{
    "id": "13uu76w",
    "title": "Free Speech, Meet Confidentiality: The Blocking of VLC and the Dowry Calculator",
    "url": "https://www.reddit.com/r/india/comments/13uu76w/free_speech_meet_confidentiality_the_blocking_of/",
    "selftext": "&#x200B;\n\n[ ](https://preview.redd.it/l3bhxl84pr2b1.png?width=1600&format=png&auto=webp&v=enabled&s=218d719f35e1c7bf9faa346676d018b41c001274)\n\n*The Internet Freedom Foundation is hosting a fundraiser on* r/India *to raise 2 lakhs in 2 weeks. We’re going to be sharing instances where we’ve created impact, hosting AMAs (exciting announcements to follow!), and giving away goodies for every donation over INR 5000!*\n\n[*https://internetfreedom.in/r-india-for-iff/*](https://internetfreedom.in/r-india-for-iff/)\n\n*Today, we’re talking about website blocking. Who blocks websites? How? Why? (Spoiler alert: we can never be sure) And what do we do about it?*\n\n*------------------------------------*\n\n# Crossing the Labyrinth\n\nIn India, the most common means through which websites are blocked is Section 69A of the Information Technology Act, 2000, which empowers the Union Government to issue orders to intermediaries (like Internet Service Providers) to block public access to websites. Why would a website be blocked? Section 69A allows for websites to be blocked in *the interest of sovereignty and integrity of India, defence of India, security of the State, friendly relations with foreign States or public order or for preventing incitement to the commission of any cognizable offence relating to above.*\n\nWhile it is Section 69A that gives the government the power to take such steps, the procedure for website blocking has been laid down in the Blocking Rules, 2009, and it is here that we enter the labyrinth.\n\nAccording to Rule 16 of the Blocking Rules, “strict confidentiality” must be maintained on all requests for blocking received and any actions arising from them. This means that the creator/originator of a website is not told *if* their website has been blocked, *why* their website has been blocked and, by extension, are unable to effectively challenge the blocking. While the Blocking Rules also stipulate that creators/originators must be granted a pre-decisional hearing, this practice is often not followed, which violates the law and the guidelines laid down by the Supreme Court in *Shreya Singhal v. Union of India.* If website blocking was a beast, it would be the Minotaur—Theseus didn’t just have to fight the Minotaur, he had to first *find* it in the Labyrinth.\n\n# A Tale of Two Websites\n\nIt was the worst of times and the worst of times— and you couldn’t even make jokes about it. In September 2018, Tanul Thakur’s satirical website, dowrycalculator.com was [blocked](https://internetfreedom.in/delhi-hc-issues-notice-to-the-government-for-blocking-satirical-dowry-calculator-website/) by the Ministry of Electronics and Information Technology after [online outrage](https://internetfreedom.in/blocking-of-satirical-dowry-calculator-website-prompts-us-to-take-action-whattheblock-savetheinternet/) that characterised the website as promoting dowry, rather than satirising it. The website was blocked without any notice or granting a pre-decisional hearing to Tanul, a clear violation of the Blocking Rules and the guidelines laid down by the Supreme Court in *Shreya Singhal v. Union of India*.\n\nIFF provided legal assistance to Tanul in challenging this unlawful banning of his website. As a result of these efforts, the Delhi High Court [directed](https://internetfreedom.in/delhi-hc-directs-meity-to-provide-a-copy-of-the-blocking-order-and-a-post-decisional-hearing-to-mr-tanul-thakur-whattheblock/) MeitY to provide a copy of the blocking order to Tanul, **marking the first time that the courts have directed MeitY to provide the blocking order to the originator of a website**. The Court also directed MeitY to grant a post-decisional hearing. Subsequent to the post-decisional hearing, Tanul was informed that MeitY decided to [continue its ban on his website](https://internetfreedom.in/dhc-issues-notice-in-website-blocking-case/). The Delhi High Court requested that Tanul should file a fresh writ petition including a challenge to MeitY’s 2022 decision to continue blocking of the website.\n\nAnother instance of unlawful blocking was the[ ban of the VideoLAN (the makers of VLC Media Player) website](https://internetfreedom.in/videolan-issued-legal-notice-to-dot-and-meity-for-banning-their-website-in-india/), which seems to have been blocked in India since March 2021. Again, this ban took place without any notice or pre-decisional hearing. Our community brought this to [our notice](https://www.instagram.com/p/Ck8THJySGpH/?igshid=MmJiY2I4NDBkZg==) and we acted. IFF provided legal assistance to VideoLAN in navigating the blocking process in India. VideoLAN issued a legal notice to MeitY and the Department of Telecommunications demanding a copy of the blocking order and an opportunity to defend its case through a virtual hearing.\n\nThe lack of procedural safeguards and their poor implementation is precisely what makes challenging website blockings so difficult. Both dowrycalculator.com and the VideoLAN website were blocked without providing notice or the opportunity of a pre-decisional hearing. This violation of due process was highlighted in VideoLAN’s legal notice to the Department of Telecommunication and the Ministry of Electronics and Information Technology and Tanul Thakur’s writ petition before the Delhi High Court.\n\nMeitY ultimately decided to [lift the ban](https://twitter.com/internetfreedom/status/1592095634013949962?s=20) on the VideoLAN website. The Delhi High Court has ordered MeitY to provide the ban order and a hearing to Tanul and issued notice in the fresh writ petition challenging the continued ban on dowrycalculator.com. IFF will continue to provide legal assistance to Tanul Thakur in this matter.\n\nWins like this are made possible only by the support of our donors, whose generous contributions ensure that our work is able to keep going. We still have a long way to go. When confronted with the labyrinth of bureaucratic opaqueness and unlawful restrictions on free speech, we do not face it alone, but with knowledge that there is a community of people navigating the labyrinth with us.\n\nIFF is trying to raise 2 lakhs in 2 weeks from May 23, 2023 to June 6, 2023. Five days in, we’ve raised INR 13,900. If you believe the work we do has value, donate today.\n\n[https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/)\n\nhttps://preview.redd.it/p4w14onzpr2b1.png?width=1600&format=png&auto=webp&v=enabled&s=1a73fb93430096b2b2c75f6c740b2edd9116dc0f",
    "flair": "Policy/Economy",
    "score": 120,
    "num_comments": 5,
    "created_utc": 1685365071.0,
    "convurl": "https://a.thumbs.redditmedia.com/8JsZO0aLIg08vGSsQNf8pbl6Fuk-tbQuYL7NwCMMOg0.jpg",
    "comments": [
        "I noticed that the most recent hearing of Mr Thakur's case was on May 16th and the blog post hasn't been updated with any developments from that hearing. Where can I follow this story?"
    ],
    "cleaned_text": "free speech meet confidentiality blocking vlc dowry calculator xb httpspreviewredditlbhxlprbpngwidthformatpngautowebpvenabledsdfecbffaadbc internet freedom foundation hosting fundraiser rindia raise lakhs weeks going sharing instances weve created impact hosting amas exciting announcements follow giving away goodies every donation inr httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff today talking website blocking blocks websites spoiler alert never sure crossing labyrinth india common means websites blocked section information technology act empowers union government issue orders intermediaries like internet service providers block public access websites would website blocked section allows websites blocked interest sovereignty integrity india defence india security state friendly relations foreign states public order preventing incitement commission cognizable offence relating section gives government power take steps procedure website blocking laid blocking rules enter labyrinth according rule blocking rules strict confidentiality must maintained requests blocking received actions arising means creatororiginator website told website blocked website blocked extension unable effectively challenge blocking blocking rules also stipulate creatorsoriginators must granted predecisional hearing practice often followed violates law guidelines laid supreme court shreya singhal v union india website blocking beast would minotaurtheseus didnt fight minotaur first find labyrinth tale two websites worst times worst times couldnt even make jokes september tanul thakurs satirical website dowrycalculatorcom blockedhttpsinternetfreedomindelhihcissuesnoticetothegovernmentforblockingsatiricaldowrycalculatorwebsite ministry electronics information technology online outragehttpsinternetfreedominblockingofsatiricaldowrycalculatorwebsitepromptsustotakeactionwhattheblocksavetheinternet characterised website promoting dowry rather satirising website blocked without notice granting predecisional hearing tanul clear violation blocking rules guidelines laid supreme court shreya singhal v union india iff provided legal assistance tanul challenging unlawful banning website result efforts delhi high court directedhttpsinternetfreedomindelhihcdirectsmeitytoprovideacopyoftheblockingorderandapostdecisionalhearingtomrtanulthakurwhattheblock meity provide copy blocking order tanul marking first time courts directed meity provide blocking order originator website court also directed meity grant postdecisional hearing subsequent postdecisional hearing tanul informed meity decided continue ban websitehttpsinternetfreedomindhcissuesnoticeinwebsiteblockingcase delhi high court requested tanul file fresh writ petition including challenge meitys decision continue blocking website another instance unlawful blocking ban videolan makers vlc media player websitehttpsinternetfreedominvideolanissuedlegalnoticetodotandmeityforbanningtheirwebsiteinindia seems blocked india since march ban took place without notice predecisional hearing community brought noticehttpswwwinstagramcompckthjysgphigshidmmjiyindbkzg acted iff provided legal assistance videolan navigating blocking process india videolan issued legal notice meity department telecommunications demanding copy blocking order opportunity defend case virtual hearing lack procedural safeguards poor implementation precisely makes challenging website blockings difficult dowrycalculatorcom videolan website blocked without providing notice opportunity predecisional hearing violation due process highlighted videolans legal notice department telecommunication ministry electronics information technology tanul thakurs writ petition delhi high court meity ultimately decided lift banhttpstwittercominternetfreedomstatuss videolan website delhi high court ordered meity provide ban order hearing tanul issued notice fresh writ petition challenging continued ban dowrycalculatorcom iff continue provide legal assistance tanul thakur matter wins like made possible support donors whose generous contributions ensure work able keep going still long way go confronted labyrinth bureaucratic opaqueness unlawful restrictions free speech face alone knowledge community people navigating labyrinth us iff trying raise lakhs weeks may june five days weve raised inr believe work value donate today httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff ",
    "cleaned_title": "free speech meet confidentiality blocking vlc dowry calculator",
    "cleaned_selftext": "xb httpspreviewredditlbhxlprbpngwidthformatpngautowebpvenabledsdfecbffaadbc internet freedom foundation hosting fundraiser rindia raise lakhs weeks going sharing instances weve created impact hosting amas exciting announcements follow giving away goodies every donation inr httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff today talking website blocking blocks websites spoiler alert never sure crossing labyrinth india common means websites blocked section information technology act empowers union government issue orders intermediaries like internet service providers block public access websites would website blocked section allows websites blocked interest sovereignty integrity india defence india security state friendly relations foreign states public order preventing incitement commission cognizable offence relating section gives government power take steps procedure website blocking laid blocking rules enter labyrinth according rule blocking rules strict confidentiality must maintained requests blocking received actions arising means creatororiginator website told website blocked website blocked extension unable effectively challenge blocking blocking rules also stipulate creatorsoriginators must granted predecisional hearing practice often followed violates law guidelines laid supreme court shreya singhal v union india website blocking beast would minotaurtheseus didnt fight minotaur first find labyrinth tale two websites worst times worst times couldnt even make jokes september tanul thakurs satirical website dowrycalculatorcom blockedhttpsinternetfreedomindelhihcissuesnoticetothegovernmentforblockingsatiricaldowrycalculatorwebsite ministry electronics information technology online outragehttpsinternetfreedominblockingofsatiricaldowrycalculatorwebsitepromptsustotakeactionwhattheblocksavetheinternet characterised website promoting dowry rather satirising website blocked without notice granting predecisional hearing tanul clear violation blocking rules guidelines laid supreme court shreya singhal v union india iff provided legal assistance tanul challenging unlawful banning website result efforts delhi high court directedhttpsinternetfreedomindelhihcdirectsmeitytoprovideacopyoftheblockingorderandapostdecisionalhearingtomrtanulthakurwhattheblock meity provide copy blocking order tanul marking first time courts directed meity provide blocking order originator website court also directed meity grant postdecisional hearing subsequent postdecisional hearing tanul informed meity decided continue ban websitehttpsinternetfreedomindhcissuesnoticeinwebsiteblockingcase delhi high court requested tanul file fresh writ petition including challenge meitys decision continue blocking website another instance unlawful blocking ban videolan makers vlc media player websitehttpsinternetfreedominvideolanissuedlegalnoticetodotandmeityforbanningtheirwebsiteinindia seems blocked india since march ban took place without notice predecisional hearing community brought noticehttpswwwinstagramcompckthjysgphigshidmmjiyindbkzg acted iff provided legal assistance videolan navigating blocking process india videolan issued legal notice meity department telecommunications demanding copy blocking order opportunity defend case virtual hearing lack procedural safeguards poor implementation precisely makes challenging website blockings difficult dowrycalculatorcom videolan website blocked without providing notice opportunity predecisional hearing violation due process highlighted videolans legal notice department telecommunication ministry electronics information technology tanul thakurs writ petition delhi high court meity ultimately decided lift banhttpstwittercominternetfreedomstatuss videolan website delhi high court ordered meity provide ban order hearing tanul issued notice fresh writ petition challenging continued ban dowrycalculatorcom iff continue provide legal assistance tanul thakur matter wins like made possible support donors whose generous contributions ensure work able keep going still long way go confronted labyrinth bureaucratic opaqueness unlawful restrictions free speech face alone knowledge community people navigating labyrinth us iff trying raise lakhs weeks may june five days weve raised inr believe work value donate today httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff",
    "cleaned_comments": "noticed recent hearing mr thakurs case may th blog post hasnt updated developments hearing follow story",
    "light_cleaned_title": "Free Speech, Meet Confidentiality: The Blocking of VLC and the Dowry Calculator",
    "light_cleaned_selftext": "&#x200B; [ ](https://preview.redd.it/l3bhxl84pr2b1.png?width=1600&format=png&auto=webp&v=enabled&s=218d719f35e1c7bf9faa346676d018b41c001274) *The Internet Freedom Foundation is hosting a fundraiser on* r/India *to raise 2 lakhs in 2 weeks. We’re going to be sharing instances where we’ve created impact, hosting AMAs (exciting announcements to follow!), and giving away goodies for every donation over INR 5000!* [*https://internetfreedom.in/r-india-for-iff/*](https://internetfreedom.in/r-india-for-iff/) *Today, we’re talking about website blocking. Who blocks websites? How? Why? (Spoiler alert: we can never be sure) And what do we do about it?* *------------------------------------* # Crossing the Labyrinth In India, the most common means through which websites are blocked is Section 69A of the Information Technology Act, 2000, which empowers the Union Government to issue orders to intermediaries (like Internet Service Providers) to block public access to websites. Why would a website be blocked? Section 69A allows for websites to be blocked in *the interest of sovereignty and integrity of India, defence of India, security of the State, friendly relations with foreign States or public order or for preventing incitement to the commission of any cognizable offence relating to above.* While it is Section 69A that gives the government the power to take such steps, the procedure for website blocking has been laid down in the Blocking Rules, 2009, and it is here that we enter the labyrinth. According to Rule 16 of the Blocking Rules, “strict confidentiality” must be maintained on all requests for blocking received and any actions arising from them. This means that the creator/originator of a website is not told *if* their website has been blocked, *why* their website has been blocked and, by extension, are unable to effectively challenge the blocking. While the Blocking Rules also stipulate that creators/originators must be granted a pre-decisional hearing, this practice is often not followed, which violates the law and the guidelines laid down by the Supreme Court in *Shreya Singhal v. Union of India.* If website blocking was a beast, it would be the Minotaur—Theseus didn’t just have to fight the Minotaur, he had to first *find* it in the Labyrinth. # A Tale of Two Websites It was the worst of times and the worst of times— and you couldn’t even make jokes about it. In September 2018, Tanul Thakur’s satirical website, dowrycalculator.com was [blocked](https://internetfreedom.in/delhi-hc-issues-notice-to-the-government-for-blocking-satirical-dowry-calculator-website/) by the Ministry of Electronics and Information Technology after [online outrage](https://internetfreedom.in/blocking-of-satirical-dowry-calculator-website-prompts-us-to-take-action-whattheblock-savetheinternet/) that characterised the website as promoting dowry, rather than satirising it. The website was blocked without any notice or granting a pre-decisional hearing to Tanul, a clear violation of the Blocking Rules and the guidelines laid down by the Supreme Court in *Shreya Singhal v. Union of India*. IFF provided legal assistance to Tanul in challenging this unlawful banning of his website. As a result of these efforts, the Delhi High Court [directed](https://internetfreedom.in/delhi-hc-directs-meity-to-provide-a-copy-of-the-blocking-order-and-a-post-decisional-hearing-to-mr-tanul-thakur-whattheblock/) MeitY to provide a copy of the blocking order to Tanul, **marking the first time that the courts have directed MeitY to provide the blocking order to the originator of a website**. The Court also directed MeitY to grant a post-decisional hearing. Subsequent to the post-decisional hearing, Tanul was informed that MeitY decided to [continue its ban on his website](https://internetfreedom.in/dhc-issues-notice-in-website-blocking-case/). The Delhi High Court requested that Tanul should file a fresh writ petition including a challenge to MeitY’s 2022 decision to continue blocking of the website. Another instance of unlawful blocking was the[ ban of the VideoLAN (the makers of VLC Media Player) website](https://internetfreedom.in/videolan-issued-legal-notice-to-dot-and-meity-for-banning-their-website-in-india/), which seems to have been blocked in India since March 2021. Again, this ban took place without any notice or pre-decisional hearing. Our community brought this to [our notice](https://www.instagram.com/p/Ck8THJySGpH/?igshid=MmJiY2I4NDBkZg==) and we acted. IFF provided legal assistance to VideoLAN in navigating the blocking process in India. VideoLAN issued a legal notice to MeitY and the Department of Telecommunications demanding a copy of the blocking order and an opportunity to defend its case through a virtual hearing. The lack of procedural safeguards and their poor implementation is precisely what makes challenging website blockings so difficult. Both dowrycalculator.com and the VideoLAN website were blocked without providing notice or the opportunity of a pre-decisional hearing. This violation of due process was highlighted in VideoLAN’s legal notice to the Department of Telecommunication and the Ministry of Electronics and Information Technology and Tanul Thakur’s writ petition before the Delhi High Court. MeitY ultimately decided to [lift the ban](https://twitter.com/internetfreedom/status/1592095634013949962?s=20) on the VideoLAN website. The Delhi High Court has ordered MeitY to provide the ban order and a hearing to Tanul and issued notice in the fresh writ petition challenging the continued ban on dowrycalculator.com. IFF will continue to provide legal assistance to Tanul Thakur in this matter. Wins like this are made possible only by the support of our donors, whose generous contributions ensure that our work is able to keep going. We still have a long way to go. When confronted with the labyrinth of bureaucratic opaqueness and unlawful restrictions on free speech, we do not face it alone, but with knowledge that there is a community of people navigating the labyrinth with us. IFF is trying to raise 2 lakhs in 2 weeks from May 23, 2023 to June 6, 2023. Five days in, we’ve raised INR 13,900. If you believe the work we do has value, donate today. [https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/)",
    "light_cleaned_comments": "I noticed that the most recent hearing of Mr Thakur's case was on May 16th and the blog post hasn't been updated with any developments from that hearing. Where can I follow this story?"
}