{
    "id": "185q9wl",
    "title": "Feels like Zomato scamming me",
    "url": "https://www.reddit.com/gallery/185q9wl",
    "selftext": "My dad started this restaurant in 2010 i am trying to keep this business running but it looks like I can't anymore. I have a decent job and I can't pay from my pocket for some mistakes these Zomato guys did and there no way to talk to someone who can explain me clear why i have to pay them 22k they only take complents using there app. I have to pay 30k to groceries and I dont think I can keep paying from my pocket.\n\nI am thinking of switching to swiggy completely let's see what happens.",
    "flair": "Rant / Vent",
    "score": 13,
    "num_comments": 4,
    "created_utc": 1701155892.0,
    "convurl": "https://i.redd.it/9qforv9uh13c1.jpg",
    "comments": [
        "If you aren't getting helpful response over any channel and getting stalled even after many attempts, publicize over Twitter tagging the CEO . Try tagging others from management team.\n\nOr worse, tag the board too.\nhttps://www.zomato.com/investor-relations/governance",
        "Just saw your snapshot on tax, how will 1% tax end up in that much? You'll better off fully understanding (try talking to other Zomato platform users?) instead of simply moving to Swiggy (you might end up with a similar challenge there too). \n\nhttps://taxguru.in/income-tax/section-194o-tds-e-commerce-operator-analysis.html\n\nAs a business, in basic terms, you pay your taxes only on your Earnings after Operating Expenses, Depreciation, Amortisation etc.",
        "Last week when they deducted it my dad called the Zomato manager he said 8k is deducted my father asked to return the rest of the amount but the ended the call when I called later he said it's 10k like sir u r saying something and the support is saying something which I am not getting it. I asked multiple times to connect me to someone who knows what's happening and explain it to me but there is no response at the end I had to upload it here.\n\nI will take this matter to Twitter"
    ],
    "cleaned_text": "feels like zomato scamming dad started restaurant trying keep business running looks like cant anymore decent job cant pay pocket mistakes zomato guys way talk someone explain clear pay k take complents using app pay k groceries dont think keep paying pocket thinking switching swiggy completely lets see happens ",
    "cleaned_title": "feels like zomato scamming",
    "cleaned_selftext": "dad started restaurant trying keep business running looks like cant anymore decent job cant pay pocket mistakes zomato guys way talk someone explain clear pay k take complents using app pay k groceries dont think keep paying pocket thinking switching swiggy completely lets see happens",
    "cleaned_comments": "arent getting helpful response channel getting stalled even many attempts publicize twitter tagging ceo try tagging others management team worse tag board saw snapshot tax tax end much youll better fully understanding try talking zomato platform users instead simply moving swiggy might end similar challenge business basic terms pay taxes earnings operating expenses depreciation amortisation etc last week deducted dad called zomato manager said k deducted father asked return rest amount ended call called later said k like sir u r saying something support saying something getting asked multiple times connect someone knows whats happening explain response end upload take matter twitter",
    "light_cleaned_title": "Feels like Zomato scamming me",
    "light_cleaned_selftext": "My dad started this restaurant in 2010 i am trying to keep this business running but it looks like I can't anymore. I have a decent job and I can't pay from my pocket for some mistakes these Zomato guys did and there no way to talk to someone who can explain me clear why i have to pay them 22k they only take complents using there app. I have to pay 30k to groceries and I dont think I can keep paying from my pocket. I am thinking of switching to swiggy completely let's see what happens.",
    "light_cleaned_comments": "If you aren't getting helpful response over any channel and getting stalled even after many attempts, publicize over Twitter tagging the CEO . Try tagging others from management team. Or worse, tag the board too. Just saw your snapshot on tax, how will 1% tax end up in that much? You'll better off fully understanding (try talking to other Zomato platform users?) instead of simply moving to Swiggy (you might end up with a similar challenge there too). As a business, in basic terms, you pay your taxes only on your Earnings after Operating Expenses, Depreciation, Amortisation etc. Last week when they deducted it my dad called the Zomato manager he said 8k is deducted my father asked to return the rest of the amount but the ended the call when I called later he said it's 10k like sir u r saying something and the support is saying something which I am not getting it. I asked multiple times to connect me to someone who knows what's happening and explain it to me but there is no response at the end I had to upload it here. I will take this matter to Twitter"
}