{
    "id": "1grxxia",
    "title": "Happened in Mumbai. What’s wrong with people?",
    "url": "https://i.redd.it/x5ydqjzjv21e1.jpeg",
    "selftext": "She was wearing a sweater that fully covered her chest on her way to work. Random bozos throwing cigarettes at women now in Malad, Mumbai.",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 3,
    "created_utc": 1731681965.0,
    "convurl": "https://i.redd.it/x5ydqjzjv21e1.jpeg",
    "comments": [
        "Women’s choice of clothing has got nothing to do with why men act like such disgusting creeps. It’s just about feeling more power over another person.\n\nWomen wearing most conservative clothings are just as equally attacked. So OP the fact you needed to mention her clothing is part of the problem blaming the victim.\n\nI wonder if she catched the number or if there are CCTV’s in the area. She should file a compliant. Assholes like these feel empowered to take these up physical harassment and eventually assaults if they are let go.",
        "> the fact needed to mention her clothing\n\nThis happened to my girlfriend and she explicitly said to mention this part because she has been harassed for wearing liberal clothes in public during summer. It’s to highlight that she wasn’t even trying to be noticeable in public for men to target her.",
        "Okay."
    ],
    "cleaned_text": "happened mumbai whats wrong people wearing sweater fully covered chest way work random bozos throwing cigarettes women malad mumbai ",
    "cleaned_title": "happened mumbai whats wrong people",
    "cleaned_selftext": "wearing sweater fully covered chest way work random bozos throwing cigarettes women malad mumbai",
    "cleaned_comments": "womens choice clothing got nothing men act like disgusting creeps feeling power another person women wearing conservative clothings equally attacked op fact needed mention clothing part problem blaming victim wonder catched number cctvs area file compliant assholes like feel empowered take physical harassment eventually assaults let go fact needed mention clothing happened girlfriend explicitly said mention part harassed wearing liberal clothes public summer highlight wasnt even trying noticeable public men target okay",
    "light_cleaned_title": "Happened in Mumbai. What’s wrong with people?",
    "light_cleaned_selftext": "She was wearing a sweater that fully covered her chest on her way to work. Random bozos throwing cigarettes at women now in Malad, Mumbai.",
    "light_cleaned_comments": "Women’s choice of clothing has got nothing to do with why men act like such disgusting creeps. It’s just about feeling more power over another person. Women wearing most conservative clothings are just as equally attacked. So OP the fact you needed to mention her clothing is part of the problem blaming the victim. I wonder if she catched the number or if there are CCTV’s in the area. She should file a compliant. Assholes like these feel empowered to take these up physical harassment and eventually assaults if they are let go. > the fact needed to mention her clothing This happened to my girlfriend and she explicitly said to mention this part because she has been harassed for wearing liberal clothes in public during summer. It’s to highlight that she wasn’t even trying to be noticeable in public for men to target her. Okay."
}