{
    "id": "1h8x2mi",
    "title": "In appeal to CJI Khanna, SC lawyers' body seeks reversal of 2 decisions taken by predecessor Chandrachud",
    "url": "https://theprint.in/judiciary/in-appeal-to-cji-khanna-sc-lawyers-body-seeks-reversal-of-2-decisions-taken-by-predecessor-chandrachud/2389130/",
    "selftext": "These include a glass partition installed in the front corridor of the Supreme Court building—outside courtrooms 1 to 5—and an old library block for judges turned into a museum, which, the association says, is a security risk.\n\nThe second letter, sent to CJI Khanna Thursday, is about the decades-old practice of circulating adjournment letters, which former CJI Chandrachud stopped.",
    "flair": "Law & Courts",
    "score": 39,
    "num_comments": 1,
    "created_utc": 1733591519.0,
    "convurl": "https://external-preview.redd.it/iCLksvHLbP0kQoie8R12t1bCL_psfFm7qxp4kcxlHXk.jpg?auto=webp&s=fe62079d6dea77294973077e4309f22001a16466",
    "comments": [
        "There's a lot that DYC imposed with impunity that needs reversal. Absolutely loathsome."
    ],
    "cleaned_text": "appeal cji khanna sc lawyers body seeks reversal decisions taken predecessor chandrachud include glass partition installed front corridor supreme court buildingoutside courtrooms old library block judges turned museum association says security risk second letter sent cji khanna thursday decadesold practice circulating adjournment letters former cji chandrachud stopped ",
    "cleaned_title": "appeal cji khanna sc lawyers body seeks reversal decisions taken predecessor chandrachud",
    "cleaned_selftext": "include glass partition installed front corridor supreme court buildingoutside courtrooms old library block judges turned museum association says security risk second letter sent cji khanna thursday decadesold practice circulating adjournment letters former cji chandrachud stopped",
    "cleaned_comments": "theres lot dyc imposed impunity needs reversal absolutely loathsome",
    "light_cleaned_title": "In appeal to CJI Khanna, SC lawyers' body seeks reversal of 2 decisions taken by predecessor Chandrachud",
    "light_cleaned_selftext": "These include a glass partition installed in the front corridor of the Supreme Court building—outside courtrooms 1 to 5—and an old library block for judges turned into a museum, which, the association says, is a security risk. The second letter, sent to CJI Khanna Thursday, is about the decades-old practice of circulating adjournment letters, which former CJI Chandrachud stopped.",
    "light_cleaned_comments": "There's a lot that DYC imposed with impunity that needs reversal. Absolutely loathsome."
}