{
    "id": "155gel2",
    "title": "Why Manipur can be WORSE than Gujarat",
    "url": "https://www.reddit.com/r/india/comments/155gel2/why_manipur_can_be_worse_than_gujarat/",
    "selftext": "As we all know, the ethnic conflict between Meitei and Kuki-Chin-Mizos have been raging for months now, with horrendous consequences. But, as far as I've seen, the Indian perspective is very much limited to the scope of Manipur.\n\nMost Indians don't know that the same Kuki-Chin-Mizos are a major player in the joint armed resistance or People's Defence Force against the Military Junta in Myanmar. Though sources are scarce, first hand accounts claim that the PDF militants now control around 30-40% of Myanmar's territory now.\n\nIf this conflict does NOT end soon, the Manipur Conflict can easily have an international dynamic. The last thing India need is an influx of well trained, armed and battle-hardened veterans of the Myanmar Civil War finding their way into Manipur.\n\nThere is also a high chance that the Naga insurgents and NSCN will get involved now after a Naga woman was killed and disfigured by Meitei militants - (https://thewire.in/security/two-killed-in-separate-incidents-as-violence-continues-in-manipur).\n\nNot to mention, the brethren of the Kukis in Mizoram are getting more and more involved politically and by supplying weaponry - (http://www.indiatodayne.in/mizoram/story/mizoram-assam-rifles-recovers-huge-cache-of-arms-allegedly-heading-to-zomi-revolutionary-army-in-manipur-613574-2023-07-12).\n\nIf the Government, be it State or Central, does not stop its politics and partiality in this conflict. Such as state law enforcement handing over helpless women to Meitei mobs and protecting the violent mobs, the Tribals of Manipur will not have any other resort but to turn outside and elsewhere. It will be a much bloodier ordeal than Gujarat.\n\nThe Central Government MUST do everything and anything it can to stop this conflict NOW!",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689923469.0,
    "convurl": "https://external-preview.redd.it/jVtP0zBUj7WSXaFaNQiuugrA3Y-DJKQuqBH82smfccI.jpg?auto=webp&s=a234bd506a73df94cc1fe4e9ea66fcc93377eeea",
    "comments": [
        "They seem to have tried to instil their Hindutva ideology there without understanding the fragile ground reality and things have blown up in their faces...the damage is already done. They can't accept or fix it because fixing it is time-consuming and gives them little to no advantage in the larger political context.  One of the reasons why the issue remains unresolved even today. They also have intelligence level agreements with these entities which makes it even worse...proper kitchdi of a disater. There is a possibility that we may lose territorial integrity and this spills out into other states....this plays well into the hands of China....its too late now",
        "Things are already out of control.\n\n* India supports PDF (and therefore Kuki militants) as they serve as a buffer against the Junta who are supported by China. Kukis are being supplied arms from PDF and Mizoram. Meiteis are supplied arms by NSCN. The Indian Army support Kukis. There are only Meitei militants who are still at war with the Indian Army and seeking independence from India. Hence, Meitei militants are a problem. Kuki and Naga militants are already in talks with the Indian Government. Also, Meitei militants are hand in hand with Military junta. Meitei meira paibis support meitei militants as in the ongoing conflict, they don't find any support from the Indian army, though support is received from meitei police forces. After thousands of houses have been burnt down on both sides (both Kukis and Meiteis), they are currently is \n\n* The Indian Government is trying to work out a solution - some form of autonomy for Kukis, some form of appeasement for Meiteis. However, if Nagas are not kept happy, it will spiral out of control again. Nagas dislike Meiteis, but hate Kukis more. [Vale of Tears](https://www.amazon.in/Vale-Tears-stories-violence-Manipur-ebook/dp/B08GFSKC5C)\nhttps://scroll.in/article/894324/25-years-after-naga-kuki-clashes-in-manipur-reconciliation-is-still-elusive\n\n>The killings were not an isolated incident but the culmination of a bitter, five-year-long feud between the Kukis and the Nagas that ravaged the hills of Manipur in the 1990s. Hostility between the Nagas and the Kukis dates back to colonial times, but the conflict of the 1990s was primarily over land: large swathes of what the Kuki claim to be their “homeland” in the Manipur hills overlapped with Greater Nagaland or Nagalim, envisioned by the NSCN (IM) as a sovereign Naga homeland. The proposed map of Nagalim consists of Nagaland and “all contiguous Naga-inhabited areas” of Assam, Manipur, Arunachal Pradesh and, across the international border, Myanmar.\n\n* So, likely solution: some form of autonomous territorial council for Kukis and Nagas and maybe Scheduled Tribe status for Manipur. However, this will lead to further conflict between Kukis and Nagas. Nagas have been watching silently so far, but internally they have activated all their village defense forces. They have refused to take in any Kukis or Meiteis in relief camps in their areas. \n\n* Many areas where presently Kukis dominate (such as Kangpokpi District) are still claimed by Nagas. The United Naga Council had imposed a 4 month-long economic blockade against the creation of 7 districts. (https://indianexpress.com/article/india/manipur-economic-blockade-lifted-130-days-united-naga-council-unc-biren-singh-tripartite-talk-okram-ibobi-4576277/ )\n>The UNC had blocked the national highways 2 and 37 since November 1, last year to protest the then Okram Ibobi Singh-led Congress government’s decision to creation of seven new districts by the then Congress government in October, 2016. The Nagas maintain that the “lands of the Nagas” left by their forefathers cannot be taken away in this manner. The indefinite blockade has largely led to acute shortage of all essential commodities, including fuel, in the state. Hardly 300 trucks and oil tankers could lift essential commodities twice a week, which proved to be the proverbial drop in the ocean. Apart from imposing economic blockade, the UNC has also banned National projects in Naga-dominated areas and demanded revocation of the order issued by the previous state government.\n\nThe above are all based on rumours and should be dismissed immediately as ramblings of a person on rationed internet.",
        ">India supports PDF (and therefore Kuki militants) as they serve as a buffer against the Junta who are supported by China. \n\nIt's a strech to say India supports PDF, India has gifted them a subamarine for training purposes which by all accounts we are still maintaining and is an active player in getting peace talks going in the region. \n\nThe sittwe port opened just a few months ago, which was constructed and financed entirely by India. \n\nThe most that can be said is we aren't targetting PDF actively."
    ],
    "cleaned_text": "manipur worse gujarat know ethnic conflict meitei kukichinmizos raging months horrendous consequences far ive seen indian perspective much limited scope manipur indians dont know kukichinmizos major player joint armed resistance peoples defence force military junta myanmar though sources scarce first hand accounts claim pdf militants control around myanmars territory conflict end soon manipur conflict easily international dynamic last thing india need influx well trained armed battlehardened veterans myanmar civil war finding way manipur also high chance naga insurgents nscn get involved naga woman killed disfigured meitei militants httpsthewireinsecuritytwokilledinseparateincidentsasviolencecontinuesinmanipur mention brethren kukis mizoram getting involved politically supplying weaponry httpwwwindiatodayneinmizoramstorymizoramassamriflesrecovershugecacheofarmsallegedlyheadingtozomirevolutionaryarmyinmanipur government state central stop politics partiality conflict state law enforcement handing helpless women meitei mobs protecting violent mobs tribals manipur resort turn outside elsewhere much bloodier ordeal gujarat central government must everything anything stop conflict ",
    "cleaned_title": "manipur worse gujarat",
    "cleaned_selftext": "know ethnic conflict meitei kukichinmizos raging months horrendous consequences far ive seen indian perspective much limited scope manipur indians dont know kukichinmizos major player joint armed resistance peoples defence force military junta myanmar though sources scarce first hand accounts claim pdf militants control around myanmars territory conflict end soon manipur conflict easily international dynamic last thing india need influx well trained armed battlehardened veterans myanmar civil war finding way manipur also high chance naga insurgents nscn get involved naga woman killed disfigured meitei militants httpsthewireinsecuritytwokilledinseparateincidentsasviolencecontinuesinmanipur mention brethren kukis mizoram getting involved politically supplying weaponry httpwwwindiatodayneinmizoramstorymizoramassamriflesrecovershugecacheofarmsallegedlyheadingtozomirevolutionaryarmyinmanipur government state central stop politics partiality conflict state law enforcement handing helpless women meitei mobs protecting violent mobs tribals manipur resort turn outside elsewhere much bloodier ordeal gujarat central government must everything anything stop conflict",
    "cleaned_comments": "seem tried instil hindutva ideology without understanding fragile ground reality things blown facesthe damage already done cant accept fix fixing timeconsuming gives little advantage larger political context one reasons issue remains unresolved even today also intelligence level agreements entities makes even worseproper kitchdi disater possibility may lose territorial integrity spills statesthis plays well hands chinaits late things already control india supports pdf therefore kuki militants serve buffer junta supported china kukis supplied arms pdf mizoram meiteis supplied arms nscn indian army support kukis meitei militants still war indian army seeking independence india hence meitei militants problem kuki naga militants already talks indian government also meitei militants hand hand military junta meitei meira paibis support meitei militants ongoing conflict dont find support indian army though support received meitei police forces thousands houses burnt sides kukis meiteis currently indian government trying work solution form autonomy kukis form appeasement meiteis however nagas kept happy spiral control nagas dislike meiteis hate kukis vale tearshttpswwwamazoninvaletearsstoriesviolencemanipurebookdpbgfskcc killings isolated incident culmination bitter fiveyearlong feud kukis nagas ravaged hills manipur hostility nagas kukis dates back colonial times conflict primarily land large swathes kuki claim homeland manipur hills overlapped greater nagaland nagalim envisioned nscn im sovereign naga homeland proposed map nagalim consists nagaland contiguous nagainhabited areas assam manipur arunachal pradesh across international border myanmar likely solution form autonomous territorial council kukis nagas maybe scheduled tribe status manipur however lead conflict kukis nagas nagas watching silently far internally activated village defense forces refused take kukis meiteis relief camps areas many areas presently kukis dominate kangpokpi district still claimed nagas united naga council imposed monthlong economic blockade creation districts httpsindianexpresscomarticleindiamanipureconomicblockadelifteddaysunitednagacounciluncbirensinghtripartitetalkokramibobi unc blocked national highways since november last year protest okram ibobi singhled congress governments decision creation seven new districts congress government october nagas maintain lands nagas left forefathers taken away manner indefinite blockade largely led acute shortage essential commodities including fuel state hardly trucks oil tankers could lift essential commodities twice week proved proverbial drop ocean apart imposing economic blockade unc also banned national projects nagadominated areas demanded revocation order issued previous state government based rumours dismissed immediately ramblings person rationed internet india supports pdf therefore kuki militants serve buffer junta supported china strech say india supports pdf india gifted subamarine training purposes accounts still maintaining active player getting peace talks going region sittwe port opened months ago constructed financed entirely india said arent targetting pdf actively",
    "light_cleaned_title": "Why Manipur can be WORSE than Gujarat",
    "light_cleaned_selftext": "As we all know, the ethnic conflict between Meitei and Kuki-Chin-Mizos have been raging for months now, with horrendous consequences. But, as far as I've seen, the Indian perspective is very much limited to the scope of Manipur. Most Indians don't know that the same Kuki-Chin-Mizos are a major player in the joint armed resistance or People's Defence Force against the Military Junta in Myanmar. Though sources are scarce, first hand accounts claim that the PDF militants now control around 30-40% of Myanmar's territory now. If this conflict does NOT end soon, the Manipur Conflict can easily have an international dynamic. The last thing India need is an influx of well trained, armed and battle-hardened veterans of the Myanmar Civil War finding their way into Manipur. There is also a high chance that the Naga insurgents and NSCN will get involved now after a Naga woman was killed and disfigured by Meitei militants - (https://thewire.in/security/two-killed-in-separate-incidents-as-violence-continues-in-manipur). Not to mention, the brethren of the Kukis in Mizoram are getting more and more involved politically and by supplying weaponry - (http://www.indiatodayne.in/mizoram/story/mizoram-assam-rifles-recovers-huge-cache-of-arms-allegedly-heading-to-zomi-revolutionary-army-in-manipur-613574-2023-07-12). If the Government, be it State or Central, does not stop its politics and partiality in this conflict. Such as state law enforcement handing over helpless women to Meitei mobs and protecting the violent mobs, the Tribals of Manipur will not have any other resort but to turn outside and elsewhere. It will be a much bloodier ordeal than Gujarat. The Central Government MUST do everything and anything it can to stop this conflict NOW!",
    "light_cleaned_comments": "They seem to have tried to instil their Hindutva ideology there without understanding the fragile ground reality and things have blown up in their faces...the damage is already done. They can't accept or fix it because fixing it is time-consuming and gives them little to no advantage in the larger political context. One of the reasons why the issue remains unresolved even today. They also have intelligence level agreements with these entities which makes it even worse...proper kitchdi of a disater. There is a possibility that we may lose territorial integrity and this spills out into other states....this plays well into the hands of China....its too late now Things are already out of control. * India supports PDF (and therefore Kuki militants) as they serve as a buffer against the Junta who are supported by China. Kukis are being supplied arms from PDF and Mizoram. Meiteis are supplied arms by NSCN. The Indian Army support Kukis. There are only Meitei militants who are still at war with the Indian Army and seeking independence from India. Hence, Meitei militants are a problem. Kuki and Naga militants are already in talks with the Indian Government. Also, Meitei militants are hand in hand with Military junta. Meitei meira paibis support meitei militants as in the ongoing conflict, they don't find any support from the Indian army, though support is received from meitei police forces. After thousands of houses have been burnt down on both sides (both Kukis and Meiteis), they are currently is * The Indian Government is trying to work out a solution - some form of autonomy for Kukis, some form of appeasement for Meiteis. However, if Nagas are not kept happy, it will spiral out of control again. Nagas dislike Meiteis, but hate Kukis more. [Vale of Tears](https://www.amazon.in/Vale-Tears-stories-violence-Manipur-ebook/dp/B08GFSKC5C) >The killings were not an isolated incident but the culmination of a bitter, five-year-long feud between the Kukis and the Nagas that ravaged the hills of Manipur in the 1990s. Hostility between the Nagas and the Kukis dates back to colonial times, but the conflict of the 1990s was primarily over land: large swathes of what the Kuki claim to be their “homeland” in the Manipur hills overlapped with Greater Nagaland or Nagalim, envisioned by the NSCN (IM) as a sovereign Naga homeland. The proposed map of Nagalim consists of Nagaland and “all contiguous Naga-inhabited areas” of Assam, Manipur, Arunachal Pradesh and, across the international border, Myanmar. * So, likely solution: some form of autonomous territorial council for Kukis and Nagas and maybe Scheduled Tribe status for Manipur. However, this will lead to further conflict between Kukis and Nagas. Nagas have been watching silently so far, but internally they have activated all their village defense forces. They have refused to take in any Kukis or Meiteis in relief camps in their areas. * Many areas where presently Kukis dominate (such as Kangpokpi District) are still claimed by Nagas. The United Naga Council had imposed a 4 month-long economic blockade against the creation of 7 districts. (https://indianexpress.com/article/india/manipur-economic-blockade-lifted-130-days-united-naga-council-unc-biren-singh-tripartite-talk-okram-ibobi-4576277/ ) >The UNC had blocked the national highways 2 and 37 since November 1, last year to protest the then Okram Ibobi Singh-led Congress government’s decision to creation of seven new districts by the then Congress government in October, 2016. The Nagas maintain that the “lands of the Nagas” left by their forefathers cannot be taken away in this manner. The indefinite blockade has largely led to acute shortage of all essential commodities, including fuel, in the state. Hardly 300 trucks and oil tankers could lift essential commodities twice a week, which proved to be the proverbial drop in the ocean. Apart from imposing economic blockade, the UNC has also banned National projects in Naga-dominated areas and demanded revocation of the order issued by the previous state government. The above are all based on rumours and should be dismissed immediately as ramblings of a person on rationed internet. >India supports PDF (and therefore Kuki militants) as they serve as a buffer against the Junta who are supported by China. It's a strech to say India supports PDF, India has gifted them a subamarine for training purposes which by all accounts we are still maintaining and is an active player in getting peace talks going in the region. The sittwe port opened just a few months ago, which was constructed and financed entirely by India. The most that can be said is we aren't targetting PDF actively."
}