{
    "id": "1eue2dc",
    "title": "Madras HC dismisses plea to declare 'Thirukkural’ as National book of high values and virtues of India",
    "url": "https://www.scconline.com/blog/post/2024/08/17/madras-hc-dismisses-plea-declare-thirukkural-national-book-of-high-values-virtues-of-india/",
    "selftext": "It was also prayed for erecting the statue of the Holy saint ‘Thiruvalluvar’ in the vicinity of the new Parliamentary building being constructed now alongwith a portrait of them describing his contribution of this nation and also ‘Thiruvallur’ name is declared as ‘the ethical and Spiritual Guru of India’ and his birth day to be declared as ‘the Spiritual and Ethical day of India’ and to be celebrated with a National holiday by the Union Government and all State Governments similar to Gandhi Jayanti. ",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1723888461.0,
    "convurl": "https://external-preview.redd.it/1MTMjhtgT0e3RnCYYPabC0xAvDcY9uWQwrUSLcGPvEI.jpg?auto=webp&s=87aa7c3e7240e13af0314b0cde1907b396b139f1",
    "comments": [
        "Obviously can't do that, India doesn't belives in morals and virtues.",
        "Thirukural has a lot of regressive thoughts. The idea of rebirth & karma can be the light to shine paths of people's life but Government Administration & Justice system should never accept such ideas and stick to the idea of \"encouraging scientific temparament\" mentioned in the Constitution. So the Madras HC decision is right in this regard."
    ],
    "cleaned_text": "madras hc dismisses plea declare thirukkural national book high values virtues india also prayed erecting statue holy saint thiruvalluvar vicinity new parliamentary building constructed alongwith portrait describing contribution nation also thiruvallur name declared ethical spiritual guru india birth day declared spiritual ethical day india celebrated national holiday union government state governments similar gandhi jayanti ",
    "cleaned_title": "madras hc dismisses plea declare thirukkural national book high values virtues india",
    "cleaned_selftext": "also prayed erecting statue holy saint thiruvalluvar vicinity new parliamentary building constructed alongwith portrait describing contribution nation also thiruvallur name declared ethical spiritual guru india birth day declared spiritual ethical day india celebrated national holiday union government state governments similar gandhi jayanti",
    "cleaned_comments": "obviously cant india doesnt belives morals virtues thirukural lot regressive thoughts idea rebirth karma light shine paths peoples life government administration justice system never accept ideas stick idea encouraging scientific temparament mentioned constitution madras hc decision right regard",
    "light_cleaned_title": "Madras HC dismisses plea to declare 'Thirukkural’ as National book of high values and virtues of India",
    "light_cleaned_selftext": "It was also prayed for erecting the statue of the Holy saint ‘Thiruvalluvar’ in the vicinity of the new Parliamentary building being constructed now alongwith a portrait of them describing his contribution of this nation and also ‘Thiruvallur’ name is declared as ‘the ethical and Spiritual Guru of India’ and his birth day to be declared as ‘the Spiritual and Ethical day of India’ and to be celebrated with a National holiday by the Union Government and all State Governments similar to Gandhi Jayanti.",
    "light_cleaned_comments": "Obviously can't do that, India doesn't belives in morals and virtues. Thirukural has a lot of regressive thoughts. The idea of rebirth & karma can be the light to shine paths of people's life but Government Administration & Justice system should never accept such ideas and stick to the idea of \"encouraging scientific temparament\" mentioned in the Constitution. So the Madras HC decision is right in this regard."
}