{
    "id": "171hge6",
    "title": "Instead of spending thousands of crores on bullet train, CAN WE NOT FIX OUR BASIC AMENITIES FIRST????",
    "url": "https://x.com/mumbaimatterz/status/1710242457118810338?s=46",
    "selftext": "JUST LOOK AT THE CONDITION OF THE RAILWAY STATIONS IN THE FINANCIAL CAPITAL OF THE COUNTRY! WHAT ARE WE WAITING FOR TO COME TO OUR SENSES? WHY DO CITIZENS NOT DEMAND FOR BASIC NECESSITIES ANYMORE? WHY HAS EVERYONE BECOME SHEEP?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 120,
    "created_utc": 1696611164.0,
    "convurl": "https://external-preview.redd.it/0UZ314-GsIaRyytX-C1XNDWU7KKIhRR8t0OuxtgHCeY.jpg?auto=webp&s=2efb26f16b60529773f1f415984c519c1d6dc383",
    "comments": [
        "Why not both",
        "Bullet train aside, hell, we are spending crores on useless statues, which are purely symbiotic, while crores of our citizens don't get 3 meals a day.\n\nThis is an ego & image thing for many of our politicians.\n\nVoters never question & those who do, are anti national.\n\nLet's keep on suffering is India's motto.",
        "Whatever makes Babu the money... Path to least resistance...",
        "Well, I don't want a similar situation in airports. Bullet train might help with that.\n\nStopping bullet train development isn't going to solve this problem. Having more public transport alternatives (like metro) and bigger railway stations(with more skybridges) will. Figure out why that's not happening in Mumbai.",
        "We should. But babus don't use public toilets. Bhaktas will take piss standing over a pool of piss and go gaga over their respective human political Goodman/woman.",
        "Health and education is all we need to.fix. the rest will.fall in place eventually. Dump money into world class.education for every child and just watch them build the country.",
        "But then they’ll stop voting in the name of religion and caste and hold politicians accountable :) This government definitely won’t put a dime into education. Look at Kerala, BJP gets zero seats. Even their minister accepted that they don’t get votes in Kerala because the people there are educated",
        "World class transportation infra is important too, We shouldn't ignore one aspect to improve other. We do need to fix basic amenities but stopping bullet trains is not gonna fix that. \n\nAnd remember, not having enough funds is not an issue in this case. Corruption and government's inefficiency is the problem. Large part of our funds go directly into the pockets of ministers. We need to fix that first and then use our funds efficiently.",
        "You do realise these contracts are given to government homes. Whether it's a statue or a train. It's just a means to siphon our money to goons.\n\nFuck these guys",
        "No ribbon cutting after redevelopment.",
        "I don't think this is a problem of lack of funds, it is a governance issue.",
        "So damn true. There won’t be cameras and ribbon cutting and chest thumping for regular maintenance or building an extra bridge. That guy literally just focuses on marketing marketing marketing. The non-Vande Bharat trains have become such a pain to travel in. Zero maintenance, no TC to check, everyone just boards, it’s crowded so badly. India has around 16,000 trains which are the actual backbone for public transport and have not increased in capacity in line with the requirement of the increasing population and instead everyone just focuses on those 20 odd trains launched in NINE WHOLE YEARS against a population that increased by millions each year",
        "That is happening as well. You need to fix infrastructure as well.\n\nPeople have got electricity, toilets , etc. More has to be done no doubt.",
        "Actually the conditions of Railway stations have improved drastically in recent years.",
        "If we look at the current state of railway and passengers and alternate mode of travel, we don't need Bullet Trains. A large portion of railway passengers won't be able to afford the ticket prices, the operation and maintenance would be quite a tireless, expensive and thankless job; not to mention it's near impossible to recover the cost through passenger journeys in India. Imagine putting such a high initial investment into such a high profile project only for it to turn into a disappointment. Not to forget, Airlines would still be more affordable and faster than Bullet Train.\n\nRather invest more in the current line of railways and amenities to make sure the lower strata of passengers can enjoy a comfortable and reliable journey.",
        "Have been travelling in Mumbai local trains since the last 10 years. What are you even talking about? I’ve very well seen many stations like Kurla, Dadar, Ghatkopar, Thane become worse with each passing year wherein people are increasing but there’s absolutely nothing that’s been done to ensure increase in capacity. There are days there’s literally no space to board from Dadar and Kurla at all. What are you even talking about???",
        "Well Indian railway system definitely needs more capex spends to increase infrastructure and maintenance. I don’t understand why we wouldn’t need a bullet train ? \n\nGoing by your logic Majority of Indians can’t afford to even live in Mumbai why do we have to waste money in Mumbai while thousands of road doesn’t have development.\n\nIf you claim it’s the financial capital and it contributes tremendously to our GDP. Well you would definitely have the answer for why we are building roads and highspeed trains connecting cities instead of spending it on improving infrastructure of villages. Capitalism works that way and don’t forget you are part of the privilege too to live in cities.",
        "Alright let’s have a bullet train by taking a loan from Japan and build it from Ahmedabad to Mumbai having fares similar to airfares on the same route. I’m completely fine with it. But can we also please please fix what we already have and what is transporting millions of passengers each day instead of a few hundred wealthy ones? Please?",
        "And I'm travelling from Udaipur, Rajasthan to bangalore for many years and most of the railway stations are wau cleaner.",
        ">WHY DO CITIZENS NOT DEMAND FOR BASIC NECESSITIES ANYMORE? \n\nThey do demand basic necessities. See - the \"roti kapda makaan\" necessities of slum areas in our metro cities. \n\nIf enough people vote and are politically active they will meet those demands too. How many people even know who their municipal corporator is and how to contact that person for services.",
        "I don't think you understand the basics concept why some statues are build the amount of money they contribute to the economy is 3 or 4 times to the actual cost of money. And I don't understand why everyone has problem with bullet train.",
        "Since this post is about Mumbai: I was born and brought up there and my thoughts might be outdated now because I left almost half a decade ago. \n\nI travelled in the local trains and through these crowds. The worst part was that ALL offices were located in the south and there was barely anything in the north (suburbs). This always caused overcrowding in a single direction (southbound during the day, northbound during the evening). And then they have the audacity to suppress average Mumbaikar's problems under the \"spirit of Mumbai\" nonsense.\n\nI have also had the displeasure of being groped multiple times walking through these dense crowds at Andheri station, the moment I quit the ladies coach. That spot where this happens is so common that almost every woman I know has told me a story about it.",
        "A large number will not be able to afford the ticket and a large number will be able to afford the ticket. Tier 1 AC seats are not for the poor. Govt is for everyone and you need to plan for current and the future generation that is going to come because if you don't you will always remain a generation below. If we have poor people we also have rich people who employ the poor people. \n\nYou need develop at multiple fronts, be it a dedicated freight corridor, Vande Bharat, Airports or National Highways. With better connectivity comes better growth.",
        "The only reason we received money from japan on 0.1 percent interest for next 50 years is for building bullet train. We can not use that money for any other project government is already working to improve the current railway Infrastructure like station and tracks. They are building DFC to reduce the congestion on the lines so that the speed of normal trains could increase wdfc is almost complete edfc is 100 percent complete they are already upgrading tracks to run train on 180km. But we have to build separate track from scratch to run high-speed train because even after upgrading current track they can not run trains on them on higher speeds because of all the curves and tunnel they have. Ultimate we need these bullet trains they will contribute more to our economy then the amount we invest on them fo example loom japan.",
        "give it to a PSU and it will eat half of the money.",
        "Indeed but even then how is Bullet Train answer to even 1% of that issue? Need faster affordable travel, you have air travel. Why Bullet Train though? Improve the foundation setup by Vande Bharat and focus on High Speed rail.",
        "Honestly I have given up hope, Here in Mumbai I have seen people glorify the local trains. Spirit of Mumbai, struggle of Mumbai and what not. If you are privileged, migrating is always a better option ( I will too) can't expect things to change, even if it does I will be too old to reap the benefits or pass away from breathing the polluted air for years.",
        "See the condition of local trains in cities, they should be a priority.",
        "Mumbai local order 238 AC train for local train upgrade. Gov is doing both. All the railway station are now so much cleaner. Electrification is going great, metro are being in so many cities. Dedicated fright coridor is going well. Parallel railway line are laid\n\nThere will be time when we are going to need bullet train, but if we are not going to start now than we will have to spend more money and railways system will be more congested. We started building Delhi metro in 2000s and now Delhi is ripping it's benefits. And now because of experience of Delhi metro is helping us to build more metro in other cities. Similar situation will happen with bullet train. \n\nYou can't just criticise it now for 10 year continually and suddenly 10 years later you demand for bullet train when it's not there. \n\nCurrently India is the only other country beside China that is building big infrastructure.",
        "I am not saying we should ignore them government must upgrade them. I am just saying these kind of tourist attraction also contribute to local economy and generate employment. Government should focus on both. If you'll ask it's time to end the subsidy and freebies given to all the MP , MLA and ministers we could save billions of rupees from that which could be used for better things.",
        "Dude, I think your capslock is broken.",
        "See the actual thing is why don't we do both. Both are essential one is for the present and one is for the future. The rail redevelopment program is nice and all but is not happening fast enough. And same goes for the bullet train.",
        "Also note. Most of the station in Mumbai are due for a redevelopment. So yeah the issues are about to be fixed. (Hopefully)",
        "Itna Paisa may itnaich milenga. \n\n-Old Mumbai Proverb.",
        "Mumbai’s eventually going to get AC locals , a full fledged metro network and this will be a combined network with the locals and the monorail. \n\nThings take time (especially in our country ) but we’ll reap the benefits soon enough.\n\nOnly criticism I have is government recognises a problem in 2010 and fixes it in 2020 by which time the solution isn’t enough because the problem has doubled.\n\nBut with the highways and infrastructure being built hopefully that’s changing",
        "Because a nation can’t proceed one by one… it has to go ahead simultaneously to level up ig? Idk",
        ">Instead of spending thousands of crores on bullet train, CAN WE NOT FIX OUR BASIC AMENITIES FIRST????\n\nIt doesn't have to be either or - the Govt can do both parallelly.",
        "It’s good photo op",
        "Faster probably not. I say this because for a plane you need to be at airport atleast 2 hour before the departure. If this doesn’t have that requirement then you can save time in certain distances.",
        "High speed railway is extremely important if india wants to ever get out of lower middle income status",
        "We already have so many potential tourist attractions nationwide, what’s the need to build more when we could use that budget advertising historical ones—ones people actually travel from abroad to visit.",
        "A statue that’s built today is not going to be a significant tourist attraction. It takes ages for monuments to gain importance and heritage. Stuff like the Taj Mahal or red fort are tourist attractions. Spending millions to build a statue today is not better than building better infrastructure for people.",
        "Elvish bhai k aage koi bol sakta hai kya?\n\nElvishhhg bhaaaaaiiii",
        "this fallacy of \"tourist attraction\" and \"generate employment\" is used too much.",
        "lol education will not solve poor voting patterns. If kerala is educated why are they voting for communists?   There are more successful capitalistic but religious countries. Yet to find a succesful communist country that did not adopt capitalism",
        "What you on about? Pretty sure thane is getting a new foot over bridge built removing the older one, just because these upgrades are not flashy, you can't choose to ignore them they are upgrades non the less. The population issue won't fix in a day when it took years to accumulate itself.",
        "Ahmedabad to Mumbai is just first phase of Mumbai to Delhi. The loan is from Japan because Japan wants to India to build using its companies.\n\n> But can we also please please fix what we already have and what is transporting millions of passengers each day instead of a few hundred wealthy ones?\n\nWell, people rarely vote for fixing things. Just look at private companies you get more recognition for building new broken things than improving overloaded services and products. Moreover, the infra problem is local more than inter city.",
        "Remember Tejas express, the one with LCD screens at each seat, clean toilets with working equipment? At the end of its first journey, SC [screens were broken](https://www.businesstoday.in/latest/economy-politics/story/tejas-express-stolen-headphones-scratched-led-screens-77501-2017-05-25) and the taps were stolen.\n\nPeople can’t take care of what’s there, why should they get anything new or fixed?",
        "Where is this even coming from? What station do you travel through and fro? Local trains are the most reliable source of transportation in Mumbai (except during rains) and also Indian railways have the least amount of mishaps in my opinion.",
        "I am pretty certain travelling once in a year isn't called travelling. I've been travelling from past 8 years as well and the services in mumbai itself have become so much better. New coaches better cleanliness, new metro lines.",
        "Why isn't waste management our top priority? The garbage problem in our country is an international embarrassment. I don't understand why we still haven't fixed it. We need some strong laws to prosecute those who litter and an efficient system to collect and dispose waste in allocated areas.",
        ">The amount of money they contribute to the economy is 3 or 4 times to the actual spent on that statue\n\nYou are talking about the person based on who the statue is built. They may have contributed 3 times the price of their statue. But now they are dead and no longer contributing to the economy. So the money can be better utilized providing people an actual service.\n\nAlso if you are building a statue, build it with some peculiarity like biggest statue, statue with biggest hat, biggest ears on a statue, biggest shoes on a statue, biggest dong in case it's a naked statue etc. Then people will come and see it as a tourist attraction. Nobody wants to come and see some random ass politician statue.",
        "they are getting it for there luxurious travel not for us . It's time for us to get sense",
        "If you keep on thinking \"instead of spending\" for everything, it will become way more costlier to acheive the same thing in future right from land acquisition costs, construction costs, etc. \n\nIt has to be a balance of both.",
        "Just like to mention bullet trains in Japan run between major cities in 20 - 30 min intervals. They have below 40% occupancy. Even less. \nThey are expensive.\n\nFrom my side I better have wifi and clean toilets before bullet train.",
        "To fix what we already have, we don't need money, we need a policy shift.  maintenance of govt infra is forgotten in India.",
        "Bullet trains will literally fix the problem that you mentioned. Go back to school kid.",
        "“Why do anything when we could be doing something else?”",
        "They are rated among the Highest in hdi in the nation. Political experts like you can write your opinion on a piece of paver and shove it where the sun don't shine.",
        "I have no idea why you are being downvoted. The conditions in peak hours are worst than ever before.",
        "That tender for 238 locals has already been put on hold indefinitely, please stay updated",
        "Yeah basically just a targeted attack from RW subs. This is nothing new. They can’t handle criticism. They want to show a rosy picture",
        "Mumbai,Bangalore,Chennai etc are milked to encourage bimaru states to be more corrupt and wasteful, what's new in this.",
        "The downvotes are from the wealthy people that want to travel that route.",
        "yeah whoever disagrees with you is a RW sub. You really thought you did something there...",
        "No bro you got me wrong I am not talking about building a statue of any politicians who is alive they don't deserve. They have not done anything I was talking about statue of unity which is contributing more to our economy then the money spent. The only politicians who deserve a staue in my opinion are Manmohan sing ji and atal bihari vajpayee. They both saved our country at some point of time.",
        "bullet trains are equally necessary and important in our country\n\nThe faster we can move people around the more money we make",
        "Yeah but the issue is that status does contribute much to the economy. Kindly look up how much it makes per year.",
        "Bhai how has it improved? Most are dirty and there not even adequate seating or anything. Even the improved stations to a degree have horrible iron benches or something. The OP is not wrong when he points this out.",
        "I agree on OP’s POV but also it’s like saying stop college education of Elder child because we need to put younger son in better school.",
        "So , basic amenities even in those bullet trains sucks... that's how we are as a nation... we dream high and we focus on top while forgetting to wear trousers and undies.",
        "This … this is exactly what’s happening. People don’t agree then it’s RW agenda. Bhai I know you are frustrated from the situation but anyone who raise a pov which doesn’t subside with yours and slightly favours the govt is not RW",
        "Millions on meaningless statues and 100,000+ capacity stadium or even frigging parliament!!! Take care of basic necessities for the people who put you in that parliament to actually work and solve their problems not to \"work\" and show case to the world how developed we are when even pathway bridges are collapsing and dams crumbling and not enough toilets or water connections!!\n\nThat's what is wrong...",
        "yikes, now I can guess why Air India and Bangalore buses also removed those screens. Have seen them present only once over a decade ago.",
        "I have travelled long distances multiple times and trains are much better and cleaner than before, toilets are still good but people use them in worst way possible. Travelled many stations and they are much cleaner , no cows on the platforms as they were roaming there before. It has improved but a long way to go.",
        ">A large portion of railway passengers won't be able to afford the ticket prices\n\nWhat a shit argument, by your logic everyone would be using candles to light at night because \"poor people can't afford electricity\"",
        "I hope the complaint is towards few cities being too much in demand and lack of more equally developed cities. Trains can't be increased exponentially, at some point too many trains would make all the trains slow in that network. Instead city planning and funding should be focus so that people don't chose only select few cities to work in",
        "What happened to vandhe Bharat won't ut come to Mumbai ?",
        "Where have you seen implementation of bullet train in India exactly ? Vande Bharat to my knowledge is not a bullet train.",
        "How do we not do an impact study before we do the fund allocation?",
        "Bro did you work in Nokia?",
        "You don't get votes or money if you maintain existing trains. So bullet train Banta Hai.",
        "You are definitely under 25",
        "We need money, this requires capacity addition..not just.maintenance.  \nAlso policy shift is required to promote other public transports and non motorised transport systems",
        "The downvotes are from rational people, who think about how it would work out in the long run",
        "Note the keyword india. Its easy to hit HDI up to 0.8. Real game begins after 0.85.  As per capita income portion never really rises and life expectancy struggles to increase beyond a point. You shall wait and see."
    ],
    "cleaned_text": "instead spending thousands crores bullet train fix basic amenities first look condition railway stations financial capital country waiting come senses citizens demand basic necessities anymore everyone become sheep ",
    "cleaned_title": "instead spending thousands crores bullet train fix basic amenities first",
    "cleaned_selftext": "look condition railway stations financial capital country waiting come senses citizens demand basic necessities anymore everyone become sheep",
    "cleaned_comments": "bullet train aside hell spending crores useless statues purely symbiotic crores citizens dont get meals day ego image thing many politicians voters never question anti national lets keep suffering indias motto whatever makes babu money path least resistance well dont want similar situation airports bullet train might help stopping bullet train development isnt going solve problem public transport alternatives like metro bigger railway stationswith skybridges figure thats happening mumbai babus dont use public toilets bhaktas take piss standing pool piss go gaga respective human political goodmanwoman health education need tofix rest willfall place eventually dump money world classeducation every child watch build country theyll stop voting name religion caste hold politicians accountable government definitely wont put dime education look kerala bjp gets zero seats even minister accepted dont get votes kerala people educated world class transportation infra important shouldnt ignore one aspect improve need fix basic amenities stopping bullet trains gon na fix remember enough funds issue case corruption governments inefficiency problem large part funds go directly pockets ministers need fix first use funds efficiently realise contracts given government homes whether statue train means siphon money goons fuck guys ribbon cutting redevelopment dont think problem lack funds governance issue damn true wont cameras ribbon cutting chest thumping regular maintenance building extra bridge guy literally focuses marketing marketing marketing nonvande bharat trains become pain travel zero maintenance tc check everyone boards crowded badly india around trains actual backbone public transport increased capacity line requirement increasing population instead everyone focuses odd trains launched nine whole years population increased millions year happening well need fix infrastructure well people got electricity toilets etc done doubt actually conditions railway stations improved drastically recent years look current state railway passengers alternate mode travel dont need bullet trains large portion railway passengers wont able afford ticket prices operation maintenance would quite tireless expensive thankless job mention near impossible recover cost passenger journeys india imagine putting high initial investment high profile project turn disappointment forget airlines would still affordable faster bullet train rather invest current line railways amenities make sure lower strata passengers enjoy comfortable reliable journey travelling mumbai local trains since last years even talking ive well seen many stations like kurla dadar ghatkopar thane become worse passing year wherein people increasing theres absolutely nothing thats done ensure increase capacity days theres literally space board dadar kurla even talking well indian railway system definitely needs capex spends increase infrastructure maintenance dont understand wouldnt need bullet train going logic majority indians cant afford even live mumbai waste money mumbai thousands road doesnt development claim financial capital contributes tremendously gdp well would definitely answer building roads highspeed trains connecting cities instead spending improving infrastructure villages capitalism works way dont forget part privilege live cities alright lets bullet train taking loan japan build ahmedabad mumbai fares similar airfares route im completely fine also please please fix already transporting millions passengers day instead hundred wealthy ones please im travelling udaipur rajasthan bangalore many years railway stations wau cleaner citizens demand basic necessities anymore demand basic necessities see roti kapda makaan necessities slum areas metro cities enough people vote politically active meet demands many people even know municipal corporator contact person services dont think understand basics concept statues build amount money contribute economy times actual cost money dont understand everyone problem bullet train since post mumbai born brought thoughts might outdated left almost half decade ago travelled local trains crowds worst part offices located south barely anything north suburbs always caused overcrowding single direction southbound day northbound evening audacity suppress average mumbaikars problems spirit mumbai nonsense also displeasure groped multiple times walking dense crowds andheri station moment quit ladies coach spot happens common almost every woman know told story large number able afford ticket large number able afford ticket tier ac seats poor govt everyone need plan current future generation going come dont always remain generation poor people also rich people employ poor people need develop multiple fronts dedicated freight corridor vande bharat airports national highways better connectivity comes better growth reason received money japan percent interest next years building bullet train use money project government already working improve current railway infrastructure like station tracks building dfc reduce congestion lines speed normal trains could increase wdfc almost complete edfc percent complete already upgrading tracks run train km build separate track scratch run highspeed train even upgrading current track run trains higher speeds curves tunnel ultimate need bullet trains contribute economy amount invest fo example loom japan give psu eat half money indeed even bullet train answer even issue need faster affordable travel air travel bullet train though improve foundation setup vande bharat focus high speed rail honestly given hope mumbai seen people glorify local trains spirit mumbai struggle mumbai privileged migrating always better option cant expect things change even old reap benefits pass away breathing polluted air years see condition local trains cities priority mumbai local order ac train local train upgrade gov railway station much cleaner electrification going great metro many cities dedicated fright coridor going well parallel railway line laid time going need bullet train going start spend money railways system congested started building delhi metro delhi ripping benefits experience delhi metro helping us build metro cities similar situation happen bullet train cant criticise year continually suddenly years later demand bullet train currently india country beside china building big infrastructure saying ignore government must upgrade saying kind tourist attraction also contribute local economy generate employment government focus youll ask time end subsidy freebies given mp mla ministers could save billions rupees could used better things dude think capslock broken see actual thing dont essential one present one future rail redevelopment program nice happening fast enough goes bullet train also note station mumbai due redevelopment yeah issues fixed hopefully itna paisa may itnaich milenga old mumbai proverb mumbais eventually going get ac locals full fledged metro network combined network locals monorail things take time especially country well reap benefits soon enough criticism government recognises problem fixes time solution isnt enough problem doubled highways infrastructure built hopefully thats changing nation cant proceed one one go ahead simultaneously level ig idk instead spending thousands crores bullet train fix basic amenities first doesnt either govt parallelly good photo op faster probably say plane need airport atleast hour departure doesnt requirement save time certain distances high speed railway extremely important india wants ever get lower middle income status already many potential tourist attractions nationwide whats need build could use budget advertising historical onesones people actually travel abroad visit statue thats built today going significant tourist attraction takes ages monuments gain importance heritage stuff like taj mahal red fort tourist attractions spending millions build statue today better building better infrastructure people elvish bhai k aage koi bol sakta hai kya elvishhhg bhaaaaaiiii fallacy tourist attraction generate employment used much lol education solve poor voting patterns kerala educated voting communists successful capitalistic religious countries yet find succesful communist country adopt capitalism pretty sure thane getting new foot bridge built removing older one upgrades flashy cant choose ignore upgrades non less population issue wont fix day took years accumulate ahmedabad mumbai first phase mumbai delhi loan japan japan wants india build using companies also please please fix already transporting millions passengers day instead hundred wealthy ones well people rarely vote fixing things look private companies get recognition building new broken things improving overloaded services products moreover infra problem local inter city remember tejas express one lcd screens seat clean toilets working equipment end first journey sc screens brokenhttpswwwbusinesstodayinlatesteconomypoliticsstorytejasexpressstolenheadphonesscratchedledscreens taps stolen people cant take care whats get anything new fixed even coming station travel fro local trains reliable source transportation mumbai except rains also indian railways least amount mishaps opinion pretty certain travelling year isnt called travelling ive travelling past years well services mumbai become much better new coaches better cleanliness new metro lines isnt waste management top priority garbage problem country international embarrassment dont understand still havent fixed need strong laws prosecute litter efficient system collect dispose waste allocated areas amount money contribute economy times actual spent statue talking person based statue built may contributed times price statue dead longer contributing economy money better utilized providing people actual service also building statue build peculiarity like biggest statue statue biggest hat biggest ears statue biggest shoes statue biggest dong case naked statue etc people come see tourist attraction nobody wants come see random ass politician statue getting luxurious travel us time us get sense keep thinking instead spending everything become way costlier acheive thing future right land acquisition costs construction costs etc balance like mention bullet trains japan run major cities min intervals occupancy even less expensive side better wifi clean toilets bullet train fix already dont need money need policy shift maintenance govt infra forgotten india bullet trains literally fix problem mentioned go back school kid anything could something else rated among highest hdi nation political experts like write opinion piece paver shove sun dont shine idea downvoted conditions peak hours worst ever tender locals already put hold indefinitely please stay updated yeah basically targeted attack rw subs nothing new cant handle criticism want show rosy picture mumbaibangalorechennai etc milked encourage bimaru states corrupt wasteful whats new downvotes wealthy people want travel route yeah whoever disagrees rw sub really thought something bro got wrong talking building statue politicians alive dont deserve done anything talking statue unity contributing economy money spent politicians deserve staue opinion manmohan sing ji atal bihari vajpayee saved country point time bullet trains equally necessary important country faster move people around money make yeah issue status contribute much economy kindly look much makes per year bhai improved dirty even adequate seating anything even improved stations degree horrible iron benches something op wrong points agree ops pov also like saying stop college education elder child need put younger son better school basic amenities even bullet trains sucks thats nation dream high focus top forgetting wear trousers undies exactly whats happening people dont agree rw agenda bhai know frustrated situation anyone raise pov doesnt subside slightly favours govt rw millions meaningless statues capacity stadium even frigging parliament take care basic necessities people put parliament actually work solve problems work show case world developed even pathway bridges collapsing dams crumbling enough toilets water connections thats wrong yikes guess air india bangalore buses also removed screens seen present decade ago travelled long distances multiple times trains much better cleaner toilets still good people use worst way possible travelled many stations much cleaner cows platforms roaming improved long way go large portion railway passengers wont able afford ticket prices shit argument logic everyone would using candles light night poor people cant afford electricity hope complaint towards cities much demand lack equally developed cities trains cant increased exponentially point many trains would make trains slow network instead city planning funding focus people dont chose select cities work happened vandhe bharat wont ut come mumbai seen implementation bullet train india exactly vande bharat knowledge bullet train impact study fund allocation bro work nokia dont get votes money maintain existing trains bullet train banta hai definitely need money requires capacity additionnot justmaintenance also policy shift required promote public transports non motorised transport systems downvotes rational people think would work long run note keyword india easy hit hdi real game begins per capita income portion never really rises life expectancy struggles increase beyond point shall wait see",
    "light_cleaned_title": "Instead of spending thousands of crores on bullet train, CAN WE NOT FIX OUR BASIC AMENITIES FIRST????",
    "light_cleaned_selftext": "JUST LOOK AT THE CONDITION OF THE RAILWAY STATIONS IN THE FINANCIAL CAPITAL OF THE COUNTRY! WHAT ARE WE WAITING FOR TO COME TO OUR SENSES? WHY DO CITIZENS NOT DEMAND FOR BASIC NECESSITIES ANYMORE? WHY HAS EVERYONE BECOME SHEEP?",
    "light_cleaned_comments": "Why not both Bullet train aside, hell, we are spending crores on useless statues, which are purely symbiotic, while crores of our citizens don't get 3 meals a day. This is an ego & image thing for many of our politicians. Voters never question & those who do, are anti national. Let's keep on suffering is India's motto. Whatever makes Babu the money... Path to least resistance... Well, I don't want a similar situation in airports. Bullet train might help with that. Stopping bullet train development isn't going to solve this problem. Having more public transport alternatives (like metro) and bigger railway stations(with more skybridges) will. Figure out why that's not happening in Mumbai. We should. But babus don't use public toilets. Bhaktas will take piss standing over a pool of piss and go gaga over their respective human political Goodman/woman. Health and education is all we need to.fix. the rest will.fall in place eventually. Dump money into world class.education for every child and just watch them build the country. But then they’ll stop voting in the name of religion and caste and hold politicians accountable :) This government definitely won’t put a dime into education. Look at Kerala, BJP gets zero seats. Even their minister accepted that they don’t get votes in Kerala because the people there are educated World class transportation infra is important too, We shouldn't ignore one aspect to improve other. We do need to fix basic amenities but stopping bullet trains is not gonna fix that. And remember, not having enough funds is not an issue in this case. Corruption and government's inefficiency is the problem. Large part of our funds go directly into the pockets of ministers. We need to fix that first and then use our funds efficiently. You do realise these contracts are given to government homes. Whether it's a statue or a train. It's just a means to siphon our money to goons. Fuck these guys No ribbon cutting after redevelopment. I don't think this is a problem of lack of funds, it is a governance issue. So damn true. There won’t be cameras and ribbon cutting and chest thumping for regular maintenance or building an extra bridge. That guy literally just focuses on marketing marketing marketing. The non-Vande Bharat trains have become such a pain to travel in. Zero maintenance, no TC to check, everyone just boards, it’s crowded so badly. India has around 16,000 trains which are the actual backbone for public transport and have not increased in capacity in line with the requirement of the increasing population and instead everyone just focuses on those 20 odd trains launched in NINE WHOLE YEARS against a population that increased by millions each year That is happening as well. You need to fix infrastructure as well. People have got electricity, toilets , etc. More has to be done no doubt. Actually the conditions of Railway stations have improved drastically in recent years. If we look at the current state of railway and passengers and alternate mode of travel, we don't need Bullet Trains. A large portion of railway passengers won't be able to afford the ticket prices, the operation and maintenance would be quite a tireless, expensive and thankless job; not to mention it's near impossible to recover the cost through passenger journeys in India. Imagine putting such a high initial investment into such a high profile project only for it to turn into a disappointment. Not to forget, Airlines would still be more affordable and faster than Bullet Train. Rather invest more in the current line of railways and amenities to make sure the lower strata of passengers can enjoy a comfortable and reliable journey. Have been travelling in Mumbai local trains since the last 10 years. What are you even talking about? I’ve very well seen many stations like Kurla, Dadar, Ghatkopar, Thane become worse with each passing year wherein people are increasing but there’s absolutely nothing that’s been done to ensure increase in capacity. There are days there’s literally no space to board from Dadar and Kurla at all. What are you even talking about??? Well Indian railway system definitely needs more capex spends to increase infrastructure and maintenance. I don’t understand why we wouldn’t need a bullet train ? Going by your logic Majority of Indians can’t afford to even live in Mumbai why do we have to waste money in Mumbai while thousands of road doesn’t have development. If you claim it’s the financial capital and it contributes tremendously to our GDP. Well you would definitely have the answer for why we are building roads and highspeed trains connecting cities instead of spending it on improving infrastructure of villages. Capitalism works that way and don’t forget you are part of the privilege too to live in cities. Alright let’s have a bullet train by taking a loan from Japan and build it from Ahmedabad to Mumbai having fares similar to airfares on the same route. I’m completely fine with it. But can we also please please fix what we already have and what is transporting millions of passengers each day instead of a few hundred wealthy ones? Please? And I'm travelling from Udaipur, Rajasthan to bangalore for many years and most of the railway stations are wau cleaner. >WHY DO CITIZENS NOT DEMAND FOR BASIC NECESSITIES ANYMORE? They do demand basic necessities. See - the \"roti kapda makaan\" necessities of slum areas in our metro cities. If enough people vote and are politically active they will meet those demands too. How many people even know who their municipal corporator is and how to contact that person for services. I don't think you understand the basics concept why some statues are build the amount of money they contribute to the economy is 3 or 4 times to the actual cost of money. And I don't understand why everyone has problem with bullet train. Since this post is about Mumbai: I was born and brought up there and my thoughts might be outdated now because I left almost half a decade ago. I travelled in the local trains and through these crowds. The worst part was that ALL offices were located in the south and there was barely anything in the north (suburbs). This always caused overcrowding in a single direction (southbound during the day, northbound during the evening). And then they have the audacity to suppress average Mumbaikar's problems under the \"spirit of Mumbai\" nonsense. I have also had the displeasure of being groped multiple times walking through these dense crowds at Andheri station, the moment I quit the ladies coach. That spot where this happens is so common that almost every woman I know has told me a story about it. A large number will not be able to afford the ticket and a large number will be able to afford the ticket. Tier 1 AC seats are not for the poor. Govt is for everyone and you need to plan for current and the future generation that is going to come because if you don't you will always remain a generation below. If we have poor people we also have rich people who employ the poor people. You need develop at multiple fronts, be it a dedicated freight corridor, Vande Bharat, Airports or National Highways. With better connectivity comes better growth. The only reason we received money from japan on 0.1 percent interest for next 50 years is for building bullet train. We can not use that money for any other project government is already working to improve the current railway Infrastructure like station and tracks. They are building DFC to reduce the congestion on the lines so that the speed of normal trains could increase wdfc is almost complete edfc is 100 percent complete they are already upgrading tracks to run train on 180km. But we have to build separate track from scratch to run high-speed train because even after upgrading current track they can not run trains on them on higher speeds because of all the curves and tunnel they have. Ultimate we need these bullet trains they will contribute more to our economy then the amount we invest on them fo example loom japan. give it to a PSU and it will eat half of the money. Indeed but even then how is Bullet Train answer to even 1% of that issue? Need faster affordable travel, you have air travel. Why Bullet Train though? Improve the foundation setup by Vande Bharat and focus on High Speed rail. Honestly I have given up hope, Here in Mumbai I have seen people glorify the local trains. Spirit of Mumbai, struggle of Mumbai and what not. If you are privileged, migrating is always a better option ( I will too) can't expect things to change, even if it does I will be too old to reap the benefits or pass away from breathing the polluted air for years. See the condition of local trains in cities, they should be a priority. Mumbai local order 238 AC train for local train upgrade. Gov is doing both. All the railway station are now so much cleaner. Electrification is going great, metro are being in so many cities. Dedicated fright coridor is going well. Parallel railway line are laid There will be time when we are going to need bullet train, but if we are not going to start now than we will have to spend more money and railways system will be more congested. We started building Delhi metro in 2000s and now Delhi is ripping it's benefits. And now because of experience of Delhi metro is helping us to build more metro in other cities. Similar situation will happen with bullet train. You can't just criticise it now for 10 year continually and suddenly 10 years later you demand for bullet train when it's not there. Currently India is the only other country beside China that is building big infrastructure. I am not saying we should ignore them government must upgrade them. I am just saying these kind of tourist attraction also contribute to local economy and generate employment. Government should focus on both. If you'll ask it's time to end the subsidy and freebies given to all the MP , MLA and ministers we could save billions of rupees from that which could be used for better things. Dude, I think your capslock is broken. See the actual thing is why don't we do both. Both are essential one is for the present and one is for the future. The rail redevelopment program is nice and all but is not happening fast enough. And same goes for the bullet train. Also note. Most of the station in Mumbai are due for a redevelopment. So yeah the issues are about to be fixed. (Hopefully) Itna Paisa may itnaich milenga. -Old Mumbai Proverb. Mumbai’s eventually going to get AC locals , a full fledged metro network and this will be a combined network with the locals and the monorail. Things take time (especially in our country ) but we’ll reap the benefits soon enough. Only criticism I have is government recognises a problem in 2010 and fixes it in 2020 by which time the solution isn’t enough because the problem has doubled. But with the highways and infrastructure being built hopefully that’s changing Because a nation can’t proceed one by one… it has to go ahead simultaneously to level up ig? Idk >Instead of spending thousands of crores on bullet train, CAN WE NOT FIX OUR BASIC AMENITIES FIRST???? It doesn't have to be either or - the Govt can do both parallelly. It’s good photo op Faster probably not. I say this because for a plane you need to be at airport atleast 2 hour before the departure. If this doesn’t have that requirement then you can save time in certain distances. High speed railway is extremely important if india wants to ever get out of lower middle income status We already have so many potential tourist attractions nationwide, what’s the need to build more when we could use that budget advertising historical ones—ones people actually travel from abroad to visit. A statue that’s built today is not going to be a significant tourist attraction. It takes ages for monuments to gain importance and heritage. Stuff like the Taj Mahal or red fort are tourist attractions. Spending millions to build a statue today is not better than building better infrastructure for people. Elvish bhai k aage koi bol sakta hai kya? Elvishhhg bhaaaaaiiii this fallacy of \"tourist attraction\" and \"generate employment\" is used too much. lol education will not solve poor voting patterns. If kerala is educated why are they voting for communists? There are more successful capitalistic but religious countries. Yet to find a succesful communist country that did not adopt capitalism What you on about? Pretty sure thane is getting a new foot over bridge built removing the older one, just because these upgrades are not flashy, you can't choose to ignore them they are upgrades non the less. The population issue won't fix in a day when it took years to accumulate itself. Ahmedabad to Mumbai is just first phase of Mumbai to Delhi. The loan is from Japan because Japan wants to India to build using its companies. > But can we also please please fix what we already have and what is transporting millions of passengers each day instead of a few hundred wealthy ones? Well, people rarely vote for fixing things. Just look at private companies you get more recognition for building new broken things than improving overloaded services and products. Moreover, the infra problem is local more than inter city. Remember Tejas express, the one with LCD screens at each seat, clean toilets with working equipment? At the end of its first journey, SC [screens were broken](https://www.businesstoday.in/latest/economy-politics/story/tejas-express-stolen-headphones-scratched-led-screens-77501-2017-05-25) and the taps were stolen. People can’t take care of what’s there, why should they get anything new or fixed? Where is this even coming from? What station do you travel through and fro? Local trains are the most reliable source of transportation in Mumbai (except during rains) and also Indian railways have the least amount of mishaps in my opinion. I am pretty certain travelling once in a year isn't called travelling. I've been travelling from past 8 years as well and the services in mumbai itself have become so much better. New coaches better cleanliness, new metro lines. Why isn't waste management our top priority? The garbage problem in our country is an international embarrassment. I don't understand why we still haven't fixed it. We need some strong laws to prosecute those who litter and an efficient system to collect and dispose waste in allocated areas. >The amount of money they contribute to the economy is 3 or 4 times to the actual spent on that statue You are talking about the person based on who the statue is built. They may have contributed 3 times the price of their statue. But now they are dead and no longer contributing to the economy. So the money can be better utilized providing people an actual service. Also if you are building a statue, build it with some peculiarity like biggest statue, statue with biggest hat, biggest ears on a statue, biggest shoes on a statue, biggest dong in case it's a naked statue etc. Then people will come and see it as a tourist attraction. Nobody wants to come and see some random ass politician statue. they are getting it for there luxurious travel not for us . It's time for us to get sense If you keep on thinking \"instead of spending\" for everything, it will become way more costlier to acheive the same thing in future right from land acquisition costs, construction costs, etc. It has to be a balance of both. Just like to mention bullet trains in Japan run between major cities in 20 - 30 min intervals. They have below 40% occupancy. Even less. They are expensive. From my side I better have wifi and clean toilets before bullet train. To fix what we already have, we don't need money, we need a policy shift. maintenance of govt infra is forgotten in India. Bullet trains will literally fix the problem that you mentioned. Go back to school kid. “Why do anything when we could be doing something else?” They are rated among the Highest in hdi in the nation. Political experts like you can write your opinion on a piece of paver and shove it where the sun don't shine. I have no idea why you are being downvoted. The conditions in peak hours are worst than ever before. That tender for 238 locals has already been put on hold indefinitely, please stay updated Yeah basically just a targeted attack from RW subs. This is nothing new. They can’t handle criticism. They want to show a rosy picture Mumbai,Bangalore,Chennai etc are milked to encourage bimaru states to be more corrupt and wasteful, what's new in this. The downvotes are from the wealthy people that want to travel that route. yeah whoever disagrees with you is a RW sub. You really thought you did something there... No bro you got me wrong I am not talking about building a statue of any politicians who is alive they don't deserve. They have not done anything I was talking about statue of unity which is contributing more to our economy then the money spent. The only politicians who deserve a staue in my opinion are Manmohan sing ji and atal bihari vajpayee. They both saved our country at some point of time. bullet trains are equally necessary and important in our country The faster we can move people around the more money we make Yeah but the issue is that status does contribute much to the economy. Kindly look up how much it makes per year. Bhai how has it improved? Most are dirty and there not even adequate seating or anything. Even the improved stations to a degree have horrible iron benches or something. The OP is not wrong when he points this out. I agree on OP’s POV but also it’s like saying stop college education of Elder child because we need to put younger son in better school. So , basic amenities even in those bullet trains sucks... that's how we are as a nation... we dream high and we focus on top while forgetting to wear trousers and undies. This … this is exactly what’s happening. People don’t agree then it’s RW agenda. Bhai I know you are frustrated from the situation but anyone who raise a pov which doesn’t subside with yours and slightly favours the govt is not RW Millions on meaningless statues and 100,000+ capacity stadium or even frigging parliament!!! Take care of basic necessities for the people who put you in that parliament to actually work and solve their problems not to \"work\" and show case to the world how developed we are when even pathway bridges are collapsing and dams crumbling and not enough toilets or water connections!! That's what is wrong... yikes, now I can guess why Air India and Bangalore buses also removed those screens. Have seen them present only once over a decade ago. I have travelled long distances multiple times and trains are much better and cleaner than before, toilets are still good but people use them in worst way possible. Travelled many stations and they are much cleaner , no cows on the platforms as they were roaming there before. It has improved but a long way to go. >A large portion of railway passengers won't be able to afford the ticket prices What a shit argument, by your logic everyone would be using candles to light at night because \"poor people can't afford electricity\" I hope the complaint is towards few cities being too much in demand and lack of more equally developed cities. Trains can't be increased exponentially, at some point too many trains would make all the trains slow in that network. Instead city planning and funding should be focus so that people don't chose only select few cities to work in What happened to vandhe Bharat won't ut come to Mumbai ? Where have you seen implementation of bullet train in India exactly ? Vande Bharat to my knowledge is not a bullet train. How do we not do an impact study before we do the fund allocation? Bro did you work in Nokia? You don't get votes or money if you maintain existing trains. So bullet train Banta Hai. You are definitely under 25 We need money, this requires capacity addition..not just.maintenance. Also policy shift is required to promote other public transports and non motorised transport systems The downvotes are from rational people, who think about how it would work out in the long run Note the keyword india. Its easy to hit HDI up to 0.8. Real game begins after 0.85. As per capita income portion never really rises and life expectancy struggles to increase beyond a point. You shall wait and see."
}