{
    "id": "17p879q",
    "title": "Lawyers of India, can I sue lays for false advertising ?",
    "url": "https://www.reddit.com/gallery/17p879q",
    "selftext": "The new blue lays tastes like a fukin rip off of lays magic masala, if feels like their masala supplier is the same as balaji's supplier, I would literally short PepsiCo India stocks after tasting this atrocity. They have said 'new masala, more magic' there is no magic  in it, the magic that was there is not there anymore, I have written to their customer care and I have not got any reply. This is really sad, magic lays was a comfort food and this is causing a lot of issues to my mental health. 10rs ka packet I used to buy when I used to come back from work and it used to make me feel soo good. I don't know how I'm going to go ahead in life. FUCK YOU PEPSICO INDIA, You can't play with your customers like this.",
    "flair": "Rant / Vent",
    "score": 1502,
    "num_comments": 212,
    "created_utc": 1699292238.0,
    "convurl": "https://i.redd.it/6820z6b9kryb1.jpg",
    "comments": [
        "Lol, this company is literally poisoning people. Sure. Sue them for not fitting your taste, they're already dreaded",
        "Lmao that is so stupid, obviously you cannot sue them for it. New Masala Can Taste the same, Magic is really no parameter to measure taste in difference.",
        "I just recently made the switch to pringles, and I'm never looking back. \n\nEdit: removed the rest of text praising pringles to not make it look like I am pringles PR.",
        "Cricket may be a religion, but Magic Masala is our heart. To war with Lays! Boycott them!",
        "damn bro, you really do be feeling it 😭 hey, on the bright side, they did say they're bringing back the old magic masala back so you can just sit tight till then ig?",
        "Bhai ke upne alag hi kalesh chalrahe hain. \n\n\"Sue\" them for what? You don't like it, that's why? Soja bhai 🤣",
        "Yes.first rule of lawsuits. You can sue anybody anywhere for anything.",
        "Bro got a bit of 'tism",
        "It's causing emotional and mental harm, so yes. If they can sue companies and individuals that may come in their normal functioning why can't we",
        "Someone sued Red Bull for not giving them wings and they became a millionaire with a trophy wife. As always, shoot your shot - *where’s the magic?*",
        "Blue lays really lived long enough to becoming a villain",
        "Go for it but big corporations have a massive legal team and it'll just be a bunch of money going to waste. Would make for a funny af headline tho\n\nStart a gofundme or something.",
        "Youtube Law School graduate over here",
        "Not in India.\n\nIf you bring frivolous law suits in India, you would be fined for wasting courts time.",
        "Lol People are so fragile nowadays",
        "It's ad man, don't take it literally just like girls don't chase you when you put on axe 🤣🤣🤣",
        "Yeah because they are very busy serving people. nincompoops",
        "Choti bacchi ho kya?",
        "Yes. It’s same everywhere. Most lawsuits never see a day in court. They are paid off way before cause it’s cheaper for companies to pay off the party than go spend their time in courts. I worked with a company who paid off one individual every year just not to file a lawsuit instead of changing a product specification which would have cost millions.",
        "Haldiram's masala (blue one) tastes same and is much better, screw these billion dollar companies and have our own home made ones. They don't lack in quality now.",
        "Bold of you to assume that they respond to emails. I remember emailing to Parle 1-2 years back and they never responded back.",
        "Apparently Magic masala is coming back thanks to the rant that an influencer Bunshah had on Instagram. Lays got a lot of backlash and now it’s being reinstated 😂 what a world",
        "Can you please elaborate on poisoning part. I am avid lays consumer",
        "Choose the non violent route, buy Patanjali noodles, it's full of magic masala.",
        "Bhai thodi km liya karo",
        "Don't want to criticize, but bhai bohot cheeze hai life mai karne ke liye aur khane ke liye. Don't waste your time on these things.",
        "Let's Sue them too!!!",
        "NAL. You can sue, but you won't win.",
        "I too mailed them, they'll call you in a week. They said they'll send a hamper, give feedback to the product team and would try to bring back the original taste.",
        "If it is fucking chips that causing you emotional and mental harm, i envy your life dude",
        "Lays Indian flavour was good till 2010, post that they ruined it.",
        "Pepsico is poisoning people with their beverages.",
        "It's already done dude - https://www.google.com/amp/s/www.citehr.com/amp.php%3ft=221564",
        "Wait..no one chases your after you put on axe?\nUsually the ladies chase me around quite a bit (you have to take their phone or their purse for the full effect of axe to work)",
        "Give it time buddy. Another 3 years or so, you'll get your response.",
        "First world problems in third world countries",
        "It's not just lays. All manufacturers in India have lowered their standards and are selling subpar products",
        "Wasn't there a guy in India who sued because his biscuit packet had one biscuit less? Was this in India or am I misremembering?",
        "You are right bud...\n\nhttps://www.indiatoday.in/amp/india/story/consumer-court-orders-itc-to-pay-rs-1-lakh-as-compensation-to-for-packing-15-biscuits-against-advertised-number-16-2431834-2023-09-06",
        "\"This company is poisoning people\"\n\n\"Pls elaborate\"\n\n\"This company is poisoning people\"\n\nThanks for elaborating mate",
        "I thought I was going fucking crazy. Glad I'm not the only one who thinks this is off.",
        "Cum*",
        "Are you saying that you can no longer get the original magic masala in India now? Cuz I can get [this big ass packet](https://imgur.com/gallery/r7qy9z9) in Canada. It might even taste better than what I remember from back in India.",
        "You will win the case and judge will award you million dollar settlement. The million dollars will come in a big suitcase. But you open the suitcase it’s just ten thousand rupees in there, and a Pokémon tazo.",
        "\"This n\\*gga has lost his composure\"",
        "That same masala is on everything French fries chips getting tiring. It’s like asking for noodles at an Indian restaurant doesn’t matter if it’s Hong Kong style or Indonesian they all taste the fuckin same",
        "You bought it right! That was the magic! I Lays my case your honor!",
        "Funny to see this as a foreigner. All I know about India is directly linked to my interest in Hinduism and Buddhism. Didn't know they are lays. But in the end it's also brahman. 😅",
        "Bro find some work",
        "Taste is a subjective thing not objective, it may taste better to some, no grounds for a legal case",
        "what magic they promised? pigeon out of packet?",
        "/s",
        "But... Taste is subjective",
        "While it's shitty of companies to do this (no surprise, companies only care about their bottomline), if your mental health hinges on a single packet of chips, you have bigger things to worry about. \n\nI'd suggest a therapist.",
        "And by poisoning, do you mean their drink has sugar? Or some specific chemicals that are killing us?\n\nBecause by the first logic, every halwai in India is also killing us.",
        "The drinks are cancerous, as shown by the toilet cleaner community",
        "Pringles PR really focussing on Reddit.",
        "As companies grow they try to maximise profits by making manufacturing simpler/cheap/homogeneous it is same as to what happened with kfc and dominos. Lawsuit against a billion dollar mammoth that too in a \"developing\" country of 1.3 billion people, with your job will be shooting on foot.\nI'd say make a insta page or something to make people aware as it will gain traction sue them as a group, you can go to people and ask them to sign a petition about that and make a yt video out of it. That's all i can think of now.",
        "Bruv, what season of SUITS made you to do this ?",
        "Yes i felt the taste getting same like Balaji too. I love the Balaji taste so it was a win win for me",
        "I liked this more than the previous one. This is coming from supportive who's loved blue lays since 15 years if not more",
        "Don't eat lays. Not healthy at all!",
        "My question is how much time do you have to fight a case, it takes yearsssssssssssss",
        "They are under no obligation to provide you with chips. This is not an essential service protected by law. Please don't waste your time.",
        "bro tu /s lagana bhool gaya",
        "I am assuming OP has huge amounts of time in his hands.... Lol\n\nI would have never thought to file a case on masala used in chips.",
        "Buy bikaji chips, they are best chips rn out there",
        "No. “More magic” is subjective, since there is no real definition / known usage of “magic” in the field of flavouring for chips. \nIf you do ill -advisedly choose to file, you’ll be slapped with cost most likely.",
        "Stop eating lays dude. Very bad for health !!",
        "My bad 🥲",
        "Damn can you send me some to Europe loll I’ll pay for shipping and the chips",
        "*on his hands",
        "Whole my life, I wanted to Sue them for the air they sell",
        "Agree",
        "The case had a significant amount the company made as a result each day.",
        "Wtf did I just read.. 🤦‍♂️",
        "The Judiciary in India is so broken , you can sue anyone even if u don't have any proof as the case to get filed will probably take 100 years and waste your whole life to just prove your innocence.",
        "Hope u know Pringles aren't 'potato chips'. Read the ingredients next time.",
        "they're allowed to display anything in the front as long as the back contains the ingredient list and nutritional info. so i dont think you can do anything about it.",
        "Okay. That didn’t make any sense!",
        "what are they then? Disliked the cheesy cummy taste and have never ordered pringles since",
        "i miss lays baked",
        "Save the lawyer money and hire a therapist instead.",
        "Get a grip dude these are just some chips. People use mental health so casually these days with anything. If some masala gives you mental health issues then you seriously need to see some doctor.",
        "I actually didn't like the previous masala but something changed in the last few months and I love the new taste! I got like 20 packets in stock",
        "The usual industrial processed garbage,\nCheck the ingredients, if you don't know where to pick or gather it, it's from a chemical plant. Usually glutamate, iodine (not the healthy kind from spinach ;)) and so on...",
        "Oh man you are right about the flavor,\nI thought I baught Balaji Masala and had to check the packet twice.\nI hate that sweet masala flavor of balaji masala. Old lays magic masala was perfect.",
        "All the comments shitting on op for no legitimate reasons. These corporations continue to blindly deliver a failure of a product and yet we are supposed to just deal with it?They are merciless moneymaking machines who would sue everything and everyone on a whim yet we are supposed to just sit there and take it?wow",
        "They've been selling us air packets since I remember. Yes, sue them.",
        "I tried this as well it’s bad",
        "Well, if you have the time and money to sue them over a packet of Rs 10 chips, then sure, go ahead.",
        "infinite money glitch",
        "Same bro…… Its literally the only flavour of chips I used to eat. there’s no more magic in the masala, just want the taste that was there 5yrs back. But on the bright side…now I have a healthier diet thanks to their shitty tasting chips.",
        "Lol, Bunshah reminded me of my classmate from school so I went and checked his insta... It was him only 🤣",
        "I would sue them for supporting israel.",
        "PepsiCo also funds genocide",
        ">elaborate on poisoning part.\n\nNot an expert, but perhaps they're talking about the I'll effects of the parmolin oil generally used in such snacks",
        "I mean the air has use like... Preventing chips from breaking. Oh wait...",
        "Wow devastating news, mm was goat status",
        "Which company? Why aren't you using this information to make money from that company ? Tell me and I'm ready to share a %!",
        "What's the specification and what did he want to change it to?????? And what's the name of the company?",
        "Why lawsuit? Stop buying, let people stop buying.\nThey'll reintroduce the original taste then.\n\nSomething that had happened with coke a long time ago.",
        "Kar na OP.. maza ayega.",
        "Cause I have a soul my friend.",
        "Bingo Hashtags : Spicy Masala is the new blue lays. Plus, touché, they fucked up blue lays big time",
        "Just eat orange lays like normal people.",
        "Lol, have nothing to say and all you do is repeat ingredients? Where is the harmful stuff in the two ingredients you said? at least show something that's actually harmful. Hating something because you don't understand ingredients doesn't qualify it as harmful.",
        "I have one too. It hasn't done me any good. \n\nI have realized it's time to switch sides and watch the world burn :D",
        "That's what you have been told 😂",
        "yes, earlier this was the best lays\n\nnow it is the exact replica of balaji wafers blue coloured chips\n\n&#x200B;\n\nhate it too",
        "Even legally speaking this isn't really a false advertisement, I seriously doubt that this case would be maintainable.",
        "Ten thousand rupees in 1000 rupee notes",
        "I came here just to ask how did this post got up vote button with sparkles around them nice look somehow make me wanna upvote for no reason....",
        "I wrote this on some other rant on lays that they will take it back. They clearly can't lose the customer as it's a money making product. They will simply change back to the other vendor or replicate the old flavour with a new vendor as soon as the stock for the current production run gets over.",
        "Nope. Not even in US. Most ridiculous cases of successful lawsuits are either fake news or partial truths.",
        "What do you mean by its coming back? It never stopped coming",
        "Pretty lame reason for suing, if you ask me. Everybody knows that advertisements are bullcrap.",
        "Why did your first comment get more than 100 upvotes and this followup explanation is getting downvotes?\n\nCertified Reddit moment.",
        "Balajis taste is great for the price per weight ratio",
        "abey american ka choddal! 😂",
        "I literally threw the last pack couldn't imagine how they fucked it up so bad.",
        "There should be also a petition to stop use of pathetic palm oil use in all Indian products why do other countries enjoy products with good quality ingredients.",
        "you dont know what they were putting in the magic masala previously which made you addicted. maybe gov found out and banned it so lays had to change their whole recipe.",
        "It's always been shit.",
        "That’s why it tasted so different!",
        "It’s literally just sodium, fat and carbs. And the bad kind. They provide no good nutrition to the body. That’s common sense.\n\nIf you love processed garbage so much, go eat only processed foods for a month. And check your blood test results before and after. I guarantee you it will be worse in every metric. There youtube videos about medical professionals who’ve done it and it always leads to worsening of all metrics such as cholesterol, fat, a1c, etc\n\nAnd the damage to the body from junk food is slow but gradual so it manifests after 30s and 40s. And ALL kinds of processed food increases insulin resistance because there’s a sudden increase and decrease in blood glucose. You repeat that many times in a day, and it badly affects metabolic rate. Insulin resistance being high is linked with almost all diseases like heart, poor pancreatic functioning, kidney problems, poor metabolism, obesity, etc.\n\nSource : https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9228591/\n\nhttps://www.health.harvard.edu/mind-and-mood/eating-ultra-processed-foods-tied-to-cognitive-decline",
        "Idk which court will admit the matter and entertain it, but it’s not like it hasn’t been done before- https://www.indiatoday.in/india/story/consumer-court-orders-itc-to-pay-rs-1-lakh-as-compensation-to-for-packing-15-biscuits-against-advertised-number-16-2431834-2023-09-06\n\nSo go off I guess, find a lawyer and register the case",
        "Oh Imma mail them too(for the hamper)",
        "because indian judicial system was never designed to bring justice FOR people.",
        "First make money and later become a Humanitarian lawyer who fights for human rights for free 😂🤣.",
        "It's fast food man, you have packaged food conveniently available. Nice to have when needed, don't make a meal out of it?\n\nThe quantities present in one packet, consumed responsibly should not do anything dangerous to you. Consume responsibly and have an overall healthy lifestyle. If you're a couch potato binging on junk, there are bigger things to worry about.",
        "It’s shit now man",
        "Without divulging company name, can you please tell us what spec or change we're talking about here? I'm so curious",
        "You can sue but you will definitely lose this one(if it didn't land with a nut judge).\n1. Magic should not be taken literally, they will argue that are you even a sane person who falls for the word magic? Their lawyer will ask you if you believe in tooth fairy and Santa Claus and the whole court will laugh.\n2. It's their prerogative to alter the flavour of their product, and it was you who bought it even after clearing saying through their label that it was a changed flavour. Your fault, not theirs.\n3. Then lastly their lawyers will ask you if you have ever heard the term inflation?? That things go expensive with passage of time and so to keep the price of the product same they reduce the amount of chips in each product.\n\nCase closed, you can be fined with wasting the time of company and its lawyers.\n\nPS- am a supreme court advocate.",
        "Hard to swallow pills ;)",
        "Bhai chutiyapa ke disha me badh rhe ho, smbhal ke.",
        "But really, is \"being an avid lays customer\" really something to be for an adult? I thought it's only kids who are like that... easily fooled by colorful packaging and 5 seconds of sensation on the tongue...",
        "Damn you know Balaji? That's kinda cooool.",
        "This is what is called first world problems!",
        "You will be surprised to know that Lays in itself is a scam .90 percent air and 10% chips. Atleast it tastes good.",
        "> Magic lays was a comfort food and this is causing a lot of issues to my mental health\n\nDoes anyone have a pin to prick this bubble?",
        "Source ?",
        "You cant technically sue over this.",
        "Use that money for a therapist instead",
        "Source?",
        "Most likely Pepsi’s bribing government officials to take too much water from places where it’s scarce. They do this in the US too here’s an Indian one, old but they never stopped.\n\nhttps://www.theguardian.com/world/2017/mar/01/indian-traders-boycott-coca-cola-for-straining-water-resources",
        "i think u have contracted COVID (again?)",
        "Ok I did some research and apparently when abused on Instagram pages on why they changed the taste laysindia is replying that the magic masala is coming back they used your favourite and not old so I don't even know what to expect lol",
        "NOT A LAWYER! \nUnless you have proper evidences and no-loophole statements presented, you will either be fined for wasting court time or they may sue you back.\nIf you have a good case, \n1. They'll try to sort this outside the court by buying you to shut your mouth\n2. Pressure you by indirect \"blackmail\" (if the company is a dark on the inside works\n3. If you still make it out of all that stress and court dates, you'll win compensation depending on the infringement and they'll just change the branding a bit and keep selling the same thing.",
        "I remember back when lays had Dhoni as its brand ambassador that the dark blue flavour was launched. They stopped producing it years ago if I'm not wrong.",
        "Apart from mental health you should also take care of your physical health and avoid LAYS kind of junk food altogether. :)",
        "Sue them for what exactly? No reasonable person would expect there to be actual magic in the chips. And Lay's decided to change their recipe, it's their right, you can't do anything about it. They can make whatever recipes they want, as long as they follow the health & safety guidelines, it's their choice. They wanted to change their flavor, they did. There's no case or claim here. The only thing you can do is not buy their products. And that's pretty much it.\n\nI mean, what you are basically saying is that you wanna sue them because you don't like the taste of their, which, btw, is extremely subjective. A frivolous lawsuit like this wouldn't do shit even in a country like US where filings lawsuits & suing companies is a lot easier, let alone in India.\n\nP. S. - NAL",
        "All this ranting about Magic Masala reminds me about Masala Jazz from Kaala Paani but I agree with you OP",
        "You want to get paid",
        "I only like green lays so can someone explain what the issue is here? Sue them for what exactly?",
        "Think of this as a chance to get out of your lays addiction.",
        "mail me kya likhu ye batao , hamper to mai bhi leke rahunga",
        "Green one is my favourite",
        "Just a coincidence, that varun beverages limited, the master franchisee of pepsico in India is 4.82% in a single session today 🤣",
        "chile lemon be gud",
        "> iodine (not the healthy kind from spinach\n\n??",
        "aise toh bhai you can use every other company in India, like Kissan, Hindustan Unilever Limited, many more",
        "Let's go",
        "They are not that bad. Its like a mix of lighter blue lays and a bit of chilli lemon from green. Although i understand why some would absolutely hate it, my mrs also hates the new one. I hope both can co-exist",
        "Blue and Cream and Onion lays fav",
        "This is the best advice. If you are mentally disturbed because of chips, then there are some other underlying issues here.",
        "We're first world, my man",
        "Yeah why aren't Indian talking about this! I ate this and had to confirm thrice that I wasn't Balaji. Kyu kyu kyu",
        "Unpopular Opinion: Yellow >>> Orange >>> Green >>> Blue Lays",
        "Bruh, you eat it in enough quantities it starts tasting like VIM liquid, not that I've ever tasted VIM but I somehow always get that feeling. Still tasty though, if I look past it.",
        "Damn , influencers are really good at influencing public opinion (writes down possible business promotion strategy)",
        "The only magic is the air in the packets that makes you feel that nothing is inside",
        "Lol. Imagine being so stress free that some company changing its chips flavour causes you emotional distress.",
        "In the words of Chelsea Peretti, \"Men used to go to wars\".",
        "i feel like that if i buy a bigger than 20 pack but the 20 one wont give that affect",
        "haa pls btao na (asking for a frnd)",
        "happy cake day bud!",
        "Haha ask ChatGPT.. That's what I did.",
        "Ask your best frAInd ChatGPT. He helped me too.",
        "Sure, tell me what they replied.",
        "thanks man 🍻",
        "I calculated an estimate just out of curiosity. It'll cost about 90 CAD through Canada Post lol.",
        "The very basic difference lies in the smell of the farts after eating both.",
        "More of Zero is still Zero. Saved you time, money and embarrasment.",
        "Still the reason for any of that is not \"processed industrial garbage\". Eating junk for a month is no different to eating sweets and desserts daily and expect that you stay healthy, you'd still get the same health issues, you need a balanced diet with reduced carbs intake. I know this coz I ate junk for more than a month, without any balance and had to visit a doctor, now I still eat junk without any adverse effects because I maintain a balanced diet. I hope you are smart enough to understand that junk food is inherently not the problem but it's the people who are unable to control eating junk food and have a balanced diet."
    ],
    "cleaned_text": "lawyers india sue lays false advertising new blue lays tastes like fukin rip lays magic masala feels like masala supplier balajis supplier would literally short pepsico india stocks tasting atrocity said new masala magic magic magic anymore written customer care got reply really sad magic lays comfort food causing lot issues mental health rs ka packet used buy used come back work used make feel soo good dont know im going go ahead life fuck pepsico india cant play customers like ",
    "cleaned_title": "lawyers india sue lays false advertising",
    "cleaned_selftext": "new blue lays tastes like fukin rip lays magic masala feels like masala supplier balajis supplier would literally short pepsico india stocks tasting atrocity said new masala magic magic magic anymore written customer care got reply really sad magic lays comfort food causing lot issues mental health rs ka packet used buy used come back work used make feel soo good dont know im going go ahead life fuck pepsico india cant play customers like",
    "cleaned_comments": "lol company literally poisoning people sure sue fitting taste theyre already dreaded lmao stupid obviously sue new masala taste magic really parameter measure taste difference recently made switch pringles im never looking back edit removed rest text praising pringles make look like pringles pr cricket may religion magic masala heart war lays boycott damn bro really feeling hey bright side say theyre bringing back old magic masala back sit tight till ig bhai ke upne alag hi kalesh chalrahe hain sue dont like thats soja bhai yesfirst rule lawsuits sue anybody anywhere anything bro got bit tism causing emotional mental harm yes sue companies individuals may come normal functioning cant someone sued red bull giving wings became millionaire trophy wife always shoot shot wheres magic blue lays really lived long enough becoming villain go big corporations massive legal team itll bunch money going waste would make funny af headline tho start gofundme something youtube law school graduate india bring frivolous law suits india would fined wasting courts time lol people fragile nowadays ad man dont take literally like girls dont chase put axe yeah busy serving people nincompoops choti bacchi ho kya yes everywhere lawsuits never see day court paid way cause cheaper companies pay party go spend time courts worked company paid one individual every year file lawsuit instead changing product specification would cost millions haldirams masala blue one tastes much better screw billion dollar companies home made ones dont lack quality bold assume respond emails remember emailing parle years back never responded back apparently magic masala coming back thanks rant influencer bunshah instagram lays got lot backlash reinstated world please elaborate poisoning part avid lays consumer choose non violent route buy patanjali noodles full magic masala bhai thodi km liya karo dont want criticize bhai bohot cheeze hai life mai karne ke liye aur khane ke liye dont waste time things lets sue nal sue wont win mailed theyll call week said theyll send hamper give feedback product team would try bring back original taste fucking chips causing emotional mental harm envy life dude lays indian flavour good till post ruined pepsico poisoning people beverages already done dude waitno one chases put axe usually ladies chase around quite bit take phone purse full effect axe work give time buddy another years youll get response first world problems third world countries lays manufacturers india lowered standards selling subpar products wasnt guy india sued biscuit packet one biscuit less india misremembering right bud company poisoning people pls elaborate company poisoning people thanks elaborating mate thought going fucking crazy glad im one thinks cum saying longer get original magic masala india cuz get big ass packethttpsimgurcomgalleryrqyz canada might even taste better remember back india win case judge award million dollar settlement million dollars come big suitcase open suitcase ten thousand rupees pokmon tazo ngga lost composure masala everything french fries chips getting tiring like asking noodles indian restaurant doesnt matter hong kong style indonesian taste fuckin bought right magic lays case honor funny see foreigner know india directly linked interest hinduism buddhism didnt know lays end also brahman bro find work taste subjective thing objective may taste better grounds legal case magic promised pigeon packet taste subjective shitty companies surprise companies care bottomline mental health hinges single packet chips bigger things worry id suggest therapist poisoning mean drink sugar specific chemicals killing us first logic every halwai india also killing us drinks cancerous shown toilet cleaner community pringles pr really focussing reddit companies grow try maximise profits making manufacturing simplercheaphomogeneous happened kfc dominos lawsuit billion dollar mammoth developing country billion people job shooting foot id say make insta page something make people aware gain traction sue group go people ask sign petition make yt video thats think bruv season suits made yes felt taste getting like balaji love balaji taste win win liked previous one coming supportive whos loved blue lays since years dont eat lays healthy question much time fight case takes yearsssssssssssss obligation provide chips essential service protected law please dont waste time bro tu lagana bhool gaya assuming op huge amounts time hands lol would never thought file case masala used chips buy bikaji chips best chips rn magic subjective since real definition known usage magic field flavouring chips ill advisedly choose file youll slapped cost likely stop eating lays dude bad health bad damn send europe loll ill pay shipping chips hands whole life wanted sue air sell agree case significant amount company made result day wtf read judiciary india broken sue anyone even u dont proof case get filed probably take years waste whole life prove innocence hope u know pringles arent potato chips read ingredients next time theyre allowed display anything front long back contains ingredient list nutritional info dont think anything okay didnt make sense disliked cheesy cummy taste never ordered pringles since miss lays baked save lawyer money hire therapist instead get grip dude chips people use mental health casually days anything masala gives mental health issues seriously need see doctor actually didnt like previous masala something changed last months love new taste got like packets stock usual industrial processed garbage check ingredients dont know pick gather chemical plant usually glutamate iodine healthy kind spinach oh man right flavor thought baught balaji masala check packet twice hate sweet masala flavor balaji masala old lays magic masala perfect comments shitting op legitimate reasons corporations continue blindly deliver failure product yet supposed deal itthey merciless moneymaking machines would sue everything everyone whim yet supposed sit take itwow theyve selling us air packets since remember yes sue tried well bad well time money sue packet rs chips sure go ahead infinite money glitch bro literally flavour chips used eat theres magic masala want taste yrs back bright sidenow healthier diet thanks shitty tasting chips lol bunshah reminded classmate school went checked insta would sue supporting israel pepsico also funds genocide elaborate poisoning part expert perhaps theyre talking ill effects parmolin oil generally used snacks mean air use like preventing chips breaking oh wait wow devastating news mm goat status company arent using information make money company tell im ready share whats specification want change whats name company lawsuit stop buying let people stop buying theyll reintroduce original taste something happened coke long time ago kar na op maza ayega cause soul friend bingo hashtags spicy masala new blue lays plus touch fucked blue lays big time eat orange lays like normal people lol nothing say repeat ingredients harmful stuff two ingredients said least show something thats actually harmful hating something dont understand ingredients doesnt qualify harmful one hasnt done good realized time switch sides watch world burn thats told yes earlier best lays exact replica balaji wafers blue coloured chips xb hate even legally speaking isnt really false advertisement seriously doubt case would maintainable ten thousand rupees rupee notes came ask post got vote button sparkles around nice look somehow make wan na upvote reason wrote rant lays take back clearly cant lose customer money making product simply change back vendor replicate old flavour new vendor soon stock current production run gets nope even us ridiculous cases successful lawsuits either fake news partial truths mean coming back never stopped coming pretty lame reason suing ask everybody knows advertisements bullcrap first comment get upvotes followup explanation getting downvotes certified reddit moment balajis taste great price per weight ratio abey american ka choddal literally threw last pack couldnt imagine fucked bad also petition stop use pathetic palm oil use indian products countries enjoy products good quality ingredients dont know putting magic masala previously made addicted maybe gov found banned lays change whole recipe always shit thats tasted different literally sodium fat carbs bad kind provide good nutrition body thats common sense love processed garbage much go eat processed foods month check blood test results guarantee worse every metric youtube videos medical professionals whove done always leads worsening metrics cholesterol fat ac etc damage body junk food slow gradual manifests kinds processed food increases insulin resistance theres sudden increase decrease blood glucose repeat many times day badly affects metabolic rate insulin resistance high linked almost diseases like heart poor pancreatic functioning kidney problems poor metabolism obesity etc source idk court admit matter entertain like hasnt done go guess find lawyer register case oh imma mail toofor hamper indian judicial system never designed bring justice people first make money later become humanitarian lawyer fights human rights free fast food man packaged food conveniently available nice needed dont make meal quantities present one packet consumed responsibly anything dangerous consume responsibly overall healthy lifestyle youre couch potato binging junk bigger things worry shit man without divulging company name please tell us spec change talking im curious sue definitely lose oneif didnt land nut judge magic taken literally argue even sane person falls word magic lawyer ask believe tooth fairy santa claus whole court laugh prerogative alter flavour product bought even clearing saying label changed flavour fault lastly lawyers ask ever heard term inflation things go expensive passage time keep price product reduce amount chips product case closed fined wasting time company lawyers ps supreme court advocate hard swallow pills bhai chutiyapa ke disha badh rhe ho smbhal ke really avid lays customer really something adult thought kids like easily fooled colorful packaging seconds sensation tongue damn know balaji thats kinda cooool called first world problems surprised know lays scam percent air chips atleast tastes good magic lays comfort food causing lot issues mental health anyone pin prick bubble source cant technically sue use money therapist instead source likely pepsis bribing government officials take much water places scarce us heres indian one old never stopped think u contracted covid ok research apparently abused instagram pages changed taste laysindia replying magic masala coming back used favourite old dont even know expect lol lawyer unless proper evidences noloophole statements presented either fined wasting court time may sue back good case theyll try sort outside court buying shut mouth pressure indirect blackmail company dark inside works still make stress court dates youll win compensation depending infringement theyll change branding bit keep selling thing remember back lays dhoni brand ambassador dark blue flavour launched stopped producing years ago im wrong apart mental health also take care physical health avoid lays kind junk food altogether sue exactly reasonable person would expect actual magic chips lays decided change recipe right cant anything make whatever recipes want long follow health safety guidelines choice wanted change flavor theres case claim thing buy products thats pretty much mean basically saying wan na sue dont like taste btw extremely subjective frivolous lawsuit like wouldnt shit even country like us filings lawsuits suing companies lot easier let alone india p nal ranting magic masala reminds masala jazz kaala paani agree op want get paid like green lays someone explain issue sue exactly think chance get lays addiction mail kya likhu ye batao hamper mai bhi leke rahunga green one favourite coincidence varun beverages limited master franchisee pepsico india single session today chile lemon gud iodine healthy kind spinach aise toh bhai use every company india like kissan hindustan unilever limited many lets go bad like mix lighter blue lays bit chilli lemon green although understand would absolutely hate mrs also hates new one hope coexist blue cream onion lays fav best advice mentally disturbed chips underlying issues first world man yeah arent indian talking ate confirm thrice wasnt balaji kyu kyu kyu unpopular opinion yellow orange green blue lays bruh eat enough quantities starts tasting like vim liquid ive ever tasted vim somehow always get feeling still tasty though look past damn influencers really good influencing public opinion writes possible business promotion strategy magic air packets makes feel nothing inside lol imagine stress free company changing chips flavour causes emotional distress words chelsea peretti men used go wars feel like buy bigger pack one wont give affect haa pls btao na asking frnd happy cake day bud haha ask chatgpt thats ask best fraind chatgpt helped sure tell replied thanks man calculated estimate curiosity itll cost cad canada post lol basic difference lies smell farts eating zero still zero saved time money embarrasment still reason processed industrial garbage eating junk month different eating sweets desserts daily expect stay healthy youd still get health issues need balanced diet reduced carbs intake know coz ate junk month without balance visit doctor still eat junk without adverse effects maintain balanced diet hope smart enough understand junk food inherently problem people unable control eating junk food balanced diet",
    "light_cleaned_title": "Lawyers of India, can I sue lays for false advertising ?",
    "light_cleaned_selftext": "The new blue lays tastes like a fukin rip off of lays magic masala, if feels like their masala supplier is the same as balaji's supplier, I would literally short PepsiCo India stocks after tasting this atrocity. They have said 'new masala, more magic' there is no magic in it, the magic that was there is not there anymore, I have written to their customer care and I have not got any reply. This is really sad, magic lays was a comfort food and this is causing a lot of issues to my mental health. 10rs ka packet I used to buy when I used to come back from work and it used to make me feel soo good. I don't know how I'm going to go ahead in life. FUCK YOU PEPSICO INDIA, You can't play with your customers like this.",
    "light_cleaned_comments": "Lol, this company is literally poisoning people. Sure. Sue them for not fitting your taste, they're already dreaded Lmao that is so stupid, obviously you cannot sue them for it. New Masala Can Taste the same, Magic is really no parameter to measure taste in difference. I just recently made the switch to pringles, and I'm never looking back. Edit: removed the rest of text praising pringles to not make it look like I am pringles PR. Cricket may be a religion, but Magic Masala is our heart. To war with Lays! Boycott them! damn bro, you really do be feeling it 😭 hey, on the bright side, they did say they're bringing back the old magic masala back so you can just sit tight till then ig? Bhai ke upne alag hi kalesh chalrahe hain. \"Sue\" them for what? You don't like it, that's why? Soja bhai 🤣 Yes.first rule of lawsuits. You can sue anybody anywhere for anything. Bro got a bit of 'tism It's causing emotional and mental harm, so yes. If they can sue companies and individuals that may come in their normal functioning why can't we Someone sued Red Bull for not giving them wings and they became a millionaire with a trophy wife. As always, shoot your shot - *where’s the magic?* Blue lays really lived long enough to becoming a villain Go for it but big corporations have a massive legal team and it'll just be a bunch of money going to waste. Would make for a funny af headline tho Start a gofundme or something. Youtube Law School graduate over here Not in India. If you bring frivolous law suits in India, you would be fined for wasting courts time. Lol People are so fragile nowadays It's ad man, don't take it literally just like girls don't chase you when you put on axe 🤣🤣🤣 Yeah because they are very busy serving people. nincompoops Choti bacchi ho kya? Yes. It’s same everywhere. Most lawsuits never see a day in court. They are paid off way before cause it’s cheaper for companies to pay off the party than go spend their time in courts. I worked with a company who paid off one individual every year just not to file a lawsuit instead of changing a product specification which would have cost millions. Haldiram's masala (blue one) tastes same and is much better, screw these billion dollar companies and have our own home made ones. They don't lack in quality now. Bold of you to assume that they respond to emails. I remember emailing to Parle 1-2 years back and they never responded back. Apparently Magic masala is coming back thanks to the rant that an influencer Bunshah had on Instagram. Lays got a lot of backlash and now it’s being reinstated 😂 what a world Can you please elaborate on poisoning part. I am avid lays consumer Choose the non violent route, buy Patanjali noodles, it's full of magic masala. Bhai thodi km liya karo Don't want to criticize, but bhai bohot cheeze hai life mai karne ke liye aur khane ke liye. Don't waste your time on these things. Let's Sue them too!!! NAL. You can sue, but you won't win. I too mailed them, they'll call you in a week. They said they'll send a hamper, give feedback to the product team and would try to bring back the original taste. If it is fucking chips that causing you emotional and mental harm, i envy your life dude Lays Indian flavour was good till 2010, post that they ruined it. Pepsico is poisoning people with their beverages. It's already done dude - Wait..no one chases your after you put on axe? Usually the ladies chase me around quite a bit (you have to take their phone or their purse for the full effect of axe to work) Give it time buddy. Another 3 years or so, you'll get your response. First world problems in third world countries It's not just lays. All manufacturers in India have lowered their standards and are selling subpar products Wasn't there a guy in India who sued because his biscuit packet had one biscuit less? Was this in India or am I misremembering? You are right bud... \"This company is poisoning people\" \"Pls elaborate\" \"This company is poisoning people\" Thanks for elaborating mate I thought I was going fucking crazy. Glad I'm not the only one who thinks this is off. Cum* Are you saying that you can no longer get the original magic masala in India now? Cuz I can get [this big ass packet](https://imgur.com/gallery/r7qy9z9) in Canada. It might even taste better than what I remember from back in India. You will win the case and judge will award you million dollar settlement. The million dollars will come in a big suitcase. But you open the suitcase it’s just ten thousand rupees in there, and a Pokémon tazo. \"This n\\*gga has lost his composure\" That same masala is on everything French fries chips getting tiring. It’s like asking for noodles at an Indian restaurant doesn’t matter if it’s Hong Kong style or Indonesian they all taste the fuckin same You bought it right! That was the magic! I Lays my case your honor! Funny to see this as a foreigner. All I know about India is directly linked to my interest in Hinduism and Buddhism. Didn't know they are lays. But in the end it's also brahman. 😅 Bro find some work Taste is a subjective thing not objective, it may taste better to some, no grounds for a legal case what magic they promised? pigeon out of packet? /s But... Taste is subjective While it's shitty of companies to do this (no surprise, companies only care about their bottomline), if your mental health hinges on a single packet of chips, you have bigger things to worry about. I'd suggest a therapist. And by poisoning, do you mean their drink has sugar? Or some specific chemicals that are killing us? Because by the first logic, every halwai in India is also killing us. The drinks are cancerous, as shown by the toilet cleaner community Pringles PR really focussing on Reddit. As companies grow they try to maximise profits by making manufacturing simpler/cheap/homogeneous it is same as to what happened with kfc and dominos. Lawsuit against a billion dollar mammoth that too in a \"developing\" country of 1.3 billion people, with your job will be shooting on foot. I'd say make a insta page or something to make people aware as it will gain traction sue them as a group, you can go to people and ask them to sign a petition about that and make a yt video out of it. That's all i can think of now. Bruv, what season of SUITS made you to do this ? Yes i felt the taste getting same like Balaji too. I love the Balaji taste so it was a win win for me I liked this more than the previous one. This is coming from supportive who's loved blue lays since 15 years if not more Don't eat lays. Not healthy at all! My question is how much time do you have to fight a case, it takes yearsssssssssssss They are under no obligation to provide you with chips. This is not an essential service protected by law. Please don't waste your time. bro tu /s lagana bhool gaya I am assuming OP has huge amounts of time in his hands.... Lol I would have never thought to file a case on masala used in chips. Buy bikaji chips, they are best chips rn out there No. “More magic” is subjective, since there is no real definition / known usage of “magic” in the field of flavouring for chips. If you do ill -advisedly choose to file, you’ll be slapped with cost most likely. Stop eating lays dude. Very bad for health !! My bad 🥲 Damn can you send me some to Europe loll I’ll pay for shipping and the chips *on his hands Whole my life, I wanted to Sue them for the air they sell Agree The case had a significant amount the company made as a result each day. Wtf did I just read.. 🤦‍♂️ The Judiciary in India is so broken , you can sue anyone even if u don't have any proof as the case to get filed will probably take 100 years and waste your whole life to just prove your innocence. Hope u know Pringles aren't 'potato chips'. Read the ingredients next time. they're allowed to display anything in the front as long as the back contains the ingredient list and nutritional info. so i dont think you can do anything about it. Okay. That didn’t make any sense! what are they then? Disliked the cheesy cummy taste and have never ordered pringles since i miss lays baked Save the lawyer money and hire a therapist instead. Get a grip dude these are just some chips. People use mental health so casually these days with anything. If some masala gives you mental health issues then you seriously need to see some doctor. I actually didn't like the previous masala but something changed in the last few months and I love the new taste! I got like 20 packets in stock The usual industrial processed garbage, Check the ingredients, if you don't know where to pick or gather it, it's from a chemical plant. Usually glutamate, iodine (not the healthy kind from spinach ;)) and so on... Oh man you are right about the flavor, I thought I baught Balaji Masala and had to check the packet twice. I hate that sweet masala flavor of balaji masala. Old lays magic masala was perfect. All the comments shitting on op for no legitimate reasons. These corporations continue to blindly deliver a failure of a product and yet we are supposed to just deal with it?They are merciless moneymaking machines who would sue everything and everyone on a whim yet we are supposed to just sit there and take it?wow They've been selling us air packets since I remember. Yes, sue them. I tried this as well it’s bad Well, if you have the time and money to sue them over a packet of Rs 10 chips, then sure, go ahead. infinite money glitch Same bro…… Its literally the only flavour of chips I used to eat. there’s no more magic in the masala, just want the taste that was there 5yrs back. But on the bright side…now I have a healthier diet thanks to their shitty tasting chips. Lol, Bunshah reminded me of my classmate from school so I went and checked his insta... It was him only 🤣 I would sue them for supporting israel. PepsiCo also funds genocide >elaborate on poisoning part. Not an expert, but perhaps they're talking about the I'll effects of the parmolin oil generally used in such snacks I mean the air has use like... Preventing chips from breaking. Oh wait... Wow devastating news, mm was goat status Which company? Why aren't you using this information to make money from that company ? Tell me and I'm ready to share a %! What's the specification and what did he want to change it to?????? And what's the name of the company? Why lawsuit? Stop buying, let people stop buying. They'll reintroduce the original taste then. Something that had happened with coke a long time ago. Kar na OP.. maza ayega. Cause I have a soul my friend. Bingo Hashtags : Spicy Masala is the new blue lays. Plus, touché, they fucked up blue lays big time Just eat orange lays like normal people. Lol, have nothing to say and all you do is repeat ingredients? Where is the harmful stuff in the two ingredients you said? at least show something that's actually harmful. Hating something because you don't understand ingredients doesn't qualify it as harmful. I have one too. It hasn't done me any good. I have realized it's time to switch sides and watch the world burn :D That's what you have been told 😂 yes, earlier this was the best lays now it is the exact replica of balaji wafers blue coloured chips &#x200B; hate it too Even legally speaking this isn't really a false advertisement, I seriously doubt that this case would be maintainable. Ten thousand rupees in 1000 rupee notes I came here just to ask how did this post got up vote button with sparkles around them nice look somehow make me wanna upvote for no reason.... I wrote this on some other rant on lays that they will take it back. They clearly can't lose the customer as it's a money making product. They will simply change back to the other vendor or replicate the old flavour with a new vendor as soon as the stock for the current production run gets over. Nope. Not even in US. Most ridiculous cases of successful lawsuits are either fake news or partial truths. What do you mean by its coming back? It never stopped coming Pretty lame reason for suing, if you ask me. Everybody knows that advertisements are bullcrap. Why did your first comment get more than 100 upvotes and this followup explanation is getting downvotes? Certified Reddit moment. Balajis taste is great for the price per weight ratio abey american ka choddal! 😂 I literally threw the last pack couldn't imagine how they fucked it up so bad. There should be also a petition to stop use of pathetic palm oil use in all Indian products why do other countries enjoy products with good quality ingredients. you dont know what they were putting in the magic masala previously which made you addicted. maybe gov found out and banned it so lays had to change their whole recipe. It's always been shit. That’s why it tasted so different! It’s literally just sodium, fat and carbs. And the bad kind. They provide no good nutrition to the body. That’s common sense. If you love processed garbage so much, go eat only processed foods for a month. And check your blood test results before and after. I guarantee you it will be worse in every metric. There youtube videos about medical professionals who’ve done it and it always leads to worsening of all metrics such as cholesterol, fat, a1c, etc And the damage to the body from junk food is slow but gradual so it manifests after 30s and 40s. And ALL kinds of processed food increases insulin resistance because there’s a sudden increase and decrease in blood glucose. You repeat that many times in a day, and it badly affects metabolic rate. Insulin resistance being high is linked with almost all diseases like heart, poor pancreatic functioning, kidney problems, poor metabolism, obesity, etc. Source : Idk which court will admit the matter and entertain it, but it’s not like it hasn’t been done before- So go off I guess, find a lawyer and register the case Oh Imma mail them too(for the hamper) because indian judicial system was never designed to bring justice FOR people. First make money and later become a Humanitarian lawyer who fights for human rights for free 😂🤣. It's fast food man, you have packaged food conveniently available. Nice to have when needed, don't make a meal out of it? The quantities present in one packet, consumed responsibly should not do anything dangerous to you. Consume responsibly and have an overall healthy lifestyle. If you're a couch potato binging on junk, there are bigger things to worry about. It’s shit now man Without divulging company name, can you please tell us what spec or change we're talking about here? I'm so curious You can sue but you will definitely lose this one(if it didn't land with a nut judge). 1. Magic should not be taken literally, they will argue that are you even a sane person who falls for the word magic? Their lawyer will ask you if you believe in tooth fairy and Santa Claus and the whole court will laugh. 2. It's their prerogative to alter the flavour of their product, and it was you who bought it even after clearing saying through their label that it was a changed flavour. Your fault, not theirs. 3. Then lastly their lawyers will ask you if you have ever heard the term inflation?? That things go expensive with passage of time and so to keep the price of the product same they reduce the amount of chips in each product. Case closed, you can be fined with wasting the time of company and its lawyers. PS- am a supreme court advocate. Hard to swallow pills ;) Bhai chutiyapa ke disha me badh rhe ho, smbhal ke. But really, is \"being an avid lays customer\" really something to be for an adult? I thought it's only kids who are like that... easily fooled by colorful packaging and 5 seconds of sensation on the tongue... Damn you know Balaji? That's kinda cooool. This is what is called first world problems! You will be surprised to know that Lays in itself is a scam .90 percent air and 10% chips. Atleast it tastes good. > Magic lays was a comfort food and this is causing a lot of issues to my mental health Does anyone have a pin to prick this bubble? Source ? You cant technically sue over this. Use that money for a therapist instead Source? Most likely Pepsi’s bribing government officials to take too much water from places where it’s scarce. They do this in the US too here’s an Indian one, old but they never stopped. i think u have contracted COVID (again?) Ok I did some research and apparently when abused on Instagram pages on why they changed the taste laysindia is replying that the magic masala is coming back they used your favourite and not old so I don't even know what to expect lol NOT A LAWYER! Unless you have proper evidences and no-loophole statements presented, you will either be fined for wasting court time or they may sue you back. If you have a good case, 1. They'll try to sort this outside the court by buying you to shut your mouth 2. Pressure you by indirect \"blackmail\" (if the company is a dark on the inside works 3. If you still make it out of all that stress and court dates, you'll win compensation depending on the infringement and they'll just change the branding a bit and keep selling the same thing. I remember back when lays had Dhoni as its brand ambassador that the dark blue flavour was launched. They stopped producing it years ago if I'm not wrong. Apart from mental health you should also take care of your physical health and avoid LAYS kind of junk food altogether. :) Sue them for what exactly? No reasonable person would expect there to be actual magic in the chips. And Lay's decided to change their recipe, it's their right, you can't do anything about it. They can make whatever recipes they want, as long as they follow the health & safety guidelines, it's their choice. They wanted to change their flavor, they did. There's no case or claim here. The only thing you can do is not buy their products. And that's pretty much it. I mean, what you are basically saying is that you wanna sue them because you don't like the taste of their, which, btw, is extremely subjective. A frivolous lawsuit like this wouldn't do shit even in a country like US where filings lawsuits & suing companies is a lot easier, let alone in India. P. S. - NAL All this ranting about Magic Masala reminds me about Masala Jazz from Kaala Paani but I agree with you OP You want to get paid I only like green lays so can someone explain what the issue is here? Sue them for what exactly? Think of this as a chance to get out of your lays addiction. mail me kya likhu ye batao , hamper to mai bhi leke rahunga Green one is my favourite Just a coincidence, that varun beverages limited, the master franchisee of pepsico in India is 4.82% in a single session today 🤣 chile lemon be gud > iodine (not the healthy kind from spinach ?? aise toh bhai you can use every other company in India, like Kissan, Hindustan Unilever Limited, many more Let's go They are not that bad. Its like a mix of lighter blue lays and a bit of chilli lemon from green. Although i understand why some would absolutely hate it, my mrs also hates the new one. I hope both can co-exist Blue and Cream and Onion lays fav This is the best advice. If you are mentally disturbed because of chips, then there are some other underlying issues here. We're first world, my man Yeah why aren't Indian talking about this! I ate this and had to confirm thrice that I wasn't Balaji. Kyu kyu kyu Unpopular Opinion: Yellow >>> Orange >>> Green >>> Blue Lays Bruh, you eat it in enough quantities it starts tasting like VIM liquid, not that I've ever tasted VIM but I somehow always get that feeling. Still tasty though, if I look past it. Damn , influencers are really good at influencing public opinion (writes down possible business promotion strategy) The only magic is the air in the packets that makes you feel that nothing is inside Lol. Imagine being so stress free that some company changing its chips flavour causes you emotional distress. In the words of Chelsea Peretti, \"Men used to go to wars\". i feel like that if i buy a bigger than 20 pack but the 20 one wont give that affect haa pls btao na (asking for a frnd) happy cake day bud! Haha ask ChatGPT.. That's what I did. Ask your best frAInd ChatGPT. He helped me too. Sure, tell me what they replied. thanks man 🍻 I calculated an estimate just out of curiosity. It'll cost about 90 CAD through Canada Post lol. The very basic difference lies in the smell of the farts after eating both. More of Zero is still Zero. Saved you time, money and embarrasment. Still the reason for any of that is not \"processed industrial garbage\". Eating junk for a month is no different to eating sweets and desserts daily and expect that you stay healthy, you'd still get the same health issues, you need a balanced diet with reduced carbs intake. I know this coz I ate junk for more than a month, without any balance and had to visit a doctor, now I still eat junk without any adverse effects because I maintain a balanced diet. I hope you are smart enough to understand that junk food is inherently not the problem but it's the people who are unable to control eating junk food and have a balanced diet."
}