{
    "id": "15w7vm3",
    "title": "Civil engineers over here: Why do metro pillars have this shape on top? Lego?",
    "url": "https://i.redd.it/wyuuwvx6s8jb1.jpg",
    "selftext": "See these Lego style protrusions on all pillar tops. Are they for future extensions? Doesn't look like such a small protrusion can actually have structural integrity. If not what are these for?",
    "flair": "AskIndia",
    "score": 196,
    "num_comments": 42,
    "created_utc": 1692527153.0,
    "convurl": "https://i.redd.it/wyuuwvx6s8jb1.jpg",
    "comments": [
        "They are points for pre-tensioning rebar most likely.\nWhen the tops are poored the use to tension the rebar to give it added strength. Concrete is very strong under compression. But isnt flexible. This tensioning is to make it more ridgit.",
        "[https://youtu.be/cZINeaDjisY](https://youtu.be/cZINeaDjisY)\n\n  \n\n\nPractical Engineering has a great explainer on how prestressed concrete works!",
        "Proof of material in physical audit.",
        "The other side would possibly have a hole and so they fit into it in case they have to connect it to the next part. Just like legos I guess",
        "Don’t get into teaching ever because you can’t convey a point properly to a lay audience. Nobody knows what you meant because we are not civil engineers.",
        "Samajh me nahi aaya but sun ke accha laga",
        "The girders (beams)  that the pier has to support are wideand so the top of the pier has to be extend out resulting in the pier being a T-shaped structure.\n\nThe top arms of the pier bend down due to the weight of the girder above, which results in tensile stressed at the top of the arms. Concrete has a lot of strength in compression but virtually none in tension, so we try to compensate for this difference by putting steel wires inside the top arms of the pier. The steel is then stretched and its stretched ends are attached to the end of the arms, which is what these protruding elements are. There are steel wires that are anchored to the concrete there. The steel can rust when exposed to the atmosphere, so it is covered by concrete or grout and that forms these protrusions.",
        "> This tensioning is to make it more ridgit.\n\nThat's isn't really the reason for prestressing the element. It's not rigidity but compensation of lack of tensile strength in concrete that necessitates the use of prestressing. It also make the element overall more elastic.\n\n> The rebar that is bend on top is just very sloppy and should have been cut off..\n\nIt isn't just sloppy, it is disastrous. It will lead to durability issues as rusting occurs at the base of the exposed rebar which will result in expansion of the rusted portion which will locally crack the concrete, leading to further exposure. All this near the anchorage of the prestressing cables! This pier won't last long.",
        "Read about prestressed concrete. In short each part of the bridge is casted elsewhere. It is simply carried, hoisted, leveled and steel bars are passed through these holes which are pulled on each side to put them in tensile state and then the holes are filled with concrete. This is the way different parts are joined together to form the section of the bridge.",
        "So from what I understand, that's prestressed concrete and those protrusions come from when new steel is added to prestressed blocks with new concrete?",
        "I hope they covee them up. For the purpose of making it less difficult to understand, it was a bit toned down. Pretensioning lets you get away with a smaller structure while maintaining the same strenght and as you said even more elastic.. I not a civil engineer so i wouldnt know the exact calculations or object propertys..",
        "Maybe it still needs to be verified. But i doubt it. Either its unfinished or someone made a booboo..",
        "There is a difference  between pre-fab and pre-stressed. And yes pre fab can be pre-stressed. But see it more in the term of the rebar has some form of tension put on it, instead of just plain rebar.",
        "What is wrong with this generation, everyone wants YouTube education where shit is dumbed down for the convenience of its stupid consumers",
        "Read “Built” by Roma Agrawal. Explains construction of structures in a very plain and interesting language. From the previous ages to modern structures.",
        "eli5? dude I understood very little",
        "This one.",
        "Imagine a horizontal concrete beam supported in the center by a pillar and forming a T.  The ends of the horizontal concrete beam weigh down, which means the top portion of the beam is in \"tension\" being pulled apart, and the bottom portion of the beam is in \"compression\" being pushed together.  Concrete handles compression very well, but tension, not so very well or not at all.  So they put steel rods - the \"reinforcement\" in RCC (reinforced cement concrete).  Steel can handle tension very well.  So steel is added where the concrete is likely to give away due to compression to reinforce.",
        "Thanks for explaining. What are those lego-head like protrusions visible on the side of the beam?",
        "looks like psc cap",
        "Here's a quick sketch I did: https://imgur.com/a/zZhES2u\n\nIt is not ELI5 really, but it is the best I can do without making a video about it.",
        "Post tensioning tendons. Basically these are tubes of steel cables which are tensioned. These help in slimming the structures while also providing long term protection against cracks",
        "MVP right here",
        "I have always wondered about this. Great question",
        "Amazing, thanks!",
        "I can explain but you won't understand half of it.\n\nIn short it's pre tensioned so it can have more strength.",
        "Which specific part are you refering to? The large horizontal spans that carries the trains are called girders. The pillar holding it up is called a pier. The T shaped head at the top of the pier is called a pier cap. The 6 knob like things are steel rebars. They run through the girders too. Without them, the concrete will break.\n\nThe two square shaped thingy at the top of the pier cap holding the girder up are provided to allow for thermal expansion of the girders. If you notice closely, you can see there is a pad like thing between them and the girder. Those are called elastomeric bearing pads, a type of specially made synthetic rubber pad which buckles (but doesn't tear) when the girder expands, and returns to original shape when it cools down. Without them the two pieces of concrete will shred each other to bits.\n\nConcrete and steel have almost same thermal co-efficient or else this thing wouldn't have been possible.",
        "😆\n\nLol\n\nI am also graduated from civil btech",
        "The pillars are constructed separately and the slab deck on which the vehicle ply is constructed on ground and later lifter through crane.\nNow that lego like structure is where the two are connected.",
        "ye sab kya dekhna pad raha hai.... \n\nAcha hai main andha hoon..",
        "To hang Modiji's photos",
        "Understood quite a bit. Thanks!",
        "Those protrusions are a concrete covering of the wires and anchor plate visible in the third image in the gallery I shared above.",
        "Power on Button, reset button, the others will glow up evertime metro passes by..",
        "This is post stressed concrete though.",
        "This is post stressed concrete.",
        "I don't think so. Those 4-5 big metal things are pulled to stress and then concrete is poured. I can be wrong though",
        "Think about it structurally. What is holding the tension before concrete is poured? Other than the steel/pvc tube, it's just air. And we're talking about tons worth of tension.\n\nOnce concrete is set, tensioning jacks tension the steel cables and then are tied and capped off. The concrete is able to support the tension. The end caps are what is pictured in the photo.",
        "But this is post tensioned concrete.\n\nAnd they are not bars. They are steel wires (similar to coiled wire used in lifts). Once concrete is set, jacks are used to tension wires, then they are capped off, and if required, grouted too.",
        "This is the correct answer. Those saying pre stressed concrete are wrong.",
        "Yup!\n\nInstead of Bars you can use wires too.",
        "If you want to extend the flyover on either side, those will work as locks. The additional flap will have holes. Did you notice they didn't cut those steel bars?",
        "Actually a post-stressed concrete. But the same principle as prestressed. The idea is to apply tension to the rebars so they can handle more bending ( moments).",
        "The actual technical term is post-tensioned.\n\nPrestressed concrete comes in two forms: post-tensioned and pre-tensioned. And they use wires for tension, not rebar, which wouldn't work due to several reasons.",
        "This is the right answer."
    ],
    "cleaned_text": "civil engineers metro pillars shape top lego see lego style protrusions pillar tops future extensions doesnt look like small protrusion actually structural integrity ",
    "cleaned_title": "civil engineers metro pillars shape top lego",
    "cleaned_selftext": "see lego style protrusions pillar tops future extensions doesnt look like small protrusion actually structural integrity",
    "cleaned_comments": "points pretensioning rebar likely tops poored use tension rebar give added strength concrete strong compression isnt flexible tensioning make ridgit httpsyoutubeczineadjisyhttpsyoutubeczineadjisy practical engineering great explainer prestressed concrete works proof material physical audit side would possibly hole fit case connect next part like legos guess dont get teaching ever cant convey point properly lay audience nobody knows meant civil engineers samajh nahi aaya sun ke accha laga girders beams pier support wideand top pier extend resulting pier tshaped structure top arms pier bend due weight girder results tensile stressed top arms concrete lot strength compression virtually none tension try compensate difference putting steel wires inside top arms pier steel stretched stretched ends attached end arms protruding elements steel wires anchored concrete steel rust exposed atmosphere covered concrete grout forms protrusions tensioning make ridgit thats isnt really reason prestressing element rigidity compensation lack tensile strength concrete necessitates use prestressing also make element overall elastic rebar bend top sloppy cut isnt sloppy disastrous lead durability issues rusting occurs base exposed rebar result expansion rusted portion locally crack concrete leading exposure near anchorage prestressing cables pier wont last long read prestressed concrete short part bridge casted elsewhere simply carried hoisted leveled steel bars passed holes pulled side put tensile state holes filled concrete way different parts joined together form section bridge understand thats prestressed concrete protrusions come new steel added prestressed blocks new concrete hope covee purpose making less difficult understand bit toned pretensioning lets get away smaller structure maintaining strenght said even elastic civil engineer wouldnt know exact calculations object propertys maybe still needs verified doubt either unfinished someone made booboo difference prefab prestressed yes pre fab prestressed see term rebar form tension put instead plain rebar wrong generation everyone wants youtube education shit dumbed convenience stupid consumers read built roma agrawal explains construction structures plain interesting language previous ages modern structures eli dude understood little one imagine horizontal concrete beam supported center pillar forming ends horizontal concrete beam weigh means top portion beam tension pulled apart bottom portion beam compression pushed together concrete handles compression well tension well put steel rods reinforcement rcc reinforced cement concrete steel handle tension well steel added concrete likely give away due compression reinforce thanks explaining legohead like protrusions visible side beam looks like psc cap heres quick sketch eli really best without making video post tensioning tendons basically tubes steel cables tensioned help slimming structures also providing long term protection cracks mvp right always wondered great question amazing thanks explain wont understand half short pre tensioned strength specific part refering large horizontal spans carries trains called girders pillar holding called pier shaped head top pier called pier cap knob like things steel rebars run girders without concrete break two square shaped thingy top pier cap holding girder provided allow thermal expansion girders notice closely see pad like thing girder called elastomeric bearing pads type specially made synthetic rubber pad buckles doesnt tear girder expands returns original shape cools without two pieces concrete shred bits concrete steel almost thermal coefficient else thing wouldnt possible lol also graduated civil btech pillars constructed separately slab deck vehicle ply constructed ground later lifter crane lego like structure two connected ye sab kya dekhna pad raha hai acha hai main andha hoon hang modijis photos understood quite bit thanks protrusions concrete covering wires anchor plate visible third image gallery shared power button reset button others glow evertime metro passes post stressed concrete though post stressed concrete dont think big metal things pulled stress concrete poured wrong though think structurally holding tension concrete poured steelpvc tube air talking tons worth tension concrete set tensioning jacks tension steel cables tied capped concrete able support tension end caps pictured photo post tensioned concrete bars steel wires similar coiled wire used lifts concrete set jacks used tension wires capped required grouted correct answer saying pre stressed concrete wrong yup instead bars use wires want extend flyover either side work locks additional flap holes notice didnt cut steel bars actually poststressed concrete principle prestressed idea apply tension rebars handle bending moments actual technical term posttensioned prestressed concrete comes two forms posttensioned pretensioned use wires tension rebar wouldnt work due several reasons right answer",
    "light_cleaned_title": "Civil engineers over here: Why do metro pillars have this shape on top? Lego?",
    "light_cleaned_selftext": "See these Lego style protrusions on all pillar tops. Are they for future extensions? Doesn't look like such a small protrusion can actually have structural integrity. If not what are these for?",
    "light_cleaned_comments": "They are points for pre-tensioning rebar most likely. When the tops are poored the use to tension the rebar to give it added strength. Concrete is very strong under compression. But isnt flexible. This tensioning is to make it more ridgit. [https://youtu.be/cZINeaDjisY](https://youtu.be/cZINeaDjisY) Practical Engineering has a great explainer on how prestressed concrete works! Proof of material in physical audit. The other side would possibly have a hole and so they fit into it in case they have to connect it to the next part. Just like legos I guess Don’t get into teaching ever because you can’t convey a point properly to a lay audience. Nobody knows what you meant because we are not civil engineers. Samajh me nahi aaya but sun ke accha laga The girders (beams) that the pier has to support are wideand so the top of the pier has to be extend out resulting in the pier being a T-shaped structure. The top arms of the pier bend down due to the weight of the girder above, which results in tensile stressed at the top of the arms. Concrete has a lot of strength in compression but virtually none in tension, so we try to compensate for this difference by putting steel wires inside the top arms of the pier. The steel is then stretched and its stretched ends are attached to the end of the arms, which is what these protruding elements are. There are steel wires that are anchored to the concrete there. The steel can rust when exposed to the atmosphere, so it is covered by concrete or grout and that forms these protrusions. > This tensioning is to make it more ridgit. That's isn't really the reason for prestressing the element. It's not rigidity but compensation of lack of tensile strength in concrete that necessitates the use of prestressing. It also make the element overall more elastic. > The rebar that is bend on top is just very sloppy and should have been cut off.. It isn't just sloppy, it is disastrous. It will lead to durability issues as rusting occurs at the base of the exposed rebar which will result in expansion of the rusted portion which will locally crack the concrete, leading to further exposure. All this near the anchorage of the prestressing cables! This pier won't last long. Read about prestressed concrete. In short each part of the bridge is casted elsewhere. It is simply carried, hoisted, leveled and steel bars are passed through these holes which are pulled on each side to put them in tensile state and then the holes are filled with concrete. This is the way different parts are joined together to form the section of the bridge. So from what I understand, that's prestressed concrete and those protrusions come from when new steel is added to prestressed blocks with new concrete? I hope they covee them up. For the purpose of making it less difficult to understand, it was a bit toned down. Pretensioning lets you get away with a smaller structure while maintaining the same strenght and as you said even more elastic.. I not a civil engineer so i wouldnt know the exact calculations or object propertys.. Maybe it still needs to be verified. But i doubt it. Either its unfinished or someone made a booboo.. There is a difference between pre-fab and pre-stressed. And yes pre fab can be pre-stressed. But see it more in the term of the rebar has some form of tension put on it, instead of just plain rebar. What is wrong with this generation, everyone wants YouTube education where shit is dumbed down for the convenience of its stupid consumers Read “Built” by Roma Agrawal. Explains construction of structures in a very plain and interesting language. From the previous ages to modern structures. eli5? dude I understood very little This one. Imagine a horizontal concrete beam supported in the center by a pillar and forming a T. The ends of the horizontal concrete beam weigh down, which means the top portion of the beam is in \"tension\" being pulled apart, and the bottom portion of the beam is in \"compression\" being pushed together. Concrete handles compression very well, but tension, not so very well or not at all. So they put steel rods - the \"reinforcement\" in RCC (reinforced cement concrete). Steel can handle tension very well. So steel is added where the concrete is likely to give away due to compression to reinforce. Thanks for explaining. What are those lego-head like protrusions visible on the side of the beam? looks like psc cap Here's a quick sketch I did: It is not ELI5 really, but it is the best I can do without making a video about it. Post tensioning tendons. Basically these are tubes of steel cables which are tensioned. These help in slimming the structures while also providing long term protection against cracks MVP right here I have always wondered about this. Great question Amazing, thanks! I can explain but you won't understand half of it. In short it's pre tensioned so it can have more strength. Which specific part are you refering to? The large horizontal spans that carries the trains are called girders. The pillar holding it up is called a pier. The T shaped head at the top of the pier is called a pier cap. The 6 knob like things are steel rebars. They run through the girders too. Without them, the concrete will break. The two square shaped thingy at the top of the pier cap holding the girder up are provided to allow for thermal expansion of the girders. If you notice closely, you can see there is a pad like thing between them and the girder. Those are called elastomeric bearing pads, a type of specially made synthetic rubber pad which buckles (but doesn't tear) when the girder expands, and returns to original shape when it cools down. Without them the two pieces of concrete will shred each other to bits. Concrete and steel have almost same thermal co-efficient or else this thing wouldn't have been possible. 😆 Lol I am also graduated from civil btech The pillars are constructed separately and the slab deck on which the vehicle ply is constructed on ground and later lifter through crane. Now that lego like structure is where the two are connected. ye sab kya dekhna pad raha hai.... Acha hai main andha hoon.. To hang Modiji's photos Understood quite a bit. Thanks! Those protrusions are a concrete covering of the wires and anchor plate visible in the third image in the gallery I shared above. Power on Button, reset button, the others will glow up evertime metro passes by.. This is post stressed concrete though. This is post stressed concrete. I don't think so. Those 4-5 big metal things are pulled to stress and then concrete is poured. I can be wrong though Think about it structurally. What is holding the tension before concrete is poured? Other than the steel/pvc tube, it's just air. And we're talking about tons worth of tension. Once concrete is set, tensioning jacks tension the steel cables and then are tied and capped off. The concrete is able to support the tension. The end caps are what is pictured in the photo. But this is post tensioned concrete. And they are not bars. They are steel wires (similar to coiled wire used in lifts). Once concrete is set, jacks are used to tension wires, then they are capped off, and if required, grouted too. This is the correct answer. Those saying pre stressed concrete are wrong. Yup! Instead of Bars you can use wires too. If you want to extend the flyover on either side, those will work as locks. The additional flap will have holes. Did you notice they didn't cut those steel bars? Actually a post-stressed concrete. But the same principle as prestressed. The idea is to apply tension to the rebars so they can handle more bending ( moments). The actual technical term is post-tensioned. Prestressed concrete comes in two forms: post-tensioned and pre-tensioned. And they use wires for tension, not rebar, which wouldn't work due to several reasons. This is the right answer."
}