{
    "id": "14yfw5a",
    "title": "Be a Liberal not a fake liberal/andhbhakt ig",
    "url": "https://youtu.be/3YVL5UxYppw",
    "selftext": "Honestly speaking I was kind off fake liberal before watching this video, it opened my eyes. Before I felt very outrageous after someone bad mouthing Gandhiji (I was also outraged how they chose the words, horrendous). \n\nI recommend everyone to watch this video and yea never forget the great things he did for the our nation.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1689240060.0,
    "convurl": "https://external-preview.redd.it/F2n4_yBu7cUGBUmEwD9gcIPIAzIIXW5xeS8rYDIjflw.jpg?auto=webp&s=0af5b9739de650ab44293f00880819fe874bd76d",
    "comments": [
        "Gandhi was and is probably the greatest Indian born. \n\n- Was he a saint? Hell no! \n- Did he make mistakes? Yes! \n\nBut what he achieved was incredible!",
        "After all he was a human being",
        "> Gandhi was and is probably the greatest Indian born. \n\nI disagree. The only thing he should be remembered for is his role in the freedom struggle and nothing more. He is not somebody who can be called the greatest. He is not somebody who should be idolized. And he didn't achieve anything on his own. His role in the Indian freedom struggle is undeniable, but that doesn't mean we should ignore the distasteful aspects of his personality. \n\nHe was a typical conservative upper caste Indian of his day with the typical tone deaf attitude that went along with it. Enough to write articles about about how the African natives trying to defend their lands fighting with bows and spears deserved to be wiped out by the Colonial forces.\n\nIt was when his own caste privilege was ignored on a train in South Africa and he was treated by the white man like they would any other non white that his pride got hurt which ultimately led to his role in the Freedom struggle.\n\nThose experiences with oppression at the hands of others weren't enough to change his views on the caste system. He believe that the caste hierarchy was the cornerstone of Indian society and wanted the lower castes to accept their fate and place at the bottom of the society relegated to doing the menial jobs supposed to be meant for them. Be believed that this is the ideal system for the Indian society. \n\nHis views were one of the key reasons many low caste people weren't keen on the freedom struggle and would rather side with the British. Overtime, he realized that his views on caste were not well received, so, he toned them down. He had many tiffs with Dr. Ambedkar as well and even implied that anybody who is against the caste hierarchy is anti-India.\n\nAt one point during the late 1930's, he went on a hunger strike against Dr. Ambedkar's proposal of dedicated political representation for lower castes. Ambedkar was put under immense pressure to backdown and he was apparently hit with a constant barrage of death threats. Ambedkar himself didn't think very highly of him.\n\nPersonally, I feel that had Gandhi not been assassinated, SC/ST's would have been left in a much worse shape than they are in right now."
    ],
    "cleaned_text": "liberal fake liberalandhbhakt ig honestly speaking kind fake liberal watching video opened eyes felt outrageous someone bad mouthing gandhiji also outraged chose words horrendous recommend everyone watch video yea never forget great things nation ",
    "cleaned_title": "liberal fake liberalandhbhakt ig",
    "cleaned_selftext": "honestly speaking kind fake liberal watching video opened eyes felt outrageous someone bad mouthing gandhiji also outraged chose words horrendous recommend everyone watch video yea never forget great things nation",
    "cleaned_comments": "gandhi probably greatest indian born saint hell make mistakes yes achieved incredible human gandhi probably greatest indian born disagree thing remembered role freedom struggle nothing somebody called greatest somebody idolized didnt achieve anything role indian freedom struggle undeniable doesnt mean ignore distasteful aspects personality typical conservative upper caste indian day typical tone deaf attitude went along enough write articles african natives trying defend lands fighting bows spears deserved wiped colonial forces caste privilege ignored train south africa treated white man like would non white pride got hurt ultimately led role freedom struggle experiences oppression hands others werent enough change views caste system believe caste hierarchy cornerstone indian society wanted lower castes accept fate place bottom society relegated menial jobs supposed meant believed ideal system indian society views one key reasons many low caste people werent keen freedom struggle would rather side british overtime realized views caste well received toned many tiffs dr ambedkar well even implied anybody caste hierarchy antiindia one point late went hunger strike dr ambedkars proposal dedicated political representation lower castes ambedkar put immense pressure backdown apparently hit constant barrage death threats ambedkar didnt think highly personally feel gandhi assassinated scsts would left much worse shape right",
    "light_cleaned_title": "Be a Liberal not a fake liberal/andhbhakt ig",
    "light_cleaned_selftext": "Honestly speaking I was kind off fake liberal before watching this video, it opened my eyes. Before I felt very outrageous after someone bad mouthing Gandhiji (I was also outraged how they chose the words, horrendous). I recommend everyone to watch this video and yea never forget the great things he did for the our nation.",
    "light_cleaned_comments": "Gandhi was and is probably the greatest Indian born. - Was he a saint? Hell no! - Did he make mistakes? Yes! But what he achieved was incredible! After all he was a human being > Gandhi was and is probably the greatest Indian born. I disagree. The only thing he should be remembered for is his role in the freedom struggle and nothing more. He is not somebody who can be called the greatest. He is not somebody who should be idolized. And he didn't achieve anything on his own. His role in the Indian freedom struggle is undeniable, but that doesn't mean we should ignore the distasteful aspects of his personality. He was a typical conservative upper caste Indian of his day with the typical tone deaf attitude that went along with it. Enough to write articles about about how the African natives trying to defend their lands fighting with bows and spears deserved to be wiped out by the Colonial forces. It was when his own caste privilege was ignored on a train in South Africa and he was treated by the white man like they would any other non white that his pride got hurt which ultimately led to his role in the Freedom struggle. Those experiences with oppression at the hands of others weren't enough to change his views on the caste system. He believe that the caste hierarchy was the cornerstone of Indian society and wanted the lower castes to accept their fate and place at the bottom of the society relegated to doing the menial jobs supposed to be meant for them. Be believed that this is the ideal system for the Indian society. His views were one of the key reasons many low caste people weren't keen on the freedom struggle and would rather side with the British. Overtime, he realized that his views on caste were not well received, so, he toned them down. He had many tiffs with Dr. Ambedkar as well and even implied that anybody who is against the caste hierarchy is anti-India. At one point during the late 1930's, he went on a hunger strike against Dr. Ambedkar's proposal of dedicated political representation for lower castes. Ambedkar was put under immense pressure to backdown and he was apparently hit with a constant barrage of death threats. Ambedkar himself didn't think very highly of him. Personally, I feel that had Gandhi not been assassinated, SC/ST's would have been left in a much worse shape than they are in right now."
}