{
    "id": "180ce2r",
    "title": "The most powerful company in the world",
    "url": "https://www.reddit.com/r/india/comments/180ce2r/the_most_powerful_company_in_the_world/",
    "selftext": "Blackrock is the most powerful company in the world, which holds major shares in nearly all big giants like Amazon, Pfizer, Microsoft, Google, etc. It gives loans to biggest of the banks, like the federal reserve bank of America, and on paper has a net worth of 106.64 billion.\n\nFound by Larry Fink, who is a member of secret society, Kappa Beta Phi (*name interestingly similar to the secret society Phi Beta Kappa, formed in the year 1776, same year as the formation of the Bavarian elites society, of which elites are part of). \n\nInterestingly, most out of the 8 founders of blackrock are Jewish.\n\nhttps://youtu.be/17_VQsr2myw?si=w8RlF1HftYqjf0bH",
    "flair": "Politics",
    "score": 1,
    "num_comments": 17,
    "created_utc": 1700555529.0,
    "convurl": "https://external-preview.redd.it/P4B9PMpqkCKfBrkAuougXx9i4OF6FKFkQx69yxOLp_Y.jpg?auto=webp&s=4f9fc0c589c5aebdd06e2f2f4406dfc575a84250",
    "comments": [
        "It's not obscure.",
        "*Blackrock is an obscure,*\n\nit is NOT an obscure company.",
        ">obscure\n\nwhat",
        ">Interestingly, most out of the 8 founders of blackrock are Jewish.\n\nIs that why it is obscure to you?",
        "not well known",
        "Based on OP's post nothing. \n\nBut, Blackrock recently entered Indian Healthcare Industry and that's a bit scary. We know how effed up Healthcare is in the US and large corporations seem to want to push India in that direction.",
        "Isn't the current healthcare situation scary enough?  Why is the healthcare situation in the US any different from India in terms of accessibility? In both countries, a vast majority of the citizens dont have access to decent healthcare. The government is white washing AYUSH so that it looks like there is affordable \"healthcare\" for the poor in India.",
        "Yes but a major difference is the cost of drugs. Due to various reasons, most drugs are available at way way lesser cost than in the US. \n\nAn example:\nInsulin in the US costs ~ 60 USD.\nIn India it costs ~ 1.5 USD.\n\nIf a healthcare system moves to a predominantly insurance based system, it's very likely that drugs will be covered in the insurance and subsequently become much costlier forcing either large expenses or regular insurance premiums. \n\nThere is no universal healthcare in the US whereas in India a large amount of healthcare is covered by the government at nominal costs. In PHCs, for regular, low level illnesses treatment as well as medication is at a nominal cost.\n\nIn government hospitals diagnostics and treatments are at a significantly lower cost than in private hospitals. \n\nThe quality is low, behaviour of staff and doctors to patients is appalling but decent healthcare is still accessible. \n\nNot saying that we are anywhere near good, accessible healthcare but it's much much better than the US. With the introduction of Ayushman Bharat program, Jan Aushadi program it's improving. \n\nAll the every two steps in the right direction is countered by a step in the backward direction, AYUSH being the prime example.",
        "Take into account PPP while comparing prices.",
        "Same example:\n\nUS: ~0.1% of PPP\nIndia: ~0.02% of PPP",
        "I don’t think you understand how black rock works as a company lol"
    ],
    "cleaned_text": "powerful company world blackrock powerful company world holds major shares nearly big giants like amazon pfizer microsoft google etc gives loans biggest banks like federal reserve bank america paper net worth billion found larry fink member secret society kappa beta phi name interestingly similar secret society phi beta kappa formed year year formation bavarian elites society elites part interestingly founders blackrock jewish ",
    "cleaned_title": "powerful company world",
    "cleaned_selftext": "blackrock powerful company world holds major shares nearly big giants like amazon pfizer microsoft google etc gives loans biggest banks like federal reserve bank america paper net worth billion found larry fink member secret society kappa beta phi name interestingly similar secret society phi beta kappa formed year year formation bavarian elites society elites part interestingly founders blackrock jewish",
    "cleaned_comments": "obscure blackrock obscure obscure company obscure interestingly founders blackrock jewish obscure well known based ops post nothing blackrock recently entered indian healthcare industry thats bit scary know effed healthcare us large corporations seem want push india direction isnt current healthcare situation scary enough healthcare situation us different india terms accessibility countries vast majority citizens dont access decent healthcare government white washing ayush looks like affordable healthcare poor india yes major difference cost drugs due various reasons drugs available way way lesser cost us example insulin us costs usd india costs usd healthcare system moves predominantly insurance based system likely drugs covered insurance subsequently become much costlier forcing either large expenses regular insurance premiums universal healthcare us whereas india large amount healthcare covered government nominal costs phcs regular low level illnesses treatment well medication nominal cost government hospitals diagnostics treatments significantly lower cost private hospitals quality low behaviour staff doctors patients appalling decent healthcare still accessible saying anywhere near good accessible healthcare much much better us introduction ayushman bharat program jan aushadi program improving every two steps right direction countered step backward direction ayush prime example take account ppp comparing prices example us ppp india ppp dont think understand black rock works company lol",
    "light_cleaned_title": "The most powerful company in the world",
    "light_cleaned_selftext": "Blackrock is the most powerful company in the world, which holds major shares in nearly all big giants like Amazon, Pfizer, Microsoft, Google, etc. It gives loans to biggest of the banks, like the federal reserve bank of America, and on paper has a net worth of 106.64 billion. Found by Larry Fink, who is a member of secret society, Kappa Beta Phi (*name interestingly similar to the secret society Phi Beta Kappa, formed in the year 1776, same year as the formation of the Bavarian elites society, of which elites are part of). Interestingly, most out of the 8 founders of blackrock are Jewish.",
    "light_cleaned_comments": "It's not obscure. *Blackrock is an obscure,* it is NOT an obscure company. >obscure what >Interestingly, most out of the 8 founders of blackrock are Jewish. Is that why it is obscure to you? not well known Based on OP's post nothing. But, Blackrock recently entered Indian Healthcare Industry and that's a bit scary. We know how effed up Healthcare is in the US and large corporations seem to want to push India in that direction. Isn't the current healthcare situation scary enough? Why is the healthcare situation in the US any different from India in terms of accessibility? In both countries, a vast majority of the citizens dont have access to decent healthcare. The government is white washing AYUSH so that it looks like there is affordable \"healthcare\" for the poor in India. Yes but a major difference is the cost of drugs. Due to various reasons, most drugs are available at way way lesser cost than in the US. An example: Insulin in the US costs ~ 60 USD. In India it costs ~ 1.5 USD. If a healthcare system moves to a predominantly insurance based system, it's very likely that drugs will be covered in the insurance and subsequently become much costlier forcing either large expenses or regular insurance premiums. There is no universal healthcare in the US whereas in India a large amount of healthcare is covered by the government at nominal costs. In PHCs, for regular, low level illnesses treatment as well as medication is at a nominal cost. In government hospitals diagnostics and treatments are at a significantly lower cost than in private hospitals. The quality is low, behaviour of staff and doctors to patients is appalling but decent healthcare is still accessible. Not saying that we are anywhere near good, accessible healthcare but it's much much better than the US. With the introduction of Ayushman Bharat program, Jan Aushadi program it's improving. All the every two steps in the right direction is countered by a step in the backward direction, AYUSH being the prime example. Take into account PPP while comparing prices. Same example: US: ~0.1% of PPP India: ~0.02% of PPP I don’t think you understand how black rock works as a company lol"
}