{
    "id": "13bhdvs",
    "title": "I hated those animated shorts on children's TV channels",
    "url": "https://www.reddit.com/r/india/comments/13bhdvs/i_hated_those_animated_shorts_on_childrens_tv/",
    "selftext": "This might not relate to everybody but do anybody remember those animated shorts that used to come in between ads on some kids channels on TV. I always used to feel uncomfortable watching those. They were overly cruel to the characters I remember. For example the main character struggling to get a single drop of water on a very very sunny day. And those never ended in a happy ending. I always felt wrong watching those. They were never funny to me. Now that some years have passed, I feel like what was wrong with the people greenlighting those shorts. I don't know if they still run them to kids or if they toned them down.\nAnyways,\nThank you for reading my rant\n\nEdit: found an example - https://www.youtube.com/watch?v=_PL3e8BkHT4\nThis is a better one but I've seen worse.\nThey always tortured my guy man- https://youtu.be/QLbCVJXDaDw",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 6,
    "created_utc": 1683530808.0,
    "convurl": "https://external-preview.redd.it/q7g-vM8h59plSF6Cki89c0otoK8_SH9wa7rnb4tbfV8.jpg?auto=webp&v=enabled&s=985d9f218f924220de556358f3fc0faee182906d",
    "comments": [
        "I don't remember anything as such but now curious to know what show this is.",
        "Edit: bruh, all I had to do was search 'insect cartoon Nickelodeon ' on youtube, got the name. Its called Miniscule.\n\nhttps://en.m.wikipedia.org/wiki/Minuscule_(TV_series)\n\nhttps://youtu.be/ZQYpogdsvQo\n\n\nKind of related to the post, I remember these shorts that used to air on Nickelodeon late at night, after the last cartoon  for the day(I think it was Avatar The Last Airbender) had aired, and before the late night infomercials started.\n\nIt was about insects, like dragon flies or houseflies, there were even a few ones with daddy long leg spiders. It was a mix of animation/stop motion+live action, the background was not animated, it was usually a field of grass or a roadside etc. Only the characters (the insects) were animated. The insects didn't have any voice lines either, it was only the buzzing sounds they make and the noise of their actions.\n\nTried looking it up on Nick India's page, couldn't find the name. It been kind of bugging me (hehe)",
        "I've updated post to add some examples",
        "Maybe we have a lost media in our hands",
        "I've edited my answer, i found it on youtube pretty much right away"
    ],
    "cleaned_text": "hated animated shorts childrens tv channels might relate everybody anybody remember animated shorts used come ads kids channels tv always used feel uncomfortable watching overly cruel characters remember example main character struggling get single drop water sunny day never ended happy ending always felt wrong watching never funny years passed feel like wrong people greenlighting shorts dont know still run kids toned anyways thank reading rant edit found example better one ive seen worse always tortured guy man ",
    "cleaned_title": "hated animated shorts childrens tv channels",
    "cleaned_selftext": "might relate everybody anybody remember animated shorts used come ads kids channels tv always used feel uncomfortable watching overly cruel characters remember example main character struggling get single drop water sunny day never ended happy ending always felt wrong watching never funny years passed feel like wrong people greenlighting shorts dont know still run kids toned anyways thank reading rant edit found example better one ive seen worse always tortured guy man",
    "cleaned_comments": "dont remember anything curious know show edit bruh search insect cartoon nickelodeon youtube got name called miniscule kind related post remember shorts used air nickelodeon late night last cartoon dayi think avatar last airbender aired late night infomercials started insects like dragon flies houseflies even ones daddy long leg spiders mix animationstop motionlive action background animated usually field grass roadside etc characters insects animated insects didnt voice lines either buzzing sounds make noise actions tried looking nick indias page couldnt find name kind bugging hehe ive updated post add examples maybe lost media hands ive edited answer found youtube pretty much right away",
    "light_cleaned_title": "I hated those animated shorts on children's TV channels",
    "light_cleaned_selftext": "This might not relate to everybody but do anybody remember those animated shorts that used to come in between ads on some kids channels on TV. I always used to feel uncomfortable watching those. They were overly cruel to the characters I remember. For example the main character struggling to get a single drop of water on a very very sunny day. And those never ended in a happy ending. I always felt wrong watching those. They were never funny to me. Now that some years have passed, I feel like what was wrong with the people greenlighting those shorts. I don't know if they still run them to kids or if they toned them down. Anyways, Thank you for reading my rant Edit: found an example - This is a better one but I've seen worse. They always tortured my guy man-",
    "light_cleaned_comments": "I don't remember anything as such but now curious to know what show this is. Edit: bruh, all I had to do was search 'insect cartoon Nickelodeon ' on youtube, got the name. Its called Miniscule. Kind of related to the post, I remember these shorts that used to air on Nickelodeon late at night, after the last cartoon for the day(I think it was Avatar The Last Airbender) had aired, and before the late night infomercials started. It was about insects, like dragon flies or houseflies, there were even a few ones with daddy long leg spiders. It was a mix of animation/stop motion+live action, the background was not animated, it was usually a field of grass or a roadside etc. Only the characters (the insects) were animated. The insects didn't have any voice lines either, it was only the buzzing sounds they make and the noise of their actions. Tried looking it up on Nick India's page, couldn't find the name. It been kind of bugging me (hehe) I've updated post to add some examples Maybe we have a lost media in our hands I've edited my answer, i found it on youtube pretty much right away"
}