{
    "id": "1c1yjxr",
    "title": "Apple’s Big Shift: 5 Lakh Potential Jobs In India In Next Three Years As Supply Chain Moves from China",
    "url": "https://www.reddit.com/r/india/comments/1c1yjxr/apples_big_shift_5_lakh_potential_jobs_in_india/",
    "selftext": "**Good morning, everyone!**\n\n**Exciting News from Apple**\n\nWe have some exciting updates from the world of technology:\n\n**1. Shifting Supply Chain:**\n\nApple, the renowned tech giant, is planning to move a substantial part of its supply chain operations from China to India. This strategic decision aims to capitalize on India's potential and create around 500,000 job opportunities in the country over the next three years.\n\n**2. Diversification Strategy:**\n\nThe move by Apple is part of a broader trend among technology companies to diversify their manufacturing bases. By shifting operations to India, Apple seeks to tap into the country's growing workforce and leverage its skilled labor pool.\n\n**3. Production Outlook:**\n\nWith its focus on India, Apple aims to manufacture iPhones worth $14 billion in the country. This ambitious production target signals a significant shift in the global technology landscape, with India emerging as a key manufacturing hub for Apple products.\n\n**4. Alignment with India's Goals:**\n\nApple's decision aligns well with India's efforts to strengthen its semiconductor and electronics manufacturing sectors. By investing in India's manufacturing capabilities, Apple not only boosts its own operations but also contributes to India's economic growth and technological advancement.\n\nSource- [https://swarajyamag.com/news-brief/apples-big-shift-5-lakh-potential-jobs-in-india-in-next-three-years-as-supply-chain-moves-from-china](https://swarajyamag.com/news-brief/apples-big-shift-5-lakh-potential-jobs-in-india-in-next-three-years-as-supply-chain-moves-from-china)",
    "flair": "Policy/Economy",
    "score": 38,
    "num_comments": 10,
    "created_utc": 1712891016.0,
    "convurl": "https://external-preview.redd.it/GhoxIAVU2b42vXq3mTBTpqQ_OPyhqv5tcj1ak20XghM.jpg?auto=webp&s=47b2bd8c52def45f3248534c514dc2026d866fb8",
    "comments": [
        "sirf science aur commerce walon ke liye hongi jobs? :(",
        "Please Follow For latest updates 😊",
        "Labour exploitation....by Apple",
        "Lads it’s swarajya mag.",
        "So iPhones will become cheaper in India. Cool!",
        "I’m sure we’ll screw it up somehow to give way to some shitty make-in-India company which will just sneakily import low quality China rejected stuff",
        "Sara profit toh 2 logon ke Jeb me jaana hai /s",
        "Do people with material science specialization get any jobs here?"
    ],
    "cleaned_text": "apples big shift lakh potential jobs india next three years supply chain moves china good morning everyone exciting news apple exciting updates world technology shifting supply chain apple renowned tech giant planning move substantial part supply chain operations china india strategic decision aims capitalize indias potential create around job opportunities country next three years diversification strategy move apple part broader trend among technology companies diversify manufacturing bases shifting operations india apple seeks tap countrys growing workforce leverage skilled labor pool production outlook focus india apple aims manufacture iphones worth billion country ambitious production target signals significant shift global technology landscape india emerging key manufacturing hub apple products alignment indias goals apples decision aligns well indias efforts strengthen semiconductor electronics manufacturing sectors investing indias manufacturing capabilities apple boosts operations also contributes indias economic growth technological advancement source httpsswarajyamagcomnewsbriefapplesbigshiftlakhpotentialjobsinindiainnextthreeyearsassupplychainmovesfromchinahttpsswarajyamagcomnewsbriefapplesbigshiftlakhpotentialjobsinindiainnextthreeyearsassupplychainmovesfromchina ",
    "cleaned_title": "apples big shift lakh potential jobs india next three years supply chain moves china",
    "cleaned_selftext": "good morning everyone exciting news apple exciting updates world technology shifting supply chain apple renowned tech giant planning move substantial part supply chain operations china india strategic decision aims capitalize indias potential create around job opportunities country next three years diversification strategy move apple part broader trend among technology companies diversify manufacturing bases shifting operations india apple seeks tap countrys growing workforce leverage skilled labor pool production outlook focus india apple aims manufacture iphones worth billion country ambitious production target signals significant shift global technology landscape india emerging key manufacturing hub apple products alignment indias goals apples decision aligns well indias efforts strengthen semiconductor electronics manufacturing sectors investing indias manufacturing capabilities apple boosts operations also contributes indias economic growth technological advancement source httpsswarajyamagcomnewsbriefapplesbigshiftlakhpotentialjobsinindiainnextthreeyearsassupplychainmovesfromchinahttpsswarajyamagcomnewsbriefapplesbigshiftlakhpotentialjobsinindiainnextthreeyearsassupplychainmovesfromchina",
    "cleaned_comments": "sirf science aur commerce walon ke liye hongi jobs please follow latest updates labour exploitationby apple lads swarajya mag iphones become cheaper india cool im sure well screw somehow give way shitty makeinindia company sneakily import low quality china rejected stuff sara profit toh logon ke jeb jaana hai people material science specialization get jobs",
    "light_cleaned_title": "Apple’s Big Shift: 5 Lakh Potential Jobs In India In Next Three Years As Supply Chain Moves from China",
    "light_cleaned_selftext": "**Good morning, everyone!** **Exciting News from Apple** We have some exciting updates from the world of technology: **1. Shifting Supply Chain:** Apple, the renowned tech giant, is planning to move a substantial part of its supply chain operations from China to India. This strategic decision aims to capitalize on India's potential and create around 500,000 job opportunities in the country over the next three years. **2. Diversification Strategy:** The move by Apple is part of a broader trend among technology companies to diversify their manufacturing bases. By shifting operations to India, Apple seeks to tap into the country's growing workforce and leverage its skilled labor pool. **3. Production Outlook:** With its focus on India, Apple aims to manufacture iPhones worth $14 billion in the country. This ambitious production target signals a significant shift in the global technology landscape, with India emerging as a key manufacturing hub for Apple products. **4. Alignment with India's Goals:** Apple's decision aligns well with India's efforts to strengthen its semiconductor and electronics manufacturing sectors. By investing in India's manufacturing capabilities, Apple not only boosts its own operations but also contributes to India's economic growth and technological advancement. Source- [https://swarajyamag.com/news-brief/apples-big-shift-5-lakh-potential-jobs-in-india-in-next-three-years-as-supply-chain-moves-from-china](https://swarajyamag.com/news-brief/apples-big-shift-5-lakh-potential-jobs-in-india-in-next-three-years-as-supply-chain-moves-from-china)",
    "light_cleaned_comments": "sirf science aur commerce walon ke liye hongi jobs? :( Please Follow For latest updates 😊 Labour exploitation....by Apple Lads it’s swarajya mag. So iPhones will become cheaper in India. Cool! I’m sure we’ll screw it up somehow to give way to some shitty make-in-India company which will just sneakily import low quality China rejected stuff Sara profit toh 2 logon ke Jeb me jaana hai /s Do people with material science specialization get any jobs here?"
}