{
    "id": "1bj56tz",
    "title": "Economic inequality in India: the “Billionaire Raj” is now more unequal than the British colonial Raj - World Inequality Database",
    "url": "https://wid.world/news-article/inequality-in-india-the-billionaire-raj-is-now-more-unequal-than-the-british-colonial-raj/",
    "selftext": "A new working paper published by Nitin Kumar Bharti, Lucas Chancel, Thomas Piketty, and Anmol Somanchi, for World Inequality Database, reveals an alarming rise in wealth inequality in India.\n\nThe paper finds a rise in concentration of wealth between 2014-15 and 2022-2023. The wealth inequality in India is now at its highest level in a century, and higher than South Africa, Brazil and US. The paper emphasizes that the quality of economic data in India is notably poor and has seen a decline recently. It is therefore likely that these new estimates represent a lower bound to actual inequality levels.\n\nThe paper finds suggestive evidence of a regressive tax system in India. It further calls for a restructuring of the tax code to account for both income and wealth, and broad-based public investments in health, education and nutrition. The paper further suggests a “super tax” of 2% on the net wealth of the 167 wealthiest families in 2022-23, which would yield 0.5% of national income in revenues and create valuable fiscal space to facilitate such investments.",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 2,
    "created_utc": 1710909149.0,
    "convurl": "https://external-preview.redd.it/peIszVKVM58UCw8JU33GC870nnWe9szc784y8ql-95k.jpg?auto=webp&s=400af0497a9c95d40af486e2556fcf66e89f8e1b",
    "comments": [
        "Yeah im calling bs on that."
    ],
    "cleaned_text": "economic inequality india billionaire raj unequal british colonial raj world inequality database new working paper published nitin kumar bharti lucas chancel thomas piketty anmol somanchi world inequality database reveals alarming rise wealth inequality india paper finds rise concentration wealth wealth inequality india highest level century higher south africa brazil us paper emphasizes quality economic data india notably poor seen decline recently therefore likely new estimates represent lower bound actual inequality levels paper finds suggestive evidence regressive tax system india calls restructuring tax code account income wealth broadbased public investments health education nutrition paper suggests super tax net wealth wealthiest families would yield national income revenues create valuable fiscal space facilitate investments ",
    "cleaned_title": "economic inequality india billionaire raj unequal british colonial raj world inequality database",
    "cleaned_selftext": "new working paper published nitin kumar bharti lucas chancel thomas piketty anmol somanchi world inequality database reveals alarming rise wealth inequality india paper finds rise concentration wealth wealth inequality india highest level century higher south africa brazil us paper emphasizes quality economic data india notably poor seen decline recently therefore likely new estimates represent lower bound actual inequality levels paper finds suggestive evidence regressive tax system india calls restructuring tax code account income wealth broadbased public investments health education nutrition paper suggests super tax net wealth wealthiest families would yield national income revenues create valuable fiscal space facilitate investments",
    "cleaned_comments": "yeah im calling bs",
    "light_cleaned_title": "Economic inequality in India: the “Billionaire Raj” is now more unequal than the British colonial Raj - World Inequality Database",
    "light_cleaned_selftext": "A new working paper published by Nitin Kumar Bharti, Lucas Chancel, Thomas Piketty, and Anmol Somanchi, for World Inequality Database, reveals an alarming rise in wealth inequality in India. The paper finds a rise in concentration of wealth between 2014-15 and 2022-2023. The wealth inequality in India is now at its highest level in a century, and higher than South Africa, Brazil and US. The paper emphasizes that the quality of economic data in India is notably poor and has seen a decline recently. It is therefore likely that these new estimates represent a lower bound to actual inequality levels. The paper finds suggestive evidence of a regressive tax system in India. It further calls for a restructuring of the tax code to account for both income and wealth, and broad-based public investments in health, education and nutrition. The paper further suggests a “super tax” of 2% on the net wealth of the 167 wealthiest families in 2022-23, which would yield 0.5% of national income in revenues and create valuable fiscal space to facilitate such investments.",
    "light_cleaned_comments": "Yeah im calling bs on that."
}