{
    "id": "14pq5kt",
    "title": "Top 100 ranked colleges in India",
    "url": "https://i.redd.it/o8hqtn6shs9b1.png",
    "selftext": "Source NIRF",
    "flair": "Policy/Economy",
    "score": 9,
    "num_comments": 8,
    "created_utc": 1688407315.0,
    "convurl": "https://i.redd.it/o8hqtn6shs9b1.png",
    "comments": [
        "Link to the source\n[NIRF india ](https://www.nirfindia.org/2023/CollegeRanking.html)",
        "86 off the 100 in 5 states, and 0 in 15 plus states. No wonder the imbalance is striking.",
        "Our higher education is oversaturated. We need more resources",
        "You can't have more resources. We are a broke ass country. The current regime has killed nearly all public educational institutions, barring a few like the IIMs and IITs. If you bring investments from outside then you will have to privatise education which ends up making it available only to those who can afford it. Faculty are getting paid less than 10k a month. This shit will hurt us bad!",
        "The future isn't looking good when we prioritize statues & religious buildings over educational institutes & hospitals."
    ],
    "cleaned_text": "top ranked colleges india source nirf ",
    "cleaned_title": "top ranked colleges india",
    "cleaned_selftext": "source nirf",
    "cleaned_comments": "link source nirf india httpswwwnirfindiaorgcollegerankinghtml states plus states wonder imbalance striking higher education oversaturated need resources cant resources broke ass country current regime killed nearly public educational institutions barring like iims iits bring investments outside privatise education ends making available afford faculty getting paid less k month shit hurt us bad future isnt looking good prioritize statues religious buildings educational institutes hospitals",
    "light_cleaned_title": "Top 100 ranked colleges in India",
    "light_cleaned_selftext": "Source NIRF",
    "light_cleaned_comments": "Link to the source [NIRF india ](https://www.nirfindia.org/2023/CollegeRanking.html) 86 off the 100 in 5 states, and 0 in 15 plus states. No wonder the imbalance is striking. Our higher education is oversaturated. We need more resources You can't have more resources. We are a broke ass country. The current regime has killed nearly all public educational institutions, barring a few like the IIMs and IITs. If you bring investments from outside then you will have to privatise education which ends up making it available only to those who can afford it. Faculty are getting paid less than 10k a month. This shit will hurt us bad! The future isn't looking good when we prioritize statues & religious buildings over educational institutes & hospitals."
}