{
    "id": "16o0exr",
    "title": "How to sell healthcare system = Vikas makes India to america ?",
    "url": "https://www.reddit.com/r/india/comments/16o0exr/how_to_sell_healthcare_system_vikas_makes_india/",
    "selftext": "Answer has been found by supreme leader and his cutlery set.\n\nhttps://m.thewire.in/article/education/neet-pg-cut-off-zero-percentile-health-ministry/amp\n\nAs a doctor I need to score 600/800 to get a seat for specialisation\n\nBut if you have 2-3 crores then you can actually score negative marks and become a surgeon or a gynecologist or dermatologist or radiologist.\nLatest rate charts can be found in your newspapers.\n\nWelcome to Bharat dear friends.\n\nVikas pe baat, Gobi aur chota fanta ke sath.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695253512.0,
    "convurl": "https://external-preview.redd.it/yvfs_ZT_pYjzzx32G9w7msNp0ZUFUbit5Od70nVxltc.jpg?auto=webp&s=34c89b2eece5e236602ae8ba9efdf8eebfdc95f5",
    "comments": [
        "the medical education is an organised \"mafia\" kinda sitiation bro...",
        "If people limit wasting their energy bitching about nepotism in the Bollywood, they may realize how fucked up the system is around us and how the rich have all sorts of privileges not exclusive to Bollywood."
    ],
    "cleaned_text": "sell healthcare system vikas makes india america answer found supreme leader cutlery set doctor need score get seat specialisation crores actually score negative marks become surgeon gynecologist dermatologist radiologist latest rate charts found newspapers welcome bharat dear friends vikas pe baat gobi aur chota fanta ke sath ",
    "cleaned_title": "sell healthcare system vikas makes india america",
    "cleaned_selftext": "answer found supreme leader cutlery set doctor need score get seat specialisation crores actually score negative marks become surgeon gynecologist dermatologist radiologist latest rate charts found newspapers welcome bharat dear friends vikas pe baat gobi aur chota fanta ke sath",
    "cleaned_comments": "medical education organised mafia kinda sitiation bro people limit wasting energy bitching nepotism bollywood may realize fucked system around us rich sorts privileges exclusive bollywood",
    "light_cleaned_title": "How to sell healthcare system = Vikas makes India to america ?",
    "light_cleaned_selftext": "Answer has been found by supreme leader and his cutlery set. As a doctor I need to score 600/800 to get a seat for specialisation But if you have 2-3 crores then you can actually score negative marks and become a surgeon or a gynecologist or dermatologist or radiologist. Latest rate charts can be found in your newspapers. Welcome to Bharat dear friends. Vikas pe baat, Gobi aur chota fanta ke sath.",
    "light_cleaned_comments": "the medical education is an organised \"mafia\" kinda sitiation bro... If people limit wasting their energy bitching about nepotism in the Bollywood, they may realize how fucked up the system is around us and how the rich have all sorts of privileges not exclusive to Bollywood."
}