{
    "id": "17fhm5v",
    "title": "When will Indian judicial system including a agencies like consumer forum learn their scope of work",
    "url": "https://www.reddit.com/r/india/comments/17fhm5v/when_will_indian_judicial_system_including_a/",
    "selftext": "Why can a private business not charge for things on it premise. Actually a business is free to charge even for using their toilets if they decide to do so. Why can a business not charge for the plastic bag it has paid and bought. Why has a business to give it free to anyone something it has paid money for. \n\nPromise you, people spend huge amount of effort to carry bags from home when they find its chargeable at the store. Most don't care for environment. \n\n[https://www.ndtv.com/india-news/bengaluru-court-orders-ikea-to-pay-rs-3-000-to-customer-for-charging-her-rs-20-for-carry-bag-4509592#pfrom=home-ndtv\\_topstories](https://www.ndtv.com/india-news/bengaluru-court-orders-ikea-to-pay-rs-3-000-to-customer-for-charging-her-rs-20-for-carry-bag-4509592#pfrom=home-ndtv_topstories)",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698166912.0,
    "convurl": "https://external-preview.redd.it/7MNX_0L-UX8orfKNOsHi8wNOdwaRUCrx9qic4oYiU-s.jpg?auto=webp&s=d5a7fce390c4d021a9649358703ea32106aad43a",
    "comments": [],
    "cleaned_text": "indian judicial system including agencies like consumer forum learn scope work private business charge things premise actually business free charge even using toilets decide business charge plastic bag paid bought business give free anyone something paid money promise people spend huge amount effort carry bags home find chargeable store dont care environment httpswwwndtvcomindianewsbengalurucourtordersikeatopayrstocustomerforchargingherrsforcarrybagpfromhomendtvtopstorieshttpswwwndtvcomindianewsbengalurucourtordersikeatopayrstocustomerforchargingherrsforcarrybagpfromhomendtvtopstories ",
    "cleaned_title": "indian judicial system including agencies like consumer forum learn scope work",
    "cleaned_selftext": "private business charge things premise actually business free charge even using toilets decide business charge plastic bag paid bought business give free anyone something paid money promise people spend huge amount effort carry bags home find chargeable store dont care environment httpswwwndtvcomindianewsbengalurucourtordersikeatopayrstocustomerforchargingherrsforcarrybagpfromhomendtvtopstorieshttpswwwndtvcomindianewsbengalurucourtordersikeatopayrstocustomerforchargingherrsforcarrybagpfromhomendtvtopstories",
    "cleaned_comments": "",
    "light_cleaned_title": "When will Indian judicial system including a agencies like consumer forum learn their scope of work",
    "light_cleaned_selftext": "Why can a private business not charge for things on it premise. Actually a business is free to charge even for using their toilets if they decide to do so. Why can a business not charge for the plastic bag it has paid and bought. Why has a business to give it free to anyone something it has paid money for. Promise you, people spend huge amount of effort to carry bags from home when they find its chargeable at the store. Most don't care for environment. [https://www.ndtv.com/india-news/bengaluru-court-orders-ikea-to-pay-rs-3-000-to-customer-for-charging-her-rs-20-for-carry-bag-4509592#pfrom=home-ndtv\\_topstories](https://www.ndtv.com/india-news/bengaluru-court-orders-ikea-to-pay-rs-3-000-to-customer-for-charging-her-rs-20-for-carry-bag-4509592#pfrom=home-ndtv_topstories)",
    "light_cleaned_comments": ""
}