{
    "id": "1cjx6ni",
    "title": "FSSAI allows 10 times more pesticide residue in herbs, spices",
    "url": "https://m.economictimes.com/news/economy/foreign-trade/fssai-allows-10-times-more-pesticide-residue-in-herbs-spices/articleshow/109825532.cms",
    "selftext": "No one cares that the Indian population's health is being sacrificed for crony capitalists profits! \n\nThis will have a long term impact with escalating health costs for the entire country!\n\nWho cares, I guess! ",
    "flair": "Crime",
    "score": 198,
    "num_comments": 18,
    "created_utc": 1714818451.0,
    "convurl": "https://external-preview.redd.it/AKR-T2BXc--rFlIEz44by2YysBV6DRfcEZ8fSN6MjuU.jpg?auto=webp&s=26b561a7fdd8a4e873aa824d5b8d67e0c5ef6912",
    "comments": [
        "Adani will buy all hospital companies now\n/S",
        "https://preview.redd.it/znixxq175eyc1.png?width=640&format=png&auto=webp&s=d1ee5be16f7e535e00828eb4199495f8868d0cad",
        "If you work in the Food FMCG SECTOR....You would definitely.buy stocks in Health sector",
        "10 times more than?",
        "Lessssgooooo more Cancer and sickness amongst people! \n\nMore reason Bhakts will at this point unironically support the Govt",
        "So it’s legal now. 👏",
        "Stop making jokes...and start complaining to fssai https://fssai.gov.in/index.php",
        "Black recently (late last year or early this year) entered the Healthcare space. It's going to be bad. No need for the /s",
        "Just drink gomutra, that will fix everything",
        "Why do we even have this organisation.. it's like who... Naam ka hai... Hota toh hai nai kuch is se",
        "https://www.business-standard.com/amp/india-news/fssai-relaxed-pesticide-norms-in-april-allowing-10x-more-residue-in-spices-124050400269_1.html\n\nNon paywalled article. The headline here isn’t quite accurate. The relaxation didn’t happen now, it happened a month ago. Hence the pesticides found in exports. So it’s not a case of our regulatory body failing to discover contamination, it’s worse. They actively encouraged it. \n\n\n“India had relaxed pesticide norms for herbs and spices, increasing the maximum residue limit (MRL) by tenfold before Hong Kong and Singapore flagged concerns with MDH and Everest masalas, according to a report by the Economic Times.\nIn an order issued on April 8, the Food Safety and Standards Authority of India (FSSAI) raised the MRL for a pesticide in herbs and spices to 0.1mg/kg from the previous 0.01mg/kg. The regulator cited “various representations” as the reason for this upward revision.” \n\nGee I wonder how much bribe money accompanied those ‘various representations’.",
        "https://www.business-standard.com/amp/india-news/fssai-relaxed-pesticide-norms-in-april-allowing-10x-more-residue-in-spices-124050400269_1.html\n\nNon paywalled article. The headline here isn’t quite accurate. The relaxation didn’t happen now, it happened a month ago. Hence the pesticides found in exports. So it’s not a case of our regulatory body failing to discover contamination, it’s worse. They actively encouraged it.\n\n“India had relaxed pesticide norms for herbs and spices, increasing the maximum residue limit (MRL) by tenfold before Hong Kong and Singapore flagged concerns with MDH and Everest masalas, according to a report by the Economic Times. In an order issued on April 8, the Food Safety and Standards Authority of India (FSSAI) raised the MRL for a pesticide in herbs and spices to 0.1mg/kg from the previous 0.01mg/kg. The regulator cited “various representations” as the reason for this upward revision.”\n\nGee I wonder how much bribe money accompanied those ‘various representations’.\n\nWatching regulatory capture and it’s consequences in slow motion. If the idiots hadn’t started exporting the same stuff we never would have known. Until the inevitable diagnosis day that is.",
        "Stop making jokes...and start complaining to  [https://fssai.gov.in/index.php](https://fssai.gov.in/index.php)",
        "So wait as soon as the companies got the increased limit order they paid fssai for , they were able to get the new production with 10 times limit going?\n\nLooks like they couldn’t wait to give everyone cancer",
        "these products should have a label like \"eating this causes cancer\" or \"people who eat this die early\" just like tobacco and other products",
        "Need to find the list of these cancer products to avoid them forever even if they rollback",
        "Why was the change made? Who is the minister for such things? This should be the top headline! It is the food we eat!"
    ],
    "cleaned_text": "fssai allows times pesticide residue herbs spices one cares indian populations health sacrificed crony capitalists profits long term impact escalating health costs entire country cares guess ",
    "cleaned_title": "fssai allows times pesticide residue herbs spices",
    "cleaned_selftext": "one cares indian populations health sacrificed crony capitalists profits long term impact escalating health costs entire country cares guess",
    "cleaned_comments": "adani buy hospital companies work food fmcg sectoryou would definitelybuy stocks health sector times lessssgooooo cancer sickness amongst people reason bhakts point unironically support govt legal stop making jokesand start complaining fssai black recently late last year early year entered healthcare space going bad need drink gomutra fix everything even organisation like naam ka hai hota toh hai nai kuch se non paywalled article headline isnt quite accurate relaxation didnt happen happened month ago hence pesticides found exports case regulatory body failing discover contamination worse actively encouraged india relaxed pesticide norms herbs spices increasing maximum residue limit mrl tenfold hong kong singapore flagged concerns mdh everest masalas according report economic times order issued april food safety standards authority india fssai raised mrl pesticide herbs spices mgkg previous mgkg regulator cited various representations reason upward revision gee wonder much bribe money accompanied various representations non paywalled article headline isnt quite accurate relaxation didnt happen happened month ago hence pesticides found exports case regulatory body failing discover contamination worse actively encouraged india relaxed pesticide norms herbs spices increasing maximum residue limit mrl tenfold hong kong singapore flagged concerns mdh everest masalas according report economic times order issued april food safety standards authority india fssai raised mrl pesticide herbs spices mgkg previous mgkg regulator cited various representations reason upward revision gee wonder much bribe money accompanied various representations watching regulatory capture consequences slow motion idiots hadnt started exporting stuff never would known inevitable diagnosis day stop making jokesand start complaining httpsfssaigovinindexphphttpsfssaigovinindexphp wait soon companies got increased limit order paid fssai able get new production times limit going looks like couldnt wait give everyone cancer products label like eating causes cancer people eat die early like tobacco products need find list cancer products avoid forever even rollback change made minister things top headline food eat",
    "light_cleaned_title": "FSSAI allows 10 times more pesticide residue in herbs, spices",
    "light_cleaned_selftext": "No one cares that the Indian population's health is being sacrificed for crony capitalists profits! This will have a long term impact with escalating health costs for the entire country! Who cares, I guess!",
    "light_cleaned_comments": "Adani will buy all hospital companies now /S If you work in the Food FMCG SECTOR....You would definitely.buy stocks in Health sector 10 times more than? Lessssgooooo more Cancer and sickness amongst people! More reason Bhakts will at this point unironically support the Govt So it’s legal now. 👏 Stop making jokes...and start complaining to fssai Black recently (late last year or early this year) entered the Healthcare space. It's going to be bad. No need for the /s Just drink gomutra, that will fix everything Why do we even have this organisation.. it's like who... Naam ka hai... Hota toh hai nai kuch is se Non paywalled article. The headline here isn’t quite accurate. The relaxation didn’t happen now, it happened a month ago. Hence the pesticides found in exports. So it’s not a case of our regulatory body failing to discover contamination, it’s worse. They actively encouraged it. “India had relaxed pesticide norms for herbs and spices, increasing the maximum residue limit (MRL) by tenfold before Hong Kong and Singapore flagged concerns with MDH and Everest masalas, according to a report by the Economic Times. In an order issued on April 8, the Food Safety and Standards Authority of India (FSSAI) raised the MRL for a pesticide in herbs and spices to 0.1mg/kg from the previous 0.01mg/kg. The regulator cited “various representations” as the reason for this upward revision.” Gee I wonder how much bribe money accompanied those ‘various representations’. Non paywalled article. The headline here isn’t quite accurate. The relaxation didn’t happen now, it happened a month ago. Hence the pesticides found in exports. So it’s not a case of our regulatory body failing to discover contamination, it’s worse. They actively encouraged it. “India had relaxed pesticide norms for herbs and spices, increasing the maximum residue limit (MRL) by tenfold before Hong Kong and Singapore flagged concerns with MDH and Everest masalas, according to a report by the Economic Times. In an order issued on April 8, the Food Safety and Standards Authority of India (FSSAI) raised the MRL for a pesticide in herbs and spices to 0.1mg/kg from the previous 0.01mg/kg. The regulator cited “various representations” as the reason for this upward revision.” Gee I wonder how much bribe money accompanied those ‘various representations’. Watching regulatory capture and it’s consequences in slow motion. If the idiots hadn’t started exporting the same stuff we never would have known. Until the inevitable diagnosis day that is. Stop making jokes...and start complaining to [https://fssai.gov.in/index.php](https://fssai.gov.in/index.php) So wait as soon as the companies got the increased limit order they paid fssai for , they were able to get the new production with 10 times limit going? Looks like they couldn’t wait to give everyone cancer these products should have a label like \"eating this causes cancer\" or \"people who eat this die early\" just like tobacco and other products Need to find the list of these cancer products to avoid them forever even if they rollback Why was the change made? Who is the minister for such things? This should be the top headline! It is the food we eat!"
}