{
    "id": "l6rhsw",
    "title": "Digital Transparency: A Right to Information Report for January, 2021",
    "url": "https://www.reddit.com/r/india/comments/l6rhsw/digital_transparency_a_right_to_information/",
    "selftext": "## \n\nhttps://preview.redd.it/nan8282q61e61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=992700c7df71e0c28e2599e08406e3be5f71151b\n\n## tl;dr\n\nSince our [last report in the month of December](https://internetfreedom.in/iffs-right-to-information-report-for-december/), IFF has filed 32 RTI requests. Here, we give you an overview of the requests filed and why demanding transparency and accountability from government authorities is one of the key elements in our fight to protect digital rights. \n\n## Why is transparency important?\n\nThe Right to Information Act, 2005 was enacted to promote transparency and accountability in the working of every public authority by ensuring that citizens are able secure access to information under the control of public authorities. Facilitating such access is necessary to ensure that democratic processes are not subverted by public authorities acting under private interests. Where transparency is not upheld as a value of public decision making, citizens are at a disadvantage when it comes to keeping a check on abuse of power by the public authorities. \n\nThe Right to Information Act is thus one of the most important tools at the disposal of the public to engage with and demand transparency and accountability from the Government. We use the Act to routinely extract information about various ongoing policies and projects that the Government launches. In the month of January, we have up till now filed 32 RTI requests with authorities at the Central and State level, both electronically and through physical filing on the various issues on which we engage with the government. \n\nNote: Number of RTIs are calculated from the date of the previous report. While we try to make this a monthly report, some RTI requests from the previous month that were filed after that month's report may be included in the present report.\n\n## Data Protection and Privacy\n\nOne of our key areas of work is ensuring that public authorities respect data privacy and engage in practices which will ensure that the right to privacy is protected. We filed 30 requests with various authorities this month to ask for information pertaining to newly introduced projects which affect the data privacy of Indian citizens. \n\nUnder IFF’s Project Panoptic, we routinely file RTI requests with various public authorities after we come across news reports that they are developing or using facial recognition technology. This month, we filed requests with:\n\n1. The [Delhi Police](https://drive.google.com/file/d/1V_kZjMiMpyxhOgcXKwy3baWSCp1Rx1Em/view?usp=sharing), \n2. The [Director General of Police Office, ](https://drive.google.com/file/d/19dGKM2gX20yE06WU7apKz9-JkNMo4RJO/view?usp=sharing)Uttar Pradesh, \n3. The [Chennai Metropolitan Development Authority](https://drive.google.com/file/d/1ZJ6IQVMdrHbkxuLAEY4FxpoLUZXAVtnG/view), \n4. The [Odisha Police](https://drive.google.com/file/d/19O0lVS9cTb7Dgw-vdEIL4ij8zenUdPQe/view),\n5. The [Bengaluru Police](https://drive.google.com/file/d/11EQw6ibB85J5GAl915xOJpbYRdiAPGgO/view), \n6. The [Bhubhaneshwar Police](https://drive.google.com/file/d/1qJz1H9Dw1aNnOARtQWepeXfQs0mYgIJV/view), \n7. The [Police Commissioner Office, Lucknow](https://drive.google.com/file/d/1CaBgRnffK1LRJeEXeyH3ClE5WsZWQdTl/view?usp=sharing) &amp;\n8. The [Education Department, Delhi Government](https://drive.google.com/file/d/1v7YNcGTbmCZwRf63ACWnFXWcMR2Yi9o1/view?usp=sharing). \n\nAdditionally we also filed requests with:\n\n1. The [National Health Authority](https://drive.google.com/file/d/1oymyqTDGk1opMjfCzZib-aOhOGbdP18I/view?usp=sharing) on the drafting of the National Digital Health Mission policy. We have also received the [reply](https://drive.google.com/file/d/16i6qOC_08F-oVNDHLoNLsBMQudx-H2i_/view?usp=sharing) to this request. \n2. The [National Health Authority](https://drive.google.com/file/d/15tq-9b0zwfUAuMkDGixup4CkGNO7cAbb/view?usp=sharing) on responses received as part of the public consultation on the draft for Health Data Management Policy. We have also received the [reply](https://drive.google.com/file/d/1VjRBB6PtV90SWUMrqIz6ahrCiW34LboE/view?usp=sharing) to this request. \n3. The [National Health Authority](https://drive.google.com/file/d/1OSTQmKsfjVY2pUVNECs1rzpP2V3CkLy3/view?usp=sharing) on the pilot projects of the National Digital Health Mission being launched in Chandigarh, Ladakh, Dadra and Nagar Haveli and Daman and Diu, Puducherry, Andaman and Nicobar Islands and Lakshadweep. We have also received the [reply](https://drive.google.com/file/d/1MPt0oYuEmQdNdYje3dIpiq-MrH704037/view?usp=sharing) to the request. \n4. The [National Health Authority](https://drive.google.com/file/d/1QM7FP1DfStoTSDeApqhwHFR8umdVePrf/view?usp=sharing) on the notification issued for the implementation of the National Digital Health Mission. We have also received the [reply](https://drive.google.com/file/d/1nl63mVOzFUlF-7L3gspwnOXTIxpis5q0/view?usp=sharing) to the request. \n5. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1szrSXxslxrDBdCCx7rEJXMAAoqYhyjMR/view?usp=sharing) on the CO-WIN application for COVID-19 vaccine registration. \n6. The [Department of Health &amp; Family Welfare](https://drive.google.com/file/d/1wCUJv2CZYyzIq15j6Af1h6S_193O9e5m/view?usp=sharing) on the CO-WIN application for COVID-19 vaccine registration. \n7. The [National Crime Records Bureau](https://drive.google.com/file/d/1HQjhKzJ4JVRP8tPBrvP_Iqq4VDJFnTyo/view?usp=sharing) on the [report](https://www.hindustantimes.com/india-news/pvt-firms-psus-set-to-get-access-to-crime-database/story-4JqLbe8qgtOuVSujVl3n9O.html) that [CCTNS](https://internetfreedom.in/watch-the-watchmen-part-3/) data will be shared with private firms and PSUs. \n8. The [National Informatics Centre](https://drive.google.com/file/d/12pgVt-3HR5lRnQUmXe31JGtIf8NnJJ1x/view?usp=sharing) on the [report](https://www.hindustantimes.com/india-news/pvt-firms-psus-set-to-get-access-to-crime-database/story-4JqLbe8qgtOuVSujVl3n9O.html) that [CCTNS](https://internetfreedom.in/watch-the-watchmen-part-3/) data will be shared with private firms and PSUs. \n9. The [Department of Agriculture, Cooperation &amp; Family Welfare](https://drive.google.com/file/d/1cQE4dAhq_sPYdnDNlFijSBNrnpUIKprT/view?usp=sharing) on the proposed AgriStack. We have also received the [reply](https://drive.google.com/drive/folders/1K3YPgflFkOhINQVGvWuaQztg3-Q0syap?usp=sharing) to this request. \n10. The [National Institution for Transforming India (NITI Aayog)](https://drive.google.com/file/d/1yVmqvbeqCTronSKWE4HETtsXuRRflvOz/view?usp=sharing) on the proposed AgriStack. We have also received the [reply](https://drive.google.com/file/d/1EeqgBthy_KdKeulw7moR0WDHA_ff7WGF/view?usp=sharing) to this request. \n11. The [National Health Authority](https://drive.google.com/file/d/1ggBWhxQuAqVpL1zO85w5i63hr82ilv1x/view?usp=sharing) on the functioning of the Aarogya Setu mobile application. \n12. The [Department of Health &amp; Family Welfare](https://drive.google.com/file/d/1rO7TJGupfKPz_1dW87d3mihBZNnjcesy/view?usp=sharing) on the functioning of the Aarogya Setu mobile application. \n13. The [Department of Telecommunications](https://drive.google.com/file/d/13hYxnqfyHlthW3Lyas1q4yYyxadV5Zkn/view?usp=sharing) on the data about the movement of migrant workers after the COVID-19 related nationwide lockdown in March 2020. \n14. The [Department of Telecommunications](https://drive.google.com/file/d/1yr5gX-n3YpYfqQzoxpqsMD9YdGLfg8Mv/view?usp=sharing) on the location data requisitioned by the Department of Telecom from telecom service providers for COVID-19 control purposes in 2020.\n15. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1YrQHsm6EUBVzcOE2jupQb3uvWtVd_WPB/view?usp=sharing) on data breaches reported to CERT-In. \n16. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1qtjNi0WrVDAd3-y31kxfRmnT6IA48vTX/view?usp=sharing) on the the Expert Committee on Non-Personal Data Governance Framework. \n17. The [PGIMER, Chandigarh](https://drive.google.com/file/d/1On4OSc1tXv_Zav7DrJyAweb784IAT6yt/view) on reports stating that Health ID has been mandatory for staffers. \n18. The [Chief Minister's Office, New Delhi](https://drive.google.com/file/d/1ThepuNrEXcc4qi8_SQQ3Op8r2VKk2sex/view?usp=sharing) on action taken on the representation sent by the Internet Freedom Foundation bearing reference no. IFF/2020/170 on November 18, 2020. \n19. The [Excise Department, Delhi](https://drive.google.com/file/d/1JTXQlK2i9unBp_8YDCPMCAMjEd2vQmXL/view?usp=sharing) on action taken on the representation sent by the Internet Freedom Foundation bearing reference no. IFF/2020/170 on November 18, 2020. \n20. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1AbIaEvk_rzPBOLhDpNTseFGbopOClX6X/view?usp=sharing) on the proposed amendment of the Information Technology Act, 2000.\n21. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1lP8VO8vFdxtUEu-3UUGDtRyyxY6kP6Di/view?usp=sharing) on the government-appointed expert panel that has been formed to monitor the data being captured by the Aarogya Setu application. \n\n## Free Speech and Censorship\n\nOur other main focus is to ensure that freedom of speech and expression on the internet is protected and that unnecessary censorship does not lead to a chilling effect on people’s fundamental rights. For this, we routinely file RTI requests to demand accountability for instances which may hamper free speech on the internet such as website blocking or internet shutdowns. \n\nIn the month of January, we have up till now filed 2 RTI requests to demand accountability for violations of free speech on the internet with:\n\n1. The [Department of Telecommunications](https://drive.google.com/file/d/1gzZox-QNgpDtJLIVg6eqPBBXioMS6LoD/view?usp=sharing) on the amendment of the Temporary Suspension of Telecom Services (Public Emergency or Public Safety) Rules, 2017. We have also received the [reply](https://drive.google.com/file/d/1gzZox-QNgpDtJLIVg6eqPBBXioMS6LoD/view?usp=sharing) to this request. \n2. The [Home Department, Maharashtra](https://drive.google.com/file/d/1rah_QIrV38U8YSiVy-kGVpkoct1cwqvU/view?usp=sharing) on representation sent by the Internet Freedom Foundation bearing reference no. IFF/2020/156 dated August 6, 2020.\n\n## Important Documents\n\n1. Digital Transparency: A Right to Information Report for December, 2020 ([link](https://internetfreedom.in/iffs-right-to-information-report-for-december/))\n2. RTI responses received from Education Department, Delhi Government on their use of facial recognition technology ([link](https://twitter.com/internetfreedom/status/1351497228691464194))\n3. RTI response received from Central Board of Secondary Education on their use of facial recognition technology dated January 27, 2021 ([link](https://drive.google.com/file/d/1KX65PWftIQlqs9YGJjjbaDFWpvea-p8L/view?usp=sharing))",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 0,
    "created_utc": 1611821313,
    "convurl": "https://b.thumbs.redditmedia.com/OuXIZRwFHcJtuWpcBeu1S_rvSv5Cu-j3peDLMaYoIls.jpg",
    "comments": [],
    "cleaned_text": "digital transparency right information report january tldr since last report month decemberhttpsinternetfreedominiffsrighttoinformationreportfordecember iff filed rti requests give overview requests filed demanding transparency accountability government authorities one key elements fight protect digital rights transparency important right information act enacted promote transparency accountability working every public authority ensuring citizens able secure access information control public authorities facilitating access necessary ensure democratic processes subverted public authorities acting private interests transparency upheld value public decision making citizens disadvantage comes keeping check abuse power public authorities right information act thus one important tools disposal public engage demand transparency accountability government use act routinely extract information various ongoing policies projects government launches month january till filed rti requests authorities central state level electronically physical filing various issues engage government note number rtis calculated date previous report try make monthly report rti requests previous month filed months report may included present report data protection privacy one key areas work ensuring public authorities respect data privacy engage practices ensure right privacy protected filed requests various authorities month ask information pertaining newly introduced projects affect data privacy indian citizens iffs project panoptic routinely file rti requests various public authorities come across news reports developing using facial recognition technology month filed requests delhi policehttpsdrivegooglecomfiledvkzjmimpyxhogcxkwybawscprxemviewuspsharing director general police office httpsdrivegooglecomfileddgkmgxyewuapkzjknmorjoviewuspsharinguttar pradesh chennai metropolitan development authorityhttpsdrivegooglecomfiledzjiqvmdrhbkxulaeyfxpoluzxavtngview odisha policehttpsdrivegooglecomfiledolvsctbdgwvdeilijzenudpqeview bengaluru policehttpsdrivegooglecomfiledeqwibbjgalxojpbyrdiapggoview bhubhaneshwar policehttpsdrivegooglecomfiledqjzhdwannoartqwepexfqsmygijvview police commissioner office lucknowhttpsdrivegooglecomfiledcabgrnffklrjeexeyhclewszwqdtlviewuspsharing amp education department delhi governmenthttpsdrivegooglecomfiledvyncgtbmczwrfacwnfxwcmryioviewuspsharing additionally also filed requests national health authorityhttpsdrivegooglecomfiledoymyqtdgkopmjfczzibaohogbdpiviewuspsharing drafting national digital health mission policy also received replyhttpsdrivegooglecomfilediqocfovndhlonlsbmqudxhiviewuspsharing request national health authorityhttpsdrivegooglecomfiledtqbzwfuaumkdgixupckgnocabbviewuspsharing responses received part public consultation draft health data management policy also received replyhttpsdrivegooglecomfiledvjrbbptvswumrqizahrciwlboeviewuspsharing request national health authorityhttpsdrivegooglecomfiledostqmksfjvypuvnecsrzppvcklyviewuspsharing pilot projects national digital health mission launched chandigarh ladakh dadra nagar haveli daman diu puducherry andaman nicobar islands lakshadweep also received replyhttpsdrivegooglecomfiledmptoyuemqdndyjedipiqmrhviewuspsharing request national health authorityhttpsdrivegooglecomfiledqmfpdfstotsdeapqhwhfrumdveprfviewuspsharing notification issued implementation national digital health mission also received replyhttpsdrivegooglecomfilednlmvozfulflgspwnoxtixpisqviewuspsharing request department electronics amp information technologyhttpsdrivegooglecomfiledszrsxxslxrdbdccxrejxmaaoqyhyjmrviewuspsharing cowin application covid vaccine registration department health amp family welfarehttpsdrivegooglecomfiledwcujvczyyziqjafhsoemviewuspsharing cowin application covid vaccine registration national crime records bureauhttpsdrivegooglecomfiledhqjhkzjjvrptpbrvpiqqvdjfntyoviewuspsharing reporthttpswwwhindustantimescomindianewspvtfirmspsussettogetaccesstocrimedatabasestoryjqlbeqgtouvsujvlnohtml cctnshttpsinternetfreedominwatchthewatchmenpart data shared private firms psus national informatics centrehttpsdrivegooglecomfiledpgvthrlrnqumxejgtifnnjjxviewuspsharing reporthttpswwwhindustantimescomindianewspvtfirmspsussettogetaccesstocrimedatabasestoryjqlbeqgtouvsujvlnohtml cctnshttpsinternetfreedominwatchthewatchmenpart data shared private firms psus department agriculture cooperation amp family welfarehttpsdrivegooglecomfiledcqedahqspydndnlfijsbnrnpuikprtviewuspsharing proposed agristack also received replyhttpsdrivegooglecomdrivefolderskypgflfkohinqvgvwuaqztgqsyapuspsharing request national institution transforming india niti aayoghttpsdrivegooglecomfiledyvmqvbeqctronskwehettsxurrflvozviewuspsharing proposed agristack also received replyhttpsdrivegooglecomfiledeeqgbthykdkeulwmorwdhaffwgfviewuspsharing request national health authorityhttpsdrivegooglecomfiledggbwhxquaqvplzowihrilvxviewuspsharing functioning aarogya setu mobile application department health amp family welfarehttpsdrivegooglecomfiledrotjgupfkpzdwdmihbznnjcesyviewuspsharing functioning aarogya setu mobile application department telecommunicationshttpsdrivegooglecomfiledhyxnqfyhlthwlyasqyyyxadvzknviewuspsharing data movement migrant workers covid related nationwide lockdown march department telecommunicationshttpsdrivegooglecomfiledyrgxnypyfqqzoxpqsmdydglfgmvviewuspsharing location data requisitioned department telecom telecom service providers covid control purposes department electronics amp information technologyhttpsdrivegooglecomfiledyrqhsmeubvzcoejupqbuvwtvdwpbviewuspsharing data breaches reported certin department electronics amp information technologyhttpsdrivegooglecomfiledqtjniwrvdadykxfrmntiavtxviewuspsharing expert committee nonpersonal data governance framework pgimer chandigarhhttpsdrivegooglecomfiledonosctxvzavdrjyawebiatytview reports stating health id mandatory staffers chief ministers office new delhihttpsdrivegooglecomfiledthepunrexccqisqqoprvkksexviewuspsharing action taken representation sent internet freedom foundation bearing reference iff november excise department delhihttpsdrivegooglecomfiledjtxqlkiunbpydcpmcamjedvqmxlviewuspsharing action taken representation sent internet freedom foundation bearing reference iff november department electronics amp information technologyhttpsdrivegooglecomfiledabiaevkrzpbolhdpntsefgbopoclxxviewuspsharing proposed amendment information technology act department electronics amp information technologyhttpsdrivegooglecomfiledlpvovfdxtueuuugdtryyxykpdiviewuspsharing governmentappointed expert panel formed monitor data captured aarogya setu application free speech censorship main focus ensure freedom speech expression internet protected unnecessary censorship lead chilling effect peoples fundamental rights routinely file rti requests demand accountability instances may hamper free speech internet website blocking internet shutdowns month january till filed rti requests demand accountability violations free speech internet department telecommunicationshttpsdrivegooglecomfiledgzzoxqngpdtjlivgeqpbbxiomslodviewuspsharing amendment temporary suspension telecom services public emergency public safety rules also received replyhttpsdrivegooglecomfiledgzzoxqngpdtjlivgeqpbbxiomslodviewuspsharing request home department maharashtrahttpsdrivegooglecomfiledrahqirvuysivykgvpkoctcwqvuviewuspsharing representation sent internet freedom foundation bearing reference iff dated august important documents digital transparency right information report december linkhttpsinternetfreedominiffsrighttoinformationreportfordecember rti responses received education department delhi government use facial recognition technology linkhttpstwittercominternetfreedomstatus rti response received central board secondary education use facial recognition technology dated january linkhttpsdrivegooglecomfiledkxpwftiqlqsygjjjbadfwpveaplviewuspsharing ",
    "cleaned_title": "digital transparency right information report january",
    "cleaned_selftext": "tldr since last report month decemberhttpsinternetfreedominiffsrighttoinformationreportfordecember iff filed rti requests give overview requests filed demanding transparency accountability government authorities one key elements fight protect digital rights transparency important right information act enacted promote transparency accountability working every public authority ensuring citizens able secure access information control public authorities facilitating access necessary ensure democratic processes subverted public authorities acting private interests transparency upheld value public decision making citizens disadvantage comes keeping check abuse power public authorities right information act thus one important tools disposal public engage demand transparency accountability government use act routinely extract information various ongoing policies projects government launches month january till filed rti requests authorities central state level electronically physical filing various issues engage government note number rtis calculated date previous report try make monthly report rti requests previous month filed months report may included present report data protection privacy one key areas work ensuring public authorities respect data privacy engage practices ensure right privacy protected filed requests various authorities month ask information pertaining newly introduced projects affect data privacy indian citizens iffs project panoptic routinely file rti requests various public authorities come across news reports developing using facial recognition technology month filed requests delhi policehttpsdrivegooglecomfiledvkzjmimpyxhogcxkwybawscprxemviewuspsharing director general police office httpsdrivegooglecomfileddgkmgxyewuapkzjknmorjoviewuspsharinguttar pradesh chennai metropolitan development authorityhttpsdrivegooglecomfiledzjiqvmdrhbkxulaeyfxpoluzxavtngview odisha policehttpsdrivegooglecomfiledolvsctbdgwvdeilijzenudpqeview bengaluru policehttpsdrivegooglecomfiledeqwibbjgalxojpbyrdiapggoview bhubhaneshwar policehttpsdrivegooglecomfiledqjzhdwannoartqwepexfqsmygijvview police commissioner office lucknowhttpsdrivegooglecomfiledcabgrnffklrjeexeyhclewszwqdtlviewuspsharing amp education department delhi governmenthttpsdrivegooglecomfiledvyncgtbmczwrfacwnfxwcmryioviewuspsharing additionally also filed requests national health authorityhttpsdrivegooglecomfiledoymyqtdgkopmjfczzibaohogbdpiviewuspsharing drafting national digital health mission policy also received replyhttpsdrivegooglecomfilediqocfovndhlonlsbmqudxhiviewuspsharing request national health authorityhttpsdrivegooglecomfiledtqbzwfuaumkdgixupckgnocabbviewuspsharing responses received part public consultation draft health data management policy also received replyhttpsdrivegooglecomfiledvjrbbptvswumrqizahrciwlboeviewuspsharing request national health authorityhttpsdrivegooglecomfiledostqmksfjvypuvnecsrzppvcklyviewuspsharing pilot projects national digital health mission launched chandigarh ladakh dadra nagar haveli daman diu puducherry andaman nicobar islands lakshadweep also received replyhttpsdrivegooglecomfiledmptoyuemqdndyjedipiqmrhviewuspsharing request national health authorityhttpsdrivegooglecomfiledqmfpdfstotsdeapqhwhfrumdveprfviewuspsharing notification issued implementation national digital health mission also received replyhttpsdrivegooglecomfilednlmvozfulflgspwnoxtixpisqviewuspsharing request department electronics amp information technologyhttpsdrivegooglecomfiledszrsxxslxrdbdccxrejxmaaoqyhyjmrviewuspsharing cowin application covid vaccine registration department health amp family welfarehttpsdrivegooglecomfiledwcujvczyyziqjafhsoemviewuspsharing cowin application covid vaccine registration national crime records bureauhttpsdrivegooglecomfiledhqjhkzjjvrptpbrvpiqqvdjfntyoviewuspsharing reporthttpswwwhindustantimescomindianewspvtfirmspsussettogetaccesstocrimedatabasestoryjqlbeqgtouvsujvlnohtml cctnshttpsinternetfreedominwatchthewatchmenpart data shared private firms psus national informatics centrehttpsdrivegooglecomfiledpgvthrlrnqumxejgtifnnjjxviewuspsharing reporthttpswwwhindustantimescomindianewspvtfirmspsussettogetaccesstocrimedatabasestoryjqlbeqgtouvsujvlnohtml cctnshttpsinternetfreedominwatchthewatchmenpart data shared private firms psus department agriculture cooperation amp family welfarehttpsdrivegooglecomfiledcqedahqspydndnlfijsbnrnpuikprtviewuspsharing proposed agristack also received replyhttpsdrivegooglecomdrivefolderskypgflfkohinqvgvwuaqztgqsyapuspsharing request national institution transforming india niti aayoghttpsdrivegooglecomfiledyvmqvbeqctronskwehettsxurrflvozviewuspsharing proposed agristack also received replyhttpsdrivegooglecomfiledeeqgbthykdkeulwmorwdhaffwgfviewuspsharing request national health authorityhttpsdrivegooglecomfiledggbwhxquaqvplzowihrilvxviewuspsharing functioning aarogya setu mobile application department health amp family welfarehttpsdrivegooglecomfiledrotjgupfkpzdwdmihbznnjcesyviewuspsharing functioning aarogya setu mobile application department telecommunicationshttpsdrivegooglecomfiledhyxnqfyhlthwlyasqyyyxadvzknviewuspsharing data movement migrant workers covid related nationwide lockdown march department telecommunicationshttpsdrivegooglecomfiledyrgxnypyfqqzoxpqsmdydglfgmvviewuspsharing location data requisitioned department telecom telecom service providers covid control purposes department electronics amp information technologyhttpsdrivegooglecomfiledyrqhsmeubvzcoejupqbuvwtvdwpbviewuspsharing data breaches reported certin department electronics amp information technologyhttpsdrivegooglecomfiledqtjniwrvdadykxfrmntiavtxviewuspsharing expert committee nonpersonal data governance framework pgimer chandigarhhttpsdrivegooglecomfiledonosctxvzavdrjyawebiatytview reports stating health id mandatory staffers chief ministers office new delhihttpsdrivegooglecomfiledthepunrexccqisqqoprvkksexviewuspsharing action taken representation sent internet freedom foundation bearing reference iff november excise department delhihttpsdrivegooglecomfiledjtxqlkiunbpydcpmcamjedvqmxlviewuspsharing action taken representation sent internet freedom foundation bearing reference iff november department electronics amp information technologyhttpsdrivegooglecomfiledabiaevkrzpbolhdpntsefgbopoclxxviewuspsharing proposed amendment information technology act department electronics amp information technologyhttpsdrivegooglecomfiledlpvovfdxtueuuugdtryyxykpdiviewuspsharing governmentappointed expert panel formed monitor data captured aarogya setu application free speech censorship main focus ensure freedom speech expression internet protected unnecessary censorship lead chilling effect peoples fundamental rights routinely file rti requests demand accountability instances may hamper free speech internet website blocking internet shutdowns month january till filed rti requests demand accountability violations free speech internet department telecommunicationshttpsdrivegooglecomfiledgzzoxqngpdtjlivgeqpbbxiomslodviewuspsharing amendment temporary suspension telecom services public emergency public safety rules also received replyhttpsdrivegooglecomfiledgzzoxqngpdtjlivgeqpbbxiomslodviewuspsharing request home department maharashtrahttpsdrivegooglecomfiledrahqirvuysivykgvpkoctcwqvuviewuspsharing representation sent internet freedom foundation bearing reference iff dated august important documents digital transparency right information report december linkhttpsinternetfreedominiffsrighttoinformationreportfordecember rti responses received education department delhi government use facial recognition technology linkhttpstwittercominternetfreedomstatus rti response received central board secondary education use facial recognition technology dated january linkhttpsdrivegooglecomfiledkxpwftiqlqsygjjjbadfwpveaplviewuspsharing",
    "cleaned_comments": "",
    "light_cleaned_title": "Digital Transparency: A Right to Information Report for January, 2021",
    "light_cleaned_selftext": "## ## tl;dr Since our [last report in the month of December](https://internetfreedom.in/iffs-right-to-information-report-for-december/), IFF has filed 32 RTI requests. Here, we give you an overview of the requests filed and why demanding transparency and accountability from government authorities is one of the key elements in our fight to protect digital rights. ## Why is transparency important? The Right to Information Act, 2005 was enacted to promote transparency and accountability in the working of every public authority by ensuring that citizens are able secure access to information under the control of public authorities. Facilitating such access is necessary to ensure that democratic processes are not subverted by public authorities acting under private interests. Where transparency is not upheld as a value of public decision making, citizens are at a disadvantage when it comes to keeping a check on abuse of power by the public authorities. The Right to Information Act is thus one of the most important tools at the disposal of the public to engage with and demand transparency and accountability from the Government. We use the Act to routinely extract information about various ongoing policies and projects that the Government launches. In the month of January, we have up till now filed 32 RTI requests with authorities at the Central and State level, both electronically and through physical filing on the various issues on which we engage with the government. Note: Number of RTIs are calculated from the date of the previous report. While we try to make this a monthly report, some RTI requests from the previous month that were filed after that month's report may be included in the present report. ## Data Protection and Privacy One of our key areas of work is ensuring that public authorities respect data privacy and engage in practices which will ensure that the right to privacy is protected. We filed 30 requests with various authorities this month to ask for information pertaining to newly introduced projects which affect the data privacy of Indian citizens. Under IFF’s Project Panoptic, we routinely file RTI requests with various public authorities after we come across news reports that they are developing or using facial recognition technology. This month, we filed requests with: 1. The [Delhi Police](https://drive.google.com/file/d/1V_kZjMiMpyxhOgcXKwy3baWSCp1Rx1Em/view?usp=sharing), 2. The [Director General of Police Office, ](https://drive.google.com/file/d/19dGKM2gX20yE06WU7apKz9-JkNMo4RJO/view?usp=sharing)Uttar Pradesh, 3. The [Chennai Metropolitan Development Authority](https://drive.google.com/file/d/1ZJ6IQVMdrHbkxuLAEY4FxpoLUZXAVtnG/view), 4. The [Odisha Police](https://drive.google.com/file/d/19O0lVS9cTb7Dgw-vdEIL4ij8zenUdPQe/view), 5. The [Bengaluru Police](https://drive.google.com/file/d/11EQw6ibB85J5GAl915xOJpbYRdiAPGgO/view), 6. The [Bhubhaneshwar Police](https://drive.google.com/file/d/1qJz1H9Dw1aNnOARtQWepeXfQs0mYgIJV/view), 7. The [Police Commissioner Office, Lucknow](https://drive.google.com/file/d/1CaBgRnffK1LRJeEXeyH3ClE5WsZWQdTl/view?usp=sharing) &amp; 8. The [Education Department, Delhi Government](https://drive.google.com/file/d/1v7YNcGTbmCZwRf63ACWnFXWcMR2Yi9o1/view?usp=sharing). Additionally we also filed requests with: 1. The [National Health Authority](https://drive.google.com/file/d/1oymyqTDGk1opMjfCzZib-aOhOGbdP18I/view?usp=sharing) on the drafting of the National Digital Health Mission policy. We have also received the [reply](https://drive.google.com/file/d/16i6qOC_08F-oVNDHLoNLsBMQudx-H2i_/view?usp=sharing) to this request. 2. The [National Health Authority](https://drive.google.com/file/d/15tq-9b0zwfUAuMkDGixup4CkGNO7cAbb/view?usp=sharing) on responses received as part of the public consultation on the draft for Health Data Management Policy. We have also received the [reply](https://drive.google.com/file/d/1VjRBB6PtV90SWUMrqIz6ahrCiW34LboE/view?usp=sharing) to this request. 3. The [National Health Authority](https://drive.google.com/file/d/1OSTQmKsfjVY2pUVNECs1rzpP2V3CkLy3/view?usp=sharing) on the pilot projects of the National Digital Health Mission being launched in Chandigarh, Ladakh, Dadra and Nagar Haveli and Daman and Diu, Puducherry, Andaman and Nicobar Islands and Lakshadweep. We have also received the [reply](https://drive.google.com/file/d/1MPt0oYuEmQdNdYje3dIpiq-MrH704037/view?usp=sharing) to the request. 4. The [National Health Authority](https://drive.google.com/file/d/1QM7FP1DfStoTSDeApqhwHFR8umdVePrf/view?usp=sharing) on the notification issued for the implementation of the National Digital Health Mission. We have also received the [reply](https://drive.google.com/file/d/1nl63mVOzFUlF-7L3gspwnOXTIxpis5q0/view?usp=sharing) to the request. 5. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1szrSXxslxrDBdCCx7rEJXMAAoqYhyjMR/view?usp=sharing) on the CO-WIN application for COVID-19 vaccine registration. 6. The [Department of Health &amp; Family Welfare](https://drive.google.com/file/d/1wCUJv2CZYyzIq15j6Af1h6S_193O9e5m/view?usp=sharing) on the CO-WIN application for COVID-19 vaccine registration. 7. The [National Crime Records Bureau](https://drive.google.com/file/d/1HQjhKzJ4JVRP8tPBrvP_Iqq4VDJFnTyo/view?usp=sharing) on the [report](https://www.hindustantimes.com/india-news/pvt-firms-psus-set-to-get-access-to-crime-database/story-4JqLbe8qgtOuVSujVl3n9O.html) that [CCTNS](https://internetfreedom.in/watch-the-watchmen-part-3/) data will be shared with private firms and PSUs. 8. The [National Informatics Centre](https://drive.google.com/file/d/12pgVt-3HR5lRnQUmXe31JGtIf8NnJJ1x/view?usp=sharing) on the [report](https://www.hindustantimes.com/india-news/pvt-firms-psus-set-to-get-access-to-crime-database/story-4JqLbe8qgtOuVSujVl3n9O.html) that [CCTNS](https://internetfreedom.in/watch-the-watchmen-part-3/) data will be shared with private firms and PSUs. 9. The [Department of Agriculture, Cooperation &amp; Family Welfare](https://drive.google.com/file/d/1cQE4dAhq_sPYdnDNlFijSBNrnpUIKprT/view?usp=sharing) on the proposed AgriStack. We have also received the [reply](https://drive.google.com/drive/folders/1K3YPgflFkOhINQVGvWuaQztg3-Q0syap?usp=sharing) to this request. 10. The [National Institution for Transforming India (NITI Aayog)](https://drive.google.com/file/d/1yVmqvbeqCTronSKWE4HETtsXuRRflvOz/view?usp=sharing) on the proposed AgriStack. We have also received the [reply](https://drive.google.com/file/d/1EeqgBthy_KdKeulw7moR0WDHA_ff7WGF/view?usp=sharing) to this request. 11. The [National Health Authority](https://drive.google.com/file/d/1ggBWhxQuAqVpL1zO85w5i63hr82ilv1x/view?usp=sharing) on the functioning of the Aarogya Setu mobile application. 12. The [Department of Health &amp; Family Welfare](https://drive.google.com/file/d/1rO7TJGupfKPz_1dW87d3mihBZNnjcesy/view?usp=sharing) on the functioning of the Aarogya Setu mobile application. 13. The [Department of Telecommunications](https://drive.google.com/file/d/13hYxnqfyHlthW3Lyas1q4yYyxadV5Zkn/view?usp=sharing) on the data about the movement of migrant workers after the COVID-19 related nationwide lockdown in March 2020. 14. The [Department of Telecommunications](https://drive.google.com/file/d/1yr5gX-n3YpYfqQzoxpqsMD9YdGLfg8Mv/view?usp=sharing) on the location data requisitioned by the Department of Telecom from telecom service providers for COVID-19 control purposes in 2020. 15. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1YrQHsm6EUBVzcOE2jupQb3uvWtVd_WPB/view?usp=sharing) on data breaches reported to CERT-In. 16. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1qtjNi0WrVDAd3-y31kxfRmnT6IA48vTX/view?usp=sharing) on the the Expert Committee on Non-Personal Data Governance Framework. 17. The [PGIMER, Chandigarh](https://drive.google.com/file/d/1On4OSc1tXv_Zav7DrJyAweb784IAT6yt/view) on reports stating that Health ID has been mandatory for staffers. 18. The [Chief Minister's Office, New Delhi](https://drive.google.com/file/d/1ThepuNrEXcc4qi8_SQQ3Op8r2VKk2sex/view?usp=sharing) on action taken on the representation sent by the Internet Freedom Foundation bearing reference no. IFF/2020/170 on November 18, 2020. 19. The [Excise Department, Delhi](https://drive.google.com/file/d/1JTXQlK2i9unBp_8YDCPMCAMjEd2vQmXL/view?usp=sharing) on action taken on the representation sent by the Internet Freedom Foundation bearing reference no. IFF/2020/170 on November 18, 2020. 20. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1AbIaEvk_rzPBOLhDpNTseFGbopOClX6X/view?usp=sharing) on the proposed amendment of the Information Technology Act, 2000. 21. The [Department of Electronics &amp; Information Technology](https://drive.google.com/file/d/1lP8VO8vFdxtUEu-3UUGDtRyyxY6kP6Di/view?usp=sharing) on the government-appointed expert panel that has been formed to monitor the data being captured by the Aarogya Setu application. ## Free Speech and Censorship Our other main focus is to ensure that freedom of speech and expression on the internet is protected and that unnecessary censorship does not lead to a chilling effect on people’s fundamental rights. For this, we routinely file RTI requests to demand accountability for instances which may hamper free speech on the internet such as website blocking or internet shutdowns. In the month of January, we have up till now filed 2 RTI requests to demand accountability for violations of free speech on the internet with: 1. The [Department of Telecommunications](https://drive.google.com/file/d/1gzZox-QNgpDtJLIVg6eqPBBXioMS6LoD/view?usp=sharing) on the amendment of the Temporary Suspension of Telecom Services (Public Emergency or Public Safety) Rules, 2017. We have also received the [reply](https://drive.google.com/file/d/1gzZox-QNgpDtJLIVg6eqPBBXioMS6LoD/view?usp=sharing) to this request. 2. The [Home Department, Maharashtra](https://drive.google.com/file/d/1rah_QIrV38U8YSiVy-kGVpkoct1cwqvU/view?usp=sharing) on representation sent by the Internet Freedom Foundation bearing reference no. IFF/2020/156 dated August 6, 2020. ## Important Documents 1. Digital Transparency: A Right to Information Report for December, 2020 ([link](https://internetfreedom.in/iffs-right-to-information-report-for-december/)) 2. RTI responses received from Education Department, Delhi Government on their use of facial recognition technology ([link](https://twitter.com/internetfreedom/status/1351497228691464194)) 3. RTI response received from Central Board of Secondary Education on their use of facial recognition technology dated January 27, 2021 ([link](https://drive.google.com/file/d/1KX65PWftIQlqs9YGJjjbaDFWpvea-p8L/view?usp=sharing))",
    "light_cleaned_comments": ""
}