{
    "id": "18lvhsw",
    "title": "STATEMENT: The Telecommunication Bill, 2023 was introduced last minute in the parliament amid protests and the suspension saga of MPs | Ours concerns 👇",
    "url": "https://www.reddit.com/r/india/comments/18lvhsw/statement_the_telecommunication_bill_2023_was/",
    "selftext": " \n\nSTATEMENT: The Telecommunication Bill, 2023 makes significant departures from its 2022 counterpart. Our concerns? Some same old, glaring. Some new, & quite concerning. We're unsure about the roots of these changes, \\*drumroll\\* since DOT never published the consultation comments. \n\nThe definition of ‘telecom service” in the 2023 Bill is much shorter & doesn't mention the entities to whom the Act will apply to. The current ambiguous definitions do not make it explicitly clear that internet services (messaging, email, etc.) do not come under its ambit. 2/11\n\nhttps://preview.redd.it/jxerm8x9577c1.png?width=1496&format=png&auto=webp&s=b8bb75fc9e7ce2e6cbf33a55b80539969cecde70\n\nhttps://preview.redd.it/ng86hi9b577c1.png?width=1370&format=png&auto=webp&s=46cdab4001ba2e5153c73ea1ac13c1a442b5008b\n\nThe 2022 Bill allowed the Union govt to issue licences for providing telecom services. The 2023 Bill has repackaged & introduced a similar concept of “authorisation”, allowing the Union govt to retain same powers, thus not addressing concerns around centralisation of power. 3/11\n\nhttps://preview.redd.it/wyw8angd577c1.png?width=1514&format=png&auto=webp&s=55b10cf12d47c9d1941c47482010ed651b9305fb\n\nThe 2023 Bill exacerbates privacy invading provisions such as the obligation of any authorised entity, as notified by the Union govt, to identify the person to whom it provides telecom services, through use of any verifiable biometric based identification “as may be prescribed”. 4/11\n\nhttps://preview.redd.it/74tcd4uf577c1.png?width=1530&format=png&auto=webp&s=0b943085b845ec5d171fa0eb5022ee225e215d97\n\nThe 2022 Bill did not reference biometric identification. This, coupled with the uncertainty brought by the phrase “as may be prescribed”, and ambit of the bill, threatens to a user’s ability to stay anonymous online. 5/11\n\nThe DoT has carried forward the duty imposed on users to not furnish any false information while establishing their identity for availing ‘telecommunication services’. This provision, if applicable to internet services, will have serious implications for anonymity online. 6/11\n\nhttps://preview.redd.it/f8lhl4rh577c1.png?width=1828&format=png&auto=webp&s=dfdc6af7e28ae574680c576ae702cd1e03fbb7e7\n\n**T7**\n\nThe Bill misses an opportunity to reform draconian telecom suspension & surveillance powers – leaving the duration & manner of shutdowns and interception to delegated legislation without an anchoring criteria. 7/11\n\nhttps://preview.redd.it/dgpt43pl577c1.png?width=1588&format=png&auto=webp&s=bad58fcf208872d25eae047e9c3c8c4b42ba844b\n\nhttps://preview.redd.it/eldsivpm577c1.png?width=1458&format=png&auto=webp&s=4b230ba9c86b3ee21475fb86b8e218674d04ad02\n\nIt suffers from excessive delegation by according the Union govt overbroad rule-making powers (a familiar pattern by now), incl. powers to exempt entities & uses, w/o adequate safeguards. At 46 instances, the Bill is left open to details that “may be prescribed”/“notified”. 8/11\n\nMoreover, the Bill confers quasi-judicial powers to “authorised officers” appointed by the Union govt, incl. powers of search and seizure of unauthorised telecom equipment, and power to summon information, documents, & records pertaining to legal proceedings under the Bill. \n\nhttps://preview.redd.it/tho3uiqo577c1.png?width=1876&format=png&auto=webp&s=f2d814ca5eedde1ec059b24960dddab9df839f17\n\nFinally, the penalty imposed on users for using ‘telecommunication services’ that they believe do not have authorisation under the Bill, has been increased from INR 1 Lakh to 10 Lakh. The hefty penal provision remains vague & arbitrary as its 2022 counterpart, but now with a 10x fine. 10/11 \n\nhttps://preview.redd.it/ptrx75ts577c1.png?width=1260&format=png&auto=webp&s=343842a35dd8e3e2735d1f1627631486251a3e0d\n\nWe stand against the introduction of the 2023 Telecom Bill in the Parliament which continues the pattern of excessive centralisation & control with the Executive. We’ve said it before, we’ll say it again, this bill needs to go. And be replaced with a rights-centric version. 11/11\n\n&#x200B;\n\n&#x200B;\n\n\\-------------------------------------------------\n\nWith the release of the Broadcasting Bill, 2023, now the draft Telecom Bill, 2023 and the rumoured upcoming DPDPA Rules, the fight for our digital rights is at a critical juncture.   📷📷  We need YOUR support now more than ever.  \n\n 🔻🔻🔻🔻There is a massive gap of over INR 23,00,000 in our income and expenditure between Jan 2023 to Nov 2023.   We need your help to bridge this gap before the year ends.   \n\n[https://internetfreedom.in/we-need-your-help-pls/](https://internetfreedom.in/we-need-your-help-pls/)\n\nhttps://preview.redd.it/a7b2pzcz577c1.png?width=1600&format=png&auto=webp&s=2d2705cd38dd0b87cc9b7c3b7966f06d7924d4ef",
    "flair": "Policy/Economy",
    "score": 178,
    "num_comments": 15,
    "created_utc": 1702967987.0,
    "convurl": "https://external-preview.redd.it/DUgZ2WdBm-bpSdXiw1Icn19EpdBNBvurBvPRLFY3Prk.jpg?auto=webp&s=0f153a74c3eeda317362efbc29537eb7e6c4c62a",
    "comments": [
        "Previously VPN providers were mandated to share user info to the government. Now they want to control the internet directly. \n\nSoon they will somehow try to categorise you according to which party you like, and discriminate against you for government services, jobs, loans etc.",
        "As per [this X post by meghnad](https://twitter.com/Memeghnad/status/1736638913748623591),\n\nBroadcast Bill:  \n\n- Allows the government to control & punish everyone who is communicating on the internet (termed \"broadcasters\").  \n- It is bringing literally everyone under their regulatory control, the govt will be able to take selective action on people with independent youtube channels or even twitter journalists who post videos here.   \n- it gives powers to 'authorized officers' to raid and seize equipment from broadcast networks or broadcasting services as well.\n\nTelecommunication Bill:  \n\n- allows centre to take control of any telecommunication services or network.  \n- allows centre to direct any message from any person can be intercepted or detained.   \n- allows centre to force any person to disclose these messages in intelligible format to the concerned officer.",
        "I'm afraid something big is going to happen before election",
        "Like ?",
        "1984",
        "If the sub is private, would it not bypass the broadcast laws since, by definition, broadcast can/should be received by everyone, and a private sub can be argued as multi-cast since people outside the sub will not have access.",
        "Surely, this will not hold in court right? (If it ever reaches there)",
        "That's what they want, to isolate as many people as the can.",
        "India is fucked . Such a beautiful country gone to ashes",
        "This is so bad, technically they can pass, this makes the law undebated, unilateral push down the throat",
        "Just donated to IFF. What these guys do is super important so even the smallest amount makes a lot of difference.",
        "It's just a matter of time.",
        "As the other reply says, that kills the virality/messaging/signaling/organizing/proselytizing aspect of ones commentary & messaging/content. Makes it into a large or glorified whatsapp group/communities feature almost.\n\nAnd YET, even this is likely to fall under some other law. Like conspiracy to organize secretly. The non-public aspect of that community then itself becomes a tool to demean the forum's existence among the public.\n\nA public platform is more immune to this attack vector since everything is in the open.",
        "Thank you for the support u/testuser514 ✊✊",
        "No issues, I’m happy to contribute because you guys actually write about the details and breakdown of the legislation. Keep up the detailed work, the newspapers and the journalism outlets don’t do this anymore."
    ],
    "cleaned_text": "statement telecommunication bill introduced last minute parliament amid protests suspension saga mps concerns statement telecommunication bill makes significant departures counterpart concerns old glaring new quite concerning unsure roots changes drumroll since dot never published consultation comments definition telecom service bill much shorter doesnt mention entities act apply current ambiguous definitions make explicitly clear internet services messaging email etc come ambit bill allowed union govt issue licences providing telecom services bill repackaged introduced similar concept authorisation allowing union govt retain powers thus addressing concerns around centralisation power bill exacerbates privacy invading provisions obligation authorised entity notified union govt identify person provides telecom services use verifiable biometric based identification may prescribed bill reference biometric identification coupled uncertainty brought phrase may prescribed ambit bill threatens users ability stay anonymous online dot carried forward duty imposed users furnish false information establishing identity availing telecommunication services provision applicable internet services serious implications anonymity online bill misses opportunity reform draconian telecom suspension surveillance powers leaving duration manner shutdowns interception delegated legislation without anchoring criteria suffers excessive delegation according union govt overbroad rulemaking powers familiar pattern incl powers exempt entities uses wo adequate safeguards instances bill left open details may prescribednotified moreover bill confers quasijudicial powers authorised officers appointed union govt incl powers search seizure unauthorised telecom equipment power summon information documents records pertaining legal proceedings bill finally penalty imposed users using telecommunication services believe authorisation bill increased inr lakh lakh hefty penal provision remains vague arbitrary counterpart x fine stand introduction telecom bill parliament continues pattern excessive centralisation control executive weve said well say bill needs go replaced rightscentric version xb xb release broadcasting bill draft telecom bill rumoured upcoming dpdpa rules fight digital rights critical juncture need support ever massive gap inr income expenditure jan nov need help bridge gap year ends httpsinternetfreedominweneedyourhelpplshttpsinternetfreedominweneedyourhelppls ",
    "cleaned_title": "statement telecommunication bill introduced last minute parliament amid protests suspension saga mps concerns",
    "cleaned_selftext": "statement telecommunication bill makes significant departures counterpart concerns old glaring new quite concerning unsure roots changes drumroll since dot never published consultation comments definition telecom service bill much shorter doesnt mention entities act apply current ambiguous definitions make explicitly clear internet services messaging email etc come ambit bill allowed union govt issue licences providing telecom services bill repackaged introduced similar concept authorisation allowing union govt retain powers thus addressing concerns around centralisation power bill exacerbates privacy invading provisions obligation authorised entity notified union govt identify person provides telecom services use verifiable biometric based identification may prescribed bill reference biometric identification coupled uncertainty brought phrase may prescribed ambit bill threatens users ability stay anonymous online dot carried forward duty imposed users furnish false information establishing identity availing telecommunication services provision applicable internet services serious implications anonymity online bill misses opportunity reform draconian telecom suspension surveillance powers leaving duration manner shutdowns interception delegated legislation without anchoring criteria suffers excessive delegation according union govt overbroad rulemaking powers familiar pattern incl powers exempt entities uses wo adequate safeguards instances bill left open details may prescribednotified moreover bill confers quasijudicial powers authorised officers appointed union govt incl powers search seizure unauthorised telecom equipment power summon information documents records pertaining legal proceedings bill finally penalty imposed users using telecommunication services believe authorisation bill increased inr lakh lakh hefty penal provision remains vague arbitrary counterpart x fine stand introduction telecom bill parliament continues pattern excessive centralisation control executive weve said well say bill needs go replaced rightscentric version xb xb release broadcasting bill draft telecom bill rumoured upcoming dpdpa rules fight digital rights critical juncture need support ever massive gap inr income expenditure jan nov need help bridge gap year ends httpsinternetfreedominweneedyourhelpplshttpsinternetfreedominweneedyourhelppls",
    "cleaned_comments": "previously vpn providers mandated share user info government want control internet directly soon somehow try categorise according party like discriminate government services jobs loans etc per x post meghnadhttpstwittercommemeghnadstatus broadcast bill allows government control punish everyone communicating internet termed broadcasters bringing literally everyone regulatory control govt able take selective action people independent youtube channels even twitter journalists post videos gives powers authorized officers raid seize equipment broadcast networks broadcasting services well telecommunication bill allows centre take control telecommunication services network allows centre direct message person intercepted detained allows centre force person disclose messages intelligible format concerned officer im afraid something big going happen election like sub private would bypass broadcast laws since definition broadcast canshould received everyone private sub argued multicast since people outside sub access surely hold court right ever reaches thats want isolate many people india fucked beautiful country gone ashes bad technically pass makes law undebated unilateral push throat donated iff guys super important even smallest amount makes lot difference matter time reply says kills viralitymessagingsignalingorganizingproselytizing aspect ones commentary messagingcontent makes large glorified whatsapp groupcommunities feature almost yet even likely fall law like conspiracy organize secretly nonpublic aspect community becomes tool demean forums existence among public public platform immune attack vector since everything open thank support utestuser issues im happy contribute guys actually write details breakdown legislation keep detailed work newspapers journalism outlets dont anymore",
    "light_cleaned_title": "STATEMENT: The Telecommunication Bill, 2023 was introduced last minute in the parliament amid protests and the suspension saga of MPs | Ours concerns 👇",
    "light_cleaned_selftext": "STATEMENT: The Telecommunication Bill, 2023 makes significant departures from its 2022 counterpart. Our concerns? Some same old, glaring. Some new, & quite concerning. We're unsure about the roots of these changes, \\*drumroll\\* since DOT never published the consultation comments. The definition of ‘telecom service” in the 2023 Bill is much shorter & doesn't mention the entities to whom the Act will apply to. The current ambiguous definitions do not make it explicitly clear that internet services (messaging, email, etc.) do not come under its ambit. 2/11 The 2022 Bill allowed the Union govt to issue licences for providing telecom services. The 2023 Bill has repackaged & introduced a similar concept of “authorisation”, allowing the Union govt to retain same powers, thus not addressing concerns around centralisation of power. 3/11 The 2023 Bill exacerbates privacy invading provisions such as the obligation of any authorised entity, as notified by the Union govt, to identify the person to whom it provides telecom services, through use of any verifiable biometric based identification “as may be prescribed”. 4/11 The 2022 Bill did not reference biometric identification. This, coupled with the uncertainty brought by the phrase “as may be prescribed”, and ambit of the bill, threatens to a user’s ability to stay anonymous online. 5/11 The DoT has carried forward the duty imposed on users to not furnish any false information while establishing their identity for availing ‘telecommunication services’. This provision, if applicable to internet services, will have serious implications for anonymity online. 6/11 **T7** The Bill misses an opportunity to reform draconian telecom suspension & surveillance powers – leaving the duration & manner of shutdowns and interception to delegated legislation without an anchoring criteria. 7/11 It suffers from excessive delegation by according the Union govt overbroad rule-making powers (a familiar pattern by now), incl. powers to exempt entities & uses, w/o adequate safeguards. At 46 instances, the Bill is left open to details that “may be prescribed”/“notified”. 8/11 Moreover, the Bill confers quasi-judicial powers to “authorised officers” appointed by the Union govt, incl. powers of search and seizure of unauthorised telecom equipment, and power to summon information, documents, & records pertaining to legal proceedings under the Bill. Finally, the penalty imposed on users for using ‘telecommunication services’ that they believe do not have authorisation under the Bill, has been increased from INR 1 Lakh to 10 Lakh. The hefty penal provision remains vague & arbitrary as its 2022 counterpart, but now with a 10x fine. 10/11 We stand against the introduction of the 2023 Telecom Bill in the Parliament which continues the pattern of excessive centralisation & control with the Executive. We’ve said it before, we’ll say it again, this bill needs to go. And be replaced with a rights-centric version. 11/11 &#x200B; &#x200B; \\------------------------------------------------- With the release of the Broadcasting Bill, 2023, now the draft Telecom Bill, 2023 and the rumoured upcoming DPDPA Rules, the fight for our digital rights is at a critical juncture. 📷📷 We need YOUR support now more than ever. 🔻🔻🔻🔻There is a massive gap of over INR 23,00,000 in our income and expenditure between Jan 2023 to Nov 2023. We need your help to bridge this gap before the year ends. [https://internetfreedom.in/we-need-your-help-pls/](https://internetfreedom.in/we-need-your-help-pls/)",
    "light_cleaned_comments": "Previously VPN providers were mandated to share user info to the government. Now they want to control the internet directly. Soon they will somehow try to categorise you according to which party you like, and discriminate against you for government services, jobs, loans etc. As per [this X post by meghnad](https://twitter.com/Memeghnad/status/1736638913748623591), Broadcast Bill: - Allows the government to control & punish everyone who is communicating on the internet (termed \"broadcasters\"). - It is bringing literally everyone under their regulatory control, the govt will be able to take selective action on people with independent youtube channels or even twitter journalists who post videos here. - it gives powers to 'authorized officers' to raid and seize equipment from broadcast networks or broadcasting services as well. Telecommunication Bill: - allows centre to take control of any telecommunication services or network. - allows centre to direct any message from any person can be intercepted or detained. - allows centre to force any person to disclose these messages in intelligible format to the concerned officer. I'm afraid something big is going to happen before election Like ? 1984 If the sub is private, would it not bypass the broadcast laws since, by definition, broadcast can/should be received by everyone, and a private sub can be argued as multi-cast since people outside the sub will not have access. Surely, this will not hold in court right? (If it ever reaches there) That's what they want, to isolate as many people as the can. India is fucked . Such a beautiful country gone to ashes This is so bad, technically they can pass, this makes the law undebated, unilateral push down the throat Just donated to IFF. What these guys do is super important so even the smallest amount makes a lot of difference. It's just a matter of time. As the other reply says, that kills the virality/messaging/signaling/organizing/proselytizing aspect of ones commentary & messaging/content. Makes it into a large or glorified whatsapp group/communities feature almost. And YET, even this is likely to fall under some other law. Like conspiracy to organize secretly. The non-public aspect of that community then itself becomes a tool to demean the forum's existence among the public. A public platform is more immune to this attack vector since everything is in the open. Thank you for the support u/testuser514 ✊✊ No issues, I’m happy to contribute because you guys actually write about the details and breakdown of the legislation. Keep up the detailed work, the newspapers and the journalism outlets don’t do this anymore."
}