{
    "id": "14ws9xe",
    "title": "Research Survey for Indian Folk Art x Animation",
    "url": "https://www.reddit.com/r/india/comments/14ws9xe/research_survey_for_indian_folk_art_x_animation/",
    "selftext": "Hello everyone! I am conducting a short research survey based on the effective use of Indian Folk Art x Animation as representation of concerns and / or identity of marginalized communities in India. Please do help me out by filling up this survey. The survey is open for all.\n\nIt is a bit extensive because you will have to watch two short films as part of this survey, but it might also increase your awareness on some beautiful applications on the said theme. You can find the form here -\n\n[https://forms.gle/88DozzWCWtLuuXkt8](https://forms.gle/88DozzWCWtLuuXkt8)\n\nThank you for your consideration :)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1689084114.0,
    "convurl": "https://external-preview.redd.it/Bvk45_YzNJTCsPXn1n5PcYNA2IYSUEQvjAbpSQAR4lc.jpg?auto=webp&v=enabled&s=bed051919124e3543f9950a7569f369a979c5558",
    "comments": [],
    "cleaned_text": "research survey indian folk art x animation hello everyone conducting short research survey based effective use indian folk art x animation representation concerns identity marginalized communities india please help filling survey survey open bit extensive watch two short films part survey might also increase awareness beautiful applications said theme find form httpsformsgledozzwcwtluuxkthttpsformsgledozzwcwtluuxkt thank consideration ",
    "cleaned_title": "research survey indian folk art x animation",
    "cleaned_selftext": "hello everyone conducting short research survey based effective use indian folk art x animation representation concerns identity marginalized communities india please help filling survey survey open bit extensive watch two short films part survey might also increase awareness beautiful applications said theme find form httpsformsgledozzwcwtluuxkthttpsformsgledozzwcwtluuxkt thank consideration",
    "cleaned_comments": "",
    "light_cleaned_title": "Research Survey for Indian Folk Art x Animation",
    "light_cleaned_selftext": "Hello everyone! I am conducting a short research survey based on the effective use of Indian Folk Art x Animation as representation of concerns and / or identity of marginalized communities in India. Please do help me out by filling up this survey. The survey is open for all. It is a bit extensive because you will have to watch two short films as part of this survey, but it might also increase your awareness on some beautiful applications on the said theme. You can find the form here - [https://forms.gle/88DozzWCWtLuuXkt8](https://forms.gle/88DozzWCWtLuuXkt8) Thank you for your consideration :)",
    "light_cleaned_comments": ""
}