{
    "id": "1hcj0gn",
    "title": "Supreme Court on Places of Worship Act Challenges: 'No Further Suits,' Asks Union Govt to File Reply",
    "url": "https://thewire.in/law/supreme-court-places-of-worship-act-no-further-suits",
    "selftext": "The Supreme Court today, December 12, ordered the Union government to file its counter-affidavit within four weeks as it hears the batch of petitions challenging provisions of the Places of Worship (Special Provisions) Act of 1991. It also said that no further suits – ostensibly asking for surveys of religious structures – can be registered till it hears and disposes of these pleas.",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1734002639,
    "convurl": "https://external-preview.redd.it/LmrDbhyhUANmXPsAlti9Ckm0zIEB8axKv8UgtBIP-ls.jpg?auto=webp&s=a2ac7eefc0f946d0f27901a7faa5acf729d923ba",
    "comments": [
        "No further suits.\n\n  \nSo, they are happy with what's already registered. These ashats know how to toe the line of not being called out.\n\n  \nWe are doomed."
    ],
    "cleaned_text": "supreme court places worship act challenges suits asks union govt file reply supreme court today december ordered union government file counteraffidavit within four weeks hears batch petitions challenging provisions places worship special provisions act also said suits ostensibly asking surveys religious structures registered till hears disposes pleas ",
    "cleaned_title": "supreme court places worship act challenges suits asks union govt file reply",
    "cleaned_selftext": "supreme court today december ordered union government file counteraffidavit within four weeks hears batch petitions challenging provisions places worship special provisions act also said suits ostensibly asking surveys religious structures registered till hears disposes pleas",
    "cleaned_comments": "suits happy whats already registered ashats know toe line called doomed",
    "light_cleaned_title": "Supreme Court on Places of Worship Act Challenges: 'No Further Suits,' Asks Union Govt to File Reply",
    "light_cleaned_selftext": "The Supreme Court today, December 12, ordered the Union government to file its counter-affidavit within four weeks as it hears the batch of petitions challenging provisions of the Places of Worship (Special Provisions) Act of 1991. It also said that no further suits – ostensibly asking for surveys of religious structures – can be registered till it hears and disposes of these pleas.",
    "light_cleaned_comments": "No further suits. So, they are happy with what's already registered. These ashats know how to toe the line of not being called out. We are doomed."
}