{
    "id": "18mwbjj",
    "title": "My 7 Month Child is fighting with Rare Disease called called Criglar najar sydndorme Because of this disease his liver will be replaced,please save my son life come forward to contribute as much u can. 🙂🙏🏻if ur not financially capable please UPVOTE ❤️ this post so it will reach right audience",
    "url": "https://www.reddit.com/gallery/18mwbjj",
    "selftext": "Think before ignoring 🙂 I am begging for my child i can do anything to save my kid ❤️\n\nUpi id :- [UPI ](https://donationtosavemykid.blogspot.com/2023/12/donate-by-scan-this-qr-or-copy-this-upi.html) \nYou can contact me if u do any financial help for me 9833223018 🙂\n......................................................................\n[Impact Guru Crowdfunding Link ](https://www.impactguru.com/fundraiser/help-for-baby-of-shabnam?utm_source=new_campaigner_app_119&utm_medium=share&utm_campaign=link)\n\nSoo i am Clearing some points as rised on previous post :-\n\nQ1) Many people's are asking that my reddit account is new.\nAns) My friend recommended me to post on reddit there are many peoples who genuinely come forward to help so i post here that's why I made and posting.\n\n2) My baby surgery date have been fixed its 2nd January 2024 And the date of my first surgery was written as 25th December and it was to be on the same day but the Govt Authority meeting was not held because the dates were not available and then the surgeon Dr Gaurav Chubal sir was also not available so the date of surgery was 2nd January.\n\n3) 2 days back I was very happy because someone donated 5 lakhs on campaign and i was about to reach my goal amount but suddenly got to know that the person by mistakenly put extra 0 n that amount is going to reverse soon.\n\n4) Now people will ask why Goal amount is increased soo 16.5 lakhs is surgery cost, 2.5 lakhs is infection control cost and 6 lakhs for post transplant cost as also mentioned on hospital estimate letter.\nWe are only raising 19 lakhs and i can manage post transplant cost which is 6 lakhs\nSo i request you to come forward and contribute something and share more to others people's.\n\n5) If you need any verification, Kindly connect with me +91-9833223018 or Hospital or Impactguru you will get the answer\nPlz if you have any doubt confirm it then comment, I request you all to help me to reach my goal amount and Save my kid life 🙏🏻\n[Document Proof ](https://donationtosavemykid.blogspot.com/2023/12/document-proof.html?m=1)",
    "flair": "Rant / Vent",
    "score": 525,
    "num_comments": 31,
    "created_utc": 1703083770.0,
    "convurl": "https://i.redd.it/pga5k2cfqg7c1.jpg",
    "comments": [
        "If anyone still have any queries 🙏🏻🙂 they can ask me",
        "CFBR",
        "Don't worrry champ U will be get well soon 💓\nDonate Little Amount from my side God help u 😊",
        "Donated whatever small amount I could at the moment. Hope your child gets well soon!",
        "He's not scamming guys. I had a chat with him and he proved his identity and his photo, name, address etc. He posted on r/India but some really suspicious accounts spammed the thread with \"scam yo this is scam\". Watch out for these accounts. Those are mainly all non-Indian accounts with no activity in Indian subs, but only commenting on that particular post. If you see those accounts again or similar accounts, just ignore. Some clown mad@c@od trolls.\n\nu/YulandaYaLittleBitch u/TheShenanegous u/DMforOpinions u/T50BMG u/Agile_Difference5618 u/ibite-books u/BombshellTom u/cuyler72 u/Forever-Unenlightend u/Miniteshi u/Itsluc u/beepboopbananas3298 u/AidsRiddled u/lookmasilverone u/azzasg1",
        "I hope your child gets well soon.",
        "shyt I could only donate a little :(\n\nGod will help u brthaa stay strong :)",
        "Praying for his speedy recovery 🙏",
        "Where is the donation link? I can't find it on any of the threads OP has posted",
        "Did my part , God bless your son . He will be perfactly fine soon\n\nhttps://preview.redd.it/ao6a50on7m7c1.jpeg?width=1080&format=pjpg&auto=webp&s=da1546343936295692188041398f9f3445f736e0",
        "Made a small contribution! Things will get better !",
        "Just donated. Praying also.",
        "Cfbr",
        "I have contributed to the fundraiser and I also pray to God the baby grows up healthy and strong. Please update us....",
        "Just donated via UPI - sending the little one all the love and blessings ❤️ please do keep us posted",
        "Cfbr",
        "Cdbr",
        "Cfbr",
        "Cfbr",
        "Cfbr",
        "Cfbr",
        "Hi just donated via UPI. Praying for speedy recovery",
        "Did my part, couldn't so much as am a student currently, but best wishes to the baby, leaving this comment for blessings : )",
        "Done my part. May god fulfill all ur prayers..god bless❤️",
        "https://preview.redd.it/q6na31g3xp7c1.png?width=1080&format=pjpg&auto=webp&s=fd1845980fd6faf27ab9e6db8cbbea2c796043f6\n\nStay strong, your child will be all right in some day :) God bless.",
        "https://www.impactguru.com/fundraiser/help-for-baby-of-shabnam?utm_source=new_campaigner_app_119&utm_medium=share&utm_campaign=link",
        "I have donated, hope your baby is ok",
        "Just donated $70. God speed.",
        "Any idea on how much the kid needs and how much has been arranged so far? Asking so I could decide my contribution amount.",
        "Don’t worry, little buddy! You’re a fighter! You will Come back healthy and safe post op!",
        "Total treatment cost is 21 lakhs \nTill I have arranged 18laks",
        "Donated as much as I could at the moment, you stay strong sir! Nothing will happen to your baby. He’s very lucky to have you as father.",
        "Donated $100. \n\nIf you are not able to make your goal, please reply to this comment with what I dm'd you. I will try and donate more. Hope everything works out.",
        "First of all thank you sir for your contribution 🙏🏻\nDon't want to ask for more but still want more  donation cause still 18% gap for reaching the goal amount \nIt will be glad if u contribute more for saving a soul 🙏🏻",
        "Did my part❤️",
        "Better verify before claiming it as a scam! When such life or death situations occur, please don’t go by your inner Sherlock Holmes peanut sized brain!",
        "I did whatever amount i could may your baby have speedy recovery … god bless",
        "Ok Aunty",
        ":)",
        "$200 more. Looks like reddit is helping out.\n\nReply to this by Jan-1 if you are unable to meet your goal. Will try and fill in the gap once I get my next pay check. So don't stress out!",
        "Thanks for ur support surgery is on at 2 January",
        "Shoot! Sent you what I could. What is the latest you can wait? I will try and get more after xmas.",
        "[https://www.reddit.com/r/india/comments/18nge34/lets\\_stop\\_misinformation\\_and\\_fake\\_theories\\_lets/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/18nge34/lets_stop_misinformation_and_fake_theories_lets/?utm_source=share&utm_medium=web2x&context=3)",
        "[https://www.reddit.com/r/india/comments/18nge34/lets\\_stop\\_misinformation\\_and\\_fake\\_theories\\_lets/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/18nge34/lets_stop_misinformation_and_fake_theories_lets/?utm_source=share&utm_medium=web2x&context=3)",
        "[https://www.reddit.com/r/india/comments/18nge34/lets\\_stop\\_misinformation\\_and\\_fake\\_theories\\_lets/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/18nge34/lets_stop_misinformation_and_fake_theories_lets/?utm_source=share&utm_medium=web2x&context=3)  \nthis is genuine",
        "Please keep us updated if you haven’t reached your goal by 31st so we all can chip in more.\n\nSending prayers and strength to you and your family.",
        "Thank you so much its means alot to me.\nI cannot sleep lots of things are going on in my head.\nI would also like to inform everyone that i myself going to donate some part of liver to my son pray for us."
    ],
    "cleaned_text": "month child fighting rare disease called called criglar najar sydndorme disease liver replacedplease save son life come forward contribute much u ur financially capable please upvote post reach right audience think ignoring begging child anything save kid upi id upi httpsdonationtosavemykidblogspotcomdonatebyscanthisqrorcopythisupihtml contact u financial help impact guru crowdfunding link httpswwwimpactgurucomfundraiserhelpforbabyofshabnamutmsourcenewcampaignerapputmmediumshareutmcampaignlink soo clearing points rised previous post q many peoples asking reddit account new ans friend recommended post reddit many peoples genuinely come forward help post thats made posting baby surgery date fixed nd january date first surgery written th december day govt authority meeting held dates available surgeon dr gaurav chubal sir also available date surgery nd january days back happy someone donated lakhs campaign reach goal amount suddenly got know person mistakenly put extra n amount going reverse soon people ask goal amount increased soo lakhs surgery cost lakhs infection control cost lakhs post transplant cost also mentioned hospital estimate letter raising lakhs manage post transplant cost lakhs request come forward contribute something share others peoples need verification kindly connect hospital impactguru get answer plz doubt confirm comment request help reach goal amount save kid life document proof httpsdonationtosavemykidblogspotcomdocumentproofhtmlm ",
    "cleaned_title": "month child fighting rare disease called called criglar najar sydndorme disease liver replacedplease save son life come forward contribute much u ur financially capable please upvote post reach right audience",
    "cleaned_selftext": "think ignoring begging child anything save kid upi id upi httpsdonationtosavemykidblogspotcomdonatebyscanthisqrorcopythisupihtml contact u financial help impact guru crowdfunding link httpswwwimpactgurucomfundraiserhelpforbabyofshabnamutmsourcenewcampaignerapputmmediumshareutmcampaignlink soo clearing points rised previous post q many peoples asking reddit account new ans friend recommended post reddit many peoples genuinely come forward help post thats made posting baby surgery date fixed nd january date first surgery written th december day govt authority meeting held dates available surgeon dr gaurav chubal sir also available date surgery nd january days back happy someone donated lakhs campaign reach goal amount suddenly got know person mistakenly put extra n amount going reverse soon people ask goal amount increased soo lakhs surgery cost lakhs infection control cost lakhs post transplant cost also mentioned hospital estimate letter raising lakhs manage post transplant cost lakhs request come forward contribute something share others peoples need verification kindly connect hospital impactguru get answer plz doubt confirm comment request help reach goal amount save kid life document proof httpsdonationtosavemykidblogspotcomdocumentproofhtmlm",
    "cleaned_comments": "anyone still queries ask cfbr dont worrry champ u get well soon donate little amount side god help u donated whatever small amount could moment hope child gets well soon hes scamming guys chat proved identity photo name address etc posted rindia really suspicious accounts spammed thread scam yo scam watch accounts mainly nonindian accounts activity indian subs commenting particular post see accounts similar accounts ignore clown madcod trolls uyulandayalittlebitch utheshenanegous udmforopinions utbmg uagiledifference uibitebooks ubombshelltom ucuyler uforeverunenlightend uminiteshi uitsluc ubeepboopbananas uaidsriddled ulookmasilverone uazzasg hope child gets well soon shyt could donate little god help u brthaa stay strong praying speedy recovery donation link cant find threads op posted part god bless son perfactly fine soon made small contribution things get better donated praying also cfbr contributed fundraiser also pray god baby grows healthy strong please update us donated via upi sending little one love blessings please keep us posted cfbr cdbr cfbr cfbr cfbr cfbr hi donated via upi praying speedy recovery part couldnt much student currently best wishes baby leaving comment blessings done part may god fulfill ur prayersgod bless stay strong child right day god bless donated hope baby ok donated god speed idea much kid needs much arranged far asking could decide contribution amount dont worry little buddy youre fighter come back healthy safe post op total treatment cost lakhs till arranged laks donated much could moment stay strong sir nothing happen baby hes lucky father donated able make goal please reply comment dmd try donate hope everything works first thank sir contribution dont want ask still want donation cause still gap reaching goal amount glad u contribute saving soul part better verify claiming scam life death situations occur please dont go inner sherlock holmes peanut sized brain whatever amount could may baby speedy recovery god bless ok aunty looks like reddit helping reply jan unable meet goal try fill gap get next pay check dont stress thanks ur support surgery january shoot sent could latest wait try get xmas httpswwwredditcomrindiacommentsngeletsstopmisinformationandfaketheoriesletsutmsourceshareutmmediumwebxcontexthttpswwwredditcomrindiacommentsngeletsstopmisinformationandfaketheoriesletsutmsourceshareutmmediumwebxcontext httpswwwredditcomrindiacommentsngeletsstopmisinformationandfaketheoriesletsutmsourceshareutmmediumwebxcontexthttpswwwredditcomrindiacommentsngeletsstopmisinformationandfaketheoriesletsutmsourceshareutmmediumwebxcontext httpswwwredditcomrindiacommentsngeletsstopmisinformationandfaketheoriesletsutmsourceshareutmmediumwebxcontexthttpswwwredditcomrindiacommentsngeletsstopmisinformationandfaketheoriesletsutmsourceshareutmmediumwebxcontext genuine please keep us updated havent reached goal st chip sending prayers strength family thank much means alot sleep lots things going head would also like inform everyone going donate part liver son pray us",
    "light_cleaned_title": "My 7 Month Child is fighting with Rare Disease called called Criglar najar sydndorme Because of this disease his liver will be replaced,please save my son life come forward to contribute as much u can. 🙂🙏🏻if ur not financially capable please UPVOTE ❤️ this post so it will reach right audience",
    "light_cleaned_selftext": "Think before ignoring 🙂 I am begging for my child i can do anything to save my kid ❤️ Upi id :- [UPI ](https://donationtosavemykid.blogspot.com/2023/12/donate-by-scan-this-qr-or-copy-this-upi.html) You can contact me if u do any financial help for me 9833223018 🙂 ...................................................................... [Impact Guru Crowdfunding Link ](https://www.impactguru.com/fundraiser/help-for-baby-of-shabnam?utm_source=new_campaigner_app_119&utm_medium=share&utm_campaign=link) Soo i am Clearing some points as rised on previous post :- Q1) Many people's are asking that my reddit account is new. Ans) My friend recommended me to post on reddit there are many peoples who genuinely come forward to help so i post here that's why I made and posting. 2) My baby surgery date have been fixed its 2nd January 2024 And the date of my first surgery was written as 25th December and it was to be on the same day but the Govt Authority meeting was not held because the dates were not available and then the surgeon Dr Gaurav Chubal sir was also not available so the date of surgery was 2nd January. 3) 2 days back I was very happy because someone donated 5 lakhs on campaign and i was about to reach my goal amount but suddenly got to know that the person by mistakenly put extra 0 n that amount is going to reverse soon. 4) Now people will ask why Goal amount is increased soo 16.5 lakhs is surgery cost, 2.5 lakhs is infection control cost and 6 lakhs for post transplant cost as also mentioned on hospital estimate letter. We are only raising 19 lakhs and i can manage post transplant cost which is 6 lakhs So i request you to come forward and contribute something and share more to others people's. 5) If you need any verification, Kindly connect with me +91-9833223018 or Hospital or Impactguru you will get the answer Plz if you have any doubt confirm it then comment, I request you all to help me to reach my goal amount and Save my kid life 🙏🏻 [Document Proof ](https://donationtosavemykid.blogspot.com/2023/12/document-proof.html?m=1)",
    "light_cleaned_comments": "If anyone still have any queries 🙏🏻🙂 they can ask me CFBR Don't worrry champ U will be get well soon 💓 Donate Little Amount from my side God help u 😊 Donated whatever small amount I could at the moment. Hope your child gets well soon! He's not scamming guys. I had a chat with him and he proved his identity and his photo, name, address etc. He posted on r/India but some really suspicious accounts spammed the thread with \"scam yo this is scam\". Watch out for these accounts. Those are mainly all non-Indian accounts with no activity in Indian subs, but only commenting on that particular post. If you see those accounts again or similar accounts, just ignore. Some clown mad@c@od trolls. u/YulandaYaLittleBitch u/TheShenanegous u/DMforOpinions u/T50BMG u/Agile_Difference5618 u/ibite-books u/BombshellTom u/cuyler72 u/Forever-Unenlightend u/Miniteshi u/Itsluc u/beepboopbananas3298 u/AidsRiddled u/lookmasilverone u/azzasg1 I hope your child gets well soon. shyt I could only donate a little :( God will help u brthaa stay strong :) Praying for his speedy recovery 🙏 Where is the donation link? I can't find it on any of the threads OP has posted Did my part , God bless your son . He will be perfactly fine soon Made a small contribution! Things will get better ! Just donated. Praying also. Cfbr I have contributed to the fundraiser and I also pray to God the baby grows up healthy and strong. Please update us.... Just donated via UPI - sending the little one all the love and blessings ❤️ please do keep us posted Cfbr Cdbr Cfbr Cfbr Cfbr Cfbr Hi just donated via UPI. Praying for speedy recovery Did my part, couldn't so much as am a student currently, but best wishes to the baby, leaving this comment for blessings : ) Done my part. May god fulfill all ur prayers..god bless❤️ Stay strong, your child will be all right in some day :) God bless. I have donated, hope your baby is ok Just donated $70. God speed. Any idea on how much the kid needs and how much has been arranged so far? Asking so I could decide my contribution amount. Don’t worry, little buddy! You’re a fighter! You will Come back healthy and safe post op! Total treatment cost is 21 lakhs Till I have arranged 18laks Donated as much as I could at the moment, you stay strong sir! Nothing will happen to your baby. He’s very lucky to have you as father. Donated $100. If you are not able to make your goal, please reply to this comment with what I dm'd you. I will try and donate more. Hope everything works out. First of all thank you sir for your contribution 🙏🏻 Don't want to ask for more but still want more donation cause still 18% gap for reaching the goal amount It will be glad if u contribute more for saving a soul 🙏🏻 Did my part❤️ Better verify before claiming it as a scam! When such life or death situations occur, please don’t go by your inner Sherlock Holmes peanut sized brain! I did whatever amount i could may your baby have speedy recovery … god bless Ok Aunty :) $200 more. Looks like reddit is helping out. Reply to this by Jan-1 if you are unable to meet your goal. Will try and fill in the gap once I get my next pay check. So don't stress out! Thanks for ur support surgery is on at 2 January Shoot! Sent you what I could. What is the latest you can wait? I will try and get more after xmas. [https://www.reddit.com/r/india/comments/18nge34/lets\\_stop\\_misinformation\\_and\\_fake\\_theories\\_lets/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/18nge34/lets_stop_misinformation_and_fake_theories_lets/?utm_source=share&utm_medium=web2x&context=3) [https://www.reddit.com/r/india/comments/18nge34/lets\\_stop\\_misinformation\\_and\\_fake\\_theories\\_lets/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/18nge34/lets_stop_misinformation_and_fake_theories_lets/?utm_source=share&utm_medium=web2x&context=3) [https://www.reddit.com/r/india/comments/18nge34/lets\\_stop\\_misinformation\\_and\\_fake\\_theories\\_lets/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/india/comments/18nge34/lets_stop_misinformation_and_fake_theories_lets/?utm_source=share&utm_medium=web2x&context=3) this is genuine Please keep us updated if you haven’t reached your goal by 31st so we all can chip in more. Sending prayers and strength to you and your family. Thank you so much its means alot to me. I cannot sleep lots of things are going on in my head. I would also like to inform everyone that i myself going to donate some part of liver to my son pray for us."
}