{
    "id": "15lgbgu",
    "title": "Union govt looks to move libraries from State to Concurrent List; Kerala, Karnataka flag concerns",
    "url": "https://thesouthfirst.com/karnataka/union-government-looks-to-move-libraries-from-state-to-concurrent-list-kerala-karnataka-flag-concerns/",
    "selftext": "Kerala’s Higher Education Minister R Bindu said the move was aimed at usurping control of knowledge dissemination and routing regressive ideas through the library system.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1691496383.0,
    "convurl": "https://external-preview.redd.it/fDUUeBffxWaNz07Yejo9RHRv5FtfMfLdLiPkPhfOw6g.jpg?auto=webp&s=ca13152d29c89210e1ee525a571d552fad0a264b",
    "comments": [
        "North India isn't satisfied with turning into and remaining a shithole. It wants all other regions to also turn into shitholes.",
        "Union govt is interested in turning everything to a centrally controlled departments",
        "This is necessary to ensure that only books supporting the ideology of party in power at are available in these libraries.No books promoting critical thing/ alternate ideology are present in these libraries..",
        "They already control online content. This way, they can control what you read offline too.",
        "except PSU",
        "Those will be centrally controlled by adani and ambani when muddyji and gang are done with their giveaway."
    ],
    "cleaned_text": "union govt looks move libraries state concurrent list kerala karnataka flag concerns keralas higher education minister r bindu said move aimed usurping control knowledge dissemination routing regressive ideas library system ",
    "cleaned_title": "union govt looks move libraries state concurrent list kerala karnataka flag concerns",
    "cleaned_selftext": "keralas higher education minister r bindu said move aimed usurping control knowledge dissemination routing regressive ideas library system",
    "cleaned_comments": "north india isnt satisfied turning remaining shithole wants regions also turn shitholes union govt interested turning everything centrally controlled departments necessary ensure books supporting ideology party power available librariesno books promoting critical thing alternate ideology present libraries already control online content way control read offline except psu centrally controlled adani ambani muddyji gang done giveaway",
    "light_cleaned_title": "Union govt looks to move libraries from State to Concurrent List; Kerala, Karnataka flag concerns",
    "light_cleaned_selftext": "Kerala’s Higher Education Minister R Bindu said the move was aimed at usurping control of knowledge dissemination and routing regressive ideas through the library system.",
    "light_cleaned_comments": "North India isn't satisfied with turning into and remaining a shithole. It wants all other regions to also turn into shitholes. Union govt is interested in turning everything to a centrally controlled departments This is necessary to ensure that only books supporting the ideology of party in power at are available in these libraries.No books promoting critical thing/ alternate ideology are present in these libraries.. They already control online content. This way, they can control what you read offline too. except PSU Those will be centrally controlled by adani and ambani when muddyji and gang are done with their giveaway."
}