{
    "id": "1hbtppo",
    "title": "Nothing’s gonna change !",
    "url": "https://i.redd.it/z7bendds386e1.jpeg",
    "selftext": "We can be sad all we want but let’s be honest : nothing’s going to change. Whom are we kidding to assume that Atul’s case will be a pivotal moment and bring about a change in the Indian lawmakers and judiciary’s mindset. Even now the judge wasn’t named in the FIR. Kangana (yes she’s an MP so a law maker) said that in 99 percent of cases men are to blame with so much conviction that you would think that she just didn’t pull that stat from her rear. You can already see women everywhere giving a counter that this case isn’t a gender issue rather a system failing an individual. So we can rant, we can hope and pray for justice but the practical me knows that in a few days we will forget about it and the case would be put on a back burner and the only one still suffering would be Atul’s parents and brother. And that monster of a wife, MIL and lady judge would continue enjoying life as usual. \n\nSometimes I think we should all be a chill guy: drink, play, enjoy the world, be focused on career and don’t marry and just see the relationships getting eff’d up with all these nonsensical gender biased laws which have already made people rethink about marriages",
    "flair": "Rant / Vent",
    "score": 47,
    "num_comments": 8,
    "created_utc": 1733924508.0,
    "convurl": "https://i.redd.it/z7bendds386e1.jpeg",
    "comments": [
        "This picture depicts a subtle and modest way of showing a middle finger. \nWhat Indian Judiciary does raise their hand high up in the air and show us the finger. Like Ranbir Kapoor did in Rockstar. They do it in front of the whole damn world and don't even care about being nice and subtle about it.",
        "We need some modifications in the current laws of dv inheritance , property division etc . The laws were made almost 6 or 7 decades ago. Times have changed now both men and women can be the victims",
        "Indian judiciary system when a *victim* 🖕\n\nWhen a powerful politician or bureaucrat 🥰\n\nLet's not get divided into gender,caste, religion guys",
        "Well who will explain it to the ones lording over us and the remnants of the colonial times our my lords. As someone else pointed out these laws have no meaning when it comes to the rich and famous of whatever gender. They will get justice or their own version of justice. And commoners can either not marry or live in fear forever",
        "I hope at least this case can shed some light on the issue .",
        "Agree with the Rick and powerful part. For them it’s either justice as per law or they even have the luxury of their own justice. For this case and more like it, it’s hard not to think from a gender perspective when every male becomes a rapist after a rape case. Now making this a case of justice denied is plain wrong",
        "Hope is the pill we are being served for the longest time now … as you say then… hope it is"
    ],
    "cleaned_text": "nothings gon na change sad want lets honest nothings going change kidding assume atuls case pivotal moment bring change indian lawmakers judiciarys mindset even judge wasnt named fir kangana yes shes mp law maker said percent cases men blame much conviction would think didnt pull stat rear already see women everywhere giving counter case isnt gender issue rather system failing individual rant hope pray justice practical knows days forget case would put back burner one still suffering would atuls parents brother monster wife mil lady judge would continue enjoying life usual sometimes think chill guy drink play enjoy world focused career dont marry see relationships getting effd nonsensical gender biased laws already made people rethink marriages ",
    "cleaned_title": "nothings gon na change",
    "cleaned_selftext": "sad want lets honest nothings going change kidding assume atuls case pivotal moment bring change indian lawmakers judiciarys mindset even judge wasnt named fir kangana yes shes mp law maker said percent cases men blame much conviction would think didnt pull stat rear already see women everywhere giving counter case isnt gender issue rather system failing individual rant hope pray justice practical knows days forget case would put back burner one still suffering would atuls parents brother monster wife mil lady judge would continue enjoying life usual sometimes think chill guy drink play enjoy world focused career dont marry see relationships getting effd nonsensical gender biased laws already made people rethink marriages",
    "cleaned_comments": "picture depicts subtle modest way showing middle finger indian judiciary raise hand high air show us finger like ranbir kapoor rockstar front whole damn world dont even care nice subtle need modifications current laws dv inheritance property division etc laws made almost decades ago times changed men women victims indian judiciary system victim powerful politician bureaucrat lets get divided gendercaste religion guys well explain ones lording us remnants colonial times lords someone else pointed laws meaning comes rich famous whatever gender get justice version justice commoners either marry live fear forever hope least case shed light issue agree rick powerful part either justice per law even luxury justice case like hard think gender perspective every male becomes rapist rape case making case justice denied plain wrong hope pill served longest time say hope",
    "light_cleaned_title": "Nothing’s gonna change !",
    "light_cleaned_selftext": "We can be sad all we want but let’s be honest : nothing’s going to change. Whom are we kidding to assume that Atul’s case will be a pivotal moment and bring about a change in the Indian lawmakers and judiciary’s mindset. Even now the judge wasn’t named in the FIR. Kangana (yes she’s an MP so a law maker) said that in 99 percent of cases men are to blame with so much conviction that you would think that she just didn’t pull that stat from her rear. You can already see women everywhere giving a counter that this case isn’t a gender issue rather a system failing an individual. So we can rant, we can hope and pray for justice but the practical me knows that in a few days we will forget about it and the case would be put on a back burner and the only one still suffering would be Atul’s parents and brother. And that monster of a wife, MIL and lady judge would continue enjoying life as usual. Sometimes I think we should all be a chill guy: drink, play, enjoy the world, be focused on career and don’t marry and just see the relationships getting eff’d up with all these nonsensical gender biased laws which have already made people rethink about marriages",
    "light_cleaned_comments": "This picture depicts a subtle and modest way of showing a middle finger. What Indian Judiciary does raise their hand high up in the air and show us the finger. Like Ranbir Kapoor did in Rockstar. They do it in front of the whole damn world and don't even care about being nice and subtle about it. We need some modifications in the current laws of dv inheritance , property division etc . The laws were made almost 6 or 7 decades ago. Times have changed now both men and women can be the victims Indian judiciary system when a *victim* 🖕 When a powerful politician or bureaucrat 🥰 Let's not get divided into gender,caste, religion guys Well who will explain it to the ones lording over us and the remnants of the colonial times our my lords. As someone else pointed out these laws have no meaning when it comes to the rich and famous of whatever gender. They will get justice or their own version of justice. And commoners can either not marry or live in fear forever I hope at least this case can shed some light on the issue . Agree with the Rick and powerful part. For them it’s either justice as per law or they even have the luxury of their own justice. For this case and more like it, it’s hard not to think from a gender perspective when every male becomes a rapist after a rape case. Now making this a case of justice denied is plain wrong Hope is the pill we are being served for the longest time now … as you say then… hope it is"
}