{
    "id": "1981lxt",
    "title": "Modi government | Niti Aayog makes huge poverty relief claim, several economists raise objections - Telegraph India",
    "url": "https://www.telegraphindia.com/india/niti-aayog-makes-huge-poverty-relief-claim-several-economists-raise-objections/cid/1994004",
    "selftext": "\nThe last poverty estimate was done in 2011-12 by applying the Tendulkar methodology after price indexation, and based on the last consumption pattern data obtained from the latest NSSO survey. According to that estimate, 21.9 per cent Indians were BPL in 2011-12.\n\nThe next poverty estimate should have come after five years but hasn’t been conducted yet. The government has not released the Household Consumer Expenditure Survey report for 2017-18, citing high divergence between the survey findings and \"administrative data\".\n\nAccording to a report in Business Standard, the NSO survey — conducted between July 2017 and June 2018 — found a fall in consumer spending for the first time in more than four decades.\n\nthere is the big mystery as to why there has been a slide in India's performance on the World Hunger Index in recent times if there has been such impressive reductions in poverty",
    "flair": "Policy/Economy",
    "score": 19,
    "num_comments": 1,
    "created_utc": 1705407493.0,
    "convurl": "https://external-preview.redd.it/QTqX27pvJ8e-xuWgWoMRAl7dygCHVkld6EoAauoozAI.jpg?auto=webp&s=d71aeb0348bc3347fc38505050dd41c132efa53f",
    "comments": [
        "Modi gormint and data have opposing tendencies. Truth retired to Kashi a while ago."
    ],
    "cleaned_text": "modi government niti aayog makes huge poverty relief claim several economists raise objections telegraph india last poverty estimate done applying tendulkar methodology price indexation based last consumption pattern data obtained latest nsso survey according estimate per cent indians bpl next poverty estimate come five years hasnt conducted yet government released household consumer expenditure survey report citing high divergence survey findings administrative data according report business standard nso survey conducted july june found fall consumer spending first time four decades big mystery slide indias performance world hunger index recent times impressive reductions poverty ",
    "cleaned_title": "modi government niti aayog makes huge poverty relief claim several economists raise objections telegraph india",
    "cleaned_selftext": "last poverty estimate done applying tendulkar methodology price indexation based last consumption pattern data obtained latest nsso survey according estimate per cent indians bpl next poverty estimate come five years hasnt conducted yet government released household consumer expenditure survey report citing high divergence survey findings administrative data according report business standard nso survey conducted july june found fall consumer spending first time four decades big mystery slide indias performance world hunger index recent times impressive reductions poverty",
    "cleaned_comments": "modi gormint data opposing tendencies truth retired kashi ago",
    "light_cleaned_title": "Modi government | Niti Aayog makes huge poverty relief claim, several economists raise objections - Telegraph India",
    "light_cleaned_selftext": "The last poverty estimate was done in 2011-12 by applying the Tendulkar methodology after price indexation, and based on the last consumption pattern data obtained from the latest NSSO survey. According to that estimate, 21.9 per cent Indians were BPL in 2011-12. The next poverty estimate should have come after five years but hasn’t been conducted yet. The government has not released the Household Consumer Expenditure Survey report for 2017-18, citing high divergence between the survey findings and \"administrative data\". According to a report in Business Standard, the NSO survey — conducted between July 2017 and June 2018 — found a fall in consumer spending for the first time in more than four decades. there is the big mystery as to why there has been a slide in India's performance on the World Hunger Index in recent times if there has been such impressive reductions in poverty",
    "light_cleaned_comments": "Modi gormint and data have opposing tendencies. Truth retired to Kashi a while ago."
}