{
    "id": "16w203o",
    "title": "I am being made to pay extra on delivery by Tata 1mg. I had already paid 298, which was the checkout screen said.",
    "url": "https://www.reddit.com/gallery/16w203o",
    "selftext": "They're asking me to pay an extra of 178 at the time of delivery. This has got to be illegal right? Where can I complain? What can I do? i didn't accept the order. I had the order delayed by the delivery agent. \n\nPlease help me guys.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696064528.0,
    "convurl": "https://i.redd.it/ki42qddmycrb1.jpg",
    "comments": [
        "Pagal ho Gaye Hain ye. \n\nRecently tried to order some meds for my dad.\n\nAnd they said to order 800 rs more to get free delivery 🙄\n\nBC dawai mangwani hai rashan nahi",
        "They told me about an hour ago that they will call in no more than 30 minutes. Never using this shit again",
        "Don't order from online. They will call you and recommend you cheaper version or some alternative more effective medicn/brand. Those people get their comminsion",
        "The most fraud company on the planet.",
        "All the medicine app are fraud in India.",
        "Trying to understand the issue. In the 2nd pic, item mrp says 510. They're giving you for 423.55 with 53 shipping charges. I don't see 298 here. Not sure why you paid 298 when item cost is 423.55?",
        "Yeah. Wtf is going on. Do they offer split payment option? Half online half offline?",
        "I have always used Tata 1 mg, especially for homeopathic medicines and I have never had any issues. Your second picture clearly says 178 to be paid. Seems to be some kind of confusion.",
        "Then where would you rank Flipkart and Jiomart.",
        "God only knows their marketing strategies. I mean 20-30 bucks save karne k liye aur 800 bucks spend karna hoga! Isse aacha local store se le lenge.",
        "Apparently they shipped a newer version of the item whose MRP was higher while what they had at checkout was the older version."
    ],
    "cleaned_text": "made pay extra delivery tata mg already paid checkout screen said theyre asking pay extra time delivery got illegal right complain didnt accept order order delayed delivery agent please help guys ",
    "cleaned_title": "made pay extra delivery tata mg already paid checkout screen said",
    "cleaned_selftext": "theyre asking pay extra time delivery got illegal right complain didnt accept order order delayed delivery agent please help guys",
    "cleaned_comments": "pagal ho gaye hain ye recently tried order meds dad said order rs get free delivery bc dawai mangwani hai rashan nahi told hour ago call minutes never using shit dont order online call recommend cheaper version alternative effective medicnbrand people get comminsion fraud company planet medicine app fraud india trying understand issue nd pic item mrp says theyre giving shipping charges dont see sure paid item cost yeah wtf going offer split payment option half online half offline always used tata mg especially homeopathic medicines never issues second picture clearly says paid seems kind confusion would rank flipkart jiomart god knows marketing strategies mean bucks save karne k liye aur bucks spend karna hoga isse aacha local store se le lenge apparently shipped newer version item whose mrp higher checkout older version",
    "light_cleaned_title": "I am being made to pay extra on delivery by Tata 1mg. I had already paid 298, which was the checkout screen said.",
    "light_cleaned_selftext": "They're asking me to pay an extra of 178 at the time of delivery. This has got to be illegal right? Where can I complain? What can I do? i didn't accept the order. I had the order delayed by the delivery agent. Please help me guys.",
    "light_cleaned_comments": "Pagal ho Gaye Hain ye. Recently tried to order some meds for my dad. And they said to order 800 rs more to get free delivery 🙄 BC dawai mangwani hai rashan nahi They told me about an hour ago that they will call in no more than 30 minutes. Never using this shit again Don't order from online. They will call you and recommend you cheaper version or some alternative more effective medicn/brand. Those people get their comminsion The most fraud company on the planet. All the medicine app are fraud in India. Trying to understand the issue. In the 2nd pic, item mrp says 510. They're giving you for 423.55 with 53 shipping charges. I don't see 298 here. Not sure why you paid 298 when item cost is 423.55? Yeah. Wtf is going on. Do they offer split payment option? Half online half offline? I have always used Tata 1 mg, especially for homeopathic medicines and I have never had any issues. Your second picture clearly says 178 to be paid. Seems to be some kind of confusion. Then where would you rank Flipkart and Jiomart. God only knows their marketing strategies. I mean 20-30 bucks save karne k liye aur 800 bucks spend karna hoga! Isse aacha local store se le lenge. Apparently they shipped a newer version of the item whose MRP was higher while what they had at checkout was the older version."
}