{
    "id": "167qtah",
    "title": "What Happens When Alien Driven UFOs Start Using Our Own Nukes Against Us?",
    "url": "https://www.reddit.com/r/india/comments/167qtah/what_happens_when_alien_driven_ufos_start_using/",
    "selftext": "There have been UFO sightings over nuclear facilities since cold war. These sightings indicate that the UFOs have been collecting reconnaissance.\n\nLink - https://www.history.com/news/ufos-near-nuclear-facilities-uss-roosevelt-rendlesham\n\nI was watching a video of Ross Coulthart and Curt Jaimungal where Ross mentioned that UFOs have \"On\" the nukes in India. Ross Coulthart is a popular UFO Journalist and Author.\n\nLink - https://youtu.be/JM3kxeU_oDE?si=GmonnVvD2oxeLT2U\n\n I am aware of mental exercises involving MAD, in case one country uses a nuke against the other. \n\nBut, if an alien species triggers a nuke, I am wondering how would this play out ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693622631.0,
    "convurl": "https://external-preview.redd.it/z9haFQjlAF17Vwj1-K2GliuRHZRpQHlEuns05zEUwjM.jpg?auto=webp&s=8e26420fa09b2622e9bee4bb9b2fdc9e365d4286",
    "comments": [
        "I have full faith in Humanity. We won’t need any Alien intervention, we will do it ourselves, Nuke each other.",
        "WTF did I just read? Have some \"normal\" problems brother!\n\nReally, really \"normal\" problems, because this shit is abnormal as hell.",
        "Lol!",
        "Is a forthcoming nuke attack a black swan event ? \n\nIn case you don't know what a Black Swan Event is : Link - https://en.m.wikipedia.org/wiki/Black_swan_theory",
        "Either of the two things are true\n1. You're doing great in life and don't have any problems around you either in family or community\n2. You're a lazy person who has nothing to do but only conspiracy theories.\n\n\nCold war passed, the bay of pigs crisis went away, and the Cuban missile crisis passed two. Soviet Russia disintegrated. Russia has been invading Ukraine for about two years now. Butttttttt, no nuke.\n\nNo aliens found so far with concrete evidence, and even if they are found, and attacked, then believe me, people aren't like you daydreaming, they are actually working on things, scientists, physicists, so they will take care of it. Butttttttt for your information, Voyager has been around Oort clouds, and no sign of life found.\n\n\nSo, get out of your nutshell, look around.\nMaybe your area has no proper roads, maybe someone is begging on the streets, maybe a member of your family needs you, maybe the current situation of your country demands your attention, and maybe your society needs you to solve some \"real\" problems. Go for it, solve them, instead of busting your head into these clumsy conspiracy theories.\n\nPS: sorry if there are some spelling mistakes, or if I'm too harsh. I'm going to bed.",
        "https://reddit.com/r/india/s/m0w5JheM0L",
        "Either of the two things are true\n1. You're doing great in life and don't have any problems arround you either in family or community\n2. You're a lazy person who has nothing to do but only conspiracy theories.\n\n\nCold war passed, bay of pigs crisis went away, and Cuban missile crisis passed two. Soviet Russia disintegrated. Russia has been invading Ukraine for about two years now. Butttttttt, no nuke.\n\nNo aliens found so far with concrete evidences, and even if they are found, and attack, then believe me, people aren't like you daydreaming, they are actually working on things, scientists, physicists, so they will take care of it. Butttttttt for your information, Voyager has been around Oort clouds, and no sign of life found.\n\n\nSo, get out of your nutshell, look around.\nMaybe your area has no proper roads, maybe someone is begging on the streets, maybe a member of your family needs you, maybe the current situation of your country demands your attention, and maybe your society needs you to solve some \"real\" problems. Go for it, solve them, instead of busting your head into these clumsy conspiracy theories.",
        "I have been down the UFO rabbit hole. I am completely convinced that extraterrestrial life exists in our universe. \n\nAlso my conclusion was exactly what Stephan Hawking said -\n\"If the government is covering up knowledge of aliens, they are doing a better job of it than they do at anything else.\"",
        "So the government, which has the information is hiding it, and you, with access to some \"rabbit hole\" randomly decided to believe in the existence of UFO, even when you lack the evidence?",
        "Answer me this - If you were an Advanced Species, what evidence would you leave for a primitive one, so that in future when the primitive specie advances it looks at the evidence and concludes that we are out there in space ?",
        "Enlighten me with your own answer, Sir Dumb-ledore!",
        "Something with a strong material that last for thousands of years and more. \n\nEgyptian Pyramids is a good example.",
        "May I DM you? Because things are getting pretty interesting!",
        "Anyways, pyramids were built by humans, there is historical evidence for it.",
        "Fox maulder and agent Scully would save us.",
        "If they can travel through vast space, they as much already have something more powerful. Why would they be worried about nukes of some random country?",
        "I love X-Files. It's a classic 90s science fiction series.\n\nBut, I also think some of the truth of what's happening is revealed in the show.",
        "If they are an advanced species, maybe nukes are the only weapons that humans have that can damage them ?"
    ],
    "cleaned_text": "happens alien driven ufos start using nukes us ufo sightings nuclear facilities since cold war sightings indicate ufos collecting reconnaissance link watching video ross coulthart curt jaimungal ross mentioned ufos nukes india ross coulthart popular ufo journalist author link aware mental exercises involving mad case one country uses nuke alien species triggers nuke wondering would play ",
    "cleaned_title": "happens alien driven ufos start using nukes us",
    "cleaned_selftext": "ufo sightings nuclear facilities since cold war sightings indicate ufos collecting reconnaissance link watching video ross coulthart curt jaimungal ross mentioned ufos nukes india ross coulthart popular ufo journalist author link aware mental exercises involving mad case one country uses nuke alien species triggers nuke wondering would play",
    "cleaned_comments": "full faith humanity wont need alien intervention nuke wtf read normal problems brother really really normal problems shit abnormal hell lol forthcoming nuke attack black swan event case dont know black swan event link either two things true youre great life dont problems around either family community youre lazy person nothing conspiracy theories cold war passed bay pigs crisis went away cuban missile crisis passed two soviet russia disintegrated russia invading ukraine two years butttttttt nuke aliens found far concrete evidence even found attacked believe people arent like daydreaming actually working things scientists physicists take care butttttttt information voyager around oort clouds sign life found get nutshell look around maybe area proper roads maybe someone begging streets maybe member family needs maybe current situation country demands attention maybe society needs solve real problems go solve instead busting head clumsy conspiracy theories ps sorry spelling mistakes im harsh im going bed either two things true youre great life dont problems arround either family community youre lazy person nothing conspiracy theories cold war passed bay pigs crisis went away cuban missile crisis passed two soviet russia disintegrated russia invading ukraine two years butttttttt nuke aliens found far concrete evidences even found attack believe people arent like daydreaming actually working things scientists physicists take care butttttttt information voyager around oort clouds sign life found get nutshell look around maybe area proper roads maybe someone begging streets maybe member family needs maybe current situation country demands attention maybe society needs solve real problems go solve instead busting head clumsy conspiracy theories ufo rabbit hole completely convinced extraterrestrial life exists universe also conclusion exactly stephan hawking said government covering knowledge aliens better job anything else government information hiding access rabbit hole randomly decided believe existence ufo even lack evidence answer advanced species evidence would leave primitive one future primitive specie advances looks evidence concludes space enlighten answer sir dumbledore something strong material last thousands years egyptian pyramids good example may dm things getting pretty interesting anyways pyramids built humans historical evidence fox maulder agent scully would save us travel vast space much already something powerful would worried nukes random country love xfiles classic science fiction series also think truth whats happening revealed show advanced species maybe nukes weapons humans damage",
    "light_cleaned_title": "What Happens When Alien Driven UFOs Start Using Our Own Nukes Against Us?",
    "light_cleaned_selftext": "There have been UFO sightings over nuclear facilities since cold war. These sightings indicate that the UFOs have been collecting reconnaissance. Link - I was watching a video of Ross Coulthart and Curt Jaimungal where Ross mentioned that UFOs have \"On\" the nukes in India. Ross Coulthart is a popular UFO Journalist and Author. Link - I am aware of mental exercises involving MAD, in case one country uses a nuke against the other. But, if an alien species triggers a nuke, I am wondering how would this play out ?",
    "light_cleaned_comments": "I have full faith in Humanity. We won’t need any Alien intervention, we will do it ourselves, Nuke each other. WTF did I just read? Have some \"normal\" problems brother! Really, really \"normal\" problems, because this shit is abnormal as hell. Lol! Is a forthcoming nuke attack a black swan event ? In case you don't know what a Black Swan Event is : Link - Either of the two things are true 1. You're doing great in life and don't have any problems around you either in family or community 2. You're a lazy person who has nothing to do but only conspiracy theories. Cold war passed, the bay of pigs crisis went away, and the Cuban missile crisis passed two. Soviet Russia disintegrated. Russia has been invading Ukraine for about two years now. Butttttttt, no nuke. No aliens found so far with concrete evidence, and even if they are found, and attacked, then believe me, people aren't like you daydreaming, they are actually working on things, scientists, physicists, so they will take care of it. Butttttttt for your information, Voyager has been around Oort clouds, and no sign of life found. So, get out of your nutshell, look around. Maybe your area has no proper roads, maybe someone is begging on the streets, maybe a member of your family needs you, maybe the current situation of your country demands your attention, and maybe your society needs you to solve some \"real\" problems. Go for it, solve them, instead of busting your head into these clumsy conspiracy theories. PS: sorry if there are some spelling mistakes, or if I'm too harsh. I'm going to bed. Either of the two things are true 1. You're doing great in life and don't have any problems arround you either in family or community 2. You're a lazy person who has nothing to do but only conspiracy theories. Cold war passed, bay of pigs crisis went away, and Cuban missile crisis passed two. Soviet Russia disintegrated. Russia has been invading Ukraine for about two years now. Butttttttt, no nuke. No aliens found so far with concrete evidences, and even if they are found, and attack, then believe me, people aren't like you daydreaming, they are actually working on things, scientists, physicists, so they will take care of it. Butttttttt for your information, Voyager has been around Oort clouds, and no sign of life found. So, get out of your nutshell, look around. Maybe your area has no proper roads, maybe someone is begging on the streets, maybe a member of your family needs you, maybe the current situation of your country demands your attention, and maybe your society needs you to solve some \"real\" problems. Go for it, solve them, instead of busting your head into these clumsy conspiracy theories. I have been down the UFO rabbit hole. I am completely convinced that extraterrestrial life exists in our universe. Also my conclusion was exactly what Stephan Hawking said - \"If the government is covering up knowledge of aliens, they are doing a better job of it than they do at anything else.\" So the government, which has the information is hiding it, and you, with access to some \"rabbit hole\" randomly decided to believe in the existence of UFO, even when you lack the evidence? Answer me this - If you were an Advanced Species, what evidence would you leave for a primitive one, so that in future when the primitive specie advances it looks at the evidence and concludes that we are out there in space ? Enlighten me with your own answer, Sir Dumb-ledore! Something with a strong material that last for thousands of years and more. Egyptian Pyramids is a good example. May I DM you? Because things are getting pretty interesting! Anyways, pyramids were built by humans, there is historical evidence for it. Fox maulder and agent Scully would save us. If they can travel through vast space, they as much already have something more powerful. Why would they be worried about nukes of some random country? I love X-Files. It's a classic 90s science fiction series. But, I also think some of the truth of what's happening is revealed in the show. If they are an advanced species, maybe nukes are the only weapons that humans have that can damage them ?"
}