{
    "id": "14v0awg",
    "title": "An example of patriarchy harming men - part 1",
    "url": "https://www.reddit.com/r/india/comments/14v0awg/an_example_of_patriarchy_harming_men_part_1/",
    "selftext": "I have seen a few men complain that a married man will have to pay for the wife’s child, even if he is not the father of the child because of a Supreme Court judgement. Most of these men are patriarchal.\n\nThis is arguably a fair ask. We are just asking for the biological father to pay for his own child.\n\nLet's see what the Supreme Court has said on the issue (in simple words):\n\n\"The Supreme Court has ruled that a DNA test cannot be routinely ordered in every paternity dispute even if the wife is said to be in an adulterous relationship, as the aggrieved husband is duty-bound to prove that he had no sexual “access” to his wife woman at the time the child was conceived.\n\nThe court said Section 112 of the Indian Evidence Act imposed a presumption of the child’s paternity on the father during the subsistence \\[maintenance\\] of a marriage, which must be rebutted with strong cogent evidence.\" --1\n\n\"Children have the right not to have their legitimacy questioned frivolously before a Court of Law. This is an essential attribute of the right to privacy.\" --2\n\nWhy did The Court say so? Whatever courts say they say based on the laws and their interpretations. Laws are above the courts. In this case, we have a law on the matter.\n\nSounds absurd, right? Looks like it was written by feminists or god-forbid feminazis!!!! This entirely favours the women right? Well, let me break your notion.\n\nWhat Section 112 is trying to say is that a woman, in this case, a wife, is the duty of the husband — blame the husband for his wife having intercourse with another man. He was supposed to make sure that it does not happen. Women should not act on their own after all. How could they? Thus he has to prove that when the child was conceived, he wasn't the one having intercourse with her. Additionally, the husband is the one who has to maintain the marriage, hence he has to raise the child as that child is legitimate.\n\nDon't believe me? The Indian Evidence Act was written in 1872. 18-frickkin-72!!!! The world was patriarchal in every way that you can think of. This is why it has such an absurd view. But it ultimately benefits the man, giving the control and responsibility of the wife to the man. Thus in most cases, if the man was with his wife (not in a faraway place), it's better to see the child as legitimate and not question the man for having an unfaithful wife.\n\nStill not convinced? Thinking it was written by a feminist? The law was written by James Fitzjames Stephen. He thought like all men during those times. This is what I could find on him:\n\nStephen held conservative views on gender roles and women's rights during his time. Stephen expressed scepticism about the women's suffrage movement, arguing against giving women the right to vote. In his book \"Liberty, Equality, Fraternity,\" he criticised John Stuart Mill's views on women's rights and equality. He believed that women were naturally suited to a domestic sphere and argued against their participation in the public and political realms.\n\nThus the act was written by a patriarchal man, during patriarchal times, making the act patriarchal. And today we men are crying over it. How it has come full circle!!!\n\nTalking about the privacy of the child. The key word is 'legitimacy' of the child, which is a phrase that's old by millennia. It kept bastards from claiming rights to a man's property because marriages were sacred. In our present times, where people have intercourse before weddings and also have live-in relationships, we should not be concerned about the legitimacy of any child. Every single person born should be considered a legitimate child, with equal rights to the property of its parents. When everyone is legitimate, the right to privacy argument gets thrown out of the window.\n\nWhat should be done about it? Well, ask the government to update a law from 1872. This would make a paternity test admissible in the courts if it gets proven that the wife was having an affair.\n\nJust blaming feminists or feminazis won't do. I am sick of men crying about having laws and systems that benefit the woman unfairly but acting submissive to the government. Ask your government. It is the government's duty to uphold your rights. Rights are above laws.\n\nCitations: --1 [https://www.telegraphindia.com/india/dna-test-not-must-in-paternity-dispute-supreme-court/cid/1918065](https://www.telegraphindia.com/india/dna-test-not-must-in-paternity-dispute-supreme-court/cid/1918065)\n\n\\--2 [https://www.jurist.org/news/2023/02/india-dispatch-supreme-court-limits-dna-paternity-testing-in-divorce-proceedings-prioritizing-childrens-privacy-rights/](https://www.jurist.org/news/2023/02/india-dispatch-supreme-court-limits-dna-paternity-testing-in-divorce-proceedings-prioritizing-childrens-privacy-rights/)",
    "flair": "Politics",
    "score": 3,
    "num_comments": 2,
    "created_utc": 1688913790.0,
    "convurl": "https://external-preview.redd.it/p978fXfDp0Lj759ZwINPGd7OdMe9ojqHJ77YmwApyjo.jpg?auto=webp&v=enabled&s=505666af25738137f3c94a16e0fd954c94d4b47a",
    "comments": [
        "The law is that way because back in the day there was no DNA test and hence the only way to rule out the possibility is if the husband wasn't even present but today we have the technology and adultery is also legal."
    ],
    "cleaned_text": "example patriarchy harming men part seen men complain married man pay wifes child even father child supreme court judgement men patriarchal arguably fair ask asking biological father pay child lets see supreme court said issue simple words supreme court ruled dna test routinely ordered every paternity dispute even wife said adulterous relationship aggrieved husband dutybound prove sexual access wife woman time child conceived court said section indian evidence act imposed presumption childs paternity father subsistence maintenance marriage must rebutted strong cogent evidence children right legitimacy questioned frivolously court law essential attribute right privacy court say whatever courts say say based laws interpretations laws courts case law matter sounds absurd right looks like written feminists godforbid feminazis entirely favours women right well let break notion section trying say woman case wife duty husband blame husband wife intercourse another man supposed make sure happen women act could thus prove child conceived wasnt one intercourse additionally husband one maintain marriage hence raise child child legitimate dont believe indian evidence act written frickkin world patriarchal every way think absurd view ultimately benefits man giving control responsibility wife man thus cases man wife faraway place better see child legitimate question man unfaithful wife still convinced thinking written feminist law written james fitzjames stephen thought like men times could find stephen held conservative views gender roles womens rights time stephen expressed scepticism womens suffrage movement arguing giving women right vote book liberty equality fraternity criticised john stuart mills views womens rights equality believed women naturally suited domestic sphere argued participation public political realms thus act written patriarchal man patriarchal times making act patriarchal today men crying come full circle talking privacy child key word legitimacy child phrase thats old millennia kept bastards claiming rights mans property marriages sacred present times people intercourse weddings also livein relationships concerned legitimacy child every single person born considered legitimate child equal rights property parents everyone legitimate right privacy argument gets thrown window done well ask government update law would make paternity test admissible courts gets proven wife affair blaming feminists feminazis wont sick men crying laws systems benefit woman unfairly acting submissive government ask government governments duty uphold rights rights laws citations httpswwwtelegraphindiacomindiadnatestnotmustinpaternitydisputesupremecourtcidhttpswwwtelegraphindiacomindiadnatestnotmustinpaternitydisputesupremecourtcid httpswwwjuristorgnewsindiadispatchsupremecourtlimitsdnapaternitytestingindivorceproceedingsprioritizingchildrensprivacyrightshttpswwwjuristorgnewsindiadispatchsupremecourtlimitsdnapaternitytestingindivorceproceedingsprioritizingchildrensprivacyrights ",
    "cleaned_title": "example patriarchy harming men part",
    "cleaned_selftext": "seen men complain married man pay wifes child even father child supreme court judgement men patriarchal arguably fair ask asking biological father pay child lets see supreme court said issue simple words supreme court ruled dna test routinely ordered every paternity dispute even wife said adulterous relationship aggrieved husband dutybound prove sexual access wife woman time child conceived court said section indian evidence act imposed presumption childs paternity father subsistence maintenance marriage must rebutted strong cogent evidence children right legitimacy questioned frivolously court law essential attribute right privacy court say whatever courts say say based laws interpretations laws courts case law matter sounds absurd right looks like written feminists godforbid feminazis entirely favours women right well let break notion section trying say woman case wife duty husband blame husband wife intercourse another man supposed make sure happen women act could thus prove child conceived wasnt one intercourse additionally husband one maintain marriage hence raise child child legitimate dont believe indian evidence act written frickkin world patriarchal every way think absurd view ultimately benefits man giving control responsibility wife man thus cases man wife faraway place better see child legitimate question man unfaithful wife still convinced thinking written feminist law written james fitzjames stephen thought like men times could find stephen held conservative views gender roles womens rights time stephen expressed scepticism womens suffrage movement arguing giving women right vote book liberty equality fraternity criticised john stuart mills views womens rights equality believed women naturally suited domestic sphere argued participation public political realms thus act written patriarchal man patriarchal times making act patriarchal today men crying come full circle talking privacy child key word legitimacy child phrase thats old millennia kept bastards claiming rights mans property marriages sacred present times people intercourse weddings also livein relationships concerned legitimacy child every single person born considered legitimate child equal rights property parents everyone legitimate right privacy argument gets thrown window done well ask government update law would make paternity test admissible courts gets proven wife affair blaming feminists feminazis wont sick men crying laws systems benefit woman unfairly acting submissive government ask government governments duty uphold rights rights laws citations httpswwwtelegraphindiacomindiadnatestnotmustinpaternitydisputesupremecourtcidhttpswwwtelegraphindiacomindiadnatestnotmustinpaternitydisputesupremecourtcid httpswwwjuristorgnewsindiadispatchsupremecourtlimitsdnapaternitytestingindivorceproceedingsprioritizingchildrensprivacyrightshttpswwwjuristorgnewsindiadispatchsupremecourtlimitsdnapaternitytestingindivorceproceedingsprioritizingchildrensprivacyrights",
    "cleaned_comments": "law way back day dna test hence way rule possibility husband wasnt even present today technology adultery also legal",
    "light_cleaned_title": "An example of patriarchy harming men - part 1",
    "light_cleaned_selftext": "I have seen a few men complain that a married man will have to pay for the wife’s child, even if he is not the father of the child because of a Supreme Court judgement. Most of these men are patriarchal. This is arguably a fair ask. We are just asking for the biological father to pay for his own child. Let's see what the Supreme Court has said on the issue (in simple words): \"The Supreme Court has ruled that a DNA test cannot be routinely ordered in every paternity dispute even if the wife is said to be in an adulterous relationship, as the aggrieved husband is duty-bound to prove that he had no sexual “access” to his wife woman at the time the child was conceived. The court said Section 112 of the Indian Evidence Act imposed a presumption of the child’s paternity on the father during the subsistence \\[maintenance\\] of a marriage, which must be rebutted with strong cogent evidence.\" --1 \"Children have the right not to have their legitimacy questioned frivolously before a Court of Law. This is an essential attribute of the right to privacy.\" --2 Why did The Court say so? Whatever courts say they say based on the laws and their interpretations. Laws are above the courts. In this case, we have a law on the matter. Sounds absurd, right? Looks like it was written by feminists or god-forbid feminazis!!!! This entirely favours the women right? Well, let me break your notion. What Section 112 is trying to say is that a woman, in this case, a wife, is the duty of the husband — blame the husband for his wife having intercourse with another man. He was supposed to make sure that it does not happen. Women should not act on their own after all. How could they? Thus he has to prove that when the child was conceived, he wasn't the one having intercourse with her. Additionally, the husband is the one who has to maintain the marriage, hence he has to raise the child as that child is legitimate. Don't believe me? The Indian Evidence Act was written in 1872. 18-frickkin-72!!!! The world was patriarchal in every way that you can think of. This is why it has such an absurd view. But it ultimately benefits the man, giving the control and responsibility of the wife to the man. Thus in most cases, if the man was with his wife (not in a faraway place), it's better to see the child as legitimate and not question the man for having an unfaithful wife. Still not convinced? Thinking it was written by a feminist? The law was written by James Fitzjames Stephen. He thought like all men during those times. This is what I could find on him: Stephen held conservative views on gender roles and women's rights during his time. Stephen expressed scepticism about the women's suffrage movement, arguing against giving women the right to vote. In his book \"Liberty, Equality, Fraternity,\" he criticised John Stuart Mill's views on women's rights and equality. He believed that women were naturally suited to a domestic sphere and argued against their participation in the public and political realms. Thus the act was written by a patriarchal man, during patriarchal times, making the act patriarchal. And today we men are crying over it. How it has come full circle!!! Talking about the privacy of the child. The key word is 'legitimacy' of the child, which is a phrase that's old by millennia. It kept bastards from claiming rights to a man's property because marriages were sacred. In our present times, where people have intercourse before weddings and also have live-in relationships, we should not be concerned about the legitimacy of any child. Every single person born should be considered a legitimate child, with equal rights to the property of its parents. When everyone is legitimate, the right to privacy argument gets thrown out of the window. What should be done about it? Well, ask the government to update a law from 1872. This would make a paternity test admissible in the courts if it gets proven that the wife was having an affair. Just blaming feminists or feminazis won't do. I am sick of men crying about having laws and systems that benefit the woman unfairly but acting submissive to the government. Ask your government. It is the government's duty to uphold your rights. Rights are above laws. Citations: --1 [https://www.telegraphindia.com/india/dna-test-not-must-in-paternity-dispute-supreme-court/cid/1918065](https://www.telegraphindia.com/india/dna-test-not-must-in-paternity-dispute-supreme-court/cid/1918065) \\--2 [https://www.jurist.org/news/2023/02/india-dispatch-supreme-court-limits-dna-paternity-testing-in-divorce-proceedings-prioritizing-childrens-privacy-rights/](https://www.jurist.org/news/2023/02/india-dispatch-supreme-court-limits-dna-paternity-testing-in-divorce-proceedings-prioritizing-childrens-privacy-rights/)",
    "light_cleaned_comments": "The law is that way because back in the day there was no DNA test and hence the only way to rule out the possibility is if the husband wasn't even present but today we have the technology and adultery is also legal."
}