{
    "id": "1efrls6",
    "title": "SUV driver arrested over Delhi Rau's IAS coaching centre deaths?",
    "url": "https://www.hindustantimes.com/india-news/who-was-suv-driver-arrested-over-delhi-raus-ias-coaching-centre-deaths-what-his-wife-said-my-husband-was-101722331417811.html",
    "selftext": "Just trying to make random people scapegoat. Why haven't they booked the authorities responsible for sewage system, the people who approved/didn't care about these constructions and designs. ",
    "flair": "Law & Courts",
    "score": 11,
    "num_comments": 8,
    "created_utc": 1722341054.0,
    "convurl": "https://external-preview.redd.it/_1T1Wq0gSutK1cE2E-hMlf-u1xzpLY7Xvjp3Isffdks.jpg?auto=webp&s=5d6d3140a7395f1e1195bf15aba753126fcef1a4",
    "comments": [
        "Nothing makes sense these days.",
        "Andher nagari chaupat raja vibes. \n\nIs every driver supposed to now know the architectural problems and hydrodynamics of every building in their city? The guy wasn't even speeding, just normally driving through a flooded street.",
        "This is so sad man.",
        "What kind of self respect do you have to sell off that one has to stoop down to this level of stupidity? Everyone apart from the police knows this is just a charade to save the real criminals. The buck stops way higher up the ladder.",
        "That's so true.",
        "I guess our legal system has become so dumb and corrupt they want to forget archimedes principle of displacement. There is no way that suv can increase the basement flooding in any meaningful way. It could probably be proven mathematically.",
        "same energy as when those rates ate all the 20 kgs of weed confiscated by police"
    ],
    "cleaned_text": "suv driver arrested delhi raus ias coaching centre deaths trying make random people scapegoat havent booked authorities responsible sewage system people approveddidnt care constructions designs ",
    "cleaned_title": "suv driver arrested delhi raus ias coaching centre deaths",
    "cleaned_selftext": "trying make random people scapegoat havent booked authorities responsible sewage system people approveddidnt care constructions designs",
    "cleaned_comments": "nothing makes sense days andher nagari chaupat raja vibes every driver supposed know architectural problems hydrodynamics every building city guy wasnt even speeding normally driving flooded street sad man kind self respect sell one stoop level stupidity everyone apart police knows charade save real criminals buck stops way higher ladder thats true guess legal system become dumb corrupt want forget archimedes principle displacement way suv increase basement flooding meaningful way could probably proven mathematically energy rates ate kgs weed confiscated police",
    "light_cleaned_title": "SUV driver arrested over Delhi Rau's IAS coaching centre deaths?",
    "light_cleaned_selftext": "Just trying to make random people scapegoat. Why haven't they booked the authorities responsible for sewage system, the people who approved/didn't care about these constructions and designs.",
    "light_cleaned_comments": "Nothing makes sense these days. Andher nagari chaupat raja vibes. Is every driver supposed to now know the architectural problems and hydrodynamics of every building in their city? The guy wasn't even speeding, just normally driving through a flooded street. This is so sad man. What kind of self respect do you have to sell off that one has to stoop down to this level of stupidity? Everyone apart from the police knows this is just a charade to save the real criminals. The buck stops way higher up the ladder. That's so true. I guess our legal system has become so dumb and corrupt they want to forget archimedes principle of displacement. There is no way that suv can increase the basement flooding in any meaningful way. It could probably be proven mathematically. same energy as when those rates ate all the 20 kgs of weed confiscated by police"
}