{
    "id": "1bun85v",
    "title": "Farmer Suicide Data from 2017-2021",
    "url": "https://i.redd.it/acf78u2n38sc1.png",
    "selftext": "It's pretty obvious that some states are hiding the data.",
    "flair": "Rant / Vent",
    "score": 3,
    "num_comments": 5,
    "created_utc": 1712132057.0,
    "convurl": "https://i.redd.it/acf78u2n38sc1.png",
    "comments": [
        "Didn't know there is farming done in the Andmans let alone farmers suicide",
        "Saaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaar comments incoming",
        "Interesting... Assuming that these datas are correct, then I wonder how it relates to climate change and moonson disruption?\n\n\nIt seems to me that the most affected states are the ones where agriculture is more reliant on monsoon waters :\n\n\nIn the North, the main rivers are fed by Himalayan glaciers and thus not so dependant on monsoonal rains, whereas Deccan's rivers are thoroughly dependant on monsoonal rains and a disruption in the monsoon season may signify a greater crop failure...\n\n\n\nI am just speculating and besides these, there must be other reasons of course .."
    ],
    "cleaned_text": "farmer suicide data pretty obvious states hiding data ",
    "cleaned_title": "farmer suicide data",
    "cleaned_selftext": "pretty obvious states hiding data",
    "cleaned_comments": "didnt know farming done andmans let alone farmers suicide saaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaar comments incoming interesting assuming datas correct wonder relates climate change moonson disruption seems affected states ones agriculture reliant monsoon waters north main rivers fed himalayan glaciers thus dependant monsoonal rains whereas deccans rivers thoroughly dependant monsoonal rains disruption monsoon season may signify greater crop failure speculating besides must reasons course",
    "light_cleaned_title": "Farmer Suicide Data from 2017-2021",
    "light_cleaned_selftext": "It's pretty obvious that some states are hiding the data.",
    "light_cleaned_comments": "Didn't know there is farming done in the Andmans let alone farmers suicide Saaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaar comments incoming Interesting... Assuming that these datas are correct, then I wonder how it relates to climate change and moonson disruption? It seems to me that the most affected states are the ones where agriculture is more reliant on monsoon waters : In the North, the main rivers are fed by Himalayan glaciers and thus not so dependant on monsoonal rains, whereas Deccan's rivers are thoroughly dependant on monsoonal rains and a disruption in the monsoon season may signify a greater crop failure... I am just speculating and besides these, there must be other reasons of course .."
}