{
    "id": "1bbxlwk",
    "title": "\"Disclose Electoral Bonds' Details By Tomorrow\": Top Court Rejects SBI Plea",
    "url": "https://www.ndtv.com/india-news/what-did-you-do-for-26-days-supreme-court-grills-sbi-on-electoral-bonds-5216384/amp/1",
    "selftext": ".",
    "flair": "Law & Courts",
    "score": 8,
    "num_comments": 4,
    "created_utc": 1710142524.0,
    "convurl": "https://external-preview.redd.it/dQTgklU8oI4W3L0PdrHFFiI19hyYDfWYUYDvdjG0lMQ.jpg?auto=webp&s=1508b8db5f150ac58b87c248ab779c837a379a81",
    "comments": [
        "The Supreme Court on Monday, March 11, dismissed the plea filed by the State Bank of India (SBI) seeking an extension till June 30 for disclosure of the data on electoral bonds. The five-judge bench headed by Chief Justice of India DY Chandrachud directed the  SBI to disclose details by the end of business hours on March 12, Tuesday. The Election Commission of India (ECI) shall publish the information on its website by 5 pm on March 15. The court directed the bank to comply with the prescribed timeline.",
        "– In the original judgement of February 15, the court had directed for disclosure of –\n1. Details of bonds purchased (date, name, denominations)\n2. Details of bonds redeemed by political parties (date of encashment, denominations)\n\nThe SBI claimed that these two details are readily available but in two separate silos.\n\nIn today’s order, the court has directed the SBI to disclose details of these two silos. There is no direction for SBI to match the two silos, and determine which company contributed how much to which party. After the disclosure, we are likely to have two lists – donors and parties – with no corelation.",
        "SBI application seeking extension till June 30 is dismissed.\n\n– The SBI has submitted that donor KYC, details of political parties are in two different silos.\n\n– The SBI has submitted that if two silos of info need to be shared, it can share details within 2-3 weeks.\n\n– The SBI has submitted that if donor details need to be matched with political parties, bank would require time till June 30.\n\n– Electoral bonds scheme stipulated that info furnished by buyer of bond shall be treated as confidential, and shall be disclosed only by orders of a court, law enforcement agencies.\n\n– The SBI is mandated to disclose info when demanded by a court.",
        "Massive W",
        "https://preview.redd.it/e74y07dyunnc1.jpeg?width=600&format=pjpg&auto=webp&s=6721f78f7da482c407fb8cc11c1cdaa1221cba2e\n\nDaar ka mahol."
    ],
    "cleaned_text": "disclose electoral bonds details tomorrow top court rejects sbi plea  ",
    "cleaned_title": "disclose electoral bonds details tomorrow top court rejects sbi plea",
    "cleaned_selftext": "",
    "cleaned_comments": "supreme court monday march dismissed plea filed state bank india sbi seeking extension till june disclosure data electoral bonds fivejudge bench headed chief justice india dy chandrachud directed sbi disclose details end business hours march tuesday election commission india eci shall publish information website pm march court directed bank comply prescribed timeline original judgement february court directed disclosure details bonds purchased date name denominations details bonds redeemed political parties date encashment denominations sbi claimed two details readily available two separate silos todays order court directed sbi disclose details two silos direction sbi match two silos determine company contributed much party disclosure likely two lists donors parties corelation sbi application seeking extension till june dismissed sbi submitted donor kyc details political parties two different silos sbi submitted two silos info need shared share details within weeks sbi submitted donor details need matched political parties bank would require time till june electoral bonds scheme stipulated info furnished buyer bond shall treated confidential shall disclosed orders court law enforcement agencies sbi mandated disclose info demanded court massive w daar ka mahol",
    "light_cleaned_title": "\"Disclose Electoral Bonds' Details By Tomorrow\": Top Court Rejects SBI Plea",
    "light_cleaned_selftext": ".",
    "light_cleaned_comments": "The Supreme Court on Monday, March 11, dismissed the plea filed by the State Bank of India (SBI) seeking an extension till June 30 for disclosure of the data on electoral bonds. The five-judge bench headed by Chief Justice of India DY Chandrachud directed the SBI to disclose details by the end of business hours on March 12, Tuesday. The Election Commission of India (ECI) shall publish the information on its website by 5 pm on March 15. The court directed the bank to comply with the prescribed timeline. – In the original judgement of February 15, the court had directed for disclosure of – 1. Details of bonds purchased (date, name, denominations) 2. Details of bonds redeemed by political parties (date of encashment, denominations) The SBI claimed that these two details are readily available but in two separate silos. In today’s order, the court has directed the SBI to disclose details of these two silos. There is no direction for SBI to match the two silos, and determine which company contributed how much to which party. After the disclosure, we are likely to have two lists – donors and parties – with no corelation. SBI application seeking extension till June 30 is dismissed. – The SBI has submitted that donor KYC, details of political parties are in two different silos. – The SBI has submitted that if two silos of info need to be shared, it can share details within 2-3 weeks. – The SBI has submitted that if donor details need to be matched with political parties, bank would require time till June 30. – Electoral bonds scheme stipulated that info furnished by buyer of bond shall be treated as confidential, and shall be disclosed only by orders of a court, law enforcement agencies. – The SBI is mandated to disclose info when demanded by a court. Massive W Daar ka mahol."
}