{
    "id": "12bu9gm",
    "title": "Are these websites legit? I am using google flight search",
    "url": "https://i.redd.it/0hchgssrqyra1.jpg",
    "selftext": "Can I safely buy tickets from these websites except turkish airlines?",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 14,
    "created_utc": 1680637710.0,
    "convurl": "https://i.redd.it/0hchgssrqyra1.jpg",
    "comments": [
        "Kiwi optimizes the price, but is a pain in the ass when it comes to flexibility. They book close transfers, with the tickets almost always non-refundable",
        "What do you mean by close transfer",
        "Layover between flights is less than 2hrs",
        "I have 2 layover both of 5hr + . So can i go for it?",
        "From Kiwi? If you are extremely sure about the possibility of no changes on the dates of travel, go for it. 5hrs is a good amount of time.\n\nThey usually give tickets that aren't flexible. Meaning, you might have to pay a lot to change dates, if at all that happens",
        "I don’t need flexible tickets. So i guess , i will go for it. \nThanks , I will travelling first time internationally that also with 2 layovers . Any suggestions which might be useful?",
        "From where to where?",
        "Canada to bombay .",
        "Yup, 2 layovers looks good.",
        "Generally, I would avoid suggesting such third parties for international travel.    \nThey are serviceable if everything goes smoothly. But as soon as there is a little issue, things can go south very fast. For example, if one or more of your flights are rescheduled or cancelled, you need to contact the OTA (and not the airline) for assistance/rescheduling/refunds.  But they tend to have horrible after-sales support and doing this will be a pain in the backside.       \nAt least for the price differences that you are seeing, sticking to the airline is the best option.      \n\nAlso, Kiwi, especially, has the habit of stitching together multiple itineraries into a single ticket. That is to say, your flights to and from the layover airport may be totally disconnected and you'll have to re-checkin baggage and might have to go through immigration there (or even denied boarding if you need a transit visa and don't have one).       \nThat might not be the case here, but there is no way of verifying it until you have your ticket. (If you have already booked, ensure that the PNR for all flights is the same).",
        "+1, for a 2-3k diff it is not worth it to book with shady OTAs.\n\nThere are plenty of horror stories about Kiwi and other OTAs online.",
        "Yes, recently booked with gotogate. Make sure to request airline PNR after booking on them so you can directly manage your booking on airline site.",
        "It’s better to book the international flights directly from the airline rather than sky scanner or any such websites. Latter is mostly non refundable and non flexible."
    ],
    "cleaned_text": "websites legit using google flight search safely buy tickets websites except turkish airlines ",
    "cleaned_title": "websites legit using google flight search",
    "cleaned_selftext": "safely buy tickets websites except turkish airlines",
    "cleaned_comments": "kiwi optimizes price pain ass comes flexibility book close transfers tickets almost always nonrefundable mean close transfer layover flights less hrs layover hr go kiwi extremely sure possibility changes dates travel go hrs good amount time usually give tickets arent flexible meaning might pay lot change dates happens dont need flexible tickets guess go thanks travelling first time internationally also layovers suggestions might useful canada bombay yup layovers looks good generally would avoid suggesting third parties international travel serviceable everything goes smoothly soon little issue things go south fast example one flights rescheduled cancelled need contact ota airline assistancereschedulingrefunds tend horrible aftersales support pain backside least price differences seeing sticking airline best option also kiwi especially habit stitching together multiple itineraries single ticket say flights layover airport may totally disconnected youll recheckin baggage might go immigration even denied boarding need transit visa dont one might case way verifying ticket already booked ensure pnr flights k diff worth book shady otas plenty horror stories kiwi otas online yes recently booked gotogate make sure request airline pnr booking directly manage booking airline site better book international flights directly airline rather sky scanner websites latter mostly non refundable non flexible",
    "light_cleaned_title": "Are these websites legit? I am using google flight search",
    "light_cleaned_selftext": "Can I safely buy tickets from these websites except turkish airlines?",
    "light_cleaned_comments": "Kiwi optimizes the price, but is a pain in the ass when it comes to flexibility. They book close transfers, with the tickets almost always non-refundable What do you mean by close transfer Layover between flights is less than 2hrs I have 2 layover both of 5hr + . So can i go for it? From Kiwi? If you are extremely sure about the possibility of no changes on the dates of travel, go for it. 5hrs is a good amount of time. They usually give tickets that aren't flexible. Meaning, you might have to pay a lot to change dates, if at all that happens I don’t need flexible tickets. So i guess , i will go for it. Thanks , I will travelling first time internationally that also with 2 layovers . Any suggestions which might be useful? From where to where? Canada to bombay . Yup, 2 layovers looks good. Generally, I would avoid suggesting such third parties for international travel. They are serviceable if everything goes smoothly. But as soon as there is a little issue, things can go south very fast. For example, if one or more of your flights are rescheduled or cancelled, you need to contact the OTA (and not the airline) for assistance/rescheduling/refunds. But they tend to have horrible after-sales support and doing this will be a pain in the backside. At least for the price differences that you are seeing, sticking to the airline is the best option. Also, Kiwi, especially, has the habit of stitching together multiple itineraries into a single ticket. That is to say, your flights to and from the layover airport may be totally disconnected and you'll have to re-checkin baggage and might have to go through immigration there (or even denied boarding if you need a transit visa and don't have one). That might not be the case here, but there is no way of verifying it until you have your ticket. (If you have already booked, ensure that the PNR for all flights is the same). +1, for a 2-3k diff it is not worth it to book with shady OTAs. There are plenty of horror stories about Kiwi and other OTAs online. Yes, recently booked with gotogate. Make sure to request airline PNR after booking on them so you can directly manage your booking on airline site. It’s better to book the international flights directly from the airline rather than sky scanner or any such websites. Latter is mostly non refundable and non flexible."
}