{
    "id": "17guisi",
    "title": "Scammed by Flipkart, replacement declined and account is Blocked",
    "url": "https://www.reddit.com/r/india/comments/17guisi/scammed_by_flipkart_replacement_declined_and/",
    "selftext": " \n\nInfinix laptop by Seller: BUZZINDIA, Amount Paid Rs. 25039  \nOrder was delivered on Sun, Oct 15, Open Box delivery was declined.  \nI picked up the item and found that Box had a broken HP laptop in the infinix Box.  \nI  raised a return request which took 3 days for the team to verify and  later the courier guys refused to pickup the package stating that it is  different then the ordered.  \nI had to move to my home due to hostel  getting close so called the customer care and asked to change the pickup  address, I was advised on the call to cancel the current return request  and raise a new one. I cancelled the request which took 3 days to  process and after that I was not given a option to raise a return  request. I called the customer care again and explained the situation  and got the option for replacement instead of return and I accepted it.  \nReturn was raised however, it got closed in 24 hours stating that product received was intact.  \nI  called again and got another Return created which got closed with same  message and my account has been blocked now. I have no way to contact  them, they are replying with standard lines in twitter.\n\nI  spoke to bank for charge back, they have raised the request but  informed that it will take 120 days to investigate. Feeling helpless.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698320462.0,
    "convurl": "https://external-preview.redd.it/-O6I8QzD3KkYKaiIxGFQ0kl-K1dAvzozyszmMWNHG7w.jpg?auto=webp&s=050bd71ff3cb079da93b8a583709bc148c9c43af",
    "comments": [
        "If it was not an open box delivery, they have to accept return request for wrong product. File a complaint on consumer complaints portal.",
        "The consumer court will take care of it. Don't worry. Just follow the process.",
        "Save all the proofs, upload all in the charge back claim",
        "I spoke to axis bank and they haven't asked for any proof yet. The timeline for resolution is 120 days",
        "In my case they asked to contact with flipkart first then I attached all the mail conversation to axis bank then after 2 months they ruled the dispute in my favour \n\nOrdered moto phone they delivered Redmi, delivery guy just gave the parcel and took otp my family members didn’t know it’s open box delivery, contacted flipkart they denied it as it’s my mistake, without wasting my time raised charge back",
        "Why the fuck are people still buying from flipkart. There are literally 3 posts/day about some issues related to flipkart but you all still buying from that shitsite. At this point your yourself are a little bit responsible for the trouble you’re facing.",
        "I was informed that charges are settled however they have still raised a case.",
        "![img](avatar_exp|123707253|bravo)",
        "Buzzindia is total fraud seller search reddit to know more",
        "Always do chargeback through the web interface, these bank employees will sit and fight for Flipkart. It's an annoying slow process.",
        "r/fuckflipkart\n\nTry to post there, its a sub esp for this, we need to make that sub more popular.",
        "Stop buying from Flipkart, even if it is free they will scam you. Amazon quality is high because they maintain proper warehouse product and tracking.",
        "The problem is that many people like me never had a bad experience from them before, i mean i ordered a lot of expensive items from them like iphones, laptop never had a bad experience but seeing these posts i am thinking of exercising caution",
        "First, op you need to calm down. You are writing the post as if you are expecting instant justice to be served to you. That doesn’t happen in India or anywhere else. \n\nCalm down and take a breather.\n\nNo one can take your money from you without giving sufficient value in return. And if online retailers do these kinds of frauds they are answerable. You need to gather every piece of information from start to end and report to concerned authorities. \n\nYeah I understand you forgot to look for information on how to report flipkart in case of their bad shit behaviour, you saw their use as a good and trustworthy online platform as advertised on TV or social media platforms and and started praising them as the best and trusty. This needs to change from your point of view from now onwards. Flipkart is just another shop where you can get screwed over if you are not vigilant. \n\nThere are consumer courts which you can find with a simple google search or possibly on flipkart website on their privacy policy or terms and conditions 🤣. That’s called dispute resolution section which every company needs to publish on their websites.\n\nYou need to calm down and think on how to recover instead of panic mode shit spreading fan mode. \n\nMistakes happen everywhere.",
        "Why are people STILL ORDERING FROM FLIPKART",
        "Well, to my defense, I never had any issues till now for 10 + Yrs. Learning from mistakes",
        "There's always something shady happening in each of such case and people walk into the scams themselves. Even in this case when the delivery guy refused to provide an open box delivery there was no reason for him to accept the package. Secondly the seal clearly looks tampered and he still went ahead and opened it.",
        "I'm more curious as to why open box delivery was denied? Did you give any sort of OTP?",
        "There was no option for open delivery. I confirmed it with Flipkart. Product was not eligible for open box"
    ],
    "cleaned_text": "scammed flipkart replacement declined account blocked infinix laptop seller buzzindia amount paid rs order delivered sun oct open box delivery declined picked item found box broken hp laptop infinix box raised return request took days team verify later courier guys refused pickup package stating different ordered move home due hostel getting close called customer care asked change pickup address advised call cancel current return request raise new one cancelled request took days process given option raise return request called customer care explained situation got option replacement instead return accepted return raised however got closed hours stating product received intact called got another return created got closed message account blocked way contact replying standard lines twitter spoke bank charge back raised request informed take days investigate feeling helpless ",
    "cleaned_title": "scammed flipkart replacement declined account blocked",
    "cleaned_selftext": "infinix laptop seller buzzindia amount paid rs order delivered sun oct open box delivery declined picked item found box broken hp laptop infinix box raised return request took days team verify later courier guys refused pickup package stating different ordered move home due hostel getting close called customer care asked change pickup address advised call cancel current return request raise new one cancelled request took days process given option raise return request called customer care explained situation got option replacement instead return accepted return raised however got closed hours stating product received intact called got another return created got closed message account blocked way contact replying standard lines twitter spoke bank charge back raised request informed take days investigate feeling helpless",
    "cleaned_comments": "open box delivery accept return request wrong product file complaint consumer complaints portal consumer court take care dont worry follow process save proofs upload charge back claim spoke axis bank havent asked proof yet timeline resolution days case asked contact flipkart first attached mail conversation axis bank months ruled dispute favour ordered moto phone delivered redmi delivery guy gave parcel took otp family members didnt know open box delivery contacted flipkart denied mistake without wasting time raised charge back fuck people still buying flipkart literally postsday issues related flipkart still buying shitsite point little bit responsible trouble youre facing informed charges settled however still raised case imgavatarexpbravo buzzindia total fraud seller search reddit know always chargeback web interface bank employees sit fight flipkart annoying slow process rfuckflipkart try post sub esp need make sub popular stop buying flipkart even free scam amazon quality high maintain proper warehouse product tracking problem many people like never bad experience mean ordered lot expensive items like iphones laptop never bad experience seeing posts thinking exercising caution first op need calm writing post expecting instant justice served doesnt happen india anywhere else calm take breather one take money without giving sufficient value return online retailers kinds frauds answerable need gather every piece information start end report concerned authorities yeah understand forgot look information report flipkart case bad shit behaviour saw use good trustworthy online platform advertised tv social media platforms started praising best trusty needs change point view onwards flipkart another shop get screwed vigilant consumer courts find simple google search possibly flipkart website privacy policy terms conditions thats called dispute resolution section every company needs publish websites need calm think recover instead panic mode shit spreading fan mode mistakes happen everywhere people still ordering flipkart well defense never issues till yrs learning mistakes theres always something shady happening case people walk scams even case delivery guy refused provide open box delivery reason accept package secondly seal clearly looks tampered still went ahead opened im curious open box delivery denied give sort otp option open delivery confirmed flipkart product eligible open box",
    "light_cleaned_title": "Scammed by Flipkart, replacement declined and account is Blocked",
    "light_cleaned_selftext": "Infinix laptop by Seller: BUZZINDIA, Amount Paid Rs. 25039 Order was delivered on Sun, Oct 15, Open Box delivery was declined. I picked up the item and found that Box had a broken HP laptop in the infinix Box. I raised a return request which took 3 days for the team to verify and later the courier guys refused to pickup the package stating that it is different then the ordered. I had to move to my home due to hostel getting close so called the customer care and asked to change the pickup address, I was advised on the call to cancel the current return request and raise a new one. I cancelled the request which took 3 days to process and after that I was not given a option to raise a return request. I called the customer care again and explained the situation and got the option for replacement instead of return and I accepted it. Return was raised however, it got closed in 24 hours stating that product received was intact. I called again and got another Return created which got closed with same message and my account has been blocked now. I have no way to contact them, they are replying with standard lines in twitter. I spoke to bank for charge back, they have raised the request but informed that it will take 120 days to investigate. Feeling helpless.",
    "light_cleaned_comments": "If it was not an open box delivery, they have to accept return request for wrong product. File a complaint on consumer complaints portal. The consumer court will take care of it. Don't worry. Just follow the process. Save all the proofs, upload all in the charge back claim I spoke to axis bank and they haven't asked for any proof yet. The timeline for resolution is 120 days In my case they asked to contact with flipkart first then I attached all the mail conversation to axis bank then after 2 months they ruled the dispute in my favour Ordered moto phone they delivered Redmi, delivery guy just gave the parcel and took otp my family members didn’t know it’s open box delivery, contacted flipkart they denied it as it’s my mistake, without wasting my time raised charge back Why the fuck are people still buying from flipkart. There are literally 3 posts/day about some issues related to flipkart but you all still buying from that shitsite. At this point your yourself are a little bit responsible for the trouble you’re facing. I was informed that charges are settled however they have still raised a case. ![img](avatar_exp|123707253|bravo) Buzzindia is total fraud seller search reddit to know more Always do chargeback through the web interface, these bank employees will sit and fight for Flipkart. It's an annoying slow process. r/fuckflipkart Try to post there, its a sub esp for this, we need to make that sub more popular. Stop buying from Flipkart, even if it is free they will scam you. Amazon quality is high because they maintain proper warehouse product and tracking. The problem is that many people like me never had a bad experience from them before, i mean i ordered a lot of expensive items from them like iphones, laptop never had a bad experience but seeing these posts i am thinking of exercising caution First, op you need to calm down. You are writing the post as if you are expecting instant justice to be served to you. That doesn’t happen in India or anywhere else. Calm down and take a breather. No one can take your money from you without giving sufficient value in return. And if online retailers do these kinds of frauds they are answerable. You need to gather every piece of information from start to end and report to concerned authorities. Yeah I understand you forgot to look for information on how to report flipkart in case of their bad shit behaviour, you saw their use as a good and trustworthy online platform as advertised on TV or social media platforms and and started praising them as the best and trusty. This needs to change from your point of view from now onwards. Flipkart is just another shop where you can get screwed over if you are not vigilant. There are consumer courts which you can find with a simple google search or possibly on flipkart website on their privacy policy or terms and conditions 🤣. That’s called dispute resolution section which every company needs to publish on their websites. You need to calm down and think on how to recover instead of panic mode shit spreading fan mode. Mistakes happen everywhere. Why are people STILL ORDERING FROM FLIPKART Well, to my defense, I never had any issues till now for 10 + Yrs. Learning from mistakes There's always something shady happening in each of such case and people walk into the scams themselves. Even in this case when the delivery guy refused to provide an open box delivery there was no reason for him to accept the package. Secondly the seal clearly looks tampered and he still went ahead and opened it. I'm more curious as to why open box delivery was denied? Did you give any sort of OTP? There was no option for open delivery. I confirmed it with Flipkart. Product was not eligible for open box"
}