{
    "id": "1575zvh",
    "title": "Mca : Can someone suggest me good college for mca direct admission with good placement please ?🥹",
    "url": "https://www.reddit.com/r/india/comments/1575zvh/mca_can_someone_suggest_me_good_college_for_mca/",
    "selftext": "im  from ghazipur (near the varansi) there is no good college with placement :   bcz of  my mom's extreme  condition  i couldn't study  my exam that good got   (76%) in 5th sem bca 6rh sem exam is starting from 8aug on my  bday and  cuet i got  67  without  studying :  \n\n\nis there any good college  i can go  with direct admission   :which has also good  placement :\n\ni tried to go  graphic era college :but  it was 4lakh fee :)  which  is tooooooooooooo high  as my family  condition  :)  my  mom dad eveeryone forcing me to do mca and get job as soon possible  :can you  suggest me ;  \n\n\nA GUY suggested me  [Noida](https://en.wikipedia.org/wiki/Noida)  to find colleges  but i dont know  much : i thought  can you  kind people  can help me show me the right  path :  \n\n\ni  am totally helpless 😭😭😭",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690090119.0,
    "convurl": "https://external-preview.redd.it/YeOyApYfagddqdZtIQzORLxtfutwRpnbHPSKciDUOXc.jpg?auto=webp&s=8528ea16da62edef414a19fd343beb9e9a9fcde4",
    "comments": [
        "Caution: there is a huge glut in IT market. Even well trained are not getting jobs. World economy is not looking great either. MCA takes few years. Things may improve.\n\n- what else you like to study?\n\nThe days of super easy placements for IT are long gone.",
        "bhai   bhai       🥹",
        "Think this way if you want sure placement.\n\n- look at a job <designation> you want to be in 5 years time in some company like TCS,Accenture etc\n\n- search LinkedIn for \"job name\". \n\n- see the current guy/gal with that job\n\n- look what is the study, college or experience, background they have\n\n- do that.",
        "sir  :  first  i am in last years  bca :   i know    i can learn more and higher  level  : by myself : i am a scared coward ,\n\nalso my family wants me to complete my mca fast as soon as possible  and isntant get job  :  \n\n\nI am trying  to find a college first for mca : bcz of mom's health i could not prepare myself for CUET exam :\n\nso now i am thinking  to get  into  a good college  For mca who takes direct admission in mca :)  \n\n&#x200B;\n\nppl suggesting noida but idk  my brain is not working  :)     \n\n\n  \nmy college is not that good in study  good at  giving us degree :  \nbut by myself i am learning   machine learning  by  learning  python  advance level and c++ also  database and datastucture same time  doing my preparation  for exam which is on my bday :\\_)  9 aug    \n\n\ni am clueless about  how to study waht to study and how to get job : family pressure giving me depression depressio depression   \n\n\n***first my aim is to fine a good   college with good placement : idk   what am i going to do***",
        "Chill, take a walk. Stop all electronic gadgets. Then your mind can properly think.\n\n- in some ways moving out is good for you\n\n- if you reduce family pressure then you can focus on study\n\n- I am serious when telling you DO WHAT YOU LIKE. Too often people join IT thinking it is cool, money but hate the job. Which also means their performance sucks. Life is then torture.",
        "99.999 % you are right sir :)  but convincing family   and their hope  : its not easy to be honest ,  \nalso \n\ni have no roadmap   for futrue what should i do or anyone to tell me  ; i   went on intenet ppl saying  alots of stuff i wanna just complete my course  and get job  and free my family from the  heavily  wieght of my future :)    \n\n\nthese days i feel  myself a heavy weight on my family : ):  \ncan you  suggest me waht should i do",
        "Sorry. No place gives you jobs like easy. Yes, it was like that 20 years before in IT. There is too much competition.",
        "i understand and you are 100% right :   \ni am right now i am doing bca : soon i will do mca  \ni wanna know what should i do to prepare myself     \n for this tf  it  to get in   \n\n\nmy college does not have placement :(    for mca : so i am worried so much   \ncan you tell me how to prepare i have 2 years   for job",
        "Create an account in LinkedIn\n\nStart looking for previous students from your college, neaebyy(same quality colleges) in there\n\nSee which jobs the ex-students work\n\nIf possible try contact in linkedin. May be they can help.\n\n\nAlso beware of scams. I know some seniors that promise Jobs ASK MONEY."
    ],
    "cleaned_text": "mca someone suggest good college mca direct admission good placement please im ghazipur near varansi good college placement bcz moms extreme condition couldnt study exam good got th sem bca rh sem exam starting aug bday cuet got without studying good college go direct admission also good placement tried go graphic era college lakh fee tooooooooooooo high family condition mom dad eveeryone forcing mca get job soon possible suggest guy suggested noidahttpsenwikipediaorgwikinoida find colleges dont know much thought kind people help show right path totally helpless ",
    "cleaned_title": "mca someone suggest good college mca direct admission good placement please",
    "cleaned_selftext": "im ghazipur near varansi good college placement bcz moms extreme condition couldnt study exam good got th sem bca rh sem exam starting aug bday cuet got without studying good college go direct admission also good placement tried go graphic era college lakh fee tooooooooooooo high family condition mom dad eveeryone forcing mca get job soon possible suggest guy suggested noidahttpsenwikipediaorgwikinoida find colleges dont know much thought kind people help show right path totally helpless",
    "cleaned_comments": "caution huge glut market even well trained getting jobs world economy looking great either mca takes years things may improve else like study days super easy placements long gone bhai bhai think way want sure placement look job designation want years time company like tcsaccenture etc search linkedin job name see current guygal job look study college experience background sir first last years bca know learn higher level scared coward also family wants complete mca fast soon possible isntant get job trying find college first mca bcz moms health could prepare cuet exam thinking get good college mca takes direct admission mca xb ppl suggesting noida idk brain working college good study good giving us degree learning machine learning learning python advance level c also database datastucture time preparation exam bday aug clueless study waht study get job family pressure giving depression depressio depression first aim fine good college good placement idk going chill take walk stop electronic gadgets mind properly think ways moving good reduce family pressure focus study serious telling like often people join thinking cool money hate job also means performance sucks life torture right sir convincing family hope easy honest also roadmap futrue anyone tell went intenet ppl saying alots stuff wan na complete course get job free family heavily wieght future days feel heavy weight family suggest waht sorry place gives jobs like easy yes like years much competition understand right right bca soon mca wan na know prepare tf get college placement mca worried much tell prepare years job create account linkedin start looking previous students college neaebyysame quality colleges see jobs exstudents work possible try contact linkedin may help also beware scams know seniors promise jobs ask money",
    "light_cleaned_title": "Mca : Can someone suggest me good college for mca direct admission with good placement please ?🥹",
    "light_cleaned_selftext": "im from ghazipur (near the varansi) there is no good college with placement : bcz of my mom's extreme condition i couldn't study my exam that good got (76%) in 5th sem bca 6rh sem exam is starting from 8aug on my bday and cuet i got 67 without studying : is there any good college i can go with direct admission :which has also good placement : i tried to go graphic era college :but it was 4lakh fee :) which is tooooooooooooo high as my family condition :) my mom dad eveeryone forcing me to do mca and get job as soon possible :can you suggest me ; A GUY suggested me [Noida](https://en.wikipedia.org/wiki/Noida) to find colleges but i dont know much : i thought can you kind people can help me show me the right path : i am totally helpless 😭😭😭",
    "light_cleaned_comments": "Caution: there is a huge glut in IT market. Even well trained are not getting jobs. World economy is not looking great either. MCA takes few years. Things may improve. - what else you like to study? The days of super easy placements for IT are long gone. bhai bhai 🥹 Think this way if you want sure placement. - look at a job <designation> you want to be in 5 years time in some company like TCS,Accenture etc - search LinkedIn for \"job name\". - see the current guy/gal with that job - look what is the study, college or experience, background they have - do that. sir : first i am in last years bca : i know i can learn more and higher level : by myself : i am a scared coward , also my family wants me to complete my mca fast as soon as possible and isntant get job : I am trying to find a college first for mca : bcz of mom's health i could not prepare myself for CUET exam : so now i am thinking to get into a good college For mca who takes direct admission in mca :) &#x200B; ppl suggesting noida but idk my brain is not working :) my college is not that good in study good at giving us degree : but by myself i am learning machine learning by learning python advance level and c++ also database and datastucture same time doing my preparation for exam which is on my bday :\\_) 9 aug i am clueless about how to study waht to study and how to get job : family pressure giving me depression depressio depression ***first my aim is to fine a good college with good placement : idk what am i going to do*** Chill, take a walk. Stop all electronic gadgets. Then your mind can properly think. - in some ways moving out is good for you - if you reduce family pressure then you can focus on study - I am serious when telling you DO WHAT YOU LIKE. Too often people join IT thinking it is cool, money but hate the job. Which also means their performance sucks. Life is then torture. 99.999 % you are right sir :) but convincing family and their hope : its not easy to be honest , also i have no roadmap for futrue what should i do or anyone to tell me ; i went on intenet ppl saying alots of stuff i wanna just complete my course and get job and free my family from the heavily wieght of my future :) these days i feel myself a heavy weight on my family : ): can you suggest me waht should i do Sorry. No place gives you jobs like easy. Yes, it was like that 20 years before in IT. There is too much competition. i understand and you are 100% right : i am right now i am doing bca : soon i will do mca i wanna know what should i do to prepare myself for this tf it to get in my college does not have placement :( for mca : so i am worried so much can you tell me how to prepare i have 2 years for job Create an account in LinkedIn Start looking for previous students from your college, neaebyy(same quality colleges) in there See which jobs the ex-students work If possible try contact in linkedin. May be they can help. Also beware of scams. I know some seniors that promise Jobs ASK MONEY."
}