{
    "id": "1flk9i1",
    "title": "Mann govt’s half-term over, governance still a challenge",
    "url": "https://www.reddit.com/r/india/comments/1flk9i1/mann_govts_halfterm_over_governance_still_a/",
    "selftext": "**Achievements in 2.5 years**\n\n* Government jobs to 50,000-odd youngsters\n* 300 units free power per month to domestic consumers\n* Purchase of a private thermal plant at Goindwal Sahib\n* Strengthening public health and school infrastructure\n* Canal water reaches tail ends and construction of new 150-km Malwa Canal\n* Attempts to diversify agriculture by promoting moong\n* Incentivising direct seeding of rice to save groundwater\n\n**Where party floundered**\n\n* Anti-corruption stance has taken a back seat\n* Not able to control drug menace\n* Unable to secure fresh industrial investment\n* No stipend of \\~1,000 for women\n* Agriculture policy not released so far\n* Illegal mining continues to be Achilles heel\n\nThe anti-corruption stance and arrest of former ministers on the charge of graft has been perceived more as a witch-hunt. **Though the Mann government has even caught its own leaders on corruption charges, AAP now seems to be going slow on this front.**\n\n**To make matters worse, the Centre has been withholding funds** at a time when AAP inherited huge debt and is more dependent on the Central doles rather than a robust resource mobilisation of its own. This perhaps explains the dire need to increase VAT on retail fuels, hike road tax and bus fares, increase in collector rates, besides rolling back power subsidy given by the previous government.\n\nGiving credit where it’s due, AAP has provided jobs to 50,000-odd youngsters. Over 80 per cent of the domestic consumers get 300 units a month free power and all agriculture pumpset consumers continue to get free power for eight hours a day. In spite of financial constraints and scoffs by economists, **the AAP government has decided to continue with their free power sop. In times of high inflation, this has reduced the burden on a common man.**\n\nAttempts to resurrect the **public health and education system have also yielded good results**, in ensuring affordable healthcare at the Aam Aadmi Clinics and providing better education through the Schools of Eminence. In the past two years, **the increase in number of students shifting from private institutes to government schools** is a testimonial of improvement in public education sector.\n\n**The government has also ensured that canal water reaches the tail ends in south Malwa**, after decades. The announcement of a new canal — Malwa Canal — to be built in south Malwa is a move in the right direction. Baby steps have also been taken on policy side to diversify agriculture and stem desertification by promoting direct seeding of rice.\n\n*Looks like doing pretty good so far...*\n\n**Source:** [Mann govt’s half-term over, governance still a challenge](https://www.tribuneindia.com/news/punjab/mann-govts-half-term-over-governance-still-a-challenge/)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1726860260.0,
    "convurl": "https://external-preview.redd.it/L3F8M2v_2GqX-hu265KOu3XttQ-ZXUt-KboQ2tHXjBo.jpg?auto=webp&s=79166a64093ac15a5574293c823269d900167dd5",
    "comments": [],
    "cleaned_text": "mann govts halfterm governance still challenge achievements years government jobs odd youngsters units free power per month domestic consumers purchase private thermal plant goindwal sahib strengthening public health school infrastructure canal water reaches tail ends construction new km malwa canal attempts diversify agriculture promoting moong incentivising direct seeding rice save groundwater party floundered anticorruption stance taken back seat able control drug menace unable secure fresh industrial investment stipend women agriculture policy released far illegal mining continues achilles heel anticorruption stance arrest former ministers charge graft perceived witchhunt though mann government even caught leaders corruption charges aap seems going slow front make matters worse centre withholding funds time aap inherited huge debt dependent central doles rather robust resource mobilisation perhaps explains dire need increase vat retail fuels hike road tax bus fares increase collector rates besides rolling back power subsidy given previous government giving credit due aap provided jobs odd youngsters per cent domestic consumers get units month free power agriculture pumpset consumers continue get free power eight hours day spite financial constraints scoffs economists aap government decided continue free power sop times high inflation reduced burden common man attempts resurrect public health education system also yielded good results ensuring affordable healthcare aam aadmi clinics providing better education schools eminence past two years increase number students shifting private institutes government schools testimonial improvement public education sector government also ensured canal water reaches tail ends south malwa decades announcement new canal malwa canal built south malwa move right direction baby steps also taken policy side diversify agriculture stem desertification promoting direct seeding rice looks like pretty good far source mann govts halfterm governance still challengehttpswwwtribuneindiacomnewspunjabmanngovtshalftermovergovernancestillachallenge ",
    "cleaned_title": "mann govts halfterm governance still challenge",
    "cleaned_selftext": "achievements years government jobs odd youngsters units free power per month domestic consumers purchase private thermal plant goindwal sahib strengthening public health school infrastructure canal water reaches tail ends construction new km malwa canal attempts diversify agriculture promoting moong incentivising direct seeding rice save groundwater party floundered anticorruption stance taken back seat able control drug menace unable secure fresh industrial investment stipend women agriculture policy released far illegal mining continues achilles heel anticorruption stance arrest former ministers charge graft perceived witchhunt though mann government even caught leaders corruption charges aap seems going slow front make matters worse centre withholding funds time aap inherited huge debt dependent central doles rather robust resource mobilisation perhaps explains dire need increase vat retail fuels hike road tax bus fares increase collector rates besides rolling back power subsidy given previous government giving credit due aap provided jobs odd youngsters per cent domestic consumers get units month free power agriculture pumpset consumers continue get free power eight hours day spite financial constraints scoffs economists aap government decided continue free power sop times high inflation reduced burden common man attempts resurrect public health education system also yielded good results ensuring affordable healthcare aam aadmi clinics providing better education schools eminence past two years increase number students shifting private institutes government schools testimonial improvement public education sector government also ensured canal water reaches tail ends south malwa decades announcement new canal malwa canal built south malwa move right direction baby steps also taken policy side diversify agriculture stem desertification promoting direct seeding rice looks like pretty good far source mann govts halfterm governance still challengehttpswwwtribuneindiacomnewspunjabmanngovtshalftermovergovernancestillachallenge",
    "cleaned_comments": "",
    "light_cleaned_title": "Mann govt’s half-term over, governance still a challenge",
    "light_cleaned_selftext": "**Achievements in 2.5 years** * Government jobs to 50,000-odd youngsters * 300 units free power per month to domestic consumers * Purchase of a private thermal plant at Goindwal Sahib * Strengthening public health and school infrastructure * Canal water reaches tail ends and construction of new 150-km Malwa Canal * Attempts to diversify agriculture by promoting moong * Incentivising direct seeding of rice to save groundwater **Where party floundered** * Anti-corruption stance has taken a back seat * Not able to control drug menace * Unable to secure fresh industrial investment * No stipend of \\~1,000 for women * Agriculture policy not released so far * Illegal mining continues to be Achilles heel The anti-corruption stance and arrest of former ministers on the charge of graft has been perceived more as a witch-hunt. **Though the Mann government has even caught its own leaders on corruption charges, AAP now seems to be going slow on this front.** **To make matters worse, the Centre has been withholding funds** at a time when AAP inherited huge debt and is more dependent on the Central doles rather than a robust resource mobilisation of its own. This perhaps explains the dire need to increase VAT on retail fuels, hike road tax and bus fares, increase in collector rates, besides rolling back power subsidy given by the previous government. Giving credit where it’s due, AAP has provided jobs to 50,000-odd youngsters. Over 80 per cent of the domestic consumers get 300 units a month free power and all agriculture pumpset consumers continue to get free power for eight hours a day. In spite of financial constraints and scoffs by economists, **the AAP government has decided to continue with their free power sop. In times of high inflation, this has reduced the burden on a common man.** Attempts to resurrect the **public health and education system have also yielded good results**, in ensuring affordable healthcare at the Aam Aadmi Clinics and providing better education through the Schools of Eminence. In the past two years, **the increase in number of students shifting from private institutes to government schools** is a testimonial of improvement in public education sector. **The government has also ensured that canal water reaches the tail ends in south Malwa**, after decades. The announcement of a new canal — Malwa Canal — to be built in south Malwa is a move in the right direction. Baby steps have also been taken on policy side to diversify agriculture and stem desertification by promoting direct seeding of rice. *Looks like doing pretty good so far...* **Source:** [Mann govt’s half-term over, governance still a challenge](https://www.tribuneindia.com/news/punjab/mann-govts-half-term-over-governance-still-a-challenge/)",
    "light_cleaned_comments": ""
}