{
    "id": "1976yfg",
    "title": "Dealing with Deepfakes (MeitY's Version)",
    "url": "https://www.reddit.com/r/india/comments/1976yfg/dealing_with_deepfakes_meitys_version/",
    "selftext": " \n\n[Donate to support us](https://preview.redd.it/qyaj41h0elcc1.png?width=1600&format=png&auto=webp&s=1ed1601875df0de8807bed5e82bf8db0a658ebf6)\n\n**tl;dr**\n\nOn January 09, 2024, we [wrote](https://drive.google.com/file/d/1frH8ys1Os2jN-fEpVO4p0WcRuZeSJJmk/view?usp=sharing&ref=static.internetfreedom.in)   to the Ministry of Electronics and Information Technology (“MeitY”)   raising our apprehensions about the Ministry’s conflicting statement   around and approach to tackling the issue of deepfakes. Amidst a series   of communications and notices sent to intermediaries, reiterating the   need to take proactive steps to curb ‘online harms’ on the internet, no   public consultation or deep research has been initiated by the   Ministry. \n\nDeepfakes dilemma\n\nAfter Rashmika Mandana’s deepfake video got widely circulated on the   internet, it caught the attention of the Union government as well, with   the [Prime Minister](https://www.thehindu.com/news/national/pm-modi-warns-against-deepfakes-calls-on-media-to-educate-people-on-misinformation/article67543869.ece?ref=static.internetfreedom.in) and the [President](https://www.thehindu.com/news/national/misuse-of-technology-to-create-deepfakes-threat-to-society-president-murmu/article67597935.ece?ref=static.internetfreedom.in)   expressing caution and noting the potential threats deepfakes pose to   society. MeitY was also quick to respond to the incident and even   conducted several [meetings](https://www.hindustantimes.com/technology/rajeev-chandrasekhar-social-media-platforms-deepfake-controversy-rashmika-mandanna-101700989063267.html?ref=static.internetfreedom.in)   with intermediaries, primarily social media platforms. The Minister of   Electronics and Information Technology, Shri Ashwini Vaishnaw, after   conversing with AI companies and experts, Nasscom, and academicians, [spoke](https://www.thehindubusinessline.com/info-tech/new-regulations-soon-to-tackle-deepfakes-vaishnaw/article67564946.ece?ref=static.internetfreedom.in) publicly on the need for drafting a legislation on deepfakes and to take clear action on it [within 10 days](https://www.business-standard.com/india-news/india-to-have-draft-regulation-on-deepfakes-in-10-days-ashwini-vaisnaw-123112300437_1.html?ref=static.internetfreedom.in),   i.e. by December 03. The Minister of State for Electronics and IT,  Shri  Rajeev Chandrashekhar, also mentioned that the government would  conduct  an open consultative process before finalising the  legislation. \n\nSoon after, around December 14, 2023, Shri Rajeev Chandrashekhar shared that the Union government was considering releasing an [advisory](https://www.livemint.com/news/india/centre-to-issue-advisory-on-deepfakes-soon-mos-chandrasekhar-11702486730978.html?ref=static.internetfreedom.in),   and not a dedicated regulation, for deepfakes. This apparent change of   plans was once again declared to the media, and not through any formal   mechanism, without any accompanying justification or reasoning. Weeks   after these statements were made in the public forum, no legislation,   regulation, guideline, or appointment has been made, or public   consultation held. Most recently, in the first week of January 2024, it   was reported that the MeitY is considering [amending](https://www.hindustantimes.com/india-news/centre-likely-to-amend-it-rules-to-define-deepfakes-101704482610756.html?ref=static.internetfreedom.in) the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (IT Rules, 2021), to “*explicitly define deepfakes and make it obligatory for all intermediaries to make “reasonable efforts” to not host them*”. \n\nAll   of this back and forth from the Ministry has created an environment of   confusion and is indicative of rushed, surface-level interventions  that  insufficiently deal with the complex problems of synthetic media.  In the  absence of any consultation with a diverse range of  stakeholders, these  multiple, and sometimes conflicting, statements can  become a cause of  confusion among stakeholders, including companies  and users. \n\nWe’re on the highway to (IT Rules) hell\n\nMeitY   urged all intermediaries, through the formal advisory it sent on   December 26, 2023, to follow the due diligence obligations listed under   the notified IT Amendment Rules, 2023. The advisory seems to be aimed  at  ensuring strict compliance with identifying and promptly removing   misinformation, false or misleading content, and material impersonating   others, specifically targeting growing concerns around deepfakes. The   intermediaries were reminded of the legal provisions applicable in case   of their non-compliance with provisions of the IT Rules, 2021, i.e.  loss  of exemption from liability provided under section 79(1) of the   Information Technology Act (IT Act), 2000. \n\nThe notified amendments to the IT Rules in 2022 expanded the requirement of intermediaries under Rule 3(1)(b) to “*make reasonable efforts to cause the* *users*”   not to post certain kinds of content. The sub-clauses (i) to (ix)  under  3(1)(b), which list the grounds on which content must be removed  by the  intermediaries, were significantly amended. In particular, Rule   3(1)(b)(v) i.e. “*knowingly and  intentionally communicates any  misinformation or information which is  patently false and untrue or  misleading in nature*” was [criticised](https://internetfreedom.in/public-brief-on-the-it-amendment-rules-2022/?ref=static.internetfreedom.in) for its [ambiguous](https://firstdraftnews.org/long-form-article/understanding-information-disorder/?ref=static.internetfreedom.in)   phrasing and vague definition, given potential consequences of making   private entities arbiters of permissible speech, which violates the   directions of the Hon’ble Supreme Court in [*Shreya Singhal vs Union of India*](https://indiankanoon.org/doc/110813550/?ref=static.internetfreedom.in).   Moreover, the term “false” also implies the presence of an objectively   identifiable truth and establishes a binary of 'true-false' for all   online content. However, content in the complex digital space cannot   always be neatly bucketed into a straightforward binary of ‘true’ and   ‘false’ (see [here](https://www.pewresearch.org/internet/2017/10/19/the-future-of-truth-and-misinformation-online/?ref=static.internetfreedom.in), [here](https://www.cigionline.org/articles/its-time-to-think-beyond-the-problems-of-disinformation-and-false-news/?ref=static.internetfreedom.in), and [here](https://www.theatlantic.com/ideas/archive/2021/10/disinformation-propaganda-amplification-ampliganda/620334/?ref=static.internetfreedom.in)).   These new provisions, purportedly aimed at providing additional   recourse to aggrieved users, do not “provide a force of law” as they are   ultra-vires the safe harbour framework under Section 79 of the IT Act,   2000. \n\nGiven these conflicting statements, rushed policy interventions, and troubling suggestions, we [wrote](https://drive.google.com/file/d/1frH8ys1Os2jN-fEpVO4p0WcRuZeSJJmk/view?usp=sharing&ref=static.internetfreedom.in) to MeitY highlighting the above stated concerns. We also noted that definitional inadequacies in the IT Rules and the [challenges](https://spectrum.ieee.org/ai-misinformation-fake-news?ref=static.internetfreedom.in) in [accurately](https://promiseinstitute.law.ucla.edu/podcast/misinformation-and-synthetic-media/?ref=static.internetfreedom.in) [identifying](https://hbr.org/2022/09/ai-isnt-ready-to-make-unsupervised-decisions?ref=static.internetfreedom.in)   synthetic media, combined with the threats to the immunity held by   platforms and stringent punishment for non-compliance or inaction, may   threaten media freedom and [legitimacy](https://www.technologyreview.com/2019/10/10/132667/the-biggest-threat-of-deepfakes-isnt-the-deepfakes-themselves/?ref=static.internetfreedom.in).   In the absence of long-term interventions that address underlying   social problems, imposing a penalty or taking away safe harbour in case   of inaction or delayed action on the part of platforms will not address   the underlying cause for the spread of such content. Instead, it may   result in over-policing of content on the part of platforms, who may be   forced to make subjective or arbitrary content moderation decisions in   the absence of a [deeper understanding](https://misinforeview.hks.harvard.edu/article/misinformation-reloaded-fears-about-the-impact-of-generative-ai-on-misinformation-are-overblown/?ref=static.internetfreedom.in) of the issue at hand to avoid losing their safe harbour. \n\nDealing with deepfakes (User rights’ version)\n\nWhile the rise of synthetic media is an evolving issue of significance, it is one of many\n\nemerging  issues in the digital space that needs deep consideration,  thorough  deliberation and broad-based consultation. We cautioned the  Ministry  against going ahead with a hurried policy or regulatory actions  based  on a few closed-door meetings with technology platforms, and  advised  for a broader multi-stakeholder consultation with journalists,   fact-checkers, policymakers, civil society organisations, etc. who are   dealing with the potential malicious use of synthetic media. For a   deeper and uniform understanding of harms including but not limited to   deepfakes, we [once again](https://drive.google.com/file/d/1LmZRQzJFUm5oFe8TVEjlq3r8r-G9RHXw/view?usp=sharing&ref=static.internetfreedom.in)   asked the Ministry to clearly state its conception of ‘user harms’ in   the Indian context, including the various harms arising from the use of   synthetic media. We highlighted that although the risks posed by   deepfakes are emergent problems, efforts must be made to improve   information literacy and efforts to understand the effects of changing   information flows.\n\n**Important documents**\n\n1. Press release of advisory dated December 26 sent by MeitY to intermediaries ([link](https://pib.gov.in/PressReleseDetailm.aspx?PRID=1990542&ref=static.internetfreedom.in))\n2. IFF’s letter to MeitY on the issue of deepfakes ([link](https://drive.google.com/file/d/1frH8ys1Os2jN-fEpVO4p0WcRuZeSJJmk/view?usp=sharing&ref=static.internetfreedom.in))\n3. Link to IFF’s public brief on IT Amendment Rules 2023 ([link](https://drive.google.com/file/d/1_MLeGkMvycejK8wAwFgosd-R4HHhEHyQ/view?ref=static.internetfreedom.in))\n\nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)!",
    "flair": "Policy/Economy",
    "score": 9,
    "num_comments": 2,
    "created_utc": 1705319455.0,
    "convurl": "https://b.thumbs.redditmedia.com/iC8sncAMvREp0dNT7jENPn35cnIuiB1wambVeeaMfvE.jpg",
    "comments": [
        "https://preview.redd.it/sqa4087whlcc1.jpeg?width=3026&format=pjpg&auto=webp&s=d4930f0d6fab3d6511f95f0ede0c9b6cd839783b",
        "Elon Musk once said that AI would be a great challenge for every country and person. He told that in future nothing would be more dangerous as the AI.",
        "Our babus and politicians normally come out with a quickly hashed out policy with bare minimum effort, erred on the side of being overly strict and then wait for activism to get ideas to modify it, slowly, digging heels, dragging the process. That is the nature of things, unless you're someone very powerful and can lobby politicians.\n\nYou can change that, but what you can do is keep your efforts up without being disheartened. Activism, the good kind, which this is, it's what keeps those in power honest."
    ],
    "cleaned_text": "dealing deepfakes meitys version donate support ushttpspreviewredditqyajhelccpngwidthformatpngautowebpseddfdebedebfdbaebf tldr january wrotehttpsdrivegooglecomfiledfrhysosjnfepvopwcruzesjjmkviewuspsharingrefstaticinternetfreedomin ministry electronics information technology meity raising apprehensions ministrys conflicting statement around approach tackling issue deepfakes amidst series communications notices sent intermediaries reiterating need take proactive steps curb online harms internet public consultation deep research initiated ministry deepfakes dilemma rashmika mandanas deepfake video got widely circulated internet caught attention union government well prime ministerhttpswwwthehinducomnewsnationalpmmodiwarnsagainstdeepfakescallsonmediatoeducatepeopleonmisinformationarticleecerefstaticinternetfreedomin presidenthttpswwwthehinducomnewsnationalmisuseoftechnologytocreatedeepfakesthreattosocietypresidentmurmuarticleecerefstaticinternetfreedomin expressing caution noting potential threats deepfakes pose society meity also quick respond incident even conducted several meetingshttpswwwhindustantimescomtechnologyrajeevchandrasekharsocialmediaplatformsdeepfakecontroversyrashmikamandannahtmlrefstaticinternetfreedomin intermediaries primarily social media platforms minister electronics information technology shri ashwini vaishnaw conversing ai companies experts nasscom academicians spokehttpswwwthehindubusinesslinecominfotechnewregulationssoontotackledeepfakesvaishnawarticleecerefstaticinternetfreedomin publicly need drafting legislation deepfakes take clear action within dayshttpswwwbusinessstandardcomindianewsindiatohavedraftregulationondeepfakesindaysashwinivaisnawhtmlrefstaticinternetfreedomin ie december minister state electronics shri rajeev chandrashekhar also mentioned government would conduct open consultative process finalising legislation soon around december shri rajeev chandrashekhar shared union government considering releasing advisoryhttpswwwlivemintcomnewsindiacentretoissueadvisoryondeepfakessoonmoschandrasekharhtmlrefstaticinternetfreedomin dedicated regulation deepfakes apparent change plans declared media formal mechanism without accompanying justification reasoning weeks statements made public forum legislation regulation guideline appointment made public consultation held recently first week january reported meity considering amendinghttpswwwhindustantimescomindianewscentrelikelytoamenditrulestodefinedeepfakeshtmlrefstaticinternetfreedomin information technology intermediary guidelines digital media ethics code rules rules explicitly define deepfakes make obligatory intermediaries make reasonable efforts host back forth ministry created environment confusion indicative rushed surfacelevel interventions insufficiently deal complex problems synthetic media absence consultation diverse range stakeholders multiple sometimes conflicting statements become cause confusion among stakeholders including companies users highway rules hell meity urged intermediaries formal advisory sent december follow due diligence obligations listed notified amendment rules advisory seems aimed ensuring strict compliance identifying promptly removing misinformation false misleading content material impersonating others specifically targeting growing concerns around deepfakes intermediaries reminded legal provisions applicable case noncompliance provisions rules ie loss exemption liability provided section information technology act act notified amendments rules expanded requirement intermediaries rule b make reasonable efforts cause users post certain kinds content subclauses ix b list grounds content must removed intermediaries significantly amended particular rule bv ie knowingly intentionally communicates misinformation information patently false untrue misleading nature criticisedhttpsinternetfreedominpublicbriefontheitamendmentrulesrefstaticinternetfreedomin ambiguoushttpsfirstdraftnewsorglongformarticleunderstandinginformationdisorderrefstaticinternetfreedomin phrasing vague definition given potential consequences making private entities arbiters permissible speech violates directions honble supreme court shreya singhal vs union indiahttpsindiankanoonorgdocrefstaticinternetfreedomin moreover term false also implies presence objectively identifiable truth establishes binary truefalse online content however content complex digital space always neatly bucketed straightforward binary true false see herehttpswwwpewresearchorginternetthefutureoftruthandmisinformationonlinerefstaticinternetfreedomin herehttpswwwcigionlineorgarticlesitstimetothinkbeyondtheproblemsofdisinformationandfalsenewsrefstaticinternetfreedomin herehttpswwwtheatlanticcomideasarchivedisinformationpropagandaamplificationampligandarefstaticinternetfreedomin new provisions purportedly aimed providing additional recourse aggrieved users provide force law ultravires safe harbour framework section act given conflicting statements rushed policy interventions troubling suggestions wrotehttpsdrivegooglecomfiledfrhysosjnfepvopwcruzesjjmkviewuspsharingrefstaticinternetfreedomin meity highlighting stated concerns also noted definitional inadequacies rules challengeshttpsspectrumieeeorgaimisinformationfakenewsrefstaticinternetfreedomin accuratelyhttpspromiseinstitutelawuclaedupodcastmisinformationandsyntheticmediarefstaticinternetfreedomin identifyinghttpshbrorgaiisntreadytomakeunsuperviseddecisionsrefstaticinternetfreedomin synthetic media combined threats immunity held platforms stringent punishment noncompliance inaction may threaten media freedom legitimacyhttpswwwtechnologyreviewcomthebiggestthreatofdeepfakesisntthedeepfakesthemselvesrefstaticinternetfreedomin absence longterm interventions address underlying social problems imposing penalty taking away safe harbour case inaction delayed action part platforms address underlying cause spread content instead may result overpolicing content part platforms may forced make subjective arbitrary content moderation decisions absence deeper understandinghttpsmisinforeviewhksharvardeduarticlemisinformationreloadedfearsabouttheimpactofgenerativeaionmisinformationareoverblownrefstaticinternetfreedomin issue hand avoid losing safe harbour dealing deepfakes user rights version rise synthetic media evolving issue significance one many emerging issues digital space needs deep consideration thorough deliberation broadbased consultation cautioned ministry going ahead hurried policy regulatory actions based closeddoor meetings technology platforms advised broader multistakeholder consultation journalists factcheckers policymakers civil society organisations etc dealing potential malicious use synthetic media deeper uniform understanding harms including limited deepfakes againhttpsdrivegooglecomfiledlmzrqzjfumofetvejlqrrgrhxwviewuspsharingrefstaticinternetfreedomin asked ministry clearly state conception user harms indian context including various harms arising use synthetic media highlighted although risks posed deepfakes emergent problems efforts must made improve information literacy efforts understand effects changing information flows important documents press release advisory dated december sent meity intermediaries linkhttpspibgovinpressrelesedetailmaspxpridrefstaticinternetfreedomin iffs letter meity issue deepfakes linkhttpsdrivegooglecomfiledfrhysosjnfepvopwcruzesjjmkviewuspsharingrefstaticinternetfreedomin link iffs public brief amendment rules linkhttpsdrivegooglecomfiledmlegkmvycejkwawfgosdrhhhehyqviewrefstaticinternetfreedomin help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "dealing deepfakes meitys version",
    "cleaned_selftext": "donate support ushttpspreviewredditqyajhelccpngwidthformatpngautowebpseddfdebedebfdbaebf tldr january wrotehttpsdrivegooglecomfiledfrhysosjnfepvopwcruzesjjmkviewuspsharingrefstaticinternetfreedomin ministry electronics information technology meity raising apprehensions ministrys conflicting statement around approach tackling issue deepfakes amidst series communications notices sent intermediaries reiterating need take proactive steps curb online harms internet public consultation deep research initiated ministry deepfakes dilemma rashmika mandanas deepfake video got widely circulated internet caught attention union government well prime ministerhttpswwwthehinducomnewsnationalpmmodiwarnsagainstdeepfakescallsonmediatoeducatepeopleonmisinformationarticleecerefstaticinternetfreedomin presidenthttpswwwthehinducomnewsnationalmisuseoftechnologytocreatedeepfakesthreattosocietypresidentmurmuarticleecerefstaticinternetfreedomin expressing caution noting potential threats deepfakes pose society meity also quick respond incident even conducted several meetingshttpswwwhindustantimescomtechnologyrajeevchandrasekharsocialmediaplatformsdeepfakecontroversyrashmikamandannahtmlrefstaticinternetfreedomin intermediaries primarily social media platforms minister electronics information technology shri ashwini vaishnaw conversing ai companies experts nasscom academicians spokehttpswwwthehindubusinesslinecominfotechnewregulationssoontotackledeepfakesvaishnawarticleecerefstaticinternetfreedomin publicly need drafting legislation deepfakes take clear action within dayshttpswwwbusinessstandardcomindianewsindiatohavedraftregulationondeepfakesindaysashwinivaisnawhtmlrefstaticinternetfreedomin ie december minister state electronics shri rajeev chandrashekhar also mentioned government would conduct open consultative process finalising legislation soon around december shri rajeev chandrashekhar shared union government considering releasing advisoryhttpswwwlivemintcomnewsindiacentretoissueadvisoryondeepfakessoonmoschandrasekharhtmlrefstaticinternetfreedomin dedicated regulation deepfakes apparent change plans declared media formal mechanism without accompanying justification reasoning weeks statements made public forum legislation regulation guideline appointment made public consultation held recently first week january reported meity considering amendinghttpswwwhindustantimescomindianewscentrelikelytoamenditrulestodefinedeepfakeshtmlrefstaticinternetfreedomin information technology intermediary guidelines digital media ethics code rules rules explicitly define deepfakes make obligatory intermediaries make reasonable efforts host back forth ministry created environment confusion indicative rushed surfacelevel interventions insufficiently deal complex problems synthetic media absence consultation diverse range stakeholders multiple sometimes conflicting statements become cause confusion among stakeholders including companies users highway rules hell meity urged intermediaries formal advisory sent december follow due diligence obligations listed notified amendment rules advisory seems aimed ensuring strict compliance identifying promptly removing misinformation false misleading content material impersonating others specifically targeting growing concerns around deepfakes intermediaries reminded legal provisions applicable case noncompliance provisions rules ie loss exemption liability provided section information technology act act notified amendments rules expanded requirement intermediaries rule b make reasonable efforts cause users post certain kinds content subclauses ix b list grounds content must removed intermediaries significantly amended particular rule bv ie knowingly intentionally communicates misinformation information patently false untrue misleading nature criticisedhttpsinternetfreedominpublicbriefontheitamendmentrulesrefstaticinternetfreedomin ambiguoushttpsfirstdraftnewsorglongformarticleunderstandinginformationdisorderrefstaticinternetfreedomin phrasing vague definition given potential consequences making private entities arbiters permissible speech violates directions honble supreme court shreya singhal vs union indiahttpsindiankanoonorgdocrefstaticinternetfreedomin moreover term false also implies presence objectively identifiable truth establishes binary truefalse online content however content complex digital space always neatly bucketed straightforward binary true false see herehttpswwwpewresearchorginternetthefutureoftruthandmisinformationonlinerefstaticinternetfreedomin herehttpswwwcigionlineorgarticlesitstimetothinkbeyondtheproblemsofdisinformationandfalsenewsrefstaticinternetfreedomin herehttpswwwtheatlanticcomideasarchivedisinformationpropagandaamplificationampligandarefstaticinternetfreedomin new provisions purportedly aimed providing additional recourse aggrieved users provide force law ultravires safe harbour framework section act given conflicting statements rushed policy interventions troubling suggestions wrotehttpsdrivegooglecomfiledfrhysosjnfepvopwcruzesjjmkviewuspsharingrefstaticinternetfreedomin meity highlighting stated concerns also noted definitional inadequacies rules challengeshttpsspectrumieeeorgaimisinformationfakenewsrefstaticinternetfreedomin accuratelyhttpspromiseinstitutelawuclaedupodcastmisinformationandsyntheticmediarefstaticinternetfreedomin identifyinghttpshbrorgaiisntreadytomakeunsuperviseddecisionsrefstaticinternetfreedomin synthetic media combined threats immunity held platforms stringent punishment noncompliance inaction may threaten media freedom legitimacyhttpswwwtechnologyreviewcomthebiggestthreatofdeepfakesisntthedeepfakesthemselvesrefstaticinternetfreedomin absence longterm interventions address underlying social problems imposing penalty taking away safe harbour case inaction delayed action part platforms address underlying cause spread content instead may result overpolicing content part platforms may forced make subjective arbitrary content moderation decisions absence deeper understandinghttpsmisinforeviewhksharvardeduarticlemisinformationreloadedfearsabouttheimpactofgenerativeaionmisinformationareoverblownrefstaticinternetfreedomin issue hand avoid losing safe harbour dealing deepfakes user rights version rise synthetic media evolving issue significance one many emerging issues digital space needs deep consideration thorough deliberation broadbased consultation cautioned ministry going ahead hurried policy regulatory actions based closeddoor meetings technology platforms advised broader multistakeholder consultation journalists factcheckers policymakers civil society organisations etc dealing potential malicious use synthetic media deeper uniform understanding harms including limited deepfakes againhttpsdrivegooglecomfiledlmzrqzjfumofetvejlqrrgrhxwviewuspsharingrefstaticinternetfreedomin asked ministry clearly state conception user harms indian context including various harms arising use synthetic media highlighted although risks posed deepfakes emergent problems efforts must made improve information literacy efforts understand effects changing information flows important documents press release advisory dated december sent meity intermediaries linkhttpspibgovinpressrelesedetailmaspxpridrefstaticinternetfreedomin iffs letter meity issue deepfakes linkhttpsdrivegooglecomfiledfrhysosjnfepvopwcruzesjjmkviewuspsharingrefstaticinternetfreedomin link iffs public brief amendment rules linkhttpsdrivegooglecomfiledmlegkmvycejkwawfgosdrhhhehyqviewrefstaticinternetfreedomin help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "elon musk said ai would great challenge every country person told future nothing would dangerous ai babus politicians normally come quickly hashed policy bare minimum effort erred side overly strict wait activism get ideas modify slowly digging heels dragging process nature things unless youre someone powerful lobby politicians change keep efforts without disheartened activism good kind keeps power honest",
    "light_cleaned_title": "Dealing with Deepfakes (MeitY's Version)",
    "light_cleaned_selftext": "[Donate to support us](https://preview.redd.it/qyaj41h0elcc1.png?width=1600&format=png&auto=webp&s=1ed1601875df0de8807bed5e82bf8db0a658ebf6) **tl;dr** On January 09, 2024, we [wrote](https://drive.google.com/file/d/1frH8ys1Os2jN-fEpVO4p0WcRuZeSJJmk/view?usp=sharing&ref=static.internetfreedom.in) to the Ministry of Electronics and Information Technology (“MeitY”) raising our apprehensions about the Ministry’s conflicting statement around and approach to tackling the issue of deepfakes. Amidst a series of communications and notices sent to intermediaries, reiterating the need to take proactive steps to curb ‘online harms’ on the internet, no public consultation or deep research has been initiated by the Ministry. Deepfakes dilemma After Rashmika Mandana’s deepfake video got widely circulated on the internet, it caught the attention of the Union government as well, with the [Prime Minister](https://www.thehindu.com/news/national/pm-modi-warns-against-deepfakes-calls-on-media-to-educate-people-on-misinformation/article67543869.ece?ref=static.internetfreedom.in) and the [President](https://www.thehindu.com/news/national/misuse-of-technology-to-create-deepfakes-threat-to-society-president-murmu/article67597935.ece?ref=static.internetfreedom.in) expressing caution and noting the potential threats deepfakes pose to society. MeitY was also quick to respond to the incident and even conducted several [meetings](https://www.hindustantimes.com/technology/rajeev-chandrasekhar-social-media-platforms-deepfake-controversy-rashmika-mandanna-101700989063267.html?ref=static.internetfreedom.in) with intermediaries, primarily social media platforms. The Minister of Electronics and Information Technology, Shri Ashwini Vaishnaw, after conversing with AI companies and experts, Nasscom, and academicians, [spoke](https://www.thehindubusinessline.com/info-tech/new-regulations-soon-to-tackle-deepfakes-vaishnaw/article67564946.ece?ref=static.internetfreedom.in) publicly on the need for drafting a legislation on deepfakes and to take clear action on it [within 10 days](https://www.business-standard.com/india-news/india-to-have-draft-regulation-on-deepfakes-in-10-days-ashwini-vaisnaw-123112300437_1.html?ref=static.internetfreedom.in), i.e. by December 03. The Minister of State for Electronics and IT, Shri Rajeev Chandrashekhar, also mentioned that the government would conduct an open consultative process before finalising the legislation. Soon after, around December 14, 2023, Shri Rajeev Chandrashekhar shared that the Union government was considering releasing an [advisory](https://www.livemint.com/news/india/centre-to-issue-advisory-on-deepfakes-soon-mos-chandrasekhar-11702486730978.html?ref=static.internetfreedom.in), and not a dedicated regulation, for deepfakes. This apparent change of plans was once again declared to the media, and not through any formal mechanism, without any accompanying justification or reasoning. Weeks after these statements were made in the public forum, no legislation, regulation, guideline, or appointment has been made, or public consultation held. Most recently, in the first week of January 2024, it was reported that the MeitY is considering [amending](https://www.hindustantimes.com/india-news/centre-likely-to-amend-it-rules-to-define-deepfakes-101704482610756.html?ref=static.internetfreedom.in) the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (IT Rules, 2021), to “*explicitly define deepfakes and make it obligatory for all intermediaries to make “reasonable efforts” to not host them*”. All of this back and forth from the Ministry has created an environment of confusion and is indicative of rushed, surface-level interventions that insufficiently deal with the complex problems of synthetic media. In the absence of any consultation with a diverse range of stakeholders, these multiple, and sometimes conflicting, statements can become a cause of confusion among stakeholders, including companies and users. We’re on the highway to (IT Rules) hell MeitY urged all intermediaries, through the formal advisory it sent on December 26, 2023, to follow the due diligence obligations listed under the notified IT Amendment Rules, 2023. The advisory seems to be aimed at ensuring strict compliance with identifying and promptly removing misinformation, false or misleading content, and material impersonating others, specifically targeting growing concerns around deepfakes. The intermediaries were reminded of the legal provisions applicable in case of their non-compliance with provisions of the IT Rules, 2021, i.e. loss of exemption from liability provided under section 79(1) of the Information Technology Act (IT Act), 2000. The notified amendments to the IT Rules in 2022 expanded the requirement of intermediaries under Rule 3(1)(b) to “*make reasonable efforts to cause the* *users*” not to post certain kinds of content. The sub-clauses (i) to (ix) under 3(1)(b), which list the grounds on which content must be removed by the intermediaries, were significantly amended. In particular, Rule 3(1)(b)(v) i.e. “*knowingly and intentionally communicates any misinformation or information which is patently false and untrue or misleading in nature*” was [criticised](https://internetfreedom.in/public-brief-on-the-it-amendment-rules-2022/?ref=static.internetfreedom.in) for its [ambiguous](https://firstdraftnews.org/long-form-article/understanding-information-disorder/?ref=static.internetfreedom.in) phrasing and vague definition, given potential consequences of making private entities arbiters of permissible speech, which violates the directions of the Hon’ble Supreme Court in [*Shreya Singhal vs Union of India*](https://indiankanoon.org/doc/110813550/?ref=static.internetfreedom.in). Moreover, the term “false” also implies the presence of an objectively identifiable truth and establishes a binary of 'true-false' for all online content. However, content in the complex digital space cannot always be neatly bucketed into a straightforward binary of ‘true’ and ‘false’ (see [here](https://www.pewresearch.org/internet/2017/10/19/the-future-of-truth-and-misinformation-online/?ref=static.internetfreedom.in), [here](https://www.cigionline.org/articles/its-time-to-think-beyond-the-problems-of-disinformation-and-false-news/?ref=static.internetfreedom.in), and [here](https://www.theatlantic.com/ideas/archive/2021/10/disinformation-propaganda-amplification-ampliganda/620334/?ref=static.internetfreedom.in)). These new provisions, purportedly aimed at providing additional recourse to aggrieved users, do not “provide a force of law” as they are ultra-vires the safe harbour framework under Section 79 of the IT Act, 2000. Given these conflicting statements, rushed policy interventions, and troubling suggestions, we [wrote](https://drive.google.com/file/d/1frH8ys1Os2jN-fEpVO4p0WcRuZeSJJmk/view?usp=sharing&ref=static.internetfreedom.in) to MeitY highlighting the above stated concerns. We also noted that definitional inadequacies in the IT Rules and the [challenges](https://spectrum.ieee.org/ai-misinformation-fake-news?ref=static.internetfreedom.in) in [accurately](https://promiseinstitute.law.ucla.edu/podcast/misinformation-and-synthetic-media/?ref=static.internetfreedom.in) [identifying](https://hbr.org/2022/09/ai-isnt-ready-to-make-unsupervised-decisions?ref=static.internetfreedom.in) synthetic media, combined with the threats to the immunity held by platforms and stringent punishment for non-compliance or inaction, may threaten media freedom and [legitimacy](https://www.technologyreview.com/2019/10/10/132667/the-biggest-threat-of-deepfakes-isnt-the-deepfakes-themselves/?ref=static.internetfreedom.in). In the absence of long-term interventions that address underlying social problems, imposing a penalty or taking away safe harbour in case of inaction or delayed action on the part of platforms will not address the underlying cause for the spread of such content. Instead, it may result in over-policing of content on the part of platforms, who may be forced to make subjective or arbitrary content moderation decisions in the absence of a [deeper understanding](https://misinforeview.hks.harvard.edu/article/misinformation-reloaded-fears-about-the-impact-of-generative-ai-on-misinformation-are-overblown/?ref=static.internetfreedom.in) of the issue at hand to avoid losing their safe harbour. Dealing with deepfakes (User rights’ version) While the rise of synthetic media is an evolving issue of significance, it is one of many emerging issues in the digital space that needs deep consideration, thorough deliberation and broad-based consultation. We cautioned the Ministry against going ahead with a hurried policy or regulatory actions based on a few closed-door meetings with technology platforms, and advised for a broader multi-stakeholder consultation with journalists, fact-checkers, policymakers, civil society organisations, etc. who are dealing with the potential malicious use of synthetic media. For a deeper and uniform understanding of harms including but not limited to deepfakes, we [once again](https://drive.google.com/file/d/1LmZRQzJFUm5oFe8TVEjlq3r8r-G9RHXw/view?usp=sharing&ref=static.internetfreedom.in) asked the Ministry to clearly state its conception of ‘user harms’ in the Indian context, including the various harms arising from the use of synthetic media. We highlighted that although the risks posed by deepfakes are emergent problems, efforts must be made to improve information literacy and efforts to understand the effects of changing information flows. **Important documents** 1. Press release of advisory dated December 26 sent by MeitY to intermediaries ([link](https://pib.gov.in/PressReleseDetailm.aspx?PRID=1990542&ref=static.internetfreedom.in)) 2. IFF’s letter to MeitY on the issue of deepfakes ([link](https://drive.google.com/file/d/1frH8ys1Os2jN-fEpVO4p0WcRuZeSJJmk/view?usp=sharing&ref=static.internetfreedom.in)) 3. Link to IFF’s public brief on IT Amendment Rules 2023 ([link](https://drive.google.com/file/d/1_MLeGkMvycejK8wAwFgosd-R4HHhEHyQ/view?ref=static.internetfreedom.in)) Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)!",
    "light_cleaned_comments": "Elon Musk once said that AI would be a great challenge for every country and person. He told that in future nothing would be more dangerous as the AI. Our babus and politicians normally come out with a quickly hashed out policy with bare minimum effort, erred on the side of being overly strict and then wait for activism to get ideas to modify it, slowly, digging heels, dragging the process. That is the nature of things, unless you're someone very powerful and can lobby politicians. You can change that, but what you can do is keep your efforts up without being disheartened. Activism, the good kind, which this is, it's what keeps those in power honest."
}