{
    "id": "1erqrk5",
    "title": "'NIA Owes An Explanation' : Supreme Court Flags Discrepancy Between Witness Statement Narrated In Chargesheet & Actual  Statement",
    "url": "https://www.livelaw.in/top-stories/nia-owes-an-explanation-supreme-court-flags-discrepancy-between-witness-statement-narrated-in-chargesheet-actual-statement-266677",
    "selftext": "The charge sheet included a statement from protected witness Z alleging that on May 29, 2022, the appellant attended a meeting-cum-training session at Ahmad Palace. During this meeting, the expansion of PFI, training of its members, and discussions on Muslim empowerment were allegedly discussed, with directions issued to attack individuals who had made derogatory remarks against Islam. \n\nThe Court observed that the witness had not mentioned the appellant's name as a participant in the alleged PFI meeting, and the content of the discussions as recorded in the witness statement did not include any specific directions for attacks as alleged in the charge sheet. ",
    "flair": "Crime",
    "score": 5,
    "num_comments": 1,
    "created_utc": 1723604027.0,
    "convurl": "https://external-preview.redd.it/IR_EWco38N0CMN7cBVtEh8iCe013zWhEP_n-ggZpsYE.jpg?auto=webp&s=a78b46956d8bfad72f654d79ba7841645d207f47",
    "comments": [
        "OP is anti-national, don't you see what is happening with Hindus in Bangladesh? /s"
    ],
    "cleaned_text": "nia owes explanation supreme court flags discrepancy witness statement narrated chargesheet actual statement charge sheet included statement protected witness z alleging may appellant attended meetingcumtraining session ahmad palace meeting expansion pfi training members discussions muslim empowerment allegedly discussed directions issued attack individuals made derogatory remarks islam court observed witness mentioned appellants name participant alleged pfi meeting content discussions recorded witness statement include specific directions attacks alleged charge sheet ",
    "cleaned_title": "nia owes explanation supreme court flags discrepancy witness statement narrated chargesheet actual statement",
    "cleaned_selftext": "charge sheet included statement protected witness z alleging may appellant attended meetingcumtraining session ahmad palace meeting expansion pfi training members discussions muslim empowerment allegedly discussed directions issued attack individuals made derogatory remarks islam court observed witness mentioned appellants name participant alleged pfi meeting content discussions recorded witness statement include specific directions attacks alleged charge sheet",
    "cleaned_comments": "op antinational dont see happening hindus bangladesh",
    "light_cleaned_title": "'NIA Owes An Explanation' : Supreme Court Flags Discrepancy Between Witness Statement Narrated In Chargesheet & Actual Statement",
    "light_cleaned_selftext": "The charge sheet included a statement from protected witness Z alleging that on May 29, 2022, the appellant attended a meeting-cum-training session at Ahmad Palace. During this meeting, the expansion of PFI, training of its members, and discussions on Muslim empowerment were allegedly discussed, with directions issued to attack individuals who had made derogatory remarks against Islam. The Court observed that the witness had not mentioned the appellant's name as a participant in the alleged PFI meeting, and the content of the discussions as recorded in the witness statement did not include any specific directions for attacks as alleged in the charge sheet.",
    "light_cleaned_comments": "OP is anti-national, don't you see what is happening with Hindus in Bangladesh? /s"
}