{
    "id": "1dlryq1",
    "title": "Pizza I ordered vs Pizza I got",
    "url": "https://www.reddit.com/gallery/1dlryq1",
    "selftext": "oh look at those toppings 😋",
    "flair": "Rant / Vent",
    "score": 1527,
    "num_comments": 273,
    "created_utc": 1719049103.0,
    "convurl": "https://i.redd.it/t6r8dpekf38d1.jpg",
    "comments": [
        "Ordered this only because I had a 50% off coupon. It was full of cheese and tomato puree with only a handful of toppings.",
        "sedlyf",
        "Yep, that's why I only make pizza at home. Besides indont know if I'm the only one but dominos and pizza hut 100% give me a bad stomach every single time. Haven't touched dominos since 2017",
        "50% toppings off.",
        "Sorry u/SADDEST-BOY-EVER",
        "Must be at ur Domino's cause I order this last week and it was full of toppings I mean i could bearly see the cheese",
        "I hate big pizza chains like dominos and pizza hut, quality is so poorly maintained, I'd rather suggest going for newly found chains since they'd have pressure to grow",
        "Brick oven proudly burns its pizza. So newer chains are not really consistent. But I agree Dominoes and Pizza Hut are shit.\n\n\nWish Papa Jhons. was still arounf.",
        "Bas 1920 ka farak hai, I mean it is possessed",
        "Atleast you got cheese.... None of the pizza places in my locality even bother putting cheese",
        "i mean... it really looks like a nice pizza, call me crazy but i'd demolish that like some sort of animal, each peice in 2 bites job, you know? the real savage kind, where who ever is in the room with you is never quite able to fully look at you the same again",
        "Govt. cut it's portion before it got delivered.",
        "Yup.  Cheese is replaced with cheap mayonnaise",
        "Literally me",
        "Be sure to trash them in the feedback link provided and share this on twitter. Btw this is typical big chain cost cutting , try to find local pizza places . They are far better atleast in tier 1 ,tier 2 cities.",
        "Do you make your own base too or buy a base? Because making a base is the most time taking task",
        "My local dominos is the same. Stopped ordering long time ago.",
        "Seeing the ***Rant*** flag, I came looking for snakes, cockroaches or Rats... but it is just a regular rant /s",
        "It’s because you’ve turned on the enhance and magnify feature 😀",
        "Gotta appreciate your wicked humour 🙂‍↔️🤲",
        "Food Pharmer needs to do some videos on fast food and restaurants. Let this kind of false advertising also be addressed and brought to attention on a larger scale.",
        "“Images are only for representation purposes. The original product might vary in appearance”..\n\nRestaurants have taken this so seriously, the product delivered does not even match 10% to the image 🫤",
        "Haha wth",
        "Username confirms",
        "Buy the base, once in a while make my own sauce also. Else I mix pizza pasta sauce with the Chinese momo chili sauce, since the pasta sauce is too sweet.",
        "True. OP should post it in twitter and we can make it viral.",
        "At least there are a few chunks of even. Ever understood the pain of people who order Pepperoni or Kheema Pizza? Chilli Flakes and Oregano sprinkles are way more prominent than meat in these Pizzas!!\n\nCustomer bhagwaan samaan hota hai, woh bas Paisa deta hai aur dukandaar apne grahak ko sabak sikhata hai. Bas got to remember this. Humein C*** banne ka shouk hai aur dukandaar ko c**** banane ka shouk hai, that's the only difference mate.",
        "The Wordplay is amazing",
        "Us moment",
        "This is probably a different pizza, you should report it.",
        "It does look like a different pizza. No way it has 5 type of chicken toppings. Can see like 2",
        "There you go. 50% off on everything. Be glad they didn't eat half of it.\n\nJokes aside. It's a scam. I paid 900 for a pizza to get something smaller than my dinner plate.",
        "I don't know man it kinda looks the same 😕",
        "I would love to, but that damn feedback link appears to have an impact on the staff, rather than the company taking it as a feedback to improve their services. Their delivery people have told me multiple times that giving feedback gives them promotion (literally what they said). They have even sent me messages lol. I’m just scared if they get dealt with harshly from their higher ups.\n\nhttps://preview.redd.it/ldn5h2tkw38d1.jpeg?width=1242&format=pjpg&auto=webp&s=fe1fe6192bab1f17dfda4ac9a49ec0ed9489181c",
        "Bold of you to assume that you will get exact food items as shown in figure.",
        "Who moved my toppings!!",
        "Pizzas in India are mostly a scam with horrible cheese and base.",
        "I've found that Dominos in India do not shy away from skimping. Their pizzas are often substandard in flavour, toppings, cheese and dough quality. Even the cheese burst pizza doesn't come with the same quantity of cheese and flavour that it did before Covid. With that kind of quality at the core their prices don't justify any of their products. Think they have taken the customers for granted. Time to find more authentic and better value for money pizzas!",
        "I think most people buy a base",
        "Maaf karna bhai mujhe bhook lagi thi that's why I nagged some of those hope you don't mind Jai Hind",
        "I mean...aren't the staff members the ones who prepared your pizza?",
        "Dominoz will never learn",
        "Dominos sucks",
        "Shadi karogi? Khana bhi mai bnaunga safari bhi karunga.",
        "Write a complaint on fssai and consumer forum",
        "Man I miss Indian pizzas.",
        "Mojo pizza?? \n\nBro 7 years back i bought the meat eater for 600 and ate the whole thing myself. Best pizza I've ever had.",
        "Oh yeah ordered the same pizza, was complete trash. But man I have understood that dominos tastes like shit. God knows why people eat from there. I am most likely never ordering from there after spending my 300 rupees in the wallet haha.",
        ">safari bhi karunga.\n\nBacche karunga sune the, ye market mein naya aaya hai kya? 😂",
        "Yes I've noticed the difference. The quality differs by location. Like in tier 3 cities you'll get the pizza with lesser toppings while in a metro city, the same pizza will be baked and topped better.",
        "They call it liquid cheese",
        "You bought this shit for 500?",
        "Safai bhai, typo ho gaya.",
        "Pls don’t buy pizza mania and those 100 rupee meals from domino’s. Pat the premium and get normal pizzas which don’t have that horrible “cheese blend” which literally feels like Mayonnaise",
        "Ye bik gyi hai gormint!! Abh iss gormint mei kch na raha ye saare milke pagal banare ** ke baache",
        "Yeah, been there and this can be surely reported",
        "I have gone through all this years ago don't fall for their emotional bs . They are the ones doing the cost cutting at the outlet level , your negative feedback will just expose them to the top management.  \nI started getting loaded pizzas after my nearest outlet got several negative feedbacks . And then they used to call and beg for positive feedbacks or the outlet will close . \nRanting or actually complaining whatever works for you i guess .",
        "I hope You know Domino’s , McDonald’s and some other popular fast food joints don’t use real cheese",
        "Both look appetizing 💯",
        "okay then, no mercy this time.",
        "Thanks for this. Didn't know!",
        "Dominos.",
        "Bah these guys are only good for the pizza mania",
        "Plus taxes ~50",
        "In my area there are 4 dominos  2 McDonald's 2 kfc and 4 subways. Exactly 50% outlets  for each chain are worth any  good.\n\nThere is a lack of consistency among outlets of same food chain. The outlets that are very busy or very rarely busy are just pathetic to taste.",
        "Can anyone suggest me best pizza outlets to order... don't wanna use dominos due to these type of cases",
        "Which one? Most bases to buy are terrible",
        "Username checks out 🥹",
        "huh?",
        "Unpopular opinion, but the pizza is decent. The picture is that of a regular-sized pizza, the relative size of the toppings therefore are much bigger and cover a larger amount of pizza while what you have ordered is a large size. the relative size of the topping will obviously seem a lot smaller in comparison. Not saying the picture is 100% accurate but not at all misleading",
        "more specifically palm oil, the most inferior type of oil these fast food chains serve us!",
        "And roadside ‘ paneer’ is not paneer at all",
        "https://preview.redd.it/ba4ame8g848d1.jpeg?width=1080&format=pjpg&auto=webp&s=0a2ec261cd8a643bad82c970031f398b09a31546",
        "Same thing happened with me when I ordered from Pizza Hut",
        "Normally it's milk solids with more than half vegetable oils",
        "They use AI to generate images nowadays. Zomato uses stock images.",
        "That sucks too. Barely any toppings and full of cheese, or maybe I’m cursed 🤷‍♂️",
        "Bhagwan kassam isne toh kat diya !",
        "It does but for 100-110 rupees, the chicken pizzas are alright.",
        "It is the pizza you deserve but not the one you need right now.",
        "https://preview.redd.it/rinrq24t948d1.jpeg?width=640&format=pjpg&auto=webp&s=a5041cdb49b663d7a02ff3da2eda59e0f30f05a1",
        "Advertising???\n\nHe’ll flat out ask you to not eat this junk!!",
        "They missed *Note:* Items in image not to scale",
        "It costs 200 now 😭",
        "Wasn't delivered along with dead rat or severed human finger \n\n10/10",
        "Bro got catfished",
        "Pizza mania?? Since when? Just had it 2 month back and it was 110",
        "Bhai domino's is the worst. If you are from Mumbai try Square Pizza. It's the best",
        "I remember the days when I used to order the Large Chicken Dominator from Dominos, and it used to come fully filled with Chicken pieces with no compromises.",
        "1000rs pizza you are rich brother 😶",
        "Idk man, i made pizza at home like once in my lifetime 😭",
        "that's 4 serves? how many slices can one usually eat before feeling full?  \nI mean, pizza is my favorite food and I usually eat for 3 days at a time so that pizza right there is 2/3 of a day for me 🤣",
        "Tds katta hai sir enjoy the rest",
        "Damn it sounds like India needs some better pizza options lol Papa johns is trash",
        "Shame 2 shame",
        "I know what I'm ordering for dinner tonight.",
        "Domino's have no quality control at all. Like AT ALL. And their customer service sucks ass. I've had missing orders and bullshit from them at various locations from before.",
        "oh my bad, I confused pizza mania for non-veg loaded.",
        "I had a similar experience, on a different app tho. Got something that was wayyy different from the pictures. I was using Tinder.",
        "That pizza has a disgusting among of cheese on it.",
        "Whattt, matlab me kuch aur hi kha raha tha, protein ke name pw",
        "…",
        "https://preview.redd.it/ymccuz2vj48d1.png?width=1080&format=pjpg&auto=webp&s=4c8d57e35ad2ca0a831dfe9b45775cfd3ddf631a\n\nBeen tricked same way. But my pizza was far more horrible in presentation and taste. Finally gave up ordering pizza from all such fake look and nonsense taste joints.",
        "You met her eh?",
        "🤣🍕",
        "😛Smoking Joe's, When they had started. 😋",
        "It looks good, I hate chicken or beef on a pIzza tbh \n\nOnly peporini for me",
        "Poor OP's sentimental and got played by those pizza boys fooled him into giving 10/10 rankings.",
        "Check the tax paid in the bill. They always get paid first, as you pay first, even before you're served.",
        "Guess the menu of this guy's shaadi. Pizza, the exact same pizza as above.\n\n🤣🍕😂",
        "Dominos??",
        "https://i.redd.it/dokjjaq4m48d1.gif",
        "I stopped both same time, once after visiting and seeing how they actually prepare a hand made pizza at Dominoes. \n\nExact same tummy pain and nausea effect. They all use low quality inputs. High advertising and junk fake reviews keep their business rolling.\n\nHome made pizza costs one fourth their costs, and tastes ten times better.",
        "Looks good",
        "> I've found that Dominos in India do not shy away from skimping. Their pizzas are often substandard in flavour, toppings, cheese and dough quality.\n\nThey're able to do all this because we don't really have better alternatives. Every single alternative pizzeria in my city ends up making even worse pizza slathered with mayo. It can't be that hard, but for some reason no real better options.",
        "What is it?",
        "Yes.",
        "dominos is a scam nowadays, earlier atleast bread was good",
        "Ofcourse. I myself haven't had pizza from outside since I got married. The wife makes top tier pizzas that are way healthier.\n\nStill, the false advertising from these big fast food chains is extremely manipulative. The pizzas and burgers on their display are way far from what is actually served and everyone knows this. About time for the public to keep this in check.",
        "100%, never ordered pizza hut anyways man, love my pizzas but paying 1000 bucks for it is atrocious, the small ones from anywhere don't even qualify as pizzas. \n\nThe meat is always old, cheese isn't cheese, it's emulsified mayo or something. Shitty dough and bread. Indian food regulators hardly care. \n\nThe photos and what's real is a rip off. Specially with the Zomato app AR feature.",
        "True.",
        "Italians will shit on it...need proper pizza makers in India now that its very popular here",
        "It's all cold storage stuff and palm oil. We copying the western lifestyle, that trend ended in their 1970s-1990s, we feel cool copying that lifestyle. They are on fresh foods now, we will adopt that lifestyle in 2050-60s.",
        "\"🙂‍↔️🤲\" What does it mean, shaking my head sideways & praying?",
        "r/usernamechecksout",
        "Yeah, if you have a Tossin nearby then it is a must try, they have maintained their quality since inception.",
        "Is this Dominos? It sucks.... I've tried to take my friends to authentic pizza places...\n\nBut they're used to thick bread + whatever they use for cheese + lucky if you get good toppings..",
        "Being in awe with OP (or it's safe to say OP's humour) is all I wanted to mean 🙂‍↔️ stop trying find \"meaning\" of every emoji.",
        "Reel vs real life 🤣",
        "Dominoes doesn’t even use real cheese. Its cheese by products and some mixed mayonnaise like cheese that tastes horrible",
        "Best is to make the pizza at home. Where I live, there are some very good pizzerias that serve actual pizza without that fake cheese and mayonnaise crap. Its expensive but once in a while its fun to get good Pizza.",
        "> stop trying to find \"meaning\" of every emoji \n\n🙂‍↔️↔️🫨⬆️",
        "Yes.",
        "My parents and me",
        "98% Pizzerias are scamsters .Better to make your own pizza at home— more toppings for less the price.",
        "coupon de de bhai",
        "It ain't Japan bro",
        "Bas 19-20 ka farak hai",
        "Redeemed already so it’s useless.",
        "better to order from a local but well known area, pizza chains like dominos have low quality food sumtimes, also if u tell where u live i might be able to suggest   \nonly downside is that shits expensive",
        "You can ask for a refund by filling the feedback form.",
        "That's the punishment god gave you because you ordered pizza with chicken",
        "Dominos is a scam, I would definitely take it to the shop ask them to make me a new one, trust me they gave me 2 + 1 pizzas 🍕 for free.",
        "???",
        "wow.",
        "They made sure you are living up to your username. \n\n/s",
        "Bhai pizza meh koi kami nahi hai, Tera lightning aur photography skills meh kami hai 🤣",
        "He’ll do a video on fast foods - don’t eat fast food. Its probably the worse, most ultra processed bullshit food in the world. Who’s going to waste time fighting lesser pieces of shit on a big piece of shit.",
        "“lightning”",
        "Domino's does use cheese with their Pizzas, if you buy their Pizza Mania range or Cheese Burst addon however you get cheese substitute like mayonnaise. Domino's is not hiding this stuff from you. \n\n[https://www.dominos.co.in/real-mozzarella-cheese](https://www.dominos.co.in/real-mozzarella-cheese)",
        "Kuch nahi hota. I’ve ordered rice bowls from the good bowl in the past and the second time they delivered a rice bowl which had a very small quantity of chicken. I was furious because it almost felt like I had no chicken. \n\nCalled up the customer care and explained it and all they said was we’ll try to convey it to the restaurant and make sure (how?!) that you have a better experience next time. And gave me some useless amount of points for another platform that I didn’t even use.\n\nThere should be regulations which enforce that restaurants are clearly mentioning how much quantity of the major ingredients we are getting. Some restaurants already do that but most not.",
        "it's not like local pizzerias don't follow cost cutting methods as well. The only difference I've seen most local places serve foodfire thin crust Pizzas with more or less the same amount of toppings for chicken pizzas for the same price (or sometimes even more).",
        "Making pizzas on your own at home requires quite the effort and patience.... From making the dough itself, you need a really good quality oven or you'll end up making the crust into a crispy biscuit on the base and the edges. Making pizza sauce and getting all ingredients and cheese is also a factor. \n\nOrdering Pizza can take 20 mins to an hour and most people are going to choose the second option.",
        "idk about Keema pizza but I often order their Chicken Pepperoni Pizza when there's a big discount and they've never (ever) sprinkled oregenos in any of the Domino's outlets I've visited here in Goa. They do give generous amounts of oregeno and chili flake packets though. Chicken Sausage is the only topping I've found where they would pre-apply oregeno sprinkles.",
        "agreed! I would devour it lol",
        "Yes",
        "Serves 4? I’d eat that all by myself on a good day.",
        "Although I know I would be downvoted for this but I'll say it anyway.\n\nAs someone who works in the pizza shop (not in India), the only difference I can tell from the photos as that the toppings are added after cheese in the professional photo. And in reality the toppings are added before the cheese. \n\nI'll also add reason why, in professional photo we need to show what type of toppings customer will get. And when we actually cook it, meat toppings tends to lose its juices when cooked at such high temperatures so they are kept under the cheese. \n\nThat said, Dominos is notorious in giving less toppings all over the globe. I'll only have something from Dominos only if I'm in the mood for double cheese pizza😋",
        "fuck",
        "Domino's has gone from good to worst",
        "19-20 ka fark hai bas",
        "Toppings changed 🥲",
        "Time to make your own",
        "Agreed...I currently live in nashik so no good local outlets here but going to shift in pune in months",
        "Bro a pizza without cheese is like no Mattar in Mattar paneer 😭🤌",
        "Well i asked for a fully loaded veg but got corn 2 times but my introverted ass would never argue with them",
        "*Processing img yisw82x9k58d1...*",
        "*Processing img yisw82x9k58d1...*",
        "https://preview.redd.it/ngocqvtdl58d1.jpeg?width=2160&format=pjpg&auto=webp&s=dfca1111f9378dfee6d8bb48d53f0ce690bb4f52",
        "फोन कर के पूछा कि नही? पोलियो वाला मुर्गा था क्या?",
        "Still looks delicious",
        "That was a rumour, they released a statement that they use real dairy cheese in all pizzas except pizza mania(cheesy mayo in this one) and cheese burst contains a blend of cheddar and mozzarella\nIdk how true it is but they’re fssai certified so they can’t lie on record ",
        "Still looks delicious",
        "Damn the pizza looks dead",
        "Same same but different",
        "Typical pizza joints lying about sausage girth smh",
        "They both look delicious tbh",
        "Dude delivery guys didnt fuck up your pizza, but the restaurant workers def did. Why are you considering all the staff the same and shielding the bad ones from blame?",
        "Same same but Different.. 😅🤣🤡",
        "5 chicken feast? i see none, you got robbed.",
        "“Loaded” lmao",
        "where chicken",
        "bro is not helping with the 'any app is a dating app if you're Indian enough' stereotype",
        "Welcome to reality.. where the reality doesn’t match the producf",
        "It looks better in person",
        "I love seeing the different ways the world eats pizza.",
        "Bro, the pizza you got looks 100x better than what you ordered. Too many toppings is not a good thing. Look at all that delicious browned cheese.",
        "The pizza OP got looks 100x better than the photo.",
        "havent lived in either places but yeah im assuming punes gonna have better food choices",
        "that's cheap, where is this ?",
        "chicken chicken chicken chicken chicken chicken chicken",
        "Next time try Lapinoz butter chicken pizza with cheese burst",
        "In American that would be impressively close",
        "They cost a fortune and they have even stopped tasting good from the last couple of years. You can easily make a better pizza at home.",
        "That's why I don't eat out and would rather make it at home. Eating out or even getting it delivered to home is so disappointing.",
        "The better option is at home. Its not that hard. Grab a good quality pizza sauce, diced mozarella cheese, oregano and basil from a mall/online grocery store. Grab a whole wheat pizza base from your bakery.\n\n1. Spread a generous amount of pizza sauce on the Pizza Base\n\n2. Add a generous amount of cheese\n\n3. Add a generous amount of toppings of your choice. I recommend Capsicum and Onion. They are classic and give the 'Pizza smell and taste'. If you have more budget then you can even add black olives if you like it. Or you can also add cut sausages\n\n4. Sprinkle oregano and basil on top\n\n5. Put it in the oven for 10-15 mins\n\nYou will get a 100 times better pizza at 1/4th the price.",
        "You can get good quality dough and pizza sauce online. Not an issue. BigBasket has it in my area. I think Blinkit should have it too everywhere",
        "Can you recommend some good pizza places?",
        "As someone who works in Dominos i can say that u ll not get what u see in the pictures. But yeah ur pizza looks almost a 5* pizza (thts what we call a perfect pizza) tho its missing a few toppings",
        "Looks good, still",
        "The only thing I can think of is that the photo is of a regular Pizza while you ordered a large(?). So the toppings looks scarce in comparison\n\nThey still should've added in a bit more toppings though. I only order regular pizzas so haven't faced this issue",
        "That's not the same 🙄",
        "I was gonna say the same, the first one seems overloaded",
        "nahi 1029 ka farak hai.",
        "They’re the same picture",
        "I hate these enterprises . Gotta give the delievery men tip because these companies don't bother giving them enough salary . And now full rating to cover up these companies' flawed ass .",
        "Big Basket is only available if you live in Tier 1 cities. There is no bigbasket in Goa so far. There are over 10 Dominos and Pizza Hut outlets and other chains like Lapinoz and local pizzerias are also popping up. It's way easier to just to just buy Pizza from chains that source quality ingredients and do it yourself without fucking it all up. \n\nAlthough Swiggy Instamant and Blinkit does exist here the options for pizza dough isn't available in many tier 2 and tier 3 cities.",
        "Aadhar card ahh pizza",
        "You just don’t have the right lighting \\s",
        "OP fell for the oldest marketing trick in the book lol.",
        "The pizza you got looks so much better",
        "I’m so high I’d eat that pizza within seconds, then I’d eat the real pizza.",
        "Same toh hai bhai!",
        "I am aware of this but I think this varies from outlet to outlet because the outlet in my city barely puts any mozzarella cheese even on regular pizza and it's full of mayo shit",
        "Had the same thing yesterday... Same pinch",
        "Don't complain the Pizza is skimpmaxxing",
        "small light use karigayi hai",
        "5 chicken probably meant 5 pieces of chicken in total.",
        "I can suggest in Bangalore.. Where do you stay",
        "Which website is this? Doesn't look like Domino's or Pizza Hut...",
        "Agree it looks delicious but toppings are significantly less compared to the photo",
        "Should have ordered small 😛",
        ">pizza boys fooled him into giving 10/10 rankings.\n\nSpankings*",
        "Advertisement : loaded with 5 different toppings \n\nReality : loaded with 5 total tiny chicken toppings",
        "Yea, my immediate reaction was 'That's how it's supposed to look?' No real pizza is going to look like the first pic.",
        "First of all … is that even a pizza ??",
        "The feast is for the restaurant from where you are ordering.",
        "Qt are you selena gomez , coz I want to make you sing on high notes in pain 😍.",
        "Are those local brands?",
        "still looks good imo, not everday you see such even browning of the cheese",
        "https://i.redd.it/k0re7lobz88d1.gif",
        "https://i.redd.it/kufvyymcz88d1.gif",
        "Was the cheese real? I've heard dominos doesn't use real cheese.",
        "MMMMJD\n(Mujhe Mast Mahaul Mein Jeene De)",
        "I've heard that the dough size for all pizza sizes are the same. So the larger the pizza you order, the thinner the crust. Is that true?",
        "They were also accused of using fake cheese in India years ago, is that still the case?",
        "Wrong lyrics mate..it's kuch dard hain mere sene mein not bdsm, then this line...",
        "Pta hai bro.. thoda match kiya toh song dimaag me aaya.. toh aage ka likh diya",
        "Ok",
        "india moment",
        "Shittiest thing to put on a pizza ever",
        "Why are pizzas in India so expensive?",
        "Domino's is a scam.",
        "Same same, but different 🙃",
        "I wouldn't know about that and don't have any evidence except for my tastebuds.",
        "and what does your tastebuds say about the cheese, feels real?",
        "Only non veg loaded is good along with pizza mania onion and Margherita",
        "https://preview.redd.it/ek396nx0k98d1.jpeg?width=800&format=pjpg&auto=webp&s=b5cf07b13eafa68ac9d046850ae51efa97e39e9f",
        "It does require patience and effort but isn’t that a better alternative to shit pizzas that we buy online? Ingredients are fresh and you know what is going on your pizza. You can get ready made dough now as well. Also, you don’t need a wooden oven as not everyone has it but if you learn the technique then it comes out well ✅\n\nMaking a basic pizza sauce is literally too easy - all the ingredients and cheese is available on zepto, instamart as well.",
        "If you're getting mayo on regular pizza you are getting scammed! You paid for the real thing and you're getting a Pizza Mania treatment. You can report this to Domino's as well as the store manager, click photo and name and shame on x.com and Google Maps reviews. Not only will they lose reputation but you will get your money back 100%.\n\nI've personally complained a few times and everytime I did I got a callback from Dominos and they would always credit 300 rs in my Dominos account wallet.",
        "Bada kamzor leg piece hai…\nIss chicken ko polio ho gaya tha kya?",
        "File a complaint",
        "You've pretty much repeated the same thing I've said. You can simply order a pizza if you have cravings for it while making pizza at home from scratch, not only requires time, preparations, and quality ingredients but also a skill like baking it at the right temperation and getting it done just right. You also need to love cooking something that I personally don't really like doing. \n\nI've seen my friends either under bake or overburn their home made pizzas. It's all good if you have the patience to learn but just not worth it for most people.",
        "This is why I only order Margherita from Domino's, toppings are a scam there.",
        "It has been quite some time since I have ordered from dominos but the next time I do I will keep an eye on it and make sure to raise complaint\n\nThanks!",
        "Yes.",
        "Wow!! Take a load of this guy xD",
        "Sue them!",
        "Wtf... really?",
        "Those toppings look too heavy for the slice to hold them.",
        "Late 90s were awesome.",
        "I recommend you oven story pizza it's my favourite",
        "oh fuck, I love your humour lol. I am gonna steal this comment btw hehe",
        "“Indians ko kya hi samjhega cheese me fark” - dominos",
        "Damnn I had the opposite experience!\n\nhttps://preview.redd.it/1kb1znz2fc8d1.jpeg?width=1170&format=pjpg&auto=webp&s=fcb3aa3a2551e409ecdc63a730e2de683fc70972",
        "😲😋 bon appetite!",
        "Exactly",
        "Wapas karde bhai mat kha. Isme yahan post karne jaisa kya tha?",
        "A thousand for THAT? no way. Mere ghar ke paas ek small business pizza shop hai wo log 350 mai itna bada/isse bada pizza dete hai and at least 3 times this much toppings. \nBurgers online are an even bigger scam lmfao",
        "looks like a fkin good pizza (in standards of what we get in india)",
        "You spent a thousand on a pizza ?",
        "https://preview.redd.it/1cfrhhafln8d1.jpeg?width=4284&format=pjpg&auto=webp&s=5bb52f7b3dcd9c6650e9013a8046661539feba02\n\nStill better than what I got i guess 🤡",
        "omg 😭",
        "And this was a medium pizza 🥲",
        "😔",
        "r/mildlyinfuriating",
        "Resembles arranged marriages what you see vs what you get🤣",
        "Ordered this mainly due to a 60% discount. It was packed with cheese and tomato puree, but disappointingly sparse on toppings.  \nNOTE: Next time go there and have your PIZZZA Dont Order haha",
        "Dominos has been increasing the prices and decreasing the toppings proportionally 😃",
        "The images shown are just for representation purpose.",
        "https://preview.redd.it/w7otu1bx2vbd1.jpeg?width=828&format=pjpg&auto=webp&s=db35f9025b894502b6b61431c6f8c9d4867bf7ad",
        "Oven Story is the best in India"
    ],
    "cleaned_text": "pizza ordered vs pizza got oh look toppings ",
    "cleaned_title": "pizza ordered vs pizza got",
    "cleaned_selftext": "oh look toppings",
    "cleaned_comments": "ordered coupon full cheese tomato puree handful toppings sedlyf yep thats make pizza home besides indont know im one dominos pizza hut give bad stomach every single time havent touched dominos since toppings sorry usaddestboyever must ur dominos cause order last week full toppings mean could bearly see cheese hate big pizza chains like dominos pizza hut quality poorly maintained id rather suggest going newly found chains since theyd pressure grow brick oven proudly burns pizza newer chains really consistent agree dominoes pizza hut shit wish papa jhons still arounf bas ka farak hai mean possessed atleast got cheese none pizza places locality even bother putting cheese mean really looks like nice pizza call crazy id demolish like sort animal peice bites job know real savage kind ever room never quite able fully look govt cut portion got delivered yup cheese replaced cheap mayonnaise literally sure trash feedback link provided share twitter btw typical big chain cost cutting try find local pizza places far better atleast tier tier cities make base buy base making base time taking task local dominos stopped ordering long time ago seeing rant flag came looking snakes cockroaches rats regular rant youve turned enhance magnify feature got ta appreciate wicked humour food pharmer needs videos fast food restaurants let kind false advertising also addressed brought attention larger scale images representation purposes original product might vary appearance restaurants taken seriously product delivered even match image haha wth username confirms buy base make sauce also else mix pizza pasta sauce chinese momo chili sauce since pasta sauce sweet true op post twitter make viral least chunks even ever understood pain people order pepperoni kheema pizza chilli flakes oregano sprinkles way prominent meat pizzas customer bhagwaan samaan hota hai woh bas paisa deta hai aur dukandaar apne grahak ko sabak sikhata hai bas got remember humein c banne ka shouk hai aur dukandaar ko c banane ka shouk hai thats difference mate wordplay amazing us moment probably different pizza report look like different pizza way type chicken toppings see like go everything glad didnt eat half jokes aside scam paid pizza get something smaller dinner plate dont know man kinda looks would love damn feedback link appears impact staff rather company taking feedback improve services delivery people told multiple times giving feedback gives promotion literally said even sent messages lol im scared get dealt harshly higher ups bold assume get exact food items shown figure moved toppings pizzas india mostly scam horrible cheese base ive found dominos india shy away skimping pizzas often substandard flavour toppings cheese dough quality even cheese burst pizza doesnt come quantity cheese flavour covid kind quality core prices dont justify products think taken customers granted time find authentic better value money pizzas think people buy base maaf karna bhai mujhe bhook lagi thi thats nagged hope dont mind jai hind meanarent staff members ones prepared pizza dominoz never learn dominos sucks shadi karogi khana bhi mai bnaunga safari bhi karunga write complaint fssai consumer forum man miss indian pizzas mojo pizza bro years back bought meat eater ate whole thing best pizza ive ever oh yeah ordered pizza complete trash man understood dominos tastes like shit god knows people eat likely never ordering spending rupees wallet haha safari bhi karunga bacche karunga sune ye market mein naya aaya hai kya yes ive noticed difference quality differs location like tier cities youll get pizza lesser toppings metro city pizza baked topped better call liquid cheese bought shit safai bhai typo ho gaya pls dont buy pizza mania rupee meals dominos pat premium get normal pizzas dont horrible cheese blend literally feels like mayonnaise ye bik gyi hai gormint abh iss gormint mei kch na raha ye saare milke pagal banare ke baache yeah surely reported gone years ago dont fall emotional bs ones cost cutting outlet level negative feedback expose top management started getting loaded pizzas nearest outlet got several negative feedbacks used call beg positive feedbacks outlet close ranting actually complaining whatever works guess hope know dominos mcdonalds popular fast food joints dont use real cheese look appetizing okay mercy time thanks didnt know dominos bah guys good pizza mania plus taxes area dominos mcdonalds kfc subways exactly outlets chain worth good lack consistency among outlets food chain outlets busy rarely busy pathetic taste anyone suggest best pizza outlets order dont wan na use dominos due type cases one bases buy terrible username checks huh unpopular opinion pizza decent picture regularsized pizza relative size toppings therefore much bigger cover larger amount pizza ordered large size relative size topping obviously seem lot smaller comparison saying picture accurate misleading specifically palm oil inferior type oil fast food chains serve us roadside paneer paneer thing happened ordered pizza hut normally milk solids half vegetable oils use ai generate images nowadays zomato uses stock images sucks barely toppings full cheese maybe im cursed bhagwan kassam isne toh kat diya rupees chicken pizzas alright pizza deserve one need right advertising hell flat ask eat junk missed note items image scale costs wasnt delivered along dead rat severed human finger bro got catfished pizza mania since month back bhai dominos worst mumbai try square pizza best remember days used order large chicken dominator dominos used come fully filled chicken pieces compromises rs pizza rich brother idk man made pizza home like lifetime thats serves many slices one usually eat feeling full mean pizza favorite food usually eat days time pizza right day tds katta hai sir enjoy rest damn sounds like india needs better pizza options lol papa johns trash shame shame know im ordering dinner tonight dominos quality control like customer service sucks ass ive missing orders bullshit various locations oh bad confused pizza mania nonveg loaded similar experience different app tho got something wayyy different pictures using tinder pizza disgusting among cheese whattt matlab kuch aur hi kha raha tha protein ke name pw tricked way pizza far horrible presentation taste finally gave ordering pizza fake look nonsense taste joints met eh smoking joes started looks good hate chicken beef pizza tbh peporini poor ops sentimental got played pizza boys fooled giving rankings check tax paid bill always get paid first pay first even youre served guess menu guys shaadi pizza exact pizza dominos stopped time visiting seeing actually prepare hand made pizza dominoes exact tummy pain nausea effect use low quality inputs high advertising junk fake reviews keep business rolling home made pizza costs one fourth costs tastes ten times better looks good ive found dominos india shy away skimping pizzas often substandard flavour toppings cheese dough quality theyre able dont really better alternatives every single alternative pizzeria city ends making even worse pizza slathered mayo cant hard reason real better options yes dominos scam nowadays earlier atleast bread good ofcourse havent pizza outside since got married wife makes top tier pizzas way healthier still false advertising big fast food chains extremely manipulative pizzas burgers display way far actually served everyone knows time public keep check never ordered pizza hut anyways man love pizzas paying bucks atrocious small ones anywhere dont even qualify pizzas meat always old cheese isnt cheese emulsified mayo something shitty dough bread indian food regulators hardly care photos whats real rip specially zomato app ar feature true italians shit itneed proper pizza makers india popular cold storage stuff palm oil copying western lifestyle trend ended ss feel cool copying lifestyle fresh foods adopt lifestyle mean shaking head sideways praying rusernamechecksout yeah tossin nearby must try maintained quality since inception dominos sucks ive tried take friends authentic pizza places theyre used thick bread whatever use cheese lucky get good toppings awe op safe say ops humour wanted mean stop trying find meaning every emoji reel vs real life dominoes doesnt even use real cheese cheese products mixed mayonnaise like cheese tastes horrible best make pizza home live good pizzerias serve actual pizza without fake cheese mayonnaise crap expensive fun get good pizza stop trying find meaning every emoji yes parents pizzerias scamsters better make pizza home toppings less price coupon de de bhai aint japan bro bas ka farak hai redeemed already useless better order local well known area pizza chains like dominos low quality food sumtimes also u tell u live might able suggest downside shits expensive ask refund filling feedback form thats punishment god gave ordered pizza chicken dominos scam would definitely take shop ask make new one trust gave pizzas free wow made sure living username bhai pizza meh koi kami nahi hai tera lightning aur photography skills meh kami hai hell video fast foods dont eat fast food probably worse ultra processed bullshit food world whos going waste time fighting lesser pieces shit big piece shit lightning dominos use cheese pizzas buy pizza mania range cheese burst addon however get cheese substitute like mayonnaise dominos hiding stuff httpswwwdominoscoinrealmozzarellacheesehttpswwwdominoscoinrealmozzarellacheese kuch nahi hota ive ordered rice bowls good bowl past second time delivered rice bowl small quantity chicken furious almost felt like chicken called customer care explained said well try convey restaurant make sure better experience next time gave useless amount points another platform didnt even use regulations enforce restaurants clearly mentioning much quantity major ingredients getting restaurants already like local pizzerias dont follow cost cutting methods well difference ive seen local places serve foodfire thin crust pizzas less amount toppings chicken pizzas price sometimes even making pizzas home requires quite effort patience making dough need really good quality oven youll end making crust crispy biscuit base edges making pizza sauce getting ingredients cheese also factor ordering pizza take mins hour people going choose second option idk keema pizza often order chicken pepperoni pizza theres big discount theyve never ever sprinkled oregenos dominos outlets ive visited goa give generous amounts oregeno chili flake packets though chicken sausage topping ive found would preapply oregeno sprinkles agreed would devour lol yes serves id eat good day although know would downvoted ill say anyway someone works pizza shop india difference tell photos toppings added cheese professional photo reality toppings added cheese ill also add reason professional photo need show type toppings customer get actually cook meat toppings tends lose juices cooked high temperatures kept cheese said dominos notorious giving less toppings globe ill something dominos im mood double cheese pizza fuck dominos gone good worst ka fark hai bas toppings changed time make agreedi currently live nashik good local outlets going shift pune months bro pizza without cheese like mattar mattar paneer well asked fully loaded veg got corn times introverted ass would never argue processing img yiswxkd processing img yiswxkd still looks delicious rumour released statement use real dairy cheese pizzas except pizza maniacheesy mayo one cheese burst contains blend cheddar mozzarella idk true theyre fssai certified cant lie record still looks delicious damn pizza looks dead different typical pizza joints lying sausage girth smh look delicious tbh dude delivery guys didnt fuck pizza restaurant workers def considering staff shielding bad ones blame different chicken feast see none got robbed loaded lmao chicken bro helping app dating app youre indian enough stereotype welcome reality reality doesnt match producf looks better person love seeing different ways world eats pizza bro pizza got looks x better ordered many toppings good thing look delicious browned cheese pizza op got looks x better photo havent lived either places yeah im assuming punes gon na better food choices thats cheap chicken chicken chicken chicken chicken chicken chicken next time try lapinoz butter chicken pizza cheese burst american would impressively close cost fortune even stopped tasting good last couple years easily make better pizza home thats dont eat would rather make home eating even getting delivered home disappointing better option home hard grab good quality pizza sauce diced mozarella cheese oregano basil mallonline grocery store grab whole wheat pizza base bakery spread generous amount pizza sauce pizza base add generous amount cheese add generous amount toppings choice recommend capsicum onion classic give pizza smell taste budget even add black olives like also add cut sausages sprinkle oregano basil top put oven mins get times better pizza th price get good quality dough pizza sauce online issue bigbasket area think blinkit everywhere recommend good pizza places someone works dominos say u get u see pictures yeah ur pizza looks almost pizza thts call perfect pizza tho missing toppings looks good still thing think photo regular pizza ordered large toppings looks scarce comparison still shouldve added bit toppings though order regular pizzas havent faced issue thats gon na say first one seems overloaded nahi ka farak hai theyre picture hate enterprises got ta give delievery men tip companies dont bother giving enough salary full rating cover companies flawed ass big basket available live tier cities bigbasket goa far dominos pizza hut outlets chains like lapinoz local pizzerias also popping way easier buy pizza chains source quality ingredients without fucking although swiggy instamant blinkit exist options pizza dough isnt available many tier tier cities aadhar card ahh pizza dont right lighting op fell oldest marketing trick book lol pizza got looks much better im high id eat pizza within seconds id eat real pizza toh hai bhai aware think varies outlet outlet outlet city barely puts mozzarella cheese even regular pizza full mayo shit thing yesterday pinch dont complain pizza skimpmaxxing small light use karigayi hai chicken probably meant pieces chicken total suggest bangalore stay website doesnt look like dominos pizza hut agree looks delicious toppings significantly less compared photo ordered small pizza boys fooled giving rankings spankings advertisement loaded different toppings reality loaded total tiny chicken toppings yea immediate reaction thats supposed look real pizza going look like first pic first even pizza feast restaurant ordering qt selena gomez coz want make sing high notes pain local brands still looks good imo everday see even browning cheese cheese real ive heard dominos doesnt use real cheese mmmmjd mujhe mast mahaul mein jeene de ive heard dough size pizza sizes larger pizza order thinner crust true also accused using fake cheese india years ago still case wrong lyrics mateits kuch dard hain mere sene mein bdsm line pta hai bro thoda match kiya toh song dimaag aaya toh aage ka likh diya ok india moment shittiest thing put pizza ever pizzas india expensive dominos scam different wouldnt know dont evidence except tastebuds tastebuds say cheese feels real non veg loaded good along pizza mania onion margherita require patience effort isnt better alternative shit pizzas buy online ingredients fresh know going pizza get ready made dough well also dont need wooden oven everyone learn technique comes well making basic pizza sauce literally easy ingredients cheese available zepto instamart well youre getting mayo regular pizza getting scammed paid real thing youre getting pizza mania treatment report dominos well store manager click photo name shame xcom google maps reviews lose reputation get money back ive personally complained times everytime got callback dominos would always credit rs dominos account wallet bada kamzor leg piece hai iss chicken ko polio ho gaya tha kya file complaint youve pretty much repeated thing ive said simply order pizza cravings making pizza home scratch requires time preparations quality ingredients also skill like baking right temperation getting done right also need love cooking something personally dont really like ive seen friends either bake overburn home made pizzas good patience learn worth people order margherita dominos toppings scam quite time since ordered dominos next time keep eye make sure raise complaint thanks yes wow take load guy xd sue wtf really toppings look heavy slice hold late awesome recommend oven story pizza favourite oh fuck love humour lol gon na steal comment btw hehe indians ko kya hi samjhega cheese fark dominos damnn opposite experience bon appetite exactly wapas karde bhai mat kha isme yahan post karne jaisa kya tha thousand way mere ghar ke paas ek small business pizza shop hai wo log mai itna badaisse bada pizza dete hai least times much toppings burgers online even bigger scam lmfao looks like fkin good pizza standards get india spent thousand pizza still better got guess omg medium pizza rmildlyinfuriating resembles arranged marriages see vs get ordered mainly due discount packed cheese tomato puree disappointingly sparse toppings note next time go pizzza dont order haha dominos increasing prices decreasing toppings proportionally images shown representation purpose oven story best india",
    "light_cleaned_title": "Pizza I ordered vs Pizza I got",
    "light_cleaned_selftext": "oh look at those toppings 😋",
    "light_cleaned_comments": "Ordered this only because I had a 50% off coupon. It was full of cheese and tomato puree with only a handful of toppings. sedlyf Yep, that's why I only make pizza at home. Besides indont know if I'm the only one but dominos and pizza hut 100% give me a bad stomach every single time. Haven't touched dominos since 2017 50% toppings off. Sorry u/SADDEST-BOY-EVER Must be at ur Domino's cause I order this last week and it was full of toppings I mean i could bearly see the cheese I hate big pizza chains like dominos and pizza hut, quality is so poorly maintained, I'd rather suggest going for newly found chains since they'd have pressure to grow Brick oven proudly burns its pizza. So newer chains are not really consistent. But I agree Dominoes and Pizza Hut are shit. Wish Papa Jhons. was still arounf. Bas 1920 ka farak hai, I mean it is possessed Atleast you got cheese.... None of the pizza places in my locality even bother putting cheese i mean... it really looks like a nice pizza, call me crazy but i'd demolish that like some sort of animal, each peice in 2 bites job, you know? the real savage kind, where who ever is in the room with you is never quite able to fully look at you the same again Govt. cut it's portion before it got delivered. Yup. Cheese is replaced with cheap mayonnaise Literally me Be sure to trash them in the feedback link provided and share this on twitter. Btw this is typical big chain cost cutting , try to find local pizza places . They are far better atleast in tier 1 ,tier 2 cities. Do you make your own base too or buy a base? Because making a base is the most time taking task My local dominos is the same. Stopped ordering long time ago. Seeing the ***Rant*** flag, I came looking for snakes, cockroaches or Rats... but it is just a regular rant /s It’s because you’ve turned on the enhance and magnify feature 😀 Gotta appreciate your wicked humour 🙂‍↔️🤲 Food Pharmer needs to do some videos on fast food and restaurants. Let this kind of false advertising also be addressed and brought to attention on a larger scale. “Images are only for representation purposes. The original product might vary in appearance”.. Restaurants have taken this so seriously, the product delivered does not even match 10% to the image 🫤 Haha wth Username confirms Buy the base, once in a while make my own sauce also. Else I mix pizza pasta sauce with the Chinese momo chili sauce, since the pasta sauce is too sweet. True. OP should post it in twitter and we can make it viral. At least there are a few chunks of even. Ever understood the pain of people who order Pepperoni or Kheema Pizza? Chilli Flakes and Oregano sprinkles are way more prominent than meat in these Pizzas!! Customer bhagwaan samaan hota hai, woh bas Paisa deta hai aur dukandaar apne grahak ko sabak sikhata hai. Bas got to remember this. Humein C*** banne ka shouk hai aur dukandaar ko c**** banane ka shouk hai, that's the only difference mate. The Wordplay is amazing Us moment This is probably a different pizza, you should report it. It does look like a different pizza. No way it has 5 type of chicken toppings. Can see like 2 There you go. 50% off on everything. Be glad they didn't eat half of it. Jokes aside. It's a scam. I paid 900 for a pizza to get something smaller than my dinner plate. I don't know man it kinda looks the same 😕 I would love to, but that damn feedback link appears to have an impact on the staff, rather than the company taking it as a feedback to improve their services. Their delivery people have told me multiple times that giving feedback gives them promotion (literally what they said). They have even sent me messages lol. I’m just scared if they get dealt with harshly from their higher ups. Bold of you to assume that you will get exact food items as shown in figure. Who moved my toppings!! Pizzas in India are mostly a scam with horrible cheese and base. I've found that Dominos in India do not shy away from skimping. Their pizzas are often substandard in flavour, toppings, cheese and dough quality. Even the cheese burst pizza doesn't come with the same quantity of cheese and flavour that it did before Covid. With that kind of quality at the core their prices don't justify any of their products. Think they have taken the customers for granted. Time to find more authentic and better value for money pizzas! I think most people buy a base Maaf karna bhai mujhe bhook lagi thi that's why I nagged some of those hope you don't mind Jai Hind I mean...aren't the staff members the ones who prepared your pizza? Dominoz will never learn Dominos sucks Shadi karogi? Khana bhi mai bnaunga safari bhi karunga. Write a complaint on fssai and consumer forum Man I miss Indian pizzas. Mojo pizza?? Bro 7 years back i bought the meat eater for 600 and ate the whole thing myself. Best pizza I've ever had. Oh yeah ordered the same pizza, was complete trash. But man I have understood that dominos tastes like shit. God knows why people eat from there. I am most likely never ordering from there after spending my 300 rupees in the wallet haha. >safari bhi karunga. Bacche karunga sune the, ye market mein naya aaya hai kya? 😂 Yes I've noticed the difference. The quality differs by location. Like in tier 3 cities you'll get the pizza with lesser toppings while in a metro city, the same pizza will be baked and topped better. They call it liquid cheese You bought this shit for 500? Safai bhai, typo ho gaya. Pls don’t buy pizza mania and those 100 rupee meals from domino’s. Pat the premium and get normal pizzas which don’t have that horrible “cheese blend” which literally feels like Mayonnaise Ye bik gyi hai gormint!! Abh iss gormint mei kch na raha ye saare milke pagal banare ** ke baache Yeah, been there and this can be surely reported I have gone through all this years ago don't fall for their emotional bs . They are the ones doing the cost cutting at the outlet level , your negative feedback will just expose them to the top management. I started getting loaded pizzas after my nearest outlet got several negative feedbacks . And then they used to call and beg for positive feedbacks or the outlet will close . Ranting or actually complaining whatever works for you i guess . I hope You know Domino’s , McDonald’s and some other popular fast food joints don’t use real cheese Both look appetizing 💯 okay then, no mercy this time. Thanks for this. Didn't know! Dominos. Bah these guys are only good for the pizza mania Plus taxes ~50 In my area there are 4 dominos 2 McDonald's 2 kfc and 4 subways. Exactly 50% outlets for each chain are worth any good. There is a lack of consistency among outlets of same food chain. The outlets that are very busy or very rarely busy are just pathetic to taste. Can anyone suggest me best pizza outlets to order... don't wanna use dominos due to these type of cases Which one? Most bases to buy are terrible Username checks out 🥹 huh? Unpopular opinion, but the pizza is decent. The picture is that of a regular-sized pizza, the relative size of the toppings therefore are much bigger and cover a larger amount of pizza while what you have ordered is a large size. the relative size of the topping will obviously seem a lot smaller in comparison. Not saying the picture is 100% accurate but not at all misleading more specifically palm oil, the most inferior type of oil these fast food chains serve us! And roadside ‘ paneer’ is not paneer at all Same thing happened with me when I ordered from Pizza Hut Normally it's milk solids with more than half vegetable oils They use AI to generate images nowadays. Zomato uses stock images. That sucks too. Barely any toppings and full of cheese, or maybe I’m cursed 🤷‍♂️ Bhagwan kassam isne toh kat diya ! It does but for 100-110 rupees, the chicken pizzas are alright. It is the pizza you deserve but not the one you need right now. Advertising??? He’ll flat out ask you to not eat this junk!! They missed *Note:* Items in image not to scale It costs 200 now 😭 Wasn't delivered along with dead rat or severed human finger 10/10 Bro got catfished Pizza mania?? Since when? Just had it 2 month back and it was 110 Bhai domino's is the worst. If you are from Mumbai try Square Pizza. It's the best I remember the days when I used to order the Large Chicken Dominator from Dominos, and it used to come fully filled with Chicken pieces with no compromises. 1000rs pizza you are rich brother 😶 Idk man, i made pizza at home like once in my lifetime 😭 that's 4 serves? how many slices can one usually eat before feeling full? I mean, pizza is my favorite food and I usually eat for 3 days at a time so that pizza right there is 2/3 of a day for me 🤣 Tds katta hai sir enjoy the rest Damn it sounds like India needs some better pizza options lol Papa johns is trash Shame 2 shame I know what I'm ordering for dinner tonight. Domino's have no quality control at all. Like AT ALL. And their customer service sucks ass. I've had missing orders and bullshit from them at various locations from before. oh my bad, I confused pizza mania for non-veg loaded. I had a similar experience, on a different app tho. Got something that was wayyy different from the pictures. I was using Tinder. That pizza has a disgusting among of cheese on it. Whattt, matlab me kuch aur hi kha raha tha, protein ke name pw … Been tricked same way. But my pizza was far more horrible in presentation and taste. Finally gave up ordering pizza from all such fake look and nonsense taste joints. You met her eh? 🤣🍕 😛Smoking Joe's, When they had started. 😋 It looks good, I hate chicken or beef on a pIzza tbh Only peporini for me Poor OP's sentimental and got played by those pizza boys fooled him into giving 10/10 rankings. Check the tax paid in the bill. They always get paid first, as you pay first, even before you're served. Guess the menu of this guy's shaadi. Pizza, the exact same pizza as above. 🤣🍕😂 Dominos?? I stopped both same time, once after visiting and seeing how they actually prepare a hand made pizza at Dominoes. Exact same tummy pain and nausea effect. They all use low quality inputs. High advertising and junk fake reviews keep their business rolling. Home made pizza costs one fourth their costs, and tastes ten times better. Looks good > I've found that Dominos in India do not shy away from skimping. Their pizzas are often substandard in flavour, toppings, cheese and dough quality. They're able to do all this because we don't really have better alternatives. Every single alternative pizzeria in my city ends up making even worse pizza slathered with mayo. It can't be that hard, but for some reason no real better options. What is it? Yes. dominos is a scam nowadays, earlier atleast bread was good Ofcourse. I myself haven't had pizza from outside since I got married. The wife makes top tier pizzas that are way healthier. Still, the false advertising from these big fast food chains is extremely manipulative. The pizzas and burgers on their display are way far from what is actually served and everyone knows this. About time for the public to keep this in check. 100%, never ordered pizza hut anyways man, love my pizzas but paying 1000 bucks for it is atrocious, the small ones from anywhere don't even qualify as pizzas. The meat is always old, cheese isn't cheese, it's emulsified mayo or something. Shitty dough and bread. Indian food regulators hardly care. The photos and what's real is a rip off. Specially with the Zomato app AR feature. True. Italians will shit on it...need proper pizza makers in India now that its very popular here It's all cold storage stuff and palm oil. We copying the western lifestyle, that trend ended in their 1970s-1990s, we feel cool copying that lifestyle. They are on fresh foods now, we will adopt that lifestyle in 2050-60s. \"🙂‍↔️🤲\" What does it mean, shaking my head sideways & praying? r/usernamechecksout Yeah, if you have a Tossin nearby then it is a must try, they have maintained their quality since inception. Is this Dominos? It sucks.... I've tried to take my friends to authentic pizza places... But they're used to thick bread + whatever they use for cheese + lucky if you get good toppings.. Being in awe with OP (or it's safe to say OP's humour) is all I wanted to mean 🙂‍↔️ stop trying find \"meaning\" of every emoji. Reel vs real life 🤣 Dominoes doesn’t even use real cheese. Its cheese by products and some mixed mayonnaise like cheese that tastes horrible Best is to make the pizza at home. Where I live, there are some very good pizzerias that serve actual pizza without that fake cheese and mayonnaise crap. Its expensive but once in a while its fun to get good Pizza. > stop trying to find \"meaning\" of every emoji 🙂‍↔️↔️🫨⬆️ Yes. My parents and me 98% Pizzerias are scamsters .Better to make your own pizza at home— more toppings for less the price. coupon de de bhai It ain't Japan bro Bas 19-20 ka farak hai Redeemed already so it’s useless. better to order from a local but well known area, pizza chains like dominos have low quality food sumtimes, also if u tell where u live i might be able to suggest only downside is that shits expensive You can ask for a refund by filling the feedback form. That's the punishment god gave you because you ordered pizza with chicken Dominos is a scam, I would definitely take it to the shop ask them to make me a new one, trust me they gave me 2 + 1 pizzas 🍕 for free. ??? wow. They made sure you are living up to your username. /s Bhai pizza meh koi kami nahi hai, Tera lightning aur photography skills meh kami hai 🤣 He’ll do a video on fast foods - don’t eat fast food. Its probably the worse, most ultra processed bullshit food in the world. Who’s going to waste time fighting lesser pieces of shit on a big piece of shit. “lightning” Domino's does use cheese with their Pizzas, if you buy their Pizza Mania range or Cheese Burst addon however you get cheese substitute like mayonnaise. Domino's is not hiding this stuff from you. [https://www.dominos.co.in/real-mozzarella-cheese](https://www.dominos.co.in/real-mozzarella-cheese) Kuch nahi hota. I’ve ordered rice bowls from the good bowl in the past and the second time they delivered a rice bowl which had a very small quantity of chicken. I was furious because it almost felt like I had no chicken. Called up the customer care and explained it and all they said was we’ll try to convey it to the restaurant and make sure (how?!) that you have a better experience next time. And gave me some useless amount of points for another platform that I didn’t even use. There should be regulations which enforce that restaurants are clearly mentioning how much quantity of the major ingredients we are getting. Some restaurants already do that but most not. it's not like local pizzerias don't follow cost cutting methods as well. The only difference I've seen most local places serve foodfire thin crust Pizzas with more or less the same amount of toppings for chicken pizzas for the same price (or sometimes even more). Making pizzas on your own at home requires quite the effort and patience.... From making the dough itself, you need a really good quality oven or you'll end up making the crust into a crispy biscuit on the base and the edges. Making pizza sauce and getting all ingredients and cheese is also a factor. Ordering Pizza can take 20 mins to an hour and most people are going to choose the second option. idk about Keema pizza but I often order their Chicken Pepperoni Pizza when there's a big discount and they've never (ever) sprinkled oregenos in any of the Domino's outlets I've visited here in Goa. They do give generous amounts of oregeno and chili flake packets though. Chicken Sausage is the only topping I've found where they would pre-apply oregeno sprinkles. agreed! I would devour it lol Yes Serves 4? I’d eat that all by myself on a good day. Although I know I would be downvoted for this but I'll say it anyway. As someone who works in the pizza shop (not in India), the only difference I can tell from the photos as that the toppings are added after cheese in the professional photo. And in reality the toppings are added before the cheese. I'll also add reason why, in professional photo we need to show what type of toppings customer will get. And when we actually cook it, meat toppings tends to lose its juices when cooked at such high temperatures so they are kept under the cheese. That said, Dominos is notorious in giving less toppings all over the globe. I'll only have something from Dominos only if I'm in the mood for double cheese pizza😋 fuck Domino's has gone from good to worst 19-20 ka fark hai bas Toppings changed 🥲 Time to make your own Agreed...I currently live in nashik so no good local outlets here but going to shift in pune in months Bro a pizza without cheese is like no Mattar in Mattar paneer 😭🤌 Well i asked for a fully loaded veg but got corn 2 times but my introverted ass would never argue with them *Processing img yisw82x9k58d1...* *Processing img yisw82x9k58d1...* फोन कर के पूछा कि नही? पोलियो वाला मुर्गा था क्या? Still looks delicious That was a rumour, they released a statement that they use real dairy cheese in all pizzas except pizza mania(cheesy mayo in this one) and cheese burst contains a blend of cheddar and mozzarella Idk how true it is but they’re fssai certified so they can’t lie on record Still looks delicious Damn the pizza looks dead Same same but different Typical pizza joints lying about sausage girth smh They both look delicious tbh Dude delivery guys didnt fuck up your pizza, but the restaurant workers def did. Why are you considering all the staff the same and shielding the bad ones from blame? Same same but Different.. 😅🤣🤡 5 chicken feast? i see none, you got robbed. “Loaded” lmao where chicken bro is not helping with the 'any app is a dating app if you're Indian enough' stereotype Welcome to reality.. where the reality doesn’t match the producf It looks better in person I love seeing the different ways the world eats pizza. Bro, the pizza you got looks 100x better than what you ordered. Too many toppings is not a good thing. Look at all that delicious browned cheese. The pizza OP got looks 100x better than the photo. havent lived in either places but yeah im assuming punes gonna have better food choices that's cheap, where is this ? chicken chicken chicken chicken chicken chicken chicken Next time try Lapinoz butter chicken pizza with cheese burst In American that would be impressively close They cost a fortune and they have even stopped tasting good from the last couple of years. You can easily make a better pizza at home. That's why I don't eat out and would rather make it at home. Eating out or even getting it delivered to home is so disappointing. The better option is at home. Its not that hard. Grab a good quality pizza sauce, diced mozarella cheese, oregano and basil from a mall/online grocery store. Grab a whole wheat pizza base from your bakery. 1. Spread a generous amount of pizza sauce on the Pizza Base 2. Add a generous amount of cheese 3. Add a generous amount of toppings of your choice. I recommend Capsicum and Onion. They are classic and give the 'Pizza smell and taste'. If you have more budget then you can even add black olives if you like it. Or you can also add cut sausages 4. Sprinkle oregano and basil on top 5. Put it in the oven for 10-15 mins You will get a 100 times better pizza at 1/4th the price. You can get good quality dough and pizza sauce online. Not an issue. BigBasket has it in my area. I think Blinkit should have it too everywhere Can you recommend some good pizza places? As someone who works in Dominos i can say that u ll not get what u see in the pictures. But yeah ur pizza looks almost a 5* pizza (thts what we call a perfect pizza) tho its missing a few toppings Looks good, still The only thing I can think of is that the photo is of a regular Pizza while you ordered a large(?). So the toppings looks scarce in comparison They still should've added in a bit more toppings though. I only order regular pizzas so haven't faced this issue That's not the same 🙄 I was gonna say the same, the first one seems overloaded nahi 1029 ka farak hai. They’re the same picture I hate these enterprises . Gotta give the delievery men tip because these companies don't bother giving them enough salary . And now full rating to cover up these companies' flawed ass . Big Basket is only available if you live in Tier 1 cities. There is no bigbasket in Goa so far. There are over 10 Dominos and Pizza Hut outlets and other chains like Lapinoz and local pizzerias are also popping up. It's way easier to just to just buy Pizza from chains that source quality ingredients and do it yourself without fucking it all up. Although Swiggy Instamant and Blinkit does exist here the options for pizza dough isn't available in many tier 2 and tier 3 cities. Aadhar card ahh pizza You just don’t have the right lighting \\s OP fell for the oldest marketing trick in the book lol. The pizza you got looks so much better I’m so high I’d eat that pizza within seconds, then I’d eat the real pizza. Same toh hai bhai! I am aware of this but I think this varies from outlet to outlet because the outlet in my city barely puts any mozzarella cheese even on regular pizza and it's full of mayo shit Had the same thing yesterday... Same pinch Don't complain the Pizza is skimpmaxxing small light use karigayi hai 5 chicken probably meant 5 pieces of chicken in total. I can suggest in Bangalore.. Where do you stay Which website is this? Doesn't look like Domino's or Pizza Hut... Agree it looks delicious but toppings are significantly less compared to the photo Should have ordered small 😛 >pizza boys fooled him into giving 10/10 rankings. Spankings* Advertisement : loaded with 5 different toppings Reality : loaded with 5 total tiny chicken toppings Yea, my immediate reaction was 'That's how it's supposed to look?' No real pizza is going to look like the first pic. First of all … is that even a pizza ?? The feast is for the restaurant from where you are ordering. Qt are you selena gomez , coz I want to make you sing on high notes in pain 😍. Are those local brands? still looks good imo, not everday you see such even browning of the cheese Was the cheese real? I've heard dominos doesn't use real cheese. MMMMJD (Mujhe Mast Mahaul Mein Jeene De) I've heard that the dough size for all pizza sizes are the same. So the larger the pizza you order, the thinner the crust. Is that true? They were also accused of using fake cheese in India years ago, is that still the case? Wrong lyrics mate..it's kuch dard hain mere sene mein not bdsm, then this line... Pta hai bro.. thoda match kiya toh song dimaag me aaya.. toh aage ka likh diya Ok india moment Shittiest thing to put on a pizza ever Why are pizzas in India so expensive? Domino's is a scam. Same same, but different 🙃 I wouldn't know about that and don't have any evidence except for my tastebuds. and what does your tastebuds say about the cheese, feels real? Only non veg loaded is good along with pizza mania onion and Margherita It does require patience and effort but isn’t that a better alternative to shit pizzas that we buy online? Ingredients are fresh and you know what is going on your pizza. You can get ready made dough now as well. Also, you don’t need a wooden oven as not everyone has it but if you learn the technique then it comes out well ✅ Making a basic pizza sauce is literally too easy - all the ingredients and cheese is available on zepto, instamart as well. If you're getting mayo on regular pizza you are getting scammed! You paid for the real thing and you're getting a Pizza Mania treatment. You can report this to Domino's as well as the store manager, click photo and name and shame on x.com and Google Maps reviews. Not only will they lose reputation but you will get your money back 100%. I've personally complained a few times and everytime I did I got a callback from Dominos and they would always credit 300 rs in my Dominos account wallet. Bada kamzor leg piece hai… Iss chicken ko polio ho gaya tha kya? File a complaint You've pretty much repeated the same thing I've said. You can simply order a pizza if you have cravings for it while making pizza at home from scratch, not only requires time, preparations, and quality ingredients but also a skill like baking it at the right temperation and getting it done just right. You also need to love cooking something that I personally don't really like doing. I've seen my friends either under bake or overburn their home made pizzas. It's all good if you have the patience to learn but just not worth it for most people. This is why I only order Margherita from Domino's, toppings are a scam there. It has been quite some time since I have ordered from dominos but the next time I do I will keep an eye on it and make sure to raise complaint Thanks! Yes. Wow!! Take a load of this guy xD Sue them! Wtf... really? Those toppings look too heavy for the slice to hold them. Late 90s were awesome. I recommend you oven story pizza it's my favourite oh fuck, I love your humour lol. I am gonna steal this comment btw hehe “Indians ko kya hi samjhega cheese me fark” - dominos Damnn I had the opposite experience! 😲😋 bon appetite! Exactly Wapas karde bhai mat kha. Isme yahan post karne jaisa kya tha? A thousand for THAT? no way. Mere ghar ke paas ek small business pizza shop hai wo log 350 mai itna bada/isse bada pizza dete hai and at least 3 times this much toppings. Burgers online are an even bigger scam lmfao looks like a fkin good pizza (in standards of what we get in india) You spent a thousand on a pizza ? Still better than what I got i guess 🤡 omg 😭 And this was a medium pizza 🥲 😔 r/mildlyinfuriating Resembles arranged marriages what you see vs what you get🤣 Ordered this mainly due to a 60% discount. It was packed with cheese and tomato puree, but disappointingly sparse on toppings. NOTE: Next time go there and have your PIZZZA Dont Order haha Dominos has been increasing the prices and decreasing the toppings proportionally 😃 The images shown are just for representation purpose. Oven Story is the best in India"
}