{
    "id": "16j31iv",
    "title": "This is 2019 data on Corruption Index.",
    "url": "https://i.redd.it/tq5ijcrxecob1.jpg",
    "selftext": "Anyone has any latest data on this ? \nhttps://www.moneycontrol.com/news/business/economy/most-corrupt-states-in-india-maharashtra-does-not-figure-in-top-8-guess-which-takes-top-spot-4680231-8.html",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694750363.0,
    "convurl": "https://i.redd.it/tq5ijcrxecob1.jpg",
    "comments": [
        "Common kerala W",
        "No surprise Raj is at top. Recently I had seen it happening at my next door. I mean what are the odds lol.",
        "63% is low for Karnataka",
        "Corruption is rampant in Karnataka. Every government worker is a leech who wants to extract most from you. Be it a grade D peon or grade A IAS officer. \n\nRecently had to bribe mutton biryani to a policeman in North Karnataka to get my passport verified.",
        "Rajasthan has gone shit crimes are increasing at alarming rate. There are many gangs and even from villages people has started to join different gangs and snaching also increased",
        "The motivation behind getting a government job has changed drastically now.",
        "At this point is there any index that shows a majority of north Indian states are performing considerably better than the majority of south Indian states?",
        "I guess anything under a 100% is under reporting.",
        "Keralite here and i think its pretty bullshit. Especially when it comes to land deals and RTO substantial corruption does exist in kerala which affects the common man. Also the corruption at governance level is just like any other state, may be a little less because most industrialist wouldnt want to come here.",
        "Ain't no way gujarat is so low, even the high court is corrupt",
        ">mutton biryani to a policeman\n\n1/2 kg or 1 kg?",
        "i am not sure but I Payed a bribe to police station to get my passport.\n\nduring delivery of passport we need to pay some amount to the police station.",
        "> but I *Paid* a bribe\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
        "Rajasthan, UP and Bihar on the lead",
        "Vote carefully else UP will become green like Kerala. \n\n~ Fanta",
        "These numbers are way too optimistic.",
        "It's actually less compared to 2019 these days...I ain't saying that it ain't happening at all but pehle se kam hai...",
        "Never left kerala have you?",
        "1 kg",
        "Padharo mhaare desss!\n\nP.S. I am marwari and it doesn’t hurt to give thulla 200 instead 1000 if you can sweet talk your way through it.",
        "I'm actually surprised at Andhra Pradesh's rate. My dad had gone to AP for some property transfer and they people in the office were immediately asking for 20k cash if my dad wanted the transfer. It's pretty common there so 50% is actually kinda low",
        "I am from UP, about 10 years ago I gave 28rs( because at that time that's all I had) bribe to the traffic police and they took it happily after checking all my pockets for more cash.",
        "You believe stats for Kerala and not Gujarat?? Hmmm very interesting",
        "Dude wtf as a guy from jharkhand this is wayyy tooo fake here the corruption is more than what listed her atleast 85% I can guarantee.",
        "Meko bhi policeman in North Karnataka Banna hai ab!",
        "Crime index?",
        "is this data relative or compared against some absolute bench mark?\n\nE.g. If one state is at 10% and One is 40% does it simply mean latter is  4 times corrupt?",
        "I don’t know about gujarat but Haryana should absolutely not be so low\nWe literally have CM and MLAs in jail for corruption",
        "I know right. If he thinks what happens in Kerala is horrible he'll be appalled if he goes to Delhi or Bangalore. As a person who had to get documents made in both cities I spent 20 times the amount of money than I did in Kochi.",
        "Ok manohar lal khattar is in jail? Also if they are in jail isn't that a really really good thing and shows why it should be low?",
        "kerala =10% is bullshit. Its pretty much the same in every state. If you are educated and aware of the rules, tehy will be scared to demand bribe. IF not, bribe will be demanded. Depends on your contacts also. chhapri data....this source must be added to the blacklist.",
        "I was expecting my state Bihar to top the list. Lost to Rajasthan *\\*sigh\\*.* We'll get them next time.",
        "Good one.",
        "Really? Kerala is among the leaders",
        "I love uttrakhand and Andhra Pradesh are 50%. Not too much and not too less",
        "Nah I think he never left his district",
        "Came to say just this.",
        "LOL, underrated joke. This can actually be an Onion Headline.",
        "Not khatter (although he too should be there but that’s another thing)\nI was talking about Om Prakash Chautala \n\nBut no , this just shows the power of public outrage plus it was the courts that sent him to jail\n\nEven Lalu was in jail that doesn’t mean bihar has or had low corruption \n\nSimilarly many upa people used to resign that just showed how corrupt it was not that it was doing better",
        "Asking the real questions",
        "North East is one of the most corrupt regions in India. Maybe that's why it's all greyed out ;)",
        "Very surprised it's not 100%. Maybe it's so common now that people don't even feel that they did anything illegal under the table is norm. For getting a electricity connection you have to pay 8000 when the amount required is 5800, extra for fast tracking and we feel that it is a genuine charge whereas it is the responsibility of Electricity board to provide connection at earliest.",
        "I think he never left his home",
        "Ok bro I personally haven't paid any bribe for anything in haryana",
        "Should be given death sentence",
        "The police are quite corrupt and HUDA \n(now HSVP) is at peak corruption \n\nIn fact corruption coupled with the recent wrestlers+ farmers protest (with some caste considerations ) is what will defeat khatter govt  and many MPs here (of course I don’t know the future but at present this seem highly likely)",
        "\"BREAKING NEWS: After Yogi became PM, UPs corruption is completely gone!\n\n\nin an unrelated news, all journalists and analysts and intellectuals were put in prison. No biggie!\"",
        "As a Mallu, 3 months ago I would have guffawed at the the Kerala numbers but after just 2 month of living in Hyderabad(Kothapet  for Gate coaching ), I can totally see the situation. In Kerala, bribes are usually given by contractors /tender takers. Or to get done something that's really difficult to get or is shady. Even that is not that common. An average Joe wouldn't be giving anything for mundane things. Even if people recieve and give money, asking bribe is still considered \"ewww\" thing in Kerala.\n\nHere in Hyderabad, based on our teachers said, bribe is the norm. Teachers praise getting government jobs not for the associated perks but for the money you'd make for \"project worth crores\". They said you need to pay 1000s as bribes to MV officer or else they'd purposefully fail you in driver's license test even if you aced it. This is completely unheard of in Kerala. At worst, you may pay bribe to let them pass you for some little mistake. That's it. Otherwise it's uncommon. I saw someone say in Kerala sub you need to pay bribe 1000s for caste certificate in Karnataka whereas in Kerala its free and fully online process.\n\nI used to criticize Kerala on a daily basis when I was back home but 2 months in Hyderabad is making me appreciate my state more on more. It has it flaws but its so much better in so many important areas that influence the quality of your daily, social life.",
        "Remaining didn't admit",
        "it says the % of citizens who admitted to paying bribes",
        "When you arrest all journalists so Nobody can report a crime, and your state becomes crime free\n\n*Background voice* a person who thinks all the time, has nothing to think about except thoughts",
        "I couldn't believe that West Bengal has only 46%.\n\nactual number will be higher",
        "I feel stupid",
        "All credits to to the vigilance department of Kerala and their really hard work. !!\n\nI have heard many wild stories of vigilance department and their modus of operandi for capturing the corrupted government officers. Also the common people in Kerala have good knowledge about corruption policies so corruption rate is very low.",
        "I gave him 400 rupees",
        "Most people is kerala are educated though. Unlike other states. So your argument supports this source.",
        "He probably saying of Akshaya fees",
        "Having lived in Bangalore for 8 years, I highly doubt the Karnataka numbers are legit. Even for my marriage certificate the typist lady, who kept making spelling errors, was 'requesting' 100 rupees for doing her job horribly.",
        "My mom just paid of the village officer to have some resurvey done. And I know how much my friends dad pays to the RTO to get his auto retests go through smoothly. May be you guys reside in less urban spaces. But anecdotes surrounding me says corruption is higher than this picture shows.",
        "I said it reduces the chances. The MOST EDUCATED TAG is given with a sample population only. Things are not much different from other states. People are equally innocent and naive and pay bribes everywhere. NOOKUKOOLI is also a bribe.",
        "Nookukooli is a fee. Not a bribe. 😂",
        ">I used to criticize Kerala on a daily basis when I was back home but 2 months in Hyderabad is making me appreciate my state more on more.\n\nThat's what lack of outside exposure does to you. I lived in Kerala till 21 and I was never really a fan of Kerala. Moved to Bangalore and everyone be like \"Oh you're from Kerala, lovely place\" and I am like \"Prrr, what's so lovely in Kerala\".\n\nLived in Bangalore and went to few cities/states (Delhi is horrible) and travelled around and realised damn, Kerala is actually very very different from every other state (in terms of everything) and much better by a huge margin (my personal opinion). I live in a tier 3 district in Kerala and I have 100% belief that no other tier 3 district in India outside Kerala will even come close to mine in terms of quality of life and standards of living.",
        "There’s no development in Rajasthan. Cities and full districts are rotting away while other states have made 4-5 good cities with decent-good infra.\n\nNo wonder government changes every term",
        "Having lived in many states, Gujarat is way way less corrupt than Karnataka or Rajasthan.\n\nYou can get regular things done in Gujarat without bribes. Bribes are mostly needed for industrialists or contractors, but regular people can get work done.\n\nIn Karnataka officers have no shame asking for tens of thousands of rupees to get a passport approved, especially if they get a hint you have to urgently go abroad. Absolutely shameless pigs.",
        "My state is soooo corrupted that even corruption data is not available.",
        "Do u really think the people who were collecting the data waited for state governments to admit if they were corrupt?",
        "Education leads to lesser corruption, exception is: west bengal",
        "idk I didn't have to pay bribe to get passport verification by police, meanwhile some of my family elsewhere in the country had to.",
        "Its low cuz some bribes are dakshina in their faith, ergo totally moral /s",
        "classic desi experts on everything seeing the username choices.",
        "He will soon die of diabetes, call it karma",
        "Yes. I live in Palarivattom in Kochi so not really rural is it? No one is saying corruption is not there. There is corruption but not as rampant as some other states.",
        "He will soon die of diabetes, call it karma",
        "Lol Karnataka at 63%? Roflol.... been living in this state all over for 25 years and can guarantee you there's not a single government employee that is not corrupt. In fact 64% corruption is what would be in the private sector. Government sector is 100% corrupt. The KAS and IAS people posted in Karnataka to ensure accountability for corrupt officials are the most corrupt officials of all. There are huge villa societies in Bangalore where these fucktards have all made their homes. Officials in rtos and pu education board expect bribe to sign and push the paper to the guy sitting right next to them. \n\nKarnataka is like a steampunk engine and the fuel is bribes. We calculate mileage and efficiency by work done/100 rs. \n\nAnother analogy is like consulting a doctor where you pay consultation fee for every visit except that most doctors don't charge consultation if there is a secondary visit on the same day. But you go to police department's, education departments, development authority, RTO, ms building, vidhan soudha any bloody fucking body, every time you enter the building you better have spare cash in hand in terms of 100Rs notes else people won't move, won't talk to you, won't acknowledge etc., slot in Rs500 in their asshole and then the engine comes to life.",
        "In Kerala even ISRO has to bribe local labour union to let their transport vehicles pass through.",
        "The data's about paying bribes, not receiving",
        "Okay but your username!",
        "Absolutely. Karnataka is one of the most corrupt states in the country. 15+ years I have lived here every single interaction with govt officials has been irritating and bribes are openly talked about almost like they are telling you \"forget getting this done unless you pay us\"",
        "This is so wrong! Haryana is at 44%. I think its 99% easily if not more. \n100 mein se 99 baiman, phir bhi mera Bharat mahan!",
        "Delhi being 46% is the most surprising",
        "1)IK, 2019 ka hai.\n2)Socho kitne log hinge jinhe kaha Bribes pay kiye hai par Bribes pay kiye hai.",
        "In MP he asked for Mithai for my passport verification.. So I started taking the two wheeler out ki chalo barfi le ayein.. My dad understood the assignment and gave him 500/-",
        "48% in Gujarat overwhelmingly legitimizes the accuracy of the data.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n\n^/s",
        "What ? Does this really happen in West Bengal?",
        ">Also I was born in Gulf,so I compared Kerala to Gulf\n\nSame here...",
        "Even 85 sometimes feels low",
        "Yeaa Especially the state government's higher ups\nThey are fuckin scums not wanting development",
        "Access Corruption and Petty Corruption.\n\nFormer is things like \"Lobbying\" or paying to meet someone in higher power dynamic (meaning cutting the line of sorts but the the end outcome is not guaranteed but you get to have your case/situation/appeal heard personally at least and that is non-trivial).\n\nPetty corruption is paying traffic cops, driver test person, peons (in offices or hospitals, etc).\n\nFormer is not an automatic growth and development drag in all cases. It can even help in development in many places. China developed like this pre 2010s.\n\nPetty corruption is both a symptom of lack of mass development but also an active drag on development itself. That is what makes it analogus to chronic disease, it's so persistent and everpresent that it's suffocating (it degrades society and drains people's energy and will).",
        "That was not the unions it was the church there",
        "Dude I was here to comment on how 10% is low for my state, after reading all this comment's i think they're right.",
        "ssup neighbour",
        "What church??\n\nhttps://www.hindustantimes.com/india-news/isro-truck-blocked-in-kerala-trade-union-members-seek-gawking-charge-101630858177288.html",
        "That's in honor of the shahenshah-e-Hind, honorable supreme leader who has a major in entire political science and a minor in lying through his teeth.",
        "https://youtu.be/ZsastkBubvk?si=iWh1Mj25U1VmP2V2",
        "People of Rajasthan UP Bihar are most honest. Who else will admit to doing something illegal. \n\nKerala people are liars. They don’t admit to giving bribes. 😂😂😂\n\n/s",
        "This data is only of those who admitted to giving bribes. Actual number will be way higher. As per my experience, I’m pleasantly surprised when I’m not asked to pay bribes.",
        "Dude ISRO started in a church!!",
        "Sorry bro unable to understand what is being spoken there. Any press statement by govt officials in English or any news reports quoting the govt officials naming the perpetrators?",
        "Nop Kerala has more crime reporting",
        "Have you ever been RTO or tried to get birth, marriage etc certificates. It’s almost impossible to do it unless you hire an agent. That is corruption in action.",
        "Got my DL in Gujarat. The test was video recorded without any agent and got my DL easily with zero bribes (this was in Bharuch).\n\nOn the other hand my brother in Karnataka was harassed and didn't get DL despite doing a flawless test.\n\nDuring passport renewal I was asked 38k in bribe in Bengaluru despite going through an agent and wasting 3.5k. Went to Gujarat and got it done for free.\n\nMy dad was harassed out of 9 lakhs of bribe in Rajasthan this year by government officials for registering our ancestral land due to typos in old records(because they knew that land is worth more than a crore). In Gujarat this would require zero to minimal bribe.",
        "there are tier list's for districts!!?",
        "where Himachal",
        "How is this estimated? Just wanna know",
        "Teekha khane se bawaseer hota hai bhai",
        "UP model 💪",
        "Yes according to public data\nKerala has the highest crime rate after delhi\n\nWhile Bihar Jharkhand and West Bengal have the lowest(among states with 50L+ people)\n\nKey word being reported",
        "Karnataka isn't 63% A simple look at the taxes will explain it lol",
        "Yes. Should be red all over",
        "What's going on in Rajasthan?",
        "lool funny",
        "West Bengal is always the best state in this metric. Hindi media run by BJP has spread fake news and made image of WB worse around the country. One reason I hate BJP. I am seeing this same thing for last 10 years and I am disgusted by BJP and Hindi media.",
        "W dad.\n\nBut this sounds so funny lmfao",
        "Why the hell in every index kerala ranks so well it's like an ideal country in itself. I always thought they rank just good in education bt seeing they literally better in everything per capita, less corruption, human index, mortality rate every fking thing",
        "Tier 3 cities in Kerala are amazing. The problem is that Kerala doesn't have any tier 1 & 2 cities that generate well paying jobs.",
        "TN is getting there, pretty much have fcked my mental health",
        "Totally false map. Adaniji himself would have made Gujarat no 1",
        "I haven’t lived in or even visited India in almost a decade but I’m still paying government officials in India bribes to expedite the release of some documents!",
        "Because with education comes the rest. Kerala has its own issues, but there are some things we excel at and feels good to be appreciated. HDI, per capita income, low number of homeless etc are also because we have a high number of people who work outside Kerala and remit money to Kerala. Less corruption is probably because people are more aware of their rights (compared to some other states). Education made both of these possible. Also refraining from selecting same party over and over again has helped as well. It would be so nice, if we Indians collectively develop but some news are just disheartening thinking it is a lost cause.",
        "I can vouch for Kerala. I have never paid a single bribe here. Even when i thought i was bribing once due to my pollution certificate expired, police gave me a receipt. In Karnataka, 3 years and I have paid at-least 5 times iirc.",
        "Spoken very wisely I also feel education is the most powerful tool and education can change a countries situation 360 in all aspects be it societal, economical, transparent etc. Also the hindu muslim Christian population is very high yet we hardly see any religious riots from Kerala. I go back and forth to US and india been to kerala feels amazing also a big fan of Malayali film industry.",
        "Recently did Police verification for my parents in Kerala. The policeman refused to accept anything.",
        "I think this is a new level of corruption ! 🤣\n\nhttps://preview.redd.it/h8ugcurwfnob1.jpeg?width=1080&format=pjpg&auto=webp&s=e7f6e5bf01868544d807b3ce6df1be20a1fa016b"
    ],
    "cleaned_text": "data corruption index anyone latest data ",
    "cleaned_title": "data corruption index",
    "cleaned_selftext": "anyone latest data",
    "cleaned_comments": "common kerala w surprise raj top recently seen happening next door mean odds lol low karnataka corruption rampant karnataka every government worker leech wants extract grade peon grade ias officer recently bribe mutton biryani policeman north karnataka get passport verified rajasthan gone shit crimes increasing alarming rate many gangs even villages people started join different gangs snaching also increased motivation behind getting government job changed drastically point index shows majority north indian states performing considerably better majority south indian states guess anything reporting keralite think pretty bullshit especially comes land deals rto substantial corruption exist kerala affects common man also corruption governance level like state may little less industrialist wouldnt want come aint way gujarat low even high court corrupt mutton biryani policeman kg kg sure payed bribe police station get passport delivery passport need pay amount police station paid bribe ftfy although payed exists reason autocorrection didnt help correct nautical context means paint surface cover something like tar resin order make waterproof corrosionresistant deck yet payed payed letting strings cables ropes slacking rope payed pull unfortunately unable find nautical roperelated words comment beep boop im bot rajasthan bihar lead vote carefully else become green like kerala fanta numbers way optimistic actually less compared daysi aint saying aint happening pehle se kam hai never left kerala kg padharo mhaare desss ps marwari doesnt hurt give thulla instead sweet talk way im actually surprised andhra pradeshs rate dad gone ap property transfer people office immediately asking k cash dad wanted transfer pretty common actually kinda low years ago gave rs time thats bribe traffic police took happily checking pockets cash believe stats kerala gujarat hmmm interesting dude wtf guy jharkhand wayyy tooo fake corruption listed atleast guarantee meko bhi policeman north karnataka banna hai ab crime index data relative compared absolute bench mark eg one state one simply mean latter times corrupt dont know gujarat haryana absolutely low literally cm mlas jail corruption know right thinks happens kerala horrible hell appalled goes delhi bangalore person get documents made cities spent times amount money kochi ok manohar lal khattar jail also jail isnt really really good thing shows low kerala bullshit pretty much every state educated aware rules tehy scared demand bribe bribe demanded depends contacts also chhapri datathis source must added blacklist expecting state bihar top list lost rajasthan sigh well get next time good one really kerala among leaders love uttrakhand andhra pradesh much less nah think never left district came say lol underrated joke actually onion headline khatter although thats another thing talking om prakash chautala shows power public outrage plus courts sent jail even lalu jail doesnt mean bihar low corruption similarly many upa people used resign showed corrupt better asking real questions north east one corrupt regions india maybe thats greyed surprised maybe common people dont even feel anything illegal table norm getting electricity connection pay amount required extra fast tracking feel genuine charge whereas responsibility electricity board provide connection earliest think never left home ok bro personally havent paid bribe anything haryana given death sentence police quite corrupt huda hsvp peak corruption fact corruption coupled recent wrestlers farmers protest caste considerations defeat khatter govt many mps course dont know future present seem highly likely breaking news yogi became pm ups corruption completely gone unrelated news journalists analysts intellectuals put prison biggie mallu months ago would guffawed kerala numbers month living hyderabadkothapet gate coaching totally see situation kerala bribes usually given contractors tender takers get done something thats really difficult get shady even common average joe wouldnt giving anything mundane things even people recieve give money asking bribe still considered ewww thing kerala hyderabad based teachers said bribe norm teachers praise getting government jobs associated perks money youd make project worth crores said need pay bribes mv officer else theyd purposefully fail drivers license test even aced completely unheard kerala worst may pay bribe let pass little mistake thats otherwise uncommon saw someone say kerala sub need pay bribe caste certificate karnataka whereas kerala free fully online process used criticize kerala daily basis back home months hyderabad making appreciate state flaws much better many important areas influence quality daily social life remaining didnt admit says citizens admitted paying bribes arrest journalists nobody report crime state becomes crime free background voice person thinks time nothing think except thoughts couldnt believe west bengal actual number higher feel stupid credits vigilance department kerala really hard work heard many wild stories vigilance department modus operandi capturing corrupted government officers also common people kerala good knowledge corruption policies corruption rate low gave rupees people kerala educated though unlike states argument supports source probably saying akshaya fees lived bangalore years highly doubt karnataka numbers legit even marriage certificate typist lady kept making spelling errors requesting rupees job horribly mom paid village officer resurvey done know much friends dad pays rto get auto retests go smoothly may guys reside less urban spaces anecdotes surrounding says corruption higher picture shows said reduces chances educated tag given sample population things much different states people equally innocent naive pay bribes everywhere nookukooli also bribe nookukooli fee bribe used criticize kerala daily basis back home months hyderabad making appreciate state thats lack outside exposure lived kerala till never really fan kerala moved bangalore everyone like oh youre kerala lovely place like prrr whats lovely kerala lived bangalore went citiesstates delhi horrible travelled around realised damn kerala actually different every state terms everything much better huge margin personal opinion live tier district kerala belief tier district india outside kerala even come close mine terms quality life standards living theres development rajasthan cities full districts rotting away states made good cities decentgood infra wonder government changes every term lived many states gujarat way way less corrupt karnataka rajasthan get regular things done gujarat without bribes bribes mostly needed industrialists contractors regular people get work done karnataka officers shame asking tens thousands rupees get passport approved especially get hint urgently go abroad absolutely shameless pigs state soooo corrupted even corruption data available u really think people collecting data waited state governments admit corrupt education leads lesser corruption exception west bengal idk didnt pay bribe get passport verification police meanwhile family elsewhere country low cuz bribes dakshina faith ergo totally moral classic desi experts everything seeing username choices soon die diabetes call karma yes live palarivattom kochi really rural one saying corruption corruption rampant states soon die diabetes call karma lol karnataka roflol living state years guarantee theres single government employee corrupt fact corruption would private sector government sector corrupt kas ias people posted karnataka ensure accountability corrupt officials corrupt officials huge villa societies bangalore fucktards made homes officials rtos pu education board expect bribe sign push paper guy sitting right next karnataka like steampunk engine fuel bribes calculate mileage efficiency work done rs another analogy like consulting doctor pay consultation fee every visit except doctors dont charge consultation secondary visit day go police departments education departments development authority rto ms building vidhan soudha bloody fucking body every time enter building better spare cash hand terms rs notes else people wont move wont talk wont acknowledge etc slot rs asshole engine comes life kerala even isro bribe local labour union let transport vehicles pass datas paying bribes receiving okay username absolutely karnataka one corrupt states country years lived every single interaction govt officials irritating bribes openly talked almost like telling forget getting done unless pay us wrong haryana think easily mein se baiman phir bhi mera bharat mahan delhi surprising ik ka hai socho kitne log hinge jinhe kaha bribes pay kiye hai par bribes pay kiye hai mp asked mithai passport verification started taking two wheeler ki chalo barfi le ayein dad understood assignment gave gujarat overwhelmingly legitimizes accuracy data really happen west bengal also born gulfso compared kerala gulf even sometimes feels low yeaa especially state governments higher ups fuckin scums wanting development access corruption petty corruption former things like lobbying paying meet someone higher power dynamic meaning cutting line sorts end outcome guaranteed get casesituationappeal heard personally least nontrivial petty corruption paying traffic cops driver test person peons offices hospitals etc former automatic growth development drag cases even help development many places china developed like pre petty corruption symptom lack mass development also active drag development makes analogus chronic disease persistent everpresent suffocating degrades society drains peoples energy unions church dude comment low state reading comments think theyre right ssup neighbour church thats honor shahenshahehind honorable supreme leader major entire political science minor lying teeth people rajasthan bihar honest else admit something illegal kerala people liars dont admit giving bribes data admitted giving bribes actual number way higher per experience im pleasantly surprised im asked pay bribes dude isro started church sorry bro unable understand spoken press statement govt officials english news reports quoting govt officials naming perpetrators nop kerala crime reporting ever rto tried get birth marriage etc certificates almost impossible unless hire agent corruption action got dl gujarat test video recorded without agent got dl easily zero bribes bharuch hand brother karnataka harassed didnt get dl despite flawless test passport renewal asked k bribe bengaluru despite going agent wasting k went gujarat got done free dad harassed lakhs bribe rajasthan year government officials registering ancestral land due typos old recordsbecause knew land worth crore gujarat would require zero minimal bribe tier lists districts himachal estimated wan na know teekha khane se bawaseer hota hai bhai model yes according public data kerala highest crime rate delhi bihar jharkhand west bengal lowestamong states l people key word reported karnataka isnt simple look taxes explain lol yes red whats going rajasthan lool funny west bengal always best state metric hindi media run bjp spread fake news made image wb worse around country one reason hate bjp seeing thing last years disgusted bjp hindi media w dad sounds funny lmfao hell every index kerala ranks well like ideal country always thought rank good education bt seeing literally better everything per capita less corruption human index mortality rate every fking thing tier cities kerala amazing problem kerala doesnt tier cities generate well paying jobs tn getting pretty much fcked mental health totally false map adaniji would made gujarat havent lived even visited india almost decade im still paying government officials india bribes expedite release documents education comes rest kerala issues things excel feels good appreciated hdi per capita income low number homeless etc also high number people work outside kerala remit money kerala less corruption probably people aware rights compared states education made possible also refraining selecting party helped well would nice indians collectively develop news disheartening thinking lost cause vouch kerala never paid single bribe even thought bribing due pollution certificate expired police gave receipt karnataka years paid atleast times iirc spoken wisely also feel education powerful tool education change countries situation aspects societal economical transparent etc also hindu muslim christian population high yet hardly see religious riots kerala go back forth us india kerala feels amazing also big fan malayali film industry recently police verification parents kerala policeman refused accept anything think new level corruption",
    "light_cleaned_title": "This is 2019 data on Corruption Index.",
    "light_cleaned_selftext": "Anyone has any latest data on this ?",
    "light_cleaned_comments": "Common kerala W No surprise Raj is at top. Recently I had seen it happening at my next door. I mean what are the odds lol. 63% is low for Karnataka Corruption is rampant in Karnataka. Every government worker is a leech who wants to extract most from you. Be it a grade D peon or grade A IAS officer. Recently had to bribe mutton biryani to a policeman in North Karnataka to get my passport verified. Rajasthan has gone shit crimes are increasing at alarming rate. There are many gangs and even from villages people has started to join different gangs and snaching also increased The motivation behind getting a government job has changed drastically now. At this point is there any index that shows a majority of north Indian states are performing considerably better than the majority of south Indian states? I guess anything under a 100% is under reporting. Keralite here and i think its pretty bullshit. Especially when it comes to land deals and RTO substantial corruption does exist in kerala which affects the common man. Also the corruption at governance level is just like any other state, may be a little less because most industrialist wouldnt want to come here. Ain't no way gujarat is so low, even the high court is corrupt >mutton biryani to a policeman 1/2 kg or 1 kg? i am not sure but I Payed a bribe to police station to get my passport. during delivery of passport we need to pay some amount to the police station. > but I *Paid* a bribe FTFY. Although *payed* exists (the reason why autocorrection didn't help you), it is only correct in: * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.* * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.* Unfortunately, I was unable to find nautical or rope-related words in your comment. *Beep, boop, I'm a bot* Rajasthan, UP and Bihar on the lead Vote carefully else UP will become green like Kerala. ~ Fanta These numbers are way too optimistic. It's actually less compared to 2019 these days...I ain't saying that it ain't happening at all but pehle se kam hai... Never left kerala have you? 1 kg Padharo mhaare desss! P.S. I am marwari and it doesn’t hurt to give thulla 200 instead 1000 if you can sweet talk your way through it. I'm actually surprised at Andhra Pradesh's rate. My dad had gone to AP for some property transfer and they people in the office were immediately asking for 20k cash if my dad wanted the transfer. It's pretty common there so 50% is actually kinda low I am from UP, about 10 years ago I gave 28rs( because at that time that's all I had) bribe to the traffic police and they took it happily after checking all my pockets for more cash. You believe stats for Kerala and not Gujarat?? Hmmm very interesting Dude wtf as a guy from jharkhand this is wayyy tooo fake here the corruption is more than what listed her atleast 85% I can guarantee. Meko bhi policeman in North Karnataka Banna hai ab! Crime index? is this data relative or compared against some absolute bench mark? E.g. If one state is at 10% and One is 40% does it simply mean latter is 4 times corrupt? I don’t know about gujarat but Haryana should absolutely not be so low We literally have CM and MLAs in jail for corruption I know right. If he thinks what happens in Kerala is horrible he'll be appalled if he goes to Delhi or Bangalore. As a person who had to get documents made in both cities I spent 20 times the amount of money than I did in Kochi. Ok manohar lal khattar is in jail? Also if they are in jail isn't that a really really good thing and shows why it should be low? kerala =10% is bullshit. Its pretty much the same in every state. If you are educated and aware of the rules, tehy will be scared to demand bribe. IF not, bribe will be demanded. Depends on your contacts also. chhapri data....this source must be added to the blacklist. I was expecting my state Bihar to top the list. Lost to Rajasthan *\\*sigh\\*.* We'll get them next time. Good one. Really? Kerala is among the leaders I love uttrakhand and Andhra Pradesh are 50%. Not too much and not too less Nah I think he never left his district Came to say just this. LOL, underrated joke. This can actually be an Onion Headline. Not khatter (although he too should be there but that’s another thing) I was talking about Om Prakash Chautala But no , this just shows the power of public outrage plus it was the courts that sent him to jail Even Lalu was in jail that doesn’t mean bihar has or had low corruption Similarly many upa people used to resign that just showed how corrupt it was not that it was doing better Asking the real questions North East is one of the most corrupt regions in India. Maybe that's why it's all greyed out ;) Very surprised it's not 100%. Maybe it's so common now that people don't even feel that they did anything illegal under the table is norm. For getting a electricity connection you have to pay 8000 when the amount required is 5800, extra for fast tracking and we feel that it is a genuine charge whereas it is the responsibility of Electricity board to provide connection at earliest. I think he never left his home Ok bro I personally haven't paid any bribe for anything in haryana Should be given death sentence The police are quite corrupt and HUDA (now HSVP) is at peak corruption In fact corruption coupled with the recent wrestlers+ farmers protest (with some caste considerations ) is what will defeat khatter govt and many MPs here (of course I don’t know the future but at present this seem highly likely) \"BREAKING NEWS: After Yogi became PM, UPs corruption is completely gone! in an unrelated news, all journalists and analysts and intellectuals were put in prison. No biggie!\" As a Mallu, 3 months ago I would have guffawed at the the Kerala numbers but after just 2 month of living in Hyderabad(Kothapet for Gate coaching ), I can totally see the situation. In Kerala, bribes are usually given by contractors /tender takers. Or to get done something that's really difficult to get or is shady. Even that is not that common. An average Joe wouldn't be giving anything for mundane things. Even if people recieve and give money, asking bribe is still considered \"ewww\" thing in Kerala. Here in Hyderabad, based on our teachers said, bribe is the norm. Teachers praise getting government jobs not for the associated perks but for the money you'd make for \"project worth crores\". They said you need to pay 1000s as bribes to MV officer or else they'd purposefully fail you in driver's license test even if you aced it. This is completely unheard of in Kerala. At worst, you may pay bribe to let them pass you for some little mistake. That's it. Otherwise it's uncommon. I saw someone say in Kerala sub you need to pay bribe 1000s for caste certificate in Karnataka whereas in Kerala its free and fully online process. I used to criticize Kerala on a daily basis when I was back home but 2 months in Hyderabad is making me appreciate my state more on more. It has it flaws but its so much better in so many important areas that influence the quality of your daily, social life. Remaining didn't admit it says the % of citizens who admitted to paying bribes When you arrest all journalists so Nobody can report a crime, and your state becomes crime free *Background voice* a person who thinks all the time, has nothing to think about except thoughts I couldn't believe that West Bengal has only 46%. actual number will be higher I feel stupid All credits to to the vigilance department of Kerala and their really hard work. !! I have heard many wild stories of vigilance department and their modus of operandi for capturing the corrupted government officers. Also the common people in Kerala have good knowledge about corruption policies so corruption rate is very low. I gave him 400 rupees Most people is kerala are educated though. Unlike other states. So your argument supports this source. He probably saying of Akshaya fees Having lived in Bangalore for 8 years, I highly doubt the Karnataka numbers are legit. Even for my marriage certificate the typist lady, who kept making spelling errors, was 'requesting' 100 rupees for doing her job horribly. My mom just paid of the village officer to have some resurvey done. And I know how much my friends dad pays to the RTO to get his auto retests go through smoothly. May be you guys reside in less urban spaces. But anecdotes surrounding me says corruption is higher than this picture shows. I said it reduces the chances. The MOST EDUCATED TAG is given with a sample population only. Things are not much different from other states. People are equally innocent and naive and pay bribes everywhere. NOOKUKOOLI is also a bribe. Nookukooli is a fee. Not a bribe. 😂 >I used to criticize Kerala on a daily basis when I was back home but 2 months in Hyderabad is making me appreciate my state more on more. That's what lack of outside exposure does to you. I lived in Kerala till 21 and I was never really a fan of Kerala. Moved to Bangalore and everyone be like \"Oh you're from Kerala, lovely place\" and I am like \"Prrr, what's so lovely in Kerala\". Lived in Bangalore and went to few cities/states (Delhi is horrible) and travelled around and realised damn, Kerala is actually very very different from every other state (in terms of everything) and much better by a huge margin (my personal opinion). I live in a tier 3 district in Kerala and I have 100% belief that no other tier 3 district in India outside Kerala will even come close to mine in terms of quality of life and standards of living. There’s no development in Rajasthan. Cities and full districts are rotting away while other states have made 4-5 good cities with decent-good infra. No wonder government changes every term Having lived in many states, Gujarat is way way less corrupt than Karnataka or Rajasthan. You can get regular things done in Gujarat without bribes. Bribes are mostly needed for industrialists or contractors, but regular people can get work done. In Karnataka officers have no shame asking for tens of thousands of rupees to get a passport approved, especially if they get a hint you have to urgently go abroad. Absolutely shameless pigs. My state is soooo corrupted that even corruption data is not available. Do u really think the people who were collecting the data waited for state governments to admit if they were corrupt? Education leads to lesser corruption, exception is: west bengal idk I didn't have to pay bribe to get passport verification by police, meanwhile some of my family elsewhere in the country had to. Its low cuz some bribes are dakshina in their faith, ergo totally moral /s classic desi experts on everything seeing the username choices. He will soon die of diabetes, call it karma Yes. I live in Palarivattom in Kochi so not really rural is it? No one is saying corruption is not there. There is corruption but not as rampant as some other states. He will soon die of diabetes, call it karma Lol Karnataka at 63%? Roflol.... been living in this state all over for 25 years and can guarantee you there's not a single government employee that is not corrupt. In fact 64% corruption is what would be in the private sector. Government sector is 100% corrupt. The KAS and IAS people posted in Karnataka to ensure accountability for corrupt officials are the most corrupt officials of all. There are huge villa societies in Bangalore where these fucktards have all made their homes. Officials in rtos and pu education board expect bribe to sign and push the paper to the guy sitting right next to them. Karnataka is like a steampunk engine and the fuel is bribes. We calculate mileage and efficiency by work done/100 rs. Another analogy is like consulting a doctor where you pay consultation fee for every visit except that most doctors don't charge consultation if there is a secondary visit on the same day. But you go to police department's, education departments, development authority, RTO, ms building, vidhan soudha any bloody fucking body, every time you enter the building you better have spare cash in hand in terms of 100Rs notes else people won't move, won't talk to you, won't acknowledge etc., slot in Rs500 in their asshole and then the engine comes to life. In Kerala even ISRO has to bribe local labour union to let their transport vehicles pass through. The data's about paying bribes, not receiving Okay but your username! Absolutely. Karnataka is one of the most corrupt states in the country. 15+ years I have lived here every single interaction with govt officials has been irritating and bribes are openly talked about almost like they are telling you \"forget getting this done unless you pay us\" This is so wrong! Haryana is at 44%. I think its 99% easily if not more. 100 mein se 99 baiman, phir bhi mera Bharat mahan! Delhi being 46% is the most surprising 1)IK, 2019 ka hai. 2)Socho kitne log hinge jinhe kaha Bribes pay kiye hai par Bribes pay kiye hai. In MP he asked for Mithai for my passport verification.. So I started taking the two wheeler out ki chalo barfi le ayein.. My dad understood the assignment and gave him 500/- 48% in Gujarat overwhelmingly legitimizes the accuracy of the data. . . . . . ^/s What ? Does this really happen in West Bengal? >Also I was born in Gulf,so I compared Kerala to Gulf Same here... Even 85 sometimes feels low Yeaa Especially the state government's higher ups They are fuckin scums not wanting development Access Corruption and Petty Corruption. Former is things like \"Lobbying\" or paying to meet someone in higher power dynamic (meaning cutting the line of sorts but the the end outcome is not guaranteed but you get to have your case/situation/appeal heard personally at least and that is non-trivial). Petty corruption is paying traffic cops, driver test person, peons (in offices or hospitals, etc). Former is not an automatic growth and development drag in all cases. It can even help in development in many places. China developed like this pre 2010s. Petty corruption is both a symptom of lack of mass development but also an active drag on development itself. That is what makes it analogus to chronic disease, it's so persistent and everpresent that it's suffocating (it degrades society and drains people's energy and will). That was not the unions it was the church there Dude I was here to comment on how 10% is low for my state, after reading all this comment's i think they're right. ssup neighbour What church?? That's in honor of the shahenshah-e-Hind, honorable supreme leader who has a major in entire political science and a minor in lying through his teeth. People of Rajasthan UP Bihar are most honest. Who else will admit to doing something illegal. Kerala people are liars. They don’t admit to giving bribes. 😂😂😂 /s This data is only of those who admitted to giving bribes. Actual number will be way higher. As per my experience, I’m pleasantly surprised when I’m not asked to pay bribes. Dude ISRO started in a church!! Sorry bro unable to understand what is being spoken there. Any press statement by govt officials in English or any news reports quoting the govt officials naming the perpetrators? Nop Kerala has more crime reporting Have you ever been RTO or tried to get birth, marriage etc certificates. It’s almost impossible to do it unless you hire an agent. That is corruption in action. Got my DL in Gujarat. The test was video recorded without any agent and got my DL easily with zero bribes (this was in Bharuch). On the other hand my brother in Karnataka was harassed and didn't get DL despite doing a flawless test. During passport renewal I was asked 38k in bribe in Bengaluru despite going through an agent and wasting 3.5k. Went to Gujarat and got it done for free. My dad was harassed out of 9 lakhs of bribe in Rajasthan this year by government officials for registering our ancestral land due to typos in old records(because they knew that land is worth more than a crore). In Gujarat this would require zero to minimal bribe. there are tier list's for districts!!? where Himachal How is this estimated? Just wanna know Teekha khane se bawaseer hota hai bhai UP model 💪 Yes according to public data Kerala has the highest crime rate after delhi While Bihar Jharkhand and West Bengal have the lowest(among states with 50L+ people) Key word being reported Karnataka isn't 63% A simple look at the taxes will explain it lol Yes. Should be red all over What's going on in Rajasthan? lool funny West Bengal is always the best state in this metric. Hindi media run by BJP has spread fake news and made image of WB worse around the country. One reason I hate BJP. I am seeing this same thing for last 10 years and I am disgusted by BJP and Hindi media. W dad. But this sounds so funny lmfao Why the hell in every index kerala ranks so well it's like an ideal country in itself. I always thought they rank just good in education bt seeing they literally better in everything per capita, less corruption, human index, mortality rate every fking thing Tier 3 cities in Kerala are amazing. The problem is that Kerala doesn't have any tier 1 & 2 cities that generate well paying jobs. TN is getting there, pretty much have fcked my mental health Totally false map. Adaniji himself would have made Gujarat no 1 I haven’t lived in or even visited India in almost a decade but I’m still paying government officials in India bribes to expedite the release of some documents! Because with education comes the rest. Kerala has its own issues, but there are some things we excel at and feels good to be appreciated. HDI, per capita income, low number of homeless etc are also because we have a high number of people who work outside Kerala and remit money to Kerala. Less corruption is probably because people are more aware of their rights (compared to some other states). Education made both of these possible. Also refraining from selecting same party over and over again has helped as well. It would be so nice, if we Indians collectively develop but some news are just disheartening thinking it is a lost cause. I can vouch for Kerala. I have never paid a single bribe here. Even when i thought i was bribing once due to my pollution certificate expired, police gave me a receipt. In Karnataka, 3 years and I have paid at-least 5 times iirc. Spoken very wisely I also feel education is the most powerful tool and education can change a countries situation 360 in all aspects be it societal, economical, transparent etc. Also the hindu muslim Christian population is very high yet we hardly see any religious riots from Kerala. I go back and forth to US and india been to kerala feels amazing also a big fan of Malayali film industry. Recently did Police verification for my parents in Kerala. The policeman refused to accept anything. I think this is a new level of corruption ! 🤣"
}