{
    "id": "19ae3qq",
    "title": "MYNTRA users beware!",
    "url": "https://www.reddit.com/gallery/19ae3qq",
    "selftext": "Ordered these pair of jeans from Myntra and received it today. While trying them on I noticed the tag mentions the price as Rs 1499/- I thought I must have misread the price on the app as 1199 instead of 1999/- but no I was right. Immediately called the customer care, they said I will have to return the product n they will refund the entire amount which is a shame since I really liked the product fit and would be happy if they could've refunded the extra amount. \n\nSo please check your tags when shopping!",
    "flair": "Rant / Vent",
    "score": 10,
    "num_comments": 3,
    "created_utc": 1705651599.0,
    "convurl": "https://i.redd.it/ss25bj1wtcdc1.jpg",
    "comments": [
        "Thanks! Will check tags next time!",
        "https://timesofindia.indiatimes.com/city/chandigarh/myntra-asked-to-pay-rs10k-to-pkl-resident/articleshow/57722445.cms",
        "They attached the wrong tag to the wrong product. The tag says \"trousers\" whereas it's clearly a pair of jeans. Mistakes happen. They didn't over charge you. The tag is wrong."
    ],
    "cleaned_text": "myntra users beware ordered pair jeans myntra received today trying noticed tag mentions price rs thought must misread price app instead right immediately called customer care said return product n refund entire amount shame since really liked product fit would happy couldve refunded extra amount please check tags shopping ",
    "cleaned_title": "myntra users beware",
    "cleaned_selftext": "ordered pair jeans myntra received today trying noticed tag mentions price rs thought must misread price app instead right immediately called customer care said return product n refund entire amount shame since really liked product fit would happy couldve refunded extra amount please check tags shopping",
    "cleaned_comments": "thanks check tags next time attached wrong tag wrong product tag says trousers whereas clearly pair jeans mistakes happen didnt charge tag wrong",
    "light_cleaned_title": "MYNTRA users beware!",
    "light_cleaned_selftext": "Ordered these pair of jeans from Myntra and received it today. While trying them on I noticed the tag mentions the price as Rs 1499/- I thought I must have misread the price on the app as 1199 instead of 1999/- but no I was right. Immediately called the customer care, they said I will have to return the product n they will refund the entire amount which is a shame since I really liked the product fit and would be happy if they could've refunded the extra amount. So please check your tags when shopping!",
    "light_cleaned_comments": "Thanks! Will check tags next time! They attached the wrong tag to the wrong product. The tag says \"trousers\" whereas it's clearly a pair of jeans. Mistakes happen. They didn't over charge you. The tag is wrong."
}