{
    "id": "1cx9oul",
    "title": "\"How Can Juvenile Board Give Such Order?\" D Fadnavis On Pune Porsche Crash",
    "url": "https://www.ndtv.com/india-news/15-day-punishment-for-teen-shocking-devendra-fadnavis-on-pune-porsche-crash-5713424/amp/1?utm_source=www.ndtv.com&utm_medium=amp-page&utm_campaign=trendingstories",
    "selftext": "Maharashtra deputy CM has promised strict action, do you all think justice will be served?",
    "flair": "Law & Courts",
    "score": 518,
    "num_comments": 53,
    "created_utc": 1716302915.0,
    "convurl": "https://external-preview.redd.it/ZKxY6hGJhTIjbTSe_qPwGn0gAeRQ5gZuZlua_99A9og.jpg",
    "comments": [
        "Hope it will but read somewhere  that the Juvenile  was bailed after pressure  was exerted by NCP MLA Sunil Tingre (Ajit Pawar aide )..",
        "Mostly likely he is on take from another builder , so is  not bothered with this one's fate.",
        "Damn the criminal is talking now guys.",
        "The news is being covered by media... I don't Think that the media had a change of heart and decide to act Robinhood....\nThere is something political going on....not that I in anyway discounting what has happened to the couple ...May there soul rest in peace.",
        "Please explain...I didn't understand",
        "Thankfully, we have political interference it case where it is actually needed.",
        "Not couple friends colleagues",
        "Not couple friends colleagues office IT",
        "Wait for next thing to happen. Everyone will forget this news. The next thing will happen in a week or two. If not then election results will come. \nThe case will keep on going. \nThat pos will move out of India and live his life there for good number of years and will come back when everyone forgets this incident. \n\nThe only people who will actually suffer are those who lost their life and those who loved them.",
        "Electoral bonds reaching everyone soon",
        "Justice will be served temporarily untill news dies down.",
        "Idk man, Punekars are pretty enraged about it, even the common people.\n\nThey're going to hold a protest at FC Road, this Sunday.",
        "#Adani ji, builder of all builders!",
        "Apparently he ordered a pizza at the police station to bring down his alcohol level and they conducted his blood analysis 10 hours after the incident",
        "Somehow no one is blaming the parents. While they are not only not taking the responsibility but also playing games to get that murder out of jail …",
        "The father who was hiding has been arrested.",
        "Everyone's gonna forget. Whatever happened to Tathya Patel who killed 9 people. Everything is bikau here.",
        "I really hope some rival builders make use of this situation and help the media completely screw up this father-son duo",
        "Totally understand frustration. Seriously what a shame!!! They treat us like insects, maro kuchlo aage bado. Justice should be given, an example has to be set. When I was reading the details of this accident, I actually laughed out loud at the ridiculous judgement. This so-called minor should be treated as any other adult and given the harshest punishment. Life of a common Indian person has become a joke to these filthy rich, privileged brats.",
        "Fadanvis had also promised justice to Sushant Singh Rajput during Bihar elections.",
        "Wait until D Fadnavis receives his fat paycheck.",
        "My bad...",
        "Yes...I don't think that a rich man in India can be jailed...there is too much corruption for that..",
        "He is saying that BJP doesn't get any bribes from the father of the culprit.",
        "And he will be treated like a king in prison. The kid got pizza and the father will get butter chicken with naan. Seriously sometimes I think aprichit and nayak are needed.",
        "It’s good. Now he cannot argue that alcohol clouded his judgement.",
        "Yeah exactly. That’s why Devendra Fadnavis is trying to be a saint here. He very well knows that people are gonna forget everything once the news cycle hit",
        "If people think Devendra Fadnavis is going to get justice, people really don’t know Devendra Fadnavis. I can assure you that as we speak, these politicians must be giving the Agarwals assurances, that wait one week and once people forget about this incident and move on to the next news cycle your sine will be home safely. What is unfortunate is that that is exactly what is going to happen.",
        "This is Insane how money can buy freedom even if he's a murderer",
        "And I get scared, if I forget my licence at home!",
        "Only correct analysis of his statement",
        "There will be 5 people who show up. No one gives a shit about others in India. There should be massive protests over this.",
        "look at the language used by NDTV while reporting this: \"Knocked down 2 IT professionals\" like sir pe tapli maari aur 2 log unconscious ho gaye... Media in this country is shit",
        "Nothing happened in the Jahnavi Gadkar case (2015) .Hope this time justice will be served",
        "They suppressed manipur videos in 2-3 days...don't underestimate power of powerful in india....",
        "Fuck patriarchy. Where's the mother?",
        "lol",
        "I'm of the feeling it's going to be huge, let's see!",
        "Indians might forget, but foreigners don't. This has spread globally, so most likely even foreigners will say, \"isn't Pune where they let go that builders son?\"",
        "Maybe but I know quite a few friends who are going with mr",
        "Yeah, Amitesh Kumar, Sunil Tingre both need to be proved tho... Their behavior was so sus in regards to this. That bail in 12 hours was sus as duck",
        "okay that is good!",
        "Nothing ever changes. A mostly similar incident happened in 2016 in Kolkata where a class 12 student was stabbed to death by his \"friends\" in a birthday party in a posh apartment in South Kolkata . People made a lot of noise about it, led candle light marches , now hardly anyone remembers. \n\n[https://timesofindia.indiatimes.com/city/kolkata/city-teen-stabbed-with-beer-bottle-after-birthday-bash/articleshow/53360939.cms](https://timesofindia.indiatimes.com/city/kolkata/city-teen-stabbed-with-beer-bottle-after-birthday-bash/articleshow/53360939.cms)",
        "Karma will get them eventually.",
        "No, but Mr. Sunil Tingre said that as a responsible public representative, he went to the police station at 6 in the morning to look into the matter of the accident that happened in his constituency!",
        "Thanks a ton for whoever assisted with making the video from the pub, public.",
        "Bro, please come out of your la la land. If our dogshit politicians were so concerned about India’s global image in terms of law & order, people like Salman Khan would be rotting in jail. Scumbags like Brijbhushan singh and Ajay Mishra Teni would not be sitting in Parliament. \n\nAt this point, justice in India is a lost cause unless you come from an affluent family and care to pay hefty lawyer fees. Just take care of your family and don’t keep your hopes so high with Indian legal machinery."
    ],
    "cleaned_text": "juvenile board give order fadnavis pune porsche crash maharashtra deputy cm promised strict action think justice served ",
    "cleaned_title": "juvenile board give order fadnavis pune porsche crash",
    "cleaned_selftext": "maharashtra deputy cm promised strict action think justice served",
    "cleaned_comments": "hope read somewhere juvenile bailed pressure exerted ncp mla sunil tingre ajit pawar aide mostly likely take another builder bothered ones fate damn criminal talking guys news covered media dont think media change heart decide act robinhood something political going onnot anyway discounting happened couple may soul rest peace please explaini didnt understand thankfully political interference case actually needed couple friends colleagues couple friends colleagues office wait next thing happen everyone forget news next thing happen week two election results come case keep going pos move india live life good number years come back everyone forgets incident people actually suffer lost life loved electoral bonds reaching everyone soon justice served temporarily untill news dies idk man punekars pretty enraged even common people theyre going hold protest fc road sunday adani ji builder builders apparently ordered pizza police station bring alcohol level conducted blood analysis hours incident somehow one blaming parents taking responsibility also playing games get murder jail father hiding arrested everyones gon na forget whatever happened tathya patel killed people everything bikau really hope rival builders make use situation help media completely screw fatherson duo totally understand frustration seriously shame treat us like insects maro kuchlo aage bado justice given example set reading details accident actually laughed loud ridiculous judgement socalled minor treated adult given harshest punishment life common indian person become joke filthy rich privileged brats fadanvis also promised justice sushant singh rajput bihar elections wait fadnavis receives fat paycheck bad yesi dont think rich man india jailedthere much corruption saying bjp doesnt get bribes father culprit treated like king prison kid got pizza father get butter chicken naan seriously sometimes think aprichit nayak needed good argue alcohol clouded judgement yeah exactly thats devendra fadnavis trying saint well knows people gon na forget everything news cycle hit people think devendra fadnavis going get justice people really dont know devendra fadnavis assure speak politicians must giving agarwals assurances wait one week people forget incident move next news cycle sine home safely unfortunate exactly going happen insane money buy freedom even hes murderer get scared forget licence home correct analysis statement people show one gives shit others india massive protests look language used ndtv reporting knocked professionals like sir pe tapli maari aur log unconscious ho gaye media country shit nothing happened jahnavi gadkar case hope time justice served suppressed manipur videos daysdont underestimate power powerful india fuck patriarchy wheres mother lol im feeling going huge lets see indians might forget foreigners dont spread globally likely even foreigners say isnt pune let go builders son maybe know quite friends going mr yeah amitesh kumar sunil tingre need proved tho behavior sus regards bail hours sus duck okay good nothing ever changes mostly similar incident happened kolkata class student stabbed death friends birthday party posh apartment south kolkata people made lot noise led candle light marches hardly anyone remembers httpstimesofindiaindiatimescomcitykolkatacityteenstabbedwithbeerbottleafterbirthdaybasharticleshowcmshttpstimesofindiaindiatimescomcitykolkatacityteenstabbedwithbeerbottleafterbirthdaybasharticleshowcms karma get eventually mr sunil tingre said responsible public representative went police station morning look matter accident happened constituency thanks ton whoever assisted making video pub public bro please come la la land dogshit politicians concerned indias global image terms law order people like salman khan would rotting jail scumbags like brijbhushan singh ajay mishra teni would sitting parliament point justice india lost cause unless come affluent family care pay hefty lawyer fees take care family dont keep hopes high indian legal machinery",
    "light_cleaned_title": "\"How Can Juvenile Board Give Such Order?\" D Fadnavis On Pune Porsche Crash",
    "light_cleaned_selftext": "Maharashtra deputy CM has promised strict action, do you all think justice will be served?",
    "light_cleaned_comments": "Hope it will but read somewhere that the Juvenile was bailed after pressure was exerted by NCP MLA Sunil Tingre (Ajit Pawar aide ).. Mostly likely he is on take from another builder , so is not bothered with this one's fate. Damn the criminal is talking now guys. The news is being covered by media... I don't Think that the media had a change of heart and decide to act Robinhood.... There is something political going on....not that I in anyway discounting what has happened to the couple ...May there soul rest in peace. Please explain...I didn't understand Thankfully, we have political interference it case where it is actually needed. Not couple friends colleagues Not couple friends colleagues office IT Wait for next thing to happen. Everyone will forget this news. The next thing will happen in a week or two. If not then election results will come. The case will keep on going. That pos will move out of India and live his life there for good number of years and will come back when everyone forgets this incident. The only people who will actually suffer are those who lost their life and those who loved them. Electoral bonds reaching everyone soon Justice will be served temporarily untill news dies down. Idk man, Punekars are pretty enraged about it, even the common people. They're going to hold a protest at FC Road, this Sunday. #Adani ji, builder of all builders! Apparently he ordered a pizza at the police station to bring down his alcohol level and they conducted his blood analysis 10 hours after the incident Somehow no one is blaming the parents. While they are not only not taking the responsibility but also playing games to get that murder out of jail … The father who was hiding has been arrested. Everyone's gonna forget. Whatever happened to Tathya Patel who killed 9 people. Everything is bikau here. I really hope some rival builders make use of this situation and help the media completely screw up this father-son duo Totally understand frustration. Seriously what a shame!!! They treat us like insects, maro kuchlo aage bado. Justice should be given, an example has to be set. When I was reading the details of this accident, I actually laughed out loud at the ridiculous judgement. This so-called minor should be treated as any other adult and given the harshest punishment. Life of a common Indian person has become a joke to these filthy rich, privileged brats. Fadanvis had also promised justice to Sushant Singh Rajput during Bihar elections. Wait until D Fadnavis receives his fat paycheck. My bad... Yes...I don't think that a rich man in India can be jailed...there is too much corruption for that.. He is saying that BJP doesn't get any bribes from the father of the culprit. And he will be treated like a king in prison. The kid got pizza and the father will get butter chicken with naan. Seriously sometimes I think aprichit and nayak are needed. It’s good. Now he cannot argue that alcohol clouded his judgement. Yeah exactly. That’s why Devendra Fadnavis is trying to be a saint here. He very well knows that people are gonna forget everything once the news cycle hit If people think Devendra Fadnavis is going to get justice, people really don’t know Devendra Fadnavis. I can assure you that as we speak, these politicians must be giving the Agarwals assurances, that wait one week and once people forget about this incident and move on to the next news cycle your sine will be home safely. What is unfortunate is that that is exactly what is going to happen. This is Insane how money can buy freedom even if he's a murderer And I get scared, if I forget my licence at home! Only correct analysis of his statement There will be 5 people who show up. No one gives a shit about others in India. There should be massive protests over this. look at the language used by NDTV while reporting this: \"Knocked down 2 IT professionals\" like sir pe tapli maari aur 2 log unconscious ho gaye... Media in this country is shit Nothing happened in the Jahnavi Gadkar case (2015) .Hope this time justice will be served They suppressed manipur videos in 2-3 days...don't underestimate power of powerful in india.... Fuck patriarchy. Where's the mother? lol I'm of the feeling it's going to be huge, let's see! Indians might forget, but foreigners don't. This has spread globally, so most likely even foreigners will say, \"isn't Pune where they let go that builders son?\" Maybe but I know quite a few friends who are going with mr Yeah, Amitesh Kumar, Sunil Tingre both need to be proved tho... Their behavior was so sus in regards to this. That bail in 12 hours was sus as duck okay that is good! Nothing ever changes. A mostly similar incident happened in 2016 in Kolkata where a class 12 student was stabbed to death by his \"friends\" in a birthday party in a posh apartment in South Kolkata . People made a lot of noise about it, led candle light marches , now hardly anyone remembers. [https://timesofindia.indiatimes.com/city/kolkata/city-teen-stabbed-with-beer-bottle-after-birthday-bash/articleshow/53360939.cms](https://timesofindia.indiatimes.com/city/kolkata/city-teen-stabbed-with-beer-bottle-after-birthday-bash/articleshow/53360939.cms) Karma will get them eventually. No, but Mr. Sunil Tingre said that as a responsible public representative, he went to the police station at 6 in the morning to look into the matter of the accident that happened in his constituency! Thanks a ton for whoever assisted with making the video from the pub, public. Bro, please come out of your la la land. If our dogshit politicians were so concerned about India’s global image in terms of law & order, people like Salman Khan would be rotting in jail. Scumbags like Brijbhushan singh and Ajay Mishra Teni would not be sitting in Parliament. At this point, justice in India is a lost cause unless you come from an affluent family and care to pay hefty lawyer fees. Just take care of your family and don’t keep your hopes so high with Indian legal machinery."
}