{
    "id": "1g85g2w",
    "title": "Horrid experience with Flipkart ",
    "url": "https://www.reddit.com/gallery/1g85g2w",
    "selftext": "Summary - ordered phone on Flipkart for my brother's birthday, horrid experience - 10-12 days(4 days - flipkarts delivery estimate) , nothing was delivered, after endless calls(25ish) over multiple days, we had to go collect it ourselves.. Amazon delivered the same phone in 2 days for my neighbour \n\n\n\nI had ordered a phone from Flipkart for my brother's birthday. We had placed the order and it showed that the delivery would be made one day before his birthday.\n\nSo the day before his birthday, after waiting till 7pm I contacted customer support who assured me we would get the order tomorrow or in 2 days time. \n\nWe tried a lot to get it, but after extensively calling customer support we still couldn't get it on his birthday. \n\nThe parcel had come all the way from UP to Pune in 2-3 days, it had reached a centre near me in time too, the parcel was just 40mins away from my house \n\nEven though it was soo close, either delivery was not attempted or they said can't deliver because of operational issues.. \nWe made continuous calls to customer support for 6 days for either the delivery or atleast the address of the hub it is at, we didn't get any help from them.. \n\nEven after all this we had to actually go to the centre and get it ourselves.. \n\nMy neighbour orderd the same model from Amazon (400 rs more) and he got it delivered in two days.. \n\n",
    "flair": "Rant / Vent",
    "score": 46,
    "num_comments": 15,
    "created_utc": 1729448954.0,
    "convurl": "https://i.redd.it/0e4av9jnfyvd1.png",
    "comments": [
        "Same I am experiencing with amazon",
        "I got a defective phone in great Indian sale and I raised it for the replacement of the phone after getting the DOA CERTIFICATE. THEN the replacement got cancelled 'god knows the reason' . Then I asked for a refund and they said the defective phone has to be picked up . Still they have picked up . I ordered the phone on 4th oct and still it is not picked up. The problem is I bought the phone using a credit card at no cost emi  . If they don't refund , then I have to pay the installment  . There is no notification from Amazon on status . I had to call each and every day for this . All giving the same excuse. \n\nAll incompetent pieces of shit work in amazon. \n\n\nWorst experience . I am going to uninstall Amazon after this issue gets resolved",
        "Ohh \n\nThis is new \n\nI've had a superb experience with Amazon so far, I guess it varies from area to area ?",
        "r/fuckflipkart",
        "To me this happens with Amazon",
        "Fuck this flipkart man. I ordered a Work desk and 2 wardrobes, the wardrobe installation is scheduled on 20th Oct,  flipkart gave the number of technician the number is switched off. And about the work desk, flipkart is saying we cannot deliver it after ordering and taking the payment. \nAnother story, this was few years ago, We ordered a phone from Flipkart, Received a SOAP inside the phone box. I'm not ordering from Flipkart again, Amazon is 100 times better.",
        "Bro, this problem is with Ekart. I faced this same issue only when the delivery partner is Ekart.",
        "Hi OP, where do you live in Pune? I live near Wakad and this issue is an ongoing one with Flipkart as there are 3 hubs here out of which only 1 delivers to our area and the products gets shuffled from one hub to another until it reaches the Wakad hub near premji mithaiwala and if the delivery timeline is not over they attempt delivery. I have raised multiple concerns but no use",
        "I second this",
        "I guess area to area vary hota hai \n\nWe must complain against those particular delivery hubs",
        "Yep, I did some digging after this incident \n\nEkart has soo many issues, I'm not sure how they manage to survive as a company",
        "Aundh",
        "Even I had the same issue with Amazon. Worst service ever. It's very irritating.",
        "Never order things during festival season. The customers themselves scam amazon and amazon gets bogged down by endless support requests that it gets hard to get a just resolution",
        "Lol they seem to be playing passing the parcel at every location",
        "Customer concerns India always fall on deaf ears.\nCheck wats up on ola electric govt should ensure better stronger laws.",
        "Same is happening with me ordered a monitor and promised delivery date was 20 and till today its only out for delivery and not sharing delivery agents number. Calling flipkart support is waste of time they cannot call the hub where my parcel has been sitting. All they say is please wait till end of today."
    ],
    "cleaned_text": "horrid experience flipkart summary ordered phone flipkart brothers birthday horrid experience days days flipkarts delivery estimate nothing delivered endless callsish multiple days go collect amazon delivered phone days neighbour ordered phone flipkart brothers birthday placed order showed delivery would made one day birthday day birthday waiting till pm contacted customer support assured would get order tomorrow days time tried lot get extensively calling customer support still couldnt get birthday parcel come way pune days reached centre near time parcel mins away house even though soo close either delivery attempted said cant deliver operational issues made continuous calls customer support days either delivery atleast address hub didnt get help even actually go centre get neighbour orderd model amazon rs got delivered two days ",
    "cleaned_title": "horrid experience flipkart",
    "cleaned_selftext": "summary ordered phone flipkart brothers birthday horrid experience days days flipkarts delivery estimate nothing delivered endless callsish multiple days go collect amazon delivered phone days neighbour ordered phone flipkart brothers birthday placed order showed delivery would made one day birthday day birthday waiting till pm contacted customer support assured would get order tomorrow days time tried lot get extensively calling customer support still couldnt get birthday parcel come way pune days reached centre near time parcel mins away house even though soo close either delivery attempted said cant deliver operational issues made continuous calls customer support days either delivery atleast address hub didnt get help even actually go centre get neighbour orderd model amazon rs got delivered two days",
    "cleaned_comments": "experiencing amazon got defective phone great indian sale raised replacement phone getting doa certificate replacement got cancelled god knows reason asked refund said defective phone picked still picked ordered phone th oct still picked problem bought phone using credit card cost emi dont refund pay installment notification amazon status call every day giving excuse incompetent pieces shit work amazon worst experience going uninstall amazon issue gets resolved ohh new ive superb experience amazon far guess varies area area rfuckflipkart happens amazon fuck flipkart man ordered work desk wardrobes wardrobe installation scheduled th oct flipkart gave number technician number switched work desk flipkart saying deliver ordering taking payment another story years ago ordered phone flipkart received soap inside phone box im ordering flipkart amazon times better bro problem ekart faced issue delivery partner ekart hi op live pune live near wakad issue ongoing one flipkart hubs delivers area products gets shuffled one hub another reaches wakad hub near premji mithaiwala delivery timeline attempt delivery raised multiple concerns use second guess area area vary hota hai must complain particular delivery hubs yep digging incident ekart soo many issues im sure manage survive company aundh even issue amazon worst service ever irritating never order things festival season customers scam amazon amazon gets bogged endless support requests gets hard get resolution lol seem playing passing parcel every location customer concerns india always fall deaf ears check wats ola electric govt ensure better stronger laws happening ordered monitor promised delivery date till today delivery sharing delivery agents number calling flipkart support waste time call hub parcel sitting say please wait till end today",
    "light_cleaned_title": "Horrid experience with Flipkart",
    "light_cleaned_selftext": "Summary - ordered phone on Flipkart for my brother's birthday, horrid experience - 10-12 days(4 days - flipkarts delivery estimate) , nothing was delivered, after endless calls(25ish) over multiple days, we had to go collect it ourselves.. Amazon delivered the same phone in 2 days for my neighbour I had ordered a phone from Flipkart for my brother's birthday. We had placed the order and it showed that the delivery would be made one day before his birthday. So the day before his birthday, after waiting till 7pm I contacted customer support who assured me we would get the order tomorrow or in 2 days time. We tried a lot to get it, but after extensively calling customer support we still couldn't get it on his birthday. The parcel had come all the way from UP to Pune in 2-3 days, it had reached a centre near me in time too, the parcel was just 40mins away from my house Even though it was soo close, either delivery was not attempted or they said can't deliver because of operational issues.. We made continuous calls to customer support for 6 days for either the delivery or atleast the address of the hub it is at, we didn't get any help from them.. Even after all this we had to actually go to the centre and get it ourselves.. My neighbour orderd the same model from Amazon (400 rs more) and he got it delivered in two days..",
    "light_cleaned_comments": "Same I am experiencing with amazon I got a defective phone in great Indian sale and I raised it for the replacement of the phone after getting the DOA CERTIFICATE. THEN the replacement got cancelled 'god knows the reason' . Then I asked for a refund and they said the defective phone has to be picked up . Still they have picked up . I ordered the phone on 4th oct and still it is not picked up. The problem is I bought the phone using a credit card at no cost emi . If they don't refund , then I have to pay the installment . There is no notification from Amazon on status . I had to call each and every day for this . All giving the same excuse. All incompetent pieces of shit work in amazon. Worst experience . I am going to uninstall Amazon after this issue gets resolved Ohh This is new I've had a superb experience with Amazon so far, I guess it varies from area to area ? r/fuckflipkart To me this happens with Amazon Fuck this flipkart man. I ordered a Work desk and 2 wardrobes, the wardrobe installation is scheduled on 20th Oct, flipkart gave the number of technician the number is switched off. And about the work desk, flipkart is saying we cannot deliver it after ordering and taking the payment. Another story, this was few years ago, We ordered a phone from Flipkart, Received a SOAP inside the phone box. I'm not ordering from Flipkart again, Amazon is 100 times better. Bro, this problem is with Ekart. I faced this same issue only when the delivery partner is Ekart. Hi OP, where do you live in Pune? I live near Wakad and this issue is an ongoing one with Flipkart as there are 3 hubs here out of which only 1 delivers to our area and the products gets shuffled from one hub to another until it reaches the Wakad hub near premji mithaiwala and if the delivery timeline is not over they attempt delivery. I have raised multiple concerns but no use I second this I guess area to area vary hota hai We must complain against those particular delivery hubs Yep, I did some digging after this incident Ekart has soo many issues, I'm not sure how they manage to survive as a company Aundh Even I had the same issue with Amazon. Worst service ever. It's very irritating. Never order things during festival season. The customers themselves scam amazon and amazon gets bogged down by endless support requests that it gets hard to get a just resolution Lol they seem to be playing passing the parcel at every location Customer concerns India always fall on deaf ears. Check wats up on ola electric govt should ensure better stronger laws. Same is happening with me ordered a monitor and promised delivery date was 20 and till today its only out for delivery and not sharing delivery agents number. Calling flipkart support is waste of time they cannot call the hub where my parcel has been sitting. All they say is please wait till end of today."
}