{
    "id": "16hf8va",
    "title": "Allahabad High Court: CJ withdraws all Gyanvapi cases from single-judge bench",
    "url": "https://indianexpress.com/article/cities/lucknow/allahabad-high-court-cj-withdraws-all-gyanvapi-cases-from-single-judge-bench-8937399/",
    "selftext": "In an order dated August 28, Chief Justice Diwaker cited an order he passed on the administrative side on August 11 to “withdraw” the cases from the bench (of Justice Prakash Padia) “wherein the judgment is reserved and to nominate afresh”.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694585737.0,
    "convurl": "https://external-preview.redd.it/HhlqQuKbCLk7UvK_6C_1bfDkXU3jH4sAVJxR9lGwAsM.jpg?auto=webp&s=30dd3634d032e7065cd692956220e986aa98b8c6",
    "comments": [
        ">In the order, the CJ notes: “Record reveals that the cases were heard on 18.01.2021 by the Court which had the jurisdiction as per the roster assigned by the Chief Justice. After the cases were heard on several dates, the proceedings were concluded and judgment was reserved in the matter on 15.03.2021. The judgment, however, was not delivered in the matter. The cases nevertheless continued to be listed before the same court even after the concerned learned Single Judge ceased to have jurisdiction in the matter as per roster.”\n\n>“Facts of this case pose a more troubled scenario of procedural aberration. The non-observance of procedure in listing of the cases, passing of successive orders for reserving the judgment and again listing the cases before the learned Judge for hearing, though he no longer had jurisdiction in the matter as per the roster, under the  directions received from the chamber of learned Judge, without allowing the parent section in the office to have access to the records of these cases are instances of non 10 of 12 observance of procedure settled for listing and hearing of cases,” the order noted."
    ],
    "cleaned_text": "allahabad high court cj withdraws gyanvapi cases singlejudge bench order dated august chief justice diwaker cited order passed administrative side august withdraw cases bench justice prakash padia wherein judgment reserved nominate afresh ",
    "cleaned_title": "allahabad high court cj withdraws gyanvapi cases singlejudge bench",
    "cleaned_selftext": "order dated august chief justice diwaker cited order passed administrative side august withdraw cases bench justice prakash padia wherein judgment reserved nominate afresh",
    "cleaned_comments": "order cj notes record reveals cases heard court jurisdiction per roster assigned chief justice cases heard several dates proceedings concluded judgment reserved matter judgment however delivered matter cases nevertheless continued listed court even concerned learned single judge ceased jurisdiction matter per roster facts case pose troubled scenario procedural aberration nonobservance procedure listing cases passing successive orders reserving judgment listing cases learned judge hearing though longer jurisdiction matter per roster directions received chamber learned judge without allowing parent section office access records cases instances non observance procedure settled listing hearing cases order noted",
    "light_cleaned_title": "Allahabad High Court: CJ withdraws all Gyanvapi cases from single-judge bench",
    "light_cleaned_selftext": "In an order dated August 28, Chief Justice Diwaker cited an order he passed on the administrative side on August 11 to “withdraw” the cases from the bench (of Justice Prakash Padia) “wherein the judgment is reserved and to nominate afresh”.",
    "light_cleaned_comments": ">In the order, the CJ notes: “Record reveals that the cases were heard on 18.01.2021 by the Court which had the jurisdiction as per the roster assigned by the Chief Justice. After the cases were heard on several dates, the proceedings were concluded and judgment was reserved in the matter on 15.03.2021. The judgment, however, was not delivered in the matter. The cases nevertheless continued to be listed before the same court even after the concerned learned Single Judge ceased to have jurisdiction in the matter as per roster.” >“Facts of this case pose a more troubled scenario of procedural aberration. The non-observance of procedure in listing of the cases, passing of successive orders for reserving the judgment and again listing the cases before the learned Judge for hearing, though he no longer had jurisdiction in the matter as per the roster, under the directions received from the chamber of learned Judge, without allowing the parent section in the office to have access to the records of these cases are instances of non 10 of 12 observance of procedure settled for listing and hearing of cases,” the order noted."
}