{
    "id": "13ummjs",
    "title": "Congress set to begin Rajasthan repair work, Kharge to meet Gehlot and Pilot today",
    "url": "https://indianexpress.com/article/political-pulse/congress-rajasthan-mallikarjun-kharge-ashok-gehlot-sachin-pilot-8634140/",
    "selftext": "What should be the solution according to you?",
    "flair": "Politics",
    "score": 28,
    "num_comments": 6,
    "created_utc": 1685340600.0,
    "convurl": "https://external-preview.redd.it/XL6IFHbRf162uUB9fRhSz9d2-V0zu7-04kDmnNo4jw8.jpg?auto=webp&v=enabled&s=a3a19871f3596dd49a9fc6e6d9500652e8e4d267",
    "comments": [
        "No solution to this unless Pilot backs out like DK Shi. Gehlot has the numbers in Rajastan but Pilot works harder than anyone else there. But Gehlot will never play second fiddle to Pilot and Congress can't take him to the centre because they have nothing to offer there.",
        "Would be a surprise if pilot goes back to what he already head after so much drama\n\n>Congress can't take him to the centre because they have nothing to offer there.\n\nThen take pilot? But there was an report that he was offered but refused",
        "> Then take pilot? But there was an report that he was offered but refused\n\nTake Pilot where?",
        "To the centre",
        "Buddy, what will they offer Pilot in the centre? Do you know BJP is in power from the last 9 years?",
        "Pretty much. They tried to change the situation by offering Gehlot Party President position. But he has been CM for 15 years. For 30 years he has been Leader of RJ Congress. Why will he give that up?"
    ],
    "cleaned_text": "congress set begin rajasthan repair work kharge meet gehlot pilot today solution according ",
    "cleaned_title": "congress set begin rajasthan repair work kharge meet gehlot pilot today",
    "cleaned_selftext": "solution according",
    "cleaned_comments": "solution unless pilot backs like dk shi gehlot numbers rajastan pilot works harder anyone else gehlot never play second fiddle pilot congress cant take centre nothing offer would surprise pilot goes back already head much drama congress cant take centre nothing offer take pilot report offered refused take pilot report offered refused take pilot centre buddy offer pilot centre know bjp power last years pretty much tried change situation offering gehlot party president position cm years years leader rj congress give",
    "light_cleaned_title": "Congress set to begin Rajasthan repair work, Kharge to meet Gehlot and Pilot today",
    "light_cleaned_selftext": "What should be the solution according to you?",
    "light_cleaned_comments": "No solution to this unless Pilot backs out like DK Shi. Gehlot has the numbers in Rajastan but Pilot works harder than anyone else there. But Gehlot will never play second fiddle to Pilot and Congress can't take him to the centre because they have nothing to offer there. Would be a surprise if pilot goes back to what he already head after so much drama >Congress can't take him to the centre because they have nothing to offer there. Then take pilot? But there was an report that he was offered but refused > Then take pilot? But there was an report that he was offered but refused Take Pilot where? To the centre Buddy, what will they offer Pilot in the centre? Do you know BJP is in power from the last 9 years? Pretty much. They tried to change the situation by offering Gehlot Party President position. But he has been CM for 15 years. For 30 years he has been Leader of RJ Congress. Why will he give that up?"
}