{
    "id": "19byq0a",
    "title": "Myntra Cheated me and eKart team is refusing to pick the return item.",
    "url": "https://www.reddit.com/r/india/comments/19byq0a/myntra_cheated_me_and_ekart_team_is_refusing_to/",
    "selftext": "Guys be careful. \n\nThese online shopping portals are good as long as you get the right item.\n\nThe moment you receive a defective or wrong item they wash off their hands stating it's not their responsibility.\n\nI ordered a mochi shoe but instead received a cheap spec inside a mochi shoe box. \n\nRequested for return, logistics team Ekart is refusing to pick up the item.\n\nhttps://twitter.com/ChachaSabKa/status/1746167626055733748",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1705825260.0,
    "convurl": "https://external-preview.redd.it/8wy_3n7khv-B60vCf9IlrG_FefSX3bEUgz4q0VNWfLo.jpg?auto=webp&s=9dec4f1262fcfe6265a53ee66a2b309cd73455bc",
    "comments": [
        "hope u got the\"unboxing\" on video footage..sent them and keep pestering them..they will likely replace or refund it I hope.."
    ],
    "cleaned_text": "myntra cheated ekart team refusing pick return item guys careful online shopping portals good long get right item moment receive defective wrong item wash hands stating responsibility ordered mochi shoe instead received cheap spec inside mochi shoe box requested return logistics team ekart refusing pick item ",
    "cleaned_title": "myntra cheated ekart team refusing pick return item",
    "cleaned_selftext": "guys careful online shopping portals good long get right item moment receive defective wrong item wash hands stating responsibility ordered mochi shoe instead received cheap spec inside mochi shoe box requested return logistics team ekart refusing pick item",
    "cleaned_comments": "hope u got theunboxing video footagesent keep pestering themthey likely replace refund hope",
    "light_cleaned_title": "Myntra Cheated me and eKart team is refusing to pick the return item.",
    "light_cleaned_selftext": "Guys be careful. These online shopping portals are good as long as you get the right item. The moment you receive a defective or wrong item they wash off their hands stating it's not their responsibility. I ordered a mochi shoe but instead received a cheap spec inside a mochi shoe box. Requested for return, logistics team Ekart is refusing to pick up the item.",
    "light_cleaned_comments": "hope u got the\"unboxing\" on video footage..sent them and keep pestering them..they will likely replace or refund it I hope.."
}