{
    "id": "158fe7r",
    "title": "There was a time when India had a PM",
    "url": "https://www.reddit.com/r/india/comments/158fe7r/there_was_a_time_when_india_had_a_pm/",
    "selftext": "who said this on women protection..\n https://m.economictimes.com/news/politics-and-nation/delhi-gang-rape-case-pm-manmohan-singh-appeals-for-calm-vows-to-protect-women/articleshow/17739603.cms\n\nAnd most of the times he was ridiculed for being silent.\n\nAnd then india chose \"developnent\" !!",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690215934.0,
    "convurl": "https://external-preview.redd.it/c0vZDUsi-uGeUEYE0cjAEwhsXAah9D1u215jMNekRwE.jpg?auto=webp&s=1a0103bc59772b9b8e0f2afefd1fba0ef80fcb37",
    "comments": [
        "\" caring PM \" now we have a Influencer who'll only care when there's  some ribbon to be cut somewhere..",
        "Maun Modi",
        "He was ridiculed for delayed action.",
        "Influencer hahaha. Nice one",
        "Influenza PM",
        "It's better than burning bodies of the victims immediately, or letting the rape accused get bail, or letting a rape accused have the police beat up Olympians, or shutting down the internet whenever a slight protest happened.\n\nChaddi",
        "The most striking thing he did was go to Nirbhayas funeral and talk to the press. Made an entire nation extremely uncomfortable with how this could happen in our country. \n\n\nSometimes, other things are much more important than politics or jumlas. Serious needs serious.",
        "Boss. He was at the hospital with Nirbhaya. At the funeral. I remember being extremely uncomfortable as a teenager about such a somber affair in the public eye with all cameras in Manmohan and a wailing family seriously wondering how this could happen in our country. \n\nToday, we don’t even acknowledge it. How far we’ve fallen.",
        "Modi's delay in addressing the situation is why we all are condemning him as well and will not reelect him again. As I noted in my comment, the government did get its act together after the pressure started mounting. However, that still doesn't justify the delay in actions. The mentality that we need to choose \"bad\" in place of \"worse\" needs to stop.",
        "What's with the slang in a discussion around a sensitive topic? Is it wrong to prefer a government whichs acts fasts as that increases the survival chances of the victim?",
        "Chaddi",
        "\"bad\" in place of \"worse\" was never the mentality of the country, no one choose like that, we have seen 'Worst' being choosen in place of 'bad' because 'Worst' had a loudspeaker. And if you are talking about \"Then Government acting after media pressure\", then also you will have to mention that Government was not managing media then, now a days, the criminal management of media is there, they blindly support anything, from whataboutery to silence, Media is not showing Manipur now, it's bashing Opposition asking for answers, without ever explaining the difference between rule 176 & rule 267 of Parliamentary rule book , they are and they will portray opposition as a devil.",
        "He stayed silent when 1000’s died due to Covid in Delhi. Why do you think he will speak now?\n\nHe did not speak when people died due to demonetisation. Why do you think he will speak now?",
        "I don't know if cremating a rape victim's body \"fast\", without even informing her family, or allowing a post-mortem, increased her chances of survival 🤔🤔. \n\nr/AmITheChaddi - yes you are.",
        "Yes fast in cover up, chaddi. Heck your kind is even ruining art in r/place. Every place is turned to shit by chaddis",
        "I hope you’re being sarcastic my friend.\n\nGive one instance of this sorry excuse of a government ‘acting fast’",
        "Let me correct that, millions in all over india.",
        "yup!",
        "By survival chances u mean for rape accused to get bail, hunt down the victim, rape her and her sister again and burn their house down.\n\nYes super fast",
        "Ahh old times when Indians used to protest lack of accountability. \n\nNow indians protest to bulldoze homes of those who protest lack of accountability",
        "Now we have PR.",
        "My criticism of MMS's government doesn't automatically mean I am endorsing Modi's government. This black-and-white judgment is rather alarming and I am not sure how it helps the discussion.",
        "#1. \n\nHe was the Prime minister during Nirbhaya Case. So he's concerning about that.\n\n\n\n#2 . \n\nHe spoke during Demonetization and  called it as a [‘monumental disaster’](https://www.thehindu.com/news/national/Manmohan-calls-demonetisation-a-%E2%80%98monumental-disaster%E2%80%99/article16696637.ece)\n\n\n\n\n#3. \nHe himself admitted to Hospital During Covid [Ex-Indian PM Manmohan Singh admitted to hospital with Covid](https://www.theguardian.com/world/2021/apr/21/ex-indian-pm-manmohan-singh-admitted-hospital-covid)\n\n\n\n\n#Are you unaware of all these things or you're just a supporter of Current PM?",
        "Personal attacks and lack of comprehension - an interesting combo.",
        "There is a lot to like about Dr. Manmohan. He was not the best PM we had, but he was miles ahead of the current one.",
        "Influencer cancer"
    ],
    "cleaned_text": "time india pm said women protection times ridiculed silent india chose developnent ",
    "cleaned_title": "time india pm",
    "cleaned_selftext": "said women protection times ridiculed silent india chose developnent",
    "cleaned_comments": "caring pm influencer wholl care theres ribbon cut somewhere maun modi ridiculed delayed action influencer hahaha nice one influenza pm better burning bodies victims immediately letting rape accused get bail letting rape accused police beat olympians shutting internet whenever slight protest happened chaddi striking thing go nirbhayas funeral talk press made entire nation extremely uncomfortable could happen country sometimes things much important politics jumlas serious needs serious boss hospital nirbhaya funeral remember extremely uncomfortable teenager somber affair public eye cameras manmohan wailing family seriously wondering could happen country today dont even acknowledge far weve fallen modis delay addressing situation condemning well reelect noted comment government get act together pressure started mounting however still doesnt justify delay actions mentality need choose bad place worse needs stop whats slang discussion around sensitive topic wrong prefer government whichs acts fasts increases survival chances victim chaddi bad place worse never mentality country one choose like seen worst choosen place bad worst loudspeaker talking government acting media pressure also mention government managing media days criminal management media blindly support anything whataboutery silence media showing manipur bashing opposition asking answers without ever explaining difference rule rule parliamentary rule book portray opposition devil stayed silent died due covid delhi think speak speak people died due demonetisation think speak dont know cremating rape victims body fast without even informing family allowing postmortem increased chances survival ramithechaddi yes yes fast cover chaddi heck kind even ruining art rplace every place turned shit chaddis hope youre sarcastic friend give one instance sorry excuse government acting fast let correct millions india yup survival chances u mean rape accused get bail hunt victim rape sister burn house yes super fast ahh old times indians used protest lack accountability indians protest bulldoze homes protest lack accountability pr criticism mmss government doesnt automatically mean endorsing modis government blackandwhite judgment rather alarming sure helps discussion prime minister nirbhaya case hes concerning spoke demonetization called monumental disasterhttpswwwthehinducomnewsnationalmanmohancallsdemonetisationaemonumentaldisasterearticleece admitted hospital covid exindian pm manmohan singh admitted hospital covidhttpswwwtheguardiancomworldaprexindianpmmanmohansinghadmittedhospitalcovid unaware things youre supporter current pm personal attacks lack comprehension interesting combo lot like dr manmohan best pm miles ahead current one influencer cancer",
    "light_cleaned_title": "There was a time when India had a PM",
    "light_cleaned_selftext": "who said this on women protection.. And most of the times he was ridiculed for being silent. And then india chose \"developnent\" !!",
    "light_cleaned_comments": "\" caring PM \" now we have a Influencer who'll only care when there's some ribbon to be cut somewhere.. Maun Modi He was ridiculed for delayed action. Influencer hahaha. Nice one Influenza PM It's better than burning bodies of the victims immediately, or letting the rape accused get bail, or letting a rape accused have the police beat up Olympians, or shutting down the internet whenever a slight protest happened. Chaddi The most striking thing he did was go to Nirbhayas funeral and talk to the press. Made an entire nation extremely uncomfortable with how this could happen in our country. Sometimes, other things are much more important than politics or jumlas. Serious needs serious. Boss. He was at the hospital with Nirbhaya. At the funeral. I remember being extremely uncomfortable as a teenager about such a somber affair in the public eye with all cameras in Manmohan and a wailing family seriously wondering how this could happen in our country. Today, we don’t even acknowledge it. How far we’ve fallen. Modi's delay in addressing the situation is why we all are condemning him as well and will not reelect him again. As I noted in my comment, the government did get its act together after the pressure started mounting. However, that still doesn't justify the delay in actions. The mentality that we need to choose \"bad\" in place of \"worse\" needs to stop. What's with the slang in a discussion around a sensitive topic? Is it wrong to prefer a government whichs acts fasts as that increases the survival chances of the victim? Chaddi \"bad\" in place of \"worse\" was never the mentality of the country, no one choose like that, we have seen 'Worst' being choosen in place of 'bad' because 'Worst' had a loudspeaker. And if you are talking about \"Then Government acting after media pressure\", then also you will have to mention that Government was not managing media then, now a days, the criminal management of media is there, they blindly support anything, from whataboutery to silence, Media is not showing Manipur now, it's bashing Opposition asking for answers, without ever explaining the difference between rule 176 & rule 267 of Parliamentary rule book , they are and they will portray opposition as a devil. He stayed silent when 1000’s died due to Covid in Delhi. Why do you think he will speak now? He did not speak when people died due to demonetisation. Why do you think he will speak now? I don't know if cremating a rape victim's body \"fast\", without even informing her family, or allowing a post-mortem, increased her chances of survival 🤔🤔. r/AmITheChaddi - yes you are. Yes fast in cover up, chaddi. Heck your kind is even ruining art in r/place. Every place is turned to shit by chaddis I hope you’re being sarcastic my friend. Give one instance of this sorry excuse of a government ‘acting fast’ Let me correct that, millions in all over india. yup! By survival chances u mean for rape accused to get bail, hunt down the victim, rape her and her sister again and burn their house down. Yes super fast Ahh old times when Indians used to protest lack of accountability. Now indians protest to bulldoze homes of those who protest lack of accountability Now we have PR. My criticism of MMS's government doesn't automatically mean I am endorsing Modi's government. This black-and-white judgment is rather alarming and I am not sure how it helps the discussion. #1. He was the Prime minister during Nirbhaya Case. So he's concerning about that. #2 . He spoke during Demonetization and called it as a [‘monumental disaster’](https://www.thehindu.com/news/national/Manmohan-calls-demonetisation-a-%E2%80%98monumental-disaster%E2%80%99/article16696637.ece) #3. He himself admitted to Hospital During Covid [Ex-Indian PM Manmohan Singh admitted to hospital with Covid](https://www.theguardian.com/world/2021/apr/21/ex-indian-pm-manmohan-singh-admitted-hospital-covid) #Are you unaware of all these things or you're just a supporter of Current PM? Personal attacks and lack of comprehension - an interesting combo. There is a lot to like about Dr. Manmohan. He was not the best PM we had, but he was miles ahead of the current one. Influencer cancer"
}