{
    "id": "1av5yeq",
    "title": "Why Waqf Act could be dangerous for Bharat’s future, and must go – Firstpost",
    "url": "https://www.firstpost.com/opinion/why-waqf-act-could-be-dangerous-for-bharats-future-and-must-go-13281122.html",
    "selftext": "Apparently Waqf act allows them to claim any land as their own and act as civil court.",
    "flair": "Policy/Economy",
    "score": 170,
    "num_comments": 149,
    "created_utc": 1708394948.0,
    "convurl": "https://external-preview.redd.it/uSGy-riPJ57Y5SDxXnH9dk3rjCa1x1FeCt7DOHkHWLY.jpg?auto=webp&s=5d1b2a0010286a50f34468d641a58b6ee6630bd8",
    "comments": [
        "I am following this for a while now. Without going too many details, this is not good. Not good at all.",
        "Omg can this waqf misinformation end already.. \n\nWaqf is a Govt controlled body working under aegis of whatever Govt is in power.. \n\nIt is a repository of lands and IT'S job is to protect waqf lands.. So it will obviously claim lands that have been stolen or encroached. \n\nMukesh Ambanis house is built on stolen waqf lands as are so many others. \n\nIt's a charitable trust which is barely allowed to do charity because politicians want to keep looting it. \n\nAnd now the rw is desperately trying to malign it because it's connected to Muslims..  Just as their typical distraction techniques.. \n\nMeanwhile rw'ers are raping, looting and rioting and NOONE IS SUPPOSED TO NOTICE. \n\nMaybe rw should get obsessed with education, child malnutrition or something that ACTUALLY MATTERS.. Rathar then constantly trying to steal from others.",
        "Bharat's future? Fuck off. It's India.\n\nUnless you want to use भारत , then that's okay. Use India if you are gonna type in the English alphabet. \n\nEk toh you're sharing RW trash",
        "Firstpost is right wing trash.",
        "Eh? Last I checked I don’t write my name in Devnagri script for my fellow non-Indians. How is this different?",
        "Heres a great article for reading bout it: [https://www.logicallyfacts.com/en/fact-check/false-no-waqf-boards-cannot-claim-and-acquire-just-any-private-or-public-property](https://www.logicallyfacts.com/en/fact-check/false-no-waqf-boards-cannot-claim-and-acquire-just-any-private-or-public-property)\n\n&#x200B;\n\nBut it is true that *\"If the owner has legal evidence of and can prove that the property is  not related to waqf, and the board still claims the property, then a  lawsuit can be filed against them in a civil court\"*\n\n&#x200B;\n\nand that the land can be claimed without informing the owner of the land, afterwhich the owner can be summoned to civil court\n\n*\"To determine whether a property falls under their regulation, If the  board possesses any document or legal evidence that a property has been  declared as waqf in the past, they will issue a notice to the current  owner. The owner will then be required to appear before the Waqf  Tribunal, which functions as a civil court for Waqf-related disputes.\"*\n\n&#x200B;\n\nBut, this does pose a challenge for illegally built structures like that of a madrassa in Surat, which now fall under the waqf's protection.",
        "Theoretically yes, but things don't work as per law in India.\n\nhttps://www.hindustantimes.com/india-news/in-tamil-nadu-waqf-board-claims-ownership-of-an-entire-village-there-s-a-temple-too-101663245541768.html",
        "As you say my dear Bhartiya",
        "Sanghi rats have infiltrated the sub",
        "The subtle imposition of India's other name. A name used by the Rw rats is plain to see.\n\nI'll call it \"bharat\" when speaking Hindi but the article shared here is from a RW publication.",
        "*Indian",
        "Yup and looks like the sanghi rats are here too.",
        "Mullu rats or sangh rats, I'll choose the later anyday",
        "Latter* you're one of them anyway.",
        "Yes lots of temples are also on waqf lands.. Both legally and ILLEGALY.. Alot of financiers and village strongman have temples built on waqf land os they can claim said land.. Why is this surprising. I'm sure it's done with other religious structures on govt land as well.. \n\nThere is a temple that a jeweller financed on a friend's land.. So he can land grab the land.. Friend is muslim so they can't go on their own land because this millionaire jeweler makes it a communal issue with some paltu bjp Goons.  \n\nIt's a fucking clusterfuck in India right now.. And bjp's chutiya moves just give more cover for Goons like this. \n\nIt happened to another family friends property but he was Hindu so he just claimed the temple as a family temple built it up a bit and walled off the entire area. \n\nThese laws are meant to serve a purpose. Just because our political class and babu class keeps misusing them doesn't mean they don't serve a purpose. \n\nAnd if people have such a problem with a waqf board.. Just return the lands to the descendants of the people who donated the land.. Which would bankrupt our Govt because govts have been stealing these lands for decades.. So compensations would be astronomical even at Govt rates. \n\nOn top of that we have Smoll smooth brained bigots who's understanding of waqf is mooslims = bad.",
        "Aapki chaddi ka rang khaaki hai!!!!",
        "Right.",
        "Why Bharat is dangerous for India.",
        "When the article doesn't suit your interests=News source is RW. What a logic lol. Days are ahead when y'all will also term NYT as RW propaganda. And, that was also an \"opinion\" piece. The writer might be RW, doesn't make the whole publisher RW, lol",
        "How can one take an article seriously when it is literally a fact that Israel was created something about 70 years ago in the land previously known as Palestine and people who lived there were expelled out to live into areas like Gaza and West Bank. Trying to force a narrative coming from religion book but ignoring the fact that who is actually a settler that came from Europe and did a Nakba to settle on other people’s land is crazy amount of misinformation.",
        "exactly. their entire reasoning is blind faith.",
        "[Without documentary proof, Waqf Board can't lay claim over any property'](https://lawstreet.co/judiciary/without-documentary-proof-waqf-board-cant-lay-claim-over-any-property)",
        "Wtf is bharat ?",
        "Our Nation.",
        "Your passport Says India fuckwit not Bharat",
        "Bharat has been a name for ages . It has nothing to do with right or left wing .\n\nJust like Deutschland is another name of Germany.",
        "Accurately described.",
        "Most literate muslim stupid you cant even once read Indian constitution",
        "Why not call it Jambodweepam? This usage is forced and a part of the sanghi narrative",
        "Because “Bharat” was selected as an alternate name in 1950s - Article 1 of constitution.",
        "https://preview.redd.it/frpohxtizojc1.jpeg?width=1082&format=pjpg&auto=webp&s=f551ee7545b26617d2020243013d9b0d804b7128",
        "Abhijit Majumder must be getting paid really well for these articles. ",
        "Again, the repeated usage of Bharat in English is forced.\n\nWe are first and foremost India.\n\nMy passport says : \" Republic of India\" followed by भारत गणराज्य।\n\nIt's not the same as calling it country Deutschland but more the equivalent of calling it Allegmagne.",
        "“Trying to force a narrative coming from religion book” - care to elaborate this ?",
        "The fact that your passport and even our currency calls it India tells that it is not being enforced like you make it sound. The term Bharat can be used alternatively anywhere else, like it is used here in the article above.",
        "Article 1 of the Indian constitution\n\nName and territory of the Union.—(1) India, that is Bharat,\nshall be a Union of States.\n1[(2) The States and the territories thereof shall be as specified in\nthe First Schedule.]\n(3) The territory of India shall comprise—\n(a) the territories of the States;\n2[(b) the Union territories specified in the First Schedule;\nand]\n(c) such other territories as may be acquired.\n2. Admission or establishment of new States.\n\nRead the actual constitution not some whatsapp forward.\n\nhttps://cdnbbsr.s3waas.gov.in/s380537a945c7aaa788ccfcdf1b99b5d8f/uploads/2023/05/2023050195.pdf",
        "Deutschland means Land of the Germans.\n\nBharat comes from the name of some supposed tribes in Northern India that spread Vedicism.",
        "The picture I shared is the original constitution, not the made-up one you just shared",
        "https://preview.redd.it/i7mv689n0pjc1.jpeg?width=1170&format=pjpg&auto=webp&s=9e5471012ce5539a291b979bcb812ea95156d127\n\nPart 1, Clause 1.\n\nYou do realise the constitution is not just the single page, right?",
        "This from actual official government site. Learn to read\n\nhttps://legislative.gov.in/constitution-of-india/",
        "Have you even seen an Indian passport?",
        "Even your passport says India not Bharat.\nAll of you are wanking in the dark",
        "Idk what kind of passport you have dude. Mine clearly says “Bharat Ganrajya” along with “Republic of India”",
        "Yeah it says \"Republic of India\" not Bharat",
        "Don't try to spin the topic now, better apologize to everyone or don't spew bullshit as facts.",
        "It also says भारत गणराज्य right above that.",
        "That's Hindi/Sanskrit ... I'm writing my replies in English hence India",
        "https://preview.redd.it/q9ud1tg81pjc1.jpeg?width=510&format=pjpg&auto=webp&s=16c0e8dbd41c719a37aebc6f8260d160840eb6a0\n\nYour propaganda ass wouldn't able to see that",
        "Umhmm and what’s your point? You are saying some people born and living on this land named it “Bharat” — so what’s wrong with that? \n\nThe word “India” was given to us by the British - if you have no problem using that what’s the issue with “Bharat” \n\nAgain, it is not being forced. It is only an alternate name. \nNot sure what’s even making you agitate about? It’s just a name.",
        "I know people from my home city are dumb but the lack of cognitive thinking here is mind numbing. In true Punekar fashion you must have been asleep between 1 and 4pm in Civics class.\n\nThe English utilization of the name is forced and has been forced ever since the farce that was g20.\n\n\nAgain, in English we are India. In Devanagari, we are Bharat(because of northern dominated politics).\n\nI do not agree with a term that has no historical basis being used to identify a diverse nation such as ours.",
        "Not my problem you can’t read the official languages of the Union.",
        "And waqf board encroaching or illegally occupying land is absolutely not a problem. /s",
        "https://preview.redd.it/i87ncsqd1pjc1.png?width=1080&format=pjpg&auto=webp&s=c2f63b09f89d0331fc973ca127a0d8c6d9b99ea3",
        "I swear these fuckwits are making a fool of themselves",
        "Lmao. This guy thinks the Preamble is all there is to the constitution.",
        "That's preamble",
        "According to religious books like Bible Judaism originated in land of Palestine. That land is considered holy land for many different religions including Christians, it is also the land where Jesus was born.",
        "Was it meant only for ……?",
        "No the word wasn't given to us by anybody you muppet.\n\nThe word comes from the River Indus which and was anglicized version of Indica. The Greeks gave that name post Alexander's campaign and eventually adopted the culture of the land and became the Kingdom of Kushan. \"Hindu Kush\" comes from that Greco-Bactrian kingdom that followed Vedicism.\n\nAt no point in the last 2000 years was this country ever a united framework.\n\nSome places were called Mewar,Chittorgarh etc.\n\nName given to us by the British. Fucking lol. What was it called before the British came then?",
        "It also says \"Bharat ganarajya\" constitution also says that. And even in the constitution in languages other than English Bharat is mentioned before India.",
        "**\"Misinformation\"** says the guy without any historical insight. \n\n\"At the time of the second kingdom of  Judea, meaning under the Hasmonean Kings (140 BC to 37 BC) there was no  division in different tribes anymore (and so a fortiori there weren't at  the time of the Roman occupation). The last time there was a real tribe  division in Judea and Israel would be from around 900 BC to 586 BC. So a  very long time ago. The people was divided but the division wasn't a  tribal division but rather a political/theological division, the largest  line of division being pro or anti Roman. They were not the only people  living in the kingdom of Judea but they were the people ruling.\n\nThe  last Jewish Kings were the Hasmonean dynasty and after the Roman  conquest in 37 BC they put on of their own on the thrones, King Herod.  So from there Jews didn't have sovereignty on their land (it was  occupied) but they were still present. Important note: not all Jews were  living in Judea back then and there was a solid Jewish community in  Babylonia, that stayed there after the first exile. At the time the  language spoken by the Jews isn't Hebrew but Arameic. Hebrew is the  language for the religious context only.\n\nAfter  the successive revolts against the Romans, things changed. Jerusalem  and the Temple were destroyed during the first revolt (66-73). Jews fled  Jerusalem. Many fled the country to join the Jewish community in  Babylonia, but most remained. The last great revolt of Judea led by Bar  Korba (132-136) brought so much casualty to the Romans that they decided  to exile the Jews from Judea and spread them into the Roman Empire. A  few remained in Judea. Again, a lot of people joined the Jewish  community in Babylonia, the majority was deported pretty much everywhere  in Western Europe.\n\nImportant to  note: the Romans renamed Judea Palestina and Jerusalem Aelia Capitolina,  to erase their connection to the Jewish people.\n\nThe  Jews in Poland arrived there much later in history. Jewish population  had settled in France and Germany along the Rhine. During the crusades,  the crusaders on their way to the Holy Land would commit massacres on  the Jewish communities. Those communities fled east and ended up in  Poland and Russia. That's why at the eve of the Holocaust there were  around 3 million Jews in Poland. There were Jews in all of Europe, and  also in North Africa (because Spain expelling all its Jews in 1492) and  the Arab world, and in America, very few in Eastern Asia and Australia  but still some... And there were always small Jewish communities in  Palestine.\n\nWherever they went,  Jews were persecuted. By the Romans then by the Christians. They were  sent away from the places they inhabited. There were massacres, there  were pogroms. Conspiracy theories were invented against us to justify  our persecution (deicide people, ritual crime accusations, the fucking  Protocols of the Elders of Zion and so many more). Wherever they went  not only were there never in peace but they were never considered to be  full citizens of the countries where they lived.\n\nTake  the example of France. The French revolution gave the status of full  citizens to its Jews. From there and up until the end of the Third  Republic, they assimilated into French society and became more often  than not indistinguishable from the rest of France. Yet the antisemitism  didn't stop. During the Dreyfus Affair, and French officer was accused  of being a traitor and giving military information to Germany even though  there was proof he was actually innocent, just because he was Jewish.  The Affair lasted years and divided French society, and even after  Dreyfus was completely exhonorated, many French people kept considering  him guilty and the perfect example that Jews were an apatride, malicious  people that aimed to control the world.\n\nDuring  the Dreyfus Affair, a Jewish Austrian journalist, Theodore Hertzl, was  sent to cover the events. He himself was a very assimilated Jew, who  believed that assimilation was the answer to antisemitism. In France, he  was shocked by the screams of \"death to Jews!\" and the general  antisemitism. He became convinced that the real solution to antisemitism  was for the Jewish people to have self determination on their own land.  He wrote a book, the Jewish State, and started the Zionist movement.  The movement organized, got support. Some very rich Jewish figures, like  the Rothschild, bought land in Palestine to create Jewish villages. In  parallel, great pogroms and massacres in Eastern Europe and Yemen pushed  the Jews to immigrate in mass in Palestine in successive waves. After  great debates, Palestine was chosen as the homeland of the Jewish people  because it was historically and culturally the land we all had a link  to.\n\nAt the time Palestine was in  the hands of the Ottoman Empire. So political effort was made to  convince them of agreeing to a Jewish homeland in Palestine,  unsuccessfully. In 1917 after WWI the British Empire took control of  Palestine and declared themselves favorable to the installation of a  Jewish homeland in Palestine. That angered the Arabs living there, there  were massacres and the British started trying to play both sides. When  Nazism arrived to power in Germany, many Jews tried to take refuge in  Palestine but British authorities drastically limited immigration, at a  time where no country accepted Jewish refugees. So the immigration had  to become clandestine.\n\nI won't do  you the insult of telling you the story of WWII and the Holocaust, you  know that six million Jews were killed and thousands of survivors were  left with no place to go (there were still pogroms after the Holocaust).  Moreover, the newly founded United Nations recognized the right to self  determination as a collective human right. In 1947 the UN voted to  share Palestine between a Jewish State and an Arab State, with Jerusalem  as an international city. The Jews accepted, the Arabs refused. When  the British left Palestine in 1948, the Jews declared in Independence of  the State of Israel and Egypt, Jordan, Lebanon, Syria and Iraq attacked  Israel. Israel won. They took control of Israel, Jordan took control of  the West Bank. There is of course more to the story but I'm going to  stop there because I think it answers all your questions so far, and I  remain available for more\"",
        "Don't bother with him he is just another whatsapp graduate, just look at his modus operandi, shares some pictures without the actual official document baking it. When others refute it with actual links proof from the official site then try to spin the topic, I just block and move from such propagandists.",
        "Whatsapp forward generation",
        "Exactly. It is derived from Sindhu river and was anglicised by the Colonisers. When you use the term anglicised - that automatically tells it wasn’t always called India. It was called Bharat, Hindustan, Al-Hind, Jamboodweep — it has had many names and eventually India. So there’s wrong in using any those . \n\nOn official documents both India and Bharat are used . Not sure what’s such a big deal.",
        "The Preamble is not the entire Constitution, you moron.",
        "Calm down. Why are you so frustrated? \nYou think every other person is dumb and a muppet but not you? \nPeople who usually think this way are not very smart themselves. \n\nA word can be written in different scripts . English words can be represented in Devnagri and vice versa. Thats what languages are for . So that people can read in the script they are comfortable in.",
        "Can you read all 21 official languages?",
        "That is far leftist reading of the issue and calling it a fact doesn't make it so. There was no strong Palestinian national identity before the 1960s which came as a response to arab israel wars. Before the mandate it was the ottoman empire so no national identity before the 20th century. Also, there was always jewish population in the area and approx 650k jews moved to Israel from majority muslim nations due to \"heightened tensions\". Also note that the nation state is a 19th century European phenomenon facilitated by state mandated education, mass literacy and mass media. Demand for sovereignty is not a natural but cultural achievement.",
        "The root word has geographical basis.\n\n\"Nippon\" means Land of the Rising Sun.\n\n\"ZhongGuo\" the name for China during the Warring States period - archaeological proof exists.\n\nHell England is literally name after the Angles who invaded and displaced the Brittons to Wales and Cornwall.\n\nEgypt is called Egypt but in Arabic its called Misr. Even Egypt has Greek roots which stem from a reference to the God Ptah.\n\nNames should have archeological, geographical and valid historical basis. If you want an ideological name, it should be one shared by 100% of the country",
        "Sodun dya. Have a good day!",
        "I can 15. Flex.",
        "So why ask what bharath then? I don’t have to care for someone’s ignorance",
        "Goes on to show you can’t even have a decent talk without resorting to use personal jibes about sleeping between 1 to 4 etc , and slurs like “dumb”, “muppet” and “fuck” \nIf you had a strong argument you wouldn’t have to use all that. Your whole agitation is pointless. \n\nAlso I am not a Punekar. You assume a lot. Hope you will find wisdom when you grow up.",
        "Have you ever sang our National Anthem?\n\nJana Gana Mana Adhinayak Jaya He\n**Bharat** Bhagya vidhata",
        "How much are you projecting just shut the fuck up",
        "I also sing \" Punjaba Sindha  Gujarata Maratha Dravida Utkala Banga\"\n\nAgain a song written by a great revolutionary from the North. We can go on and on. I'll refute you.",
        "Yes so you just post on r/Pune for fun.",
        "If that is what you understand by the word projecting then soz you need remedial comprehension classes.",
        "Then that would be really an great job high pay for writting fact looks good to me",
        "When you can read all 21, then comment until then, you can't read the official languages of the union either. Nor can I for that matter. My comment was particularly for lil fat potato - if they can't read all 21 languages, it's hypocritical of them to bitch about someone not knowing hindi.",
        "This still does not align with what the author of the article saying. He is portraying Palestinians as trying to take over the land that belongs to Israel. When infact places like Gaza were formed because Arabs who were displaced from what became Israel had nowhere else to go . \n\nAuthor is saying if we don’t want mini Gazas in India we need to remove this law. What does that even mean?",
        "Firstly, he wasn’t exactly from North. He was from West Bengal (which let me tell you is in East of India). Seems like everything above your state is “North” for you.\n\nA poem or song can be written by only one person and that one person has to be from some place right? How does it matter if he’s Bengali or Marathi or Punjabi? He’s wrote it with conviction and with utmost love & respect for this nation. \n\nThis shows how biased & prejudiced your whole personality is.\n\nYou are one of those ignorant Indians who absolute hate people from other states/cities or people who don’t speak your language.",
        "That’s none of your business.",
        "Ignorant like you for thinking everyone speaks hindi when not everyone does. we have 21 official language last I checked and most people don't speak more than 2-3; why the hindification?",
        "There are only 2 official languages of the Union - English and Hindi, and I can read both. I guess you are talking about the scheduled languages, but that is irrelevant in this context.",
        "No one denies there was Jewish population it was less than 8% it was a multi cultural religion which got converted to an ethno state. But you can’t claim people who were already there are trying to take the land.",
        "My god.... I speak 4 Indian languages. 5. All of them fluently. You have no working knowledge of names and live under the delusion that the name India is a British one. You don't even know your own country's history.\n\nMala Marathi yete Ani ani bolate.\n\nEnnaku Tamil Pessamudiyum.\n\nEnniku Malayalam ariyam\n\nHindi Mai toh bindaas baat kar sakta hoon\n\nI'm the last person who can be accused of not liking another language seeing that I cover 60% of the linguistic variety of this country with the above languages.\n\nI'm writing my words with conviction in what the rules and laws of etymology are.",
        "Okay madam. Sorry, you might want to post on r/history to learn your own country's history.",
        "It's RW trash. Simple as.",
        "The way you proved my point.\n\nThey picked a land to self determine as their country coz of “ historic “ and “cultural” connections. It was still a land where others had houses they were forced to evacuate eventually.",
        "How long did it take to cherry pick Wikipedia good sir?",
        "If I didn’t know the history enough, I would also be using slurs  on you but I chose you tell you the facts. \nThe fact is Bharat is an accepted alternate Name of this country - and it is part of Article 1 of our constitution (You can read some civics too, along with history). \n\nAgain, why are you so frustrated? Is it because of all the downvotes on your first comment ?",
        "You really trying to ignore what happened before Naqba and what caused it?\nThe land was previously owned by the British and before that the Ottomans.Their was no Palestinian king or for a fact a Jewish king there(at least a person of final authority)\nYes Naqba is terrible tragedy it should have been prevented if neighboring Arab nations didn't attacked first.But does it justify what Israel did, never it should have been avoidable\nIf they did agree to the UN partition plan and lived with it .\nWhy would jews suddenly had the idea to move to Israel- because they were persecuted from everywhere the prime example being the holocaust.(Most of the land were barren and sparsely populated anyway.)\nZionism gained a huge  momentum only after the holocaust and persecutions in the middle East.\nIt's always this narrative of that \"everybody coexisted and lived in harmony until the fire nation attacked\" are lies,you should look into the Pre partition violence that ensued from both sides.\n\nYou can absolutely vouch for Palestinian state without denying Jewish people's right to exist and to have a state.\nPeace is only an option if and when both states agree unanimously and gave up their lust from drawing blood.",
        "Hate speech? Noise..stick to Coc .",
        "You should scribble off Bharat from your passport. This will show these RWs. Please do it.  /s",
        "I'm aware of the religious history and significance of Israel for Abrahamic religions. \n\nAre you implying that Jews were not the inhabitants of the land called Israel and Palestine today ? \n\nReligion and history are not mutually exclusive. Just cause something is mentioned in Bible or Torah, doesn't mean it's fiction or false.",
        "I might have to considering where everything is headed /s",
        " If I cared about Internet points girly, then I would have just thought you to be the regular ignoramus and moved on with life.\n\nPeople express their agreement or disagreement with me through down votes and the like. It's their right as is mine.\n\nYou first claim I don't know anything beyond my language. Pray tell me what is my first language?\nSecondly you changed your comment about Germany to some Devanagari form after I corrected you about why it's called Deutschland.\n\nThirdly, you've not acknowledged any of the previous official names of other countries and the historical links to those names.\n\nI said I will call India Bharat when speaking in a Devanagari language but it will never replace \"India\" for me because that is the name that unified this country from North to South.",
        "I was wrong there are 22 offical languages. Also Idk why you keep referring to union, USA nahi hai (we're not US). Dominion of India was a british territory till 1950, since then we have been the REPUBLIC of India, not the union. Union of india may have 2 languages but it doesn't exist. \n\nDownvote me bhakts, won't make hindi any more official than bangla or assamese or punjabi or gujrati or kannada. 22 official languages accoriding to the current constitution, agar supreme leader ne change kiya hai toh bataiye, altho I don't think he'd like that you're saying gujrati isn't an officially recognized language. (22 official languages unless the constitution was changed otherwise)\n\nAnd you have just proven that reading and comprehension mei farak kya hota hai. Read karna toh seekh liya, samajhna bhi seekh le aaloo. (There's a difference between reading an comprehension, potato needs to learn comprehension) \n\nP.s Gyan baantne se pehle gyan hona zaruri hai IT Cell. (cannot educate others, if we are illiterate ourselves)",
        "REPUBLIC OF INDIA.",
        "But the problem is that, if you want to dispute their claim you have to go to them and prove to them that their claim is false. So often what happens is that they are the criminal and they are the judge.",
        "By 1920s, about 20% were Jewish. That is when the similar riots and killing you start to see in British India between Hindus and Muslims start to happen in British Palestine. That went to around 40% by end of WW2. By then, there was a strong demand for Jewish State. The amnosity betweeh Jewish groups and the Non jewish groups was too much. Terrorism was a daily occurence and most of the times, British troops were being targetted by both Jewish groups and Palestinian groups. British had no way of dealing with this violence so they left this matter to newly formed UN. \n\nUN followed the same method that was going to happen to British India. Partition plan was accepted by the Jewish groups while the Palestinian groups did not accept that. UN went ahead cause majority of the countries voted for it.\n\nTBH, if you were living in that time, even neutral perspective would say Partition is best. What the Arab states did after by declaring war was literally hitting themselves in the foot. You could say it was Karma.",
        "Part I of the constitution is literally titled “THE UNION AND ITS TERRITORY”. What are you so mad about?",
        "No. You can go to local police and file a case or file a case in court. I remember similar dispute in Bangalore went against waqf.",
        "That was because all the Arab states kicked all the Jews out and also how is this comment relevant for the post?",
        "Why people like you are dangerous for India.",
        "I am not arguing with this wall of text when the basic premise is wrong. Read the first article of the Part XVII of the constitution.",
        "You original comment said \"forcing narrative from religious book\" and called Jews \"settlers from Europe\". Both are historically wrong. Now instead of changing the narrative, why don't you stop this misinformation and accept your mistakes.",
        "Agreed that makes no sense. The article is trash and pushing an agenda where better arguments can be made against the waqf stuff. I was responding mostly to the comment that provides a slanted view of the Israel/Palestine issue and can mislead people.",
        "What are you even talking about? Straight up falsehoods to suit your narrative, here is a video explaining [things](https://youtu.be/T0b8Nz31u-0?si=UfSzKC96aEaRDTlp).\nI am interested in your claim of police and courts having authority to decide. Give sources for your claims.",
        "Of course it's a problem..and it's the govts job to ensure it doesn't happen. \n\nThese issues don't spring up out of thin air you know..",
        "It is not about internet points. After getting so brutally downvoted you should atleast self-reflect and think, may be what you said was utterly stupid - “don’t use Bharat in English alphabets”.\n\nYou claim to know 4 languages — and as example you wrote phrases from there in English Alphabets — beating the very point of your original comment. Why didn’t you choose the respective scripts of Marathi, Tamil, Hindi and Malayali to express the same?\n\nBut you have a problem when Bharat is written in English alphabets? \n\nNow coming to etymology of the words.\nFirstly, this is off topic discussion but still since you brought it up.. \nyou accept India as a name but not Bharat because you think it doesn’t represent this country’s history as a whole? \nWell, how is Sindhu river related to Tamil Nadu or Kerala or MH or Northeast for that matter? Even the word India doesn’t make any sense to portray the diversity of this land. \nSo you should also have a problem with the word India then? Why just with Bharat? \n\nAnd for the last time, it was selected as an alternate name in constitution (1950) - article 1",
        "This is a trash article. And indian ppl dont understand what waqf board is. Its an govt body. Bjp folks are so brainwashed at this point, its scary.",
        "He is not indian.",
        "I mean you did make a simplistic claim that they were European settlers that came from outside the area. I can agree that most Zionist leaders were European but that is to be expected since europe was more ahead in terms of education/economic factors. \n\nAnd for the record, i am in favor of two states and against the occupation. i don't agree with the reasoning in the article at all.",
        "There was exactly a national identity before British take over the land. Arabs revolt was the manifestation of Arabs nationalism under Ottoman rule. Arabs agree to revolts and assist the Entente as long as the Arabs land get liberated from the Ottoman.\n\nWhen the war is done, the Entente betrayed their Arabs allies, turned Arabs lands into a mandate, and split their lands with artificial borders.",
        "Oh you are right. I was under the wrong impression as the idag ground case was adjudicated by high court as well Supreme Court.\n\nTo your point of tribunal of being both judge and jury. That’s not correct. State govts nominate members to wakf tribunal.",
        "Because it's ... ridiculously complicated to type out each word laboriously in their native scripts.\n\nI am a Malayali Tamizh (Google Pallakad) who was brought up in Mumbai and Pune. I think that's enough for me to claim knowledge of all 4 languages.\n\nThe River Sindh references a geographical peninsula below it. It's rooted in history and not partial mythology.\n\nIf we were a monoculture I would happily accept it but it is not.\n\nLike that I shouldn't call myself a Hindu and call myself the new flavour of the decade. What is it, Sanatani? Lol\n\nBharat varsh refers to the kingdom of Kuru which references a legendary king in the Mahabharata.\n\nThe Kurus also were a tribe that won the Battle of the 10 Kings and settled in the Gangetic plain. So not representative of the land.",
        "Sanghis are down voting me for the most part.Sorry but I can't be bothered if brain dead zealots didn't agree with me.",
        "Why is this downvoted? Firstpost is owned by Ambani and so on and so forth.",
        "Again peddling misinformation. The Nakaba is the Palestinian word for the outcome of the 1948 war with Israel. What happened was a combination of things. Many Arabs (there were no Palestinians then) left in their own accord either out of fear  (60,000 left Jaffa for example) or because they were encouraged to by surrounding Arab nations who did not want them to get in the way of  their invading armies. Others were forced out because they fought against the Jews (for example the villages on the approach to Jerusalem)  of because their presence i certain area was seen as a threat to the  new state of Israel (the area around Lod and Ramle). ArBs who did not fight and were not seen as a threat were left alone which is why today 20% of Israel’s population is Arab. Not to mention the1929 Hebron massacre and the 15 year ongoing conflict of hatred and killing Jews by the Arabs. Palestinians unfortunately did not like the fact that Jews fled to the holy land. All the pro Palestinians say that Muslims and Jews lived happily together before nakhba and nakhba was a  colonization. Well, it was not.\n\nThe  reality is that unethical things happen during war, that is almost  self-evident because of the nature of war itself. Some were forced out of their homes by the Jewish armies, some left because of orders from  the incoming Arab armies, and some left because war was imminent and  people generally don't want to be caught in the middle of a war zone.  The ones who didn't flee were allowed to stay and today they are the  Arab-Israelis.\n\nA lot of people  think that this event makes Israel a state that is based on injustice,  If that were true then virtually every state is based on injustice. This  quote sums it up better than I ever could.\n\n\"The Jews are a peculiar people: things permitted to other nations are forbidden to the Jews.\n\nOther nations drive out thousands, even millions of people and there is no  refugee problem. Russia did it, Poland and Czechoslovakia did it. Turkey  drove out a million Greeks and Algeria a million Frenchman. Indonesia  threw out heaven knows how many Chinese—and no one says a word about  refugees.\n\nBut in the case of  Israel, the displaced Arabs have become eternal refugees. Everyone  insists that Israel must take back every single Arab. Arnold Toynbee  calls the displacement of the Arabs an atrocity greater than any committed by the Nazis.\n\nOther nations when victorious on the battlefield dictate peace terms. But when  Israel is victorious, it must sue for peace.\n\nName me a country formed in the last century and I will guarantee you that  there was some injustice. Look at the violence even today that is done  in the name of establishing an independent Kurdistan, does that mean the Kurds don't have the right to self-determination and nationhood? Of course not.\n\nThe Arab countries(forced UN) kept there status as refuges with minimum condition to use them as a tool in the Arab Israeli conflict.",
        "Here is the historical account of media publications.\n\n    “Every effort is being made by the Jews to persuade the Arab populace to stay and carry on with their normal lives, to get their shops and businesses open and to be assured that their lives and interests will be safe.” -- Haifa District HQ of the British Police, April 26, 1948. \n\n“The fact that there are  these refugees is the direct consequence of the act of the Arab states  in opposing partition and the Jewish state. The Arab states agreed upon  this policy unanimously and they must share in the solution of the  problem.” – Emile Ghoury, secretary of the Palestinian Arab Higher  Committee, in an interview with the Beirut Telegraph September 6, 1948.\n\n“The  most potent factor \\[in the flight of Palestinians\\] was the  announcements made over the air by the Arab-Palestinian Higher  Executive, urging all Haifa Arabs to quit... It was clearly intimated  that Arabs who remained in Haifa and accepted Jewish protection would be  regarded as renegades.” -- London Economist October 2, 1948\n\n“It  must not be forgotten that the Arab Higher Committee encouraged the  refugees’ flight from their homes in Jaffa, Haifa, and Jerusalem”. --  Near East Arabic Broadcasting Station, Cyprus, April 3, 1949.\n\n“The  Arabs of Haifa fled in spite of the fact that the Jewish authorities  guaranteed their safety and rights as citizens of Israel.”- Monsignor  George Hakim, Greek Catholic Bishop of Galilee, New York Herald Tribune,  June 30, 1949\n\n“The military and  civil (Israeli) authorities expressed their profound regret at this  grave decision (taken by the Arab military delegates of Haifa and the  Acting Chair of the Palestine Arab Higher Committee to evacuate Haifa  despite the Israeli offer of a truce). The Jewish mayor of Haifa made a  passionate appeal to the delegation (of Arab military leaders) to  reconsider its decision.” -- Memorandum of the Arab National Committee  of Haifa, 1950, to the governments of the Arab League, quoted in J. B.  Schechtman, The Refugees in the World, NY 1963, pp. 192f.\n\nSir  John Troutbeck, British Middle East Office in Cairo, noted in cables to  superiors (1948-49) that the refugees (in Gaza) have no bitterness  against Jews, but harbor intense hatred toward Egyptians: “They say ‘we  know who our enemies are (referring to the Egyptians)’, declaring that  their Arab brethren persuaded them unnecessarily to leave their homes…I  even heard it said that many of the refugees would give a welcome to the  Israelis if they were to come in and take the district over.”\n\n“The  Arab states which had encouraged the Palestine Arabs to leave their  homes temporarily in order to be out of the way of the Arab invasion  armies, have failed to keep their promise to help these refugees.” – The  Jordanian daily newspaper Falastin, February 19, 1949.\n\n    “The Secretary General of the Arab League, Azzam Pasha, assured the Arab peoples that the occupation of Palestine and of Tel Aviv would be as simple as a military promenade...Brotherly advice was given to the Arabs of Palestine to leave their land, homes, and property to stay temporarily In neighboring fraternal states, lest the guns of invading Arab armies mow them down.” --Al Hoda, a New York-based Lebanese daily, June 8, 1951. \n\n“Who brought the  Palestinians to Lebanon as refugees, suffering now from the malign  attitude of newspapers and communal leaders, who have neither honor nor  conscience? Who brought them over in dire straits and penniless, after  they lost their honor? The Arab states, and Lebanon amongst them, did  it.” -- The Beirut Muslim weekly Kul-Shay, August 19, 1951.\n\n“We  will smash the country with our guns and obliterate every place the  Jews seek shelter in. The Arabs should conduct their wives and children  to safe areas until the fighting has died down.” -- Iraqi Prime Minister  Nuri Said, quoted in Sir An-Nakbah (“The Secret Behind the Disaster”)  by Nimr el-Hawari, Nazareth, 1952\n\n“The  Arab Exodus …was not caused by the actual battle, but by the  exaggerated description spread by the Arab leaders to incite them to  fight the Jews. …For the flight and fall of the other villages it is our  leaders who are responsible because of their dissemination of rumors  exaggerating Jewish crimes and describing them as atrocities in order to  inflame the Arabs ... By spreading rumors of Jewish atrocities,  killings of women and children etc., they instilled fear and terror in  the hearts of the Arabs in Palestine, until they fled leaving their  homes and properties to the enemy.” – The Jordanian daily newspaper Al  Urdun, April 9, 1953.\n\n“As early as  the first months of 1948, the Arab League issued orders exhorting the  people to seek a temporary refuge in neighboring countries, later to  return to their abodes ... and obtain their share of abandoned Jewish  property.” -- Bulletin of The Research Group for European Migration  Problems, 1957.\n\n“Israelis argue  that the Arab states encouraged the Palestinians to flee. And, in fact,  Arabs still living in Israel recall being urged to evacuate Haifa by  Arab military commanders who wanted to bomb the city.” -- Newsweek,  January 20, 1963.\n\n“The 15th May,  1948, arrived ... On that day the mufti of Jerusalem appealed to the  Arabs of Palestine to leave the country, because the Arab armies were  about to enter and fight in their stead.” -- The Cairo daily Akhbar el  Yom, October 12, 1963.\n\nIn listing  the reasons for the Arab failure in 1948, Khaled alAzm (Syrian Prime  Minister) notes that “…the fifth factor was the call by the Arab  governments to the inhabitants of Palestine to evacuate it (Palestine)  and leave for the bordering Arab countries. Since 1948, it is we who  have demanded the return of the refugees, while it is we who made them  leave. We brought disaster upon a million Arab refugees by inviting them  and bringing pressure on them to leave. We have accustomed them to  begging...we have participated in lowering their morale and social  level...Then we exploited them in executing crimes of murder, arson and  throwing stones upon men, women and children...all this in the service  of political purposes...” -- Khaled elAzm, Syrian prime minister after  the 1948 War, in his 1972 memoirs, published in 1973.\n\n“Abu Mazen Charges that the Arab States Are the Cause of the Palestinian Refugee Problem” (Wall Street Journal; June 5, 2003)",
        "Ok. I see what you are saying about the history of words and that’s why I said etymology is a different topic. Sure the word “Bharat” doesn’t represent the history of the Southern States. India is more of an apt word for this nation if we look at it geography wise. But then, Bharat was also accepted over the years and is now part of a more recent history. As I grew up in South India, Mahabharata was always there in our culture, telling you from my experience of studying in southern schools. My grandparents also narrated stories from it to us, as kids. And, the inclusion of it in article 1 makes it official. I am sure, there were representatives from all across the nation when that happened. \n\nBut your point about only using Devanagari to type that word is what I don’t agree with. Any word can be written in any script.",
        "Yes it is technically a separate entity",
        "You can always tell an article's bias if they call India \"Bharat\"—our country already has a name, thanks",
        "Good article, but using Bharat instead of India already shows who the article was written for.",
        "Ah yes \"india today explaining waqf act\" Surely this will be a completely unbiased report! /s",
        "I dont disagree that there was a pan arab identity but we are talking specifically of a Palestinian identify and arabs did gain independent nation states like Lebanon, Syria, Egypt and moracco. Also, jordan was in control of the west bank till 1967 and there wasn't a resistance against the jordanians which is what we would expect if there was a strong national identity rather than a religious identity.",
        "They were not expelled. The Israelis brought the land from wealthy arabs and the peasant arabs are the ones who are still fighting for Palestine.",
        "They are saying that the justification for  the creation for a separate state for zionists comes from this holy book bullshit. Ironically if u dig deep enough you will find that you only find this in the bible and not the torah. Nowhere in the torah is this demand for separate zionist state mentioned. Iirc it comes from the old Testament where a separate homeland for jews is created and when the \"time\" Yk the return of Christ or whatever, then all the jews would be annihilated. Jews were and still are inhabitants of middle East. The zionists are not jews, not native at least. They come from the dregs of European colonial dream. ",
        "Wow you do live under a rock. It doesn't matter anyway",
        "Bharat has been the official name since forever? Matter of fact so is hindustan. The way you frame your point almost makes it like calling india bharat is a dirty word, our country has multiple names, many of whom are officially recognised and adopted.",
        "People are worried about waqf board being biased about important decisions when the entire government of India is openly biased lol.",
        ">almost makes it like calling india bharat is a dirty word\n\nI said nothing of the kind lmao. Where are you pulling this from?",
        "Correct. It was put in place by a government.",
        "Most of them were from Europe tho. How does that not stand? The problem was they way they kept expanding and pushing away the population",
        "Yes because they were escaping persecution in Europe (something something moustache man) and also have religious/historical ties to place. Historically,  coerciveness is contested but they did buy land in the area before moving there and not through conquest. The comparison with settler colonialism doesn't work since it wasn't for resources and they didn't have a place to go back to. \n\nAlso, I don't believe natives have unlimited rights to a piece of land just because their ancestors were born in the area. Human history is a history of migration and nation states were spreading all over the world in the 20th century. Jews were better organised politically and had better leadership.\n\nRegarding expansion, isn't all the territory won during defensive wars?. Settlements are bad but they are on occupied territory so i wouldn't classify it as expansion. Still pretty bad for the long term peace prospects so i agree with you there",
        "I am sure your opinion would differ if you were the one asked to leave your house and migrate. I personally find the idea of country based on religion very problematic. It is also not an incident that happened in void. Gaza was controlled by Israel to an extent that they could not prosper or have stability. West Bank is full of settlers from all around the world. I too believe in two state solution. But one can’t just claim Israel has a full right to the land because Europeans did them wrong.",
        "Again, the Mahabharata is a work of fiction. There is no proof that it ever happened. The same way the Odyssey was a work fiction. \n\nHinduism is practiced all across the country lol, hence you learnt about it because you were born a Hindu.\n\nMy southern identity means a lot to me. Who are you to tell me I should not take pride in it? I take as much pride in being  Maharashtrian as I do being a Tamizhan. WE are one country when its convenient but Hindu Muslim in other times. The South has a history far different from the North. Different cultures and different mindsets. India is the equivalent of Europe in terms of diversity. Do not be facetious.",
        " Do you even read the whole comment? \nI said it is pretty much throughout India - the title of that epic Poem contains the word “Bharath” — don’t divert from the topic. How would Mahabharat exist without Bharat?\n\nAlso, it was called “Bharath Varsham” in southern states too. When did I say don’t take pride in your origins? You do assume a lot.\n\nWe are one country always . It’s only people like you who try their best to underline the differences. Your whole personality is about categorising people as Hindu Muslim or North South — you cannot see beyond that. I didn’t even bring up Hindu Muslim and neither was this post about it. But even here you made sure to call it out.\n\nYou may be from two states. I am from whole of India. In which ever state I travel to or stay, I only find amazing people. \nOfcourse the cultural diversity is the beauty of this country. It’s not a bad thing. And Europe is a continent, in case you didn’t know that. \n\nWhat we don’t need in this country is hate mongers like you.",
        "Lol... IN TERMS OF DIVERSITY INDIA IS MORE DIVERSE THAN EUROPE. \n\nMy god you have zero comprehension skills. Time to disengage. You're clueless if you think I'm hate mongering. \n\nWe have never been a single country up until now lady. You don't know your history. Accept you don't know your Indian history and move on.\n\nTHE MAHABHARATA IS AN EPIC. THERE IS NO PROOF THAT IT HAPPENED. MY GOD.",
        "So you didn’t say Rabindranath Tagore is from\nnorth? You didn’t say that Bharath should not be written in English alphabets (like that’s a big problem)? Your whole comment started with this one stupid point alone. And now that I am saying how the word “Bharath”  has always been in use both in South & North equally - you find my history wrong. Thats only because it doesn’t suit your flawed narrative. You did mention in your comments above how you think so some North guy wrote the national anthem — you don’t even know that he’s from West Bengal and you are preaching others? \nYou brought up Hindu Muslim in a post which isn’t even about it. \nAnd now you are even stealing my comment and throwing it back at me - like the comprehension part. Yeah sure 👍🏼 \n\nAnd yes, you should have disengaged a long time back.",
        "The analogy doesn't work as my house is under the protection of the state and in case of dispute i can reach the relevant authority that can mediate the dispute. At minimum property rights cannot be secured without the state. Also, i lean on rights being socially instituted rather than inalienable magic coming from god or some higher power (natural rights). \n\nIsrael being founded on religion vs procedurally operating on discrimination are different things. Israel functions as a democratic secular state with equal rights for its citizens while same cannot be claimed for other states in the region. I mean we also had partitions on religious lines and people were dividing the border based on ethnic/religious lines at that time. Not everyplace can be like the multicultural US which is an anomaly in a sense and there is growing backlash against immigration there too.\n\nRegarding the military occupation, i agree with you that controlling the area prevents growth and it is bad overall  for long term peace prospects. But there is a chicken/egg problem here since israel says it does it in response to violence. Intifada was pretty bloody and there is a continuous barrage of rockets from gaza so it is not an imagined threat. The cycle of violence forces both sides away. national security is the primary function of a state so it cannot simply be compromised on."
    ],
    "cleaned_text": "waqf act could dangerous bharats future must go firstpost apparently waqf act allows claim land act civil court ",
    "cleaned_title": "waqf act could dangerous bharats future must go firstpost",
    "cleaned_selftext": "apparently waqf act allows claim land act civil court",
    "cleaned_comments": "following without going many details good good omg waqf misinformation end already waqf govt controlled body working aegis whatever govt power repository lands job protect waqf lands obviously claim lands stolen encroached mukesh ambanis house built stolen waqf lands many others charitable trust barely allowed charity politicians want keep looting rw desperately trying malign connected muslims typical distraction techniques meanwhile rwers raping looting rioting noone supposed notice maybe rw get obsessed education child malnutrition something actually matters rathar constantly trying steal others bharats future fuck india unless want use thats okay use india gon na type english alphabet ek toh youre sharing rw trash firstpost right wing trash eh last checked dont write name devnagri script fellow nonindians different heres great article reading bout httpswwwlogicallyfactscomenfactcheckfalsenowaqfboardscannotclaimandacquirejustanyprivateorpublicpropertyhttpswwwlogicallyfactscomenfactcheckfalsenowaqfboardscannotclaimandacquirejustanyprivateorpublicproperty xb true owner legal evidence prove property related waqf board still claims property lawsuit filed civil court xb land claimed without informing owner land afterwhich owner summoned civil court determine whether property falls regulation board possesses document legal evidence property declared waqf past issue notice current owner owner required appear waqf tribunal functions civil court waqfrelated disputes xb pose challenge illegally built structures like madrassa surat fall waqfs protection theoretically yes things dont work per law india say dear bhartiya sanghi rats infiltrated sub subtle imposition indias name name used rw rats plain see ill call bharat speaking hindi article shared rw publication indian yup looks like sanghi rats mullu rats sangh rats ill choose later anyday latter youre one anyway yes lots temples also waqf lands legally illegaly alot financiers village strongman temples built waqf land os claim said land surprising im sure done religious structures govt land well temple jeweller financed friends land land grab land friend muslim cant go land millionaire jeweler makes communal issue paltu bjp goons fucking clusterfuck india right bjps chutiya moves give cover goons like happened another family friends property hindu claimed temple family temple built bit walled entire area laws meant serve purpose political class babu class keeps misusing doesnt mean dont serve purpose people problem waqf board return lands descendants people donated land would bankrupt govt govts stealing lands decades compensations would astronomical even govt rates top smoll smooth brained bigots whos understanding waqf mooslims bad aapki chaddi ka rang khaaki hai right bharat dangerous india article doesnt suit interestsnews source rw logic lol days ahead yall also term nyt rw propaganda also opinion piece writer might rw doesnt make whole publisher rw lol one take article seriously literally fact israel created something years ago land previously known palestine people lived expelled live areas like gaza west bank trying force narrative coming religion book ignoring fact actually settler came europe nakba settle peoples land crazy amount misinformation exactly entire reasoning blind faith without documentary proof waqf board cant lay claim propertyhttpslawstreetcojudiciarywithoutdocumentaryproofwaqfboardcantlayclaimoveranyproperty wtf bharat nation passport says india fuckwit bharat bharat name ages nothing right left wing like deutschland another name germany accurately described literate muslim stupid cant even read indian constitution call jambodweepam usage forced part sanghi narrative bharat selected alternate name article constitution abhijit majumder must getting paid really well articles repeated usage bharat english forced first foremost india passport says republic india followed calling country deutschland equivalent calling allegmagne trying force narrative coming religion book care elaborate fact passport even currency calls india tells enforced like make sound term bharat used alternatively anywhere else like used article article indian constitution name territory union india bharat shall union states states territories thereof shall specified first schedule territory india shall comprise territories states b union territories specified first schedule c territories may acquired admission establishment new states read actual constitution whatsapp forward deutschland means land germans bharat comes name supposed tribes northern india spread vedicism picture shared original constitution madeup one shared part clause realise constitution single page right actual official government site learn read even seen indian passport even passport says india bharat wanking dark idk kind passport dude mine clearly says bharat ganrajya along republic india yeah says republic india bharat dont try spin topic better apologize everyone dont spew bullshit facts also says right thats hindisanskrit im writing replies english hence india propaganda ass wouldnt able see umhmm whats point saying people born living land named bharat whats wrong word india given us british problem using whats issue bharat forced alternate name sure whats even making agitate name know people home city dumb lack cognitive thinking mind numbing true punekar fashion must asleep pm civics class english utilization name forced forced ever since farce g english india devanagari bharatbecause northern dominated politics agree term historical basis used identify diverse nation problem cant read official languages union waqf board encroaching illegally occupying land absolutely problem swear fuckwits making fool lmao guy thinks preamble constitution thats preamble according religious books like bible judaism originated land palestine land considered holy land many different religions including christians also land jesus born meant word wasnt given us anybody muppet word comes river indus anglicized version indica greeks gave name post alexanders campaign eventually adopted culture land became kingdom kushan hindu kush comes grecobactrian kingdom followed vedicism point last years country ever united framework places called mewarchittorgarh etc name given us british fucking lol called british came also says bharat ganarajya constitution also says even constitution languages english bharat mentioned india misinformation says guy without historical insight time second kingdom judea meaning hasmonean kings bc bc division different tribes anymore fortiori werent time roman occupation last time real tribe division judea israel would around bc bc long time ago people divided division wasnt tribal division rather politicaltheological division largest line division pro anti roman people living kingdom judea people ruling last jewish kings hasmonean dynasty roman conquest bc put thrones king herod jews didnt sovereignty land occupied still present important note jews living judea back solid jewish community babylonia stayed first exile time language spoken jews isnt hebrew arameic hebrew language religious context successive revolts romans things changed jerusalem temple destroyed first revolt jews fled jerusalem many fled country join jewish community babylonia remained last great revolt judea led bar korba brought much casualty romans decided exile jews judea spread roman empire remained judea lot people joined jewish community babylonia majority deported pretty much everywhere western europe important note romans renamed judea palestina jerusalem aelia capitolina erase connection jewish people jews poland arrived much later history jewish population settled france germany along rhine crusades crusaders way holy land would commit massacres jewish communities communities fled east ended poland russia thats eve holocaust around million jews poland jews europe also north africa spain expelling jews arab world america eastern asia australia still always small jewish communities palestine wherever went jews persecuted romans christians sent away places inhabited massacres pogroms conspiracy theories invented us justify persecution deicide people ritual crime accusations fucking protocols elders zion many wherever went never peace never considered full citizens countries lived take example france french revolution gave status full citizens jews end third republic assimilated french society became often indistinguishable rest france yet antisemitism didnt stop dreyfus affair french officer accused traitor giving military information germany even though proof actually innocent jewish affair lasted years divided french society even dreyfus completely exhonorated many french people kept considering guilty perfect example jews apatride malicious people aimed control world dreyfus affair jewish austrian journalist theodore hertzl sent cover events assimilated jew believed assimilation answer antisemitism france shocked screams death jews general antisemitism became convinced real solution antisemitism jewish people self determination land wrote book jewish state started zionist movement movement organized got support rich jewish figures like rothschild bought land palestine create jewish villages parallel great pogroms massacres eastern europe yemen pushed jews immigrate mass palestine successive waves great debates palestine chosen homeland jewish people historically culturally land link time palestine hands ottoman empire political effort made convince agreeing jewish homeland palestine unsuccessfully wwi british empire took control palestine declared favorable installation jewish homeland palestine angered arabs living massacres british started trying play sides nazism arrived power germany many jews tried take refuge palestine british authorities drastically limited immigration time country accepted jewish refugees immigration become clandestine wont insult telling story wwii holocaust know six million jews killed thousands survivors left place go still pogroms holocaust moreover newly founded united nations recognized right self determination collective human right un voted share palestine jewish state arab state jerusalem international city jews accepted arabs refused british left palestine jews declared independence state israel egypt jordan lebanon syria iraq attacked israel israel took control israel jordan took control west bank course story im going stop think answers questions far remain available dont bother another whatsapp graduate look modus operandi shares pictures without actual official document baking others refute actual links proof official site try spin topic block move propagandists whatsapp forward generation exactly derived sindhu river anglicised colonisers use term anglicised automatically tells wasnt always called india called bharat hindustan alhind jamboodweep many names eventually india theres wrong using official documents india bharat used sure whats big deal preamble entire constitution moron calm frustrated think every person dumb muppet people usually think way smart word written different scripts english words represented devnagri vice versa thats languages people read script comfortable read official languages far leftist reading issue calling fact doesnt make strong palestinian national identity came response arab israel wars mandate ottoman empire national identity th century also always jewish population area approx k jews moved israel majority muslim nations due heightened tensions also note nation state th century european phenomenon facilitated state mandated education mass literacy mass media demand sovereignty natural cultural achievement root word geographical basis nippon means land rising sun zhongguo name china warring states period archaeological proof exists hell england literally name angles invaded displaced brittons wales cornwall egypt called egypt arabic called misr even egypt greek roots stem reference god ptah names archeological geographical valid historical basis want ideological name one shared country sodun dya good day flex ask bharath dont care someones ignorance goes show cant even decent talk without resorting use personal jibes sleeping etc slurs like dumb muppet fuck strong argument wouldnt use whole agitation pointless also punekar assume lot hope find wisdom grow ever sang national anthem jana gana mana adhinayak jaya bharat bhagya vidhata much projecting shut fuck also sing punjaba sindha gujarata maratha dravida utkala banga song written great revolutionary north go ill refute yes post rpune fun understand word projecting soz need remedial comprehension classes would really great job high pay writting fact looks good read comment cant read official languages union either matter comment particularly lil fat potato cant read languages hypocritical bitch someone knowing hindi still align author article saying portraying palestinians trying take land belongs israel infact places like gaza formed arabs displaced became israel nowhere else go author saying dont want mini gazas india need remove law even mean firstly wasnt exactly north west bengal let tell east india seems like everything state north poem song written one person one person place right matter hes bengali marathi punjabi hes wrote conviction utmost love respect nation shows biased prejudiced whole personality one ignorant indians absolute hate people statescities people dont speak language thats none business ignorant like thinking everyone speaks hindi everyone official language last checked people dont speak hindification official languages union english hindi read guess talking scheduled languages irrelevant context one denies jewish population less multi cultural religion got converted ethno state cant claim people already trying take land god speak indian languages fluently working knowledge names live delusion name india british one dont even know countrys history mala marathi yete ani ani bolate ennaku tamil pessamudiyum enniku malayalam ariyam hindi mai toh bindaas baat kar sakta hoon im last person accused liking another language seeing cover linguistic variety country languages im writing words conviction rules laws etymology okay madam sorry might want post rhistory learn countrys history rw trash simple way proved point picked land self determine country coz historic cultural connections still land others houses forced evacuate eventually long take cherry pick wikipedia good sir didnt know history enough would also using slurs chose tell facts fact bharat accepted alternate name country part article constitution read civics along history frustrated downvotes first comment really trying ignore happened naqba caused land previously owned british ottomanstheir palestinian king fact jewish king thereat least person final authority yes naqba terrible tragedy prevented neighboring arab nations didnt attacked firstbut justify israel never avoidable agree un partition plan lived would jews suddenly idea move israel persecuted everywhere prime example holocaustmost land barren sparsely populated anyway zionism gained huge momentum holocaust persecutions middle east always narrative everybody coexisted lived harmony fire nation attacked liesyou look pre partition violence ensued sides absolutely vouch palestinian state without denying jewish peoples right exist state peace option states agree unanimously gave lust drawing blood hate speech noisestick coc scribble bharat passport show rws please im aware religious history significance israel abrahamic religions implying jews inhabitants land called israel palestine today religion history mutually exclusive cause something mentioned bible torah doesnt mean fiction false might considering everything headed cared internet points girly would thought regular ignoramus moved life people express agreement disagreement votes like right mine first claim dont know anything beyond language pray tell first language secondly changed comment germany devanagari form corrected called deutschland thirdly youve acknowledged previous official names countries historical links names said call india bharat speaking devanagari language never replace india name unified country north south wrong offical languages also idk keep referring union usa nahi hai us dominion india british territory till since republic india union union india may languages doesnt exist downvote bhakts wont make hindi official bangla assamese punjabi gujrati kannada official languages accoriding current constitution agar supreme leader ne change kiya hai toh bataiye altho dont think hed like youre saying gujrati isnt officially recognized language official languages unless constitution changed otherwise proven reading comprehension mei farak kya hota hai read karna toh seekh liya samajhna bhi seekh le aaloo theres difference reading comprehension potato needs learn comprehension ps gyan baantne se pehle gyan hona zaruri hai cell educate others illiterate republic india problem want dispute claim go prove claim false often happens criminal judge jewish similar riots killing start see british india hindus muslims start happen british palestine went around end ww strong demand jewish state amnosity betweeh jewish groups non jewish groups much terrorism daily occurence times british troops targetted jewish groups palestinian groups british way dealing violence left matter newly formed un un followed method going happen british india partition plan accepted jewish groups palestinian groups accept un went ahead cause majority countries voted tbh living time even neutral perspective would say partition best arab states declaring war literally hitting foot could say karma part constitution literally titled union territory mad go local police file case file case court remember similar dispute bangalore went waqf arab states kicked jews also comment relevant post people like dangerous india arguing wall text basic premise wrong read first article part xvii constitution original comment said forcing narrative religious book called jews settlers europe historically wrong instead changing narrative dont stop misinformation accept mistakes agreed makes sense article trash pushing agenda better arguments made waqf stuff responding mostly comment provides slanted view israelpalestine issue mislead people even talking straight falsehoods suit narrative video explaining thingshttpsyoutubetbnzusiufszkcaeardtlp interested claim police courts authority decide give sources claims course problemand govts job ensure doesnt happen issues dont spring thin air know internet points getting brutally downvoted atleast selfreflect think may said utterly stupid dont use bharat english alphabets claim know languages example wrote phrases english alphabets beating point original comment didnt choose respective scripts marathi tamil hindi malayali express problem bharat written english alphabets coming etymology words firstly topic discussion still since brought accept india name bharat think doesnt represent countrys history whole well sindhu river related tamil nadu kerala mh northeast matter even word india doesnt make sense portray diversity land also problem word india bharat last time selected alternate name constitution article trash article indian ppl dont understand waqf board govt body bjp folks brainwashed point scary indian mean make simplistic claim european settlers came outside area agree zionist leaders european expected since europe ahead terms educationeconomic factors record favor two states occupation dont agree reasoning article exactly national identity british take land arabs revolt manifestation arabs nationalism ottoman rule arabs agree revolts assist entente long arabs land get liberated ottoman war done entente betrayed arabs allies turned arabs lands mandate split lands artificial borders oh right wrong impression idag ground case adjudicated high court well supreme court point tribunal judge jury thats correct state govts nominate members wakf tribunal ridiculously complicated type word laboriously native scripts malayali tamizh google pallakad brought mumbai pune think thats enough claim knowledge languages river sindh references geographical peninsula rooted history partial mythology monoculture would happily accept like shouldnt call hindu call new flavour decade sanatani lol bharat varsh refers kingdom kuru references legendary king mahabharata kurus also tribe battle kings settled gangetic plain representative land sanghis voting partsorry cant bothered brain dead zealots didnt agree downvoted firstpost owned ambani forth peddling misinformation nakaba palestinian word outcome war israel happened combination things many arabs palestinians left accord either fear left jaffa example encouraged surrounding arab nations want get way invading armies others forced fought jews example villages approach jerusalem presence certain area seen threat new state israel area around lod ramle arbs fight seen threat left alone today israels population arab mention hebron massacre year ongoing conflict hatred killing jews arabs palestinians unfortunately like fact jews fled holy land pro palestinians say muslims jews lived happily together nakhba nakhba colonization well reality unethical things happen war almost selfevident nature war forced homes jewish armies left orders incoming arab armies left war imminent people generally dont want caught middle war zone ones didnt flee allowed stay today arabisraelis lot people think event makes israel state based injustice true virtually every state based injustice quote sums better ever could jews peculiar people things permitted nations forbidden jews nations drive thousands even millions people refugee problem russia poland czechoslovakia turkey drove million greeks algeria million frenchman indonesia threw heaven knows many chineseand one says word refugees case israel displaced arabs become eternal refugees everyone insists israel must take back every single arab arnold toynbee calls displacement arabs atrocity greater committed nazis nations victorious battlefield dictate peace terms israel victorious must sue peace name country formed last century guarantee injustice look violence even today done name establishing independent kurdistan mean kurds dont right selfdetermination nationhood course arab countriesforced un kept status refuges minimum condition use tool arab israeli conflict historical account media publications every effort made jews persuade arab populace stay carry normal lives get shops businesses open assured lives interests safe haifa district hq british police april fact refugees direct consequence act arab states opposing partition jewish state arab states agreed upon policy unanimously must share solution problem emile ghoury secretary palestinian arab higher committee interview beirut telegraph september potent factor flight palestinians announcements made air arabpalestinian higher executive urging haifa arabs quit clearly intimated arabs remained haifa accepted jewish protection would regarded renegades london economist october must forgotten arab higher committee encouraged refugees flight homes jaffa haifa jerusalem near east arabic broadcasting station cyprus april arabs haifa fled spite fact jewish authorities guaranteed safety rights citizens israel monsignor george hakim greek catholic bishop galilee new york herald tribune june military civil israeli authorities expressed profound regret grave decision taken arab military delegates haifa acting chair palestine arab higher committee evacuate haifa despite israeli offer truce jewish mayor haifa made passionate appeal delegation arab military leaders reconsider decision memorandum arab national committee haifa governments arab league quoted j b schechtman refugees world ny pp f sir john troutbeck british middle east office cairo noted cables superiors refugees gaza bitterness jews harbor intense hatred toward egyptians say know enemies referring egyptians declaring arab brethren persuaded unnecessarily leave homesi even heard said many refugees would give welcome israelis come take district arab states encouraged palestine arabs leave homes temporarily order way arab invasion armies failed keep promise help refugees jordanian daily newspaper falastin february secretary general arab league azzam pasha assured arab peoples occupation palestine tel aviv would simple military promenadebrotherly advice given arabs palestine leave land homes property stay temporarily neighboring fraternal states lest guns invading arab armies mow al hoda new yorkbased lebanese daily june brought palestinians lebanon refugees suffering malign attitude newspapers communal leaders neither honor conscience brought dire straits penniless lost honor arab states lebanon amongst beirut muslim weekly kulshay august smash country guns obliterate every place jews seek shelter arabs conduct wives children safe areas fighting died iraqi prime minister nuri said quoted sir annakbah secret behind disaster nimr elhawari nazareth arab exodus caused actual battle exaggerated description spread arab leaders incite fight jews flight fall villages leaders responsible dissemination rumors exaggerating jewish crimes describing atrocities order inflame arabs spreading rumors jewish atrocities killings women children etc instilled fear terror hearts arabs palestine fled leaving homes properties enemy jordanian daily newspaper al urdun april early first months arab league issued orders exhorting people seek temporary refuge neighboring countries later return abodes obtain share abandoned jewish property bulletin research group european migration problems israelis argue arab states encouraged palestinians flee fact arabs still living israel recall urged evacuate haifa arab military commanders wanted bomb city newsweek january th may arrived day mufti jerusalem appealed arabs palestine leave country arab armies enter fight stead cairo daily akhbar el yom october listing reasons arab failure khaled alazm syrian prime minister notes fifth factor call arab governments inhabitants palestine evacuate palestine leave bordering arab countries since demanded return refugees made leave brought disaster upon million arab refugees inviting bringing pressure leave accustomed beggingwe participated lowering morale social levelthen exploited executing crimes murder arson throwing stones upon men women childrenall service political purposes khaled elazm syrian prime minister war memoirs published abu mazen charges arab states cause palestinian refugee problem wall street journal june ok see saying history words thats said etymology different topic sure word bharat doesnt represent history southern states india apt word nation look geography wise bharat also accepted years part recent history grew south india mahabharata always culture telling experience studying southern schools grandparents also narrated stories us kids inclusion article makes official sure representatives across nation happened point using devanagari type word dont agree word written script yes technically separate entity always tell articles bias call india bharatour country already name thanks good article using bharat instead india already shows article written ah yes india today explaining waqf act surely completely unbiased report dont disagree pan arab identity talking specifically palestinian identify arabs gain independent nation states like lebanon syria egypt moracco also jordan control west bank till wasnt resistance jordanians would expect strong national identity rather religious identity expelled israelis brought land wealthy arabs peasant arabs ones still fighting palestine saying justification creation separate state zionists comes holy book bullshit ironically u dig deep enough find find bible torah nowhere torah demand separate zionist state mentioned iirc comes old testament separate homeland jews created time yk return christ whatever jews would annihilated jews still inhabitants middle east zionists jews native least come dregs european colonial dream wow live rock doesnt matter anyway bharat official name since forever matter fact hindustan way frame point almost makes like calling india bharat dirty word country multiple names many officially recognised adopted people worried waqf board biased important decisions entire government india openly biased lol almost makes like calling india bharat dirty word said nothing kind lmao pulling correct put place government europe tho stand problem way kept expanding pushing away population yes escaping persecution europe something something moustache man also religioushistorical ties place historically coerciveness contested buy land area moving conquest comparison settler colonialism doesnt work since wasnt resources didnt place go back also dont believe natives unlimited rights piece land ancestors born area human history history migration nation states spreading world th century jews better organised politically better leadership regarding expansion isnt territory defensive wars settlements bad occupied territory wouldnt classify expansion still pretty bad long term peace prospects agree sure opinion would differ one asked leave house migrate personally find idea country based religion problematic also incident happened void gaza controlled israel extent could prosper stability west bank full settlers around world believe two state solution one cant claim israel full right land europeans wrong mahabharata work fiction proof ever happened way odyssey work fiction hinduism practiced across country lol hence learnt born hindu southern identity means lot tell take pride take much pride maharashtrian tamizhan one country convenient hindu muslim times south history far different north different cultures different mindsets india equivalent europe terms diversity facetious even read whole comment said pretty much throughout india title epic poem contains word bharath dont divert topic would mahabharat exist without bharat also called bharath varsham southern states say dont take pride origins assume lot one country always people like try best underline differences whole personality categorising people hindu muslim north south see beyond didnt even bring hindu muslim neither post even made sure call may two states whole india ever state travel stay find amazing people ofcourse cultural diversity beauty country bad thing europe continent case didnt know dont need country hate mongers like lol terms diversity india diverse europe god zero comprehension skills time disengage youre clueless think im hate mongering never single country lady dont know history accept dont know indian history move mahabharata epic proof happened god didnt say rabindranath tagore north didnt say bharath written english alphabets like thats big problem whole comment started one stupid point alone saying word bharath always use south north equally find history wrong thats doesnt suit flawed narrative mention comments think north guy wrote national anthem dont even know hes west bengal preaching others brought hindu muslim post isnt even even stealing comment throwing back like comprehension part yeah sure yes disengaged long time back analogy doesnt work house protection state case dispute reach relevant authority mediate dispute minimum property rights secured without state also lean rights socially instituted rather inalienable magic coming god higher power natural rights israel founded religion vs procedurally operating discrimination different things israel functions democratic secular state equal rights citizens claimed states region mean also partitions religious lines people dividing border based ethnicreligious lines time everyplace like multicultural us anomaly sense growing backlash immigration regarding military occupation agree controlling area prevents growth bad overall long term peace prospects chickenegg problem since israel says response violence intifada pretty bloody continuous barrage rockets gaza imagined threat cycle violence forces sides away national security primary function state simply compromised",
    "light_cleaned_title": "Why Waqf Act could be dangerous for Bharat’s future, and must go – Firstpost",
    "light_cleaned_selftext": "Apparently Waqf act allows them to claim any land as their own and act as civil court.",
    "light_cleaned_comments": "I am following this for a while now. Without going too many details, this is not good. Not good at all. Omg can this waqf misinformation end already.. Waqf is a Govt controlled body working under aegis of whatever Govt is in power.. It is a repository of lands and IT'S job is to protect waqf lands.. So it will obviously claim lands that have been stolen or encroached. Mukesh Ambanis house is built on stolen waqf lands as are so many others. It's a charitable trust which is barely allowed to do charity because politicians want to keep looting it. And now the rw is desperately trying to malign it because it's connected to Muslims.. Just as their typical distraction techniques.. Meanwhile rw'ers are raping, looting and rioting and NOONE IS SUPPOSED TO NOTICE. Maybe rw should get obsessed with education, child malnutrition or something that ACTUALLY MATTERS.. Rathar then constantly trying to steal from others. Bharat's future? Fuck off. It's India. Unless you want to use भारत , then that's okay. Use India if you are gonna type in the English alphabet. Ek toh you're sharing RW trash Firstpost is right wing trash. Eh? Last I checked I don’t write my name in Devnagri script for my fellow non-Indians. How is this different? Heres a great article for reading bout it: [https://www.logicallyfacts.com/en/fact-check/false-no-waqf-boards-cannot-claim-and-acquire-just-any-private-or-public-property](https://www.logicallyfacts.com/en/fact-check/false-no-waqf-boards-cannot-claim-and-acquire-just-any-private-or-public-property) &#x200B; But it is true that *\"If the owner has legal evidence of and can prove that the property is not related to waqf, and the board still claims the property, then a lawsuit can be filed against them in a civil court\"* &#x200B; and that the land can be claimed without informing the owner of the land, afterwhich the owner can be summoned to civil court *\"To determine whether a property falls under their regulation, If the board possesses any document or legal evidence that a property has been declared as waqf in the past, they will issue a notice to the current owner. The owner will then be required to appear before the Waqf Tribunal, which functions as a civil court for Waqf-related disputes.\"* &#x200B; But, this does pose a challenge for illegally built structures like that of a madrassa in Surat, which now fall under the waqf's protection. Theoretically yes, but things don't work as per law in India. As you say my dear Bhartiya Sanghi rats have infiltrated the sub The subtle imposition of India's other name. A name used by the Rw rats is plain to see. I'll call it \"bharat\" when speaking Hindi but the article shared here is from a RW publication. *Indian Yup and looks like the sanghi rats are here too. Mullu rats or sangh rats, I'll choose the later anyday Latter* you're one of them anyway. Yes lots of temples are also on waqf lands.. Both legally and ILLEGALY.. Alot of financiers and village strongman have temples built on waqf land os they can claim said land.. Why is this surprising. I'm sure it's done with other religious structures on govt land as well.. There is a temple that a jeweller financed on a friend's land.. So he can land grab the land.. Friend is muslim so they can't go on their own land because this millionaire jeweler makes it a communal issue with some paltu bjp Goons. It's a fucking clusterfuck in India right now.. And bjp's chutiya moves just give more cover for Goons like this. It happened to another family friends property but he was Hindu so he just claimed the temple as a family temple built it up a bit and walled off the entire area. These laws are meant to serve a purpose. Just because our political class and babu class keeps misusing them doesn't mean they don't serve a purpose. And if people have such a problem with a waqf board.. Just return the lands to the descendants of the people who donated the land.. Which would bankrupt our Govt because govts have been stealing these lands for decades.. So compensations would be astronomical even at Govt rates. On top of that we have Smoll smooth brained bigots who's understanding of waqf is mooslims = bad. Aapki chaddi ka rang khaaki hai!!!! Right. Why Bharat is dangerous for India. When the article doesn't suit your interests=News source is RW. What a logic lol. Days are ahead when y'all will also term NYT as RW propaganda. And, that was also an \"opinion\" piece. The writer might be RW, doesn't make the whole publisher RW, lol How can one take an article seriously when it is literally a fact that Israel was created something about 70 years ago in the land previously known as Palestine and people who lived there were expelled out to live into areas like Gaza and West Bank. Trying to force a narrative coming from religion book but ignoring the fact that who is actually a settler that came from Europe and did a Nakba to settle on other people’s land is crazy amount of misinformation. exactly. their entire reasoning is blind faith. [Without documentary proof, Waqf Board can't lay claim over any property'](https://lawstreet.co/judiciary/without-documentary-proof-waqf-board-cant-lay-claim-over-any-property) Wtf is bharat ? Our Nation. Your passport Says India fuckwit not Bharat Bharat has been a name for ages . It has nothing to do with right or left wing . Just like Deutschland is another name of Germany. Accurately described. Most literate muslim stupid you cant even once read Indian constitution Why not call it Jambodweepam? This usage is forced and a part of the sanghi narrative Because “Bharat” was selected as an alternate name in 1950s - Article 1 of constitution. Abhijit Majumder must be getting paid really well for these articles. Again, the repeated usage of Bharat in English is forced. We are first and foremost India. My passport says : \" Republic of India\" followed by भारत गणराज्य। It's not the same as calling it country Deutschland but more the equivalent of calling it Allegmagne. “Trying to force a narrative coming from religion book” - care to elaborate this ? The fact that your passport and even our currency calls it India tells that it is not being enforced like you make it sound. The term Bharat can be used alternatively anywhere else, like it is used here in the article above. Article 1 of the Indian constitution Name and territory of the Union.—(1) India, that is Bharat, shall be a Union of States. 1[(2) The States and the territories thereof shall be as specified in the First Schedule.] (3) The territory of India shall comprise— (a) the territories of the States; 2[(b) the Union territories specified in the First Schedule; and] (c) such other territories as may be acquired. 2. Admission or establishment of new States. Read the actual constitution not some whatsapp forward. Deutschland means Land of the Germans. Bharat comes from the name of some supposed tribes in Northern India that spread Vedicism. The picture I shared is the original constitution, not the made-up one you just shared Part 1, Clause 1. You do realise the constitution is not just the single page, right? This from actual official government site. Learn to read Have you even seen an Indian passport? Even your passport says India not Bharat. All of you are wanking in the dark Idk what kind of passport you have dude. Mine clearly says “Bharat Ganrajya” along with “Republic of India” Yeah it says \"Republic of India\" not Bharat Don't try to spin the topic now, better apologize to everyone or don't spew bullshit as facts. It also says भारत गणराज्य right above that. That's Hindi/Sanskrit ... I'm writing my replies in English hence India Your propaganda ass wouldn't able to see that Umhmm and what’s your point? You are saying some people born and living on this land named it “Bharat” — so what’s wrong with that? The word “India” was given to us by the British - if you have no problem using that what’s the issue with “Bharat” Again, it is not being forced. It is only an alternate name. Not sure what’s even making you agitate about? It’s just a name. I know people from my home city are dumb but the lack of cognitive thinking here is mind numbing. In true Punekar fashion you must have been asleep between 1 and 4pm in Civics class. The English utilization of the name is forced and has been forced ever since the farce that was g20. Again, in English we are India. In Devanagari, we are Bharat(because of northern dominated politics). I do not agree with a term that has no historical basis being used to identify a diverse nation such as ours. Not my problem you can’t read the official languages of the Union. And waqf board encroaching or illegally occupying land is absolutely not a problem. /s I swear these fuckwits are making a fool of themselves Lmao. This guy thinks the Preamble is all there is to the constitution. That's preamble According to religious books like Bible Judaism originated in land of Palestine. That land is considered holy land for many different religions including Christians, it is also the land where Jesus was born. Was it meant only for ……? No the word wasn't given to us by anybody you muppet. The word comes from the River Indus which and was anglicized version of Indica. The Greeks gave that name post Alexander's campaign and eventually adopted the culture of the land and became the Kingdom of Kushan. \"Hindu Kush\" comes from that Greco-Bactrian kingdom that followed Vedicism. At no point in the last 2000 years was this country ever a united framework. Some places were called Mewar,Chittorgarh etc. Name given to us by the British. Fucking lol. What was it called before the British came then? It also says \"Bharat ganarajya\" constitution also says that. And even in the constitution in languages other than English Bharat is mentioned before India. **\"Misinformation\"** says the guy without any historical insight. \"At the time of the second kingdom of Judea, meaning under the Hasmonean Kings (140 BC to 37 BC) there was no division in different tribes anymore (and so a fortiori there weren't at the time of the Roman occupation). The last time there was a real tribe division in Judea and Israel would be from around 900 BC to 586 BC. So a very long time ago. The people was divided but the division wasn't a tribal division but rather a political/theological division, the largest line of division being pro or anti Roman. They were not the only people living in the kingdom of Judea but they were the people ruling. The last Jewish Kings were the Hasmonean dynasty and after the Roman conquest in 37 BC they put on of their own on the thrones, King Herod. So from there Jews didn't have sovereignty on their land (it was occupied) but they were still present. Important note: not all Jews were living in Judea back then and there was a solid Jewish community in Babylonia, that stayed there after the first exile. At the time the language spoken by the Jews isn't Hebrew but Arameic. Hebrew is the language for the religious context only. After the successive revolts against the Romans, things changed. Jerusalem and the Temple were destroyed during the first revolt (66-73). Jews fled Jerusalem. Many fled the country to join the Jewish community in Babylonia, but most remained. The last great revolt of Judea led by Bar Korba (132-136) brought so much casualty to the Romans that they decided to exile the Jews from Judea and spread them into the Roman Empire. A few remained in Judea. Again, a lot of people joined the Jewish community in Babylonia, the majority was deported pretty much everywhere in Western Europe. Important to note: the Romans renamed Judea Palestina and Jerusalem Aelia Capitolina, to erase their connection to the Jewish people. The Jews in Poland arrived there much later in history. Jewish population had settled in France and Germany along the Rhine. During the crusades, the crusaders on their way to the Holy Land would commit massacres on the Jewish communities. Those communities fled east and ended up in Poland and Russia. That's why at the eve of the Holocaust there were around 3 million Jews in Poland. There were Jews in all of Europe, and also in North Africa (because Spain expelling all its Jews in 1492) and the Arab world, and in America, very few in Eastern Asia and Australia but still some... And there were always small Jewish communities in Palestine. Wherever they went, Jews were persecuted. By the Romans then by the Christians. They were sent away from the places they inhabited. There were massacres, there were pogroms. Conspiracy theories were invented against us to justify our persecution (deicide people, ritual crime accusations, the fucking Protocols of the Elders of Zion and so many more). Wherever they went not only were there never in peace but they were never considered to be full citizens of the countries where they lived. Take the example of France. The French revolution gave the status of full citizens to its Jews. From there and up until the end of the Third Republic, they assimilated into French society and became more often than not indistinguishable from the rest of France. Yet the antisemitism didn't stop. During the Dreyfus Affair, and French officer was accused of being a traitor and giving military information to Germany even though there was proof he was actually innocent, just because he was Jewish. The Affair lasted years and divided French society, and even after Dreyfus was completely exhonorated, many French people kept considering him guilty and the perfect example that Jews were an apatride, malicious people that aimed to control the world. During the Dreyfus Affair, a Jewish Austrian journalist, Theodore Hertzl, was sent to cover the events. He himself was a very assimilated Jew, who believed that assimilation was the answer to antisemitism. In France, he was shocked by the screams of \"death to Jews!\" and the general antisemitism. He became convinced that the real solution to antisemitism was for the Jewish people to have self determination on their own land. He wrote a book, the Jewish State, and started the Zionist movement. The movement organized, got support. Some very rich Jewish figures, like the Rothschild, bought land in Palestine to create Jewish villages. In parallel, great pogroms and massacres in Eastern Europe and Yemen pushed the Jews to immigrate in mass in Palestine in successive waves. After great debates, Palestine was chosen as the homeland of the Jewish people because it was historically and culturally the land we all had a link to. At the time Palestine was in the hands of the Ottoman Empire. So political effort was made to convince them of agreeing to a Jewish homeland in Palestine, unsuccessfully. In 1917 after WWI the British Empire took control of Palestine and declared themselves favorable to the installation of a Jewish homeland in Palestine. That angered the Arabs living there, there were massacres and the British started trying to play both sides. When Nazism arrived to power in Germany, many Jews tried to take refuge in Palestine but British authorities drastically limited immigration, at a time where no country accepted Jewish refugees. So the immigration had to become clandestine. I won't do you the insult of telling you the story of WWII and the Holocaust, you know that six million Jews were killed and thousands of survivors were left with no place to go (there were still pogroms after the Holocaust). Moreover, the newly founded United Nations recognized the right to self determination as a collective human right. In 1947 the UN voted to share Palestine between a Jewish State and an Arab State, with Jerusalem as an international city. The Jews accepted, the Arabs refused. When the British left Palestine in 1948, the Jews declared in Independence of the State of Israel and Egypt, Jordan, Lebanon, Syria and Iraq attacked Israel. Israel won. They took control of Israel, Jordan took control of the West Bank. There is of course more to the story but I'm going to stop there because I think it answers all your questions so far, and I remain available for more\" Don't bother with him he is just another whatsapp graduate, just look at his modus operandi, shares some pictures without the actual official document baking it. When others refute it with actual links proof from the official site then try to spin the topic, I just block and move from such propagandists. Whatsapp forward generation Exactly. It is derived from Sindhu river and was anglicised by the Colonisers. When you use the term anglicised - that automatically tells it wasn’t always called India. It was called Bharat, Hindustan, Al-Hind, Jamboodweep — it has had many names and eventually India. So there’s wrong in using any those . On official documents both India and Bharat are used . Not sure what’s such a big deal. The Preamble is not the entire Constitution, you moron. Calm down. Why are you so frustrated? You think every other person is dumb and a muppet but not you? People who usually think this way are not very smart themselves. A word can be written in different scripts . English words can be represented in Devnagri and vice versa. Thats what languages are for . So that people can read in the script they are comfortable in. Can you read all 21 official languages? That is far leftist reading of the issue and calling it a fact doesn't make it so. There was no strong Palestinian national identity before the 1960s which came as a response to arab israel wars. Before the mandate it was the ottoman empire so no national identity before the 20th century. Also, there was always jewish population in the area and approx 650k jews moved to Israel from majority muslim nations due to \"heightened tensions\". Also note that the nation state is a 19th century European phenomenon facilitated by state mandated education, mass literacy and mass media. Demand for sovereignty is not a natural but cultural achievement. The root word has geographical basis. \"Nippon\" means Land of the Rising Sun. \"ZhongGuo\" the name for China during the Warring States period - archaeological proof exists. Hell England is literally name after the Angles who invaded and displaced the Brittons to Wales and Cornwall. Egypt is called Egypt but in Arabic its called Misr. Even Egypt has Greek roots which stem from a reference to the God Ptah. Names should have archeological, geographical and valid historical basis. If you want an ideological name, it should be one shared by 100% of the country Sodun dya. Have a good day! I can 15. Flex. So why ask what bharath then? I don’t have to care for someone’s ignorance Goes on to show you can’t even have a decent talk without resorting to use personal jibes about sleeping between 1 to 4 etc , and slurs like “dumb”, “muppet” and “fuck” If you had a strong argument you wouldn’t have to use all that. Your whole agitation is pointless. Also I am not a Punekar. You assume a lot. Hope you will find wisdom when you grow up. Have you ever sang our National Anthem? Jana Gana Mana Adhinayak Jaya He **Bharat** Bhagya vidhata How much are you projecting just shut the fuck up I also sing \" Punjaba Sindha Gujarata Maratha Dravida Utkala Banga\" Again a song written by a great revolutionary from the North. We can go on and on. I'll refute you. Yes so you just post on r/Pune for fun. If that is what you understand by the word projecting then soz you need remedial comprehension classes. Then that would be really an great job high pay for writting fact looks good to me When you can read all 21, then comment until then, you can't read the official languages of the union either. Nor can I for that matter. My comment was particularly for lil fat potato - if they can't read all 21 languages, it's hypocritical of them to bitch about someone not knowing hindi. This still does not align with what the author of the article saying. He is portraying Palestinians as trying to take over the land that belongs to Israel. When infact places like Gaza were formed because Arabs who were displaced from what became Israel had nowhere else to go . Author is saying if we don’t want mini Gazas in India we need to remove this law. What does that even mean? Firstly, he wasn’t exactly from North. He was from West Bengal (which let me tell you is in East of India). Seems like everything above your state is “North” for you. A poem or song can be written by only one person and that one person has to be from some place right? How does it matter if he’s Bengali or Marathi or Punjabi? He’s wrote it with conviction and with utmost love & respect for this nation. This shows how biased & prejudiced your whole personality is. You are one of those ignorant Indians who absolute hate people from other states/cities or people who don’t speak your language. That’s none of your business. Ignorant like you for thinking everyone speaks hindi when not everyone does. we have 21 official language last I checked and most people don't speak more than 2-3; why the hindification? There are only 2 official languages of the Union - English and Hindi, and I can read both. I guess you are talking about the scheduled languages, but that is irrelevant in this context. No one denies there was Jewish population it was less than 8% it was a multi cultural religion which got converted to an ethno state. But you can’t claim people who were already there are trying to take the land. My god.... I speak 4 Indian languages. 5. All of them fluently. You have no working knowledge of names and live under the delusion that the name India is a British one. You don't even know your own country's history. Mala Marathi yete Ani ani bolate. Ennaku Tamil Pessamudiyum. Enniku Malayalam ariyam Hindi Mai toh bindaas baat kar sakta hoon I'm the last person who can be accused of not liking another language seeing that I cover 60% of the linguistic variety of this country with the above languages. I'm writing my words with conviction in what the rules and laws of etymology are. Okay madam. Sorry, you might want to post on r/history to learn your own country's history. It's RW trash. Simple as. The way you proved my point. They picked a land to self determine as their country coz of “ historic “ and “cultural” connections. It was still a land where others had houses they were forced to evacuate eventually. How long did it take to cherry pick Wikipedia good sir? If I didn’t know the history enough, I would also be using slurs on you but I chose you tell you the facts. The fact is Bharat is an accepted alternate Name of this country - and it is part of Article 1 of our constitution (You can read some civics too, along with history). Again, why are you so frustrated? Is it because of all the downvotes on your first comment ? You really trying to ignore what happened before Naqba and what caused it? The land was previously owned by the British and before that the Ottomans.Their was no Palestinian king or for a fact a Jewish king there(at least a person of final authority) Yes Naqba is terrible tragedy it should have been prevented if neighboring Arab nations didn't attacked first.But does it justify what Israel did, never it should have been avoidable If they did agree to the UN partition plan and lived with it . Why would jews suddenly had the idea to move to Israel- because they were persecuted from everywhere the prime example being the holocaust.(Most of the land were barren and sparsely populated anyway.) Zionism gained a huge momentum only after the holocaust and persecutions in the middle East. It's always this narrative of that \"everybody coexisted and lived in harmony until the fire nation attacked\" are lies,you should look into the Pre partition violence that ensued from both sides. You can absolutely vouch for Palestinian state without denying Jewish people's right to exist and to have a state. Peace is only an option if and when both states agree unanimously and gave up their lust from drawing blood. Hate speech? Noise..stick to Coc . You should scribble off Bharat from your passport. This will show these RWs. Please do it. /s I'm aware of the religious history and significance of Israel for Abrahamic religions. Are you implying that Jews were not the inhabitants of the land called Israel and Palestine today ? Religion and history are not mutually exclusive. Just cause something is mentioned in Bible or Torah, doesn't mean it's fiction or false. I might have to considering where everything is headed /s If I cared about Internet points girly, then I would have just thought you to be the regular ignoramus and moved on with life. People express their agreement or disagreement with me through down votes and the like. It's their right as is mine. You first claim I don't know anything beyond my language. Pray tell me what is my first language? Secondly you changed your comment about Germany to some Devanagari form after I corrected you about why it's called Deutschland. Thirdly, you've not acknowledged any of the previous official names of other countries and the historical links to those names. I said I will call India Bharat when speaking in a Devanagari language but it will never replace \"India\" for me because that is the name that unified this country from North to South. I was wrong there are 22 offical languages. Also Idk why you keep referring to union, USA nahi hai (we're not US). Dominion of India was a british territory till 1950, since then we have been the REPUBLIC of India, not the union. Union of india may have 2 languages but it doesn't exist. Downvote me bhakts, won't make hindi any more official than bangla or assamese or punjabi or gujrati or kannada. 22 official languages accoriding to the current constitution, agar supreme leader ne change kiya hai toh bataiye, altho I don't think he'd like that you're saying gujrati isn't an officially recognized language. (22 official languages unless the constitution was changed otherwise) And you have just proven that reading and comprehension mei farak kya hota hai. Read karna toh seekh liya, samajhna bhi seekh le aaloo. (There's a difference between reading an comprehension, potato needs to learn comprehension) P.s Gyan baantne se pehle gyan hona zaruri hai IT Cell. (cannot educate others, if we are illiterate ourselves) REPUBLIC OF INDIA. But the problem is that, if you want to dispute their claim you have to go to them and prove to them that their claim is false. So often what happens is that they are the criminal and they are the judge. By 1920s, about 20% were Jewish. That is when the similar riots and killing you start to see in British India between Hindus and Muslims start to happen in British Palestine. That went to around 40% by end of WW2. By then, there was a strong demand for Jewish State. The amnosity betweeh Jewish groups and the Non jewish groups was too much. Terrorism was a daily occurence and most of the times, British troops were being targetted by both Jewish groups and Palestinian groups. British had no way of dealing with this violence so they left this matter to newly formed UN. UN followed the same method that was going to happen to British India. Partition plan was accepted by the Jewish groups while the Palestinian groups did not accept that. UN went ahead cause majority of the countries voted for it. TBH, if you were living in that time, even neutral perspective would say Partition is best. What the Arab states did after by declaring war was literally hitting themselves in the foot. You could say it was Karma. Part I of the constitution is literally titled “THE UNION AND ITS TERRITORY”. What are you so mad about? No. You can go to local police and file a case or file a case in court. I remember similar dispute in Bangalore went against waqf. That was because all the Arab states kicked all the Jews out and also how is this comment relevant for the post? Why people like you are dangerous for India. I am not arguing with this wall of text when the basic premise is wrong. Read the first article of the Part XVII of the constitution. You original comment said \"forcing narrative from religious book\" and called Jews \"settlers from Europe\". Both are historically wrong. Now instead of changing the narrative, why don't you stop this misinformation and accept your mistakes. Agreed that makes no sense. The article is trash and pushing an agenda where better arguments can be made against the waqf stuff. I was responding mostly to the comment that provides a slanted view of the Israel/Palestine issue and can mislead people. What are you even talking about? Straight up falsehoods to suit your narrative, here is a video explaining [things](https://youtu.be/T0b8Nz31u-0?si=UfSzKC96aEaRDTlp). I am interested in your claim of police and courts having authority to decide. Give sources for your claims. Of course it's a problem..and it's the govts job to ensure it doesn't happen. These issues don't spring up out of thin air you know.. It is not about internet points. After getting so brutally downvoted you should atleast self-reflect and think, may be what you said was utterly stupid - “don’t use Bharat in English alphabets”. You claim to know 4 languages — and as example you wrote phrases from there in English Alphabets — beating the very point of your original comment. Why didn’t you choose the respective scripts of Marathi, Tamil, Hindi and Malayali to express the same? But you have a problem when Bharat is written in English alphabets? Now coming to etymology of the words. Firstly, this is off topic discussion but still since you brought it up.. you accept India as a name but not Bharat because you think it doesn’t represent this country’s history as a whole? Well, how is Sindhu river related to Tamil Nadu or Kerala or MH or Northeast for that matter? Even the word India doesn’t make any sense to portray the diversity of this land. So you should also have a problem with the word India then? Why just with Bharat? And for the last time, it was selected as an alternate name in constitution (1950) - article 1 This is a trash article. And indian ppl dont understand what waqf board is. Its an govt body. Bjp folks are so brainwashed at this point, its scary. He is not indian. I mean you did make a simplistic claim that they were European settlers that came from outside the area. I can agree that most Zionist leaders were European but that is to be expected since europe was more ahead in terms of education/economic factors. And for the record, i am in favor of two states and against the occupation. i don't agree with the reasoning in the article at all. There was exactly a national identity before British take over the land. Arabs revolt was the manifestation of Arabs nationalism under Ottoman rule. Arabs agree to revolts and assist the Entente as long as the Arabs land get liberated from the Ottoman. When the war is done, the Entente betrayed their Arabs allies, turned Arabs lands into a mandate, and split their lands with artificial borders. Oh you are right. I was under the wrong impression as the idag ground case was adjudicated by high court as well Supreme Court. To your point of tribunal of being both judge and jury. That’s not correct. State govts nominate members to wakf tribunal. Because it's ... ridiculously complicated to type out each word laboriously in their native scripts. I am a Malayali Tamizh (Google Pallakad) who was brought up in Mumbai and Pune. I think that's enough for me to claim knowledge of all 4 languages. The River Sindh references a geographical peninsula below it. It's rooted in history and not partial mythology. If we were a monoculture I would happily accept it but it is not. Like that I shouldn't call myself a Hindu and call myself the new flavour of the decade. What is it, Sanatani? Lol Bharat varsh refers to the kingdom of Kuru which references a legendary king in the Mahabharata. The Kurus also were a tribe that won the Battle of the 10 Kings and settled in the Gangetic plain. So not representative of the land. Sanghis are down voting me for the most part.Sorry but I can't be bothered if brain dead zealots didn't agree with me. Why is this downvoted? Firstpost is owned by Ambani and so on and so forth. Again peddling misinformation. The Nakaba is the Palestinian word for the outcome of the 1948 war with Israel. What happened was a combination of things. Many Arabs (there were no Palestinians then) left in their own accord either out of fear (60,000 left Jaffa for example) or because they were encouraged to by surrounding Arab nations who did not want them to get in the way of their invading armies. Others were forced out because they fought against the Jews (for example the villages on the approach to Jerusalem) of because their presence i certain area was seen as a threat to the new state of Israel (the area around Lod and Ramle). ArBs who did not fight and were not seen as a threat were left alone which is why today 20% of Israel’s population is Arab. Not to mention the1929 Hebron massacre and the 15 year ongoing conflict of hatred and killing Jews by the Arabs. Palestinians unfortunately did not like the fact that Jews fled to the holy land. All the pro Palestinians say that Muslims and Jews lived happily together before nakhba and nakhba was a colonization. Well, it was not. The reality is that unethical things happen during war, that is almost self-evident because of the nature of war itself. Some were forced out of their homes by the Jewish armies, some left because of orders from the incoming Arab armies, and some left because war was imminent and people generally don't want to be caught in the middle of a war zone. The ones who didn't flee were allowed to stay and today they are the Arab-Israelis. A lot of people think that this event makes Israel a state that is based on injustice, If that were true then virtually every state is based on injustice. This quote sums it up better than I ever could. \"The Jews are a peculiar people: things permitted to other nations are forbidden to the Jews. Other nations drive out thousands, even millions of people and there is no refugee problem. Russia did it, Poland and Czechoslovakia did it. Turkey drove out a million Greeks and Algeria a million Frenchman. Indonesia threw out heaven knows how many Chinese—and no one says a word about refugees. But in the case of Israel, the displaced Arabs have become eternal refugees. Everyone insists that Israel must take back every single Arab. Arnold Toynbee calls the displacement of the Arabs an atrocity greater than any committed by the Nazis. Other nations when victorious on the battlefield dictate peace terms. But when Israel is victorious, it must sue for peace. Name me a country formed in the last century and I will guarantee you that there was some injustice. Look at the violence even today that is done in the name of establishing an independent Kurdistan, does that mean the Kurds don't have the right to self-determination and nationhood? Of course not. The Arab countries(forced UN) kept there status as refuges with minimum condition to use them as a tool in the Arab Israeli conflict. Here is the historical account of media publications. “Every effort is being made by the Jews to persuade the Arab populace to stay and carry on with their normal lives, to get their shops and businesses open and to be assured that their lives and interests will be safe.” -- Haifa District HQ of the British Police, April 26, 1948. “The fact that there are these refugees is the direct consequence of the act of the Arab states in opposing partition and the Jewish state. The Arab states agreed upon this policy unanimously and they must share in the solution of the problem.” – Emile Ghoury, secretary of the Palestinian Arab Higher Committee, in an interview with the Beirut Telegraph September 6, 1948. “The most potent factor \\[in the flight of Palestinians\\] was the announcements made over the air by the Arab-Palestinian Higher Executive, urging all Haifa Arabs to quit... It was clearly intimated that Arabs who remained in Haifa and accepted Jewish protection would be regarded as renegades.” -- London Economist October 2, 1948 “It must not be forgotten that the Arab Higher Committee encouraged the refugees’ flight from their homes in Jaffa, Haifa, and Jerusalem”. -- Near East Arabic Broadcasting Station, Cyprus, April 3, 1949. “The Arabs of Haifa fled in spite of the fact that the Jewish authorities guaranteed their safety and rights as citizens of Israel.”- Monsignor George Hakim, Greek Catholic Bishop of Galilee, New York Herald Tribune, June 30, 1949 “The military and civil (Israeli) authorities expressed their profound regret at this grave decision (taken by the Arab military delegates of Haifa and the Acting Chair of the Palestine Arab Higher Committee to evacuate Haifa despite the Israeli offer of a truce). The Jewish mayor of Haifa made a passionate appeal to the delegation (of Arab military leaders) to reconsider its decision.” -- Memorandum of the Arab National Committee of Haifa, 1950, to the governments of the Arab League, quoted in J. B. Schechtman, The Refugees in the World, NY 1963, pp. 192f. Sir John Troutbeck, British Middle East Office in Cairo, noted in cables to superiors (1948-49) that the refugees (in Gaza) have no bitterness against Jews, but harbor intense hatred toward Egyptians: “They say ‘we know who our enemies are (referring to the Egyptians)’, declaring that their Arab brethren persuaded them unnecessarily to leave their homes…I even heard it said that many of the refugees would give a welcome to the Israelis if they were to come in and take the district over.” “The Arab states which had encouraged the Palestine Arabs to leave their homes temporarily in order to be out of the way of the Arab invasion armies, have failed to keep their promise to help these refugees.” – The Jordanian daily newspaper Falastin, February 19, 1949. “The Secretary General of the Arab League, Azzam Pasha, assured the Arab peoples that the occupation of Palestine and of Tel Aviv would be as simple as a military promenade...Brotherly advice was given to the Arabs of Palestine to leave their land, homes, and property to stay temporarily In neighboring fraternal states, lest the guns of invading Arab armies mow them down.” --Al Hoda, a New York-based Lebanese daily, June 8, 1951. “Who brought the Palestinians to Lebanon as refugees, suffering now from the malign attitude of newspapers and communal leaders, who have neither honor nor conscience? Who brought them over in dire straits and penniless, after they lost their honor? The Arab states, and Lebanon amongst them, did it.” -- The Beirut Muslim weekly Kul-Shay, August 19, 1951. “We will smash the country with our guns and obliterate every place the Jews seek shelter in. The Arabs should conduct their wives and children to safe areas until the fighting has died down.” -- Iraqi Prime Minister Nuri Said, quoted in Sir An-Nakbah (“The Secret Behind the Disaster”) by Nimr el-Hawari, Nazareth, 1952 “The Arab Exodus …was not caused by the actual battle, but by the exaggerated description spread by the Arab leaders to incite them to fight the Jews. …For the flight and fall of the other villages it is our leaders who are responsible because of their dissemination of rumors exaggerating Jewish crimes and describing them as atrocities in order to inflame the Arabs ... By spreading rumors of Jewish atrocities, killings of women and children etc., they instilled fear and terror in the hearts of the Arabs in Palestine, until they fled leaving their homes and properties to the enemy.” – The Jordanian daily newspaper Al Urdun, April 9, 1953. “As early as the first months of 1948, the Arab League issued orders exhorting the people to seek a temporary refuge in neighboring countries, later to return to their abodes ... and obtain their share of abandoned Jewish property.” -- Bulletin of The Research Group for European Migration Problems, 1957. “Israelis argue that the Arab states encouraged the Palestinians to flee. And, in fact, Arabs still living in Israel recall being urged to evacuate Haifa by Arab military commanders who wanted to bomb the city.” -- Newsweek, January 20, 1963. “The 15th May, 1948, arrived ... On that day the mufti of Jerusalem appealed to the Arabs of Palestine to leave the country, because the Arab armies were about to enter and fight in their stead.” -- The Cairo daily Akhbar el Yom, October 12, 1963. In listing the reasons for the Arab failure in 1948, Khaled alAzm (Syrian Prime Minister) notes that “…the fifth factor was the call by the Arab governments to the inhabitants of Palestine to evacuate it (Palestine) and leave for the bordering Arab countries. Since 1948, it is we who have demanded the return of the refugees, while it is we who made them leave. We brought disaster upon a million Arab refugees by inviting them and bringing pressure on them to leave. We have accustomed them to begging...we have participated in lowering their morale and social level...Then we exploited them in executing crimes of murder, arson and throwing stones upon men, women and children...all this in the service of political purposes...” -- Khaled elAzm, Syrian prime minister after the 1948 War, in his 1972 memoirs, published in 1973. “Abu Mazen Charges that the Arab States Are the Cause of the Palestinian Refugee Problem” (Wall Street Journal; June 5, 2003) Ok. I see what you are saying about the history of words and that’s why I said etymology is a different topic. Sure the word “Bharat” doesn’t represent the history of the Southern States. India is more of an apt word for this nation if we look at it geography wise. But then, Bharat was also accepted over the years and is now part of a more recent history. As I grew up in South India, Mahabharata was always there in our culture, telling you from my experience of studying in southern schools. My grandparents also narrated stories from it to us, as kids. And, the inclusion of it in article 1 makes it official. I am sure, there were representatives from all across the nation when that happened. But your point about only using Devanagari to type that word is what I don’t agree with. Any word can be written in any script. Yes it is technically a separate entity You can always tell an article's bias if they call India \"Bharat\"—our country already has a name, thanks Good article, but using Bharat instead of India already shows who the article was written for. Ah yes \"india today explaining waqf act\" Surely this will be a completely unbiased report! /s I dont disagree that there was a pan arab identity but we are talking specifically of a Palestinian identify and arabs did gain independent nation states like Lebanon, Syria, Egypt and moracco. Also, jordan was in control of the west bank till 1967 and there wasn't a resistance against the jordanians which is what we would expect if there was a strong national identity rather than a religious identity. They were not expelled. The Israelis brought the land from wealthy arabs and the peasant arabs are the ones who are still fighting for Palestine. They are saying that the justification for the creation for a separate state for zionists comes from this holy book bullshit. Ironically if u dig deep enough you will find that you only find this in the bible and not the torah. Nowhere in the torah is this demand for separate zionist state mentioned. Iirc it comes from the old Testament where a separate homeland for jews is created and when the \"time\" Yk the return of Christ or whatever, then all the jews would be annihilated. Jews were and still are inhabitants of middle East. The zionists are not jews, not native at least. They come from the dregs of European colonial dream. Wow you do live under a rock. It doesn't matter anyway Bharat has been the official name since forever? Matter of fact so is hindustan. The way you frame your point almost makes it like calling india bharat is a dirty word, our country has multiple names, many of whom are officially recognised and adopted. People are worried about waqf board being biased about important decisions when the entire government of India is openly biased lol. >almost makes it like calling india bharat is a dirty word I said nothing of the kind lmao. Where are you pulling this from? Correct. It was put in place by a government. Most of them were from Europe tho. How does that not stand? The problem was they way they kept expanding and pushing away the population Yes because they were escaping persecution in Europe (something something moustache man) and also have religious/historical ties to place. Historically, coerciveness is contested but they did buy land in the area before moving there and not through conquest. The comparison with settler colonialism doesn't work since it wasn't for resources and they didn't have a place to go back to. Also, I don't believe natives have unlimited rights to a piece of land just because their ancestors were born in the area. Human history is a history of migration and nation states were spreading all over the world in the 20th century. Jews were better organised politically and had better leadership. Regarding expansion, isn't all the territory won during defensive wars?. Settlements are bad but they are on occupied territory so i wouldn't classify it as expansion. Still pretty bad for the long term peace prospects so i agree with you there I am sure your opinion would differ if you were the one asked to leave your house and migrate. I personally find the idea of country based on religion very problematic. It is also not an incident that happened in void. Gaza was controlled by Israel to an extent that they could not prosper or have stability. West Bank is full of settlers from all around the world. I too believe in two state solution. But one can’t just claim Israel has a full right to the land because Europeans did them wrong. Again, the Mahabharata is a work of fiction. There is no proof that it ever happened. The same way the Odyssey was a work fiction. Hinduism is practiced all across the country lol, hence you learnt about it because you were born a Hindu. My southern identity means a lot to me. Who are you to tell me I should not take pride in it? I take as much pride in being Maharashtrian as I do being a Tamizhan. WE are one country when its convenient but Hindu Muslim in other times. The South has a history far different from the North. Different cultures and different mindsets. India is the equivalent of Europe in terms of diversity. Do not be facetious. Do you even read the whole comment? I said it is pretty much throughout India - the title of that epic Poem contains the word “Bharath” — don’t divert from the topic. How would Mahabharat exist without Bharat? Also, it was called “Bharath Varsham” in southern states too. When did I say don’t take pride in your origins? You do assume a lot. We are one country always . It’s only people like you who try their best to underline the differences. Your whole personality is about categorising people as Hindu Muslim or North South — you cannot see beyond that. I didn’t even bring up Hindu Muslim and neither was this post about it. But even here you made sure to call it out. You may be from two states. I am from whole of India. In which ever state I travel to or stay, I only find amazing people. Ofcourse the cultural diversity is the beauty of this country. It’s not a bad thing. And Europe is a continent, in case you didn’t know that. What we don’t need in this country is hate mongers like you. Lol... IN TERMS OF DIVERSITY INDIA IS MORE DIVERSE THAN EUROPE. My god you have zero comprehension skills. Time to disengage. You're clueless if you think I'm hate mongering. We have never been a single country up until now lady. You don't know your history. Accept you don't know your Indian history and move on. THE MAHABHARATA IS AN EPIC. THERE IS NO PROOF THAT IT HAPPENED. MY GOD. So you didn’t say Rabindranath Tagore is from north? You didn’t say that Bharath should not be written in English alphabets (like that’s a big problem)? Your whole comment started with this one stupid point alone. And now that I am saying how the word “Bharath” has always been in use both in South & North equally - you find my history wrong. Thats only because it doesn’t suit your flawed narrative. You did mention in your comments above how you think so some North guy wrote the national anthem — you don’t even know that he’s from West Bengal and you are preaching others? You brought up Hindu Muslim in a post which isn’t even about it. And now you are even stealing my comment and throwing it back at me - like the comprehension part. Yeah sure 👍🏼 And yes, you should have disengaged a long time back. The analogy doesn't work as my house is under the protection of the state and in case of dispute i can reach the relevant authority that can mediate the dispute. At minimum property rights cannot be secured without the state. Also, i lean on rights being socially instituted rather than inalienable magic coming from god or some higher power (natural rights). Israel being founded on religion vs procedurally operating on discrimination are different things. Israel functions as a democratic secular state with equal rights for its citizens while same cannot be claimed for other states in the region. I mean we also had partitions on religious lines and people were dividing the border based on ethnic/religious lines at that time. Not everyplace can be like the multicultural US which is an anomaly in a sense and there is growing backlash against immigration there too. Regarding the military occupation, i agree with you that controlling the area prevents growth and it is bad overall for long term peace prospects. But there is a chicken/egg problem here since israel says it does it in response to violence. Intifada was pretty bloody and there is a continuous barrage of rockets from gaza so it is not an imagined threat. The cycle of violence forces both sides away. national security is the primary function of a state so it cannot simply be compromised on."
}