{
    "id": "m8wg55",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/m8wg55/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 47,
    "num_comments": 68,
    "created_utc": 1616203817,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Need recommendations on recent, good Indian movies - on Netflix, Amazon prime etc. Language not important as long as there are subtitles. Have not watched Indian based movies in a long time. \n\nNot interested in masala potboilers with big stars and songs and romantic movies.\n\nAny suggestions?",
        "\"Behind her eyes\" was good..",
        "I was looking for a show with some Fargo feel to it. Trapped (Icelandic TV series) on Netflix felt pretty good.",
        "Just finished watching Zack Snyder's Justice league , absolutely brilliant.Much deserving of a theatrical release  ☹️",
        "Check out the Valhalla murders , The Chalet nd Deadwind . Somewhat similar to Trapped",
        "You can watch Sir on Netflix if you haven’t already. It’s a decent flick.",
        "Nice, thanks for this suggestion. Will give this a go!",
        "+1 Had a few nitpicks about it but you could see that Zack had put his soul into it and it got gridded over by Wheadon",
        "Yup , the ending especially felt all over the the place  nd downbeat . But visually , everything was spectacular   . The Chapter cards , the longer battle sequence ( Steppenwolf and the Amazons ) , the Background score everything was brilliant .",
        "Its not recent, its called 'Mukti Bhavan' (Hotel Salvation). It is based on a father who believes his time has come, so he must visit varanasi for his last days except he takes his extremely busy son with him. I m not sure where exactly its streaming but here the trailer. I cannot stress enough how moving this movie is. It helps take a look at the big picture, at what life is and what it means, and acceptance of death.\n\nhttps://youtu.be/1A1Sp6-GcmI\n\nHere's my favourite critic- Mark Kermode on the movie spoiler free\n\nhttps://youtu.be/b9SBHiT2-xA\n\n\nAlso yes, fuck romance we have had an overdose of romatic love stories my god its overdone to death. Life has so much more to offer.",
        "CGI was still bad though. Overall a much better movie than the 2017 one.",
        "Currently binging Bosch! Very good Cop show with great characters and development.",
        "**The Falcon And The Winter Soldier**\n\n[](#s \"The opening sequence was mind blowing. Best I've seen since infinity war. I'd rank it my 2nd best fighting sequence in marvel movies. Hype for Baron Zemo\")",
        "Watching lupin on netflix. It's good.",
        "Should probably blame studio execs more than whedon. He did his job (not perfectly) but studio execs just wanted a DC version of avengers.",
        "Saw Broachurch Season 1, absolutely amazing! \n\nAnyone knows if S2 and S3 are worth watching?",
        "I watched lotr (I know i was too late). But it's not overrated or too idealistic. Also done with 3/4 of the first book, fellowship of the ring. Simultaneously read Violet Jessop's memoir, a titanic and world war one Survivor. Really epic and lucky life this lady lead. Watched Hustlers. Meh, rad music but inconsistent and repetitive. Also binged on Sonpari coz why not.",
        "I love Super V. Netflix should pick up the series.",
        "Falcon and Winter Soldier\n\nAlso there is a promising series OK Computer releasing on March 26 on hotstar \n[trailer ](https://youtu.be/KTMNI98YVBI)",
        "Have started watching Anime. Cowboy Bebop",
        "Finished watching the first 4 seasons of the hit Australian series 'Wentworth'. Really underrated series. Each episode keeps you on the edge of your seat with twists and turns happening every episode. Some of the best television I have ever watched. I advise everyone to give it a try.",
        "Mukti Bhawan is available on Mubi India",
        "Dersu Uzala, Nights of Cabiria, North by Northwest and ZSJL.",
        "JJBA next",
        "&gt; Also there is a promising series OK Computer releasing on March 26\n\nLooks heavily inspired by iRobot, pity they don't mention it and try to come off as an original",
        "True Detective season 1",
        "It’s different, trust me",
        "It might be, just talking about it being inspired by it. The 3 laws of robotics, a robot killing a person, such things were premise of iRobot.",
        "Your logic sounds like if a movie quotes 3rd law of Newton no other movie can quote 3rd law of Newton.\nIt’s literally a law of that particular field",
        "So this is a prison series. Co-incidentally searching wentworth on imdb, shows wentworth miller first.",
        "What a co-incidence, i also finished re-watching the trilogy yesterday.\n\n&gt;Also binged on Sonpari coz why not.\n\nBoner killer",
        "Amazing show. Good choice.",
        "Giovanni Ribsi is sooo underrated.",
        "There is this amazing podcast on spotify called Mission ISRO , it's about the beginning of India's space program and it's amazing . Would definitely recommend trying it out . And to make it even more better , it's narrated by harsha bhogle",
        "The 3 laws of robots was a fictional narrative devised by Asimov. The 3 laws of Newton is a scientific principal which defines the laws of physical nature. You can't compare fiction with real science. So your argument is moot.",
        "Vincenzo (Netflix)",
        "I want to watch it just for Olivia Colman. Brennant is an added bonus. Twin peaks vibes apparently. Does it have a supernatural element? If no, I'll give it a watch",
        "Ugly by Anurag Kashyap. 2015ish not sure if that counts as recent or not.\nArticle 15-True Detective vibes thanks to the cinematography.\nDeath in the Gunj-Prime.",
        "Thanks. I watched Mukti Bhawan and loved it.\n\n&gt;Also yes, fuck romance we have had an overdose of romatic love stories my god its overdone to death. Life has so much more to offer.\n\nDude. Dont even go there. If I see one more generic good looking girl walk in slow motion, I will lose it.",
        "Watched ugly. Thanks for the other recommendations. I will check them out.",
        "Thanks for the reco.",
        "Lol Yeah..In the Prison Break series, the protagonist name is Wentworth too",
        "I think the biggest strength for the show is it's actors and the setting (small England town where everyone knows everyone). \n\nAnd there's no supernatural element.\n\nAlso, it's leaving Netflix india on 31st March.",
        "&gt; lupin\n\nIt's a consistently good, no-nonsense cop show.",
        "Yup, definitely",
        "God there's so much to love about Mukti Bhavan. What I personally liked was that it felt like a homogenous continuous process from the start till the end. There was no eureka moment, no sudden drama that just changed their relationship overnight. It breathed. It felt alive and true. Small snippets between the duo here and there, and they werent all necessarily positive, but they all helped them knw each other, explore each other in a way ths duo had never tried, or experienced.\n\nAnother thing I noticed was how light the movie was considering the heaviness of the subject matter-death. It was hilarious. It never got melodramatic, you are not going to cry but it wasnt a disservice to death either. It did not mock, it laughed.",
        "Snyder Cut anyone? I felt it was a so much better than theatrical version. Only thing i felt is that the epilogue chapter could have been an after-credits thing. Now i am sad that the continuation of this particular timeline may never materialize.",
        "Palang tod caretaker",
        "Court, Kumbalangi Nights",
        "Just started with Naruto, hoping for it be as good as the reviews.",
        "currently reading rainbows, halos and glories by Robert G Greenler. pretty informative and easy to digest too.",
        "Reply 1988 K-drama is good. Especially for 80s born",
        "Watched both. Liked both of them a lot.",
        "I was thinking of starting The Wire. Has anyone here seen it? How is it?",
        "Enjoyed it thoroughly.\n\nIt shows power of the 'net where some dedicated fanboys made enough noise to make it happen.\n\nHoping to see him finish his arc. I know how it would have played out in the course of three movies but he overplayed his hand in BvS. It was a shitty movie by any standard. If he had done it well, things could have been waaay different and we would have been watching the final of the three movie JL arc.",
        "I found it great, it is a bit slow though but one of the best shows out there.",
        "And which shows are your favorite?",
        "I have seen too many but Wire, Person of Interest, House, Bosch are the ones I find good across all seasons.\n\nAlso liked Dexter, HIMYM, Modern Family, BBT but these became very drab towards the later seasons.",
        "It is a great show. You'll see why it's one of the best shows ever.",
        "Best show ever",
        "Rake on Netflix. \n\nIts like an Australian Californication but better.",
        "Hotstar as well..",
        "Detective Byomkesh Bakshy if you haven't watched it. Manorama 6 feet under. Shaitan.",
        "True... Martha! Martha??",
        "Ha ha! \n\nThat was the dumbest thing and prompted gazillion memes.\n\nThere were many other ways for Batman to know who Superman was. I mean he is world's best detective, duh! \n\nIn comics, Batman deducted Superman/ Clark Kent just by going through Martha's scrap book. Here he is depicted as such a dumbass as to never verify the background on Dupes whose life he is ready to take. \n\nThis is plain lazy and bad characterization.\n\nHe seems like comic book lex luthor who fails to acknowledge that a guy like Superman can choose to live as simple joe.\n\nAnyway, enough rant.\n\nNice to find another good DC enthusiast on Reddit.\n\nCiao."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "need recommendations recent good indian movies netflix amazon prime etc language important long subtitles watched indian based movies long time interested masala potboilers big stars songs romantic movies suggestions behind eyes good looking show fargo feel trapped icelandic tv series netflix felt pretty good finished watching zack snyders justice league absolutely brilliantmuch deserving theatrical release check valhalla murders chalet nd deadwind somewhat similar trapped watch sir netflix havent already decent flick nice thanks suggestion give go nitpicks could see zack put soul got gridded wheadon yup ending especially felt place nd downbeat visually everything spectacular chapter cards longer battle sequence steppenwolf amazons background score everything brilliant recent called mukti bhavan hotel salvation based father believes time come must visit varanasi last days except takes extremely busy son sure exactly streaming trailer stress enough moving movie helps take look big picture life means acceptance death heres favourite critic mark kermode movie spoiler free also yes fuck romance overdose romatic love stories god overdone death life much offer cgi still bad though overall much better movie one currently binging bosch good cop show great characters development falcon winter soldier opening sequence mind blowing best ive seen since infinity war id rank nd best fighting sequence marvel movies hype baron zemo watching lupin netflix good probably blame studio execs whedon job perfectly studio execs wanted dc version avengers saw broachurch season absolutely amazing anyone knows worth watching watched lotr know late overrated idealistic also done first book fellowship ring simultaneously read violet jessops memoir titanic world war one survivor really epic lucky life lady lead watched hustlers meh rad music inconsistent repetitive also binged sonpari coz love super v netflix pick series falcon winter soldier also promising series ok computer releasing march hotstar trailer httpsyoutubektmniyvbi started watching anime cowboy bebop finished watching first seasons hit australian series wentworth really underrated series episode keeps edge seat twists turns happening every episode best television ever watched advise everyone give try mukti bhawan available mubi india dersu uzala nights cabiria north northwest zsjl jjba next gt also promising series ok computer releasing march looks heavily inspired irobot pity dont mention try come original true detective season different trust might talking inspired laws robotics robot killing person things premise irobot logic sounds like movie quotes rd law newton movie quote rd law newton literally law particular field prison series coincidentally searching wentworth imdb shows wentworth miller first coincidence also finished rewatching trilogy yesterday gtalso binged sonpari coz boner killer amazing show good choice giovanni ribsi sooo underrated amazing podcast spotify called mission isro beginning indias space program amazing would definitely recommend trying make even better narrated harsha bhogle laws robots fictional narrative devised asimov laws newton scientific principal defines laws physical nature cant compare fiction real science argument moot vincenzo netflix want watch olivia colman brennant added bonus twin peaks vibes apparently supernatural element ill give watch ugly anurag kashyap ish sure counts recent article true detective vibes thanks cinematography death gunjprime thanks watched mukti bhawan loved gtalso yes fuck romance overdose romatic love stories god overdone death life much offer dude dont even go see one generic good looking girl walk slow motion lose watched ugly thanks recommendations check thanks reco lol yeahin prison break series protagonist name wentworth think biggest strength show actors setting small england town everyone knows everyone theres supernatural element also leaving netflix india st march gt lupin consistently good nononsense cop show yup definitely god theres much love mukti bhavan personally liked felt like homogenous continuous process start till end eureka moment sudden drama changed relationship overnight breathed felt alive true small snippets duo werent necessarily positive helped knw explore way ths duo never tried experienced another thing noticed light movie considering heaviness subject matterdeath hilarious never got melodramatic going cry wasnt disservice death either mock laughed snyder cut anyone felt much better theatrical version thing felt epilogue chapter could aftercredits thing sad continuation particular timeline may never materialize palang tod caretaker court kumbalangi nights started naruto hoping good reviews currently reading rainbows halos glories robert g greenler pretty informative easy digest reply kdrama good especially born watched liked lot thinking starting wire anyone seen enjoyed thoroughly shows power net dedicated fanboys made enough noise make happen hoping see finish arc know would played course three movies overplayed hand bvs shitty movie standard done well things could waaay different would watching final three movie jl arc found great bit slow though one best shows shows favorite seen many wire person interest house bosch ones find good across seasons also liked dexter himym modern family bbt became drab towards later seasons great show youll see one best shows ever best show ever rake netflix like australian californication better hotstar well detective byomkesh bakshy havent watched manorama feet shaitan true martha martha ha ha dumbest thing prompted gazillion memes many ways batman know superman mean worlds best detective duh comics batman deducted superman clark kent going marthas scrap book depicted dumbass never verify background dupes whose life ready take plain lazy bad characterization seems like comic book lex luthor fails acknowledge guy like superman choose live simple joe anyway enough rant nice find another good dc enthusiast reddit ciao",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Need recommendations on recent, good Indian movies - on Netflix, Amazon prime etc. Language not important as long as there are subtitles. Have not watched Indian based movies in a long time. Not interested in masala potboilers with big stars and songs and romantic movies. Any suggestions? \"Behind her eyes\" was good.. I was looking for a show with some Fargo feel to it. Trapped (Icelandic TV series) on Netflix felt pretty good. Just finished watching Zack Snyder's Justice league , absolutely brilliant.Much deserving of a theatrical release ☹️ Check out the Valhalla murders , The Chalet nd Deadwind . Somewhat similar to Trapped You can watch Sir on Netflix if you haven’t already. It’s a decent flick. Nice, thanks for this suggestion. Will give this a go! +1 Had a few nitpicks about it but you could see that Zack had put his soul into it and it got gridded over by Wheadon Yup , the ending especially felt all over the the place nd downbeat . But visually , everything was spectacular . The Chapter cards , the longer battle sequence ( Steppenwolf and the Amazons ) , the Background score everything was brilliant . Its not recent, its called 'Mukti Bhavan' (Hotel Salvation). It is based on a father who believes his time has come, so he must visit varanasi for his last days except he takes his extremely busy son with him. I m not sure where exactly its streaming but here the trailer. I cannot stress enough how moving this movie is. It helps take a look at the big picture, at what life is and what it means, and acceptance of death. Here's my favourite critic- Mark Kermode on the movie spoiler free Also yes, fuck romance we have had an overdose of romatic love stories my god its overdone to death. Life has so much more to offer. CGI was still bad though. Overall a much better movie than the 2017 one. Currently binging Bosch! Very good Cop show with great characters and development. **The Falcon And The Winter Soldier** [](#s \"The opening sequence was mind blowing. Best I've seen since infinity war. I'd rank it my 2nd best fighting sequence in marvel movies. Hype for Baron Zemo\") Watching lupin on netflix. It's good. Should probably blame studio execs more than whedon. He did his job (not perfectly) but studio execs just wanted a DC version of avengers. Saw Broachurch Season 1, absolutely amazing! Anyone knows if S2 and S3 are worth watching? I watched lotr (I know i was too late). But it's not overrated or too idealistic. Also done with 3/4 of the first book, fellowship of the ring. Simultaneously read Violet Jessop's memoir, a titanic and world war one Survivor. Really epic and lucky life this lady lead. Watched Hustlers. Meh, rad music but inconsistent and repetitive. Also binged on Sonpari coz why not. I love Super V. Netflix should pick up the series. Falcon and Winter Soldier Also there is a promising series OK Computer releasing on March 26 on hotstar [trailer ](https://youtu.be/KTMNI98YVBI) Have started watching Anime. Cowboy Bebop Finished watching the first 4 seasons of the hit Australian series 'Wentworth'. Really underrated series. Each episode keeps you on the edge of your seat with twists and turns happening every episode. Some of the best television I have ever watched. I advise everyone to give it a try. Mukti Bhawan is available on Mubi India Dersu Uzala, Nights of Cabiria, North by Northwest and ZSJL. JJBA next &gt; Also there is a promising series OK Computer releasing on March 26 Looks heavily inspired by iRobot, pity they don't mention it and try to come off as an original True Detective season 1 It’s different, trust me It might be, just talking about it being inspired by it. The 3 laws of robotics, a robot killing a person, such things were premise of iRobot. Your logic sounds like if a movie quotes 3rd law of Newton no other movie can quote 3rd law of Newton. It’s literally a law of that particular field So this is a prison series. Co-incidentally searching wentworth on imdb, shows wentworth miller first. What a co-incidence, i also finished re-watching the trilogy yesterday. &gt;Also binged on Sonpari coz why not. Boner killer Amazing show. Good choice. Giovanni Ribsi is sooo underrated. There is this amazing podcast on spotify called Mission ISRO , it's about the beginning of India's space program and it's amazing . Would definitely recommend trying it out . And to make it even more better , it's narrated by harsha bhogle The 3 laws of robots was a fictional narrative devised by Asimov. The 3 laws of Newton is a scientific principal which defines the laws of physical nature. You can't compare fiction with real science. So your argument is moot. Vincenzo (Netflix) I want to watch it just for Olivia Colman. Brennant is an added bonus. Twin peaks vibes apparently. Does it have a supernatural element? If no, I'll give it a watch Ugly by Anurag Kashyap. 2015ish not sure if that counts as recent or not. Article 15-True Detective vibes thanks to the cinematography. Death in the Gunj-Prime. Thanks. I watched Mukti Bhawan and loved it. &gt;Also yes, fuck romance we have had an overdose of romatic love stories my god its overdone to death. Life has so much more to offer. Dude. Dont even go there. If I see one more generic good looking girl walk in slow motion, I will lose it. Watched ugly. Thanks for the other recommendations. I will check them out. Thanks for the reco. Lol Yeah..In the Prison Break series, the protagonist name is Wentworth too I think the biggest strength for the show is it's actors and the setting (small England town where everyone knows everyone). And there's no supernatural element. Also, it's leaving Netflix india on 31st March. &gt; lupin It's a consistently good, no-nonsense cop show. Yup, definitely God there's so much to love about Mukti Bhavan. What I personally liked was that it felt like a homogenous continuous process from the start till the end. There was no eureka moment, no sudden drama that just changed their relationship overnight. It breathed. It felt alive and true. Small snippets between the duo here and there, and they werent all necessarily positive, but they all helped them knw each other, explore each other in a way ths duo had never tried, or experienced. Another thing I noticed was how light the movie was considering the heaviness of the subject matter-death. It was hilarious. It never got melodramatic, you are not going to cry but it wasnt a disservice to death either. It did not mock, it laughed. Snyder Cut anyone? I felt it was a so much better than theatrical version. Only thing i felt is that the epilogue chapter could have been an after-credits thing. Now i am sad that the continuation of this particular timeline may never materialize. Palang tod caretaker Court, Kumbalangi Nights Just started with Naruto, hoping for it be as good as the reviews. currently reading rainbows, halos and glories by Robert G Greenler. pretty informative and easy to digest too. Reply 1988 K-drama is good. Especially for 80s born Watched both. Liked both of them a lot. I was thinking of starting The Wire. Has anyone here seen it? How is it? Enjoyed it thoroughly. It shows power of the 'net where some dedicated fanboys made enough noise to make it happen. Hoping to see him finish his arc. I know how it would have played out in the course of three movies but he overplayed his hand in BvS. It was a shitty movie by any standard. If he had done it well, things could have been waaay different and we would have been watching the final of the three movie JL arc. I found it great, it is a bit slow though but one of the best shows out there. And which shows are your favorite? I have seen too many but Wire, Person of Interest, House, Bosch are the ones I find good across all seasons. Also liked Dexter, HIMYM, Modern Family, BBT but these became very drab towards the later seasons. It is a great show. You'll see why it's one of the best shows ever. Best show ever Rake on Netflix. Its like an Australian Californication but better. Hotstar as well.. Detective Byomkesh Bakshy if you haven't watched it. Manorama 6 feet under. Shaitan. True... Martha! Martha?? Ha ha! That was the dumbest thing and prompted gazillion memes. There were many other ways for Batman to know who Superman was. I mean he is world's best detective, duh! In comics, Batman deducted Superman/ Clark Kent just by going through Martha's scrap book. Here he is depicted as such a dumbass as to never verify the background on Dupes whose life he is ready to take. This is plain lazy and bad characterization. He seems like comic book lex luthor who fails to acknowledge that a guy like Superman can choose to live as simple joe. Anyway, enough rant. Nice to find another good DC enthusiast on Reddit. Ciao."
}