{
    "id": "1btyg6c",
    "title": "Gujarat HC restrains Google from deleting account blocked over ‘explicit content’",
    "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-hc-restrains-google-from-deleting-account-blocked-over-explicit-content-9246970/",
    "selftext": "The Gujarat High Court on Tuesday came to the rescue of a 24-year-old engineer who has been locked out of his Google account as it was flagged for “explicit content” after he uploaded a photo that showed him being given a bath by his grandmother when he was two.",
    "flair": "Law & Courts",
    "score": 64,
    "num_comments": 4,
    "created_utc": 1712063683.0,
    "convurl": "https://external-preview.redd.it/GA8m4rdVeUOOThRsh0wYw3Qfcih6IuO6BkBjQbiKei8.jpg?auto=webp&s=80f19d7a3ee92374cfcbc89d15749ddef7a18ac4",
    "comments": [
        "Someone please send this to Louis Rossmann...",
        "These companies pretend to belong to the cloud and drop customers, business partners, employees etc at each breath. This is the only way to avoid a one sided relationship with them.",
        "Exactly. Even reddit for that matter; it's super easy for your IP to get banned; you just need to piss a mod off.",
        "I haven't read Google Drive's ToS but isn't this a breach of privacy? Google being able to run its algorithms on private data stored on users' accounts seems like a big issue."
    ],
    "cleaned_text": "gujarat hc restrains google deleting account blocked explicit content gujarat high court tuesday came rescue yearold engineer locked google account flagged explicit content uploaded photo showed given bath grandmother two ",
    "cleaned_title": "gujarat hc restrains google deleting account blocked explicit content",
    "cleaned_selftext": "gujarat high court tuesday came rescue yearold engineer locked google account flagged explicit content uploaded photo showed given bath grandmother two",
    "cleaned_comments": "someone please send louis rossmann companies pretend belong cloud drop customers business partners employees etc breath way avoid one sided relationship exactly even reddit matter super easy ip get banned need piss mod havent read google drives tos isnt breach privacy google able run algorithms private data stored users accounts seems like big issue",
    "light_cleaned_title": "Gujarat HC restrains Google from deleting account blocked over ‘explicit content’",
    "light_cleaned_selftext": "The Gujarat High Court on Tuesday came to the rescue of a 24-year-old engineer who has been locked out of his Google account as it was flagged for “explicit content” after he uploaded a photo that showed him being given a bath by his grandmother when he was two.",
    "light_cleaned_comments": "Someone please send this to Louis Rossmann... These companies pretend to belong to the cloud and drop customers, business partners, employees etc at each breath. This is the only way to avoid a one sided relationship with them. Exactly. Even reddit for that matter; it's super easy for your IP to get banned; you just need to piss a mod off. I haven't read Google Drive's ToS but isn't this a breach of privacy? Google being able to run its algorithms on private data stored on users' accounts seems like a big issue."
}