{
    "id": "tz7iyl",
    "title": "What the hell is wrong with (Indigo) airlines",
    "url": "https://www.reddit.com/r/india/comments/tz7iyl/what_the_hell_is_wrong_with_indigo_airlines/",
    "selftext": "&amp;#x200B;\n\n[The website had a confusing way of displaying list of flights. When I clicked on the desired flight, I did not actually 'select' it and the airline chose the first flight on the list by default. I ended up paying 11k for the wrong flight and now I am entitled to only 35&amp;#37; of the fare as refund. This literally happened in minutes. Why can't airlines issue a full refund accommodating for glitches like this. This is fucking diabolical!](https://preview.redd.it/vs1qo1od0cs81.png?width=538&amp;format=png&amp;auto=webp&amp;s=4aa8c006c51aecaebca136af02713bb723d80467)\n\n&amp;#x200B;",
    "flair": "Rant / Vent",
    "score": 3,
    "num_comments": 3,
    "created_utc": 1649435610,
    "convurl": "https://b.thumbs.redditmedia.com/wnFPdxPvHNQAD-tUdw798Plkc-Qm1nBvGkt6V5noqjU.jpg",
    "comments": [
        "F \n\n  You can try cleartrip next time. They have a travel insurance kind of add-on thing for 250/ticket. You can cancel upto 72 hours before departure and get back (100% refund - charges). Cheapest way to turn a cheap non refundable economy ticket into refundable one \n\n   Gives peace of mind and flexibility",
        "Has that ever worked? There is always hidden charges when canceling",
        "Yes worked for me a month back"
    ],
    "cleaned_text": "hell wrong indigo airlines ampxb website confusing way displaying list flights clicked desired flight actually select airline chose first flight list default ended paying k wrong flight entitled amp fare refund literally happened minutes cant airlines issue full refund accommodating glitches like fucking diabolicalhttpspreviewredditvsqoodcspngwidthampformatpngampautowebpampsaaccaecaebcaafbbd ampxb ",
    "cleaned_title": "hell wrong indigo airlines",
    "cleaned_selftext": "ampxb website confusing way displaying list flights clicked desired flight actually select airline chose first flight list default ended paying k wrong flight entitled amp fare refund literally happened minutes cant airlines issue full refund accommodating glitches like fucking diabolicalhttpspreviewredditvsqoodcspngwidthampformatpngampautowebpampsaaccaecaebcaafbbd ampxb",
    "cleaned_comments": "f try cleartrip next time travel insurance kind addon thing ticket cancel upto hours departure get back refund charges cheapest way turn cheap non refundable economy ticket refundable one gives peace mind flexibility ever worked always hidden charges canceling yes worked month back",
    "light_cleaned_title": "What the hell is wrong with (Indigo) airlines",
    "light_cleaned_selftext": "[The website had a confusing way of displaying list of flights. When I clicked on the desired flight, I did not actually 'select' it and the airline chose the first flight on the list by default. I ended up paying 11k for the wrong flight and now I am entitled to only 35&amp;#37; of the fare as refund. This literally happened in minutes. Why can't airlines issue a full refund accommodating for glitches like this. This is fucking diabolical!](https://preview.redd.it/vs1qo1od0cs81.png?width=538&amp;format=png&amp;auto=webp&amp;s=4aa8c006c51aecaebca136af02713bb723d80467)",
    "light_cleaned_comments": "F You can try cleartrip next time. They have a travel insurance kind of add-on thing for 250/ticket. You can cancel upto 72 hours before departure and get back (100% refund - charges). Cheapest way to turn a cheap non refundable economy ticket into refundable one Gives peace of mind and flexibility Has that ever worked? There is always hidden charges when canceling Yes worked for me a month back"
}