{
    "id": "1dy7ui7",
    "title": "Agriculture Minister Shivraj Singh Chouhan’s priority should be to bridge trust deficit with farmers",
    "url": "https://indianexpress.com/article/opinion/columns/agriculture-minister-shivraj-singh-chouhans-priority-should-be-to-bridge-trust-deficit-with-farmers-9438984/",
    "selftext": "PM-FBY was started in 2016 after back-to-back droughts in 2014-15 and 2015-16. Agri-GDP had collapsed and suddenly the farming community was under deep stress. PM-FBY was a bold step in the right direction. But the success of any such scheme depends on how efficiently it is implemented. ",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1720442194.0,
    "convurl": "https://external-preview.redd.it/bs0fS8As692HSxukbwaFP2Dlf2KWmRz3tNy7g6hrOik.jpg?auto=webp&s=66da4172ba3a6583cc934c0e5ebdb0e1d3742e44",
    "comments": [
        "Trust is the foundation of any relationship, be it in a family, between friends or between farmers and policymakers. But trust building requires transparency in actions. Without it, any action by any party can be misconstrued, leading to the collapse of relations and policies. I am talking in the context of farm policies and the trust deficit that widened between some segments of the farming community and the agri-policy makers.\n\nIf agriculture in the country has to be put on a fast and sustainable track, first and foremost, the agriculture minister, Shivraj Singh Chouhan, has to bridge this trust deficit with farmers. The best way to do it is to form two agri-councils, one with representatives of farmers from each state, say two per state, one owner cultivator and one tenant. Let us call it the Farmers’ Council. The second council will comprise agri-ministers of each state, somewhat on the lines of the GST council. Both these councils must meet at least twice a year, at the beginning of the kharif and rabi conferences that the Centre holds each year. This will go a long way to converge on some important reforms in the agri-sector, which is crying for change.\n\nSecond, climate change is already knocking on our heads and farming will be impacted in a big way unless we take some bold steps. The Indian Council of Agricultural Research (ICAR) claims that they have produced more than 2,000 seed varieties that are climate resilient for different crops. If that is the case, how does one explain the drop in agri-GDP in 2023-24 to just 1.4 per cent compared to the previous year’s high of 4.7 per cent? There was the El Nino impact in 2023. That means that either we are still way behind in creating a climate-resilient agriculture or our innovation in seeds has not moved from the scientists’ labs to the lands of the farmers. In terms of the forthcoming Union Budget, this also means that ICAR’s funding needs to go up significantly, say from less than Rs 10,000 crore today to about Rs 15,000 crore. The marginal returns in investing in climate-resilient agriculture, and also promoting climate-smart agriculture are very high. The latter requires the resurrection of the agri-extension work in a way that promotes farming practices which can withstand extreme heat waves or bursts of rain, etc. The extra funding of ICAR should be exclusively focused on creating a climate-resilient and climate-smart agriculture. But this is not going to happen overnight. In the short run, we need to fix the crop insurance scheme, the PM-Fasal Bima Yojana (PM-FBY).\n\nPM-FBY was started in 2016 after back-to-back droughts in 2014-15 and 2015-16. Agri-GDP had collapsed and suddenly the farming community was under deep stress. PM-FBY was a bold step in the right direction. But the success of any such scheme depends on how efficiently it is implemented. It started with a big bang. In total 26 states, 16 insurers came forward to join this scheme. But the scheme was somewhat premature as the spade work was not done, and the infusion of technology was meagre. The All-Weather Stations (AWS) were not fixed, continuous monitoring of plots was not done through high-tech Low Earth Orbits (LEOs), algorithms for crop losses were not properly designed, and so on. In brief, the scheme was open to human manipulation. No wonder many of our states, with the help of some leaders, took undue advantage. There were several cases of corruption. As a result, after a good initial start, the graph of its adoption, instead of going up started coming down. Re-insurers who are the real risk-takers in the crop insurance business were not satisfied as there was not enough transparency in crop losses and claims made. By 2021-22, there were only 20 states and 10 insurers willing to participate in PM-FBY. It was feared that this scheme may fail. But there was no better alternative to compensate the farmers in case of crop failures. It was at that time that a major push for technology re-booting was made. In the last two years, there seems to be a turnaround in PM-FBY. The number of states and insurers participating in the scheme has gone back to 24 and 15, respectively. The improvements in the yield estimation system based on technology (YES-TECH), and the Weather Information Network and Data System (WINDS) have raised hopes and reduced human intervention. Though still not perfect, it has an all-time high enrolment of farmers at about 40 million.",
        "Interestingly, first-time, non-loanee farmers who opted for this scheme comprised 55 per cent of the total farmers insured. The area covered under PM-FBY in 2023-24 was about 61 million hectares which was roughly 40 per cent of the gross cropped area of the states who opted for PM-FBY. This has raised hopes that the technology infusion has earned the trust of insurers, re-insurers, as well as farmers. But the litmus test for the success of crop insurance depends on the premium rates. They had peaked at 17 per cent in 2021-22, but since then they have sharply come down to roughly 10 per cent in 2023-24 as per provisional figures. This is a commendable revival of the scheme at the all-India level. But there is no time for complacency.\n\nA state-wise picture throws some interesting results: The actuarial premium was just 3.4 per cent in Andhra Pradesh, 5.7 per cent in Uttar Pradesh, and 7.5 per cent in Madhya Pradesh. But many other states attracted much higher premiums. For example, Chhattisgarh (14.8 per cent), Haryana (11.7 per cent), Karnataka (19.2 per cent), Maharashtra (13.5 per cent), Odisha (13.1 per cent), Rajasthan (9.7 per cent), Tamil Nadu (12 per cent), and so on. There is a need to study its reasons and bring the all-India premiums below 7 per cent. Chouhan can do it, provided he fixes the system based on technology with the least human manipulation. Can he deliver on this?"
    ],
    "cleaned_text": "agriculture minister shivraj singh chouhans priority bridge trust deficit farmers pmfby started backtoback droughts agrigdp collapsed suddenly farming community deep stress pmfby bold step right direction success scheme depends efficiently implemented ",
    "cleaned_title": "agriculture minister shivraj singh chouhans priority bridge trust deficit farmers",
    "cleaned_selftext": "pmfby started backtoback droughts agrigdp collapsed suddenly farming community deep stress pmfby bold step right direction success scheme depends efficiently implemented",
    "cleaned_comments": "trust foundation relationship family friends farmers policymakers trust building requires transparency actions without action party misconstrued leading collapse relations policies talking context farm policies trust deficit widened segments farming community agripolicy makers agriculture country put fast sustainable track first foremost agriculture minister shivraj singh chouhan bridge trust deficit farmers best way form two agricouncils one representatives farmers state say two per state one owner cultivator one tenant let us call farmers council second council comprise agriministers state somewhat lines gst council councils must meet least twice year beginning kharif rabi conferences centre holds year go long way converge important reforms agrisector crying change second climate change already knocking heads farming impacted big way unless take bold steps indian council agricultural research icar claims produced seed varieties climate resilient different crops case one explain drop agrigdp per cent compared previous years high per cent el nino impact means either still way behind creating climateresilient agriculture innovation seeds moved scientists labs lands farmers terms forthcoming union budget also means icars funding needs go significantly say less rs crore today rs crore marginal returns investing climateresilient agriculture also promoting climatesmart agriculture high latter requires resurrection agriextension work way promotes farming practices withstand extreme heat waves bursts rain etc extra funding icar exclusively focused creating climateresilient climatesmart agriculture going happen overnight short run need fix crop insurance scheme pmfasal bima yojana pmfby pmfby started backtoback droughts agrigdp collapsed suddenly farming community deep stress pmfby bold step right direction success scheme depends efficiently implemented started big bang total states insurers came forward join scheme scheme somewhat premature spade work done infusion technology meagre allweather stations aws fixed continuous monitoring plots done hightech low earth orbits leos algorithms crop losses properly designed brief scheme open human manipulation wonder many states help leaders took undue advantage several cases corruption result good initial start graph adoption instead going started coming reinsurers real risktakers crop insurance business satisfied enough transparency crop losses claims made states insurers willing participate pmfby feared scheme may fail better alternative compensate farmers case crop failures time major push technology rebooting made last two years seems turnaround pmfby number states insurers participating scheme gone back respectively improvements yield estimation system based technology yestech weather information network data system winds raised hopes reduced human intervention though still perfect alltime high enrolment farmers million interestingly firsttime nonloanee farmers opted scheme comprised per cent total farmers insured area covered pmfby million hectares roughly per cent gross cropped area states opted pmfby raised hopes technology infusion earned trust insurers reinsurers well farmers litmus test success crop insurance depends premium rates peaked per cent since sharply come roughly per cent per provisional figures commendable revival scheme allindia level time complacency statewise picture throws interesting results actuarial premium per cent andhra pradesh per cent uttar pradesh per cent madhya pradesh many states attracted much higher premiums example chhattisgarh per cent haryana per cent karnataka per cent maharashtra per cent odisha per cent rajasthan per cent tamil nadu per cent need study reasons bring allindia premiums per cent chouhan provided fixes system based technology least human manipulation deliver",
    "light_cleaned_title": "Agriculture Minister Shivraj Singh Chouhan’s priority should be to bridge trust deficit with farmers",
    "light_cleaned_selftext": "PM-FBY was started in 2016 after back-to-back droughts in 2014-15 and 2015-16. Agri-GDP had collapsed and suddenly the farming community was under deep stress. PM-FBY was a bold step in the right direction. But the success of any such scheme depends on how efficiently it is implemented.",
    "light_cleaned_comments": "Trust is the foundation of any relationship, be it in a family, between friends or between farmers and policymakers. But trust building requires transparency in actions. Without it, any action by any party can be misconstrued, leading to the collapse of relations and policies. I am talking in the context of farm policies and the trust deficit that widened between some segments of the farming community and the agri-policy makers. If agriculture in the country has to be put on a fast and sustainable track, first and foremost, the agriculture minister, Shivraj Singh Chouhan, has to bridge this trust deficit with farmers. The best way to do it is to form two agri-councils, one with representatives of farmers from each state, say two per state, one owner cultivator and one tenant. Let us call it the Farmers’ Council. The second council will comprise agri-ministers of each state, somewhat on the lines of the GST council. Both these councils must meet at least twice a year, at the beginning of the kharif and rabi conferences that the Centre holds each year. This will go a long way to converge on some important reforms in the agri-sector, which is crying for change. Second, climate change is already knocking on our heads and farming will be impacted in a big way unless we take some bold steps. The Indian Council of Agricultural Research (ICAR) claims that they have produced more than 2,000 seed varieties that are climate resilient for different crops. If that is the case, how does one explain the drop in agri-GDP in 2023-24 to just 1.4 per cent compared to the previous year’s high of 4.7 per cent? There was the El Nino impact in 2023. That means that either we are still way behind in creating a climate-resilient agriculture or our innovation in seeds has not moved from the scientists’ labs to the lands of the farmers. In terms of the forthcoming Union Budget, this also means that ICAR’s funding needs to go up significantly, say from less than Rs 10,000 crore today to about Rs 15,000 crore. The marginal returns in investing in climate-resilient agriculture, and also promoting climate-smart agriculture are very high. The latter requires the resurrection of the agri-extension work in a way that promotes farming practices which can withstand extreme heat waves or bursts of rain, etc. The extra funding of ICAR should be exclusively focused on creating a climate-resilient and climate-smart agriculture. But this is not going to happen overnight. In the short run, we need to fix the crop insurance scheme, the PM-Fasal Bima Yojana (PM-FBY). PM-FBY was started in 2016 after back-to-back droughts in 2014-15 and 2015-16. Agri-GDP had collapsed and suddenly the farming community was under deep stress. PM-FBY was a bold step in the right direction. But the success of any such scheme depends on how efficiently it is implemented. It started with a big bang. In total 26 states, 16 insurers came forward to join this scheme. But the scheme was somewhat premature as the spade work was not done, and the infusion of technology was meagre. The All-Weather Stations (AWS) were not fixed, continuous monitoring of plots was not done through high-tech Low Earth Orbits (LEOs), algorithms for crop losses were not properly designed, and so on. In brief, the scheme was open to human manipulation. No wonder many of our states, with the help of some leaders, took undue advantage. There were several cases of corruption. As a result, after a good initial start, the graph of its adoption, instead of going up started coming down. Re-insurers who are the real risk-takers in the crop insurance business were not satisfied as there was not enough transparency in crop losses and claims made. By 2021-22, there were only 20 states and 10 insurers willing to participate in PM-FBY. It was feared that this scheme may fail. But there was no better alternative to compensate the farmers in case of crop failures. It was at that time that a major push for technology re-booting was made. In the last two years, there seems to be a turnaround in PM-FBY. The number of states and insurers participating in the scheme has gone back to 24 and 15, respectively. The improvements in the yield estimation system based on technology (YES-TECH), and the Weather Information Network and Data System (WINDS) have raised hopes and reduced human intervention. Though still not perfect, it has an all-time high enrolment of farmers at about 40 million. Interestingly, first-time, non-loanee farmers who opted for this scheme comprised 55 per cent of the total farmers insured. The area covered under PM-FBY in 2023-24 was about 61 million hectares which was roughly 40 per cent of the gross cropped area of the states who opted for PM-FBY. This has raised hopes that the technology infusion has earned the trust of insurers, re-insurers, as well as farmers. But the litmus test for the success of crop insurance depends on the premium rates. They had peaked at 17 per cent in 2021-22, but since then they have sharply come down to roughly 10 per cent in 2023-24 as per provisional figures. This is a commendable revival of the scheme at the all-India level. But there is no time for complacency. A state-wise picture throws some interesting results: The actuarial premium was just 3.4 per cent in Andhra Pradesh, 5.7 per cent in Uttar Pradesh, and 7.5 per cent in Madhya Pradesh. But many other states attracted much higher premiums. For example, Chhattisgarh (14.8 per cent), Haryana (11.7 per cent), Karnataka (19.2 per cent), Maharashtra (13.5 per cent), Odisha (13.1 per cent), Rajasthan (9.7 per cent), Tamil Nadu (12 per cent), and so on. There is a need to study its reasons and bring the all-India premiums below 7 per cent. Chouhan can do it, provided he fixes the system based on technology with the least human manipulation. Can he deliver on this?"
}