{
    "id": "15yxhwv",
    "title": "Chandrayaan, chaiwala controversy",
    "url": "https://www.reddit.com/r/india/comments/15yxhwv/chandrayaan_chaiwala_controversy/",
    "selftext": " \n\n[Chaiwala ](https://preview.redd.it/t86q0jx3ktjb1.jpg?width=1600&format=pjpg&auto=webp&s=a1468714c6832d6ed7bf642f01498f34a9b08e86)\n\nThe chaiwala is famous but does anyone know where it comes from? It was created by a 3d artist from Bangalore. The art went to places leaving the artist.\n\nUnfortunately, we in India never worry about copyright, especially artists. Just crop the name and now anybody can use it. There have been many before. We are used to it.\n\nThe recent controversy surrounding the tweet with Chaiwala and Chandrayaan uses the image in a negative manner.\n\nI want the community's support to separate the art from the issue and appreciate the artist's hard work. With the discussions surrounding this image, we need to keep in mind that art is subjective and open to interpretations. This image was created with a different intention but unfortunately came to fame with a different message.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692778867.0,
    "convurl": "https://b.thumbs.redditmedia.com/a4vrX1ezeXEA8mRIdnPwu9xOJv7F7Pgb7L4stzTVTLg.jpg",
    "comments": [
        "Agreed,  but wrt to this scenario  I'm  sure the artist would like to separate  himself from the said art given the \"misintepretation\". the message  was pretty much the same ,  just that bhakts misinterpreted it nd thought the chaiwala in the pic   was their Master .",
        "In this scenario it is even more important for the artist to assert himself. I know the artist personally and his work was created out of a love for tea."
    ],
    "cleaned_text": "chandrayaan chaiwala controversy chaiwala httpspreviewreddittqjxktjbjpgwidthformatpjpgautowebpsacdedbfffabe chaiwala famous anyone know comes created artist bangalore art went places leaving artist unfortunately india never worry copyright especially artists crop name anybody use many used recent controversy surrounding tweet chaiwala chandrayaan uses image negative manner want communitys support separate art issue appreciate artists hard work discussions surrounding image need keep mind art subjective open interpretations image created different intention unfortunately came fame different message ",
    "cleaned_title": "chandrayaan chaiwala controversy",
    "cleaned_selftext": "chaiwala httpspreviewreddittqjxktjbjpgwidthformatpjpgautowebpsacdedbfffabe chaiwala famous anyone know comes created artist bangalore art went places leaving artist unfortunately india never worry copyright especially artists crop name anybody use many used recent controversy surrounding tweet chaiwala chandrayaan uses image negative manner want communitys support separate art issue appreciate artists hard work discussions surrounding image need keep mind art subjective open interpretations image created different intention unfortunately came fame different message",
    "cleaned_comments": "agreed wrt scenario im sure artist would like separate said art given misintepretation message pretty much bhakts misinterpreted nd thought chaiwala pic master scenario even important artist assert know artist personally work created love tea",
    "light_cleaned_title": "Chandrayaan, chaiwala controversy",
    "light_cleaned_selftext": "[Chaiwala ](https://preview.redd.it/t86q0jx3ktjb1.jpg?width=1600&format=pjpg&auto=webp&s=a1468714c6832d6ed7bf642f01498f34a9b08e86) The chaiwala is famous but does anyone know where it comes from? It was created by a 3d artist from Bangalore. The art went to places leaving the artist. Unfortunately, we in India never worry about copyright, especially artists. Just crop the name and now anybody can use it. There have been many before. We are used to it. The recent controversy surrounding the tweet with Chaiwala and Chandrayaan uses the image in a negative manner. I want the community's support to separate the art from the issue and appreciate the artist's hard work. With the discussions surrounding this image, we need to keep in mind that art is subjective and open to interpretations. This image was created with a different intention but unfortunately came to fame with a different message.",
    "light_cleaned_comments": "Agreed, but wrt to this scenario I'm sure the artist would like to separate himself from the said art given the \"misintepretation\". the message was pretty much the same , just that bhakts misinterpreted it nd thought the chaiwala in the pic was their Master . In this scenario it is even more important for the artist to assert himself. I know the artist personally and his work was created out of a love for tea."
}