{
    "id": "15px8n4",
    "title": "Row over Unacademy educator asking students to vote out politicians busy ‘changing names’",
    "url": "https://www.hindustantimes.com/india-news/row-over-unacademy-educator-karan-sangwan-asking-students-to-vote-out-politicians-busy-changing-names-101691916132378.html",
    "selftext": "He just asked students to vote for educated politicians, why is one particular party so upset about it when it’s leader has a degree in Entire Political Science",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1691928541.0,
    "convurl": "https://external-preview.redd.it/X0CjQbkYoTV4eumSHMgrYrUNTAvpSJ0sz9k8hKjU9r0.jpg?auto=webp&s=2b01e227a3a0bf19dfc67523b61e51a591a5abda",
    "comments": [
        "They don't want people with Influence, influencing. Same with Bollywood, cricketers, teachers, activists etc",
        "Checking education of candidates should be a bare minimum that a (young) voter must do. But this entire fiasco seems to be planted by Byjus to harm in Unacademy and distract people from their mess.",
        "Ab ye bol denge unacademy Wale deshdrohi hai Muslim hai, sc/st hai 🤣🤣🤣"
    ],
    "cleaned_text": "row unacademy educator asking students vote politicians busy changing names asked students vote educated politicians one particular party upset leader degree entire political science ",
    "cleaned_title": "row unacademy educator asking students vote politicians busy changing names",
    "cleaned_selftext": "asked students vote educated politicians one particular party upset leader degree entire political science",
    "cleaned_comments": "dont want people influence influencing bollywood cricketers teachers activists etc checking education candidates bare minimum young voter must entire fiasco seems planted byjus harm unacademy distract people mess ab ye bol denge unacademy wale deshdrohi hai muslim hai scst hai",
    "light_cleaned_title": "Row over Unacademy educator asking students to vote out politicians busy ‘changing names’",
    "light_cleaned_selftext": "He just asked students to vote for educated politicians, why is one particular party so upset about it when it’s leader has a degree in Entire Political Science",
    "light_cleaned_comments": "They don't want people with Influence, influencing. Same with Bollywood, cricketers, teachers, activists etc Checking education of candidates should be a bare minimum that a (young) voter must do. But this entire fiasco seems to be planted by Byjus to harm in Unacademy and distract people from their mess. Ab ye bol denge unacademy Wale deshdrohi hai Muslim hai, sc/st hai 🤣🤣🤣"
}