{
    "id": "1drekor",
    "title": "Vogue bestows Industrial magnate label on isha ambani",
    "url": "https://www.vogue.in/content/isha-ambani-piramal-reliance-jio-nmacc-ivf-vogue-india-july-august-2024-cover-story",
    "selftext": "When asked to bend we crawl is how best we can describe all current media houses functioning in india.\n\nHere's a piece put out by Vogue, bestowing the tag of industrial magnate on a woman who in closing of the interview for this piece says if left alone and free would love to spend the whole day scrolling Instagram reels.\n\nHe could've spared and spent a few crores on her education , maybe this is the fate that awaits anyone born in the darkness of an oligarchs wealth.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1719677240.0,
    "convurl": "https://external-preview.redd.it/KX6xNmkHzpbDXbEf2LdW0keKn4dmG4lwyIS8-xllNKo.jpg?auto=webp&s=aca63902efc5476ae11dc9b1e514196eab63a341",
    "comments": [
        "RSS Chief Mohan Bhagwat Visits Ambani Family At Antilia For Dinner",
        "Hey she worked hard to be born inside Nita Ambani, she was literally the winner of the race from Mukesh's Nuts",
        "I'd call for name and shame the article writer but I won't."
    ],
    "cleaned_text": "vogue bestows industrial magnate label isha ambani asked bend crawl best describe current media houses functioning india heres piece put vogue bestowing tag industrial magnate woman closing interview piece says left alone free would love spend whole day scrolling instagram reels couldve spared spent crores education maybe fate awaits anyone born darkness oligarchs wealth ",
    "cleaned_title": "vogue bestows industrial magnate label isha ambani",
    "cleaned_selftext": "asked bend crawl best describe current media houses functioning india heres piece put vogue bestowing tag industrial magnate woman closing interview piece says left alone free would love spend whole day scrolling instagram reels couldve spared spent crores education maybe fate awaits anyone born darkness oligarchs wealth",
    "cleaned_comments": "rss chief mohan bhagwat visits ambani family antilia dinner hey worked hard born inside nita ambani literally winner race mukeshs nuts id call name shame article writer wont",
    "light_cleaned_title": "Vogue bestows Industrial magnate label on isha ambani",
    "light_cleaned_selftext": "When asked to bend we crawl is how best we can describe all current media houses functioning in india. Here's a piece put out by Vogue, bestowing the tag of industrial magnate on a woman who in closing of the interview for this piece says if left alone and free would love to spend the whole day scrolling Instagram reels. He could've spared and spent a few crores on her education , maybe this is the fate that awaits anyone born in the darkness of an oligarchs wealth.",
    "light_cleaned_comments": "RSS Chief Mohan Bhagwat Visits Ambani Family At Antilia For Dinner Hey she worked hard to be born inside Nita Ambani, she was literally the winner of the race from Mukesh's Nuts I'd call for name and shame the article writer but I won't."
}