{
    "id": "17qgtgb",
    "title": "Uninstalled Zomato after this",
    "url": "https://i.redd.it/j6s8t3yny2zb1.jpg",
    "selftext": "\nUninstalled the app after creepy notifications. Hope they work on their interface better.",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 18,
    "created_utc": 1699430256.0,
    "convurl": "https://i.redd.it/j6s8t3yny2zb1.jpg",
    "comments": [
        "what's creepy?",
        "What's creepy(1)?",
        "This isn't creepy. Haath peele means getting married.",
        "I know what it means. I mean, their notifications are really weird and annoying. A few days ago, I received a notification like \"Uth gye kya nashta to kar lo.\" They really need to work on their ads.",
        "If you are on android you can turn off promotional/miscellaneous notification under app notification categories. I suggest you do this to every app.",
        "thats the only creative part that they have initiated.. tho what i found weird is.. sometimes i be talking about ice cream and they pop up a notification about icecream right then..they better not fking listening",
        "ok and..? lol you could just disable the notifs if it offends you this much , also whts creppy about this , all i see is unique marketing",
        "Sometimes they are really annoying",
        "What's creepy?(2)",
        "Op be like: saala juthe sapne dikhata hai",
        "How dare they try to do something new with their ads. No such tomfoolery will be tolerated.",
        "Bhai splitwise clear karde please",
        "Might be annoying(to OP)but I didn’t find it creepy"
    ],
    "cleaned_text": "uninstalled zomato uninstalled app creepy notifications hope work interface better ",
    "cleaned_title": "uninstalled zomato",
    "cleaned_selftext": "uninstalled app creepy notifications hope work interface better",
    "cleaned_comments": "whats creepy whats creepy isnt creepy haath peele means getting married know means mean notifications really weird annoying days ago received notification like uth gye kya nashta kar lo really need work ads android turn promotionalmiscellaneous notification app notification categories suggest every app thats creative part initiated tho found weird sometimes talking ice cream pop notification icecream right thenthey better fking listening ok lol could disable notifs offends much also whts creppy see unique marketing sometimes really annoying whats creepy op like saala juthe sapne dikhata hai dare try something new ads tomfoolery tolerated bhai splitwise clear karde please might annoyingto opbut didnt find creepy",
    "light_cleaned_title": "Uninstalled Zomato after this",
    "light_cleaned_selftext": "Uninstalled the app after creepy notifications. Hope they work on their interface better.",
    "light_cleaned_comments": "what's creepy? What's creepy(1)? This isn't creepy. Haath peele means getting married. I know what it means. I mean, their notifications are really weird and annoying. A few days ago, I received a notification like \"Uth gye kya nashta to kar lo.\" They really need to work on their ads. If you are on android you can turn off promotional/miscellaneous notification under app notification categories. I suggest you do this to every app. thats the only creative part that they have initiated.. tho what i found weird is.. sometimes i be talking about ice cream and they pop up a notification about icecream right then..they better not fking listening ok and..? lol you could just disable the notifs if it offends you this much , also whts creppy about this , all i see is unique marketing Sometimes they are really annoying What's creepy?(2) Op be like: saala juthe sapne dikhata hai How dare they try to do something new with their ads. No such tomfoolery will be tolerated. Bhai splitwise clear karde please Might be annoying(to OP)but I didn’t find it creepy"
}