{
    "id": "14hw3l4",
    "title": "[Survey] Clothing Brand Startup",
    "url": "https://www.reddit.com/r/india/comments/14hw3l4/survey_clothing_brand_startup/",
    "selftext": "Looking to Wear Your Imagination? Share your inspiring text, and our AI will bring it to your life through clothes!\n\nLet your creativity soar and embrace the infinite possibilities of AI  Imagined clothing. Unleash your unique style, make a statement, and wear your imagination with pride.\n\n&#x200B;\n\nPlease fill out the survey here: [https://forms.gle/6TpDeiCFwVyYTg6q6](https://forms.gle/6TpDeiCFwVyYTg6q6)",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1687621322.0,
    "convurl": "https://external-preview.redd.it/yu6zDMZz8_7w91WJH75U-fY6D-BTlNc0OtSsqjg3jLk.jpg?auto=webp&v=enabled&s=890a0a73de103d6aa02e2152181b4590b2722945",
    "comments": [],
    "cleaned_text": "survey clothing brand startup looking wear imagination share inspiring text ai bring life clothes let creativity soar embrace infinite possibilities ai imagined clothing unleash unique style make statement wear imagination pride xb please fill survey httpsformsgletpdeicfwvyytgqhttpsformsgletpdeicfwvyytgq ",
    "cleaned_title": "survey clothing brand startup",
    "cleaned_selftext": "looking wear imagination share inspiring text ai bring life clothes let creativity soar embrace infinite possibilities ai imagined clothing unleash unique style make statement wear imagination pride xb please fill survey httpsformsgletpdeicfwvyytgqhttpsformsgletpdeicfwvyytgq",
    "cleaned_comments": "",
    "light_cleaned_title": "[Survey] Clothing Brand Startup",
    "light_cleaned_selftext": "Looking to Wear Your Imagination? Share your inspiring text, and our AI will bring it to your life through clothes! Let your creativity soar and embrace the infinite possibilities of AI Imagined clothing. Unleash your unique style, make a statement, and wear your imagination with pride. &#x200B; Please fill out the survey here: [https://forms.gle/6TpDeiCFwVyYTg6q6](https://forms.gle/6TpDeiCFwVyYTg6q6)",
    "light_cleaned_comments": ""
}