{
    "id": "150igtc",
    "title": "Starting a Bronze/ Copper dinnerware business for American market. Need feedback!",
    "url": "https://www.reddit.com/r/india/comments/150igtc/starting_a_bronze_copper_dinnerware_business_for/",
    "selftext": "We as a family do a side business of selling bronze, copper, brass dinnerware and artefacts in India.\n\nWe are going to start selling these items, especially dinnerware because they are healthy for a person's body to eat it. And people is USA are alot health conscious.\n[Source](https://www.vogue.in/content/cooking-in-the-right-kind-of-vessels-can-actually-make-you-healthier)\n\nIt will also act as a problem we are solving\nThe items will also be very high quality, Targetting premium customers, elevating their status.\n\nThough, it will be exported from India to US\n\nWe have a supplier in India with the products.\nWe plan to do the marketing of the products through video ads on Instagram and Facebook\n\nNote- we are just starting out, we want to keep the expense to minimal.\n\nTo Americans:\n\nHow is the demand for these items in USA?\nIs a average American from USA interested in such items?\nWhat demographics is the best bet to target?\nHow do you like your packaging to be?\nHow premium should the product be?\nHow premium will people be willing to pay?\nWhat are the obstacles I may face during the setting-up phase?\nDoes this business have a good chance of being successful?\nDo you have any additional information that you can think of to add? Please do, I am all ears.\n\nTo Indians:\n\nHow does Export from India to America works?\nHow can I do a direct consumer oriented affordable yet good packaging?\nHow much expense should I estimate before I see any money coming in?\nShould I create a inventory or order items from supplier only when order starts coming in?\nIf so how to handle logistics?\nWhat are the obstacles I may face during the setting-up phase?\nDoes this business have a good chance of being successful?\nDo you have any additional information that you can think of to add? Please do, I am all ears.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689443775.0,
    "convurl": "https://external-preview.redd.it/KYFWWBjshlO4thtqNdauCkBJJ_AuSfC6nLkPCNQGryI.jpg?auto=webp&s=1c9d4390532caa4204a367c88ba4d5039b6fa734",
    "comments": [
        "Make website on Shopify or equivalent. Don’t hold inventory since you already do in your family business. Market using Insta etc. \n\nGet logistics partner. To deal with shipping and such. Shopify can manage taxes and such for worldwide shipping. \n\nPricing - you slowly figure that out. Start with cost plus 100% margin. And then work your way up offering discounts and such. \n\nLook at Amazon and other places where goods may already be available. Price accordingly. \n\nTry and create a brand - not brass utensils. A name that symbolises what you are selling so you can expand SKUs later on. \n\nOmni channel - same updates on all modes - Facebook/Instagram/Twitter/Threads and whatever else you want to use. Start small. \n\nGet Influencers once you are able to get a customer or 100 - free and then paid to talk up your brand and such. \n\nAnd slowly work your way up to a distributor locally in each country that you intend to operate - this is a much much later thing to do though. \n\nGo on Shark tank /s",
        "Bullshit."
    ],
    "cleaned_text": "starting bronze copper dinnerware business american market need feedback family side business selling bronze copper brass dinnerware artefacts india going start selling items especially dinnerware healthy persons body eat people usa alot health conscious sourcehttpswwwvogueincontentcookingintherightkindofvesselscanactuallymakeyouhealthier also act problem solving items also high quality targetting premium customers elevating status though exported india us supplier india products plan marketing products video ads instagram facebook note starting want keep expense minimal americans demand items usa average american usa interested items demographics best bet target like packaging premium product premium people willing pay obstacles may face settingup phase business good chance successful additional information think add please ears indians export india america works direct consumer oriented affordable yet good packaging much expense estimate see money coming create inventory order items supplier order starts coming handle logistics obstacles may face settingup phase business good chance successful additional information think add please ears ",
    "cleaned_title": "starting bronze copper dinnerware business american market need feedback",
    "cleaned_selftext": "family side business selling bronze copper brass dinnerware artefacts india going start selling items especially dinnerware healthy persons body eat people usa alot health conscious sourcehttpswwwvogueincontentcookingintherightkindofvesselscanactuallymakeyouhealthier also act problem solving items also high quality targetting premium customers elevating status though exported india us supplier india products plan marketing products video ads instagram facebook note starting want keep expense minimal americans demand items usa average american usa interested items demographics best bet target like packaging premium product premium people willing pay obstacles may face settingup phase business good chance successful additional information think add please ears indians export india america works direct consumer oriented affordable yet good packaging much expense estimate see money coming create inventory order items supplier order starts coming handle logistics obstacles may face settingup phase business good chance successful additional information think add please ears",
    "cleaned_comments": "make website shopify equivalent dont hold inventory since already family business market using insta etc get logistics partner deal shipping shopify manage taxes worldwide shipping pricing slowly figure start cost plus margin work way offering discounts look amazon places goods may already available price accordingly try create brand brass utensils name symbolises selling expand skus later omni channel updates modes facebookinstagramtwitterthreads whatever else want use start small get influencers able get customer free paid talk brand slowly work way distributor locally country intend operate much much later thing though go shark tank bullshit",
    "light_cleaned_title": "Starting a Bronze/ Copper dinnerware business for American market. Need feedback!",
    "light_cleaned_selftext": "We as a family do a side business of selling bronze, copper, brass dinnerware and artefacts in India. We are going to start selling these items, especially dinnerware because they are healthy for a person's body to eat it. And people is USA are alot health conscious. [Source](https://www.vogue.in/content/cooking-in-the-right-kind-of-vessels-can-actually-make-you-healthier) It will also act as a problem we are solving The items will also be very high quality, Targetting premium customers, elevating their status. Though, it will be exported from India to US We have a supplier in India with the products. We plan to do the marketing of the products through video ads on Instagram and Facebook Note- we are just starting out, we want to keep the expense to minimal. To Americans: How is the demand for these items in USA? Is a average American from USA interested in such items? What demographics is the best bet to target? How do you like your packaging to be? How premium should the product be? How premium will people be willing to pay? What are the obstacles I may face during the setting-up phase? Does this business have a good chance of being successful? Do you have any additional information that you can think of to add? Please do, I am all ears. To Indians: How does Export from India to America works? How can I do a direct consumer oriented affordable yet good packaging? How much expense should I estimate before I see any money coming in? Should I create a inventory or order items from supplier only when order starts coming in? If so how to handle logistics? What are the obstacles I may face during the setting-up phase? Does this business have a good chance of being successful? Do you have any additional information that you can think of to add? Please do, I am all ears.",
    "light_cleaned_comments": "Make website on Shopify or equivalent. Don’t hold inventory since you already do in your family business. Market using Insta etc. Get logistics partner. To deal with shipping and such. Shopify can manage taxes and such for worldwide shipping. Pricing - you slowly figure that out. Start with cost plus 100% margin. And then work your way up offering discounts and such. Look at Amazon and other places where goods may already be available. Price accordingly. Try and create a brand - not brass utensils. A name that symbolises what you are selling so you can expand SKUs later on. Omni channel - same updates on all modes - Facebook/Instagram/Twitter/Threads and whatever else you want to use. Start small. Get Influencers once you are able to get a customer or 100 - free and then paid to talk up your brand and such. And slowly work your way up to a distributor locally in each country that you intend to operate - this is a much much later thing to do though. Go on Shark tank /s Bullshit."
}