{
    "id": "1dzq9xp",
    "title": "What are you funding when you donate to IFF?  | Radical transparency",
    "url": "https://www.reddit.com/r/india/comments/1dzq9xp/what_are_you_funding_when_you_donate_to_iff/",
    "selftext": "Hi,\n\nI am Ashlesh, Campaign and Advocacy Associate at IFF. You are receiving this email because you’ve been an IFF member/donor, and as a crucial part of our community, you are invited to IFF’s Quarterly Members’ & Donors’ call, happening tomorrow at 5:30 PM. \n\n*“But why??”*  \nSome of you are already familiar with what goes on in these calls and why we do them. But for the johnny-come-lately’s, here’s a quick refresher! \n\n**We are accountable to YOU, our supporters!** \n\nAs a tiny, donor-funded organisation which relies upon contributions from the people of India, your support and faith can only be maintained with greater transparency about our financial needs, fund inflows, and expenses. And we do this by \n\n* Proactively publishing monthly financial disclosures, with income and expenditure figures. ([here](https://forum.internetfreedom.in/t/financial-disclosure-2023/3368?ref=static.internetfreedom.in) and [here](https://x.com/search?q=%40internetfreedom%20financial%20disclosures&src=typed_query&f=live)) \n* Publishing tax reports, filings and documents related to board governance. ([here](https://internetfreedom.in/transparency-and-finances/?ref=static.internetfreedom.in)) \n* Hosting quarterly members’ and donors’ calls to touch base with our biggest cheerleaders, YOU GUYS! ([here](https://youtube.com/playlist?list=PLgcwCSsOJipovlZ5S6VdoKF_MsBgmCQ8J&si=wBn0oaN6ZN4fJRvZ&ref=static.internetfreedom.in)) \n\n**What goes on in these “Quarterly Members’ and Donors’ calls and why do we host them?** \n\nIn our quarterly calls, we walk you, our community, through what your money and support are going towards, what we have been working on for the last quarter, issues we are closely following, critical developments shaping our digital rights landscape, and our responses to them. \n\nThe presentation part of the call is live-streamed through  [Twitter](https://x.com/i/broadcasts/1YqJDgNrmqNGV) and [YouTube](https://youtube.com/live/LiP_TY4bac8), but as a member/donor, ***YOU*** get a chance to engage directly with the IFF staff and the community. Every quarter, all our supporters get to hop on the call and ask us questions, give their input/feedback, and hold us accountable! \n\nYour support is what makes our collective vision for a transparent, accountable and free internet possible. \n\nSee you tomorrow? \n\n  \nNot a member? Become one today and stand up for your digital rights! [https://internetfreedom.in/donate](https://internetfreedom.in/donate) ",
    "flair": "Policy/Economy",
    "score": 13,
    "num_comments": 2,
    "created_utc": 1720598682.0,
    "convurl": "https://external-preview.redd.it/Cdnov9rjkJfd15S12qPZyRBcq1MK3DjT1b1J4rXFxsg.jpg?auto=webp&s=3f6c6a5c5c31f4b430f6c7678ec8bd160555cfa9",
    "comments": [
        "This might sound naïve but are you like EFF but based on India?",
        "i will take that, hi!"
    ],
    "cleaned_text": "funding donate iff radical transparency hi ashlesh campaign advocacy associate iff receiving email youve iff memberdonor crucial part community invited iffs quarterly members donors call happening tomorrow pm already familiar goes calls johnnycomelatelys heres quick refresher accountable supporters tiny donorfunded organisation relies upon contributions people india support faith maintained greater transparency financial needs fund inflows expenses proactively publishing monthly financial disclosures income expenditure figures herehttpsforuminternetfreedomintfinancialdisclosurerefstaticinternetfreedomin herehttpsxcomsearchqinternetfreedomfinancialdisclosuressrctypedqueryflive publishing tax reports filings documents related board governance herehttpsinternetfreedomintransparencyandfinancesrefstaticinternetfreedomin hosting quarterly members donors calls touch base biggest cheerleaders guys herehttpsyoutubecomplaylistlistplgcwcssojipovlzsvdokfmsbgmcqjsiwbnoanznfjrvzrefstaticinternetfreedomin goes quarterly members donors calls host quarterly calls walk community money support going towards working last quarter issues closely following critical developments shaping digital rights landscape responses presentation part call livestreamed twitterhttpsxcomibroadcastsyqjdgnrmqngv youtubehttpsyoutubecomliveliptybac memberdonor get chance engage directly iff staff community every quarter supporters get hop call ask us questions give inputfeedback hold us accountable support makes collective vision transparent accountable free internet possible see tomorrow member become one today stand digital rights httpsinternetfreedomindonatehttpsinternetfreedomindonate ",
    "cleaned_title": "funding donate iff radical transparency",
    "cleaned_selftext": "hi ashlesh campaign advocacy associate iff receiving email youve iff memberdonor crucial part community invited iffs quarterly members donors call happening tomorrow pm already familiar goes calls johnnycomelatelys heres quick refresher accountable supporters tiny donorfunded organisation relies upon contributions people india support faith maintained greater transparency financial needs fund inflows expenses proactively publishing monthly financial disclosures income expenditure figures herehttpsforuminternetfreedomintfinancialdisclosurerefstaticinternetfreedomin herehttpsxcomsearchqinternetfreedomfinancialdisclosuressrctypedqueryflive publishing tax reports filings documents related board governance herehttpsinternetfreedomintransparencyandfinancesrefstaticinternetfreedomin hosting quarterly members donors calls touch base biggest cheerleaders guys herehttpsyoutubecomplaylistlistplgcwcssojipovlzsvdokfmsbgmcqjsiwbnoanznfjrvzrefstaticinternetfreedomin goes quarterly members donors calls host quarterly calls walk community money support going towards working last quarter issues closely following critical developments shaping digital rights landscape responses presentation part call livestreamed twitterhttpsxcomibroadcastsyqjdgnrmqngv youtubehttpsyoutubecomliveliptybac memberdonor get chance engage directly iff staff community every quarter supporters get hop call ask us questions give inputfeedback hold us accountable support makes collective vision transparent accountable free internet possible see tomorrow member become one today stand digital rights httpsinternetfreedomindonatehttpsinternetfreedomindonate",
    "cleaned_comments": "might sound nave like eff based india take hi",
    "light_cleaned_title": "What are you funding when you donate to IFF? | Radical transparency",
    "light_cleaned_selftext": "Hi, I am Ashlesh, Campaign and Advocacy Associate at IFF. You are receiving this email because you’ve been an IFF member/donor, and as a crucial part of our community, you are invited to IFF’s Quarterly Members’ & Donors’ call, happening tomorrow at 5:30 PM. *“But why??”* Some of you are already familiar with what goes on in these calls and why we do them. But for the johnny-come-lately’s, here’s a quick refresher! **We are accountable to YOU, our supporters!** As a tiny, donor-funded organisation which relies upon contributions from the people of India, your support and faith can only be maintained with greater transparency about our financial needs, fund inflows, and expenses. And we do this by * Proactively publishing monthly financial disclosures, with income and expenditure figures. ([here](https://forum.internetfreedom.in/t/financial-disclosure-2023/3368?ref=static.internetfreedom.in) and [here](https://x.com/search?q=%40internetfreedom%20financial%20disclosures&src=typed_query&f=live)) * Publishing tax reports, filings and documents related to board governance. ([here](https://internetfreedom.in/transparency-and-finances/?ref=static.internetfreedom.in)) * Hosting quarterly members’ and donors’ calls to touch base with our biggest cheerleaders, YOU GUYS! ([here](https://youtube.com/playlist?list=PLgcwCSsOJipovlZ5S6VdoKF_MsBgmCQ8J&si=wBn0oaN6ZN4fJRvZ&ref=static.internetfreedom.in)) **What goes on in these “Quarterly Members’ and Donors’ calls and why do we host them?** In our quarterly calls, we walk you, our community, through what your money and support are going towards, what we have been working on for the last quarter, issues we are closely following, critical developments shaping our digital rights landscape, and our responses to them. The presentation part of the call is live-streamed through [Twitter](https://x.com/i/broadcasts/1YqJDgNrmqNGV) and [YouTube](https://youtube.com/live/LiP_TY4bac8), but as a member/donor, ***YOU*** get a chance to engage directly with the IFF staff and the community. Every quarter, all our supporters get to hop on the call and ask us questions, give their input/feedback, and hold us accountable! Your support is what makes our collective vision for a transparent, accountable and free internet possible. See you tomorrow? Not a member? Become one today and stand up for your digital rights! [https://internetfreedom.in/donate](https://internetfreedom.in/donate)",
    "light_cleaned_comments": "This might sound naïve but are you like EFF but based on India? i will take that, hi!"
}