{
    "id": "14a0zhx",
    "title": "Easemytrip no convenience fees?",
    "url": "https://www.reddit.com/gallery/14a0zhx",
    "selftext": "Recently saw a podcast of the Easemytrip Founder Nishant Pitti where he claims that there's no convenience fees in Easemytrip but my recent experience says otherwise?\n\nBelow i compare trip price in Easemytrip(Pic one) and the indigo app(Pic 2), although Easemytrip is a bit cheaper the dreaded convenience fees is still very much there\n\nLink to the Podcast- https://youtu.be/WgtHo16hXyw",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1686831610.0,
    "convurl": "https://i.redd.it/3ohf4e5fc66b1.png",
    "comments": [
        "https://youtu.be/WgtHo16hXyw",
        "You have used easefly coupon code . Hence convenience fee is added . The default code for no convenience fee is emtncf. Only one code can be used at a time .",
        "You're right but there was an option to choose \"No convince\" fees earlier but since it wasn't an option i choose another code"
    ],
    "cleaned_text": "easemytrip convenience fees recently saw podcast easemytrip founder nishant pitti claims theres convenience fees easemytrip recent experience says otherwise compare trip price easemytrippic one indigo apppic although easemytrip bit cheaper dreaded convenience fees still much link podcast ",
    "cleaned_title": "easemytrip convenience fees",
    "cleaned_selftext": "recently saw podcast easemytrip founder nishant pitti claims theres convenience fees easemytrip recent experience says otherwise compare trip price easemytrippic one indigo apppic although easemytrip bit cheaper dreaded convenience fees still much link podcast",
    "cleaned_comments": "used easefly coupon code hence convenience fee added default code convenience fee emtncf one code used time youre right option choose convince fees earlier since wasnt option choose another code",
    "light_cleaned_title": "Easemytrip no convenience fees?",
    "light_cleaned_selftext": "Recently saw a podcast of the Easemytrip Founder Nishant Pitti where he claims that there's no convenience fees in Easemytrip but my recent experience says otherwise? Below i compare trip price in Easemytrip(Pic one) and the indigo app(Pic 2), although Easemytrip is a bit cheaper the dreaded convenience fees is still very much there Link to the Podcast-",
    "light_cleaned_comments": "You have used easefly coupon code . Hence convenience fee is added . The default code for no convenience fee is emtncf. Only one code can be used at a time . You're right but there was an option to choose \"No convince\" fees earlier but since it wasn't an option i choose another code"
}