{
    "id": "16tdinp",
    "title": "New NMC guidelines won’t allow new medical colleges, seats in any state of South India",
    "url": "https://www.reddit.com/r/india/comments/16tdinp/new_nmc_guidelines_wont_allow_new_medical/",
    "selftext": "Source:\n\n[https://thesouthfirst.com/health/new-nmc-guidelines-wont-allow-new-medical-colleges-seats-in-any-states-of-south-india/](https://thesouthfirst.com/health/new-nmc-guidelines-wont-allow-new-medical-colleges-seats-in-any-states-of-south-india/)\n\n\"...for an annual intake capacity of 50/100/150 seats: Provided that the medical college shall follow the ratio of 100 MBBS seats for every 10 lakh population in that state/U.T,\" reads the notification.\"\n\nhttps://preview.redd.it/2cqv2vkswqqb1.png?width=900&format=png&auto=webp&s=8048520e56f8d3fa0a3549213ad339988afb2f37\n\nIs this the new weapon against south BJP is using as they are not able to \"conquer\" the Souther states?",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 7,
    "created_utc": 1695797819,
    "convurl": "https://external-preview.redd.it/hrPH3gW9ABkSVBDfqweHMnZc7K9r6UcEvWd8kN5r678.jpg?auto=webp&s=722ce3f733b9c3e6b2b0f4ba9f91f485c525e8bc",
    "comments": [
        "Bjp is a disgrace.",
        "Pumping out more doctors is not a strategy. Essentially a lot of the seats are due to private medical colleges which have fuck all quality. South India is actually a place with the lowest doctor to patient ratio in the world. This destroys the income of doctors. I believe BJP has a better idea here",
        "Punishment for being Educated, progressive and not giving a F to BJ party.",
        "At the same , i wish NMC creates a rule saying all seats in south india belongs to south indians..",
        "They should've done this to Engineering colleges and deemed medical colleges.",
        "Probably because they've only laid one brick so far for Madurai AIMS lol. \n\nAlso, If seats are to be based on the state population, then only in-state students be admitted to them."
    ],
    "cleaned_text": "new nmc guidelines wont allow new medical colleges seats state south india source httpsthesouthfirstcomhealthnewnmcguidelineswontallownewmedicalcollegesseatsinanystatesofsouthindiahttpsthesouthfirstcomhealthnewnmcguidelineswontallownewmedicalcollegesseatsinanystatesofsouthindia annual intake capacity seats provided medical college shall follow ratio mbbs seats every lakh population stateut reads notification new weapon south bjp using able conquer souther states ",
    "cleaned_title": "new nmc guidelines wont allow new medical colleges seats state south india",
    "cleaned_selftext": "source httpsthesouthfirstcomhealthnewnmcguidelineswontallownewmedicalcollegesseatsinanystatesofsouthindiahttpsthesouthfirstcomhealthnewnmcguidelineswontallownewmedicalcollegesseatsinanystatesofsouthindia annual intake capacity seats provided medical college shall follow ratio mbbs seats every lakh population stateut reads notification new weapon south bjp using able conquer souther states",
    "cleaned_comments": "bjp disgrace pumping doctors strategy essentially lot seats due private medical colleges fuck quality south india actually place lowest doctor patient ratio world destroys income doctors believe bjp better idea punishment educated progressive giving f bj party wish nmc creates rule saying seats south india belongs south indians shouldve done engineering colleges deemed medical colleges probably theyve laid one brick far madurai aims lol also seats based state population instate students admitted",
    "light_cleaned_title": "New NMC guidelines won’t allow new medical colleges, seats in any state of South India",
    "light_cleaned_selftext": "Source: [https://thesouthfirst.com/health/new-nmc-guidelines-wont-allow-new-medical-colleges-seats-in-any-states-of-south-india/](https://thesouthfirst.com/health/new-nmc-guidelines-wont-allow-new-medical-colleges-seats-in-any-states-of-south-india/) \"...for an annual intake capacity of 50/100/150 seats: Provided that the medical college shall follow the ratio of 100 MBBS seats for every 10 lakh population in that state/U.T,\" reads the notification.\" Is this the new weapon against south BJP is using as they are not able to \"conquer\" the Souther states?",
    "light_cleaned_comments": "Bjp is a disgrace. Pumping out more doctors is not a strategy. Essentially a lot of the seats are due to private medical colleges which have fuck all quality. South India is actually a place with the lowest doctor to patient ratio in the world. This destroys the income of doctors. I believe BJP has a better idea here Punishment for being Educated, progressive and not giving a F to BJ party. At the same , i wish NMC creates a rule saying all seats in south india belongs to south indians.. They should've done this to Engineering colleges and deemed medical colleges. Probably because they've only laid one brick so far for Madurai AIMS lol. Also, If seats are to be based on the state population, then only in-state students be admitted to them."
}