{
    "id": "16kagsg",
    "title": "41000 per rat and in 2 years, they caught 168 rats!",
    "url": "https://i.redd.it/9k0244c20nob1.jpg",
    "selftext": "Source : https://m.economictimes.com/industry/transportation/railways/northern-railways-lucknow-division-spends-rs-69-lakh-to-catch-168-rats/articleshow/103710575.cms",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694878536.0,
    "convurl": "https://i.redd.it/9k0244c20nob1.jpg",
    "comments": [
        "My cat will catch those in 5 months. And only needs love and food",
        "41k per rat ? Hopefully they find the bureauc-rat who let this scam happen.",
        "Mera desh badal rha hai .. aage badh rha hai :)",
        "Aren't the real rats in the railway division.",
        "Only rats are getting expensive",
        "the actual solution would be to deal with the root cause. poor sanitation. pay the sanitation workers really really well, give them permanent government jobs instead of contracts, give them safety gear. penalize passengers for littering, built better toilets, better waste disposal, the rats won't have enough food and waste to eat then.\n\n&#x200B;\n\nI have been to stations in south and west India and they are way cleaner than north indian stations with the exception of a few.",
        "I could have done it cheaper.",
        "Yogi ji k raaj mein maal aise batega to Bhogi ji k Raj mein kya hoga",
        "I dunno why there hasn't been a paradigm shift in how Uttar Pradesh is dealt with",
        "One persian cat costs 20-35k ₹, You anuty nashnol won't understand master stroke of Gogiji. \n\n\\s",
        "69 Lakh, nice",
        "[Should have hired the King of Rats, he can slaughter 200 in a single sitting](https://youtu.be/j4N3CRuuqLY)\n\n[Or listened to his advice on tackling 10,000 rats](https://youtu.be/lSyqWbrxcG4)",
        "Huh. So around 41k to get one rat?",
        "1 rat catcher managed by 100 senior level employees in a bureaucratic administration is not easy. Poor guy was sick half the time and the entire administration worked tirelessly to manage him.",
        "Yogi hai toh mumkin hai."
    ],
    "cleaned_text": "per rat years caught rats source ",
    "cleaned_title": "per rat years caught rats",
    "cleaned_selftext": "source",
    "cleaned_comments": "cat catch months needs love food k per rat hopefully find bureaucrat let scam happen mera desh badal rha hai aage badh rha hai arent real rats railway division rats getting expensive actual solution would deal root cause poor sanitation pay sanitation workers really really well give permanent government jobs instead contracts give safety gear penalize passengers littering built better toilets better waste disposal rats wont enough food waste eat xb stations south west india way cleaner north indian stations exception could done cheaper yogi ji k raaj mein maal aise batega bhogi ji k raj mein kya hoga dunno hasnt paradigm shift uttar pradesh dealt one persian cat costs k anuty nashnol wont understand master stroke gogiji lakh nice hired king rats slaughter single sittinghttpsyoutubejncruuqly listened advice tackling ratshttpsyoutubelsyqwbrxcg huh around k get one rat rat catcher managed senior level employees bureaucratic administration easy poor guy sick half time entire administration worked tirelessly manage yogi hai toh mumkin hai",
    "light_cleaned_title": "41000 per rat and in 2 years, they caught 168 rats!",
    "light_cleaned_selftext": "Source :",
    "light_cleaned_comments": "My cat will catch those in 5 months. And only needs love and food 41k per rat ? Hopefully they find the bureauc-rat who let this scam happen. Mera desh badal rha hai .. aage badh rha hai :) Aren't the real rats in the railway division. Only rats are getting expensive the actual solution would be to deal with the root cause. poor sanitation. pay the sanitation workers really really well, give them permanent government jobs instead of contracts, give them safety gear. penalize passengers for littering, built better toilets, better waste disposal, the rats won't have enough food and waste to eat then. &#x200B; I have been to stations in south and west India and they are way cleaner than north indian stations with the exception of a few. I could have done it cheaper. Yogi ji k raaj mein maal aise batega to Bhogi ji k Raj mein kya hoga I dunno why there hasn't been a paradigm shift in how Uttar Pradesh is dealt with One persian cat costs 20-35k ₹, You anuty nashnol won't understand master stroke of Gogiji. \\s 69 Lakh, nice [Should have hired the King of Rats, he can slaughter 200 in a single sitting](https://youtu.be/j4N3CRuuqLY) [Or listened to his advice on tackling 10,000 rats](https://youtu.be/lSyqWbrxcG4) Huh. So around 41k to get one rat? 1 rat catcher managed by 100 senior level employees in a bureaucratic administration is not easy. Poor guy was sick half the time and the entire administration worked tirelessly to manage him. Yogi hai toh mumkin hai."
}