{
    "id": "1faf3ao",
    "title": "Why India should not have the Right to Disconnect",
    "url": "https://indianexpress.com/article/opinion/columns/right-to-disconnect-india-9550785/",
    "selftext": "This article argues against the right to disconnect in an Indian context.  If I understood the article well, the author is conflating \"the right to disconnect\" with a supposed decrease in productivity, and how we don't need it for continuing/initiating our rapid economic  development. \n\nI think the author severely downplays the advantages associated with it , from more free time with family to more time to dedicate for a range of physical activities which can aid productivity in the long run.\n\nWhy is there a hesitancy of acknowledging the real advantages that such a law can bring? Is it merely expediency from people in upper-level corporate/private firms to continue exploiting lower-level  employees' in the form of unpaid overtime?\n\nP.S. those people who work overtime on their own accord will do so regardless, they don't need follow up calls in the night from their concerned managers for the same.",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 5,
    "created_utc": 1725629025.0,
    "convurl": "https://external-preview.redd.it/qtZoTQdjIxT7lFrfrwU2pC7uAkhzS44_T-o8jyeaTzc.jpg?auto=webp&s=d335b777c25a279b4db4768084aa7016393271f5",
    "comments": [
        "Unpopular opinion: all these kinds of laws don’t do much, and aren’t really going to help.\n\nWhat’s going to fix Indian corporate world is at will employment laws, like in the US. Basically means, you can quit whenever you want. Even with 0 notice. If your employer can fire you anytime they want, you should have the ability to quit with 0 notice.\n\nLong notice periods and contracts are significantly hampering job mobility. If people jump ship, employers will then realise it’s hard to retain talented people and overall culture will improve. Pay will improve. \n\nWe should also move away from making the termination letter so important. If you quit, it should be illegal for an employer to delay/hold your termination letter. And overall, reduce the importance of termination letters.\n\nI have switched multiple jobs in the US, I was never asked termination letter from my previous job when I wanted to job a new one. Nobody cares about it. \n\nWhat will help improve Indian workers is easy and improved job mobility. When employers start to see their best employees jump ship the minute they are treated poorly, they will value workers.",
        "Silence corpo slave.",
        "Article must be funded by murthy type bois",
        "US has shitty employment laws, we need EU like laws.",
        "Had to be a fucking Brahmin."
    ],
    "cleaned_text": "india right disconnect article argues right disconnect indian context understood article well author conflating right disconnect supposed decrease productivity dont need continuinginitiating rapid economic development think author severely downplays advantages associated free time family time dedicate range physical activities aid productivity long run hesitancy acknowledging real advantages law bring merely expediency people upperlevel corporateprivate firms continue exploiting lowerlevel employees form unpaid overtime ps people work overtime accord regardless dont need follow calls night concerned managers ",
    "cleaned_title": "india right disconnect",
    "cleaned_selftext": "article argues right disconnect indian context understood article well author conflating right disconnect supposed decrease productivity dont need continuinginitiating rapid economic development think author severely downplays advantages associated free time family time dedicate range physical activities aid productivity long run hesitancy acknowledging real advantages law bring merely expediency people upperlevel corporateprivate firms continue exploiting lowerlevel employees form unpaid overtime ps people work overtime accord regardless dont need follow calls night concerned managers",
    "cleaned_comments": "unpopular opinion kinds laws dont much arent really going help whats going fix indian corporate world employment laws like us basically means quit whenever want even notice employer fire anytime want ability quit notice long notice periods contracts significantly hampering job mobility people jump ship employers realise hard retain talented people overall culture improve pay improve also move away making termination letter important quit illegal employer delayhold termination letter overall reduce importance termination letters switched multiple jobs us never asked termination letter previous job wanted job new one nobody cares help improve indian workers easy improved job mobility employers start see best employees jump ship minute treated poorly value workers silence corpo slave article must funded murthy type bois us shitty employment laws need eu like laws fucking brahmin",
    "light_cleaned_title": "Why India should not have the Right to Disconnect",
    "light_cleaned_selftext": "This article argues against the right to disconnect in an Indian context. If I understood the article well, the author is conflating \"the right to disconnect\" with a supposed decrease in productivity, and how we don't need it for continuing/initiating our rapid economic development. I think the author severely downplays the advantages associated with it , from more free time with family to more time to dedicate for a range of physical activities which can aid productivity in the long run. Why is there a hesitancy of acknowledging the real advantages that such a law can bring? Is it merely expediency from people in upper-level corporate/private firms to continue exploiting lower-level employees' in the form of unpaid overtime? P.S. those people who work overtime on their own accord will do so regardless, they don't need follow up calls in the night from their concerned managers for the same.",
    "light_cleaned_comments": "Unpopular opinion: all these kinds of laws don’t do much, and aren’t really going to help. What’s going to fix Indian corporate world is at will employment laws, like in the US. Basically means, you can quit whenever you want. Even with 0 notice. If your employer can fire you anytime they want, you should have the ability to quit with 0 notice. Long notice periods and contracts are significantly hampering job mobility. If people jump ship, employers will then realise it’s hard to retain talented people and overall culture will improve. Pay will improve. We should also move away from making the termination letter so important. If you quit, it should be illegal for an employer to delay/hold your termination letter. And overall, reduce the importance of termination letters. I have switched multiple jobs in the US, I was never asked termination letter from my previous job when I wanted to job a new one. Nobody cares about it. What will help improve Indian workers is easy and improved job mobility. When employers start to see their best employees jump ship the minute they are treated poorly, they will value workers. Silence corpo slave. Article must be funded by murthy type bois US has shitty employment laws, we need EU like laws. Had to be a fucking Brahmin."
}