{
    "id": "1g79w7a",
    "title": "Why are Indians emigrating in Amritkaal?",
    "url": "https://www.ndtv.com/india-news/going-abroad-new-disease-among-children-vice-presidents-lament-6826122#pfrom=home-ndtv_topscroll",
    "selftext": "\n\nThis guy is wondering why ? I guess he is well served during Amritkaal \n",
    "flair": "Policy/Economy",
    "score": 15,
    "num_comments": 5,
    "created_utc": 1729347460.0,
    "convurl": "https://external-preview.redd.it/OOSKvJky18aXzcyZHqEUFvyMAFZqIyabibVehxtEv80.jpg",
    "comments": [
        "At first it was because of jobs , now you can add work life balance too",
        "Add more excuses every other day. You are supposed to protest. Sitting at home and cribbing about something won't change an issue",
        ">\"An assessment is being made about what will happen to their future, people are now understanding how bright their future would have been if they had studied here.\"\n\nNever realized that the VP has an amazing sense of humor.",
        "Good question. But is he really ready to know the answer, or will he cut our mics off?",
        "Put exit tax on people emigrating, it’ll stop",
        "What would be the basis of this tax? How would it be calculated?\n\nThe kids of the BJP supporting upper middle classes are the first in line to leave. Imagine pissing off their richest supporters.\n\nPeople already take out huge loans to escape. thinking this would make any difference is delusional.\n\n🤡",
        "The tax will be calculated to offset the loss of potential tax contributions based on their educational qualifications and current earnings. I am sure the finance secretary can come up with a suitable formula.\n\nThe current craze is a hangover of the past and it’ll stop if the government actively discourages it. Many NRI patriots who had previously emigrated and acquired foreign citizenship have voulantarily renounced them to become an Indian citizen (e.g. Alshay Kumar).",
        "Protest against what ?? Its a cultural issue"
    ],
    "cleaned_text": "indians emigrating amritkaal guy wondering guess well served amritkaal ",
    "cleaned_title": "indians emigrating amritkaal",
    "cleaned_selftext": "guy wondering guess well served amritkaal",
    "cleaned_comments": "first jobs add work life balance add excuses every day supposed protest sitting home cribbing something wont change issue assessment made happen future people understanding bright future would studied never realized vp amazing sense humor good question really ready know answer cut mics put exit tax people emigrating itll stop would basis tax would calculated kids bjp supporting upper middle classes first line leave imagine pissing richest supporters people already take huge loans escape thinking would make difference delusional tax calculated offset loss potential tax contributions based educational qualifications current earnings sure finance secretary come suitable formula current craze hangover past itll stop government actively discourages many nri patriots previously emigrated acquired foreign citizenship voulantarily renounced become indian citizen eg alshay kumar protest cultural issue",
    "light_cleaned_title": "Why are Indians emigrating in Amritkaal?",
    "light_cleaned_selftext": "This guy is wondering why ? I guess he is well served during Amritkaal",
    "light_cleaned_comments": "At first it was because of jobs , now you can add work life balance too Add more excuses every other day. You are supposed to protest. Sitting at home and cribbing about something won't change an issue >\"An assessment is being made about what will happen to their future, people are now understanding how bright their future would have been if they had studied here.\" Never realized that the VP has an amazing sense of humor. Good question. But is he really ready to know the answer, or will he cut our mics off? Put exit tax on people emigrating, it’ll stop What would be the basis of this tax? How would it be calculated? The kids of the BJP supporting upper middle classes are the first in line to leave. Imagine pissing off their richest supporters. People already take out huge loans to escape. thinking this would make any difference is delusional. 🤡 The tax will be calculated to offset the loss of potential tax contributions based on their educational qualifications and current earnings. I am sure the finance secretary can come up with a suitable formula. The current craze is a hangover of the past and it’ll stop if the government actively discourages it. Many NRI patriots who had previously emigrated and acquired foreign citizenship have voulantarily renounced them to become an Indian citizen (e.g. Alshay Kumar). Protest against what ?? Its a cultural issue"
}