{
    "id": "184wlwb",
    "title": "\"Apart from Jaitely & Gadkari, No One..\" I Inside Modi's Government Meetings I Top Bureaucrat Reveal",
    "url": "https://youtu.be/2cyaprLKGMA?si=YMZdxCQuyV8Pumnm",
    "selftext": "Must watch! Gives in sight on how politicians work.",
    "flair": "Politics",
    "score": 16,
    "num_comments": 7,
    "created_utc": 1701066999.0,
    "convurl": "https://external-preview.redd.it/loZ5zFmj1YnIoIgzU4nieIhRKZFfFvLzgkXGUcLAjMU.jpg?auto=webp&s=616d8bf5ab66c5a733a37e7953a759e2d917f72b",
    "comments": [
        "An insightful interview. If Arun Jaitely  had been around things would have probably been different......",
        "Please watch this interview. His insights are really good.",
        "Tired of insights..how to implement change?",
        "An insightful interview. \n\nHe talks about following things\n\n* centralization in BJP and complete decentralization of power in UPA and also says instead we should have a middle ground. \n* Jaitley was an excellent negotiator. \n* Gadhkari and Jaitley could only say No to Lord Modi. \n* Then he talks about some unknown bureaucrats. \n* Corruption in civil servants and politicians are not real villains, it is the bureaucrats who are corrupted.",
        "Bro 😭😭. I will notice it for eternity.",
        "Electoral bonds says hi🤣"
    ],
    "cleaned_text": "apart jaitely gadkari one inside modis government meetings top bureaucrat reveal must watch gives sight politicians work ",
    "cleaned_title": "apart jaitely gadkari one inside modis government meetings top bureaucrat reveal",
    "cleaned_selftext": "must watch gives sight politicians work",
    "cleaned_comments": "insightful interview arun jaitely around things would probably different please watch interview insights really good tired insightshow implement change insightful interview talks following things centralization bjp complete decentralization power upa also says instead middle ground jaitley excellent negotiator gadhkari jaitley could say lord modi talks unknown bureaucrats corruption civil servants politicians real villains bureaucrats corrupted bro notice eternity electoral bonds says hi",
    "light_cleaned_title": "\"Apart from Jaitely & Gadkari, No One..\" I Inside Modi's Government Meetings I Top Bureaucrat Reveal",
    "light_cleaned_selftext": "Must watch! Gives in sight on how politicians work.",
    "light_cleaned_comments": "An insightful interview. If Arun Jaitely had been around things would have probably been different...... Please watch this interview. His insights are really good. Tired of insights..how to implement change? An insightful interview. He talks about following things * centralization in BJP and complete decentralization of power in UPA and also says instead we should have a middle ground. * Jaitley was an excellent negotiator. * Gadhkari and Jaitley could only say No to Lord Modi. * Then he talks about some unknown bureaucrats. * Corruption in civil servants and politicians are not real villains, it is the bureaucrats who are corrupted. Bro 😭😭. I will notice it for eternity. Electoral bonds says hi🤣"
}