{
    "id": "1h1lpww",
    "title": "'Judiciary Not Here To Perform Opposition's Role': Ex Chief Justice DY Chandrachud",
    "url": "https://www.ndtv.com/india-news/dy-chandrachud-judiciary-not-here-to-perform-oppositions-role-7107981",
    "selftext": "Former Chief Justice of India DY Chandrachud said that there is a separate space in a democracy for the political opposition.",
    "flair": "Law & Courts",
    "score": 6,
    "num_comments": 8,
    "created_utc": 1732761030.0,
    "convurl": "https://external-preview.redd.it/nM2nxYTsvkkcHcFrzxFJijBygpuU87Jwxv5qpZBprCg.jpg?auto=webp&s=54db9e34bd61d223a4310ac83eff021680fbc222",
    "comments": [
        "Why did you not do your job then?",
        "Yes, in normal times, the opposition is given a healthy space, they're given a say in decisions and there's some bipartisanship. But in today's time, the judiciary needs to get its act together and step in, giving blank statements to absolve themselves of responsibilities is cowardly.",
        "O bhai tu rehn de, aaya bada democracy ka rakshak.",
        "He proved to be the biggest disappointment after Gogoi disaster people has so much hope from him. But he failed on multiple occasions.\n\nAnd its proving worse after retirement with all these media appearances",
        "Chandu is nothing but a lazy traitor.",
        "That's fine but then judiciary shouldn't roll with executive's wishes either. You're supposed to be a brake on the executive, not their turbo.",
        "Is there any upcoming vacancy in Rajbhavans/LokPal/Tribunals?",
        "Says the guy who gave the verdict that \"the Governor performed illegally but the illegal government is legal because the CM resigned\""
    ],
    "cleaned_text": "judiciary perform oppositions role ex chief justice dy chandrachud former chief justice india dy chandrachud said separate space democracy political opposition ",
    "cleaned_title": "judiciary perform oppositions role ex chief justice dy chandrachud",
    "cleaned_selftext": "former chief justice india dy chandrachud said separate space democracy political opposition",
    "cleaned_comments": "job yes normal times opposition given healthy space theyre given say decisions theres bipartisanship todays time judiciary needs get act together step giving blank statements absolve responsibilities cowardly bhai tu rehn de aaya bada democracy ka rakshak proved biggest disappointment gogoi disaster people much hope failed multiple occasions proving worse retirement media appearances chandu nothing lazy traitor thats fine judiciary shouldnt roll executives wishes either youre supposed brake executive turbo upcoming vacancy rajbhavanslokpaltribunals says guy gave verdict governor performed illegally illegal government legal cm resigned",
    "light_cleaned_title": "'Judiciary Not Here To Perform Opposition's Role': Ex Chief Justice DY Chandrachud",
    "light_cleaned_selftext": "Former Chief Justice of India DY Chandrachud said that there is a separate space in a democracy for the political opposition.",
    "light_cleaned_comments": "Why did you not do your job then? Yes, in normal times, the opposition is given a healthy space, they're given a say in decisions and there's some bipartisanship. But in today's time, the judiciary needs to get its act together and step in, giving blank statements to absolve themselves of responsibilities is cowardly. O bhai tu rehn de, aaya bada democracy ka rakshak. He proved to be the biggest disappointment after Gogoi disaster people has so much hope from him. But he failed on multiple occasions. And its proving worse after retirement with all these media appearances Chandu is nothing but a lazy traitor. That's fine but then judiciary shouldn't roll with executive's wishes either. You're supposed to be a brake on the executive, not their turbo. Is there any upcoming vacancy in Rajbhavans/LokPal/Tribunals? Says the guy who gave the verdict that \"the Governor performed illegally but the illegal government is legal because the CM resigned\""
}