{
    "id": "1675vb1",
    "title": "Karnataka High Court declares as null and void election of Prajwal Revanna from Hassan Lok Sabha constituency",
    "url": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-declares-as-null-and-void-election-of-prajwal-revanna-from-hassan-lok-sabha-constituency/article67259351.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fkarnataka%2Fkarnataka-high-court-declares-as-null-and-void-election-of-prajwal-revanna-from-hassan-lok-sabha-constituency%2Farticle67259351.ece",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693571552.0,
    "convurl": "https://external-preview.redd.it/N2r08mRD6fc74ypCya1kwS1_WWxQdbiCz0E1ZpeXSLw.jpg?auto=webp&s=19f1fdcbbe0eb8a7a096f19b5ddc590848e1c1ee",
    "comments": [
        ">Meanwhile, the Court also rejected the plea of A. Manju, who had then unsuccessfully contested in the elections from the Bhartiya Janata Party, to declare him as a returned candidate in place of Mr. Prajwal. The Court said that it cannot declare Mr. Manju as the returned candidate as he too had indulged in corrupt practices.\n\n>The petitioners had complained that Mr. Prajwal had indulged in various corrupt practice, including not disclosing all the assets and furnishing wrong disclosure on his assets and other particulars, which itself amounts to a corrupt practice under the Representation of the People Act, 1951. "
    ],
    "cleaned_text": "karnataka high court declares null void election prajwal revanna hassan lok sabha constituency  ",
    "cleaned_title": "karnataka high court declares null void election prajwal revanna hassan lok sabha constituency",
    "cleaned_selftext": "",
    "cleaned_comments": "meanwhile court also rejected plea manju unsuccessfully contested elections bhartiya janata party declare returned candidate place mr prajwal court said declare mr manju returned candidate indulged corrupt practices petitioners complained mr prajwal indulged various corrupt practice including disclosing assets furnishing wrong disclosure assets particulars amounts corrupt practice representation people act",
    "light_cleaned_title": "Karnataka High Court declares as null and void election of Prajwal Revanna from Hassan Lok Sabha constituency",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">Meanwhile, the Court also rejected the plea of A. Manju, who had then unsuccessfully contested in the elections from the Bhartiya Janata Party, to declare him as a returned candidate in place of Mr. Prajwal. The Court said that it cannot declare Mr. Manju as the returned candidate as he too had indulged in corrupt practices. >The petitioners had complained that Mr. Prajwal had indulged in various corrupt practice, including not disclosing all the assets and furnishing wrong disclosure on his assets and other particulars, which itself amounts to a corrupt practice under the Representation of the People Act, 1951."
}