{
    "id": "17x8zqb",
    "title": "Proposed criminal code gives more immunity to defence personnel",
    "url": "https://www.thehindu.com/news/national/proposed-criminal-code-will-require-central-or-state-government-nod-to-register-cases-against-armed-forces-personnel/article67536432.ece",
    "selftext": "What kind of aftereffcts will we see once this gets passed? \n\n1. Protests by opposition or civil groups being stopped with violence by the armed forces?\n2. War crimes on minorities which will be not reported and not be acted on?\n3. Possibility of a military uprising which the govt fails to stop ?",
    "flair": "Politics",
    "score": 28,
    "num_comments": 5,
    "created_utc": 1700202959,
    "convurl": "https://external-preview.redd.it/m8HAF8qMzKdCv84_-7ztiRu7nltwLpVJEE_gA7a6tfg.jpg?auto=webp&s=40964ac3bd61a37dff4b35d54a6514889b8b117b",
    "comments": [
        "Maybe 1 and2 but not 3.",
        "Think about this scenario, some generals plan a coup for whatever reasons. Use official govt orders to stop protests or any other deployment etc as a reason and march on & try to establish control. Soldiers from different ranks join. \n\nLet's say the coup fails. Can they be tried under treason etc or will they have immunity.. \n\nVery unrealistic scenario but giving it a thought",
        "Anyone who knows the organization structure of the army knows that this scenario is impossible. \n\nAlso, in India, military strength doesn't solely reside in the army. This is also true for several other countries, including the USA. It's basically a failsafe against coup attempts.",
        "Pakistan /china me bhi aisa hi hai",
        "Not really aware.. could you please share how it's different from where coups have been attempted?",
        "In countries where coups have happened, the military power revolves around the army because it's the one with the manpower. They also have a history of instability, so the military has something of a roadmap on what to do. In some ways, it's like crossing the Rubicon in the Roman empire. No one does it for centuries, but once Sula does it, everyone's jumping across the Rubicon. \n\nThere aren't a few generals that control the army. There are dozens of generals, corpse commanders, field commanders, brigadiers etc. that need to be convinced. Then there's Navy, Air Force, CRPF, ITBP, BSF, etc. that don't exactly look forward to military rule. Plus, everything has to be kept quiet or the jig is up.\n\nIf there's someone charismatic enough to pull this off, they'll find it easier to win a majority in the LS.\n\nThe US follows a similar system, though the manpower is more equally distributed within the military. Generally though, the Navy and Army form manpower counters to each other.",
        "Indian Armed forces are all segregated just like the country and don't have much unity across regiments and the higher ups are perceived as first rate assholes that the cadre hates. There is no chance that a general gets idolized enough that the soldiers would participate in a coup for their benefit. So, its fair to assume that we don't have problems on that front.\n\nAlso FYI, RSS is several times the strength of the Indian armed forces. We are more at threat from that group than the armed forces.",
        "That was a good read! Thanks.. appreciate it."
    ],
    "cleaned_text": "proposed criminal code gives immunity defence personnel kind aftereffcts see gets passed protests opposition civil groups stopped violence armed forces war crimes minorities reported acted possibility military uprising govt fails stop ",
    "cleaned_title": "proposed criminal code gives immunity defence personnel",
    "cleaned_selftext": "kind aftereffcts see gets passed protests opposition civil groups stopped violence armed forces war crimes minorities reported acted possibility military uprising govt fails stop",
    "cleaned_comments": "maybe think scenario generals plan coup whatever reasons use official govt orders stop protests deployment etc reason march try establish control soldiers different ranks join lets say coup fails tried treason etc immunity unrealistic scenario giving thought anyone knows organization structure army knows scenario impossible also india military strength doesnt solely reside army also true several countries including usa basically failsafe coup attempts pakistan china bhi aisa hi hai really aware could please share different coups attempted countries coups happened military power revolves around army one manpower also history instability military something roadmap ways like crossing rubicon roman empire one centuries sula everyones jumping across rubicon arent generals control army dozens generals corpse commanders field commanders brigadiers etc need convinced theres navy air force crpf itbp bsf etc dont exactly look forward military rule plus everything kept quiet jig theres someone charismatic enough pull theyll find easier win majority ls us follows similar system though manpower equally distributed within military generally though navy army form manpower counters indian armed forces segregated like country dont much unity across regiments higher ups perceived first rate assholes cadre hates chance general gets idolized enough soldiers would participate coup benefit fair assume dont problems front also fyi rss several times strength indian armed forces threat group armed forces good read thanks appreciate",
    "light_cleaned_title": "Proposed criminal code gives more immunity to defence personnel",
    "light_cleaned_selftext": "What kind of aftereffcts will we see once this gets passed? 1. Protests by opposition or civil groups being stopped with violence by the armed forces? 2. War crimes on minorities which will be not reported and not be acted on? 3. Possibility of a military uprising which the govt fails to stop ?",
    "light_cleaned_comments": "Maybe 1 and2 but not 3. Think about this scenario, some generals plan a coup for whatever reasons. Use official govt orders to stop protests or any other deployment etc as a reason and march on & try to establish control. Soldiers from different ranks join. Let's say the coup fails. Can they be tried under treason etc or will they have immunity.. Very unrealistic scenario but giving it a thought Anyone who knows the organization structure of the army knows that this scenario is impossible. Also, in India, military strength doesn't solely reside in the army. This is also true for several other countries, including the USA. It's basically a failsafe against coup attempts. Pakistan /china me bhi aisa hi hai Not really aware.. could you please share how it's different from where coups have been attempted? In countries where coups have happened, the military power revolves around the army because it's the one with the manpower. They also have a history of instability, so the military has something of a roadmap on what to do. In some ways, it's like crossing the Rubicon in the Roman empire. No one does it for centuries, but once Sula does it, everyone's jumping across the Rubicon. There aren't a few generals that control the army. There are dozens of generals, corpse commanders, field commanders, brigadiers etc. that need to be convinced. Then there's Navy, Air Force, CRPF, ITBP, BSF, etc. that don't exactly look forward to military rule. Plus, everything has to be kept quiet or the jig is up. If there's someone charismatic enough to pull this off, they'll find it easier to win a majority in the LS. The US follows a similar system, though the manpower is more equally distributed within the military. Generally though, the Navy and Army form manpower counters to each other. Indian Armed forces are all segregated just like the country and don't have much unity across regiments and the higher ups are perceived as first rate assholes that the cadre hates. There is no chance that a general gets idolized enough that the soldiers would participate in a coup for their benefit. So, its fair to assume that we don't have problems on that front. Also FYI, RSS is several times the strength of the Indian armed forces. We are more at threat from that group than the armed forces. That was a good read! Thanks.. appreciate it."
}