{
    "id": "16fcyf3",
    "title": "Selling 942 INR in Uber Cash due to being scammed in India and not being able to use it in my home country",
    "url": "https://www.reddit.com/r/india/comments/16fcyf3/selling_942_inr_in_uber_cash_due_to_being_scammed/",
    "selftext": "Hi all,\nI had an unfortunate situation on my last day of visiting Delhi last month. My Uber driver scammed me of around 1000 INR by telling me I needed to pay non-existing toll taxes. I contacted Uber that refunded me the money in Uber Cash. Unfortanetly, I can not use it here in my home country (Sweden) due to Ubers policy.\n\nI am therefore selling this uber cash of 942 INR to the highest bidder. Please message me for further proof.\n\nThanks.\n\n\nhttps://imgur.com/a/c5U1e1K",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694382736.0,
    "convurl": "https://external-preview.redd.it/0XNOwI6AH_vf8V1w0dRUID_p747Ha2ez7Ydpl3wyCAc.jpg?auto=webp&s=f5e1f9774090f37ffdea716b1abe234d6ad91799",
    "comments": [
        "Highest bidder what? Why would someone bid for it",
        "you can use uber cash to pay for uber trips",
        "150 rupiya dega"
    ],
    "cleaned_text": "selling inr uber cash due scammed india able use home country hi unfortunate situation last day visiting delhi last month uber driver scammed around inr telling needed pay nonexisting toll taxes contacted uber refunded money uber cash unfortanetly use home country sweden due ubers policy therefore selling uber cash inr highest bidder please message proof thanks ",
    "cleaned_title": "selling inr uber cash due scammed india able use home country",
    "cleaned_selftext": "hi unfortunate situation last day visiting delhi last month uber driver scammed around inr telling needed pay nonexisting toll taxes contacted uber refunded money uber cash unfortanetly use home country sweden due ubers policy therefore selling uber cash inr highest bidder please message proof thanks",
    "cleaned_comments": "highest bidder would someone bid use uber cash pay uber trips rupiya dega",
    "light_cleaned_title": "Selling 942 INR in Uber Cash due to being scammed in India and not being able to use it in my home country",
    "light_cleaned_selftext": "Hi all, I had an unfortunate situation on my last day of visiting Delhi last month. My Uber driver scammed me of around 1000 INR by telling me I needed to pay non-existing toll taxes. I contacted Uber that refunded me the money in Uber Cash. Unfortanetly, I can not use it here in my home country (Sweden) due to Ubers policy. I am therefore selling this uber cash of 942 INR to the highest bidder. Please message me for further proof. Thanks.",
    "light_cleaned_comments": "Highest bidder what? Why would someone bid for it you can use uber cash to pay for uber trips 150 rupiya dega"
}