{
    "id": "14j500a",
    "title": "Help a farming family in Erode, Tamil Nadu selling 20,000 coconuts?",
    "url": "https://www.reddit.com/r/india/comments/14j500a/help_a_farming_family_in_erode_tamil_nadu_selling/",
    "selftext": "Hello, all \n\ni am helping one farming family in erode, who have 20,000 mature coconuts. \n\ndo you think anyone of you can help? Or guide?\n\nLike where to find buyers?\n\nThey are ready to sell for 15 rs each. (excluding shipping that can range between 2 rs to 10 rs depending on shipping method/quantity) \n\nmarket rate is around 30-35 rs.\n\ntheir website is [www.apanest.buzz](https://www.apanest.buzz) you can check it out. \n\ncheers! \n\n&#x200B;",
    "flair": "AskIndia",
    "score": 18,
    "num_comments": 6,
    "created_utc": 1687747440.0,
    "convurl": "https://external-preview.redd.it/05VICBel_KyhgzHKOTy_bgvTDaI8XiE-ymevdApzW0M.jpg?auto=webp&v=enabled&s=be7400b99e316640779db031ec830874c603c7e5",
    "comments": [
        "Indiamart maybe",
        "Bro, convert that to coconut oil. Sell in bulk.",
        "Try posting on your local Facebook and WhatsApp groups. They have better reach.",
        "Have you considered exporting? Contact local trading companies. China s buying big bulk and signing lease with coconut farms.",
        "Pay 700-800 Rs to any popular journalist and ask her to tweet this adding emotional touch. All will be sold out within a month",
        "i wish i knew such people"
    ],
    "cleaned_text": "help farming family erode tamil nadu selling coconuts hello helping one farming family erode mature coconuts think anyone help guide like find buyers ready sell rs excluding shipping range rs rs depending shipping methodquantity market rate around rs website wwwapanestbuzzhttpswwwapanestbuzz check cheers xb ",
    "cleaned_title": "help farming family erode tamil nadu selling coconuts",
    "cleaned_selftext": "hello helping one farming family erode mature coconuts think anyone help guide like find buyers ready sell rs excluding shipping range rs rs depending shipping methodquantity market rate around rs website wwwapanestbuzzhttpswwwapanestbuzz check cheers xb",
    "cleaned_comments": "indiamart maybe bro convert coconut oil sell bulk try posting local facebook whatsapp groups better reach considered exporting contact local trading companies china buying big bulk signing lease coconut farms pay rs popular journalist ask tweet adding emotional touch sold within month wish knew people",
    "light_cleaned_title": "Help a farming family in Erode, Tamil Nadu selling 20,000 coconuts?",
    "light_cleaned_selftext": "Hello, all i am helping one farming family in erode, who have 20,000 mature coconuts. do you think anyone of you can help? Or guide? Like where to find buyers? They are ready to sell for 15 rs each. (excluding shipping that can range between 2 rs to 10 rs depending on shipping method/quantity) market rate is around 30-35 rs. their website is [www.apanest.buzz](https://www.apanest.buzz) you can check it out. cheers! &#x200B;",
    "light_cleaned_comments": "Indiamart maybe Bro, convert that to coconut oil. Sell in bulk. Try posting on your local Facebook and WhatsApp groups. They have better reach. Have you considered exporting? Contact local trading companies. China s buying big bulk and signing lease with coconut farms. Pay 700-800 Rs to any popular journalist and ask her to tweet this adding emotional touch. All will be sold out within a month i wish i knew such people"
}