{
    "id": "1adladl",
    "title": "CJI suggestion in stark contradiction to his own actions",
    "url": "https://i.redd.it/yup24fq0safc1.jpeg",
    "selftext": "Current CJI seems most willing to compromise than anyone in Supreme Court’s history but that doesn’t stop him from dishing out this nonsense to others.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1706498447.0,
    "convurl": "https://i.redd.it/yup24fq0safc1.jpeg",
    "comments": [
        "Like?",
        "Give me examples please",
        "Our courts have become a joke. Thanks to nepotism and casteism. Which has ensured that any person with a spine or and shred of decency is sidelined and dismissed. \n\nThe result is a Supreme Court which makes judgements based on politics and convenience over right and wrong."
    ],
    "cleaned_text": "cji suggestion stark contradiction actions current cji seems willing compromise anyone supreme courts history doesnt stop dishing nonsense others ",
    "cleaned_title": "cji suggestion stark contradiction actions",
    "cleaned_selftext": "current cji seems willing compromise anyone supreme courts history doesnt stop dishing nonsense others",
    "cleaned_comments": "like give examples please courts become joke thanks nepotism casteism ensured person spine shred decency sidelined dismissed result supreme court makes judgements based politics convenience right wrong",
    "light_cleaned_title": "CJI suggestion in stark contradiction to his own actions",
    "light_cleaned_selftext": "Current CJI seems most willing to compromise than anyone in Supreme Court’s history but that doesn’t stop him from dishing out this nonsense to others.",
    "light_cleaned_comments": "Like? Give me examples please Our courts have become a joke. Thanks to nepotism and casteism. Which has ensured that any person with a spine or and shred of decency is sidelined and dismissed. The result is a Supreme Court which makes judgements based on politics and convenience over right and wrong."
}