{
    "id": "13qi7m1",
    "title": "Bengaluru floods: All eyes on new State government and Chief Minister Siddaramaiah",
    "url": "https://www.moneycontrol.com/news/business/bengaluru-floods-all-eyes-on-new-state-government-and-chief-minister-siddaramaiah-10652811.html",
    "selftext": "Six months after it was drowned by a deluge, not much has changed in Bengaluru. Basements continue to be inundated, and major roads continue to overflow in India’s so-called Silicon Valley. The sudden deluge brought back traumatic memories for many in the city, and created new ones, claiming a young life.",
    "flair": "Politics",
    "score": 19,
    "num_comments": 3,
    "created_utc": 1684925824.0,
    "convurl": "https://external-preview.redd.it/JUhHhVR7mwE9nXexz4oinbg9D8EO2IfCxu1-oONO9kw.jpg?auto=webp&v=enabled&s=c63a593574c2954624e29b9bdd4dbd0197dd77aa",
    "comments": [
        "They can start by kicking out Tushar Giri Nath immediately, both for repeated shoddiness and pro-BJP partisanship.",
        "BBMP needs cleaning along with the gutters."
    ],
    "cleaned_text": "bengaluru floods eyes new state government chief minister siddaramaiah six months drowned deluge much changed bengaluru basements continue inundated major roads continue overflow indias socalled silicon valley sudden deluge brought back traumatic memories many city created new ones claiming young life ",
    "cleaned_title": "bengaluru floods eyes new state government chief minister siddaramaiah",
    "cleaned_selftext": "six months drowned deluge much changed bengaluru basements continue inundated major roads continue overflow indias socalled silicon valley sudden deluge brought back traumatic memories many city created new ones claiming young life",
    "cleaned_comments": "start kicking tushar giri nath immediately repeated shoddiness probjp partisanship bbmp needs cleaning along gutters",
    "light_cleaned_title": "Bengaluru floods: All eyes on new State government and Chief Minister Siddaramaiah",
    "light_cleaned_selftext": "Six months after it was drowned by a deluge, not much has changed in Bengaluru. Basements continue to be inundated, and major roads continue to overflow in India’s so-called Silicon Valley. The sudden deluge brought back traumatic memories for many in the city, and created new ones, claiming a young life.",
    "light_cleaned_comments": "They can start by kicking out Tushar Giri Nath immediately, both for repeated shoddiness and pro-BJP partisanship. BBMP needs cleaning along with the gutters."
}