{
    "id": "1ckowaw",
    "title": "How wealthy is India? ",
    "url": "https://www.reddit.com/r/india/comments/1ckowaw/how_wealthy_is_india/",
    "selftext": "Lately I've been trying to research how wealthy Indian citizens are. Whenever I've tried to discuss this with my peers in India, they've told me that lots of Indians are wealthy but they don't pay income taxes. So we will need to dig a bit deeper and estimate based of indirect metrics. \n\n**1. Number of iPhones sold in a year.**\n\nApple sold 10 million iPhones in India in 2023 compared to 50 million sold in China in 2021. It's hard to find an accurate number for the last year. \n\n[https://www.livemint.com/technology/apple-tops-india-smartphone-revenue-in-2023-nears-10-bn-mark-11706708396436.html](https://www.livemint.com/technology/apple-tops-india-smartphone-revenue-in-2023-nears-10-bn-mark-11706708396436.html)\n\n[https://www.gizchina.com/2022/08/26/apple-china-sold-380-million-iphone-smartphones-in-10-years/](https://www.gizchina.com/2022/08/26/apple-china-sold-380-million-iphone-smartphones-in-10-years/)\n\n**2. Number of netflix/ott subscribers in India.** \n\nNetflix - 6.5 Million and Hotstar - 40 Million. \n\n[https://tcrn.ch/48ULkKr](https://tcrn.ch/48ULkKr)\n\n**3. Number of people who have at-least flown by air in the preceding year.** \n\nThere no data on unique flyers but total passengers were 450M. Given that most flights would be a round trip, we can divide this number by 2 and get 225 million. This would likely be the upper ceiling of the unique flyers if there were no repeat flyers (unlikely). \n\n[https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/indias-domestic-air-passenger-traffic-touches-record-high-on-nov-19/articleshow/105356249.cms?from=mdr](https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/indias-domestic-air-passenger-traffic-touches-record-high-on-nov-19/articleshow/105356249.cms?from=mdr)\n\n**4. Amount of data transferred from Steam servers to India.** \n\nIndia - 6.8 PB, Indonesia (with 5 times less population) - 6.4 PB, China - 292 PB, Australia (with 50 times less population) - 17.8 PB  \n\n[https://store.steampowered.com/stats/content/](https://store.steampowered.com/stats/content/)\n\nEither we in India don't play any games or we don't have money to buy games or there isn't any private space in house to play games for most people or maybe there is some other reason. \n\n**5. Number of monthly unique users of Youtube in India.**  \n\n460 Million  - [https://www.statista.com/statistics/280685/number-of-monthly-unique-youtube-users/](https://www.statista.com/statistics/280685/number-of-monthly-unique-youtube-users/) \n\n**6. Number of people who have at-least ordered once from a food delivery app in the last year.** \n\n60 million estimate from - [https://www.goldmansachs.com/intelligence/pages/indias-affluent-population-is-likely-to-hit-100-million-by-2027.html](https://www.goldmansachs.com/intelligence/pages/indias-affluent-population-is-likely-to-hit-100-million-by-2027.html) \n\nLastly biggest consumer markets - [https://en.wikipedia.org/wiki/List\\_of\\_largest\\_consumer\\_markets](https://en.wikipedia.org/wiki/List_of_largest_consumer_markets) \n\nBy these metrics, India is clearly growing but the start base is very low. Just 40-60 million people in India have enough disposable income to spend on non-necessities as above. That’s like a small middle-income country. Indonesia is a surprise to me; they seem to have a done a decent job lately. This number would likely grow to \\~100 million soon but at the cost of growing inequality. India has not been investing enough into its education sector and without that it can’t be like USA and EU who invented steam engine, processors, smartphones operating systems, internet and now AI advancements. Without education, a nation can not build new sources of wealth and will likely be forever bound by its natural resources and be dependent on others to share new technology.",
    "flair": "Policy/Economy",
    "score": 248,
    "num_comments": 69,
    "created_utc": 1714907552.0,
    "convurl": "https://external-preview.redd.it/RO8KDdu2RMbIEgqbPMVV0ucI_TLDfGJwmsH8-LVarwc.jpg?auto=webp&s=ab0de0c4fa7b1e4f8378d72af40d2f7af92cb92b",
    "comments": [
        "https://preview.redd.it/sp93sc2tdlyc1.jpeg?width=654&format=pjpg&auto=webp&s=c083541a4d7e230f7ed6f355ed1ec013943cf66a",
        "Compare luxury car sales and you’ll get the real depressing picture. Companies like Mercedes sell >500k cars a year in China and just 10-12k in India.\n\nIndia has just 1.5% people which earn enough to pay income taxes. Even if you have just as many hiding their wealth (highly unlikely) that still gives you 3%.\n\nFact of the matter is that at least 95% of our population is either low income or downright poor. This is also why the taxes in India are so high with such poor benefits. \n\nOne more factoid:\n\n* Average indirect taxes are around 9k rupees per year per capita\n\n* Average direct taxes are around 4 lakhs per year per capita for income tax payers.",
        "If we spend our budget, time and effort on communal matters, then we will have less for healthcare and education.",
        "Is there a way to get median tax paid ? ",
        "It's unlikely that India would ever achieve the development level of where China is now. Not in our lifetime anyways.  So comparision against China, might as well be comparision against USA now. Both the nations are absurdly prosperous and developed compared to India. What really sucks is that India is even lagging behind ASEAN now. Compared to rest of the planet, an average human would be better off in India only when compared to Africa and some war torn countries. Every other place is now more advanced, civil and educated.",
        "Median income would be around top ~0.8 percentile as 1.5% pay taxes. The latest report from IT is from 2022-23 so numbers could change a bit upwards(check page 8):\n\nhttps://incometaxindia.gov.in/Documents/Direct%20Tax%20Data/Income-tax-statistics-i-t-return-AY_2021-22.pdf\n\nAccording to this 98.2%ile would be around 9.5-10 lakhs income. So tax paid by that person would be close to 50k. Most of the direct tax is paid by the top 0.1%.",
        "Thanks. Quite an interesting dataset",
        "There are two Indias. About 300 million who can own a phone and are “consumers”. Rest of India is among the poorest countries on the planet.",
        "May I refer you to Sajith Pai's blog?\n\n[https://medium.com/hackernoon/india1-avocado-startups-product-market-fit-dbfb7a8b2ef6](https://medium.com/hackernoon/india1-avocado-startups-product-market-fit-dbfb7a8b2ef6)\n\nWhile this is relevant to VC's, its also indicative of how wealthy India is.\n\nSo India is divided into 4 parts:\n\nIndia 1 Alpha - The rich. Per capita income of more than USD 35,000 (INR 30 lpa)a year. These people could form the 51st state in the United States. Estimates are about 35 million Indians.\n\nIndia 1 - The Middle class.  Per capita income of USD 9,000 (INR 7.5 lpa) a year. White collar folks, like PSU bank managers, entry level engineers etc. This is equivalent to the per capita income of Mexico. The estimate for the number of people like this is 110 million Indians\n\nIndia 2 - The Lower Middle Class. Per capita income of USD 3,000 (INR 2.25 lpa) a year. Drivers, maids, semi skilled workers etc. Per capita income equivalent to Philippines. Estimate of another 110 million Indians.\n\nIndia 3 - The rest. Per capita income of USD 1,000 or less (INR 85,000 or less) a year. Unskilled, unemployed. Subtract the above numbers from 1.4 billion and you can imagine the scale of how poor we are as a country.\n\nThe poor you like at stuff like Netflix subscriptions, phone sales etc, the more this classification seems to come just about right.",
        "I don't think looking at car sales is the best way to determine how much \"money\" Indians have, because car prices are unreasonably high in India. \n\nThe Mercedes E class starts at 76 lakhs (ex showroom) in india, but costs 52 lakhs in China. Admittedly this is another issue where vehicles are taxed way too much which doesn't help in the over all quality of life of the average Indian, but yeah.",
        "Even after accounting for 300M people, that leaves 1.1B people in poverty",
        "If cars prices were same in china and india then the sale figures would probably 50k still super low tbh but not as bad",
        "Speaking of Point 4, most of the enthusiast gamers in India are teenagers who don’t have the money so they either resort to free mobile games or get themselves a pirated copy for PC.",
        "Dk about anything else but the reason steam number is low because most people in india pirate games even when they have a lot of disposable income. I did it for years even tho i had plenty of money. \n\nAnd mobile gaming especially free to play games are also really popular here.",
        "That boils down to unable to earn 600 rs/day",
        "I’d say it’s exactly why this is an apt comparison.\n\nBeyond basic survival(food, rent, clothes), you need more wealth than China to live a comparable quality of life in India. Everything from electronics, appliances, cars, luxury stuff or even real estate costs more in India. Not to mention higher income taxe rates at lower absolute income levels.\n\nNo wonder India has one of the highest amount of millionaires emigrating out.",
        "This is also my perception. \n\nBut it doesn’t track with official GDP figures put out by the IMF or World Bank. They assign a significantly larger PPP premium to India compared to China (I.e they think the gap in nominal GDP between the countries is much larger than the PPP gap). \n\nMaybe the basket on which they base this is largely composed of necessities?",
        "Cars fuck up quality of life my dude.",
        "Yes I know. I literally said it affects the overall quality of life.",
        "No I get what you're saying, but my comment was more of a technicality because with cars you're not only looking at how much money Indians have but also how much tax they pay. If the taxes weren't so high, more people would purchase Mercedes and other luxury cars.",
        "Getting to know about the wealth in India is a very tricky part. see if there are 100 million people in India who are rich than you have more than 800 million people who are poor so it is very very difficult to get a good picture",
        "The difference still wouldn’t even begin to bridge the 50x ratio. Maybe without high taxes China would only be 10-20x of luxury consumption.",
        "Number of iphones is the worst method to estimate wealth. Most people don't even prefer iphone here. Its mostly brought by students who wish to brag about in their college days.",
        "PSU Bank managers only 7.5 lakhs per annum???",
        "Lol. These are in no way near any metric that specifies if a country's population is rich or poor. Netflix, Hotstar accounts are shared in India. Youtube viewers means internet is cheap and everyone has app. People buy Iphone because it's a status symbol but even kids get iphones these days. Food delivery apps, Steam are specifically used in urban setup(do you know how many villages, cities India has when not even considering State Capitals?) \n\nThis is an extremely bad method of measuring wealth of any country let alone India.",
        "very interesting points, good effort on looking for these numbers.",
        "Yeah their basic pay is pretty low, some of the benefits are great",
        "oh yeah I remember this from TSAU podcast a long time ago, helped me change my perspective a lot about India not being as rich as my immediate peers would imagine",
        "460 unique monthly YouTube users?",
        "Yaar crore/ lakh likho naa, every time someone writes million/Billion it becomes a bit taxing to convert the number in crores \n\nAise chalta rha toh, soon we will see mention of miles and pounds on Indian sub!",
        "Pvt Sector Bank Managers get paid 1.5-2x that amount on the lower end.",
        "Never forget.",
        "What is TSAU?",
        "Don’t compare ex showroom. Actual price is 15 lacs higher.",
        "This is something we all need to open our eyes to. At current levels we’re far away from countries we would imagine to be “poor”. Heck, Argentina a country in literal taters has a GDP per capita more than 4 times ours! My point is, the road ahead is a long hard one and the focus should be on lifting the poorest out of abject poverty as soon as possible. “ Trickle down” economics will take too much time to actually help people",
        "don't need to look at luxury cars\n\nlook at D2 car segment sales. This is for all cars above 25L (but not luxury cars). Total sales are about 60k/year\n\nThat's about what Mercedes sells in a month in China",
        "From the 51st state of the U.S. to lower than Mozambique level of GDP/capita",
        "These numbers don’t make any sense, the India one alpha and India 1 middle class according to you are around 150 million = 15 crore.\n\nAll these are squarely in income tax paying net. Yet we only see just 2 crore taxpayers in the country. I highly doubly that 85% of these hide their income.",
        "Umm. Where are you getting the 2 crore number from? For AY 2022-23 the number of tax payers were 93.7 million or 9.37 crore.",
        "Bruh, India's per capita GDP (constant $) is approx $2000. A typical high income country per capita income is around $13000. And ultra rich countries like US have per capita incomes of approx $60000",
        ">Most people don't even prefer iphone here\n\nMore like most people don't have the money to buy iphone",
        "The seen and the unseen podcast; specifically ep 213",
        "Most people I know own android phones more expensive than iphones. Even when presented with choice, people who can afford don't prefer iphones due to multiple reasons. Firstly, there is little penetration of imessage as everyone uses whatsapp, so iphones lose one of their main selling points, and it comes with inconveniences such as lack of bluetooth transfer, greater hiccups while transferring files to and from windows computers, higher percentage of paid apps, lack of gimmicky stuff, and being overall less value for money.",
        "Those are income tax return filers. Out of those 9 crores only 2 crores pay taxes. Rest pay nothing.",
        "I'm guessing that a large part of India 1 is filing taxes but making use of deductions to have nil taxes?",
        "That’s just impossible.\n\nEven if you use all kinds of deductions you can hardly deduct 4 lakhs of your income. 1.5 lakhs 80c (PF, EPF, investment etc), 50k standard deduction, maybe 2 lakhs of HRA deduction (out of 2.5-3 lakhs of rent). If you stretch a lot maybe you can do a further 50k NPS deduction making it 4.5 lakhs.\n\nI’ve been paying income taxes for over a decade. Unless you go the illegal route and file nonsense deductions like paying exaggerated rent to your parents (but not showing transfer or not even living in that city) or do political party donation and taking back in black it’s not possible to save taxes as someone earning above 10 lakhs of income.",
        "That's all just BS, most people you know isn't all Indian people. Apple sells more in India in that range. Pixels aren't that popular in India.",
        "Pixels?\n\nI know only 2 guys who own pixels. Most people I know buy samsung phones. Next one would probably be oneplus, followed by other chinese manufacturers. Even I am planning to get a galaxy fold in future, and I know it will not be cheap.\n\n>That's all just BS, most people you know isn't all Indian people.\n\nI didn't understand at all what this meant.",
        "https://www.counterpointresearch.com/insights/india-smartphone-share/\n\nCheck the figures in the 45k+ segment Apple holds 71% market share",
        "Interesting. Maybe its my bias since most people I know are also tech oriented, so more likely to get android phones. I have seen iphones mostly in the hands of managers and corporate staff, who are given those and are required to use them. That could also probably inflate iphone's share",
        "Are you even reading what you're writing, Apple holds 71% share basically the whole market. Nothing is inflating it",
        "Okay",
        "OP might be interested in these 2 reports on this topic.\n\n[Credit Suisse|UBS Global Wealth Report 2023](https://www.credit-suisse.com/about-us/en/reports-research/global-wealth-report.html).  \n\n[Blume's Indus Valley Annual Report 2024](https://blume.vc/reports/indus-valley-annual-report-2024). \n\nBoth very very informative.",
        "This was really useful. The blog as well. Can I ask how you got the population estimates? Can be very really useful",
        "daily food is basically meatless gravy and a couple chapatis"
    ],
    "cleaned_text": "wealthy india lately ive trying research wealthy indian citizens whenever ive tried discuss peers india theyve told lots indians wealthy dont pay income taxes need dig bit deeper estimate based indirect metrics number iphones sold year apple sold million iphones india compared million sold china hard find accurate number last year httpswwwlivemintcomtechnologyappletopsindiasmartphonerevenueinnearsbnmarkhtmlhttpswwwlivemintcomtechnologyappletopsindiasmartphonerevenueinnearsbnmarkhtml httpswwwgizchinacomapplechinasoldmillioniphonesmartphonesinyearshttpswwwgizchinacomapplechinasoldmillioniphonesmartphonesinyears number netflixott subscribers india netflix million hotstar million httpstcrnchulkkrhttpstcrnchulkkr number people atleast flown air preceding year data unique flyers total passengers given flights would round trip divide number get million would likely upper ceiling unique flyers repeat flyers unlikely httpseconomictimesindiatimescomindustrytransportationairlinesaviationindiasdomesticairpassengertraffictouchesrecordhighonnovarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustrytransportationairlinesaviationindiasdomesticairpassengertraffictouchesrecordhighonnovarticleshowcmsfrommdr amount data transferred steam servers india india pb indonesia times less population pb china pb australia times less population pb httpsstoresteampoweredcomstatscontenthttpsstoresteampoweredcomstatscontent either india dont play games dont money buy games isnt private space house play games people maybe reason number monthly unique users youtube india million httpswwwstatistacomstatisticsnumberofmonthlyuniqueyoutubeusershttpswwwstatistacomstatisticsnumberofmonthlyuniqueyoutubeusers number people atleast ordered food delivery app last year million estimate httpswwwgoldmansachscomintelligencepagesindiasaffluentpopulationislikelytohitmillionbyhtmlhttpswwwgoldmansachscomintelligencepagesindiasaffluentpopulationislikelytohitmillionbyhtml lastly biggest consumer markets httpsenwikipediaorgwikilistoflargestconsumermarketshttpsenwikipediaorgwikilistoflargestconsumermarkets metrics india clearly growing start base low million people india enough disposable income spend nonnecessities thats like small middleincome country indonesia surprise seem done decent job lately number would likely grow million soon cost growing inequality india investing enough education sector without cant like usa eu invented steam engine processors smartphones operating systems internet ai advancements without education nation build new sources wealth likely forever bound natural resources dependent others share new technology ",
    "cleaned_title": "wealthy india",
    "cleaned_selftext": "lately ive trying research wealthy indian citizens whenever ive tried discuss peers india theyve told lots indians wealthy dont pay income taxes need dig bit deeper estimate based indirect metrics number iphones sold year apple sold million iphones india compared million sold china hard find accurate number last year httpswwwlivemintcomtechnologyappletopsindiasmartphonerevenueinnearsbnmarkhtmlhttpswwwlivemintcomtechnologyappletopsindiasmartphonerevenueinnearsbnmarkhtml httpswwwgizchinacomapplechinasoldmillioniphonesmartphonesinyearshttpswwwgizchinacomapplechinasoldmillioniphonesmartphonesinyears number netflixott subscribers india netflix million hotstar million httpstcrnchulkkrhttpstcrnchulkkr number people atleast flown air preceding year data unique flyers total passengers given flights would round trip divide number get million would likely upper ceiling unique flyers repeat flyers unlikely httpseconomictimesindiatimescomindustrytransportationairlinesaviationindiasdomesticairpassengertraffictouchesrecordhighonnovarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustrytransportationairlinesaviationindiasdomesticairpassengertraffictouchesrecordhighonnovarticleshowcmsfrommdr amount data transferred steam servers india india pb indonesia times less population pb china pb australia times less population pb httpsstoresteampoweredcomstatscontenthttpsstoresteampoweredcomstatscontent either india dont play games dont money buy games isnt private space house play games people maybe reason number monthly unique users youtube india million httpswwwstatistacomstatisticsnumberofmonthlyuniqueyoutubeusershttpswwwstatistacomstatisticsnumberofmonthlyuniqueyoutubeusers number people atleast ordered food delivery app last year million estimate httpswwwgoldmansachscomintelligencepagesindiasaffluentpopulationislikelytohitmillionbyhtmlhttpswwwgoldmansachscomintelligencepagesindiasaffluentpopulationislikelytohitmillionbyhtml lastly biggest consumer markets httpsenwikipediaorgwikilistoflargestconsumermarketshttpsenwikipediaorgwikilistoflargestconsumermarkets metrics india clearly growing start base low million people india enough disposable income spend nonnecessities thats like small middleincome country indonesia surprise seem done decent job lately number would likely grow million soon cost growing inequality india investing enough education sector without cant like usa eu invented steam engine processors smartphones operating systems internet ai advancements without education nation build new sources wealth likely forever bound natural resources dependent others share new technology",
    "cleaned_comments": "compare luxury car sales youll get real depressing picture companies like mercedes sell k cars year china k india india people earn enough pay income taxes even many hiding wealth highly unlikely still gives fact matter least population either low income downright poor also taxes india high poor benefits one factoid average indirect taxes around k rupees per year per capita average direct taxes around lakhs per year per capita income tax payers spend budget time effort communal matters less healthcare education way get median tax paid unlikely india would ever achieve development level china lifetime anyways comparision china might well comparision usa nations absurdly prosperous developed compared india really sucks india even lagging behind asean compared rest planet average human would better india compared africa war torn countries every place advanced civil educated median income would around top percentile pay taxes latest report numbers could change bit upwardscheck page according ile would around lakhs income tax paid person would close k direct tax paid top thanks quite interesting dataset two indias million phone consumers rest india among poorest countries planet may refer sajith pais blog httpsmediumcomhackernoonindiaavocadostartupsproductmarketfitdbfbabefhttpsmediumcomhackernoonindiaavocadostartupsproductmarketfitdbfbabef relevant vcs also indicative wealthy india india divided parts india alpha rich per capita income usd inr lpaa year people could form st state united states estimates million indians india middle class per capita income usd inr lpa year white collar folks like psu bank managers entry level engineers etc equivalent per capita income mexico estimate number people like million indians india lower middle class per capita income usd inr lpa year drivers maids semi skilled workers etc per capita income equivalent philippines estimate another million indians india rest per capita income usd less inr less year unskilled unemployed subtract numbers billion imagine scale poor country poor like stuff like netflix subscriptions phone sales etc classification seems come right dont think looking car sales best way determine much money indians car prices unreasonably high india mercedes e class starts lakhs ex showroom india costs lakhs china admittedly another issue vehicles taxed way much doesnt help quality life average indian yeah even accounting people leaves b people poverty cars prices china india sale figures would probably k still super low tbh bad speaking point enthusiast gamers india teenagers dont money either resort free mobile games get pirated copy pc dk anything else reason steam number low people india pirate games even lot disposable income years even tho plenty money mobile gaming especially free play games also really popular boils unable earn rsday id say exactly apt comparison beyond basic survivalfood rent clothes need wealth china live comparable quality life india everything electronics appliances cars luxury stuff even real estate costs india mention higher income taxe rates lower absolute income levels wonder india one highest amount millionaires emigrating also perception doesnt track official gdp figures put imf world bank assign significantly larger ppp premium india compared china ie think gap nominal gdp countries much larger ppp gap maybe basket base largely composed necessities cars fuck quality life dude yes know literally said affects overall quality life get youre saying comment technicality cars youre looking much money indians also much tax pay taxes werent high people would purchase mercedes luxury cars getting know wealth india tricky part see million people india rich million people poor difficult get good picture difference still wouldnt even begin bridge x ratio maybe without high taxes china would x luxury consumption number iphones worst method estimate wealth people dont even prefer iphone mostly brought students wish brag college days psu bank managers lakhs per annum lol way near metric specifies countrys population rich poor netflix hotstar accounts shared india youtube viewers means internet cheap everyone app people buy iphone status symbol even kids get iphones days food delivery apps steam specifically used urban setupdo know many villages cities india even considering state capitals extremely bad method measuring wealth country let alone india interesting points good effort looking numbers yeah basic pay pretty low benefits great oh yeah remember tsau podcast long time ago helped change perspective lot india rich immediate peers would imagine unique monthly youtube users yaar crore lakh likho naa every time someone writes millionbillion becomes bit taxing convert number crores aise chalta rha toh soon see mention miles pounds indian sub pvt sector bank managers get paid x amount lower end never forget tsau dont compare ex showroom actual price lacs higher something need open eyes current levels far away countries would imagine poor heck argentina country literal taters gdp per capita times point road ahead long hard one focus lifting poorest abject poverty soon possible trickle economics take much time actually help people dont need look luxury cars look car segment sales cars l luxury cars total sales kyear thats mercedes sells month china st state us lower mozambique level gdpcapita numbers dont make sense india one alpha india middle class according around million crore squarely income tax paying net yet see crore taxpayers country highly doubly hide income umm getting crore number ay number tax payers million crore bruh indias per capita gdp constant approx typical high income country per capita income around ultra rich countries like us per capita incomes approx people dont even prefer iphone like people dont money buy iphone seen unseen podcast specifically ep people know android phones expensive iphones even presented choice people afford dont prefer iphones due multiple reasons firstly little penetration imessage everyone uses whatsapp iphones lose one main selling points comes inconveniences lack bluetooth transfer greater hiccups transferring files windows computers higher percentage paid apps lack gimmicky stuff overall less value money income tax return filers crores crores pay taxes rest pay nothing im guessing large part india filing taxes making use deductions nil taxes thats impossible even use kinds deductions hardly deduct lakhs income lakhs c pf epf investment etc k standard deduction maybe lakhs hra deduction lakhs rent stretch lot maybe k nps deduction making lakhs ive paying income taxes decade unless go illegal route file nonsense deductions like paying exaggerated rent parents showing transfer even living city political party donation taking back black possible save taxes someone earning lakhs income thats bs people know isnt indian people apple sells india range pixels arent popular india pixels know guys pixels people know buy samsung phones next one would probably oneplus followed chinese manufacturers even planning get galaxy fold future know cheap thats bs people know isnt indian people didnt understand meant check figures k segment apple holds market share interesting maybe bias since people know also tech oriented likely get android phones seen iphones mostly hands managers corporate staff given required use could also probably inflate iphones share even reading youre writing apple holds share basically whole market nothing inflating okay op might interested reports topic credit suisseubs global wealth report httpswwwcreditsuissecomaboutusenreportsresearchglobalwealthreporthtml blumes indus valley annual report httpsblumevcreportsindusvalleyannualreport informative really useful blog well ask got population estimates really useful daily food basically meatless gravy couple chapatis",
    "light_cleaned_title": "How wealthy is India?",
    "light_cleaned_selftext": "Lately I've been trying to research how wealthy Indian citizens are. Whenever I've tried to discuss this with my peers in India, they've told me that lots of Indians are wealthy but they don't pay income taxes. So we will need to dig a bit deeper and estimate based of indirect metrics. **1. Number of iPhones sold in a year.** Apple sold 10 million iPhones in India in 2023 compared to 50 million sold in China in 2021. It's hard to find an accurate number for the last year. [https://www.livemint.com/technology/apple-tops-india-smartphone-revenue-in-2023-nears-10-bn-mark-11706708396436.html](https://www.livemint.com/technology/apple-tops-india-smartphone-revenue-in-2023-nears-10-bn-mark-11706708396436.html) [https://www.gizchina.com/2022/08/26/apple-china-sold-380-million-iphone-smartphones-in-10-years/](https://www.gizchina.com/2022/08/26/apple-china-sold-380-million-iphone-smartphones-in-10-years/) **2. Number of netflix/ott subscribers in India.** Netflix - 6.5 Million and Hotstar - 40 Million. [https://tcrn.ch/48ULkKr](https://tcrn.ch/48ULkKr) **3. Number of people who have at-least flown by air in the preceding year.** There no data on unique flyers but total passengers were 450M. Given that most flights would be a round trip, we can divide this number by 2 and get 225 million. This would likely be the upper ceiling of the unique flyers if there were no repeat flyers (unlikely). [https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/indias-domestic-air-passenger-traffic-touches-record-high-on-nov-19/articleshow/105356249.cms?from=mdr](https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/indias-domestic-air-passenger-traffic-touches-record-high-on-nov-19/articleshow/105356249.cms?from=mdr) **4. Amount of data transferred from Steam servers to India.** India - 6.8 PB, Indonesia (with 5 times less population) - 6.4 PB, China - 292 PB, Australia (with 50 times less population) - 17.8 PB [https://store.steampowered.com/stats/content/](https://store.steampowered.com/stats/content/) Either we in India don't play any games or we don't have money to buy games or there isn't any private space in house to play games for most people or maybe there is some other reason. **5. Number of monthly unique users of Youtube in India.** 460 Million - [https://www.statista.com/statistics/280685/number-of-monthly-unique-youtube-users/](https://www.statista.com/statistics/280685/number-of-monthly-unique-youtube-users/) **6. Number of people who have at-least ordered once from a food delivery app in the last year.** 60 million estimate from - [https://www.goldmansachs.com/intelligence/pages/indias-affluent-population-is-likely-to-hit-100-million-by-2027.html](https://www.goldmansachs.com/intelligence/pages/indias-affluent-population-is-likely-to-hit-100-million-by-2027.html) Lastly biggest consumer markets - [https://en.wikipedia.org/wiki/List\\_of\\_largest\\_consumer\\_markets](https://en.wikipedia.org/wiki/List_of_largest_consumer_markets) By these metrics, India is clearly growing but the start base is very low. Just 40-60 million people in India have enough disposable income to spend on non-necessities as above. That’s like a small middle-income country. Indonesia is a surprise to me; they seem to have a done a decent job lately. This number would likely grow to \\~100 million soon but at the cost of growing inequality. India has not been investing enough into its education sector and without that it can’t be like USA and EU who invented steam engine, processors, smartphones operating systems, internet and now AI advancements. Without education, a nation can not build new sources of wealth and will likely be forever bound by its natural resources and be dependent on others to share new technology.",
    "light_cleaned_comments": "Compare luxury car sales and you’ll get the real depressing picture. Companies like Mercedes sell >500k cars a year in China and just 10-12k in India. India has just 1.5% people which earn enough to pay income taxes. Even if you have just as many hiding their wealth (highly unlikely) that still gives you 3%. Fact of the matter is that at least 95% of our population is either low income or downright poor. This is also why the taxes in India are so high with such poor benefits. One more factoid: * Average indirect taxes are around 9k rupees per year per capita * Average direct taxes are around 4 lakhs per year per capita for income tax payers. If we spend our budget, time and effort on communal matters, then we will have less for healthcare and education. Is there a way to get median tax paid ? It's unlikely that India would ever achieve the development level of where China is now. Not in our lifetime anyways. So comparision against China, might as well be comparision against USA now. Both the nations are absurdly prosperous and developed compared to India. What really sucks is that India is even lagging behind ASEAN now. Compared to rest of the planet, an average human would be better off in India only when compared to Africa and some war torn countries. Every other place is now more advanced, civil and educated. Median income would be around top ~0.8 percentile as 1.5% pay taxes. The latest report from IT is from 2022-23 so numbers could change a bit upwards(check page 8): According to this 98.2%ile would be around 9.5-10 lakhs income. So tax paid by that person would be close to 50k. Most of the direct tax is paid by the top 0.1%. Thanks. Quite an interesting dataset There are two Indias. About 300 million who can own a phone and are “consumers”. Rest of India is among the poorest countries on the planet. May I refer you to Sajith Pai's blog? [https://medium.com/hackernoon/india1-avocado-startups-product-market-fit-dbfb7a8b2ef6](https://medium.com/hackernoon/india1-avocado-startups-product-market-fit-dbfb7a8b2ef6) While this is relevant to VC's, its also indicative of how wealthy India is. So India is divided into 4 parts: India 1 Alpha - The rich. Per capita income of more than USD 35,000 (INR 30 lpa)a year. These people could form the 51st state in the United States. Estimates are about 35 million Indians. India 1 - The Middle class. Per capita income of USD 9,000 (INR 7.5 lpa) a year. White collar folks, like PSU bank managers, entry level engineers etc. This is equivalent to the per capita income of Mexico. The estimate for the number of people like this is 110 million Indians India 2 - The Lower Middle Class. Per capita income of USD 3,000 (INR 2.25 lpa) a year. Drivers, maids, semi skilled workers etc. Per capita income equivalent to Philippines. Estimate of another 110 million Indians. India 3 - The rest. Per capita income of USD 1,000 or less (INR 85,000 or less) a year. Unskilled, unemployed. Subtract the above numbers from 1.4 billion and you can imagine the scale of how poor we are as a country. The poor you like at stuff like Netflix subscriptions, phone sales etc, the more this classification seems to come just about right. I don't think looking at car sales is the best way to determine how much \"money\" Indians have, because car prices are unreasonably high in India. The Mercedes E class starts at 76 lakhs (ex showroom) in india, but costs 52 lakhs in China. Admittedly this is another issue where vehicles are taxed way too much which doesn't help in the over all quality of life of the average Indian, but yeah. Even after accounting for 300M people, that leaves 1.1B people in poverty If cars prices were same in china and india then the sale figures would probably 50k still super low tbh but not as bad Speaking of Point 4, most of the enthusiast gamers in India are teenagers who don’t have the money so they either resort to free mobile games or get themselves a pirated copy for PC. Dk about anything else but the reason steam number is low because most people in india pirate games even when they have a lot of disposable income. I did it for years even tho i had plenty of money. And mobile gaming especially free to play games are also really popular here. That boils down to unable to earn 600 rs/day I’d say it’s exactly why this is an apt comparison. Beyond basic survival(food, rent, clothes), you need more wealth than China to live a comparable quality of life in India. Everything from electronics, appliances, cars, luxury stuff or even real estate costs more in India. Not to mention higher income taxe rates at lower absolute income levels. No wonder India has one of the highest amount of millionaires emigrating out. This is also my perception. But it doesn’t track with official GDP figures put out by the IMF or World Bank. They assign a significantly larger PPP premium to India compared to China (I.e they think the gap in nominal GDP between the countries is much larger than the PPP gap). Maybe the basket on which they base this is largely composed of necessities? Cars fuck up quality of life my dude. Yes I know. I literally said it affects the overall quality of life. No I get what you're saying, but my comment was more of a technicality because with cars you're not only looking at how much money Indians have but also how much tax they pay. If the taxes weren't so high, more people would purchase Mercedes and other luxury cars. Getting to know about the wealth in India is a very tricky part. see if there are 100 million people in India who are rich than you have more than 800 million people who are poor so it is very very difficult to get a good picture The difference still wouldn’t even begin to bridge the 50x ratio. Maybe without high taxes China would only be 10-20x of luxury consumption. Number of iphones is the worst method to estimate wealth. Most people don't even prefer iphone here. Its mostly brought by students who wish to brag about in their college days. PSU Bank managers only 7.5 lakhs per annum??? Lol. These are in no way near any metric that specifies if a country's population is rich or poor. Netflix, Hotstar accounts are shared in India. Youtube viewers means internet is cheap and everyone has app. People buy Iphone because it's a status symbol but even kids get iphones these days. Food delivery apps, Steam are specifically used in urban setup(do you know how many villages, cities India has when not even considering State Capitals?) This is an extremely bad method of measuring wealth of any country let alone India. very interesting points, good effort on looking for these numbers. Yeah their basic pay is pretty low, some of the benefits are great oh yeah I remember this from TSAU podcast a long time ago, helped me change my perspective a lot about India not being as rich as my immediate peers would imagine 460 unique monthly YouTube users? Yaar crore/ lakh likho naa, every time someone writes million/Billion it becomes a bit taxing to convert the number in crores Aise chalta rha toh, soon we will see mention of miles and pounds on Indian sub! Pvt Sector Bank Managers get paid 1.5-2x that amount on the lower end. Never forget. What is TSAU? Don’t compare ex showroom. Actual price is 15 lacs higher. This is something we all need to open our eyes to. At current levels we’re far away from countries we would imagine to be “poor”. Heck, Argentina a country in literal taters has a GDP per capita more than 4 times ours! My point is, the road ahead is a long hard one and the focus should be on lifting the poorest out of abject poverty as soon as possible. “ Trickle down” economics will take too much time to actually help people don't need to look at luxury cars look at D2 car segment sales. This is for all cars above 25L (but not luxury cars). Total sales are about 60k/year That's about what Mercedes sells in a month in China From the 51st state of the U.S. to lower than Mozambique level of GDP/capita These numbers don’t make any sense, the India one alpha and India 1 middle class according to you are around 150 million = 15 crore. All these are squarely in income tax paying net. Yet we only see just 2 crore taxpayers in the country. I highly doubly that 85% of these hide their income. Umm. Where are you getting the 2 crore number from? For AY 2022-23 the number of tax payers were 93.7 million or 9.37 crore. Bruh, India's per capita GDP (constant $) is approx $2000. A typical high income country per capita income is around $13000. And ultra rich countries like US have per capita incomes of approx $60000 >Most people don't even prefer iphone here More like most people don't have the money to buy iphone The seen and the unseen podcast; specifically ep 213 Most people I know own android phones more expensive than iphones. Even when presented with choice, people who can afford don't prefer iphones due to multiple reasons. Firstly, there is little penetration of imessage as everyone uses whatsapp, so iphones lose one of their main selling points, and it comes with inconveniences such as lack of bluetooth transfer, greater hiccups while transferring files to and from windows computers, higher percentage of paid apps, lack of gimmicky stuff, and being overall less value for money. Those are income tax return filers. Out of those 9 crores only 2 crores pay taxes. Rest pay nothing. I'm guessing that a large part of India 1 is filing taxes but making use of deductions to have nil taxes? That’s just impossible. Even if you use all kinds of deductions you can hardly deduct 4 lakhs of your income. 1.5 lakhs 80c (PF, EPF, investment etc), 50k standard deduction, maybe 2 lakhs of HRA deduction (out of 2.5-3 lakhs of rent). If you stretch a lot maybe you can do a further 50k NPS deduction making it 4.5 lakhs. I’ve been paying income taxes for over a decade. Unless you go the illegal route and file nonsense deductions like paying exaggerated rent to your parents (but not showing transfer or not even living in that city) or do political party donation and taking back in black it’s not possible to save taxes as someone earning above 10 lakhs of income. That's all just BS, most people you know isn't all Indian people. Apple sells more in India in that range. Pixels aren't that popular in India. Pixels? I know only 2 guys who own pixels. Most people I know buy samsung phones. Next one would probably be oneplus, followed by other chinese manufacturers. Even I am planning to get a galaxy fold in future, and I know it will not be cheap. >That's all just BS, most people you know isn't all Indian people. I didn't understand at all what this meant. Check the figures in the 45k+ segment Apple holds 71% market share Interesting. Maybe its my bias since most people I know are also tech oriented, so more likely to get android phones. I have seen iphones mostly in the hands of managers and corporate staff, who are given those and are required to use them. That could also probably inflate iphone's share Are you even reading what you're writing, Apple holds 71% share basically the whole market. Nothing is inflating it Okay OP might be interested in these 2 reports on this topic. [Credit Suisse|UBS Global Wealth Report 2023](https://www.credit-suisse.com/about-us/en/reports-research/global-wealth-report.html). [Blume's Indus Valley Annual Report 2024](https://blume.vc/reports/indus-valley-annual-report-2024). Both very very informative. This was really useful. The blog as well. Can I ask how you got the population estimates? Can be very really useful daily food is basically meatless gravy and a couple chapatis"
}