{
    "id": "16inho4",
    "title": "Jio pulled a fast one on postpaid users.",
    "url": "https://www.reddit.com/r/india/comments/16inho4/jio_pulled_a_fast_one_on_postpaid_users/",
    "selftext": "I was under the impression jio postpaid provides the service of unused data to be rolled over to the next month. But thats not the case they have sneakily removed the service from all postpaid plans.\n\nAs you can see from the screenshot they say upto 200 GB of data rollover on different plans. Pretty convincing right .. See the note not applicable to Jio Plus Plans you would think its for prepaid plans , its all the postpaid plans they released after 31st march,2023 ... they sneakily renamed their postpaid plans to Jio Plus plans which is so fking similar to everything else jio prime jio postpaid plus  you'd confuse it any day and they are taking advantage of it. They are masters of deception.\n\nPS : I got tricked and I am salty\n\n&#x200B;\n\n[Scammy website](https://preview.redd.it/1sopn94z29ob1.png?width=2222&format=png&auto=webp&s=63dc7fbe68557d36880aed1fb6d65dd5f99a2f31)",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694710312.0,
    "convurl": "https://b.thumbs.redditmedia.com/N1yNjgm4BumgrU8dXUQCOnbtHSWSB7A-YqAovaUcc_U.jpg",
    "comments": [
        "Invest into RIL. Be a Tata customer",
        "Story as old as time.",
        "I changed my postpaid sim to a prepaid sim and took the sim out. Hoping that 3 months of inactivity will deactivate the sim.",
        "Switch to Vi, they provide data rollover on weekly basis plus free internet 12AM to 6AM. The daily leftover quota gets carried over for weekends.",
        "How's the network these days?",
        "Depends upon the region or area; thiugh in ours it does drop to E (2G) randomly for few seconds and then back to 4G.",
        "Remember the times when jio gave away everything for free and everyone was happy. Yeah. Now they are making it up from these initiatives. Free & unlimited is a scam anyways, be it any industry.",
        "Mota bhai doing that",
        "What is the point of the data and carry forward when you don't have proper signals 😔",
        "That was a good thing because they normalised affordable internet and 4g in India. Remember the dark time before that where Airtel 3g cost 25rs for 125MB pack for 7 days?",
        "So true dude they took away the most basic features of postpaid which was data rollover and now post paid is just prepaid just pay at the end of month the data rollover was the only +ve feature of postpaid except for the employees which need bill reimbursements",
        "I am in family plan cant take the whole family to Vi which might shutdown any day and on top of that Vi is not that good in my area, neither is jio but it atleast crawls",
        "Believe it or not that revolutionarised india not for that we would still be paying hundereds for 2-3 gb/ month and super slow internet speeds, when jio released 4g it was getting 50Mbps even my wifi wasnt fast enough back then , you see it clearly worked",
        "Well vi won't really shut down that way but if the network is not fine you should act accordingly.\nHowever might I suggest you \"tweet\" for the network issue tagging Jio, ciz that really works... (I have done it myself. I got my network issue resolved first by frequent and regular customer care complaint) and then through Twitter (once I came to know about it).",
        "Do they really bother and I am living on 7th floor so no way they can fix anything on ground it works like 10 mbps",
        "these companies have put in so much resource in 5g the 4g stopped working I used to get so good 4g speeds now theres no speeds in 5g and airtel 4g doesnt even start speed test and the funny thing is jio 5g doesnt reach here but airtel 5g gives 500mbps.",
        "I used to use rcom 3g 1gb@97 or docomo 2g 4gb@98,  so no i don't remember dark days never recharged for 1gb @250 a broadband user from before 4g time so I'm irritated in the name of cheap gb everyone who don't even use those gbs has to pay higher and higher every month",
        "Doesn't matter... the thing is tweet is something anyone can see and it can affect their reputation,  so they take tweets seriously.",
        "You got a point there",
        "broadband change was inevitable since we shifted from Copper to optic fibre",
        "If true then My worry is that Airtel will mimic these practices and may stop data carryover in near future",
        "I bet ya they will stop data carry over"
    ],
    "cleaned_text": "jio pulled fast one postpaid users impression jio postpaid provides service unused data rolled next month thats case sneakily removed service postpaid plans see screenshot say upto gb data rollover different plans pretty convincing right see note applicable jio plus plans would think prepaid plans postpaid plans released st march sneakily renamed postpaid plans jio plus plans fking similar everything else jio prime jio postpaid plus youd confuse day taking advantage masters deception ps got tricked salty xb scammy websitehttpspreviewredditsopnzobpngwidthformatpngautowebpsdcfbedaedfbdddfaf ",
    "cleaned_title": "jio pulled fast one postpaid users",
    "cleaned_selftext": "impression jio postpaid provides service unused data rolled next month thats case sneakily removed service postpaid plans see screenshot say upto gb data rollover different plans pretty convincing right see note applicable jio plus plans would think prepaid plans postpaid plans released st march sneakily renamed postpaid plans jio plus plans fking similar everything else jio prime jio postpaid plus youd confuse day taking advantage masters deception ps got tricked salty xb scammy websitehttpspreviewredditsopnzobpngwidthformatpngautowebpsdcfbedaedfbdddfaf",
    "cleaned_comments": "invest ril tata customer story old time changed postpaid sim prepaid sim took sim hoping months inactivity deactivate sim switch vi provide data rollover weekly basis plus free internet daily leftover quota gets carried weekends hows network days depends upon region area thiugh drop e g randomly seconds back g remember times jio gave away everything free everyone happy yeah making initiatives free unlimited scam anyways industry mota bhai point data carry forward dont proper signals good thing normalised affordable internet g india remember dark time airtel g cost rs mb pack days true dude took away basic features postpaid data rollover post paid prepaid pay end month data rollover feature postpaid except employees need bill reimbursements family plan cant take whole family vi might shutdown day top vi good area neither jio atleast crawls believe revolutionarised india would still paying hundereds gb month super slow internet speeds jio released g getting mbps even wifi wasnt fast enough back see clearly worked well vi wont really shut way network fine act accordingly however might suggest tweet network issue tagging jio ciz really works done got network issue resolved first frequent regular customer care complaint twitter came know really bother living th floor way fix anything ground works like mbps companies put much resource g g stopped working used get good g speeds theres speeds g airtel g doesnt even start speed test funny thing jio g doesnt reach airtel g gives mbps used use rcom g gb docomo g gb dont remember dark days never recharged gb broadband user g time im irritated name cheap gb everyone dont even use gbs pay higher higher every month doesnt matter thing tweet something anyone see affect reputation take tweets seriously got point broadband change inevitable since shifted copper optic fibre true worry airtel mimic practices may stop data carryover near future bet ya stop data carry",
    "light_cleaned_title": "Jio pulled a fast one on postpaid users.",
    "light_cleaned_selftext": "I was under the impression jio postpaid provides the service of unused data to be rolled over to the next month. But thats not the case they have sneakily removed the service from all postpaid plans. As you can see from the screenshot they say upto 200 GB of data rollover on different plans. Pretty convincing right .. See the note not applicable to Jio Plus Plans you would think its for prepaid plans , its all the postpaid plans they released after 31st march,2023 ... they sneakily renamed their postpaid plans to Jio Plus plans which is so fking similar to everything else jio prime jio postpaid plus you'd confuse it any day and they are taking advantage of it. They are masters of deception. PS : I got tricked and I am salty &#x200B; [Scammy website](https://preview.redd.it/1sopn94z29ob1.png?width=2222&format=png&auto=webp&s=63dc7fbe68557d36880aed1fb6d65dd5f99a2f31)",
    "light_cleaned_comments": "Invest into RIL. Be a Tata customer Story as old as time. I changed my postpaid sim to a prepaid sim and took the sim out. Hoping that 3 months of inactivity will deactivate the sim. Switch to Vi, they provide data rollover on weekly basis plus free internet 12AM to 6AM. The daily leftover quota gets carried over for weekends. How's the network these days? Depends upon the region or area; thiugh in ours it does drop to E (2G) randomly for few seconds and then back to 4G. Remember the times when jio gave away everything for free and everyone was happy. Yeah. Now they are making it up from these initiatives. Free & unlimited is a scam anyways, be it any industry. Mota bhai doing that What is the point of the data and carry forward when you don't have proper signals 😔 That was a good thing because they normalised affordable internet and 4g in India. Remember the dark time before that where Airtel 3g cost 25rs for 125MB pack for 7 days? So true dude they took away the most basic features of postpaid which was data rollover and now post paid is just prepaid just pay at the end of month the data rollover was the only +ve feature of postpaid except for the employees which need bill reimbursements I am in family plan cant take the whole family to Vi which might shutdown any day and on top of that Vi is not that good in my area, neither is jio but it atleast crawls Believe it or not that revolutionarised india not for that we would still be paying hundereds for 2-3 gb/ month and super slow internet speeds, when jio released 4g it was getting 50Mbps even my wifi wasnt fast enough back then , you see it clearly worked Well vi won't really shut down that way but if the network is not fine you should act accordingly. However might I suggest you \"tweet\" for the network issue tagging Jio, ciz that really works... (I have done it myself. I got my network issue resolved first by frequent and regular customer care complaint) and then through Twitter (once I came to know about it). Do they really bother and I am living on 7th floor so no way they can fix anything on ground it works like 10 mbps these companies have put in so much resource in 5g the 4g stopped working I used to get so good 4g speeds now theres no speeds in 5g and airtel 4g doesnt even start speed test and the funny thing is jio 5g doesnt reach here but airtel 5g gives 500mbps. I used to use rcom 3g 1gb@97 or docomo 2g 4gb@98, so no i don't remember dark days never recharged for 1gb @250 a broadband user from before 4g time so I'm irritated in the name of cheap gb everyone who don't even use those gbs has to pay higher and higher every month Doesn't matter... the thing is tweet is something anyone can see and it can affect their reputation, so they take tweets seriously. You got a point there broadband change was inevitable since we shifted from Copper to optic fibre If true then My worry is that Airtel will mimic these practices and may stop data carryover in near future I bet ya they will stop data carry over"
}