{
    "id": "1brg7rh",
    "title": "Scammers are getting out of control",
    "url": "https://www.reddit.com/gallery/1brg7rh",
    "selftext": "Data security is a big joke in our country!!",
    "flair": "Crime",
    "score": 179,
    "num_comments": 47,
    "created_utc": 1711800057,
    "convurl": "https://i.redd.it/qkcvxpdfogrc1.jpg",
    "comments": [
        "If politicians can scam us , these people are like why can't we",
        "Mai tera number nikal ke dikhata hu tu 1hazar de 😎",
        "First time 150 rupees denge ye log free me vo lekar block kar dena",
        "Anaisha, naam is veey South Delhi, send this person that south delhi reel  \n  \n*Baby see, hu main south delhi ki,*  \n*Vegan waali diet,*  \n*Almond waala ghee,*  \n*Mera mann jo karega na, main wahi karungi,*  \n*Aisi choti moti gaadi mein main nahi baithungi.*",
        "It's damn fun messing with these scammers.\n\nI love it every time one of them messages me",
        "I got the very same message!! I blocked immediately",
        "Young Scammer Yojana",
        "I am going to message this person in order to check whether they would try to scam me as well.  If they do,  I would play around for a while and waste their time.",
        "I have taken upto ₹900 and blocked them. Twice",
        "I could max milk them till 475. How did you manage till 900?",
        "A person once impersonated as an executive working at the same firm where I am based. I quickly checked her up on Teams and there was no such person.\nThe funny thing came after when I told her the same and she wanted proof 😂😂😂😂",
        "Went on until they wanted me to switch over to telegram. That's where the shady business starts",
        "The same receptionist,  finance department names in telegram too I guess.",
        "Yes",
        "Unknown number ko reply kaun karta hai? Bc tabhi scam hote hai itne",
        "My number is on DND and so I am getting promotional messages on WhatsApp now. Is anyone looking into this crap?",
        "Bro most of the times ye Pakistani hote hain aur fir in hutiyon ki vajah se westerners hame gaali dete hain",
        "I also got it same today. \n\nI sent them a short clip of 2 Girls 1 cup and blocked them",
        "https://preview.redd.it/sswxdsqvnhrc1.jpeg?width=1170&format=pjpg&auto=webp&s=b2b366da33b5cd29743823c0f7f92ac755980638\n\nI also got one today lol",
        "Isliye bola tha Signal pe aao, WhatsApp ke ads will get more and more intrusive over time...because capitalism son",
        "Use the GOI's chakshu portal and get his ass reported.",
        "https://preview.redd.it/1jg35iv9thrc1.jpeg?width=1290&format=pjpg&auto=webp&s=c04562bac6d4cd43fcb25468a2ea68284279b7aa\n\n🫤",
        "They told me to add some items to cart on a website and send screenshot. That's it.",
        "Don't show the number. It will get handed over to someone else within 4months.",
        "I received this exact dm",
        "yoooo I got the same message today 😂😂",
        "Yea knsa app h? 🥲 WhatsApp to nhi h ig",
        "How are they getting our numbers? That's what I don't understand!",
        "-Anaisha\n-gulshanmd749\n\nDont you already see red flag?",
        "https://preview.redd.it/fn08rmuu0jrc1.jpeg?width=1440&format=pjpg&auto=webp&s=9d78a2a7491cf16d4f29840f5d9562df02c89092",
        "https://preview.redd.it/ur7w5vz15jrc1.png?width=1080&format=pjpg&auto=webp&s=85e12a3bae305c7b72fa3a7cd71caa5ba1097fa7",
        "How are these people getting our contacts, the ruling party got our contacts because it used data from government db anyway privacy is a joke in india",
        "I usually get these scam messages but in the DP there is a boy and he is pretending to be a girl 😂",
        "merko bhi koi scam karo mai bhi 500 600 ruapy lekar unhe block karna chahta hu",
        "Just remember your accounts can be frozen even for accepting 1rs from them as they are also into money laundering. One complaint is all it will take to freeze it and you will have to get it unfrozen through court.",
        "Youve read the privacy policy on reddit right?"
    ],
    "cleaned_text": "scammers getting control data security big joke country ",
    "cleaned_title": "scammers getting control",
    "cleaned_selftext": "data security big joke country",
    "cleaned_comments": "politicians scam us people like cant mai tera number nikal ke dikhata hu tu hazar de first time rupees denge ye log free vo lekar block kar dena anaisha naam veey south delhi send person south delhi reel baby see hu main south delhi ki vegan waali diet almond waala ghee mera mann jo karega na main wahi karungi aisi choti moti gaadi mein main nahi baithungi damn fun messing scammers love every time one messages got message blocked immediately young scammer yojana going message person order check whether would try scam well would play around waste time taken upto blocked twice could max milk till manage till person impersonated executive working firm based quickly checked teams person funny thing came told wanted proof went wanted switch telegram thats shady business starts receptionist finance department names telegram guess yes unknown number ko reply kaun karta hai bc tabhi scam hote hai itne number dnd getting promotional messages whatsapp anyone looking crap bro times ye pakistani hote hain aur fir hutiyon ki vajah se westerners hame gaali dete hain also got today sent short clip girls cup blocked also got one today lol isliye bola tha signal pe aao whatsapp ke ads get intrusive timebecause capitalism son use gois chakshu portal get ass reported told add items cart website send screenshot thats dont show number get handed someone else within months received exact dm yoooo got message today yea knsa app h whatsapp nhi h ig getting numbers thats dont understand anaisha gulshanmd dont already see red flag people getting contacts ruling party got contacts used data government db anyway privacy joke india usually get scam messages dp boy pretending girl merko bhi koi scam karo mai bhi ruapy lekar unhe block karna chahta hu remember accounts frozen even accepting rs also money laundering one complaint take freeze get unfrozen court youve read privacy policy reddit right",
    "light_cleaned_title": "Scammers are getting out of control",
    "light_cleaned_selftext": "Data security is a big joke in our country!!",
    "light_cleaned_comments": "If politicians can scam us , these people are like why can't we Mai tera number nikal ke dikhata hu tu 1hazar de 😎 First time 150 rupees denge ye log free me vo lekar block kar dena Anaisha, naam is veey South Delhi, send this person that south delhi reel *Baby see, hu main south delhi ki,* *Vegan waali diet,* *Almond waala ghee,* *Mera mann jo karega na, main wahi karungi,* *Aisi choti moti gaadi mein main nahi baithungi.* It's damn fun messing with these scammers. I love it every time one of them messages me I got the very same message!! I blocked immediately Young Scammer Yojana I am going to message this person in order to check whether they would try to scam me as well. If they do, I would play around for a while and waste their time. I have taken upto ₹900 and blocked them. Twice I could max milk them till 475. How did you manage till 900? A person once impersonated as an executive working at the same firm where I am based. I quickly checked her up on Teams and there was no such person. The funny thing came after when I told her the same and she wanted proof 😂😂😂😂 Went on until they wanted me to switch over to telegram. That's where the shady business starts The same receptionist, finance department names in telegram too I guess. Yes Unknown number ko reply kaun karta hai? Bc tabhi scam hote hai itne My number is on DND and so I am getting promotional messages on WhatsApp now. Is anyone looking into this crap? Bro most of the times ye Pakistani hote hain aur fir in hutiyon ki vajah se westerners hame gaali dete hain I also got it same today. I sent them a short clip of 2 Girls 1 cup and blocked them I also got one today lol Isliye bola tha Signal pe aao, WhatsApp ke ads will get more and more intrusive over time...because capitalism son Use the GOI's chakshu portal and get his ass reported. 🫤 They told me to add some items to cart on a website and send screenshot. That's it. Don't show the number. It will get handed over to someone else within 4months. I received this exact dm yoooo I got the same message today 😂😂 Yea knsa app h? 🥲 WhatsApp to nhi h ig How are they getting our numbers? That's what I don't understand! -Anaisha -gulshanmd749 Dont you already see red flag? How are these people getting our contacts, the ruling party got our contacts because it used data from government db anyway privacy is a joke in india I usually get these scam messages but in the DP there is a boy and he is pretending to be a girl 😂 merko bhi koi scam karo mai bhi 500 600 ruapy lekar unhe block karna chahta hu Just remember your accounts can be frozen even for accepting 1rs from them as they are also into money laundering. One complaint is all it will take to freeze it and you will have to get it unfrozen through court. Youve read the privacy policy on reddit right?"
}