{
    "id": "172us63",
    "title": "TIL: Narayan Murthy funded OpIndia",
    "url": "https://www.reddit.com/r/india/comments/172us63/til_narayan_murthy_funded_opindia/",
    "selftext": "Maybe its an old news for you all but just today I learnt that PoopIndia (OpIndia) website, yes the same one that promotes hate across India, is funded by Narayan Murthy's foundation.\n\nMy reference is a shitty old 2018 news link [https://www.rediff.com/news/special/busting-fake-news-who-funds-whom/20180408.htm](https://www.rediff.com/news/special/busting-fake-news-who-funds-whom/20180408.htm) but here is another archived link : [https://web.archive.org/web/20211217205447/https://www.newslaundry.com/2020/06/23/opindia-hate-speech-vanishing-advertisers-and-an-undisclosed-bjp-connection](https://web.archive.org/web/20211217205447/https://www.newslaundry.com/2020/06/23/opindia-hate-speech-vanishing-advertisers-and-an-undisclosed-bjp-connection)\n\nThe ownership of Narayan Murthy in PoopIndia is about 2-3% but the asshole still funded a toxic anti-India website while being called a pioneer and shit like that.\n\nRemember this when you see the name of Narayan Murthy next time.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696756731.0,
    "convurl": "https://external-preview.redd.it/pHUvZ1LblOFlsUxvbyLLzXD73BMLLmasxeB6qSJ_8ps.jpg?auto=webp&s=68609f59a5ecd8918b8dc6fcdf5e74b0b2a740a9",
    "comments": [
        "People should boycott him and his annoying wife.",
        "Also came across this series on Netflix:\n\nhttps://www.netflix.com/in/title/81570077"
    ],
    "cleaned_text": "til narayan murthy funded opindia maybe old news today learnt poopindia opindia website yes one promotes hate across india funded narayan murthys foundation reference shitty old news link httpswwwrediffcomnewsspecialbustingfakenewswhofundswhomhtmhttpswwwrediffcomnewsspecialbustingfakenewswhofundswhomhtm another archived link httpswebarchiveorgwebhttpswwwnewslaundrycomopindiahatespeechvanishingadvertisersandanundisclosedbjpconnectionhttpswebarchiveorgwebhttpswwwnewslaundrycomopindiahatespeechvanishingadvertisersandanundisclosedbjpconnection ownership narayan murthy poopindia asshole still funded toxic antiindia website called pioneer shit like remember see name narayan murthy next time ",
    "cleaned_title": "til narayan murthy funded opindia",
    "cleaned_selftext": "maybe old news today learnt poopindia opindia website yes one promotes hate across india funded narayan murthys foundation reference shitty old news link httpswwwrediffcomnewsspecialbustingfakenewswhofundswhomhtmhttpswwwrediffcomnewsspecialbustingfakenewswhofundswhomhtm another archived link httpswebarchiveorgwebhttpswwwnewslaundrycomopindiahatespeechvanishingadvertisersandanundisclosedbjpconnectionhttpswebarchiveorgwebhttpswwwnewslaundrycomopindiahatespeechvanishingadvertisersandanundisclosedbjpconnection ownership narayan murthy poopindia asshole still funded toxic antiindia website called pioneer shit like remember see name narayan murthy next time",
    "cleaned_comments": "people boycott annoying wife also came across series netflix",
    "light_cleaned_title": "TIL: Narayan Murthy funded OpIndia",
    "light_cleaned_selftext": "Maybe its an old news for you all but just today I learnt that PoopIndia (OpIndia) website, yes the same one that promotes hate across India, is funded by Narayan Murthy's foundation. My reference is a shitty old 2018 news link [https://www.rediff.com/news/special/busting-fake-news-who-funds-whom/20180408.htm](https://www.rediff.com/news/special/busting-fake-news-who-funds-whom/20180408.htm) but here is another archived link : [https://web.archive.org/web/20211217205447/https://www.newslaundry.com/2020/06/23/opindia-hate-speech-vanishing-advertisers-and-an-undisclosed-bjp-connection](https://web.archive.org/web/20211217205447/https://www.newslaundry.com/2020/06/23/opindia-hate-speech-vanishing-advertisers-and-an-undisclosed-bjp-connection) The ownership of Narayan Murthy in PoopIndia is about 2-3% but the asshole still funded a toxic anti-India website while being called a pioneer and shit like that. Remember this when you see the name of Narayan Murthy next time.",
    "light_cleaned_comments": "People should boycott him and his annoying wife. Also came across this series on Netflix:"
}