{
    "id": "17ebl4s",
    "title": "Gaza hospital bombing",
    "url": "https://www.reddit.com/r/india/comments/17ebl4s/gaza_hospital_bombing/",
    "selftext": "\nChannel 4 is one that major network in the UK, along with the BBC and ITV.\n\nhttps://www.channel4.com/news/human-rights-investigators-raise-new-questions-on-gaza-hospital-explosion\n\nForensic Architecture is a multidisciplinary research group based at Goldsmiths, University of London that uses architectural techniques and technologies to investigate cases of state violence and violations of human rights around the world. The group is led by architect Eyal Weizman. Wikipedia\n\nEarshot is the worlds' first not-for-profit organisation producing audio investigations for human rights and environmental advocacy.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698033367.0,
    "convurl": "https://external-preview.redd.it/P20SiJg0ReVCemteCE30zaU9EqKvV2Jkz5gCFQKeUiE.jpg?auto=webp&s=c58e121d5b0020cb8a883267f85b65ec77583b39",
    "comments": [],
    "cleaned_text": "gaza hospital bombing channel one major network uk along bbc itv forensic architecture multidisciplinary research group based goldsmiths university london uses architectural techniques technologies investigate cases state violence violations human rights around world group led architect eyal weizman wikipedia earshot worlds first notforprofit organisation producing audio investigations human rights environmental advocacy ",
    "cleaned_title": "gaza hospital bombing",
    "cleaned_selftext": "channel one major network uk along bbc itv forensic architecture multidisciplinary research group based goldsmiths university london uses architectural techniques technologies investigate cases state violence violations human rights around world group led architect eyal weizman wikipedia earshot worlds first notforprofit organisation producing audio investigations human rights environmental advocacy",
    "cleaned_comments": "",
    "light_cleaned_title": "Gaza hospital bombing",
    "light_cleaned_selftext": "Channel 4 is one that major network in the UK, along with the BBC and ITV. Forensic Architecture is a multidisciplinary research group based at Goldsmiths, University of London that uses architectural techniques and technologies to investigate cases of state violence and violations of human rights around the world. The group is led by architect Eyal Weizman. Wikipedia Earshot is the worlds' first not-for-profit organisation producing audio investigations for human rights and environmental advocacy.",
    "light_cleaned_comments": ""
}