{
    "id": "16gpbcl",
    "title": "What are your thoughts on \"THE VACCINE WAR\" trailer?",
    "url": "https://www.reddit.com/r/india/comments/16gpbcl/what_are_your_thoughts_on_the_vaccine_war_trailer/",
    "selftext": "[TRAILER LINK](https://www.youtube.com/watch?v=sFfzp5bqr10)\n\nAfter making movies like chocolate, hate story and zid, almost all of them which didn't work at the box office. Is he just trying to churn people's money with political and deshbhakti propaganda ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694519505.0,
    "convurl": "https://external-preview.redd.it/aSg_CKSdJ2S3AdOljEYpsz_D16SszwCGG-jEKOlNpEs.jpg?auto=webp&s=82af22f04c578d796a8e1f8d4861ff407d675d67",
    "comments": [
        "Not giving a single view to Hatred Spreader.\n\nIf I have to ever watch it, I’ll Telegram it",
        "A vaccine war which doesn't mention we only got the vaccine because Central government lost the case in Supreme Court is just a big lie",
        "I think he is the biggest hypocrite in Btown,   \n( A deshbhakt who has case of molestation from Tanushree Dutta )"
    ],
    "cleaned_text": "thoughts vaccine war trailer trailer linkhttpswwwyoutubecomwatchvsffzpbqr making movies like chocolate hate story zid almost didnt work box office trying churn peoples money political deshbhakti propaganda ",
    "cleaned_title": "thoughts vaccine war trailer",
    "cleaned_selftext": "trailer linkhttpswwwyoutubecomwatchvsffzpbqr making movies like chocolate hate story zid almost didnt work box office trying churn peoples money political deshbhakti propaganda",
    "cleaned_comments": "giving single view hatred spreader ever watch ill telegram vaccine war doesnt mention got vaccine central government lost case supreme court big lie think biggest hypocrite btown deshbhakt case molestation tanushree dutta",
    "light_cleaned_title": "What are your thoughts on \"THE VACCINE WAR\" trailer?",
    "light_cleaned_selftext": "[TRAILER LINK](https://www.youtube.com/watch?v=sFfzp5bqr10) After making movies like chocolate, hate story and zid, almost all of them which didn't work at the box office. Is he just trying to churn people's money with political and deshbhakti propaganda ?",
    "light_cleaned_comments": "Not giving a single view to Hatred Spreader. If I have to ever watch it, I’ll Telegram it A vaccine war which doesn't mention we only got the vaccine because Central government lost the case in Supreme Court is just a big lie I think he is the biggest hypocrite in Btown, ( A deshbhakt who has case of molestation from Tanushree Dutta )"
}