{
    "id": "1efu64f",
    "title": "High-level inter-ministerial panel identifies loopholes in banking, immigration and telecom sectors that enable cyber scams",
    "url": "https://www.reddit.com/r/india/comments/1efu64f/highlevel_interministerial_panel_identifies/",
    "selftext": "India's financial sector is in the spotlight as the nation grapples with a cybercrime wave that has exposed deep-rooted problems within its public banks. According to the Indian Express, recent government probes have unearthed a troubling pattern of senior managers at major state-owned banks like the State Bank of India and Punjab National Bank allegedly setting up \"mule\" accounts to launder money, a shocking abuse of their positions and the public's trust. This, coupled with the fact that nearly 30,000 Indians haven't returned from Southeast Asian countries such as Cambodia, Laos, Vietnam, Thailand and Malaysia, potentially ensnared in cyber scams linked to these banking lapses, paints a dire picture.  \n  \n>Indian Express: [Panel finds cracks that help hackers target jobseekers](https://indianexpress.com/article/india/panel-finds-cracks-that-help-hackers-target-jobseekers-9479932/) (28 July 2024)  \n  \n>Recently, a meeting was held by the Home Ministry with the officials of the Telecom Ministry, Financial Intelligence Unit, RBI, MeiTY, NIA, CBI and security experts of other agencies.  \n  \n>According to sources, three shortcomings in the system that have been identified include: Involvement of the senior bank managers of two nationalised banks to open mule accounts; around 30,000 unreturned passengers travelling on visitor visa to Cambodia, Thailand, Myanmar and Vietnam from January 2022-May 2024, and misuse of bulk SIM cards.  \n  \n>A source said Union Home Minister [Amit Shah](https://indianexpress.com/about/amit-shah/) may meet all the officials in the coming days, and take an update on the Centre’s action. Recently, a meeting was held by the Home Ministry with the officials of the Telecom Ministry, Financial Intelligence Unit, RBI, MeiTY, NIA, CBI and security experts of other agencies. \\[article continues\\]\n\nThese aren't just isolated incidents; they're glaring symptoms of widespread institutional failures that could jeopardise India's national security and economy. The banks' silence and apparent inaction in the face of these findings are especially alarming, suggesting a potential disconnect between internal controls and the public's expectations of financial integrity.\n\nThe situation becomes even more ominous when considering the [arrest of a Yakuza leader for trafficking nuclear materials](https://np.reddit.com/r/GeopoliticsIndia/comments/1ax62vx/nuclear_concerns_in_southeast_asia_and_indias/) from Burma in 2022, and the revelation that scam centers in Southeast Asia [siphon off USD 39 billion annually from global victims](https://www.voanews.com/a/report-southeast-asia-scam-centers-swindle-billions/7655765.html) – and reportedly USD 60 million from India in the first half of this year. This disturbing link between organized crime and institutional negligence raises serious concerns. The money stolen doesn't just line criminals' pockets; it could potentially fund activities that destabilize the region, including supporting organized crime and terrorism within India.\n\nGiven these immense risks, why should these state-owned banks not be privatised? Why should taxpayers continue to bear the brunt of these banks' failures, which not only cause financial losses but also compromise national security? The ongoing misuse of authority within these institutions raises hard-hitting questions about their viability as public entities. If they can't protect themselves from such vulnerabilities, perhaps it's time to rethink their structure and ownership. Is continued state ownership justified when it seems to facilitate more harm than good? How long will India allow a few to profit at the expense of the many?\n\n",
    "flair": "Crime",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1722348222.0,
    "convurl": "https://external-preview.redd.it/20bBsWXdkq1x2AA4w74RY2jdJHWQQtlO0PLt32uua10.jpg?auto=webp&s=6cce2a606d853d57590ea804c862e0cca4b2ae35",
    "comments": [],
    "cleaned_text": "highlevel interministerial panel identifies loopholes banking immigration telecom sectors enable cyber scams indias financial sector spotlight nation grapples cybercrime wave exposed deeprooted problems within public banks according indian express recent government probes unearthed troubling pattern senior managers major stateowned banks like state bank india punjab national bank allegedly setting mule accounts launder money shocking abuse positions publics trust coupled fact nearly indians havent returned southeast asian countries cambodia laos vietnam thailand malaysia potentially ensnared cyber scams linked banking lapses paints dire picture indian express panel finds cracks help hackers target jobseekershttpsindianexpresscomarticleindiapanelfindscracksthathelphackerstargetjobseekers july recently meeting held home ministry officials telecom ministry financial intelligence unit rbi meity nia cbi security experts agencies according sources three shortcomings system identified include involvement senior bank managers two nationalised banks open mule accounts around unreturned passengers travelling visitor visa cambodia thailand myanmar vietnam january may misuse bulk sim cards source said union home minister amit shahhttpsindianexpresscomaboutamitshah may meet officials coming days take update centres action recently meeting held home ministry officials telecom ministry financial intelligence unit rbi meity nia cbi security experts agencies article continues arent isolated incidents theyre glaring symptoms widespread institutional failures could jeopardise indias national security economy banks silence apparent inaction face findings especially alarming suggesting potential disconnect internal controls publics expectations financial integrity situation becomes even ominous considering arrest yakuza leader trafficking nuclear materialshttpsnpredditcomrgeopoliticsindiacommentsaxvxnuclearconcernsinsoutheastasiaandindias burma revelation scam centers southeast asia siphon usd billion annually global victimshttpswwwvoanewscomareportsoutheastasiascamcentersswindlebillionshtml reportedly usd million india first half year disturbing link organized crime institutional negligence raises serious concerns money stolen doesnt line criminals pockets could potentially fund activities destabilize region including supporting organized crime terrorism within india given immense risks stateowned banks privatised taxpayers continue bear brunt banks failures cause financial losses also compromise national security ongoing misuse authority within institutions raises hardhitting questions viability public entities cant protect vulnerabilities perhaps time rethink structure ownership continued state ownership justified seems facilitate harm good long india allow profit expense many ",
    "cleaned_title": "highlevel interministerial panel identifies loopholes banking immigration telecom sectors enable cyber scams",
    "cleaned_selftext": "indias financial sector spotlight nation grapples cybercrime wave exposed deeprooted problems within public banks according indian express recent government probes unearthed troubling pattern senior managers major stateowned banks like state bank india punjab national bank allegedly setting mule accounts launder money shocking abuse positions publics trust coupled fact nearly indians havent returned southeast asian countries cambodia laos vietnam thailand malaysia potentially ensnared cyber scams linked banking lapses paints dire picture indian express panel finds cracks help hackers target jobseekershttpsindianexpresscomarticleindiapanelfindscracksthathelphackerstargetjobseekers july recently meeting held home ministry officials telecom ministry financial intelligence unit rbi meity nia cbi security experts agencies according sources three shortcomings system identified include involvement senior bank managers two nationalised banks open mule accounts around unreturned passengers travelling visitor visa cambodia thailand myanmar vietnam january may misuse bulk sim cards source said union home minister amit shahhttpsindianexpresscomaboutamitshah may meet officials coming days take update centres action recently meeting held home ministry officials telecom ministry financial intelligence unit rbi meity nia cbi security experts agencies article continues arent isolated incidents theyre glaring symptoms widespread institutional failures could jeopardise indias national security economy banks silence apparent inaction face findings especially alarming suggesting potential disconnect internal controls publics expectations financial integrity situation becomes even ominous considering arrest yakuza leader trafficking nuclear materialshttpsnpredditcomrgeopoliticsindiacommentsaxvxnuclearconcernsinsoutheastasiaandindias burma revelation scam centers southeast asia siphon usd billion annually global victimshttpswwwvoanewscomareportsoutheastasiascamcentersswindlebillionshtml reportedly usd million india first half year disturbing link organized crime institutional negligence raises serious concerns money stolen doesnt line criminals pockets could potentially fund activities destabilize region including supporting organized crime terrorism within india given immense risks stateowned banks privatised taxpayers continue bear brunt banks failures cause financial losses also compromise national security ongoing misuse authority within institutions raises hardhitting questions viability public entities cant protect vulnerabilities perhaps time rethink structure ownership continued state ownership justified seems facilitate harm good long india allow profit expense many",
    "cleaned_comments": "",
    "light_cleaned_title": "High-level inter-ministerial panel identifies loopholes in banking, immigration and telecom sectors that enable cyber scams",
    "light_cleaned_selftext": "India's financial sector is in the spotlight as the nation grapples with a cybercrime wave that has exposed deep-rooted problems within its public banks. According to the Indian Express, recent government probes have unearthed a troubling pattern of senior managers at major state-owned banks like the State Bank of India and Punjab National Bank allegedly setting up \"mule\" accounts to launder money, a shocking abuse of their positions and the public's trust. This, coupled with the fact that nearly 30,000 Indians haven't returned from Southeast Asian countries such as Cambodia, Laos, Vietnam, Thailand and Malaysia, potentially ensnared in cyber scams linked to these banking lapses, paints a dire picture. >Indian Express: [Panel finds cracks that help hackers target jobseekers](https://indianexpress.com/article/india/panel-finds-cracks-that-help-hackers-target-jobseekers-9479932/) (28 July 2024) >Recently, a meeting was held by the Home Ministry with the officials of the Telecom Ministry, Financial Intelligence Unit, RBI, MeiTY, NIA, CBI and security experts of other agencies. >According to sources, three shortcomings in the system that have been identified include: Involvement of the senior bank managers of two nationalised banks to open mule accounts; around 30,000 unreturned passengers travelling on visitor visa to Cambodia, Thailand, Myanmar and Vietnam from January 2022-May 2024, and misuse of bulk SIM cards. >A source said Union Home Minister [Amit Shah](https://indianexpress.com/about/amit-shah/) may meet all the officials in the coming days, and take an update on the Centre’s action. Recently, a meeting was held by the Home Ministry with the officials of the Telecom Ministry, Financial Intelligence Unit, RBI, MeiTY, NIA, CBI and security experts of other agencies. \\[article continues\\] These aren't just isolated incidents; they're glaring symptoms of widespread institutional failures that could jeopardise India's national security and economy. The banks' silence and apparent inaction in the face of these findings are especially alarming, suggesting a potential disconnect between internal controls and the public's expectations of financial integrity. The situation becomes even more ominous when considering the [arrest of a Yakuza leader for trafficking nuclear materials](https://np.reddit.com/r/GeopoliticsIndia/comments/1ax62vx/nuclear_concerns_in_southeast_asia_and_indias/) from Burma in 2022, and the revelation that scam centers in Southeast Asia [siphon off USD 39 billion annually from global victims](https://www.voanews.com/a/report-southeast-asia-scam-centers-swindle-billions/7655765.html) – and reportedly USD 60 million from India in the first half of this year. This disturbing link between organized crime and institutional negligence raises serious concerns. The money stolen doesn't just line criminals' pockets; it could potentially fund activities that destabilize the region, including supporting organized crime and terrorism within India. Given these immense risks, why should these state-owned banks not be privatised? Why should taxpayers continue to bear the brunt of these banks' failures, which not only cause financial losses but also compromise national security? The ongoing misuse of authority within these institutions raises hard-hitting questions about their viability as public entities. If they can't protect themselves from such vulnerabilities, perhaps it's time to rethink their structure and ownership. Is continued state ownership justified when it seems to facilitate more harm than good? How long will India allow a few to profit at the expense of the many?",
    "light_cleaned_comments": ""
}