{
    "id": "197h2yf",
    "title": "AI is coming for the jobs while we are busy with Religious bullshit",
    "url": "https://www.reddit.com/r/india/comments/197h2yf/ai_is_coming_for_the_jobs_while_we_are_busy_with/",
    "selftext": "It feels surreal that nobody in India is talking at a high level about plans to restructure our economy in case new IT jobs disappear in say 5-10 years. We have 100s of million of youth who need job.\n\n If IT jobs go it will bring down most sectors since spending by IT companies and employees has become a big part of the growth economy.\n\n[AI to hit 40% of jobs and worsen inequality, IMF says](https://www.bbc.com/news/business-67977967)\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 12,
    "num_comments": 6,
    "created_utc": 1705346106.0,
    "convurl": "https://external-preview.redd.it/vPlwlQ30bCyZGHNPQUCLWzpoPWHk_Owsn5A70FFctL4.jpg?auto=webp&s=256b43fd28e30cb22211e415a3c23a51a3a95923",
    "comments": [
        "Haha yes\n\nI posted it other day here but people in Reddit India or in general in India don't understand the impact it will have for our workforce. We have large population and AI eats people for fun. \n\nA lot of us will be screwed especially people with medicore skills. AI has almost automated 70% of IT coding jobs in Python etc. You just need to ask one question and ask another to improve the code etc.\n\nPeople in creative fields, writing fields all are seeing impact of it. As tools become more and more easy to use it will have large impact. People who are freelancing content writing etc all are going to be unemployed in few years. Jobs that need face to face interaction like teachers or doctors will have some less impact. \n\nThe good thing is AI is still not able to create something totally new and it can generate wrong information so for that part humans still will be in job.\n\nThe current political landscape is too naive to understand anything of that sort other than using AI to creating deep fakes of opposition parties and defame them.",
        "didn't you know AI was already invented by Indians thousands of year back?. /s\nthat's how people are gonna cope up.",
        "Really? You're pretty naive to base the post around religious bullshit. Those who know, know. and those don't, they're completely unaware. It's the same everywhere. Do you think it's just 'india' matter alone? It's a matter of all place, and tell me which government of which nation is currently trying to fight the incoming wave of ai? But nah, let's start with bullshiting. Better learn to separate your view before pandering to anything.",
        "Another \"we could build a hospital there \" argument"
    ],
    "cleaned_text": "ai coming jobs busy religious bullshit feels surreal nobody india talking high level plans restructure economy case new jobs disappear say years million youth need job jobs go bring sectors since spending companies employees become big part growth economy ai hit jobs worsen inequality imf sayshttpswwwbbccomnewsbusiness xb ",
    "cleaned_title": "ai coming jobs busy religious bullshit",
    "cleaned_selftext": "feels surreal nobody india talking high level plans restructure economy case new jobs disappear say years million youth need job jobs go bring sectors since spending companies employees become big part growth economy ai hit jobs worsen inequality imf sayshttpswwwbbccomnewsbusiness xb",
    "cleaned_comments": "haha yes posted day people reddit india general india dont understand impact workforce large population ai eats people fun lot us screwed especially people medicore skills ai almost automated coding jobs python etc need ask one question ask another improve code etc people creative fields writing fields seeing impact tools become easy use large impact people freelancing content writing etc going unemployed years jobs need face face interaction like teachers doctors less impact good thing ai still able create something totally new generate wrong information part humans still job current political landscape naive understand anything sort using ai creating deep fakes opposition parties defame didnt know ai already invented indians thousands year back thats people gon na cope really youre pretty naive base post around religious bullshit know know dont theyre completely unaware everywhere think india matter alone matter place tell government nation currently trying fight incoming wave ai nah lets start bullshiting better learn separate view pandering anything another could build hospital argument",
    "light_cleaned_title": "AI is coming for the jobs while we are busy with Religious bullshit",
    "light_cleaned_selftext": "It feels surreal that nobody in India is talking at a high level about plans to restructure our economy in case new IT jobs disappear in say 5-10 years. We have 100s of million of youth who need job. If IT jobs go it will bring down most sectors since spending by IT companies and employees has become a big part of the growth economy. [AI to hit 40% of jobs and worsen inequality, IMF says](https://www.bbc.com/news/business-67977967) &#x200B;",
    "light_cleaned_comments": "Haha yes I posted it other day here but people in Reddit India or in general in India don't understand the impact it will have for our workforce. We have large population and AI eats people for fun. A lot of us will be screwed especially people with medicore skills. AI has almost automated 70% of IT coding jobs in Python etc. You just need to ask one question and ask another to improve the code etc. People in creative fields, writing fields all are seeing impact of it. As tools become more and more easy to use it will have large impact. People who are freelancing content writing etc all are going to be unemployed in few years. Jobs that need face to face interaction like teachers or doctors will have some less impact. The good thing is AI is still not able to create something totally new and it can generate wrong information so for that part humans still will be in job. The current political landscape is too naive to understand anything of that sort other than using AI to creating deep fakes of opposition parties and defame them. didn't you know AI was already invented by Indians thousands of year back?. /s that's how people are gonna cope up. Really? You're pretty naive to base the post around religious bullshit. Those who know, know. and those don't, they're completely unaware. It's the same everywhere. Do you think it's just 'india' matter alone? It's a matter of all place, and tell me which government of which nation is currently trying to fight the incoming wave of ai? But nah, let's start with bullshiting. Better learn to separate your view before pandering to anything. Another \"we could build a hospital there \" argument"
}