{
    "id": "14mc50t",
    "title": "Urgent Help Needed for KITTU, a 5-Month-Old Cat Fighting Feline Panleukopenia Virus in Pune!",
    "url": "https://www.reddit.com/gallery/14mc50t",
    "selftext": "Hello, fellow Redditors!\n\nI come to you today with a heartfelt plea for your support. Meet KITTU, a 5-month-old female orange cat who is currently battling Feline Panleukopenia Virus at the Pune Crown Vet Hospital. I have attached her blood report and a 1-day bill estimate for your reference.\n\nBlood report:\nhttp://crownvet.thevetbuddy.com/162857_1688073226.pdf?viewbig=165366\n\nKITTU is a vibrant and cheerful cat who deserves a fighting chance at a healthy life. Unfortunately, due to the ongoing monsoon season, she contracted this virus as she was not vaccinated.\n\nThe vet has informed us that KITTU's condition is critical, and she requires extensive observation and medical care. After her observation period, she will be placed in foster care, which costs around 500 rupees per day. We are doing everything we can to ensure she gets the care she needs, but the financial burden is becoming overwhelming.\n\nThat's why I am reaching out to the compassionate and caring Reddit community for assistance. Any donation, no matter how small, will make a significant difference in KITTU's fight against this virus. We have set up a UPI code and PayPal account for your convenience:\n\n\nPayPal:https://www.paypal.me/siddharthtamrakar\n\n\nUPI ID: therealsiddharthtamrakar@okhdfcbank\n\n\nYour contributions will directly go towards KITTU's medical expenses, including her treatment, medication, observation period, and foster care. We genuinely believe that with your help, we can give this adorable cat a chance to live a healthy and fulfilling life.\n\nI understand that times are tough for everyone, and not everyone can contribute financially. However, if you are unable to donate, please consider sharing KITTU's story with your friends, family, or any animal-loving communities you are part of. Spreading the word can go a long way in helping us reach our goal and finding KITTU a forever home once she recovers.\n\nThank you from the bottom of our hearts for taking the time to read KITTU's story. Your generosity and support mean the world to us. Let's come together as a community and give KITTU the love and care she deserves.\n\nUpdates on KITTU's progress and further donation details can be found in the comments below.",
    "flair": "AskIndia",
    "score": 65,
    "num_comments": 15,
    "created_utc": 1688062443.0,
    "convurl": "https://i.redd.it/5xih2eqa009b1.jpg",
    "comments": [
        "Why take cat to such a fancy hospital if you don't have the money and resources ?",
        "Because cheap hospitals don't have 24*7 care and 24*7 care is required for viral infection",
        "4 month kitten is old enough,, just ask doctor to give her IV fluids once daily and proper medication twice a day. \n\nYou can take her daily once to the doctor for IV.\n\nNo need for 24x7 care.\n\nLet her rest and recuperate.\n\n\nHere, either the doctor is milking you or you are milking the public.\n\nCall animal care , they do good work with the money you give them .\n\nThese fancy hospitals are not for strays,\nDoctor will overcharge,\nYou are better served with funding to any animal aid program .",
        "How can you say that we are Milking public ! , we have shared all the costs and bills \nWe previously lost 2 cats which were 6 months old to this virus.\nAnd since we cant keep her at our house due to family restrictions.The foster charges us 500 per day,So we still need money.\n\nIf you have any contacts or NGOs please share",
        "RESQ is the best as per feedback I have received.\n\n\nI would suggest you take him/her there,\n\n also I would **advise people to donate to RESQ** instead of doing personal donations.",
        "Yes please tell people to donate to the shelter but meanwhile please refrain yourself from pointing fingers towards rescuers who are trying to save lives when all bills and documents are shared with you",
        "Suspicious username",
        "Don't pay, it's that simple.",
        "Upvoted for visibility"
    ],
    "cleaned_text": "urgent help needed kittu monthold cat fighting feline panleukopenia virus pune hello fellow redditors come today heartfelt plea support meet kittu monthold female orange cat currently battling feline panleukopenia virus pune crown vet hospital attached blood report day bill estimate reference blood report kittu vibrant cheerful cat deserves fighting chance healthy life unfortunately due ongoing monsoon season contracted virus vaccinated vet informed us kittus condition critical requires extensive observation medical care observation period placed foster care costs around rupees per day everything ensure gets care needs financial burden becoming overwhelming thats reaching compassionate caring reddit community assistance donation matter small make significant difference kittus fight virus set upi code paypal account convenience paypalhttpswwwpaypalmesiddharthtamrakar upi id therealsiddharthtamrakarokhdfcbank contributions directly go towards kittus medical expenses including treatment medication observation period foster care genuinely believe help give adorable cat chance live healthy fulfilling life understand times tough everyone everyone contribute financially however unable donate please consider sharing kittus story friends family animalloving communities part spreading word go long way helping us reach goal finding kittu forever home recovers thank bottom hearts taking time read kittus story generosity support mean world us lets come together community give kittu love care deserves updates kittus progress donation details found comments ",
    "cleaned_title": "urgent help needed kittu monthold cat fighting feline panleukopenia virus pune",
    "cleaned_selftext": "hello fellow redditors come today heartfelt plea support meet kittu monthold female orange cat currently battling feline panleukopenia virus pune crown vet hospital attached blood report day bill estimate reference blood report kittu vibrant cheerful cat deserves fighting chance healthy life unfortunately due ongoing monsoon season contracted virus vaccinated vet informed us kittus condition critical requires extensive observation medical care observation period placed foster care costs around rupees per day everything ensure gets care needs financial burden becoming overwhelming thats reaching compassionate caring reddit community assistance donation matter small make significant difference kittus fight virus set upi code paypal account convenience paypalhttpswwwpaypalmesiddharthtamrakar upi id therealsiddharthtamrakarokhdfcbank contributions directly go towards kittus medical expenses including treatment medication observation period foster care genuinely believe help give adorable cat chance live healthy fulfilling life understand times tough everyone everyone contribute financially however unable donate please consider sharing kittus story friends family animalloving communities part spreading word go long way helping us reach goal finding kittu forever home recovers thank bottom hearts taking time read kittus story generosity support mean world us lets come together community give kittu love care deserves updates kittus progress donation details found comments",
    "cleaned_comments": "take cat fancy hospital dont money resources cheap hospitals dont care care required viral infection month kitten old enough ask doctor give iv fluids daily proper medication twice day take daily doctor iv need x care let rest recuperate either doctor milking milking public call animal care good work money give fancy hospitals strays doctor overcharge better served funding animal aid program say milking public shared costs bills previously lost cats months old virus since cant keep house due family restrictionsthe foster charges us per dayso still need money contacts ngos please share resq best per feedback received would suggest take himher also would advise people donate resq instead personal donations yes please tell people donate shelter meanwhile please refrain pointing fingers towards rescuers trying save lives bills documents shared suspicious username dont pay simple upvoted visibility",
    "light_cleaned_title": "Urgent Help Needed for KITTU, a 5-Month-Old Cat Fighting Feline Panleukopenia Virus in Pune!",
    "light_cleaned_selftext": "Hello, fellow Redditors! I come to you today with a heartfelt plea for your support. Meet KITTU, a 5-month-old female orange cat who is currently battling Feline Panleukopenia Virus at the Pune Crown Vet Hospital. I have attached her blood report and a 1-day bill estimate for your reference. Blood report: KITTU is a vibrant and cheerful cat who deserves a fighting chance at a healthy life. Unfortunately, due to the ongoing monsoon season, she contracted this virus as she was not vaccinated. The vet has informed us that KITTU's condition is critical, and she requires extensive observation and medical care. After her observation period, she will be placed in foster care, which costs around 500 rupees per day. We are doing everything we can to ensure she gets the care she needs, but the financial burden is becoming overwhelming. That's why I am reaching out to the compassionate and caring Reddit community for assistance. Any donation, no matter how small, will make a significant difference in KITTU's fight against this virus. We have set up a UPI code and PayPal account for your convenience: PayPal:https://www.paypal.me/siddharthtamrakar UPI ID: therealsiddharthtamrakar@okhdfcbank Your contributions will directly go towards KITTU's medical expenses, including her treatment, medication, observation period, and foster care. We genuinely believe that with your help, we can give this adorable cat a chance to live a healthy and fulfilling life. I understand that times are tough for everyone, and not everyone can contribute financially. However, if you are unable to donate, please consider sharing KITTU's story with your friends, family, or any animal-loving communities you are part of. Spreading the word can go a long way in helping us reach our goal and finding KITTU a forever home once she recovers. Thank you from the bottom of our hearts for taking the time to read KITTU's story. Your generosity and support mean the world to us. Let's come together as a community and give KITTU the love and care she deserves. Updates on KITTU's progress and further donation details can be found in the comments below.",
    "light_cleaned_comments": "Why take cat to such a fancy hospital if you don't have the money and resources ? Because cheap hospitals don't have 24*7 care and 24*7 care is required for viral infection 4 month kitten is old enough,, just ask doctor to give her IV fluids once daily and proper medication twice a day. You can take her daily once to the doctor for IV. No need for 24x7 care. Let her rest and recuperate. Here, either the doctor is milking you or you are milking the public. Call animal care , they do good work with the money you give them . These fancy hospitals are not for strays, Doctor will overcharge, You are better served with funding to any animal aid program . How can you say that we are Milking public ! , we have shared all the costs and bills We previously lost 2 cats which were 6 months old to this virus. And since we cant keep her at our house due to family restrictions.The foster charges us 500 per day,So we still need money. If you have any contacts or NGOs please share RESQ is the best as per feedback I have received. I would suggest you take him/her there, also I would **advise people to donate to RESQ** instead of doing personal donations. Yes please tell people to donate to the shelter but meanwhile please refrain yourself from pointing fingers towards rescuers who are trying to save lives when all bills and documents are shared with you Suspicious username Don't pay, it's that simple. Upvoted for visibility"
}