{
    "id": "16kpxki",
    "title": "Centre publishes disability database stripped of socio-economic figures",
    "url": "https://www.thehindu.com/news/national/govt-shelves-socio-economic-data-of-pwds-as-disability-database-goes-online/article67312174.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fgovt-shelves-socio-economic-data-of-pwds-as-disability-database-goes-online%2Farticle67312174.ece",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694919966.0,
    "convurl": "https://external-preview.redd.it/rjh8HLq5t3jXr_1ZtSzqLfDtu1zDLjjxflqtFXQBUdw.jpg?auto=webp&s=a5dfa73009f1d406b4a1ce9b34deed4f0d1ea740",
    "comments": [
        ">The Social Justice & Empowerment Ministry doubts ‘quality’ of socio-economic data collected; not many filled the socio-economic fields as they were not mandatory, say officials; earlier this year, a parliamentary panel had raised doubts about the department’s ability to collect accurate population through UDID mechanism in time\n\n\n>The Union government is shelving whatever socio-economic data it had collected, while registering about 94 lakh Persons with Disabilities (PwDs) across the country for Unique Disability ID (UDID) cards in the last six years, The Hindu has learnt. The Ministry of Social Justice and Empowerment is justifying the move by questioning the “quality” of the socio-economic data collected.\n\n>The data being shelved includes information like socio-economic category (caste), level of education, employment status, income (personal and family) and marital status of PwDs, with officials saying the focus of the form was always to collect disability data and hence all these fields were made optional. Consequently, many skipped them."
    ],
    "cleaned_text": "centre publishes disability database stripped socioeconomic figures  ",
    "cleaned_title": "centre publishes disability database stripped socioeconomic figures",
    "cleaned_selftext": "",
    "cleaned_comments": "social justice empowerment ministry doubts quality socioeconomic data collected many filled socioeconomic fields mandatory say officials earlier year parliamentary panel raised doubts departments ability collect accurate population udid mechanism time union government shelving whatever socioeconomic data collected registering lakh persons disabilities pwds across country unique disability id udid cards last six years hindu learnt ministry social justice empowerment justifying move questioning quality socioeconomic data collected data shelved includes information like socioeconomic category caste level education employment status income personal family marital status pwds officials saying focus form always collect disability data hence fields made optional consequently many skipped",
    "light_cleaned_title": "Centre publishes disability database stripped of socio-economic figures",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">The Social Justice & Empowerment Ministry doubts ‘quality’ of socio-economic data collected; not many filled the socio-economic fields as they were not mandatory, say officials; earlier this year, a parliamentary panel had raised doubts about the department’s ability to collect accurate population through UDID mechanism in time >The Union government is shelving whatever socio-economic data it had collected, while registering about 94 lakh Persons with Disabilities (PwDs) across the country for Unique Disability ID (UDID) cards in the last six years, The Hindu has learnt. The Ministry of Social Justice and Empowerment is justifying the move by questioning the “quality” of the socio-economic data collected. >The data being shelved includes information like socio-economic category (caste), level of education, employment status, income (personal and family) and marital status of PwDs, with officials saying the focus of the form was always to collect disability data and hence all these fields were made optional. Consequently, many skipped them."
}