{
    "id": "16xn0bl",
    "title": "Posters criticising PM Modi appear as he arrives in Hyderabad",
    "url": "https://www.thehindu.com/news/national/telangana/posters-criticising-pm-modi-erected-as-he-arrives-in-hyderabad/article67368615.ece/amp/",
    "selftext": "Well done people of Hyderabad!!",
    "flair": "Politics",
    "score": 1,
    "num_comments": 21,
    "created_utc": 1696220627.0,
    "convurl": "https://external-preview.redd.it/dYvz4hovEQ2ULapRncVehpUXYkDNXTRJCr6GlsGZVCM.jpg?auto=webp&s=755bdde84e7096c50b88d7f77ef81b2e5e57a3da",
    "comments": [
        "After every visit to any southern state, Muddi would need to see the psychotherapist.",
        "Isn't even much news. They do it every time Modiji lands. I think this time BJP have put up counter posters as well. The games are ramping up.",
        "They will massage his ego by doing some flower shower on him on his return. JP Nadda's main KRA is keeping Modis ego happy.",
        "This happens all the time",
        "Wrong! Narcissists don't seek help",
        "Based hyderabadi people.",
        "Psycho the rapist???",
        "Or do another event with lots od photographers",
        "Hate emboldens them more as they think they're better than the rest."
    ],
    "cleaned_text": "posters criticising pm modi appear arrives hyderabad well done people hyderabad ",
    "cleaned_title": "posters criticising pm modi appear arrives hyderabad",
    "cleaned_selftext": "well done people hyderabad",
    "cleaned_comments": "every visit southern state muddi would need see psychotherapist isnt even much news every time modiji lands think time bjp put counter posters well games ramping massage ego flower shower return jp naddas main kra keeping modis ego happy happens time wrong narcissists dont seek help based hyderabadi people psycho rapist another event lots od photographers hate emboldens think theyre better rest",
    "light_cleaned_title": "Posters criticising PM Modi appear as he arrives in Hyderabad",
    "light_cleaned_selftext": "Well done people of Hyderabad!!",
    "light_cleaned_comments": "After every visit to any southern state, Muddi would need to see the psychotherapist. Isn't even much news. They do it every time Modiji lands. I think this time BJP have put up counter posters as well. The games are ramping up. They will massage his ego by doing some flower shower on him on his return. JP Nadda's main KRA is keeping Modis ego happy. This happens all the time Wrong! Narcissists don't seek help Based hyderabadi people. Psycho the rapist??? Or do another event with lots od photographers Hate emboldens them more as they think they're better than the rest."
}