{
    "id": "1gmd1au",
    "title": "Neem Karoli Baba was a creep who abused women",
    "url": "https://www.reddit.com/r/india/comments/1gmd1au/neem_karoli_baba_was_a_creep_who_abused_women/",
    "selftext": "NKB was a creep who abused women!! Several accounts have been published by his own disciple, Ram Dass, in a positive light in his book, \"Miracle of Love: Stories about Neem Karoli Baba.\" Further editions removes a lot of controversial stories. If you need that pdf, I will share it with you. \n\nhttps://therevealer.org/the-guru-disciple-relationship-and-the-complications-of-consent/\n\nI am adding some excerpts -\n\nThe first time he [Guru Neem Karoli Baba] took me in the room alone I sat up on the tucket [low wooden bed] with him, and he was like a seventeen-year-old jock who was a little fast! I felt as if I were fifteen and innocent. He started making out with me, and it was so cute, so pure. I was swept into it for a few moments—then grew alarmed: “Wait! This is my guru. One doesn’t do this with one’s guru!” So I pulled away from him. Then Maharajji [Neem Karoli Baba] tilted his head sideways and wrinkled up his eyebrows in a tender, endearing, quizzical look. He didn’t say anything, but his whole being was saying to me, “Don’t you like me?”\n\nBut as soon as I walked out of that particular darshan [the ritual act of seeing and being seen by the divine], I started getting so sick that by the end of the day I felt I had vomited and shit out everything that was ever inside me. I had to be carried out of the ashram [religious hermitage]. On the way, we stopped by Maharajji’s [Neem Karoli Baba’s] room so I could pranam [prostrate] to him. I kneeled by the tucket and put my head down by his feet—and he kicked me in the head, saying, “Get her out of here!” . . .\n\nThat was the first time, and I was to be there for two years. During my last month there, I was alone with him every day in the room . . . Sometimes he would just touch me on the breasts and between my legs, saying, “This is mine, this is mine, this is mine. All is mine. You are mine.” You can interpret it as you want, but near the end in these darshans, it was as though he were my child. Sometimes I felt as though I were suckling a tiny baby.\n\nHOW DO MEN AND WOMEN HAVE THE GUTS TO CALL HIM AN AVATAR OF HANUMAN???? \n\n",
    "flair": "Rant / Vent",
    "score": 36,
    "num_comments": 27,
    "created_utc": 1731050499.0,
    "convurl": "https://external-preview.redd.it/0cTVI3Xh-jbP7vWDJdJJB4zMrKR1yin4SM1Se5Lg9f0.jpg?auto=webp&s=80f366d86fda7b01444ebd43fa9884d0051124ff",
    "comments": [
        "Don’t believe everything you read on internet.",
        "Most of these self proclaimed godmen are creeps",
        "Phir bhi mohommad 6 vote se aage hai.",
        "This is a huge thing for me to read. I really thought he was different and i still think this is fake. All other Babas have bad track records I don't know what to believe.",
        "ka-boom  :⁠0",
        "His own Disciple Ram Dass wrote it in the book. If you want the pdf, let me know",
        "I know, right!!",
        "Bhagwan ko bhakti keliye ye baba ki jarurat nahi hai",
        "Here is the pdf\n \n\nhttps://maharajji.love/files/downloads/pdf_downloads/MoL-20.pdf",
        "Nowadays, anyone can write anything, and people like you who feed on hate love spreading it will believe it without any substantial evidence.",
        "I’ve already read this article few years ago.Making Allegation on anyone is easiest,proving it true is the toughest.",
        "Please share the pdf.",
        "Here -\n\nhttps://maharajji.love/files/downloads/pdf_downloads/MoL-20.pdf",
        "Do you believe he was an incarnation of Hanuman?",
        "seems like this has become part of bucket list for all babas and even mahatma (iykyk) 😣",
        "Provide proof. Anyone with ill intentions to damage someone's reputation and spread falsehoods can write anything. People like you seem to enjoy spreading hate and hurting others' sentiments. Many of his followers would say the opposite   would you believe that?",
        "Country blinded by religion, what else would u expect? We are developing backwards. No doubt India has no significant footprint in any research and development innovations or any other innovations globally except few very few.",
        "This is madness 😠 😳",
        "There are many enlightened folks who was accused of these kind of things in past and even now. Problem is high level of consciousness doesn't mean that you become good in every metrics.\nOne more thing to note with higher consciousness you will know there is nothing wrong in anything, no meaning in anything. GOD is Rapist, Pedophole and Devil all In one and All is One.",
        "Thanks",
        "*All",
        "This is sarcasm, right? Right???",
        "In tantra, they do see human bodies and sex differently though.",
        "Matter of the fact is, is that pdf correct, you see, a lot of Christian/muslim groups are circulating a rotten and totally wrong printed bhagwad Gita, to mislead, if what you have read is something on the same lines, then my friend, you have been fooled and played.",
        "Bhai sab Muslim Nahi karte. Kafi Hindu bhi haraami Hain and logon Ka fayeda uthate Hain. Jaise ye NKB.",
        "Nope based on 15+ years of spiritual search. Then again don't mind me keep on doing you.",
        "Strongly denying the words uttered by you, as the internet contains only one website mentioning the same and that too is led by the Christian organization and this topic was first brought by Amanda Lucia, hence, there can be 2 sides to this thing. Either what you are saying is truth or second, missionaries/other parties with defiled objective are trying to put up a bad impression of hindu deities and god's, as they have tried to do for years and years, because, they know that they can only protect and expand their religion by painting others religion in a bad light."
    ],
    "cleaned_text": "neem karoli baba creep abused women nkb creep abused women several accounts published disciple ram dass positive light book miracle love stories neem karoli baba editions removes lot controversial stories need pdf share adding excerpts first time guru neem karoli baba took room alone sat tucket low wooden bed like seventeenyearold jock little fast felt fifteen innocent started making cute pure swept momentsthen grew alarmed wait guru one doesnt ones guru pulled away maharajji neem karoli baba tilted head sideways wrinkled eyebrows tender endearing quizzical look didnt say anything whole saying dont like soon walked particular darshan ritual act seeing seen divine started getting sick end day felt vomited shit everything ever inside carried ashram religious hermitage way stopped maharajjis neem karoli babas room could pranam prostrate kneeled tucket put head feetand kicked head saying get first time two years last month alone every day room sometimes would touch breasts legs saying mine mine mine mine mine interpret want near end darshans though child sometimes felt though suckling tiny baby men women guts call avatar hanuman ",
    "cleaned_title": "neem karoli baba creep abused women",
    "cleaned_selftext": "nkb creep abused women several accounts published disciple ram dass positive light book miracle love stories neem karoli baba editions removes lot controversial stories need pdf share adding excerpts first time guru neem karoli baba took room alone sat tucket low wooden bed like seventeenyearold jock little fast felt fifteen innocent started making cute pure swept momentsthen grew alarmed wait guru one doesnt ones guru pulled away maharajji neem karoli baba tilted head sideways wrinkled eyebrows tender endearing quizzical look didnt say anything whole saying dont like soon walked particular darshan ritual act seeing seen divine started getting sick end day felt vomited shit everything ever inside carried ashram religious hermitage way stopped maharajjis neem karoli babas room could pranam prostrate kneeled tucket put head feetand kicked head saying get first time two years last month alone every day room sometimes would touch breasts legs saying mine mine mine mine mine interpret want near end darshans though child sometimes felt though suckling tiny baby men women guts call avatar hanuman",
    "cleaned_comments": "dont believe everything read internet self proclaimed godmen creeps phir bhi mohommad vote se aage hai huge thing read really thought different still think fake babas bad track records dont know believe kaboom disciple ram dass wrote book want pdf let know know right bhagwan ko bhakti keliye ye baba ki jarurat nahi hai pdf nowadays anyone write anything people like feed hate love spreading believe without substantial evidence ive already read article years agomaking allegation anyone easiestproving true toughest please share pdf believe incarnation hanuman seems like become part bucket list babas even mahatma iykyk provide proof anyone ill intentions damage someones reputation spread falsehoods write anything people like seem enjoy spreading hate hurting others sentiments many followers would say opposite would believe country blinded religion else would u expect developing backwards doubt india significant footprint research development innovations innovations globally except madness many enlightened folks accused kind things past even problem high level consciousness doesnt mean become good every metrics one thing note higher consciousness know nothing wrong anything meaning anything god rapist pedophole devil one one thanks sarcasm right right tantra see human bodies sex differently though matter fact pdf correct see lot christianmuslim groups circulating rotten totally wrong printed bhagwad gita mislead read something lines friend fooled played bhai sab muslim nahi karte kafi hindu bhi haraami hain logon ka fayeda uthate hain jaise ye nkb nope based years spiritual search dont mind keep strongly denying words uttered internet contains one website mentioning led christian organization topic first brought amanda lucia hence sides thing either saying truth second missionariesother parties defiled objective trying put bad impression hindu deities gods tried years years know protect expand religion painting others religion bad light",
    "light_cleaned_title": "Neem Karoli Baba was a creep who abused women",
    "light_cleaned_selftext": "NKB was a creep who abused women!! Several accounts have been published by his own disciple, Ram Dass, in a positive light in his book, \"Miracle of Love: Stories about Neem Karoli Baba.\" Further editions removes a lot of controversial stories. If you need that pdf, I will share it with you. I am adding some excerpts - The first time he [Guru Neem Karoli Baba] took me in the room alone I sat up on the tucket [low wooden bed] with him, and he was like a seventeen-year-old jock who was a little fast! I felt as if I were fifteen and innocent. He started making out with me, and it was so cute, so pure. I was swept into it for a few moments—then grew alarmed: “Wait! This is my guru. One doesn’t do this with one’s guru!” So I pulled away from him. Then Maharajji [Neem Karoli Baba] tilted his head sideways and wrinkled up his eyebrows in a tender, endearing, quizzical look. He didn’t say anything, but his whole being was saying to me, “Don’t you like me?” But as soon as I walked out of that particular darshan [the ritual act of seeing and being seen by the divine], I started getting so sick that by the end of the day I felt I had vomited and shit out everything that was ever inside me. I had to be carried out of the ashram [religious hermitage]. On the way, we stopped by Maharajji’s [Neem Karoli Baba’s] room so I could pranam [prostrate] to him. I kneeled by the tucket and put my head down by his feet—and he kicked me in the head, saying, “Get her out of here!” . . . That was the first time, and I was to be there for two years. During my last month there, I was alone with him every day in the room . . . Sometimes he would just touch me on the breasts and between my legs, saying, “This is mine, this is mine, this is mine. All is mine. You are mine.” You can interpret it as you want, but near the end in these darshans, it was as though he were my child. Sometimes I felt as though I were suckling a tiny baby. HOW DO MEN AND WOMEN HAVE THE GUTS TO CALL HIM AN AVATAR OF HANUMAN????",
    "light_cleaned_comments": "Don’t believe everything you read on internet. Most of these self proclaimed godmen are creeps Phir bhi mohommad 6 vote se aage hai. This is a huge thing for me to read. I really thought he was different and i still think this is fake. All other Babas have bad track records I don't know what to believe. ka-boom :⁠0 His own Disciple Ram Dass wrote it in the book. If you want the pdf, let me know I know, right!! Bhagwan ko bhakti keliye ye baba ki jarurat nahi hai Here is the pdf Nowadays, anyone can write anything, and people like you who feed on hate love spreading it will believe it without any substantial evidence. I’ve already read this article few years ago.Making Allegation on anyone is easiest,proving it true is the toughest. Please share the pdf. Here - Do you believe he was an incarnation of Hanuman? seems like this has become part of bucket list for all babas and even mahatma (iykyk) 😣 Provide proof. Anyone with ill intentions to damage someone's reputation and spread falsehoods can write anything. People like you seem to enjoy spreading hate and hurting others' sentiments. Many of his followers would say the opposite would you believe that? Country blinded by religion, what else would u expect? We are developing backwards. No doubt India has no significant footprint in any research and development innovations or any other innovations globally except few very few. This is madness 😠 😳 There are many enlightened folks who was accused of these kind of things in past and even now. Problem is high level of consciousness doesn't mean that you become good in every metrics. One more thing to note with higher consciousness you will know there is nothing wrong in anything, no meaning in anything. GOD is Rapist, Pedophole and Devil all In one and All is One. Thanks *All This is sarcasm, right? Right??? In tantra, they do see human bodies and sex differently though. Matter of the fact is, is that pdf correct, you see, a lot of Christian/muslim groups are circulating a rotten and totally wrong printed bhagwad Gita, to mislead, if what you have read is something on the same lines, then my friend, you have been fooled and played. Bhai sab Muslim Nahi karte. Kafi Hindu bhi haraami Hain and logon Ka fayeda uthate Hain. Jaise ye NKB. Nope based on 15+ years of spiritual search. Then again don't mind me keep on doing you. Strongly denying the words uttered by you, as the internet contains only one website mentioning the same and that too is led by the Christian organization and this topic was first brought by Amanda Lucia, hence, there can be 2 sides to this thing. Either what you are saying is truth or second, missionaries/other parties with defiled objective are trying to put up a bad impression of hindu deities and god's, as they have tried to do for years and years, because, they know that they can only protect and expand their religion by painting others religion in a bad light."
}