{
    "id": "1adv41l",
    "title": "There is no such thing as a \"last option\".",
    "url": "https://www.reddit.com/r/india/comments/1adv41l/there_is_no_such_thing_as_a_last_option/",
    "selftext": "Recently there was a suicide case in Kota, Rajasthan, where a young girl only 18 years of age killed herself as she was unable to succumb to the pressure of studies and her parent's expectations that the poor thing deemed suicide as a last resort.\n\nlink\\~[https://timesofindia.indiatimes.com/city/jaipur/sorry-mummy-papa-jee-aspirant-ends-her-life-in-kota-leaves-suicide-note/articleshow/107229508.cms](https://timesofindia.indiatimes.com/city/jaipur/sorry-mummy-papa-jee-aspirant-ends-her-life-in-kota-leaves-suicide-note/articleshow/107229508.cms)\n\nHonestly speaking the amount of pressure that teenagers face and the struggles that they go through while preparing for any exam seriously indicates that something is wrong with our education system.\n\n And if anyone feels the same as her please just don't lose hope as she did. You do need to understand no matter the amount of pressure laid on you by your parents or relatives or anyone in general doesn't matter. That they would still choose you over your career and if you do feel so pressurized by such an examination leave it do something else.\n\nWho cares if you're not a bloody engineer or a doctor at least you're alive and well to enjoy and spend time with people you care about.\n\nPersonally speaking even if you do get into these courses you'll never be satisfied and it's always going to be a race to do one thing after the other.\n\nWhen i used to prepare for my NEET i deemed it to be the worst phase of my life the amount of pressure i felt from my parent's or teacher's was so bad that i used to cry myself to sleep every night and one bad test result would be devastating for me even to the extent that i would stop eating as eating would make me sleepy. I really do wish no one has to go through any of this.\n\nWhen i entered my medical college i thought that this is it and i don't have to worry anymore, but that isn't the case at all, now we're forced to prepare for post graduations because \" just an mbbs doesn't matter in today's world.\"  And you're stuck in a never ending cycle of competition.\n\nI am in no way trying discourage anyone to achieve their dreams but if you feel that because of your dream your life is at stake then that dream really isn't worth it.\n\n&#x200B;\n\nP.S.\\~ If you feel that being a doctor or an engineer or an IAS is the only way to achieve happiness in life then please don't pursue that because you will put your career before your own health be it mental or physical and will lose yourself and your own identity before you become anything.\n\nP.P.S\\~ If you also feel that you're drowning in your studies please contact someone you trust or you can even speak to me if you're comfortable.",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 6,
    "created_utc": 1706534306.0,
    "convurl": "https://external-preview.redd.it/CT-aLDcEditoZPVjI3Fm13_1zmtCpSUGk74myumUJJA.jpg?auto=webp&s=5250f0c49cbe8c0f7c6318b9b84ba81b29c9612a",
    "comments": [
        "I would've done the same thing when I was in Kota a decade back. The atmosphere there was quite shitty. Only memory I like to keep from there is no memory.",
        "It becomes the last option when you have such horrible relationship with parents. parents keep putting expectations on you, saying you are the one to pull the family out of poverty.\n\n\nIn cases like these some kids shine but most just crumble and if your parents aren't there to help you out to be whole again, sadly giving up is the only option. Who tf wants to go back home to parents who will keep reminding you about how much money they spent and how all you had to do was 'study'.\n\n\nLucky are those people who have supportive parents.",
        "“Who cares if you’re not a bloody engineer or a doctor”.. I personally think this statement is ignorant and invalidates the struggles that many of these students go through. The thing is, PEOPLE DO CARE, their parents, family members, neighbours and family friends.. there are people that have high expectations from the child. Which is exactly what happened in this case, she was ready to take her own life before she was ready to disappoint the people in her life. It’s easy for us to sit behind this screen and say, “it’s okay just develop a thick skin and pursue want you want to do”. I’m pretty sure even a kid knows that if they talk about what they want then they can go for what they want, the problem isn’t about speaking up, the problem lies within the fact that parents and society put an immeasurable burden upon them to the point that they succumb to the pressure. Your concern on the matter is much appreciated but I think your takeaway from this whole incident could’ve been better. Nevertheless, I’m glad that you’re bringing up this topic to encourage other students to speak up.",
        "You lost the point of conversation the moment you started talking about yourself. You clearly haven't reached a phase where logic completely fades away and dark emotions take over. The pain becomes too much and you start looking for easy relief. \n\nIf you ever find someone like that don't tell them it's okay or how you have been in the same situation. Just be there and listen. At no point of conversation talk about yourself or your life.",
        "It's disheartening to know that some parents out there force their ambitions on child so much that the child considers death as alternative of failing to complete their parents dream. Few people say that they should consider their parents situation as well before taking such a huge step kitna shock lagega unhe blah blah but I've listened about parents who themselves wish death on their kids when they fail such exams like itna bhi clear nahi kar paaya/kar paayi isse acha mar jao",
        "In an economy that only gives jobs to certain fields, where tier 3 coleges do not have functioning labs, its a system set up for people to fail.",
        "> THIS IS WHAT HAPPENS WHEN POOR HAVE KIDS. \n\nWhat even is tis take? I mean there are a lot bridges and analogies you missed there"
    ],
    "cleaned_text": "thing last option recently suicide case kota rajasthan young girl years age killed unable succumb pressure studies parents expectations poor thing deemed suicide last resort linkhttpstimesofindiaindiatimescomcityjaipursorrymummypapajeeaspirantendsherlifeinkotaleavessuicidenotearticleshowcmshttpstimesofindiaindiatimescomcityjaipursorrymummypapajeeaspirantendsherlifeinkotaleavessuicidenotearticleshowcms honestly speaking amount pressure teenagers face struggles go preparing exam seriously indicates something wrong education system anyone feels please dont lose hope need understand matter amount pressure laid parents relatives anyone general doesnt matter would still choose career feel pressurized examination leave something else cares youre bloody engineer doctor least youre alive well enjoy spend time people care personally speaking even get courses youll never satisfied always going race one thing used prepare neet deemed worst phase life amount pressure felt parents teachers bad used cry sleep every night one bad test result would devastating even extent would stop eating eating would make sleepy really wish one go entered medical college thought dont worry anymore isnt case forced prepare post graduations mbbs doesnt matter todays world youre stuck never ending cycle competition way trying discourage anyone achieve dreams feel dream life stake dream really isnt worth xb ps feel doctor engineer ias way achieve happiness life please dont pursue put career health mental physical lose identity become anything pps also feel youre drowning studies please contact someone trust even speak youre comfortable ",
    "cleaned_title": "thing last option",
    "cleaned_selftext": "recently suicide case kota rajasthan young girl years age killed unable succumb pressure studies parents expectations poor thing deemed suicide last resort linkhttpstimesofindiaindiatimescomcityjaipursorrymummypapajeeaspirantendsherlifeinkotaleavessuicidenotearticleshowcmshttpstimesofindiaindiatimescomcityjaipursorrymummypapajeeaspirantendsherlifeinkotaleavessuicidenotearticleshowcms honestly speaking amount pressure teenagers face struggles go preparing exam seriously indicates something wrong education system anyone feels please dont lose hope need understand matter amount pressure laid parents relatives anyone general doesnt matter would still choose career feel pressurized examination leave something else cares youre bloody engineer doctor least youre alive well enjoy spend time people care personally speaking even get courses youll never satisfied always going race one thing used prepare neet deemed worst phase life amount pressure felt parents teachers bad used cry sleep every night one bad test result would devastating even extent would stop eating eating would make sleepy really wish one go entered medical college thought dont worry anymore isnt case forced prepare post graduations mbbs doesnt matter todays world youre stuck never ending cycle competition way trying discourage anyone achieve dreams feel dream life stake dream really isnt worth xb ps feel doctor engineer ias way achieve happiness life please dont pursue put career health mental physical lose identity become anything pps also feel youre drowning studies please contact someone trust even speak youre comfortable",
    "cleaned_comments": "wouldve done thing kota decade back atmosphere quite shitty memory like keep memory becomes last option horrible relationship parents parents keep putting expectations saying one pull family poverty cases like kids shine crumble parents arent help whole sadly giving option tf wants go back home parents keep reminding much money spent study lucky people supportive parents cares youre bloody engineer doctor personally think statement ignorant invalidates struggles many students go thing people care parents family members neighbours family friends people high expectations child exactly happened case ready take life ready disappoint people life easy us sit behind screen say okay develop thick skin pursue want want im pretty sure even kid knows talk want go want problem isnt speaking problem lies within fact parents society put immeasurable burden upon point succumb pressure concern matter much appreciated think takeaway whole incident couldve better nevertheless im glad youre bringing topic encourage students speak lost point conversation moment started talking clearly havent reached phase logic completely fades away dark emotions take pain becomes much start looking easy relief ever find someone like dont tell okay situation listen point conversation talk life disheartening know parents force ambitions child much child considers death alternative failing complete parents dream people say consider parents situation well taking huge step kitna shock lagega unhe blah blah ive listened parents wish death kids fail exams like itna bhi clear nahi kar paayakar paayi isse acha mar jao economy gives jobs certain fields tier coleges functioning labs system set people fail happens poor kids even tis take mean lot bridges analogies missed",
    "light_cleaned_title": "There is no such thing as a \"last option\".",
    "light_cleaned_selftext": "Recently there was a suicide case in Kota, Rajasthan, where a young girl only 18 years of age killed herself as she was unable to succumb to the pressure of studies and her parent's expectations that the poor thing deemed suicide as a last resort. link\\~[https://timesofindia.indiatimes.com/city/jaipur/sorry-mummy-papa-jee-aspirant-ends-her-life-in-kota-leaves-suicide-note/articleshow/107229508.cms](https://timesofindia.indiatimes.com/city/jaipur/sorry-mummy-papa-jee-aspirant-ends-her-life-in-kota-leaves-suicide-note/articleshow/107229508.cms) Honestly speaking the amount of pressure that teenagers face and the struggles that they go through while preparing for any exam seriously indicates that something is wrong with our education system. And if anyone feels the same as her please just don't lose hope as she did. You do need to understand no matter the amount of pressure laid on you by your parents or relatives or anyone in general doesn't matter. That they would still choose you over your career and if you do feel so pressurized by such an examination leave it do something else. Who cares if you're not a bloody engineer or a doctor at least you're alive and well to enjoy and spend time with people you care about. Personally speaking even if you do get into these courses you'll never be satisfied and it's always going to be a race to do one thing after the other. When i used to prepare for my NEET i deemed it to be the worst phase of my life the amount of pressure i felt from my parent's or teacher's was so bad that i used to cry myself to sleep every night and one bad test result would be devastating for me even to the extent that i would stop eating as eating would make me sleepy. I really do wish no one has to go through any of this. When i entered my medical college i thought that this is it and i don't have to worry anymore, but that isn't the case at all, now we're forced to prepare for post graduations because \" just an mbbs doesn't matter in today's world.\" And you're stuck in a never ending cycle of competition. I am in no way trying discourage anyone to achieve their dreams but if you feel that because of your dream your life is at stake then that dream really isn't worth it. &#x200B; P.S.\\~ If you feel that being a doctor or an engineer or an IAS is the only way to achieve happiness in life then please don't pursue that because you will put your career before your own health be it mental or physical and will lose yourself and your own identity before you become anything. P.P.S\\~ If you also feel that you're drowning in your studies please contact someone you trust or you can even speak to me if you're comfortable.",
    "light_cleaned_comments": "I would've done the same thing when I was in Kota a decade back. The atmosphere there was quite shitty. Only memory I like to keep from there is no memory. It becomes the last option when you have such horrible relationship with parents. parents keep putting expectations on you, saying you are the one to pull the family out of poverty. In cases like these some kids shine but most just crumble and if your parents aren't there to help you out to be whole again, sadly giving up is the only option. Who tf wants to go back home to parents who will keep reminding you about how much money they spent and how all you had to do was 'study'. Lucky are those people who have supportive parents. “Who cares if you’re not a bloody engineer or a doctor”.. I personally think this statement is ignorant and invalidates the struggles that many of these students go through. The thing is, PEOPLE DO CARE, their parents, family members, neighbours and family friends.. there are people that have high expectations from the child. Which is exactly what happened in this case, she was ready to take her own life before she was ready to disappoint the people in her life. It’s easy for us to sit behind this screen and say, “it’s okay just develop a thick skin and pursue want you want to do”. I’m pretty sure even a kid knows that if they talk about what they want then they can go for what they want, the problem isn’t about speaking up, the problem lies within the fact that parents and society put an immeasurable burden upon them to the point that they succumb to the pressure. Your concern on the matter is much appreciated but I think your takeaway from this whole incident could’ve been better. Nevertheless, I’m glad that you’re bringing up this topic to encourage other students to speak up. You lost the point of conversation the moment you started talking about yourself. You clearly haven't reached a phase where logic completely fades away and dark emotions take over. The pain becomes too much and you start looking for easy relief. If you ever find someone like that don't tell them it's okay or how you have been in the same situation. Just be there and listen. At no point of conversation talk about yourself or your life. It's disheartening to know that some parents out there force their ambitions on child so much that the child considers death as alternative of failing to complete their parents dream. Few people say that they should consider their parents situation as well before taking such a huge step kitna shock lagega unhe blah blah but I've listened about parents who themselves wish death on their kids when they fail such exams like itna bhi clear nahi kar paaya/kar paayi isse acha mar jao In an economy that only gives jobs to certain fields, where tier 3 coleges do not have functioning labs, its a system set up for people to fail. > THIS IS WHAT HAPPENS WHEN POOR HAVE KIDS. What even is tis take? I mean there are a lot bridges and analogies you missed there"
}