{
    "id": "1bgwr40",
    "title": "Justice?",
    "url": "https://www.reddit.com/gallery/1bgwr40",
    "selftext": "This woman had 49 witnesses, dna evidence(hair of accused left on her body),even the torture weapons were found in their car. And they still got acquitted,they are free now\nShe was tortured in the worst ways possible and there was plenty of evidence, they got convicted severatimes in lower courts, high court upheld death penalty\nBut supreme court has completely acquitted them\nHer body was mutilated, decaying, abandoned. There was more proof than most  victims have.\n\n\nhttps://en.m.wikipedia.org/wiki/Murder_of_Kiran_Negi\n\n\nNot just that court rejected the review petition by delhi police\n https://www.hindustantimes.com/cities/delhi-news/chhawla-case-sc-upholds-acquittal-rejects-review-plea-101680024767431.html\n\nThe culprit was arrested in another case within 3 months \n\n\nhttps://www.thehindu.com/news/cities/Delhi/3-months-after-acquittal-in-chhawla-case-man-arrested-for-murder/article66454881.ece\n\nUnrealistic and insane expectations to prove the same crime over and over again ... How do they expect them to present evidence in pristine condition 12 years after the crime has been committed? It was in good condition back when the district and high court convicted them.\n\n\nhttps://bnblegal.com/news/9-reasons-why-supreme-court-acquitted-3-convicts-in-brutal-2012-chhawla-gangrape-and-murder-case/\n\n\nhttps://youtu.be/gP3_o6GWxZc",
    "flair": "Law & Courts",
    "score": 24,
    "num_comments": 5,
    "created_utc": 1710679767.0,
    "convurl": "https://i.redd.it/v2ejlsk75woc1.jpg",
    "comments": [
        "> As per the top court, no witnesses identified the accused during their depositions\n\nIdk what the truth is , but this seems like a very glaring lapse by the cops. Idk why everyone is blaming the SC  when it's the police and forensics dept at fault , you can't convict someone based on feelings , not at a High court or supreme court level",
        "Sometimes I get surprised how far humanity can go? At this point I'm out of words what to call this devilish act.",
        "India needs \"Death Penalty\" for Rapist. Telecast the Death penalties on Live TV. Installing Fear among people for the consequences can only prevent Rapes nothing else won't work. They are Animals and Animals only understands the language of \"Torture\"",
        "Seeing those countries who are in really terrible conditions I use to wonder why they do not take help of government institutions or action according to laws but seeing the State of my own country it seems you start accepting your condition cos there is no one who will hear your voice.",
        "But brother we can't adopt these kind of methods that are being practised in Arab nations. As it would have a lot to think about as well. Also the fact is that many times the rapist is usually connected to a political party or he is himself a leader these people won't get convicted",
        "My body during reading the crime was just shivering...I mean how someone can be so cruel like this ...",
        "I am a Sister. So punishing a Rapist will make us look Bad. What a shitty response"
    ],
    "cleaned_text": "justice woman witnesses dna evidencehair accused left bodyeven torture weapons found car still got acquittedthey free tortured worst ways possible plenty evidence got convicted severatimes lower courts high court upheld death penalty supreme court completely acquitted body mutilated decaying abandoned proof victims court rejected review petition delhi police culprit arrested another case within months unrealistic insane expectations prove crime expect present evidence pristine condition years crime committed good condition back district high court convicted ",
    "cleaned_title": "justice",
    "cleaned_selftext": "woman witnesses dna evidencehair accused left bodyeven torture weapons found car still got acquittedthey free tortured worst ways possible plenty evidence got convicted severatimes lower courts high court upheld death penalty supreme court completely acquitted body mutilated decaying abandoned proof victims court rejected review petition delhi police culprit arrested another case within months unrealistic insane expectations prove crime expect present evidence pristine condition years crime committed good condition back district high court convicted",
    "cleaned_comments": "per top court witnesses identified accused depositions idk truth seems like glaring lapse cops idk everyone blaming sc police forensics dept fault cant convict someone based feelings high court supreme court level sometimes get surprised far humanity go point im words call devilish act india needs death penalty rapist telecast death penalties live tv installing fear among people consequences prevent rapes nothing else wont work animals animals understands language torture seeing countries really terrible conditions use wonder take help government institutions action according laws seeing state country seems start accepting condition cos one hear voice brother cant adopt kind methods practised arab nations would lot think well also fact many times rapist usually connected political party leader people wont get convicted body reading crime shiveringi mean someone cruel like sister punishing rapist make us look bad shitty response",
    "light_cleaned_title": "Justice?",
    "light_cleaned_selftext": "This woman had 49 witnesses, dna evidence(hair of accused left on her body),even the torture weapons were found in their car. And they still got acquitted,they are free now She was tortured in the worst ways possible and there was plenty of evidence, they got convicted severatimes in lower courts, high court upheld death penalty But supreme court has completely acquitted them Her body was mutilated, decaying, abandoned. There was more proof than most victims have. Not just that court rejected the review petition by delhi police The culprit was arrested in another case within 3 months Unrealistic and insane expectations to prove the same crime over and over again ... How do they expect them to present evidence in pristine condition 12 years after the crime has been committed? It was in good condition back when the district and high court convicted them.",
    "light_cleaned_comments": "> As per the top court, no witnesses identified the accused during their depositions Idk what the truth is , but this seems like a very glaring lapse by the cops. Idk why everyone is blaming the SC when it's the police and forensics dept at fault , you can't convict someone based on feelings , not at a High court or supreme court level Sometimes I get surprised how far humanity can go? At this point I'm out of words what to call this devilish act. India needs \"Death Penalty\" for Rapist. Telecast the Death penalties on Live TV. Installing Fear among people for the consequences can only prevent Rapes nothing else won't work. They are Animals and Animals only understands the language of \"Torture\" Seeing those countries who are in really terrible conditions I use to wonder why they do not take help of government institutions or action according to laws but seeing the State of my own country it seems you start accepting your condition cos there is no one who will hear your voice. But brother we can't adopt these kind of methods that are being practised in Arab nations. As it would have a lot to think about as well. Also the fact is that many times the rapist is usually connected to a political party or he is himself a leader these people won't get convicted My body during reading the crime was just shivering...I mean how someone can be so cruel like this ... I am a Sister. So punishing a Rapist will make us look Bad. What a shitty response"
}