{
    "id": "mkp0j6",
    "title": "Difference between Xi and Modi",
    "url": "https://www.reddit.com/r/india/comments/mkp0j6/difference_between_xi_and_modi/",
    "selftext": "In the year 2015 - Xi Jinping proposed to reduce and deal with Garbage and Waste generated by the Chinese\n\n* He invested over $ 60 Billion in Landfills, Incinerators, Compactors etc\n\n&amp;#x200B;\n\nhttps://preview.redd.it/osd6gbogvdr61.png?width=560&amp;format=png&amp;auto=webp&amp;s=97d8319e9a81782a12b551eef0d3f9dbbd9ca7d3\n\n* He invested over $ 40 Billion in Collection Trucks and Waste Compaction Plants capable of compacting 100 Cubic Meters of Waste into a single cube of 0.5 m sides.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2d4iamohvdr61.png?width=347&amp;format=png&amp;auto=webp&amp;s=876a9e3acdbfa5656c89b0a81c6bf3e6ea0ba432\n\n* He passed over 15 laws with fines of as high as **15 Million Yuan** for polluting rivers with effluents from Factories\n* He built many Waste Water Treatment Plants to treat Effluent from both Industries and from Homes and reduce something called BOD and COD and re-use over 40% of the same\n\n&amp;#x200B;\n\nhttps://preview.redd.it/f6qz0soivdr61.png?width=500&amp;format=png&amp;auto=webp&amp;s=fdd2dfc3d7a3ebf51d0b6855bf81ee487b56dd47\n\n* In 2020 - when he reviewed the plan he found that China had succeeded in reducing the Garbage per Capita by 26% over 5 years. Now he has decided to invest another $ 210 Billion and reduce this by 50% by 2025\n\n&amp;#x200B;\n\nhttps://preview.redd.it/15wgnpqjvdr61.png?width=602&amp;format=png&amp;auto=webp&amp;s=a4b64726e71fe087e70e565da3e166709db713bc\n\n**Modiji** used software to make 50–100 posters of kids with broomsticks and set up what appeared to be a Social Worker Campaign to clean and put waste in a Dustbin.\n\n**Effluents** still cause terrible problems and Industries still dump over 90% of Effluents without treatment into the Sea\n\n**Ground water Contamination** is extremely high\n\n**Garbage Pickup** has not had a National Campaign. Modiji has invested exactly Rs. 3000 Crore and the entire money has been invested in **Uttar Pradesh and in Varanasi,** his own constituency has got the lions share. Amethi received a big chunk in 2017 and 2018.\n\nNo Landfills, Compactors, Waste Water Treatment Plants, Sewage Effluent Treatment - **Nothing Zilch**\n\nIn fact, MMS Govt invested **Rs. 16000 Crore** in Rainwater Harvesting\n\n**Yet** his supporters hail him for this supposed “Cleanliness Campaign” and say Modi did the **Swacch Bharat Abhiyaan**\n\n**SERIOUSLY???**\n\nSo This is the difference between Xis Style and Modis style\n\nSo if the same trend is to be believed\n\nWhile Xi Jinping offered NLF benefits, grant subsidies, economic infusions, free skills training programs etc for 15 years now to fight poverty\n\nModiji may make speeches, launch a **Pradhan Mantri Garibi Mukti Yojna** and claim a year later “We ensured we removed 100 Million people from Poverty”\n\nHow?\n\nBy Printing Slogans and Preaching to people to save money",
    "flair": "Policy/Economy",
    "score": 13,
    "num_comments": 4,
    "created_utc": 1617641044,
    "convurl": "https://b.thumbs.redditmedia.com/FrljiKL1SURogczyvSA5_NMigR6QqmX-0J2ZjewqJ_U.jpg",
    "comments": [
        "What do you want us to do?",
        "Modi hai toh Mumkin hai. Any data can be developed"
    ],
    "cleaned_text": "difference xi modi year xi jinping proposed reduce deal garbage waste generated chinese invested billion landfills incinerators compactors etc ampxb invested billion collection trucks waste compaction plants capable compacting cubic meters waste single cube sides ampxb passed laws fines high million yuan polluting rivers effluents factories built many waste water treatment plants treat effluent industries homes reduce something called bod cod reuse ampxb reviewed plan found china succeeded reducing garbage per capita years decided invest another billion reduce ampxb modiji used software make posters kids broomsticks set appeared social worker campaign clean put waste dustbin effluents still cause terrible problems industries still dump effluents without treatment sea ground water contamination extremely high garbage pickup national campaign modiji invested exactly rs crore entire money invested uttar pradesh varanasi constituency got lions share amethi received big chunk landfills compactors waste water treatment plants sewage effluent treatment nothing zilch fact mms govt invested rs crore rainwater harvesting yet supporters hail supposed cleanliness campaign say modi swacch bharat abhiyaan seriously difference xis style modis style trend believed xi jinping offered nlf benefits grant subsidies economic infusions free skills training programs etc years fight poverty modiji may make speeches launch pradhan mantri garibi mukti yojna claim year later ensured removed million people poverty printing slogans preaching people save money ",
    "cleaned_title": "difference xi modi",
    "cleaned_selftext": "year xi jinping proposed reduce deal garbage waste generated chinese invested billion landfills incinerators compactors etc ampxb invested billion collection trucks waste compaction plants capable compacting cubic meters waste single cube sides ampxb passed laws fines high million yuan polluting rivers effluents factories built many waste water treatment plants treat effluent industries homes reduce something called bod cod reuse ampxb reviewed plan found china succeeded reducing garbage per capita years decided invest another billion reduce ampxb modiji used software make posters kids broomsticks set appeared social worker campaign clean put waste dustbin effluents still cause terrible problems industries still dump effluents without treatment sea ground water contamination extremely high garbage pickup national campaign modiji invested exactly rs crore entire money invested uttar pradesh varanasi constituency got lions share amethi received big chunk landfills compactors waste water treatment plants sewage effluent treatment nothing zilch fact mms govt invested rs crore rainwater harvesting yet supporters hail supposed cleanliness campaign say modi swacch bharat abhiyaan seriously difference xis style modis style trend believed xi jinping offered nlf benefits grant subsidies economic infusions free skills training programs etc years fight poverty modiji may make speeches launch pradhan mantri garibi mukti yojna claim year later ensured removed million people poverty printing slogans preaching people save money",
    "cleaned_comments": "want us modi hai toh mumkin hai data developed",
    "light_cleaned_title": "Difference between Xi and Modi",
    "light_cleaned_selftext": "In the year 2015 - Xi Jinping proposed to reduce and deal with Garbage and Waste generated by the Chinese * He invested over $ 60 Billion in Landfills, Incinerators, Compactors etc  * He invested over $ 40 Billion in Collection Trucks and Waste Compaction Plants capable of compacting 100 Cubic Meters of Waste into a single cube of 0.5 m sides.  * He passed over 15 laws with fines of as high as **15 Million Yuan** for polluting rivers with effluents from Factories * He built many Waste Water Treatment Plants to treat Effluent from both Industries and from Homes and reduce something called BOD and COD and re-use over 40% of the same  * In 2020 - when he reviewed the plan he found that China had succeeded in reducing the Garbage per Capita by 26% over 5 years. Now he has decided to invest another $ 210 Billion and reduce this by 50% by 2025  **Modiji** used software to make 50–100 posters of kids with broomsticks and set up what appeared to be a Social Worker Campaign to clean and put waste in a Dustbin. **Effluents** still cause terrible problems and Industries still dump over 90% of Effluents without treatment into the Sea **Ground water Contamination** is extremely high **Garbage Pickup** has not had a National Campaign. Modiji has invested exactly Rs. 3000 Crore and the entire money has been invested in **Uttar Pradesh and in Varanasi,** his own constituency has got the lions share. Amethi received a big chunk in 2017 and 2018. No Landfills, Compactors, Waste Water Treatment Plants, Sewage Effluent Treatment - **Nothing Zilch** In fact, MMS Govt invested **Rs. 16000 Crore** in Rainwater Harvesting **Yet** his supporters hail him for this supposed “Cleanliness Campaign” and say Modi did the **Swacch Bharat Abhiyaan** **SERIOUSLY???** So This is the difference between Xis Style and Modis style So if the same trend is to be believed While Xi Jinping offered NLF benefits, grant subsidies, economic infusions, free skills training programs etc for 15 years now to fight poverty Modiji may make speeches, launch a **Pradhan Mantri Garibi Mukti Yojna** and claim a year later “We ensured we removed 100 Million people from Poverty” How? By Printing Slogans and Preaching to people to save money",
    "light_cleaned_comments": "What do you want us to do? Modi hai toh Mumkin hai. Any data can be developed"
}