{
    "id": "1cjsa5k",
    "title": "I got sexually assaulted as a 16 year old yesterday and I need your help.   ",
    "url": "https://www.reddit.com/r/india/comments/1cjsa5k/i_got_sexually_assaulted_as_a_16_year_old/",
    "selftext": "So I'm at Rajiv chowk metro right now and I just boarded the train and felt someone's bag on my ass, atleast that's what I thought but it turned out IT WAS A MANS FINGER and he was rubbing it against my ass but i still thought it would be a mistake since it was hella crowded BUT THEN WHEN I TRIED TO TOUCH HIS HAND WITH MINE HE TOUCHED MY HAND AND STARTED rubbbing it ALSO. I'm literally so weirded out rn I'm just 16 and travelling alone in metro WHAT the fuck just happened (this is the story i posted originally when i was getting seuxally assualted, the full story is on Twitter) \n\nIf anyone could tag delhi police and mention details then message me. I will tell you everything in detail. I am at home right now and I asked the metro guards for help and they kindly escorted me to my train. I don't have a Twitter account and no instagram followers to reach delhi police so any help would be appreciated.\n\nIt happened between 8:30-8:40pm in coach 7 on Rajiv chowk station 3 may. I was wearing a purple set of tshirt and shorts with chain in my neck and white shoes. The assaulter is wearing the same clothing as in the picture\n\n I made a Twitter post finally. I shared my whole story there and tagged delhi police. https://twitter.com/Bhavya78059793 /status/1786449158632812966?t= DIc40AMV59Aeykx6bZTSOg&s=19\n",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1714798156.0,
    "convurl": "https://external-preview.redd.it/Na-CGSJBYiDAwlwGsRnQHr9UNI7laiVO05YRLCI3gOg.jpg?auto=webp&s=0d4660b8c31e169e84c3b2f273f57f61f1f5c677",
    "comments": [],
    "cleaned_text": "got sexually assaulted year old yesterday need help im rajiv chowk metro right boarded train felt someones bag ass atleast thats thought turned mans finger rubbing ass still thought would mistake since hella crowded tried touch hand mine touched hand started rubbbing also im literally weirded rn im travelling alone metro fuck happened story posted originally getting seuxally assualted full story twitter anyone could tag delhi police mention details message tell everything detail home right asked metro guards help kindly escorted train dont twitter account instagram followers reach delhi police help would appreciated happened pm coach rajiv chowk station may wearing purple set tshirt shorts chain neck white shoes assaulter wearing clothing picture made twitter post finally shared whole story tagged delhi police statust dicamvaeykxbztsogs ",
    "cleaned_title": "got sexually assaulted year old yesterday need help",
    "cleaned_selftext": "im rajiv chowk metro right boarded train felt someones bag ass atleast thats thought turned mans finger rubbing ass still thought would mistake since hella crowded tried touch hand mine touched hand started rubbbing also im literally weirded rn im travelling alone metro fuck happened story posted originally getting seuxally assualted full story twitter anyone could tag delhi police mention details message tell everything detail home right asked metro guards help kindly escorted train dont twitter account instagram followers reach delhi police help would appreciated happened pm coach rajiv chowk station may wearing purple set tshirt shorts chain neck white shoes assaulter wearing clothing picture made twitter post finally shared whole story tagged delhi police statust dicamvaeykxbztsogs",
    "cleaned_comments": "",
    "light_cleaned_title": "I got sexually assaulted as a 16 year old yesterday and I need your help.",
    "light_cleaned_selftext": "So I'm at Rajiv chowk metro right now and I just boarded the train and felt someone's bag on my ass, atleast that's what I thought but it turned out IT WAS A MANS FINGER and he was rubbing it against my ass but i still thought it would be a mistake since it was hella crowded BUT THEN WHEN I TRIED TO TOUCH HIS HAND WITH MINE HE TOUCHED MY HAND AND STARTED rubbbing it ALSO. I'm literally so weirded out rn I'm just 16 and travelling alone in metro WHAT the fuck just happened (this is the story i posted originally when i was getting seuxally assualted, the full story is on Twitter) If anyone could tag delhi police and mention details then message me. I will tell you everything in detail. I am at home right now and I asked the metro guards for help and they kindly escorted me to my train. I don't have a Twitter account and no instagram followers to reach delhi police so any help would be appreciated. It happened between 8:30-8:40pm in coach 7 on Rajiv chowk station 3 may. I was wearing a purple set of tshirt and shorts with chain in my neck and white shoes. The assaulter is wearing the same clothing as in the picture I made a Twitter post finally. I shared my whole story there and tagged delhi police. /status/1786449158632812966?t= DIc40AMV59Aeykx6bZTSOg&s=19",
    "light_cleaned_comments": ""
}