{
    "id": "1bzcupx",
    "title": "Kanwar Yatra: Night marches with loud music disrupts life in East Delhi, Noida",
    "url": "https://www.hindustantimes.com/cities/delhi-news/kanwar-yatra-night-marches-with-loud-music-disrupts-life-in-east-delhi-noida-101689361894175.html",
    "selftext": "It's 4 am and 2 trucks blasting only sub bass passed by at 2kmph past our buildings. I called the cops and it's been 45mins and the trucks are still blasting it, I'm sure the cops have no issues in locating the trucks. \n\nThis is not the india I want. These jobless Aholes need to be suspended upside down at a police station. Atleast 15000 people are guaranteed being affected by this shit, right now as I write this. ",
    "flair": "Crime",
    "score": 163,
    "num_comments": 41,
    "created_utc": 1712618471.0,
    "convurl": "https://external-preview.redd.it/tPL6HRF9CPgK6QhrC0daWhgzjBBbc-U8XQD4M6fuCtY.jpg?auto=webp&s=25df2e029351cf957014ea6199133937670d3433",
    "comments": [
        "I don't get it how those people enjoy that bass. Was stuck in such a march and the cars window were shaking pretty loudly however the sound systems were about 100 meter away. And those guys were just dancing standing infront of the speakers",
        "They are enjoying the fact that they matter enough to inflict pain and inconvenience to others. It’s a paradigm of a society where the idiom of power is dominance over others through overt signalling.",
        "Yaar but 4am, like wtf. \n\nI have an insane day ahead and can't go back to sleep. And I can see lights on in a number of other houses. Like use headphones. And it's really damaging to the ear, I'm a musician I always have ear protection to dampen the sound, not cut it off 100%. \n\nAll male party in a truck drunk and dancing. Probably gonna sleep off the whole day cuz they got no jobs.",
        "Yes. You have my sympathy. And yes.",
        "I sympathize and weep for the few truly educated in the North. They have no escape from this insanity.",
        "Hindu jaag raha hai (Hindus are awakening). It will be like this going forward. No one can dare stop them. Police will shower rose petals on them.",
        "How can you complain ? How can you raise a concern ? \n\nYou were sleeping when wrong deeds were happening with others, so what has  changed ?\n\nGo to sleep and bolo Modi Modi",
        "That's the point, I can't go back to sleep anymore, in more ways than one. \n\nI've been wondering how many police complaints they received.",
        "They don't enjoy the bass, they enjoy the power, power they have in numbers, power they have momentarily hiding behind their religion, it feels good to them to have this power in their otherwise insignificant life.",
        "It is useless, do not even think about it my friend. \n\nBut good quality noise cancelling headphones",
        "Dude that sub bass was rattling windows 70 mts from the road, I'm on the 7th floor. 20 mins on 4 to 5 different instances.\n\nI've called in sick, working from home inshallah.",
        "Hindu ko bolo so jaye or sone de. Alarm se pehle uth ke kuch nahi ukhaad lenge ye.",
        "its is our kulcha,",
        "I thought they walked for religious reasons. Why do they need the loud and bright party trucks. Ban those. Let the pious walk without needless distraction",
        "I want to hear how much trouble people are having from azaan but this is fine",
        "Kanwariya and gundagardi has been synonymous with each other for ages. I remember being intimidated by them as a kid. They were out of control and entitled even pre modi.",
        "Well they don't blast it infront of your home with loud speaker in high bass",
        "Oh yeah, let's have a loudspeaker competition, fuck society and their eardrums.\n\nI can't tell if sanghis hate Islam or imitate them.",
        "oh yeah,365 days torture with that cheap opera voice and that too multiples times a day, and rip for those places having 4 to 5 of them,sure bro sure",
        "When they’re passing through Uttarakhand these music things continue v late at night, so disruptive and cant raise a voice coz they are hooligans",
        "Unless you live right next to the mosque u can't hear it that loud",
        "yeah lmfao",
        "They are the other side of the coin. Gandoo gandoo Bhai Bhai",
        "I called the cops and complained. Nothing happened, dev bhoomi might be worse. \n\nRam rajya needs sound system bhajans, cuz small dik syndrome.",
        "I also don't want to be woken up by 5am Azaan which happens 5 time a day. Ban the loudspeakers.",
        "Nah azaan isn't fine as well, loudspeakers need to be banned in general.",
        "This is an irrelevant bait post from a hateful OP. The article is from Jul 15 2023, there is no Kanwar yatra at the moment because this is not when it happens. If he has a problem with trucks honking, why link a Kanwar Yatra article with this?",
        "I've posted the article and written my own explanation and posted a video of the same shite, but thick skinned Dil do's won't have the brain cells to understand. \n\nNEXT 9 DAYS THESE TRUCKS WILL PASS EVERY DAY OUTSIDE MY HOUSE.",
        "Shut up troll! This is not the time for kanwar yatra. If you want to hate on Hindus, which is what you seem to do all day, at least learn when our customs happen. Or better still, find a life.",
        "How is this hating on Hindus ? My estimate is that you wouldn’t be doing something like this that disturbs other people",
        "Paraud Indian",
        "\"Few\" truly educated, What do you mean?",
        "Ganja & Daru...",
        "i think tujhe azaan se bhi problem hoti hogi , hoti hai na?",
        "if this comment get's downvoted yk this is a heavily polarised sub",
        "if this comment get's downvoted yk this is a heavily polarised sub",
        "1000% yes, but what's the point of bringing it up when I'm complaining about a completely different issue. \n\nFocus on what the op's post is about, if there was an azaan issue I would have posted about that."
    ],
    "cleaned_text": "kanwar yatra night marches loud music disrupts life east delhi noida trucks blasting sub bass passed kmph past buildings called cops mins trucks still blasting im sure cops issues locating trucks india want jobless aholes need suspended upside police station atleast people guaranteed affected shit right write ",
    "cleaned_title": "kanwar yatra night marches loud music disrupts life east delhi noida",
    "cleaned_selftext": "trucks blasting sub bass passed kmph past buildings called cops mins trucks still blasting im sure cops issues locating trucks india want jobless aholes need suspended upside police station atleast people guaranteed affected shit right write",
    "cleaned_comments": "dont get people enjoy bass stuck march cars window shaking pretty loudly however sound systems meter away guys dancing standing infront speakers enjoying fact matter enough inflict pain inconvenience others paradigm society idiom power dominance others overt signalling yaar like wtf insane day ahead cant go back sleep see lights number houses like use headphones really damaging ear im musician always ear protection dampen sound cut male party truck drunk dancing probably gon na sleep whole day cuz got jobs yes sympathy yes sympathize weep truly educated north escape insanity hindu jaag raha hai hindus awakening like going forward one dare stop police shower rose petals complain raise concern sleeping wrong deeds happening others changed go sleep bolo modi modi thats point cant go back sleep anymore ways one ive wondering many police complaints received dont enjoy bass enjoy power power numbers power momentarily hiding behind religion feels good power otherwise insignificant life useless even think friend good quality noise cancelling headphones dude sub bass rattling windows mts road im th floor mins different instances ive called sick working home inshallah hindu ko bolo jaye sone de alarm se pehle uth ke kuch nahi ukhaad lenge ye kulcha thought walked religious reasons need loud bright party trucks ban let pious walk without needless distraction want hear much trouble people azaan fine kanwariya gundagardi synonymous ages remember intimidated kid control entitled even pre modi well dont blast infront home loud speaker high bass oh yeah lets loudspeaker competition fuck society eardrums cant tell sanghis hate islam imitate oh yeah days torture cheap opera voice multiples times day rip places themsure bro sure theyre passing uttarakhand music things continue v late night disruptive cant raise voice coz hooligans unless live right next mosque u cant hear loud yeah lmfao side coin gandoo gandoo bhai bhai called cops complained nothing happened dev bhoomi might worse ram rajya needs sound system bhajans cuz small dik syndrome also dont want woken azaan happens time day ban loudspeakers nah azaan isnt fine well loudspeakers need banned general irrelevant bait post hateful op article jul kanwar yatra moment happens problem trucks honking link kanwar yatra article ive posted article written explanation posted video shite thick skinned dil dos wont brain cells understand next days trucks pass every day outside house shut troll time kanwar yatra want hate hindus seem day least learn customs happen better still find life hating hindus estimate wouldnt something like disturbs people paraud indian truly educated mean ganja daru think tujhe azaan se bhi problem hoti hogi hoti hai na comment gets downvoted yk heavily polarised sub comment gets downvoted yk heavily polarised sub yes whats point bringing im complaining completely different issue focus ops post azaan issue would posted",
    "light_cleaned_title": "Kanwar Yatra: Night marches with loud music disrupts life in East Delhi, Noida",
    "light_cleaned_selftext": "It's 4 am and 2 trucks blasting only sub bass passed by at 2kmph past our buildings. I called the cops and it's been 45mins and the trucks are still blasting it, I'm sure the cops have no issues in locating the trucks. This is not the india I want. These jobless Aholes need to be suspended upside down at a police station. Atleast 15000 people are guaranteed being affected by this shit, right now as I write this.",
    "light_cleaned_comments": "I don't get it how those people enjoy that bass. Was stuck in such a march and the cars window were shaking pretty loudly however the sound systems were about 100 meter away. And those guys were just dancing standing infront of the speakers They are enjoying the fact that they matter enough to inflict pain and inconvenience to others. It’s a paradigm of a society where the idiom of power is dominance over others through overt signalling. Yaar but 4am, like wtf. I have an insane day ahead and can't go back to sleep. And I can see lights on in a number of other houses. Like use headphones. And it's really damaging to the ear, I'm a musician I always have ear protection to dampen the sound, not cut it off 100%. All male party in a truck drunk and dancing. Probably gonna sleep off the whole day cuz they got no jobs. Yes. You have my sympathy. And yes. I sympathize and weep for the few truly educated in the North. They have no escape from this insanity. Hindu jaag raha hai (Hindus are awakening). It will be like this going forward. No one can dare stop them. Police will shower rose petals on them. How can you complain ? How can you raise a concern ? You were sleeping when wrong deeds were happening with others, so what has changed ? Go to sleep and bolo Modi Modi That's the point, I can't go back to sleep anymore, in more ways than one. I've been wondering how many police complaints they received. They don't enjoy the bass, they enjoy the power, power they have in numbers, power they have momentarily hiding behind their religion, it feels good to them to have this power in their otherwise insignificant life. It is useless, do not even think about it my friend. But good quality noise cancelling headphones Dude that sub bass was rattling windows 70 mts from the road, I'm on the 7th floor. 20 mins on 4 to 5 different instances. I've called in sick, working from home inshallah. Hindu ko bolo so jaye or sone de. Alarm se pehle uth ke kuch nahi ukhaad lenge ye. its is our kulcha, I thought they walked for religious reasons. Why do they need the loud and bright party trucks. Ban those. Let the pious walk without needless distraction I want to hear how much trouble people are having from azaan but this is fine Kanwariya and gundagardi has been synonymous with each other for ages. I remember being intimidated by them as a kid. They were out of control and entitled even pre modi. Well they don't blast it infront of your home with loud speaker in high bass Oh yeah, let's have a loudspeaker competition, fuck society and their eardrums. I can't tell if sanghis hate Islam or imitate them. oh yeah,365 days torture with that cheap opera voice and that too multiples times a day, and rip for those places having 4 to 5 of them,sure bro sure When they’re passing through Uttarakhand these music things continue v late at night, so disruptive and cant raise a voice coz they are hooligans Unless you live right next to the mosque u can't hear it that loud yeah lmfao They are the other side of the coin. Gandoo gandoo Bhai Bhai I called the cops and complained. Nothing happened, dev bhoomi might be worse. Ram rajya needs sound system bhajans, cuz small dik syndrome. I also don't want to be woken up by 5am Azaan which happens 5 time a day. Ban the loudspeakers. Nah azaan isn't fine as well, loudspeakers need to be banned in general. This is an irrelevant bait post from a hateful OP. The article is from Jul 15 2023, there is no Kanwar yatra at the moment because this is not when it happens. If he has a problem with trucks honking, why link a Kanwar Yatra article with this? I've posted the article and written my own explanation and posted a video of the same shite, but thick skinned Dil do's won't have the brain cells to understand. NEXT 9 DAYS THESE TRUCKS WILL PASS EVERY DAY OUTSIDE MY HOUSE. Shut up troll! This is not the time for kanwar yatra. If you want to hate on Hindus, which is what you seem to do all day, at least learn when our customs happen. Or better still, find a life. How is this hating on Hindus ? My estimate is that you wouldn’t be doing something like this that disturbs other people Paraud Indian \"Few\" truly educated, What do you mean? Ganja & Daru... i think tujhe azaan se bhi problem hoti hogi , hoti hai na? if this comment get's downvoted yk this is a heavily polarised sub if this comment get's downvoted yk this is a heavily polarised sub 1000% yes, but what's the point of bringing it up when I'm complaining about a completely different issue. Focus on what the op's post is about, if there was an azaan issue I would have posted about that."
}