{
    "id": "1boapgt",
    "title": "Exposed: Women's Safety a Sham! Only Cows Get Protection?",
    "url": "https://www.reddit.com/r/india/comments/1boapgt/exposed_womens_safety_a_sham_only_cows_get/",
    "selftext": "Our country has come a long way from Raja Ram Mohan Roy and Vidyasagar but has it really?\n\n&#x200B;\n\nToday we discuss the safety of women in Uttar Pradesh where the CM claims :  “Now even a 16-year-old girl wearing jewellery can roam around at 12 pm without any fear. The change was possible only after the BJP came to power in 2017,”  \n\nIs this really true? \n\nAnswer is a big NO, here see the graph for yourself:\n\n&#x200B;\n\nhttps://preview.redd.it/39i2lh6v5pqc1.png?width=849&format=png&auto=webp&s=a0fc1936aa5d8234bd87654537f00c66d8a42cad\n\n&#x200B;\n\nThe count keeps increasing year after year , but on the ground when such big claims are made everyone believes them.\n\n\" According to the latest report of the National Crime Records Bureau (NCRB), Uttar Pradesh topped the country in 2022 in the total number of crimes against women (such as rape, murder, kidnapping, murder after rape, and gang rape). It recorded 65,743 such cases, compared with 56,083 in 2021 and 49,385 in 2020. \"\n\n&#x200B;\n\nhttps://preview.redd.it/16r452cw5pqc1.png?width=849&format=png&auto=webp&s=73c00df4ac5abfd6df09fc70fb120bf9f1665869\n\n\" The State recorded the highest number of cases involving kidnapping of women (14,887), dowry deaths (2,138), and torture by husband and relatives (20,371). It was second in the number of rape cases (3,690), after Rajasthan (5,399). Uttar Pradesh also reported the highest number of “murders after gang-rape” (62). \"\n\nThis is the ground situation , laid-bare in front of you. Do you want this to extend to the nation? \n\nOh , no - \"I will vote for the lesser evil\" , many people are claiming. How do you even say that!\n\n&#x200B;\n\nRapists are garlanded and they have the courage to keep attempting this without any fear why?\n\n[https://www.ndtv.com/india-news/bilkis-banos-rapists-are-brahmins-have-good-sanskar-bjp-mla-3266193](https://www.ndtv.com/india-news/bilkis-banos-rapists-are-brahmins-have-good-sanskar-bjp-mla-3266193)\n\n\"Bilkis Bano rapists are brahmins have good sanskar\" , is this what you all think? Or is this party a representative of a fringe upper-caste sub-section of the population.\n\nIn IIT-BHU :\n\n\" In another case, the party came under attack after the delayed arrest of three accused persons, Kunal Pandey, Anand alias Abhishek Chauhan, and Saksham Patel, in a two-month-old IIT (BHU) gang-rape case. The survivor, a 20-year-old BTech student, had reportedly identified them within five days of the incident, but the police arrested the accused only on December 31. Initially, the police registered a molestation case, but following angry protests, relevant gang-rape sections were added to the FIR. \"\n\nSince these guys held connections with the PARIVAR , they were protected. A group which protects its r\\*pists , cannot be forgiven.\n\nIn 2014 , voting ads were made : \"Hamare betiyon ko suraksha na dene walo janta maaf nehi karegi\"\n\n[https://www.youtube.com/watch?v=Kk0x0Q56ODE](https://www.youtube.com/watch?v=Kk0x0Q56ODE)\n\nBut it seems as long as so-called janta , doesn't even care about that or do they? \n\n “The police had all the evidence, including CCTV footage, but the accused were arrested only after student protests and widespread public condemnation. For BJP, Beti Bachao Beti Padhao is just a slogan,” \n\n\" Uttar Pradesh was also witness to several heinous crimes against Dalit women in 2023. On October 31, the dismembered body of a 40-year-old Dalit woman was found at the flour mill where she was working in Pataura village of Banda district. Her left hand had been chopped off and placed on her naked body, while her severed head was found nearby. The victim’s 44-year-old husband accused the police of shielding the accused as they hail from a dominant caste. \"\n\nJust look at this. For whose interest are they working for? Does the common human being even matter to them?\n\n\" One of the most shocking cases was reported in April from Lal Kheda village in Unnao district, where a group of men led by two rape accused who were out on bail set fire to the thatched brick house of a minor Dalit girl aged 14; they had reportedly sexually assaulted her the previous year. While the attackers thrashed the survivor and her mother, two infants of the family were reportedly flung into the raging flames. One of the infants was the rape survivor’s six-month-old child born after she was impregnated in the sexual assault, and the other was her two-month-old sister. \n\nIn June 2023, a 17-year-old Dalit girl in Barabanki district died by suicide after the police allegedly forced her family members to arrive at a compromise in favour of the accused persons who had gang-raped her. Later that month, a 38-year-old man died by suicide after the police took no action against the men accused of gang-raping his minor daughter in Akodhi village of Jalaun district. Before taking the extreme step, the aggrieved father is said to have filed a complaint against the local policemen on the Chief Minister’s Jansunwai online portal.\"\n\n&#x200B;\n\nIs this the model you want for the whole nation? \n\n&#x200B;\n\nhttps://preview.redd.it/ge0y6niz5pqc1.png?width=1200&format=png&auto=webp&s=b57c9dad22e41fa3b655d63f4e4c2dbf6cb4cc7f\n\nChoose wisely!\n\n[Source](https://frontline.thehindu.com/politics/uttar-pradesh-continues-to-be-unsafe-for-women-despite-bjp-tall-claims/article67701310.ece)\n\n&#x200B;",
    "flair": "Crime",
    "score": 470,
    "num_comments": 85,
    "created_utc": 1711467002.0,
    "convurl": "https://external-preview.redd.it/SvNMxxCr2nP7ClCKN-DzcnnMUFYoMqUrcy7bzS5gRg8.jpg?auto=webp&s=f8d536f982516ff5a35d9c8438cd2363ad93323d",
    "comments": [
        "This is scary!",
        "[https://timesofindia.indiatimes.com/city/lucknow/up-safer-for-women-than-many-big-states/articleshow/80204684.cms](https://timesofindia.indiatimes.com/city/lucknow/up-safer-for-women-than-many-big-states/articleshow/80204684.cms)",
        "Bold of you to assume that [Cows](https://www.indiatimes.com/news/india/man-charged-for-raping-cow-595198.html) or even a fcking [lizard](https://www.indiatoday.in/india/story/bengal-monitor-lizard-raped-maharashtra-3-held-sahydari-tiger-reserve-1937027-2022-04-13) is safe in this shithole country",
        "Even if you show these statistics to people, they'll refuse to accept this, and call you anti national and stuff (I tried showing this to my family, and they just snatched my phone saying \"phone pe ulti seedhi cheeze dekhta he\" and trying to put random blames on me for stuff I never did or do",
        "Mann! This is really scary. It wouldn't be that much if there seems to be efforts made by the gov to prevent this. But what we see is drastically opposite. They know that they will get votes in the name of religion, but with this situation in the country?? It is scary!",
        "Most people in favour of BJP will be in denial if they read the post.",
        "The condition of UP was and is shocking. Compared to earlier, people would definitely think this party is the lesser evil. Things used to be that bad over there earlier. I'm sure you don't know anything about the mafia and gundas that existed there earlier, with full political support. Look at people like Vikas Dubey or Atiq Ahmed. With the shit they did, how were they surviving for this long? Go read up their wikipedia page. It's messed up on so many levels.\n\nAnd, keep in mind this is only the 'reported cases'. The unreported ones are very high as well. I hope the reportings increase by a lot more. Even if the numbers increase, as long as the reporting is high, it's a positive sign that people are willing to speak up more. Everyone must speak up and such an atmosphere has to be created (only possible via education). \n\nPeople definitely will not be bringing back the parties that harboured people like Atiq Ahmed. Unless there is a new better opposition, people will not vote for them and that's the reality. You can choose to look at the situation with a biased mind, but try to be realistic and understand the on ground situation. \n\nI would leave it to the people over there to choose their party. When you live in that situation only you will know which party to vote for.",
        "This should be shared in all possible forums",
        "religion and caste....politics politics politics\n\nsome issue again play religion and caste....politics politics\n\ndivert everyone using religion and caste",
        "They won't be wrong if they don't want to accept these stats as they are actually wrong. Crimes against women are grossly under reported because of the taboo associated with them or other reasons. Which makes it even scarier.",
        "That's BJP style. First they promise things. After a few months /years they announce with a lot of fanfare that they have achieved promised targets. But the reality on ground is generally different. Facts and statistics are doctored and independence of reporting institutions are curbed or obfuscated by appointment of their sympathisers.",
        "What do you expect from a deluded country whose 90% of population worships multiple gods but still asks for a person's history and last name to confirm their caste?",
        "The lockdown helped women more than the police themselves",
        "There's a major problem in your statistical analysis which is the assumption that crimes being reported = crimes going up.\n\nThere has been a ton of literature about how difficult it is for women to report crime. And plenty of literature on how difficult it is generally. The fact that more crime is being reported doesn't necessarily mean crime has gone up. It is just as likely, if not more so, that it is indicative of administrative reforms ensuring that crimes are properly recorded.\n\nKnee Jerk reactions against crime stats and unreasoned demands for their reduction is exactly how many of the poorer states got into the problems they did because the cops would simply refuse to file complaints. No complaints? Crimes are down in their jurisdiction. Cue promotions, awards and commendations.",
        "The stats may show that but afaik actually domestic violence rose by a lot due to lockdown as husband and wife were stuck all day at home..and Domestic Violence doesn't get reported much so.",
        "Okie I am strictly against crime against women but you have to realise. Data you are showing is REPORTED Crime against Women. Nowadays police DO register complaint ( mostly) if a women complaint. Before Yogi complaint wasn't even registered because criminals were given shelter by those in power. Hence REPORTED cases will increase obviously. You can ask any normal person of UP candidly and they will tell you the truth",
        "3 year old report , 5 year old data.",
        "I agree with the women's safety never improving but the cows are safe isn't true. I've seen many cows and ox homeless when they get old, beating cows( or any animals) .  The cows are holy is just a sham, nobody in real life cares about animals except their pets. Cows are just political animals rn lol .",
        "No point in posting this. BJP bhakts will see this and still be in denial. Even if their own daughters, sisters, mothers etc get raped, they'll still say Jai Modi Jai BJP.",
        "That is alright but another focus is on how the rapists were defended and in many cases bodies burnt , casteism prevented many arrests etc",
        "These things you mentioned are allowed Rong and yes it used to happen 3 x before Yogi but yes I agree this have to be stopped. No matter Hindu Muslim Sikh or Christian Law should be same for everybody",
        "https://preview.redd.it/xychw6lwspqc1.png?width=1080&format=pjpg&auto=webp&s=774ed080082269f3aee54898e1a75fee59dc3ec3",
        "I am from up i every day see girl with bag going to their hostel home around 6.I always see police around evening at near chawrah.Although you people think this is small thing thing have changed a lot.",
        "I feel like stats have increased because crime reporting has also increased but yes we do have a very long to go in terms of women safety.",
        "Not just antisocial, you'll be called a \"misandrist\" and start wHaTaBoUtRy.. \"rapes happen everywhere, its just that our populationis high \".",
        "And marital rape is legal so women aren't safe inside or outside.",
        "I kindly disagree. Women have started going out but the fear has not decreased. There is always a fear that something is going to happen to me just because I’m a women and most of all if anything happens I will fear that I wouldn’t get support but rather be shamed by my society. It’s the mindset of ppl that giving confidence to these abusers. Women clothing, behavior is constantly blamed even questioning the mother about raising the girl properly but nobody raises questions against the rapist family.",
        "OP just wants to Blame Hindus & BJP for every criminal case in India. He’s just a pseudo leftist.\n\nIgnore this stupid & biased post.",
        "But why peudo Leftist? Why not just come out as leftist? I am a centerist slightly inclined towards right but why it's always leftists who have to present to b centerist and pushing their leftist agenda",
        "I never blamed Hindus , BJP doesn't entail Hinduism. Get that out of your head , the main point was how claims don't really seem to hold and also how BJP has protected many rapists and has oppressed the minority.",
        "Agree but saying that yogi government has done nothing is wrong . for women safety,I would say it better than samjwadi.",
        "Northeast se hu\nLike bohot din phele idhar se ek ladki missing tha .\nKuch din phele ( 1 month se zyada ho gaya )uska body ek water tanker ka niche nale me mila\nBohot he zyada kharab halat me tha .\nUska gang rape huah tha Jo uska boyfriend ne kiya tha or bf ka  dost log.\nLadki ko ghar se bhaga ke leke Gaya or ye kar diya ladki ke sath\nLadki ka name aarti Kumari das hai \nLadka ka name sarfraz Hussain \n\nEk mahine se zyada ho gaya \nAbhi tak ladka ko kuch nehi kiyya\nPolice koi update nehi de rha",
        "Oh there were no such cases happened when Congress was in power? Countless such cases didn’t even recorded in the past.\n\nWhich minority you’re talking about? The one community that provoking anti-hinduism, forced conversions, rape & murder, physical harassment, anti-nationalism, terrorism? And you want people to choose the gov which supports all these? Noice!",
        "Highlight shit happening in country ❌  \nCompare it to religious beliefs 🤡",
        "I would say none of the govt parties has done anything genuinely for preventing this. In the end it’s not debate of BJP vs Congress. It’s diverting the issue altogether. There are rapists sitting in BJP government position as well congress. It’s a way for both parties to market and we are fools to debate who is better while none of them are actually doing anything",
        "Exactly! There are also some men who only bring up men's rights or men being victims of sexual assault when the topic of women being victims of sexual assault is discussed",
        "Agree that rapist sitting in bjp government but saying that bjp is wrong.you know there is joke that kuch galat mat karna nahi toh buldozer chal jayega.Yogi had made a fear among people.Police has improved as well",
        "Bhaiya. Nari raksha karo, statistics to chat gpt bhi bana dega. \n\nKab tak keyboard warrior banne rona karoge??",
        "Ram raj bhai ram raj",
        "Lol in this country majority women related crimes are done by muslims coz Islam teaches to beat and oppress women",
        "https://preview.redd.it/xxi4fr2gbqqc1.jpeg?width=521&format=pjpg&auto=webp&s=3d87bdf9b1e80d758358f1331738f030469d4eee",
        "Religious societies are sexist to the core, oppression of women is common across all religions, they are treated as property. Don't know how BJP still gets the women vote.",
        "Actually not even cows. It's a hypocritical notion. India is the largest exporter of cow leather. Dairy industry exploits cows without us knowing. So yeah no one gets protection expect the rich and those in power.",
        "They can't stand even a discussion of not opressing women.",
        "Are these stats per capita? or the total count? One can assume that even if the per capita crime stays stagnant, absolute numbers would appear higher.\n\nAlthough I personally believe that the claim made by politician cant be true, not even in his wildest imaginations.",
        "Bcoz they are \"top Gs\" that want lord modi to invade Romania",
        "More reason to leave this shitty land",
        "Time to change the government, let's show bjp that they can't take us for granted",
        "Your anger is right.  But let me put some points in perspective .\n\n1) whomever is in power ( politically or economically) will never feel harsh judgment of law that's basic nature of things  even if we say it's democracy and its true for everyplace in world .\n\n2) with population rise and less employment opportunity there is feeling of unrest and it increased these kind of incident ( again its not an excuse it's just a perspective ) \n\n3)in your bar chart the bar about harreshment for dowery column is not right . Because even though it's an major issue there are multiple fake cases there so you can't really say data is correct .\n\n\nPoint being whatever makes the large part of population put a vote in particular direction will get attention hence Cow protection. \n\nAs for women safety yes there are issue and need a lot of improvement there is no denying in that .But to change something in india you have to start from core of it that is politics and nobody want to go there unless you have too much money or guns . Then we question those goons ( it's same situation in every state )",
        "In India what are the taboos which stop one from reporting?",
        "Source that majority women related crimes are done by muslims?",
        "It ruins and dishonours the family's reputation. Losing face in society - which is really devastating as per Indian society, where a woman's reputation is more important than her life. She must have done something to warrant it, she must be characterless so deserved it, she must be too independent so learnt a lesson. Apart from troll comments and judgement, the process to get justice is paved with many challenges like police making fun of the incident and defence lawyers digging her relationships to prove she is easy or characterless.",
        "Are they in cow poop?",
        "My dude, go read some local newspapers of non bjp states. You’ll find more or less similar incidents that don’t get national coverage. And the sad part is if the accused are in anyway related to ruling party they get saved. So your concern shouldn’t be if people want this model for nation, it should be how can you make govt & political parties do the right thing & take proper action to ensure safety of women, regardless of your political alignment.",
        "We must make it so that a family that seeks to protect its 'honour' by harming or silencing a victim of abuse has no honour in the true sense of the word. We must redefine honour as having the guts to stand up for your family and protect as well as not keep silent. Nothing honourable about not standing up for your sister, daughter or mother. \n\nWishful thinking IG. Indian culture is far too regressive. We need reformation",
        "Yup it was There is the link https://youtu.be/Ai--ioYcd0o?si=bXRRbmN7wOSh9h6m",
        "You may not know this but in India  70 - 80 % of the rape cases culprit is either neighbor , relative, or someone who girls family already knows. ( which is one of the things what makes rapes in India different from countries like America and England and Europe  )\n\nAfter the crime families of both wants to avoid going to police saying it may destroy  mens family if they are married ( his wife and kids won't have provider ) and incase  for victim girl :-  the girl will get  \" ***damaged*** \" and it will  hinder and her from getting married ( *meaning will have to give huge dowry , that is if anyone will be willing to marry her at all* ) \n\nWe strive for death penalty but in reality people involved think it is too extreme  for  \" ***mistake*** \" the guy  maid and it will damage the girl anyway so let's just all  keep quiet,  . This people convince the victim girls it will be just be more problems if she goes to Police ( *including her own family* sad but reality )\n\nThe only time it is big deal when someone from another cast or religion commits the crime,  now only everyone wants justice  not mainly for the girls sake but \" ***how dare someone from other cast or religion touched our ~~girl~~ property*** \" \n\nIn cities situation is very much different  , but don't forget 70% population in India still lives in rural area not urban.  \n\nGo to any ruler town / village and try talking to this girls,  they would rather marry poor guy who is in  city than richest guy in village ( *they just wants to grt out of the village asap* )\n\nAnd when they do leave the village and come to cities,  well you already know how safe they are.",
        "BJP != HINDU",
        "But INC == Muslim",
        "Sad but true. People of cloth respect their religion more than their fellow people.",
        "Shi iiit....no wonder some politicians win elections in spite of doing a shitty job.",
        "I wonder if those masks will work as they must. They would simply say that you're cheating.🤔",
        "People have been brainwashed to accept these crimes if it enables the Modi gang to be in power.",
        "Holy shit I didn't think that it would be this bad. They don't even leave the poor [goats](https://www.indiatoday.in/india/story/pregnant-goat-dies-after-8-men-gang-raped-it-in-haryana-1299168-2018-07-28). Like?????",
        "Have you heard of two magical terms, that make every data look irrelevant? \"Jumla\" and \"Bhakti\"?",
        "I am hearing good things about Yogi govt in UP. People who have seen the rule of SP, BSP & Congress are all praises for Yogi.",
        "I have this hopeful delusional belief that they will face the brutal reality of bjp themselves and start questioning themselves",
        "Unfortunately I don't think so. Just look at Germany during Hitler's time. Atlast a world war was needed to stop hitler🥲",
        "Institutionalised insanity. It's progressing rapidly.",
        "Bro, why don't they just use their hand to do the deed? Like come on man, how desperate you have to be 😂",
        "Rapes in the US are also more often someone the victim knows too",
        "But we are in a transition phase towards dictatorship\n\nI think there is a possibility that lots of people can come together and stop this transition",
        "Not just us and india it's whole world"
    ],
    "cleaned_text": "exposed womens safety sham cows get protection country come long way raja ram mohan roy vidyasagar really xb today discuss safety women uttar pradesh cm claims even yearold girl wearing jewellery roam around pm without fear change possible bjp came power really true answer big see graph xb xb count keeps increasing year year ground big claims made everyone believes according latest report national crime records bureau ncrb uttar pradesh topped country total number crimes women rape murder kidnapping murder rape gang rape recorded cases compared xb state recorded highest number cases involving kidnapping women dowry deaths torture husband relatives second number rape cases rajasthan uttar pradesh also reported highest number murders gangrape ground situation laidbare front want extend nation oh vote lesser evil many people claiming even say xb rapists garlanded courage keep attempting without fear httpswwwndtvcomindianewsbilkisbanosrapistsarebrahminshavegoodsanskarbjpmlahttpswwwndtvcomindianewsbilkisbanosrapistsarebrahminshavegoodsanskarbjpmla bilkis bano rapists brahmins good sanskar think party representative fringe uppercaste subsection population iitbhu another case party came attack delayed arrest three accused persons kunal pandey anand alias abhishek chauhan saksham patel twomonthold iit bhu gangrape case survivor yearold btech student reportedly identified within five days incident police arrested accused december initially police registered molestation case following angry protests relevant gangrape sections added fir since guys held connections parivar protected group protects rpists forgiven voting ads made hamare betiyon ko suraksha na dene walo janta maaf nehi karegi httpswwwyoutubecomwatchvkkxqodehttpswwwyoutubecomwatchvkkxqode seems long socalled janta doesnt even care police evidence including cctv footage accused arrested student protests widespread public condemnation bjp beti bachao beti padhao slogan uttar pradesh also witness several heinous crimes dalit women october dismembered body yearold dalit woman found flour mill working pataura village banda district left hand chopped placed naked body severed head found nearby victims yearold husband accused police shielding accused hail dominant caste look whose interest working common human even matter one shocking cases reported april lal kheda village unnao district group men led two rape accused bail set fire thatched brick house minor dalit girl aged reportedly sexually assaulted previous year attackers thrashed survivor mother two infants family reportedly flung raging flames one infants rape survivors sixmonthold child born impregnated sexual assault twomonthold sister june yearold dalit girl barabanki district died suicide police allegedly forced family members arrive compromise favour accused persons gangraped later month yearold man died suicide police took action men accused gangraping minor daughter akodhi village jalaun district taking extreme step aggrieved father said filed complaint local policemen chief ministers jansunwai online portal xb model want whole nation xb choose wisely sourcehttpsfrontlinethehinducompoliticsuttarpradeshcontinuestobeunsafeforwomendespitebjptallclaimsarticleece xb ",
    "cleaned_title": "exposed womens safety sham cows get protection",
    "cleaned_selftext": "country come long way raja ram mohan roy vidyasagar really xb today discuss safety women uttar pradesh cm claims even yearold girl wearing jewellery roam around pm without fear change possible bjp came power really true answer big see graph xb xb count keeps increasing year year ground big claims made everyone believes according latest report national crime records bureau ncrb uttar pradesh topped country total number crimes women rape murder kidnapping murder rape gang rape recorded cases compared xb state recorded highest number cases involving kidnapping women dowry deaths torture husband relatives second number rape cases rajasthan uttar pradesh also reported highest number murders gangrape ground situation laidbare front want extend nation oh vote lesser evil many people claiming even say xb rapists garlanded courage keep attempting without fear httpswwwndtvcomindianewsbilkisbanosrapistsarebrahminshavegoodsanskarbjpmlahttpswwwndtvcomindianewsbilkisbanosrapistsarebrahminshavegoodsanskarbjpmla bilkis bano rapists brahmins good sanskar think party representative fringe uppercaste subsection population iitbhu another case party came attack delayed arrest three accused persons kunal pandey anand alias abhishek chauhan saksham patel twomonthold iit bhu gangrape case survivor yearold btech student reportedly identified within five days incident police arrested accused december initially police registered molestation case following angry protests relevant gangrape sections added fir since guys held connections parivar protected group protects rpists forgiven voting ads made hamare betiyon ko suraksha na dene walo janta maaf nehi karegi httpswwwyoutubecomwatchvkkxqodehttpswwwyoutubecomwatchvkkxqode seems long socalled janta doesnt even care police evidence including cctv footage accused arrested student protests widespread public condemnation bjp beti bachao beti padhao slogan uttar pradesh also witness several heinous crimes dalit women october dismembered body yearold dalit woman found flour mill working pataura village banda district left hand chopped placed naked body severed head found nearby victims yearold husband accused police shielding accused hail dominant caste look whose interest working common human even matter one shocking cases reported april lal kheda village unnao district group men led two rape accused bail set fire thatched brick house minor dalit girl aged reportedly sexually assaulted previous year attackers thrashed survivor mother two infants family reportedly flung raging flames one infants rape survivors sixmonthold child born impregnated sexual assault twomonthold sister june yearold dalit girl barabanki district died suicide police allegedly forced family members arrive compromise favour accused persons gangraped later month yearold man died suicide police took action men accused gangraping minor daughter akodhi village jalaun district taking extreme step aggrieved father said filed complaint local policemen chief ministers jansunwai online portal xb model want whole nation xb choose wisely sourcehttpsfrontlinethehinducompoliticsuttarpradeshcontinuestobeunsafeforwomendespitebjptallclaimsarticleece xb",
    "cleaned_comments": "scary httpstimesofindiaindiatimescomcitylucknowupsaferforwomenthanmanybigstatesarticleshowcmshttpstimesofindiaindiatimescomcitylucknowupsaferforwomenthanmanybigstatesarticleshowcms bold assume cowshttpswwwindiatimescomnewsindiamanchargedforrapingcowhtml even fcking lizardhttpswwwindiatodayinindiastorybengalmonitorlizardrapedmaharashtraheldsahydaritigerreserve safe shithole country even show statistics people theyll refuse accept call anti national stuff tried showing family snatched phone saying phone pe ulti seedhi cheeze dekhta trying put random blames stuff never mann really scary wouldnt much seems efforts made gov prevent see drastically opposite know get votes name religion situation country scary people favour bjp denial read post condition shocking compared earlier people would definitely think party lesser evil things used bad earlier im sure dont know anything mafia gundas existed earlier full political support look people like vikas dubey atiq ahmed shit surviving long go read wikipedia page messed many levels keep mind reported cases unreported ones high well hope reportings increase lot even numbers increase long reporting high positive sign people willing speak everyone must speak atmosphere created possible via education people definitely bringing back parties harboured people like atiq ahmed unless new better opposition people vote thats reality choose look situation biased mind try realistic understand ground situation would leave people choose party live situation know party vote shared possible forums religion castepolitics politics politics issue play religion castepolitics politics divert everyone using religion caste wont wrong dont want accept stats actually wrong crimes women grossly reported taboo associated reasons makes even scarier thats bjp style first promise things months years announce lot fanfare achieved promised targets reality ground generally different facts statistics doctored independence reporting institutions curbed obfuscated appointment sympathisers expect deluded country whose population worships multiple gods still asks persons history last name confirm caste lockdown helped women police theres major problem statistical analysis assumption crimes reported crimes going ton literature difficult women report crime plenty literature difficult generally fact crime reported doesnt necessarily mean crime gone likely indicative administrative reforms ensuring crimes properly recorded knee jerk reactions crime stats unreasoned demands reduction exactly many poorer states got problems cops would simply refuse file complaints complaints crimes jurisdiction cue promotions awards commendations stats may show afaik actually domestic violence rose lot due lockdown husband wife stuck day homeand domestic violence doesnt get reported much okie strictly crime women realise data showing reported crime women nowadays police register complaint mostly women complaint yogi complaint wasnt even registered criminals given shelter power hence reported cases increase obviously ask normal person candidly tell truth year old report year old data agree womens safety never improving cows safe isnt true ive seen many cows ox homeless get old beating cows animals cows holy sham nobody real life cares animals except pets cows political animals rn lol point posting bjp bhakts see still denial even daughters sisters mothers etc get raped theyll still say jai modi jai bjp alright another focus rapists defended many cases bodies burnt casteism prevented many arrests etc things mentioned allowed rong yes used happen x yogi yes agree stopped matter hindu muslim sikh christian law everybody every day see girl bag going hostel home around always see police around evening near chawrahalthough people think small thing thing changed lot feel like stats increased crime reporting also increased yes long go terms women safety antisocial youll called misandrist start whataboutry rapes happen everywhere populationis high marital rape legal women arent safe inside outside kindly disagree women started going fear decreased always fear something going happen im women anything happens fear wouldnt get support rather shamed society mindset ppl giving confidence abusers women clothing behavior constantly blamed even questioning mother raising girl properly nobody raises questions rapist family op wants blame hindus bjp every criminal case india hes pseudo leftist ignore stupid biased post peudo leftist come leftist centerist slightly inclined towards right always leftists present b centerist pushing leftist agenda never blamed hindus bjp doesnt entail hinduism get head main point claims dont really seem hold also bjp protected many rapists oppressed minority agree saying yogi government done nothing wrong women safetyi would say better samjwadi northeast se hu like bohot din phele idhar se ek ladki missing tha kuch din phele month se zyada ho gaya uska body ek water tanker ka niche nale mila bohot zyada kharab halat tha uska gang rape huah tha jo uska boyfriend ne kiya tha bf ka dost log ladki ko ghar se bhaga ke leke gaya ye kar diya ladki ke sath ladki ka name aarti kumari das hai ladka ka name sarfraz hussain ek mahine se zyada ho gaya abhi tak ladka ko kuch nehi kiyya police koi update nehi de rha oh cases happened congress power countless cases didnt even recorded past minority youre talking one community provoking antihinduism forced conversions rape murder physical harassment antinationalism terrorism want people choose gov supports noice highlight shit happening country compare religious beliefs would say none govt parties done anything genuinely preventing end debate bjp vs congress diverting issue altogether rapists sitting bjp government position well congress way parties market fools debate better none actually anything exactly also men bring mens rights men victims sexual assault topic women victims sexual assault discussed agree rapist sitting bjp government saying bjp wrongyou know joke kuch galat mat karna nahi toh buldozer chal jayegayogi made fear among peoplepolice improved well bhaiya nari raksha karo statistics chat gpt bhi bana dega kab tak keyboard warrior banne rona karoge ram raj bhai ram raj lol country majority women related crimes done muslims coz islam teaches beat oppress women religious societies sexist core oppression women common across religions treated property dont know bjp still gets women vote actually even cows hypocritical notion india largest exporter cow leather dairy industry exploits cows without us knowing yeah one gets protection expect rich power cant stand even discussion opressing women stats per capita total count one assume even per capita crime stays stagnant absolute numbers would appear higher although personally believe claim made politician cant true even wildest imaginations bcoz top gs want lord modi invade romania reason leave shitty land time change government lets show bjp cant take us granted anger right let put points perspective whomever power politically economically never feel harsh judgment law thats basic nature things even say democracy true everyplace world population rise less employment opportunity feeling unrest increased kind incident excuse perspective bar chart bar harreshment dowery column right even though major issue multiple fake cases cant really say data correct point whatever makes large part population put vote particular direction get attention hence cow protection women safety yes issue need lot improvement denying change something india start core politics nobody want go unless much money guns question goons situation every state india taboos stop one reporting source majority women related crimes done muslims ruins dishonours familys reputation losing face society really devastating per indian society womans reputation important life must done something warrant must characterless deserved must independent learnt lesson apart troll comments judgement process get justice paved many challenges like police making fun incident defence lawyers digging relationships prove easy characterless cow poop dude go read local newspapers non bjp states youll find less similar incidents dont get national coverage sad part accused anyway related ruling party get saved concern shouldnt people want model nation make govt political parties right thing take proper action ensure safety women regardless political alignment must make family seeks protect honour harming silencing victim abuse honour true sense word must redefine honour guts stand family protect well keep silent nothing honourable standing sister daughter mother wishful thinking ig indian culture far regressive need reformation yup link may know india rape cases culprit either neighbor relative someone girls family already knows one things makes rapes india different countries like america england europe crime families wants avoid going police saying may destroy mens family married wife kids wont provider incase victim girl girl get damaged hinder getting married meaning give huge dowry anyone willing marry strive death penalty reality people involved think extreme mistake guy maid damage girl anyway lets keep quiet people convince victim girls problems goes police including family sad reality time big deal someone another cast religion commits crime everyone wants justice mainly girls sake dare someone cast religion touched girl property cities situation much different dont forget population india still lives rural area urban go ruler town village try talking girls would rather marry poor guy city richest guy village wants grt village asap leave village come cities well already know safe bjp hindu inc muslim sad true people cloth respect religion fellow people shi iiitno wonder politicians win elections spite shitty job wonder masks work must would simply say youre cheating people brainwashed accept crimes enables modi gang power holy shit didnt think would bad dont even leave poor goatshttpswwwindiatodayinindiastorypregnantgoatdiesaftermengangrapeditinharyana like heard two magical terms make every data look irrelevant jumla bhakti hearing good things yogi govt people seen rule sp bsp congress praises yogi hopeful delusional belief face brutal reality bjp start questioning unfortunately dont think look germany hitlers time atlast world war needed stop hitler institutionalised insanity progressing rapidly bro dont use hand deed like come man desperate rapes us also often someone victim knows transition phase towards dictatorship think possibility lots people come together stop transition us india whole world",
    "light_cleaned_title": "Exposed: Women's Safety a Sham! Only Cows Get Protection?",
    "light_cleaned_selftext": "Our country has come a long way from Raja Ram Mohan Roy and Vidyasagar but has it really? &#x200B; Today we discuss the safety of women in Uttar Pradesh where the CM claims : “Now even a 16-year-old girl wearing jewellery can roam around at 12 pm without any fear. The change was possible only after the BJP came to power in 2017,” Is this really true? Answer is a big NO, here see the graph for yourself: &#x200B; &#x200B; The count keeps increasing year after year , but on the ground when such big claims are made everyone believes them. \" According to the latest report of the National Crime Records Bureau (NCRB), Uttar Pradesh topped the country in 2022 in the total number of crimes against women (such as rape, murder, kidnapping, murder after rape, and gang rape). It recorded 65,743 such cases, compared with 56,083 in 2021 and 49,385 in 2020. \" &#x200B; \" The State recorded the highest number of cases involving kidnapping of women (14,887), dowry deaths (2,138), and torture by husband and relatives (20,371). It was second in the number of rape cases (3,690), after Rajasthan (5,399). Uttar Pradesh also reported the highest number of “murders after gang-rape” (62). \" This is the ground situation , laid-bare in front of you. Do you want this to extend to the nation? Oh , no - \"I will vote for the lesser evil\" , many people are claiming. How do you even say that! &#x200B; Rapists are garlanded and they have the courage to keep attempting this without any fear why? [https://www.ndtv.com/india-news/bilkis-banos-rapists-are-brahmins-have-good-sanskar-bjp-mla-3266193](https://www.ndtv.com/india-news/bilkis-banos-rapists-are-brahmins-have-good-sanskar-bjp-mla-3266193) \"Bilkis Bano rapists are brahmins have good sanskar\" , is this what you all think? Or is this party a representative of a fringe upper-caste sub-section of the population. In IIT-BHU : \" In another case, the party came under attack after the delayed arrest of three accused persons, Kunal Pandey, Anand alias Abhishek Chauhan, and Saksham Patel, in a two-month-old IIT (BHU) gang-rape case. The survivor, a 20-year-old BTech student, had reportedly identified them within five days of the incident, but the police arrested the accused only on December 31. Initially, the police registered a molestation case, but following angry protests, relevant gang-rape sections were added to the FIR. \" Since these guys held connections with the PARIVAR , they were protected. A group which protects its r\\*pists , cannot be forgiven. In 2014 , voting ads were made : \"Hamare betiyon ko suraksha na dene walo janta maaf nehi karegi\" [https://www.youtube.com/watch?v=Kk0x0Q56ODE](https://www.youtube.com/watch?v=Kk0x0Q56ODE) But it seems as long as so-called janta , doesn't even care about that or do they? “The police had all the evidence, including CCTV footage, but the accused were arrested only after student protests and widespread public condemnation. For BJP, Beti Bachao Beti Padhao is just a slogan,” \" Uttar Pradesh was also witness to several heinous crimes against Dalit women in 2023. On October 31, the dismembered body of a 40-year-old Dalit woman was found at the flour mill where she was working in Pataura village of Banda district. Her left hand had been chopped off and placed on her naked body, while her severed head was found nearby. The victim’s 44-year-old husband accused the police of shielding the accused as they hail from a dominant caste. \" Just look at this. For whose interest are they working for? Does the common human being even matter to them? \" One of the most shocking cases was reported in April from Lal Kheda village in Unnao district, where a group of men led by two rape accused who were out on bail set fire to the thatched brick house of a minor Dalit girl aged 14; they had reportedly sexually assaulted her the previous year. While the attackers thrashed the survivor and her mother, two infants of the family were reportedly flung into the raging flames. One of the infants was the rape survivor’s six-month-old child born after she was impregnated in the sexual assault, and the other was her two-month-old sister. In June 2023, a 17-year-old Dalit girl in Barabanki district died by suicide after the police allegedly forced her family members to arrive at a compromise in favour of the accused persons who had gang-raped her. Later that month, a 38-year-old man died by suicide after the police took no action against the men accused of gang-raping his minor daughter in Akodhi village of Jalaun district. Before taking the extreme step, the aggrieved father is said to have filed a complaint against the local policemen on the Chief Minister’s Jansunwai online portal.\" &#x200B; Is this the model you want for the whole nation? &#x200B; Choose wisely! [Source](https://frontline.thehindu.com/politics/uttar-pradesh-continues-to-be-unsafe-for-women-despite-bjp-tall-claims/article67701310.ece) &#x200B;",
    "light_cleaned_comments": "This is scary! [https://timesofindia.indiatimes.com/city/lucknow/up-safer-for-women-than-many-big-states/articleshow/80204684.cms](https://timesofindia.indiatimes.com/city/lucknow/up-safer-for-women-than-many-big-states/articleshow/80204684.cms) Bold of you to assume that [Cows](https://www.indiatimes.com/news/india/man-charged-for-raping-cow-595198.html) or even a fcking [lizard](https://www.indiatoday.in/india/story/bengal-monitor-lizard-raped-maharashtra-3-held-sahydari-tiger-reserve-1937027-2022-04-13) is safe in this shithole country Even if you show these statistics to people, they'll refuse to accept this, and call you anti national and stuff (I tried showing this to my family, and they just snatched my phone saying \"phone pe ulti seedhi cheeze dekhta he\" and trying to put random blames on me for stuff I never did or do Mann! This is really scary. It wouldn't be that much if there seems to be efforts made by the gov to prevent this. But what we see is drastically opposite. They know that they will get votes in the name of religion, but with this situation in the country?? It is scary! Most people in favour of BJP will be in denial if they read the post. The condition of UP was and is shocking. Compared to earlier, people would definitely think this party is the lesser evil. Things used to be that bad over there earlier. I'm sure you don't know anything about the mafia and gundas that existed there earlier, with full political support. Look at people like Vikas Dubey or Atiq Ahmed. With the shit they did, how were they surviving for this long? Go read up their wikipedia page. It's messed up on so many levels. And, keep in mind this is only the 'reported cases'. The unreported ones are very high as well. I hope the reportings increase by a lot more. Even if the numbers increase, as long as the reporting is high, it's a positive sign that people are willing to speak up more. Everyone must speak up and such an atmosphere has to be created (only possible via education). People definitely will not be bringing back the parties that harboured people like Atiq Ahmed. Unless there is a new better opposition, people will not vote for them and that's the reality. You can choose to look at the situation with a biased mind, but try to be realistic and understand the on ground situation. I would leave it to the people over there to choose their party. When you live in that situation only you will know which party to vote for. This should be shared in all possible forums religion and caste....politics politics politics some issue again play religion and caste....politics politics divert everyone using religion and caste They won't be wrong if they don't want to accept these stats as they are actually wrong. Crimes against women are grossly under reported because of the taboo associated with them or other reasons. Which makes it even scarier. That's BJP style. First they promise things. After a few months /years they announce with a lot of fanfare that they have achieved promised targets. But the reality on ground is generally different. Facts and statistics are doctored and independence of reporting institutions are curbed or obfuscated by appointment of their sympathisers. What do you expect from a deluded country whose 90% of population worships multiple gods but still asks for a person's history and last name to confirm their caste? The lockdown helped women more than the police themselves There's a major problem in your statistical analysis which is the assumption that crimes being reported = crimes going up. There has been a ton of literature about how difficult it is for women to report crime. And plenty of literature on how difficult it is generally. The fact that more crime is being reported doesn't necessarily mean crime has gone up. It is just as likely, if not more so, that it is indicative of administrative reforms ensuring that crimes are properly recorded. Knee Jerk reactions against crime stats and unreasoned demands for their reduction is exactly how many of the poorer states got into the problems they did because the cops would simply refuse to file complaints. No complaints? Crimes are down in their jurisdiction. Cue promotions, awards and commendations. The stats may show that but afaik actually domestic violence rose by a lot due to lockdown as husband and wife were stuck all day at home..and Domestic Violence doesn't get reported much so. Okie I am strictly against crime against women but you have to realise. Data you are showing is REPORTED Crime against Women. Nowadays police DO register complaint ( mostly) if a women complaint. Before Yogi complaint wasn't even registered because criminals were given shelter by those in power. Hence REPORTED cases will increase obviously. You can ask any normal person of UP candidly and they will tell you the truth 3 year old report , 5 year old data. I agree with the women's safety never improving but the cows are safe isn't true. I've seen many cows and ox homeless when they get old, beating cows( or any animals) . The cows are holy is just a sham, nobody in real life cares about animals except their pets. Cows are just political animals rn lol . No point in posting this. BJP bhakts will see this and still be in denial. Even if their own daughters, sisters, mothers etc get raped, they'll still say Jai Modi Jai BJP. That is alright but another focus is on how the rapists were defended and in many cases bodies burnt , casteism prevented many arrests etc These things you mentioned are allowed Rong and yes it used to happen 3 x before Yogi but yes I agree this have to be stopped. No matter Hindu Muslim Sikh or Christian Law should be same for everybody I am from up i every day see girl with bag going to their hostel home around 6.I always see police around evening at near chawrah.Although you people think this is small thing thing have changed a lot. I feel like stats have increased because crime reporting has also increased but yes we do have a very long to go in terms of women safety. Not just antisocial, you'll be called a \"misandrist\" and start wHaTaBoUtRy.. \"rapes happen everywhere, its just that our populationis high \". And marital rape is legal so women aren't safe inside or outside. I kindly disagree. Women have started going out but the fear has not decreased. There is always a fear that something is going to happen to me just because I’m a women and most of all if anything happens I will fear that I wouldn’t get support but rather be shamed by my society. It’s the mindset of ppl that giving confidence to these abusers. Women clothing, behavior is constantly blamed even questioning the mother about raising the girl properly but nobody raises questions against the rapist family. OP just wants to Blame Hindus & BJP for every criminal case in India. He’s just a pseudo leftist. Ignore this stupid & biased post. But why peudo Leftist? Why not just come out as leftist? I am a centerist slightly inclined towards right but why it's always leftists who have to present to b centerist and pushing their leftist agenda I never blamed Hindus , BJP doesn't entail Hinduism. Get that out of your head , the main point was how claims don't really seem to hold and also how BJP has protected many rapists and has oppressed the minority. Agree but saying that yogi government has done nothing is wrong . for women safety,I would say it better than samjwadi. Northeast se hu Like bohot din phele idhar se ek ladki missing tha . Kuch din phele ( 1 month se zyada ho gaya )uska body ek water tanker ka niche nale me mila Bohot he zyada kharab halat me tha . Uska gang rape huah tha Jo uska boyfriend ne kiya tha or bf ka dost log. Ladki ko ghar se bhaga ke leke Gaya or ye kar diya ladki ke sath Ladki ka name aarti Kumari das hai Ladka ka name sarfraz Hussain Ek mahine se zyada ho gaya Abhi tak ladka ko kuch nehi kiyya Police koi update nehi de rha Oh there were no such cases happened when Congress was in power? Countless such cases didn’t even recorded in the past. Which minority you’re talking about? The one community that provoking anti-hinduism, forced conversions, rape & murder, physical harassment, anti-nationalism, terrorism? And you want people to choose the gov which supports all these? Noice! Highlight shit happening in country ❌ Compare it to religious beliefs 🤡 I would say none of the govt parties has done anything genuinely for preventing this. In the end it’s not debate of BJP vs Congress. It’s diverting the issue altogether. There are rapists sitting in BJP government position as well congress. It’s a way for both parties to market and we are fools to debate who is better while none of them are actually doing anything Exactly! There are also some men who only bring up men's rights or men being victims of sexual assault when the topic of women being victims of sexual assault is discussed Agree that rapist sitting in bjp government but saying that bjp is wrong.you know there is joke that kuch galat mat karna nahi toh buldozer chal jayega.Yogi had made a fear among people.Police has improved as well Bhaiya. Nari raksha karo, statistics to chat gpt bhi bana dega. Kab tak keyboard warrior banne rona karoge?? Ram raj bhai ram raj Lol in this country majority women related crimes are done by muslims coz Islam teaches to beat and oppress women Religious societies are sexist to the core, oppression of women is common across all religions, they are treated as property. Don't know how BJP still gets the women vote. Actually not even cows. It's a hypocritical notion. India is the largest exporter of cow leather. Dairy industry exploits cows without us knowing. So yeah no one gets protection expect the rich and those in power. They can't stand even a discussion of not opressing women. Are these stats per capita? or the total count? One can assume that even if the per capita crime stays stagnant, absolute numbers would appear higher. Although I personally believe that the claim made by politician cant be true, not even in his wildest imaginations. Bcoz they are \"top Gs\" that want lord modi to invade Romania More reason to leave this shitty land Time to change the government, let's show bjp that they can't take us for granted Your anger is right. But let me put some points in perspective . 1) whomever is in power ( politically or economically) will never feel harsh judgment of law that's basic nature of things even if we say it's democracy and its true for everyplace in world . 2) with population rise and less employment opportunity there is feeling of unrest and it increased these kind of incident ( again its not an excuse it's just a perspective ) 3)in your bar chart the bar about harreshment for dowery column is not right . Because even though it's an major issue there are multiple fake cases there so you can't really say data is correct . Point being whatever makes the large part of population put a vote in particular direction will get attention hence Cow protection. As for women safety yes there are issue and need a lot of improvement there is no denying in that .But to change something in india you have to start from core of it that is politics and nobody want to go there unless you have too much money or guns . Then we question those goons ( it's same situation in every state ) In India what are the taboos which stop one from reporting? Source that majority women related crimes are done by muslims? It ruins and dishonours the family's reputation. Losing face in society - which is really devastating as per Indian society, where a woman's reputation is more important than her life. She must have done something to warrant it, she must be characterless so deserved it, she must be too independent so learnt a lesson. Apart from troll comments and judgement, the process to get justice is paved with many challenges like police making fun of the incident and defence lawyers digging her relationships to prove she is easy or characterless. Are they in cow poop? My dude, go read some local newspapers of non bjp states. You’ll find more or less similar incidents that don’t get national coverage. And the sad part is if the accused are in anyway related to ruling party they get saved. So your concern shouldn’t be if people want this model for nation, it should be how can you make govt & political parties do the right thing & take proper action to ensure safety of women, regardless of your political alignment. We must make it so that a family that seeks to protect its 'honour' by harming or silencing a victim of abuse has no honour in the true sense of the word. We must redefine honour as having the guts to stand up for your family and protect as well as not keep silent. Nothing honourable about not standing up for your sister, daughter or mother. Wishful thinking IG. Indian culture is far too regressive. We need reformation Yup it was There is the link You may not know this but in India 70 - 80 % of the rape cases culprit is either neighbor , relative, or someone who girls family already knows. ( which is one of the things what makes rapes in India different from countries like America and England and Europe ) After the crime families of both wants to avoid going to police saying it may destroy mens family if they are married ( his wife and kids won't have provider ) and incase for victim girl :- the girl will get \" ***damaged*** \" and it will hinder and her from getting married ( *meaning will have to give huge dowry , that is if anyone will be willing to marry her at all* ) We strive for death penalty but in reality people involved think it is too extreme for \" ***mistake*** \" the guy maid and it will damage the girl anyway so let's just all keep quiet, . This people convince the victim girls it will be just be more problems if she goes to Police ( *including her own family* sad but reality ) The only time it is big deal when someone from another cast or religion commits the crime, now only everyone wants justice not mainly for the girls sake but \" ***how dare someone from other cast or religion touched our ~~girl~~ property*** \" In cities situation is very much different , but don't forget 70% population in India still lives in rural area not urban. Go to any ruler town / village and try talking to this girls, they would rather marry poor guy who is in city than richest guy in village ( *they just wants to grt out of the village asap* ) And when they do leave the village and come to cities, well you already know how safe they are. BJP != HINDU But INC == Muslim Sad but true. People of cloth respect their religion more than their fellow people. Shi iiit....no wonder some politicians win elections in spite of doing a shitty job. I wonder if those masks will work as they must. They would simply say that you're cheating.🤔 People have been brainwashed to accept these crimes if it enables the Modi gang to be in power. Holy shit I didn't think that it would be this bad. They don't even leave the poor [goats](https://www.indiatoday.in/india/story/pregnant-goat-dies-after-8-men-gang-raped-it-in-haryana-1299168-2018-07-28). Like????? Have you heard of two magical terms, that make every data look irrelevant? \"Jumla\" and \"Bhakti\"? I am hearing good things about Yogi govt in UP. People who have seen the rule of SP, BSP & Congress are all praises for Yogi. I have this hopeful delusional belief that they will face the brutal reality of bjp themselves and start questioning themselves Unfortunately I don't think so. Just look at Germany during Hitler's time. Atlast a world war was needed to stop hitler🥲 Institutionalised insanity. It's progressing rapidly. Bro, why don't they just use their hand to do the deed? Like come on man, how desperate you have to be 😂 Rapes in the US are also more often someone the victim knows too But we are in a transition phase towards dictatorship I think there is a possibility that lots of people can come together and stop this transition Not just us and india it's whole world"
}