{
    "id": "1ca1hym",
    "title": "Women chops her thumb to protest against organized gangs making children consume weed, and using them to sell weed and commit other crimes, and against ppl grabbing land, names MLA, ex home minister Mekathoti Sucharita as person responsible. Incident of chopping happened at India Gate, Delhi",
    "url": "https://www.reddit.com/r/india/comments/1ca1hym/women_chops_her_thumb_to_protest_against/",
    "selftext": "Kopuri Lakshmi, president of Adarsh ​​Mahila Council claims she has evidence that a gang in Prattipadu constituency represented by former Home Minister Sucharita is developing criminal tendencies among young children by making them addicted to ganja, making them sell them and making them commit crimes.  When questioned, the people responsible for this are falsely accusing her and others of \"indecent things and blackmailing officers\".  In the 41st division of Guntur city, land grabs and signatures of government officials are being done by Sucharita's followers. Even though complaints were made to the SPs and Collectors, and orders were passed and cases were registers to take action against the perpetrators, no action was taken. She tried to meet PM, President and Chief Justice, and also submitted request letters/petitions to their offices, as all were apathetic, as a means of protest she chopped off her left thumb to bring notice to her protest.\n\n Sad state of affairs in India, where a woman compelled collectors and SPs to issue orders against organized criminal gangs involving children in crimes. However, despite her efforts, no action is being taken. In seeking support, she attempted to meet the Prime Minister, President, and Chief Justice (I understand that the Prime Minister and Chief Justice may not be available for meetings, but if the Prime Minister can meet many people for trivial matters, why not for this?). Unfortunately, she couldn't secure a meeting and thus submitted letters to their offices. Later, feeling out of help, she resorted to drastic measures, chopping off her left thumb to draw attention to her protest \n\nSource Link: [https://www.andhrajyothy.com/2024/andhra-pradesh/finger-chopping-protest-against-anarchy-in-ap-1243294.html](https://www.andhrajyothy.com/2024/andhra-pradesh/finger-chopping-protest-against-anarchy-in-ap-1243294.html)\n\nGoogle Translate and GPT are not doing accurate job in translating and are mistranslating the paragraphs in the article, You can try translating line by line. I guess you can understand the underlying context.",
    "flair": "Policy/Economy",
    "score": 139,
    "num_comments": 4,
    "created_utc": 1713759035.0,
    "convurl": "https://external-preview.redd.it/x5LmzuJYQ5v2H8vIismFJgdbdI3P0fDald0UYjyjge0.jpg?auto=webp&s=aabc0898c7a0b6342a9ad380142d12337fad08e6",
    "comments": [
        "Godspeed to that brave women.\n\nSad to see that people have to cut their thumbs off to just get their word out.",
        "dear leader has time to meet gamers but not this.."
    ],
    "cleaned_text": "women chops thumb protest organized gangs making children consume weed using sell weed commit crimes ppl grabbing land names mla ex home minister mekathoti sucharita person responsible incident chopping happened india gate delhi kopuri lakshmi president adarsh mahila council claims evidence gang prattipadu constituency represented former home minister sucharita developing criminal tendencies among young children making addicted ganja making sell making commit crimes questioned people responsible falsely accusing others indecent things blackmailing officers st division guntur city land grabs signatures government officials done sucharitas followers even though complaints made sps collectors orders passed cases registers take action perpetrators action taken tried meet pm president chief justice also submitted request letterspetitions offices apathetic means protest chopped left thumb bring notice protest sad state affairs india woman compelled collectors sps issue orders organized criminal gangs involving children crimes however despite efforts action taken seeking support attempted meet prime minister president chief justice understand prime minister chief justice may available meetings prime minister meet many people trivial matters unfortunately couldnt secure meeting thus submitted letters offices later feeling help resorted drastic measures chopping left thumb draw attention protest source link httpswwwandhrajyothycomandhrapradeshfingerchoppingprotestagainstanarchyinaphtmlhttpswwwandhrajyothycomandhrapradeshfingerchoppingprotestagainstanarchyinaphtml google translate gpt accurate job translating mistranslating paragraphs article try translating line line guess understand underlying context ",
    "cleaned_title": "women chops thumb protest organized gangs making children consume weed using sell weed commit crimes ppl grabbing land names mla ex home minister mekathoti sucharita person responsible incident chopping happened india gate delhi",
    "cleaned_selftext": "kopuri lakshmi president adarsh mahila council claims evidence gang prattipadu constituency represented former home minister sucharita developing criminal tendencies among young children making addicted ganja making sell making commit crimes questioned people responsible falsely accusing others indecent things blackmailing officers st division guntur city land grabs signatures government officials done sucharitas followers even though complaints made sps collectors orders passed cases registers take action perpetrators action taken tried meet pm president chief justice also submitted request letterspetitions offices apathetic means protest chopped left thumb bring notice protest sad state affairs india woman compelled collectors sps issue orders organized criminal gangs involving children crimes however despite efforts action taken seeking support attempted meet prime minister president chief justice understand prime minister chief justice may available meetings prime minister meet many people trivial matters unfortunately couldnt secure meeting thus submitted letters offices later feeling help resorted drastic measures chopping left thumb draw attention protest source link httpswwwandhrajyothycomandhrapradeshfingerchoppingprotestagainstanarchyinaphtmlhttpswwwandhrajyothycomandhrapradeshfingerchoppingprotestagainstanarchyinaphtml google translate gpt accurate job translating mistranslating paragraphs article try translating line line guess understand underlying context",
    "cleaned_comments": "godspeed brave women sad see people cut thumbs get word dear leader time meet gamers",
    "light_cleaned_title": "Women chops her thumb to protest against organized gangs making children consume weed, and using them to sell weed and commit other crimes, and against ppl grabbing land, names MLA, ex home minister Mekathoti Sucharita as person responsible. Incident of chopping happened at India Gate, Delhi",
    "light_cleaned_selftext": "Kopuri Lakshmi, president of Adarsh ​​Mahila Council claims she has evidence that a gang in Prattipadu constituency represented by former Home Minister Sucharita is developing criminal tendencies among young children by making them addicted to ganja, making them sell them and making them commit crimes. When questioned, the people responsible for this are falsely accusing her and others of \"indecent things and blackmailing officers\". In the 41st division of Guntur city, land grabs and signatures of government officials are being done by Sucharita's followers. Even though complaints were made to the SPs and Collectors, and orders were passed and cases were registers to take action against the perpetrators, no action was taken. She tried to meet PM, President and Chief Justice, and also submitted request letters/petitions to their offices, as all were apathetic, as a means of protest she chopped off her left thumb to bring notice to her protest. Sad state of affairs in India, where a woman compelled collectors and SPs to issue orders against organized criminal gangs involving children in crimes. However, despite her efforts, no action is being taken. In seeking support, she attempted to meet the Prime Minister, President, and Chief Justice (I understand that the Prime Minister and Chief Justice may not be available for meetings, but if the Prime Minister can meet many people for trivial matters, why not for this?). Unfortunately, she couldn't secure a meeting and thus submitted letters to their offices. Later, feeling out of help, she resorted to drastic measures, chopping off her left thumb to draw attention to her protest Source Link: [https://www.andhrajyothy.com/2024/andhra-pradesh/finger-chopping-protest-against-anarchy-in-ap-1243294.html](https://www.andhrajyothy.com/2024/andhra-pradesh/finger-chopping-protest-against-anarchy-in-ap-1243294.html) Google Translate and GPT are not doing accurate job in translating and are mistranslating the paragraphs in the article, You can try translating line by line. I guess you can understand the underlying context.",
    "light_cleaned_comments": "Godspeed to that brave women. Sad to see that people have to cut their thumbs off to just get their word out. dear leader has time to meet gamers but not this.."
}