{
    "id": "xsihnx",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/xsihnx/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 16,
    "num_comments": 7,
    "created_utc": 1664587810,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watched PS-1 and I liked it. It tried to stick to the book and was low on mass hero build ups which is what I expected. Casting was really good. Hardcore masala movie fans should stay away though.",
        "Vikram Vedha was a good watch.. it felt refreshing yet nostalgic.  Hrithik's Vedha and charm was what made the movie. Sprinkled with masala but not over the top. This coming from someone that doesn't like masala flicks",
        "I don't know how much people go out of their way to watch movies not available on ott in India (sail the high seas!) but I recently watched Fall 2022 ([https://www.imdb.com/title/tt15325794/?ref\\_=nv\\_sr\\_srsg\\_0](https://www.imdb.com/title/tt15325794/?ref_=nv_sr_srsg_0))\n\nPlot: Best friends Becky and Hunter find themselves at the top of a 2,000-foot radio tower.\n\nI am a horror fan and I love heavy gore movies, but watching this movie made my intestines turn like no other movie. It's different, it will take you on an adventure, it will take you with the characters on top of the 2000ft tower. I loved it.",
        "Thanks for the recommendation, downloading. Will watch tomorrow.",
        "Recently re-watched Adam Curtis's Bitter Lake. One of the best political/historical documentaries I've ever seen.\n\nWould recommend to everyone regardless of political leaning. Even if you find yourself disagreeing with the director's take, you still get a fairly unbiased look into the events that led to the current situation in Afghanistan/ME. \n\nIf you do end up enjoying the doc, don't hesitate to go down the Adam Curtis rabbit hole. Hypernormalisation, The Power of Nightmares, Can't Get you Out of my Head are all worth a watch \n\nRelevant links:-\n\nBitter Lake:\n\nhttps://watchdocumentaries.com/bitter-lake/\n\nHyperNormalisation:\n\nhttps://watchdocumentaries.com/hypernormalisation/\n\nThe Power of Nightmares:\n\nhttps://watchdocumentaries.com/the-power-of-nightmares/\n\nCan't Get You Out of My Head:\n\nhttps://watchdocumentaries.com/cant-get-you-out-of-my-head/",
        "Let me know if you liked it mate",
        "Have watched all of his films. Kinda expanded my understanding of the world."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "watched ps liked tried stick book low mass hero build ups expected casting really good hardcore masala movie fans stay away though vikram vedha good watch felt refreshing yet nostalgic hrithiks vedha charm made movie sprinkled masala top coming someone doesnt like masala flicks dont know much people go way watch movies available ott india sail high seas recently watched fall httpswwwimdbcomtitlettrefnvsrsrsghttpswwwimdbcomtitlettrefnvsrsrsg plot best friends becky hunter find top foot radio tower horror fan love heavy gore movies watching movie made intestines turn like movie different take adventure take characters top ft tower loved thanks recommendation downloading watch tomorrow recently rewatched adam curtiss bitter lake one best politicalhistorical documentaries ive ever seen would recommend everyone regardless political leaning even find disagreeing directors take still get fairly unbiased look events led current situation afghanistanme end enjoying doc dont hesitate go adam curtis rabbit hole hypernormalisation power nightmares cant get head worth watch relevant links bitter lake hypernormalisation power nightmares cant get head let know liked mate watched films kinda expanded understanding world",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Watched PS-1 and I liked it. It tried to stick to the book and was low on mass hero build ups which is what I expected. Casting was really good. Hardcore masala movie fans should stay away though. Vikram Vedha was a good watch.. it felt refreshing yet nostalgic. Hrithik's Vedha and charm was what made the movie. Sprinkled with masala but not over the top. This coming from someone that doesn't like masala flicks I don't know how much people go out of their way to watch movies not available on ott in India (sail the high seas!) but I recently watched Fall 2022 ([https://www.imdb.com/title/tt15325794/?ref\\_=nv\\_sr\\_srsg\\_0](https://www.imdb.com/title/tt15325794/?ref_=nv_sr_srsg_0)) Plot: Best friends Becky and Hunter find themselves at the top of a 2,000-foot radio tower. I am a horror fan and I love heavy gore movies, but watching this movie made my intestines turn like no other movie. It's different, it will take you on an adventure, it will take you with the characters on top of the 2000ft tower. I loved it. Thanks for the recommendation, downloading. Will watch tomorrow. Recently re-watched Adam Curtis's Bitter Lake. One of the best political/historical documentaries I've ever seen. Would recommend to everyone regardless of political leaning. Even if you find yourself disagreeing with the director's take, you still get a fairly unbiased look into the events that led to the current situation in Afghanistan/ME. If you do end up enjoying the doc, don't hesitate to go down the Adam Curtis rabbit hole. Hypernormalisation, The Power of Nightmares, Can't Get you Out of my Head are all worth a watch Relevant links:- Bitter Lake: HyperNormalisation: The Power of Nightmares: Can't Get You Out of My Head: Let me know if you liked it mate Have watched all of his films. Kinda expanded my understanding of the world."
}