{
    "id": "173uxbe",
    "title": "HachikoAnimalWelfareTrust",
    "url": "https://youtube.com/@ahanasamrinindore?feature=shared",
    "selftext": "I just came across a channel in youtube as to how one women is left in a very horrible state to live just because she is speaking against the atrocities of animal welfare board in Indore.\n\nThough i am from the southern part of india it is very disturbing to see how this woman has been subjected to abuse by the society as a whole for doing something like running a dog shelter.\n\nI wonder what all the NGOs are doing even HRC seems to be unaware of such incidents since the videos in the channel are very disturbing to see, this women seems to be fighting against such crooks about which she is posting videos about it past 3 years and her health is detoriating in very bad condition, one can see how depressed she looks from the videos. Just wish someone with power comes across this woman!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1696865947.0,
    "convurl": "https://external-preview.redd.it/V0XuvV3Q1IiiEIBUpHyT_xechzFbU98N1G0oOd_SL2M.jpg?auto=webp&s=b642ecc444b59ba5210d6120b966bc6c69fa08ea",
    "comments": [],
    "cleaned_text": "hachikoanimalwelfaretrust came across channel youtube one women left horrible state live speaking atrocities animal welfare board indore though southern part india disturbing see woman subjected abuse society whole something like running dog shelter wonder ngos even hrc seems unaware incidents since videos channel disturbing see women seems fighting crooks posting videos past years health detoriating bad condition one see depressed looks videos wish someone power comes across woman ",
    "cleaned_title": "hachikoanimalwelfaretrust",
    "cleaned_selftext": "came across channel youtube one women left horrible state live speaking atrocities animal welfare board indore though southern part india disturbing see woman subjected abuse society whole something like running dog shelter wonder ngos even hrc seems unaware incidents since videos channel disturbing see women seems fighting crooks posting videos past years health detoriating bad condition one see depressed looks videos wish someone power comes across woman",
    "cleaned_comments": "",
    "light_cleaned_title": "HachikoAnimalWelfareTrust",
    "light_cleaned_selftext": "I just came across a channel in youtube as to how one women is left in a very horrible state to live just because she is speaking against the atrocities of animal welfare board in Indore. Though i am from the southern part of india it is very disturbing to see how this woman has been subjected to abuse by the society as a whole for doing something like running a dog shelter. I wonder what all the NGOs are doing even HRC seems to be unaware of such incidents since the videos in the channel are very disturbing to see, this women seems to be fighting against such crooks about which she is posting videos about it past 3 years and her health is detoriating in very bad condition, one can see how depressed she looks from the videos. Just wish someone with power comes across this woman!",
    "light_cleaned_comments": ""
}