{
    "id": "14xfbjd",
    "title": "Corporate rivalry turned into full blown attack",
    "url": "https://www.reddit.com/r/india/comments/14xfbjd/corporate_rivalry_turned_into_full_blown_attack/",
    "selftext": "CEO and MD murdered in broad daylight in Bengaluru. \n\nVictims Phanindra Subramanya and Vinu Kumar were the MD and CEO of Aeronics Internet Company, respectively. They were stabbed to death on Tuesday, July 11. \n\nThe Bengaluru Police have arrested all three accused in the murder of the Managing Director (MD) and Chief Executive Officer (CEO) of a tech company in the city. The accused have been identified as Shabarish, Vinay Reddy and Santosh.\n\n&#x200B;\n\nhttps://preview.redd.it/4nwl8yo72hbb1.png?width=965&format=png&auto=webp&s=00c2dc6222d81de54a819df3587f9f170aa076a3",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689140602.0,
    "convurl": "https://b.thumbs.redditmedia.com/nJFARs9Db3uQb7sZc9VMM6M9nYHYQJy8VeOq1G4nanQ.jpg",
    "comments": [],
    "cleaned_text": "corporate rivalry turned full blown attack ceo md murdered broad daylight bengaluru victims phanindra subramanya vinu kumar md ceo aeronics internet company respectively stabbed death tuesday july bengaluru police arrested three accused murder managing director md chief executive officer ceo tech company city accused identified shabarish vinay reddy santosh xb ",
    "cleaned_title": "corporate rivalry turned full blown attack",
    "cleaned_selftext": "ceo md murdered broad daylight bengaluru victims phanindra subramanya vinu kumar md ceo aeronics internet company respectively stabbed death tuesday july bengaluru police arrested three accused murder managing director md chief executive officer ceo tech company city accused identified shabarish vinay reddy santosh xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Corporate rivalry turned into full blown attack",
    "light_cleaned_selftext": "CEO and MD murdered in broad daylight in Bengaluru. Victims Phanindra Subramanya and Vinu Kumar were the MD and CEO of Aeronics Internet Company, respectively. They were stabbed to death on Tuesday, July 11. The Bengaluru Police have arrested all three accused in the murder of the Managing Director (MD) and Chief Executive Officer (CEO) of a tech company in the city. The accused have been identified as Shabarish, Vinay Reddy and Santosh. &#x200B;",
    "light_cleaned_comments": ""
}