{
    "id": "18wg7ex",
    "title": "TINA is a Deliberate Propaganda to Hide the Gross Incompetence of the Modi Government.",
    "url": "https://www.reddit.com/r/india/comments/18wg7ex/tina_is_a_deliberate_propaganda_to_hide_the_gross/",
    "selftext": "**तू इनकी झूठी बात पर ना और ऐतबार कर**  \n**के तुझको साँस-साँस का सही हिसाब चाहिए**  \n**घिरे हैं हम सवाल से हमें जवाब चाहिए**  \n**जवाब-दर-सवाल है के इन्क़लाब चाहिए**\n\nOne of the most distinguishable feature of 10 years of Modi Government has been the gross incompetence shown by the regime in every aspect of the administration.\n\nIn 2016, Modi announced the **demonetization of banknotes, at a four-hour notice**. The entire nation was thrown into panic. Over 100 people died standing in queues. Everything — from small businesses to everyday life — was thrown into chaos and suffering, while Modi was joking about people's conditions. The Government was so unprepared for the move, that new notes hadn't even been printed yet, and couldn't be dispensed by the ATM. Modi Government kept changing the goals of the demonetization, from action against black money, to curbing terrorism, to bringing cashless economy. Yet, it was clear that the only result of the policy was a massive hit to the national economy and destruction of the informal sector.\n\nIn 2017, the Modi Government introduced **GST, riddled with flaws**, its rules were amended dozens of times within a month. Against the objective of uniform taxation, GST introduced five different tax rates, apart from cess. GST dealt a massive blow to federalism.\n\nBy 2018, the effects of demonetization and GST visible, and the economic growth slowed down. Meanwhile, the unemployment was rising. Instead of addressing the issue, Modi asked whether selling pakoda in front of news studios and earning ₹200 a day would not count as employment. In 2019, a leaked NSSO report revealed that **unemployment was at a 45-year-high**. The report was suppressed, and further NSSO surveys were stopped.\n\nIn 2019, the Pulwama attack happened, where 40 CRPF personnel were killed. Yet, Modi who was shooting Man vs Wild at the time of the attack, continued with his program for hours. Instead of accepting responsibility, he began exploiting the attack to seek votes in the name of national security. It was later revealed that the **Modi Government had received 11 intelligence reports of a possible attack before Pulwama, and refused to provide security to the CRPF despite repeated requests.**\n\nAfter the 2019 election, the Modi Government went into a hyperdrive with its communal agenda. The Government introduced Citizenship Amendment Act, a provision to grant the Citizenship of India, to non-Muslim illegal immigrants from Bangladesh, Pakistan, and Afghanistan who entered India before 2014. Which meant, for the first time, the Citizenship of India has been linked to religious identity. Massive protests erupted across India. Meanwhile, the **Government attacked the universities of JMI, JNU and DU** to quell the protests. Peaceful protesters were arrested, while **BJP leaders like Kapil Mishra, Anurag Thakur, and Parvesh Verma, openly gave hate speeches**.\n\nIn 2020, the COVID pandemic struck, and the **Government imposed a nationwide lockdown at a four-hour notice**. Millions of workers went unemployed. Migrant workers were thrown into an immense suffering, many of them choosing to walk thousands of kilometers rather than suffering from starvation. Thousands of people were killed. With loss of jobs and incomes, millions fell faced hunger and starvation.\n\nIn 2020, during the lockdown, the Government conspired with the corporations to **weaken India's environmental laws**, and to allow corporate takeover of dense forests. The Government also conspired to **allow corporate takeover of agriculture**, and force the farmers to become bonded labourers. The farmers fought a historic battle, and after the sacrifice of 800 farmers, the Government was forced to take back the black laws.\n\nIn 2020, in the Galwan valley conflict **20 army jawans laid down their lives defending our borders**. Yet, to save his face, Modi claimed that China did not enter Indian territories. The statement was a major setback to India, and contradicted India Army's stand. Reports revealed that India had lost access to 26 out of 65 Patrolling Points in eastern Ladakh, after China occupied over 1000 sq km of Indian territories. China constructed roads and villages inside Indian territories in Arunachal Pradesh, while Modi Government kept awarding massive contracts to Chinese firms.\n\nA few months later, the second wave of COVID struck. Despite warnings, Modi government let India sleepwalk into its largest humanitarian crisis. **47 lakh people died, due to Government's incompetence**. People were suffocating without oxygen, and dying without hospital beds. There was not enough space in crematoriums, and **rivers were overflowing with dead bodies**.\n\nMeanwhile, the Government kept endorsing and protecting hate-mongers. Open call for genocide and rape were made in public rallies. In December 2021, at a **Dharma Sansad organized in Haridwar, speakers gave call for genocide, assassinations, and civil war.**\n\n2022 saw **massive protests against unemployment**. The entire North India erupted in protest after the Government brought the Agnipath scheme. Large-scale riots and arson happened in Bihar, UP and other states. The annoyed youths targeted BJP offices and set them on fire.\n\n2023 witnessed a **massive ethnic conflicts and civil war in Manipur**. Despite having a “double engine” government, the Modi has not even visited the state. He has refused to meet the delegation from Manipur, and has refused to remove the Chief Minister. The state has been burning for seven months.\n\nIn December 2023, four youths protesting against unemployment breached the Parliament. Modi refused to address the house on this security incident. Meanwhile, over **140 MPs were suspended from the Parliament**, and crucial laws, threatening civil liberties, were bulldozed without debates. Earlier, in August, the Government passed laws to allow digital surveillance.\n\nNarendra Modi is the most incompetent and useless Prime Minister in the history of India, which is ironic considering how much his propaganda media tries to portray him as a great leader and administrator. Not once does this person ever work, or do what he was elected to do. All his policies and schemes are thoughtless experiments, with no regard for common people.\n\nWhy then, one might ask, is there a constant narrative to portray him as a competent administrator, while claiming that the opposition is incompetent. This is the power of propaganda.\n\nEvery opposition leader is more competent than Modi. TINA (There Is No Alternative) is a deliberate propaganda created ahead of the General Election. People of India will not fall for it. There are over 1 billion alternatives to Modi.\n\n[मोदी के सामने कौन? | Election 2024](https://www.youtube.com/shorts/Q_VZTyBrKC8)\n\n[The 2024 General Election is a DO OR DIE moment for Indian Democracy : IndianSocialists](https://np.reddit.com/r/IndianSocialists/comments/18tijp0/the_2024_general_election_is_a_do_or_die_moment/)\n\n[Building the largest political mobilization in Independent India. : IndianSocialists](https://np.reddit.com/r/IndianSocialists/comments/18vvqaw/building_the_largest_political_mobilization_in/)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1704168718.0,
    "convurl": "https://external-preview.redd.it/fMXFvPmvTj34de5Ar-zl35Ob5SG9Y7zPZ9qn34EbL0I.jpg?auto=webp&s=5b99e2e7a715d686460177eee1b2d26bff49739f",
    "comments": [
        "Yikes! \n\nOk, name one opposition leader you would want to see as PM and list their achievements.",
        "The election is fought over the performance of the ruling party. It is clear Modi is undeserving of any post let alone the leader of the nation. He will answer for his crimes.",
        "The election is also fought on the promises and track record of the opposition.  The fact that you can't even name a single opposition leader you would like to see as PM is telling.",
        "I have written it clearly in my post. Every single opposition leader is more competent than Modi. Mallikarjun Kharge, MK Stalin, Sitaram Yechury, D Raja, Arvind Kejriwal, all are hundred times more competent than Modi.",
        "You have not mentioned a single one of these guys in your post. \n\nOK, now that you have named them. Which one would you vote for? Kharge or Yechury or Raja or Stalin or Kejriwal? Which one is better? What are their achievements?",
        "Do you think it’s possible for take to lose in 2024. It’s almost too easy for them to win, they just need to bring up some religious issue or the other and people will vote for that :/",
        "See, I have been saying this over and over. The price of BJP winning the 2024 election will be too much for India and her citizens. BJP has already forcibly captured the Parliament. They have imprisoned dozens of activists, journalists, academicians. All the institutions have been compromised. They have legitimized violence against women. They have corrupted the education system, to replace scientific facts with irrational ideas.\n\nIf Modi wins, most of the activists and independent journalists will be put in jail. All the facts and data will be suppressed.\n\nI will say it again, without any exaggeration, this is Do or Die for Indian Democracy. Trust me. We cannot afford to lose.\n\nYes, it is a difficult battle. But we have to win. And we can win. I just urge everyone to not accept the defeat before the battle. And please do your part, whatever you can.",
        "100 times?? Are you just plain dumb or what??\n\nMallikarjun Kharge: Lost his seat in last Lok Sabha Elections. If elected PM, will be a proper rubber stamp as Maunmohan. Guy has zero charisma, no one will follow him, zero connect to ground, do you seriously think he can handle the complex situation India is in right now?\n\nSitaram Yechury: You gotta be cleaning the bottom of the barrel if you are naming him with his party's ideology which made Bengal go back 10 years at least in its potential. CPI(M) salutes Mao on Twitter FYI, a sign of what is to come. Also take a look at their vote share in India.\n\nD Raja:  Again seriously, please take a look at their vote share.\n\nArvind Kejriwal: Can say, a bit competent, but the guy needs to get out of this witch hunt (hopefully it is a witch hunt only) involving him and his ministers first. He also should stop freebies culture like free electricity etc. which is damaging to fiscal health of the country. But him and his party has to go a long way to be more popular across country to give a sense of strong leader.\n\nAnyone else?",
        "Seriously? All you've said against these people is lack of charisma. That is in no way a metric of someone's competency. I'll admit, it is the one thing Gobiji has more of than the others mentioned, and we all know what happens to a country who based their leader on how charismatic they are, not how competent they are.",
        "Haha. Chaddis calling a great leader as Dr Manmohan Singh as Maunmohan. \n\n[Was called silent PM, but I wasn't afraid of talking to press: Manmohan Singh](https://www.indiatoday.in/india/story/manmohan-singh-silent-pm-narendra-modi-press-conference-1412551-2018-12-19)",
        "Everything you say is true, and depressing 🤦‍♀️",
        "List the achievements then!! Saying Gobhiji is not a good answer to this. \n\nCPI(M) along with CPI were in power in West Bengal for consecutive terms. how's West Bengal faring?? Best in the country? They are also aligned with China's ideology . You folks keeping saying \"Modi sold India to China\", these fuckers will write it in their manifesto. \n\nArvind Kejriwal is in power in Punjab, a good time to see what they do. There are many problems with the state and if his party is able to solve it, definitely something to push for the centre.\n\nI'm asking you about the competency of all the folks whom you mentioned. Please list them and let's have a healthy discussion",
        "Haha. So easy to call another person Chaddi. Now I'll call you a chamcha and we will start abusing each other, discussion down the drain.\n\nI just have one question - do you not think that he was a rubber stamp PM?",
        "No. He was a leader, Modi is a megalomaniac.",
        "LMFAOOO. Hilarious post, the government deserves criticism for sure, but the fact that Congress was a major power for most part after the independence and didn't do much. As for the defence policies let's not talk about those 5 jawans who were beheaded by terrorists and the Manmohan Singh government did nothing. It didn't do anything after the 26/11 attacks either. More roads have been developed in the last 10 years than the 67 years before that. India's image at the global front has improved a lot, CONgress just had very little interest in strengthening ties with more countries. \nAlso to blame your incompetence on ruling party is just delusion lmao. Not being able to field a competent person is also Modi's fault apparently.",
        "Don't worry. Have faith. We have defeated fascists before. We are ready for this challenge too. He will not win.\n\n[Building the largest political mobilization in Independent India. : IndianSocialists](https://np.reddit.com/r/IndianSocialists/comments/18vvqaw/building_the_largest_political_mobilization_in/)",
        "Thanks for speaking out on this and providing sources. I hope people can see through all the smoke one day.",
        "I'm not going to take the word of media like you which substantiates your thinking. Just pasting it here, this may or may not be politically motivated. https://www.newindianexpress.com/nation/2017/jan/08/straight-from-pmo-files-how-sonia-ruled-as-proxy-pm-1557323.html\n\nBTW Did I talk about Modi in my entire discussion? The parent thread talked about alternatives, which you provided, I refuted, you called me Chaddi and then started lapping on Manmohan Singh. If you don't have anything to add to the discussion, please start a new thread and post as much hate as you have for Modi there.",
        "OP talks about propaganda and then proceeds to do the same..\n\nGST has been a tremendous success as seen by the tax collections and compliances improving..refer RBI studies\n\nUPI a massive success \n\nDBT plugging leakages, another success\n\nImproved financial condition of PSUs..improved road infrastructure connectivity..faster execution of projects\n\nIndia seen as China+1, a global superpower in the making after losing out in the manufacturing bus since independence \n\nOne of the best handling of Covid among major countries..ensured poor ppl aren’t going hungry through free food grains schemes, but didn’t indulge in destroying the country’s balance sheet like some did..fast tracked vaccination through digital adoption\n\nStrengthened the financial sector..NPA at decade lows\n\nStrengthened indigenous defence manufacturing..look at the annual report of defence companies \n\nAdded so many hospitals and medical colleges..steady improvement in doctor/population..ABDM ftw \n\nStrong facilitator of transition from dirty coal energy to clean green energy..securing energy security for future..tremendous achievement \n\nAnd finally when all countries globally are facing slowdown, India remains the fastest growing major economy..refer IMF\n\n\n\nI will say Modi has been the most competent PM in the last 20 years!",
        "Yeah but as OP is pointing out \"TINA\" is a coping mechanism for middle class \"educated\" people who are ashamed to admit they are voting on religious grounds like the extremist mullahs in Iran and Pakistan.",
        "Practically any of the opposition leaders is better than the current incompetent and corrupt buffoon we have as PM.",
        "National Advisory Council was an institution built to draft the opinion and expertise of leaders, academicians, and experts into policy making. NAC led to the drafting of RTI act, Right to Education Act, Right to Food Act, and Right to Work Act.\n\nThroughout my post, I have highlighted how Modi Government took senseless decisions, many without consultation, which led to hardships and tragedies.\n\nWe have two model of leadership, one of Dr Manmohan Singh, who sought the opinion and advice of experts, and one of Modi, who thinks he is supreme intelligence. Our choice is clear.",
        "Care to list their positive points? Please identify ONE leader you would vote for, what are the things they stand for, and what they are going to achieve if elected to the centre.",
        "> The election is also fought on the promises and track record of the opposition.\n\nYou need to read more Political literature (like works by Allan Lichtman) and history for this statement is simply false.\n\n*In a \"Real\" (which India is) Electoral Democracy, the elections are Referrundum on Incumbents*, whereby the Only condition for Opposition is to simply Exist. And they more than exist in India (Vote Share and even Seat Share is testament to this Objective Fact).\n\nIF Opposition has more money, is charismatic, etc etc. That is a Bonus, it is NOT a pre-requisite or fundamental driver of Political structure in such a Real Electoral Democracy. \n\nThis is how 1977 transition happened, i.e. the only condition for Opposition was to Simply Exist. There was no incentive on them being more competent than Incumbent, because we history showed withing 2-3 years, who was how competent.\n\nSo no, it doesn't matter who the Opposition Leader even is as long as it exists and it does. It's on the Ballot Box clearly visible.",
        "Spoken like someone who doesn't have an ideology to support, just doesn't like the current leadership.\n\n> it doesn't matter who the Opposition Leader even is as long as it exists and it does\n\nIt absolutely matters. The last one year with I.N.D.I.A. has shown that our opposition leaders all have simply too much individual ambitions and cannot coexist to fight the current leadership. Even if they stop bickering till the elections, somehow miraculously agree on a seat sharing formula, and even more miraculously manage to restrict BJP (not NDA, BJP) to less than complete majority, what do you think will happen? These guys will never agree on a consensus leader, max we will have a 16 day govt ala Vajpayee in 1996, and we will have another round of elections. Worst, these guys will eat into each others' vote share and BJP will achieve an even bigger supermajority.",
        "After 2024, they will change the constitution. They have been sending feelers through bibek debroys articles. There are no doubts in my mind about this. We might see the Chinese style of the one party rule. India cozying up to Russia defying is an ominous sign.",
        "The harsh reality is that all of this is and will be forgotten. The media machine works nonstop blowing the man. \n\nDuring the migrant worker and Covid crises, there was hope that this would wake people up. But that didn't happen at all.\n\nAnd now BJP will win again by a landslide because of the Mandir.\n\nIt's cruel to say this but if the ones who suffered due to  Covid, migrant crisis, unemployment, oppression still go and vote for him in 2024, they deserve all this misery that has befallen over them and will do in the future. \n\nWe are writing our own end.",
        "Yup, Rahul Gandhi is a wonderful leader, much more competent. There is no reason he should not become our next PM. He will take us to new heights and our GDP will rival China. Just see his accomplishments until now. Or take Nitish for example, who has made Bihar into the most progressive and developed state. I'm sure OP with his excellent research skills can point out the fantastic accomplishments of these stalwart leaders. I would have done it myself but don't have so much time. After Nyay Yatra, which is a brilliant idea by the way, to make Rahul Gandhi's face top of mind as elections get closer, I'm pretty sure the alliance bloc will get 300+ seats. It is also good for the market, as it will fall temporarily and give a great buying opportunity, before climbing back up to the current levels towards December.",
        "I haven't voted for BJP ever. I've been voting for 22 years now. But this time I'll vote for them because of the opposition's vocal pro-reservation and anti-business policies.",
        "What do we do then?\n\nVote but what else?",
        "So the BJP introducing 10% reservation for EWS or Modi's masterstrokes for business like demonetization or banning Chinese apps were great for business in your opinion?",
        "We will have a democracy still, that's better than what this government will do.",
        "Ask any local businessman who they would rather vote for. Even better, look at the market indices and how they react when BJP has won in recent times vis-a-vis when they have lost.",
        "I'm sorry, but what is TINA?",
        "There is a lot you can do. You can contribute in any way you are able to, write, speak, sing, spread awareness, knock on the door, distribute pamphlets, donate to organizations. Do it part-time or full-time. For the next six months, do whatever you can, and more. So, years later, you'd proudly say, “I did my part.”\n\n[79 Years Old Retired Professor Roop Rekha Verma Distributing Pamphlets To Spread Awareness - YouTube](https://www.youtube.com/watch?v=_wpFlYGSrfE)\n\n[With pamphlets, on public transport, a retired IIT professor campaigns in MP for ‘right candidates’ - YouTube](https://www.youtube.com/watch?v=ulSghtnLscg&embeds_referring_origin=https%3A%2F%2Fwww.newslaundry.com&source_ve_path=MjM4NTE)\n\nApart from individual work, you can join any organisation. Civil Society Organisations will launch a nationwide campaign in coming weeks. You can join that. You can also help in countering the BJP propaganda, which is intense these days.",
        "I'm not surprised that local businessmen are big fans of the one PM who will put profit over people every time. But you didn't answer my question. \n\nYou're just proving my point. Like most BJP voters you are using obscure arguments to defend voting for them. Whereas the one area they are clearly distinct from the opposition in is their anti poor, anti minority stance.",
        "There Is No Alternative. It's a narrative that there is no alternative to Modi.",
        "How is Modi not a pro-reservation and an anti-business? \n\nHis policies suggest otherwise. He implemented 10% EWS which is wrong, bc how can one be against reservation for all but not against EWS. Second, Modi brought back back the horrors of license raj recently, still there are 36 regulators which tightening control over economy. Private investment is bottom but still he's pro-business, dont know how?",
        "Modi came in 2014 in the name of economy but did everything instead of working for economy. There's so much taxes that one is crushed, there's tax on tax.",
        "Dude literally anyone's better, India will grow regardless. Having narcissistic snowflakes on top effects induces insecurities in every citizen. \n\nAny politician is ok if they follow their duties, which they are not and people sadly don't care if they do. A change would be good for reflection.",
        "It's so scary how easily people forgot COVID. Also, I was at a medical college at that time and I have seen with my own eyes how many COVID deaths were signed off as  some other diagnosis leading to death. Just to show lower numbers on paper. Would it have been better with a different government? I really don't know. Maybe not. But does it mean that we won't hold the current government responsible?? Why do we keep validating these things? Why do we keep worshipping these people? Why are we not questioning them more? Why are we forgetting that they are there to serve us and not the other way around???\n\nOur health care system is suffering. AYUSH quacks are being given more and more rights now instead of increasing the number of government medical colleges and seats. \n\nWho will I vote for? Not the ruling party. They have disappointed me in every sphere of my life here in India. My education, my work, my transport, my safety.  \n\nMaybe they have benefited people other than me, that's respectful, and they can vote for them again.",
        "What was your question? \n\n10% reservations for EWS? I'm morally ok with it compared to reservations for SCs, STs, and OBCs\n\nRegarding Demonetization? Yes, it did not have as much of an impact as the govt thought it would. Big whoop. So what? Kudos to them for at least trying.\n\nBanning Chinese apps? Are you really coming here promoting Chinese apps? Seriously?",
        "> doesn't have an ideology to support\n\nThank you. I take that as a Compliment. To not have fundamentalist Dogma guide me, regardless of the content of whatever it may be.\n\n\n> It absolutely matters\n\nI trust actual history, reality of the world and academic literature more than your subjective trite. \n\n> max we will have a 16 day govt ala Vajpayee in 1996\n\ni.e. Proves my point of how \"REAL\" Electoral Systems work.\n\nPeople Vote on the Incumbent.  \nAnd if they vote someone back in after 16 days of Incumbency that TOO was because of what they saw happened to/with the Incumebt.\n\nCoalition Govt is real thing, it happens all over the world and for current historic era of India it \"May\" (this is non-Objective part of my comment) even be better, even with same current Incumbant, in relative context to how they've gone about so far.\n\nOpposition is IRRELVANT, outside of the context of their just existing. And it exists in India. Period.",
        "> He implemented 10% EWS which is wrong, bc how can one be against reservation for all but not against EWS.\n\nSimple, I've seen too many rich folks exploit reservations. I had a classmate who was an Sikh, whose father was the chief of Delhi's fire department, who used to live in an apartment overlooking the swimming pool of Hyatt, who used to drive a car to college in the days where very few college students had cars. And he was an ST. I have seen numerous stories like these.\n\nEWS if implemented correctly is morally correct. Caste based politics is not. I don't understand how you can defend caste based reservations.\n\n> Second, Modi brought back back the horrors of license raj recently, still there are 36 regulators which tightening control over economy.\n\nProof? How does that compare to the number of regulators 10 years back?\n\n> Private investment is bottom\n\nSource?",
        "So basically you are ok with reservation and anti business stuff BJP did but will vote for them for the first time ever because of opposition may do the same. \n\nJust admit you want a Hindu Pakistan and save yourself the effort of these mental gymnastics",
        "What? I'M OK with reservations? Isn't it the OPPOSITION which is clamouring for a Caste Census? Isn't it the opposition parties which are going on and on about increasing ST, SC, and OBC reservations?\n\nJust admit it that you don't know an iota bout what's going on in the country and just want to be a contrarian.",
        "Dude you are so thick, the other guy explained his point so well, but you are high on some really nice stuff.",
        "Again friend. Its perfectly legal to vote out of hatred.  You are not helping yourself by contradicting yourself again and again instead of just admitting to it.",
        "Modi is anti-business. He destroyed all the small businesses. Large businesses were forcibly acquired by Adani, after being persecuted by Government's agencies. \n\nOnly a few crony capitalists enjoy tax cuts and loan waivers of 14 lakh crore.\n\nEven millionaires are fleeing India.",
        "I'm sorry I do not qualify as intelligent for the average sham Sharma fan.",
        "Yes this and then modi is practically everywhere like ruling the conscious and sub-concious of the illiterate dumb folks of India, heck they even installed his life size portraits in colleges that too by UGC guidelines so that youths can take selfies with him and then share on socials ! What thugery is this..\n\nI hope dogs take piss on those portraits and then that will be the picture worth sharing !",
        "If there were no demonisation it would be impossible to see this humongous digital growth\nNow the govt can track all of our transactions online so the income tax filing may increase applying big data technology \nreservation systems should be only based on individual income so don’t understand why gentlemen is against EWS\nUpa turned India into dumping ground for China and asean.\n\nBanning cheeeni companies is essential for local\nIn-house development \n\nWhy raga is not choosing arunqchal to start his Bharat nyay yatra( these people can’t do a tiny thing against chin)",
        "It seems you are living in separate universe",
        "> EWS if implemented correctly is morally correct\n\nThere's no justification whether moral or academic to any reservations and I'm not defending caste based as well. Reservation is not even affirmative actions like the west practices, here you're determining equality of outcome instead of opportunities.",
        ">  I'm not defending caste based as well.\n\nThen how are you defending the opposition?",
        "TINA must be countered with DITA (Democracy is the alternative).",
        "the disadvantaged, the lazy, the incompetent and the entitled view this govt as something that needs to be perfect under the closest scrutiny and expect that a misrule of 75 years with well oiled corrupt and lethargic nexus system would just magically perform without flaws. they forgot that only the law makers and governance is what this new part is all about and they need to work through and with filth thats there in most of the people that do not want this govt because they are used to the benefits that camee with the older regimeand ate scared their old way of living is at threat.",
        "i wrote in opposition to modi and not in support of opposition. Opposition is as bad as BJP in terms of policies and none of them go for long term solution instead of short term lollipop.",
        "Then what's the use of writing against Modi? If all of them are as bad as the BJP, why even get up to vote?",
        "Modi fights a presidential type election and thats why a TINA comes in. What you're saying is right in terms of policies, but the way BJP fights the elections- Modi v/s Who makes it a presidential type with no candidate opposing him similar to Indira.",
        "Why is Modi unable to speak China's name, even after they captured our territory. Why is Jaishankar saying that India cannot stand up against China? Why did they demolish the memorial of Major Shaitan Singh, who fought till the last man and the last bullet against Chinese Army?\n\nModi is a Chinese agent sent by Xi Jinping to destroy India from within.",
        "> Narendra Modi is the most incompetent and useless Prime Minister in the history of India\n\nThis alone puts your credibility in the ground. Electric connectivity, infra, cylinders, toilets, trains, allowing private companies in defense, selling Air India, making petrol a revenue generating stream, 370, Mandir. He's not gonna have three terms as PM (with the first simple majority since the 80s) for nothing.",
        "All true. But Indian vote for personality. Not policy.\n\nFailure after failure will not deter modi voters",
        "Forgotten about [\"Cloud hain, benefit hoga\"](https://www.youtube.com/watch?v=I1ewyQ_Ceqg) disasterstroke already?  \nAn important strategic decision could have been jeopardized by the raw wisdom of our know-it-all versatile genius.  \nThis guy has our nation's nuclear codes!",
        ">Just see his accomplishments until now.\n\nHe, at the very least, didn't get people killed in massive riots and genocides. I count that as an absolute win. But then again, I value human life so maybe I'm just behind the curve.",
        "The fact that OP thinks Sitaram Yechury would be a better PM than Modi destroys all credibility from this post.",
        "For majority of voter \" but mandir to ban Raha hai na \" election were never won on economic alone mostly won on emotional issues .",
        "You forgot the /s",
        "That’s nice and all but this circular logic is not going to work on the ground. They have been trying it for 10 years and nothing is working. Kejriwal won a landslide in Delhi not because he came and said “I haven’t done anything so far so you might as well vote for me.” He had a clear vision, good image, had good credentials and showed a PROMISE of better governance. What happened after that is another story, but that is the ONLY way anyone has a shot at displacing the current party. All this “modi bad we are best we are clean not corrupt” has not worked for 10 years and keeping on doing the same thing will not work, at least in 2024. By 2029 when things have gone to some kind of extreme, it might rebalance and people will vote in some other party. Right now just like sensex, the rally is continuing without a stop and no one knows why.",
        "Yup , India is on the path of becoming a Super Power. Thats the reason so many people are leaving India via the \"Dunki\" route to spread this message all over the world....",
        "I am curious to know what good this government has done in the past 10 years",
        "This is an outstanding write up.\n\nWay above 'reddit paygrade' I must say.",
        "Infrastructure, especially roads-National Highways, expressways which we badly needed",
        ">That’s nice and all but this circular logic\n\nWhat circular logic?\n\n>They have been trying it for 10 years and nothing is working.\n\nBecause the illiterate North India was ripe for brainwashing with propaganda and BJP realised that, leveraged it before they realised what happened. \n\n>Kejriwal won a landslide in Delhi not because he came and said “I haven’t done anything so far so you might as well vote for me.”\n\nA large part of it was over the ashes of Congress rule. People were riled up and we're proactively looking for an alternative.\n\n>By 2029 when things have gone to some kind of extreme, it might rebalance and people will vote in some other party.\n\nIf you still have voting rights left by then, sure.\n\n>Right now just like sensex, the rally is continuing without a stop and no one knows why. \n\nI know why. A lot of it has to do with the most basic human psychology i.e. the us vs them narrative that's being peddled. Used to work great in the stone age because violence was the norm and so any other tribe approaching your hunting/feeding/breeding grounds was seen as an act of war because more often than not, they pose a threat to your livelihood and your family. In the 21st century, we're long past that. BUT we're descendants of those who were paranoid because that helped them survive long enough to bear children and natural selection ensured the paranoid survive. The civilization we built afterwards has no utility for this paranoia but we still have these instincts. That's why Hindus are constantly in danger of being wiped out. It just appeals to that deeply ingrained paranoia within our DNA that our ancestors have cultivated generation after generation. The world we live in no longer has the need for that but it feels good, just like sex, eating , drinking water satisfies our survival instincts and those who had sex, water and food were the ones who survived long enough for their descendants to love these activities. In the same way, in-group, out-group dynamics are woven into our DNA. But the better man is not the one who gives into them, the better man is one who realises that just like our appendix, it no longer has any utility and discards it in favour of a just, democratic society.",
        "I like the increased rate of petrol is branded as \" making petrol a revenue generating stream \".  What do you really drink?",
        "Please don't feed my ego. :D\n\nOn a serious note, I regularly write on important political issues, many of which are available on my profile.",
        "Okay, fuck the petrol. What about the rest? Fastest growing economy, highest forex reserves ever, buying petrol with INR, solar panels, quad agreements. Dude we can go on and on. \n\nI don't like their govt, I don't like the bitch moves they do like changing the way to calculate inflation or not bring PM Cares under RTI, or using the EC to obviously go after their opponents, or sidelining the President or bullying opposing media houses or selling everything to Adani. Censoring media, taking us back decades socially by injecting communal poison in the community, nepotism shoved down our faces every time we see a cricket match, suspending opposition MPs when they've gotten away with much worse. They're no saints, they might not be the best administrators we have (the bar is actually quite low, we've had some shitty politicians), but useless they definitely are not. They've got **a lot** of shit done and not all of it is bad. GST was always gonna be rocky, demonetization was an experiment which literally no economist worth their salt would claim the outcome of, Pulwama was avenged in the most OG way possible, Modi never denied the existence or severity of COVID unlike many, many worldwide leaders, he encouraged people to get vaccinated and stay safe. Manipur was always gonna come to a boil, but the internet censorship was wrong and an outdated way of maintaining peace.",
        "\\> The fact that OP thinks Sitaram Yechury would be a better PM than Modi destroys all credibility from this post \n\nWhere did you find that? In any case argument is \\_anybody\\_  will be better than Modiji. It is bit rhetorical , but I have no problem with it.",
        "\\>  sidelining the President or bullying opposing media houses or selling everything to Adani \n\nI am with you. Real point is govt  glorifies its action by 10 times, people should be able to criticize it similar way. Modi came because Congress was bad. Only way to know more about   bad deeds of BJP is get different govt and start digging to its files.",
        "I said it in 2021, as I saw people lying dead on the streets I grew up in, that all this will be forgotten by the next election. Government got lucky with the timing of Covid and second wave. Three years is a long enough time for them to shove everything under the rug using the current media landscape",
        "Might just be me, but I think this is a symptom of Indians being lazy people. In any walk of life, in any industry, if you look for the laziest bunch, you’re certain to find some Indians in there. \n\nWe’ve had the same mentality all along. Why else would the Nehru family still be the main alternative (Rahul Gandhi). We never bothered to diversify the most powerful people. And now we’re paying for it.",
        "Tbh, even time doesn't matter now. The Manipur violence is pretty recent, and people don't even talk about it anymore. The strategic timing of Nari Shakti Vandan Adhiniyam, which was promised in the 2014 manifesto, actually had me in awe of their genius. The first bill to be passed in the new parliament. It's just plain genius. I wish people read more history (world history) of how propaganda works.",
        "> Only way to know more about bad deeds of BJP is get different govt and start digging to its files.\n\nNot a good enough reason to kick them to the curb, to be honest. There are many reasons, but you need to acknowledge what they've done and not be one note about it. ~60% of the country is rural, tell the beneficiaries of electricity, cylinders, gas stoves and toilets about the media censorship or communal disharmony and they'll laugh in your face. Talk about how you can do better for them, don't be a Mac using, Starbucks sipping liberal while ignoring ground realities because those people are sick of being talked down to.",
        "[Here](https://www.reddit.com/r/india/s/1rGrXw4xjf)",
        "BJP is run by a bunch of ruthless master minds. Modi is just an actor who is made to believe that he has the power. The real players are hidden. The timing of things done by them is also astonishing.\n\nI hope they get destroyed through infighting.As long as Indians believe in propaganda BJP will cling to power.",
        "Just so you know, market indices performed better at the time of UPA government. You can check it anywhere.",
        "Sure. Here are some of the top reasons why all of the opposition leaders are better than Modi, so there is no need to talk about any one in particular. \n\n~ None of them oversaw and facilitated genocidal riots that resulted in killing of thousands of people. \n\n~ None of them have caused the most number of historical level disasters under one prime minister due to the incompetence and corruption of their administration. \n\n~ None of them have led an authorotarian govt that have destroyed the democratic institutions of India. \n\n~ None of them are going to turn India into a religious extremist country like its neighbor to the west is. \n\n~ None of them are bigger narcissists and blatant liars. \n\nThe only reason one would prefer Modi over others is if all they care about is the Hindutva agenda. In that case yes Modi is the obvious choice. I think OP has done a good job in capturing how Modi has been a failure in every other way.",
        "\\> acknowledge what they've done  ?\n\nEveryday that comes to me by way of whatsapp message.All the things listed have implementation issues, like any govt schemes.    Be it swachch bharat, or water supply schemes or what not. Or his friendship with Adani.  The media unable to meet Modi  and question him. When that happens all these \"facade\" of development  will comedown.    \n\nPoor will get their share even if any other party now comes to power.  Case point is almost any state - Telengana (BRS , till recently) , Andhra(YSR), Karanataka (Congress).  Almost all parties now recognize need of taking care of the poorest folks.",
        "UPA government was 10 years ago. Let's live in the present, shall we?",
        "UPI is a massive success ... scamsters agree!",
        "Amritkaal refugees.",
        "So if I understand correctly, none of them have actually done anything in their career. Am I right?",
        "> tell the beneficiaries of electricity, cylinders, gas stoves and toilets about the media censorship or communal disharmony and they'll laugh in your face.\n\nDo you know the cost of a cylinder? People will spit in your face if ask them if they are happy with what the price of gas is.",
        "How did you come to that conclusion? Nowhere I said that.I simply pointed out how they are better than Modi.",
        "What are their achievements?",
        "People in UP are happy to have reduced Gunda raj",
        "C'mon. You cannot dismiss UPI with that sort of a throwaway remark. It remains one of the greatest fintech products of the modern world",
        "You should write for The Onion. Brilliant",
        "Curious to hear your thoughts on something, u/rishianand. Imo one of the largest flaws of the Indian state of the oversized strength and reach of the executive. Given that the executive is formed by the legislative in our parliamentary democracy, it essentially renders the legislative body powerless to the wishes of the leaders of any ruling political party. I feel our democracy could benefit from a greater seperation of powers where our legislative would function independently and our executive is elected through a presidential-style election.\n\nAny thoughts on this? Do you see any ways this sort of systematic upheaval could happen? It might need to be a completely citizen driven project given that it would mean the stripping away of powers from the currently powerful",
        "People will say 10 rupees is too expensive. It costs what it costs, but they've given cylinders out for free and gotten them off the chulha. 20% of the recipients will never use it, and that will be shown in the media, but for the rest, Modi just did them a solid.",
        "> all these \"facade\" of development will comedown\n\nSee, keep denying all his work. It's a good way to get people to ignore you.",
        "You are right on the money. But, our public has drunk the religious kool aid they have offered. I think we will hit rock bottom and only then will ppl realise... It will take another 2 terms for it...",
        "Chooste raho.",
        "Opposition failed to win despite these issues",
        "Lol. The alternatives ***are*** the star campaigner of BJP. Everytime they open their mouth, more and more people lean towards voting for bjp.",
        "India will end up like Pak/Iran in about 15 years. 100% guarantee.",
        "Iran is a very likely path. I don't know if the world is ready for such a large country and economy in a theocracy.",
        "There are multiple gangrapes happening UP (BHU, Agra) but I guess doing 1 hr show on Ayodhya temple is more important on larger scheme of things. Shame on news media channels.",
        "The world will need to be ready for refugees.",
        "Fact check: After the Covid first wave, during the UN General Assembly Modi had claimed that India had defeated Covid and now helping the other countries with vaccines. \n\nDuring the WB elections, Modi came just near my town and louded people for showing up in large numbers in the peak of second Covid cycle. \n\nGOI did not place any order of homegrown vaccine when it could have increased the production. That perhaps was the reason that the second wave was massive.\n\n And when asked for how many people died in the country, then govt showed that they have no data. \n\nThat being said, GOI did start to work only after peak second wave otherwise it would have been much wider disaster.",
        "Modis biggest achievement has been properly implementing UPA policies. (NPA was Raguram Rajan)\n\nHis biggest weakness has been trying to use his own brain and setting the nation back with disastrous policies \n\nI will give him credit on military to some extent but we actually havent seen the government side of the MIC doing all that much better under Modi. Hal hasnt taken some major leap. It is doing what it always has done. Slowly but surely move ahead and no ability to move quickly.",
        "I think it will be more of this TBH...just leave behind everyone who doesn't have the money to get out. [https://thewire.in/world/india-has-the-worlds-biggest-diaspora](https://thewire.in/world/india-has-the-worlds-biggest-diaspora)",
        "With a side dose of Chinese surveillance.",
        "Leftist echo post",
        "Of course all the opposition leaders have different achievements. They are not all the same. They have been leaders of their party, MPs, MLAs, ministers, most are well educated with real, not fake, degrees. Much like achievements of several other PMs when they became PM for the first time.\n\nMy comment was about how any opposition leader is better than Modi and I have explained the top reasons. So you agree with that right?\n\nHere's an analogy - when selecting between two people for a job, if one is not only a known criminal but also caused a series of disasters due to their incompetence, it is better to give the other person a chance.",
        "Do you really think people care about something as abstract as this?\nEven if your suggestion would benefit us, there are ten other suggestions which are simpler and would produce bigger benefits:\n1. make government finances transparent at the micro level.\n2. improve the police system, so it's easier to live and run businesses\n3. pretend to have a secular state.\n4. mass education on socialist values so that the benefits of socialist schemes reach the most remote.\n5. social reform\ni could just go on.",
        "I'm still waiting to hear their achievements.",
        "Already given.",
        "Being the leader of a party is not an achievement. Especially a regional party with no pan national recognition. \n\nHaving a degree is also not an achievement. \n\nBe specific. Which leader do you want to vote for. Name them. Defend them.",
        "What sort of a useless reply is this lmao? Out of curiosity, I asked a specific question about specific aspect of the Indian political system, and you reply with irrelevant, inane shit like “social reform” and “pretend to have a secular state”? You clearly have no idea what’re you’re even talking about lol. Gtfo, mate. Stop being rude, read more, and improve your comprehend skills before you bother replying to anyone.",
        "Tell me what's wrong with introduction of UPI?",
        "Because opposition even if it’s bad is important for democracy",
        "Bruhh low level immigration China se bhi hoti hain....itna ghatiya deemag kaha se laate ho.",
        "Immigration of the best of the best has stopped.....only the tier 2 level guys migrate.",
        "Tbh bjp policies are much better than the opposition offers....half of the data given here is plain info especially galwan clashes...",
        "Wtf....verify these things yourself....half of it here is misinfo..... If yogendra yadav is a credible source....then Sonia Gandhi is Rajmata.",
        "I was wondering when the what-aboutism would roll in.\n\nCongress wasn't great and therefore isn't in power right now. So, you agree that should happen to the BJP too, right?\n\n> Not being able to field a competent person is also Modi's fault apparently.\n\nThe post is a rant. It doesn't say the opposition's inability to field a good candidate is somehow on Modi. It talks about Modi/BJP government's poor performance so far and their continued support regardless.",
        "In the truest sense of democracy and a republic government, Modi and BJP definitely have failed miserably. However, Modi/Shah are astute politicians and have considerably weakened pillars of Indian democracy one by one. Controlling the narrative via complete media control worked great for them.\n\nMy concern is if this continues, there's no motivation left for a non-BJP (or non-NDA) government to not abuse the same overreach of executive powers using the exact same precedents set by the current government.",
        "I don’t agree with the farm laws thing though. Both sides had bigwigs pushing their agenda with little to no concern for struggling farmers.",
        "Agreed",
        "Agreed .",
        "U must be from  bjp it cell",
        "UPI and DBT are UPA policies.\n\nActually, many of the highly profitable PSUs have been pushed under debt. [ONGC: Modi government drove India’s most profitable company under a mountain of debt](https://scroll.in/article/898171/ongc-woes-how-modi-government-drove-indias-most-profitable-company-under-a-mountain-of-debt)\n\nManufacturing growth has slowed down under the Modi Government. Last FY, manufacturing grew at 1.3%. Over the last five years, it grew at 3.4%, against the 9.1% during UPA. Number of jobs in manufacturing sector has similarly declined. [As ‘Make in India’ Enters 10th Year, What Does the Government’s Silence Mean? ](https://thewire.in/article/make-in-india-10-years-government-silence)\n\nModi Government grossly mishandled the pandemic, and ignored scientific advice. [Harsh Mander: Despite warnings, the Modi government had let India sleepwalk into the second wave](https://scroll.in/article/1020376/harsh-mander-despite-warnings-modi-government-had-let-india-sleepwalk-into-the-second-wave)\n\nNPA increased substantially under Modi Government. This is after the fact that over 14 lakh crore of bad loans were written off. [Gross NPAs more than three times up in NDA rule, says RBI data- The New Indian Express](https://www.newindianexpress.com/business/2021/jan/11/gross-npas-more-than-threetimes-up-in-nda-rule-says-rbi-data-2248365.html)\n\nI think Modi bhakts don't check facts before doing propaganda.",
        "Haha. Chaddi fantasy.\n\nThe fact is that you know how much this post destroys your daddy's credibility, so you came here to find gotcha moment.\n\nSitaram Yechury is a million times better leader than Modi. He was leading the student movement against Indira Gandhi, when Modi was playing imposter game. Yechury called her on her face that she must resign and gave a list of reasons. He was the a real gigachad.\n\nhttps://preview.redd.it/b4g7pgye84ac1.jpeg?width=680&format=pjpg&auto=webp&s=d2a685b0d112aed44d819d1e1e45b33480fbdc2d\n\nYechury is more learned and competent than the entire Modi cabinet put together.\n\nAll my facts of my post stay chaddi boy. Try as you may.",
        "Nope.. that was a creation of the fascist narrative... MS had to perform on a tightrope because of the multiple parties constituting the UPA 2.. but he did a good job considering the circumstances...",
        "I have already done all of that. I have given the reasons to support my initial claim. OTOH you haven't provided a single reason to show how an uneducated moron with a fake degree who has already proven to be a failure as PM is better than any opposition leader (come on show some whatsapp university knowledge 😉).\n\nIt is always fun to see people come up with excuses if their question gets answered when they weren't expecting to.",
        "When did UPI and DBT get implemented? Clearly it took u a lot of time to research and yet the best u can come up with plain old lies",
        "you are so desperate man , atlest if you are being pr then be like one isnted calling out random one who critisizes or speaks against you as chaadi",
        "To add to this, The current government is refuting the studies, surveys and rankings done by international organizations, calling it International Propaganda, false methodology and what not. Press Freedom Index, Hunger Index, Women Peace and security index, world press freedom index. I can keep on going.\n\nYou want to develop your country, fine. But atleast acknowledge the issues in the governance that is being pointed out. Refuting the surveys and Indexes just shows that you have no clue on how to develop your country.",
        "Bruhhh come on.... yogendra yadav is literally a politician and sources are literally biased...check yourself.... don't suck RaGa's balls all the time.",
        "BJP have no policy makers. They are effectively implementing congress policy, no doubt. but when it comes to creating new policy, they cannot tell the ass end from the front end of a donkey.",
        "I wanted to say something but then I realized chodee got banned, I see your presence makes sense now",
        "You are living in delusion.",
        "Well, you are entitled to your opinion",
        "Because most of land was always captured by 2013/14\n\nRead about depsang bulge",
        ">I'M OK with reservations? Isn't it the OPPOSITION which is clamouring for a Caste Census?\n\nThe fuck? Advocating for caste census is advocating for caste reservation?",
        "https://indianexpress.com/article/explained/explained-economics/explainspeaking-ultra-rich-investors-leaving-india-2023-migration-8662000/",
        "I am talking about talent pool...not the ultra rich ones.... don't talk dumb....",
        "There might be 1 billion alternatives but Indian people have only a few options:-\nRaGa:- Always going GaGa\nNitish:- Alias palturam\nMamta:- you don't want her if you have been to Bengal\nKejriwal:- Bigger u turner than imran khan\n\nIn these options only one is getting projected RaGa. The less said about him the better."
    ],
    "cleaned_text": "tina deliberate propaganda hide gross incompetence modi government one distinguishable feature years modi government gross incompetence shown regime every aspect administration modi announced demonetization banknotes fourhour notice entire nation thrown panic people died standing queues everything small businesses everyday life thrown chaos suffering modi joking peoples conditions government unprepared move new notes hadnt even printed yet couldnt dispensed atm modi government kept changing goals demonetization action black money curbing terrorism bringing cashless economy yet clear result policy massive hit national economy destruction informal sector modi government introduced gst riddled flaws rules amended dozens times within month objective uniform taxation gst introduced five different tax rates apart cess gst dealt massive blow federalism effects demonetization gst visible economic growth slowed meanwhile unemployment rising instead addressing issue modi asked whether selling pakoda front news studios earning day would count employment leaked nsso report revealed unemployment yearhigh report suppressed nsso surveys stopped pulwama attack happened crpf personnel killed yet modi shooting man vs wild time attack continued program hours instead accepting responsibility began exploiting attack seek votes name national security later revealed modi government received intelligence reports possible attack pulwama refused provide security crpf despite repeated requests election modi government went hyperdrive communal agenda government introduced citizenship amendment act provision grant citizenship india nonmuslim illegal immigrants bangladesh pakistan afghanistan entered india meant first time citizenship india linked religious identity massive protests erupted across india meanwhile government attacked universities jmi jnu du quell protests peaceful protesters arrested bjp leaders like kapil mishra anurag thakur parvesh verma openly gave hate speeches covid pandemic struck government imposed nationwide lockdown fourhour notice millions workers went unemployed migrant workers thrown immense suffering many choosing walk thousands kilometers rather suffering starvation thousands people killed loss jobs incomes millions fell faced hunger starvation lockdown government conspired corporations weaken indias environmental laws allow corporate takeover dense forests government also conspired allow corporate takeover agriculture force farmers become bonded labourers farmers fought historic battle sacrifice farmers government forced take back black laws galwan valley conflict army jawans laid lives defending borders yet save face modi claimed china enter indian territories statement major setback india contradicted india armys stand reports revealed india lost access patrolling points eastern ladakh china occupied sq km indian territories china constructed roads villages inside indian territories arunachal pradesh modi government kept awarding massive contracts chinese firms months later second wave covid struck despite warnings modi government let india sleepwalk largest humanitarian crisis lakh people died due governments incompetence people suffocating without oxygen dying without hospital beds enough space crematoriums rivers overflowing dead bodies meanwhile government kept endorsing protecting hatemongers open call genocide rape made public rallies december dharma sansad organized haridwar speakers gave call genocide assassinations civil war saw massive protests unemployment entire north india erupted protest government brought agnipath scheme largescale riots arson happened bihar states annoyed youths targeted bjp offices set fire witnessed massive ethnic conflicts civil war manipur despite double engine government modi even visited state refused meet delegation manipur refused remove chief minister state burning seven months december four youths protesting unemployment breached parliament modi refused address house security incident meanwhile mps suspended parliament crucial laws threatening civil liberties bulldozed without debates earlier august government passed laws allow digital surveillance narendra modi incompetent useless prime minister history india ironic considering much propaganda media tries portray great leader administrator person ever work elected policies schemes thoughtless experiments regard common people one might ask constant narrative portray competent administrator claiming opposition incompetent power propaganda every opposition leader competent modi tina alternative deliberate propaganda created ahead general election people india fall billion alternatives modi election httpswwwyoutubecomshortsqvztybrkc general election die moment indian democracy indiansocialistshttpsnpredditcomrindiansocialistscommentstijpthegeneralelectionisadoordiemoment building largest political mobilization independent india indiansocialistshttpsnpredditcomrindiansocialistscommentsvvqawbuildingthelargestpoliticalmobilizationin ",
    "cleaned_title": "tina deliberate propaganda hide gross incompetence modi government",
    "cleaned_selftext": "one distinguishable feature years modi government gross incompetence shown regime every aspect administration modi announced demonetization banknotes fourhour notice entire nation thrown panic people died standing queues everything small businesses everyday life thrown chaos suffering modi joking peoples conditions government unprepared move new notes hadnt even printed yet couldnt dispensed atm modi government kept changing goals demonetization action black money curbing terrorism bringing cashless economy yet clear result policy massive hit national economy destruction informal sector modi government introduced gst riddled flaws rules amended dozens times within month objective uniform taxation gst introduced five different tax rates apart cess gst dealt massive blow federalism effects demonetization gst visible economic growth slowed meanwhile unemployment rising instead addressing issue modi asked whether selling pakoda front news studios earning day would count employment leaked nsso report revealed unemployment yearhigh report suppressed nsso surveys stopped pulwama attack happened crpf personnel killed yet modi shooting man vs wild time attack continued program hours instead accepting responsibility began exploiting attack seek votes name national security later revealed modi government received intelligence reports possible attack pulwama refused provide security crpf despite repeated requests election modi government went hyperdrive communal agenda government introduced citizenship amendment act provision grant citizenship india nonmuslim illegal immigrants bangladesh pakistan afghanistan entered india meant first time citizenship india linked religious identity massive protests erupted across india meanwhile government attacked universities jmi jnu du quell protests peaceful protesters arrested bjp leaders like kapil mishra anurag thakur parvesh verma openly gave hate speeches covid pandemic struck government imposed nationwide lockdown fourhour notice millions workers went unemployed migrant workers thrown immense suffering many choosing walk thousands kilometers rather suffering starvation thousands people killed loss jobs incomes millions fell faced hunger starvation lockdown government conspired corporations weaken indias environmental laws allow corporate takeover dense forests government also conspired allow corporate takeover agriculture force farmers become bonded labourers farmers fought historic battle sacrifice farmers government forced take back black laws galwan valley conflict army jawans laid lives defending borders yet save face modi claimed china enter indian territories statement major setback india contradicted india armys stand reports revealed india lost access patrolling points eastern ladakh china occupied sq km indian territories china constructed roads villages inside indian territories arunachal pradesh modi government kept awarding massive contracts chinese firms months later second wave covid struck despite warnings modi government let india sleepwalk largest humanitarian crisis lakh people died due governments incompetence people suffocating without oxygen dying without hospital beds enough space crematoriums rivers overflowing dead bodies meanwhile government kept endorsing protecting hatemongers open call genocide rape made public rallies december dharma sansad organized haridwar speakers gave call genocide assassinations civil war saw massive protests unemployment entire north india erupted protest government brought agnipath scheme largescale riots arson happened bihar states annoyed youths targeted bjp offices set fire witnessed massive ethnic conflicts civil war manipur despite double engine government modi even visited state refused meet delegation manipur refused remove chief minister state burning seven months december four youths protesting unemployment breached parliament modi refused address house security incident meanwhile mps suspended parliament crucial laws threatening civil liberties bulldozed without debates earlier august government passed laws allow digital surveillance narendra modi incompetent useless prime minister history india ironic considering much propaganda media tries portray great leader administrator person ever work elected policies schemes thoughtless experiments regard common people one might ask constant narrative portray competent administrator claiming opposition incompetent power propaganda every opposition leader competent modi tina alternative deliberate propaganda created ahead general election people india fall billion alternatives modi election httpswwwyoutubecomshortsqvztybrkc general election die moment indian democracy indiansocialistshttpsnpredditcomrindiansocialistscommentstijpthegeneralelectionisadoordiemoment building largest political mobilization independent india indiansocialistshttpsnpredditcomrindiansocialistscommentsvvqawbuildingthelargestpoliticalmobilizationin",
    "cleaned_comments": "yikes ok name one opposition leader would want see pm list achievements election fought performance ruling party clear modi undeserving post let alone leader nation answer crimes election also fought promises track record opposition fact cant even name single opposition leader would like see pm telling written clearly post every single opposition leader competent modi mallikarjun kharge mk stalin sitaram yechury raja arvind kejriwal hundred times competent modi mentioned single one guys post ok named one would vote kharge yechury raja stalin kejriwal one better achievements think possible take lose almost easy win need bring religious issue people vote see saying price bjp winning election much india citizens bjp already forcibly captured parliament imprisoned dozens activists journalists academicians institutions compromised legitimized violence women corrupted education system replace scientific facts irrational ideas modi wins activists independent journalists put jail facts data suppressed say without exaggeration die indian democracy trust afford lose yes difficult battle win win urge everyone accept defeat battle please part whatever times plain dumb mallikarjun kharge lost seat last lok sabha elections elected pm proper rubber stamp maunmohan guy zero charisma one follow zero connect ground seriously think handle complex situation india right sitaram yechury got ta cleaning bottom barrel naming partys ideology made bengal go back years least potential cpim salutes mao twitter fyi sign come also take look vote share india raja seriously please take look vote share arvind kejriwal say bit competent guy needs get witch hunt hopefully witch hunt involving ministers first also stop freebies culture like free electricity etc damaging fiscal health country party go long way popular across country give sense strong leader anyone else seriously youve said people lack charisma way metric someones competency ill admit one thing gobiji others mentioned know happens country based leader charismatic competent haha chaddis calling great leader dr manmohan singh maunmohan called silent pm wasnt afraid talking press manmohan singhhttpswwwindiatodayinindiastorymanmohansinghsilentpmnarendramodipressconference everything say true depressing list achievements saying gobhiji good answer cpim along cpi power west bengal consecutive terms hows west bengal faring best country also aligned chinas ideology folks keeping saying modi sold india china fuckers write manifesto arvind kejriwal power punjab good time see many problems state party able solve definitely something push centre im asking competency folks mentioned please list lets healthy discussion haha easy call another person chaddi ill call chamcha start abusing discussion drain one question think rubber stamp pm leader modi megalomaniac lmfaooo hilarious post government deserves criticism sure fact congress major power part independence didnt much defence policies lets talk jawans beheaded terrorists manmohan singh government nothing didnt anything attacks either roads developed last years years indias image global front improved lot congress little interest strengthening ties countries also blame incompetence ruling party delusion lmao able field competent person also modis fault apparently dont worry faith defeated fascists ready challenge win building largest political mobilization independent india indiansocialistshttpsnpredditcomrindiansocialistscommentsvvqawbuildingthelargestpoliticalmobilizationin thanks speaking providing sources hope people see smoke one day im going take word media like substantiates thinking pasting may may politically motivated btw talk modi entire discussion parent thread talked alternatives provided refuted called chaddi started lapping manmohan singh dont anything add discussion please start new thread post much hate modi op talks propaganda proceeds gst tremendous success seen tax collections compliances improvingrefer rbi studies upi massive success dbt plugging leakages another success improved financial condition psusimproved road infrastructure connectivityfaster execution projects india seen china global superpower making losing manufacturing bus since independence one best handling covid among major countriesensured poor ppl arent going hungry free food grains schemes didnt indulge destroying countrys balance sheet like didfast tracked vaccination digital adoption strengthened financial sectornpa decade lows strengthened indigenous defence manufacturinglook annual report defence companies added many hospitals medical collegessteady improvement doctorpopulationabdm ftw strong facilitator transition dirty coal energy clean green energysecuring energy security futuretremendous achievement finally countries globally facing slowdown india remains fastest growing major economyrefer imf say modi competent pm last years yeah op pointing tina coping mechanism middle class educated people ashamed admit voting religious grounds like extremist mullahs iran pakistan practically opposition leaders better current incompetent corrupt buffoon pm national advisory council institution built draft opinion expertise leaders academicians experts policy making nac led drafting rti act right education act right food act right work act throughout post highlighted modi government took senseless decisions many without consultation led hardships tragedies two model leadership one dr manmohan singh sought opinion advice experts one modi thinks supreme intelligence choice clear care list positive points please identify one leader would vote things stand going achieve elected centre election also fought promises track record opposition need read political literature like works allan lichtman history statement simply false real india electoral democracy elections referrundum incumbents whereby condition opposition simply exist exist india vote share even seat share testament objective fact opposition money charismatic etc etc bonus prerequisite fundamental driver political structure real electoral democracy transition happened ie condition opposition simply exist incentive competent incumbent history showed withing years competent doesnt matter opposition leader even long exists ballot box clearly visible spoken like someone doesnt ideology support doesnt like current leadership doesnt matter opposition leader even long exists absolutely matters last one year india shown opposition leaders simply much individual ambitions coexist fight current leadership even stop bickering till elections somehow miraculously agree seat sharing formula even miraculously manage restrict bjp nda bjp less complete majority think happen guys never agree consensus leader max day govt ala vajpayee another round elections worst guys eat others vote share bjp achieve even bigger supermajority change constitution sending feelers bibek debroys articles doubts mind might see chinese style one party rule india cozying russia defying ominous sign harsh reality forgotten media machine works nonstop blowing man migrant worker covid crises hope would wake people didnt happen bjp win landslide mandir cruel say ones suffered due covid migrant crisis unemployment oppression still go vote deserve misery befallen future writing end yup rahul gandhi wonderful leader much competent reason become next pm take us new heights gdp rival china see accomplishments take nitish example made bihar progressive developed state im sure op excellent research skills point fantastic accomplishments stalwart leaders would done dont much time nyay yatra brilliant idea way make rahul gandhis face top mind elections get closer im pretty sure alliance bloc get seats also good market fall temporarily give great buying opportunity climbing back current levels towards december havent voted bjp ever ive voting years time ill vote oppositions vocal proreservation antibusiness policies vote else bjp introducing reservation ews modis masterstrokes business like demonetization banning chinese apps great business opinion democracy still thats better government ask local businessman would rather vote even better look market indices react bjp recent times visavis lost im sorry tina lot contribute way able write speak sing spread awareness knock door distribute pamphlets donate organizations parttime fulltime next six months whatever years later youd proudly say part years old retired professor roop rekha verma distributing pamphlets spread awareness youtubehttpswwwyoutubecomwatchvwpflygsrfe pamphlets public transport retired iit professor campaigns mp right candidates youtubehttpswwwyoutubecomwatchvulsghtnlscgembedsreferringoriginhttpsaffwwwnewslaundrycomsourcevepathmjmnte apart individual work join organisation civil society organisations launch nationwide campaign coming weeks join also help countering bjp propaganda intense days im surprised local businessmen big fans one pm put profit people every time didnt answer question youre proving point like bjp voters using obscure arguments defend voting whereas one area clearly distinct opposition anti poor anti minority stance alternative narrative alternative modi modi proreservation antibusiness policies suggest otherwise implemented ews wrong bc one reservation ews second modi brought back back horrors license raj recently still regulators tightening control economy private investment bottom still hes probusiness dont know modi came name economy everything instead working economy theres much taxes one crushed theres tax tax dude literally anyones better india grow regardless narcissistic snowflakes top effects induces insecurities every citizen politician ok follow duties people sadly dont care change would good reflection scary easily people forgot covid also medical college time seen eyes many covid deaths signed diagnosis leading death show lower numbers paper would better different government really dont know maybe mean wont hold current government responsible keep validating things keep worshipping people questioning forgetting serve us way around health care system suffering ayush quacks given rights instead increasing number government medical colleges seats vote ruling party disappointed every sphere life india education work transport safety maybe benefited people thats respectful vote question reservations ews im morally ok compared reservations scs sts obcs regarding demonetization yes much impact govt thought would big whoop kudos least trying banning chinese apps really coming promoting chinese apps seriously doesnt ideology support thank take compliment fundamentalist dogma guide regardless content whatever may absolutely matters trust actual history reality world academic literature subjective trite max day govt ala vajpayee ie proves point real electoral systems work people vote incumbent vote someone back days incumbency saw happened towith incumebt coalition govt real thing happens world current historic era india may nonobjective part comment even better even current incumbant relative context theyve gone far opposition irrelvant outside context existing exists india period implemented ews wrong bc one reservation ews simple ive seen many rich folks exploit reservations classmate sikh whose father chief delhis fire department used live apartment overlooking swimming pool hyatt used drive car college days college students cars st seen numerous stories like ews implemented correctly morally correct caste based politics dont understand defend caste based reservations second modi brought back back horrors license raj recently still regulators tightening control economy proof compare number regulators years back private investment bottom source basically ok reservation anti business stuff bjp vote first time ever opposition may admit want hindu pakistan save effort mental gymnastics im ok reservations isnt opposition clamouring caste census isnt opposition parties going increasing st sc obc reservations admit dont know iota bout whats going country want contrarian dude thick guy explained point well high really nice stuff friend perfectly legal vote hatred helping contradicting instead admitting modi antibusiness destroyed small businesses large businesses forcibly acquired adani persecuted governments agencies crony capitalists enjoy tax cuts loan waivers lakh crore even millionaires fleeing india im sorry qualify intelligent average sham sharma fan yes modi practically everywhere like ruling conscious subconcious illiterate dumb folks india heck even installed life size portraits colleges ugc guidelines youths take selfies share socials thugery hope dogs take piss portraits picture worth sharing demonisation would impossible see humongous digital growth govt track transactions online income tax filing may increase applying big data technology reservation systems based individual income dont understand gentlemen ews upa turned india dumping ground china asean banning cheeeni companies essential local inhouse development raga choosing arunqchal start bharat nyay yatra people cant tiny thing chin seems living separate universe ews implemented correctly morally correct theres justification whether moral academic reservations im defending caste based well reservation even affirmative actions like west practices youre determining equality outcome instead opportunities im defending caste based well defending opposition tina must countered dita democracy alternative disadvantaged lazy incompetent entitled view govt something needs perfect closest scrutiny expect misrule years well oiled corrupt lethargic nexus system would magically perform without flaws forgot law makers governance new part need work filth thats people want govt used benefits camee older regimeand ate scared old way living threat wrote opposition modi support opposition opposition bad bjp terms policies none go long term solution instead short term lollipop whats use writing modi bad bjp even get vote modi fights presidential type election thats tina comes youre saying right terms policies way bjp fights elections modi vs makes presidential type candidate opposing similar indira modi unable speak chinas name even captured territory jaishankar saying india stand china demolish memorial major shaitan singh fought till last man last bullet chinese army modi chinese agent sent xi jinping destroy india within narendra modi incompetent useless prime minister history india alone puts credibility ground electric connectivity infra cylinders toilets trains allowing private companies defense selling air india making petrol revenue generating stream mandir hes gon na three terms pm first simple majority since nothing true indian vote personality policy failure failure deter modi voters forgotten cloud hain benefit hogahttpswwwyoutubecomwatchviewyqceqg disasterstroke already important strategic decision could jeopardized raw wisdom knowitall versatile genius guy nations nuclear codes see accomplishments least didnt get people killed massive riots genocides count absolute win value human life maybe im behind curve fact op thinks sitaram yechury would better pm modi destroys credibility post majority voter mandir ban raha hai na election never economic alone mostly emotional issues forgot thats nice circular logic going work ground trying years nothing working kejriwal landslide delhi came said havent done anything far might well vote clear vision good image good credentials showed promise better governance happened another story way anyone shot displacing current party modi bad best clean corrupt worked years keeping thing work least things gone kind extreme might rebalance people vote party right like sensex rally continuing without stop one knows yup india path becoming super power thats reason many people leaving india via dunki route spread message world curious know good government done past years outstanding write way reddit paygrade must say infrastructure especially roadsnational highways expressways badly needed thats nice circular logic circular logic trying years nothing working illiterate north india ripe brainwashing propaganda bjp realised leveraged realised happened kejriwal landslide delhi came said havent done anything far might well vote large part ashes congress rule people riled proactively looking alternative things gone kind extreme might rebalance people vote party still voting rights left sure right like sensex rally continuing without stop one knows know lot basic human psychology ie us vs narrative thats peddled used work great stone age violence norm tribe approaching huntingfeedingbreeding grounds seen act war often pose threat livelihood family st century long past descendants paranoid helped survive long enough bear children natural selection ensured paranoid survive civilization built afterwards utility paranoia still instincts thats hindus constantly danger wiped appeals deeply ingrained paranoia within dna ancestors cultivated generation generation world live longer need feels good like sex eating drinking water satisfies survival instincts sex water food ones survived long enough descendants love activities way ingroup outgroup dynamics woven dna better man one gives better man one realises like appendix longer utility discards favour democratic society like increased rate petrol branded making petrol revenue generating stream really drink please dont feed ego serious note regularly write important political issues many available profile okay fuck petrol rest fastest growing economy highest forex reserves ever buying petrol inr solar panels quad agreements dude go dont like govt dont like bitch moves like changing way calculate inflation bring pm cares rti using ec obviously go opponents sidelining president bullying opposing media houses selling everything adani censoring media taking us back decades socially injecting communal poison community nepotism shoved faces every time see cricket match suspending opposition mps theyve gotten away much worse theyre saints might best administrators bar actually quite low weve shitty politicians useless definitely theyve got lot shit done bad gst always gon na rocky demonetization experiment literally economist worth salt would claim outcome pulwama avenged og way possible modi never denied existence severity covid unlike many many worldwide leaders encouraged people get vaccinated stay safe manipur always gon na come boil internet censorship wrong outdated way maintaining peace fact op thinks sitaram yechury would better pm modi destroys credibility post find case argument anybody better modiji bit rhetorical problem sidelining president bullying opposing media houses selling everything adani real point govt glorifies action times people able criticize similar way modi came congress bad way know bad deeds bjp get different govt start digging files said saw people lying dead streets grew forgotten next election government got lucky timing covid second wave three years long enough time shove everything rug using current media landscape might think symptom indians lazy people walk life industry look laziest bunch youre certain find indians weve mentality along else would nehru family still main alternative rahul gandhi never bothered diversify powerful people paying tbh even time doesnt matter manipur violence pretty recent people dont even talk anymore strategic timing nari shakti vandan adhiniyam promised manifesto actually awe genius first bill passed new parliament plain genius wish people read history world history propaganda works way know bad deeds bjp get different govt start digging files good enough reason kick curb honest many reasons need acknowledge theyve done one note country rural tell beneficiaries electricity cylinders gas stoves toilets media censorship communal disharmony theyll laugh face talk better dont mac using starbucks sipping liberal ignoring ground realities people sick talked herehttpswwwredditcomrindiasrgrxwxjf bjp run bunch ruthless master minds modi actor made believe power real players hidden timing things done also astonishing hope get destroyed infightingas long indians believe propaganda bjp cling power know market indices performed better time upa government check anywhere sure top reasons opposition leaders better modi need talk one particular none oversaw facilitated genocidal riots resulted killing thousands people none caused number historical level disasters one prime minister due incompetence corruption administration none led authorotarian govt destroyed democratic institutions india none going turn india religious extremist country like neighbor west none bigger narcissists blatant liars reason one would prefer modi others care hindutva agenda case yes modi obvious choice think op done good job capturing modi failure every way acknowledge theyve done everyday comes way whatsapp messageall things listed implementation issues like govt schemes swachch bharat water supply schemes friendship adani media unable meet modi question happens facade development comedown poor get share even party comes power case point almost state telengana brs till recently andhraysr karanataka congress almost parties recognize need taking care poorest folks upa government years ago lets live present shall upi massive success scamsters agree amritkaal refugees understand correctly none actually done anything career right tell beneficiaries electricity cylinders gas stoves toilets media censorship communal disharmony theyll laugh face know cost cylinder people spit face ask happy price gas come conclusion nowhere said thati simply pointed better modi achievements people happy reduced gunda raj cmon dismiss upi sort throwaway remark remains one greatest fintech products modern world write onion brilliant curious hear thoughts something urishianand imo one largest flaws indian state oversized strength reach executive given executive formed legislative parliamentary democracy essentially renders legislative body powerless wishes leaders ruling political party feel democracy could benefit greater seperation powers legislative would function independently executive elected presidentialstyle election thoughts see ways sort systematic upheaval could happen might need completely citizen driven project given would mean stripping away powers currently powerful people say rupees expensive costs costs theyve given cylinders free gotten chulha recipients never use shown media rest modi solid facade development comedown see keep denying work good way get people ignore right money public drunk religious kool aid offered think hit rock bottom ppl realise take another terms chooste raho opposition failed win despite issues lol alternatives star campaigner bjp everytime open mouth people lean towards voting bjp india end like pakiran years guarantee iran likely path dont know world ready large country economy theocracy multiple gangrapes happening bhu agra guess hr show ayodhya temple important larger scheme things shame news media channels world need ready refugees fact check covid first wave un general assembly modi claimed india defeated covid helping countries vaccines wb elections modi came near town louded people showing large numbers peak second covid cycle goi place order homegrown vaccine could increased production perhaps reason second wave massive asked many people died country govt showed data said goi start work peak second wave otherwise would much wider disaster modis biggest achievement properly implementing upa policies npa raguram rajan biggest weakness trying use brain setting nation back disastrous policies give credit military extent actually havent seen government side mic much better modi hal hasnt taken major leap always done slowly surely move ahead ability move quickly think tbhjust leave behind everyone doesnt money get httpsthewireinworldindiahastheworldsbiggestdiasporahttpsthewireinworldindiahastheworldsbiggestdiaspora side dose chinese surveillance leftist echo post course opposition leaders different achievements leaders party mps mlas ministers well educated real fake degrees much like achievements several pms became pm first time comment opposition leader better modi explained top reasons agree right heres analogy selecting two people job one known criminal also caused series disasters due incompetence better give person chance really think people care something abstract even suggestion would benefit us ten suggestions simpler would produce bigger benefits make government finances transparent micro level improve police system easier live run businesses pretend secular state mass education socialist values benefits socialist schemes reach remote social reform could go im still waiting hear achievements already given leader party achievement especially regional party pan national recognition degree also achievement specific leader want vote name defend sort useless reply lmao curiosity asked specific question specific aspect indian political system reply irrelevant inane shit like social reform pretend secular state clearly idea whatre youre even talking lol gtfo mate stop rude read improve comprehend skills bother replying anyone tell whats wrong introduction upi opposition even bad important democracy bruhh low level immigration china se bhi hoti hainitna ghatiya deemag kaha se laate ho immigration best best stoppedonly tier level guys migrate tbh bjp policies much better opposition offershalf data given plain info especially galwan clashes wtfverify things yourselfhalf misinfo yogendra yadav credible sourcethen sonia gandhi rajmata wondering whataboutism would roll congress wasnt great therefore isnt power right agree happen bjp right able field competent person also modis fault apparently post rant doesnt say oppositions inability field good candidate somehow modi talks modibjp governments poor performance far continued support regardless truest sense democracy republic government modi bjp definitely failed miserably however modishah astute politicians considerably weakened pillars indian democracy one one controlling narrative via complete media control worked great concern continues theres motivation left nonbjp nonnda government abuse overreach executive powers using exact precedents set current government dont agree farm laws thing though sides bigwigs pushing agenda little concern struggling farmers agreed agreed u must bjp cell upi dbt upa policies actually many highly profitable psus pushed debt ongc modi government drove indias profitable company mountain debthttpsscrollinarticleongcwoeshowmodigovernmentdroveindiasmostprofitablecompanyunderamountainofdebt manufacturing growth slowed modi government last fy manufacturing grew last five years grew upa number jobs manufacturing sector similarly declined make india enters th year governments silence mean httpsthewireinarticlemakeinindiayearsgovernmentsilence modi government grossly mishandled pandemic ignored scientific advice harsh mander despite warnings modi government let india sleepwalk second wavehttpsscrollinarticleharshmanderdespitewarningsmodigovernmenthadletindiasleepwalkintothesecondwave npa increased substantially modi government fact lakh crore bad loans written gross npas three times nda rule says rbi data new indian expresshttpswwwnewindianexpresscombusinessjangrossnpasmorethanthreetimesupinndarulesaysrbidatahtml think modi bhakts dont check facts propaganda haha chaddi fantasy fact know much post destroys daddys credibility came find gotcha moment sitaram yechury million times better leader modi leading student movement indira gandhi modi playing imposter game yechury called face must resign gave list reasons real gigachad yechury learned competent entire modi cabinet put together facts post stay chaddi boy try may nope creation fascist narrative ms perform tightrope multiple parties constituting upa good job considering circumstances already done given reasons support initial claim otoh havent provided single reason show uneducated moron fake degree already proven failure pm better opposition leader come show whatsapp university knowledge always fun see people come excuses question gets answered werent expecting upi dbt get implemented clearly took u lot time research yet best u come plain old lies desperate man atlest pr like one isnted calling random one critisizes speaks chaadi add current government refuting studies surveys rankings done international organizations calling international propaganda false methodology press freedom index hunger index women peace security index world press freedom index keep going want develop country fine atleast acknowledge issues governance pointed refuting surveys indexes shows clue develop country bruhhh come yogendra yadav literally politician sources literally biasedcheck dont suck ragas balls time bjp policy makers effectively implementing congress policy doubt comes creating new policy tell ass end front end donkey wanted say something realized chodee got banned see presence makes sense living delusion well entitled opinion land always captured read depsang bulge im ok reservations isnt opposition clamouring caste census fuck advocating caste census advocating caste reservation talking talent poolnot ultra rich ones dont talk dumb might billion alternatives indian people options raga always going gaga nitish alias palturam mamta dont want bengal kejriwal bigger u turner imran khan options one getting projected raga less said better",
    "light_cleaned_title": "TINA is a Deliberate Propaganda to Hide the Gross Incompetence of the Modi Government.",
    "light_cleaned_selftext": "**तू इनकी झूठी बात पर ना और ऐतबार कर** **के तुझको साँस-साँस का सही हिसाब चाहिए** **घिरे हैं हम सवाल से हमें जवाब चाहिए** **जवाब-दर-सवाल है के इन्क़लाब चाहिए** One of the most distinguishable feature of 10 years of Modi Government has been the gross incompetence shown by the regime in every aspect of the administration. In 2016, Modi announced the **demonetization of banknotes, at a four-hour notice**. The entire nation was thrown into panic. Over 100 people died standing in queues. Everything — from small businesses to everyday life — was thrown into chaos and suffering, while Modi was joking about people's conditions. The Government was so unprepared for the move, that new notes hadn't even been printed yet, and couldn't be dispensed by the ATM. Modi Government kept changing the goals of the demonetization, from action against black money, to curbing terrorism, to bringing cashless economy. Yet, it was clear that the only result of the policy was a massive hit to the national economy and destruction of the informal sector. In 2017, the Modi Government introduced **GST, riddled with flaws**, its rules were amended dozens of times within a month. Against the objective of uniform taxation, GST introduced five different tax rates, apart from cess. GST dealt a massive blow to federalism. By 2018, the effects of demonetization and GST visible, and the economic growth slowed down. Meanwhile, the unemployment was rising. Instead of addressing the issue, Modi asked whether selling pakoda in front of news studios and earning ₹200 a day would not count as employment. In 2019, a leaked NSSO report revealed that **unemployment was at a 45-year-high**. The report was suppressed, and further NSSO surveys were stopped. In 2019, the Pulwama attack happened, where 40 CRPF personnel were killed. Yet, Modi who was shooting Man vs Wild at the time of the attack, continued with his program for hours. Instead of accepting responsibility, he began exploiting the attack to seek votes in the name of national security. It was later revealed that the **Modi Government had received 11 intelligence reports of a possible attack before Pulwama, and refused to provide security to the CRPF despite repeated requests.** After the 2019 election, the Modi Government went into a hyperdrive with its communal agenda. The Government introduced Citizenship Amendment Act, a provision to grant the Citizenship of India, to non-Muslim illegal immigrants from Bangladesh, Pakistan, and Afghanistan who entered India before 2014. Which meant, for the first time, the Citizenship of India has been linked to religious identity. Massive protests erupted across India. Meanwhile, the **Government attacked the universities of JMI, JNU and DU** to quell the protests. Peaceful protesters were arrested, while **BJP leaders like Kapil Mishra, Anurag Thakur, and Parvesh Verma, openly gave hate speeches**. In 2020, the COVID pandemic struck, and the **Government imposed a nationwide lockdown at a four-hour notice**. Millions of workers went unemployed. Migrant workers were thrown into an immense suffering, many of them choosing to walk thousands of kilometers rather than suffering from starvation. Thousands of people were killed. With loss of jobs and incomes, millions fell faced hunger and starvation. In 2020, during the lockdown, the Government conspired with the corporations to **weaken India's environmental laws**, and to allow corporate takeover of dense forests. The Government also conspired to **allow corporate takeover of agriculture**, and force the farmers to become bonded labourers. The farmers fought a historic battle, and after the sacrifice of 800 farmers, the Government was forced to take back the black laws. In 2020, in the Galwan valley conflict **20 army jawans laid down their lives defending our borders**. Yet, to save his face, Modi claimed that China did not enter Indian territories. The statement was a major setback to India, and contradicted India Army's stand. Reports revealed that India had lost access to 26 out of 65 Patrolling Points in eastern Ladakh, after China occupied over 1000 sq km of Indian territories. China constructed roads and villages inside Indian territories in Arunachal Pradesh, while Modi Government kept awarding massive contracts to Chinese firms. A few months later, the second wave of COVID struck. Despite warnings, Modi government let India sleepwalk into its largest humanitarian crisis. **47 lakh people died, due to Government's incompetence**. People were suffocating without oxygen, and dying without hospital beds. There was not enough space in crematoriums, and **rivers were overflowing with dead bodies**. Meanwhile, the Government kept endorsing and protecting hate-mongers. Open call for genocide and rape were made in public rallies. In December 2021, at a **Dharma Sansad organized in Haridwar, speakers gave call for genocide, assassinations, and civil war.** 2022 saw **massive protests against unemployment**. The entire North India erupted in protest after the Government brought the Agnipath scheme. Large-scale riots and arson happened in Bihar, UP and other states. The annoyed youths targeted BJP offices and set them on fire. 2023 witnessed a **massive ethnic conflicts and civil war in Manipur**. Despite having a “double engine” government, the Modi has not even visited the state. He has refused to meet the delegation from Manipur, and has refused to remove the Chief Minister. The state has been burning for seven months. In December 2023, four youths protesting against unemployment breached the Parliament. Modi refused to address the house on this security incident. Meanwhile, over **140 MPs were suspended from the Parliament**, and crucial laws, threatening civil liberties, were bulldozed without debates. Earlier, in August, the Government passed laws to allow digital surveillance. Narendra Modi is the most incompetent and useless Prime Minister in the history of India, which is ironic considering how much his propaganda media tries to portray him as a great leader and administrator. Not once does this person ever work, or do what he was elected to do. All his policies and schemes are thoughtless experiments, with no regard for common people. Why then, one might ask, is there a constant narrative to portray him as a competent administrator, while claiming that the opposition is incompetent. This is the power of propaganda. Every opposition leader is more competent than Modi. TINA (There Is No Alternative) is a deliberate propaganda created ahead of the General Election. People of India will not fall for it. There are over 1 billion alternatives to Modi. [मोदी के सामने कौन? | Election 2024](https://www.youtube.com/shorts/Q_VZTyBrKC8) [The 2024 General Election is a DO OR DIE moment for Indian Democracy : IndianSocialists](https://np.reddit.com/r/IndianSocialists/comments/18tijp0/the_2024_general_election_is_a_do_or_die_moment/) [Building the largest political mobilization in Independent India. : IndianSocialists](https://np.reddit.com/r/IndianSocialists/comments/18vvqaw/building_the_largest_political_mobilization_in/)",
    "light_cleaned_comments": "Yikes! Ok, name one opposition leader you would want to see as PM and list their achievements. The election is fought over the performance of the ruling party. It is clear Modi is undeserving of any post let alone the leader of the nation. He will answer for his crimes. The election is also fought on the promises and track record of the opposition. The fact that you can't even name a single opposition leader you would like to see as PM is telling. I have written it clearly in my post. Every single opposition leader is more competent than Modi. Mallikarjun Kharge, MK Stalin, Sitaram Yechury, D Raja, Arvind Kejriwal, all are hundred times more competent than Modi. You have not mentioned a single one of these guys in your post. OK, now that you have named them. Which one would you vote for? Kharge or Yechury or Raja or Stalin or Kejriwal? Which one is better? What are their achievements? Do you think it’s possible for take to lose in 2024. It’s almost too easy for them to win, they just need to bring up some religious issue or the other and people will vote for that :/ See, I have been saying this over and over. The price of BJP winning the 2024 election will be too much for India and her citizens. BJP has already forcibly captured the Parliament. They have imprisoned dozens of activists, journalists, academicians. All the institutions have been compromised. They have legitimized violence against women. They have corrupted the education system, to replace scientific facts with irrational ideas. If Modi wins, most of the activists and independent journalists will be put in jail. All the facts and data will be suppressed. I will say it again, without any exaggeration, this is Do or Die for Indian Democracy. Trust me. We cannot afford to lose. Yes, it is a difficult battle. But we have to win. And we can win. I just urge everyone to not accept the defeat before the battle. And please do your part, whatever you can. 100 times?? Are you just plain dumb or what?? Mallikarjun Kharge: Lost his seat in last Lok Sabha Elections. If elected PM, will be a proper rubber stamp as Maunmohan. Guy has zero charisma, no one will follow him, zero connect to ground, do you seriously think he can handle the complex situation India is in right now? Sitaram Yechury: You gotta be cleaning the bottom of the barrel if you are naming him with his party's ideology which made Bengal go back 10 years at least in its potential. CPI(M) salutes Mao on Twitter FYI, a sign of what is to come. Also take a look at their vote share in India. D Raja: Again seriously, please take a look at their vote share. Arvind Kejriwal: Can say, a bit competent, but the guy needs to get out of this witch hunt (hopefully it is a witch hunt only) involving him and his ministers first. He also should stop freebies culture like free electricity etc. which is damaging to fiscal health of the country. But him and his party has to go a long way to be more popular across country to give a sense of strong leader. Anyone else? Seriously? All you've said against these people is lack of charisma. That is in no way a metric of someone's competency. I'll admit, it is the one thing Gobiji has more of than the others mentioned, and we all know what happens to a country who based their leader on how charismatic they are, not how competent they are. Haha. Chaddis calling a great leader as Dr Manmohan Singh as Maunmohan. [Was called silent PM, but I wasn't afraid of talking to press: Manmohan Singh](https://www.indiatoday.in/india/story/manmohan-singh-silent-pm-narendra-modi-press-conference-1412551-2018-12-19) Everything you say is true, and depressing 🤦‍♀️ List the achievements then!! Saying Gobhiji is not a good answer to this. CPI(M) along with CPI were in power in West Bengal for consecutive terms. how's West Bengal faring?? Best in the country? They are also aligned with China's ideology . You folks keeping saying \"Modi sold India to China\", these fuckers will write it in their manifesto. Arvind Kejriwal is in power in Punjab, a good time to see what they do. There are many problems with the state and if his party is able to solve it, definitely something to push for the centre. I'm asking you about the competency of all the folks whom you mentioned. Please list them and let's have a healthy discussion Haha. So easy to call another person Chaddi. Now I'll call you a chamcha and we will start abusing each other, discussion down the drain. I just have one question - do you not think that he was a rubber stamp PM? No. He was a leader, Modi is a megalomaniac. LMFAOOO. Hilarious post, the government deserves criticism for sure, but the fact that Congress was a major power for most part after the independence and didn't do much. As for the defence policies let's not talk about those 5 jawans who were beheaded by terrorists and the Manmohan Singh government did nothing. It didn't do anything after the 26/11 attacks either. More roads have been developed in the last 10 years than the 67 years before that. India's image at the global front has improved a lot, CONgress just had very little interest in strengthening ties with more countries. Also to blame your incompetence on ruling party is just delusion lmao. Not being able to field a competent person is also Modi's fault apparently. Don't worry. Have faith. We have defeated fascists before. We are ready for this challenge too. He will not win. [Building the largest political mobilization in Independent India. : IndianSocialists](https://np.reddit.com/r/IndianSocialists/comments/18vvqaw/building_the_largest_political_mobilization_in/) Thanks for speaking out on this and providing sources. I hope people can see through all the smoke one day. I'm not going to take the word of media like you which substantiates your thinking. Just pasting it here, this may or may not be politically motivated. BTW Did I talk about Modi in my entire discussion? The parent thread talked about alternatives, which you provided, I refuted, you called me Chaddi and then started lapping on Manmohan Singh. If you don't have anything to add to the discussion, please start a new thread and post as much hate as you have for Modi there. OP talks about propaganda and then proceeds to do the same.. GST has been a tremendous success as seen by the tax collections and compliances improving..refer RBI studies UPI a massive success DBT plugging leakages, another success Improved financial condition of PSUs..improved road infrastructure connectivity..faster execution of projects India seen as China+1, a global superpower in the making after losing out in the manufacturing bus since independence One of the best handling of Covid among major countries..ensured poor ppl aren’t going hungry through free food grains schemes, but didn’t indulge in destroying the country’s balance sheet like some did..fast tracked vaccination through digital adoption Strengthened the financial sector..NPA at decade lows Strengthened indigenous defence manufacturing..look at the annual report of defence companies Added so many hospitals and medical colleges..steady improvement in doctor/population..ABDM ftw Strong facilitator of transition from dirty coal energy to clean green energy..securing energy security for future..tremendous achievement And finally when all countries globally are facing slowdown, India remains the fastest growing major economy..refer IMF I will say Modi has been the most competent PM in the last 20 years! Yeah but as OP is pointing out \"TINA\" is a coping mechanism for middle class \"educated\" people who are ashamed to admit they are voting on religious grounds like the extremist mullahs in Iran and Pakistan. Practically any of the opposition leaders is better than the current incompetent and corrupt buffoon we have as PM. National Advisory Council was an institution built to draft the opinion and expertise of leaders, academicians, and experts into policy making. NAC led to the drafting of RTI act, Right to Education Act, Right to Food Act, and Right to Work Act. Throughout my post, I have highlighted how Modi Government took senseless decisions, many without consultation, which led to hardships and tragedies. We have two model of leadership, one of Dr Manmohan Singh, who sought the opinion and advice of experts, and one of Modi, who thinks he is supreme intelligence. Our choice is clear. Care to list their positive points? Please identify ONE leader you would vote for, what are the things they stand for, and what they are going to achieve if elected to the centre. > The election is also fought on the promises and track record of the opposition. You need to read more Political literature (like works by Allan Lichtman) and history for this statement is simply false. *In a \"Real\" (which India is) Electoral Democracy, the elections are Referrundum on Incumbents*, whereby the Only condition for Opposition is to simply Exist. And they more than exist in India (Vote Share and even Seat Share is testament to this Objective Fact). IF Opposition has more money, is charismatic, etc etc. That is a Bonus, it is NOT a pre-requisite or fundamental driver of Political structure in such a Real Electoral Democracy. This is how 1977 transition happened, i.e. the only condition for Opposition was to Simply Exist. There was no incentive on them being more competent than Incumbent, because we history showed withing 2-3 years, who was how competent. So no, it doesn't matter who the Opposition Leader even is as long as it exists and it does. It's on the Ballot Box clearly visible. Spoken like someone who doesn't have an ideology to support, just doesn't like the current leadership. > it doesn't matter who the Opposition Leader even is as long as it exists and it does It absolutely matters. The last one year with I.N.D.I.A. has shown that our opposition leaders all have simply too much individual ambitions and cannot coexist to fight the current leadership. Even if they stop bickering till the elections, somehow miraculously agree on a seat sharing formula, and even more miraculously manage to restrict BJP (not NDA, BJP) to less than complete majority, what do you think will happen? These guys will never agree on a consensus leader, max we will have a 16 day govt ala Vajpayee in 1996, and we will have another round of elections. Worst, these guys will eat into each others' vote share and BJP will achieve an even bigger supermajority. After 2024, they will change the constitution. They have been sending feelers through bibek debroys articles. There are no doubts in my mind about this. We might see the Chinese style of the one party rule. India cozying up to Russia defying is an ominous sign. The harsh reality is that all of this is and will be forgotten. The media machine works nonstop blowing the man. During the migrant worker and Covid crises, there was hope that this would wake people up. But that didn't happen at all. And now BJP will win again by a landslide because of the Mandir. It's cruel to say this but if the ones who suffered due to Covid, migrant crisis, unemployment, oppression still go and vote for him in 2024, they deserve all this misery that has befallen over them and will do in the future. We are writing our own end. Yup, Rahul Gandhi is a wonderful leader, much more competent. There is no reason he should not become our next PM. He will take us to new heights and our GDP will rival China. Just see his accomplishments until now. Or take Nitish for example, who has made Bihar into the most progressive and developed state. I'm sure OP with his excellent research skills can point out the fantastic accomplishments of these stalwart leaders. I would have done it myself but don't have so much time. After Nyay Yatra, which is a brilliant idea by the way, to make Rahul Gandhi's face top of mind as elections get closer, I'm pretty sure the alliance bloc will get 300+ seats. It is also good for the market, as it will fall temporarily and give a great buying opportunity, before climbing back up to the current levels towards December. I haven't voted for BJP ever. I've been voting for 22 years now. But this time I'll vote for them because of the opposition's vocal pro-reservation and anti-business policies. What do we do then? Vote but what else? So the BJP introducing 10% reservation for EWS or Modi's masterstrokes for business like demonetization or banning Chinese apps were great for business in your opinion? We will have a democracy still, that's better than what this government will do. Ask any local businessman who they would rather vote for. Even better, look at the market indices and how they react when BJP has won in recent times vis-a-vis when they have lost. I'm sorry, but what is TINA? There is a lot you can do. You can contribute in any way you are able to, write, speak, sing, spread awareness, knock on the door, distribute pamphlets, donate to organizations. Do it part-time or full-time. For the next six months, do whatever you can, and more. So, years later, you'd proudly say, “I did my part.” [79 Years Old Retired Professor Roop Rekha Verma Distributing Pamphlets To Spread Awareness - YouTube](https://www.youtube.com/watch?v=_wpFlYGSrfE) [With pamphlets, on public transport, a retired IIT professor campaigns in MP for ‘right candidates’ - YouTube](https://www.youtube.com/watch?v=ulSghtnLscg&embeds_referring_origin=https%3A%2F%2Fwww.newslaundry.com&source_ve_path=MjM4NTE) Apart from individual work, you can join any organisation. Civil Society Organisations will launch a nationwide campaign in coming weeks. You can join that. You can also help in countering the BJP propaganda, which is intense these days. I'm not surprised that local businessmen are big fans of the one PM who will put profit over people every time. But you didn't answer my question. You're just proving my point. Like most BJP voters you are using obscure arguments to defend voting for them. Whereas the one area they are clearly distinct from the opposition in is their anti poor, anti minority stance. There Is No Alternative. It's a narrative that there is no alternative to Modi. How is Modi not a pro-reservation and an anti-business? His policies suggest otherwise. He implemented 10% EWS which is wrong, bc how can one be against reservation for all but not against EWS. Second, Modi brought back back the horrors of license raj recently, still there are 36 regulators which tightening control over economy. Private investment is bottom but still he's pro-business, dont know how? Modi came in 2014 in the name of economy but did everything instead of working for economy. There's so much taxes that one is crushed, there's tax on tax. Dude literally anyone's better, India will grow regardless. Having narcissistic snowflakes on top effects induces insecurities in every citizen. Any politician is ok if they follow their duties, which they are not and people sadly don't care if they do. A change would be good for reflection. It's so scary how easily people forgot COVID. Also, I was at a medical college at that time and I have seen with my own eyes how many COVID deaths were signed off as some other diagnosis leading to death. Just to show lower numbers on paper. Would it have been better with a different government? I really don't know. Maybe not. But does it mean that we won't hold the current government responsible?? Why do we keep validating these things? Why do we keep worshipping these people? Why are we not questioning them more? Why are we forgetting that they are there to serve us and not the other way around??? Our health care system is suffering. AYUSH quacks are being given more and more rights now instead of increasing the number of government medical colleges and seats. Who will I vote for? Not the ruling party. They have disappointed me in every sphere of my life here in India. My education, my work, my transport, my safety. Maybe they have benefited people other than me, that's respectful, and they can vote for them again. What was your question? 10% reservations for EWS? I'm morally ok with it compared to reservations for SCs, STs, and OBCs Regarding Demonetization? Yes, it did not have as much of an impact as the govt thought it would. Big whoop. So what? Kudos to them for at least trying. Banning Chinese apps? Are you really coming here promoting Chinese apps? Seriously? > doesn't have an ideology to support Thank you. I take that as a Compliment. To not have fundamentalist Dogma guide me, regardless of the content of whatever it may be. > It absolutely matters I trust actual history, reality of the world and academic literature more than your subjective trite. > max we will have a 16 day govt ala Vajpayee in 1996 i.e. Proves my point of how \"REAL\" Electoral Systems work. People Vote on the Incumbent. And if they vote someone back in after 16 days of Incumbency that TOO was because of what they saw happened to/with the Incumebt. Coalition Govt is real thing, it happens all over the world and for current historic era of India it \"May\" (this is non-Objective part of my comment) even be better, even with same current Incumbant, in relative context to how they've gone about so far. Opposition is IRRELVANT, outside of the context of their just existing. And it exists in India. Period. > He implemented 10% EWS which is wrong, bc how can one be against reservation for all but not against EWS. Simple, I've seen too many rich folks exploit reservations. I had a classmate who was an Sikh, whose father was the chief of Delhi's fire department, who used to live in an apartment overlooking the swimming pool of Hyatt, who used to drive a car to college in the days where very few college students had cars. And he was an ST. I have seen numerous stories like these. EWS if implemented correctly is morally correct. Caste based politics is not. I don't understand how you can defend caste based reservations. > Second, Modi brought back back the horrors of license raj recently, still there are 36 regulators which tightening control over economy. Proof? How does that compare to the number of regulators 10 years back? > Private investment is bottom Source? So basically you are ok with reservation and anti business stuff BJP did but will vote for them for the first time ever because of opposition may do the same. Just admit you want a Hindu Pakistan and save yourself the effort of these mental gymnastics What? I'M OK with reservations? Isn't it the OPPOSITION which is clamouring for a Caste Census? Isn't it the opposition parties which are going on and on about increasing ST, SC, and OBC reservations? Just admit it that you don't know an iota bout what's going on in the country and just want to be a contrarian. Dude you are so thick, the other guy explained his point so well, but you are high on some really nice stuff. Again friend. Its perfectly legal to vote out of hatred. You are not helping yourself by contradicting yourself again and again instead of just admitting to it. Modi is anti-business. He destroyed all the small businesses. Large businesses were forcibly acquired by Adani, after being persecuted by Government's agencies. Only a few crony capitalists enjoy tax cuts and loan waivers of 14 lakh crore. Even millionaires are fleeing India. I'm sorry I do not qualify as intelligent for the average sham Sharma fan. Yes this and then modi is practically everywhere like ruling the conscious and sub-concious of the illiterate dumb folks of India, heck they even installed his life size portraits in colleges that too by UGC guidelines so that youths can take selfies with him and then share on socials ! What thugery is this.. I hope dogs take piss on those portraits and then that will be the picture worth sharing ! If there were no demonisation it would be impossible to see this humongous digital growth Now the govt can track all of our transactions online so the income tax filing may increase applying big data technology reservation systems should be only based on individual income so don’t understand why gentlemen is against EWS Upa turned India into dumping ground for China and asean. Banning cheeeni companies is essential for local In-house development Why raga is not choosing arunqchal to start his Bharat nyay yatra( these people can’t do a tiny thing against chin) It seems you are living in separate universe > EWS if implemented correctly is morally correct There's no justification whether moral or academic to any reservations and I'm not defending caste based as well. Reservation is not even affirmative actions like the west practices, here you're determining equality of outcome instead of opportunities. > I'm not defending caste based as well. Then how are you defending the opposition? TINA must be countered with DITA (Democracy is the alternative). the disadvantaged, the lazy, the incompetent and the entitled view this govt as something that needs to be perfect under the closest scrutiny and expect that a misrule of 75 years with well oiled corrupt and lethargic nexus system would just magically perform without flaws. they forgot that only the law makers and governance is what this new part is all about and they need to work through and with filth thats there in most of the people that do not want this govt because they are used to the benefits that camee with the older regimeand ate scared their old way of living is at threat. i wrote in opposition to modi and not in support of opposition. Opposition is as bad as BJP in terms of policies and none of them go for long term solution instead of short term lollipop. Then what's the use of writing against Modi? If all of them are as bad as the BJP, why even get up to vote? Modi fights a presidential type election and thats why a TINA comes in. What you're saying is right in terms of policies, but the way BJP fights the elections- Modi v/s Who makes it a presidential type with no candidate opposing him similar to Indira. Why is Modi unable to speak China's name, even after they captured our territory. Why is Jaishankar saying that India cannot stand up against China? Why did they demolish the memorial of Major Shaitan Singh, who fought till the last man and the last bullet against Chinese Army? Modi is a Chinese agent sent by Xi Jinping to destroy India from within. > Narendra Modi is the most incompetent and useless Prime Minister in the history of India This alone puts your credibility in the ground. Electric connectivity, infra, cylinders, toilets, trains, allowing private companies in defense, selling Air India, making petrol a revenue generating stream, 370, Mandir. He's not gonna have three terms as PM (with the first simple majority since the 80s) for nothing. All true. But Indian vote for personality. Not policy. Failure after failure will not deter modi voters Forgotten about [\"Cloud hain, benefit hoga\"](https://www.youtube.com/watch?v=I1ewyQ_Ceqg) disasterstroke already? An important strategic decision could have been jeopardized by the raw wisdom of our know-it-all versatile genius. This guy has our nation's nuclear codes! >Just see his accomplishments until now. He, at the very least, didn't get people killed in massive riots and genocides. I count that as an absolute win. But then again, I value human life so maybe I'm just behind the curve. The fact that OP thinks Sitaram Yechury would be a better PM than Modi destroys all credibility from this post. For majority of voter \" but mandir to ban Raha hai na \" election were never won on economic alone mostly won on emotional issues . You forgot the /s That’s nice and all but this circular logic is not going to work on the ground. They have been trying it for 10 years and nothing is working. Kejriwal won a landslide in Delhi not because he came and said “I haven’t done anything so far so you might as well vote for me.” He had a clear vision, good image, had good credentials and showed a PROMISE of better governance. What happened after that is another story, but that is the ONLY way anyone has a shot at displacing the current party. All this “modi bad we are best we are clean not corrupt” has not worked for 10 years and keeping on doing the same thing will not work, at least in 2024. By 2029 when things have gone to some kind of extreme, it might rebalance and people will vote in some other party. Right now just like sensex, the rally is continuing without a stop and no one knows why. Yup , India is on the path of becoming a Super Power. Thats the reason so many people are leaving India via the \"Dunki\" route to spread this message all over the world.... I am curious to know what good this government has done in the past 10 years This is an outstanding write up. Way above 'reddit paygrade' I must say. Infrastructure, especially roads-National Highways, expressways which we badly needed >That’s nice and all but this circular logic What circular logic? >They have been trying it for 10 years and nothing is working. Because the illiterate North India was ripe for brainwashing with propaganda and BJP realised that, leveraged it before they realised what happened. >Kejriwal won a landslide in Delhi not because he came and said “I haven’t done anything so far so you might as well vote for me.” A large part of it was over the ashes of Congress rule. People were riled up and we're proactively looking for an alternative. >By 2029 when things have gone to some kind of extreme, it might rebalance and people will vote in some other party. If you still have voting rights left by then, sure. >Right now just like sensex, the rally is continuing without a stop and no one knows why. I know why. A lot of it has to do with the most basic human psychology i.e. the us vs them narrative that's being peddled. Used to work great in the stone age because violence was the norm and so any other tribe approaching your hunting/feeding/breeding grounds was seen as an act of war because more often than not, they pose a threat to your livelihood and your family. In the 21st century, we're long past that. BUT we're descendants of those who were paranoid because that helped them survive long enough to bear children and natural selection ensured the paranoid survive. The civilization we built afterwards has no utility for this paranoia but we still have these instincts. That's why Hindus are constantly in danger of being wiped out. It just appeals to that deeply ingrained paranoia within our DNA that our ancestors have cultivated generation after generation. The world we live in no longer has the need for that but it feels good, just like sex, eating , drinking water satisfies our survival instincts and those who had sex, water and food were the ones who survived long enough for their descendants to love these activities. In the same way, in-group, out-group dynamics are woven into our DNA. But the better man is not the one who gives into them, the better man is one who realises that just like our appendix, it no longer has any utility and discards it in favour of a just, democratic society. I like the increased rate of petrol is branded as \" making petrol a revenue generating stream \". What do you really drink? Please don't feed my ego. :D On a serious note, I regularly write on important political issues, many of which are available on my profile. Okay, fuck the petrol. What about the rest? Fastest growing economy, highest forex reserves ever, buying petrol with INR, solar panels, quad agreements. Dude we can go on and on. I don't like their govt, I don't like the bitch moves they do like changing the way to calculate inflation or not bring PM Cares under RTI, or using the EC to obviously go after their opponents, or sidelining the President or bullying opposing media houses or selling everything to Adani. Censoring media, taking us back decades socially by injecting communal poison in the community, nepotism shoved down our faces every time we see a cricket match, suspending opposition MPs when they've gotten away with much worse. They're no saints, they might not be the best administrators we have (the bar is actually quite low, we've had some shitty politicians), but useless they definitely are not. They've got **a lot** of shit done and not all of it is bad. GST was always gonna be rocky, demonetization was an experiment which literally no economist worth their salt would claim the outcome of, Pulwama was avenged in the most OG way possible, Modi never denied the existence or severity of COVID unlike many, many worldwide leaders, he encouraged people to get vaccinated and stay safe. Manipur was always gonna come to a boil, but the internet censorship was wrong and an outdated way of maintaining peace. \\> The fact that OP thinks Sitaram Yechury would be a better PM than Modi destroys all credibility from this post Where did you find that? In any case argument is \\_anybody\\_ will be better than Modiji. It is bit rhetorical , but I have no problem with it. \\> sidelining the President or bullying opposing media houses or selling everything to Adani I am with you. Real point is govt glorifies its action by 10 times, people should be able to criticize it similar way. Modi came because Congress was bad. Only way to know more about bad deeds of BJP is get different govt and start digging to its files. I said it in 2021, as I saw people lying dead on the streets I grew up in, that all this will be forgotten by the next election. Government got lucky with the timing of Covid and second wave. Three years is a long enough time for them to shove everything under the rug using the current media landscape Might just be me, but I think this is a symptom of Indians being lazy people. In any walk of life, in any industry, if you look for the laziest bunch, you’re certain to find some Indians in there. We’ve had the same mentality all along. Why else would the Nehru family still be the main alternative (Rahul Gandhi). We never bothered to diversify the most powerful people. And now we’re paying for it. Tbh, even time doesn't matter now. The Manipur violence is pretty recent, and people don't even talk about it anymore. The strategic timing of Nari Shakti Vandan Adhiniyam, which was promised in the 2014 manifesto, actually had me in awe of their genius. The first bill to be passed in the new parliament. It's just plain genius. I wish people read more history (world history) of how propaganda works. > Only way to know more about bad deeds of BJP is get different govt and start digging to its files. Not a good enough reason to kick them to the curb, to be honest. There are many reasons, but you need to acknowledge what they've done and not be one note about it. ~60% of the country is rural, tell the beneficiaries of electricity, cylinders, gas stoves and toilets about the media censorship or communal disharmony and they'll laugh in your face. Talk about how you can do better for them, don't be a Mac using, Starbucks sipping liberal while ignoring ground realities because those people are sick of being talked down to. [Here](https://www.reddit.com/r/india/s/1rGrXw4xjf) BJP is run by a bunch of ruthless master minds. Modi is just an actor who is made to believe that he has the power. The real players are hidden. The timing of things done by them is also astonishing. I hope they get destroyed through infighting.As long as Indians believe in propaganda BJP will cling to power. Just so you know, market indices performed better at the time of UPA government. You can check it anywhere. Sure. Here are some of the top reasons why all of the opposition leaders are better than Modi, so there is no need to talk about any one in particular. ~ None of them oversaw and facilitated genocidal riots that resulted in killing of thousands of people. ~ None of them have caused the most number of historical level disasters under one prime minister due to the incompetence and corruption of their administration. ~ None of them have led an authorotarian govt that have destroyed the democratic institutions of India. ~ None of them are going to turn India into a religious extremist country like its neighbor to the west is. ~ None of them are bigger narcissists and blatant liars. The only reason one would prefer Modi over others is if all they care about is the Hindutva agenda. In that case yes Modi is the obvious choice. I think OP has done a good job in capturing how Modi has been a failure in every other way. \\> acknowledge what they've done ? Everyday that comes to me by way of whatsapp message.All the things listed have implementation issues, like any govt schemes. Be it swachch bharat, or water supply schemes or what not. Or his friendship with Adani. The media unable to meet Modi and question him. When that happens all these \"facade\" of development will comedown. Poor will get their share even if any other party now comes to power. Case point is almost any state - Telengana (BRS , till recently) , Andhra(YSR), Karanataka (Congress). Almost all parties now recognize need of taking care of the poorest folks. UPA government was 10 years ago. Let's live in the present, shall we? UPI is a massive success ... scamsters agree! Amritkaal refugees. So if I understand correctly, none of them have actually done anything in their career. Am I right? > tell the beneficiaries of electricity, cylinders, gas stoves and toilets about the media censorship or communal disharmony and they'll laugh in your face. Do you know the cost of a cylinder? People will spit in your face if ask them if they are happy with what the price of gas is. How did you come to that conclusion? Nowhere I said that.I simply pointed out how they are better than Modi. What are their achievements? People in UP are happy to have reduced Gunda raj C'mon. You cannot dismiss UPI with that sort of a throwaway remark. It remains one of the greatest fintech products of the modern world You should write for The Onion. Brilliant Curious to hear your thoughts on something, u/rishianand. Imo one of the largest flaws of the Indian state of the oversized strength and reach of the executive. Given that the executive is formed by the legislative in our parliamentary democracy, it essentially renders the legislative body powerless to the wishes of the leaders of any ruling political party. I feel our democracy could benefit from a greater seperation of powers where our legislative would function independently and our executive is elected through a presidential-style election. Any thoughts on this? Do you see any ways this sort of systematic upheaval could happen? It might need to be a completely citizen driven project given that it would mean the stripping away of powers from the currently powerful People will say 10 rupees is too expensive. It costs what it costs, but they've given cylinders out for free and gotten them off the chulha. 20% of the recipients will never use it, and that will be shown in the media, but for the rest, Modi just did them a solid. > all these \"facade\" of development will comedown See, keep denying all his work. It's a good way to get people to ignore you. You are right on the money. But, our public has drunk the religious kool aid they have offered. I think we will hit rock bottom and only then will ppl realise... It will take another 2 terms for it... Chooste raho. Opposition failed to win despite these issues Lol. The alternatives ***are*** the star campaigner of BJP. Everytime they open their mouth, more and more people lean towards voting for bjp. India will end up like Pak/Iran in about 15 years. 100% guarantee. Iran is a very likely path. I don't know if the world is ready for such a large country and economy in a theocracy. There are multiple gangrapes happening UP (BHU, Agra) but I guess doing 1 hr show on Ayodhya temple is more important on larger scheme of things. Shame on news media channels. The world will need to be ready for refugees. Fact check: After the Covid first wave, during the UN General Assembly Modi had claimed that India had defeated Covid and now helping the other countries with vaccines. During the WB elections, Modi came just near my town and louded people for showing up in large numbers in the peak of second Covid cycle. GOI did not place any order of homegrown vaccine when it could have increased the production. That perhaps was the reason that the second wave was massive. And when asked for how many people died in the country, then govt showed that they have no data. That being said, GOI did start to work only after peak second wave otherwise it would have been much wider disaster. Modis biggest achievement has been properly implementing UPA policies. (NPA was Raguram Rajan) His biggest weakness has been trying to use his own brain and setting the nation back with disastrous policies I will give him credit on military to some extent but we actually havent seen the government side of the MIC doing all that much better under Modi. Hal hasnt taken some major leap. It is doing what it always has done. Slowly but surely move ahead and no ability to move quickly. I think it will be more of this TBH...just leave behind everyone who doesn't have the money to get out. [https://thewire.in/world/india-has-the-worlds-biggest-diaspora](https://thewire.in/world/india-has-the-worlds-biggest-diaspora) With a side dose of Chinese surveillance. Leftist echo post Of course all the opposition leaders have different achievements. They are not all the same. They have been leaders of their party, MPs, MLAs, ministers, most are well educated with real, not fake, degrees. Much like achievements of several other PMs when they became PM for the first time. My comment was about how any opposition leader is better than Modi and I have explained the top reasons. So you agree with that right? Here's an analogy - when selecting between two people for a job, if one is not only a known criminal but also caused a series of disasters due to their incompetence, it is better to give the other person a chance. Do you really think people care about something as abstract as this? Even if your suggestion would benefit us, there are ten other suggestions which are simpler and would produce bigger benefits: 1. make government finances transparent at the micro level. 2. improve the police system, so it's easier to live and run businesses 3. pretend to have a secular state. 4. mass education on socialist values so that the benefits of socialist schemes reach the most remote. 5. social reform i could just go on. I'm still waiting to hear their achievements. Already given. Being the leader of a party is not an achievement. Especially a regional party with no pan national recognition. Having a degree is also not an achievement. Be specific. Which leader do you want to vote for. Name them. Defend them. What sort of a useless reply is this lmao? Out of curiosity, I asked a specific question about specific aspect of the Indian political system, and you reply with irrelevant, inane shit like “social reform” and “pretend to have a secular state”? You clearly have no idea what’re you’re even talking about lol. Gtfo, mate. Stop being rude, read more, and improve your comprehend skills before you bother replying to anyone. Tell me what's wrong with introduction of UPI? Because opposition even if it’s bad is important for democracy Bruhh low level immigration China se bhi hoti hain....itna ghatiya deemag kaha se laate ho. Immigration of the best of the best has stopped.....only the tier 2 level guys migrate. Tbh bjp policies are much better than the opposition offers....half of the data given here is plain info especially galwan clashes... Wtf....verify these things yourself....half of it here is misinfo..... If yogendra yadav is a credible source....then Sonia Gandhi is Rajmata. I was wondering when the what-aboutism would roll in. Congress wasn't great and therefore isn't in power right now. So, you agree that should happen to the BJP too, right? > Not being able to field a competent person is also Modi's fault apparently. The post is a rant. It doesn't say the opposition's inability to field a good candidate is somehow on Modi. It talks about Modi/BJP government's poor performance so far and their continued support regardless. In the truest sense of democracy and a republic government, Modi and BJP definitely have failed miserably. However, Modi/Shah are astute politicians and have considerably weakened pillars of Indian democracy one by one. Controlling the narrative via complete media control worked great for them. My concern is if this continues, there's no motivation left for a non-BJP (or non-NDA) government to not abuse the same overreach of executive powers using the exact same precedents set by the current government. I don’t agree with the farm laws thing though. Both sides had bigwigs pushing their agenda with little to no concern for struggling farmers. Agreed Agreed . U must be from bjp it cell UPI and DBT are UPA policies. Actually, many of the highly profitable PSUs have been pushed under debt. [ONGC: Modi government drove India’s most profitable company under a mountain of debt](https://scroll.in/article/898171/ongc-woes-how-modi-government-drove-indias-most-profitable-company-under-a-mountain-of-debt) Manufacturing growth has slowed down under the Modi Government. Last FY, manufacturing grew at 1.3%. Over the last five years, it grew at 3.4%, against the 9.1% during UPA. Number of jobs in manufacturing sector has similarly declined. [As ‘Make in India’ Enters 10th Year, What Does the Government’s Silence Mean? ](https://thewire.in/article/make-in-india-10-years-government-silence) Modi Government grossly mishandled the pandemic, and ignored scientific advice. [Harsh Mander: Despite warnings, the Modi government had let India sleepwalk into the second wave](https://scroll.in/article/1020376/harsh-mander-despite-warnings-modi-government-had-let-india-sleepwalk-into-the-second-wave) NPA increased substantially under Modi Government. This is after the fact that over 14 lakh crore of bad loans were written off. [Gross NPAs more than three times up in NDA rule, says RBI data- The New Indian Express](https://www.newindianexpress.com/business/2021/jan/11/gross-npas-more-than-threetimes-up-in-nda-rule-says-rbi-data-2248365.html) I think Modi bhakts don't check facts before doing propaganda. Haha. Chaddi fantasy. The fact is that you know how much this post destroys your daddy's credibility, so you came here to find gotcha moment. Sitaram Yechury is a million times better leader than Modi. He was leading the student movement against Indira Gandhi, when Modi was playing imposter game. Yechury called her on her face that she must resign and gave a list of reasons. He was the a real gigachad. Yechury is more learned and competent than the entire Modi cabinet put together. All my facts of my post stay chaddi boy. Try as you may. Nope.. that was a creation of the fascist narrative... MS had to perform on a tightrope because of the multiple parties constituting the UPA 2.. but he did a good job considering the circumstances... I have already done all of that. I have given the reasons to support my initial claim. OTOH you haven't provided a single reason to show how an uneducated moron with a fake degree who has already proven to be a failure as PM is better than any opposition leader (come on show some whatsapp university knowledge 😉). It is always fun to see people come up with excuses if their question gets answered when they weren't expecting to. When did UPI and DBT get implemented? Clearly it took u a lot of time to research and yet the best u can come up with plain old lies you are so desperate man , atlest if you are being pr then be like one isnted calling out random one who critisizes or speaks against you as chaadi To add to this, The current government is refuting the studies, surveys and rankings done by international organizations, calling it International Propaganda, false methodology and what not. Press Freedom Index, Hunger Index, Women Peace and security index, world press freedom index. I can keep on going. You want to develop your country, fine. But atleast acknowledge the issues in the governance that is being pointed out. Refuting the surveys and Indexes just shows that you have no clue on how to develop your country. Bruhhh come on.... yogendra yadav is literally a politician and sources are literally biased...check yourself.... don't suck RaGa's balls all the time. BJP have no policy makers. They are effectively implementing congress policy, no doubt. but when it comes to creating new policy, they cannot tell the ass end from the front end of a donkey. I wanted to say something but then I realized chodee got banned, I see your presence makes sense now You are living in delusion. Well, you are entitled to your opinion Because most of land was always captured by 2013/14 Read about depsang bulge >I'M OK with reservations? Isn't it the OPPOSITION which is clamouring for a Caste Census? The fuck? Advocating for caste census is advocating for caste reservation? I am talking about talent pool...not the ultra rich ones.... don't talk dumb.... There might be 1 billion alternatives but Indian people have only a few options:- RaGa:- Always going GaGa Nitish:- Alias palturam Mamta:- you don't want her if you have been to Bengal Kejriwal:- Bigger u turner than imran khan In these options only one is getting projected RaGa. The less said about him the better."
}