{
    "id": "1czfpe7",
    "title": "#VoterPrivacyWatch | We’ve been tracking how political parties use mobile apps to identify & profile voters, potentially compromising their data privacy for a range of political gains. Here’s a rundown of some such apps we’ve come across & the risks they pose. ",
    "url": "https://www.reddit.com/r/india/comments/1czfpe7/voterprivacywatch_weve_been_tracking_how/",
    "selftext": "**1️⃣ BJP’s NaMo App**\n\nThe app uses a range of permissions, trackers, & user data to send customised party updates (eg. using location to notify users when the PM is in their state). It’s been under fire for problematic data practices & potential voter profiling concerns. \n\nNaMo app’s default permission settings gives it nearly full access to the data stored on users’ phones, including photos & videos, contacts, location services, & the ability to record audio. One can opt out by disabling the permissions for those features—but not many may end up doing so.\n\nThere is also an institutional push for the app—state govts, mobile phone companies, & even govt-funded schools—have been bundling, pre-installing, or enforcing the NaMo app through their products & schemes. \n\n[https://www.business-standard.com/article/elections/free-mobile-schemes-in-election-states-jio-gets-customers-govts-get-data-118100100351\\_1.html](https://www.business-standard.com/article/elections/free-mobile-schemes-in-election-states-jio-gets-customers-govts-get-data-118100100351_1.html)\n\n\n\n**2️⃣  TDP’s WeApp**\n\nThe YSR Congress Party recently lodged a complaint with ECI alleging that TDP was using its new WeApp to profile voters & bribe them for votes through UPI transfers.\n\n[https://www.boomlive.in/decode/ysrcp-accuses-tdp-voter-profiling-bribery-weapp-voter-data-scandal-andhra-pradesh-eci-elections-2024-25339](https://www.boomlive.in/decode/ysrcp-accuses-tdp-voter-profiling-bribery-weapp-voter-data-scandal-andhra-pradesh-eci-elections-2024-25339) \n\nLimited publicly available information suggests that WeApp collects detailed data on voters (dead or alive) at the booth level–on family & residence, contact, occupation, caste, political leanings. WeApp is not on app stores & is distributed locally through TDP volunteers. 🥶 \n\n**3️⃣BJP’s Saral App**\n\nBJP uses the ‘Sangathan Reporting & Analysis’ app to directly engage w voters, collecting user photo, contact, address, age, gender, religion, social category like tribe & caste, constituency, voter identity no., professional & educational details... phew.\n\nSaral’s privacy policy further allows it to collect detailed device & location information—experts worry that the scale & depth of this data collection exercise may allow BJP to successfully target & appeal to voters at a granular level. \n\n[https://restofworld.org/2024/bjp-saral-app-data-gathering/](https://restofworld.org/2024/bjp-saral-app-data-gathering/) \n\nWell, is any of this legal? ECI recently issued an advisory against voter data collection under the guise of ‘surveys’ promising benefits, & classified this as a violation of Section 123(1) (Bribery) of the Representation of the People Act, 1950. \n\n[https://elections24.eci.gov.in/docs/JYX9Tcz0En.pdf](https://elections24.eci.gov.in/docs/JYX9Tcz0En.pdf) \n\nBut ECI is late to the party, literally. The advisory does not solve for the scale & depth of sensitive personal voter data political parties have amassed over the years, which they are now using for political gains. \n\nWatch the space for IFF’s deepdive on these apps & the law.\n\n[https://freeandfair.in](https://freeandfair.in)",
    "flair": "Policy/Economy",
    "score": 52,
    "num_comments": 6,
    "created_utc": 1716538225.0,
    "convurl": "https://external-preview.redd.it/9WHYuF5pb50wcDu-wK8VGiRTDyWc5H1ey8VRepXhQWg.jpg?auto=webp&s=2669a53f3beaff07ed7c5f13520017933063a388",
    "comments": [
        "why would anyone use these apps to begin with?",
        "Because PM said so.",
        "Do you know that some phones are literally baked this software built-in ?",
        "No party can stoop as low as BJP\nI hope they lose this time",
        "Too late for that, 2029 is our year",
        "With current situation i doubt there will be fair elections in future, it will be now or never"
    ],
    "cleaned_text": "voterprivacywatch weve tracking political parties use mobile apps identify profile voters potentially compromising data privacy range political gains heres rundown apps weve come across risks pose bjps namo app app uses range permissions trackers user data send customised party updates eg using location notify users pm state fire problematic data practices potential voter profiling concerns namo apps default permission settings gives nearly full access data stored users phones including photos videos contacts location services ability record audio one opt disabling permissions featuresbut many may end also institutional push appstate govts mobile phone companies even govtfunded schoolshave bundling preinstalling enforcing namo app products schemes httpswwwbusinessstandardcomarticleelectionsfreemobileschemesinelectionstatesjiogetscustomersgovtsgetdatahtmlhttpswwwbusinessstandardcomarticleelectionsfreemobileschemesinelectionstatesjiogetscustomersgovtsgetdatahtml tdps weapp ysr congress party recently lodged complaint eci alleging tdp using new weapp profile voters bribe votes upi transfers httpswwwboomliveindecodeysrcpaccusestdpvoterprofilingbriberyweappvoterdatascandalandhrapradeshecielectionshttpswwwboomliveindecodeysrcpaccusestdpvoterprofilingbriberyweappvoterdatascandalandhrapradeshecielections limited publicly available information suggests weapp collects detailed data voters dead alive booth levelon family residence contact occupation caste political leanings weapp app stores distributed locally tdp volunteers bjps saral app bjp uses sangathan reporting analysis app directly engage w voters collecting user photo contact address age gender religion social category like tribe caste constituency voter identity professional educational details phew sarals privacy policy allows collect detailed device location informationexperts worry scale depth data collection exercise may allow bjp successfully target appeal voters granular level httpsrestofworldorgbjpsaralappdatagatheringhttpsrestofworldorgbjpsaralappdatagathering well legal eci recently issued advisory voter data collection guise surveys promising benefits classified violation section bribery representation people act httpselectionsecigovindocsjyxtczenpdfhttpselectionsecigovindocsjyxtczenpdf eci late party literally advisory solve scale depth sensitive personal voter data political parties amassed years using political gains watch space iffs deepdive apps law httpsfreeandfairinhttpsfreeandfairin ",
    "cleaned_title": "voterprivacywatch weve tracking political parties use mobile apps identify profile voters potentially compromising data privacy range political gains heres rundown apps weve come across risks pose",
    "cleaned_selftext": "bjps namo app app uses range permissions trackers user data send customised party updates eg using location notify users pm state fire problematic data practices potential voter profiling concerns namo apps default permission settings gives nearly full access data stored users phones including photos videos contacts location services ability record audio one opt disabling permissions featuresbut many may end also institutional push appstate govts mobile phone companies even govtfunded schoolshave bundling preinstalling enforcing namo app products schemes httpswwwbusinessstandardcomarticleelectionsfreemobileschemesinelectionstatesjiogetscustomersgovtsgetdatahtmlhttpswwwbusinessstandardcomarticleelectionsfreemobileschemesinelectionstatesjiogetscustomersgovtsgetdatahtml tdps weapp ysr congress party recently lodged complaint eci alleging tdp using new weapp profile voters bribe votes upi transfers httpswwwboomliveindecodeysrcpaccusestdpvoterprofilingbriberyweappvoterdatascandalandhrapradeshecielectionshttpswwwboomliveindecodeysrcpaccusestdpvoterprofilingbriberyweappvoterdatascandalandhrapradeshecielections limited publicly available information suggests weapp collects detailed data voters dead alive booth levelon family residence contact occupation caste political leanings weapp app stores distributed locally tdp volunteers bjps saral app bjp uses sangathan reporting analysis app directly engage w voters collecting user photo contact address age gender religion social category like tribe caste constituency voter identity professional educational details phew sarals privacy policy allows collect detailed device location informationexperts worry scale depth data collection exercise may allow bjp successfully target appeal voters granular level httpsrestofworldorgbjpsaralappdatagatheringhttpsrestofworldorgbjpsaralappdatagathering well legal eci recently issued advisory voter data collection guise surveys promising benefits classified violation section bribery representation people act httpselectionsecigovindocsjyxtczenpdfhttpselectionsecigovindocsjyxtczenpdf eci late party literally advisory solve scale depth sensitive personal voter data political parties amassed years using political gains watch space iffs deepdive apps law httpsfreeandfairinhttpsfreeandfairin",
    "cleaned_comments": "would anyone use apps begin pm said know phones literally baked software builtin party stoop low bjp hope lose time late year current situation doubt fair elections future never",
    "light_cleaned_title": "#VoterPrivacyWatch | We’ve been tracking how political parties use mobile apps to identify & profile voters, potentially compromising their data privacy for a range of political gains. Here’s a rundown of some such apps we’ve come across & the risks they pose.",
    "light_cleaned_selftext": "**1️⃣ BJP’s NaMo App** The app uses a range of permissions, trackers, & user data to send customised party updates (eg. using location to notify users when the PM is in their state). It’s been under fire for problematic data practices & potential voter profiling concerns. NaMo app’s default permission settings gives it nearly full access to the data stored on users’ phones, including photos & videos, contacts, location services, & the ability to record audio. One can opt out by disabling the permissions for those features—but not many may end up doing so. There is also an institutional push for the app—state govts, mobile phone companies, & even govt-funded schools—have been bundling, pre-installing, or enforcing the NaMo app through their products & schemes. [https://www.business-standard.com/article/elections/free-mobile-schemes-in-election-states-jio-gets-customers-govts-get-data-118100100351\\_1.html](https://www.business-standard.com/article/elections/free-mobile-schemes-in-election-states-jio-gets-customers-govts-get-data-118100100351_1.html) **2️⃣ TDP’s WeApp** The YSR Congress Party recently lodged a complaint with ECI alleging that TDP was using its new WeApp to profile voters & bribe them for votes through UPI transfers. [https://www.boomlive.in/decode/ysrcp-accuses-tdp-voter-profiling-bribery-weapp-voter-data-scandal-andhra-pradesh-eci-elections-2024-25339](https://www.boomlive.in/decode/ysrcp-accuses-tdp-voter-profiling-bribery-weapp-voter-data-scandal-andhra-pradesh-eci-elections-2024-25339) Limited publicly available information suggests that WeApp collects detailed data on voters (dead or alive) at the booth level–on family & residence, contact, occupation, caste, political leanings. WeApp is not on app stores & is distributed locally through TDP volunteers. 🥶 **3️⃣BJP’s Saral App** BJP uses the ‘Sangathan Reporting & Analysis’ app to directly engage w voters, collecting user photo, contact, address, age, gender, religion, social category like tribe & caste, constituency, voter identity no., professional & educational details... phew. Saral’s privacy policy further allows it to collect detailed device & location information—experts worry that the scale & depth of this data collection exercise may allow BJP to successfully target & appeal to voters at a granular level. [https://restofworld.org/2024/bjp-saral-app-data-gathering/](https://restofworld.org/2024/bjp-saral-app-data-gathering/) Well, is any of this legal? ECI recently issued an advisory against voter data collection under the guise of ‘surveys’ promising benefits, & classified this as a violation of Section 123(1) (Bribery) of the Representation of the People Act, 1950. [https://elections24.eci.gov.in/docs/JYX9Tcz0En.pdf](https://elections24.eci.gov.in/docs/JYX9Tcz0En.pdf) But ECI is late to the party, literally. The advisory does not solve for the scale & depth of sensitive personal voter data political parties have amassed over the years, which they are now using for political gains. Watch the space for IFF’s deepdive on these apps & the law. [https://freeandfair.in](https://freeandfair.in)",
    "light_cleaned_comments": "why would anyone use these apps to begin with? Because PM said so. Do you know that some phones are literally baked this software built-in ? No party can stoop as low as BJP I hope they lose this time Too late for that, 2029 is our year With current situation i doubt there will be fair elections in future, it will be now or never"
}