{
    "id": "1c0jtjy",
    "title": "Approaching court to stop \"over-apartmentalization\" of residential areas?",
    "url": "https://www.reddit.com/r/india/comments/1c0jtjy/approaching_court_to_stop_overapartmentalization/",
    "selftext": "Hello,  \nIn Delhi-NCR i've seen this widespread phenomena where local builders buy up property/plots of land from single duplex type house owners, then demolish the duplex house and build an apartment with 8-16 apartments on it and sell them off.\n\nI have even seen cases where one large residential house was demolished and turned into 3 seperate 1 BHK housing apartments.\n\nGenerally this happens in cases where the house was built by parents or grandparents and inherited by their children, who sell it off to a local builder and divide the money between themselves to buy an apartment somewhere else.\n\nThis would have been fine in limited capacity or in a planned way, but it is happening too much and too fast.\n\nIt has led to entire areas (for ex: Shalimar Garden is an old example) colonies and apartments being overpopulated because on same piece of where one family used to live, now 10-16 families live.\n\nThis causes parking issues, too much pressure and choking of traffic on the internal and arterial roads, ground water supply, sewage, parks maintenance issues, electricity issues etc.\n\nAs far as i know the govt seems pretty happy with it and is satisfied gobbling up the registry fees.\n\nIn my research i have found only one case: [https://timesofindia.indiatimes.com/city/chandigarh/stilt-plus-4-floor-bldgs-cannot-be-constructed-in-pkl-orders-hry/articleshow/97934273.cms](https://timesofindia.indiatimes.com/city/chandigarh/stilt-plus-4-floor-bldgs-cannot-be-constructed-in-pkl-orders-hry/articleshow/97934273.cms)\n\nCan i approach the court to put a limit on this?",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1712750419.0,
    "convurl": "https://external-preview.redd.it/N91eBoEtUbDYK3_nvn7tg4pWzRex2XkxoAKGuEDPAFU.jpg?auto=webp&s=91eb11370dedeaca44746bf77e20293ac77b0d70",
    "comments": [
        "Dude Delhi seriously needs more mixed use and high density housing spaces. I don't think that this city has the luxury of Duplexes and other fancy houses. Like, the entire reason that NCR exists is to shift the housing burden to bordering cities.\n\nAs for the parking, traffic issues, ground water supply, and other things, I agree with you. Just housing more people is not going to solve the issue. We need to accelerate the access to public transportation, water, and electricity at a similar rate, and while Delhi is good on these issues, there are still things to be desired.\n\nI think if you want to demand action, you should demand that these other services be handled better.",
        "I agree! That is what i have always supported as well.\n\nI live in one such place too. If you see carefully, i mentioned \"*OVER*-apartmentalization\". \n\nThe problem is these apartments are coming in a haphazard manner and in old areas that are not designed to cope up with the demand.  I doubt building codes are being followed. There's zero spaces between buildings.\n\nFor example - Many times the high voltage main electricity supply line to the apartments is not even underground but hanging over the ground by taking a connection from the pole.\n\nIt leads to zero accountability when it comes to shared resources such as the roads , parks etc , and the population density is so how no one gives a crap.\n\nMany times the roads have become choked due to excess apartment ramps and fights among residents due to parking spaces is common."
    ],
    "cleaned_text": "approaching court stop overapartmentalization residential areas hello delhincr ive seen widespread phenomena local builders buy propertyplots land single duplex type house owners demolish duplex house build apartment apartments sell even seen cases one large residential house demolished turned seperate bhk housing apartments generally happens cases house built parents grandparents inherited children sell local builder divide money buy apartment somewhere else would fine limited capacity planned way happening much fast led entire areas ex shalimar garden old example colonies apartments overpopulated piece one family used live families live causes parking issues much pressure choking traffic internal arterial roads ground water supply sewage parks maintenance issues electricity issues etc far know govt seems pretty happy satisfied gobbling registry fees research found one case httpstimesofindiaindiatimescomcitychandigarhstiltplusfloorbldgscannotbeconstructedinpklordershryarticleshowcmshttpstimesofindiaindiatimescomcitychandigarhstiltplusfloorbldgscannotbeconstructedinpklordershryarticleshowcms approach court put limit ",
    "cleaned_title": "approaching court stop overapartmentalization residential areas",
    "cleaned_selftext": "hello delhincr ive seen widespread phenomena local builders buy propertyplots land single duplex type house owners demolish duplex house build apartment apartments sell even seen cases one large residential house demolished turned seperate bhk housing apartments generally happens cases house built parents grandparents inherited children sell local builder divide money buy apartment somewhere else would fine limited capacity planned way happening much fast led entire areas ex shalimar garden old example colonies apartments overpopulated piece one family used live families live causes parking issues much pressure choking traffic internal arterial roads ground water supply sewage parks maintenance issues electricity issues etc far know govt seems pretty happy satisfied gobbling registry fees research found one case httpstimesofindiaindiatimescomcitychandigarhstiltplusfloorbldgscannotbeconstructedinpklordershryarticleshowcmshttpstimesofindiaindiatimescomcitychandigarhstiltplusfloorbldgscannotbeconstructedinpklordershryarticleshowcms approach court put limit",
    "cleaned_comments": "dude delhi seriously needs mixed use high density housing spaces dont think city luxury duplexes fancy houses like entire reason ncr exists shift housing burden bordering cities parking traffic issues ground water supply things agree housing people going solve issue need accelerate access public transportation water electricity similar rate delhi good issues still things desired think want demand action demand services handled better agree always supported well live one place see carefully mentioned overapartmentalization problem apartments coming haphazard manner old areas designed cope demand doubt building codes followed theres zero spaces buildings example many times high voltage main electricity supply line apartments even underground hanging ground taking connection pole leads zero accountability comes shared resources roads parks etc population density one gives crap many times roads become choked due excess apartment ramps fights among residents due parking spaces common",
    "light_cleaned_title": "Approaching court to stop \"over-apartmentalization\" of residential areas?",
    "light_cleaned_selftext": "Hello, In Delhi-NCR i've seen this widespread phenomena where local builders buy up property/plots of land from single duplex type house owners, then demolish the duplex house and build an apartment with 8-16 apartments on it and sell them off. I have even seen cases where one large residential house was demolished and turned into 3 seperate 1 BHK housing apartments. Generally this happens in cases where the house was built by parents or grandparents and inherited by their children, who sell it off to a local builder and divide the money between themselves to buy an apartment somewhere else. This would have been fine in limited capacity or in a planned way, but it is happening too much and too fast. It has led to entire areas (for ex: Shalimar Garden is an old example) colonies and apartments being overpopulated because on same piece of where one family used to live, now 10-16 families live. This causes parking issues, too much pressure and choking of traffic on the internal and arterial roads, ground water supply, sewage, parks maintenance issues, electricity issues etc. As far as i know the govt seems pretty happy with it and is satisfied gobbling up the registry fees. In my research i have found only one case: [https://timesofindia.indiatimes.com/city/chandigarh/stilt-plus-4-floor-bldgs-cannot-be-constructed-in-pkl-orders-hry/articleshow/97934273.cms](https://timesofindia.indiatimes.com/city/chandigarh/stilt-plus-4-floor-bldgs-cannot-be-constructed-in-pkl-orders-hry/articleshow/97934273.cms) Can i approach the court to put a limit on this?",
    "light_cleaned_comments": "Dude Delhi seriously needs more mixed use and high density housing spaces. I don't think that this city has the luxury of Duplexes and other fancy houses. Like, the entire reason that NCR exists is to shift the housing burden to bordering cities. As for the parking, traffic issues, ground water supply, and other things, I agree with you. Just housing more people is not going to solve the issue. We need to accelerate the access to public transportation, water, and electricity at a similar rate, and while Delhi is good on these issues, there are still things to be desired. I think if you want to demand action, you should demand that these other services be handled better. I agree! That is what i have always supported as well. I live in one such place too. If you see carefully, i mentioned \"*OVER*-apartmentalization\". The problem is these apartments are coming in a haphazard manner and in old areas that are not designed to cope up with the demand. I doubt building codes are being followed. There's zero spaces between buildings. For example - Many times the high voltage main electricity supply line to the apartments is not even underground but hanging over the ground by taking a connection from the pole. It leads to zero accountability when it comes to shared resources such as the roads , parks etc , and the population density is so how no one gives a crap. Many times the roads have become choked due to excess apartment ramps and fights among residents due to parking spaces is common."
}