{
    "id": "15n37cc",
    "title": "Surviving Dialysis, Polio, and Job Rejections: Seeking Support and Advice",
    "url": "https://www.reddit.com/r/india/comments/15n37cc/surviving_dialysis_polio_and_job_rejections/",
    "selftext": "Hi, I'm a 23 old dialysis patient (kidney failure) and i need your help, few years ago, on April 20th 2019 my only family, my mother died, i have no one except her, so when she died, i stopped eating, i went into depression, took a lot of tension, cried all day, which caused my BP to go way high and my heart became weak and was at the risk of failing, so I was admitted to the hospital where doctors used strong medicines to treat my heart which my kidneys couldn't handle and they failed. That's how i lost my kidneys, i never did drugs, smoking or drinking. It was hypertension and just bad luck.\n\nI am on dialysis since February of 2020, I was admitted for heart problem on September 2019, spent 2 months bed ridden in the hospital and then when i got out I was on dialysis. \n\nNow before all this I was studying for Diploma degree in Computer science and had completed 2 years and only one year was remaining but i dropped out because of all this, the final year was all focused on practical projects, going out to offices, collecting data, taking interviews of employees etc which i couldn't do why? Because God hates me, because on top of all of this i have polio in my right leg which renders my entire right body weaker/thinner than my left side body.\n\nSo since my kidneys failed I had been living off of my mother's saving, my mother had a govt job which paid well and she had pretty good amount saved. I have been using that sum to pay for my dialysis, medicines, house rent, food etc. I also sold all house hold items like fridge, TV, washing machine, sofa etc to keep myself floating. Now I have no more things to sell and the savings have finished.\n\nIn the beginning, the first year or so, i had no knowledge about dialysis, no one to take care of me, no one to feed me kidney disease specific diet, I was scared, I was extremely scared, I had to figure out everything myself, learn everything about dialysis myself, this again caused extreme anxiety and just made my situation worse from every angle, during this time, i also caught COVID, i also ate only outside food which obviously is unhealthy, this caused pressure on my liver and my liver gave out, and now I also have liver Fibrosis, and require ascites tapping and additional medicines for that as well.\n\nI wasted the the first year or so of my kidney failure life, being scared, figuring stuff out etc. After a year, when I was somewhat stable both mentally and physically, i knew that I couldn't live on my mother's savings for all my life, so I started looking for jobs, but everyone rejected me mainly for my looks and then for my lack of experience, I look extremely thin, i went from being 89kgs to just 39kgs because of muscle loss and dialysis process, i also developed pot belly, which has left me looking deranged and like an alien. So any no experience positions like cashier, desk attendent, have rejected me saying I look weird and they can't put me in front of people, and every desk job behind a computer or anything like that asked for experience which I don't have. So even after trying so hard i couldn't find myself a job.\n\nIn the mean time, i started learning what i loved on my own, programming, i started learning kotlin, Java, DBMS, SQL etc in hopes of becoming an Android app developer on my own, but i also struggled there as i could barely remember any stuff, got stuck in tutorial hell, and just got stuck, but i kept trying and I'm still doing it continuously. But I no longer have money to sustain myself. I need to quickly find something that pays me, so i have switched to learning video editing and photo editing on someone's suggestion hoping i can get paying jobs quickly. \n\nI had to leave my house, because i couldn't pay rent, right now I'm living in a shelter house that is meant for old people and the officer here has told me i can stay for few days but not for long as this place is for old people and not for chronic patients, they don't wanna take my responsibility, i have been eating only one meal a day trying to save money and also have stopped all my medication because i can't afford them. Luckily i found a foundation/club(i don't know exactly what it is) which agreed to do my dialysis for only ₹150 per dialysis, which was earlier ₹1200 at KLE hospital. \n\nNow the part where I need your help, help me with anything please please please, help me find a job, help me financially if you can, help me find food banks or shelters, help me please just help me, i don't want to be homeless, i don't want to disappoint my mom by committing the \"s\" word.\nI have only ₹1250 left with me. I'm tired of fighting alone.\n\nhttps://imgur.com/gallery/7ygtIzz\n\nI have more documents but they are at the hospital, i will post them when i go for dialysis tomorrow",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691645451.0,
    "convurl": "https://external-preview.redd.it/dT6r7pWHNaN2ss23TZHWh77Ii-1xL_nF7kTdsgPJ1c4.jpg?auto=webp&s=dfb59358a5f5017304bf7bfad7b570c6588cf20b",
    "comments": [
        "I am so sorry to hear about your situation. I've lost my dad to kidney failure, and I understand how excruciating the procedure is. All I can do in my limited capacity are prayers and best wishes for a better life for you. Sharing and upvoting for better reach. I'm sure there will be people to help you.\n\nI got tears reading this. This too shall pass.",
        "commenting for better reach :)",
        "CFBR",
        "CFBR",
        "Have you tried getting a job in the hospital where you are getting dialysis. I m sure they won't hesitate. Doctors also need help.",
        "Put your upi. If people can afford they'll send some money.",
        "No i haven't, i didn't think of this. I will definately all about this to the assistant of the doctor, when i go for dialysis tomorrow",
        "CFBR",
        "So so sorry that you're going through catastrophe at such a young age. The document linked says that you're in Belgaum. A quick search shows that there's an ISCKON temple in Belgaum. Maybe you can inquire about when they offer food during the week? I'm assuming this food should be healthier and more filling than eating at stalls or restaurants, but you'll know when you visit. You can also inquire and ask for help regarding shelter and employment.\n\nRegarding Android development, please think about making and selling games. This gives you a clear product to build and sell quickly. All you need is knowing programming with a game engine like Godot or Unity and design knowledge, which I'm sure you'll learn with your android experience. Youtube channel \"GDC\" has a very large number of game design talks, enough to give ideas.\n\nDon't ever give up. You're 23. You're only getting started. Come back here with an update soon.",
        "I called the temple that you mentioned, they said they give free food every Sunday after the Pooja, but after i told them about my condition, they said they will contact me later this day if they can find anyone to help me in any ways.\n\nAlso i think learning game development will take a lot of time and effort, so I'm thinking of sticking to learning video/photo editing, where i have to just learn what reach button does",
        "CFBR",
        "You are not alone...",
        "nice English, bud.",
        "That's a good start. You can also request them to give you any excess food to take back on Sundays so that you have something to eat for the next 2-3 days. If you're able to, going in person might work better regarding getting help.",
        "indeed he's.",
        "capitalism...",
        "dude, there's no God. it's just man-made bulshit... \n\nmoreover, I'm amazed that you didn't mention your father or grand-parents & even your paternal side family mama-mami-nana-nani etc... \n\nif your mother had a gov job, then she must've had good connections relation with other people...\n\nsince you've attached the bills, I can't say you're lying but obviously you're hiding something.....",
        "damn ,",
        "My father divorced my mother 10 years ago, and when I reached him after my kidneys failed, he straight up said to me \"you didn't contact me all this time, now your kidneys failed that you seek help fro me, go fuck yourself\". So no help from my dad's side of family,\n\n and as for my mom's side, well... How do I say this, they didn't exactly agree to the marriage since mom's side is vegetarian and my dad's non-vegetarian. So I have 3 mama who are no contact and 3 grannies who are all above the age of 90(I'm surprised, they lived this long) who have their own health problem but are in contact so i don't feel like being a burden 9n them",
        "CBFR",
        "I can post divorce documents if you want to",
        "dude there's this place callled.. prison.. i've heard they give free food, medical, sports...etc... ohh plus job too.. consider going there by...",
        "No house sadly, i wish I did, but i dont",
        "yes please. dm me.",
        "Divorce documents https://imgur.com/a/AMCQaJ6",
        "You mentioned God hates me, my question is even after all this suffering you still believe there is a god?",
        "Yes, because some things have happened to me that have no explanation. Good and bad. He is with me and also against me. It's like he keeps a balance of how much good and bad to give me. I hate him but i also need him.",
        "dude, don't bother. it's not his mistake. he has been led to believe in a lie with that much good faith, that even after suffering to this much, he still has to be an imaginary nonexistent man-made capitalistic creature. \n\nmoreover, it's the mistake of those two mfs, his mom-dad that they parted ways & made his life living hell.",
        "You are a fighter",
        "Dude...if true,this dude is a fricking survivor,no family,no money,no health....I would have killed myself if I were him....",
        "This is not LinkedIn",
        "What is wrong with you, you wierdo? If you can't be empathetic fine, don't be an a.hole",
        "You don't owe anybody any explanation. Ignore the trolls",
        "Are you now aware of how to manage your disease? And  about renal diet? Also, do you not have a government facility that you can go to for your hemodialysis? That would be easy on the pocket.",
        "I wasn't at first, but now I'm aware of what to eat and can somewhat manage my condition, again the problem is i have no option but to eat ransid food from outside. \n\nI do have a civil hospital here, that offers free dialysis, for which I require BPL card, which I have applied for.\nI didn't apply for BPL card for this long because the officer at the office told me they have to cancel my APL card to create BPL card and if my BPL card got denied then I won't have any ration card and told me to not do it",
        "I am so sorry for what you’re going thru. It’s a devastating diagnosis. Do you not have any family left? Besides mom?\n\nAlso, if she was a government employee does that not entitle you to some form of compensation? A pension of a pay?",
        "I do have family, but all of them have denied to help me, saying I'm not their responsibility.",
        "I can just suggest you something post it in r/developersIndia may someone can help you, also man your are very brave.",
        "Also, there is a thing called the golden card in India no? Where are you on that?",
        "I really need to stop bitching about my life",
        "No I'm not on that, how can I apply",
        "You are a goddamm survivor my man, wish I could help you but I'm just a student, but please post your bank details or something so others could donate, also ask in ur hospital if they could give you some sort of job or something.",
        "“The eligibility criteria for the interested applicants to register for the for Ayushman Bharat golden card Yojana stated by the government of India and Ministry of Health and Family Welfare department are mentioned as below:\n\nThe applicant must be a citizen or permanent resident of India.\nThe applicant’s annual family income should be less than 2.5 lakhs.\nAnd must hold a BPL card (below poverty line card). Also no member from the applicants should be working in any government sector.\nthe applicant or any member of the applicant’s family must ensure that they must not hold any home registry of their names.\nIf the applicant has received aid from any other kind of government housing program earlier. He will not be considered eligible for the Ayushman Bharat yojana under any circumstances.”\n\nThis is what I got after a simple Google search. \nNo chance of inheritance claim? Is your dad not in the picture?",
        "This",
        "Brother dm me you number or upi id",
        "No, he divorced and when i contacted him, he said no to any and all help.",
        "more power to you man, hope you find a job soon,",
        "Hey? I think you should post in Legal advice India. I don’t remember the sub’s name properly but I feel like you have rights and you should not be deprived of them.  A lawyer on that sub could help you understand your situation better. Also, you did not answer the pension/compensation question.",
        "About this, when i went to the office where my mother worked, they said I'm not eligible for pension since I'm already over the age of 18 and there's no one in the family under the age of 18. Also they f-ed me over the job offer that is given to the children of the dead, by sending a letter to bengluru office that i denied the job offer and told me to go fight in Bengaluru office if i want my mother's job. Which i obviously can't do cause of my condition, sitting in govt office hours on end isn't something i can do",
        "Dude stop being a moron",
        "Send me / comment your UPI ID",
        "Add UPI id to your post. Sorry for what you are going through man.",
        "Really hats off to your faith man, I haven't suffered even a tiny bit much as you but still I don't believe in the existence of an imaginary power deciding everything.",
        "Posting my UPI ID,\n\nhttps://imgur.com/a/XvoyDTC\n\nI'll be extremely happy if you helped me financially, but helping me in other ways like finding a job, or telling me which govt officials to reach/contact, anything ANYTHING Is appreciated.\n\nAnd if you do decide to donate money, i promise I won't let it go to waste, I will only spend it on food and medicines nothing else.\n \nThank you, thank you so much",
        "https://imgur.com/a/XvoyDTC \n\nOnly donate if you can throw away any money",
        "comment your UPI id",
        "https://imgur.com/a/XvoyDTC\n\nOnly donate if you can spare any money",
        "I have just now,\n\nhttps://imgur.com/a/XvoyDTC\n\nOnly donate if ur doesn't hurt you, cause you can help me in so many other ways",
        "F o",
        "So sorry for situation man, its rough. Just wanted to ask if you have had Polio recently or in your childhood ?",
        "Sending all the positive vibes your way. I really hope that your situation improves and you find a job soon. I cannot imagine being in your position. You are a survivor through and through. Hoping and praying for all the good things to come your way super soon! I am really sorry that you are facing such a difficult time.",
        "Donated 500. God bless you",
        "Sorry to hear that OP. I donated 10K. Mentioning the amount in the hope it will encourage others to donate more.\n\nI would also suggest to setup Ketto/Gofundme. I am pretty sure many people will donate once they hear your story. I am happy to donate 5K every month. I think that would be enough for you to get a room or PG in Belgaum.   \nTagging /u/st_broseph in case he can help.",
        "Please see my gpay message,\nAlso 10k is huge HUGE amount, dude it's a very Big amount to away to a stranger.\nPlease PLEASE tell me it's not gonna hurt you in any ways.\nIf you want me to return it, I will.\nEveryone's donating ₹500-₹2000 which is more than i could ask for, More than i could ever hope for.\nSo please tell me you are okay with it.\nAlso thank you, thank you, thank you, thank you.\nI don't know what more to say",
        "I have found a pg that is willing to give me a room even after mentioning my health condition. (That's the biggest problem, the minute i mention my condition, everyone denies me a room), the rent is ₹5000 and they also offer 3 times meal for additional ₹2500. \nBut i think ₹5000 is too much for me, so i haven't moved there. But the people seem nice, because they offered me a place even after hearing about my condition",
        "Done, if you need any help I have your back and \nwhere are you staying rn or at night",
        "We definitely should",
        "Hello brother. Can you please comment what your expenditure per month is like? Include everything. Thanks",
        "I need 27k per month to survive, this includes, dialysis, house rent, medicines, food, travel, Mobile recharge etc. I use a app keep track of my expenses, if you want I can share screenshot",
        "Don't worry about it. I really hope you come out of this slump.",
        "Also one more good news for me, My ad in news paper https://imgur.com/a/nazykiu",
        "CFBR, OP I am a 21 year old person and had a chronic disease and had to drop out because of it too. Please check your DMs if you have the time, sorry to disturb you",
        "Hey you should start some fundraising through that fundraising website, it would be of great help for sure.... Please look forward to that.",
        "I tried didn't work",
        "When i thought i had it hard..... Stay hard brother there will always be light at the end of the tunnel",
        "😔",
        "I will",
        "Type ICANTTAKEITANYMORE after shoving keyboard wire up your ass",
        "Man, that’s tough! I am happy to see how people have come forward to help you. But I am concerned about the sustainability of this whole thing. Did you try posting on that sub I told you about? Maybe find a lawyer that could work pro-bono for you?  You are entitled to support from your father, and your mother must have had a family that she would have inherited something from. \n\nI just want to find something that works for you in the longer run. \nAlso, if you have any questions regarding your illness or how to manage it, feel free to text.",
        "I do want dietary advice",
        "https://healthlibrary.askapollo.com/diet-and-nutrition-for-dialysis-patients/\n\nHere’s a quick link to a very generic renal diet chart. \nGo thru it once and see if you have any questions. I’ll help!",
        "And I went thru a couple of websites first to get you to this one. This has Indian food options and gives you a fair idea of what to eat and what to avoid.",
        "This would have helped if i had someone to cook for me or permission to cook myself. I can't do all this. I eat outside, only of the reasons for me bad health in the first place. The healthiest option i have is upma and idlis. That's it.",
        "Boiled Egg whites can work for you no? So can salads. And fresh fruits. You’re young and I know this is hard, but you’ll have to get your diet part handled. The increased sodium, potassium and even fluid load cannot be managed well in ESRD. \n\nAt the end of that list on the website is a list of foods you need to avoid. At least look at those. If you’re eating out, ask for food that does not contain any salt. Most places will oblige.",
        "I need to increase my fibre intake, also doctor told me i lack iron and to eat iron rich food. I do eat egg not every day though",
        "I used to eat fruits, but they are expensive and don't fill my stomach, i get hungry real quick",
        "Yeah you’re hemoglobin must be dropping. Were you given erythropoietin shots?",
        "Hey can you guide me on what medicines i should be taking, i will DM you on what I take currently",
        "Try Davita.com for more recipes etc.\nListen, I don’t know if you’re doctor counselled you properly or not, but you need to realise the importance of a good diet here. You need to maintain your fluids and electrolytes and get some protein in. \n\nMy heart breaks thinking that a child has been left alone to deal with all of this. But the dietary modification is an important aspect to your MHD. \n\nDM please",
        "What is that",
        "Right now I'm staying at a shelter house that is meant for old people. I don't know how long will they keep me though.",
        "Why mate?",
        "From childhood",
        "Thank you so much",
        "Stay strong soldier",
        "Donated small amount stay strong soldier",
        "Thx for helping him brother.",
        "Us bhai",
        "Commenting for more visibility. Good Luck! thats all I can offer.",
        "I tried doing my bit, GPay-ed you. Also if you can also upload your CV and qualifications, will try my best to search a job for you. Also, please register yourself with NOTTO, so that there's a possibility of you getting a kidney transplant from an accidental death case.",
        "No matter what please do not sell your house.\n\nThat's all i can say.",
        "Find a lawyer n ask him him will it be feasible to file a case for this.\n\nIf u manage to get a government job it will solve many of ur problems.\n\nContact local politician like MLA, corporator, etc they need ppl like u for publicity (u may not get resolution for ur problem but it won't hurt to try).",
        "Can you start fundraiser",
        "Ganesh one more advice i want to give u is.\n\nApply for ur mom's job as u may get it n the fact that u have polio means u r eligible for PWD(person with disability).\n\nRead the below lines\n\nThe rules related to applying for a compassionate appointment have been dealt with under the Scheme for Compassionate appointment. The objective of the scheme is to provide employment to a dependent family member of a Government servant who has died while in service or who is retired on medical grounds before attaining the age of 55 years (57 years for erstwhile Group D employees), thereby leaving the family without any means of sustainable livelihood. The scheme provides relief to the family of a Government servant concerned with destitution and to help it get over the emergency.\n \n\nIs there a time limit to apply for compassionate appointment?\nThere is no time limit to apply for compassionate employment. A request for appointment on compassionate grounds can be carried forward to next years if an application could not be made within a year of the requirement of such employment. However, the total number of compassionate appointments made in a year must not exceed 5% limit of direct recruitment of Group C quota. \n \n\nWho can apply?\nA request for a compassionate appointment can only be made by a dependent family member of a government servant. The term ‘dependent family member’ includes:\n\nSpouse of the government servant;\n\nSon (including adopted son) of the government servant;\n\nDaughter (including an adopted daughter) of the government servant;\n\nBrother or sister in case of unmarried government servant;\n\nMember of the Armed Forces, who was entirely dependent upon the Government Servant/member of the Armed Forces at the time of his death in harness or retirement on medical grounds, as the case may be.\n\nA married daughter can also apply for a compassionate appointment if she was wholly dependent upon the government servant at the time of his/her death in harness or retirement on medical grounds and if she supports other dependent members of the family.\n \n\nEmployment on compassionate grounds is not a right\nThe Supreme Court in one of its landmark judgments has stated that the policy of compassionate appointment in public service is not a right, but a benefit held out by the state to rescue the family of a government employee, who died in harness, from penury. Thus, the basis of the policy is that it recognizes that a family of a deceased employee may be placed in a position of financial hardship upon the untimely death of the government employee while in service.\n \n\nWhat if there is an earning member in the family?\nA dependant family member is eligible to be appraised for a compassionate appointment even in the presence of an earning member in the family in deserving cases, after the approval of the Secretary of the concerned Department or Ministry is obtained.\n\nThe income of the earning member, number of dependants, and the assets and liabilities left behind by the government servant must also be taken into consideration before approval is granted.\n\nHow can a lawyer help?\nIn case you have made an application for appointment on compassionate grounds and it has not been granted to you even though you are falling within the criteria to apply for such appointment, you can take the help of a good labour and service lawyer. An experienced labour and service lawyer can guide you with your options in case you have been rejected to be appointed on compassionate grounds. He can also help you file a case and represent you in court if need be.",
        "Post this on r/legaladviceindia too.",
        "I saved up  200 rupees in 4 weeks to eat a burger but ig you need it more\nFight brother fight",
        "Hi brother it hurts to see someone suffering so bad. Since this post is about you, I'm not gonna mention much about my struggle but it's quite similar. If you need any friend, to talk to, to cry with or anything at all, please do dm. Stay in touch with people if not me. Being lonely will make it worse for you. I hope enough people helped you already, I hope you got some more practical assistance.",
        "A reminder that if you cannot be kind or help this person, then just mind your own business.\nSomebody is going through a hard time and you're here questioning him? You need to take a long hard look at yourself, my friend.",
        "Do you have paypal/bank account info for international donations as well? I will be able to send something to keep you afloat for a bit.",
        "Sent you a chat message instead of a DM so I copied over the same message and resent, please have a look when you can",
        "OP do u have PayPal by any chance?",
        "Hey, I am an android developer with 3+ years of professional experience and making apps from 5 years. If you want to skill up i can teach you for free.\n\nI am proficient in Kotlin, clean architecture, MVVM, and can make an app individually. I don't know much but whatever I know i can help you learn it. Please do let me know if you're interested.",
        "Someone give this man an award please",
        "Please check DMs OP",
        "Dont ask for that kind of help most wont help you\nAsk them to use their connections just to get you a good job",
        "Just ask them to help get a job\nThey must have some good connections\nAll you need is a job right now",
        "He is not... You sure are",
        "OP please DM me if you like - my father had similar health issues so I do happen to know a lot (additionally I'll be able to guide you on how you can save up on meds and dialysis too)",
        "How can I save up on meds, my doctor has put me on expensive auryveda meds, is this normal?. Doctors usually don't believe in auryveda",
        "You can minus 12k from this amount as i switched hospitals and now my dialysis cost is easy less ₹150 * 8 is 1200 on a good month",
        "No, i have to set it up",
        "Hey, asked about this today. They said there's no special program for patients of kind (which was weird, are they lying), if i want a job i would have to apply like any other normal person and then they asked me to bring my resume, qualification, identification documents. And told me after applying there will be a written and viva test and some exciting time (varies, they said). Then i might get the job",
        "Hey found a govt person, that runs a shelter and agreed to help me. But they give rice/sambar as food everyday which I'm not allowed to eat as rice causes me to hold water and they have Indian toilet system which also I can use due to polio. So i denied the offer for now. Did i do something wrong",
        "That's a good step...where do you stay?",
        "Belgaum, right now in a shelter",
        "Switch to English medicine and you can get it. Anyway, it's upto you whether you wish to do it or not.\n\nPS: if it's already at dialysis please don't use ayurveda.",
        "Right now i take nicardia and sevcar, in terms of English meds. Is there anything that can help me with energy and endurance.",
        "This makes sense. I would recommend asking this person if there are other options due to these issues. If he has experience of even a few years, he will be aware of options where these issues may be resolved. \n\nI'm also seeing other comments regarding money, I'm sure that will provide more options, and you can make a 1 year (or 6 months) plan for good shelter and food at the very least. Do visit isckon on Sunday as well (or whenever they're available to meet) and ask the people there for help.",
        "Hey can you talk with me for a bit if i dm you",
        "Since you have hypertension and CKD - steer clear from potassium rich food, avoid pickles. As far as the energy aspect is concerned - unfortunately protein rich food is out of the question too... \n\nBanana and pineapple, guava - potassium rich \nMilk - phosphorus\nYou might have digestion issues - take in fibres and veggies, avoid meat (egg might be okay)\nPickle - avoid \nEat a low sodium diet sort of meal\nChapati and bland veggies (yep)\n\nAny other major restriction doesn't come to mind but I'd really suggest you to monitor health conditions - take that BPL card (will help a tonne plus so many rich fucks are using this who don't need it - you take the benefits you get and you use it!)\n\nMultiple dialysis (thrice a week) and monitored eating (please don't overdo on the proteins....) \n\nPS: my dad had diabetes in addition to this and even with dialysis and hypertension (heart surgery as well) what killed him were incompetent doctors in KMC. Don't go to money grabbing hospitals.\n\nNarayana hridayalaya - good doctors (register for transplant - cadever so charges won't be levied )\n\nTry to get a job which has ESI - will cover medical expenses (dialysis and medicines - although it won't be easy, also claim disability )\n\nI know these are not the best options but you do what you can to survive...",
        "Stay strong.",
        " this is list of IT companies which hires freshers off campus, please try applying on them, It will help you.   \nNagarro\n\n👉 Virtusa\n\n👉Zoho\n\n👉 CGI\n\n👉 Finastra\n\n👉 FIS\n\n👉 Fiserv\n\n👉 IQVIA \n\n👉 JIO\n\n👉 MAQ Software\n\n👉 Optum\n\n👉 Publicis Sapient\n\n👉 Geekyants\n\n👉 Accolite\n\n👉 Airtel\n\n👉 EA\n\n👉Gartner\n\n👉 HARMAN\n\n👉 Yellow\\[.\\]ai\n\n👉 Seimens \n\n👉 Samsung\n\n👉 Vmware\n\n👉 Adobe https\n\n👉 Amazon\n\n👉 Cadence Design Systems\n\n👉 CleverTap\n\n👉Cisco\n\n👉 Dunzo\n\n👉 FamPay\n\n👉 Flipkart\n\n👉 Google\n\n👉 Hackererath \n\n👉 Morgan Stanley\n\n👉 EY\n\n👉 MyGate\n\n👉 McAfee\n\n👉 Oracle\n\n👉 Microsoft\n\n👉 PhonePe\n\n👉 PWC\n\n👉 Rakuten\n\n👉Razorpay\n\n👉 SAP\n\n👉 Media\\[.\\]net\n\n👉 Twilio\n\n👉 Byju’s\n\n👉 TCS \n\n👉 Infosys \n\n👉 Wipro\n\n👉 Cognizant\n\n👉 LTI\n\n👉 Capgemini\n\n👉 DXC Technology\n\n👉 HCL\n\n👉 Hashedin\n\n👉 Hexaware\n\n👉 Revature\n\n👉 IBM",
        "Bro, I’m really sorry you’re going through this. Since you mentioned game development, there’s this platform that one of my friends has created, where you don’t need to learn all that complex development stuff. You can make games on your phone/pc using their platform! I’d be happy to share the link if you feel upto it. It’s free so it wouldn’t cost you money either! \nSincerely hope tu lavkarach bara hoshil and hya problems madhna baher yeshil! \nLmk if you want the link to the app.",
        "Goddamn bro if you’re fr, god bless you!",
        "Can you please share your UPI ID? I couldn't find it in the post. \n\nAlso, photo and video editors have plenty of freelancing jobs online, perhaps even coding (not 100% about the latter). Remember to undercut the original offer so you have a better chance at getting the project.",
        "Hi i have already started learning, video editing on my phone, can't use my PC as I'm in a shelter.",
        "I read that, which is why I suggested looking for freelance work online There is also writing and editing, if you undercut enough, you will get projects. \n\nAlso, share your UPI ID.",
        "Yes please please please",
        "I don't see this comment earlier sorry about that",
        "You fuckin AH .. after asking so many things and questioning his motive what help you have provided him?",
        "Check your gpay.",
        "@OP, Did you manage to find a job?\n\nPlease update your status.",
        "Found a few gigs here and there, translation work, teaching launguage etc. One paid me ₹5000~ for launguage teaching work and other paid very little for translation work. Nothing that can help me afford this lifestyle. I need to be making ₹30k a month to be able to afford dialysis, all needed medicines, rent (because no one wants to live sharing a room with a sick person in pg), and fancy food because I am not allowed eat cheap food 🤦. I can't make ₹30k a month with these health conditions, death is a better option for me.",
        "Can you also attach your updated resume to the post?\n\nI will try to refer to a few positions that match your profile.",
        "I haven't been able to find anything permanent or long term. Short term gigs aren't helping me much.",
        "This is hard . Fuck",
        "Short term gigs will not help you mate and if i was at your position then i would have aimed for govt exams as you’re be eligible for pwd quota. There’s a detailed comment regarding the same. But firstly the best option is to get your mother job anyhow and then start preparing for other big exams along with a open degree. Jobs where you can work with comfort and specially take benefit of the quotas in which you’re eligible.",
        "I want something from govt as well, but do you know how much of a hassle it is in India, no govt offical wants to help you, wants to make things easy for you. I went to my mother's office asking for her job for me, but they said it's not transferable to me, I know it's a lie but how do I contest it, how do I go there sit hours on end arguing with them with this heath condition. \nI really wish I had someone to go places with me, be with me for emergency situations, what if I faint in public due to high BP, no one to look after me, I'm literally afraid to get out of my room.",
        "Maybe someone from reddit or newspaper who’s near to your loacilty can help you with this. Invest some amount in this if possible, but this is really important brother. Majority of your problems will solve as soon as you get that job.",
        "I had reached out, I had my ad put in local news paper asking for help, NO ONE came forward. Some govt officer gave me ₹3000 and wished me luck. THAT'S ALL, my ad has been in news paper since August, no one has offered any help. I F-ing hate this country",
        "thanks for helping him bro",
        "Hi, can you contact me here in the dm I'm in contact with Ganesh and we're trying to sort his situation out. Send me a dm on reddit"
    ],
    "cleaned_text": "surviving dialysis polio job rejections seeking support advice hi im old dialysis patient kidney failure need help years ago april th family mother died one except died stopped eating went depression took lot tension cried day caused bp go way high heart became weak risk failing admitted hospital doctors used strong medicines treat heart kidneys couldnt handle failed thats lost kidneys never drugs smoking drinking hypertension bad luck dialysis since february admitted heart problem september spent months bed ridden hospital got dialysis studying diploma degree computer science completed years one year remaining dropped final year focused practical projects going offices collecting data taking interviews employees etc couldnt god hates top polio right leg renders entire right body weakerthinner left side body since kidneys failed living mothers saving mother govt job paid well pretty good amount saved using sum pay dialysis medicines house rent food etc also sold house hold items like fridge tv washing machine sofa etc keep floating things sell savings finished beginning first year knowledge dialysis one take care one feed kidney disease specific diet scared extremely scared figure everything learn everything dialysis caused extreme anxiety made situation worse every angle time also caught covid also ate outside food obviously unhealthy caused pressure liver liver gave also liver fibrosis require ascites tapping additional medicines well wasted first year kidney failure life scared figuring stuff etc year somewhat stable mentally physically knew couldnt live mothers savings life started looking jobs everyone rejected mainly looks lack experience look extremely thin went kgs kgs muscle loss dialysis process also developed pot belly left looking deranged like alien experience positions like cashier desk attendent rejected saying look weird cant put front people every desk job behind computer anything like asked experience dont even trying hard couldnt find job mean time started learning loved programming started learning kotlin java dbms sql etc hopes becoming android app developer also struggled could barely remember stuff got stuck tutorial hell got stuck kept trying im still continuously longer money sustain need quickly find something pays switched learning video editing photo editing someones suggestion hoping get paying jobs quickly leave house couldnt pay rent right im living shelter house meant old people officer told stay days long place old people chronic patients dont wan na take responsibility eating one meal day trying save money also stopped medication cant afford luckily found foundationclubi dont know exactly agreed dialysis per dialysis earlier kle hospital part need help help anything please please please help find job help financially help find food banks shelters help please help dont want homeless dont want disappoint mom committing word left im tired fighting alone documents hospital post go dialysis tomorrow ",
    "cleaned_title": "surviving dialysis polio job rejections seeking support advice",
    "cleaned_selftext": "hi im old dialysis patient kidney failure need help years ago april th family mother died one except died stopped eating went depression took lot tension cried day caused bp go way high heart became weak risk failing admitted hospital doctors used strong medicines treat heart kidneys couldnt handle failed thats lost kidneys never drugs smoking drinking hypertension bad luck dialysis since february admitted heart problem september spent months bed ridden hospital got dialysis studying diploma degree computer science completed years one year remaining dropped final year focused practical projects going offices collecting data taking interviews employees etc couldnt god hates top polio right leg renders entire right body weakerthinner left side body since kidneys failed living mothers saving mother govt job paid well pretty good amount saved using sum pay dialysis medicines house rent food etc also sold house hold items like fridge tv washing machine sofa etc keep floating things sell savings finished beginning first year knowledge dialysis one take care one feed kidney disease specific diet scared extremely scared figure everything learn everything dialysis caused extreme anxiety made situation worse every angle time also caught covid also ate outside food obviously unhealthy caused pressure liver liver gave also liver fibrosis require ascites tapping additional medicines well wasted first year kidney failure life scared figuring stuff etc year somewhat stable mentally physically knew couldnt live mothers savings life started looking jobs everyone rejected mainly looks lack experience look extremely thin went kgs kgs muscle loss dialysis process also developed pot belly left looking deranged like alien experience positions like cashier desk attendent rejected saying look weird cant put front people every desk job behind computer anything like asked experience dont even trying hard couldnt find job mean time started learning loved programming started learning kotlin java dbms sql etc hopes becoming android app developer also struggled could barely remember stuff got stuck tutorial hell got stuck kept trying im still continuously longer money sustain need quickly find something pays switched learning video editing photo editing someones suggestion hoping get paying jobs quickly leave house couldnt pay rent right im living shelter house meant old people officer told stay days long place old people chronic patients dont wan na take responsibility eating one meal day trying save money also stopped medication cant afford luckily found foundationclubi dont know exactly agreed dialysis per dialysis earlier kle hospital part need help help anything please please please help find job help financially help find food banks shelters help please help dont want homeless dont want disappoint mom committing word left im tired fighting alone documents hospital post go dialysis tomorrow",
    "cleaned_comments": "sorry hear situation ive lost dad kidney failure understand excruciating procedure limited capacity prayers best wishes better life sharing upvoting better reach im sure people help got tears reading shall pass commenting better reach cfbr cfbr tried getting job hospital getting dialysis sure wont hesitate doctors also need help put upi people afford theyll send money havent didnt think definately assistant doctor go dialysis tomorrow cfbr sorry youre going catastrophe young age document linked says youre belgaum quick search shows theres isckon temple belgaum maybe inquire offer food week im assuming food healthier filling eating stalls restaurants youll know visit also inquire ask help regarding shelter employment regarding android development please think making selling games gives clear product build sell quickly need knowing programming game engine like godot unity design knowledge im sure youll learn android experience youtube channel gdc large number game design talks enough give ideas dont ever give youre youre getting started come back update soon called temple mentioned said give free food every sunday pooja told condition said contact later day find anyone help ways also think learning game development take lot time effort im thinking sticking learning videophoto editing learn reach button cfbr alone nice english bud thats good start also request give excess food take back sundays something eat next days youre able going person might work better regarding getting help indeed hes capitalism dude theres god manmade bulshit moreover im amazed didnt mention father grandparents even paternal side family mamamaminananani etc mother gov job mustve good connections relation people since youve attached bills cant say youre lying obviously youre hiding something damn father divorced mother years ago reached kidneys failed straight said didnt contact time kidneys failed seek help fro go fuck help dads side family moms side well say didnt exactly agree marriage since moms side vegetarian dads nonvegetarian mama contact grannies age im surprised lived long health problem contact dont feel like burden n cbfr post divorce documents want dude theres place callled prison ive heard give free food medical sportsetc ohh plus job consider going house sadly wish dont yes please dm divorce documents mentioned god hates question even suffering still believe god yes things happened explanation good bad also like keeps balance much good bad give hate also need dude dont bother mistake led believe lie much good faith even suffering much still imaginary nonexistent manmade capitalistic creature moreover mistake two mfs momdad parted ways made life living hell fighter dudeif truethis dude fricking survivorno familyno moneyno healthi would killed linkedin wrong wierdo cant empathetic fine dont ahole dont owe anybody explanation ignore trolls aware manage disease renal diet also government facility go hemodialysis would easy pocket wasnt first im aware eat somewhat manage condition problem option eat ransid food outside civil hospital offers free dialysis require bpl card applied didnt apply bpl card long officer office told cancel apl card create bpl card bpl card got denied wont ration card told sorry youre going thru devastating diagnosis family left besides mom also government employee entitle form compensation pension pay family denied help saying im responsibility suggest something post rdevelopersindia may someone help also man brave also thing called golden card india really need stop bitching life im apply goddamm survivor man wish could help im student please post bank details something others could donate also ask ur hospital could give sort job something eligibility criteria interested applicants register ayushman bharat golden card yojana stated government india ministry health family welfare department mentioned applicant must citizen permanent resident india applicants annual family income less lakhs must hold bpl card poverty line card also member applicants working government sector applicant member applicants family must ensure must hold home registry names applicant received aid kind government housing program earlier considered eligible ayushman bharat yojana circumstances got simple google search chance inheritance claim dad picture brother dm number upi id divorced contacted said help power man hope find job soon hey think post legal advice india dont remember subs name properly feel like rights deprived lawyer sub could help understand situation better also answer pensioncompensation question went office mother worked said im eligible pension since im already age theres one family age also fed job offer given children dead sending letter bengluru office denied job offer told go fight bengaluru office want mothers job obviously cant cause condition sitting govt office hours end isnt something dude stop moron send comment upi id add upi id post sorry going man really hats faith man havent suffered even tiny bit much still dont believe existence imaginary power deciding everything posting upi id ill extremely happy helped financially helping ways like finding job telling govt officials reachcontact anything anything appreciated decide donate money promise wont let go waste spend food medicines nothing else thank thank much donate throw away money comment upi id donate spare money donate ur doesnt hurt cause help many ways f sorry situation man rough wanted ask polio recently childhood sending positive vibes way really hope situation improves find job soon imagine position survivor hoping praying good things come way super soon really sorry facing difficult time donated god bless sorry hear op donated k mentioning amount hope encourage others donate would also suggest setup kettogofundme pretty sure many people donate hear story happy donate k every month think would enough get room pg belgaum tagging ustbroseph case help please see gpay message also k huge huge amount dude big amount away stranger please please tell gon na hurt ways want return everyones donating could ask could ever hope please tell okay also thank thank thank thank dont know say found pg willing give room even mentioning health condition thats biggest problem minute mention condition everyone denies room rent also offer times meal additional think much havent moved people seem nice offered place even hearing condition done need help back staying rn night definitely hello brother please comment expenditure per month like include everything thanks need k per month survive includes dialysis house rent medicines food travel mobile recharge etc use app keep track expenses want share screenshot dont worry really hope come slump also one good news ad news paper cfbr op year old person chronic disease drop please check dms time sorry disturb hey start fundraising fundraising website would great help sure please look forward tried didnt work thought hard stay hard brother always light end tunnel type icanttakeitanymore shoving keyboard wire ass man thats tough happy see people come forward help concerned sustainability whole thing try posting sub told maybe find lawyer could work probono entitled support father mother must family would inherited something want find something works longer run also questions regarding illness manage feel free text want dietary advice heres quick link generic renal diet chart go thru see questions ill help went thru couple websites first get one indian food options gives fair idea eat avoid would helped someone cook permission cook cant eat outside reasons bad health first place healthiest option upma idlis thats boiled egg whites work salads fresh fruits youre young know hard youll get diet part handled increased sodium potassium even fluid load managed well esrd end list website list foods need avoid least look youre eating ask food contain salt places oblige need increase fibre intake also doctor told lack iron eat iron rich food eat egg every day though used eat fruits expensive dont fill stomach get hungry real quick yeah youre hemoglobin must dropping given erythropoietin shots hey guide medicines taking dm take currently try davitacom recipes etc listen dont know youre doctor counselled properly need realise importance good diet need maintain fluids electrolytes get protein heart breaks thinking child left alone deal dietary modification important aspect mhd dm please right im staying shelter house meant old people dont know long keep though mate childhood thank much stay strong soldier donated small amount stay strong soldier thx helping brother us bhai commenting visibility good luck thats offer tried bit gpayed also also upload cv qualifications try best search job also please register notto theres possibility getting kidney transplant accidental death case matter please sell house thats say find lawyer n ask feasible file case u manage get government job solve many ur problems contact local politician like mla corporator etc need ppl like u publicity u may get resolution ur problem wont hurt try start fundraiser ganesh one advice want give u apply ur moms job u may get n fact u polio means u r eligible pwdperson disability read lines rules related applying compassionate appointment dealt scheme compassionate appointment objective scheme provide employment dependent family member government servant died service retired medical grounds attaining age years years erstwhile group employees thereby leaving family without means sustainable livelihood scheme provides relief family government servant concerned destitution help get emergency time limit apply compassionate appointment time limit apply compassionate employment request appointment compassionate grounds carried forward next years application could made within year requirement employment however total number compassionate appointments made year must exceed limit direct recruitment group c quota apply request compassionate appointment made dependent family member government servant term dependent family member includes spouse government servant son including adopted son government servant daughter including adopted daughter government servant brother sister case unmarried government servant member armed forces entirely dependent upon government servantmember armed forces time death harness retirement medical grounds case may married daughter also apply compassionate appointment wholly dependent upon government servant time hisher death harness retirement medical grounds supports dependent members family employment compassionate grounds right supreme court one landmark judgments stated policy compassionate appointment public service right benefit held state rescue family government employee died harness penury thus basis policy recognizes family deceased employee may placed position financial hardship upon untimely death government employee service earning member family dependant family member eligible appraised compassionate appointment even presence earning member family deserving cases approval secretary concerned department ministry obtained income earning member number dependants assets liabilities left behind government servant must also taken consideration approval granted lawyer help case made application appointment compassionate grounds granted even though falling within criteria apply appointment take help good labour service lawyer experienced labour service lawyer guide options case rejected appointed compassionate grounds also help file case represent court need post rlegaladviceindia saved rupees weeks eat burger ig need fight brother fight hi brother hurts see someone suffering bad since post im gon na mention much struggle quite similar need friend talk cry anything please dm stay touch people lonely make worse hope enough people helped already hope got practical assistance reminder kind help person mind business somebody going hard time youre questioning need take long hard look friend paypalbank account info international donations well able send something keep afloat bit sent chat message instead dm copied message resent please look op u paypal chance hey android developer years professional experience making apps years want skill teach free proficient kotlin clean architecture mvvm make app individually dont know much whatever know help learn please let know youre interested someone give man award please please check dms op dont ask kind help wont help ask use connections get good job ask help get job must good connections need job right sure op please dm like father similar health issues happen know lot additionally ill able guide save meds dialysis save meds doctor put expensive auryveda meds normal doctors usually dont believe auryveda minus k amount switched hospitals dialysis cost easy less good month set hey asked today said theres special program patients kind weird lying want job would apply like normal person asked bring resume qualification identification documents told applying written viva test exciting time varies said might get job hey found govt person runs shelter agreed help give ricesambar food everyday im allowed eat rice causes hold water indian toilet system also use due polio denied offer something wrong thats good stepwhere stay belgaum right shelter switch english medicine get anyway upto whether wish ps already dialysis please dont use ayurveda right take nicardia sevcar terms english meds anything help energy endurance makes sense would recommend asking person options due issues experience even years aware options issues may resolved im also seeing comments regarding money im sure provide options make year months plan good shelter food least visit isckon sunday well whenever theyre available meet ask people help hey talk bit dm since hypertension ckd steer clear potassium rich food avoid pickles far energy aspect concerned unfortunately protein rich food question banana pineapple guava potassium rich milk phosphorus might digestion issues take fibres veggies avoid meat egg might okay pickle avoid eat low sodium diet sort meal chapati bland veggies yep major restriction doesnt come mind id really suggest monitor health conditions take bpl card help tonne plus many rich fucks using dont need take benefits get use multiple dialysis thrice week monitored eating please dont overdo proteins ps dad diabetes addition even dialysis hypertension heart surgery well killed incompetent doctors kmc dont go money grabbing hospitals narayana hridayalaya good doctors register transplant cadever charges wont levied try get job esi cover medical expenses dialysis medicines although wont easy also claim disability know best options survive stay strong list companies hires freshers campus please try applying help nagarro virtusa zoho cgi finastra fis fiserv iqvia jio maq software optum publicis sapient geekyants accolite airtel ea gartner harman yellowai seimens samsung vmware adobe amazon cadence design systems clevertap cisco dunzo fampay flipkart google hackererath morgan stanley ey mygate mcafee oracle microsoft phonepe pwc rakuten razorpay sap medianet twilio byjus tcs infosys wipro cognizant lti capgemini dxc technology hcl hashedin hexaware revature ibm bro im really sorry youre going since mentioned game development theres platform one friends created dont need learn complex development stuff make games phonepc using platform id happy share link feel upto free wouldnt cost money either sincerely hope tu lavkarach bara hoshil hya problems madhna baher yeshil lmk want link app goddamn bro youre fr god bless please share upi id couldnt find post also photo video editors plenty freelancing jobs online perhaps even coding latter remember undercut original offer better chance getting project hi already started learning video editing phone cant use pc im shelter read suggested looking freelance work online also writing editing undercut enough get projects also share upi id yes please please please dont see comment earlier sorry fuckin ah asking many things questioning motive help provided check gpay op manage find job please update status found gigs translation work teaching launguage etc one paid launguage teaching work paid little translation work nothing help afford lifestyle need making k month able afford dialysis needed medicines rent one wants live sharing room sick person pg fancy food allowed eat cheap food cant make k month health conditions death better option also attach updated resume post try refer positions match profile havent able find anything permanent long term short term gigs arent helping much hard fuck short term gigs help mate position would aimed govt exams youre eligible pwd quota theres detailed comment regarding firstly best option get mother job anyhow start preparing big exams along open degree jobs work comfort specially take benefit quotas youre eligible want something govt well know much hassle india govt offical wants help wants make things easy went mothers office asking job said transferable know lie contest go sit hours end arguing heath condition really wish someone go places emergency situations faint public due high bp one look im literally afraid get room maybe someone reddit newspaper whos near loacilty help invest amount possible really important brother majority problems solve soon get job reached ad put local news paper asking help one came forward govt officer gave wished luck thats ad news paper since august one offered help fing hate country thanks helping bro hi contact dm im contact ganesh trying sort situation send dm reddit",
    "light_cleaned_title": "Surviving Dialysis, Polio, and Job Rejections: Seeking Support and Advice",
    "light_cleaned_selftext": "Hi, I'm a 23 old dialysis patient (kidney failure) and i need your help, few years ago, on April 20th 2019 my only family, my mother died, i have no one except her, so when she died, i stopped eating, i went into depression, took a lot of tension, cried all day, which caused my BP to go way high and my heart became weak and was at the risk of failing, so I was admitted to the hospital where doctors used strong medicines to treat my heart which my kidneys couldn't handle and they failed. That's how i lost my kidneys, i never did drugs, smoking or drinking. It was hypertension and just bad luck. I am on dialysis since February of 2020, I was admitted for heart problem on September 2019, spent 2 months bed ridden in the hospital and then when i got out I was on dialysis. Now before all this I was studying for Diploma degree in Computer science and had completed 2 years and only one year was remaining but i dropped out because of all this, the final year was all focused on practical projects, going out to offices, collecting data, taking interviews of employees etc which i couldn't do why? Because God hates me, because on top of all of this i have polio in my right leg which renders my entire right body weaker/thinner than my left side body. So since my kidneys failed I had been living off of my mother's saving, my mother had a govt job which paid well and she had pretty good amount saved. I have been using that sum to pay for my dialysis, medicines, house rent, food etc. I also sold all house hold items like fridge, TV, washing machine, sofa etc to keep myself floating. Now I have no more things to sell and the savings have finished. In the beginning, the first year or so, i had no knowledge about dialysis, no one to take care of me, no one to feed me kidney disease specific diet, I was scared, I was extremely scared, I had to figure out everything myself, learn everything about dialysis myself, this again caused extreme anxiety and just made my situation worse from every angle, during this time, i also caught COVID, i also ate only outside food which obviously is unhealthy, this caused pressure on my liver and my liver gave out, and now I also have liver Fibrosis, and require ascites tapping and additional medicines for that as well. I wasted the the first year or so of my kidney failure life, being scared, figuring stuff out etc. After a year, when I was somewhat stable both mentally and physically, i knew that I couldn't live on my mother's savings for all my life, so I started looking for jobs, but everyone rejected me mainly for my looks and then for my lack of experience, I look extremely thin, i went from being 89kgs to just 39kgs because of muscle loss and dialysis process, i also developed pot belly, which has left me looking deranged and like an alien. So any no experience positions like cashier, desk attendent, have rejected me saying I look weird and they can't put me in front of people, and every desk job behind a computer or anything like that asked for experience which I don't have. So even after trying so hard i couldn't find myself a job. In the mean time, i started learning what i loved on my own, programming, i started learning kotlin, Java, DBMS, SQL etc in hopes of becoming an Android app developer on my own, but i also struggled there as i could barely remember any stuff, got stuck in tutorial hell, and just got stuck, but i kept trying and I'm still doing it continuously. But I no longer have money to sustain myself. I need to quickly find something that pays me, so i have switched to learning video editing and photo editing on someone's suggestion hoping i can get paying jobs quickly. I had to leave my house, because i couldn't pay rent, right now I'm living in a shelter house that is meant for old people and the officer here has told me i can stay for few days but not for long as this place is for old people and not for chronic patients, they don't wanna take my responsibility, i have been eating only one meal a day trying to save money and also have stopped all my medication because i can't afford them. Luckily i found a foundation/club(i don't know exactly what it is) which agreed to do my dialysis for only ₹150 per dialysis, which was earlier ₹1200 at KLE hospital. Now the part where I need your help, help me with anything please please please, help me find a job, help me financially if you can, help me find food banks or shelters, help me please just help me, i don't want to be homeless, i don't want to disappoint my mom by committing the \"s\" word. I have only ₹1250 left with me. I'm tired of fighting alone. I have more documents but they are at the hospital, i will post them when i go for dialysis tomorrow",
    "light_cleaned_comments": "I am so sorry to hear about your situation. I've lost my dad to kidney failure, and I understand how excruciating the procedure is. All I can do in my limited capacity are prayers and best wishes for a better life for you. Sharing and upvoting for better reach. I'm sure there will be people to help you. I got tears reading this. This too shall pass. commenting for better reach :) CFBR CFBR Have you tried getting a job in the hospital where you are getting dialysis. I m sure they won't hesitate. Doctors also need help. Put your upi. If people can afford they'll send some money. No i haven't, i didn't think of this. I will definately all about this to the assistant of the doctor, when i go for dialysis tomorrow CFBR So so sorry that you're going through catastrophe at such a young age. The document linked says that you're in Belgaum. A quick search shows that there's an ISCKON temple in Belgaum. Maybe you can inquire about when they offer food during the week? I'm assuming this food should be healthier and more filling than eating at stalls or restaurants, but you'll know when you visit. You can also inquire and ask for help regarding shelter and employment. Regarding Android development, please think about making and selling games. This gives you a clear product to build and sell quickly. All you need is knowing programming with a game engine like Godot or Unity and design knowledge, which I'm sure you'll learn with your android experience. Youtube channel \"GDC\" has a very large number of game design talks, enough to give ideas. Don't ever give up. You're 23. You're only getting started. Come back here with an update soon. I called the temple that you mentioned, they said they give free food every Sunday after the Pooja, but after i told them about my condition, they said they will contact me later this day if they can find anyone to help me in any ways. Also i think learning game development will take a lot of time and effort, so I'm thinking of sticking to learning video/photo editing, where i have to just learn what reach button does CFBR You are not alone... nice English, bud. That's a good start. You can also request them to give you any excess food to take back on Sundays so that you have something to eat for the next 2-3 days. If you're able to, going in person might work better regarding getting help. indeed he's. capitalism... dude, there's no God. it's just man-made bulshit... moreover, I'm amazed that you didn't mention your father or grand-parents & even your paternal side family mama-mami-nana-nani etc... if your mother had a gov job, then she must've had good connections relation with other people... since you've attached the bills, I can't say you're lying but obviously you're hiding something..... damn , My father divorced my mother 10 years ago, and when I reached him after my kidneys failed, he straight up said to me \"you didn't contact me all this time, now your kidneys failed that you seek help fro me, go fuck yourself\". So no help from my dad's side of family, and as for my mom's side, well... How do I say this, they didn't exactly agree to the marriage since mom's side is vegetarian and my dad's non-vegetarian. So I have 3 mama who are no contact and 3 grannies who are all above the age of 90(I'm surprised, they lived this long) who have their own health problem but are in contact so i don't feel like being a burden 9n them CBFR I can post divorce documents if you want to dude there's this place callled.. prison.. i've heard they give free food, medical, sports...etc... ohh plus job too.. consider going there by... No house sadly, i wish I did, but i dont yes please. dm me. Divorce documents You mentioned God hates me, my question is even after all this suffering you still believe there is a god? Yes, because some things have happened to me that have no explanation. Good and bad. He is with me and also against me. It's like he keeps a balance of how much good and bad to give me. I hate him but i also need him. dude, don't bother. it's not his mistake. he has been led to believe in a lie with that much good faith, that even after suffering to this much, he still has to be an imaginary nonexistent man-made capitalistic creature. moreover, it's the mistake of those two mfs, his mom-dad that they parted ways & made his life living hell. You are a fighter Dude...if true,this dude is a fricking survivor,no family,no money,no health....I would have killed myself if I were him.... This is not LinkedIn What is wrong with you, you wierdo? If you can't be empathetic fine, don't be an a.hole You don't owe anybody any explanation. Ignore the trolls Are you now aware of how to manage your disease? And about renal diet? Also, do you not have a government facility that you can go to for your hemodialysis? That would be easy on the pocket. I wasn't at first, but now I'm aware of what to eat and can somewhat manage my condition, again the problem is i have no option but to eat ransid food from outside. I do have a civil hospital here, that offers free dialysis, for which I require BPL card, which I have applied for. I didn't apply for BPL card for this long because the officer at the office told me they have to cancel my APL card to create BPL card and if my BPL card got denied then I won't have any ration card and told me to not do it I am so sorry for what you’re going thru. It’s a devastating diagnosis. Do you not have any family left? Besides mom? Also, if she was a government employee does that not entitle you to some form of compensation? A pension of a pay? I do have family, but all of them have denied to help me, saying I'm not their responsibility. I can just suggest you something post it in r/developersIndia may someone can help you, also man your are very brave. Also, there is a thing called the golden card in India no? Where are you on that? I really need to stop bitching about my life No I'm not on that, how can I apply You are a goddamm survivor my man, wish I could help you but I'm just a student, but please post your bank details or something so others could donate, also ask in ur hospital if they could give you some sort of job or something. “The eligibility criteria for the interested applicants to register for the for Ayushman Bharat golden card Yojana stated by the government of India and Ministry of Health and Family Welfare department are mentioned as below: The applicant must be a citizen or permanent resident of India. The applicant’s annual family income should be less than 2.5 lakhs. And must hold a BPL card (below poverty line card). Also no member from the applicants should be working in any government sector. the applicant or any member of the applicant’s family must ensure that they must not hold any home registry of their names. If the applicant has received aid from any other kind of government housing program earlier. He will not be considered eligible for the Ayushman Bharat yojana under any circumstances.” This is what I got after a simple Google search. No chance of inheritance claim? Is your dad not in the picture? This Brother dm me you number or upi id No, he divorced and when i contacted him, he said no to any and all help. more power to you man, hope you find a job soon, Hey? I think you should post in Legal advice India. I don’t remember the sub’s name properly but I feel like you have rights and you should not be deprived of them. A lawyer on that sub could help you understand your situation better. Also, you did not answer the pension/compensation question. About this, when i went to the office where my mother worked, they said I'm not eligible for pension since I'm already over the age of 18 and there's no one in the family under the age of 18. Also they f-ed me over the job offer that is given to the children of the dead, by sending a letter to bengluru office that i denied the job offer and told me to go fight in Bengaluru office if i want my mother's job. Which i obviously can't do cause of my condition, sitting in govt office hours on end isn't something i can do Dude stop being a moron Send me / comment your UPI ID Add UPI id to your post. Sorry for what you are going through man. Really hats off to your faith man, I haven't suffered even a tiny bit much as you but still I don't believe in the existence of an imaginary power deciding everything. Posting my UPI ID, I'll be extremely happy if you helped me financially, but helping me in other ways like finding a job, or telling me which govt officials to reach/contact, anything ANYTHING Is appreciated. And if you do decide to donate money, i promise I won't let it go to waste, I will only spend it on food and medicines nothing else. Thank you, thank you so much Only donate if you can throw away any money comment your UPI id Only donate if you can spare any money I have just now, Only donate if ur doesn't hurt you, cause you can help me in so many other ways F o So sorry for situation man, its rough. Just wanted to ask if you have had Polio recently or in your childhood ? Sending all the positive vibes your way. I really hope that your situation improves and you find a job soon. I cannot imagine being in your position. You are a survivor through and through. Hoping and praying for all the good things to come your way super soon! I am really sorry that you are facing such a difficult time. Donated 500. God bless you Sorry to hear that OP. I donated 10K. Mentioning the amount in the hope it will encourage others to donate more. I would also suggest to setup Ketto/Gofundme. I am pretty sure many people will donate once they hear your story. I am happy to donate 5K every month. I think that would be enough for you to get a room or PG in Belgaum. Tagging /u/st_broseph in case he can help. Please see my gpay message, Also 10k is huge HUGE amount, dude it's a very Big amount to away to a stranger. Please PLEASE tell me it's not gonna hurt you in any ways. If you want me to return it, I will. Everyone's donating ₹500-₹2000 which is more than i could ask for, More than i could ever hope for. So please tell me you are okay with it. Also thank you, thank you, thank you, thank you. I don't know what more to say I have found a pg that is willing to give me a room even after mentioning my health condition. (That's the biggest problem, the minute i mention my condition, everyone denies me a room), the rent is ₹5000 and they also offer 3 times meal for additional ₹2500. But i think ₹5000 is too much for me, so i haven't moved there. But the people seem nice, because they offered me a place even after hearing about my condition Done, if you need any help I have your back and where are you staying rn or at night We definitely should Hello brother. Can you please comment what your expenditure per month is like? Include everything. Thanks I need 27k per month to survive, this includes, dialysis, house rent, medicines, food, travel, Mobile recharge etc. I use a app keep track of my expenses, if you want I can share screenshot Don't worry about it. I really hope you come out of this slump. Also one more good news for me, My ad in news paper CFBR, OP I am a 21 year old person and had a chronic disease and had to drop out because of it too. Please check your DMs if you have the time, sorry to disturb you Hey you should start some fundraising through that fundraising website, it would be of great help for sure.... Please look forward to that. I tried didn't work When i thought i had it hard..... Stay hard brother there will always be light at the end of the tunnel 😔 I will Type ICANTTAKEITANYMORE after shoving keyboard wire up your ass Man, that’s tough! I am happy to see how people have come forward to help you. But I am concerned about the sustainability of this whole thing. Did you try posting on that sub I told you about? Maybe find a lawyer that could work pro-bono for you? You are entitled to support from your father, and your mother must have had a family that she would have inherited something from. I just want to find something that works for you in the longer run. Also, if you have any questions regarding your illness or how to manage it, feel free to text. I do want dietary advice Here’s a quick link to a very generic renal diet chart. Go thru it once and see if you have any questions. I’ll help! And I went thru a couple of websites first to get you to this one. This has Indian food options and gives you a fair idea of what to eat and what to avoid. This would have helped if i had someone to cook for me or permission to cook myself. I can't do all this. I eat outside, only of the reasons for me bad health in the first place. The healthiest option i have is upma and idlis. That's it. Boiled Egg whites can work for you no? So can salads. And fresh fruits. You’re young and I know this is hard, but you’ll have to get your diet part handled. The increased sodium, potassium and even fluid load cannot be managed well in ESRD. At the end of that list on the website is a list of foods you need to avoid. At least look at those. If you’re eating out, ask for food that does not contain any salt. Most places will oblige. I need to increase my fibre intake, also doctor told me i lack iron and to eat iron rich food. I do eat egg not every day though I used to eat fruits, but they are expensive and don't fill my stomach, i get hungry real quick Yeah you’re hemoglobin must be dropping. Were you given erythropoietin shots? Hey can you guide me on what medicines i should be taking, i will DM you on what I take currently Try Davita.com for more recipes etc. Listen, I don’t know if you’re doctor counselled you properly or not, but you need to realise the importance of a good diet here. You need to maintain your fluids and electrolytes and get some protein in. My heart breaks thinking that a child has been left alone to deal with all of this. But the dietary modification is an important aspect to your MHD. DM please What is that Right now I'm staying at a shelter house that is meant for old people. I don't know how long will they keep me though. Why mate? From childhood Thank you so much Stay strong soldier Donated small amount stay strong soldier Thx for helping him brother. Us bhai Commenting for more visibility. Good Luck! thats all I can offer. I tried doing my bit, GPay-ed you. Also if you can also upload your CV and qualifications, will try my best to search a job for you. Also, please register yourself with NOTTO, so that there's a possibility of you getting a kidney transplant from an accidental death case. No matter what please do not sell your house. That's all i can say. Find a lawyer n ask him him will it be feasible to file a case for this. If u manage to get a government job it will solve many of ur problems. Contact local politician like MLA, corporator, etc they need ppl like u for publicity (u may not get resolution for ur problem but it won't hurt to try). Can you start fundraiser Ganesh one more advice i want to give u is. Apply for ur mom's job as u may get it n the fact that u have polio means u r eligible for PWD(person with disability). Read the below lines The rules related to applying for a compassionate appointment have been dealt with under the Scheme for Compassionate appointment. The objective of the scheme is to provide employment to a dependent family member of a Government servant who has died while in service or who is retired on medical grounds before attaining the age of 55 years (57 years for erstwhile Group D employees), thereby leaving the family without any means of sustainable livelihood. The scheme provides relief to the family of a Government servant concerned with destitution and to help it get over the emergency. Is there a time limit to apply for compassionate appointment? There is no time limit to apply for compassionate employment. A request for appointment on compassionate grounds can be carried forward to next years if an application could not be made within a year of the requirement of such employment. However, the total number of compassionate appointments made in a year must not exceed 5% limit of direct recruitment of Group C quota. Who can apply? A request for a compassionate appointment can only be made by a dependent family member of a government servant. The term ‘dependent family member’ includes: Spouse of the government servant; Son (including adopted son) of the government servant; Daughter (including an adopted daughter) of the government servant; Brother or sister in case of unmarried government servant; Member of the Armed Forces, who was entirely dependent upon the Government Servant/member of the Armed Forces at the time of his death in harness or retirement on medical grounds, as the case may be. A married daughter can also apply for a compassionate appointment if she was wholly dependent upon the government servant at the time of his/her death in harness or retirement on medical grounds and if she supports other dependent members of the family. Employment on compassionate grounds is not a right The Supreme Court in one of its landmark judgments has stated that the policy of compassionate appointment in public service is not a right, but a benefit held out by the state to rescue the family of a government employee, who died in harness, from penury. Thus, the basis of the policy is that it recognizes that a family of a deceased employee may be placed in a position of financial hardship upon the untimely death of the government employee while in service. What if there is an earning member in the family? A dependant family member is eligible to be appraised for a compassionate appointment even in the presence of an earning member in the family in deserving cases, after the approval of the Secretary of the concerned Department or Ministry is obtained. The income of the earning member, number of dependants, and the assets and liabilities left behind by the government servant must also be taken into consideration before approval is granted. How can a lawyer help? In case you have made an application for appointment on compassionate grounds and it has not been granted to you even though you are falling within the criteria to apply for such appointment, you can take the help of a good labour and service lawyer. An experienced labour and service lawyer can guide you with your options in case you have been rejected to be appointed on compassionate grounds. He can also help you file a case and represent you in court if need be. Post this on r/legaladviceindia too. I saved up 200 rupees in 4 weeks to eat a burger but ig you need it more Fight brother fight Hi brother it hurts to see someone suffering so bad. Since this post is about you, I'm not gonna mention much about my struggle but it's quite similar. If you need any friend, to talk to, to cry with or anything at all, please do dm. Stay in touch with people if not me. Being lonely will make it worse for you. I hope enough people helped you already, I hope you got some more practical assistance. A reminder that if you cannot be kind or help this person, then just mind your own business. Somebody is going through a hard time and you're here questioning him? You need to take a long hard look at yourself, my friend. Do you have paypal/bank account info for international donations as well? I will be able to send something to keep you afloat for a bit. Sent you a chat message instead of a DM so I copied over the same message and resent, please have a look when you can OP do u have PayPal by any chance? Hey, I am an android developer with 3+ years of professional experience and making apps from 5 years. If you want to skill up i can teach you for free. I am proficient in Kotlin, clean architecture, MVVM, and can make an app individually. I don't know much but whatever I know i can help you learn it. Please do let me know if you're interested. Someone give this man an award please Please check DMs OP Dont ask for that kind of help most wont help you Ask them to use their connections just to get you a good job Just ask them to help get a job They must have some good connections All you need is a job right now He is not... You sure are OP please DM me if you like - my father had similar health issues so I do happen to know a lot (additionally I'll be able to guide you on how you can save up on meds and dialysis too) How can I save up on meds, my doctor has put me on expensive auryveda meds, is this normal?. Doctors usually don't believe in auryveda You can minus 12k from this amount as i switched hospitals and now my dialysis cost is easy less ₹150 * 8 is 1200 on a good month No, i have to set it up Hey, asked about this today. They said there's no special program for patients of kind (which was weird, are they lying), if i want a job i would have to apply like any other normal person and then they asked me to bring my resume, qualification, identification documents. And told me after applying there will be a written and viva test and some exciting time (varies, they said). Then i might get the job Hey found a govt person, that runs a shelter and agreed to help me. But they give rice/sambar as food everyday which I'm not allowed to eat as rice causes me to hold water and they have Indian toilet system which also I can use due to polio. So i denied the offer for now. Did i do something wrong That's a good step...where do you stay? Belgaum, right now in a shelter Switch to English medicine and you can get it. Anyway, it's upto you whether you wish to do it or not. PS: if it's already at dialysis please don't use ayurveda. Right now i take nicardia and sevcar, in terms of English meds. Is there anything that can help me with energy and endurance. This makes sense. I would recommend asking this person if there are other options due to these issues. If he has experience of even a few years, he will be aware of options where these issues may be resolved. I'm also seeing other comments regarding money, I'm sure that will provide more options, and you can make a 1 year (or 6 months) plan for good shelter and food at the very least. Do visit isckon on Sunday as well (or whenever they're available to meet) and ask the people there for help. Hey can you talk with me for a bit if i dm you Since you have hypertension and CKD - steer clear from potassium rich food, avoid pickles. As far as the energy aspect is concerned - unfortunately protein rich food is out of the question too... Banana and pineapple, guava - potassium rich Milk - phosphorus You might have digestion issues - take in fibres and veggies, avoid meat (egg might be okay) Pickle - avoid Eat a low sodium diet sort of meal Chapati and bland veggies (yep) Any other major restriction doesn't come to mind but I'd really suggest you to monitor health conditions - take that BPL card (will help a tonne plus so many rich fucks are using this who don't need it - you take the benefits you get and you use it!) Multiple dialysis (thrice a week) and monitored eating (please don't overdo on the proteins....) PS: my dad had diabetes in addition to this and even with dialysis and hypertension (heart surgery as well) what killed him were incompetent doctors in KMC. Don't go to money grabbing hospitals. Narayana hridayalaya - good doctors (register for transplant - cadever so charges won't be levied ) Try to get a job which has ESI - will cover medical expenses (dialysis and medicines - although it won't be easy, also claim disability ) I know these are not the best options but you do what you can to survive... Stay strong. this is list of IT companies which hires freshers off campus, please try applying on them, It will help you. Nagarro 👉 Virtusa 👉Zoho 👉 CGI 👉 Finastra 👉 FIS 👉 Fiserv 👉 IQVIA 👉 JIO 👉 MAQ Software 👉 Optum 👉 Publicis Sapient 👉 Geekyants 👉 Accolite 👉 Airtel 👉 EA 👉Gartner 👉 HARMAN 👉 Yellow\\[.\\]ai 👉 Seimens 👉 Samsung 👉 Vmware 👉 Adobe 👉 Amazon 👉 Cadence Design Systems 👉 CleverTap 👉Cisco 👉 Dunzo 👉 FamPay 👉 Flipkart 👉 Google 👉 Hackererath 👉 Morgan Stanley 👉 EY 👉 MyGate 👉 McAfee 👉 Oracle 👉 Microsoft 👉 PhonePe 👉 PWC 👉 Rakuten 👉Razorpay 👉 SAP 👉 Media\\[.\\]net 👉 Twilio 👉 Byju’s 👉 TCS 👉 Infosys 👉 Wipro 👉 Cognizant 👉 LTI 👉 Capgemini 👉 DXC Technology 👉 HCL 👉 Hashedin 👉 Hexaware 👉 Revature 👉 IBM Bro, I’m really sorry you’re going through this. Since you mentioned game development, there’s this platform that one of my friends has created, where you don’t need to learn all that complex development stuff. You can make games on your phone/pc using their platform! I’d be happy to share the link if you feel upto it. It’s free so it wouldn’t cost you money either! Sincerely hope tu lavkarach bara hoshil and hya problems madhna baher yeshil! Lmk if you want the link to the app. Goddamn bro if you’re fr, god bless you! Can you please share your UPI ID? I couldn't find it in the post. Also, photo and video editors have plenty of freelancing jobs online, perhaps even coding (not 100% about the latter). Remember to undercut the original offer so you have a better chance at getting the project. Hi i have already started learning, video editing on my phone, can't use my PC as I'm in a shelter. I read that, which is why I suggested looking for freelance work online There is also writing and editing, if you undercut enough, you will get projects. Also, share your UPI ID. Yes please please please I don't see this comment earlier sorry about that You fuckin AH .. after asking so many things and questioning his motive what help you have provided him? Check your gpay. @OP, Did you manage to find a job? Please update your status. Found a few gigs here and there, translation work, teaching launguage etc. One paid me ₹5000~ for launguage teaching work and other paid very little for translation work. Nothing that can help me afford this lifestyle. I need to be making ₹30k a month to be able to afford dialysis, all needed medicines, rent (because no one wants to live sharing a room with a sick person in pg), and fancy food because I am not allowed eat cheap food 🤦. I can't make ₹30k a month with these health conditions, death is a better option for me. Can you also attach your updated resume to the post? I will try to refer to a few positions that match your profile. I haven't been able to find anything permanent or long term. Short term gigs aren't helping me much. This is hard . Fuck Short term gigs will not help you mate and if i was at your position then i would have aimed for govt exams as you’re be eligible for pwd quota. There’s a detailed comment regarding the same. But firstly the best option is to get your mother job anyhow and then start preparing for other big exams along with a open degree. Jobs where you can work with comfort and specially take benefit of the quotas in which you’re eligible. I want something from govt as well, but do you know how much of a hassle it is in India, no govt offical wants to help you, wants to make things easy for you. I went to my mother's office asking for her job for me, but they said it's not transferable to me, I know it's a lie but how do I contest it, how do I go there sit hours on end arguing with them with this heath condition. I really wish I had someone to go places with me, be with me for emergency situations, what if I faint in public due to high BP, no one to look after me, I'm literally afraid to get out of my room. Maybe someone from reddit or newspaper who’s near to your loacilty can help you with this. Invest some amount in this if possible, but this is really important brother. Majority of your problems will solve as soon as you get that job. I had reached out, I had my ad put in local news paper asking for help, NO ONE came forward. Some govt officer gave me ₹3000 and wished me luck. THAT'S ALL, my ad has been in news paper since August, no one has offered any help. I F-ing hate this country thanks for helping him bro Hi, can you contact me here in the dm I'm in contact with Ganesh and we're trying to sort his situation out. Send me a dm on reddit"
}