{
    "id": "18mudnm",
    "title": "Statement: The Lok Sabha has just passed 3 Bills to reform India's criminal justice system without meaningful debate.",
    "url": "https://www.reddit.com/r/india/comments/18mudnm/statement_the_lok_sabha_has_just_passed_3_bills/",
    "selftext": " STATEMENT: With over 95 of its opposition MPs suspended, the Lok Sabha has just passed 3 Bills to reform India's criminal justice system without meaningful debate. Procedural impropriety aside, the Bills bring little reform & excessive executive control (do we see the pattern?)\n\nAs we pointed out, Standing Committee's review of the Bills fails to address glaring concerns re digital rights – broadening \"sedition\", classifying digital records & devices as \"evidence\" without safeguards, and widening powers of search & seizure. \n\nhttps://x.com/internetfreedom/status/1725483821192376437 \n\nWe stand against not only several provisions of the Bills, which erode the rights to privacy & free speech, but also the undemocratic circumstances in which they were passed. Reform of this magnitude requires substantive & meaningful discussions.\n\nhttps://x.com/internetfreedom/status/1737130493609427134 ",
    "flair": "Law & Courts",
    "score": 101,
    "num_comments": 12,
    "created_utc": 1703078247.0,
    "convurl": "https://external-preview.redd.it/5Z9iWMWC_5lll2Lezwp7yF1ljRrrZKKtJUw-BpljI1Q.jpg?auto=webp&s=b670218af0f741796e85ed90e48e9fc676389d33",
    "comments": [
        "Mother of democracy. Mera Bharat Mahan.",
        "Fantastic, calling yourself as \"Internet Freedom\" and posting eXcretions. First, be the change you want to see in the world and start using truly free social media like Mastodon and then come preach to us.",
        "Unpopular opinion: there was no proper debate in the last 9 years, even when the opposition weren’t suspended!",
        "Yeah, they won’t do that..branding is easy to make money!",
        "/s",
        "Weren't the number of suspended mps around 150?",
        "True, to some extent. But that was due to the speakers bulldozing bills through the parliament without any care for democratic processes. Can't really blame the opposition for it.",
        "A lot of MP's themselves won't understand half of these laws, you cannot expect most of citizens to do so...they won't oppose something they do not understand.",
        "With due respect, if opposition were serious about certain issues, they have enough capability to raise them in the public..apart from farm bill, they haven’t shown any inclination to engage in improving the lives of citizens..the system has been gamed by shills of both parties where outrage is public, while work is absent!",
        "That’s for Lok Sabha and Rajya Sabha combined.\n\nLok Sabha alone is ~95.",
        "understanding comes from experts who assist them. the problem here is the denial of the oppurtunity",
        "I think supreme court would be able to intervene regarding the draconian sections of the new bill.\n\nIt the old wine with desi masala packaged in Bharatiya bottle.\nThe aim still remains that the reigns of power entirely lie in one hand.",
        "Just so you know, [@internetfreedom](https://mas.to/@internetfreedom) is their Mastodon account.",
        "So why post links to eXcretions and not their Mastodon posts. Mera khoon khoon, tumhara khoon paani?",
        "Dark dark days are in store for Indians."
    ],
    "cleaned_text": "statement lok sabha passed bills reform indias criminal justice system without meaningful debate statement opposition mps suspended lok sabha passed bills reform indias criminal justice system without meaningful debate procedural impropriety aside bills bring little reform excessive executive control see pattern pointed standing committees review bills fails address glaring concerns digital rights broadening sedition classifying digital records devices evidence without safeguards widening powers search seizure stand several provisions bills erode rights privacy free speech also undemocratic circumstances passed reform magnitude requires substantive meaningful discussions ",
    "cleaned_title": "statement lok sabha passed bills reform indias criminal justice system without meaningful debate",
    "cleaned_selftext": "statement opposition mps suspended lok sabha passed bills reform indias criminal justice system without meaningful debate procedural impropriety aside bills bring little reform excessive executive control see pattern pointed standing committees review bills fails address glaring concerns digital rights broadening sedition classifying digital records devices evidence without safeguards widening powers search seizure stand several provisions bills erode rights privacy free speech also undemocratic circumstances passed reform magnitude requires substantive meaningful discussions",
    "cleaned_comments": "mother democracy mera bharat mahan fantastic calling internet freedom posting excretions first change want see world start using truly free social media like mastodon come preach us unpopular opinion proper debate last years even opposition werent suspended yeah wont thatbranding easy make money werent number suspended mps around true extent due speakers bulldozing bills parliament without care democratic processes cant really blame opposition lot mps wont understand half laws expect citizens sothey wont oppose something understand due respect opposition serious certain issues enough capability raise publicapart farm bill havent shown inclination engage improving lives citizensthe system gamed shills parties outrage public work absent thats lok sabha rajya sabha combined lok sabha alone understanding comes experts assist problem denial oppurtunity think supreme court would able intervene regarding draconian sections new bill old wine desi masala packaged bharatiya bottle aim still remains reigns power entirely lie one hand know internetfreedomhttpsmastointernetfreedom mastodon account post links excretions mastodon posts mera khoon khoon tumhara khoon paani dark dark days store indians",
    "light_cleaned_title": "Statement: The Lok Sabha has just passed 3 Bills to reform India's criminal justice system without meaningful debate.",
    "light_cleaned_selftext": "STATEMENT: With over 95 of its opposition MPs suspended, the Lok Sabha has just passed 3 Bills to reform India's criminal justice system without meaningful debate. Procedural impropriety aside, the Bills bring little reform & excessive executive control (do we see the pattern?) As we pointed out, Standing Committee's review of the Bills fails to address glaring concerns re digital rights – broadening \"sedition\", classifying digital records & devices as \"evidence\" without safeguards, and widening powers of search & seizure. We stand against not only several provisions of the Bills, which erode the rights to privacy & free speech, but also the undemocratic circumstances in which they were passed. Reform of this magnitude requires substantive & meaningful discussions.",
    "light_cleaned_comments": "Mother of democracy. Mera Bharat Mahan. Fantastic, calling yourself as \"Internet Freedom\" and posting eXcretions. First, be the change you want to see in the world and start using truly free social media like Mastodon and then come preach to us. Unpopular opinion: there was no proper debate in the last 9 years, even when the opposition weren’t suspended! Yeah, they won’t do that..branding is easy to make money! /s Weren't the number of suspended mps around 150? True, to some extent. But that was due to the speakers bulldozing bills through the parliament without any care for democratic processes. Can't really blame the opposition for it. A lot of MP's themselves won't understand half of these laws, you cannot expect most of citizens to do so...they won't oppose something they do not understand. With due respect, if opposition were serious about certain issues, they have enough capability to raise them in the public..apart from farm bill, they haven’t shown any inclination to engage in improving the lives of citizens..the system has been gamed by shills of both parties where outrage is public, while work is absent! That’s for Lok Sabha and Rajya Sabha combined. Lok Sabha alone is ~95. understanding comes from experts who assist them. the problem here is the denial of the oppurtunity I think supreme court would be able to intervene regarding the draconian sections of the new bill. It the old wine with desi masala packaged in Bharatiya bottle. The aim still remains that the reigns of power entirely lie in one hand. Just so you know, [@internetfreedom](https://mas.to/@internetfreedom) is their Mastodon account. So why post links to eXcretions and not their Mastodon posts. Mera khoon khoon, tumhara khoon paani? Dark dark days are in store for Indians."
}