{
    "id": "17qgr92",
    "title": "Jay Prakash Narayan talks about old pension scheme",
    "url": "https://www.reddit.com/r/india/comments/17qgr92/jay_prakash_narayan_talks_about_old_pension_scheme/",
    "selftext": "https://www.youtube.com/watch?v=Vv9KOC9Yj-g\n\n\nIt’s a good talk in English. All Indians should be aware of this.",
    "flair": "Policy/Economy",
    "score": 9,
    "num_comments": 4,
    "created_utc": 1699429949.0,
    "convurl": "https://external-preview.redd.it/_-Iy2R7Ocq1ese4I30AJtxXQ56BMzv0J6B87PF_J5pE.jpg?auto=webp&s=3fdafd834c4e6ded4d5a4b75a513302cb7f1f25d",
    "comments": [
        "He is a good man.",
        "I am currently watching it. And he is a sensible man.\n\nIf we set aside our political differences, and just evaluate the situation in hand, it will be evident that we are headed to a disaster. I don't understand Rahul Gandhi's obsession with OPS, when Manmohan Singh aggressively rooted it out and introduced NPS in his hayem.\n\nIt's an lazy way to win elections. And politicians batting for OPS should be booted out.",
        "Nice analysis \nPeople always want to work less and make more money. They want govt jobs. \nit’s not possible for all esp when we don’t have basic lifestyle standards."
    ],
    "cleaned_text": "jay prakash narayan talks old pension scheme good talk english indians aware ",
    "cleaned_title": "jay prakash narayan talks old pension scheme",
    "cleaned_selftext": "good talk english indians aware",
    "cleaned_comments": "good man currently watching sensible man set aside political differences evaluate situation hand evident headed disaster dont understand rahul gandhis obsession ops manmohan singh aggressively rooted introduced nps hayem lazy way win elections politicians batting ops booted nice analysis people always want work less make money want govt jobs possible esp dont basic lifestyle standards",
    "light_cleaned_title": "Jay Prakash Narayan talks about old pension scheme",
    "light_cleaned_selftext": "It’s a good talk in English. All Indians should be aware of this.",
    "light_cleaned_comments": "He is a good man. I am currently watching it. And he is a sensible man. If we set aside our political differences, and just evaluate the situation in hand, it will be evident that we are headed to a disaster. I don't understand Rahul Gandhi's obsession with OPS, when Manmohan Singh aggressively rooted it out and introduced NPS in his hayem. It's an lazy way to win elections. And politicians batting for OPS should be booted out. Nice analysis People always want to work less and make more money. They want govt jobs. it’s not possible for all esp when we don’t have basic lifestyle standards."
}