{
    "id": "14hwgjh",
    "title": "Is this reasonable apartment interiors designer cost ? Any place to trim down the cost (from 55L to ??)",
    "url": "https://www.reddit.com/gallery/14hwgjh",
    "selftext": "Hi,\n\nI need some help with doing sensible negotiation. The interior architect quote is 55L INR for the 6BHK (2x3BHK - ~2800 sqft) which I am still not able to wrap my head around.  \n\nAny pointer on how to trim down the cost without paying penalty in terms of quality and aesthetic will be great help.",
    "flair": "AskIndia",
    "score": 8,
    "num_comments": 23,
    "created_utc": 1687622292.0,
    "convurl": "https://i.redd.it/kgpz4xvinz7b1.jpg",
    "comments": [
        "OC",
        "Everything is overpriced. 14k for shoe rack lmao",
        "True. I am just not aware of how these pricing work and since we don’t have ikea nearby I am just not sure what’s the best alternate option. So thought of reaching out on reddit",
        "Every city has their own famous furniture shop look it up. Since you are buying alot of things they will even give you hefty discounts. \n\nYour designer is robbing you blind",
        "By going to an interior designer, I assume you get design consultation, 3D renders and layout help, project management etc that you will not if you DIY from furniture shops. Best way to check if the rate is reasonable is to go to 2-3 designers in the same range (premium, luxury, mid range) and get similar quotes and compare.\n\nIn general to get the same look at a lower budget, choose the rooms that are the most important and spend your budget there. For e.g. maybe a couple of the bedrooms are for guests or kids. Go the DIY route there from IKEA or similar stores to cut costs. You could also tell the designer that your budget is 20% less and get their inputs on what to cut.",
        "Some prices are ok(wardrobes/kitchen seem reasonable to me) while some are quite expensive esp if you are not asking for high end custom stuff(they are fine if you want those things)\n\nYou can save on TV consoles and Beds a lot. The bedrooms also seem to have too much stuff an unless you need those things you can cut some stuff.\n\nAnyways hard to actually comment more without seeing the designs. Custom built furniture does actually work out more expensive as top quality parts are used everywhere whereas furniture shops usually make cut corners in many things.",
        "Consultancy charges at 4% max of project cost.",
        "Feels a bit too filled to the brim with furniture.... \n\nMaybe I am the only one but the whole plan has a cluttered ambience to it... Also the whole plan just looks like a complex network of rooms bound by walls rather than a spacious & inviting home.",
        "Yeah these are two separate unit originally. We tried our best to merge it and make it look one peace.",
        "Any idea how much per room cost is? Please note that these doesn’t even include basic home appliances so it will be easily +5L",
        "Yeah that’s one point I want to push for. But it won’t help trim down the final bill significantly.",
        "So thought of checking with fresh eyes",
        "Please feel free to give more suggestion:)",
        "Let me try looking. It’s just that it is small town so not many option and online furniture shopping is not so reliable.",
        "Yeah since it’s my first big purchase ever, I am not sure how much challenging or easy it will be to deal with carpenter and other folks on a personal level. And given that my work required me to travel, I thought hiring interior architect will be the best option but that’s definitely leaving a big hole in the pocket.",
        "99K for 6x9 laminate cupboard had me.",
        "OP there are some back of envelope calculations available. The estimates are super high IMO. For example carpentry has a per sq foot contractor rate of about 300/sqft of frontage. The best plyboard is less 200 rupees per sq foot. commercial plyboard is half that. Adding fittings and consumables you are not looking at beyond 600 per square foot 700 max. \n\nThe rate the interiors person has given you is about 2000 per square foot PLUS a 7.5% consultancy and im sure a gst will come too.\n\nshop around. This estimate imo looks too high to even negotiate.",
        "take the estimate and divide by 3",
        "Sure thing!!\n\n1. Get rid of Bedroom 3 & 4. Bedrooms are never meant to be centrally located. Use the empty space here as combined Dining and Family Living space. Those two spaces are meant for gathering, so its better to keep them large. You can always convert this place into a large bedroom with beddings if you get even more guests. \n\n2. Get rid of the toilets adjoining the central sit out and expand this sit out. Its a common gathering space, so better to keep it decently sized. Place large & strong glass walls to enjoy the view and the large sit out from outside. Its expensive but looks phenomenal. \n\n3. Right next to the main door, build a walk in utility closet and a store room. You can keep shoes, tools, raincoats, hats, bicycles, and other utilities. The store rooms gives you easy access to main door in case you want to store tge gas cylinders there or some other items you don't use much.\n\n4. Replace the old store room with a toilet whose door is towards the Dining / Family Living space.\n\n5. Try increasing the the size of the Kitchen space by extending it into the Dining / Family Living space. That Kitchen space right now is too tiny for this big of a flat.\n\nThese are just my two cents. I am not even remotely related to the field of Interior Designing so be sure to dicuss these changes with others here if you found them any helpful.",
        "Also each item has 15% profits added while arriving to rates, so you can narrow down to 1.5%.\n\nYou can take reference rates from CPWD DSR 2021.",
        "What’s CPWD DSR?",
        "Do one thing, look for a carpenter who does custom home jobs. Ask him for the estimate of boards, laminates and other stuff for wardrobe, beds and tables. Then look up prices for branded boards by visiting dealers and include his rates.\n\n Most interior designers actually earn commissions from both carpenter and dealers they buy stuff from. You should be able to find 15-20% lower rates. \n\nThe only issue with doing work w/o an interior guy is that you then need to provide everything to the workers directly and do all the legwork like finding designs, keeping an eye on them, getting raw materials etc.\n\nFrankly if you are anal about using best stuff and high end designs, the costs can escalate quickly. There are laminates in market from 1500-7500 per sheet, handles that start at 100-200 per unit and go upto 4-5K for branded ones. Same for sliders, hinges etc.\n\nWe did some renovations last year and spent 5-6L on Master bedroom while guest beds we spent only 80-90K. You can save money buy going for low end furniture for places not being used regularly.\n\nSharing the approx prices both below:\n\nMB:\n\nKing bed: 95K\n\nMattress : 85K\n\nSide tables : 20K\n\nDressing: 25K\n\nWardrobe: 1.2L\n\nOther seating: 35K\n\nLights: 45K\n\nGuest bed:\n\nBed: 25K\n\nMattress: 25K\n\nTables: 15K\n\nChairs: 10K",
        "Well, Central Government publishes rates of different civil, electrical, architectural and HVAC items for government contracts.\n\nThey are based on fair market prices.",
        "Wardrobes, kitchen etc should be in the range of 1600 to 2000 per sq. ft. depending on the quality and complexity. For example, glossy finish will cost more than matt. Known brands of plywood and laminates will cost more. Waterproof ply for kitchen and bathroom will cost more. But over all will not exceed 2000 per sft. \n\nFor furniture and lights, go to shops and look at the rates. You can agree with them to supply your own stuff which may work out cheaper, for example lights from Amazon or Pepperfry.\n\nOne more option is to get a designer from nearby large town to visit and give you a design. May cost you a bit for the initial visit, but could end up saving money in the long run.",
        "Your furniture is costing you a lot. That is what you should optimise.",
        "This person architects",
        "Haha!! I feel honored!! Thanks a lot!! \n\nSorry to disappoint though, I am just a B. Tech. pass out... Guess B. Arch. was simply a road not taken 🙂",
        "This is a bad layout. Considering the 2800 sqft carpet area, the rooms are small, space is not efficiently used and it seems that the designer is trying to forcefully fit the maximum number. of rooms . 3 toilets are more than enough . Lighting and ventilation are awful. I don't think this is the work of any experienced or sensible architect. Check whether your designer is an architect or an interior designer, there is a huge difference between the two!",
        "Actually these are two 3BHK combined together. Given that we are a joint family(10 adults 2 kids), we kind of need a house with more number of private bathrooms."
    ],
    "cleaned_text": "reasonable apartment interiors designer cost place trim cost l hi need help sensible negotiation interior architect quote l inr bhk xbhk sqft still able wrap head around pointer trim cost without paying penalty terms quality aesthetic great help ",
    "cleaned_title": "reasonable apartment interiors designer cost place trim cost l",
    "cleaned_selftext": "hi need help sensible negotiation interior architect quote l inr bhk xbhk sqft still able wrap head around pointer trim cost without paying penalty terms quality aesthetic great help",
    "cleaned_comments": "oc everything overpriced k shoe rack lmao true aware pricing work since dont ikea nearby sure whats best alternate option thought reaching reddit every city famous furniture shop look since buying alot things even give hefty discounts designer robbing blind going interior designer assume get design consultation renders layout help project management etc diy furniture shops best way check rate reasonable go designers range premium luxury mid range get similar quotes compare general get look lower budget choose rooms important spend budget eg maybe couple bedrooms guests kids go diy route ikea similar stores cut costs could also tell designer budget less get inputs cut prices okwardrobeskitchen seem reasonable quite expensive esp asking high end custom stuffthey fine want things save tv consoles beds lot bedrooms also seem much stuff unless need things cut stuff anyways hard actually comment without seeing designs custom built furniture actually work expensive top quality parts used everywhere whereas furniture shops usually make cut corners many things consultancy charges max project cost feels bit filled brim furniture maybe one whole plan cluttered ambience also whole plan looks like complex network rooms bound walls rather spacious inviting home yeah two separate unit originally tried best merge make look one peace idea much per room cost please note doesnt even include basic home appliances easily l yeah thats one point want push wont help trim final bill significantly thought checking fresh eyes please feel free give suggestion let try looking small town many option online furniture shopping reliable yeah since first big purchase ever sure much challenging easy deal carpenter folks personal level given work required travel thought hiring interior architect best option thats definitely leaving big hole pocket k x laminate cupboard op back envelope calculations available estimates super high imo example carpentry per sq foot contractor rate sqft frontage best plyboard less rupees per sq foot commercial plyboard half adding fittings consumables looking beyond per square foot max rate interiors person given per square foot plus consultancy im sure gst come shop around estimate imo looks high even negotiate take estimate divide sure thing get rid bedroom bedrooms never meant centrally located use empty space combined dining family living space two spaces meant gathering better keep large always convert place large bedroom beddings get even guests get rid toilets adjoining central sit expand sit common gathering space better keep decently sized place large strong glass walls enjoy view large sit outside expensive looks phenomenal right next main door build walk utility closet store room keep shoes tools raincoats hats bicycles utilities store rooms gives easy access main door case want store tge gas cylinders items dont use much replace old store room toilet whose door towards dining family living space try increasing size kitchen space extending dining family living space kitchen space right tiny big flat two cents even remotely related field interior designing sure dicuss changes others found helpful also item profits added arriving rates narrow take reference rates cpwd dsr whats cpwd dsr one thing look carpenter custom home jobs ask estimate boards laminates stuff wardrobe beds tables look prices branded boards visiting dealers include rates interior designers actually earn commissions carpenter dealers buy stuff able find lower rates issue work wo interior guy need provide everything workers directly legwork like finding designs keeping eye getting raw materials etc frankly anal using best stuff high end designs costs escalate quickly laminates market per sheet handles start per unit go upto k branded ones sliders hinges etc renovations last year spent l master bedroom guest beds spent k save money buy going low end furniture places used regularly sharing approx prices mb king bed k mattress k side tables k dressing k wardrobe l seating k lights k guest bed bed k mattress k tables k chairs k well central government publishes rates different civil electrical architectural hvac items government contracts based fair market prices wardrobes kitchen etc range per sq ft depending quality complexity example glossy finish cost matt known brands plywood laminates cost waterproof ply kitchen bathroom cost exceed per sft furniture lights go shops look rates agree supply stuff may work cheaper example lights amazon pepperfry one option get designer nearby large town visit give design may cost bit initial visit could end saving money long run furniture costing lot optimise person architects haha feel honored thanks lot sorry disappoint though b tech pass guess b arch simply road taken bad layout considering sqft carpet area rooms small space efficiently used seems designer trying forcefully fit maximum number rooms toilets enough lighting ventilation awful dont think work experienced sensible architect check whether designer architect interior designer huge difference two actually two bhk combined together given joint family adults kids kind need house number private bathrooms",
    "light_cleaned_title": "Is this reasonable apartment interiors designer cost ? Any place to trim down the cost (from 55L to ??)",
    "light_cleaned_selftext": "Hi, I need some help with doing sensible negotiation. The interior architect quote is 55L INR for the 6BHK (2x3BHK - ~2800 sqft) which I am still not able to wrap my head around. Any pointer on how to trim down the cost without paying penalty in terms of quality and aesthetic will be great help.",
    "light_cleaned_comments": "OC Everything is overpriced. 14k for shoe rack lmao True. I am just not aware of how these pricing work and since we don’t have ikea nearby I am just not sure what’s the best alternate option. So thought of reaching out on reddit Every city has their own famous furniture shop look it up. Since you are buying alot of things they will even give you hefty discounts. Your designer is robbing you blind By going to an interior designer, I assume you get design consultation, 3D renders and layout help, project management etc that you will not if you DIY from furniture shops. Best way to check if the rate is reasonable is to go to 2-3 designers in the same range (premium, luxury, mid range) and get similar quotes and compare. In general to get the same look at a lower budget, choose the rooms that are the most important and spend your budget there. For e.g. maybe a couple of the bedrooms are for guests or kids. Go the DIY route there from IKEA or similar stores to cut costs. You could also tell the designer that your budget is 20% less and get their inputs on what to cut. Some prices are ok(wardrobes/kitchen seem reasonable to me) while some are quite expensive esp if you are not asking for high end custom stuff(they are fine if you want those things) You can save on TV consoles and Beds a lot. The bedrooms also seem to have too much stuff an unless you need those things you can cut some stuff. Anyways hard to actually comment more without seeing the designs. Custom built furniture does actually work out more expensive as top quality parts are used everywhere whereas furniture shops usually make cut corners in many things. Consultancy charges at 4% max of project cost. Feels a bit too filled to the brim with furniture.... Maybe I am the only one but the whole plan has a cluttered ambience to it... Also the whole plan just looks like a complex network of rooms bound by walls rather than a spacious & inviting home. Yeah these are two separate unit originally. We tried our best to merge it and make it look one peace. Any idea how much per room cost is? Please note that these doesn’t even include basic home appliances so it will be easily +5L Yeah that’s one point I want to push for. But it won’t help trim down the final bill significantly. So thought of checking with fresh eyes Please feel free to give more suggestion:) Let me try looking. It’s just that it is small town so not many option and online furniture shopping is not so reliable. Yeah since it’s my first big purchase ever, I am not sure how much challenging or easy it will be to deal with carpenter and other folks on a personal level. And given that my work required me to travel, I thought hiring interior architect will be the best option but that’s definitely leaving a big hole in the pocket. 99K for 6x9 laminate cupboard had me. OP there are some back of envelope calculations available. The estimates are super high IMO. For example carpentry has a per sq foot contractor rate of about 300/sqft of frontage. The best plyboard is less 200 rupees per sq foot. commercial plyboard is half that. Adding fittings and consumables you are not looking at beyond 600 per square foot 700 max. The rate the interiors person has given you is about 2000 per square foot PLUS a 7.5% consultancy and im sure a gst will come too. shop around. This estimate imo looks too high to even negotiate. take the estimate and divide by 3 Sure thing!! 1. Get rid of Bedroom 3 & 4. Bedrooms are never meant to be centrally located. Use the empty space here as combined Dining and Family Living space. Those two spaces are meant for gathering, so its better to keep them large. You can always convert this place into a large bedroom with beddings if you get even more guests. 2. Get rid of the toilets adjoining the central sit out and expand this sit out. Its a common gathering space, so better to keep it decently sized. Place large & strong glass walls to enjoy the view and the large sit out from outside. Its expensive but looks phenomenal. 3. Right next to the main door, build a walk in utility closet and a store room. You can keep shoes, tools, raincoats, hats, bicycles, and other utilities. The store rooms gives you easy access to main door in case you want to store tge gas cylinders there or some other items you don't use much. 4. Replace the old store room with a toilet whose door is towards the Dining / Family Living space. 5. Try increasing the the size of the Kitchen space by extending it into the Dining / Family Living space. That Kitchen space right now is too tiny for this big of a flat. These are just my two cents. I am not even remotely related to the field of Interior Designing so be sure to dicuss these changes with others here if you found them any helpful. Also each item has 15% profits added while arriving to rates, so you can narrow down to 1.5%. You can take reference rates from CPWD DSR 2021. What’s CPWD DSR? Do one thing, look for a carpenter who does custom home jobs. Ask him for the estimate of boards, laminates and other stuff for wardrobe, beds and tables. Then look up prices for branded boards by visiting dealers and include his rates. Most interior designers actually earn commissions from both carpenter and dealers they buy stuff from. You should be able to find 15-20% lower rates. The only issue with doing work w/o an interior guy is that you then need to provide everything to the workers directly and do all the legwork like finding designs, keeping an eye on them, getting raw materials etc. Frankly if you are anal about using best stuff and high end designs, the costs can escalate quickly. There are laminates in market from 1500-7500 per sheet, handles that start at 100-200 per unit and go upto 4-5K for branded ones. Same for sliders, hinges etc. We did some renovations last year and spent 5-6L on Master bedroom while guest beds we spent only 80-90K. You can save money buy going for low end furniture for places not being used regularly. Sharing the approx prices both below: MB: King bed: 95K Mattress : 85K Side tables : 20K Dressing: 25K Wardrobe: 1.2L Other seating: 35K Lights: 45K Guest bed: Bed: 25K Mattress: 25K Tables: 15K Chairs: 10K Well, Central Government publishes rates of different civil, electrical, architectural and HVAC items for government contracts. They are based on fair market prices. Wardrobes, kitchen etc should be in the range of 1600 to 2000 per sq. ft. depending on the quality and complexity. For example, glossy finish will cost more than matt. Known brands of plywood and laminates will cost more. Waterproof ply for kitchen and bathroom will cost more. But over all will not exceed 2000 per sft. For furniture and lights, go to shops and look at the rates. You can agree with them to supply your own stuff which may work out cheaper, for example lights from Amazon or Pepperfry. One more option is to get a designer from nearby large town to visit and give you a design. May cost you a bit for the initial visit, but could end up saving money in the long run. Your furniture is costing you a lot. That is what you should optimise. This person architects Haha!! I feel honored!! Thanks a lot!! Sorry to disappoint though, I am just a B. Tech. pass out... Guess B. Arch. was simply a road not taken 🙂 This is a bad layout. Considering the 2800 sqft carpet area, the rooms are small, space is not efficiently used and it seems that the designer is trying to forcefully fit the maximum number. of rooms . 3 toilets are more than enough . Lighting and ventilation are awful. I don't think this is the work of any experienced or sensible architect. Check whether your designer is an architect or an interior designer, there is a huge difference between the two! Actually these are two 3BHK combined together. Given that we are a joint family(10 adults 2 kids), we kind of need a house with more number of private bathrooms."
}