{
    "id": "1bg39io",
    "title": "Sacrilege case: ‘Honeypreet directed to desecrate Guru Granth Sahib, Dera chief endorsed it’",
    "url": "https://indianexpress.com/article/cities/chandigarh/sacrilege-case-honeypreet-guru-granth-sahib-dera-chief-9217191/",
    "selftext": "According to sources, police have already chargesheeted Ram Rahim in the sacrilege case and this is the first time when Honeypreet Insan’s name has cropped up. Kaler, a proclaimed offender, had been on the run since 2018 and was arrested last month after photos of him attending a religious function in Ayodhya with a BJP UP Cabinet minister went viral, police said.",
    "flair": "Law & Courts",
    "score": 6,
    "num_comments": 4,
    "created_utc": 1710585753.0,
    "convurl": "https://external-preview.redd.it/bLjUC2OWAynXzOZR6APJ-qO-_Rm1IgYDCqtcDUR9gsk.jpg?auto=webp&s=e729ff32e0bda3031e5fa887cf9320324e8333a3",
    "comments": [
        "From the article:\n\nThe Punjab Police investigation into the 2015 Guru Granth Sahib sacrilege case received a shot in the arm after key accused Pardeep Kaler in his confessional statement recorded under section 164 CrPc reportedly not only named Dera Sacha Sauda (DSS) head Gurmeet Ram Rahim but also named, for the first time, the latter’s close associate Honeypreet Insan for “hatching a conspiracy to execute the sacrilege incident”, police sources said.\n\nKaler recorded his statement in connection with the sacrilege case (FIR number 63/2015 registered at the Bazakhana police station in Faridkot district) before Judicial Magistrate First Class, Chandigarh, Mohit in the last week of February, they said. Kaler’s statement assumes significance with the Lok Sabha elections around the corner.\n\n“Mohinder Pal brought to the knowledge of Ram Rahim that Harjinder Singh Manjhi, a Sikh preacher, had conducted a religious congregation at Burj Jawahar Singh Wala village in Faridkot district, where some followers of Ram Rahim got inspired by Manjhi’s preaching and broke lockets bearing pictures of the Dera chief and threw on the floor,” Kaler said.\n\n“This enraged Honeypreet. Ram Rahim and Honeypreet said they should give them a fitting reply (Itt da jawab patthar naal). Rakesh Dirba and Bittu said the Guru Granth Sahib is a symbol of the Sikhs. To which Honeypreet said they should desecrate the Guru Granth Sahib. Ram Rahim subsequently directed them to execute Honeyreet’s instructions immediately,” Kaler said in the statement.\n\n“Mohinder Pal Bittu, one of the 45 members of the Dera’s committee asked his team to execute the task. I was standing behind Ram Rahim, who asked me what my role would be. As I told him I was going to Delhi, he asked me to meet some people there,” Kaler said.\n\nAccording to police sources, Kaler stated that there was a threat to his life and the lives of his family members and that they might be killed. “I and my family have been facing threats. Ram Rahim, Honeypreet, Rakesh Dirba and others may get us killed. Mohinder Pal was already killed in the Nabha high-security cell,” Kaler added.\n\nResponding to the fresh development, Dera lawyer Kewal Brar in Faridkot said, “SIT is concocting stories to save their skin because further investigation has been marked against the SIT by Justice Raj Mohan Singh of the Punjab and Haryana High Court vide an order dated August 18, 2022. Besides, the investigation is still pending into the Mohinderpal Bittu Murder conspiracy based on his last letter/diary note. No sacrilege was committed by any Dera followers. These are false and politically motivated charges against them.”\n\nKaler, who was arrested in Gurgaon, is accused of being one of the conspirators in the incidents related to the desecration of Guru Granth Sahib in Faridkot in 2015. Dera Sacha Sauda follower Kaler and two other accused — Sandeep Bareta and Harsh Dhuri — were declared proclaimed offenders. Kaler was declared wanted by the Punjab Police in 2018.\n\nThree national committee members of Dera Sirsa — Harash Dhuri, Pardeep Kaler and Sandeep Bareta— are wanted in sacrilege cases. The police have also named three Dera Sacha Sauda followers —Gurtej Singh, Amrik Singh and Avtar Singh —in connection with the 2017 Maur bomb blast, in which seven people were killed.\n\nBareta and Dhuri are still on the run.\n\nThe name of Kaler was mentioned in FIR number 63 in connection with the theft of a ‘bir’ (copy) of the Guru Granth Sahib from Jawahar Singh Wala Gurdwara in Faridkot district in June 2015. The handwritten sacrilegious posters and torn pages of the holy book were found scattered at Bargari in Faridkot leading to anti-sacrilege protests in Faridkot.\n\nIn the police firing at anti-sacrilege protesters in October 2015, two persons were killed in Behbal Kalan while some persons were injured at Kotkapura in Faridkot.\n\nNotably, an investigation report of the Punjab Police on the 2015 sacrilege cases had pinned the blame on the Sirsa-based Dera Sacha Sauda sect for the incidents of the desecration of the Guru Granth Sahib. Dera chief Gurmeet Ram Rahim Singh had been named in the three sacrilege incidents.\n\nThe BJP-led Haryana government has been facing criticism over granting undue parole to Ram Rahim. Recently, the High Court directed the Haryana government not to grant further parole to the Dera chief.\n\nIn 2015, the then SAD-BJP government had handed over three cases — theft of a ‘bir’ (copy) of the Guru Granth Sahib from a Burj Jawahar Singh Wala gurdwara; putting up of handwritten sacrilegious posters in Bargari and Burj Jawahar Singh Wala; and torn pages of the holy book found at Bargari — to the CBI for the probe.\n\nLater, the Congress-led Punjab government had handed over the probe to a special investigation team (SIT) of the Punjab Police in September 2018 after the state Assembly passed a resolution withdrawing consent to the CBI to investigate these cases, noting the lack of progress in the investigation.",
        "Whenever there is religious issue, you ll always find BJP",
        "And [Congress](https://www.indiatoday.in/india/story/gurmeet-ram-rahim-dera-sacha-sauda-politics-bjp-congress-1031762-2017-08-26) and [AAP](https://www.newindian.in/aap-bjp-mantris-seek-rapist-ram-rahims-blessings-uproar-in-hp/) and [Akali Dal](https://www.hindustantimes.com/punjab/shiromani-akali-dal-s-dera-pardon-gamble-boomerangs-on-punjab/story-lwaeAdvJGFkwLuNUjPPuMO.html).",
        "Isn't she his daughter?"
    ],
    "cleaned_text": "sacrilege case honeypreet directed desecrate guru granth sahib dera chief endorsed according sources police already chargesheeted ram rahim sacrilege case first time honeypreet insans name cropped kaler proclaimed offender run since arrested last month photos attending religious function ayodhya bjp cabinet minister went viral police said ",
    "cleaned_title": "sacrilege case honeypreet directed desecrate guru granth sahib dera chief endorsed",
    "cleaned_selftext": "according sources police already chargesheeted ram rahim sacrilege case first time honeypreet insans name cropped kaler proclaimed offender run since arrested last month photos attending religious function ayodhya bjp cabinet minister went viral police said",
    "cleaned_comments": "article punjab police investigation guru granth sahib sacrilege case received shot arm key accused pardeep kaler confessional statement recorded section crpc reportedly named dera sacha sauda dss head gurmeet ram rahim also named first time latters close associate honeypreet insan hatching conspiracy execute sacrilege incident police sources said kaler recorded statement connection sacrilege case fir number registered bazakhana police station faridkot district judicial magistrate first class chandigarh mohit last week february said kalers statement assumes significance lok sabha elections around corner mohinder pal brought knowledge ram rahim harjinder singh manjhi sikh preacher conducted religious congregation burj jawahar singh wala village faridkot district followers ram rahim got inspired manjhis preaching broke lockets bearing pictures dera chief threw floor kaler said enraged honeypreet ram rahim honeypreet said give fitting reply itt da jawab patthar naal rakesh dirba bittu said guru granth sahib symbol sikhs honeypreet said desecrate guru granth sahib ram rahim subsequently directed execute honeyreets instructions immediately kaler said statement mohinder pal bittu one members deras committee asked team execute task standing behind ram rahim asked role would told going delhi asked meet people kaler said according police sources kaler stated threat life lives family members might killed family facing threats ram rahim honeypreet rakesh dirba others may get us killed mohinder pal already killed nabha highsecurity cell kaler added responding fresh development dera lawyer kewal brar faridkot said sit concocting stories save skin investigation marked sit justice raj mohan singh punjab haryana high court vide order dated august besides investigation still pending mohinderpal bittu murder conspiracy based last letterdiary note sacrilege committed dera followers false politically motivated charges kaler arrested gurgaon accused one conspirators incidents related desecration guru granth sahib faridkot dera sacha sauda follower kaler two accused sandeep bareta harsh dhuri declared proclaimed offenders kaler declared wanted punjab police three national committee members dera sirsa harash dhuri pardeep kaler sandeep bareta wanted sacrilege cases police also named three dera sacha sauda followers gurtej singh amrik singh avtar singh connection maur bomb blast seven people killed bareta dhuri still run name kaler mentioned fir number connection theft bir copy guru granth sahib jawahar singh wala gurdwara faridkot district june handwritten sacrilegious posters torn pages holy book found scattered bargari faridkot leading antisacrilege protests faridkot police firing antisacrilege protesters october two persons killed behbal kalan persons injured kotkapura faridkot notably investigation report punjab police sacrilege cases pinned blame sirsabased dera sacha sauda sect incidents desecration guru granth sahib dera chief gurmeet ram rahim singh named three sacrilege incidents bjpled haryana government facing criticism granting undue parole ram rahim recently high court directed haryana government grant parole dera chief sadbjp government handed three cases theft bir copy guru granth sahib burj jawahar singh wala gurdwara putting handwritten sacrilegious posters bargari burj jawahar singh wala torn pages holy book found bargari cbi probe later congressled punjab government handed probe special investigation team sit punjab police september state assembly passed resolution withdrawing consent cbi investigate cases noting lack progress investigation whenever religious issue always find bjp congresshttpswwwindiatodayinindiastorygurmeetramrahimderasachasaudapoliticsbjpcongress aaphttpswwwnewindianinaapbjpmantrisseekrapistramrahimsblessingsuproarinhp akali dalhttpswwwhindustantimescompunjabshiromaniakalidalsderapardongambleboomerangsonpunjabstorylwaeadvjgfkwlunujppumohtml isnt daughter",
    "light_cleaned_title": "Sacrilege case: ‘Honeypreet directed to desecrate Guru Granth Sahib, Dera chief endorsed it’",
    "light_cleaned_selftext": "According to sources, police have already chargesheeted Ram Rahim in the sacrilege case and this is the first time when Honeypreet Insan’s name has cropped up. Kaler, a proclaimed offender, had been on the run since 2018 and was arrested last month after photos of him attending a religious function in Ayodhya with a BJP UP Cabinet minister went viral, police said.",
    "light_cleaned_comments": "From the article: The Punjab Police investigation into the 2015 Guru Granth Sahib sacrilege case received a shot in the arm after key accused Pardeep Kaler in his confessional statement recorded under section 164 CrPc reportedly not only named Dera Sacha Sauda (DSS) head Gurmeet Ram Rahim but also named, for the first time, the latter’s close associate Honeypreet Insan for “hatching a conspiracy to execute the sacrilege incident”, police sources said. Kaler recorded his statement in connection with the sacrilege case (FIR number 63/2015 registered at the Bazakhana police station in Faridkot district) before Judicial Magistrate First Class, Chandigarh, Mohit in the last week of February, they said. Kaler’s statement assumes significance with the Lok Sabha elections around the corner. “Mohinder Pal brought to the knowledge of Ram Rahim that Harjinder Singh Manjhi, a Sikh preacher, had conducted a religious congregation at Burj Jawahar Singh Wala village in Faridkot district, where some followers of Ram Rahim got inspired by Manjhi’s preaching and broke lockets bearing pictures of the Dera chief and threw on the floor,” Kaler said. “This enraged Honeypreet. Ram Rahim and Honeypreet said they should give them a fitting reply (Itt da jawab patthar naal). Rakesh Dirba and Bittu said the Guru Granth Sahib is a symbol of the Sikhs. To which Honeypreet said they should desecrate the Guru Granth Sahib. Ram Rahim subsequently directed them to execute Honeyreet’s instructions immediately,” Kaler said in the statement. “Mohinder Pal Bittu, one of the 45 members of the Dera’s committee asked his team to execute the task. I was standing behind Ram Rahim, who asked me what my role would be. As I told him I was going to Delhi, he asked me to meet some people there,” Kaler said. According to police sources, Kaler stated that there was a threat to his life and the lives of his family members and that they might be killed. “I and my family have been facing threats. Ram Rahim, Honeypreet, Rakesh Dirba and others may get us killed. Mohinder Pal was already killed in the Nabha high-security cell,” Kaler added. Responding to the fresh development, Dera lawyer Kewal Brar in Faridkot said, “SIT is concocting stories to save their skin because further investigation has been marked against the SIT by Justice Raj Mohan Singh of the Punjab and Haryana High Court vide an order dated August 18, 2022. Besides, the investigation is still pending into the Mohinderpal Bittu Murder conspiracy based on his last letter/diary note. No sacrilege was committed by any Dera followers. These are false and politically motivated charges against them.” Kaler, who was arrested in Gurgaon, is accused of being one of the conspirators in the incidents related to the desecration of Guru Granth Sahib in Faridkot in 2015. Dera Sacha Sauda follower Kaler and two other accused — Sandeep Bareta and Harsh Dhuri — were declared proclaimed offenders. Kaler was declared wanted by the Punjab Police in 2018. Three national committee members of Dera Sirsa — Harash Dhuri, Pardeep Kaler and Sandeep Bareta— are wanted in sacrilege cases. The police have also named three Dera Sacha Sauda followers —Gurtej Singh, Amrik Singh and Avtar Singh —in connection with the 2017 Maur bomb blast, in which seven people were killed. Bareta and Dhuri are still on the run. The name of Kaler was mentioned in FIR number 63 in connection with the theft of a ‘bir’ (copy) of the Guru Granth Sahib from Jawahar Singh Wala Gurdwara in Faridkot district in June 2015. The handwritten sacrilegious posters and torn pages of the holy book were found scattered at Bargari in Faridkot leading to anti-sacrilege protests in Faridkot. In the police firing at anti-sacrilege protesters in October 2015, two persons were killed in Behbal Kalan while some persons were injured at Kotkapura in Faridkot. Notably, an investigation report of the Punjab Police on the 2015 sacrilege cases had pinned the blame on the Sirsa-based Dera Sacha Sauda sect for the incidents of the desecration of the Guru Granth Sahib. Dera chief Gurmeet Ram Rahim Singh had been named in the three sacrilege incidents. The BJP-led Haryana government has been facing criticism over granting undue parole to Ram Rahim. Recently, the High Court directed the Haryana government not to grant further parole to the Dera chief. In 2015, the then SAD-BJP government had handed over three cases — theft of a ‘bir’ (copy) of the Guru Granth Sahib from a Burj Jawahar Singh Wala gurdwara; putting up of handwritten sacrilegious posters in Bargari and Burj Jawahar Singh Wala; and torn pages of the holy book found at Bargari — to the CBI for the probe. Later, the Congress-led Punjab government had handed over the probe to a special investigation team (SIT) of the Punjab Police in September 2018 after the state Assembly passed a resolution withdrawing consent to the CBI to investigate these cases, noting the lack of progress in the investigation. Whenever there is religious issue, you ll always find BJP And [Congress](https://www.indiatoday.in/india/story/gurmeet-ram-rahim-dera-sacha-sauda-politics-bjp-congress-1031762-2017-08-26) and [AAP](https://www.newindian.in/aap-bjp-mantris-seek-rapist-ram-rahims-blessings-uproar-in-hp/) and [Akali Dal](https://www.hindustantimes.com/punjab/shiromani-akali-dal-s-dera-pardon-gamble-boomerangs-on-punjab/story-lwaeAdvJGFkwLuNUjPPuMO.html). Isn't she his daughter?"
}