{
    "id": "11oenz2",
    "title": "Am I eligible for compartmental exams if I fail in 2/5 subjects in theory portion of 12th CBSE board but got good marks in internals and practical exam?",
    "url": "https://www.reddit.com/r/india/comments/11oenz2/am_i_eligible_for_compartmental_exams_if_i_fail/",
    "selftext": "I messed up my physics and chemistry exam (just solved 2-3 questions ) . I did passed in the internals and might score between 23-28 in practical of all subjects (60+ in fine arts and 15+ in English ). So am I eligible to give compartment exam for these two subjects ?\n\nI have in total 5 subjects (PHY,CHEM,BIO,ENG,FINE ARTS).My english exam went great and I'm pretty confident for bio and fine arts .\n\n&amp;#x200B;\n\n[This is confusing me](https://preview.redd.it/lst6u6gsm2na1.png?width=1758&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=389c2ad0bda4c25fb472d015295b91c7144711ea)\n\n&amp;#x200B;\n\n[What's the difference between these two?](https://preview.redd.it/3ls7gzeum2na1.png?width=1666&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=dbf2b7cdf0fce41aa6f53908e393aa36495bf04d)\n\n&amp;#x200B;",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 4,
    "created_utc": 1678522726,
    "convurl": "https://b.thumbs.redditmedia.com/fm4Y-wN3vLFPu36-tAHf6JpPS91i2RHWbW4t4-aL7DU.jpg",
    "comments": [
        "Agar google pe dekho to yeh likha ha\n\nStudents who failed in any one of their five subjects are eligible to appear in CBSE Compartment Examination. Candidate having 6 subjects and got compartment in two subjects can appear in any one of the two compartmental subjects.\n\nYa to physics de paoge ya sirf chemistry dono dene he\nTo jab agla board hoga unke sath de paoge jitna mujhe dhyaan h\n\n\nAgar apke 5 main subject h aur aap do me fail h sorry ab 12th fail ha",
        "ohk thanks for commenting ..\n\nbtw do you know about NIOS on demand exams ?",
        "They will pass you don't worry. Speaking from experience"
    ],
    "cleaned_text": "eligible compartmental exams fail subjects theory portion th cbse board got good marks internals practical exam messed physics chemistry exam solved questions passed internals might score practical subjects fine arts english eligible give compartment exam two subjects total subjects phychembioengfine artsmy english exam went great im pretty confident bio fine arts ampxb confusing mehttpspreviewredditlstugsmnapngwidthampformatpngampautowebpampvenabledampscadbdacfbdbcea ampxb whats difference twohttpspreviewredditlsgzeumnapngwidthampformatpngampautowebpampvenabledampsdbfbcdffceaafeaabfd ampxb ",
    "cleaned_title": "eligible compartmental exams fail subjects theory portion th cbse board got good marks internals practical exam",
    "cleaned_selftext": "messed physics chemistry exam solved questions passed internals might score practical subjects fine arts english eligible give compartment exam two subjects total subjects phychembioengfine artsmy english exam went great im pretty confident bio fine arts ampxb confusing mehttpspreviewredditlstugsmnapngwidthampformatpngampautowebpampvenabledampscadbdacfbdbcea ampxb whats difference twohttpspreviewredditlsgzeumnapngwidthampformatpngampautowebpampvenabledampsdbfbcdffceaafeaabfd ampxb",
    "cleaned_comments": "agar google pe dekho yeh likha ha students failed one five subjects eligible appear cbse compartment examination candidate subjects got compartment two subjects appear one two compartmental subjects ya physics de paoge ya sirf chemistry dono dene jab agla board hoga unke sath de paoge jitna mujhe dhyaan h agar apke main subject h aur aap fail h sorry ab th fail ha ohk thanks commenting btw know nios demand exams pass dont worry speaking experience",
    "light_cleaned_title": "Am I eligible for compartmental exams if I fail in 2/5 subjects in theory portion of 12th CBSE board but got good marks in internals and practical exam?",
    "light_cleaned_selftext": "I messed up my physics and chemistry exam (just solved 2-3 questions ) . I did passed in the internals and might score between 23-28 in practical of all subjects (60+ in fine arts and 15+ in English ). So am I eligible to give compartment exam for these two subjects ? I have in total 5 subjects (PHY,CHEM,BIO,ENG,FINE ARTS).My english exam went great and I'm pretty confident for bio and fine arts .  [This is confusing me](https://preview.redd.it/lst6u6gsm2na1.png?width=1758&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=389c2ad0bda4c25fb472d015295b91c7144711ea)  [What's the difference between these two?](https://preview.redd.it/3ls7gzeum2na1.png?width=1666&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=dbf2b7cdf0fce41aa6f53908e393aa36495bf04d)",
    "light_cleaned_comments": "Agar google pe dekho to yeh likha ha Students who failed in any one of their five subjects are eligible to appear in CBSE Compartment Examination. Candidate having 6 subjects and got compartment in two subjects can appear in any one of the two compartmental subjects. Ya to physics de paoge ya sirf chemistry dono dene he To jab agla board hoga unke sath de paoge jitna mujhe dhyaan h Agar apke 5 main subject h aur aap do me fail h sorry ab 12th fail ha ohk thanks for commenting .. btw do you know about NIOS on demand exams ? They will pass you don't worry. Speaking from experience"
}