{
    "id": "13reiym",
    "title": "Defamation Suit involving BBC documentary to be heard by Rohini District Court | IFF is representing and providing legal support to Internet Archive in the matter.",
    "url": "https://www.reddit.com/r/india/comments/13reiym/defamation_suit_involving_bbc_documentary_to_be/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/aou011jgky1b1.png?width=1600&format=png&auto=webp&v=enabled&s=142bc0dbd8207043693f6542aef75cbe140cccc0\n\n### Tl;dr\n\nOn 26.05.2023, Rohini District Court (‘Rohini Court’) will be considering whether it has the jurisdiction to hear a defamation suit relating to the contentious two-part BBC documentary titled, “India: The Modi Question”. The suit has been filed by a member of BJP Jharkhand alleging damage to his reputation. He has prayed for a permanent injunction against BBC, Internet Archive and other Defendants to cease the publishing of the documentary, and for the passing of a decree of Rs. 10,00,000/- in his favour. IFF is representing and providing legal support to Internet Archive in the matter.\n\n### General background\n\nThe BBC documentary was released in January 2023 and caused major consternation in the country. Consequently, it was blocked for viewing by the Government of India under Section 69A of the Information Technology Act, 2000 (**‘IT Act’**)  read with Rule 16 of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (**‘IT Rules’)**. While the BBC itself did not release the documentary in India, it was uploaded by third parties on many publicly accessible internet websites, such as  YouTube and Internet Archive.\n\nConsequently, the Government of India issued a Final Order on 27.01.2023 and directed  Internet Archive to disable the link to the documentary available on its platform. Through a blogpost dated 27.01.2023, Internet Archive conveyed to its users that it had already disabled all the links to the documentary and that it was under an obligation to do so as a takedown request had been issued by the BBC under the Digital Millennium Copyright  Act , for copyright infringement.\n\nThe Internet Archive is a 501(c)(3) non-profit library, headquartered in San Francisco, California, United States. It is a digital library of Internet sites and other cultural artifacts in digital form. Like a paper library, it provides free access to researchers, historians, scholars, people with print disabilities, and the general public. Its mission is to provide ‘Universal Access to All Knowledge’.\n\n### Background of the Suit \n\nAs reported by [**BarandBench**](https://www.barandbench.com/news/litigation/bbc-documentary-on-pm-modi-delhi-court-issues-summons-bbc-wikipedia-internet-archive-defamation-case-bjp-leader?ref=static.internetfreedom.in), the suit claims that the Plaintiff is a State Executive Committee member of Jharkhand BJP and an active volunteer of  RSS and VHP. The Plaintiff has stated that the BBC documentary defames these organizations by giving impetus to unfounded and baseless allegations. \n\nReportedly, the Plaintiff has alleged that *\"The Defendant No.1 (BBC), strategically and purposefully disseminated unfounded rumours without verifying the authenticity of the claims. Furthermore, the accusations made therein foster animosity between multiple faith communities, in particular Hindus and Muslims.”*\n\nIt is the grievance of the Plaintiff that despite the documentary being banned in India, a page on Wikipedia provides links to the documentary, which in turn is accessible on Internet Archive.\n\n>*\"This leads to a reasonable inference that all three defendants are acting in concert and mutually in order to tarnish the image of the country as well as of distinguished organizations such as the Rashtriya Swayamsewak Sangh (RSS) and the Vishwa Hindu Parishad (VHP).\"*\n\nIt is in view of the above that the Plaintiff has filed the defamation suit against the BBC, Internet Archive and other Defendants. The Plaintiff has prayed for permanent injunction against the Defendants, restraining them from publishing the documentary. Additionally, the Plaintiff has sought an unconditional apology for the *“libellous and defamatory content”*, and damages of Rs. 10,000,00/- in favour of the Plaintiff.  \n\n### What has happened till now?\n\nOn 03.05.2023, summons were issued by the Rohini Court to the Defendants, including Internet Archive. Directions were given for filing of written statement within 30 days from the date of service of the summons. The next date of hearing was fixed for 11.05.2023.\n\nOn 11.05.2023, IFF’s lawyers, appearing on instructions from Internet Archive, submitted that the documentary had already been taken down and that it is under a continuous obligation under the DMCA to remove the content from its website. Internet Archive further submitted that if the Plaintiff had any objection regarding the same, it would do the needful.\n\nThe Rohini Court has now fixed the matter for 26.05.2023 and will be hearing arguments on whether the Court has jurisdiction to try the defamation suit. We will be prepared to represent Internet Archive, and the right to free expression and access to knowledge in India.\n\n### Important Documents:\n\n1. Order dated 03.05.2023 passed by the Rohini Court in C.S. D.J. 362 of 2023 ([**link**](https://drive.google.com/file/d/13sbhAhIAlv95DaX67dvKkNsFhfhIJvDN/view?usp=sharing&ref=static.internetfreedom.in))\n2. Order dated 11.05.2023 passed by the Rohini Court in C.S. D. 362 of 2023 ([**link**](https://drive.google.com/file/d/1mgGd3xD4nactSRMEbSug1PcY3P065RCx/view?usp=sharing&ref=static.internetfreedom.in))",
    "flair": "Law & Courts",
    "score": 85,
    "num_comments": 4,
    "created_utc": 1685012115.0,
    "convurl": "https://external-preview.redd.it/oHSBO5Drqs4jmHoQGPdjZiqnvbhluV7MxUqsgcgguBY.jpg?auto=webp&v=enabled&s=2c0b6ab2c5e47126ccc611ecd826337771996e31",
    "comments": [
        "BJP is a sore loser. I'm sure they'd be screaming free speach if liberals, muslims and kerala govt sued Stupido sen",
        "And you wonder why Indian courts are backlogged. Anywhere else in the world this suit would have been thrown out because of the lack of standing of the plaintiff. No one other than Narendra Modi himself can claim to be defamed since it’s his name on the banner. Of course, Modi would not want to show up to Rohini court to give evidence. Such a joke."
    ],
    "cleaned_text": "defamation suit involving bbc documentary heard rohini district court iff representing providing legal support internet archive matter xb tldr rohini district court rohini court considering whether jurisdiction hear defamation suit relating contentious twopart bbc documentary titled india modi question suit filed member bjp jharkhand alleging damage reputation prayed permanent injunction bbc internet archive defendants cease publishing documentary passing decree rs favour iff representing providing legal support internet archive matter general background bbc documentary released january caused major consternation country consequently blocked viewing government india section information technology act act read rule information technology intermediary guidelines digital media ethics code rules rules bbc release documentary india uploaded third parties many publicly accessible internet websites youtube internet archive consequently government india issued final order directed internet archive disable link documentary available platform blogpost dated internet archive conveyed users already disabled links documentary obligation takedown request issued bbc digital millennium copyright act copyright infringement internet archive c nonprofit library headquartered san francisco california united states digital library internet sites cultural artifacts digital form like paper library provides free access researchers historians scholars people print disabilities general public mission provide universal access knowledge background suit reported barandbenchhttpswwwbarandbenchcomnewslitigationbbcdocumentaryonpmmodidelhicourtissuessummonsbbcwikipediainternetarchivedefamationcasebjpleaderrefstaticinternetfreedomin suit claims plaintiff state executive committee member jharkhand bjp active volunteer rss vhp plaintiff stated bbc documentary defames organizations giving impetus unfounded baseless allegations reportedly plaintiff alleged defendant bbc strategically purposefully disseminated unfounded rumours without verifying authenticity claims furthermore accusations made therein foster animosity multiple faith communities particular hindus muslims grievance plaintiff despite documentary banned india page wikipedia provides links documentary turn accessible internet archive leads reasonable inference three defendants acting concert mutually order tarnish image country well distinguished organizations rashtriya swayamsewak sangh rss vishwa hindu parishad vhp view plaintiff filed defamation suit bbc internet archive defendants plaintiff prayed permanent injunction defendants restraining publishing documentary additionally plaintiff sought unconditional apology libellous defamatory content damages rs favour plaintiff happened till summons issued rohini court defendants including internet archive directions given filing written statement within days date service summons next date hearing fixed iffs lawyers appearing instructions internet archive submitted documentary already taken continuous obligation dmca remove content website internet archive submitted plaintiff objection regarding would needful rohini court fixed matter hearing arguments whether court jurisdiction try defamation suit prepared represent internet archive right free expression access knowledge india important documents order dated passed rohini court cs dj linkhttpsdrivegooglecomfiledsbhahialvdaxdvkknsfhfhijvdnviewuspsharingrefstaticinternetfreedomin order dated passed rohini court cs linkhttpsdrivegooglecomfiledmggdxdnactsrmebsugpcyprcxviewuspsharingrefstaticinternetfreedomin ",
    "cleaned_title": "defamation suit involving bbc documentary heard rohini district court iff representing providing legal support internet archive matter",
    "cleaned_selftext": "xb tldr rohini district court rohini court considering whether jurisdiction hear defamation suit relating contentious twopart bbc documentary titled india modi question suit filed member bjp jharkhand alleging damage reputation prayed permanent injunction bbc internet archive defendants cease publishing documentary passing decree rs favour iff representing providing legal support internet archive matter general background bbc documentary released january caused major consternation country consequently blocked viewing government india section information technology act act read rule information technology intermediary guidelines digital media ethics code rules rules bbc release documentary india uploaded third parties many publicly accessible internet websites youtube internet archive consequently government india issued final order directed internet archive disable link documentary available platform blogpost dated internet archive conveyed users already disabled links documentary obligation takedown request issued bbc digital millennium copyright act copyright infringement internet archive c nonprofit library headquartered san francisco california united states digital library internet sites cultural artifacts digital form like paper library provides free access researchers historians scholars people print disabilities general public mission provide universal access knowledge background suit reported barandbenchhttpswwwbarandbenchcomnewslitigationbbcdocumentaryonpmmodidelhicourtissuessummonsbbcwikipediainternetarchivedefamationcasebjpleaderrefstaticinternetfreedomin suit claims plaintiff state executive committee member jharkhand bjp active volunteer rss vhp plaintiff stated bbc documentary defames organizations giving impetus unfounded baseless allegations reportedly plaintiff alleged defendant bbc strategically purposefully disseminated unfounded rumours without verifying authenticity claims furthermore accusations made therein foster animosity multiple faith communities particular hindus muslims grievance plaintiff despite documentary banned india page wikipedia provides links documentary turn accessible internet archive leads reasonable inference three defendants acting concert mutually order tarnish image country well distinguished organizations rashtriya swayamsewak sangh rss vishwa hindu parishad vhp view plaintiff filed defamation suit bbc internet archive defendants plaintiff prayed permanent injunction defendants restraining publishing documentary additionally plaintiff sought unconditional apology libellous defamatory content damages rs favour plaintiff happened till summons issued rohini court defendants including internet archive directions given filing written statement within days date service summons next date hearing fixed iffs lawyers appearing instructions internet archive submitted documentary already taken continuous obligation dmca remove content website internet archive submitted plaintiff objection regarding would needful rohini court fixed matter hearing arguments whether court jurisdiction try defamation suit prepared represent internet archive right free expression access knowledge india important documents order dated passed rohini court cs dj linkhttpsdrivegooglecomfiledsbhahialvdaxdvkknsfhfhijvdnviewuspsharingrefstaticinternetfreedomin order dated passed rohini court cs linkhttpsdrivegooglecomfiledmggdxdnactsrmebsugpcyprcxviewuspsharingrefstaticinternetfreedomin",
    "cleaned_comments": "bjp sore loser im sure theyd screaming free speach liberals muslims kerala govt sued stupido sen wonder indian courts backlogged anywhere else world suit would thrown lack standing plaintiff one narendra modi claim defamed since name banner course modi would want show rohini court give evidence joke",
    "light_cleaned_title": "Defamation Suit involving BBC documentary to be heard by Rohini District Court | IFF is representing and providing legal support to Internet Archive in the matter.",
    "light_cleaned_selftext": "&#x200B; ### Tl;dr On 26.05.2023, Rohini District Court (‘Rohini Court’) will be considering whether it has the jurisdiction to hear a defamation suit relating to the contentious two-part BBC documentary titled, “India: The Modi Question”. The suit has been filed by a member of BJP Jharkhand alleging damage to his reputation. He has prayed for a permanent injunction against BBC, Internet Archive and other Defendants to cease the publishing of the documentary, and for the passing of a decree of Rs. 10,00,000/- in his favour. IFF is representing and providing legal support to Internet Archive in the matter. ### General background The BBC documentary was released in January 2023 and caused major consternation in the country. Consequently, it was blocked for viewing by the Government of India under Section 69A of the Information Technology Act, 2000 (**‘IT Act’**) read with Rule 16 of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (**‘IT Rules’)**. While the BBC itself did not release the documentary in India, it was uploaded by third parties on many publicly accessible internet websites, such as YouTube and Internet Archive. Consequently, the Government of India issued a Final Order on 27.01.2023 and directed Internet Archive to disable the link to the documentary available on its platform. Through a blogpost dated 27.01.2023, Internet Archive conveyed to its users that it had already disabled all the links to the documentary and that it was under an obligation to do so as a takedown request had been issued by the BBC under the Digital Millennium Copyright Act , for copyright infringement. The Internet Archive is a 501(c)(3) non-profit library, headquartered in San Francisco, California, United States. It is a digital library of Internet sites and other cultural artifacts in digital form. Like a paper library, it provides free access to researchers, historians, scholars, people with print disabilities, and the general public. Its mission is to provide ‘Universal Access to All Knowledge’. ### Background of the Suit As reported by [**BarandBench**](https://www.barandbench.com/news/litigation/bbc-documentary-on-pm-modi-delhi-court-issues-summons-bbc-wikipedia-internet-archive-defamation-case-bjp-leader?ref=static.internetfreedom.in), the suit claims that the Plaintiff is a State Executive Committee member of Jharkhand BJP and an active volunteer of RSS and VHP. The Plaintiff has stated that the BBC documentary defames these organizations by giving impetus to unfounded and baseless allegations. Reportedly, the Plaintiff has alleged that *\"The Defendant No.1 (BBC), strategically and purposefully disseminated unfounded rumours without verifying the authenticity of the claims. Furthermore, the accusations made therein foster animosity between multiple faith communities, in particular Hindus and Muslims.”* It is the grievance of the Plaintiff that despite the documentary being banned in India, a page on Wikipedia provides links to the documentary, which in turn is accessible on Internet Archive. >*\"This leads to a reasonable inference that all three defendants are acting in concert and mutually in order to tarnish the image of the country as well as of distinguished organizations such as the Rashtriya Swayamsewak Sangh (RSS) and the Vishwa Hindu Parishad (VHP).\"* It is in view of the above that the Plaintiff has filed the defamation suit against the BBC, Internet Archive and other Defendants. The Plaintiff has prayed for permanent injunction against the Defendants, restraining them from publishing the documentary. Additionally, the Plaintiff has sought an unconditional apology for the *“libellous and defamatory content”*, and damages of Rs. 10,000,00/- in favour of the Plaintiff. ### What has happened till now? On 03.05.2023, summons were issued by the Rohini Court to the Defendants, including Internet Archive. Directions were given for filing of written statement within 30 days from the date of service of the summons. The next date of hearing was fixed for 11.05.2023. On 11.05.2023, IFF’s lawyers, appearing on instructions from Internet Archive, submitted that the documentary had already been taken down and that it is under a continuous obligation under the DMCA to remove the content from its website. Internet Archive further submitted that if the Plaintiff had any objection regarding the same, it would do the needful. The Rohini Court has now fixed the matter for 26.05.2023 and will be hearing arguments on whether the Court has jurisdiction to try the defamation suit. We will be prepared to represent Internet Archive, and the right to free expression and access to knowledge in India. ### Important Documents: 1. Order dated 03.05.2023 passed by the Rohini Court in C.S. D.J. 362 of 2023 ([**link**](https://drive.google.com/file/d/13sbhAhIAlv95DaX67dvKkNsFhfhIJvDN/view?usp=sharing&ref=static.internetfreedom.in)) 2. Order dated 11.05.2023 passed by the Rohini Court in C.S. D. 362 of 2023 ([**link**](https://drive.google.com/file/d/1mgGd3xD4nactSRMEbSug1PcY3P065RCx/view?usp=sharing&ref=static.internetfreedom.in))",
    "light_cleaned_comments": "BJP is a sore loser. I'm sure they'd be screaming free speach if liberals, muslims and kerala govt sued Stupido sen And you wonder why Indian courts are backlogged. Anywhere else in the world this suit would have been thrown out because of the lack of standing of the plaintiff. No one other than Narendra Modi himself can claim to be defamed since it’s his name on the banner. Of course, Modi would not want to show up to Rohini court to give evidence. Such a joke."
}