{
    "id": "1cmb86n",
    "title": "Gas Cylinder Blast in one of the side street stalls near Noida Sector 75 [OC]",
    "url": "https://v.redd.it/j0kh6fyn40zc1",
    "selftext": "Ther were around 3-4 cylinders at that spot. Thankfully no one got hurt and there was a fire hydrant near it. The people there extinguished before the police and the fire truck arrived.",
    "flair": "Crime",
    "score": 26,
    "num_comments": 8,
    "created_utc": 1715086501.0,
    "convurl": "https://external-preview.redd.it/bXl0cWh2bW40MHpjMQAnBHn9FGU3F0eJXpmGnK7klmhcBmLIxIpwBlYDlEQH.png?format=pjpg&auto=webp&s=669c0008375225c9df8031a0550e3a6a18eedece",
    "comments": [
        "This is exactly the reason there are regulations for what can be done in the open and what shouldn’t. \n\nHaving such facilities in such close proximity to vehicles and pedestrians will result in tragedy.",
        "Agreed. These shops are illegal as that area is not theirs or rented. Police had already cleared all of them last year but few months after they came back.",
        "bro fire hydrant near by?? is it provided by the civic authority or any private residential society?",
        "\"मैं नाली के गैस को इस्तेमाल करता था\"",
        "Yes read the caption",
        "read the question, who installed it? muncipal corporation or ur society?",
        "Im not sure exactly, but most likely my society as the land is owned by the society. Leaving that, read my other other comment, the police demolished all the illegal shops. I have attached a pic with it."
    ],
    "cleaned_text": "gas cylinder blast one side street stalls near noida sector oc ther around cylinders spot thankfully one got hurt fire hydrant near people extinguished police fire truck arrived ",
    "cleaned_title": "gas cylinder blast one side street stalls near noida sector oc",
    "cleaned_selftext": "ther around cylinders spot thankfully one got hurt fire hydrant near people extinguished police fire truck arrived",
    "cleaned_comments": "exactly reason regulations done open shouldnt facilities close proximity vehicles pedestrians result tragedy agreed shops illegal area rented police already cleared last year months came back bro fire hydrant near provided civic authority private residential society yes read caption read question installed muncipal corporation ur society im sure exactly likely society land owned society leaving read comment police demolished illegal shops attached pic",
    "light_cleaned_title": "Gas Cylinder Blast in one of the side street stalls near Noida Sector 75 [OC]",
    "light_cleaned_selftext": "Ther were around 3-4 cylinders at that spot. Thankfully no one got hurt and there was a fire hydrant near it. The people there extinguished before the police and the fire truck arrived.",
    "light_cleaned_comments": "This is exactly the reason there are regulations for what can be done in the open and what shouldn’t. Having such facilities in such close proximity to vehicles and pedestrians will result in tragedy. Agreed. These shops are illegal as that area is not theirs or rented. Police had already cleared all of them last year but few months after they came back. bro fire hydrant near by?? is it provided by the civic authority or any private residential society? \"मैं नाली के गैस को इस्तेमाल करता था\" Yes read the caption read the question, who installed it? muncipal corporation or ur society? Im not sure exactly, but most likely my society as the land is owned by the society. Leaving that, read my other other comment, the police demolished all the illegal shops. I have attached a pic with it."
}