{
    "id": "1f8hbno",
    "title": "Wait, what?",
    "url": "https://www.reddit.com/gallery/1f8hbno",
    "selftext": "Hostel owners are protesting to bring WFO cuz these cunts are losing out on rent that's already jacked up?? ",
    "flair": "Policy/Economy",
    "score": 537,
    "num_comments": 91,
    "created_utc": 1725414121.0,
    "convurl": "https://i.redd.it/5uz53hv06pmd1.jpg",
    "comments": [
        "It was always about commercial real estates. Hard WFH policies the kind people were coming up with during the pandemic would have decimated IT parks as companies could move to much smaller spaces while running at full strength. It was to keep the IT park rents coming regularly that the ideas were killed outright.",
        "How stupid! I agree people have to make their livelihood but this is just so sad. Working from home is allowing people not to contribute to traffic and pollution. It is allowing people to chose lower and better rental places and stay a little far from office. These idiotic hostels and PGs do nothing ever overcharge rents and give below average living conditions to people",
        "I hope the real estate market crashes very very badly and makes all their black money investment worthless. \nIncluding those huge real estate projects owned by politicians. \n\nBuying or renting a home should be affordable.",
        "> Govt has allotted the plots at subsidised costs.\n\nDo you not think that the subsidy was decided based on the economy generated by company?\n\nDo you not think that rental income is a part of the economy?\n\nWhat part of that argument do you not agree with?",
        "I hope the real estate market crashes very very badly and makes all their black money investment worthless. \nIncluding those huge real estate projects owned by politicians. \n\nBuying or renting a home should be affordable.",
        "Agreed",
        "LOL athi ante idi",
        "i hope so too\n\nbut unlikely to happen",
        "Any crash in the market in any form will lead to recession.",
        "Not in IT but as long as IT workers can keep pushing for wfh it should work. \nFor eg, Most Migrants in Bombay, spend half their pay on rent. \n\nThere's no living only surviving.",
        "It’s called surplus.., the money saved in rent stays with the earner and he can SPEND it in other parts of the economy like eating out, vacations, better clothes etc.., as long as said  money is not invested in non performing assets like gold.., the economy will be fine. These hostels have to adapt or perish-capitalism at work",
        "Crash in real estate of single city has nothing to do with recession .",
        "Next there will be a protest rally by restaurants in IT belt.\n\n\"In places like ..., many of us have taken loans and constructed restaurants to cater to the IT rush.  But now, we are overburdened with EMIs and are not getting any income because many people cook at home.  This needs to end as humans are equipped with hands for the benefit of all and not just one family.  Make it compulsory for employees to eat out every day.\"",
        "Womp Womp.",
        "😂😂😂\n\nProtect unethical passive income yeaah ..",
        "LMAO so employees should go back to office so hostel owners can make profit? \n\nIt's so fucked up bruh.\n\nIf your business is not working anymore then change your business 😂",
        "Total to agree. They are skyrocketing their price.",
        "This is financial molestation.....",
        "Real estate market isn't a separate market. If it crashes, you'll pay for it as well.",
        "poor Landlords eh?",
        "✨capitalism✨",
        "Some company abroad made WFO mandatory for developers. Nobody went, so they had no choice but to continue WFH. \n\nSome of these apartment owners in prime locations treated young IT employees with such dislike & mistrust. They deserve this.",
        "We over charge you for your benefit. Govt gives us and companies subsidies for your benefit. IT worker pays more income as taxes, these real estate owners and businesses get the subsidies and benefits and cry for any time a venture isn't profitable. It shouldn't be govts job to make businesses successful just because you took loans.",
        "BRING BACK STEAM ENGINES SO THAT COAL DEALERS CAN MAKE A LIVELIHOOD!!!!!",
        "No words. This is so lame!",
        "Real market crash has nothing to do with recession.",
        "It's not even profit. It's greed. They're sitting on appreciating assets.\n\n Even if the cash flow completely stopped, they could just sell the land and break even. Or rent out to families for cheaper and make a smaller profit.\n\nThey don't want that. They want to cram 10 people into a 2000 Sq. Ft building and charge each of them Rs. 5000/-.",
        "I wasn't talking about the health of the economy though. I was talking about the landlords being a part of local economy that would've been considered while deciding subsidies.",
        "Mao was right about landlords",
        "But they won't, cause they're scumbags.\n\nThese greedy MFs has ruined real estate market.\n\nReal estate market needs to fall where a mid-class person own a space that can be called home.\n\nIn my city(Ahmedabad, Gujarat) I saw a board where they wrote 3BHK flat starting at just 1.35cr ☠️\n\n1cr is written everywhere as if it is 10-20L",
        "Let me get the world's smallest violin",
        "This is not exactly a new sentiment.  \n\nOur BJP Bangalore Central MP said exactly the same thing back in 2021:  \n\nhttps://www.hindustantimes.com/india-news/bjp-mp-wants-work-from-home-for-techies-to-be-scrapped-says-its-hurting-other-sectors/story-3v8OHbdSfNzmtIHqVx3tKP.html",
        "Adani be like “Fuck yeah”",
        "I don't have any sympathy for these hostel owners. Fucking assholes. When asked to reduce the rent, their butt puckers up.",
        "Sure. The wider market will be affected because people will sell to cover their losses. But if that means that real estate moves from being an investment vehicle to something people buy to live in then, overall that's a net positive. The people who will be affected the most are the people who've profited off of an economy that's flourishing over stagnating wages and a widening class gap.",
        "Real estate will never move from being an investment vehicle. It just cannot be done in a democracy.",
        "What do you mean when you say that? What does being a democracy have to do with real estate being used as an investment?",
        "Wtf",
        "They are entitled dumbfvcks",
        "This is like Americans rallying to bring back slavery because of their hardships.",
        "Let me rephrase the news \n\n“Land And Hostel Owner Mafia wants to exploit people more and more in India”",
        "It's like generator manufacturers protesting against inverters. Seriously, how foolish is our country!",
        "wfh IT companies can steal those talents right",
        "That just creates gap for new IT companies that can steal those talents right",
        "Cyber cafe owners should have protested against home and mobile internet.",
        "Land is not under the Government's control. Like in China and Russia. If you take any developed metro city. Delhi, gurgaon to New york. High rise apartments are bought by the rich and they remain empty because it is an investment vehicle. Most of these apartment complexes in New york for example are owned by Russians and West Europeans.",
        "The prime imperative being compensation if any pureplay WFH company can match what the existing company does it could poach a lot of good talent. One bottleneck would be to limit hiring to self driven individuals or develop a middle management stack that knows how to manage talent remotely.\n\nCurrently, the middle management level is only competent in physical office space politics and cubicle games.",
        "If IT employees go back because of this, they are grade A pussies.",
        "You also have rent control apartments in major cities across the States. So even if people are buying to sell later, rent is kept under control, unlike in India. India has also introduced laws regarding the use of real estate as an investment. Apartments that go empty are taxed heavily. It's because we're a democracy that we can disincentivise real estate as an investment.",
        "Ok, so you want govt to mandate working from office so that your income is protected, fine, then you should also be ok with govt mandating rent control so that tenants incomes are also protected from greedy landlords.",
        "You don't want to talk about rent controlled apartments and that too in a city like New york, you'll have better luck finding a unicorn dancing on an unreleased Michael Jackson's song. The tenant has to be living there continuously since the 1970s if I'm not wrong and the built year if that building has to be even decades older than that. The probability of that, in and around manhattan is so low it's basically zero. Moreover how would you, as a free market democracy, discourage the real estate as an investment?",
        "If landlords are ok with forcing people to come to office so that their incomes are protected, then they should also be ok with rent control so that tenants incomes are also protected from exploitation.",
        "Real estate is over over priced and it’s hard to afford by middle class people and the amount whatever these so called builders are charging and there amenities we are getting are utter bullshit the real estate market should crash and it will one day for sure the bubble will burst.",
        "If market crashes those who bought will suffer. \n\nThe salaried employees are paying EMI through their nose.",
        "Good thing I'm not a salaried employee",
        "Nor am I. \n\nBut my point is the real estate developers will not suffer, nor will the politicians.\n\nIt's the middle class salaried guy who will get F'd.",
        "So landlords would not be making money but someone else will. No one is guaranteed income; landlords can adapt(convert hostels to marriage halls etc..) or go broke. No one is owed an income stream."
    ],
    "cleaned_text": "wait hostel owners protesting bring wfo cuz cunts losing rent thats already jacked ",
    "cleaned_title": "wait",
    "cleaned_selftext": "hostel owners protesting bring wfo cuz cunts losing rent thats already jacked",
    "cleaned_comments": "always commercial real estates hard wfh policies kind people coming pandemic would decimated parks companies could move much smaller spaces running full strength keep park rents coming regularly ideas killed outright stupid agree people make livelihood sad working home allowing people contribute traffic pollution allowing people chose lower better rental places stay little far office idiotic hostels pgs nothing ever overcharge rents give average living conditions people hope real estate market crashes badly makes black money investment worthless including huge real estate projects owned politicians buying renting home affordable govt allotted plots subsidised costs think subsidy decided based economy generated company think rental income part economy part argument agree hope real estate market crashes badly makes black money investment worthless including huge real estate projects owned politicians buying renting home affordable agreed lol athi ante idi hope unlikely happen crash market form lead recession long workers keep pushing wfh work eg migrants bombay spend half pay rent theres living surviving called surplus money saved rent stays earner spend parts economy like eating vacations better clothes etc long said money invested non performing assets like gold economy fine hostels adapt perishcapitalism work crash real estate single city nothing recession next protest rally restaurants belt places like many us taken loans constructed restaurants cater rush overburdened emis getting income many people cook home needs end humans equipped hands benefit one family make compulsory employees eat every day womp womp protect unethical passive income yeaah lmao employees go back office hostel owners make profit fucked bruh business working anymore change business total agree skyrocketing price financial molestation real estate market isnt separate market crashes youll pay well poor landlords eh capitalism company abroad made wfo mandatory developers nobody went choice continue wfh apartment owners prime locations treated young employees dislike mistrust deserve charge benefit govt gives us companies subsidies benefit worker pays income taxes real estate owners businesses get subsidies benefits cry time venture isnt profitable shouldnt govts job make businesses successful took loans bring back steam engines coal dealers make livelihood words lame real market crash nothing recession even profit greed theyre sitting appreciating assets even cash flow completely stopped could sell land break even rent families cheaper make smaller profit dont want want cram people sq ft building charge rs wasnt talking health economy though talking landlords part local economy wouldve considered deciding subsidies mao right landlords wont cause theyre scumbags greedy mfs ruined real estate market real estate market needs fall midclass person space called home cityahmedabad gujarat saw board wrote bhk flat starting cr cr written everywhere l let get worlds smallest violin exactly new sentiment bjp bangalore central mp said exactly thing back adani like fuck yeah dont sympathy hostel owners fucking assholes asked reduce rent butt puckers sure wider market affected people sell cover losses means real estate moves investment vehicle something people buy live overall thats net positive people affected people whove profited economy thats flourishing stagnating wages widening class gap real estate never move investment vehicle done democracy mean say democracy real estate used investment wtf entitled dumbfvcks like americans rallying bring back slavery hardships let rephrase news land hostel owner mafia wants exploit people india like generator manufacturers protesting inverters seriously foolish country wfh companies steal talents right creates gap new companies steal talents right cyber cafe owners protested home mobile internet land governments control like china russia take developed metro city delhi gurgaon new york high rise apartments bought rich remain empty investment vehicle apartment complexes new york example owned russians west europeans prime imperative compensation pureplay wfh company match existing company could poach lot good talent one bottleneck would limit hiring self driven individuals develop middle management stack knows manage talent remotely currently middle management level competent physical office space politics cubicle games employees go back grade pussies also rent control apartments major cities across states even people buying sell later rent kept control unlike india india also introduced laws regarding use real estate investment apartments go empty taxed heavily democracy disincentivise real estate investment ok want govt mandate working office income protected fine also ok govt mandating rent control tenants incomes also protected greedy landlords dont want talk rent controlled apartments city like new york youll better luck finding unicorn dancing unreleased michael jacksons song tenant living continuously since im wrong built year building even decades older probability around manhattan low basically zero moreover would free market democracy discourage real estate investment landlords ok forcing people come office incomes protected also ok rent control tenants incomes also protected exploitation real estate priced hard afford middle class people amount whatever called builders charging amenities getting utter bullshit real estate market crash one day sure bubble burst market crashes bought suffer salaried employees paying emi nose good thing im salaried employee point real estate developers suffer politicians middle class salaried guy get fd landlords would making money someone else one guaranteed income landlords adaptconvert hostels marriage halls etc go broke one owed income stream",
    "light_cleaned_title": "Wait, what?",
    "light_cleaned_selftext": "Hostel owners are protesting to bring WFO cuz these cunts are losing out on rent that's already jacked up??",
    "light_cleaned_comments": "It was always about commercial real estates. Hard WFH policies the kind people were coming up with during the pandemic would have decimated IT parks as companies could move to much smaller spaces while running at full strength. It was to keep the IT park rents coming regularly that the ideas were killed outright. How stupid! I agree people have to make their livelihood but this is just so sad. Working from home is allowing people not to contribute to traffic and pollution. It is allowing people to chose lower and better rental places and stay a little far from office. These idiotic hostels and PGs do nothing ever overcharge rents and give below average living conditions to people I hope the real estate market crashes very very badly and makes all their black money investment worthless. Including those huge real estate projects owned by politicians. Buying or renting a home should be affordable. > Govt has allotted the plots at subsidised costs. Do you not think that the subsidy was decided based on the economy generated by company? Do you not think that rental income is a part of the economy? What part of that argument do you not agree with? I hope the real estate market crashes very very badly and makes all their black money investment worthless. Including those huge real estate projects owned by politicians. Buying or renting a home should be affordable. Agreed LOL athi ante idi i hope so too but unlikely to happen Any crash in the market in any form will lead to recession. Not in IT but as long as IT workers can keep pushing for wfh it should work. For eg, Most Migrants in Bombay, spend half their pay on rent. There's no living only surviving. It’s called surplus.., the money saved in rent stays with the earner and he can SPEND it in other parts of the economy like eating out, vacations, better clothes etc.., as long as said money is not invested in non performing assets like gold.., the economy will be fine. These hostels have to adapt or perish-capitalism at work Crash in real estate of single city has nothing to do with recession . Next there will be a protest rally by restaurants in IT belt. \"In places like ..., many of us have taken loans and constructed restaurants to cater to the IT rush. But now, we are overburdened with EMIs and are not getting any income because many people cook at home. This needs to end as humans are equipped with hands for the benefit of all and not just one family. Make it compulsory for employees to eat out every day.\" Womp Womp. 😂😂😂 Protect unethical passive income yeaah .. LMAO so employees should go back to office so hostel owners can make profit? It's so fucked up bruh. If your business is not working anymore then change your business 😂 Total to agree. They are skyrocketing their price. This is financial molestation..... Real estate market isn't a separate market. If it crashes, you'll pay for it as well. poor Landlords eh? ✨capitalism✨ Some company abroad made WFO mandatory for developers. Nobody went, so they had no choice but to continue WFH. Some of these apartment owners in prime locations treated young IT employees with such dislike & mistrust. They deserve this. We over charge you for your benefit. Govt gives us and companies subsidies for your benefit. IT worker pays more income as taxes, these real estate owners and businesses get the subsidies and benefits and cry for any time a venture isn't profitable. It shouldn't be govts job to make businesses successful just because you took loans. BRING BACK STEAM ENGINES SO THAT COAL DEALERS CAN MAKE A LIVELIHOOD!!!!! No words. This is so lame! Real market crash has nothing to do with recession. It's not even profit. It's greed. They're sitting on appreciating assets. Even if the cash flow completely stopped, they could just sell the land and break even. Or rent out to families for cheaper and make a smaller profit. They don't want that. They want to cram 10 people into a 2000 Sq. Ft building and charge each of them Rs. 5000/-. I wasn't talking about the health of the economy though. I was talking about the landlords being a part of local economy that would've been considered while deciding subsidies. Mao was right about landlords But they won't, cause they're scumbags. These greedy MFs has ruined real estate market. Real estate market needs to fall where a mid-class person own a space that can be called home. In my city(Ahmedabad, Gujarat) I saw a board where they wrote 3BHK flat starting at just 1.35cr ☠️ 1cr is written everywhere as if it is 10-20L Let me get the world's smallest violin This is not exactly a new sentiment. Our BJP Bangalore Central MP said exactly the same thing back in 2021: Adani be like “Fuck yeah” I don't have any sympathy for these hostel owners. Fucking assholes. When asked to reduce the rent, their butt puckers up. Sure. The wider market will be affected because people will sell to cover their losses. But if that means that real estate moves from being an investment vehicle to something people buy to live in then, overall that's a net positive. The people who will be affected the most are the people who've profited off of an economy that's flourishing over stagnating wages and a widening class gap. Real estate will never move from being an investment vehicle. It just cannot be done in a democracy. What do you mean when you say that? What does being a democracy have to do with real estate being used as an investment? Wtf They are entitled dumbfvcks This is like Americans rallying to bring back slavery because of their hardships. Let me rephrase the news “Land And Hostel Owner Mafia wants to exploit people more and more in India” It's like generator manufacturers protesting against inverters. Seriously, how foolish is our country! wfh IT companies can steal those talents right That just creates gap for new IT companies that can steal those talents right Cyber cafe owners should have protested against home and mobile internet. Land is not under the Government's control. Like in China and Russia. If you take any developed metro city. Delhi, gurgaon to New york. High rise apartments are bought by the rich and they remain empty because it is an investment vehicle. Most of these apartment complexes in New york for example are owned by Russians and West Europeans. The prime imperative being compensation if any pureplay WFH company can match what the existing company does it could poach a lot of good talent. One bottleneck would be to limit hiring to self driven individuals or develop a middle management stack that knows how to manage talent remotely. Currently, the middle management level is only competent in physical office space politics and cubicle games. If IT employees go back because of this, they are grade A pussies. You also have rent control apartments in major cities across the States. So even if people are buying to sell later, rent is kept under control, unlike in India. India has also introduced laws regarding the use of real estate as an investment. Apartments that go empty are taxed heavily. It's because we're a democracy that we can disincentivise real estate as an investment. Ok, so you want govt to mandate working from office so that your income is protected, fine, then you should also be ok with govt mandating rent control so that tenants incomes are also protected from greedy landlords. You don't want to talk about rent controlled apartments and that too in a city like New york, you'll have better luck finding a unicorn dancing on an unreleased Michael Jackson's song. The tenant has to be living there continuously since the 1970s if I'm not wrong and the built year if that building has to be even decades older than that. The probability of that, in and around manhattan is so low it's basically zero. Moreover how would you, as a free market democracy, discourage the real estate as an investment? If landlords are ok with forcing people to come to office so that their incomes are protected, then they should also be ok with rent control so that tenants incomes are also protected from exploitation. Real estate is over over priced and it’s hard to afford by middle class people and the amount whatever these so called builders are charging and there amenities we are getting are utter bullshit the real estate market should crash and it will one day for sure the bubble will burst. If market crashes those who bought will suffer. The salaried employees are paying EMI through their nose. Good thing I'm not a salaried employee Nor am I. But my point is the real estate developers will not suffer, nor will the politicians. It's the middle class salaried guy who will get F'd. So landlords would not be making money but someone else will. No one is guaranteed income; landlords can adapt(convert hostels to marriage halls etc..) or go broke. No one is owed an income stream."
}