{
    "id": "1cgm3as",
    "title": "Supreme Court extends stay on trial of BJP chief K Annamalai over alleged hate speech",
    "url": "https://www.newindianexpress.com/states/tamil-nadu/2024/Apr/29/supreme-court-extends-stay-on-trial-of-bjp-chief-k-annamalai-over-alleged-hate-speech",
    "selftext": "SC bench consisting of Justices Sanjiv Khanna and Dipankar Datta stay trial against Tamil Nadu BJP president for hate speech against a Christian NGO. \n\nSame bench also refuses to give bail to Arvind Kejriwal and Manish Sisodia for the Delhi Liquor Policy case despite no money trail.\n\nSame bech also dismisses petition for 100% EVM-VVPAT verification.\n\nEarlier, a bench comprising Justices Sanjiv Khanna, M M Sundresh and Bela Trivedi also refused bail to BRS leader K Kavitha in the same Liquor Policy case despite little reliable evidence against her.\n\nhttps://m.economictimes.com/news/politics-and-nation/why-didnt-you-file-for-bail-supreme-court-asks-arvind-kejriwal/articleshow/109704055.cms\n\nhttps://thewire.in/law/manish-sisodia-supreme-court-bail-justice-khanna\n\nhttps://www.business-standard.com/india-news/sc-refuses-bail-to-k-kavitha-in-ed-case-related-to-delhi-excise-policy-scam-124032200265_1.html\n\nhttps://www.livelaw.in/top-stories/supreme-court-judgment-on-evm-vvpat-verification-live-updates-256161 ",
    "flair": "Law & Courts",
    "score": 45,
    "num_comments": 3,
    "created_utc": 1714458656.0,
    "convurl": "https://external-preview.redd.it/a511y4JHmnTCdEHLhMZbkIGjtAeO--UKBEtP5yFiL5w.jpg?auto=webp&s=a434e8a5b2bd2e2ed56df842d8e19bf7de39c486",
    "comments": [
        "Clear video evidence existed against K Annamalai for hate speech against the Christian NGO in a YouTube interview. \n\nhttps://www.thehindu.com/news/national/tamil-nadu/madras-hc-stays-further-proceedings-in-case-against-annamalai/article67590836.ece?_gl=1*1l77un3*_ga*YW1wLVcyTzQ1Y2JaZU15bVAtRUViSXpSLVJCOFE5dktva1pzQnBielFiWXJjVDNLZW43WDdTOXp3TmE4allhc25oTDc.*_ga_MHCVDGHV0S*MTcxNDQ1NzMyNi40LjEuMTcxNDQ1ODcyMS4wLjAuMA..",
        "Ofcourse, look at the judges on the bench. Khanna defn getting ticket after retirement.",
        "https://preview.redd.it/6ogr4dxgjuxc1.jpeg?width=1023&format=pjpg&auto=webp&s=ae4b356a4697657950a5c0805eaa4b3b48681421"
    ],
    "cleaned_text": "supreme court extends stay trial bjp chief k annamalai alleged hate speech sc bench consisting justices sanjiv khanna dipankar datta stay trial tamil nadu bjp president hate speech christian ngo bench also refuses give bail arvind kejriwal manish sisodia delhi liquor policy case despite money trail bech also dismisses petition evmvvpat verification earlier bench comprising justices sanjiv khanna sundresh bela trivedi also refused bail brs leader k kavitha liquor policy case despite little reliable evidence ",
    "cleaned_title": "supreme court extends stay trial bjp chief k annamalai alleged hate speech",
    "cleaned_selftext": "sc bench consisting justices sanjiv khanna dipankar datta stay trial tamil nadu bjp president hate speech christian ngo bench also refuses give bail arvind kejriwal manish sisodia delhi liquor policy case despite money trail bech also dismisses petition evmvvpat verification earlier bench comprising justices sanjiv khanna sundresh bela trivedi also refused bail brs leader k kavitha liquor policy case despite little reliable evidence",
    "cleaned_comments": "clear video evidence existed k annamalai hate speech christian ngo youtube interview ofcourse look judges bench khanna defn getting ticket retirement",
    "light_cleaned_title": "Supreme Court extends stay on trial of BJP chief K Annamalai over alleged hate speech",
    "light_cleaned_selftext": "SC bench consisting of Justices Sanjiv Khanna and Dipankar Datta stay trial against Tamil Nadu BJP president for hate speech against a Christian NGO. Same bench also refuses to give bail to Arvind Kejriwal and Manish Sisodia for the Delhi Liquor Policy case despite no money trail. Same bech also dismisses petition for 100% EVM-VVPAT verification. Earlier, a bench comprising Justices Sanjiv Khanna, M M Sundresh and Bela Trivedi also refused bail to BRS leader K Kavitha in the same Liquor Policy case despite little reliable evidence against her.",
    "light_cleaned_comments": "Clear video evidence existed against K Annamalai for hate speech against the Christian NGO in a YouTube interview. Ofcourse, look at the judges on the bench. Khanna defn getting ticket after retirement."
}