{
    "id": "14pc908",
    "title": "‘Your actions have damaged IISc’s reputation’: Scientists and academics protest cancellation of discussion on UAPA",
    "url": "https://indianexpress.com/article/education/your-actions-have-damaged-iiscs-reputation-scientists-and-academics-protest-cancellation-of-discussion-on-uapa-8698246/",
    "selftext": "More than 500 scientists, academics, and students have written to the director of the Indian Institute of Science (IISc), Bangalore to protest the last-minute cancellation of a discussion that was to be led by student activists Natasha Narwal and Devangana Kalita and urge the institute to ensure the freedom of expression for members of IISc",
    "flair": "Politics",
    "score": 452,
    "num_comments": 13,
    "created_utc": 1688369823.0,
    "convurl": "https://external-preview.redd.it/onvFbpbEVwnjICLqtr-NbRWo1Zuh_aw1NwH8358WCAM.jpg?auto=webp&s=776dcf59a5258050b895bfcc6f6b447247c5cebb",
    "comments": [
        ">After the cancellation, the organisers substituted the discussion with an informal interaction outside the Sarvam Complex, a canteen at IISc. “At this point, the administration dispatched members of the security team to disperse this informal gathering. It was only after the intervention of members of the IISc faculty that the security team backtracked,” states the letter signed by over 500 scientists, academicians and students.\n\n>“We believe that it is important for members of IISc to hear about Natasha and Devangana’s experience and to reflect on the laws that were used to incarcerate them. Regardless of one’s perspective, such discussions are crucial in a functioning democracy and IISc, as an academic institution, is ideally positioned to host them. Conversely, if the institute is unwilling to permit peaceful discussions on constitutional questions, it is hard to see how it can foster a spirit of critical inquiry that is necessary for scientific work,” the letter further states.\n\n>The letter addressed to the IISc director also mentions that the cancellation of the discussion mars the reputation of IISc, nationally and internationally. It ends by saying, “We hope that you will take urgent corrective measures and ensure that members of IISc remain free to express and discuss a range of ideas, both about science and about the society that we live in.”\n\n>Of the 543 signatories to the letter, about 280 are faculty members from different institutes including IISc, Chennai Mathematical Institute, Indian Institute of Astrophysics, Tata Institute of Fundamental Research, IIT Kanpur, IIT Bombay, IISER Pune, IISER Mohali, IISER Kolkata and Indian Statistical Institute, among others. The letter, however, clarifies that the institutional affiliations have been provided only for purposes of identification and that the signatures do not reflect the views of these institutes. About 110 of the signatories are students and postdoctoral fellows.",
        "1934 Germany is closer than it looks.",
        "its already beginning",
        "Amit Malviya's inbox will be busy for this weeks \"toolkit\" template distribution for the Bhakts and their undersigned.",
        "Its already here. The majority will not notice it till it starts impacting them..",
        "They will not notice it even when they are impacted.",
        "What are Natasha Narwal and Devangana Kalita studying at IISc?",
        "How is that relevant?",
        "It was a genuine question. Not saying they can't conduct if they are not admitted.",
        "when UAPA case on these scientists branding then antinationals?"
    ],
    "cleaned_text": "actions damaged iiscs reputation scientists academics protest cancellation discussion uapa scientists academics students written director indian institute science iisc bangalore protest lastminute cancellation discussion led student activists natasha narwal devangana kalita urge institute ensure freedom expression members iisc ",
    "cleaned_title": "actions damaged iiscs reputation scientists academics protest cancellation discussion uapa",
    "cleaned_selftext": "scientists academics students written director indian institute science iisc bangalore protest lastminute cancellation discussion led student activists natasha narwal devangana kalita urge institute ensure freedom expression members iisc",
    "cleaned_comments": "cancellation organisers substituted discussion informal interaction outside sarvam complex canteen iisc point administration dispatched members security team disperse informal gathering intervention members iisc faculty security team backtracked states letter signed scientists academicians students believe important members iisc hear natasha devanganas experience reflect laws used incarcerate regardless ones perspective discussions crucial functioning democracy iisc academic institution ideally positioned host conversely institute unwilling permit peaceful discussions constitutional questions hard see foster spirit critical inquiry necessary scientific work letter states letter addressed iisc director also mentions cancellation discussion mars reputation iisc nationally internationally ends saying hope take urgent corrective measures ensure members iisc remain free express discuss range ideas science society live signatories letter faculty members different institutes including iisc chennai mathematical institute indian institute astrophysics tata institute fundamental research iit kanpur iit bombay iiser pune iiser mohali iiser kolkata indian statistical institute among others letter however clarifies institutional affiliations provided purposes identification signatures reflect views institutes signatories students postdoctoral fellows germany closer looks already beginning amit malviyas inbox busy weeks toolkit template distribution bhakts undersigned already majority notice till starts impacting notice even impacted natasha narwal devangana kalita studying iisc relevant genuine question saying cant conduct admitted uapa case scientists branding antinationals",
    "light_cleaned_title": "‘Your actions have damaged IISc’s reputation’: Scientists and academics protest cancellation of discussion on UAPA",
    "light_cleaned_selftext": "More than 500 scientists, academics, and students have written to the director of the Indian Institute of Science (IISc), Bangalore to protest the last-minute cancellation of a discussion that was to be led by student activists Natasha Narwal and Devangana Kalita and urge the institute to ensure the freedom of expression for members of IISc",
    "light_cleaned_comments": ">After the cancellation, the organisers substituted the discussion with an informal interaction outside the Sarvam Complex, a canteen at IISc. “At this point, the administration dispatched members of the security team to disperse this informal gathering. It was only after the intervention of members of the IISc faculty that the security team backtracked,” states the letter signed by over 500 scientists, academicians and students. >“We believe that it is important for members of IISc to hear about Natasha and Devangana’s experience and to reflect on the laws that were used to incarcerate them. Regardless of one’s perspective, such discussions are crucial in a functioning democracy and IISc, as an academic institution, is ideally positioned to host them. Conversely, if the institute is unwilling to permit peaceful discussions on constitutional questions, it is hard to see how it can foster a spirit of critical inquiry that is necessary for scientific work,” the letter further states. >The letter addressed to the IISc director also mentions that the cancellation of the discussion mars the reputation of IISc, nationally and internationally. It ends by saying, “We hope that you will take urgent corrective measures and ensure that members of IISc remain free to express and discuss a range of ideas, both about science and about the society that we live in.” >Of the 543 signatories to the letter, about 280 are faculty members from different institutes including IISc, Chennai Mathematical Institute, Indian Institute of Astrophysics, Tata Institute of Fundamental Research, IIT Kanpur, IIT Bombay, IISER Pune, IISER Mohali, IISER Kolkata and Indian Statistical Institute, among others. The letter, however, clarifies that the institutional affiliations have been provided only for purposes of identification and that the signatures do not reflect the views of these institutes. About 110 of the signatories are students and postdoctoral fellows. 1934 Germany is closer than it looks. its already beginning Amit Malviya's inbox will be busy for this weeks \"toolkit\" template distribution for the Bhakts and their undersigned. Its already here. The majority will not notice it till it starts impacting them.. They will not notice it even when they are impacted. What are Natasha Narwal and Devangana Kalita studying at IISc? How is that relevant? It was a genuine question. Not saying they can't conduct if they are not admitted. when UAPA case on these scientists branding then antinationals?"
}