{
    "id": "15amw33",
    "title": "Explain this to a 5 year old",
    "url": "https://www.reddit.com/r/india/comments/15amw33/explain_this_to_a_5_year_old/",
    "selftext": " The Budget 2023 has hiked the basic exemption limit to Rs 3 lakh from Rs 2.5 lakh currently. Thus, an individual's income becomes taxable if it exceeds Rs 3 lakh in a financial year. However, to reiterate, no tax has to be paid if the taxable income does not exceed Rs 7 lakh under the new tax regime.  \n\n\nRead more at:  \n[https://economictimes.indiatimes.com/wealth/tax/who-is-eligible-for-tax-rebate-under-section-87a-of-the-income-tax-act/articleshow/97574684.cms?utm\\_source=contentofinterest&utm\\_medium=text&utm\\_campaign=cppst](https://economictimes.indiatimes.com/wealth/tax/who-is-eligible-for-tax-rebate-under-section-87a-of-the-income-tax-act/articleshow/97574684.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst)\n\nI'm too dumb for this. Like you're telling me no tax for up to 7 lakhs but in tax slabs rates starts from 3 lakhs. Someone please enlighten my ooga booga peanut of a brain :)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690418046.0,
    "convurl": "https://external-preview.redd.it/HRfMG8vfcVtrd5MeFiAMLlZ4ItLJwIUynMoRIIiPU-M.jpg?auto=webp&s=4662315091d49fda07cdae557eb039b42bc0c6fd",
    "comments": [
        "Total Income = 7,00,000\n\nBasic exemption = 3,00,000\n\nTaxable income = Total income - Basic exemption = 4,00,000\n\nTax calculation\n\n* slab 3,00,000 - 6,00,000 at 5% = 3,00,000 x 5% = 15,000\n* slab 6,00,000 - 9,00,000 at 10% = 1,00,000 x 10% = 10,000\n\n87a Rebate under new tax regime = 25,000\n\nNet payable tax = 15,000 + 10,000 - 25,000 = Nil",
        "87A rebate [isn't available to all taxpayers](https://economictimes.indiatimes.com/wealth/tax/section-87a-income-tax-rebate-is-not-available-on-these-incomes/articleshow/102110244.cms).\n\nThe tax slabs are general rules applicable to all taxpayers.\n\n87A rebate is a special exception available to some taxpayers.",
        "so if my income is 3 lakhs the govt. should pay me 10,000? /s",
        "if my income is between 6 and 7,do i have to file ITR or is it understood that i wont have to pay any tax."
    ],
    "cleaned_text": "explain year old budget hiked basic exemption limit rs lakh rs lakh currently thus individuals income becomes taxable exceeds rs lakh financial year however reiterate tax paid taxable income exceed rs lakh new tax regime read httpseconomictimesindiatimescomwealthtaxwhoiseligiblefortaxrebateundersectionaoftheincometaxactarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppsthttpseconomictimesindiatimescomwealthtaxwhoiseligiblefortaxrebateundersectionaoftheincometaxactarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppst im dumb like youre telling tax lakhs tax slabs rates starts lakhs someone please enlighten ooga booga peanut brain ",
    "cleaned_title": "explain year old",
    "cleaned_selftext": "budget hiked basic exemption limit rs lakh rs lakh currently thus individuals income becomes taxable exceeds rs lakh financial year however reiterate tax paid taxable income exceed rs lakh new tax regime read httpseconomictimesindiatimescomwealthtaxwhoiseligiblefortaxrebateundersectionaoftheincometaxactarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppsthttpseconomictimesindiatimescomwealthtaxwhoiseligiblefortaxrebateundersectionaoftheincometaxactarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppst im dumb like youre telling tax lakhs tax slabs rates starts lakhs someone please enlighten ooga booga peanut brain",
    "cleaned_comments": "total income basic exemption taxable income total income basic exemption tax calculation slab x slab x rebate new tax regime net payable tax nil rebate isnt available taxpayershttpseconomictimesindiatimescomwealthtaxsectionaincometaxrebateisnotavailableontheseincomesarticleshowcms tax slabs general rules applicable taxpayers rebate special exception available taxpayers income lakhs govt pay income file itr understood wont pay tax",
    "light_cleaned_title": "Explain this to a 5 year old",
    "light_cleaned_selftext": "The Budget 2023 has hiked the basic exemption limit to Rs 3 lakh from Rs 2.5 lakh currently. Thus, an individual's income becomes taxable if it exceeds Rs 3 lakh in a financial year. However, to reiterate, no tax has to be paid if the taxable income does not exceed Rs 7 lakh under the new tax regime. Read more at: [https://economictimes.indiatimes.com/wealth/tax/who-is-eligible-for-tax-rebate-under-section-87a-of-the-income-tax-act/articleshow/97574684.cms?utm\\_source=contentofinterest&utm\\_medium=text&utm\\_campaign=cppst](https://economictimes.indiatimes.com/wealth/tax/who-is-eligible-for-tax-rebate-under-section-87a-of-the-income-tax-act/articleshow/97574684.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst) I'm too dumb for this. Like you're telling me no tax for up to 7 lakhs but in tax slabs rates starts from 3 lakhs. Someone please enlighten my ooga booga peanut of a brain :)",
    "light_cleaned_comments": "Total Income = 7,00,000 Basic exemption = 3,00,000 Taxable income = Total income - Basic exemption = 4,00,000 Tax calculation * slab 3,00,000 - 6,00,000 at 5% = 3,00,000 x 5% = 15,000 * slab 6,00,000 - 9,00,000 at 10% = 1,00,000 x 10% = 10,000 87a Rebate under new tax regime = 25,000 Net payable tax = 15,000 + 10,000 - 25,000 = Nil 87A rebate [isn't available to all taxpayers](https://economictimes.indiatimes.com/wealth/tax/section-87a-income-tax-rebate-is-not-available-on-these-incomes/articleshow/102110244.cms). The tax slabs are general rules applicable to all taxpayers. 87A rebate is a special exception available to some taxpayers. so if my income is 3 lakhs the govt. should pay me 10,000? /s if my income is between 6 and 7,do i have to file ITR or is it understood that i wont have to pay any tax."
}