{
    "id": "1ac7mgl",
    "title": "Do you think parents should interfere in school activities? Why do they treat everything as a competition that their child must win?",
    "url": "https://i.redd.it/yf7b3tf1iyec1.png",
    "selftext": "I take public speaking classes at a very reputed school. This is a part of the various after school classes that the school has to offer. \n\nWe are preparing the kids for a showcase event for the end of the year. This is Grade 4 I am talking about. So, I started preparing the kids for a concept where they have to choose famous people from any generation and any country. All trapped in a plane. Suddenly the plane has some issues and it is about to crash but there is only one parachute. Now these people have to convince the jury to give them the parachute. The characters were chosen by the children themselves. I made them do research work and write points about important things they have done for humanity and the world. Children chose diff characters like Newton, Smita Sabharwal, Jhansi ki Rani, etc. I wrote individual speeches for each of them in such a way that the characters actually empathize with the situation and don't explicitly ask for the parachute. \n\nOne parent (child who's playing Neil Armstrong) came back to me saying the speech is very negative and that the jury will never give the parachute to them. The parent is treating this like a competition whereas it's not about that at all. I tried to reason with her that these were great people who would not want to fight for the parachute but instead sacrifice or just remind the world about things they have done. Anyway, can't win with the people who pay fees, so am changing the speech. Am attaching it here. Please see if this feels negative in any way.",
    "flair": "Rant / Vent",
    "score": 34,
    "num_comments": 10,
    "created_utc": 1706349807.0,
    "convurl": "https://i.redd.it/yf7b3tf1iyec1.png",
    "comments": [
        "But bro Neil Armstrong died in 2012, there is no way he would have watched Interstellar (2014). \nI think you can suggest the kid to change the name to Buzz Aldrin who was 2nd astronaut to land on moon and was in LM (Lunar Module) (callsign: Eagle) with Neil.",
        "What is your school's policy? Do they make you feel obligated to accept the parents suggestion?",
        "Because they want their kid to win. They don't care about learning. Tomorrow, the same kid will try to win in life even with dishonesty because they learnt it from parents.",
        "Huh, how is the post related to the title?",
        "Thanks for this! Will update the script keeping this in mind. I don't want to change the character because that is what the child had thought about. I will update the script keeping this in mind.",
        "School will interfere only when the complaint reaches them. They usually follow the policy of \" Customer is always right\". Parents being the customer here.",
        "The reason the parent wants a change is because they think of this as a competition where their child must win. Not as a presentation/performance.",
        "Why is Neil Armstrong Pandering to indians in your new script? winking at the jury and acknowledging that they’re indian so they vote for him? its just a weak script that doesn’t acknowledge any of his achievements other than acknowledging indians, which is something that he didn’t do in real life.  Aren’t the characters meant to point out achievements their real world counterparts accomplished?",
        "I agree with everything you said. Being a teacher I can tell you one thing for sure. It's from a standup show by Kenny Sebastian. Children hate you, parents hate you, Principal hates you. You have no win. It's a thankless job.",
        "You are welcome"
    ],
    "cleaned_text": "think parents interfere school activities treat everything competition child must win take public speaking classes reputed school part various school classes school offer preparing kids showcase event end year grade talking started preparing kids concept choose famous people generation country trapped plane suddenly plane issues crash one parachute people convince jury give parachute characters chosen children made research work write points important things done humanity world children chose diff characters like newton smita sabharwal jhansi ki rani etc wrote individual speeches way characters actually empathize situation dont explicitly ask parachute one parent child whos playing neil armstrong came back saying speech negative jury never give parachute parent treating like competition whereas tried reason great people would want fight parachute instead sacrifice remind world things done anyway cant win people pay fees changing speech attaching please see feels negative way ",
    "cleaned_title": "think parents interfere school activities treat everything competition child must win",
    "cleaned_selftext": "take public speaking classes reputed school part various school classes school offer preparing kids showcase event end year grade talking started preparing kids concept choose famous people generation country trapped plane suddenly plane issues crash one parachute people convince jury give parachute characters chosen children made research work write points important things done humanity world children chose diff characters like newton smita sabharwal jhansi ki rani etc wrote individual speeches way characters actually empathize situation dont explicitly ask parachute one parent child whos playing neil armstrong came back saying speech negative jury never give parachute parent treating like competition whereas tried reason great people would want fight parachute instead sacrifice remind world things done anyway cant win people pay fees changing speech attaching please see feels negative way",
    "cleaned_comments": "bro neil armstrong died way would watched interstellar think suggest kid change name buzz aldrin nd astronaut land moon lm lunar module callsign eagle neil schools policy make feel obligated accept parents suggestion want kid win dont care learning tomorrow kid try win life even dishonesty learnt parents huh post related title thanks update script keeping mind dont want change character child thought update script keeping mind school interfere complaint reaches usually follow policy customer always right parents customer reason parent wants change think competition child must win presentationperformance neil armstrong pandering indians new script winking jury acknowledging theyre indian vote weak script doesnt acknowledge achievements acknowledging indians something didnt real life arent characters meant point achievements real world counterparts accomplished agree everything said teacher tell one thing sure standup show kenny sebastian children hate parents hate principal hates win thankless job welcome",
    "light_cleaned_title": "Do you think parents should interfere in school activities? Why do they treat everything as a competition that their child must win?",
    "light_cleaned_selftext": "I take public speaking classes at a very reputed school. This is a part of the various after school classes that the school has to offer. We are preparing the kids for a showcase event for the end of the year. This is Grade 4 I am talking about. So, I started preparing the kids for a concept where they have to choose famous people from any generation and any country. All trapped in a plane. Suddenly the plane has some issues and it is about to crash but there is only one parachute. Now these people have to convince the jury to give them the parachute. The characters were chosen by the children themselves. I made them do research work and write points about important things they have done for humanity and the world. Children chose diff characters like Newton, Smita Sabharwal, Jhansi ki Rani, etc. I wrote individual speeches for each of them in such a way that the characters actually empathize with the situation and don't explicitly ask for the parachute. One parent (child who's playing Neil Armstrong) came back to me saying the speech is very negative and that the jury will never give the parachute to them. The parent is treating this like a competition whereas it's not about that at all. I tried to reason with her that these were great people who would not want to fight for the parachute but instead sacrifice or just remind the world about things they have done. Anyway, can't win with the people who pay fees, so am changing the speech. Am attaching it here. Please see if this feels negative in any way.",
    "light_cleaned_comments": "But bro Neil Armstrong died in 2012, there is no way he would have watched Interstellar (2014). I think you can suggest the kid to change the name to Buzz Aldrin who was 2nd astronaut to land on moon and was in LM (Lunar Module) (callsign: Eagle) with Neil. What is your school's policy? Do they make you feel obligated to accept the parents suggestion? Because they want their kid to win. They don't care about learning. Tomorrow, the same kid will try to win in life even with dishonesty because they learnt it from parents. Huh, how is the post related to the title? Thanks for this! Will update the script keeping this in mind. I don't want to change the character because that is what the child had thought about. I will update the script keeping this in mind. School will interfere only when the complaint reaches them. They usually follow the policy of \" Customer is always right\". Parents being the customer here. The reason the parent wants a change is because they think of this as a competition where their child must win. Not as a presentation/performance. Why is Neil Armstrong Pandering to indians in your new script? winking at the jury and acknowledging that they’re indian so they vote for him? its just a weak script that doesn’t acknowledge any of his achievements other than acknowledging indians, which is something that he didn’t do in real life. Aren’t the characters meant to point out achievements their real world counterparts accomplished? I agree with everything you said. Being a teacher I can tell you one thing for sure. It's from a standup show by Kenny Sebastian. Children hate you, parents hate you, Principal hates you. You have no win. It's a thankless job. You are welcome"
}