{
    "id": "16v3mit",
    "title": "1992 Vachathi brutality: Madras High Court confirms conviction, sentence imposed on forest, police and revenue officials",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/1992-vachathi-brutality-madras-high-court-confirms-conviction-sentence-imposed-on-forest-police-and-revenue-officials/article67360113.ece",
    "selftext": "Justice P Velmurugan of the Madras High Court on Friday dismissed all appeals filed by the forest, police and revenue officials convicted for ransacking the village in Tamil Nadu’s Dharmapuri, raping 18 women and committing other atrocities, including assault on men and women of the tribal hamlet Vachathi.\n\nThe court confirmed the punishment given by the lower court to 215 accused, including 10 years of imprisonment for 12 people, seven years of imprisonment for five, and others received imprisonment ranging from two to 10 years.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695967430.0,
    "convurl": "https://external-preview.redd.it/0mOpeStTccdYXv_SMsadSSyzytSyxPnraGoMQAstPaY.jpg?auto=webp&s=a87d10090e0d0d5675293b4fd508b336b381b087",
    "comments": [
        "Forest rangers, police, and other government authorities raided each residence, falsely accused them of smuggling sandalwood, and kidnapped and transported away a total of 133 people: 90 women, 98 boys, and 15 men. They committed horrible acts of violence. The women were raped by the police and the forest rangers. All night, they robbed them ruthlessly.",
        "I don’t want to sound pro-death, but these sumbags who did this deserve being shot.\n\nUsing public funds to let them serve jail time is fkn useless cause these aholes knew what they were doing."
    ],
    "cleaned_text": "vachathi brutality madras high court confirms conviction sentence imposed forest police revenue officials justice p velmurugan madras high court friday dismissed appeals filed forest police revenue officials convicted ransacking village tamil nadus dharmapuri raping women committing atrocities including assault men women tribal hamlet vachathi court confirmed punishment given lower court accused including years imprisonment people seven years imprisonment five others received imprisonment ranging two years ",
    "cleaned_title": "vachathi brutality madras high court confirms conviction sentence imposed forest police revenue officials",
    "cleaned_selftext": "justice p velmurugan madras high court friday dismissed appeals filed forest police revenue officials convicted ransacking village tamil nadus dharmapuri raping women committing atrocities including assault men women tribal hamlet vachathi court confirmed punishment given lower court accused including years imprisonment people seven years imprisonment five others received imprisonment ranging two years",
    "cleaned_comments": "forest rangers police government authorities raided residence falsely accused smuggling sandalwood kidnapped transported away total people women boys men committed horrible acts violence women raped police forest rangers night robbed ruthlessly dont want sound prodeath sumbags deserve shot using public funds let serve jail time fkn useless cause aholes knew",
    "light_cleaned_title": "1992 Vachathi brutality: Madras High Court confirms conviction, sentence imposed on forest, police and revenue officials",
    "light_cleaned_selftext": "Justice P Velmurugan of the Madras High Court on Friday dismissed all appeals filed by the forest, police and revenue officials convicted for ransacking the village in Tamil Nadu’s Dharmapuri, raping 18 women and committing other atrocities, including assault on men and women of the tribal hamlet Vachathi. The court confirmed the punishment given by the lower court to 215 accused, including 10 years of imprisonment for 12 people, seven years of imprisonment for five, and others received imprisonment ranging from two to 10 years.",
    "light_cleaned_comments": "Forest rangers, police, and other government authorities raided each residence, falsely accused them of smuggling sandalwood, and kidnapped and transported away a total of 133 people: 90 women, 98 boys, and 15 men. They committed horrible acts of violence. The women were raped by the police and the forest rangers. All night, they robbed them ruthlessly. I don’t want to sound pro-death, but these sumbags who did this deserve being shot. Using public funds to let them serve jail time is fkn useless cause these aholes knew what they were doing."
}