{
    "id": "1etb72w",
    "title": "Xenophobic and racist 'documentary' on Indians",
    "url": "https://www.reddit.com/r/india/comments/1etb72w/xenophobic_and_racist_documentary_on_indians/",
    "selftext": "While searching for something, I ended up on a [blockchain-based](https://en.wikipedia.org/wiki/LBRY) video-sharing platform called [odysee](https://odysee.com/). While browsing through it, I found really xenophobic and racist content hosted by that site. At least I found three videos, I don't know if they are the same are not because didn't feel like watching them,\n\n* [https://odysee.com/@Minnesota-tan:5/Codex-Pajeet-II:4](https://odysee.com/@Minnesota-tan:5/Codex-Pajeet-II:4)\n* [https://odysee.com/@GermanBro:6/DoNotRedeem:b](https://odysee.com/@GermanBro:6/DoNotRedeem:b)\n* [https://odysee.com/@Bongoboltu:9/India-The-Worst-Country-On-Earth-Codex-Pajeet-II:6](https://odysee.com/@Bongoboltu:9/India-The-Worst-Country-On-Earth-Codex-Pajeet-II:6)\n\nNow, the point is even though I see the parent company has closed its operations after [losing a legal battle against the SEC](https://www.sec.gov/enforcement-litigation/litigation-releases/lr-25775), we should make some effort to stop these videos from streaming because even if the video platform is not popular, people can use clips from that clip to create xenophobic contents. But, I donno how do to that, maybe you guys can amplify this through some channel?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1723768247.0,
    "convurl": "https://external-preview.redd.it/Z_j3EIQ4b4rCsgHpr994lzzECRhUk7G33N12Ej4LsZs.jpg?auto=webp&s=f2911430fbf5a600513eb69a268173096e686552",
    "comments": [
        "Odysse is an open platform video sharing. There are too many self made documentaries and many conspiracy videos. Videos and documentaries that are banned, people can find it there. It's like YouTube, but , with very few restrictions and censorship. \n\nPoint being, you can't stop it because, as per the website policy it's freedom of speech."
    ],
    "cleaned_text": "xenophobic racist documentary indians searching something ended blockchainbasedhttpsenwikipediaorgwikilbry videosharing platform called odyseehttpsodyseecom browsing found really xenophobic racist content hosted site least found three videos dont know didnt feel like watching httpsodyseecomminnesotatancodexpajeetiihttpsodyseecomminnesotatancodexpajeetii httpsodyseecomgermanbrodonotredeembhttpsodyseecomgermanbrodonotredeemb httpsodyseecombongoboltuindiatheworstcountryonearthcodexpajeetiihttpsodyseecombongoboltuindiatheworstcountryonearthcodexpajeetii point even though see parent company closed operations losing legal battle sechttpswwwsecgovenforcementlitigationlitigationreleaseslr make effort stop videos streaming even video platform popular people use clips clip create xenophobic contents donno maybe guys amplify channel ",
    "cleaned_title": "xenophobic racist documentary indians",
    "cleaned_selftext": "searching something ended blockchainbasedhttpsenwikipediaorgwikilbry videosharing platform called odyseehttpsodyseecom browsing found really xenophobic racist content hosted site least found three videos dont know didnt feel like watching httpsodyseecomminnesotatancodexpajeetiihttpsodyseecomminnesotatancodexpajeetii httpsodyseecomgermanbrodonotredeembhttpsodyseecomgermanbrodonotredeemb httpsodyseecombongoboltuindiatheworstcountryonearthcodexpajeetiihttpsodyseecombongoboltuindiatheworstcountryonearthcodexpajeetii point even though see parent company closed operations losing legal battle sechttpswwwsecgovenforcementlitigationlitigationreleaseslr make effort stop videos streaming even video platform popular people use clips clip create xenophobic contents donno maybe guys amplify channel",
    "cleaned_comments": "odysse open platform video sharing many self made documentaries many conspiracy videos videos documentaries banned people find like youtube restrictions censorship point cant stop per website policy freedom speech",
    "light_cleaned_title": "Xenophobic and racist 'documentary' on Indians",
    "light_cleaned_selftext": "While searching for something, I ended up on a [blockchain-based](https://en.wikipedia.org/wiki/LBRY) video-sharing platform called [odysee](https://odysee.com/). While browsing through it, I found really xenophobic and racist content hosted by that site. At least I found three videos, I don't know if they are the same are not because didn't feel like watching them, * [https://odysee.com/@Minnesota-tan:5/Codex-Pajeet-II:4](https://odysee.com/@Minnesota-tan:5/Codex-Pajeet-II:4) * [https://odysee.com/@GermanBro:6/DoNotRedeem:b](https://odysee.com/@GermanBro:6/DoNotRedeem:b) * [https://odysee.com/@Bongoboltu:9/India-The-Worst-Country-On-Earth-Codex-Pajeet-II:6](https://odysee.com/@Bongoboltu:9/India-The-Worst-Country-On-Earth-Codex-Pajeet-II:6) Now, the point is even though I see the parent company has closed its operations after [losing a legal battle against the SEC](https://www.sec.gov/enforcement-litigation/litigation-releases/lr-25775), we should make some effort to stop these videos from streaming because even if the video platform is not popular, people can use clips from that clip to create xenophobic contents. But, I donno how do to that, maybe you guys can amplify this through some channel?",
    "light_cleaned_comments": "Odysse is an open platform video sharing. There are too many self made documentaries and many conspiracy videos. Videos and documentaries that are banned, people can find it there. It's like YouTube, but , with very few restrictions and censorship. Point being, you can't stop it because, as per the website policy it's freedom of speech."
}