{
    "id": "1b8nsti",
    "title": "ADR moves Supreme Court over SBI's failure to disclose Electoral Bonds data",
    "url": "https://www.livemint.com/politics/news/electoral-bonds-case-adr-moves-supreme-court-after-sbi-fails-to-disclose-data-by-march-6-11709790464007.html",
    "selftext": " \n.",
    "flair": "Law & Courts",
    "score": 57,
    "num_comments": 4,
    "created_utc": 1709793465.0,
    "convurl": "https://external-preview.redd.it/89-s36RdhAEjHCLcYjMv-A4xY6pMTNsS9YA8ce0guPk.jpg?auto=webp&s=67623a3e23fa277a1c89bbe890341aad95529d9f",
    "comments": [
        "SBI said that it does not keep digital records on the sale of electoral bonds to safeguard the privacy of those who are donating money to political parties.  \n  \nThomas Franco, former general secretary of the All India Bank Officers' Confederation (AIBOC), says it is laughable as records and books need to be tallied at end of the day and it should be an easy task given the low number of records (22000 aprox).  \n  \nHow much time does a behemoth like SBI need to tally meagre 22000 records? 4months?  \n  \nIMHO, it seems like disrespect of the Apex court's order.",
        "Then why not just submit digital copies of all the documents to SC/EC and make it available to public? I am sure there are quite a few people who would do the job in a day or two. e.g. [Congress cites TNM-NL investigation into link between political donations and ED raids](https://www.thenewsminute.com/news/congress-cites-tnm-nl-investigation-into-link-between-political-donations-and-ed-raids)    \n\n> “The brave independent journalists at The News Minute and Newslaundry have done a thorough investigation of two sources of campaign finance - 1. electoral trusts 2. ⁠political party donations. They’ve discovered that for at least 30 firms, ED and IT raids have been followed by the investigated firms making substantial chanda donations amounting to around Rs 335 crores to MoShah’s coffers. From the ashes of IT and ED, MoShah has innovated this new I-D model: Investigate, then get them to Donate,”",
        "Cji is too busy defending his post retirement benefits and guaranteeing chi positing for his progeny to have time to assign the case and schedule hearing till after the elections. If at all. ",
        "This deliberate contempt of SC’s orders and EC’s conspicuous silence makes you think what are they hiding and why, to the extent that SBI’s top management would risks a very tangible chance of going to jail over disclosure of the Electoral Bond data."
    ],
    "cleaned_text": "adr moves supreme court sbis failure disclose electoral bonds data  ",
    "cleaned_title": "adr moves supreme court sbis failure disclose electoral bonds data",
    "cleaned_selftext": "",
    "cleaned_comments": "sbi said keep digital records sale electoral bonds safeguard privacy donating money political parties thomas franco former general secretary india bank officers confederation aiboc says laughable records books need tallied end day easy task given low number records aprox much time behemoth like sbi need tally meagre records months imho seems like disrespect apex courts order submit digital copies documents scec make available public sure quite people would job day two eg congress cites tnmnl investigation link political donations ed raidshttpswwwthenewsminutecomnewscongresscitestnmnlinvestigationintolinkbetweenpoliticaldonationsandedraids brave independent journalists news minute newslaundry done thorough investigation two sources campaign finance electoral trusts political party donations theyve discovered least firms ed raids followed investigated firms making substantial chanda donations amounting around rs crores moshahs coffers ashes ed moshah innovated new id model investigate get donate cji busy defending post retirement benefits guaranteeing chi positing progeny time assign case schedule hearing till elections deliberate contempt scs orders ecs conspicuous silence makes think hiding extent sbis top management would risks tangible chance going jail disclosure electoral bond data",
    "light_cleaned_title": "ADR moves Supreme Court over SBI's failure to disclose Electoral Bonds data",
    "light_cleaned_selftext": ".",
    "light_cleaned_comments": "SBI said that it does not keep digital records on the sale of electoral bonds to safeguard the privacy of those who are donating money to political parties. Thomas Franco, former general secretary of the All India Bank Officers' Confederation (AIBOC), says it is laughable as records and books need to be tallied at end of the day and it should be an easy task given the low number of records (22000 aprox). How much time does a behemoth like SBI need to tally meagre 22000 records? 4months? IMHO, it seems like disrespect of the Apex court's order. Then why not just submit digital copies of all the documents to SC/EC and make it available to public? I am sure there are quite a few people who would do the job in a day or two. e.g. [Congress cites TNM-NL investigation into link between political donations and ED raids](https://www.thenewsminute.com/news/congress-cites-tnm-nl-investigation-into-link-between-political-donations-and-ed-raids) > “The brave independent journalists at The News Minute and Newslaundry have done a thorough investigation of two sources of campaign finance - 1. electoral trusts 2. ⁠political party donations. They’ve discovered that for at least 30 firms, ED and IT raids have been followed by the investigated firms making substantial chanda donations amounting to around Rs 335 crores to MoShah’s coffers. From the ashes of IT and ED, MoShah has innovated this new I-D model: Investigate, then get them to Donate,” Cji is too busy defending his post retirement benefits and guaranteeing chi positing for his progeny to have time to assign the case and schedule hearing till after the elections. If at all. This deliberate contempt of SC’s orders and EC’s conspicuous silence makes you think what are they hiding and why, to the extent that SBI’s top management would risks a very tangible chance of going to jail over disclosure of the Electoral Bond data."
}