{
    "id": "16e0uek",
    "title": "Help a student to complete her CSP project.",
    "url": "https://www.reddit.com/r/india/comments/16e0uek/help_a_student_to_complete_her_csp_project/",
    "selftext": "https://docs.google.com/forms/d/e/1FAIpQLSeKmdrTn59xSH19G3DgFqK0sJqspQGIemK7KCpd2UTmDlLWGA/viewform?vc=0&c=0&w=1&flr=0\n\nPlease take 5 minutes to complete this survey. This was given by my college as a community service project. I don have much connections or network irl I need atleast 100 responses to analyze and get credits. This is the only place I can think about to get responses. Thanks in advance.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694249654.0,
    "convurl": "https://external-preview.redd.it/U2u5ied0hVTBKL2i780yBKgpyZwqVp2UqPR1Jwegdq8.jpg",
    "comments": [
        "Uh, why are names required?",
        "I just had it incase if someone asks the name of the people from whom I collected the data, its okay if people want to  give any fake name.",
        "The form options are bad. I don't think you'll have a good dataset to work with."
    ],
    "cleaned_text": "help student complete csp project please take minutes complete survey given college community service project much connections network irl need atleast responses analyze get credits place think get responses thanks advance ",
    "cleaned_title": "help student complete csp project",
    "cleaned_selftext": "please take minutes complete survey given college community service project much connections network irl need atleast responses analyze get credits place think get responses thanks advance",
    "cleaned_comments": "uh names required incase someone asks name people collected data okay people want give fake name form options bad dont think youll good dataset work",
    "light_cleaned_title": "Help a student to complete her CSP project.",
    "light_cleaned_selftext": "Please take 5 minutes to complete this survey. This was given by my college as a community service project. I don have much connections or network irl I need atleast 100 responses to analyze and get credits. This is the only place I can think about to get responses. Thanks in advance.",
    "light_cleaned_comments": "Uh, why are names required? I just had it incase if someone asks the name of the people from whom I collected the data, its okay if people want to give any fake name. The form options are bad. I don't think you'll have a good dataset to work with."
}