{
    "id": "18ud6bp",
    "title": "Sneaky trick by Yatra.com",
    "url": "https://www.reddit.com/r/india/comments/18ud6bp/sneaky_trick_by_yatracom/",
    "selftext": "I was booking flight ticket on Yatra for my upcoming travel, and noticed that the convenience fee increases if you apply credit card based coupon codes.  \nUpon applying a credit card coupon code, the convenience fee increases from 399 to 499.  \nDue to this our \"effective\" discount reduces, as Yatra eats up a pie from the discount offered by the bank by increasing the convenience fee.\n\nhttps://preview.redd.it/tixfkiqlre9c1.jpg?width=1179&format=pjpg&auto=webp&s=98bd35f7fa6e9e8731a3f1ab5a7e6dc8697fe081\n\n![img](sj5y4mqlre9c1 \"\n\")\n\n People need to be cautious & alert about such sneaky charges added by these platforms on the final payment page, as additional increase can be more if companies are not called out for such shady practices.\n\nIf anyone has similar experiences of shady practices, plz do share.",
    "flair": "Rant / Vent",
    "score": 71,
    "num_comments": 9,
    "created_utc": 1703933737.0,
    "convurl": "https://b.thumbs.redditmedia.com/GmDTEBKBrM9Hljxdz0ViG8awI-XOHkwWB4GCqKvv3SY.jpg",
    "comments": [
        "Commenting here so that it helps others and if you haven't booked, you can take a look as well.  \n\n\nFirst of all yeah, this is a common practice accross multiple travel sites. Even adding this extra tax at each and every step is one of the most irritating things out there.\n\nYou should checkout [https://getaway.pathfndr.io/](https://getaway.pathfndr.io/) . I work at a B2B travel company, and this is one of our sites.\n\nI made a search for the same flight you have searched above, and I was getting the flight for Rs. **4,444** (i.e \\~ Rs1,200 cheaper)**.**  \nYou check it here: [https://getaway.pathfndr.io/detail/flight-to-mumbai-india-from-newdelhi-india-v2-73068635](https://getaway.pathfndr.io/detail/flight-to-mumbai-india-from-newdelhi-india-v2-73068635)  \n\n\nAnd the price you see in the first page is what you book for. There are no extra charges or taxes added later in the flow.\n\n&#x200B;\n\nIf you have any doubts or queries, do let me know.",
        "This is common at all online portals, including those of airlines. While it is an extra, it is not a scam. \n\nThese are not even charged by the website, but by the credit card payment gateways like visa/MasterCard. Only thing website does is that it passes on the extra charges to you.",
        "Both payment options are of CC. \nProblem is that fee changes when the coupon code is applied. \n\nIt should remain the same for both cases.",
        "Such fee are usually not part of discounts offered by websites, because they are not part of what the website is charging you.",
        "If any component is not part of discount, it should remain constant. \nProblem is that the fee is increased if CC coupon is applied.",
        "Their discount dude . They can charge what they want. You went to them for the discount.",
        "Happens in most travel portals",
        "Happened on RedBus once.\n\nTotal ticket price: some 6800\nDiscount coupon applied: 500\nPrice after coupon: 6600 because the ticket prices increased all of a sudden to 7100",
        "Disappointing. 🙁🙁\nI've recently noticed this, previously I used to book tickets without looking at such tricks. \nWill be careful going forward.",
        "I am also seeing the same\n\nhttps://preview.redd.it/i2t4azgonfqd1.png?width=1363&format=png&auto=webp&s=f88958b7eee84d30e3a204138aa453ee74dd0767\n\nConvenience fees increased. But my question is what if the discount code that I am availing - I don't really qualify for? then what will happen? Let's say that discount code is for somebody having that specific credit card but I am not using that credit card then what will happen? Will yatra charge me later?",
        "I am also seeing the same. But what if I claim a discount code which I am not eligible for? For example it is for some XYZ credit card - I took that discount code but never had that credit card? Will yatra take that amount from my bank account later?"
    ],
    "cleaned_text": "sneaky trick yatracom booking flight ticket yatra upcoming travel noticed convenience fee increases apply credit card based coupon codes upon applying credit card coupon code convenience fee increases due effective discount reduces yatra eats pie discount offered bank increasing convenience fee imgsjymqlrec people need cautious alert sneaky charges added platforms final payment page additional increase companies called shady practices anyone similar experiences shady practices plz share ",
    "cleaned_title": "sneaky trick yatracom",
    "cleaned_selftext": "booking flight ticket yatra upcoming travel noticed convenience fee increases apply credit card based coupon codes upon applying credit card coupon code convenience fee increases due effective discount reduces yatra eats pie discount offered bank increasing convenience fee imgsjymqlrec people need cautious alert sneaky charges added platforms final payment page additional increase companies called shady practices anyone similar experiences shady practices plz share",
    "cleaned_comments": "commenting helps others havent booked take look well first yeah common practice accross multiple travel sites even adding extra tax every step one irritating things checkout httpsgetawaypathfndriohttpsgetawaypathfndrio work bb travel company one sites made search flight searched getting flight rs ie rs cheaper check httpsgetawaypathfndriodetailflighttomumbaiindiafromnewdelhiindiavhttpsgetawaypathfndriodetailflighttomumbaiindiafromnewdelhiindiav price see first page book extra charges taxes added later flow xb doubts queries let know common online portals including airlines extra scam even charged website credit card payment gateways like visamastercard thing website passes extra charges payment options cc problem fee changes coupon code applied remain cases fee usually part discounts offered websites part website charging component part discount remain constant problem fee increased cc coupon applied discount dude charge want went discount happens travel portals happened redbus total ticket price discount coupon applied price coupon ticket prices increased sudden disappointing ive recently noticed previously used book tickets without looking tricks careful going forward also seeing convenience fees increased question discount code availing dont really qualify happen lets say discount code somebody specific credit card using credit card happen yatra charge later also seeing claim discount code eligible example xyz credit card took discount code never credit card yatra take amount bank account later",
    "light_cleaned_title": "Sneaky trick by Yatra.com",
    "light_cleaned_selftext": "I was booking flight ticket on Yatra for my upcoming travel, and noticed that the convenience fee increases if you apply credit card based coupon codes. Upon applying a credit card coupon code, the convenience fee increases from 399 to 499. Due to this our \"effective\" discount reduces, as Yatra eats up a pie from the discount offered by the bank by increasing the convenience fee. ![img](sj5y4mqlre9c1 \" \") People need to be cautious & alert about such sneaky charges added by these platforms on the final payment page, as additional increase can be more if companies are not called out for such shady practices. If anyone has similar experiences of shady practices, plz do share.",
    "light_cleaned_comments": "Commenting here so that it helps others and if you haven't booked, you can take a look as well. First of all yeah, this is a common practice accross multiple travel sites. Even adding this extra tax at each and every step is one of the most irritating things out there. You should checkout [https://getaway.pathfndr.io/](https://getaway.pathfndr.io/) . I work at a B2B travel company, and this is one of our sites. I made a search for the same flight you have searched above, and I was getting the flight for Rs. **4,444** (i.e \\~ Rs1,200 cheaper)**.** You check it here: [https://getaway.pathfndr.io/detail/flight-to-mumbai-india-from-newdelhi-india-v2-73068635](https://getaway.pathfndr.io/detail/flight-to-mumbai-india-from-newdelhi-india-v2-73068635) And the price you see in the first page is what you book for. There are no extra charges or taxes added later in the flow. &#x200B; If you have any doubts or queries, do let me know. This is common at all online portals, including those of airlines. While it is an extra, it is not a scam. These are not even charged by the website, but by the credit card payment gateways like visa/MasterCard. Only thing website does is that it passes on the extra charges to you. Both payment options are of CC. Problem is that fee changes when the coupon code is applied. It should remain the same for both cases. Such fee are usually not part of discounts offered by websites, because they are not part of what the website is charging you. If any component is not part of discount, it should remain constant. Problem is that the fee is increased if CC coupon is applied. Their discount dude . They can charge what they want. You went to them for the discount. Happens in most travel portals Happened on RedBus once. Total ticket price: some 6800 Discount coupon applied: 500 Price after coupon: 6600 because the ticket prices increased all of a sudden to 7100 Disappointing. 🙁🙁 I've recently noticed this, previously I used to book tickets without looking at such tricks. Will be careful going forward. I am also seeing the same Convenience fees increased. But my question is what if the discount code that I am availing - I don't really qualify for? then what will happen? Let's say that discount code is for somebody having that specific credit card but I am not using that credit card then what will happen? Will yatra charge me later? I am also seeing the same. But what if I claim a discount code which I am not eligible for? For example it is for some XYZ credit card - I took that discount code but never had that credit card? Will yatra take that amount from my bank account later?"
}