{
    "id": "1gmgn8v",
    "title": "How Modi govt is redirecting investments from other states to Gujarat",
    "url": "https://www.thenewsminute.com/news/how-modi-govt-is-redirecting-investments-from-other-states-to-gujarat?s=34",
    "selftext": "Source:\n\nA semiconductor company from the US was keen on investing a large amount of money in Tamil Nadu capital Chennai, back in 2022. The company’s officials were in New Delhi to meet with the Commerce Minister to discuss their intentions — and when they stepped out of that meeting, there was a surprise waiting for them. A helicopter was all set to whisk them away to Gujarat, before they could finalise their investment in Chennai. “They wanted to waste no time to convince them to shift their project to Prime Minister Narendra Modi’s home state, Gujarat,” a source close to a Tamil Nadu minister tells TNM.\n\nThis ‘helicopter diplomacy’ — straight out of a masala movie — is just one instance of the Modi government’s boorish methods for diverting investments from other states to Gujarat. Political leaders, particularly from opposition-ruled states, have raised concerns about this repeatedly. Ahead of the 2024 Lok Sabha elections, Tamil Nadu Chief Minister MK Stalin alleged that a Rs 6,000 crore investment intended for his state was coerced into moving to Gujarat. Similarly, former Telangana IT Minister KTR accused the Union government of \"arm-twisting\" multinational companies into relocating to Gujarat, while Karnataka's IT Minister Priyank Kharge claimed that companies faced pressure from the Prime Minister's Office to divert their investments.\n\nAhead of the Assembly elections in Maharashtra, leaders from the Maha Vikas Aghadi (MVA) have intensified their accusations against the BJP-led Union government, claiming it has deliberately diverted major projects — such as the recently inaugurated Tata-Airbus facility in Vadodara — away from Maharashtra. \n\nIs there truth to these allegations? And if there is, what’s the modus-operandi? TNM had in-depth conversations with ministers, bureaucrats, and company officials across four states — Maharashtra, Tamil Nadu, Telangana, and Karnataka — as well as officials from the Union government and Gujarat to find out more. \n\nWe identified four strategies frequently employed: substantial capital subsidies from the Union government; commitments to reduce import duties; assurances of government orders for manufacturing; and aggressive promotion of Dholera and GIFT City as investment destinations by Union government representatives. There are also many instances of the Union government unilaterally deciding to grant big-ticket state-run projects to Gujarat, casting aside the proposals of other states. \n\nSince Narendra Modi became the Prime Minister, there has been sharp scrutiny for what many perceive as a lopsided favour for his home state of Gujarat. Strategic relocation of high-profile events like India’s flagship military exhibition DefExpo, it seems that Gujarat is often in the spotlight while other states feel left in the shadows. ",
    "flair": "Policy/Economy",
    "score": 12,
    "num_comments": 6,
    "created_utc": 1731066336.0,
    "convurl": "https://external-preview.redd.it/Z6Knr9AktG60tS9R6WSxRHKRLYGp6c6ay45GPzpsCf8.jpg?auto=webp&s=145754f345871886b65d9dc0a8a26bde491c0428",
    "comments": [
        "The article seems to be paywalled:\n\nhttps://preview.redd.it/ejt4fwf31ozd1.png?width=1386&format=pjpg&auto=webp&s=82501921f6f42242446021ce81f8b4faf76d2315",
        "PM of Gujarat.",
        "Eh, what will you do about it? If you make too much noise, they'll brand you anti-national or build a bew temple in your state by demolishing an existing mosque to get the votes.\n\n_We don't need investment, we need temples. We don't need education, we need cultural preservation._",
        "Siphoning off money from other states to profit Mota bhai.. Atmanirbhar Bharat ya AmbaniBharat ?",
        "wish india divided into 5 more countries , being big country ruining out development.",
        "What happened to a Samsung factory in TN?"
    ],
    "cleaned_text": "modi govt redirecting investments states gujarat source semiconductor company us keen investing large amount money tamil nadu capital chennai back companys officials new delhi meet commerce minister discuss intentions stepped meeting surprise waiting helicopter set whisk away gujarat could finalise investment chennai wanted waste time convince shift project prime minister narendra modis home state gujarat source close tamil nadu minister tells tnm helicopter diplomacy straight masala movie one instance modi governments boorish methods diverting investments states gujarat political leaders particularly oppositionruled states raised concerns repeatedly ahead lok sabha elections tamil nadu chief minister mk stalin alleged rs crore investment intended state coerced moving gujarat similarly former telangana minister ktr accused union government armtwisting multinational companies relocating gujarat karnatakas minister priyank kharge claimed companies faced pressure prime ministers office divert investments ahead assembly elections maharashtra leaders maha vikas aghadi mva intensified accusations bjpled union government claiming deliberately diverted major projects recently inaugurated tataairbus facility vadodara away maharashtra truth allegations whats modusoperandi tnm indepth conversations ministers bureaucrats company officials across four states maharashtra tamil nadu telangana karnataka well officials union government gujarat find identified four strategies frequently employed substantial capital subsidies union government commitments reduce import duties assurances government orders manufacturing aggressive promotion dholera gift city investment destinations union government representatives also many instances union government unilaterally deciding grant bigticket staterun projects gujarat casting aside proposals states since narendra modi became prime minister sharp scrutiny many perceive lopsided favour home state gujarat strategic relocation highprofile events like indias flagship military exhibition defexpo seems gujarat often spotlight states feel left shadows ",
    "cleaned_title": "modi govt redirecting investments states gujarat",
    "cleaned_selftext": "source semiconductor company us keen investing large amount money tamil nadu capital chennai back companys officials new delhi meet commerce minister discuss intentions stepped meeting surprise waiting helicopter set whisk away gujarat could finalise investment chennai wanted waste time convince shift project prime minister narendra modis home state gujarat source close tamil nadu minister tells tnm helicopter diplomacy straight masala movie one instance modi governments boorish methods diverting investments states gujarat political leaders particularly oppositionruled states raised concerns repeatedly ahead lok sabha elections tamil nadu chief minister mk stalin alleged rs crore investment intended state coerced moving gujarat similarly former telangana minister ktr accused union government armtwisting multinational companies relocating gujarat karnatakas minister priyank kharge claimed companies faced pressure prime ministers office divert investments ahead assembly elections maharashtra leaders maha vikas aghadi mva intensified accusations bjpled union government claiming deliberately diverted major projects recently inaugurated tataairbus facility vadodara away maharashtra truth allegations whats modusoperandi tnm indepth conversations ministers bureaucrats company officials across four states maharashtra tamil nadu telangana karnataka well officials union government gujarat find identified four strategies frequently employed substantial capital subsidies union government commitments reduce import duties assurances government orders manufacturing aggressive promotion dholera gift city investment destinations union government representatives also many instances union government unilaterally deciding grant bigticket staterun projects gujarat casting aside proposals states since narendra modi became prime minister sharp scrutiny many perceive lopsided favour home state gujarat strategic relocation highprofile events like indias flagship military exhibition defexpo seems gujarat often spotlight states feel left shadows",
    "cleaned_comments": "article seems paywalled pm gujarat eh make much noise theyll brand antinational build bew temple state demolishing existing mosque get votes dont need investment need temples dont need education need cultural preservation siphoning money states profit mota bhai atmanirbhar bharat ya ambanibharat wish india divided countries big country ruining development happened samsung factory tn",
    "light_cleaned_title": "How Modi govt is redirecting investments from other states to Gujarat",
    "light_cleaned_selftext": "Source: A semiconductor company from the US was keen on investing a large amount of money in Tamil Nadu capital Chennai, back in 2022. The company’s officials were in New Delhi to meet with the Commerce Minister to discuss their intentions — and when they stepped out of that meeting, there was a surprise waiting for them. A helicopter was all set to whisk them away to Gujarat, before they could finalise their investment in Chennai. “They wanted to waste no time to convince them to shift their project to Prime Minister Narendra Modi’s home state, Gujarat,” a source close to a Tamil Nadu minister tells TNM. This ‘helicopter diplomacy’ — straight out of a masala movie — is just one instance of the Modi government’s boorish methods for diverting investments from other states to Gujarat. Political leaders, particularly from opposition-ruled states, have raised concerns about this repeatedly. Ahead of the 2024 Lok Sabha elections, Tamil Nadu Chief Minister MK Stalin alleged that a Rs 6,000 crore investment intended for his state was coerced into moving to Gujarat. Similarly, former Telangana IT Minister KTR accused the Union government of \"arm-twisting\" multinational companies into relocating to Gujarat, while Karnataka's IT Minister Priyank Kharge claimed that companies faced pressure from the Prime Minister's Office to divert their investments. Ahead of the Assembly elections in Maharashtra, leaders from the Maha Vikas Aghadi (MVA) have intensified their accusations against the BJP-led Union government, claiming it has deliberately diverted major projects — such as the recently inaugurated Tata-Airbus facility in Vadodara — away from Maharashtra. Is there truth to these allegations? And if there is, what’s the modus-operandi? TNM had in-depth conversations with ministers, bureaucrats, and company officials across four states — Maharashtra, Tamil Nadu, Telangana, and Karnataka — as well as officials from the Union government and Gujarat to find out more. We identified four strategies frequently employed: substantial capital subsidies from the Union government; commitments to reduce import duties; assurances of government orders for manufacturing; and aggressive promotion of Dholera and GIFT City as investment destinations by Union government representatives. There are also many instances of the Union government unilaterally deciding to grant big-ticket state-run projects to Gujarat, casting aside the proposals of other states. Since Narendra Modi became the Prime Minister, there has been sharp scrutiny for what many perceive as a lopsided favour for his home state of Gujarat. Strategic relocation of high-profile events like India’s flagship military exhibition DefExpo, it seems that Gujarat is often in the spotlight while other states feel left in the shadows.",
    "light_cleaned_comments": "The article seems to be paywalled: PM of Gujarat. Eh, what will you do about it? If you make too much noise, they'll brand you anti-national or build a bew temple in your state by demolishing an existing mosque to get the votes. _We don't need investment, we need temples. We don't need education, we need cultural preservation._ Siphoning off money from other states to profit Mota bhai.. Atmanirbhar Bharat ya AmbaniBharat ? wish india divided into 5 more countries , being big country ruining out development. What happened to a Samsung factory in TN?"
}