{
    "id": "1bltsuf",
    "title": "Just saw this video,and I am shicked",
    "url": "https://youtu.be/vmM7SDGOQiQ?si=H1DJ5qE4OLl-Mhsb",
    "selftext": "Just saw this video and the streets of a failed state looked like an average street in a tier2/3/4 towns in India or any average sabhi mandi.This is the first time I have been shocked on how dirty our country really is.\n\n",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1711204940.0,
    "convurl": "https://external-preview.redd.it/e5wbU24f5E0oswpsxJNtjaPEtMc9fthjQY-FqxupMjw.jpg?auto=webp&s=c545b9acdad8dfe2c75897c4f864c3a46668ade5",
    "comments": [
        "Oh 😳. How shocked do you have to be to become shicked",
        "This guy had very traumatic moments in India too",
        "I understand,I am incredibly interested in the politics of DR AND haiti as they are on the same island with hugely different political and economic conditions.\n\nThis video popped up,I already knew how bad haiti was but seeing the streets of the slums reminded me of an average sabji Mandi in India.I am awestruck",
        " It’s funny how India is regarded as this emerging superpower or booming economy country which looks similar to a totally messed up canabalistic hellh0le extremely poverty ridden place like Haiti .",
        "Haiti is literally a failed state,overtaken by gangs with no governmental oversight.Their slums look like our average crowded market.",
        "Haha if Haiti is supposed to be a failed state , then what is India supposed to be when it looks similar if not worse"
    ],
    "cleaned_text": "saw videoand shicked saw video streets failed state looked like average street tier towns india average sabhi mandithis first time shocked dirty country really ",
    "cleaned_title": "saw videoand shicked",
    "cleaned_selftext": "saw video streets failed state looked like average street tier towns india average sabhi mandithis first time shocked dirty country really",
    "cleaned_comments": "oh shocked become shicked guy traumatic moments india understandi incredibly interested politics dr haiti island hugely different political economic conditions video popped upi already knew bad haiti seeing streets slums reminded average sabji mandi indiai awestruck funny india regarded emerging superpower booming economy country looks similar totally messed canabalistic hellhle extremely poverty ridden place like haiti haiti literally failed stateovertaken gangs governmental oversighttheir slums look like average crowded market haha haiti supposed failed state india supposed looks similar worse",
    "light_cleaned_title": "Just saw this video,and I am shicked",
    "light_cleaned_selftext": "Just saw this video and the streets of a failed state looked like an average street in a tier2/3/4 towns in India or any average sabhi mandi.This is the first time I have been shocked on how dirty our country really is.",
    "light_cleaned_comments": "Oh 😳. How shocked do you have to be to become shicked This guy had very traumatic moments in India too I understand,I am incredibly interested in the politics of DR AND haiti as they are on the same island with hugely different political and economic conditions. This video popped up,I already knew how bad haiti was but seeing the streets of the slums reminded me of an average sabji Mandi in India.I am awestruck It’s funny how India is regarded as this emerging superpower or booming economy country which looks similar to a totally messed up canabalistic hellh0le extremely poverty ridden place like Haiti . Haiti is literally a failed state,overtaken by gangs with no governmental oversight.Their slums look like our average crowded market. Haha if Haiti is supposed to be a failed state , then what is India supposed to be when it looks similar if not worse"
}