{
    "id": "14gcg2f",
    "title": "I am in trubble help me",
    "url": "https://www.reddit.com/gallery/14gcg2f",
    "selftext": "Hi everyone ,\n\nI filled a form(under part admission or dual enrollment) for my 10th grade in nios, but unfortunately i filled a wrong one were I only got marksheet not the certificate\n\nNow i have no idea what to do how i will get admission in 12th grade without certificate and then further studies \n\nI want to take admission in BHU (banaras hindu University) for my graduation is this possible without certification only with marksheet\n \nI am scared rn i can't afford to spoil a year",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 3,
    "created_utc": 1687461989.0,
    "convurl": "https://i.redd.it/pgnrhqyuem7b1.jpg",
    "comments": [
        "I don't know a solution to your problem but one thing I'll tell you is that there's most likely nothing to worry about. \n\nI've been in situations like these.\n\nFor eg: I had a 35% attendance in class 12 and my madarchod teacher kept scaring me by saying that I'll not be able to attend my board exams. I kid you not, I was scared shitless, it kept me awake at many nights. I topped my entire school by scoring 97%.\n\nAnother problem I had was that I lost my class 10th marksheet, this also scared me but nothing happened. I just talked to my class teacher, decided on a date, went to my old school and got it on the same day.\n\nThere's definitely going to be a straightforward and simple solution to this problem. Don't worry."
    ],
    "cleaned_text": "trubble help hi everyone filled formunder part admission dual enrollment th grade nios unfortunately filled wrong one got marksheet certificate idea get admission th grade without certificate studies want take admission bhu banaras hindu university graduation possible without certification marksheet scared rn cant afford spoil year ",
    "cleaned_title": "trubble help",
    "cleaned_selftext": "hi everyone filled formunder part admission dual enrollment th grade nios unfortunately filled wrong one got marksheet certificate idea get admission th grade without certificate studies want take admission bhu banaras hindu university graduation possible without certification marksheet scared rn cant afford spoil year",
    "cleaned_comments": "dont know solution problem one thing ill tell theres likely nothing worry ive situations like eg attendance class madarchod teacher kept scaring saying ill able attend board exams kid scared shitless kept awake many nights topped entire school scoring another problem lost class th marksheet also scared nothing happened talked class teacher decided date went old school got day theres definitely going straightforward simple solution problem dont worry",
    "light_cleaned_title": "I am in trubble help me",
    "light_cleaned_selftext": "Hi everyone , I filled a form(under part admission or dual enrollment) for my 10th grade in nios, but unfortunately i filled a wrong one were I only got marksheet not the certificate Now i have no idea what to do how i will get admission in 12th grade without certificate and then further studies I want to take admission in BHU (banaras hindu University) for my graduation is this possible without certification only with marksheet I am scared rn i can't afford to spoil a year",
    "light_cleaned_comments": "I don't know a solution to your problem but one thing I'll tell you is that there's most likely nothing to worry about. I've been in situations like these. For eg: I had a 35% attendance in class 12 and my madarchod teacher kept scaring me by saying that I'll not be able to attend my board exams. I kid you not, I was scared shitless, it kept me awake at many nights. I topped my entire school by scoring 97%. Another problem I had was that I lost my class 10th marksheet, this also scared me but nothing happened. I just talked to my class teacher, decided on a date, went to my old school and got it on the same day. There's definitely going to be a straightforward and simple solution to this problem. Don't worry."
}