{
    "id": "1c4eejf",
    "title": "Amazon scammed me",
    "url": "https://twitter.com/abhi_pistelero/status/1779738251080892441?t=7n7gdiUng6LnQnyjT3W2wQ&s=19",
    "selftext": "On April 3rd, I ordered [headphone, a mouse, and a mousepad.The box arrived on April 5th, but only contained the mouse and mousepad. Despite Amazon support initially stating they'd investigate, they later claimed they couldn't reach the supplier and needed another 4-day investigation. Now, they say all items are delivered and refuse further assistance.\n\n",
    "flair": "Crime",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1713158895.0,
    "convurl": "https://external-preview.redd.it/orW3wp8y0XyhUX81OHoCzcNRcRNuP8Wy-YSVAfasEW4.jpg?auto=webp&s=7de4c22c6d463fb8191c66090f2a59e4aadd1c2c",
    "comments": [
        "Raise a complaint on NCH website",
        "Harsh truth - \n\n\nIf you got no video, then you don't have any proof\n\n\n\n\nThe amount of scam calls amazon will get from people claiming they never received products will be insane if get they simply start believing customers words ",
        "You can talk to them again and don't be impatient with them. Treat them respectfully and they will resolve it. Keep your mind cool. Getting angry and showing you are some kind of haryanvi tau works on apps like mi or swiggy or companies like that. Amazon is more of a sophisticated one you will get resolution.",
        "Are you a Prime user?",
        "I used to be a prime user. Not anymore.",
        "That would explain their insenstivity towards your issues. \n\nAs a long time Prime user, I have never faced any such issues with returns or refunds. And I have made a few silly claims also. Eg. Tried returning a non-returnable container because the listing mentioned 400gm capacity but the actual box mentioned 360gm. Amazon ended up refunding me the whole amount and let me keep the container too!"
    ],
    "cleaned_text": "amazon scammed april rd ordered headphone mouse mousepadthe box arrived april th contained mouse mousepad despite amazon support initially stating theyd investigate later claimed couldnt reach supplier needed another day investigation say items delivered refuse assistance ",
    "cleaned_title": "amazon scammed",
    "cleaned_selftext": "april rd ordered headphone mouse mousepadthe box arrived april th contained mouse mousepad despite amazon support initially stating theyd investigate later claimed couldnt reach supplier needed another day investigation say items delivered refuse assistance",
    "cleaned_comments": "raise complaint nch website harsh truth got video dont proof amount scam calls amazon get people claiming never received products insane get simply start believing customers words talk dont impatient treat respectfully resolve keep mind cool getting angry showing kind haryanvi tau works apps like mi swiggy companies like amazon sophisticated one get resolution prime user used prime user anymore would explain insenstivity towards issues long time prime user never faced issues returns refunds made silly claims also eg tried returning nonreturnable container listing mentioned gm capacity actual box mentioned gm amazon ended refunding whole amount let keep container",
    "light_cleaned_title": "Amazon scammed me",
    "light_cleaned_selftext": "On April 3rd, I ordered [headphone, a mouse, and a mousepad.The box arrived on April 5th, but only contained the mouse and mousepad. Despite Amazon support initially stating they'd investigate, they later claimed they couldn't reach the supplier and needed another 4-day investigation. Now, they say all items are delivered and refuse further assistance.",
    "light_cleaned_comments": "Raise a complaint on NCH website Harsh truth - If you got no video, then you don't have any proof The amount of scam calls amazon will get from people claiming they never received products will be insane if get they simply start believing customers words You can talk to them again and don't be impatient with them. Treat them respectfully and they will resolve it. Keep your mind cool. Getting angry and showing you are some kind of haryanvi tau works on apps like mi or swiggy or companies like that. Amazon is more of a sophisticated one you will get resolution. Are you a Prime user? I used to be a prime user. Not anymore. That would explain their insenstivity towards your issues. As a long time Prime user, I have never faced any such issues with returns or refunds. And I have made a few silly claims also. Eg. Tried returning a non-returnable container because the listing mentioned 400gm capacity but the actual box mentioned 360gm. Amazon ended up refunding me the whole amount and let me keep the container too!"
}