{
    "id": "1dy3a6w",
    "title": "Karnataka State Government Proposes 'Gender Neutral' Rape Laws ",
    "url": "https://i.redd.it/61lxmq4x39bd1.jpeg",
    "selftext": "KARNATAKA STATE GOVERNMENT PROPOSES 'GENDER NEUTRAL' RAPE LAWS\n\n▪️Proposal Has Been Made By Expert Committee Headed By State Law Minister @HKPatilINC\n\n▪️Jyothi. A. President of Karnataka State Committee National Federation of Indian Women (NFIW) Demands \"Immediate Withdrawal Of Said Proposal\"\n\nJyothi A (NFIW):\n\n\"In a society deep rooted in patriarchy and misogyny, talking of ‘gender neutral’ rape laws is an injustice to the women of the country as well as the Constitutional values.\"\n\n\"Gender Neutralisation of rape laws and other acts of sexual offences would dilute the laws and deny justice to the aggrieved women.\"\n\n\"On the other hand, the diluted gender neutral legislation only places accusations against her. Therefore, NFIW reiterates that laws pertaining to sexual offences cannot be gender neutral in a patriarchal society.\"",
    "flair": "Law & Courts",
    "score": 1773,
    "num_comments": 157,
    "created_utc": 1720425371.0,
    "convurl": "https://i.redd.it/61lxmq4x39bd1.jpeg",
    "comments": [
        "Finally someone 🙇\n\nAlso, Jyoti needs to answer as to how acknowledging and acting on the fact that men too can be victims of sexual assault without diluting existing laws is \"against women and constitution\"",
        "Someone needs to tell Jyoti that giving someone justice does not mean taking it away from someone else. Everyone needs to have justice or is she worried about the extra makkhan she'll stop getting by supporting fake cases against men? I wonder how men in her family must be living.",
        "This is needed, it's about damn time",
        "Gender neutral laws are also justice to females (the mom ,sister,wife of the male victim)",
        "Time to move to karnataka",
        "Jyothi just wanted to be on main stream media that's all she wants",
        "Bangalore here I come.",
        "Already on my way",
        "Jyoti trying to be relevant.\nWatch her join politics in the next edition of elections.",
        "No laws against road rage and auto drivers tho. /s",
        "Well half of middle class  india is already there",
        "Ms/ Mrs Jyothi needs to be evaluated by a psychiatrist",
        "Or maybe she's a predator herself and knows that she might be called out if these laws are put in motion. Who knows?",
        "Why women have so many commissions who block men's justice? And why men don't have any commissions?\n\nSometimes I think, we should take all the privileges women have and send them back to the kitchen. This is totally outrageous. Men literally have no power in this world.",
        "Fucking finally.",
        "These laws need to be written VERY CAREFULLY. They should not be vague so that anything goes but they should also be specific enough that people cannot easily misuse them.",
        "Buddy, men are raped my other men. Please don't be so narrow in your understanding of the society. Fake cases happen everywhere, that is not a ground to allow men to keep getting raped without being able to file an FIR.",
        "Rare Karnataka w?",
        "Karnataka has my full support. Finally a state government with 2 brain cells .",
        "I think you need to go back and learn comprehension. Good luck 👍🏻",
        "Jyothi is a true Patriot. She doesn't give a fuck about women cutting their partner's dick.",
        "You think she doesn't know?",
        "She's talking out of her ass.",
        "Any idea on how it was made gender neutral? I.e. what the actual wordings are? I couldn't find anything on that.",
        "Bravo Karnataka! You're ahead of all Indian states!",
        "No pls don't, I don't own the place but just me request.",
        "Lol will never happen. I have seen men fighting for women's rights and then women mocking men's issue, living in an entitled world and being real arseholes in general.\nThe real enemy of men is men itself.",
        "if anything wont this actually uphold the constitutional value?",
        "Jyoti isn't entirely wrong but she should atleast fricking wait to see the proposal and laws first. \n\nIncluding the patriarchal and misogynistic factors, then amendment can be proposed so it's not misused by men, meanwhile men who are actually harmed would get justice - including protection and space for trans men and re instate the 377 law they removed that protected men from SA by other men. 😑😑😑\n\nWhenever anything is put forth, everyone wants to talk and create a ruckus instead of actually seeing the minutia and discussing the points in it. This results in most laws literally screwing people over 😑",
        "Trust me , She Can't Answer that!",
        "About time they criminilized marital rape too",
        "The new laws to replace IPC have removed section 377, which protected men against rape...\n\nWe need to bring section 377 back. Because more than 95% of r\\*pes of men, are committed by other men...",
        "\"Gender Neutralisation of rape laws and other acts of sexual offences would dilute the laws and deny justice to the aggrieved women.\"\n\nhttps://i.redd.it/qj0iws2sn9bd1.gif",
        "men have also been gangraped by women",
        "Exactly!",
        "W",
        "What do you want to know exactly?",
        "its about damn time and fuck off Jyoti you ain't the main character",
        "Who rapes men?",
        "Priveliged women like these pounce on every oppurtunity available to misuse any law they can find. Just some selfish pieces of shit.",
        "1 thing at a time man, be patient",
        "Men & Women",
        "On what grounds is this injustice even",
        "Why? They are rewriting the law, might as well do it in one fell swoop.",
        "Someone should really check her history, maybe they find why she is so against it............",
        "Great job!",
        "Didn't know Karnataka was a chad state",
        "He didnt mean he was against it. Our laws are shitty so if we devote all energy at a time on one thing we will solve problems sooner. When this is done we can go ham on marital rape",
        "Based Karnataka",
        "Finally a good step",
        "I have mostly seen men mocking men’s issue honestly. If a man goes ahead and shares with his male friends that he has been raped or molested, more often than not he becomes a laughing stock, it also has been shown as a funny trope in many movies and shows. If a man wears makeup, I see mostly men abusing him in the social media comment section. Anyway, literally speaking every sexual assault law should be gender neutral.",
        "Finally someone talks sense",
        "Im so shocked Indian men want marital rape to be legal !!! Who would've thought!!! OMG!!!",
        "Take a hike Jyothi Anandasubharao.",
        "She was part of CPI, rotten politics",
        "But not to specific as it can be used as way to misuse the laws purpose and escape within its cracks, eg a few days a ago read an article where it wasn't considered rape because he hadn't physically penetrait her but was naked and removed her undergarments.",
        "Rape in the technical term of the law.",
        "Good. Now, is marital rape felonized?",
        "About time, i hope the new laws are made with care unlike the prior ones",
        "That's why these laws need to be detailed and consider various situations.",
        "That's why these laws need to be detailed and consider various situations.",
        "But they are woman who rape men, either by drugs, emotional blackmail, it's not just men who rape men. But rape by women if I'm right is not even considered rape by law, if we take movies, men being drugged with aphrodisiac etc are treated comically.",
        "Need of the hour!!",
        "Okay, if you read up about the history of this, after Nirbhaya there was actually suggestions for gender neutral laws in this regards, but [activists and womens organisations protested against it](https://timesofindia.indiatimes.com/india/activists-join-chorus-against-gender-neutral-rape-laws/articleshow/18840879.cms).\n\nJust a few years ago in 2019, the [central government replied to a PIL that we cannot have gender neutral laws in this country](https://www.vice.com/en/article/mb8dey/rape-laws-in-india-cannot-be-gender-neutral-says-ministry-of-home-affairs).\n\nWhat this lady says is the same, it just repeats this positions from earlier.\n\nI'd say, we need both martial rape and these gender neutral laws.",
        "Yep. But seeing the downvotes, people don't Wang to admit that there's also more number of men who would literally use that law to further abuse women. See how men treat women in online spaces. They literally use AI for revenge porn and do far worse.\n\nI didn't even suggest that law shouldn't be made. I said it should hold a provision to prevent a gender known for abuse from abusing it. And still people have a problem. \n\nMen want to blame women and feminists for lack of gender equality laws. Blame your own gender for it being unsafe to have gender neutral laws. 🤷🏻‍♀️",
        "What is marital rape ?",
        "I kinda support the fake cases excuse because that's what they use to deter male supporting organisation and women on men rape not being called rape and given appropriate punishment.       \n\nApart from that, they're only theoretically speaking.      \nOnly theoretically, it makes sense to do things one by one.         \nBut the ways law is accepted, even getting this proposal accepted would be hard. Adding another clause would make it harder.     \n\nJust theorising.",
        "Correct me if I’m wrong, I agree that’s heinous and the act deserves to be punished, but how is it not an attempted rape and sexual assault and is actual rape?",
        "Please include /s if you're kidding, because there's too many actual rapists on reddit",
        "Opposition to any acts should be based on clear and valid concerns. The law intends to punish anyone forcing themselves on anyone whichever gender that person or persons are belonging to. I fail to see how that is an injustice.",
        "Wah jyoti wah🖕calling society deep rooted patriarchy when there is no judicial protection for men against any allegation by women. Jyoti is actual sex predator when she doesn't want men to get justice when they get raped.",
        "It will collapse the institution she build for women who need side income.",
        "What do you mean? There are many good looking men who can get raped.",
        "I am moving to Kerala and thinking of learning the state language from next day👍",
        "Well it's simple, they are spending so much political capital on changing the rape laws, might as well do the push and make marital rape an offence.\nThis would negate all the opposition from the likes mentioned in the post.",
        "W k'taka govt",
        "Explain to me what is /s?",
        "Yes please.",
        "W move by the government!!",
        "Don't know about this particular men's right Instagram page but most of the men's rights account on Instagram are very pro BJP and hold Congress for downfall of men's rights in India\n\nWhen election results came most of those pages were expressing their sadness for BJP's loss of seats",
        "You don't have to he good looking to be raped",
        "/s is a tone indicator of sarcasm you add at the end of a sentence. There are too many stupid people on reddit therefore it's better to indicate if you are being sarcastic.",
        "if a 30 year old woman drugs a 19 yr old and he wakes up naked in a shack and sees the woman taking advantage of him, is it not rape? the 19 yr old can't go to court because it is either useless or he will end up going to prison",
        "how will it dilute anything? it will just include laws for men. Jyoti seems like a really bad person tbh.  \nShe speaks about injustice of women, what about injustice of men which is never reported anywhere and the victims silently suffer",
        "ABOUT DAMN TIME",
        "This should be implemented all over India..",
        "Average misandrist be like.",
        "What about time bringing in a contract for consensual sex. Every time you have to have sex, sign that fing document, both remain safe.",
        "He's a troll",
        "I'll tell you what will happen. Both feminists and religious conservatives will oppose it and the proposal will be dropped.",
        "Having gender involved in making laws in itself doesn't make any sense. Make changes on how arrests are made (women police for women suspects, separate cells for women) but keep laws same for everyone.",
        "Stop living in an utopian world. Feminism has in literal become anit men rather than pro equality. \nAnd nice ad hominem attack, blame men for everything lol",
        "About time to establish SOP before having sex to establish the consent of both parties",
        "Do we need to learn Kannada?",
        "Subjudice in the Supreme Court. Let them deal",
        "Auto correct on karlo bhai🙂",
        "https://preview.redd.it/9zaspsgtgabd1.jpeg?width=1079&format=pjpg&auto=webp&s=839f919f8fb33a141069c326d2548fb4e829b3a3\n\nAbout time rapists stop blaming women for their miserable low life",
        "wow......my state has bcm mature......didnt expect it but im damn happy",
        "Would be better if you provide the post for the comment.",
        "Having sex with your spouse without consent.",
        "https://preview.redd.it/63n1xhi0iabd1.jpeg?width=1079&format=pjpg&auto=webp&s=9f60829a636f82e074f1dfab16952601a2d10cad\n\nWhy is it only the creepiest and rapiest peeps always fighting to keep rape legal 🤔 hmm",
        "I don't care about pro-rape people",
        "I would really like for this to happen now. But realistically i expect it after 15-20 years, after some of the old policy makers hit the can.",
        "Jyoti is probably projecting 😬",
        "Nope, after them another set of rapists will come to keep rape legal.",
        "Why would you not if you're moving to Karnataka?",
        "https://preview.redd.it/wp7djsdfjabd1.jpeg?width=567&format=pjpg&auto=webp&s=0702137fc9b62ca689ab50a7e554a5432ec9c606",
        "We need to make the definition of rape in 375 so it's not only women that can be victims of rape. It excludes transgenders and men",
        "Drugging people is a crime. As is assault",
        ">nice ad hominem attack\n\nIdt you know what that means",
        "Start watching rajnikanth movies",
        "Please spread this around the world. Starting with England and it's cohorts, who still refuse to even acknowledge male rape. Thanks.",
        ".... That is the standard procedure for the introduction of any law. There is a period for which the public is invited to comment on the proposed law. Its just the center hasn't been doing it. \n\nWe need to make the definition of rape in 375 so it's not only women that can be victims of rape. It excludes transgenders and men. No need for the creative interpretation of a homophobic law just so there can be a reduced sentence for the offender.",
        "They're finally going to punish those who make false rape actuations with prison time? Oh, nope. No equality ",
        "About time they legalized prenups",
        "Wouldn’t that spoil the whole intent of sarcasm :)",
        "That's the point I tried to make in OG comment but well. \n\nMen are too busy abusing women than caring their protection was stripped away. So 🤷🏻‍♀️",
        "As a feminist, I agree. But some sort of system has to be created to ensure that people don’t misuse such laws. If anyone is found faking rape/ threatening to cause harm if they don’t withdraw the case/ other reasons, straight to jail.",
        "Well because everyone’s moving there anyway right?",
        "You weren't making a point. You were defending the woman by making malcious arguments\n\n>abusing women\n\nThe woman in question opposes granting the very basic protection of law to men so imma say she deserves it.",
        "s",
        "And men like you literally abusing women because they're making a point is the reason gender neutral laws in india aren't feasible.\n\nDefending the woman? I literally said she has a point but spoke prematurely. \n\nAnd herein lies people like you - men individually target women who don't adhere to their views. Women may say shit about men as a whole but rarely target specific men, esp en masse ganging up. That's evident by reddit.\n\nAnd thank you. You literally are the example here who proved that dumbass woman's point 🤷🏻‍♀️",
        "Why withdrawl? Feminist dictatorship chalegi.",
        "But false dowry accusations have shown that there is a precedent to this, because courts don't require a significant burden of evidence in such cases. No need to make ad homynem attacks to someone whose life you know nothing about.",
        "Bro it's like asking do I have to learn Hindi if I want to move to New Delhi.",
        "My hopes are the new generarion will be mature enough to vote for intellectuals rather than rapists.",
        ">literally abusing women\n\nLmao who? \n\n>literally said she has a point\n\nYes, that's what defending someone means. \n\n>who don't adhere to their views\n\nI reserve my right to call people who don't believe in basic human rights whatever I want. If that offends you, you are a part of the problem. \n\n>whole but rarely target specific\n\nBruh what is this fanfiction? Where are you coming up with these things?",
        ">Im so shocked Indian men want marital rape to be legal !!! Who would've thought!!! OMG!!!\n\nThat's a good thing though. \n\n>Its so interesting no ones whining about fake cases now and using it as an excuse to keep rape legal.\n\nFake cases shouldn't be used as an excuse to keep rape legal.",
        "Calling women's experience fanfiction? Lol\n\nYeah, your basic human rights means abuses and further shit for women and more oppression. You can't demand equal responsibility when there's no semblance of equality.\n\nWhile you spew your BS here and then can go safely outside after 7 pm. \n\nYou literally said she deserves abuses and then say lmao who. Some level of BS.",
        "Maybe they should just propose 'No Rape' laws instead? Seems like that'd solve everything.",
        "Hoping ain't enough. India is the rape capital of the world and men here are known as \"bob and vagene\". These laws just cement what our culture represents.",
        "The degree of sexual assault is of great importance, in deciding the severity of the punishment. A violation of someone's mouth is penalized to a lesser extent than vginal or anl peneration. Because it is less violent and traumatizing. \n\nAs a man, would you say that being violently penetrated by another man and unable to fight back a more heinous offense, than being coerced into having sex by a woman? I would say so.\n\nSo if you were a man, would you be fine with only a heterosexual definition of r\\*pe? Even though you are more likely to be assaulted and violated violently by another man in another hole? If there's no definition for the type of assault you have suffered, you will be at a great disadvantage in getting justice. And male children are among worst affected in this case.",
        "Bruh I don't even know if you are a woman. If something sounds dumb to me, I am gonna call it out. \n\nTerrible people deserve to be abused. Doesnt excuse them just because they are a woman. \n\n>safely outside after 7 pm. \n\n80% of murder victims are men. But I am not gonna go there cause there are a million intersectional factors that are much more relevant in determining how safe anybody is. You sound pretty privileged honestly, so don't go around appropriating the struggles of actually marginalized people to win internet points. \n\n>literally said she deserves abuses\n\nDo you know the meaning of the words 'literally abused'? Cause that's what you said",
        ">mouth is penalized to a lesser extent than vginal or anl peneration\n\nWhere are you coming up with this? Go read 375 ipc\n\n>fine with only a heterosexual definition of r*pe?\n\nDude go read the ipc. You have no idea what you are taking about. The ipc doesn't recognize men as victims AND doesn't recognize women as perpetuators except in extremely limited circumstances. Just changing the first part would be more than enough if achieved in the present environment.",
        "The IPC is no longer in place since July 1st. \n\nThe new laws do not protect a man from sodomy by another man....the most probable scenario of a man's r\\*pe.\n\nWhat's the point of only wanting the recognition of a man being \"coerced\" into having sex by a woman, but ignoring the most likely scenario that a man is would face? (aka, assault by another man)?\n\nYou should be more concerned about the fact that there's no interpretation of male on male SA in the new Bhartiya Nyaya Sanhita...which leaves men with no recourse in most cases of their SA.",
        "Meh",
        "375 is rape. Not unnatural offenses. That did not get removed. And it is which should be changed to recognize male victims. \n\nOriginal\n\n>A man is said to commit \"rape\" if he—a. penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or (object, body, part, against consent) \n\nTo \n\n>A **person**is said to commit \"rape\" if he— a. penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a **person**or makes her to do so with him or any other person; or \n\nWhy are y'all so resistant to actually reading wtf you are talking about?",
        ">",
        "Read the goddamn section ffs. I did not quote the entire thing. I even paraphrased with brackets the rest of it. \n\n>I agree that the definition\n\nSo why are you arguing against me?",
        "Because you're also changing the definition of the perpetrator. Duh. R\\*pe is penetrative sexual assault. It can only be done by a man. So using the word \"person\" to define the perpetrator's offence will just lend to confusion and ambiguity.",
        "ou will not read the section unless I quote it to you in a reply will you? \n\n>inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person; or\n\n>(c)manipulates any part of the body of a woman so as to cause penetration into the vagina, urethra, anus or any part of body of such woman or makes her to do so with him or any other person; or\n\n>(d)applies his mouth to the vagina, anus, urethra of a woman or makes her to do so with him or any other person,\n\nYou don't even know what currently the status of the crime of rape is. How are you commenting what is should be in the future?",
        "Lol",
        "Victim blaming much?",
        "Supporting oppressors much?",
        "What did the posts text say?",
        "I love my friends from Karnataka. But I don't have flair for languages. My brain is not capable of learning a new language. That is the only reason. Trust me, there are tonnes of people like me. Learning a new language is not an easy skill after you are 20 years old. Neurons are not as elastic. And I am definitely not one of those who wants Hindi to be forced on anyone.\n\nHowever, one thing is that most of my Kannada speaking friends are very fluent in Hindi. So far they continue to speak with me in English and Hindi. I was hoping that will continue at a socital level if it is not an inconvenience.",
        "This will eventually create an environment where people from rural Karnataka will have to learn either Hindi or English before moving to Bangalore.\n\nI know this because this is already happened in Mumbai."
    ],
    "cleaned_text": "karnataka state government proposes gender neutral rape laws karnataka state government proposes gender neutral rape laws proposal made expert committee headed state law minister hkpatilinc jyothi president karnataka state committee national federation indian women nfiw demands immediate withdrawal said proposal jyothi nfiw society deep rooted patriarchy misogyny talking gender neutral rape laws injustice women country well constitutional values gender neutralisation rape laws acts sexual offences would dilute laws deny justice aggrieved women hand diluted gender neutral legislation places accusations therefore nfiw reiterates laws pertaining sexual offences gender neutral patriarchal society ",
    "cleaned_title": "karnataka state government proposes gender neutral rape laws",
    "cleaned_selftext": "karnataka state government proposes gender neutral rape laws proposal made expert committee headed state law minister hkpatilinc jyothi president karnataka state committee national federation indian women nfiw demands immediate withdrawal said proposal jyothi nfiw society deep rooted patriarchy misogyny talking gender neutral rape laws injustice women country well constitutional values gender neutralisation rape laws acts sexual offences would dilute laws deny justice aggrieved women hand diluted gender neutral legislation places accusations therefore nfiw reiterates laws pertaining sexual offences gender neutral patriarchal society",
    "cleaned_comments": "finally someone also jyoti needs answer acknowledging acting fact men victims sexual assault without diluting existing laws women constitution someone needs tell jyoti giving someone justice mean taking away someone else everyone needs justice worried extra makkhan shell stop getting supporting fake cases men wonder men family must living needed damn time gender neutral laws also justice females mom sisterwife male victim time move karnataka jyothi wanted main stream media thats wants bangalore come already way jyoti trying relevant watch join politics next edition elections laws road rage auto drivers tho well half middle class india already ms mrs jyothi needs evaluated psychiatrist maybe shes predator knows might called laws put motion knows women many commissions block mens justice men dont commissions sometimes think take privileges women send back kitchen totally outrageous men literally power world fucking finally laws need written carefully vague anything goes also specific enough people easily misuse buddy men raped men please dont narrow understanding society fake cases happen everywhere ground allow men keep getting raped without able file fir rare karnataka w karnataka full support finally state government brain cells think need go back learn comprehension good luck jyothi true patriot doesnt give fuck women cutting partners dick think doesnt know shes talking ass idea made gender neutral ie actual wordings couldnt find anything bravo karnataka youre ahead indian states pls dont dont place request lol never happen seen men fighting womens rights women mocking mens issue living entitled world real arseholes general real enemy men men anything wont actually uphold constitutional value jyoti isnt entirely wrong atleast fricking wait see proposal laws first including patriarchal misogynistic factors amendment proposed misused men meanwhile men actually harmed would get justice including protection space trans men instate law removed protected men sa men whenever anything put forth everyone wants talk create ruckus instead actually seeing minutia discussing points results laws literally screwing people trust cant answer time criminilized marital rape new laws replace ipc removed section protected men rape need bring section back rpes men committed men gender neutralisation rape laws acts sexual offences would dilute laws deny justice aggrieved women men also gangraped women exactly w want know exactly damn time fuck jyoti aint main character rapes men priveliged women like pounce every oppurtunity available misuse law find selfish pieces shit thing time man patient men women grounds injustice even rewriting law might well one fell swoop someone really check history maybe find great job didnt know karnataka chad state didnt mean laws shitty devote energy time one thing solve problems sooner done go ham marital rape based karnataka finally good step mostly seen men mocking mens issue honestly man goes ahead shares male friends raped molested often becomes laughing stock also shown funny trope many movies shows man wears makeup see mostly men abusing social media comment section anyway literally speaking every sexual assault law gender neutral finally someone talks sense im shocked indian men want marital rape legal wouldve thought omg take hike jyothi anandasubharao part cpi rotten politics specific used way misuse laws purpose escape within cracks eg days ago read article wasnt considered rape hadnt physically penetrait naked removed undergarments rape technical term law good marital rape felonized time hope new laws made care unlike prior ones thats laws need detailed consider various situations thats laws need detailed consider various situations woman rape men either drugs emotional blackmail men rape men rape women im right even considered rape law take movies men drugged aphrodisiac etc treated comically need hour okay read history nirbhaya actually suggestions gender neutral laws regards activists womens organisations protested ithttpstimesofindiaindiatimescomindiaactivistsjoinchorusagainstgenderneutralrapelawsarticleshowcms years ago central government replied pil gender neutral laws countryhttpswwwvicecomenarticlembdeyrapelawsinindiacannotbegenderneutralsaysministryofhomeaffairs lady says repeats positions earlier id say need martial rape gender neutral laws yep seeing downvotes people dont wang admit theres also number men would literally use law abuse women see men treat women online spaces literally use ai revenge porn far worse didnt even suggest law shouldnt made said hold provision prevent gender known abuse abusing still people problem men want blame women feminists lack gender equality laws blame gender unsafe gender neutral laws marital rape kinda support fake cases excuse thats use deter male supporting organisation women men rape called rape given appropriate punishment apart theyre theoretically speaking theoretically makes sense things one one ways law accepted even getting proposal accepted would hard adding another clause would make harder theorising correct im wrong agree thats heinous act deserves punished attempted rape sexual assault actual rape please include youre kidding theres many actual rapists reddit opposition acts based clear valid concerns law intends punish anyone forcing anyone whichever gender person persons belonging fail see injustice wah jyoti wahcalling society deep rooted patriarchy judicial protection men allegation women jyoti actual sex predator doesnt want men get justice get raped collapse institution build women need side income mean many good looking men get raped moving kerala thinking learning state language next day well simple spending much political capital changing rape laws might well push make marital rape offence would negate opposition likes mentioned post w ktaka govt explain yes please w move government dont know particular mens right instagram page mens rights account instagram pro bjp hold congress downfall mens rights india election results came pages expressing sadness bjps loss seats dont good looking raped tone indicator sarcasm add end sentence many stupid people reddit therefore better indicate sarcastic year old woman drugs yr old wakes naked shack sees woman taking advantage rape yr old cant go court either useless end going prison dilute anything include laws men jyoti seems like really bad person tbh speaks injustice women injustice men never reported anywhere victims silently suffer damn time implemented india average misandrist like time bringing contract consensual sex every time sex sign fing document remain safe hes troll ill tell happen feminists religious conservatives oppose proposal dropped gender involved making laws doesnt make sense make changes arrests made women police women suspects separate cells women keep laws everyone stop living utopian world feminism literal become anit men rather pro equality nice ad hominem attack blame men everything lol time establish sop sex establish consent parties need learn kannada subjudice supreme court let deal auto correct karlo bhai time rapists stop blaming women miserable low life wowmy state bcm maturedidnt expect im damn happy would better provide post comment sex spouse without consent creepiest rapiest peeps always fighting keep rape legal hmm dont care prorape people would really like happen realistically expect years old policy makers hit jyoti probably projecting nope another set rapists come keep rape legal would youre moving karnataka need make definition rape women victims rape excludes transgenders men drugging people crime assault nice ad hominem attack idt know means start watching rajnikanth movies please spread around world starting england cohorts still refuse even acknowledge male rape thanks standard procedure introduction law period public invited comment proposed law center hasnt need make definition rape women victims rape excludes transgenders men need creative interpretation homophobic law reduced sentence offender theyre finally going punish make false rape actuations prison time oh nope equality time legalized prenups wouldnt spoil whole intent sarcasm thats point tried make og comment well men busy abusing women caring protection stripped away feminist agree sort system created ensure people dont misuse laws anyone found faking rape threatening cause harm dont withdraw case reasons straight jail well everyones moving anyway right werent making point defending woman making malcious arguments abusing women woman question opposes granting basic protection law men imma say deserves men like literally abusing women theyre making point reason gender neutral laws india arent feasible defending woman literally said point spoke prematurely herein lies people like men individually target women dont adhere views women may say shit men whole rarely target specific men esp en masse ganging thats evident reddit thank literally example proved dumbass womans point withdrawl feminist dictatorship chalegi false dowry accusations shown precedent courts dont require significant burden evidence cases need make ad homynem attacks someone whose life know nothing bro like asking learn hindi want move new delhi hopes new generarion mature enough vote intellectuals rather rapists literally abusing women lmao literally said point yes thats defending someone means dont adhere views reserve right call people dont believe basic human rights whatever want offends part problem whole rarely target specific bruh fanfiction coming things im shocked indian men want marital rape legal wouldve thought omg thats good thing though interesting ones whining fake cases using excuse keep rape legal fake cases shouldnt used excuse keep rape legal calling womens experience fanfiction lol yeah basic human rights means abuses shit women oppression cant demand equal responsibility theres semblance equality spew bs go safely outside pm literally said deserves abuses say lmao level bs maybe propose rape laws instead seems like thatd solve everything hoping aint enough india rape capital world men known bob vagene laws cement culture represents degree sexual assault great importance deciding severity punishment violation someones mouth penalized lesser extent vginal anl peneration less violent traumatizing man would say violently penetrated another man unable fight back heinous offense coerced sex woman would say man would fine heterosexual definition rpe even though likely assaulted violated violently another man another hole theres definition type assault suffered great disadvantage getting justice male children among worst affected case bruh dont even know woman something sounds dumb gon na call terrible people deserve abused doesnt excuse woman safely outside pm murder victims men gon na go cause million intersectional factors much relevant determining safe anybody sound pretty privileged honestly dont go around appropriating struggles actually marginalized people win internet points literally said deserves abuses know meaning words literally abused cause thats said mouth penalized lesser extent vginal anl peneration coming go read ipc fine heterosexual definition rpe dude go read ipc idea taking ipc doesnt recognize men victims doesnt recognize women perpetuators except extremely limited circumstances changing first part would enough achieved present environment ipc longer place since july st new laws protect man sodomy another manthe probable scenario mans rpe whats point wanting recognition man coerced sex woman ignoring likely scenario man would face aka assault another man concerned fact theres interpretation male male sa new bhartiya nyaya sanhitawhich leaves men recourse cases sa meh rape unnatural offenses get removed changed recognize male victims original man said commit rape hea penetrates penis extent vagina mouth urethra anus woman makes person object body part consent personis said commit rape penetrates penis extent vagina mouth urethra anus personor makes person yall resistant actually reading wtf talking read goddamn section ffs quote entire thing even paraphrased brackets rest agree definition arguing youre also changing definition perpetrator duh rpe penetrative sexual assault done man using word person define perpetrators offence lend confusion ambiguity ou read section unless quote reply inserts extent object part body penis vagina urethra anus woman makes person cmanipulates part body woman cause penetration vagina urethra anus part body woman makes person dapplies mouth vagina anus urethra woman makes person dont even know currently status crime rape commenting future lol victim blaming much supporting oppressors much posts text say love friends karnataka dont flair languages brain capable learning new language reason trust tonnes people like learning new language easy skill years old neurons elastic definitely one wants hindi forced anyone however one thing kannada speaking friends fluent hindi far continue speak english hindi hoping continue socital level inconvenience eventually create environment people rural karnataka learn either hindi english moving bangalore know already happened mumbai",
    "light_cleaned_title": "Karnataka State Government Proposes 'Gender Neutral' Rape Laws",
    "light_cleaned_selftext": "KARNATAKA STATE GOVERNMENT PROPOSES 'GENDER NEUTRAL' RAPE LAWS ▪️Proposal Has Been Made By Expert Committee Headed By State Law Minister @HKPatilINC ▪️Jyothi. A. President of Karnataka State Committee National Federation of Indian Women (NFIW) Demands \"Immediate Withdrawal Of Said Proposal\" Jyothi A (NFIW): \"In a society deep rooted in patriarchy and misogyny, talking of ‘gender neutral’ rape laws is an injustice to the women of the country as well as the Constitutional values.\" \"Gender Neutralisation of rape laws and other acts of sexual offences would dilute the laws and deny justice to the aggrieved women.\" \"On the other hand, the diluted gender neutral legislation only places accusations against her. Therefore, NFIW reiterates that laws pertaining to sexual offences cannot be gender neutral in a patriarchal society.\"",
    "light_cleaned_comments": "Finally someone 🙇 Also, Jyoti needs to answer as to how acknowledging and acting on the fact that men too can be victims of sexual assault without diluting existing laws is \"against women and constitution\" Someone needs to tell Jyoti that giving someone justice does not mean taking it away from someone else. Everyone needs to have justice or is she worried about the extra makkhan she'll stop getting by supporting fake cases against men? I wonder how men in her family must be living. This is needed, it's about damn time Gender neutral laws are also justice to females (the mom ,sister,wife of the male victim) Time to move to karnataka Jyothi just wanted to be on main stream media that's all she wants Bangalore here I come. Already on my way Jyoti trying to be relevant. Watch her join politics in the next edition of elections. No laws against road rage and auto drivers tho. /s Well half of middle class india is already there Ms/ Mrs Jyothi needs to be evaluated by a psychiatrist Or maybe she's a predator herself and knows that she might be called out if these laws are put in motion. Who knows? Why women have so many commissions who block men's justice? And why men don't have any commissions? Sometimes I think, we should take all the privileges women have and send them back to the kitchen. This is totally outrageous. Men literally have no power in this world. Fucking finally. These laws need to be written VERY CAREFULLY. They should not be vague so that anything goes but they should also be specific enough that people cannot easily misuse them. Buddy, men are raped my other men. Please don't be so narrow in your understanding of the society. Fake cases happen everywhere, that is not a ground to allow men to keep getting raped without being able to file an FIR. Rare Karnataka w? Karnataka has my full support. Finally a state government with 2 brain cells . I think you need to go back and learn comprehension. Good luck 👍🏻 Jyothi is a true Patriot. She doesn't give a fuck about women cutting their partner's dick. You think she doesn't know? She's talking out of her ass. Any idea on how it was made gender neutral? I.e. what the actual wordings are? I couldn't find anything on that. Bravo Karnataka! You're ahead of all Indian states! No pls don't, I don't own the place but just me request. Lol will never happen. I have seen men fighting for women's rights and then women mocking men's issue, living in an entitled world and being real arseholes in general. The real enemy of men is men itself. if anything wont this actually uphold the constitutional value? Jyoti isn't entirely wrong but she should atleast fricking wait to see the proposal and laws first. Including the patriarchal and misogynistic factors, then amendment can be proposed so it's not misused by men, meanwhile men who are actually harmed would get justice - including protection and space for trans men and re instate the 377 law they removed that protected men from SA by other men. 😑😑😑 Whenever anything is put forth, everyone wants to talk and create a ruckus instead of actually seeing the minutia and discussing the points in it. This results in most laws literally screwing people over 😑 Trust me , She Can't Answer that! About time they criminilized marital rape too The new laws to replace IPC have removed section 377, which protected men against rape... We need to bring section 377 back. Because more than 95% of r\\*pes of men, are committed by other men... \"Gender Neutralisation of rape laws and other acts of sexual offences would dilute the laws and deny justice to the aggrieved women.\" men have also been gangraped by women Exactly! W What do you want to know exactly? its about damn time and fuck off Jyoti you ain't the main character Who rapes men? Priveliged women like these pounce on every oppurtunity available to misuse any law they can find. Just some selfish pieces of shit. 1 thing at a time man, be patient Men & Women On what grounds is this injustice even Why? They are rewriting the law, might as well do it in one fell swoop. Someone should really check her history, maybe they find why she is so against it............ Great job! Didn't know Karnataka was a chad state He didnt mean he was against it. Our laws are shitty so if we devote all energy at a time on one thing we will solve problems sooner. When this is done we can go ham on marital rape Based Karnataka Finally a good step I have mostly seen men mocking men’s issue honestly. If a man goes ahead and shares with his male friends that he has been raped or molested, more often than not he becomes a laughing stock, it also has been shown as a funny trope in many movies and shows. If a man wears makeup, I see mostly men abusing him in the social media comment section. Anyway, literally speaking every sexual assault law should be gender neutral. Finally someone talks sense Im so shocked Indian men want marital rape to be legal !!! Who would've thought!!! OMG!!! Take a hike Jyothi Anandasubharao. She was part of CPI, rotten politics But not to specific as it can be used as way to misuse the laws purpose and escape within its cracks, eg a few days a ago read an article where it wasn't considered rape because he hadn't physically penetrait her but was naked and removed her undergarments. Rape in the technical term of the law. Good. Now, is marital rape felonized? About time, i hope the new laws are made with care unlike the prior ones That's why these laws need to be detailed and consider various situations. That's why these laws need to be detailed and consider various situations. But they are woman who rape men, either by drugs, emotional blackmail, it's not just men who rape men. But rape by women if I'm right is not even considered rape by law, if we take movies, men being drugged with aphrodisiac etc are treated comically. Need of the hour!! Okay, if you read up about the history of this, after Nirbhaya there was actually suggestions for gender neutral laws in this regards, but [activists and womens organisations protested against it](https://timesofindia.indiatimes.com/india/activists-join-chorus-against-gender-neutral-rape-laws/articleshow/18840879.cms). Just a few years ago in 2019, the [central government replied to a PIL that we cannot have gender neutral laws in this country](https://www.vice.com/en/article/mb8dey/rape-laws-in-india-cannot-be-gender-neutral-says-ministry-of-home-affairs). What this lady says is the same, it just repeats this positions from earlier. I'd say, we need both martial rape and these gender neutral laws. Yep. But seeing the downvotes, people don't Wang to admit that there's also more number of men who would literally use that law to further abuse women. See how men treat women in online spaces. They literally use AI for revenge porn and do far worse. I didn't even suggest that law shouldn't be made. I said it should hold a provision to prevent a gender known for abuse from abusing it. And still people have a problem. Men want to blame women and feminists for lack of gender equality laws. Blame your own gender for it being unsafe to have gender neutral laws. 🤷🏻‍♀️ What is marital rape ? I kinda support the fake cases excuse because that's what they use to deter male supporting organisation and women on men rape not being called rape and given appropriate punishment. Apart from that, they're only theoretically speaking. Only theoretically, it makes sense to do things one by one. But the ways law is accepted, even getting this proposal accepted would be hard. Adding another clause would make it harder. Just theorising. Correct me if I’m wrong, I agree that’s heinous and the act deserves to be punished, but how is it not an attempted rape and sexual assault and is actual rape? Please include /s if you're kidding, because there's too many actual rapists on reddit Opposition to any acts should be based on clear and valid concerns. The law intends to punish anyone forcing themselves on anyone whichever gender that person or persons are belonging to. I fail to see how that is an injustice. Wah jyoti wah🖕calling society deep rooted patriarchy when there is no judicial protection for men against any allegation by women. Jyoti is actual sex predator when she doesn't want men to get justice when they get raped. It will collapse the institution she build for women who need side income. What do you mean? There are many good looking men who can get raped. I am moving to Kerala and thinking of learning the state language from next day👍 Well it's simple, they are spending so much political capital on changing the rape laws, might as well do the push and make marital rape an offence. This would negate all the opposition from the likes mentioned in the post. W k'taka govt Explain to me what is /s? Yes please. W move by the government!! Don't know about this particular men's right Instagram page but most of the men's rights account on Instagram are very pro BJP and hold Congress for downfall of men's rights in India When election results came most of those pages were expressing their sadness for BJP's loss of seats You don't have to he good looking to be raped /s is a tone indicator of sarcasm you add at the end of a sentence. There are too many stupid people on reddit therefore it's better to indicate if you are being sarcastic. if a 30 year old woman drugs a 19 yr old and he wakes up naked in a shack and sees the woman taking advantage of him, is it not rape? the 19 yr old can't go to court because it is either useless or he will end up going to prison how will it dilute anything? it will just include laws for men. Jyoti seems like a really bad person tbh. She speaks about injustice of women, what about injustice of men which is never reported anywhere and the victims silently suffer ABOUT DAMN TIME This should be implemented all over India.. Average misandrist be like. What about time bringing in a contract for consensual sex. Every time you have to have sex, sign that fing document, both remain safe. He's a troll I'll tell you what will happen. Both feminists and religious conservatives will oppose it and the proposal will be dropped. Having gender involved in making laws in itself doesn't make any sense. Make changes on how arrests are made (women police for women suspects, separate cells for women) but keep laws same for everyone. Stop living in an utopian world. Feminism has in literal become anit men rather than pro equality. And nice ad hominem attack, blame men for everything lol About time to establish SOP before having sex to establish the consent of both parties Do we need to learn Kannada? Subjudice in the Supreme Court. Let them deal Auto correct on karlo bhai🙂 About time rapists stop blaming women for their miserable low life wow......my state has bcm mature......didnt expect it but im damn happy Would be better if you provide the post for the comment. Having sex with your spouse without consent. Why is it only the creepiest and rapiest peeps always fighting to keep rape legal 🤔 hmm I don't care about pro-rape people I would really like for this to happen now. But realistically i expect it after 15-20 years, after some of the old policy makers hit the can. Jyoti is probably projecting 😬 Nope, after them another set of rapists will come to keep rape legal. Why would you not if you're moving to Karnataka? We need to make the definition of rape in 375 so it's not only women that can be victims of rape. It excludes transgenders and men Drugging people is a crime. As is assault >nice ad hominem attack Idt you know what that means Start watching rajnikanth movies Please spread this around the world. Starting with England and it's cohorts, who still refuse to even acknowledge male rape. Thanks. .... That is the standard procedure for the introduction of any law. There is a period for which the public is invited to comment on the proposed law. Its just the center hasn't been doing it. We need to make the definition of rape in 375 so it's not only women that can be victims of rape. It excludes transgenders and men. No need for the creative interpretation of a homophobic law just so there can be a reduced sentence for the offender. They're finally going to punish those who make false rape actuations with prison time? Oh, nope. No equality About time they legalized prenups Wouldn’t that spoil the whole intent of sarcasm :) That's the point I tried to make in OG comment but well. Men are too busy abusing women than caring their protection was stripped away. So 🤷🏻‍♀️ As a feminist, I agree. But some sort of system has to be created to ensure that people don’t misuse such laws. If anyone is found faking rape/ threatening to cause harm if they don’t withdraw the case/ other reasons, straight to jail. Well because everyone’s moving there anyway right? You weren't making a point. You were defending the woman by making malcious arguments >abusing women The woman in question opposes granting the very basic protection of law to men so imma say she deserves it. s And men like you literally abusing women because they're making a point is the reason gender neutral laws in india aren't feasible. Defending the woman? I literally said she has a point but spoke prematurely. And herein lies people like you - men individually target women who don't adhere to their views. Women may say shit about men as a whole but rarely target specific men, esp en masse ganging up. That's evident by reddit. And thank you. You literally are the example here who proved that dumbass woman's point 🤷🏻‍♀️ Why withdrawl? Feminist dictatorship chalegi. But false dowry accusations have shown that there is a precedent to this, because courts don't require a significant burden of evidence in such cases. No need to make ad homynem attacks to someone whose life you know nothing about. Bro it's like asking do I have to learn Hindi if I want to move to New Delhi. My hopes are the new generarion will be mature enough to vote for intellectuals rather than rapists. >literally abusing women Lmao who? >literally said she has a point Yes, that's what defending someone means. >who don't adhere to their views I reserve my right to call people who don't believe in basic human rights whatever I want. If that offends you, you are a part of the problem. >whole but rarely target specific Bruh what is this fanfiction? Where are you coming up with these things? >Im so shocked Indian men want marital rape to be legal !!! Who would've thought!!! OMG!!! That's a good thing though. >Its so interesting no ones whining about fake cases now and using it as an excuse to keep rape legal. Fake cases shouldn't be used as an excuse to keep rape legal. Calling women's experience fanfiction? Lol Yeah, your basic human rights means abuses and further shit for women and more oppression. You can't demand equal responsibility when there's no semblance of equality. While you spew your BS here and then can go safely outside after 7 pm. You literally said she deserves abuses and then say lmao who. Some level of BS. Maybe they should just propose 'No Rape' laws instead? Seems like that'd solve everything. Hoping ain't enough. India is the rape capital of the world and men here are known as \"bob and vagene\". These laws just cement what our culture represents. The degree of sexual assault is of great importance, in deciding the severity of the punishment. A violation of someone's mouth is penalized to a lesser extent than vginal or anl peneration. Because it is less violent and traumatizing. As a man, would you say that being violently penetrated by another man and unable to fight back a more heinous offense, than being coerced into having sex by a woman? I would say so. So if you were a man, would you be fine with only a heterosexual definition of r\\*pe? Even though you are more likely to be assaulted and violated violently by another man in another hole? If there's no definition for the type of assault you have suffered, you will be at a great disadvantage in getting justice. And male children are among worst affected in this case. Bruh I don't even know if you are a woman. If something sounds dumb to me, I am gonna call it out. Terrible people deserve to be abused. Doesnt excuse them just because they are a woman. >safely outside after 7 pm. 80% of murder victims are men. But I am not gonna go there cause there are a million intersectional factors that are much more relevant in determining how safe anybody is. You sound pretty privileged honestly, so don't go around appropriating the struggles of actually marginalized people to win internet points. >literally said she deserves abuses Do you know the meaning of the words 'literally abused'? Cause that's what you said >mouth is penalized to a lesser extent than vginal or anl peneration Where are you coming up with this? Go read 375 ipc >fine with only a heterosexual definition of r*pe? Dude go read the ipc. You have no idea what you are taking about. The ipc doesn't recognize men as victims AND doesn't recognize women as perpetuators except in extremely limited circumstances. Just changing the first part would be more than enough if achieved in the present environment. The IPC is no longer in place since July 1st. The new laws do not protect a man from sodomy by another man....the most probable scenario of a man's r\\*pe. What's the point of only wanting the recognition of a man being \"coerced\" into having sex by a woman, but ignoring the most likely scenario that a man is would face? (aka, assault by another man)? You should be more concerned about the fact that there's no interpretation of male on male SA in the new Bhartiya Nyaya Sanhita...which leaves men with no recourse in most cases of their SA. Meh 375 is rape. Not unnatural offenses. That did not get removed. And it is which should be changed to recognize male victims. Original >A man is said to commit \"rape\" if he—a. penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or (object, body, part, against consent) To >A **person**is said to commit \"rape\" if he— a. penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a **person**or makes her to do so with him or any other person; or Why are y'all so resistant to actually reading wtf you are talking about? > Read the goddamn section ffs. I did not quote the entire thing. I even paraphrased with brackets the rest of it. >I agree that the definition So why are you arguing against me? Because you're also changing the definition of the perpetrator. Duh. R\\*pe is penetrative sexual assault. It can only be done by a man. So using the word \"person\" to define the perpetrator's offence will just lend to confusion and ambiguity. ou will not read the section unless I quote it to you in a reply will you? >inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person; or >(c)manipulates any part of the body of a woman so as to cause penetration into the vagina, urethra, anus or any part of body of such woman or makes her to do so with him or any other person; or >(d)applies his mouth to the vagina, anus, urethra of a woman or makes her to do so with him or any other person, You don't even know what currently the status of the crime of rape is. How are you commenting what is should be in the future? Lol Victim blaming much? Supporting oppressors much? What did the posts text say? I love my friends from Karnataka. But I don't have flair for languages. My brain is not capable of learning a new language. That is the only reason. Trust me, there are tonnes of people like me. Learning a new language is not an easy skill after you are 20 years old. Neurons are not as elastic. And I am definitely not one of those who wants Hindi to be forced on anyone. However, one thing is that most of my Kannada speaking friends are very fluent in Hindi. So far they continue to speak with me in English and Hindi. I was hoping that will continue at a socital level if it is not an inconvenience. This will eventually create an environment where people from rural Karnataka will have to learn either Hindi or English before moving to Bangalore. I know this because this is already happened in Mumbai."
}