{
    "id": "14k7jqz",
    "title": "Vodafone Idea is forcing me to stick with their postpaid plan.",
    "url": "https://www.reddit.com/r/india/comments/14k7jqz/vodafone_idea_is_forcing_me_to_stick_with_their/",
    "selftext": "I want to share my frustrating experience with Vodafone India's customer service. Despite my repeated requests to switch from postpaid to prepaid, they have been stalling the process for a week. Their call center representatives have called me over 50 times, trying to convince me to stick with postpaid. I even tweeted at their customer support and CEO today.\n\n[https://twitter.com/SinghaiApurva/status/1673593505480835073](https://twitter.com/SinghaiApurva/status/1673593505480835073)\n\n[https://twitter.com/SinghaiApurva/status/1673595414535184384](https://twitter.com/SinghaiApurva/status/1673595414535184384)\n\nIt feels like they have no regard for my decision and it's exploitation. Anyone else faced a similar situation?\n\nPlease share my tweets if you can. thanks. \n\nI have been to their store as well but its still not moving ahead. ",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 9,
    "created_utc": 1687853800.0,
    "convurl": "https://external-preview.redd.it/iur_K5oUlyPd0BimoRZUrvzR1mhnsJ_FTf55OZ5ndis.jpg?auto=webp&v=enabled&s=a1f35981897f965eb85e5af5c3d2841709571723",
    "comments": [
        "Apply for MNP. They’ll be begging you and willing to do anything to make you stay.\n\nSMS PORT to 1900",
        "Drop a mail to the grievance officer of VI at : grievanceofficer@vodafoneidea.com\n\nDo inform them that you'll raise this issue with DoT if the request is not processed.",
        "Just go to the gallery and apply for prepaid conversion. If the one in ur area isn't OK with it. Go to the one near ur office. Even then if they are not proceeding with conversion . Then port to another service provider.",
        "Op,  do this. They will call you themselves.",
        "[https://www.trai.gov.in/faqcategory/complaint](https://www.trai.gov.in/faqcategory/complaint)",
        "Port it to jio or airtel... any way VI suck to the core",
        "Only best way.",
        "Go to their offline store. They will also try to make u stay on postpaid but if you firmly say No, they will process the request for conversion to Prepaid. You have to go to the store anyway as they don't do it online afaik.",
        "Go to their offline store. They will also try to make u stay on postpaid but if you firmly say No, they will process the request for conversion to Prepaid. You have to go to the store anyway as they don't do it online afaik.",
        "Thanks a lot. I knew I could count on you.",
        "How to do this? Please explain it step by step.",
        "SMS PORT to 1900\n\nYou’ll get a code through SMS. You can use that code to port your VI number to any other provider like Jio/Airtel. But as you’re happy with the service provided by VI, and don’t plan to change, all you have to do is wait. Within about 24hrs VI people will call you and ask you why you want to port. Just tell them what you’re going through and as a result you want to port to Jio/Airtel. Trust me, they’ll go out of their way to make you stay. All of your grievances will be put on high priority.",
        "Did you port it? I'm in the same position as you."
    ],
    "cleaned_text": "vodafone idea forcing stick postpaid plan want share frustrating experience vodafone indias customer service despite repeated requests switch postpaid prepaid stalling process week call center representatives called times trying convince stick postpaid even tweeted customer support ceo today httpstwittercomsinghaiapurvastatushttpstwittercomsinghaiapurvastatus httpstwittercomsinghaiapurvastatushttpstwittercomsinghaiapurvastatus feels like regard decision exploitation anyone else faced similar situation please share tweets thanks store well still moving ahead ",
    "cleaned_title": "vodafone idea forcing stick postpaid plan",
    "cleaned_selftext": "want share frustrating experience vodafone indias customer service despite repeated requests switch postpaid prepaid stalling process week call center representatives called times trying convince stick postpaid even tweeted customer support ceo today httpstwittercomsinghaiapurvastatushttpstwittercomsinghaiapurvastatus httpstwittercomsinghaiapurvastatushttpstwittercomsinghaiapurvastatus feels like regard decision exploitation anyone else faced similar situation please share tweets thanks store well still moving ahead",
    "cleaned_comments": "apply mnp theyll begging willing anything make stay sms port drop mail grievance officer vi grievanceofficervodafoneideacom inform youll raise issue dot request processed go gallery apply prepaid conversion one ur area isnt ok go one near ur office even proceeding conversion port another service provider op call httpswwwtraigovinfaqcategorycomplainthttpswwwtraigovinfaqcategorycomplaint port jio airtel way vi suck core best way go offline store also try make u stay postpaid firmly say process request conversion prepaid go store anyway dont online afaik go offline store also try make u stay postpaid firmly say process request conversion prepaid go store anyway dont online afaik thanks lot knew could count please explain step step sms port youll get code sms use code port vi number provider like jioairtel youre happy service provided vi dont plan change wait within hrs vi people call ask want port tell youre going result want port jioairtel trust theyll go way make stay grievances put high priority port im position",
    "light_cleaned_title": "Vodafone Idea is forcing me to stick with their postpaid plan.",
    "light_cleaned_selftext": "I want to share my frustrating experience with Vodafone India's customer service. Despite my repeated requests to switch from postpaid to prepaid, they have been stalling the process for a week. Their call center representatives have called me over 50 times, trying to convince me to stick with postpaid. I even tweeted at their customer support and CEO today. [https://twitter.com/SinghaiApurva/status/1673593505480835073](https://twitter.com/SinghaiApurva/status/1673593505480835073) [https://twitter.com/SinghaiApurva/status/1673595414535184384](https://twitter.com/SinghaiApurva/status/1673595414535184384) It feels like they have no regard for my decision and it's exploitation. Anyone else faced a similar situation? Please share my tweets if you can. thanks. I have been to their store as well but its still not moving ahead.",
    "light_cleaned_comments": "Apply for MNP. They’ll be begging you and willing to do anything to make you stay. SMS PORT to 1900 Drop a mail to the grievance officer of VI at : grievanceofficer@vodafoneidea.com Do inform them that you'll raise this issue with DoT if the request is not processed. Just go to the gallery and apply for prepaid conversion. If the one in ur area isn't OK with it. Go to the one near ur office. Even then if they are not proceeding with conversion . Then port to another service provider. Op, do this. They will call you themselves. [https://www.trai.gov.in/faqcategory/complaint](https://www.trai.gov.in/faqcategory/complaint) Port it to jio or airtel... any way VI suck to the core Only best way. Go to their offline store. They will also try to make u stay on postpaid but if you firmly say No, they will process the request for conversion to Prepaid. You have to go to the store anyway as they don't do it online afaik. Go to their offline store. They will also try to make u stay on postpaid but if you firmly say No, they will process the request for conversion to Prepaid. You have to go to the store anyway as they don't do it online afaik. Thanks a lot. I knew I could count on you. How to do this? Please explain it step by step. SMS PORT to 1900 You’ll get a code through SMS. You can use that code to port your VI number to any other provider like Jio/Airtel. But as you’re happy with the service provided by VI, and don’t plan to change, all you have to do is wait. Within about 24hrs VI people will call you and ask you why you want to port. Just tell them what you’re going through and as a result you want to port to Jio/Airtel. Trust me, they’ll go out of their way to make you stay. All of your grievances will be put on high priority. Did you port it? I'm in the same position as you."
}