{
    "id": "14e8g76",
    "title": "Scamming the scamster, but now feeling guilty",
    "url": "https://www.reddit.com/r/india/comments/14e8g76/scamming_the_scamster_but_now_feeling_guilty/",
    "selftext": "So most of you here would be aware of 'like/subscribe and earn' scam going around for sometime now. I usually stay away from such scams but this time, my inquisitive mind and some gem of friends advised me to play along. Although I dont know the repercussions of my adventure, I'll pen them down either way\n\n**A: What exactly is the scam about? (Those who know about the scam may skip this part and directly jump to Para B)**\n\nThe scam is an elaborate scheme of too many things and jargons, and begins with a random number offering you the opportunity to earn money, and after you accept, they start telling you about it. They'll put some screenshots of people receiving money to gain your trust. As soon as you are in, they'll ask you to shift to a more anonymous platform i.e Telegram.\n\nA person will takeover and start directing you to complete certain tasks like subscribing to a channel, and will keep updating your pay counter as you post screenshots. To lure people, the rates at the starting are 50 per subscription, and payout to your account after the amount reaches 150 Rs. This 'per subscription' payment gradually reduces from 50 to 25 to 5 to 1 in a span of 1-2 days (like first and second day, you'll get 50 rs per subscription, and there are about 15-16 channels to subscribe, so calculate accordingly. This amount reduces to 25, 10, 5 etc from third day itself, unless you pay them), so that you get hooked initially. To further get 50 per subscription, they start pitching you their prepaid tasks. Basically, you send them an amount from your bank account (say 1000), and then they send you back (say) 1300, thus making you believe that youve earned Rs 300, and in addition, hike your per subscription rate from measly 1/5/10 to 50 again. This amount increases in steps, as shown in this screenshot- [https://imgur.com/a/jjgqsUe](https://imgur.com/a/jjgqsUe). The money (1300, and 50 per subscription) is duly credited to your account to gain your confidence.\n\nThis prepaid thing is valid only for a day, and you'll have to pay them again to get your per subscription rate hiked to 50 (else they again downgrade it to 10/5 and likewise, frustrating you and prompting you to throw more money)\n\n**B: What happened with me?**\n\nI did receive money from subscribe and earn scheme, though the amount reduced with time. Then I was asked to pay them 1000 rs (and they'll send back 1300, plus hike the rates again to 50/subscribe). As asked by them, I did send 1000 rs and got back 1300, got back in the 50/sub slab. Downgraded a day after, and again got only 5 or 10 per sub. Again paid them 3000, got 3900 back and upgraded to 50 per sub slab. But my luck ran out, when i paid 5000 rs to them (to get 6500 as they promised), and they further asked 23500 rs (by speaking in some gibberish jargon) from me to get 6500 that they promised. I go on, pay them, and get blocked, after losing Rs 28500.\n\n**C: Wait, there's a twist.....**\n\nI aint no fool, buds. I never paid a single penny to them, and faked screenshots of SMS' and Account Statements to make them believe that I did send money to their accounts. Scambros have a unique way of operating where each transaction is routed through a network of separate UPI Ids and bank accounts. Never did I get same UPI from scamsters to direct my payments into, nor did I receive payments from a single UPI ID (All IDs were different). As a result, these guys probably have no way to coordinate and tally the payments, and totally relied on what the victim is sending them (screenshots of UPI app or account statement). So I got paid for their subscription thing, and in addition, 1.3k+4.5k+4.5k (double transaction due to their mistake lol). In the last transaction, they asked for 5000 Rs, i sent them a fake screenshot, and they again asked for 23.5k, i sent them the fake screenshot. This time, however, they did decide to crosscheck the transaction and I was caught. I blocked them soon after.\n\n**D: What do they make you do after taking your money during confidence building phase?**\n\nNothing much, they'll ask you to do some transactions on a Crypto website (which looks fake af, but i'd still commend their HTML/CSS coding skills), and tbh these transactions make no sense at all. A sample of the website is given below. Check for yourself. Opening the website is perfectly fine and it doesnt download any spyware etc. Just dont input any of your data, you can use the credentials I have given below to login. Browse if you want to-\n\n[https://ypcwycupholda.com/#/ucenter](https://ypcwycupholda.com/#/ucenter) User id-  [bebas77128@byorby.com](mailto:bebas77128@byorby.com) ; Pass- abcde12345\n\n**E: How much money did I earn?**\n\nWell, in short, I earned about 12k from the entire saga.\n\nFrom POV of scamster, ideally, he should have incurred a cost of \\~2000-3000 to earn \\~28500, but instead, he ended up losing 12k without earning a dime.\n\nI have invested that money in markets, so that if, by chance, someone claims that money, I would have multiplied it and gave them back. Will not be spending that money for now.\n\n**F: Damage caused?**\n\nAll victories inevitably come at a cost. I did try to fake as much details as I could, there were some details I couldnt fake. The data that they have is my telegram id, full name, bank account no and IFSC code. I deleted messages and screenshots wherever possible, and also deleted the link message between actual phone no and telegram. Changed telegram name and telegram id. While I realize that no one can siphon off money from my account with these details, I fear for some sort of retribution, which I have asked in the questions below. I did receive a call from an unknown no, did not bother to pick up, and not sure if it is related to these guys. But I'm supersure I never gave any phone number in any of the chats\n\n**G: My analysis**\n\n1. The scamsters have no real time mechanism to check for transactions, unless bigger transactions are involved\n2. For the last transaction, he actually gave me out account details of a person, and the account was of ICICI bank in a village in Rajasthan (Jodhpur). These areas (plus some areas in Haryana) are indeed notorious for such scams\n\n**H: I have some questions. I'll be glad if you could answer them, or throw in your views**\n\n1. Are my actions of swindling money from scamsters justified? I do have a sense of guilt, because now there's no difference between me and that scammer sitting on the other end, and I seem to have fallen to their level.\n2. Is it possible that these folks would have insiders (moles) in banks who could rat out my personal details to these ppl, and they could, in some way, seek revenge? My account is in SBI, if that helps, and none of the UPI IDs or banks of scamsters are associated with SBI. I know they cant involve police, but Im honestly concerned if they rope in some Dagdu Dada, Afzal Tonda or Shakeel Yeda to recover their money lol :P\n3. If you were in my place, how would you have spent this money?\n\n**I: Screenshots of chat**\n\nTBH, they are not in order and they wont make any sense to you, so dont bother reading. I'll put some of them here for all the inquisitive hobbits though- [https://imgur.com/a/A1FHwSs](https://imgur.com/a/A1FHwSs)\n\n&#x200B;\n\nPS- I did unsubscribe all the channels that scamster asked me to subscribe to. Buying views to increase reach is not ethical in my opinion /s :P",
    "flair": "Crime",
    "score": 10,
    "num_comments": 0,
    "created_utc": 1687260108.0,
    "convurl": "https://external-preview.redd.it/k6OJLSviD3Fb4eg5XL2yhKX_fOHbDR_MZiEbZdrOibA.jpg?auto=webp&v=enabled&s=8dbd61369e5647be44602c78511affc2e1c853dd",
    "comments": [
        "Happened with me. Lost 41K",
        "Try kar lo. Use a dormant or a disposable account (which you can afford to lose if frozen). Withdraw cash ASAP. Usually scammers ask for account details (Account no and IFSC Code) instead of UPI ID.\nI dont think they have insiders in big banks who can leak your personal data, but just for safety, use a local co op bank account.\nDo not divulge your ph no. If possible cutoff the link between telegram (where they ultimately lure you) and whatsapp (where they first message you) by deleting messages. Theyll just have your full name, bank acc no, by which they cant do anything.\nAlso make sure you delete fake screenshots regularly"
    ],
    "cleaned_text": "scamming scamster feeling guilty would aware likesubscribe earn scam going around sometime usually stay away scams time inquisitive mind gem friends advised play along although dont know repercussions adventure ill pen either way exactly scam know scam may skip part directly jump para b scam elaborate scheme many things jargons begins random number offering opportunity earn money accept start telling theyll put screenshots people receiving money gain trust soon theyll ask shift anonymous platform ie telegram person takeover start directing complete certain tasks like subscribing channel keep updating pay counter post screenshots lure people rates starting per subscription payout account amount reaches rs per subscription payment gradually reduces span days like first second day youll get rs per subscription channels subscribe calculate accordingly amount reduces etc third day unless pay get hooked initially get per subscription start pitching prepaid tasks basically send amount bank account say send back say thus making believe youve earned rs addition hike per subscription rate measly amount increases steps shown screenshot httpsimgurcomajjgqsuehttpsimgurcomajjgqsue money per subscription duly credited account gain confidence prepaid thing valid day youll pay get per subscription rate hiked else downgrade likewise frustrating prompting throw money b happened receive money subscribe earn scheme though amount reduced time asked pay rs theyll send back plus hike rates subscribe asked send rs got back got back sub slab downgraded day got per sub paid got back upgraded per sub slab luck ran paid rs get promised asked rs speaking gibberish jargon get promised go pay get blocked losing rs c wait theres twist aint fool buds never paid single penny faked screenshots sms account statements make believe send money accounts scambros unique way operating transaction routed network separate upi ids bank accounts never get upi scamsters direct payments receive payments single upi id ids different result guys probably way coordinate tally payments totally relied victim sending screenshots upi app account statement got paid subscription thing addition kkk double transaction due mistake lol last transaction asked rs sent fake screenshot asked k sent fake screenshot time however decide crosscheck transaction caught blocked soon make taking money confidence building phase nothing much theyll ask transactions crypto website looks fake af id still commend htmlcss coding skills tbh transactions make sense sample website given check opening website perfectly fine doesnt download spyware etc dont input data use credentials given login browse want httpsypcwycupholdacomucenterhttpsypcwycupholdacomucenter user id bebasbyorbycommailtobebasbyorbycom pass abcde e much money earn well short earned k entire saga pov scamster ideally incurred cost earn instead ended losing k without earning dime invested money markets chance someone claims money would multiplied gave back spending money f damage caused victories inevitably come cost try fake much details could details couldnt fake data telegram id full name bank account ifsc code deleted messages screenshots wherever possible also deleted link message actual phone telegram changed telegram name telegram id realize one siphon money account details fear sort retribution asked questions receive call unknown bother pick sure related guys im supersure never gave phone number chats g analysis scamsters real time mechanism check transactions unless bigger transactions involved last transaction actually gave account details person account icici bank village rajasthan jodhpur areas plus areas haryana indeed notorious scams h questions ill glad could answer throw views actions swindling money scamsters justified sense guilt theres difference scammer sitting end seem fallen level possible folks would insiders moles banks could rat personal details ppl could way seek revenge account sbi helps none upi ids banks scamsters associated sbi know cant involve police im honestly concerned rope dagdu dada afzal tonda shakeel yeda recover money lol p place would spent money screenshots chat tbh order wont make sense dont bother reading ill put inquisitive hobbits though httpsimgurcomaafhwsshttpsimgurcomaafhwss xb ps unsubscribe channels scamster asked subscribe buying views increase reach ethical opinion p ",
    "cleaned_title": "scamming scamster feeling guilty",
    "cleaned_selftext": "would aware likesubscribe earn scam going around sometime usually stay away scams time inquisitive mind gem friends advised play along although dont know repercussions adventure ill pen either way exactly scam know scam may skip part directly jump para b scam elaborate scheme many things jargons begins random number offering opportunity earn money accept start telling theyll put screenshots people receiving money gain trust soon theyll ask shift anonymous platform ie telegram person takeover start directing complete certain tasks like subscribing channel keep updating pay counter post screenshots lure people rates starting per subscription payout account amount reaches rs per subscription payment gradually reduces span days like first second day youll get rs per subscription channels subscribe calculate accordingly amount reduces etc third day unless pay get hooked initially get per subscription start pitching prepaid tasks basically send amount bank account say send back say thus making believe youve earned rs addition hike per subscription rate measly amount increases steps shown screenshot httpsimgurcomajjgqsuehttpsimgurcomajjgqsue money per subscription duly credited account gain confidence prepaid thing valid day youll pay get per subscription rate hiked else downgrade likewise frustrating prompting throw money b happened receive money subscribe earn scheme though amount reduced time asked pay rs theyll send back plus hike rates subscribe asked send rs got back got back sub slab downgraded day got per sub paid got back upgraded per sub slab luck ran paid rs get promised asked rs speaking gibberish jargon get promised go pay get blocked losing rs c wait theres twist aint fool buds never paid single penny faked screenshots sms account statements make believe send money accounts scambros unique way operating transaction routed network separate upi ids bank accounts never get upi scamsters direct payments receive payments single upi id ids different result guys probably way coordinate tally payments totally relied victim sending screenshots upi app account statement got paid subscription thing addition kkk double transaction due mistake lol last transaction asked rs sent fake screenshot asked k sent fake screenshot time however decide crosscheck transaction caught blocked soon make taking money confidence building phase nothing much theyll ask transactions crypto website looks fake af id still commend htmlcss coding skills tbh transactions make sense sample website given check opening website perfectly fine doesnt download spyware etc dont input data use credentials given login browse want httpsypcwycupholdacomucenterhttpsypcwycupholdacomucenter user id bebasbyorbycommailtobebasbyorbycom pass abcde e much money earn well short earned k entire saga pov scamster ideally incurred cost earn instead ended losing k without earning dime invested money markets chance someone claims money would multiplied gave back spending money f damage caused victories inevitably come cost try fake much details could details couldnt fake data telegram id full name bank account ifsc code deleted messages screenshots wherever possible also deleted link message actual phone telegram changed telegram name telegram id realize one siphon money account details fear sort retribution asked questions receive call unknown bother pick sure related guys im supersure never gave phone number chats g analysis scamsters real time mechanism check transactions unless bigger transactions involved last transaction actually gave account details person account icici bank village rajasthan jodhpur areas plus areas haryana indeed notorious scams h questions ill glad could answer throw views actions swindling money scamsters justified sense guilt theres difference scammer sitting end seem fallen level possible folks would insiders moles banks could rat personal details ppl could way seek revenge account sbi helps none upi ids banks scamsters associated sbi know cant involve police im honestly concerned rope dagdu dada afzal tonda shakeel yeda recover money lol p place would spent money screenshots chat tbh order wont make sense dont bother reading ill put inquisitive hobbits though httpsimgurcomaafhwsshttpsimgurcomaafhwss xb ps unsubscribe channels scamster asked subscribe buying views increase reach ethical opinion p",
    "cleaned_comments": "happened lost k try kar lo use dormant disposable account afford lose frozen withdraw cash asap usually scammers ask account details account ifsc code instead upi id dont think insiders big banks leak personal data safety use local co op bank account divulge ph possible cutoff link telegram ultimately lure whatsapp first message deleting messages theyll full name bank acc cant anything also make sure delete fake screenshots regularly",
    "light_cleaned_title": "Scamming the scamster, but now feeling guilty",
    "light_cleaned_selftext": "So most of you here would be aware of 'like/subscribe and earn' scam going around for sometime now. I usually stay away from such scams but this time, my inquisitive mind and some gem of friends advised me to play along. Although I dont know the repercussions of my adventure, I'll pen them down either way **A: What exactly is the scam about? (Those who know about the scam may skip this part and directly jump to Para B)** The scam is an elaborate scheme of too many things and jargons, and begins with a random number offering you the opportunity to earn money, and after you accept, they start telling you about it. They'll put some screenshots of people receiving money to gain your trust. As soon as you are in, they'll ask you to shift to a more anonymous platform i.e Telegram. A person will takeover and start directing you to complete certain tasks like subscribing to a channel, and will keep updating your pay counter as you post screenshots. To lure people, the rates at the starting are 50 per subscription, and payout to your account after the amount reaches 150 Rs. This 'per subscription' payment gradually reduces from 50 to 25 to 5 to 1 in a span of 1-2 days (like first and second day, you'll get 50 rs per subscription, and there are about 15-16 channels to subscribe, so calculate accordingly. This amount reduces to 25, 10, 5 etc from third day itself, unless you pay them), so that you get hooked initially. To further get 50 per subscription, they start pitching you their prepaid tasks. Basically, you send them an amount from your bank account (say 1000), and then they send you back (say) 1300, thus making you believe that youve earned Rs 300, and in addition, hike your per subscription rate from measly 1/5/10 to 50 again. This amount increases in steps, as shown in this screenshot- [https://imgur.com/a/jjgqsUe](https://imgur.com/a/jjgqsUe). The money (1300, and 50 per subscription) is duly credited to your account to gain your confidence. This prepaid thing is valid only for a day, and you'll have to pay them again to get your per subscription rate hiked to 50 (else they again downgrade it to 10/5 and likewise, frustrating you and prompting you to throw more money) **B: What happened with me?** I did receive money from subscribe and earn scheme, though the amount reduced with time. Then I was asked to pay them 1000 rs (and they'll send back 1300, plus hike the rates again to 50/subscribe). As asked by them, I did send 1000 rs and got back 1300, got back in the 50/sub slab. Downgraded a day after, and again got only 5 or 10 per sub. Again paid them 3000, got 3900 back and upgraded to 50 per sub slab. But my luck ran out, when i paid 5000 rs to them (to get 6500 as they promised), and they further asked 23500 rs (by speaking in some gibberish jargon) from me to get 6500 that they promised. I go on, pay them, and get blocked, after losing Rs 28500. **C: Wait, there's a twist.....** I aint no fool, buds. I never paid a single penny to them, and faked screenshots of SMS' and Account Statements to make them believe that I did send money to their accounts. Scambros have a unique way of operating where each transaction is routed through a network of separate UPI Ids and bank accounts. Never did I get same UPI from scamsters to direct my payments into, nor did I receive payments from a single UPI ID (All IDs were different). As a result, these guys probably have no way to coordinate and tally the payments, and totally relied on what the victim is sending them (screenshots of UPI app or account statement). So I got paid for their subscription thing, and in addition, 1.3k+4.5k+4.5k (double transaction due to their mistake lol). In the last transaction, they asked for 5000 Rs, i sent them a fake screenshot, and they again asked for 23.5k, i sent them the fake screenshot. This time, however, they did decide to crosscheck the transaction and I was caught. I blocked them soon after. **D: What do they make you do after taking your money during confidence building phase?** Nothing much, they'll ask you to do some transactions on a Crypto website (which looks fake af, but i'd still commend their HTML/CSS coding skills), and tbh these transactions make no sense at all. A sample of the website is given below. Check for yourself. Opening the website is perfectly fine and it doesnt download any spyware etc. Just dont input any of your data, you can use the credentials I have given below to login. Browse if you want to- [https://ypcwycupholda.com/#/ucenter](https://ypcwycupholda.com/#/ucenter) User id- [bebas77128@byorby.com](mailto:bebas77128@byorby.com) ; Pass- abcde12345 **E: How much money did I earn?** Well, in short, I earned about 12k from the entire saga. From POV of scamster, ideally, he should have incurred a cost of \\~2000-3000 to earn \\~28500, but instead, he ended up losing 12k without earning a dime. I have invested that money in markets, so that if, by chance, someone claims that money, I would have multiplied it and gave them back. Will not be spending that money for now. **F: Damage caused?** All victories inevitably come at a cost. I did try to fake as much details as I could, there were some details I couldnt fake. The data that they have is my telegram id, full name, bank account no and IFSC code. I deleted messages and screenshots wherever possible, and also deleted the link message between actual phone no and telegram. Changed telegram name and telegram id. While I realize that no one can siphon off money from my account with these details, I fear for some sort of retribution, which I have asked in the questions below. I did receive a call from an unknown no, did not bother to pick up, and not sure if it is related to these guys. But I'm supersure I never gave any phone number in any of the chats **G: My analysis** 1. The scamsters have no real time mechanism to check for transactions, unless bigger transactions are involved 2. For the last transaction, he actually gave me out account details of a person, and the account was of ICICI bank in a village in Rajasthan (Jodhpur). These areas (plus some areas in Haryana) are indeed notorious for such scams **H: I have some questions. I'll be glad if you could answer them, or throw in your views** 1. Are my actions of swindling money from scamsters justified? I do have a sense of guilt, because now there's no difference between me and that scammer sitting on the other end, and I seem to have fallen to their level. 2. Is it possible that these folks would have insiders (moles) in banks who could rat out my personal details to these ppl, and they could, in some way, seek revenge? My account is in SBI, if that helps, and none of the UPI IDs or banks of scamsters are associated with SBI. I know they cant involve police, but Im honestly concerned if they rope in some Dagdu Dada, Afzal Tonda or Shakeel Yeda to recover their money lol :P 3. If you were in my place, how would you have spent this money? **I: Screenshots of chat** TBH, they are not in order and they wont make any sense to you, so dont bother reading. I'll put some of them here for all the inquisitive hobbits though- [https://imgur.com/a/A1FHwSs](https://imgur.com/a/A1FHwSs) &#x200B; PS- I did unsubscribe all the channels that scamster asked me to subscribe to. Buying views to increase reach is not ethical in my opinion /s :P",
    "light_cleaned_comments": "Happened with me. Lost 41K Try kar lo. Use a dormant or a disposable account (which you can afford to lose if frozen). Withdraw cash ASAP. Usually scammers ask for account details (Account no and IFSC Code) instead of UPI ID. I dont think they have insiders in big banks who can leak your personal data, but just for safety, use a local co op bank account. Do not divulge your ph no. If possible cutoff the link between telegram (where they ultimately lure you) and whatsapp (where they first message you) by deleting messages. Theyll just have your full name, bank acc no, by which they cant do anything. Also make sure you delete fake screenshots regularly"
}