{
    "id": "15z697g",
    "title": "Irritated watching this annoying, falsifying YouTube ad.",
    "url": "https://www.reddit.com/r/india/comments/15z697g/irritated_watching_this_annoying_falsifying/",
    "selftext": "Just a rant.  \nEvery video I open in youtube, I see this guy's add. Its fucking annoying. He's allegedly from IIT kharagpur and claims highest paid entry level job is of a prompt engineer -\\_- like bruh what about SDEs getting 30-40 LPA. According to him a guy who generates prompts to enter in chatgpt is paid more than anyone else. Also saw his other add where he claims to have used absured (1000+ something lol) amount of AI tools and have researched them all. \n\nThe way he claims all these things is absurd.  \n\n\nSo Irritated watching this ad that am gonna buy premium just to not see his ad.\n\nhttps://preview.redd.it/zlr5nb0ejvjb1.png?width=1654&format=png&auto=webp&s=b614b91474fac5dc145874a5592a35bef667a26c",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692802653.0,
    "convurl": "https://b.thumbs.redditmedia.com/55a-Etn3o8svPzZ6U_kJ3blZ8I7jSmeGZmYV4vRpa1E.jpg",
    "comments": [
        "Use Revanced.",
        "link plox",
        "He is from Can-do generation to attract can-do generation and make them gan-do.",
        "😂😂",
        "use premium i domt even know bout him lol",
        "That piece of s*** President of SA doesn't deserve to be chief guest for past - Indias Republic day.He allowed his race people to attack peaceful, successful people of Indian Origin of, no fault of them - sherr jealousy because they are hard working and successful.",
        "Youtube has ads?",
        "Browse youtube through brave browser,  u will not get any adds",
        "You living under a rock?",
        "Yes, the rock is called youtube premium for which I pay less than a dollar per month.",
        "Use revanced app",
        "I'm using Edge browser and I get no add at all.",
        "Lol if u need to learn prompt just ask the ai",
        "The day they get belted on the street is the day this will stop other idiots are Rajiv talreja Ankur warikoo and there’s Dev or some shit his name is",
        "Or you could do the intelligent thing of browsing on brave for free",
        "How less than a dollar?",
        "Use YouTube Revanced, you will save your time and mental peace.",
        "Who buys premium, adbhut log hain! Just get Newpipe.",
        "plot twist: he is paid by yt to convince people to buy yt premium",
        "Well, this guy was a batchmate. AMA.",
        "Chill & Revance",
        "For PC install malwarebyte extension to chrome. Blocks all tube ads",
        "Was he a chuchomu in college?",
        "Youtube family plan is 189 Rupees a month which can be shared amount 5 people.",
        "College ke time se hi scammer tha ye ?",
        "You guys still watching ads? i gave up on them 8 months back.",
        "Is it true that If your email id is added in the family group, the person can see your contacts and other things?",
        "Newpipe or Youtube Revanced :)",
        "Nope, not possible whatsoever.",
        "He used to make (reportedly well paying) youtube videos even then. Needless to say, no classes entire sem.",
        "Scammer nahi tha. Lekin harkato ko extrapolate kiya jaye toh abhi jonkar rha h kaafi unsurprising hai.",
        "His scripts are so poor and unpolished that it looks like he himself does not use ChatGPT(the product that he is promoting) for his paid marketing efforts.",
        "Bro use ad blocker and chill",
        "Koi nhi, itna naam kama rha",
        "He's my batchmate. I am not surprised by this, though definitely has taken his game a notch higher. Riding on the brand value."
    ],
    "cleaned_text": "irritated watching annoying falsifying youtube ad rant every video open youtube see guys add fucking annoying hes allegedly iit kharagpur claims highest paid entry level job prompt engineer like bruh sdes getting lpa according guy generates prompts enter chatgpt paid anyone else also saw add claims used absured something lol amount ai tools researched way claims things absurd irritated watching ad gon na buy premium see ad ",
    "cleaned_title": "irritated watching annoying falsifying youtube ad",
    "cleaned_selftext": "rant every video open youtube see guys add fucking annoying hes allegedly iit kharagpur claims highest paid entry level job prompt engineer like bruh sdes getting lpa according guy generates prompts enter chatgpt paid anyone else also saw add claims used absured something lol amount ai tools researched way claims things absurd irritated watching ad gon na buy premium see ad",
    "cleaned_comments": "use revanced link plox cando generation attract cando generation make gando use premium domt even know bout lol piece president sa doesnt deserve chief guest past indias republic dayhe allowed race people attack peaceful successful people indian origin fault sherr jealousy hard working successful youtube ads browse youtube brave browser u get adds living rock yes rock called youtube premium pay less dollar per month use revanced app im using edge browser get add lol u need learn prompt ask ai day get belted street day stop idiots rajiv talreja ankur warikoo theres dev shit name could intelligent thing browsing brave free less dollar use youtube revanced save time mental peace buys premium adbhut log hain get newpipe plot twist paid yt convince people buy yt premium well guy batchmate ama chill revance pc install malwarebyte extension chrome blocks tube ads chuchomu college youtube family plan rupees month shared amount people college ke time se hi scammer tha ye guys still watching ads gave months back true email id added family group person see contacts things newpipe youtube revanced nope possible whatsoever used make reportedly well paying youtube videos even needless say classes entire sem scammer nahi tha lekin harkato ko extrapolate kiya jaye toh abhi jonkar rha h kaafi unsurprising hai scripts poor unpolished looks like use chatgptthe product promoting paid marketing efforts bro use ad blocker chill koi nhi itna naam kama rha hes batchmate surprised though definitely taken game notch higher riding brand value",
    "light_cleaned_title": "Irritated watching this annoying, falsifying YouTube ad.",
    "light_cleaned_selftext": "Just a rant. Every video I open in youtube, I see this guy's add. Its fucking annoying. He's allegedly from IIT kharagpur and claims highest paid entry level job is of a prompt engineer -\\_- like bruh what about SDEs getting 30-40 LPA. According to him a guy who generates prompts to enter in chatgpt is paid more than anyone else. Also saw his other add where he claims to have used absured (1000+ something lol) amount of AI tools and have researched them all. The way he claims all these things is absurd. So Irritated watching this ad that am gonna buy premium just to not see his ad.",
    "light_cleaned_comments": "Use Revanced. link plox He is from Can-do generation to attract can-do generation and make them gan-do. 😂😂 use premium i domt even know bout him lol That piece of s*** President of SA doesn't deserve to be chief guest for past - Indias Republic day.He allowed his race people to attack peaceful, successful people of Indian Origin of, no fault of them - sherr jealousy because they are hard working and successful. Youtube has ads? Browse youtube through brave browser, u will not get any adds You living under a rock? Yes, the rock is called youtube premium for which I pay less than a dollar per month. Use revanced app I'm using Edge browser and I get no add at all. Lol if u need to learn prompt just ask the ai The day they get belted on the street is the day this will stop other idiots are Rajiv talreja Ankur warikoo and there’s Dev or some shit his name is Or you could do the intelligent thing of browsing on brave for free How less than a dollar? Use YouTube Revanced, you will save your time and mental peace. Who buys premium, adbhut log hain! Just get Newpipe. plot twist: he is paid by yt to convince people to buy yt premium Well, this guy was a batchmate. AMA. Chill & Revance For PC install malwarebyte extension to chrome. Blocks all tube ads Was he a chuchomu in college? Youtube family plan is 189 Rupees a month which can be shared amount 5 people. College ke time se hi scammer tha ye ? You guys still watching ads? i gave up on them 8 months back. Is it true that If your email id is added in the family group, the person can see your contacts and other things? Newpipe or Youtube Revanced :) Nope, not possible whatsoever. He used to make (reportedly well paying) youtube videos even then. Needless to say, no classes entire sem. Scammer nahi tha. Lekin harkato ko extrapolate kiya jaye toh abhi jonkar rha h kaafi unsurprising hai. His scripts are so poor and unpolished that it looks like he himself does not use ChatGPT(the product that he is promoting) for his paid marketing efforts. Bro use ad blocker and chill Koi nhi, itna naam kama rha He's my batchmate. I am not surprised by this, though definitely has taken his game a notch higher. Riding on the brand value."
}