{
    "id": "153k6z9",
    "title": "Is there any way I could get 'em?",
    "url": "https://www.reddit.com/gallery/153k6z9",
    "selftext": "Heyy people, I just bought these pair of Hola off headphonezone.in. Pretty good sound for the price\n\nI got the seal broken off on the right side, and now the eartips have no support to hold on to the IEM(they're DIRTY, I'm sorry🙃), and they just fall off. \nBut the connecting pins, wires are in very good condition.\n\nPlease let me know if there's any website where I could order just the IEMs, without the wires, pins? Thanks in advance!",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689739728.0,
    "convurl": "https://i.redd.it/1cmfnnlqjucb1.jpg",
    "comments": [
        "A small dab of fewiquik should be enough to hold them."
    ],
    "cleaned_text": "way could get em heyy people bought pair hola headphonezonein pretty good sound price got seal broken right side eartips support hold iemtheyre dirty im sorry fall connecting pins wires good condition please let know theres website could order iems without wires pins thanks advance ",
    "cleaned_title": "way could get em",
    "cleaned_selftext": "heyy people bought pair hola headphonezonein pretty good sound price got seal broken right side eartips support hold iemtheyre dirty im sorry fall connecting pins wires good condition please let know theres website could order iems without wires pins thanks advance",
    "cleaned_comments": "small dab fewiquik enough hold",
    "light_cleaned_title": "Is there any way I could get 'em?",
    "light_cleaned_selftext": "Heyy people, I just bought these pair of Hola off headphonezone.in. Pretty good sound for the price I got the seal broken off on the right side, and now the eartips have no support to hold on to the IEM(they're DIRTY, I'm sorry🙃), and they just fall off. But the connecting pins, wires are in very good condition. Please let me know if there's any website where I could order just the IEMs, without the wires, pins? Thanks in advance!",
    "light_cleaned_comments": "A small dab of fewiquik should be enough to hold them."
}