{
    "id": "145mxg8",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/145mxg8/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=ae6b7a10fa3272821e9904431dab0b993b36aae7",
    "flair": "Scheduled",
    "score": 7,
    "num_comments": 4,
    "created_utc": 1686360609.0,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Hello you gorgeous people,\n I am trying hard to remember a movie name if you could help, it was suggested me by a redditor 2 years back and op has deleted their messages. \n\nA South Indian movie don't know malyalam or Telugu or Tamil watched it with subtitles. \nThe plot was about love from childhood to adult, starts with a kid who likes a girl in class who leaves, then as a teen there is other love story and after that he is working as clerk and loves a lady at workplace, it was a wonderful movie, the climax was the most goosebump part of it where he is talking to his lady on first night talking about all the love he been in through i don't want to give any spoilers, that night power goes and he asks his friend for a generator or something (side comedy part) ....please for the love of movies help with the name... I am restless.\n\nEdit: typos",
        "Started watching Never Have I ever s4",
        "Watched Dahaad. The serial killer part was picked directly from one of the crime patrol episodes. Exact M.O., but the killer was from Maharashtra and targeted poor females that worked around construction sites.\n\nSonakshi Sinha, the guy who played the killer and Gulshan Devaiah were amazing. Much more amazing was the part where they connected the whole story with caste discrimination & women being forced into marriage after a certain age by their families.\n\nBut the biggest problem was the last part where the killer tells his motive. He says that he killed those women because they would easily get into a man and readily slept with them. No where during the whole series was he shown driven by any agenda. He was just a classic psychopath who killed for pleasure. That part just killed the whole series.\n\n+++++++++++\n\nAsur S2 was amazing. Shubh was created as an amazing villain.\n\nWhat was great about this series was that they actually showed Anarchy taking place after India's financial system started collapsing. The villain was taking out future threats to his regime under the guise of mythology using AI.\n\nI mean Fight Club ends where bombs start going off and anarchy begins.\n\nDark Knight Rises shows a bit, but we know if nothing the city which goes into anarchy will explode on day 30. Also most of the focus was on Bruce Wayne.\n\nCaptain America Winter Soldier: Exact same plan by Hydra. Develop a system to detect future threats to regime & eliminate them before hand. But it gets over just as it is about to begin.\n\nSacred Games: Again same plot by the cult. But we never see the anarchy happening if it even happens.\n\n+++++++++++\n\nGumraah: Good movie, one time watch.\n\n+++++++++++\n\nWatched Rang De Basanti again after many years. But this time I watched it from Atul Kulkarni's character POV. It is a beautiful story of a political party worker blinded by hatred for modernity and a specific religion. But when he deep dives into India's freedom struggle as part of acting, realizes the importance of freedom, and meets more people his mind opens up. He starts empathizing more, starts understanding and accepting other people's opinions. In the end stands for what is right even if it means going against his party and leader.",
        "It's \"C/o Kancharapalem\" finally found it."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall ",
    "cleaned_title": "biweekly movies tv shows documentaries podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall",
    "cleaned_comments": "hello gorgeous people trying hard remember movie name could help suggested redditor years back op deleted messages south indian movie dont know malyalam telugu tamil watched subtitles plot love childhood adult starts kid likes girl class leaves teen love story working clerk loves lady workplace wonderful movie climax goosebump part talking lady first night talking love dont want give spoilers night power goes asks friend generator something side comedy part please love movies help name restless edit typos started watching never ever watched dahaad serial killer part picked directly one crime patrol episodes exact mo killer maharashtra targeted poor females worked around construction sites sonakshi sinha guy played killer gulshan devaiah amazing much amazing part connected whole story caste discrimination women forced marriage certain age families biggest problem last part killer tells motive says killed women would easily get man readily slept whole series shown driven agenda classic psychopath killed pleasure part killed whole series asur amazing shubh created amazing villain great series actually showed anarchy taking place indias financial system started collapsing villain taking future threats regime guise mythology using ai mean fight club ends bombs start going anarchy begins dark knight rises shows bit know nothing city goes anarchy explode day also focus bruce wayne captain america winter soldier exact plan hydra develop system detect future threats regime eliminate hand gets begin sacred games plot cult never see anarchy happening even happens gumraah good movie one time watch watched rang de basanti many years time watched atul kulkarnis character pov beautiful story political party worker blinded hatred modernity specific religion deep dives indias freedom struggle part acting realizes importance freedom meets people mind opens starts empathizing starts understanding accepting peoples opinions end stands right even means going party leader co kancharapalem finally found",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Hello you gorgeous people, I am trying hard to remember a movie name if you could help, it was suggested me by a redditor 2 years back and op has deleted their messages. A South Indian movie don't know malyalam or Telugu or Tamil watched it with subtitles. The plot was about love from childhood to adult, starts with a kid who likes a girl in class who leaves, then as a teen there is other love story and after that he is working as clerk and loves a lady at workplace, it was a wonderful movie, the climax was the most goosebump part of it where he is talking to his lady on first night talking about all the love he been in through i don't want to give any spoilers, that night power goes and he asks his friend for a generator or something (side comedy part) ....please for the love of movies help with the name... I am restless. Edit: typos Started watching Never Have I ever s4 Watched Dahaad. The serial killer part was picked directly from one of the crime patrol episodes. Exact M.O., but the killer was from Maharashtra and targeted poor females that worked around construction sites. Sonakshi Sinha, the guy who played the killer and Gulshan Devaiah were amazing. Much more amazing was the part where they connected the whole story with caste discrimination & women being forced into marriage after a certain age by their families. But the biggest problem was the last part where the killer tells his motive. He says that he killed those women because they would easily get into a man and readily slept with them. No where during the whole series was he shown driven by any agenda. He was just a classic psychopath who killed for pleasure. That part just killed the whole series. +++++++++++ Asur S2 was amazing. Shubh was created as an amazing villain. What was great about this series was that they actually showed Anarchy taking place after India's financial system started collapsing. The villain was taking out future threats to his regime under the guise of mythology using AI. I mean Fight Club ends where bombs start going off and anarchy begins. Dark Knight Rises shows a bit, but we know if nothing the city which goes into anarchy will explode on day 30. Also most of the focus was on Bruce Wayne. Captain America Winter Soldier: Exact same plan by Hydra. Develop a system to detect future threats to regime & eliminate them before hand. But it gets over just as it is about to begin. Sacred Games: Again same plot by the cult. But we never see the anarchy happening if it even happens. +++++++++++ Gumraah: Good movie, one time watch. +++++++++++ Watched Rang De Basanti again after many years. But this time I watched it from Atul Kulkarni's character POV. It is a beautiful story of a political party worker blinded by hatred for modernity and a specific religion. But when he deep dives into India's freedom struggle as part of acting, realizes the importance of freedom, and meets more people his mind opens up. He starts empathizing more, starts understanding and accepting other people's opinions. In the end stands for what is right even if it means going against his party and leader. It's \"C/o Kancharapalem\" finally found it."
}