{
    "id": "1edvcuy",
    "title": "Man arrested for raping 14-year-old daughter in Ghaziabad",
    "url": "https://indianexpress.com/article/cities/delhi/man-arrested-for-raping-14-year-old-daughter-in-ghaziabad-9479754/",
    "selftext": "Investigating officials, however, later found out that the father of the girl had been allegedly sexually abusing her for over two years.",
    "flair": "Crime",
    "score": 347,
    "num_comments": 75,
    "created_utc": 1722127913.0,
    "convurl": "https://external-preview.redd.it/1Zb886krogtNPF0Mdv5MJe6xzxnG91pZLNLwGU_EsXk.jpg?auto=webp&s=207a8d46498571cb7997385192013fe038fa426c",
    "comments": [
        "What was the name of culprit?\n\n\nWhy is it hidden? \n\n\n(/sarcasm, but scary how many will think this way) ",
        "His name is golu, a religion neutral name I would say? 🤔",
        "r4pe apologists are currently working on how to twist this one around.",
        "Why does his religion matter? He's a terrible, fucked up individual.",
        "This country doesn't deserve its women, and it shows, only 37% of women participate in the economy, while veitnam and China as 78% and 76% respectively. \n\nYet people somehow think that we will magically become a super power and all our problems will disappear.",
        "Exactly",
        "Name and shame him and chop his arms off, so he can never touch another female in his life and broadcast his life widely so people know what’ll happen to them \n\n\nAnd in schools, stuff physics and useless chemistry and maths equations\n\nTeach men how to behave and show respect to women, in a country that says atidhi devo bhava can’t even show proper respect to women and girls \n\nMake respect and behaviours towards women a pet of curriculum",
        "The sad part is even if we become an economic superpower, the top 1% will control 95% of the wealth and most of them are men, so women will rarely get to enjoy the benefits of economic growth \n\nThe poverty line gets bigger and bigger while income gap wider \n\nI was reading the other day, while ambanis were busy spending 600 million odd for their wedding, they made 25k crores in the same time period, that’s how distorted our economy is, now rich can make money by almost doing nothing while poor and middle class people get affected",
        "a muslim man and his wife in my area got arrested 2 weeks ago cause he was raping his teenage daughter for some years, and the sickening thing is that his wife knew it all, their neighbours somehow suspected them and called the police, they had 6 children and all of them were kicked out by the landlord after this incident, poor kids :/",
        "I mean last 10-15 years standard of living has hardly increased for most people while the GDP numbers keep going up.",
        "Name,race, religion doesn't matter, the only thing that matter is his upbringing and from which type of environment he was been raised.\n\nIf I have a power to give punishment to these type of bastards I will do following things to him.\n\n1. We will give him women's hormonal medicine to him for 1-2 year constant. I don't know the time period in real scenarios.\n\n2. And when he show the signs like women we will operate him and chop off his penis and make a pussy like doctors do in Male to Female transformation operation.\n\n3. We give hime silicone boobs.\n\n4. Cosmetic surgery on face and other parts to make him very beautiful.\n\nAfter finishing the procedure within 3-4 years we will send him to men's jail where anyone can rape him in both the holes. or make him prostiute.\n\nAll the expenses will come by selling his property or forcing him into prostitution businees. This way I want to punish these animals. Sorry If I over exaggerated.",
        "What about false convictions? They’ll be punished for no reason( and don’t try to deny that there are fake rape cases) but yeah in this case this maybe but I can’t think in that way",
        "Exactly, but we live in a denegrated society where everything and anything is connected with the religion of the culprit.",
        "In false rape accusations cases a very detailed investigation will be needed. CBI, foerenscis, lie detector whatever needed will be done for truth to be come out for both the parties.",
        "SHUT THE FUCK UP",
        "Yeah I agree but unfortunately there are very few cases which actually garner that much attention for a thorough investigation to happen. Also polygraph tests have been proven to be inaccurate.",
        "amritkaal somehow",
        "https://preview.redd.it/rm5po4c9u6fd1.jpeg?width=941&format=pjpg&auto=webp&s=0badb7ec33fbf819e15e5883001c7bc0dddbce1b",
        "well, punishment for criminals is not to take revenge but to reform the criminal and deter others from committing crime",
        "Standard of living has actually gone down for the majority. ",
        ">Make respect and behaviours towards women a part of curriculum\n\nall are taught to respect everyone",
        "Bears don't r@pe their cubs",
        "Horrifying",
        "well well no name surname.. lemme guess... bindus at their best?",
        "How the fuck does that matter? Stop bringing religion everywhere.",
        " B man bhu it",
        "lmao don't be naive brother everyone knows the game",
        "What's the game you are reminded of when you see a father raping his daughter?",
        "think separately think about the condemning game, media game, hate game literally everything when the players change.. i know that you know and for reference  u don't even have to dig deep.",
        "and people were offended at that men vs bear meme.  \nwhere are all alphas, beta, chigma",
        "Sorry I am out of the loop, what's the meme?",
        "What will be the punishment for...fake r*pe accuser... Can you elaborate...",
        "Most of these women also work in farms and other low paying jobs. Women lfpr has increased because of the distress in the economy after covid. Which sadly we still haven't recovered from.",
        "Not enough",
        "I had already answered that. Deep investigation. See above my comment.",
        "No I'm asking...what will be the punishment for fake case...what will be done to women...who had filed fake case against a man...\n\ndo you know there is less 30% conviction rate of rape cases...it means about 70% cases are fake... even though burden of proof lies on man...means he has to prove himself innocent...till than he is treated as guilty...\n\nWomen have to just accuse...no evidence needed... \n\nI'm not saying that women do not suffer ...but please have some sympathy for man who are being harassed by these laws...",
        "I was looking at the global hunger index and India was at 111 out of 125 countries and the charts have been kind of stagnant since 2015. What's surprising is all our neighbours, even Pakistan, are above us and here our government claims nobody in India is going to bed hungry.",
        "Superpower. Sure.",
        "Lie detector tests are famously unreliable.",
        "Getting into her history”= slut shaming in this country \nA few decades ago, a teen girl was raped by cops at a police station. The court ruled that because a two finger test (which has no scientific value btw) proved that she was accustomed to sex and therefore there could not be any rape. 🤡",
        "Women in India: baby factories",
        "70% cases aren’t fake- conviction rates are just low for most crimes in India due to shoddy investigation, lack of forensic involvement and prosecutorial apathy.",
        "in some religion thats acceptable",
        "Sexual abuse of your own daughter?",
        "Reform?\n\n\nA man who raped his own daughter can be reformed?\n\n\nWhy do we have the death sentence then? \n\n\nCould Nirbhaya rapists be reformed?",
        "Real wages of both informal workers and farmers aren't growing.",
        "\nYeah I agree with you about conviction and laws of India but I was just strictly talking about those pedos whom do not have integrity who does not care about concern and in this case he was her father. The punishment I suggested was for his father. \n\n\nSorry if everybody misunderstood that was not my intent I was so much angry after reading that.\n\n\nAnd about those woman who files fake rape cases there should be a strict law about that too. I am not feminist and I have total empathy towards those guys whom are facing fake rape cases and fake dowry cases. It all about personalities and upbringing my comment was not on men or women. I was taking in general. Everybody has a personality like introvert or psychopath. They should be punished whether the act is carried out by men or women.\n\n\nI was clearly talking about this matter only and I was talking about those narcissist and true villains who want something from others and they take it forcibly and also do not care what others feels.\n\n\nLaw must be followed with integrity in every case. But I forgot this is India 😔\n\n\nPardon my english hope you understand.",
        "Might be ur religion because I havent heard of any other.",
        "India is a failed state",
        "He is a shame for father. I am so protective of my kids. As a father my heart aches for the girl. I want to ki// this man.",
        "What any logical person would see: One psychopaths actions on a poor victim.\n\nWhat redditors see: men this... That.... The bear would be better... India doesn't deserve it's women... Blah blah...\n\nStop turning this into a gender debate.",
        "You forgot religion. Some people on Reddit also try to find out the religion of the psychopath and then love to debate on religion lol.",
        "actually men do this too. they blame entire gender for an individual's mistake. you remember that one case of jyoti maurya? there were no right and wrongs in that case but still men trolled and blamed all women over internet.. and promoted things like 'beti parhao wife nahi'.\n\nso yeah women will do the same to men... infact male criminals are way more than female criminals",
        "This title got worse and worse with every passing word",
        "Hmmm. Kill it with fire.",
        "Again men do this... Women do that.... Wtf.\nPsychopath are gonna do what psychopaths do best.... Regardless of gender.",
        "brahma and saraswati?",
        "Animals like them shouldn't even be killed. They should be tortured until the end of their lives. Death is a gift for them!\n\nEvery child deserves a parent but not every parent deserves a child.\n\nLaws in India favour women. But the problem is many women aren't even aware about it. Also sex education is absent in India. Poor child.",
        "Not a bad argument but not the right place/post.",
        "The only false convictions are that men in India have empathy for women. Cause they don’t. ",
        "I mean, the wives, mothers and daughters of the rich guy will get to enjoy that wealth. Nita Ambani is enjoying her family’s wealth.",
        "Where are you getting such a pessimistic view from? Just look at the number of automobiles on the roads today vs 15 years ago. People’s purchasing power has gone up. People are out there buying iphones, air travel has grown several fold.",
        "An incident of this type incident can be found in almost every country. This incident sickening, but this doesn’t mean the country is a failed state",
        "You’re talking about the select few, I’m talking about the opportunities for females in India and it’s always an uphill battle",
        "Lol really? Our consumption expenditure grew at 4 percent. Real wages of both farmers and in informal sectors haven't grown, just because your rich friends are buying an iphone doesn't mean everything is alright. More than 50 percent of children are suffering from chronic malnutrition. Don't live under a rock dude. As a developing country obviously we will grow, but we are leaving a large chunk of the population behind.",
        "Why everybody going off topic ? i was talking in these case matter only. 2 or 3 people are trying to prove me feminist. \n\n\n\nsome is trying to say i am encoraging the rape. Why the hell you people are commenting like andhbhakts? what is the name of this post ? huh ? \"Man arrested for raping 12 year daughter\" so whatever i had written was in this context, people like this man who rapes his own daughter is not a human being, he is true evil \n\n\n\nand there more like these people remeber nirbhaya ? and some pedophiles even kill the kids ? i am strictly talking about these type of animals who do not care about the victim.\n\n\n\nnobody was talking about justice to the child, and some people are seeing this as very intense or extreme comment. The people who are comment did not even mention about this case they were asking about what about fake rape cases ? fake rape cases is not the topic here buddy ?  and no i am not encouraging the rape culture. I only want to the **same unpleasant experience** to that animals. and that what i had said in the very 1st comment of mine.  but it seems nowdays people just want to comment like andhbhakts just to derails the subject. and now anyone asks me about fake rape cases I will ask what about this case buddy.",
        "you cannot reform a psychopath or narcissist person. and despite that i want to agree with you so please give us any nice ideas that how to reform this type of animals. or any ideal ways to do reforming.",
        "Get out of your victim mentality... please my princess ...this is the reality in 2013...even majority of them were not rape... simply revenge...now fake rape cases have increased due to social media and scammers getting awareness\n\nhttps://preview.redd.it/quss8t8bfifd1.png?width=624&format=pjpg&auto=webp&s=044fe8a4137f8398af4438eb7a6d9b3ae9bd5037"
    ],
    "cleaned_text": "man arrested raping yearold daughter ghaziabad investigating officials however later found father girl allegedly sexually abusing two years ",
    "cleaned_title": "man arrested raping yearold daughter ghaziabad",
    "cleaned_selftext": "investigating officials however later found father girl allegedly sexually abusing two years",
    "cleaned_comments": "name culprit hidden sarcasm scary many think way name golu religion neutral name would say rpe apologists currently working twist one around religion matter hes terrible fucked individual country doesnt deserve women shows women participate economy veitnam china respectively yet people somehow think magically become super power problems disappear exactly name shame chop arms never touch another female life broadcast life widely people know whatll happen schools stuff physics useless chemistry maths equations teach men behave show respect women country says atidhi devo bhava cant even show proper respect women girls make respect behaviours towards women pet curriculum sad part even become economic superpower top control wealth men women rarely get enjoy benefits economic growth poverty line gets bigger bigger income gap wider reading day ambanis busy spending million odd wedding made k crores time period thats distorted economy rich make money almost nothing poor middle class people get affected muslim man wife area got arrested weeks ago cause raping teenage daughter years sickening thing wife knew neighbours somehow suspected called police children kicked landlord incident poor kids mean last years standard living hardly increased people gdp numbers keep going namerace religion doesnt matter thing matter upbringing type environment raised power give punishment type bastards following things give womens hormonal medicine year constant dont know time period real scenarios show signs like women operate chop penis make pussy like doctors male female transformation operation give hime silicone boobs cosmetic surgery face parts make beautiful finishing procedure within years send mens jail anyone rape holes make prostiute expenses come selling property forcing prostitution businees way want punish animals sorry exaggerated false convictions theyll punished reason dont try deny fake rape cases yeah case maybe cant think way exactly live denegrated society everything anything connected religion culprit false rape accusations cases detailed investigation needed cbi foerenscis lie detector whatever needed done truth come parties shut fuck yeah agree unfortunately cases actually garner much attention thorough investigation happen also polygraph tests proven inaccurate amritkaal somehow well punishment criminals take revenge reform criminal deter others committing crime standard living actually gone majority make respect behaviours towards women part curriculum taught respect everyone bears dont rpe cubs horrifying well well name surname lem guess bindus best fuck matter stop bringing religion everywhere b man bhu lmao dont naive brother everyone knows game whats game reminded see father raping daughter think separately think condemning game media game hate game literally everything players change know know reference u dont even dig deep people offended men vs bear meme alphas beta chigma sorry loop whats meme punishment forfake rpe accuser elaborate women also work farms low paying jobs women lfpr increased distress economy covid sadly still havent recovered enough already answered deep investigation see comment im askingwhat punishment fake casewhat done womenwho filed fake case man know less conviction rate rape casesit means cases fake even though burden proof lies manmeans prove innocenttill treated guilty women accuseno evidence needed im saying women suffer please sympathy man harassed laws looking global hunger index india countries charts kind stagnant since whats surprising neighbours even pakistan us government claims nobody india going bed hungry superpower sure lie detector tests famously unreliable getting history slut shaming country decades ago teen girl raped cops police station court ruled two finger test scientific value btw proved accustomed sex therefore could rape women india baby factories cases arent fake conviction rates low crimes india due shoddy investigation lack forensic involvement prosecutorial apathy religion thats acceptable sexual abuse daughter reform man raped daughter reformed death sentence could nirbhaya rapists reformed real wages informal workers farmers arent growing yeah agree conviction laws india strictly talking pedos integrity care concern case father punishment suggested father sorry everybody misunderstood intent much angry reading woman files fake rape cases strict law feminist total empathy towards guys facing fake rape cases fake dowry cases personalities upbringing comment men women taking general everybody personality like introvert psychopath punished whether act carried men women clearly talking matter talking narcissist true villains want something others take forcibly also care others feels law must followed integrity every case forgot india pardon english hope understand might ur religion havent heard india failed state shame father protective kids father heart aches girl want ki man logical person would see one psychopaths actions poor victim redditors see men bear would better india doesnt deserve women blah blah stop turning gender debate forgot religion people reddit also try find religion psychopath love debate religion lol actually men blame entire gender individuals mistake remember one case jyoti maurya right wrongs case still men trolled blamed women internet promoted things like beti parhao wife nahi yeah women men infact male criminals way female criminals title got worse worse every passing word hmmm kill fire men women wtf psychopath gon na psychopaths best regardless gender brahma saraswati animals like shouldnt even killed tortured end lives death gift every child deserves parent every parent deserves child laws india favour women problem many women arent even aware also sex education absent india poor child bad argument right placepost false convictions men india empathy women cause dont mean wives mothers daughters rich guy get enjoy wealth nita ambani enjoying familys wealth getting pessimistic view look number automobiles roads today vs years ago peoples purchasing power gone people buying iphones air travel grown several fold incident type incident found almost every country incident sickening doesnt mean country failed state youre talking select im talking opportunities females india always uphill battle lol really consumption expenditure grew percent real wages farmers informal sectors havent grown rich friends buying iphone doesnt mean everything alright percent children suffering chronic malnutrition dont live rock dude developing country obviously grow leaving large chunk population behind everybody going topic talking case matter people trying prove feminist trying say encoraging rape hell people commenting like andhbhakts name post huh man arrested raping year daughter whatever written context people like man rapes daughter human true evil like people remeber nirbhaya pedophiles even kill kids strictly talking type animals care victim nobody talking justice child people seeing intense extreme comment people comment even mention case asking fake rape cases fake rape cases topic buddy encouraging rape culture want unpleasant experience animals said st comment mine seems nowdays people want comment like andhbhakts derails subject anyone asks fake rape cases ask case buddy reform psychopath narcissist person despite want agree please give us nice ideas reform type animals ideal ways reforming get victim mentality please princess reality even majority rape simply revengenow fake rape cases increased due social media scammers getting awareness",
    "light_cleaned_title": "Man arrested for raping 14-year-old daughter in Ghaziabad",
    "light_cleaned_selftext": "Investigating officials, however, later found out that the father of the girl had been allegedly sexually abusing her for over two years.",
    "light_cleaned_comments": "What was the name of culprit? Why is it hidden? (/sarcasm, but scary how many will think this way) His name is golu, a religion neutral name I would say? 🤔 r4pe apologists are currently working on how to twist this one around. Why does his religion matter? He's a terrible, fucked up individual. This country doesn't deserve its women, and it shows, only 37% of women participate in the economy, while veitnam and China as 78% and 76% respectively. Yet people somehow think that we will magically become a super power and all our problems will disappear. Exactly Name and shame him and chop his arms off, so he can never touch another female in his life and broadcast his life widely so people know what’ll happen to them And in schools, stuff physics and useless chemistry and maths equations Teach men how to behave and show respect to women, in a country that says atidhi devo bhava can’t even show proper respect to women and girls Make respect and behaviours towards women a pet of curriculum The sad part is even if we become an economic superpower, the top 1% will control 95% of the wealth and most of them are men, so women will rarely get to enjoy the benefits of economic growth The poverty line gets bigger and bigger while income gap wider I was reading the other day, while ambanis were busy spending 600 million odd for their wedding, they made 25k crores in the same time period, that’s how distorted our economy is, now rich can make money by almost doing nothing while poor and middle class people get affected a muslim man and his wife in my area got arrested 2 weeks ago cause he was raping his teenage daughter for some years, and the sickening thing is that his wife knew it all, their neighbours somehow suspected them and called the police, they had 6 children and all of them were kicked out by the landlord after this incident, poor kids :/ I mean last 10-15 years standard of living has hardly increased for most people while the GDP numbers keep going up. Name,race, religion doesn't matter, the only thing that matter is his upbringing and from which type of environment he was been raised. If I have a power to give punishment to these type of bastards I will do following things to him. 1. We will give him women's hormonal medicine to him for 1-2 year constant. I don't know the time period in real scenarios. 2. And when he show the signs like women we will operate him and chop off his penis and make a pussy like doctors do in Male to Female transformation operation. 3. We give hime silicone boobs. 4. Cosmetic surgery on face and other parts to make him very beautiful. After finishing the procedure within 3-4 years we will send him to men's jail where anyone can rape him in both the holes. or make him prostiute. All the expenses will come by selling his property or forcing him into prostitution businees. This way I want to punish these animals. Sorry If I over exaggerated. What about false convictions? They’ll be punished for no reason( and don’t try to deny that there are fake rape cases) but yeah in this case this maybe but I can’t think in that way Exactly, but we live in a denegrated society where everything and anything is connected with the religion of the culprit. In false rape accusations cases a very detailed investigation will be needed. CBI, foerenscis, lie detector whatever needed will be done for truth to be come out for both the parties. SHUT THE FUCK UP Yeah I agree but unfortunately there are very few cases which actually garner that much attention for a thorough investigation to happen. Also polygraph tests have been proven to be inaccurate. amritkaal somehow well, punishment for criminals is not to take revenge but to reform the criminal and deter others from committing crime Standard of living has actually gone down for the majority. >Make respect and behaviours towards women a part of curriculum all are taught to respect everyone Bears don't r@pe their cubs Horrifying well well no name surname.. lemme guess... bindus at their best? How the fuck does that matter? Stop bringing religion everywhere. B man bhu it lmao don't be naive brother everyone knows the game What's the game you are reminded of when you see a father raping his daughter? think separately think about the condemning game, media game, hate game literally everything when the players change.. i know that you know and for reference u don't even have to dig deep. and people were offended at that men vs bear meme. where are all alphas, beta, chigma Sorry I am out of the loop, what's the meme? What will be the punishment for...fake r*pe accuser... Can you elaborate... Most of these women also work in farms and other low paying jobs. Women lfpr has increased because of the distress in the economy after covid. Which sadly we still haven't recovered from. Not enough I had already answered that. Deep investigation. See above my comment. No I'm asking...what will be the punishment for fake case...what will be done to women...who had filed fake case against a man... do you know there is less 30% conviction rate of rape cases...it means about 70% cases are fake... even though burden of proof lies on man...means he has to prove himself innocent...till than he is treated as guilty... Women have to just accuse...no evidence needed... I'm not saying that women do not suffer ...but please have some sympathy for man who are being harassed by these laws... I was looking at the global hunger index and India was at 111 out of 125 countries and the charts have been kind of stagnant since 2015. What's surprising is all our neighbours, even Pakistan, are above us and here our government claims nobody in India is going to bed hungry. Superpower. Sure. Lie detector tests are famously unreliable. Getting into her history”= slut shaming in this country A few decades ago, a teen girl was raped by cops at a police station. The court ruled that because a two finger test (which has no scientific value btw) proved that she was accustomed to sex and therefore there could not be any rape. 🤡 Women in India: baby factories 70% cases aren’t fake- conviction rates are just low for most crimes in India due to shoddy investigation, lack of forensic involvement and prosecutorial apathy. in some religion thats acceptable Sexual abuse of your own daughter? Reform? A man who raped his own daughter can be reformed? Why do we have the death sentence then? Could Nirbhaya rapists be reformed? Real wages of both informal workers and farmers aren't growing. Yeah I agree with you about conviction and laws of India but I was just strictly talking about those pedos whom do not have integrity who does not care about concern and in this case he was her father. The punishment I suggested was for his father. Sorry if everybody misunderstood that was not my intent I was so much angry after reading that. And about those woman who files fake rape cases there should be a strict law about that too. I am not feminist and I have total empathy towards those guys whom are facing fake rape cases and fake dowry cases. It all about personalities and upbringing my comment was not on men or women. I was taking in general. Everybody has a personality like introvert or psychopath. They should be punished whether the act is carried out by men or women. I was clearly talking about this matter only and I was talking about those narcissist and true villains who want something from others and they take it forcibly and also do not care what others feels. Law must be followed with integrity in every case. But I forgot this is India 😔 Pardon my english hope you understand. Might be ur religion because I havent heard of any other. India is a failed state He is a shame for father. I am so protective of my kids. As a father my heart aches for the girl. I want to ki// this man. What any logical person would see: One psychopaths actions on a poor victim. What redditors see: men this... That.... The bear would be better... India doesn't deserve it's women... Blah blah... Stop turning this into a gender debate. You forgot religion. Some people on Reddit also try to find out the religion of the psychopath and then love to debate on religion lol. actually men do this too. they blame entire gender for an individual's mistake. you remember that one case of jyoti maurya? there were no right and wrongs in that case but still men trolled and blamed all women over internet.. and promoted things like 'beti parhao wife nahi'. so yeah women will do the same to men... infact male criminals are way more than female criminals This title got worse and worse with every passing word Hmmm. Kill it with fire. Again men do this... Women do that.... Wtf. Psychopath are gonna do what psychopaths do best.... Regardless of gender. brahma and saraswati? Animals like them shouldn't even be killed. They should be tortured until the end of their lives. Death is a gift for them! Every child deserves a parent but not every parent deserves a child. Laws in India favour women. But the problem is many women aren't even aware about it. Also sex education is absent in India. Poor child. Not a bad argument but not the right place/post. The only false convictions are that men in India have empathy for women. Cause they don’t. I mean, the wives, mothers and daughters of the rich guy will get to enjoy that wealth. Nita Ambani is enjoying her family’s wealth. Where are you getting such a pessimistic view from? Just look at the number of automobiles on the roads today vs 15 years ago. People’s purchasing power has gone up. People are out there buying iphones, air travel has grown several fold. An incident of this type incident can be found in almost every country. This incident sickening, but this doesn’t mean the country is a failed state You’re talking about the select few, I’m talking about the opportunities for females in India and it’s always an uphill battle Lol really? Our consumption expenditure grew at 4 percent. Real wages of both farmers and in informal sectors haven't grown, just because your rich friends are buying an iphone doesn't mean everything is alright. More than 50 percent of children are suffering from chronic malnutrition. Don't live under a rock dude. As a developing country obviously we will grow, but we are leaving a large chunk of the population behind. Why everybody going off topic ? i was talking in these case matter only. 2 or 3 people are trying to prove me feminist. some is trying to say i am encoraging the rape. Why the hell you people are commenting like andhbhakts? what is the name of this post ? huh ? \"Man arrested for raping 12 year daughter\" so whatever i had written was in this context, people like this man who rapes his own daughter is not a human being, he is true evil and there more like these people remeber nirbhaya ? and some pedophiles even kill the kids ? i am strictly talking about these type of animals who do not care about the victim. nobody was talking about justice to the child, and some people are seeing this as very intense or extreme comment. The people who are comment did not even mention about this case they were asking about what about fake rape cases ? fake rape cases is not the topic here buddy ? and no i am not encouraging the rape culture. I only want to the **same unpleasant experience** to that animals. and that what i had said in the very 1st comment of mine. but it seems nowdays people just want to comment like andhbhakts just to derails the subject. and now anyone asks me about fake rape cases I will ask what about this case buddy. you cannot reform a psychopath or narcissist person. and despite that i want to agree with you so please give us any nice ideas that how to reform this type of animals. or any ideal ways to do reforming. Get out of your victim mentality... please my princess ...this is the reality in 2013...even majority of them were not rape... simply revenge...now fake rape cases have increased due to social media and scammers getting awareness"
}