{
    "id": "1cbzq1v",
    "title": "Great News!! Tamilnadu is at the brink of eliminating elephantiasis",
    "url": "https://www.thehindu.com/news/cities/chennai/tn-now-closer-to-elimination-of-filariasis/article68072326.ece",
    "selftext": "Filariasis or elephantiasis is a parasitic disease caused by roundworms that are transmitted by the bites of infected mosquitoes. It is also known as lymphatic filariasis (LF) or elephantiasis. Filariasis is the second-largest cause of permanent disability worldwide, after leprosy. \n\nLet's congratulate the government's health policy that lead to this herculean fear.\n",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 0,
    "created_utc": 1713969140.0,
    "convurl": "https://external-preview.redd.it/QtMLZjEFRzRJsBT_BijbDUrd4aFSuHtE9Yhr81Be1cw.jpg?auto=webp&s=c15e5a88a1563138b04d98a51c84ae380cd63ee0",
    "comments": [],
    "cleaned_text": "great news tamilnadu brink eliminating elephantiasis filariasis elephantiasis parasitic disease caused roundworms transmitted bites infected mosquitoes also known lymphatic filariasis lf elephantiasis filariasis secondlargest cause permanent disability worldwide leprosy lets congratulate governments health policy lead herculean fear ",
    "cleaned_title": "great news tamilnadu brink eliminating elephantiasis",
    "cleaned_selftext": "filariasis elephantiasis parasitic disease caused roundworms transmitted bites infected mosquitoes also known lymphatic filariasis lf elephantiasis filariasis secondlargest cause permanent disability worldwide leprosy lets congratulate governments health policy lead herculean fear",
    "cleaned_comments": "",
    "light_cleaned_title": "Great News!! Tamilnadu is at the brink of eliminating elephantiasis",
    "light_cleaned_selftext": "Filariasis or elephantiasis is a parasitic disease caused by roundworms that are transmitted by the bites of infected mosquitoes. It is also known as lymphatic filariasis (LF) or elephantiasis. Filariasis is the second-largest cause of permanent disability worldwide, after leprosy. Let's congratulate the government's health policy that lead to this herculean fear.",
    "light_cleaned_comments": ""
}