{
    "id": "1d6fjxq",
    "title": "mint: Day after polls, highway authority hikes rates by 3-5% across 1100 toll plazas",
    "url": "https://www.livemint.com/news/india/day-after-polls-highway-authority-hikes-rates-by-3-5-across-1-100-toll-plazas-11717332421144.html",
    "selftext": "Day after polls, highway authority hikes rates by 3-5% across 1100 toll plazas",
    "flair": "Policy/Economy",
    "score": 273,
    "num_comments": 20,
    "created_utc": 1717341380.0,
    "convurl": "https://external-preview.redd.it/bLHrbWFEKjaZQ5qj6kqqGqkbOXDNasiXQuTkJZU_aNA.jpg?auto=webp&s=2c6305c15fd284bb0765e861871831bd7d807eed",
    "comments": [
        "Ha ha ha....keep voting for the same clowns and keep having the same tricks played on you ",
        "Godiji meditated for 45hrs to see if this hike will help Bharat in the future. During his deep meditation and time travel, he found that this will help us 748 years later. He's truly a gift of god. /s",
        "Sher pala hai toh…",
        "Half truth. Not this hike alone. Forthcoming hike in mobile plan, petrol, LPG, ATF (jet fuel), CNG etc.",
        "It's just the beginning. Petrol is going up around 10% within a month. Old tax regime will not be an option for new tax payers within a year or two. Brutal censorship will be enforced once new broadcast law is fully adapted. The third term will be the 21st century's Third Reich. Fasten your seat belts. We have a ride through hell.",
        "Why doesn't Adani Ji just create a GoFundMe in order to become the richest person in the world? All this show of governance, taxation, loans, bidding wars, it's just too cumbersome and we don't clearly know if our money is reaching Adani Ji. /s",
        "Amul hiked milk prices by 2 rupees already.",
        "Chanting JSR will make hell less painful /s",
        "Honest question, how is India to continuer to advance and increase economic prosperity without taxation from the government",
        "And so it begins....prices of more items will be hiked .",
        "Retrieve the money the biggest bank defaulters (majority are Gujaratis) and use that money instead of leeching the middle-class.",
        "Thanks NDA voters. Also, F**K YOU!",
        "Has it been done before anywhere?",
        "Tbh I will be glad if old tax regime is gone. I already pay less in new tax regime and that has been the same since the last 2-3 years. This year am saving even more due to the new slabs. Plenty of hra tax frauds are committed through old regime.",
        "but we put leftists in place bro. mElTdOwN on June 4th bro. /s",
        "Don't forget onions. It's been fixed for over a month and 40% export duty imposed.",
        "Jokes on you, they don't understand angrezi",
        "Yes...us in the 50's the tax rate for the top 1 per cent was almost 90 percent....after Ronald Reagan it all went down hill",
        "Polls ho gayi guys polls ho gayi. Ab petrol, gas cylinder sabka price badega.",
        "Just onions? Every vegetables in my area costs 40-50% more than normal rate."
    ],
    "cleaned_text": "mint day polls highway authority hikes rates across toll plazas day polls highway authority hikes rates across toll plazas ",
    "cleaned_title": "mint day polls highway authority hikes rates across toll plazas",
    "cleaned_selftext": "day polls highway authority hikes rates across toll plazas",
    "cleaned_comments": "ha ha hakeep voting clowns keep tricks played godiji meditated hrs see hike help bharat future deep meditation time travel found help us years later hes truly gift god sher pala hai toh half truth hike alone forthcoming hike mobile plan petrol lpg atf jet fuel cng etc beginning petrol going around within month old tax regime option new tax payers within year two brutal censorship enforced new broadcast law fully adapted third term st centurys third reich fasten seat belts ride hell doesnt adani ji create gofundme order become richest person world show governance taxation loans bidding wars cumbersome dont clearly know money reaching adani ji amul hiked milk prices rupees already chanting jsr make hell less painful honest question india continuer advance increase economic prosperity without taxation government beginsprices items hiked retrieve money biggest bank defaulters majority gujaratis use money instead leeching middleclass thanks nda voters also fk done anywhere tbh glad old tax regime gone already pay less new tax regime since last years year saving even due new slabs plenty hra tax frauds committed old regime put leftists place bro meltdown june th bro dont forget onions fixed month export duty imposed jokes dont understand angrezi yesus tax rate top per cent almost percentafter ronald reagan went hill polls ho gayi guys polls ho gayi ab petrol gas cylinder sabka price badega onions every vegetables area costs normal rate",
    "light_cleaned_title": "mint: Day after polls, highway authority hikes rates by 3-5% across 1100 toll plazas",
    "light_cleaned_selftext": "Day after polls, highway authority hikes rates by 3-5% across 1100 toll plazas",
    "light_cleaned_comments": "Ha ha ha....keep voting for the same clowns and keep having the same tricks played on you Godiji meditated for 45hrs to see if this hike will help Bharat in the future. During his deep meditation and time travel, he found that this will help us 748 years later. He's truly a gift of god. /s Sher pala hai toh… Half truth. Not this hike alone. Forthcoming hike in mobile plan, petrol, LPG, ATF (jet fuel), CNG etc. It's just the beginning. Petrol is going up around 10% within a month. Old tax regime will not be an option for new tax payers within a year or two. Brutal censorship will be enforced once new broadcast law is fully adapted. The third term will be the 21st century's Third Reich. Fasten your seat belts. We have a ride through hell. Why doesn't Adani Ji just create a GoFundMe in order to become the richest person in the world? All this show of governance, taxation, loans, bidding wars, it's just too cumbersome and we don't clearly know if our money is reaching Adani Ji. /s Amul hiked milk prices by 2 rupees already. Chanting JSR will make hell less painful /s Honest question, how is India to continuer to advance and increase economic prosperity without taxation from the government And so it begins....prices of more items will be hiked . Retrieve the money the biggest bank defaulters (majority are Gujaratis) and use that money instead of leeching the middle-class. Thanks NDA voters. Also, F**K YOU! Has it been done before anywhere? Tbh I will be glad if old tax regime is gone. I already pay less in new tax regime and that has been the same since the last 2-3 years. This year am saving even more due to the new slabs. Plenty of hra tax frauds are committed through old regime. but we put leftists in place bro. mElTdOwN on June 4th bro. /s Don't forget onions. It's been fixed for over a month and 40% export duty imposed. Jokes on you, they don't understand angrezi Yes...us in the 50's the tax rate for the top 1 per cent was almost 90 percent....after Ronald Reagan it all went down hill Polls ho gayi guys polls ho gayi. Ab petrol, gas cylinder sabka price badega. Just onions? Every vegetables in my area costs 40-50% more than normal rate."
}