{
    "id": "1beqhn8",
    "title": "Punishment for rapists in different countries",
    "url": "https://www.reddit.com/r/india/comments/1beqhn8/punishment_for_rapists_in_different_countries/",
    "selftext": " \n\n**1. India: Life imprisonment to death sentence**\n\n After the Anti Rape Bill of April 2013, culprits are liable to life imprisonment (which is actually 14 years), imprisonment for entire life and even the death sentence in the rarest of rare cases.\n\n**2. China: Death sentence or castration**\n\n The sentence for rape in China is death. Castration is also used in some cases.\n\n**3. Saudi Arabia: Beheading within days**\n\n The punishment for rape in Saudi Arabia is a public beheading after administering the rapist with a sedative.\n\n**4. North Korea: Death by firing squad**\n\nNorth Korea sentences rapists to death by firing squad.\n\n**5. Afghanistan: Shot in the head or hanged to death**\n\nRapists in Afghanistan are shot in the head within 4 days or hanged to death depending on the judgement handed out by the court.\n\n**6. Pakistan: Death sentence**\n\nGang rape, child molestation and rape are punishable by death. An assault on a woman and intentional display of her body in public view is punishable by death in Pakistan. Statutory rape by a man of a girl under sixteen, especially a gang rape, is punishable by death.\n\n**7. Japan: 20 years to life**\n\nTwenty years for the crime of rape. If it is rape or fatal rape at the scene of any other crime like robbery, then death penalty.\n\n**8. Egypt: Death by hanging**\n\n Egypt is also one of the places that still follows the slightly outdated mode of death by hanging.\n\n**9. Iran: Hanged to death**\n\n Rapists in Iran are sentenced to death, sometimes by hanging but sometimes allegedly also by stoning.\n\n**10. USA: Imprisonment for life**\n\n The usual sentence for a convicted rapist here depends on whether the trial falls under state or federal law. In cases under federal law, the punishments can range from a few years to imprisonment for the entirety of the rapist's life span.\n\n**11. Russia: 3 to 20 years**\n\n Rapists in Russia are usually sentenced to 3-6 years in prison. The jail term can go up to more than 10 years depending on the situation.\n\n**12. Israel: 16 years to life**\n\n If someone is convicted of raping a woman, he is liable to be sentenced to 16 years in prison. Their definition of rape is quite inclusive and takes into account other forms of sexual assault.\n\n**13 France: 15 years to life**\n\n French hands out 15 year sentences for rape, which can be extended to 30 or life depending on the extent of damage and brutality.\n\n**14. Norway: 4 to 15 years**\n\n Any kind of sexual behaviour without consent falls under the category of rape in Norway, and the perpetrator can be thrown in jail for a period of 4-15 years depending on how heinous the crime was.\n\n**Source**: [https://www.tbsnews.net/world/punishment-rapists-different-countries-144115](https://www.tbsnews.net/world/punishment-rapists-different-countries-144115)",
    "flair": "Crime",
    "score": 58,
    "num_comments": 76,
    "created_utc": 1710436686.0,
    "convurl": "https://external-preview.redd.it/DePYsROryfFNtKS2wzZfM8e5jglkmp7DggTMaHPZHTQ.jpg?auto=webp&s=290728fe6607d0b89776a5900aad633efd1be44b",
    "comments": [
        "All developed countries got rid of capital punishment",
        "read somewhere that it makes it worse as culprit is more likely to kill the victim so he doesn't get caught (as he would die if that happened). \n\nespecially in a country like ours where justice system is so bad, ig it is more likely to backfire.",
        "Ah yes... Now what about the cases where the male gets ropd by a female or a male....\n\nTell me THAT.",
        "That is also molestation and a crime, bas you need to have courage to fight for justice. Rape of a man is also wrong.",
        "Saudi Arabia 💀",
        "What’s the question? There isn’t one but I’d say Indians need to get whipped. Worked on the Chinese. The Indian people aren’t cut out for democracy it feels like.",
        "I heard an argument that the reason we don't have \"death penalty\" for rape is that because law tends to look out for rape victims life . We have death penalty reserved for rape+murder(of the rape victim) , now if we change the law and put out death penalty for rape, so there's same penalty for rape and rape+ murder (of the rape victim) . Now after putting out this new law rapes won't stop in a single day, but then what will happen is that everytime there's a rape somewhere there's a sureshot chance(9/10) that the rape victim will be murdered by the offender. Because he'll be hanged for rape so he will not leave the victim alive to even testify , because now penalty for rape+murder(of the rape victim) is same as rape so , if he's climbing the noose he'll not leave the victim alive either.   Now assuming there's a rape happening every hour across India, you are looking at a murder rate higher than a mountain. And all this is said in assumption that every rape case filed is not false.",
        "Actually making the punishment worse could be counter productive. If the sentence is death, the rapist is incentivised to kill the victim so that they don't report, if it's jail they might let the victim live. Also in the majority of cases, the rapist is someone the victim knows and trusts so they are less likely to report if the sentence is death.",
        "There are no stats with respect to India because they don't think men can be victims.",
        "Death penalty shouldn’t be used solely for the reason that it is irreversible and we all know how erratic the justice system is and how many wrongfully convicted people are there.",
        ">1. India: ~~Life imprisonment to death sentence~~ Congratulating the perpetrators with garland and celebrating their achievements.",
        "Gendered whataboutism",
        "Malaysia - 8 to 30 years of prison and >10 (usually 20) strokes of whipping",
        "Mohak has uploaded a video regarding this issue on why giving a death sentence might be worse",
        "so why does this logic not apply to other countries who have a death penalty?",
        "always that one person fighting for \"humanism\". this post is simply mentioning rape punishments, where tf is it written that rapes happens ONLY with females?",
        "Doesn't have to be a death sentence. It could be increased to whipping. It tears their back so at least some justice and fear will be there. In my place sexual crimes get whippings along with prison time",
        "Maybe because those laws are set way before and has taken concrete form and now public abides by them, any \"new law\" takes time for public to actually follow it, if I were to ban alcohol today in a state which isn't a dry state, alcohol consumption won't drop down to zero just because it's illegal now.",
        "Only from certain community",
        "Exactly India needs to introduce whipping at least it gives some justice and creates fear instead of just prison",
        "Ask the government. They recently erased the law which was for rape against males or transgenders.",
        "That's right. That's why it doesn't have to be a death sentence. It could be increased to whipping. It tears their back so at least some justice and fear will be there. In my place sexual crimes get whippings along with prison time",
        "Yeah, I think the people are just too uncivilized to their core with this stuff to be trusted to solve this organically via the legal system. Maybe unless you add whipping to the mix. Don’t get me wrong, it’s brute and medieval as heck, but it will instill the fear of God in the people.",
        "Because he’s over smart. \n\nYe nahi bolraha bandhu ke quick death penalty se rape cases kam hojayenge. But ulta samjha raha ke rape + murder hi honge. Lol\n\nIndia govt try to kare public execution of rapists ek baar. Tamasha banaye rapists ka.\n\nYe sab rape apologists jo ladkiya chedte firte hain, didi didi bolenge sabko aur aankhen rakkhenge neechi . \n\nSadly is desh me convicted rapists ke liye rallies nikalti hain demanding the rapists release ya govt khud release kardeti hai even in some of the most brutal rape cases in the country. \n\nAur yahan ki majority janta rape apologists hi bane rehte hain.\n\nDekhna kaise kilas gaye honge. Downvotes se samajh jaoge!",
        "India Saudi ko copy karraha hai religious domination me for Hinduism.\n\nWe should also copy how they are handling rapists but koi nahi chahta aisa ho India. Sabse sad part to yehi hai India ka. Rapists ko itna bura nahi samajhte yahan.",
        "Tumne bahot befkoofi ki baat likhi hai yahan pe.\n\nTum rape kam karna chahte bhi ho?",
        "Should be 20 strokes every day. Plus extra whipping everytime the victim wants to give",
        "Tumhare kehne ka matlab hai presently Indian rapists apne victim ko zinda isliye chodta hai taaki usko sirf life sentence ho and death penalty nahi? Agar dimaag laga hi rahe ho to thoda aur lagao. Don’t you think agar rapist itna sochta hai to victim ko hamesha marega regardless of death penalty or life imprisonment? Usko maza to ayega nahi life imprisonment leke. Wo to bahar hi rehna chahega.\n\nMatlab kuch bhi copied logic forward karte rehte ho tum log!",
        "W saudi arabia",
        "Death penalty as a way to prevent rape is like putting a band aid on a cracked wall. Doesn't do shit, and would encourage rapists to murder their victims so they can get away with it",
        "And if death sentence is given for rape, then rape+murder cases will increase",
        "It does apply.",
        "Stop being emotional and apply sense. Bohot baat rapists ko extra judicially mara Gaya hai. Hua rape Kam ? Public execution vaise bhi nahin ho sakta chahe kitna serious crime ho.",
        "People praising saudi arabia..... you also wanna consider how are women treated there? I can confidently say its just as bad if not worse than india rn. \nChanging the laws wont do shit if society wont change. Yes rata rataya dialogue this one, but this is the actual solution.",
        "Yes I honestly dont want ki hamari society Saudi jasi barbaric ho jaye. You wanna know how \"good\" situation of women in these Saudi countries is? Come on dont be this negligent. \nThere is a reason Legal systems are there. Solution is to make them better along with changing mindset of society, not to evolve even more backwards as society.",
        "you forgot to mention that victims will also be punished in some arab countries.",
        "India - accused to marry victim if crime proved.",
        "I agree fully, it’s cowardly to formulate your laws out of fear and cowardice of what a rapist may decide to do. Like, the law should be based on the criminal? \n\nI’d add whipping to the mix too. It’s medieval and brutal but the only thing that can civilize the Indian people.",
        ">Actually making the punishment worse could be counter productive.\n\nLol, what is this logic you guys spout here? Nonsense. \n\nBy your own logic, lightening the punishment should decrease rape cases? Should that be the strategy then?",
        "These people just get hyper when something happens for a week or two then get back to their nonsensical talking points. That’s why this problem has never been fixed in india.",
        "You've listed some interesting countries, do you know their threshold of evidence?\n\n\nPlease share what proof a woman needs to provide to prove rape? And that she can be legally sentenced to lashings or stoning when such a case isn't proved.\n\n\nAs for USA, you've literally not followed the culture of rape on college campuses and the lack of any kind of punishment.\n\n\nYou can have the strictest of laws on the book, but if they can't be consistently and fairly applied, they're useless. India has reasonable laws to punish culprits, the problem is that these aren't property enforced.",
        "Plenty of rapists, especially those in the north it seems, tend to murder their victims, esp if they are children or those deemed on the lower rungs of society. Not saying we should start mopping those rapists left and right, but we sure do need a stronger deterrence",
        "honestly i have only seen non saudis complain about women treatment and actually never a saudi women complain about how she is treated in her country",
        "also castrate them",
        "Just because you can't understand doesn't mean it doesn't make sense. I gave an explanation for why it doesn't work. Now if you disagree, provide an actual argument.\n\nRate won't decrease, rate of reporting will increase.",
        "They require 1 male witness or 2 women witnesses, the victim isn't able to find them in most cases",
        "Women who move out do. They can't speak out when they're there.",
        "I tried giving you a gold but the app won’t let me. I just wanna say, real astute analysis on the situation in India. So correct, people like dry and moan for a week, make Reddit posts then all energy gone. Your analysis is just… on-point, man.",
        "Don't pretend to misunderstand what I am trying to say. We must give a quick death penalty to the rapists. Who's saying ke women oppression Karo India me unki tarah? Jo kehraha hun utna samjho.",
        "Tum rape Kam karna bhi chahte ho? Iska answer nahi Diya tumne?\n\nAlso, your opinion is still bevkoof. \n\nYou are trying to suggest that rapists who don't kill women they rape is because they are okay with life sentences and not okay with death penalty!\n\nMatlab wo soch Raha hai agar pakda Gaya to sirf life sentence hi to hoga! Lmao\n\nWouldn't he try to save his entire ass if he was actually being this analytical like you? Rape+murder to Indian rapist ko life sentence ke case me bhi karna chahiye ? Kyun? Ya usko pasand hai poori life jail me rehna? \n\nBevfook comment karte ho! \n\nTum actually me rape Kam karna chahte hi nahi ho! Problem ye hai!",
        "It's surprising that so many Indians defend rapists. Look at the downvotes on all of my comments.\n\nSome of these guys think they might do something like this in the future, so they can't be having tougher laws for rape in India. It's harsh but there's no explanation for them getting pissed off like this.",
        "Ever heard of DNA test ?",
        "Another reason I believe is that in a country like ours where there are some really poor people who have absolutely no rights. They are often falsely arrested on the crimes of others. If we enable death penalty then they get no chance to prove their innocence. They’re simply selected at random, because many at time the rapists have too much power, and then executed.",
        "And they don't always leave DNA behind",
        "The most irrelevant post ever.",
        "Wow so lovely!",
        "There are probably other method to catch the rapist, such as pregnancy can also be used as evidence but DNA testing are extremely accurate but anyways Rape cases in Saudia arabia is extremely low",
        "They don't always leave DNA behind. Also they need 2 female witnesses or 1 male witness",
        "Again Witnesses are not always necessary if there are evidences provided",
        "And they don't always leave other evidence",
        "They go full medieval on rapist's ass",
        "No mercy 💀",
        "You clearly said \" how they handle rapists \". And how saudi handles rapist is public stoning by what posts say. I have not misunderstood lol, you are just backing out now that you have seen the fault in your argument lol. \nIts fine atleast you see the fault lol. You could have taken example of simple death penalty carried by proper judicial systems in other countries would have been a better point but you had to go to saudi.....",
        "Because rapists deserve the worst kind of death. If you know any country that gives worse punishment to the rapists, I will gladly take their name. \n\nIt is interesting that you are arguing for rapists here, trying to suggest that they should not be given brutal death. \n\nAre you guilty yourself? Seems like it.",
        "Yup because death penalty to hai hi , ab murder karke Pakde jaane ke chances Kam karne ki sochega rapist .",
        "People asking Death penalty within days ? Are bhai Fake cases walon ko bhi marwa doge kya ... \n\nBhit baar ex gf rape case kardeti hai on promise of marriage wala ...\n Bhot baar extortion Wale mamle hai , bhot baar police Galt bande ko pakad leti hai because real culprit is powerful and he bribed Police . Kuch bhi ho sakata hai . \n\nAlso jab rape par death milni hi hai to kyun na rapist murder kardega jisse pakde jane ke chances Kam ho Jaye. ?",
        "Death sentence se rape Kam nahi hoga, rape+murder ke cases badhege. Rapist will kill the victim if the sentence is same for rape and rape+murder. \n\nTo reduce rape, men must be taught to not rape.",
        "It’s a stupid argument from rapist apologists. \n\nYou guys don’t want to reduce rape. Only the harshest of punishments can reduce the incidence of rape. \n\nDeny it because agar apply hogaye aise laws to potential rapists Jo ki bhare pade hain is country me, unki haalat tight hojayegi.",
        "And induction into politics",
        "And in Japan and SK, if a guy rapes someone while being drunk, it's the fault of alcohol, not the guy.",
        "Public execution is never an option in any civilized countries. Jin countries ka naam loge wo sb kisi na kisi situation mein extreme hai bilkul. Hum proper democracy hain. Humare yahan ye sb kbhi nhi hone wala. Infact, it doesn't happen in any civilized country USA ko hi dekh lo unka judicial system one of the best hai. Death penalty kr skte h but pta nhi usse kitna asar hoga. Iss situation ko handle krne ka sbse bada tareeka hota h conviction rate improve krna..mass campaigns chlate rehna...aur vigilance systems ko strengthen krna"
    ],
    "cleaned_text": "punishment rapists different countries india life imprisonment death sentence anti rape bill april culprits liable life imprisonment actually years imprisonment entire life even death sentence rarest rare cases china death sentence castration sentence rape china death castration also used cases saudi arabia beheading within days punishment rape saudi arabia public beheading administering rapist sedative north korea death firing squad north korea sentences rapists death firing squad afghanistan shot head hanged death rapists afghanistan shot head within days hanged death depending judgement handed court pakistan death sentence gang rape child molestation rape punishable death assault woman intentional display body public view punishable death pakistan statutory rape man girl sixteen especially gang rape punishable death japan years life twenty years crime rape rape fatal rape scene crime like robbery death penalty egypt death hanging egypt also one places still follows slightly outdated mode death hanging iran hanged death rapists iran sentenced death sometimes hanging sometimes allegedly also stoning usa imprisonment life usual sentence convicted rapist depends whether trial falls state federal law cases federal law punishments range years imprisonment entirety rapists life span russia years rapists russia usually sentenced years prison jail term go years depending situation israel years life someone convicted raping woman liable sentenced years prison definition rape quite inclusive takes account forms sexual assault france years life french hands year sentences rape extended life depending extent damage brutality norway years kind sexual behaviour without consent falls category rape norway perpetrator thrown jail period years depending heinous crime source httpswwwtbsnewsnetworldpunishmentrapistsdifferentcountrieshttpswwwtbsnewsnetworldpunishmentrapistsdifferentcountries ",
    "cleaned_title": "punishment rapists different countries",
    "cleaned_selftext": "india life imprisonment death sentence anti rape bill april culprits liable life imprisonment actually years imprisonment entire life even death sentence rarest rare cases china death sentence castration sentence rape china death castration also used cases saudi arabia beheading within days punishment rape saudi arabia public beheading administering rapist sedative north korea death firing squad north korea sentences rapists death firing squad afghanistan shot head hanged death rapists afghanistan shot head within days hanged death depending judgement handed court pakistan death sentence gang rape child molestation rape punishable death assault woman intentional display body public view punishable death pakistan statutory rape man girl sixteen especially gang rape punishable death japan years life twenty years crime rape rape fatal rape scene crime like robbery death penalty egypt death hanging egypt also one places still follows slightly outdated mode death hanging iran hanged death rapists iran sentenced death sometimes hanging sometimes allegedly also stoning usa imprisonment life usual sentence convicted rapist depends whether trial falls state federal law cases federal law punishments range years imprisonment entirety rapists life span russia years rapists russia usually sentenced years prison jail term go years depending situation israel years life someone convicted raping woman liable sentenced years prison definition rape quite inclusive takes account forms sexual assault france years life french hands year sentences rape extended life depending extent damage brutality norway years kind sexual behaviour without consent falls category rape norway perpetrator thrown jail period years depending heinous crime source httpswwwtbsnewsnetworldpunishmentrapistsdifferentcountrieshttpswwwtbsnewsnetworldpunishmentrapistsdifferentcountries",
    "cleaned_comments": "developed countries got rid capital punishment read somewhere makes worse culprit likely kill victim doesnt get caught would die happened especially country like justice system bad ig likely backfire ah yes cases male gets ropd female male tell also molestation crime bas need courage fight justice rape man also wrong saudi arabia whats question isnt one id say indians need get whipped worked chinese indian people arent cut democracy feels like heard argument reason dont death penalty rape law tends look rape victims life death penalty reserved rapemurderof rape victim change law put death penalty rape theres penalty rape rape murder rape victim putting new law rapes wont stop single day happen everytime theres rape somewhere theres sureshot chance rape victim murdered offender hell hanged rape leave victim alive even testify penalty rapemurderof rape victim rape hes climbing noose hell leave victim alive either assuming theres rape happening every hour across india looking murder rate higher mountain said assumption every rape case filed false actually making punishment worse could counter productive sentence death rapist incentivised kill victim dont report jail might let victim live also majority cases rapist someone victim knows trusts less likely report sentence death stats respect india dont think men victims death penalty shouldnt used solely reason irreversible know erratic justice system many wrongfully convicted people india life imprisonment death sentence congratulating perpetrators garland celebrating achievements gendered whataboutism malaysia years prison usually strokes whipping mohak uploaded video regarding issue giving death sentence might worse logic apply countries death penalty always one person fighting humanism post simply mentioning rape punishments tf written rapes happens females doesnt death sentence could increased whipping tears back least justice fear place sexual crimes get whippings along prison time maybe laws set way taken concrete form public abides new law takes time public actually follow ban alcohol today state isnt dry state alcohol consumption wont drop zero illegal certain community exactly india needs introduce whipping least gives justice creates fear instead prison ask government recently erased law rape males transgenders thats right thats doesnt death sentence could increased whipping tears back least justice fear place sexual crimes get whippings along prison time yeah think people uncivilized core stuff trusted solve organically via legal system maybe unless add whipping mix dont get wrong brute medieval heck instill fear god people hes smart ye nahi bolraha bandhu ke quick death penalty se rape cases kam hojayenge ulta samjha raha ke rape murder hi honge lol india govt try kare public execution rapists ek baar tamasha banaye rapists ka ye sab rape apologists jo ladkiya chedte firte hain didi didi bolenge sabko aur aankhen rakkhenge neechi sadly desh convicted rapists ke liye rallies nikalti hain demanding rapists release ya govt khud release kardeti hai even brutal rape cases country aur yahan ki majority janta rape apologists hi bane rehte hain dekhna kaise kilas gaye honge downvotes se samajh jaoge india saudi ko copy karraha hai religious domination hinduism also copy handling rapists koi nahi chahta aisa ho india sabse sad part yehi hai india ka rapists ko itna bura nahi samajhte yahan tumne bahot befkoofi ki baat likhi hai yahan pe tum rape kam karna chahte bhi ho strokes every day plus extra whipping everytime victim wants give tumhare kehne ka matlab hai presently indian rapists apne victim ko zinda isliye chodta hai taaki usko sirf life sentence ho death penalty nahi agar dimaag laga hi rahe ho thoda aur lagao dont think agar rapist itna sochta hai victim ko hamesha marega regardless death penalty life imprisonment usko maza ayega nahi life imprisonment leke wo bahar hi rehna chahega matlab kuch bhi copied logic forward karte rehte ho tum log w saudi arabia death penalty way prevent rape like putting band aid cracked wall doesnt shit would encourage rapists murder victims get away death sentence given rape rapemurder cases increase apply stop emotional apply sense bohot baat rapists ko extra judicially mara gaya hai hua rape kam public execution vaise bhi nahin ho sakta chahe kitna serious crime ho people praising saudi arabia also wan na consider women treated confidently say bad worse india rn changing laws wont shit society wont change yes rata rataya dialogue one actual solution yes honestly dont want ki hamari society saudi jasi barbaric ho jaye wan na know good situation women saudi countries come dont negligent reason legal systems solution make better along changing mindset society evolve even backwards society forgot mention victims also punished arab countries india accused marry victim crime proved agree fully cowardly formulate laws fear cowardice rapist may decide like law based criminal id add whipping mix medieval brutal thing civilize indian people actually making punishment worse could counter productive lol logic guys spout nonsense logic lightening punishment decrease rape cases strategy people get hyper something happens week two get back nonsensical talking points thats problem never fixed india youve listed interesting countries know threshold evidence please share proof woman needs provide prove rape legally sentenced lashings stoning case isnt proved usa youve literally followed culture rape college campuses lack kind punishment strictest laws book cant consistently fairly applied theyre useless india reasonable laws punish culprits problem arent property enforced plenty rapists especially north seems tend murder victims esp children deemed lower rungs society saying start mopping rapists left right sure need stronger deterrence honestly seen non saudis complain women treatment actually never saudi women complain treated country also castrate cant understand doesnt mean doesnt make sense gave explanation doesnt work disagree provide actual argument rate wont decrease rate reporting increase require male witness women witnesses victim isnt able find cases women move cant speak theyre tried giving gold app wont let wan na say real astute analysis situation india correct people like dry moan week make reddit posts energy gone analysis onpoint man dont pretend misunderstand trying say must give quick death penalty rapists whos saying ke women oppression karo india unki tarah jo kehraha hun utna samjho tum rape kam karna bhi chahte ho iska answer nahi diya tumne also opinion still bevkoof trying suggest rapists dont kill women rape okay life sentences okay death penalty matlab wo soch raha hai agar pakda gaya sirf life sentence hi hoga lmao wouldnt try save entire ass actually analytical like rapemurder indian rapist ko life sentence ke case bhi karna chahiye kyun ya usko pasand hai poori life jail rehna bevfook comment karte ho tum actually rape kam karna chahte hi nahi ho problem ye hai surprising many indians defend rapists look downvotes comments guys think might something like future cant tougher laws rape india harsh theres explanation getting pissed like ever heard dna test another reason believe country like really poor people absolutely rights often falsely arrested crimes others enable death penalty get chance prove innocence theyre simply selected random many time rapists much power executed dont always leave dna behind irrelevant post ever wow lovely probably method catch rapist pregnancy also used evidence dna testing extremely accurate anyways rape cases saudia arabia extremely low dont always leave dna behind also need female witnesses male witness witnesses always necessary evidences provided dont always leave evidence go full medieval rapists ass mercy clearly said handle rapists saudi handles rapist public stoning posts say misunderstood lol backing seen fault argument lol fine atleast see fault lol could taken example simple death penalty carried proper judicial systems countries would better point go saudi rapists deserve worst kind death know country gives worse punishment rapists gladly take name interesting arguing rapists trying suggest given brutal death guilty seems like yup death penalty hai hi ab murder karke pakde jaane ke chances kam karne ki sochega rapist people asking death penalty within days bhai fake cases walon ko bhi marwa doge kya bhit baar ex gf rape case kardeti hai promise marriage wala bhot baar extortion wale mamle hai bhot baar police galt bande ko pakad leti hai real culprit powerful bribed police kuch bhi ho sakata hai also jab rape par death milni hi hai kyun na rapist murder kardega jisse pakde jane ke chances kam ho jaye death sentence se rape kam nahi hoga rapemurder ke cases badhege rapist kill victim sentence rape rapemurder reduce rape men must taught rape stupid argument rapist apologists guys dont want reduce rape harshest punishments reduce incidence rape deny agar apply hogaye aise laws potential rapists jo ki bhare pade hain country unki haalat tight hojayegi induction politics japan sk guy rapes someone drunk fault alcohol guy public execution never option civilized countries jin countries ka naam loge wo sb kisi na kisi situation mein extreme hai bilkul hum proper democracy hain humare yahan ye sb kbhi nhi hone wala infact doesnt happen civilized country usa ko hi dekh lo unka judicial system one best hai death penalty kr skte h pta nhi usse kitna asar hoga iss situation ko handle krne ka sbse bada tareeka hota h conviction rate improve krnamass campaigns chlate rehnaaur vigilance systems ko strengthen krna",
    "light_cleaned_title": "Punishment for rapists in different countries",
    "light_cleaned_selftext": "**1. India: Life imprisonment to death sentence** After the Anti Rape Bill of April 2013, culprits are liable to life imprisonment (which is actually 14 years), imprisonment for entire life and even the death sentence in the rarest of rare cases. **2. China: Death sentence or castration** The sentence for rape in China is death. Castration is also used in some cases. **3. Saudi Arabia: Beheading within days** The punishment for rape in Saudi Arabia is a public beheading after administering the rapist with a sedative. **4. North Korea: Death by firing squad** North Korea sentences rapists to death by firing squad. **5. Afghanistan: Shot in the head or hanged to death** Rapists in Afghanistan are shot in the head within 4 days or hanged to death depending on the judgement handed out by the court. **6. Pakistan: Death sentence** Gang rape, child molestation and rape are punishable by death. An assault on a woman and intentional display of her body in public view is punishable by death in Pakistan. Statutory rape by a man of a girl under sixteen, especially a gang rape, is punishable by death. **7. Japan: 20 years to life** Twenty years for the crime of rape. If it is rape or fatal rape at the scene of any other crime like robbery, then death penalty. **8. Egypt: Death by hanging** Egypt is also one of the places that still follows the slightly outdated mode of death by hanging. **9. Iran: Hanged to death** Rapists in Iran are sentenced to death, sometimes by hanging but sometimes allegedly also by stoning. **10. USA: Imprisonment for life** The usual sentence for a convicted rapist here depends on whether the trial falls under state or federal law. In cases under federal law, the punishments can range from a few years to imprisonment for the entirety of the rapist's life span. **11. Russia: 3 to 20 years** Rapists in Russia are usually sentenced to 3-6 years in prison. The jail term can go up to more than 10 years depending on the situation. **12. Israel: 16 years to life** If someone is convicted of raping a woman, he is liable to be sentenced to 16 years in prison. Their definition of rape is quite inclusive and takes into account other forms of sexual assault. **13 France: 15 years to life** French hands out 15 year sentences for rape, which can be extended to 30 or life depending on the extent of damage and brutality. **14. Norway: 4 to 15 years** Any kind of sexual behaviour without consent falls under the category of rape in Norway, and the perpetrator can be thrown in jail for a period of 4-15 years depending on how heinous the crime was. **Source**: [https://www.tbsnews.net/world/punishment-rapists-different-countries-144115](https://www.tbsnews.net/world/punishment-rapists-different-countries-144115)",
    "light_cleaned_comments": "All developed countries got rid of capital punishment read somewhere that it makes it worse as culprit is more likely to kill the victim so he doesn't get caught (as he would die if that happened). especially in a country like ours where justice system is so bad, ig it is more likely to backfire. Ah yes... Now what about the cases where the male gets ropd by a female or a male.... Tell me THAT. That is also molestation and a crime, bas you need to have courage to fight for justice. Rape of a man is also wrong. Saudi Arabia 💀 What’s the question? There isn’t one but I’d say Indians need to get whipped. Worked on the Chinese. The Indian people aren’t cut out for democracy it feels like. I heard an argument that the reason we don't have \"death penalty\" for rape is that because law tends to look out for rape victims life . We have death penalty reserved for rape+murder(of the rape victim) , now if we change the law and put out death penalty for rape, so there's same penalty for rape and rape+ murder (of the rape victim) . Now after putting out this new law rapes won't stop in a single day, but then what will happen is that everytime there's a rape somewhere there's a sureshot chance(9/10) that the rape victim will be murdered by the offender. Because he'll be hanged for rape so he will not leave the victim alive to even testify , because now penalty for rape+murder(of the rape victim) is same as rape so , if he's climbing the noose he'll not leave the victim alive either. Now assuming there's a rape happening every hour across India, you are looking at a murder rate higher than a mountain. And all this is said in assumption that every rape case filed is not false. Actually making the punishment worse could be counter productive. If the sentence is death, the rapist is incentivised to kill the victim so that they don't report, if it's jail they might let the victim live. Also in the majority of cases, the rapist is someone the victim knows and trusts so they are less likely to report if the sentence is death. There are no stats with respect to India because they don't think men can be victims. Death penalty shouldn’t be used solely for the reason that it is irreversible and we all know how erratic the justice system is and how many wrongfully convicted people are there. >1. India: ~~Life imprisonment to death sentence~~ Congratulating the perpetrators with garland and celebrating their achievements. Gendered whataboutism Malaysia - 8 to 30 years of prison and >10 (usually 20) strokes of whipping Mohak has uploaded a video regarding this issue on why giving a death sentence might be worse so why does this logic not apply to other countries who have a death penalty? always that one person fighting for \"humanism\". this post is simply mentioning rape punishments, where tf is it written that rapes happens ONLY with females? Doesn't have to be a death sentence. It could be increased to whipping. It tears their back so at least some justice and fear will be there. In my place sexual crimes get whippings along with prison time Maybe because those laws are set way before and has taken concrete form and now public abides by them, any \"new law\" takes time for public to actually follow it, if I were to ban alcohol today in a state which isn't a dry state, alcohol consumption won't drop down to zero just because it's illegal now. Only from certain community Exactly India needs to introduce whipping at least it gives some justice and creates fear instead of just prison Ask the government. They recently erased the law which was for rape against males or transgenders. That's right. That's why it doesn't have to be a death sentence. It could be increased to whipping. It tears their back so at least some justice and fear will be there. In my place sexual crimes get whippings along with prison time Yeah, I think the people are just too uncivilized to their core with this stuff to be trusted to solve this organically via the legal system. Maybe unless you add whipping to the mix. Don’t get me wrong, it’s brute and medieval as heck, but it will instill the fear of God in the people. Because he’s over smart. Ye nahi bolraha bandhu ke quick death penalty se rape cases kam hojayenge. But ulta samjha raha ke rape + murder hi honge. Lol India govt try to kare public execution of rapists ek baar. Tamasha banaye rapists ka. Ye sab rape apologists jo ladkiya chedte firte hain, didi didi bolenge sabko aur aankhen rakkhenge neechi . Sadly is desh me convicted rapists ke liye rallies nikalti hain demanding the rapists release ya govt khud release kardeti hai even in some of the most brutal rape cases in the country. Aur yahan ki majority janta rape apologists hi bane rehte hain. Dekhna kaise kilas gaye honge. Downvotes se samajh jaoge! India Saudi ko copy karraha hai religious domination me for Hinduism. We should also copy how they are handling rapists but koi nahi chahta aisa ho India. Sabse sad part to yehi hai India ka. Rapists ko itna bura nahi samajhte yahan. Tumne bahot befkoofi ki baat likhi hai yahan pe. Tum rape kam karna chahte bhi ho? Should be 20 strokes every day. Plus extra whipping everytime the victim wants to give Tumhare kehne ka matlab hai presently Indian rapists apne victim ko zinda isliye chodta hai taaki usko sirf life sentence ho and death penalty nahi? Agar dimaag laga hi rahe ho to thoda aur lagao. Don’t you think agar rapist itna sochta hai to victim ko hamesha marega regardless of death penalty or life imprisonment? Usko maza to ayega nahi life imprisonment leke. Wo to bahar hi rehna chahega. Matlab kuch bhi copied logic forward karte rehte ho tum log! W saudi arabia Death penalty as a way to prevent rape is like putting a band aid on a cracked wall. Doesn't do shit, and would encourage rapists to murder their victims so they can get away with it And if death sentence is given for rape, then rape+murder cases will increase It does apply. Stop being emotional and apply sense. Bohot baat rapists ko extra judicially mara Gaya hai. Hua rape Kam ? Public execution vaise bhi nahin ho sakta chahe kitna serious crime ho. People praising saudi arabia..... you also wanna consider how are women treated there? I can confidently say its just as bad if not worse than india rn. Changing the laws wont do shit if society wont change. Yes rata rataya dialogue this one, but this is the actual solution. Yes I honestly dont want ki hamari society Saudi jasi barbaric ho jaye. You wanna know how \"good\" situation of women in these Saudi countries is? Come on dont be this negligent. There is a reason Legal systems are there. Solution is to make them better along with changing mindset of society, not to evolve even more backwards as society. you forgot to mention that victims will also be punished in some arab countries. India - accused to marry victim if crime proved. I agree fully, it’s cowardly to formulate your laws out of fear and cowardice of what a rapist may decide to do. Like, the law should be based on the criminal? I’d add whipping to the mix too. It’s medieval and brutal but the only thing that can civilize the Indian people. >Actually making the punishment worse could be counter productive. Lol, what is this logic you guys spout here? Nonsense. By your own logic, lightening the punishment should decrease rape cases? Should that be the strategy then? These people just get hyper when something happens for a week or two then get back to their nonsensical talking points. That’s why this problem has never been fixed in india. You've listed some interesting countries, do you know their threshold of evidence? Please share what proof a woman needs to provide to prove rape? And that she can be legally sentenced to lashings or stoning when such a case isn't proved. As for USA, you've literally not followed the culture of rape on college campuses and the lack of any kind of punishment. You can have the strictest of laws on the book, but if they can't be consistently and fairly applied, they're useless. India has reasonable laws to punish culprits, the problem is that these aren't property enforced. Plenty of rapists, especially those in the north it seems, tend to murder their victims, esp if they are children or those deemed on the lower rungs of society. Not saying we should start mopping those rapists left and right, but we sure do need a stronger deterrence honestly i have only seen non saudis complain about women treatment and actually never a saudi women complain about how she is treated in her country also castrate them Just because you can't understand doesn't mean it doesn't make sense. I gave an explanation for why it doesn't work. Now if you disagree, provide an actual argument. Rate won't decrease, rate of reporting will increase. They require 1 male witness or 2 women witnesses, the victim isn't able to find them in most cases Women who move out do. They can't speak out when they're there. I tried giving you a gold but the app won’t let me. I just wanna say, real astute analysis on the situation in India. So correct, people like dry and moan for a week, make Reddit posts then all energy gone. Your analysis is just… on-point, man. Don't pretend to misunderstand what I am trying to say. We must give a quick death penalty to the rapists. Who's saying ke women oppression Karo India me unki tarah? Jo kehraha hun utna samjho. Tum rape Kam karna bhi chahte ho? Iska answer nahi Diya tumne? Also, your opinion is still bevkoof. You are trying to suggest that rapists who don't kill women they rape is because they are okay with life sentences and not okay with death penalty! Matlab wo soch Raha hai agar pakda Gaya to sirf life sentence hi to hoga! Lmao Wouldn't he try to save his entire ass if he was actually being this analytical like you? Rape+murder to Indian rapist ko life sentence ke case me bhi karna chahiye ? Kyun? Ya usko pasand hai poori life jail me rehna? Bevfook comment karte ho! Tum actually me rape Kam karna chahte hi nahi ho! Problem ye hai! It's surprising that so many Indians defend rapists. Look at the downvotes on all of my comments. Some of these guys think they might do something like this in the future, so they can't be having tougher laws for rape in India. It's harsh but there's no explanation for them getting pissed off like this. Ever heard of DNA test ? Another reason I believe is that in a country like ours where there are some really poor people who have absolutely no rights. They are often falsely arrested on the crimes of others. If we enable death penalty then they get no chance to prove their innocence. They’re simply selected at random, because many at time the rapists have too much power, and then executed. And they don't always leave DNA behind The most irrelevant post ever. Wow so lovely! There are probably other method to catch the rapist, such as pregnancy can also be used as evidence but DNA testing are extremely accurate but anyways Rape cases in Saudia arabia is extremely low They don't always leave DNA behind. Also they need 2 female witnesses or 1 male witness Again Witnesses are not always necessary if there are evidences provided And they don't always leave other evidence They go full medieval on rapist's ass No mercy 💀 You clearly said \" how they handle rapists \". And how saudi handles rapist is public stoning by what posts say. I have not misunderstood lol, you are just backing out now that you have seen the fault in your argument lol. Its fine atleast you see the fault lol. You could have taken example of simple death penalty carried by proper judicial systems in other countries would have been a better point but you had to go to saudi..... Because rapists deserve the worst kind of death. If you know any country that gives worse punishment to the rapists, I will gladly take their name. It is interesting that you are arguing for rapists here, trying to suggest that they should not be given brutal death. Are you guilty yourself? Seems like it. Yup because death penalty to hai hi , ab murder karke Pakde jaane ke chances Kam karne ki sochega rapist . People asking Death penalty within days ? Are bhai Fake cases walon ko bhi marwa doge kya ... Bhit baar ex gf rape case kardeti hai on promise of marriage wala ... Bhot baar extortion Wale mamle hai , bhot baar police Galt bande ko pakad leti hai because real culprit is powerful and he bribed Police . Kuch bhi ho sakata hai . Also jab rape par death milni hi hai to kyun na rapist murder kardega jisse pakde jane ke chances Kam ho Jaye. ? Death sentence se rape Kam nahi hoga, rape+murder ke cases badhege. Rapist will kill the victim if the sentence is same for rape and rape+murder. To reduce rape, men must be taught to not rape. It’s a stupid argument from rapist apologists. You guys don’t want to reduce rape. Only the harshest of punishments can reduce the incidence of rape. Deny it because agar apply hogaye aise laws to potential rapists Jo ki bhare pade hain is country me, unki haalat tight hojayegi. And induction into politics And in Japan and SK, if a guy rapes someone while being drunk, it's the fault of alcohol, not the guy. Public execution is never an option in any civilized countries. Jin countries ka naam loge wo sb kisi na kisi situation mein extreme hai bilkul. Hum proper democracy hain. Humare yahan ye sb kbhi nhi hone wala. Infact, it doesn't happen in any civilized country USA ko hi dekh lo unka judicial system one of the best hai. Death penalty kr skte h but pta nhi usse kitna asar hoga. Iss situation ko handle krne ka sbse bada tareeka hota h conviction rate improve krna..mass campaigns chlate rehna...aur vigilance systems ko strengthen krna"
}