{
    "id": "15n3dcx",
    "title": "As a student who passed class 12, I wrote an article about the Education system in India. Please let me know your thoughts!",
    "url": "https://www.reddit.com/r/india/comments/15n3dcx/as_a_student_who_passed_class_12_i_wrote_an/",
    "selftext": "Earlier this year, I wrote my class 12th board examinations, which marks the end of my school journey. A few days ago, I got admission in a B.Sc. Computer Science course. In the intervening four months, I realised how deeply inadequate the formal education system is. This is my experience as a survivor of this flawed system.\n\n## High School\nAfter finishing class 10th, and ideally having passed the board examinations (I was, unfortunately, in the batch whose exams were cancelled due to COVID) the student chooses a stream – what subjects they wish to pursue in the final two years of schooling. However, more often than not what actually happens is that the student’s parents decide which stream the student wishes to pursue, which means most students take science, either the Maths group (to become an engineer) or the Biology group (to become a doctor). If the parent is more liberal, or confident in their child’s ineptitude, they may allow the child to take commerce, often to train the child to continue the family business. A few remaining stragglers take humanities. I, being a computer science nerd, was in the Maths group, so I can only speak about the engineering side of things, though I hear the situation is quite similar in most respects in the medical camp, too.\n\nThe first thing a typical science student does after joining class 11 is join a coaching institute, because the schools only teach the syllabus required for the board examinations. The syllabus for cracking the competitive exams for joining a college is often more than what is taught in the schools, and while it is theoretically possible to clear entrance examinations only by studying the school textbooks, this is quite rare. The school will skip several chapters from the textbook as they are not part of the boards syllabus, so you have to study those yourselves. Oh, and the entrance exams give very limited time per question, so you have to apply certain tricks or shortcuts to common questions which won’t be discussed in the theory-focused textbooks, which are riddled with flowery language and unending descriptions of the mundane.\n\nSo, coaching institutions are almost a necessity to be successful in the exams. Now, I myself didn’t take part in any such classes, instead opting for home tuitions, so I am not inherently qualified to make derogatory remarks against them, except for what is visible about them from outside. And that which is visible from outside is not pretty, to see the least.\n\n## The Rat Race\nThe coaching institutions are clearly humongous businesses – during results season, every available surface area of newspapers, billboards, TV and YouTube ads are plastered with the smiling faces of the toppers from that coaching institute. What the faces hide is a rotten system, built on greed and broken dreams. Let me explain.\n\nJEE, or Joint Entrance Examination, is one of the largest examinations of the world. It is written by more than a million students each to get a seat in government funded engineering institutions for the B.Tech course, of which there are, over all the IITs, NITs, IIITs, and GFTIs, a little over 54,000. Yes, you read that right – there are over a million students trying to get just fifty thousand seats! If that is not a rat race, I don’t know what is.\n\nFrom the 16,000 students who took admissions in IITs in 2016, around half had studied from coaching institutions. The ratio is probably lower in the overall pool of JEE aspirants, but if you consider around 10% had taken coaching, that is still 1,00,000 students across the nation. That, in a word, is lucrative.\n\nAgain, I cannot comment on the quality of education imparted in the coaching classes, but I will leave to your imagination the learning happening in classrooms stuffed to be the brim with often hundreds of students, being taught by a teacher with no legal responsibility to teach concepts and a huge incentive to get students to rote-learn formulas. Coaching centres, after all, are not regulated by any law, as they are not schools. Students going to coaching centres instead often go to a “dummy school”, which is a school run by the coaching institutions only to conduct examinations and practicals, while all the classes take place in the coaching centre. This is why some students who crack JEE are unable to clear the 75% in boards criteria, they have never learnt the theory taught by actual schools and do not know what to write in a pen and paper exam.\n\nStudents, who are 16-18 years old, taking such coaching often spend their morning in school, afternoons in coaching centres, and evenings in self-study. In fact, engineering students often say they have to study the most before joining the college, rather than during college itself. They are taught to treat their classmates as their competitors rather than classmates, and spend upwards of two years continuously being told by relatives, teachers and parents to perform well in a ridiculously difficult exam. What do you expect to happen?\n\nWell, what happens is this. The best students get what they dreamt of – a seat in one of India’s best colleges. This is the best case scenario, and is seen by less 1% of the students, according to our previous calculation. Mind you, not all of these are getting into a course they are interested in! It is common for students, especially in IITs, to choose whatever course is available to them in a reputed college instead of a course they actually have interest in. This is especially true for those of us interested in computer science – because of the dream of a good placement, everyone tries to get a computer science course irrespective of whether they are interested in CS or not, resulting in those actually interested in CS facing a far more difficult competition than they would have otherwise.\n\nMost of the students instead spend lakhs and lakhs of rupees per year into something they could never have achieved – not everyone is good at physics, chemistry and maths, you can not expect them to! Some take a year off to study more and retake the exam next year – some do so several times. The vast majority either take admission into a private college, or realise this isn’t what they are meant for and move on to something else.\n\nBut, for some students, the pressure put by the family, friends, relatives and teachers over several years is too much to handle. It is then, that the absolute worst elements of the system rear their ugly heads.\n\n## The Ugly Bits\n[Another student kills self, Kota registers 20th suicide in 2015](https://www.hindustantimes.com/india/another-student-kills-self-kota-registers-20th-suicide-in-2015/story-FP6ywWb8CQHkf8ima2VVhL.html)\n\n[Shut Down IIT Coaching Centres, Aspirant Who Killed Herself In Kota Last Week Wrote In Her Suicide Note](https://www.indiatimes.com/news/india/close-iit-coaching-centres-aspirant-who-killed-herself-in-kota-last-week-wrote-in-her-suicide-note-254857.html)\n\n[Two more students commit suicide in Kota, poor performance in exam suspected](https://indianexpress.com/article/india/india-news-india/two-more-students-commit-suicide-in-kota-poor-performance-in-exam-suspected-2790355/)\n\n[Now, ‘anti-suicide’ ceiling fans to prevent suicides in India’s ‘coaching capital’ Kota](https://www.inuth.com/india/now-anti-suicide-ceiling-fans-to-prevent-suicides-in-indias-coaching-capital-kota/)\n\n[Student Allegedly Commits Suicide at Coaching Institute in Kota](https://www.news18.com/news/india/student-allegedly-commits-suicide-at-coaching-institute-in-kota-1266462.html)\n\n[Coaching student suicide in Kota: Bihar girl jumps into Chambal river, dies](https://www.pinkcitypost.com/coaching-student-suicide-in-kota-bihar-girl-jumps-into-chambal-river-dies/)\n\n[IIT aspirant found hanging in hostel room in Kota, 3rd suicide in 4 days](https://www.hindustantimes.com/india-news/coaching-student-commits-suicide-in-kota-third-in-four-days/story-6f4FT3TD3CVqmERlH4q6DO.html)\n\n[Coaching class student committed suicide: Ahmedabad cops](https://timesofindia.indiatimes.com/city/ahmedabad/coaching-class-student-committed-suicide-cops/articleshow/73001554.cms)\n\n[3 coaching centre students die by suicide in Kota in their paying-guest rooms](https://theprint.in/india/3-coaching-centre-students-die-by-suicide-in-kota-in-their-paying-guest-rooms/1262174/)\n\n[Another coaching centre student dies by suicide in Rajasthan’s Kota](https://www.hindustantimes.com/cities/jaipur-news/another-coaching-centre-student-dies-by-suicide-in-rajasthan-s-kota-101671807174442.html)\n\nAnd these are just the ones that get reported. It is not difficult to imagine that the coaching industry, which has a revenue of 1,700 crore rupees in Kota alone, has some influence on what the media is able to report!\n\n## The Exam Itself\nThe entrance exam itself consists of three papers – physics, chemistry and mathematics. The course you are actually aiming for has no role to play in what subjects you have to study. What sort of logic is that? Why can’t a student like me, who wants to pursue computer science, only have to attempt those subjects which are relevant to my interests? Or, at the very least, also have to attempt the subject I am going to pursue?\n\nStudents who did not ever study computers but have studied physics, chemistry and maths, will be able to ace the entrance test and get a seat in a computer science program which they don’t even know if they are interested in, whereas a student who has had a lifelong interest in computers but not so much in physics or chemistry will be lucky to get a CS degree from a good private college, let along public universities. If they don’t, they have to get a seat wherever they can, regardless of the quality of education at the college. Or, they can leave their dreams behind and get whatever course they can from a good college, even though they have no experience or interest in the subject. how is this fair?\n\n## What Can Be Done?\n1. Shut down all coaching centres, and set the syllabus of the competitive exams to strictly follow that of the school system. The fact that the exam may be too easy is not an excuse: the cut-offs for the best institutes will naturally be the highest. The JEE Advanced paper for entrance to the IITs is one of the hardest exams in the world, whereas the IITs themselves are far from being the best colleges in the world!\nAs an extension, shut down the culture of going to Kota to study. Students should be able to enjoy the last two years at their homes with their families before leaving for college.\n\n2. Ensure that schools teach with both the board exams and the competitive exams in mind.\n\n3. Remove the 75% in board exams eligibility criteria for giving the entrance exam. Not all students are good at theory, and it is a well known fact that, unlike government schools, private schools almost always give full marks in internal assessment to its students, making it unfair for students in public schools. For example, I got full marks in all my practicals and internal assessments in physics, chemistry and maths, which I am comfortable in sharing I did not deserve, as maths and physics are not my strong points.\n\n4. Add all the subjects to the entrance exam. Instead of just physics, chemistry and maths, offer subjects such as CS, geography and geology as well.\nMake it such that admissions to different courses have different subjects: For example, B.Tech CSE could only require maths and CS, B.Tech Metallurgy could require, for example, chemistry and geology, mechanical engineering could only require physics etc.\n\nIn subjects like CS, it may be difficult for students from rural backgrounds to study CS at the school level, so the option to take CS only with marks from physics and maths could be added, and the merit from both subject combinations (and maybe others as well) could be considered.\nThe Common Universities Entrance Test (CUET) which was started last year, is very good in these regards because it only considers the school syllabus, it has several subjects to choose from, and different courses take merit of different subject combinations. If the engineering and medical colleges are also added to CUET, with care given to make sure different subject combinations are considered for various courses, several problems with the current system can be solved in one shot.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691645977.0,
    "convurl": "https://external-preview.redd.it/vQFnrSnVrSzu47I1rLEfXfUH1AkdNuah9L-SRmc0Xtc.jpg?auto=webp&s=66d5833864e8075a0e0e37db283bba5fa3995394",
    "comments": [
        "Very well written. A couple of initial thoughts...\n\n\n1. You mention the 1% success rate and say that the calculation is shown previously. Can you explicitly add that calculation? I see there are numbers but the 1% is not explicitly computed.\n\n2. The B. tech courses, even in metallurgy and mechanical engineering, cannot be done without Maths. Beyond a point you cannot understand subjects in these courses without topics like Calculus, probability, matrices etc.",
        "You can’t do engineering without maths.",
        "Good work OP. \n\nHow about you send this to the editorial of some newspapers ?\nTOI, Indian Express, The Hindu",
        "1. Unfortunately, there are no sources available for the number of students who are enrolled in coaching classes, so all calculations has to be made on the basis of the only numbers we have - 44% of IIT students took coaching in 2016, and the total number of GFTI seats available (50k).\n\nIt becomes complicated because IITs take candidates based on the JEE Advanced exam, which has a completely different syllabus from the school syllabus, so far more students are likely to get into IITs after coaching than other GFTIs, where the entrance (JEE Mains) is more or less based on the school syllabus.\nIt is difficult to quantize the impact of this.\n\n\nI do not have access to any numbers on the number of students in GFTIs who took coaching so I made an assumption based on the previous numbers and anecdotal evidence from teachers and classmates.\n\nI took \"10% of all candidates are in coaching\" as a very conservative estimate based on the fact that there is a vast number of students from rural areas with no coaching centres.\n\nUnfortunately these are very fidgety calculations but they are the best numbers I could come up with. I should have explicitly mentioned the fidgety calculations but I did not want to distract from the main point. I will add an explanation on this to the actual article on my website.\n\n2. I am not of the syllabus in those subjects, so I only gave an example. Thank you for letting me know, I will change that.",
        "Thank you. I will consider it but I don't think they will be interested.",
        "Noice. I remember when I had economics in 12th, the economics planning chapter said \"First make a list of economic problems in the country and then start by solving small problems\" couldn't stop laughing lol",
        "> Shut down all coaching centres, and set the syllabus of the competitive exams to strictly follow that of the school system.\n\nI don't think this will ever happen unfortunately.",
        "> Shut down all coaching centres, and set the syllabus of the competitive exams to strictly follow that of the school system. \n\nDid this change in recent years? When I gave IIT JEE, and AIEEE, both exams had syllabus that was part of the CBSE Class XII. I gave more a few entrance exams, but none of them ever really had a questions that aren't part of CBSE. Logical reasoning questions aren't really something that need to be taught. I didn't do coaching, I know quite a few people from IIT, BITS, and NITS that didn't. I tested even the previous IITJEE and AIEEE question papers, none of the questions were out of NCERT.\n\nCoaching centres came up when there were questions that required descriptive answers and not just options to be selected. Subjective answers can't really be evaluated automatically. And, give advantage on ability to write and describe in a language than solve. \n\n> Ensure that schools teach with both the board exams and the competitive exams in mind.\n\nThat will never happen. Even coaching centres that teach for entrance exams have different batches for different entrance exam. You can't expect teachers to be able to cover competitive exam questions and board exam questions. Those are different types of the questions from the same syllabus.\n\n> The fact that the exam may be too easy is not an excuse: the cut-offs for the best institutes will naturally be the highest. The JEE Advanced paper for entrance to the IITs is one of the hardest exams in the world, whereas the IITs themselves are far from being the best colleges in the world! As an extension, shut down the culture of going to Kota to study. Students should be able to enjoy the last two years at their homes with their families before leaving for college.\n\nStudents have been educated in boarding schools for millennia. The initial Universities were boarding. You can't really shutdown culture of going to kota, that isn't really different than sending children to Delhi or Mumbai. That students should be able to enjoy last 2 years at their homes is an extremely privileged take for someone from cities. Tier 3-4 cities and towns don't really have schools with teachers good enough to compete with teachers from Delhi, Mumbai etc. Then you have villages. Everyone wants to move to areas that have infrastructure and offers highest pay, how do you think students from rural areas should compete?\n\n> Remove the 75% in board exams eligibility criteria for giving the entrance exam. Not all students are good at theory, and it is a well known fact that, unlike government schools, private schools almost always give full marks in internal assessment to its students, making it unfair for students in public schools. \n\nFunny? If you can't write boards, then you are not making cut offs for entrance exams. The whole 75% cut off was added for the express purpose to reduce importance of coaching centres or atleast force them to explain theory not just do teach tricks to get the answer fastest. Also, are you kidding, if you are going to a public school and not a coaching centre, and you aren't getting 75% marks, then you aren't clearing JEE or most entrance exams. \n\n> Add all the subjects to the entrance exam. Instead of just physics, chemistry and maths, offer subjects such as CS, geography and geology as well. Make it such that admissions to different courses have different subjects: For example, B.Tech CSE could only require maths and CS, B.Tech Metallurgy could require, for example, chemistry and geology, mechanical engineering could only require physics etc.\n\nDo you understand why it is called JEE - Joint Entrance Exam? It is reduce the number of entrance exams a student needs to give. Most students have more than 1-2 streams that they are willing to learn? You are increasing the number of tests that need to organized and student needs to do. \n\nYou should have put more thought on describing solution rather than repeating the same old problems that everyone knows."
    ],
    "cleaned_text": "student passed class wrote article education system india please let know thoughts earlier year wrote class th board examinations marks end school journey days ago got admission bsc computer science course intervening four months realised deeply inadequate formal education system experience survivor flawed system high school finishing class th ideally passed board examinations unfortunately batch whose exams cancelled due covid student chooses stream subjects wish pursue final two years schooling however often actually happens students parents decide stream student wishes pursue means students take science either maths group become engineer biology group become doctor parent liberal confident childs ineptitude may allow child take commerce often train child continue family business remaining stragglers take humanities computer science nerd maths group speak engineering side things though hear situation quite similar respects medical camp first thing typical science student joining class join coaching institute schools teach syllabus required board examinations syllabus cracking competitive exams joining college often taught schools theoretically possible clear entrance examinations studying school textbooks quite rare school skip several chapters textbook part boards syllabus study oh entrance exams give limited time per question apply certain tricks shortcuts common questions wont discussed theoryfocused textbooks riddled flowery language unending descriptions mundane coaching institutions almost necessity successful exams didnt take part classes instead opting home tuitions inherently qualified make derogatory remarks except visible outside visible outside pretty see least rat race coaching institutions clearly humongous businesses results season every available surface area newspapers billboards tv youtube ads plastered smiling faces toppers coaching institute faces hide rotten system built greed broken dreams let explain jee joint entrance examination one largest examinations world written million students get seat government funded engineering institutions btech course iits nits iiits gftis little yes read right million students trying get fifty thousand seats rat race dont know students took admissions iits around half studied coaching institutions ratio probably lower overall pool jee aspirants consider around taken coaching still students across nation word lucrative comment quality education imparted coaching classes leave imagination learning happening classrooms stuffed brim often hundreds students taught teacher legal responsibility teach concepts huge incentive get students rotelearn formulas coaching centres regulated law schools students going coaching centres instead often go dummy school school run coaching institutions conduct examinations practicals classes take place coaching centre students crack jee unable clear boards criteria never learnt theory taught actual schools know write pen paper exam students years old taking coaching often spend morning school afternoons coaching centres evenings selfstudy fact engineering students often say study joining college rather college taught treat classmates competitors rather classmates spend upwards two years continuously told relatives teachers parents perform well ridiculously difficult exam expect happen well happens best students get dreamt seat one indias best colleges best case scenario seen less students according previous calculation mind getting course interested common students especially iits choose whatever course available reputed college instead course actually interest especially true us interested computer science dream good placement everyone tries get computer science course irrespective whether interested cs resulting actually interested cs facing far difficult competition would otherwise students instead spend lakhs lakhs rupees per year something could never achieved everyone good physics chemistry maths expect take year study retake exam next year several times vast majority either take admission private college realise isnt meant move something else students pressure put family friends relatives teachers several years much handle absolute worst elements system rear ugly heads ugly bits another student kills self kota registers th suicide httpswwwhindustantimescomindiaanotherstudentkillsselfkotaregistersthsuicideinstoryfpywwbcqhkfimavvhlhtml shut iit coaching centres aspirant killed kota last week wrote suicide notehttpswwwindiatimescomnewsindiacloseiitcoachingcentresaspirantwhokilledherselfinkotalastweekwroteinhersuicidenotehtml two students commit suicide kota poor performance exam suspectedhttpsindianexpresscomarticleindiaindianewsindiatwomorestudentscommitsuicideinkotapoorperformanceinexamsuspected antisuicide ceiling fans prevent suicides indias coaching capital kotahttpswwwinuthcomindianowantisuicideceilingfanstopreventsuicidesinindiascoachingcapitalkota student allegedly commits suicide coaching institute kotahttpswwwnewscomnewsindiastudentallegedlycommitssuicideatcoachinginstituteinkotahtml coaching student suicide kota bihar girl jumps chambal river dieshttpswwwpinkcitypostcomcoachingstudentsuicideinkotabihargirljumpsintochambalriverdies iit aspirant found hanging hostel room kota rd suicide dayshttpswwwhindustantimescomindianewscoachingstudentcommitssuicideinkotathirdinfourdaysstoryffttdcvqmerlhqdohtml coaching class student committed suicide ahmedabad copshttpstimesofindiaindiatimescomcityahmedabadcoachingclassstudentcommittedsuicidecopsarticleshowcms coaching centre students die suicide kota payingguest roomshttpstheprintinindiacoachingcentrestudentsdiebysuicideinkotaintheirpayingguestrooms another coaching centre student dies suicide rajasthans kotahttpswwwhindustantimescomcitiesjaipurnewsanothercoachingcentrestudentdiesbysuicideinrajasthanskotahtml ones get reported difficult imagine coaching industry revenue crore rupees kota alone influence media able report exam entrance exam consists three papers physics chemistry mathematics course actually aiming role play subjects study sort logic cant student like wants pursue computer science attempt subjects relevant interests least also attempt subject going pursue students ever study computers studied physics chemistry maths able ace entrance test get seat computer science program dont even know interested whereas student lifelong interest computers much physics chemistry lucky get cs degree good private college let along public universities dont get seat wherever regardless quality education college leave dreams behind get whatever course good college even though experience interest subject fair done shut coaching centres set syllabus competitive exams strictly follow school system fact exam may easy excuse cutoffs best institutes naturally highest jee advanced paper entrance iits one hardest exams world whereas iits far best colleges world extension shut culture going kota study students able enjoy last two years homes families leaving college ensure schools teach board exams competitive exams mind remove board exams eligibility criteria giving entrance exam students good theory well known fact unlike government schools private schools almost always give full marks internal assessment students making unfair students public schools example got full marks practicals internal assessments physics chemistry maths comfortable sharing deserve maths physics strong points add subjects entrance exam instead physics chemistry maths offer subjects cs geography geology well make admissions different courses different subjects example btech cse could require maths cs btech metallurgy could require example chemistry geology mechanical engineering could require physics etc subjects like cs may difficult students rural backgrounds study cs school level option take cs marks physics maths could added merit subject combinations maybe others well could considered common universities entrance test cuet started last year good regards considers school syllabus several subjects choose different courses take merit different subject combinations engineering medical colleges also added cuet care given make sure different subject combinations considered various courses several problems current system solved one shot ",
    "cleaned_title": "student passed class wrote article education system india please let know thoughts",
    "cleaned_selftext": "earlier year wrote class th board examinations marks end school journey days ago got admission bsc computer science course intervening four months realised deeply inadequate formal education system experience survivor flawed system high school finishing class th ideally passed board examinations unfortunately batch whose exams cancelled due covid student chooses stream subjects wish pursue final two years schooling however often actually happens students parents decide stream student wishes pursue means students take science either maths group become engineer biology group become doctor parent liberal confident childs ineptitude may allow child take commerce often train child continue family business remaining stragglers take humanities computer science nerd maths group speak engineering side things though hear situation quite similar respects medical camp first thing typical science student joining class join coaching institute schools teach syllabus required board examinations syllabus cracking competitive exams joining college often taught schools theoretically possible clear entrance examinations studying school textbooks quite rare school skip several chapters textbook part boards syllabus study oh entrance exams give limited time per question apply certain tricks shortcuts common questions wont discussed theoryfocused textbooks riddled flowery language unending descriptions mundane coaching institutions almost necessity successful exams didnt take part classes instead opting home tuitions inherently qualified make derogatory remarks except visible outside visible outside pretty see least rat race coaching institutions clearly humongous businesses results season every available surface area newspapers billboards tv youtube ads plastered smiling faces toppers coaching institute faces hide rotten system built greed broken dreams let explain jee joint entrance examination one largest examinations world written million students get seat government funded engineering institutions btech course iits nits iiits gftis little yes read right million students trying get fifty thousand seats rat race dont know students took admissions iits around half studied coaching institutions ratio probably lower overall pool jee aspirants consider around taken coaching still students across nation word lucrative comment quality education imparted coaching classes leave imagination learning happening classrooms stuffed brim often hundreds students taught teacher legal responsibility teach concepts huge incentive get students rotelearn formulas coaching centres regulated law schools students going coaching centres instead often go dummy school school run coaching institutions conduct examinations practicals classes take place coaching centre students crack jee unable clear boards criteria never learnt theory taught actual schools know write pen paper exam students years old taking coaching often spend morning school afternoons coaching centres evenings selfstudy fact engineering students often say study joining college rather college taught treat classmates competitors rather classmates spend upwards two years continuously told relatives teachers parents perform well ridiculously difficult exam expect happen well happens best students get dreamt seat one indias best colleges best case scenario seen less students according previous calculation mind getting course interested common students especially iits choose whatever course available reputed college instead course actually interest especially true us interested computer science dream good placement everyone tries get computer science course irrespective whether interested cs resulting actually interested cs facing far difficult competition would otherwise students instead spend lakhs lakhs rupees per year something could never achieved everyone good physics chemistry maths expect take year study retake exam next year several times vast majority either take admission private college realise isnt meant move something else students pressure put family friends relatives teachers several years much handle absolute worst elements system rear ugly heads ugly bits another student kills self kota registers th suicide httpswwwhindustantimescomindiaanotherstudentkillsselfkotaregistersthsuicideinstoryfpywwbcqhkfimavvhlhtml shut iit coaching centres aspirant killed kota last week wrote suicide notehttpswwwindiatimescomnewsindiacloseiitcoachingcentresaspirantwhokilledherselfinkotalastweekwroteinhersuicidenotehtml two students commit suicide kota poor performance exam suspectedhttpsindianexpresscomarticleindiaindianewsindiatwomorestudentscommitsuicideinkotapoorperformanceinexamsuspected antisuicide ceiling fans prevent suicides indias coaching capital kotahttpswwwinuthcomindianowantisuicideceilingfanstopreventsuicidesinindiascoachingcapitalkota student allegedly commits suicide coaching institute kotahttpswwwnewscomnewsindiastudentallegedlycommitssuicideatcoachinginstituteinkotahtml coaching student suicide kota bihar girl jumps chambal river dieshttpswwwpinkcitypostcomcoachingstudentsuicideinkotabihargirljumpsintochambalriverdies iit aspirant found hanging hostel room kota rd suicide dayshttpswwwhindustantimescomindianewscoachingstudentcommitssuicideinkotathirdinfourdaysstoryffttdcvqmerlhqdohtml coaching class student committed suicide ahmedabad copshttpstimesofindiaindiatimescomcityahmedabadcoachingclassstudentcommittedsuicidecopsarticleshowcms coaching centre students die suicide kota payingguest roomshttpstheprintinindiacoachingcentrestudentsdiebysuicideinkotaintheirpayingguestrooms another coaching centre student dies suicide rajasthans kotahttpswwwhindustantimescomcitiesjaipurnewsanothercoachingcentrestudentdiesbysuicideinrajasthanskotahtml ones get reported difficult imagine coaching industry revenue crore rupees kota alone influence media able report exam entrance exam consists three papers physics chemistry mathematics course actually aiming role play subjects study sort logic cant student like wants pursue computer science attempt subjects relevant interests least also attempt subject going pursue students ever study computers studied physics chemistry maths able ace entrance test get seat computer science program dont even know interested whereas student lifelong interest computers much physics chemistry lucky get cs degree good private college let along public universities dont get seat wherever regardless quality education college leave dreams behind get whatever course good college even though experience interest subject fair done shut coaching centres set syllabus competitive exams strictly follow school system fact exam may easy excuse cutoffs best institutes naturally highest jee advanced paper entrance iits one hardest exams world whereas iits far best colleges world extension shut culture going kota study students able enjoy last two years homes families leaving college ensure schools teach board exams competitive exams mind remove board exams eligibility criteria giving entrance exam students good theory well known fact unlike government schools private schools almost always give full marks internal assessment students making unfair students public schools example got full marks practicals internal assessments physics chemistry maths comfortable sharing deserve maths physics strong points add subjects entrance exam instead physics chemistry maths offer subjects cs geography geology well make admissions different courses different subjects example btech cse could require maths cs btech metallurgy could require example chemistry geology mechanical engineering could require physics etc subjects like cs may difficult students rural backgrounds study cs school level option take cs marks physics maths could added merit subject combinations maybe others well could considered common universities entrance test cuet started last year good regards considers school syllabus several subjects choose different courses take merit different subject combinations engineering medical colleges also added cuet care given make sure different subject combinations considered various courses several problems current system solved one shot",
    "cleaned_comments": "well written couple initial thoughts mention success rate say calculation shown previously explicitly add calculation see numbers explicitly computed b tech courses even metallurgy mechanical engineering done without maths beyond point understand subjects courses without topics like calculus probability matrices etc cant engineering without maths good work op send editorial newspapers toi indian express hindu unfortunately sources available number students enrolled coaching classes calculations made basis numbers iit students took coaching total number gfti seats available k becomes complicated iits take candidates based jee advanced exam completely different syllabus school syllabus far students likely get iits coaching gftis entrance jee mains less based school syllabus difficult quantize impact access numbers number students gftis took coaching made assumption based previous numbers anecdotal evidence teachers classmates took candidates coaching conservative estimate based fact vast number students rural areas coaching centres unfortunately fidgety calculations best numbers could come explicitly mentioned fidgety calculations want distract main point add explanation actual article website syllabus subjects gave example thank letting know change thank consider dont think interested noice remember economics th economics planning chapter said first make list economic problems country start solving small problems couldnt stop laughing lol shut coaching centres set syllabus competitive exams strictly follow school system dont think ever happen unfortunately shut coaching centres set syllabus competitive exams strictly follow school system change recent years gave iit jee aieee exams syllabus part cbse class xii gave entrance exams none ever really questions arent part cbse logical reasoning questions arent really something need taught didnt coaching know quite people iit bits nits didnt tested even previous iitjee aieee question papers none questions ncert coaching centres came questions required descriptive answers options selected subjective answers cant really evaluated automatically give advantage ability write describe language solve ensure schools teach board exams competitive exams mind never happen even coaching centres teach entrance exams different batches different entrance exam cant expect teachers able cover competitive exam questions board exam questions different types questions syllabus fact exam may easy excuse cutoffs best institutes naturally highest jee advanced paper entrance iits one hardest exams world whereas iits far best colleges world extension shut culture going kota study students able enjoy last two years homes families leaving college students educated boarding schools millennia initial universities boarding cant really shutdown culture going kota isnt really different sending children delhi mumbai students able enjoy last years homes extremely privileged take someone cities tier cities towns dont really schools teachers good enough compete teachers delhi mumbai etc villages everyone wants move areas infrastructure offers highest pay think students rural areas compete remove board exams eligibility criteria giving entrance exam students good theory well known fact unlike government schools private schools almost always give full marks internal assessment students making unfair students public schools funny cant write boards making cut offs entrance exams whole cut added express purpose reduce importance coaching centres atleast force explain theory teach tricks get answer fastest also kidding going public school coaching centre arent getting marks arent clearing jee entrance exams add subjects entrance exam instead physics chemistry maths offer subjects cs geography geology well make admissions different courses different subjects example btech cse could require maths cs btech metallurgy could require example chemistry geology mechanical engineering could require physics etc understand called jee joint entrance exam reduce number entrance exams student needs give students streams willing learn increasing number tests need organized student needs put thought describing solution rather repeating old problems everyone knows",
    "light_cleaned_title": "As a student who passed class 12, I wrote an article about the Education system in India. Please let me know your thoughts!",
    "light_cleaned_selftext": "Earlier this year, I wrote my class 12th board examinations, which marks the end of my school journey. A few days ago, I got admission in a B.Sc. Computer Science course. In the intervening four months, I realised how deeply inadequate the formal education system is. This is my experience as a survivor of this flawed system. ## High School After finishing class 10th, and ideally having passed the board examinations (I was, unfortunately, in the batch whose exams were cancelled due to COVID) the student chooses a stream – what subjects they wish to pursue in the final two years of schooling. However, more often than not what actually happens is that the student’s parents decide which stream the student wishes to pursue, which means most students take science, either the Maths group (to become an engineer) or the Biology group (to become a doctor). If the parent is more liberal, or confident in their child’s ineptitude, they may allow the child to take commerce, often to train the child to continue the family business. A few remaining stragglers take humanities. I, being a computer science nerd, was in the Maths group, so I can only speak about the engineering side of things, though I hear the situation is quite similar in most respects in the medical camp, too. The first thing a typical science student does after joining class 11 is join a coaching institute, because the schools only teach the syllabus required for the board examinations. The syllabus for cracking the competitive exams for joining a college is often more than what is taught in the schools, and while it is theoretically possible to clear entrance examinations only by studying the school textbooks, this is quite rare. The school will skip several chapters from the textbook as they are not part of the boards syllabus, so you have to study those yourselves. Oh, and the entrance exams give very limited time per question, so you have to apply certain tricks or shortcuts to common questions which won’t be discussed in the theory-focused textbooks, which are riddled with flowery language and unending descriptions of the mundane. So, coaching institutions are almost a necessity to be successful in the exams. Now, I myself didn’t take part in any such classes, instead opting for home tuitions, so I am not inherently qualified to make derogatory remarks against them, except for what is visible about them from outside. And that which is visible from outside is not pretty, to see the least. ## The Rat Race The coaching institutions are clearly humongous businesses – during results season, every available surface area of newspapers, billboards, TV and YouTube ads are plastered with the smiling faces of the toppers from that coaching institute. What the faces hide is a rotten system, built on greed and broken dreams. Let me explain. JEE, or Joint Entrance Examination, is one of the largest examinations of the world. It is written by more than a million students each to get a seat in government funded engineering institutions for the B.Tech course, of which there are, over all the IITs, NITs, IIITs, and GFTIs, a little over 54,000. Yes, you read that right – there are over a million students trying to get just fifty thousand seats! If that is not a rat race, I don’t know what is. From the 16,000 students who took admissions in IITs in 2016, around half had studied from coaching institutions. The ratio is probably lower in the overall pool of JEE aspirants, but if you consider around 10% had taken coaching, that is still 1,00,000 students across the nation. That, in a word, is lucrative. Again, I cannot comment on the quality of education imparted in the coaching classes, but I will leave to your imagination the learning happening in classrooms stuffed to be the brim with often hundreds of students, being taught by a teacher with no legal responsibility to teach concepts and a huge incentive to get students to rote-learn formulas. Coaching centres, after all, are not regulated by any law, as they are not schools. Students going to coaching centres instead often go to a “dummy school”, which is a school run by the coaching institutions only to conduct examinations and practicals, while all the classes take place in the coaching centre. This is why some students who crack JEE are unable to clear the 75% in boards criteria, they have never learnt the theory taught by actual schools and do not know what to write in a pen and paper exam. Students, who are 16-18 years old, taking such coaching often spend their morning in school, afternoons in coaching centres, and evenings in self-study. In fact, engineering students often say they have to study the most before joining the college, rather than during college itself. They are taught to treat their classmates as their competitors rather than classmates, and spend upwards of two years continuously being told by relatives, teachers and parents to perform well in a ridiculously difficult exam. What do you expect to happen? Well, what happens is this. The best students get what they dreamt of – a seat in one of India’s best colleges. This is the best case scenario, and is seen by less 1% of the students, according to our previous calculation. Mind you, not all of these are getting into a course they are interested in! It is common for students, especially in IITs, to choose whatever course is available to them in a reputed college instead of a course they actually have interest in. This is especially true for those of us interested in computer science – because of the dream of a good placement, everyone tries to get a computer science course irrespective of whether they are interested in CS or not, resulting in those actually interested in CS facing a far more difficult competition than they would have otherwise. Most of the students instead spend lakhs and lakhs of rupees per year into something they could never have achieved – not everyone is good at physics, chemistry and maths, you can not expect them to! Some take a year off to study more and retake the exam next year – some do so several times. The vast majority either take admission into a private college, or realise this isn’t what they are meant for and move on to something else. But, for some students, the pressure put by the family, friends, relatives and teachers over several years is too much to handle. It is then, that the absolute worst elements of the system rear their ugly heads. ## The Ugly Bits [Another student kills self, Kota registers 20th suicide in 2015](https://www.hindustantimes.com/india/another-student-kills-self-kota-registers-20th-suicide-in-2015/story-FP6ywWb8CQHkf8ima2VVhL.html) [Shut Down IIT Coaching Centres, Aspirant Who Killed Herself In Kota Last Week Wrote In Her Suicide Note](https://www.indiatimes.com/news/india/close-iit-coaching-centres-aspirant-who-killed-herself-in-kota-last-week-wrote-in-her-suicide-note-254857.html) [Two more students commit suicide in Kota, poor performance in exam suspected](https://indianexpress.com/article/india/india-news-india/two-more-students-commit-suicide-in-kota-poor-performance-in-exam-suspected-2790355/) [Now, ‘anti-suicide’ ceiling fans to prevent suicides in India’s ‘coaching capital’ Kota](https://www.inuth.com/india/now-anti-suicide-ceiling-fans-to-prevent-suicides-in-indias-coaching-capital-kota/) [Student Allegedly Commits Suicide at Coaching Institute in Kota](https://www.news18.com/news/india/student-allegedly-commits-suicide-at-coaching-institute-in-kota-1266462.html) [Coaching student suicide in Kota: Bihar girl jumps into Chambal river, dies](https://www.pinkcitypost.com/coaching-student-suicide-in-kota-bihar-girl-jumps-into-chambal-river-dies/) [IIT aspirant found hanging in hostel room in Kota, 3rd suicide in 4 days](https://www.hindustantimes.com/india-news/coaching-student-commits-suicide-in-kota-third-in-four-days/story-6f4FT3TD3CVqmERlH4q6DO.html) [Coaching class student committed suicide: Ahmedabad cops](https://timesofindia.indiatimes.com/city/ahmedabad/coaching-class-student-committed-suicide-cops/articleshow/73001554.cms) [3 coaching centre students die by suicide in Kota in their paying-guest rooms](https://theprint.in/india/3-coaching-centre-students-die-by-suicide-in-kota-in-their-paying-guest-rooms/1262174/) [Another coaching centre student dies by suicide in Rajasthan’s Kota](https://www.hindustantimes.com/cities/jaipur-news/another-coaching-centre-student-dies-by-suicide-in-rajasthan-s-kota-101671807174442.html) And these are just the ones that get reported. It is not difficult to imagine that the coaching industry, which has a revenue of 1,700 crore rupees in Kota alone, has some influence on what the media is able to report! ## The Exam Itself The entrance exam itself consists of three papers – physics, chemistry and mathematics. The course you are actually aiming for has no role to play in what subjects you have to study. What sort of logic is that? Why can’t a student like me, who wants to pursue computer science, only have to attempt those subjects which are relevant to my interests? Or, at the very least, also have to attempt the subject I am going to pursue? Students who did not ever study computers but have studied physics, chemistry and maths, will be able to ace the entrance test and get a seat in a computer science program which they don’t even know if they are interested in, whereas a student who has had a lifelong interest in computers but not so much in physics or chemistry will be lucky to get a CS degree from a good private college, let along public universities. If they don’t, they have to get a seat wherever they can, regardless of the quality of education at the college. Or, they can leave their dreams behind and get whatever course they can from a good college, even though they have no experience or interest in the subject. how is this fair? ## What Can Be Done? 1. Shut down all coaching centres, and set the syllabus of the competitive exams to strictly follow that of the school system. The fact that the exam may be too easy is not an excuse: the cut-offs for the best institutes will naturally be the highest. The JEE Advanced paper for entrance to the IITs is one of the hardest exams in the world, whereas the IITs themselves are far from being the best colleges in the world! As an extension, shut down the culture of going to Kota to study. Students should be able to enjoy the last two years at their homes with their families before leaving for college. 2. Ensure that schools teach with both the board exams and the competitive exams in mind. 3. Remove the 75% in board exams eligibility criteria for giving the entrance exam. Not all students are good at theory, and it is a well known fact that, unlike government schools, private schools almost always give full marks in internal assessment to its students, making it unfair for students in public schools. For example, I got full marks in all my practicals and internal assessments in physics, chemistry and maths, which I am comfortable in sharing I did not deserve, as maths and physics are not my strong points. 4. Add all the subjects to the entrance exam. Instead of just physics, chemistry and maths, offer subjects such as CS, geography and geology as well. Make it such that admissions to different courses have different subjects: For example, B.Tech CSE could only require maths and CS, B.Tech Metallurgy could require, for example, chemistry and geology, mechanical engineering could only require physics etc. In subjects like CS, it may be difficult for students from rural backgrounds to study CS at the school level, so the option to take CS only with marks from physics and maths could be added, and the merit from both subject combinations (and maybe others as well) could be considered. The Common Universities Entrance Test (CUET) which was started last year, is very good in these regards because it only considers the school syllabus, it has several subjects to choose from, and different courses take merit of different subject combinations. If the engineering and medical colleges are also added to CUET, with care given to make sure different subject combinations are considered for various courses, several problems with the current system can be solved in one shot.",
    "light_cleaned_comments": "Very well written. A couple of initial thoughts... 1. You mention the 1% success rate and say that the calculation is shown previously. Can you explicitly add that calculation? I see there are numbers but the 1% is not explicitly computed. 2. The B. tech courses, even in metallurgy and mechanical engineering, cannot be done without Maths. Beyond a point you cannot understand subjects in these courses without topics like Calculus, probability, matrices etc. You can’t do engineering without maths. Good work OP. How about you send this to the editorial of some newspapers ? TOI, Indian Express, The Hindu 1. Unfortunately, there are no sources available for the number of students who are enrolled in coaching classes, so all calculations has to be made on the basis of the only numbers we have - 44% of IIT students took coaching in 2016, and the total number of GFTI seats available (50k). It becomes complicated because IITs take candidates based on the JEE Advanced exam, which has a completely different syllabus from the school syllabus, so far more students are likely to get into IITs after coaching than other GFTIs, where the entrance (JEE Mains) is more or less based on the school syllabus. It is difficult to quantize the impact of this. I do not have access to any numbers on the number of students in GFTIs who took coaching so I made an assumption based on the previous numbers and anecdotal evidence from teachers and classmates. I took \"10% of all candidates are in coaching\" as a very conservative estimate based on the fact that there is a vast number of students from rural areas with no coaching centres. Unfortunately these are very fidgety calculations but they are the best numbers I could come up with. I should have explicitly mentioned the fidgety calculations but I did not want to distract from the main point. I will add an explanation on this to the actual article on my website. 2. I am not of the syllabus in those subjects, so I only gave an example. Thank you for letting me know, I will change that. Thank you. I will consider it but I don't think they will be interested. Noice. I remember when I had economics in 12th, the economics planning chapter said \"First make a list of economic problems in the country and then start by solving small problems\" couldn't stop laughing lol > Shut down all coaching centres, and set the syllabus of the competitive exams to strictly follow that of the school system. I don't think this will ever happen unfortunately. > Shut down all coaching centres, and set the syllabus of the competitive exams to strictly follow that of the school system. Did this change in recent years? When I gave IIT JEE, and AIEEE, both exams had syllabus that was part of the CBSE Class XII. I gave more a few entrance exams, but none of them ever really had a questions that aren't part of CBSE. Logical reasoning questions aren't really something that need to be taught. I didn't do coaching, I know quite a few people from IIT, BITS, and NITS that didn't. I tested even the previous IITJEE and AIEEE question papers, none of the questions were out of NCERT. Coaching centres came up when there were questions that required descriptive answers and not just options to be selected. Subjective answers can't really be evaluated automatically. And, give advantage on ability to write and describe in a language than solve. > Ensure that schools teach with both the board exams and the competitive exams in mind. That will never happen. Even coaching centres that teach for entrance exams have different batches for different entrance exam. You can't expect teachers to be able to cover competitive exam questions and board exam questions. Those are different types of the questions from the same syllabus. > The fact that the exam may be too easy is not an excuse: the cut-offs for the best institutes will naturally be the highest. The JEE Advanced paper for entrance to the IITs is one of the hardest exams in the world, whereas the IITs themselves are far from being the best colleges in the world! As an extension, shut down the culture of going to Kota to study. Students should be able to enjoy the last two years at their homes with their families before leaving for college. Students have been educated in boarding schools for millennia. The initial Universities were boarding. You can't really shutdown culture of going to kota, that isn't really different than sending children to Delhi or Mumbai. That students should be able to enjoy last 2 years at their homes is an extremely privileged take for someone from cities. Tier 3-4 cities and towns don't really have schools with teachers good enough to compete with teachers from Delhi, Mumbai etc. Then you have villages. Everyone wants to move to areas that have infrastructure and offers highest pay, how do you think students from rural areas should compete? > Remove the 75% in board exams eligibility criteria for giving the entrance exam. Not all students are good at theory, and it is a well known fact that, unlike government schools, private schools almost always give full marks in internal assessment to its students, making it unfair for students in public schools. Funny? If you can't write boards, then you are not making cut offs for entrance exams. The whole 75% cut off was added for the express purpose to reduce importance of coaching centres or atleast force them to explain theory not just do teach tricks to get the answer fastest. Also, are you kidding, if you are going to a public school and not a coaching centre, and you aren't getting 75% marks, then you aren't clearing JEE or most entrance exams. > Add all the subjects to the entrance exam. Instead of just physics, chemistry and maths, offer subjects such as CS, geography and geology as well. Make it such that admissions to different courses have different subjects: For example, B.Tech CSE could only require maths and CS, B.Tech Metallurgy could require, for example, chemistry and geology, mechanical engineering could only require physics etc. Do you understand why it is called JEE - Joint Entrance Exam? It is reduce the number of entrance exams a student needs to give. Most students have more than 1-2 streams that they are willing to learn? You are increasing the number of tests that need to organized and student needs to do. You should have put more thought on describing solution rather than repeating the same old problems that everyone knows."
}