{
    "id": "1hnabq5",
    "title": "There will never be Nationalised healthcare or education in India.",
    "url": "https://www.reddit.com/r/india/comments/1hnabq5/there_will_never_be_nationalised_healthcare_or/",
    "selftext": "I was wondering the cost of Nationalised heatlthcare and education in India.   \nNationalised healthcare was expensive and could over run the 70% of Central government tax collection.   \nBut Nationalised education was possible with around 20% of current income tax collection could possibly fund the education. \n\nBut then I remembered our Brij bhushan singh of BJP owns 54 educational institutes.   \nKailash hospital of Noida also belongs to some politician, and so do other educational and health institutes.   \nOur politicians have no incentive in Nationalising healthcare and education even when possible (not possible at current tax collection). \n\nDelhi was able to implement it due to high tax collection per capita, even they won't be able to do it. \n\nLink to brijbhushan singh educational institutes number  \n[https://indianexpress.com/article/india/brij-bhushan-gonda-raj-over-50-colleges-schools-hospitals-hotel-8656158/](https://indianexpress.com/article/india/brij-bhushan-gonda-raj-over-50-colleges-schools-hospitals-hotel-8656158/)",
    "flair": "Policy/Economy",
    "score": 22,
    "num_comments": 19,
    "created_utc": 1735287197.0,
    "convurl": "https://external-preview.redd.it/eOMAfg647-qq95GwpMk5mn6ww92Re6-BrZCI8otkWZY.jpg?auto=webp&s=9feb9c1861572e7d58eefa69e39d553fc7bb5cae",
    "comments": [
        "Nationalised healthcare for 1.4 billion people ?? Lol",
        "Yes.",
        "could cost 300 Billion dollar, not possible",
        " Its not possible",
        "Do these people live in alternate reality? India is a poor country. India needs to generate wealth first before providing such benefits. \n \nWe cannot become Norway overnight, those countries have more natural resources than all of India and have a population less than that of south Bombay.",
        "We have already tried socialism prior to the Manmohan reforms. It didn’t work.",
        "It is possible, just the politicians are in the way - as always.",
        "Its possible if you cut funding from every other public sector by 90%. Our nation is not a healthy one like Scandinavian countries. Every household had BP and diabetes.  Pollution , smoking,  tobacco makes everything worse.",
        "It's quite possible to scale up healthcare without obscene spending. Look at our priorities, even scaling up primary Healthcare will solve so much. But then we keep building AIIMS in random parts of the country. Triaging seems non existent here.\n\nWHO has scores of resources on how to scale up Healthcare in poorer countries, we just aren't willing to follow it.",
        "Well not every poorer country has a population of 1.4 billion.",
        "That's not a good enough excuse. China manages it as well. Plus there are always answers available on how to scale up.",
        "China makes that amount of money to be able to do that. Also there gov model is very different from ours. Comparison with China is ridiculous unless we have the same gov model. Nationalise healthcare also demands exponential investments,  look at UK , it takes a month for a GP appointment.",
        "UK and every other nationalized Healthcare system works on the basis of priority. You have to wait a month if initial assessment says you aren't suffering from anything serious.\n\nThis is what I mean by triaging. Not every instance of cold requires to be first in line at a doctor. That's a waste of resources. Have a paracetamol and an anti allergy tablet and stay out.",
        "Nationalized healthcare and education in India aren’t impossible. Hard? Yes. But not impossible. Other countries with massive populations, like China or Brazil, have done it. The problem isn’t the lack of money or resources: it’s the lack of will to make it happen.\n\nHealthcare can start small. The government doesn’t need to take over every hospital overnight. They can start with basic universal health coverage (stuff like vaccines, maternal care, and primary treatments). **Private hospitals could be forced to cap prices for critical services, so healthcare isn’t just for the rich.** At the same time, public spending on healthcare has to go up. Right now, it’s barely 1% of GDP. Bump that to 3%, and you’ve got money for better rural clinics, public hospitals, and affordable meds. How do you pay for that? Fix the tax system!! Widen the base, crack down on evasion, and there’s your budget.\n\nEducation is way more doable than healthcare. The government already runs public schools and colleges; they’re just underfunded and ignored. **Fix the basics.** Better infrastructure, better teachers, better curriculums. Raise education spending to 6% of GDP, which is totally realistic if the tax base grows. The bigger problem? Politicians. So many of them own private schools and colleges, so they have no reason to fix public education. They make money when the system stays broken. There needs to be a law stopping them from profiting off this. If public education gets stronger, private schools lose their grip.\n\nThe elephant in the room is **corruption**. Every good plan fails if money gets stolen. The government needs to use tech to track where every rupee goes and hit back hard at corruption. No slap-on-the-wrist stuff **REAL punishments, made PUBLIC**. People need to trust that public systems actually work. And let’s face it, none of this happens unless citizens demand it. Politicians only move when they feel pressure.\n\nThis isn’t about fixing everything at once. Start small, focus on what matters, and build from there. Delhi’s already proven it’s possible (better healthcare and education are working there because tax collection is higher, and governance is stronger). India can do this. The resources are there. **It’s just about finding the guts to make it happen.**",
        "There is nationalized corruption, filth, honking.",
        "Except we do have nationalised healthcare for half the country, called PMJAY.",
        "It's like getting Auto insurance when the car is blinking all the engine lights. \nIndians are very very unhealthy and the environment makes it worse. \nTo have such socialized care you need to get the general Health of the current young population up, then in 30 years when we are ready for social healthcare financially and politically we will have a lower burden of health care to start with. \n\nCurrent 30 year olds are as healthy as a European 60 year old. Obese or skinny fat, poor diet and no exercise regimen, they will be a huge drain in 30 years.\nGood luck to this country. I would bet my life savings against India if there is a financial vehicle for it.",
        "You are not taking into consideration the money saved by the citizens by not having to pay for private healthcare, that goes into economy. Also a healthy person is more productive and that also adds to economy. If Indians can get cheap or free primary healthcare, diseases will not progress to need specialists or hospital care as much as today. Gov should allow Ayushman Bharat card to be used to pay for doctor’s fee, tests and medicines rather than hospital stays. It may even save them money.",
        "Yes, just like pulse polio dosage program.",
        "Large population also means we can reduce many costs.   It is better to try and fail than not try at all"
    ],
    "cleaned_text": "never nationalised healthcare education india wondering cost nationalised heatlthcare education india nationalised healthcare expensive could run central government tax collection nationalised education possible around current income tax collection could possibly fund education remembered brij bhushan singh bjp owns educational institutes kailash hospital noida also belongs politician educational health institutes politicians incentive nationalising healthcare education even possible possible current tax collection delhi able implement due high tax collection per capita even wont able link brijbhushan singh educational institutes number httpsindianexpresscomarticleindiabrijbhushangondarajovercollegesschoolshospitalshotelhttpsindianexpresscomarticleindiabrijbhushangondarajovercollegesschoolshospitalshotel ",
    "cleaned_title": "never nationalised healthcare education india",
    "cleaned_selftext": "wondering cost nationalised heatlthcare education india nationalised healthcare expensive could run central government tax collection nationalised education possible around current income tax collection could possibly fund education remembered brij bhushan singh bjp owns educational institutes kailash hospital noida also belongs politician educational health institutes politicians incentive nationalising healthcare education even possible possible current tax collection delhi able implement due high tax collection per capita even wont able link brijbhushan singh educational institutes number httpsindianexpresscomarticleindiabrijbhushangondarajovercollegesschoolshospitalshotelhttpsindianexpresscomarticleindiabrijbhushangondarajovercollegesschoolshospitalshotel",
    "cleaned_comments": "nationalised healthcare billion people lol yes could cost billion dollar possible possible people live alternate reality india poor country india needs generate wealth first providing benefits become norway overnight countries natural resources india population less south bombay already tried socialism prior manmohan reforms didnt work possible politicians way always possible cut funding every public sector nation healthy one like scandinavian countries every household bp diabetes pollution smoking tobacco makes everything worse quite possible scale healthcare without obscene spending look priorities even scaling primary healthcare solve much keep building aiims random parts country triaging seems non existent scores resources scale healthcare poorer countries arent willing follow well every poorer country population billion thats good enough excuse china manages well plus always answers available scale china makes amount money able also gov model different comparison china ridiculous unless gov model nationalise healthcare also demands exponential investments look uk takes month gp appointment uk every nationalized healthcare system works basis priority wait month initial assessment says arent suffering anything serious mean triaging every instance cold requires first line doctor thats waste resources paracetamol anti allergy tablet stay nationalized healthcare education india arent impossible hard yes impossible countries massive populations like china brazil done problem isnt lack money resources lack make happen healthcare start small government doesnt need take every hospital overnight start basic universal health coverage stuff like vaccines maternal care primary treatments private hospitals could forced cap prices critical services healthcare isnt rich time public spending healthcare go right barely gdp bump youve got money better rural clinics public hospitals affordable meds pay fix tax system widen base crack evasion theres budget education way doable healthcare government already runs public schools colleges theyre underfunded ignored fix basics better infrastructure better teachers better curriculums raise education spending gdp totally realistic tax base grows bigger problem politicians many private schools colleges reason fix public education make money system stays broken needs law stopping profiting public education gets stronger private schools lose grip elephant room corruption every good plan fails money gets stolen government needs use tech track every rupee goes hit back hard corruption slaponthewrist stuff real punishments made public people need trust public systems actually work lets face none happens unless citizens demand politicians move feel pressure isnt fixing everything start small focus matters build delhis already proven possible better healthcare education working tax collection higher governance stronger india resources finding guts make happen nationalized corruption filth honking except nationalised healthcare half country called pmjay like getting auto insurance car blinking engine lights indians unhealthy environment makes worse socialized care need get general health current young population years ready social healthcare financially politically lower burden health care start current year olds healthy european year old obese skinny fat poor diet exercise regimen huge drain years good luck country would bet life savings india financial vehicle taking consideration money saved citizens pay private healthcare goes economy also healthy person productive also adds economy indians get cheap free primary healthcare diseases progress need specialists hospital care much today gov allow ayushman bharat card used pay doctors fee tests medicines rather hospital stays may even save money yes like pulse polio dosage program large population also means reduce many costs better try fail try",
    "light_cleaned_title": "There will never be Nationalised healthcare or education in India.",
    "light_cleaned_selftext": "I was wondering the cost of Nationalised heatlthcare and education in India. Nationalised healthcare was expensive and could over run the 70% of Central government tax collection. But Nationalised education was possible with around 20% of current income tax collection could possibly fund the education. But then I remembered our Brij bhushan singh of BJP owns 54 educational institutes. Kailash hospital of Noida also belongs to some politician, and so do other educational and health institutes. Our politicians have no incentive in Nationalising healthcare and education even when possible (not possible at current tax collection). Delhi was able to implement it due to high tax collection per capita, even they won't be able to do it. Link to brijbhushan singh educational institutes number [https://indianexpress.com/article/india/brij-bhushan-gonda-raj-over-50-colleges-schools-hospitals-hotel-8656158/](https://indianexpress.com/article/india/brij-bhushan-gonda-raj-over-50-colleges-schools-hospitals-hotel-8656158/)",
    "light_cleaned_comments": "Nationalised healthcare for 1.4 billion people ?? Lol Yes. could cost 300 Billion dollar, not possible Its not possible Do these people live in alternate reality? India is a poor country. India needs to generate wealth first before providing such benefits. We cannot become Norway overnight, those countries have more natural resources than all of India and have a population less than that of south Bombay. We have already tried socialism prior to the Manmohan reforms. It didn’t work. It is possible, just the politicians are in the way - as always. Its possible if you cut funding from every other public sector by 90%. Our nation is not a healthy one like Scandinavian countries. Every household had BP and diabetes. Pollution , smoking, tobacco makes everything worse. It's quite possible to scale up healthcare without obscene spending. Look at our priorities, even scaling up primary Healthcare will solve so much. But then we keep building AIIMS in random parts of the country. Triaging seems non existent here. WHO has scores of resources on how to scale up Healthcare in poorer countries, we just aren't willing to follow it. Well not every poorer country has a population of 1.4 billion. That's not a good enough excuse. China manages it as well. Plus there are always answers available on how to scale up. China makes that amount of money to be able to do that. Also there gov model is very different from ours. Comparison with China is ridiculous unless we have the same gov model. Nationalise healthcare also demands exponential investments, look at UK , it takes a month for a GP appointment. UK and every other nationalized Healthcare system works on the basis of priority. You have to wait a month if initial assessment says you aren't suffering from anything serious. This is what I mean by triaging. Not every instance of cold requires to be first in line at a doctor. That's a waste of resources. Have a paracetamol and an anti allergy tablet and stay out. Nationalized healthcare and education in India aren’t impossible. Hard? Yes. But not impossible. Other countries with massive populations, like China or Brazil, have done it. The problem isn’t the lack of money or resources: it’s the lack of will to make it happen. Healthcare can start small. The government doesn’t need to take over every hospital overnight. They can start with basic universal health coverage (stuff like vaccines, maternal care, and primary treatments). **Private hospitals could be forced to cap prices for critical services, so healthcare isn’t just for the rich.** At the same time, public spending on healthcare has to go up. Right now, it’s barely 1% of GDP. Bump that to 3%, and you’ve got money for better rural clinics, public hospitals, and affordable meds. How do you pay for that? Fix the tax system!! Widen the base, crack down on evasion, and there’s your budget. Education is way more doable than healthcare. The government already runs public schools and colleges; they’re just underfunded and ignored. **Fix the basics.** Better infrastructure, better teachers, better curriculums. Raise education spending to 6% of GDP, which is totally realistic if the tax base grows. The bigger problem? Politicians. So many of them own private schools and colleges, so they have no reason to fix public education. They make money when the system stays broken. There needs to be a law stopping them from profiting off this. If public education gets stronger, private schools lose their grip. The elephant in the room is **corruption**. Every good plan fails if money gets stolen. The government needs to use tech to track where every rupee goes and hit back hard at corruption. No slap-on-the-wrist stuff **REAL punishments, made PUBLIC**. People need to trust that public systems actually work. And let’s face it, none of this happens unless citizens demand it. Politicians only move when they feel pressure. This isn’t about fixing everything at once. Start small, focus on what matters, and build from there. Delhi’s already proven it’s possible (better healthcare and education are working there because tax collection is higher, and governance is stronger). India can do this. The resources are there. **It’s just about finding the guts to make it happen.** There is nationalized corruption, filth, honking. Except we do have nationalised healthcare for half the country, called PMJAY. It's like getting Auto insurance when the car is blinking all the engine lights. Indians are very very unhealthy and the environment makes it worse. To have such socialized care you need to get the general Health of the current young population up, then in 30 years when we are ready for social healthcare financially and politically we will have a lower burden of health care to start with. Current 30 year olds are as healthy as a European 60 year old. Obese or skinny fat, poor diet and no exercise regimen, they will be a huge drain in 30 years. Good luck to this country. I would bet my life savings against India if there is a financial vehicle for it. You are not taking into consideration the money saved by the citizens by not having to pay for private healthcare, that goes into economy. Also a healthy person is more productive and that also adds to economy. If Indians can get cheap or free primary healthcare, diseases will not progress to need specialists or hospital care as much as today. Gov should allow Ayushman Bharat card to be used to pay for doctor’s fee, tests and medicines rather than hospital stays. It may even save them money. Yes, just like pulse polio dosage program. Large population also means we can reduce many costs. It is better to try and fail than not try at all"
}