{
    "id": "17xfxwi",
    "title": "Airport scam alert",
    "url": "https://www.reddit.com/r/india/comments/17xfxwi/airport_scam_alert/",
    "selftext": "Location: Airports - Domestic\n\n**MO**\n\nThese guys use a LPU student Id Card(Lovely Professional University) and say they missed their flight….Asks for a phone to call mom….phone is switched off...Dad works overseas\n\nThen ask for some money to buy a ticket and promise to return it after they establish contact with mom\n\nObviously abscond with the money\n\nHappened with me recently, but looks like these guys operate as a network across the country….If you see anyone with Id card, walk away or better yet, Call the police.\n\n[Link!](https://mumbaiairport.in/complaints/fraud-person-at-t2-cheating-passengers-and-taking-money-fyi-and-action/)",
    "flair": "Crime",
    "score": 326,
    "num_comments": 35,
    "created_utc": 1700230392.0,
    "convurl": "https://external-preview.redd.it/g-fqy5dGxlpBefZ8uNbljOHm-KsdtidPP8C-r_uWDs0.jpg?auto=webp&s=5c5fa8d8eacfb85c8099e0c8d108910c8f173711",
    "comments": [
        "Honestly, getting anc earbuds has been a gamechanger. No wonder so many people in public spaces are wearing earbuds or headphones. Even if I can hear the person slightly in public space, it is just easy to ignore and move on. So many kids and old ladies begging in the local market. I mean I go there multiple times a week. Even if I give once, it is going to invite more harassment. Ignoring has been the best move.",
        "We are the land of Scams! \n\nOur ingenuity has gravitated towards making a fast buck instead of making a change for the betterment.\n\nNo wonder trust levels amongst the citizens is pathetically low.",
        "There are so many scams around us. I can't even tell who is in need of genuine help, so I end up ignoring any kind of requests. Main toh \"skill issue, mate\" bolke nikal leta hu",
        "So his name is Modela Venkata Dinesh Kumar, he is from Guntur roams around airports in the country scamming people. \n\nHe is a serial offender, scams people gets arrested comes out on bail and start all over again. \n\nGoogle his name and you will see he has been arrested so many times from 2020 to 2023. \n\nBased on few other Tweets and Reddits posts this man has been scamming again this year late November. \n\nStay safe if you come across this garbage, report him to CRPF they will take care of him.",
        "not a fucking solution, what if the person does need help. what if he is speaking the truth. listening doesn't harm anyone.",
        "To those people, I enthusiastically point to the nearest police officer saying that they will help them.",
        "This actually happened to me a while back in IGI, New Delhi. A decent looking student approached me with the same exact reasons. It felt so real that I genuinely felt bad after denying him even a call. Now I feel better considering this is a widespread scam.",
        "I don't know much about law but can you just, regularly come out of jail on bail? Again and again?",
        "have u ever came across such a person in need really? I have and eventually police is called and police helps, police is the solution and not ur money",
        "These type of people fall for the scams",
        "Scammers like this will prevent people helping out even for genuine ones.\nI was in Chennai airport when a guy next to me was asking for my phone to make a call to his friend. Apparently his SIM got deactivated and had no way to even connect to the airport wifi as it required an OTP.\nHearing about all the scams I was skeptical about handing my phone over to him that I mentioned I was on International roaming and offered to pay cash to call from a Phone booth.",
        "Honestly this one time someone asked me to pay for their Uber/lend them cash to book an uber. It was the first time it ever happened so i didn't want to assume it's a scam. I started to explain that they can connect to their UPI and pay later when they get back home or something if they can't rn. \n\nThe dude just went away. Didn't even bother saying another word as a response.",
        " you guys are just giving him money or booking his tickets?",
        "The Actual Fuck!!\nSo I googled his name, and he's the same person I encountered a few days back at the airport.\n\nI was flying from Ahmedabad to Goa, and he asked me for 10k to buy a new ticket as he missed his current flight to Hyderabad. He shows his LPU student card, and talks in a very sophisticated manner. He asked me to lend him 10k which he'd return in 5 minutes as his mother was waiting for him outside the airport. I refused to help and later was even guilty about the same.\n\nIncidents like these, and I'm starting to lose trust on strangers.",
        "I think I met this guy. Says Dad works in California. It's a very convincing scam but don't know if he makes any profit. He roams around in the boarding area so he has to buy a ticket himself to enter.",
        "Its because of these fucks that the ones in need done get the help they should get",
        "He's a cool guy.",
        "On his id card, \"www.info\" should be a dead give away.\nIf that's not enough deterrent, I don't know what is.",
        "I'd say if anyone comes across this vile shit, beat him up to avenge those who he cheated. Reporting to cops will again turn out to be a bail (unless the cops are involved too then bail is just a façade).",
        "Airport Authority ke pass bhi phone rehta hai. Ask such scamsters to call from there.",
        "Suckers are creating a bad rep for my Alma matter now? C'mon guys use some IIT cards at least.",
        "Bad rep for LPU?? Lol",
        "I don't think it's just one guy....Its a network or atleast 5-6 people minimum",
        "Yeah I meant in a sarcastic way. Like use something that makes you look atleast a bit legit and in need",
        "India is infamous already for the land of scams, government does shit.",
        "If someone ever asks you for money just like that, don't believe them, cut them off straight right up there. If they ever come to fight you for that, go to an armed CISF who has the biggest gun there and tell him about this. They'll get scared shitless.",
        "bruh just don't trust these people.",
        "Scam and fakery is beyond control now.",
        "My mobile phone had lost charge and I asked a lady nearby if she could lend her charger for a while as I had misplaced mine.\n\nShe refused lol. I still wonder how people ask for money. I felt bad asking for a charger just to charge my phone for 5 mins.",
        "There are two primary reasons I made this post\n\n**Sympathy and** **Empathy**\n\nI wouldn't care too much about scams exploiting greed**.** These fucks are exploiting people's willingness to help and using students' image to do so.  I'm generally a dick who doesn't trust people anyway, but there are really sweet people out there trying to genuinely help and I don't want them to lose that trust in people. Most comments here are highlighting exactly what I'm worried about....that we're all better off ignoring and walking away from the plight of people who actually need help\n\n**Raise Awareness**\n\nI didnt lose much(1500) but when I dug a little, I realised some people have lost upwards of 10k  and this was a regular scam with the same MO across domestic terminals in India. These sort of scams are easier to shut down with some sort of awareness because they are stuck in a closed environment...They are physically present and are likely to have spent money on a legit ticket and stuck inside the terminal with no real exit...They are banking on people merely refusing and walking away instead of calling the cops",
        "When someone will genuinely need help people will not be able to help them because of such incidents…🥲",
        "Bro i swear similar incident happened with me when i was going to vijayawada from delhi and vijayawada and guntur are super close but i thought that guy  was genuinely looking for help. Fuck man these guys act better than some of the finest actors itw.",
        "This happened to me at Chennai airport many years ago in 2018 IIRC. I was in a rush and moved on not sure if it's the same guy.",
        "I don't think it's a good idea to start violence inside an airport.",
        "People will stop helping genuine people because of incidents like these."
    ],
    "cleaned_text": "airport scam alert location airports domestic mo guys use lpu student id cardlovely professional university say missed flightasks phone call momphone switched offdad works overseas ask money buy ticket promise return establish contact mom obviously abscond money happened recently looks like guys operate network across countryif see anyone id card walk away better yet call police linkhttpsmumbaiairportincomplaintsfraudpersonattcheatingpassengersandtakingmoneyfyiandaction ",
    "cleaned_title": "airport scam alert",
    "cleaned_selftext": "location airports domestic mo guys use lpu student id cardlovely professional university say missed flightasks phone call momphone switched offdad works overseas ask money buy ticket promise return establish contact mom obviously abscond money happened recently looks like guys operate network across countryif see anyone id card walk away better yet call police linkhttpsmumbaiairportincomplaintsfraudpersonattcheatingpassengersandtakingmoneyfyiandaction",
    "cleaned_comments": "honestly getting anc earbuds gamechanger wonder many people public spaces wearing earbuds headphones even hear person slightly public space easy ignore move many kids old ladies begging local market mean go multiple times week even give going invite harassment ignoring best move land scams ingenuity gravitated towards making fast buck instead making change betterment wonder trust levels amongst citizens pathetically low many scams around us cant even tell need genuine help end ignoring kind requests main toh skill issue mate bolke nikal leta hu name modela venkata dinesh kumar guntur roams around airports country scamming people serial offender scams people gets arrested comes bail start google name see arrested many times based tweets reddits posts man scamming year late november stay safe come across garbage report crpf take care fucking solution person need help speaking truth listening doesnt harm anyone people enthusiastically point nearest police officer saying help actually happened back igi new delhi decent looking student approached exact reasons felt real genuinely felt bad denying even call feel better considering widespread scam dont know much law regularly come jail bail u ever came across person need really eventually police called police helps police solution ur money type people fall scams scammers like prevent people helping even genuine ones chennai airport guy next asking phone make call friend apparently sim got deactivated way even connect airport wifi required otp hearing scams skeptical handing phone mentioned international roaming offered pay cash call phone booth honestly one time someone asked pay uberlend cash book uber first time ever happened didnt want assume scam started explain connect upi pay later get back home something cant rn dude went away didnt even bother saying another word response guys giving money booking tickets actual fuck googled name hes person encountered days back airport flying ahmedabad goa asked k buy new ticket missed current flight hyderabad shows lpu student card talks sophisticated manner asked lend k hed return minutes mother waiting outside airport refused help later even guilty incidents like im starting lose trust strangers think met guy says dad works california convincing scam dont know makes profit roams around boarding area buy ticket enter fucks ones need done get help get hes cool guy id card wwwinfo dead give away thats enough deterrent dont know id say anyone comes across vile shit beat avenge cheated reporting cops turn bail unless cops involved bail faade airport authority ke pass bhi phone rehta hai ask scamsters call suckers creating bad rep alma matter cmon guys use iit cards least bad rep lpu lol dont think one guyits network atleast people minimum yeah meant sarcastic way like use something makes look atleast bit legit need india infamous already land scams government shit someone ever asks money like dont believe cut straight right ever come fight go armed cisf biggest gun tell theyll get scared shitless bruh dont trust people scam fakery beyond control mobile phone lost charge asked lady nearby could lend charger misplaced mine refused lol still wonder people ask money felt bad asking charger charge phone mins two primary reasons made post sympathy empathy wouldnt care much scams exploiting greed fucks exploiting peoples willingness help using students image im generally dick doesnt trust people anyway really sweet people trying genuinely help dont want lose trust people comments highlighting exactly im worried aboutthat better ignoring walking away plight people actually need help raise awareness didnt lose much dug little realised people lost upwards k regular scam mo across domestic terminals india sort scams easier shut sort awareness stuck closed environmentthey physically present likely spent money legit ticket stuck inside terminal real exitthey banking people merely refusing walking away instead calling cops someone genuinely need help people able help incidents bro swear similar incident happened going vijayawada delhi vijayawada guntur super close thought guy genuinely looking help fuck man guys act better finest actors itw happened chennai airport many years ago iirc rush moved sure guy dont think good idea start violence inside airport people stop helping genuine people incidents like",
    "light_cleaned_title": "Airport scam alert",
    "light_cleaned_selftext": "Location: Airports - Domestic **MO** These guys use a LPU student Id Card(Lovely Professional University) and say they missed their flight….Asks for a phone to call mom….phone is switched off...Dad works overseas Then ask for some money to buy a ticket and promise to return it after they establish contact with mom Obviously abscond with the money Happened with me recently, but looks like these guys operate as a network across the country….If you see anyone with Id card, walk away or better yet, Call the police. [Link!](https://mumbaiairport.in/complaints/fraud-person-at-t2-cheating-passengers-and-taking-money-fyi-and-action/)",
    "light_cleaned_comments": "Honestly, getting anc earbuds has been a gamechanger. No wonder so many people in public spaces are wearing earbuds or headphones. Even if I can hear the person slightly in public space, it is just easy to ignore and move on. So many kids and old ladies begging in the local market. I mean I go there multiple times a week. Even if I give once, it is going to invite more harassment. Ignoring has been the best move. We are the land of Scams! Our ingenuity has gravitated towards making a fast buck instead of making a change for the betterment. No wonder trust levels amongst the citizens is pathetically low. There are so many scams around us. I can't even tell who is in need of genuine help, so I end up ignoring any kind of requests. Main toh \"skill issue, mate\" bolke nikal leta hu So his name is Modela Venkata Dinesh Kumar, he is from Guntur roams around airports in the country scamming people. He is a serial offender, scams people gets arrested comes out on bail and start all over again. Google his name and you will see he has been arrested so many times from 2020 to 2023. Based on few other Tweets and Reddits posts this man has been scamming again this year late November. Stay safe if you come across this garbage, report him to CRPF they will take care of him. not a fucking solution, what if the person does need help. what if he is speaking the truth. listening doesn't harm anyone. To those people, I enthusiastically point to the nearest police officer saying that they will help them. This actually happened to me a while back in IGI, New Delhi. A decent looking student approached me with the same exact reasons. It felt so real that I genuinely felt bad after denying him even a call. Now I feel better considering this is a widespread scam. I don't know much about law but can you just, regularly come out of jail on bail? Again and again? have u ever came across such a person in need really? I have and eventually police is called and police helps, police is the solution and not ur money These type of people fall for the scams Scammers like this will prevent people helping out even for genuine ones. I was in Chennai airport when a guy next to me was asking for my phone to make a call to his friend. Apparently his SIM got deactivated and had no way to even connect to the airport wifi as it required an OTP. Hearing about all the scams I was skeptical about handing my phone over to him that I mentioned I was on International roaming and offered to pay cash to call from a Phone booth. Honestly this one time someone asked me to pay for their Uber/lend them cash to book an uber. It was the first time it ever happened so i didn't want to assume it's a scam. I started to explain that they can connect to their UPI and pay later when they get back home or something if they can't rn. The dude just went away. Didn't even bother saying another word as a response. you guys are just giving him money or booking his tickets? The Actual Fuck!! So I googled his name, and he's the same person I encountered a few days back at the airport. I was flying from Ahmedabad to Goa, and he asked me for 10k to buy a new ticket as he missed his current flight to Hyderabad. He shows his LPU student card, and talks in a very sophisticated manner. He asked me to lend him 10k which he'd return in 5 minutes as his mother was waiting for him outside the airport. I refused to help and later was even guilty about the same. Incidents like these, and I'm starting to lose trust on strangers. I think I met this guy. Says Dad works in California. It's a very convincing scam but don't know if he makes any profit. He roams around in the boarding area so he has to buy a ticket himself to enter. Its because of these fucks that the ones in need done get the help they should get He's a cool guy. On his id card, \"www.info\" should be a dead give away. If that's not enough deterrent, I don't know what is. I'd say if anyone comes across this vile shit, beat him up to avenge those who he cheated. Reporting to cops will again turn out to be a bail (unless the cops are involved too then bail is just a façade). Airport Authority ke pass bhi phone rehta hai. Ask such scamsters to call from there. Suckers are creating a bad rep for my Alma matter now? C'mon guys use some IIT cards at least. Bad rep for LPU?? Lol I don't think it's just one guy....Its a network or atleast 5-6 people minimum Yeah I meant in a sarcastic way. Like use something that makes you look atleast a bit legit and in need India is infamous already for the land of scams, government does shit. If someone ever asks you for money just like that, don't believe them, cut them off straight right up there. If they ever come to fight you for that, go to an armed CISF who has the biggest gun there and tell him about this. They'll get scared shitless. bruh just don't trust these people. Scam and fakery is beyond control now. My mobile phone had lost charge and I asked a lady nearby if she could lend her charger for a while as I had misplaced mine. She refused lol. I still wonder how people ask for money. I felt bad asking for a charger just to charge my phone for 5 mins. There are two primary reasons I made this post **Sympathy and** **Empathy** I wouldn't care too much about scams exploiting greed**.** These fucks are exploiting people's willingness to help and using students' image to do so. I'm generally a dick who doesn't trust people anyway, but there are really sweet people out there trying to genuinely help and I don't want them to lose that trust in people. Most comments here are highlighting exactly what I'm worried about....that we're all better off ignoring and walking away from the plight of people who actually need help **Raise Awareness** I didnt lose much(1500) but when I dug a little, I realised some people have lost upwards of 10k and this was a regular scam with the same MO across domestic terminals in India. These sort of scams are easier to shut down with some sort of awareness because they are stuck in a closed environment...They are physically present and are likely to have spent money on a legit ticket and stuck inside the terminal with no real exit...They are banking on people merely refusing and walking away instead of calling the cops When someone will genuinely need help people will not be able to help them because of such incidents…🥲 Bro i swear similar incident happened with me when i was going to vijayawada from delhi and vijayawada and guntur are super close but i thought that guy was genuinely looking for help. Fuck man these guys act better than some of the finest actors itw. This happened to me at Chennai airport many years ago in 2018 IIRC. I was in a rush and moved on not sure if it's the same guy. I don't think it's a good idea to start violence inside an airport. People will stop helping genuine people because of incidents like these."
}