{
    "id": "13yceqi",
    "title": "Free Expression, meet Section 66A: Getting Rid of Zombies",
    "url": "https://www.reddit.com/r/india/comments/13yceqi/free_expression_meet_section_66a_getting_rid_of/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/iqq7lm3ftl3b1.png?width=1600&format=png&auto=webp&v=enabled&s=900d3c9d157c6ec59266f5391e90466a2693e610\n\n# Vagueness, Vagueness everywhere \n\nSection 66A was a part of the Information Technology Act, 2000, the Act which primarily governs cybercrime and e-commerce in India. In 2008, the Act was significantly amended, and it was then that Section 66A was included. The text of Section 66A reads:  \n\n\n“Any person who sends, by means of a computer resource or a communication device,\n\n>(a) *any* information that is ***grossly offensive*** or has ***menacing character***; or  \n>  \n>(b) *any* information which he knows to be false, but for the purpose of ***causing annoyance***, ***inconvenience***, danger, obstruction, insult, injury, criminal intimidation, enmity, hatred or ill will, persistently by making use of such computer resource or a communication device;  \n>  \n>(c) any electronic mail or electronic mail message for the purpose of causing annoyance or inconvenience or to deceive or to mislead the addressee or recipient about the origin of such messages,  \n>  \n>be punishable with imprisonment for a term which may extend to three years and with fine.” \\[emphasis added\\]\n\nWhat Section 66A does is criminalise the sending/sharing of messages that it deems offensive through a computer or any other electronic device. However, its vague and ambiguous wording allowed cases to be filed with an arbitrary understanding of what “offensive” and “annoying” are. \n\nSome arrests made under Section 66A [include](https://www.thehindu.com/opinion/lead/an-unreasonable-restriction/article4432360.ece) for:\n\n* Posting comments on and caricatures of then-Prime Minister, Manmohan Singh, former Union Minister, Kapil Sibal, and former Samajwadi Party President Mulayam Singh Yadav\n* Causing ‘inconvenience’ to relatives of Nationalist Congress Party chief Sharad Pawar \n* Posting a political cartoon of West Bengal Chief Minister, Mamta Banerjee \n* Posting an allegedly defamatory tweet about the son of former Union Finance Minister P. Chidambaram\n* Posting a comment on Facebook about the shutdown in Mumbai following the death of Shiv Sena leader, Bal Thackeray \n* Liking a comment on Facebook about the shutdown in Mumbai following the death of Shiv Sena leader, Bal Thackeray \n\nSeveral petitions were filed challenging the constitutionality of Section 66A, including by law student Shreya Singhal, the People’s Union for Civil Liberties and Common Cause. The petitioners [argued](https://globalfreedomofexpression.columbia.edu/cases/shreya-singhal-v-union-of-india) that Section 66A went beyond the scope of permissible restrictions to free speech under Article 19(2) of the Indian Constitution.  All these petitions were tagged together in a matter that would come to be known as *Shreya Singhal v. Union of India*. \n\nThen, on March 24, 2015, the Supreme Court in *Shreya Singhal v. Union of India* famously struck down Section 66A. \n\n# Rising from the dead \n\nThe *Shreya Singhal* judgement was lauded as a major step forward for Indian jurisprudence on free speech. Despite the judgement, cases continued to be registered under Section 66A. We started tracking these cases on the [Zombie Tracker](https://zombietracker.in/viz/)— a platform built in collaboration with CivicDataLab. We discovered that over 1000 cases were registered under Section 66A, even more than before Shreya Singhal!  \n\n# Slaying Zombies\n\nIFF assisted PUCL, one of the original litigants in the Shreya Singhal case, in filing an [application](https://internetfreedom.in/pucl-approaches-supreme-court-seeking-directions-against-continued-prosecutions-under-the-unconstitutional-section-66a/) for directions to prevent the continued prosecutions under Section 66A, the Supreme Court had directed High Courts, States and Union Territories to reply to the application. 12 High Courts, 10 States and 1 Union Territory replied to the application, and several of them [admitted](https://internetfreedom.in/dead-and-alive-affidavits-filed-by-8-states-and-high-courts-reveal-470-pending-cases-under-the-struck-down-s-66a/) that Section 66A cases were still pending in their jurisdictions. On September 6, 2022, the Supreme Court directed the counsel for the Union of India to impress upon the States the need for remedial measures on the continued use of Section 66A. \n\nOn October 12, 2022 after hearing submissions from both sides, the Supreme Court Bench, led by the Chief Justice of India, issued directions which are a massive victory win for free expression in India:\n\n1. The Supreme Court in Shreya Singhal has unequivocally held that Section 66A is unconstitutional. Thus, no citizen should be prosecuted under this provision. \n2. In every case where Section 66A is being used, the clause under Section 66A shall be dropped.\n3. Home Secretaries and other officials of State Governments must strictly instruct police officers not to register cases under Section 66A. \n4. All publications which refer to Section 66A should adequately inform the readers that the Supreme Court has struck down this provision in Shreya Singhal. \n\nFor more on Section 66A, what the judgement means, and why this a win for free speech, read our [blog post](https://internetfreedom.in/sc-direction-stop-prosecuting-people-under-the-unconstitutional-s-66a/). \n\nOur work went beyond the *Shreya Singhal* judgement, we don’t back down because we know that sustained advocacy works, and we cannot do it without you. This was an important fight to fight, because most often one sees that the push stops after a judgement from the Courts is received. But with your support, we have followed up on whether the fruits of *Shreya Singhal* have actually been realised, painstakingly gathered the data that shows that it has not, and been able to present it to Court. As a direct result of our application, more than [30 orders, circulars and notifications](https://docs.google.com/document/d/1gIEhQKdkUogoFfgeD_6RDqdKYg_XhvdVKRZI9Q8P6iE/edit) have been issued by the Union Government, the State Governments and various High Courts down to the local level to make sure that this zombie is laid to rest. This is an innovative legal strategy that is only possible through the kind of sustained advocacy that we are able to provide with your support. So the next time a zombie rears its head, you know who has your back. \n\nIFF is trying to raise 2 lakhs in 2 weeks from May 23, 2023 to June 7, 2023. We’ve raised INR 26,750. If you believe the work we do has value, donate today. \n\n[https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/)",
    "flair": "Law & Courts",
    "score": 125,
    "num_comments": 8,
    "created_utc": 1685711513.0,
    "convurl": "https://b.thumbs.redditmedia.com/6zyGsbrVbW-kxUGT-6rUQJ7gBLbLSm28JXzDpw51Aoc.jpg",
    "comments": [
        "IFF is a group of absolute legends",
        "I never knew about this getting struck down. Thank you for the mods to pin the post. It is very informative.",
        "That point (a) is just farcical levels of policy semantics. Freaking anything can be interpreted under that. \n\nHeck this post or my comment here itself can be interpreted under it.",
        "Also what do you guys think about section 67A?"
    ],
    "cleaned_text": "free expression meet section getting rid zombies xb vagueness vagueness everywhere section part information technology act act primarily governs cybercrime ecommerce india act significantly amended section included text section reads person sends means computer resource communication device information grossly offensive menacing character b information knows false purpose causing annoyance inconvenience danger obstruction insult injury criminal intimidation enmity hatred ill persistently making use computer resource communication device c electronic mail electronic mail message purpose causing annoyance inconvenience deceive mislead addressee recipient origin messages punishable imprisonment term may extend three years fine emphasis added section criminalise sendingsharing messages deems offensive computer electronic device however vague ambiguous wording allowed cases filed arbitrary understanding offensive annoying arrests made section includehttpswwwthehinducomopinionleadanunreasonablerestrictionarticleece posting comments caricatures thenprime minister manmohan singh former union minister kapil sibal former samajwadi party president mulayam singh yadav causing inconvenience relatives nationalist congress party chief sharad pawar posting political cartoon west bengal chief minister mamta banerjee posting allegedly defamatory tweet son former union finance minister p chidambaram posting comment facebook shutdown mumbai following death shiv sena leader bal thackeray liking comment facebook shutdown mumbai following death shiv sena leader bal thackeray several petitions filed challenging constitutionality section including law student shreya singhal peoples union civil liberties common cause petitioners arguedhttpsglobalfreedomofexpressioncolumbiaeducasesshreyasinghalvunionofindia section went beyond scope permissible restrictions free speech article indian constitution petitions tagged together matter would come known shreya singhal v union india march supreme court shreya singhal v union india famously struck section rising dead shreya singhal judgement lauded major step forward indian jurisprudence free speech despite judgement cases continued registered section started tracking cases zombie trackerhttpszombietrackerinviz platform built collaboration civicdatalab discovered cases registered section even shreya singhal slaying zombies iff assisted pucl one original litigants shreya singhal case filing applicationhttpsinternetfreedominpuclapproachessupremecourtseekingdirectionsagainstcontinuedprosecutionsundertheunconstitutionalsectiona directions prevent continued prosecutions section supreme court directed high courts states union territories reply application high courts states union territory replied application several admittedhttpsinternetfreedomindeadandaliveaffidavitsfiledbystatesandhighcourtsrevealpendingcasesunderthestruckdownsa section cases still pending jurisdictions september supreme court directed counsel union india impress upon states need remedial measures continued use section october hearing submissions sides supreme court bench led chief justice india issued directions massive victory win free expression india supreme court shreya singhal unequivocally held section unconstitutional thus citizen prosecuted provision every case section used clause section shall dropped home secretaries officials state governments must strictly instruct police officers register cases section publications refer section adequately inform readers supreme court struck provision shreya singhal section judgement means win free speech read blog posthttpsinternetfreedominscdirectionstopprosecutingpeopleundertheunconstitutionalsa work went beyond shreya singhal judgement dont back know sustained advocacy works without important fight fight often one sees push stops judgement courts received support followed whether fruits shreya singhal actually realised painstakingly gathered data shows able present court direct result application orders circulars notificationshttpsdocsgooglecomdocumentdgiehqkdkuogoffgedrdqdkygxhvdvkrziqpieedit issued union government state governments various high courts local level make sure zombie laid rest innovative legal strategy possible kind sustained advocacy able provide support next time zombie rears head know back iff trying raise lakhs weeks may june weve raised inr believe work value donate today httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff ",
    "cleaned_title": "free expression meet section getting rid zombies",
    "cleaned_selftext": "xb vagueness vagueness everywhere section part information technology act act primarily governs cybercrime ecommerce india act significantly amended section included text section reads person sends means computer resource communication device information grossly offensive menacing character b information knows false purpose causing annoyance inconvenience danger obstruction insult injury criminal intimidation enmity hatred ill persistently making use computer resource communication device c electronic mail electronic mail message purpose causing annoyance inconvenience deceive mislead addressee recipient origin messages punishable imprisonment term may extend three years fine emphasis added section criminalise sendingsharing messages deems offensive computer electronic device however vague ambiguous wording allowed cases filed arbitrary understanding offensive annoying arrests made section includehttpswwwthehinducomopinionleadanunreasonablerestrictionarticleece posting comments caricatures thenprime minister manmohan singh former union minister kapil sibal former samajwadi party president mulayam singh yadav causing inconvenience relatives nationalist congress party chief sharad pawar posting political cartoon west bengal chief minister mamta banerjee posting allegedly defamatory tweet son former union finance minister p chidambaram posting comment facebook shutdown mumbai following death shiv sena leader bal thackeray liking comment facebook shutdown mumbai following death shiv sena leader bal thackeray several petitions filed challenging constitutionality section including law student shreya singhal peoples union civil liberties common cause petitioners arguedhttpsglobalfreedomofexpressioncolumbiaeducasesshreyasinghalvunionofindia section went beyond scope permissible restrictions free speech article indian constitution petitions tagged together matter would come known shreya singhal v union india march supreme court shreya singhal v union india famously struck section rising dead shreya singhal judgement lauded major step forward indian jurisprudence free speech despite judgement cases continued registered section started tracking cases zombie trackerhttpszombietrackerinviz platform built collaboration civicdatalab discovered cases registered section even shreya singhal slaying zombies iff assisted pucl one original litigants shreya singhal case filing applicationhttpsinternetfreedominpuclapproachessupremecourtseekingdirectionsagainstcontinuedprosecutionsundertheunconstitutionalsectiona directions prevent continued prosecutions section supreme court directed high courts states union territories reply application high courts states union territory replied application several admittedhttpsinternetfreedomindeadandaliveaffidavitsfiledbystatesandhighcourtsrevealpendingcasesunderthestruckdownsa section cases still pending jurisdictions september supreme court directed counsel union india impress upon states need remedial measures continued use section october hearing submissions sides supreme court bench led chief justice india issued directions massive victory win free expression india supreme court shreya singhal unequivocally held section unconstitutional thus citizen prosecuted provision every case section used clause section shall dropped home secretaries officials state governments must strictly instruct police officers register cases section publications refer section adequately inform readers supreme court struck provision shreya singhal section judgement means win free speech read blog posthttpsinternetfreedominscdirectionstopprosecutingpeopleundertheunconstitutionalsa work went beyond shreya singhal judgement dont back know sustained advocacy works without important fight fight often one sees push stops judgement courts received support followed whether fruits shreya singhal actually realised painstakingly gathered data shows able present court direct result application orders circulars notificationshttpsdocsgooglecomdocumentdgiehqkdkuogoffgedrdqdkygxhvdvkrziqpieedit issued union government state governments various high courts local level make sure zombie laid rest innovative legal strategy possible kind sustained advocacy able provide support next time zombie rears head know back iff trying raise lakhs weeks may june weve raised inr believe work value donate today httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff",
    "cleaned_comments": "iff group absolute legends never knew getting struck thank mods pin post informative point farcical levels policy semantics freaking anything interpreted heck post comment interpreted also guys think section",
    "light_cleaned_title": "Free Expression, meet Section 66A: Getting Rid of Zombies",
    "light_cleaned_selftext": "&#x200B; # Vagueness, Vagueness everywhere Section 66A was a part of the Information Technology Act, 2000, the Act which primarily governs cybercrime and e-commerce in India. In 2008, the Act was significantly amended, and it was then that Section 66A was included. The text of Section 66A reads: “Any person who sends, by means of a computer resource or a communication device, >(a) *any* information that is ***grossly offensive*** or has ***menacing character***; or > >(b) *any* information which he knows to be false, but for the purpose of ***causing annoyance***, ***inconvenience***, danger, obstruction, insult, injury, criminal intimidation, enmity, hatred or ill will, persistently by making use of such computer resource or a communication device; > >(c) any electronic mail or electronic mail message for the purpose of causing annoyance or inconvenience or to deceive or to mislead the addressee or recipient about the origin of such messages, > >be punishable with imprisonment for a term which may extend to three years and with fine.” \\[emphasis added\\] What Section 66A does is criminalise the sending/sharing of messages that it deems offensive through a computer or any other electronic device. However, its vague and ambiguous wording allowed cases to be filed with an arbitrary understanding of what “offensive” and “annoying” are. Some arrests made under Section 66A [include](https://www.thehindu.com/opinion/lead/an-unreasonable-restriction/article4432360.ece) for: * Posting comments on and caricatures of then-Prime Minister, Manmohan Singh, former Union Minister, Kapil Sibal, and former Samajwadi Party President Mulayam Singh Yadav * Causing ‘inconvenience’ to relatives of Nationalist Congress Party chief Sharad Pawar * Posting a political cartoon of West Bengal Chief Minister, Mamta Banerjee * Posting an allegedly defamatory tweet about the son of former Union Finance Minister P. Chidambaram * Posting a comment on Facebook about the shutdown in Mumbai following the death of Shiv Sena leader, Bal Thackeray * Liking a comment on Facebook about the shutdown in Mumbai following the death of Shiv Sena leader, Bal Thackeray Several petitions were filed challenging the constitutionality of Section 66A, including by law student Shreya Singhal, the People’s Union for Civil Liberties and Common Cause. The petitioners [argued](https://globalfreedomofexpression.columbia.edu/cases/shreya-singhal-v-union-of-india) that Section 66A went beyond the scope of permissible restrictions to free speech under Article 19(2) of the Indian Constitution. All these petitions were tagged together in a matter that would come to be known as *Shreya Singhal v. Union of India*. Then, on March 24, 2015, the Supreme Court in *Shreya Singhal v. Union of India* famously struck down Section 66A. # Rising from the dead The *Shreya Singhal* judgement was lauded as a major step forward for Indian jurisprudence on free speech. Despite the judgement, cases continued to be registered under Section 66A. We started tracking these cases on the [Zombie Tracker](https://zombietracker.in/viz/)— a platform built in collaboration with CivicDataLab. We discovered that over 1000 cases were registered under Section 66A, even more than before Shreya Singhal! # Slaying Zombies IFF assisted PUCL, one of the original litigants in the Shreya Singhal case, in filing an [application](https://internetfreedom.in/pucl-approaches-supreme-court-seeking-directions-against-continued-prosecutions-under-the-unconstitutional-section-66a/) for directions to prevent the continued prosecutions under Section 66A, the Supreme Court had directed High Courts, States and Union Territories to reply to the application. 12 High Courts, 10 States and 1 Union Territory replied to the application, and several of them [admitted](https://internetfreedom.in/dead-and-alive-affidavits-filed-by-8-states-and-high-courts-reveal-470-pending-cases-under-the-struck-down-s-66a/) that Section 66A cases were still pending in their jurisdictions. On September 6, 2022, the Supreme Court directed the counsel for the Union of India to impress upon the States the need for remedial measures on the continued use of Section 66A. On October 12, 2022 after hearing submissions from both sides, the Supreme Court Bench, led by the Chief Justice of India, issued directions which are a massive victory win for free expression in India: 1. The Supreme Court in Shreya Singhal has unequivocally held that Section 66A is unconstitutional. Thus, no citizen should be prosecuted under this provision. 2. In every case where Section 66A is being used, the clause under Section 66A shall be dropped. 3. Home Secretaries and other officials of State Governments must strictly instruct police officers not to register cases under Section 66A. 4. All publications which refer to Section 66A should adequately inform the readers that the Supreme Court has struck down this provision in Shreya Singhal. For more on Section 66A, what the judgement means, and why this a win for free speech, read our [blog post](https://internetfreedom.in/sc-direction-stop-prosecuting-people-under-the-unconstitutional-s-66a/). Our work went beyond the *Shreya Singhal* judgement, we don’t back down because we know that sustained advocacy works, and we cannot do it without you. This was an important fight to fight, because most often one sees that the push stops after a judgement from the Courts is received. But with your support, we have followed up on whether the fruits of *Shreya Singhal* have actually been realised, painstakingly gathered the data that shows that it has not, and been able to present it to Court. As a direct result of our application, more than [30 orders, circulars and notifications](https://docs.google.com/document/d/1gIEhQKdkUogoFfgeD_6RDqdKYg_XhvdVKRZI9Q8P6iE/edit) have been issued by the Union Government, the State Governments and various High Courts down to the local level to make sure that this zombie is laid to rest. This is an innovative legal strategy that is only possible through the kind of sustained advocacy that we are able to provide with your support. So the next time a zombie rears its head, you know who has your back. IFF is trying to raise 2 lakhs in 2 weeks from May 23, 2023 to June 7, 2023. We’ve raised INR 26,750. If you believe the work we do has value, donate today. [https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/)",
    "light_cleaned_comments": "IFF is a group of absolute legends I never knew about this getting struck down. Thank you for the mods to pin the post. It is very informative. That point (a) is just farcical levels of policy semantics. Freaking anything can be interpreted under that. Heck this post or my comment here itself can be interpreted under it. Also what do you guys think about section 67A?"
}