{
    "id": "1506eaf",
    "title": "I'm a research scholar, this is a survey related to my research on a sociopolitical issue related to India. If you could please find some time to fill it out. Thanks in advance.",
    "url": "https://www.reddit.com/r/india/comments/1506eaf/im_a_research_scholar_this_is_a_survey_related_to/",
    "selftext": "Hey there, hope this is not an intrusion. Would you be willing to spare just 10 minutes of your time to take part in this survey that is essential for my research? Your unique perspective is incredibly valuable, and I’d genuinely appreciate your contribution. Sincere Thanks.\n\nLink to the survey: [https://docs.google.com/forms/d/e/1FAIpQLSc15pU9ByztBAbCTRcZNH6jvQTmq3IC-3z3oTPPGcjf15XyTw/viewform](https://docs.google.com/forms/d/e/1FAIpQLSc15pU9ByztBAbCTRcZNH6jvQTmq3IC-3z3oTPPGcjf15XyTw/viewform)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689409941.0,
    "convurl": "https://external-preview.redd.it/nlAxSMZVuIGCcAyK7S9Q5IaC13mcku4zdlIBCa-uofE.jpg?auto=webp&s=beb5bb73fff0edb4582682063c87035c71a1ad07",
    "comments": [
        "a) it asks for sign in. \n\nb) Introduce it to us, OP! What it's about etc.",
        "Hey, yes sorry, sign-in is essential to verify the responses are genuine and by actual people for the credibility of the data collected. \n\nIn terms of the survey, it is an attempt to understand the impact of social media in shaping opinions and perceptions regarding the government's decision to ban Hijabs in educational institutes and organizations. I aim to analyze the level of understanding among social media users and identify the key challenges faced during the discourse. Also, understand the nuances that were highlighted/neglected from the users' perspective.",
        "Hey I completed your survey, but please keep in mind that I got bored by the time I reached around midway of your survey and then I randomly clicked a bunch of answers to complete it.\n\nWould suggest to shorten your survey by at least 10 questions, if you want to get a true sentiment  on the issue. \n\nCheers!!",
        "Hey, thanks a lot. Will definitely keep in mind. Lemme see if I can shorten it now. 🙏🏻",
        "Hello! \n\nYour survey was really interesting! \n\nI would really appreciate it if you could help me by filling out my survey form. It will not take more than 10 minutes. \n\nLink: [https://docs.google.com/forms/d/e/1FAIpQLScors7zDVqSYPZ8UivjnBUxLQfIXSg2shEDu4XgYbNdeyR2kw/viewform](https://docs.google.com/forms/d/e/1FAIpQLScors7zDVqSYPZ8UivjnBUxLQfIXSg2shEDu4XgYbNdeyR2kw/viewform)\n\nThanks in advance!",
        "Shall do by tonight. Yours looks interesting as well. And since I have a kid I might be useful 😅",
        "Whoops. I don't fall in the age group you are looking for :("
    ],
    "cleaned_text": "im research scholar survey related research sociopolitical issue related india could please find time fill thanks advance hey hope intrusion would willing spare minutes time take part survey essential research unique perspective incredibly valuable id genuinely appreciate contribution sincere thanks link survey httpsdocsgooglecomformsdefaipqlscpubyztbabctrcznhjvqtmqiczotppgcjfxytwviewformhttpsdocsgooglecomformsdefaipqlscpubyztbabctrcznhjvqtmqiczotppgcjfxytwviewform ",
    "cleaned_title": "im research scholar survey related research sociopolitical issue related india could please find time fill thanks advance",
    "cleaned_selftext": "hey hope intrusion would willing spare minutes time take part survey essential research unique perspective incredibly valuable id genuinely appreciate contribution sincere thanks link survey httpsdocsgooglecomformsdefaipqlscpubyztbabctrcznhjvqtmqiczotppgcjfxytwviewformhttpsdocsgooglecomformsdefaipqlscpubyztbabctrcznhjvqtmqiczotppgcjfxytwviewform",
    "cleaned_comments": "asks sign b introduce us op etc hey yes sorry signin essential verify responses genuine actual people credibility data collected terms survey attempt understand impact social media shaping opinions perceptions regarding governments decision ban hijabs educational institutes organizations aim analyze level understanding among social media users identify key challenges faced discourse also understand nuances highlightedneglected users perspective hey completed survey please keep mind got bored time reached around midway survey randomly clicked bunch answers complete would suggest shorten survey least questions want get true sentiment issue cheers hey thanks lot definitely keep mind lem see shorten hello survey really interesting would really appreciate could help filling survey form take minutes link httpsdocsgooglecomformsdefaipqlscorszdvqsypzuivjnbuxlqfixsgsheduxgybndeyrkwviewformhttpsdocsgooglecomformsdefaipqlscorszdvqsypzuivjnbuxlqfixsgsheduxgybndeyrkwviewform thanks advance shall tonight looks interesting well since kid might useful whoops dont fall age group looking",
    "light_cleaned_title": "I'm a research scholar, this is a survey related to my research on a sociopolitical issue related to India. If you could please find some time to fill it out. Thanks in advance.",
    "light_cleaned_selftext": "Hey there, hope this is not an intrusion. Would you be willing to spare just 10 minutes of your time to take part in this survey that is essential for my research? Your unique perspective is incredibly valuable, and I’d genuinely appreciate your contribution. Sincere Thanks. Link to the survey: [https://docs.google.com/forms/d/e/1FAIpQLSc15pU9ByztBAbCTRcZNH6jvQTmq3IC-3z3oTPPGcjf15XyTw/viewform](https://docs.google.com/forms/d/e/1FAIpQLSc15pU9ByztBAbCTRcZNH6jvQTmq3IC-3z3oTPPGcjf15XyTw/viewform)",
    "light_cleaned_comments": "a) it asks for sign in. b) Introduce it to us, OP! What it's about etc. Hey, yes sorry, sign-in is essential to verify the responses are genuine and by actual people for the credibility of the data collected. In terms of the survey, it is an attempt to understand the impact of social media in shaping opinions and perceptions regarding the government's decision to ban Hijabs in educational institutes and organizations. I aim to analyze the level of understanding among social media users and identify the key challenges faced during the discourse. Also, understand the nuances that were highlighted/neglected from the users' perspective. Hey I completed your survey, but please keep in mind that I got bored by the time I reached around midway of your survey and then I randomly clicked a bunch of answers to complete it. Would suggest to shorten your survey by at least 10 questions, if you want to get a true sentiment on the issue. Cheers!! Hey, thanks a lot. Will definitely keep in mind. Lemme see if I can shorten it now. 🙏🏻 Hello! Your survey was really interesting! I would really appreciate it if you could help me by filling out my survey form. It will not take more than 10 minutes. Link: [https://docs.google.com/forms/d/e/1FAIpQLScors7zDVqSYPZ8UivjnBUxLQfIXSg2shEDu4XgYbNdeyR2kw/viewform](https://docs.google.com/forms/d/e/1FAIpQLScors7zDVqSYPZ8UivjnBUxLQfIXSg2shEDu4XgYbNdeyR2kw/viewform) Thanks in advance! Shall do by tonight. Yours looks interesting as well. And since I have a kid I might be useful 😅 Whoops. I don't fall in the age group you are looking for :("
}