{
    "id": "1bagxbn",
    "title": "85% of Indian respondents agree that the global economy will be stronger in 2024 than in 2023",
    "url": "https://www.visualcapitalist.com/confidence-in-the-global-economy-by-country/#:~:text=At%20the%20top%2C%20India%2C%20Indonesia,Indonesian%20respondents%20felt%20the%20same.",
    "selftext": "According to Visual Capitalist, as of March 2024, India, China, and Indonesia are the most confident about the global economy's prospects in 2024. ",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1709988259.0,
    "convurl": "https://external-preview.redd.it/xm-EYRbgAIMB2M9YflB3qVHA6P3G69VsAPfvhNNRG_Y.jpg?auto=webp&s=ff81ed5e3380b983804a38667851dbcbafa13432",
    "comments": [
        "Yes. Let’s run economy on opinion polls. /s\n\nAt best this is indication of consumer confidence. So still a good news but just one component of economic outlook.",
        "\"Opinions of 100,000 men have no meaning if none of them know anything about the subject\""
    ],
    "cleaned_text": "indian respondents agree global economy stronger according visual capitalist march india china indonesia confident global economys prospects ",
    "cleaned_title": "indian respondents agree global economy stronger",
    "cleaned_selftext": "according visual capitalist march india china indonesia confident global economys prospects",
    "cleaned_comments": "yes lets run economy opinion polls best indication consumer confidence still good news one component economic outlook opinions men meaning none know anything subject",
    "light_cleaned_title": "85% of Indian respondents agree that the global economy will be stronger in 2024 than in 2023",
    "light_cleaned_selftext": "According to Visual Capitalist, as of March 2024, India, China, and Indonesia are the most confident about the global economy's prospects in 2024.",
    "light_cleaned_comments": "Yes. Let’s run economy on opinion polls. /s At best this is indication of consumer confidence. So still a good news but just one component of economic outlook. \"Opinions of 100,000 men have no meaning if none of them know anything about the subject\""
}