{
    "id": "15eg6he",
    "title": "Listen to what RPF constable Chetan Singh is saying after open firing on Jaipur-Mumbai train and killing his senior Tikaram Meena and 3 passengers (Abdul Kadir, Asgar Kai and an identified man).",
    "url": "https://twitter.com/zoo_bear/status/1685980754130649088",
    "selftext": "A source from Western Railway in Mumbai told \n@IndianExpress\n, a fight had allegedly broken out following an argument over communities.\n\nAccording to Indian Express report, Chetan Singh fired on ASI Tikaram Meena from his ARM Rifle first inside the B-5 coach and then shot at Abdul Kadir, who was from Madhubani. He later killed an unidentified man in the pantry car, and moved to the S-6 coach where he shot Asgar Kai, a bangle seller from Jaipur.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1690809957.0,
    "convurl": "https://external-preview.redd.it/hnG5qV0TEW3zd7PWy99GFo3OVZRaUgCtya6MBVpYyww.jpg?auto=webp&s=27833db9b1e58ef7d16726603fa51789e3cdd071",
    "comments": [
        "Vasudhaiva Kutumbakam",
        "What did he say ?",
        "Vote for Modi and Yogi."
    ],
    "cleaned_text": "listen rpf constable chetan singh saying open firing jaipurmumbai train killing senior tikaram meena passengers abdul kadir asgar kai identified man source western railway mumbai told indianexpress fight allegedly broken following argument communities according indian express report chetan singh fired asi tikaram meena arm rifle first inside b coach shot abdul kadir madhubani later killed unidentified man pantry car moved coach shot asgar kai bangle seller jaipur ",
    "cleaned_title": "listen rpf constable chetan singh saying open firing jaipurmumbai train killing senior tikaram meena passengers abdul kadir asgar kai identified man",
    "cleaned_selftext": "source western railway mumbai told indianexpress fight allegedly broken following argument communities according indian express report chetan singh fired asi tikaram meena arm rifle first inside b coach shot abdul kadir madhubani later killed unidentified man pantry car moved coach shot asgar kai bangle seller jaipur",
    "cleaned_comments": "vasudhaiva kutumbakam say vote modi yogi",
    "light_cleaned_title": "Listen to what RPF constable Chetan Singh is saying after open firing on Jaipur-Mumbai train and killing his senior Tikaram Meena and 3 passengers (Abdul Kadir, Asgar Kai and an identified man).",
    "light_cleaned_selftext": "A source from Western Railway in Mumbai told @IndianExpress , a fight had allegedly broken out following an argument over communities. According to Indian Express report, Chetan Singh fired on ASI Tikaram Meena from his ARM Rifle first inside the B-5 coach and then shot at Abdul Kadir, who was from Madhubani. He later killed an unidentified man in the pantry car, and moved to the S-6 coach where he shot Asgar Kai, a bangle seller from Jaipur.",
    "light_cleaned_comments": "Vasudhaiva Kutumbakam What did he say ? Vote for Modi and Yogi."
}