{
    "id": "1e9sbj2",
    "title": "IAS Officer's Wife Who \"Eloped\" With Gangster Returns Home, Dies By Suicide",
    "url": "https://www.ndtv.com/india-news/ias-officers-wife-who-eloped-with-gangster-returns-home-dies-by-suicide-6164244",
    "selftext": "The husband, Ranjeet Kumar, who is a secretary at Gujarat Electricity Regulatory Commission, had instructed the domestic staff that his wife, who is involved in a child abduction case, should not be allowed in the house, said police.\n\n\"Ranjeet Kumar had gone out to finalise his divorce petition with Surya on Saturday. Upset at not being allowed in the house, she ingested poison and called up 108 (an ambulance helpline number),\" said police.\n\nWild! ",
    "flair": "Law & Courts",
    "score": 313,
    "num_comments": 42,
    "created_utc": 1721689516.0,
    "convurl": "https://external-preview.redd.it/uTGDq0OYr2TSCwc2pU89L8Z5ueGs83VkwlHMELfBMoA.jpg?auto=webp&s=73381f08a6d577ed6d110d050504ef5765bdb581",
    "comments": [
        "Doesn’t compute",
        "something wrong I can feel it",
        "Acha hai maine civils nahi diya. Tante hi rehte hai inki life me.",
        "Which thing? She drinking poison at the home? Or she not being given medical care at time? Its a wild story tbh",
        "Too many wrongs in this. Like how tf did she even come in contact with the gangster? And then there's a child kidnapping?",
        "Normal people have also such kalesh happening but the media lens is not there.",
        "Total",
        "trash took itself out",
        "“The woman’s name featured in a case with her rumoured gangster boyfriend, Maharaja High Court, and his aide Senthil Kumar.”\n\nMaharaja High Court? That’s the gangster’s name?",
        "Even after this, the husband will be blamed and punished. And girls/ women enjoy all the privilege.",
        "**Kalesh is the constant**\n\nEmbrace kalesh, Reject Shanti.\n\nhttps://i.redd.it/pwn33zq0l6ed1.gif",
        "Ever heard of emergency yadav?",
        "I still don't know the meaning of that word",
        "Maharaja High Court hmmmm..,",
        "Yes z some tribal villages have such names. there are several news articles you can find \n\nhttps://www.news18.com/buzz/google-to-amitabh-this-karnataka-tribal-community-gives-the-most-bizarre-names-to-kids-7047649.html",
        "acha hai maine UPSC nhi diya , kon sahega aisa",
        "What kind of name is that? Maharaja high court?",
        "Can’t ever imagine getting with a dude named High Court ☠️",
        "[Kehlani - Gangsta](https://www.youtube.com/watch?v=XmZrCRRxxXE)",
        "sorry meant [Ms Krazie - A Gangster's Wife](https://www.youtube.com/watch?v=UgdKrFjq7kk)",
        "[https://youtu.be/UgdKrFjq7kk?t=65](https://youtu.be/UgdKrFjq7kk?t=65)",
        "Story is not connecting, there are missing pieces to this puzzle.",
        "You can get away with anything by saying the High Court ordered me to do this.",
        "strange case. interesting name",
        "#Another IAS Officer story\n\n/s",
        "Our country is fascinating ",
        "She wasn't allowed inside the home then how did she drink poison \"at the home\"?",
        "Gangsters when not in jail attend many social events. Nothing strange about a rich woman coming in contact with a gangster.",
        "> Sources say Surya might have gone to her husband's home to evade arrest from Tamil Nadu police in the kidnapping case of a 14-year-old boy in Madurai.\n\nYa. She didn't want to take responsibility for her actions.",
        "just blown away",
        "Elaborate?",
        "Gunjan Lawdi is one too",
        "In my village there was a family whose kids names were literally Dm, minister and advocate.",
        "Even a real minister's aadhar won't say minister, but this guy is a minister for life",
        "Bro: I am not in high court skylar, I am the high court",
        "I am not expert but I think crime petrol can create episode on this topic.",
        "She drank outside home? Outside gate?",
        "Yeah I was too shocked when I was in my home town, then someone said that 'DM' is coming in few hours.\nLo and behold It was a kid in his teenage.",
        "Speaking of Maharaja, the Setupathy movie is dark, but a good one.",
        "Yeh Aspirants ka season 3 story line thodi zyada ho gayi"
    ],
    "cleaned_text": "ias officers wife eloped gangster returns home dies suicide husband ranjeet kumar secretary gujarat electricity regulatory commission instructed domestic staff wife involved child abduction case allowed house said police ranjeet kumar gone finalise divorce petition surya saturday upset allowed house ingested poison called ambulance helpline number said police wild ",
    "cleaned_title": "ias officers wife eloped gangster returns home dies suicide",
    "cleaned_selftext": "husband ranjeet kumar secretary gujarat electricity regulatory commission instructed domestic staff wife involved child abduction case allowed house said police ranjeet kumar gone finalise divorce petition surya saturday upset allowed house ingested poison called ambulance helpline number said police wild",
    "cleaned_comments": "doesnt compute something wrong feel acha hai maine civils nahi diya tante hi rehte hai inki life thing drinking poison home given medical care time wild story tbh many wrongs like tf even come contact gangster theres child kidnapping normal people also kalesh happening media lens total trash took womans name featured case rumoured gangster boyfriend maharaja high court aide senthil kumar maharaja high court thats gangsters name even husband blamed punished girls women enjoy privilege kalesh constant embrace kalesh reject shanti ever heard emergency yadav still dont know meaning word maharaja high court hmmmm yes z tribal villages names several news articles find acha hai maine upsc nhi diya kon sahega aisa kind name maharaja high court cant ever imagine getting dude named high court kehlani gangstahttpswwwyoutubecomwatchvxmzrcrrxxxe sorry meant ms krazie gangsters wifehttpswwwyoutubecomwatchvugdkrfjqkk httpsyoutubeugdkrfjqkkthttpsyoutubeugdkrfjqkkt story connecting missing pieces puzzle get away anything saying high court ordered strange case interesting name another ias officer story country fascinating wasnt allowed inside home drink poison home gangsters jail attend many social events nothing strange rich woman coming contact gangster sources say surya might gone husbands home evade arrest tamil nadu police kidnapping case yearold boy madurai ya didnt want take responsibility actions blown away elaborate gunjan lawdi one village family whose kids names literally dm minister advocate even real ministers aadhar wont say minister guy minister life bro high court skylar high court expert think crime petrol create episode topic drank outside home outside gate yeah shocked home town someone said dm coming hours lo behold kid teenage speaking maharaja setupathy movie dark good one yeh aspirants ka season story line thodi zyada ho gayi",
    "light_cleaned_title": "IAS Officer's Wife Who \"Eloped\" With Gangster Returns Home, Dies By Suicide",
    "light_cleaned_selftext": "The husband, Ranjeet Kumar, who is a secretary at Gujarat Electricity Regulatory Commission, had instructed the domestic staff that his wife, who is involved in a child abduction case, should not be allowed in the house, said police. \"Ranjeet Kumar had gone out to finalise his divorce petition with Surya on Saturday. Upset at not being allowed in the house, she ingested poison and called up 108 (an ambulance helpline number),\" said police. Wild!",
    "light_cleaned_comments": "Doesn’t compute something wrong I can feel it Acha hai maine civils nahi diya. Tante hi rehte hai inki life me. Which thing? She drinking poison at the home? Or she not being given medical care at time? Its a wild story tbh Too many wrongs in this. Like how tf did she even come in contact with the gangster? And then there's a child kidnapping? Normal people have also such kalesh happening but the media lens is not there. Total trash took itself out “The woman’s name featured in a case with her rumoured gangster boyfriend, Maharaja High Court, and his aide Senthil Kumar.” Maharaja High Court? That’s the gangster’s name? Even after this, the husband will be blamed and punished. And girls/ women enjoy all the privilege. **Kalesh is the constant** Embrace kalesh, Reject Shanti. Ever heard of emergency yadav? I still don't know the meaning of that word Maharaja High Court hmmmm.., Yes z some tribal villages have such names. there are several news articles you can find acha hai maine UPSC nhi diya , kon sahega aisa What kind of name is that? Maharaja high court? Can’t ever imagine getting with a dude named High Court ☠️ [Kehlani - Gangsta](https://www.youtube.com/watch?v=XmZrCRRxxXE) sorry meant [Ms Krazie - A Gangster's Wife](https://www.youtube.com/watch?v=UgdKrFjq7kk) [https://youtu.be/UgdKrFjq7kk?t=65](https://youtu.be/UgdKrFjq7kk?t=65) Story is not connecting, there are missing pieces to this puzzle. You can get away with anything by saying the High Court ordered me to do this. strange case. interesting name #Another IAS Officer story /s Our country is fascinating She wasn't allowed inside the home then how did she drink poison \"at the home\"? Gangsters when not in jail attend many social events. Nothing strange about a rich woman coming in contact with a gangster. > Sources say Surya might have gone to her husband's home to evade arrest from Tamil Nadu police in the kidnapping case of a 14-year-old boy in Madurai. Ya. She didn't want to take responsibility for her actions. just blown away Elaborate? Gunjan Lawdi is one too In my village there was a family whose kids names were literally Dm, minister and advocate. Even a real minister's aadhar won't say minister, but this guy is a minister for life Bro: I am not in high court skylar, I am the high court I am not expert but I think crime petrol can create episode on this topic. She drank outside home? Outside gate? Yeah I was too shocked when I was in my home town, then someone said that 'DM' is coming in few hours. Lo and behold It was a kid in his teenage. Speaking of Maharaja, the Setupathy movie is dark, but a good one. Yeh Aspirants ka season 3 story line thodi zyada ho gayi"
}