{
    "id": "14q48ya",
    "title": "Teesta Setalvad case: Chief Justice got a call at event, judges rushed for hearing",
    "url": "https://www.indiatoday.in/law/story/teesta-setalvad-case-chief-justice-got-a-call-at-event-judges-rushed-for-hearing-2400819-2023-07-02",
    "selftext": "Has anyone experienced a judge running in  middle of the night to give bail?",
    "flair": "Law & Courts",
    "score": 30,
    "num_comments": 12,
    "created_utc": 1688443351.0,
    "convurl": "https://external-preview.redd.it/YR3wbUbvSiY6WoA1T8En_4B6BY_9xzW9V0KSm2V7gj4.jpg?auto=webp&s=c80080816c326cbf27622f216b7877074e4c27b1",
    "comments": [
        "Bhai modiji se panga lelenge isse kabhi mat lena.",
        "You do realize this case is a witch hunt. God bless the Judges. Yes - these kinds of cases have a ripple effect. Because then atleast some police officials would refrain from foisting false cases based on political loyalty. What we ideally need is a depoliticized police force, or atleast fixing accountability for wrongful indictment.",
        "It is not a witch hunt, there is a clear money trail of financial misappropriation and these cases have been filed by donors of her NGO, the same people who believed her in the quest for justice.",
        "That is not the case that has been taken. The GJ police have taken a case based on SC judgement- which the SC itself deemed as harsh in yesterday's hearing. That Teesta Setalvad defamed Gujarat and the Then CM by indicting them for the riots. \n\nIt is a witch hunt.",
        "Working like doctors on critical patients",
        "The same Chief Justice opened court late at night to grant Arnab Goswami bail",
        "The same Justice Chandrachud opened court late at night to grant Arnab Goswami bail",
        "Dude there are 1000s or critical patients in line, why jump the queue.",
        "Because all are equal, some are more equal.",
        "Basically favouritism..",
        "Justice Chandrachud heard the case in the morning of Wed 11, Nov 2020. Check the timestamp here https://www.ndtv.com/india-news/arnab-goswami-bail-plea-hearing-in-supreme-court-today-2323631 \n\nArnab was arrested on 4 Nov for a closed case which was opened without consent of court and bail plea heard good 7 days later.\nHere Teesta is not even arrested.",
        ">morning\n\nThis was the time the news was reported, not the time when he got bail. The court was on holiday for Diwali that full week. And unlike summer break, they don't have vacation benches for Diwali",
        "yeah god bless the judges.\n\nFor the second time in a day SC judges opens court at night around 9 to bail her despite of that they were on vacation\n\nAnd you know that SIT is formed for this investigation not Gujrat police and this SIT has filed case in SC not gujrat police."
    ],
    "cleaned_text": "teesta setalvad case chief justice got call event judges rushed hearing anyone experienced judge running middle night give bail ",
    "cleaned_title": "teesta setalvad case chief justice got call event judges rushed hearing",
    "cleaned_selftext": "anyone experienced judge running middle night give bail",
    "cleaned_comments": "bhai modiji se panga lelenge isse kabhi mat lena realize case witch hunt god bless judges yes kinds cases ripple effect atleast police officials would refrain foisting false cases based political loyalty ideally need depoliticized police force atleast fixing accountability wrongful indictment witch hunt clear money trail financial misappropriation cases filed donors ngo people believed quest justice case taken gj police taken case based sc judgement sc deemed harsh yesterdays hearing teesta setalvad defamed gujarat cm indicting riots witch hunt working like doctors critical patients chief justice opened court late night grant arnab goswami bail justice chandrachud opened court late night grant arnab goswami bail dude critical patients line jump queue equal equal basically favouritism justice chandrachud heard case morning wed nov check timestamp arnab arrested nov closed case opened without consent court bail plea heard good days later teesta even arrested morning time news reported time got bail court holiday diwali full week unlike summer break dont vacation benches diwali yeah god bless judges second time day sc judges opens court night around bail despite vacation know sit formed investigation gujrat police sit filed case sc gujrat police",
    "light_cleaned_title": "Teesta Setalvad case: Chief Justice got a call at event, judges rushed for hearing",
    "light_cleaned_selftext": "Has anyone experienced a judge running in middle of the night to give bail?",
    "light_cleaned_comments": "Bhai modiji se panga lelenge isse kabhi mat lena. You do realize this case is a witch hunt. God bless the Judges. Yes - these kinds of cases have a ripple effect. Because then atleast some police officials would refrain from foisting false cases based on political loyalty. What we ideally need is a depoliticized police force, or atleast fixing accountability for wrongful indictment. It is not a witch hunt, there is a clear money trail of financial misappropriation and these cases have been filed by donors of her NGO, the same people who believed her in the quest for justice. That is not the case that has been taken. The GJ police have taken a case based on SC judgement- which the SC itself deemed as harsh in yesterday's hearing. That Teesta Setalvad defamed Gujarat and the Then CM by indicting them for the riots. It is a witch hunt. Working like doctors on critical patients The same Chief Justice opened court late at night to grant Arnab Goswami bail The same Justice Chandrachud opened court late at night to grant Arnab Goswami bail Dude there are 1000s or critical patients in line, why jump the queue. Because all are equal, some are more equal. Basically favouritism.. Justice Chandrachud heard the case in the morning of Wed 11, Nov 2020. Check the timestamp here Arnab was arrested on 4 Nov for a closed case which was opened without consent of court and bail plea heard good 7 days later. Here Teesta is not even arrested. >morning This was the time the news was reported, not the time when he got bail. The court was on holiday for Diwali that full week. And unlike summer break, they don't have vacation benches for Diwali yeah god bless the judges. For the second time in a day SC judges opens court at night around 9 to bail her despite of that they were on vacation And you know that SIT is formed for this investigation not Gujrat police and this SIT has filed case in SC not gujrat police."
}