{
    "id": "149wsvr",
    "title": "Was Shiv Kumar Batalavi having aspergers syndrome?",
    "url": "https://www.reddit.com/r/india/comments/149wsvr/was_shiv_kumar_batalavi_having_aspergers_syndrome/",
    "selftext": "Dear India subreddit,\n\nI have a naive question to people here. Especially psychologists who know about the legendary Punjabi Poet Shiva Kumar Batalavi. I was watching this video again and again:\n\n[https://www.youtube.com/watch?v=EgpSHpATAIM](https://www.youtube.com/watch?v=EgpSHpATAIM)\n\nHis values and weightage towards empathy towards individuals and sufferings seem to be very unique. Anyone would want to extrapolate on this naive question? His statement about relationship with women and the comment made is very striking. It has some sort of stoic elements.\n\nHas anyone checked his handwritings? I am not promoting graphology\\[it is considered pseudoscience\\]\n\nRef of handwritings: [http://www.sikh-heritage.co.uk/arts/shiv%20batalvi/Shiv%20batalvi.htm](http://www.sikh-heritage.co.uk/arts/shiv%20batalvi/Shiv%20batalvi.htm)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1686817494.0,
    "convurl": "https://external-preview.redd.it/zqixAHHW5QA6MAnPCX3YV3iizTYTDjGpEj-O5yToTfs.jpg?auto=webp&v=enabled&s=12fef7346f33cfe6cb470836cd3546b7811860c5",
    "comments": [
        "Not a psychologist but a great fan of him. I think is too innocent and talk with utmost decency.  The way he says - \" mai kitaab lelu\" ...\n\nHe likes few other poets like Ghalib knows too much about the existence. When the mind knows too much, it tends to destroy itelf. So, one can also sense suicidal tendency in his words easily as one can find in Ghalib's poetry."
    ],
    "cleaned_text": "shiv kumar batalavi aspergers syndrome dear india subreddit naive question people especially psychologists know legendary punjabi poet shiva kumar batalavi watching video httpswwwyoutubecomwatchvegpshpataimhttpswwwyoutubecomwatchvegpshpataim values weightage towards empathy towards individuals sufferings seem unique anyone would want extrapolate naive question statement relationship women comment made striking sort stoic elements anyone checked handwritings promoting graphologyit considered pseudoscience ref handwritings httpwwwsikhheritagecoukartsshivbatalvishivbatalvihtmhttpwwwsikhheritagecoukartsshivbatalvishivbatalvihtm ",
    "cleaned_title": "shiv kumar batalavi aspergers syndrome",
    "cleaned_selftext": "dear india subreddit naive question people especially psychologists know legendary punjabi poet shiva kumar batalavi watching video httpswwwyoutubecomwatchvegpshpataimhttpswwwyoutubecomwatchvegpshpataim values weightage towards empathy towards individuals sufferings seem unique anyone would want extrapolate naive question statement relationship women comment made striking sort stoic elements anyone checked handwritings promoting graphologyit considered pseudoscience ref handwritings httpwwwsikhheritagecoukartsshivbatalvishivbatalvihtmhttpwwwsikhheritagecoukartsshivbatalvishivbatalvihtm",
    "cleaned_comments": "psychologist great fan think innocent talk utmost decency way says mai kitaab lelu likes poets like ghalib knows much existence mind knows much tends destroy itelf one also sense suicidal tendency words easily one find ghalibs poetry",
    "light_cleaned_title": "Was Shiv Kumar Batalavi having aspergers syndrome?",
    "light_cleaned_selftext": "Dear India subreddit, I have a naive question to people here. Especially psychologists who know about the legendary Punjabi Poet Shiva Kumar Batalavi. I was watching this video again and again: [https://www.youtube.com/watch?v=EgpSHpATAIM](https://www.youtube.com/watch?v=EgpSHpATAIM) His values and weightage towards empathy towards individuals and sufferings seem to be very unique. Anyone would want to extrapolate on this naive question? His statement about relationship with women and the comment made is very striking. It has some sort of stoic elements. Has anyone checked his handwritings? I am not promoting graphology\\[it is considered pseudoscience\\] Ref of handwritings: [http://www.sikh-heritage.co.uk/arts/shiv%20batalvi/Shiv%20batalvi.htm](http://www.sikh-heritage.co.uk/arts/shiv%20batalvi/Shiv%20batalvi.htm)",
    "light_cleaned_comments": "Not a psychologist but a great fan of him. I think is too innocent and talk with utmost decency. The way he says - \" mai kitaab lelu\" ... He likes few other poets like Ghalib knows too much about the existence. When the mind knows too much, it tends to destroy itelf. So, one can also sense suicidal tendency in his words easily as one can find in Ghalib's poetry."
}