{
    "id": "130fc59",
    "title": "Airfare are skyrocketing, atleast 30% price jump from last year.",
    "url": "https://i.redd.it/ashxvlihtfwa1.png",
    "selftext": "was to book flight tickets to go home but now thinking train will be better option now(for students).  i remember paying 6.5-7k last year for same route and non-stop flight.",
    "flair": "Policy/Economy",
    "score": 74,
    "num_comments": 48,
    "created_utc": 1682587831.0,
    "convurl": "https://i.redd.it/ashxvlihtfwa1.png",
    "comments": [
        "source: screenshot of cleartrip.com website from my phone.",
        "&#x200B;\n\nhttps://preview.redd.it/60nxekvvvfwa1.png?width=2146&format=png&auto=webp&v=enabled&s=5bbf8e03e21170f690a30a6735aa5923d2ac19e0",
        "yes i also saw that but, last year if we book 2-3 week before we get to see the pricing around 6.5-7k and if booked even earlier then prices were 5.5-6k.",
        "You'll never get a seat in the train",
        "Search in incognito mode",
        "true😅",
        "did that same price.",
        "[Interesting article](https://www.ndtv.com/world-news/why-flying-is-so-expensive-and-likely-to-remain-that-way-3983604) I read earlier which goes into a few reasons.",
        "Check out transit flights, that's what I used to do earlier. \nAmd-del-ixc and I'd get down at Delhi.",
        "These prices are inflated because you would have searched many times.\nYea even through skyscanner incognito whatever. They are inflated.",
        "that used to work 10 years back, does not work anymore",
        "And the check-in baggage allowed has been reduced to 15 kgs since COVID. It used to be 25kgs.",
        "that used to work 10 years back, does not work anymore",
        "if you are pretty confident there would be no cancellations try ease my trip. 1 or 2 K off is pretty common.",
        "Is it allowed?",
        "Sure",
        "Ofcourse not silly. Be creative and be a storyteller and save money.",
        "Holiday season",
        "True. That time they relied on browser cookies. Now they fingerprint you, use analytics tools and use aggregated data from multiple users collected at cloud. So it’s pointless now whether you use incognito or tor. \n\nThe best workaround I have found is you play with flight dates 1-7 days before or after. That won’t affect prices for the date you want to fly.",
        "the best workaround i have found is check the general price graph in google flights. get an idea about prices\n\nbook around 20+ days before if its a planned trip. book in flexi scheme of indigo. check prices every morning. if price falls, book the ticket and get the refund. works for indigo flexi fare+ only. not sure works for AI and Vistara too",
        "#Achedin\nAmrit kaal \nThenk yew Mudixi",
        "Only Air India used to give 25. Rest all gave 15 only except for student or army quota.",
        "We told you...we told you \"more privatisation will lead to reduced fares\" is a lie. It has never been true.",
        "But riding on the roof has worked for me in the past....",
        "Try Skyscanner",
        "this shit is crazy man. i was looking for a resort to book since a month and it was showing me 10k costlier for a 2 day stay. My friend who just downloaded travel app for the first time got it for 10k less than my amount. obviously we booked via him then. but shits crazy",
        "Yup, some routes have become very expensive",
        "There is so much increase in price of foreign goods especially after rupees depreciated in value. Ps5 is expensive now and so are games on steam.",
        "Udey Desh ka Aam Nagrik Yojana hai yeh.",
        "Prices are dynamic. Its simple demand-supply. With Covid long behind us and workplaces mandating WFO, I would not be surprised if the time window for cheap flights shorten further."
    ],
    "cleaned_text": "airfare skyrocketing atleast price jump last year book flight tickets go home thinking train better option nowfor students remember paying k last year route nonstop flight ",
    "cleaned_title": "airfare skyrocketing atleast price jump last year",
    "cleaned_selftext": "book flight tickets go home thinking train better option nowfor students remember paying k last year route nonstop flight",
    "cleaned_comments": "source screenshot cleartripcom website phone xb yes also saw last year book week get see pricing around k booked even earlier prices k youll never get seat train search incognito mode true price interesting articlehttpswwwndtvcomworldnewswhyflyingissoexpensiveandlikelytoremainthatway read earlier goes reasons check transit flights thats used earlier amddelixc id get delhi prices inflated would searched many times yea even skyscanner incognito whatever inflated used work years back work anymore checkin baggage allowed reduced kgs since covid used kgs used work years back work anymore pretty confident would cancellations try ease trip k pretty common allowed sure ofcourse silly creative storyteller save money holiday season true time relied browser cookies fingerprint use analytics tools use aggregated data multiple users collected cloud pointless whether use incognito tor best workaround found play flight dates days wont affect prices date want fly best workaround found check general price graph google flights get idea prices book around days planned trip book flexi scheme indigo check prices every morning price falls book ticket get refund works indigo flexi fare sure works ai vistara achedin amrit kaal thenk yew mudixi air india used give rest gave except student army quota told youwe told privatisation lead reduced fares lie never true riding roof worked past try skyscanner shit crazy man looking resort book since month showing k costlier day stay friend downloaded travel app first time got k less amount obviously booked via shits crazy yup routes become expensive much increase price foreign goods especially rupees depreciated value ps expensive games steam udey desh ka aam nagrik yojana hai yeh prices dynamic simple demandsupply covid long behind us workplaces mandating wfo would surprised time window cheap flights shorten",
    "light_cleaned_title": "Airfare are skyrocketing, atleast 30% price jump from last year.",
    "light_cleaned_selftext": "was to book flight tickets to go home but now thinking train will be better option now(for students). i remember paying 6.5-7k last year for same route and non-stop flight.",
    "light_cleaned_comments": "source: screenshot of cleartrip.com website from my phone. &#x200B; yes i also saw that but, last year if we book 2-3 week before we get to see the pricing around 6.5-7k and if booked even earlier then prices were 5.5-6k. You'll never get a seat in the train Search in incognito mode true😅 did that same price. [Interesting article](https://www.ndtv.com/world-news/why-flying-is-so-expensive-and-likely-to-remain-that-way-3983604) I read earlier which goes into a few reasons. Check out transit flights, that's what I used to do earlier. Amd-del-ixc and I'd get down at Delhi. These prices are inflated because you would have searched many times. Yea even through skyscanner incognito whatever. They are inflated. that used to work 10 years back, does not work anymore And the check-in baggage allowed has been reduced to 15 kgs since COVID. It used to be 25kgs. that used to work 10 years back, does not work anymore if you are pretty confident there would be no cancellations try ease my trip. 1 or 2 K off is pretty common. Is it allowed? Sure Ofcourse not silly. Be creative and be a storyteller and save money. Holiday season True. That time they relied on browser cookies. Now they fingerprint you, use analytics tools and use aggregated data from multiple users collected at cloud. So it’s pointless now whether you use incognito or tor. The best workaround I have found is you play with flight dates 1-7 days before or after. That won’t affect prices for the date you want to fly. the best workaround i have found is check the general price graph in google flights. get an idea about prices book around 20+ days before if its a planned trip. book in flexi scheme of indigo. check prices every morning. if price falls, book the ticket and get the refund. works for indigo flexi fare+ only. not sure works for AI and Vistara too #Achedin Amrit kaal Thenk yew Mudixi Only Air India used to give 25. Rest all gave 15 only except for student or army quota. We told you...we told you \"more privatisation will lead to reduced fares\" is a lie. It has never been true. But riding on the roof has worked for me in the past.... Try Skyscanner this shit is crazy man. i was looking for a resort to book since a month and it was showing me 10k costlier for a 2 day stay. My friend who just downloaded travel app for the first time got it for 10k less than my amount. obviously we booked via him then. but shits crazy Yup, some routes have become very expensive There is so much increase in price of foreign goods especially after rupees depreciated in value. Ps5 is expensive now and so are games on steam. Udey Desh ka Aam Nagrik Yojana hai yeh. Prices are dynamic. Its simple demand-supply. With Covid long behind us and workplaces mandating WFO, I would not be surprised if the time window for cheap flights shorten further."
}