{
    "id": "12uu5ua",
    "title": "Man Kills Live-In Partner In Delhi, Throws Body 12 Km Away Outside A House",
    "url": "https://www.reddit.com/r/india/comments/12uu5ua/man_kills_livein_partner_in_delhi_throws_body_12/",
    "selftext": "https://www.ndtv.com/delhi-news/man-kills-live-in-partner-in-delhi-throws-body-12-km-away-outside-a-house-3968582\n\n> The woman, identified as Rohina, was living with her partner Vineet and the man and the woman eloped four years ago.\n\n>  The cops said the woman was pressuring the man for marriage, and they suspect that on April 12, the two fought over the issue, and the man strangled Rohina to death.\n\n> The police said the accused's sister helped the duo hide the body with her scarf.\n\n> Vineet and his father were serving life imprisonment in a 2019 murder case in Uttar Pradesh's Baghpat. The accused was out on bail since November last year.",
    "flair": "Crime",
    "score": 37,
    "num_comments": 21,
    "created_utc": 1682136626.0,
    "convurl": "https://external-preview.redd.it/rbNWilnI6pMCSMp_GTgpezTznl3eNx4FRrMc01JIjp8.jpg?auto=webp&v=enabled&s=05b5e42f6bcfa16395b0dc5757f8d41277f9d9fd",
    "comments": [
        "What's with relationships these days? Are people going full pshychotic after COVID?\nSince the accused isn't from a particular community, I guess this news wouldn't blow up.",
        "Sahi pakde hai.",
        "Bhai mil gaya retired unkils ko WhatsApp fwd material:\n\n\"aur raho live-in me, fir ye sab hota hai\"",
        "His sister helped him?? Kya hogya hai bhaiii pagal hogye hai log... Ab kya Mila murder karke? Jail ki hawa bas...",
        "This trend is still going on?",
        "First nirbhaya,aftabh and now this why Delhi is epicenter of these crimes?",
        "Just another day in Delhi.",
        "Well the guy was out on bail on a murder case.",
        "2 facts: Vineet was convicted in a murder case. Vineet and Rohini were in a live in relationship. Whoever wrote the headline somehow thought the live in part was more important than the convicted murderer part. Seriously, what the fuck",
        "you left like 99% of all crimes that happens in delhi",
        "Really our capital shouldn't be like this",
        "No Muslim character! \n\nPass",
        "Girls like bad boys -Chandler bing."
    ],
    "cleaned_text": "man kills livein partner delhi throws body km away outside house woman identified rohina living partner vineet man woman eloped four years ago cops said woman pressuring man marriage suspect april two fought issue man strangled rohina death police said accuseds sister helped duo hide body scarf vineet father serving life imprisonment murder case uttar pradeshs baghpat accused bail since november last year ",
    "cleaned_title": "man kills livein partner delhi throws body km away outside house",
    "cleaned_selftext": "woman identified rohina living partner vineet man woman eloped four years ago cops said woman pressuring man marriage suspect april two fought issue man strangled rohina death police said accuseds sister helped duo hide body scarf vineet father serving life imprisonment murder case uttar pradeshs baghpat accused bail since november last year",
    "cleaned_comments": "whats relationships days people going full pshychotic covid since accused isnt particular community guess news wouldnt blow sahi pakde hai bhai mil gaya retired unkils ko whatsapp fwd material aur raho livein fir ye sab hota hai sister helped kya hogya hai bhaiii pagal hogye hai log ab kya mila murder karke jail ki hawa bas trend still going first nirbhayaaftabh delhi epicenter crimes another day delhi well guy bail murder case facts vineet convicted murder case vineet rohini live relationship whoever wrote headline somehow thought live part important convicted murderer part seriously fuck left like crimes happens delhi really capital shouldnt like muslim character pass girls like bad boys chandler bing",
    "light_cleaned_title": "Man Kills Live-In Partner In Delhi, Throws Body 12 Km Away Outside A House",
    "light_cleaned_selftext": "> The woman, identified as Rohina, was living with her partner Vineet and the man and the woman eloped four years ago. > The cops said the woman was pressuring the man for marriage, and they suspect that on April 12, the two fought over the issue, and the man strangled Rohina to death. > The police said the accused's sister helped the duo hide the body with her scarf. > Vineet and his father were serving life imprisonment in a 2019 murder case in Uttar Pradesh's Baghpat. The accused was out on bail since November last year.",
    "light_cleaned_comments": "What's with relationships these days? Are people going full pshychotic after COVID? Since the accused isn't from a particular community, I guess this news wouldn't blow up. Sahi pakde hai. Bhai mil gaya retired unkils ko WhatsApp fwd material: \"aur raho live-in me, fir ye sab hota hai\" His sister helped him?? Kya hogya hai bhaiii pagal hogye hai log... Ab kya Mila murder karke? Jail ki hawa bas... This trend is still going on? First nirbhaya,aftabh and now this why Delhi is epicenter of these crimes? Just another day in Delhi. Well the guy was out on bail on a murder case. 2 facts: Vineet was convicted in a murder case. Vineet and Rohini were in a live in relationship. Whoever wrote the headline somehow thought the live in part was more important than the convicted murderer part. Seriously, what the fuck you left like 99% of all crimes that happens in delhi Really our capital shouldn't be like this No Muslim character! Pass Girls like bad boys -Chandler bing."
}