{
    "id": "157f5jr",
    "title": "Why do you think female traveler numbers from developed countries increasing when India is increasingly not safe for women?",
    "url": "https://www.reddit.com/r/india/comments/157f5jr/why_do_you_think_female_traveler_numbers_from/",
    "selftext": "[https://travelbizmonitor.com/share-of-inbound-women-travellers-visiting-india-from-developed-countries-has-increasedrategain/](https://travelbizmonitor.com/share-of-inbound-women-travellers-visiting-india-from-developed-countries-has-increasedrategain/)\n\nthis is the article",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690119663.0,
    "convurl": "https://external-preview.redd.it/6UHgTz_ePvU9JPh6p-9eEwJepIrHxzC8qAOo4NVHjQ8.jpg?auto=webp&s=b179ddb3ddf3507715f01c879513c0ad2d3daf37",
    "comments": [
        "I mean India is still a different world from rest of west, and with current environment Indian culture ka prachar bhi jyada ho raha and Indians khud net pe kafi proactive hote hai to showcases their achievements and when someone talks about us\n\nAnd one must not forget that people have all kinds of experience and net has small sample size . I hear all kinds of experiences. Some hate being here , some love it for some it's somewhere in between so....",
        "Influencers shit and its cheaper for people from developed countries to holiday in India.",
        "It can be safe if you avoid shitty neighborhoods. Only problem is people need to stop taking selfies with foreigners"
    ],
    "cleaned_text": "think female traveler numbers developed countries increasing india increasingly safe women httpstravelbizmonitorcomshareofinboundwomentravellersvisitingindiafromdevelopedcountrieshasincreasedrategainhttpstravelbizmonitorcomshareofinboundwomentravellersvisitingindiafromdevelopedcountrieshasincreasedrategain article ",
    "cleaned_title": "think female traveler numbers developed countries increasing india increasingly safe women",
    "cleaned_selftext": "httpstravelbizmonitorcomshareofinboundwomentravellersvisitingindiafromdevelopedcountrieshasincreasedrategainhttpstravelbizmonitorcomshareofinboundwomentravellersvisitingindiafromdevelopedcountrieshasincreasedrategain article",
    "cleaned_comments": "mean india still different world rest west current environment indian culture ka prachar bhi jyada ho raha indians khud net pe kafi proactive hote hai showcases achievements someone talks us one must forget people kinds experience net small sample size hear kinds experiences hate love somewhere influencers shit cheaper people developed countries holiday india safe avoid shitty neighborhoods problem people need stop taking selfies foreigners",
    "light_cleaned_title": "Why do you think female traveler numbers from developed countries increasing when India is increasingly not safe for women?",
    "light_cleaned_selftext": "[https://travelbizmonitor.com/share-of-inbound-women-travellers-visiting-india-from-developed-countries-has-increasedrategain/](https://travelbizmonitor.com/share-of-inbound-women-travellers-visiting-india-from-developed-countries-has-increasedrategain/) this is the article",
    "light_cleaned_comments": "I mean India is still a different world from rest of west, and with current environment Indian culture ka prachar bhi jyada ho raha and Indians khud net pe kafi proactive hote hai to showcases their achievements and when someone talks about us And one must not forget that people have all kinds of experience and net has small sample size . I hear all kinds of experiences. Some hate being here , some love it for some it's somewhere in between so.... Influencers shit and its cheaper for people from developed countries to holiday in India. It can be safe if you avoid shitty neighborhoods. Only problem is people need to stop taking selfies with foreigners"
}