{
    "id": "14k9ocp",
    "title": "Why can't we expect the same from Indian News Media outlets? What steps can be taken to ensure this level of foresight and constraint?",
    "url": "https://www.reddit.com/r/india/comments/14k9ocp/why_cant_we_expect_the_same_from_indian_news/",
    "selftext": " During the 1997 Financial Crisis of Japan, many Japanese news media outlet voluntarily and without any collusion or coercion from authorities, universally refrained from reporting about the queues forming in front of the failing banks as they had the foresight that it could magnify the panic beyond the point of no return. And it worked, as things began to settle down gradually, giving precious time to the authorities to manage the situation.  \n(Ref : [*https://www.nippon.com/en/currents/d00360/*](https://www.nippon.com/en/currents/d00360/))\n\nThis behavior cannot be forced upon media outlets as it will defeat the purpose of keeping them independent but at the same time it seems crucial in averting dire outcomes and resolving them at far lower costs.",
    "flair": "AskIndia",
    "score": 5,
    "num_comments": 9,
    "created_utc": 1687861001.0,
    "convurl": "https://external-preview.redd.it/Nt91ErWCBvgKwih9YKico0kGT9mmKuOip-azwRzuM_s.jpg?auto=webp&v=enabled&s=b5560d4713a2e250658a68d54c6b48b93935a98f",
    "comments": [
        "Bruh 🤣 indian media and brain these 2 things r mutually exclusive",
        "That's bad journalism. News outlets are supposed to inform the public, not influence the public",
        "I think the people deserved to know about the queues forming. If the media is concerned about the effects of it then they are free to provide context, expert analysis and even narratives. Having said that I wouldn’t be surprised if something like this happens in India, a reporter in a studio will claim that they’re at the scene, live, and in the queues while proceeding to speak absolute bs.",
        "I see your point. But that is where professional ethics come in picture, where the ideals and pragmatism are balanced.\n\nAnd then if your point holds true, then activism in journalism will fall obsolete, as usually this type of journalism tends to narrate an incident from a particular perspective while ignoring the other. Though one can argue about its ligitimacy, but can they disagree that activism also gives voice to the voiceless?",
        "What you mentioned will surely improve the journalistic standards, but we cannot overlook the fact that the very phrase \"bank in trouble\" and \"long queues\" will trigger a spiral down response, no matter how well worded it is. And the only way to avoid is to water it down, which again defies the gravity of situation.",
        "bro the left media will find any opportunity to showcase and accentuate any misshap happening during this period.",
        "I understand but disagree. The value of a journalist, ideally,  is in imparting well researched information. If not then journalistic integrity is compromised. An extreme example of the compromise today can be seen in Russia where the journalists are reduced to pawns of the regime. Perhaps the journalists in Japan were pawns of the bourgeois capitalists and the media companies had vested interests in not informing people. I concede that nothing is ideal, and journalists have often been tools for rhetoric and propaganda. But then again- SHOULD the people have been informed? The answer is still yes for me.",
        "If one news outlet doesn’t report, but see another covering it and also getting trp, then they too have to do it. Our news outlets rely heavily on ads. It can only be forcefully sone by cutting government ads on those who don’t follow and that doesn’t serve the purpose."
    ],
    "cleaned_text": "cant expect indian news media outlets steps taken ensure level foresight constraint financial crisis japan many japanese news media outlet voluntarily without collusion coercion authorities universally refrained reporting queues forming front failing banks foresight could magnify panic beyond point return worked things began settle gradually giving precious time authorities manage situation ref httpswwwnipponcomencurrentsdhttpswwwnipponcomencurrentsd behavior forced upon media outlets defeat purpose keeping independent time seems crucial averting dire outcomes resolving far lower costs ",
    "cleaned_title": "cant expect indian news media outlets steps taken ensure level foresight constraint",
    "cleaned_selftext": "financial crisis japan many japanese news media outlet voluntarily without collusion coercion authorities universally refrained reporting queues forming front failing banks foresight could magnify panic beyond point return worked things began settle gradually giving precious time authorities manage situation ref httpswwwnipponcomencurrentsdhttpswwwnipponcomencurrentsd behavior forced upon media outlets defeat purpose keeping independent time seems crucial averting dire outcomes resolving far lower costs",
    "cleaned_comments": "bruh indian media brain things r mutually exclusive thats bad journalism news outlets supposed inform public influence public think people deserved know queues forming media concerned effects free provide context expert analysis even narratives said wouldnt surprised something like happens india reporter studio claim theyre scene live queues proceeding speak absolute bs see point professional ethics come picture ideals pragmatism balanced point holds true activism journalism fall obsolete usually type journalism tends narrate incident particular perspective ignoring though one argue ligitimacy disagree activism also gives voice voiceless mentioned surely improve journalistic standards overlook fact phrase bank trouble long queues trigger spiral response matter well worded way avoid water defies gravity situation bro left media find opportunity showcase accentuate misshap happening period understand disagree value journalist ideally imparting well researched information journalistic integrity compromised extreme example compromise today seen russia journalists reduced pawns regime perhaps journalists japan pawns bourgeois capitalists media companies vested interests informing people concede nothing ideal journalists often tools rhetoric propaganda people informed answer still yes one news outlet doesnt report see another covering also getting trp news outlets rely heavily ads forcefully sone cutting government ads dont follow doesnt serve purpose",
    "light_cleaned_title": "Why can't we expect the same from Indian News Media outlets? What steps can be taken to ensure this level of foresight and constraint?",
    "light_cleaned_selftext": "During the 1997 Financial Crisis of Japan, many Japanese news media outlet voluntarily and without any collusion or coercion from authorities, universally refrained from reporting about the queues forming in front of the failing banks as they had the foresight that it could magnify the panic beyond the point of no return. And it worked, as things began to settle down gradually, giving precious time to the authorities to manage the situation. (Ref : [*https://www.nippon.com/en/currents/d00360/*](https://www.nippon.com/en/currents/d00360/)) This behavior cannot be forced upon media outlets as it will defeat the purpose of keeping them independent but at the same time it seems crucial in averting dire outcomes and resolving them at far lower costs.",
    "light_cleaned_comments": "Bruh 🤣 indian media and brain these 2 things r mutually exclusive That's bad journalism. News outlets are supposed to inform the public, not influence the public I think the people deserved to know about the queues forming. If the media is concerned about the effects of it then they are free to provide context, expert analysis and even narratives. Having said that I wouldn’t be surprised if something like this happens in India, a reporter in a studio will claim that they’re at the scene, live, and in the queues while proceeding to speak absolute bs. I see your point. But that is where professional ethics come in picture, where the ideals and pragmatism are balanced. And then if your point holds true, then activism in journalism will fall obsolete, as usually this type of journalism tends to narrate an incident from a particular perspective while ignoring the other. Though one can argue about its ligitimacy, but can they disagree that activism also gives voice to the voiceless? What you mentioned will surely improve the journalistic standards, but we cannot overlook the fact that the very phrase \"bank in trouble\" and \"long queues\" will trigger a spiral down response, no matter how well worded it is. And the only way to avoid is to water it down, which again defies the gravity of situation. bro the left media will find any opportunity to showcase and accentuate any misshap happening during this period. I understand but disagree. The value of a journalist, ideally, is in imparting well researched information. If not then journalistic integrity is compromised. An extreme example of the compromise today can be seen in Russia where the journalists are reduced to pawns of the regime. Perhaps the journalists in Japan were pawns of the bourgeois capitalists and the media companies had vested interests in not informing people. I concede that nothing is ideal, and journalists have often been tools for rhetoric and propaganda. But then again- SHOULD the people have been informed? The answer is still yes for me. If one news outlet doesn’t report, but see another covering it and also getting trp, then they too have to do it. Our news outlets rely heavily on ads. It can only be forcefully sone by cutting government ads on those who don’t follow and that doesn’t serve the purpose."
}