{
    "id": "14v27xt",
    "title": "Jio International Roaming - Prepaid - Using it for 1st Time",
    "url": "https://www.reddit.com/r/india/comments/14v27xt/jio_international_roaming_prepaid_using_it_for/",
    "selftext": "Hi, I'm confused, for Jio Prepaid International Roaming, do you still have to purchase a IR pack once? Assuming I've never used IR with this Jio number before.\n\nOr just activate through the Jio app, and then I can use Pay as You Go rates without purchasing an IR pack?? (I prefer to use Pay as You Go)\n\nSome pages on Jio say that for Prepaid you need to *purchase IR Pack at least once.* However, the link below says   \n\\--------------  \n([https://www.jio.com/help/faq/mobile/international-services/prepaid-ir-activation/can-i-activate-the-international-roaming-service-after-reaching-another-country-if-yes-what-settings-do-i-need-to-check-on-my-device#/](https://www.jio.com/help/faq/mobile/international-services/prepaid-ir-activation/can-i-activate-the-international-roaming-service-after-reaching-another-country-if-yes-what-settings-do-i-need-to-check-on-my-device#/)):\n\n***If you are activating IR service for the first time and would like to enjoy seamless IR service across all 120+ countries, then it is required that you purchase IR pack when you are connected to Jio network in India. We would advise you to activate pack at least 4 hrs before your departure. After purchasing the pack, your phone needs to be restarted to process the request.***\n\n***However, if you want to use IR service only in the below listed 120+ countries, you can buy the IR pack even when you are at an international location. Your phone needs re-start once the IR settings are processed.***\n\n[*Click Here*](https://jep-asset.akamaized.net/jio/plan/List_of_Countries.pdf) *for applicable list of countries*  \n\\-----------------\n\nDoes this mean I don't need to purchase a IR Pack even once, if the country that I am visiting is in their list? For reference, I was able to \"activate\" IR through the Jio App, but not sure if it will work unless I purchase a pack once. I just want to travel to the country and use Pay As You Go for the first time, without any packs. Is this possible?\n\nThanks!!",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 2,
    "created_utc": 1688918548.0,
    "convurl": "https://external-preview.redd.it/LEmoDfZAQjOsrPL2oZXv5fP1v6T6TRMO3zXDOv9b2hg.jpg?auto=webp&v=enabled&s=6bedce2a926dce61dcd24c209fadb61a6c0f45c8",
    "comments": [
        "I am in the same situation as you and I was told that you need to add Top Up ₹ to your account from which the per minute charges will be deducted.",
        "Same scenario here and assuming you made a decision and moved abroad, how was your experience and what would you advice me?"
    ],
    "cleaned_text": "jio international roaming prepaid using st time hi im confused jio prepaid international roaming still purchase ir pack assuming ive never used ir jio number activate jio app use pay go rates without purchasing ir pack prefer use pay go pages jio say prepaid need purchase ir pack least however link says httpswwwjiocomhelpfaqmobileinternationalservicesprepaidiractivationcaniactivatetheinternationalroamingserviceafterreachinganothercountryifyeswhatsettingsdoineedtocheckonmydevicehttpswwwjiocomhelpfaqmobileinternationalservicesprepaidiractivationcaniactivatetheinternationalroamingserviceafterreachinganothercountryifyeswhatsettingsdoineedtocheckonmydevice activating ir service first time would like enjoy seamless ir service across countries required purchase ir pack connected jio network india would advise activate pack least hrs departure purchasing pack phone needs restarted process request however want use ir service listed countries buy ir pack even international location phone needs restart ir settings processed click herehttpsjepassetakamaizednetjioplanlistofcountriespdf applicable list countries mean dont need purchase ir pack even country visiting list reference able activate ir jio app sure work unless purchase pack want travel country use pay go first time without packs possible thanks ",
    "cleaned_title": "jio international roaming prepaid using st time",
    "cleaned_selftext": "hi im confused jio prepaid international roaming still purchase ir pack assuming ive never used ir jio number activate jio app use pay go rates without purchasing ir pack prefer use pay go pages jio say prepaid need purchase ir pack least however link says httpswwwjiocomhelpfaqmobileinternationalservicesprepaidiractivationcaniactivatetheinternationalroamingserviceafterreachinganothercountryifyeswhatsettingsdoineedtocheckonmydevicehttpswwwjiocomhelpfaqmobileinternationalservicesprepaidiractivationcaniactivatetheinternationalroamingserviceafterreachinganothercountryifyeswhatsettingsdoineedtocheckonmydevice activating ir service first time would like enjoy seamless ir service across countries required purchase ir pack connected jio network india would advise activate pack least hrs departure purchasing pack phone needs restarted process request however want use ir service listed countries buy ir pack even international location phone needs restart ir settings processed click herehttpsjepassetakamaizednetjioplanlistofcountriespdf applicable list countries mean dont need purchase ir pack even country visiting list reference able activate ir jio app sure work unless purchase pack want travel country use pay go first time without packs possible thanks",
    "cleaned_comments": "situation told need add top account per minute charges deducted scenario assuming made decision moved abroad experience would advice",
    "light_cleaned_title": "Jio International Roaming - Prepaid - Using it for 1st Time",
    "light_cleaned_selftext": "Hi, I'm confused, for Jio Prepaid International Roaming, do you still have to purchase a IR pack once? Assuming I've never used IR with this Jio number before. Or just activate through the Jio app, and then I can use Pay as You Go rates without purchasing an IR pack?? (I prefer to use Pay as You Go) Some pages on Jio say that for Prepaid you need to *purchase IR Pack at least once.* However, the link below says \\-------------- ([https://www.jio.com/help/faq/mobile/international-services/prepaid-ir-activation/can-i-activate-the-international-roaming-service-after-reaching-another-country-if-yes-what-settings-do-i-need-to-check-on-my-device#/](https://www.jio.com/help/faq/mobile/international-services/prepaid-ir-activation/can-i-activate-the-international-roaming-service-after-reaching-another-country-if-yes-what-settings-do-i-need-to-check-on-my-device#/)): ***If you are activating IR service for the first time and would like to enjoy seamless IR service across all 120+ countries, then it is required that you purchase IR pack when you are connected to Jio network in India. We would advise you to activate pack at least 4 hrs before your departure. After purchasing the pack, your phone needs to be restarted to process the request.*** ***However, if you want to use IR service only in the below listed 120+ countries, you can buy the IR pack even when you are at an international location. Your phone needs re-start once the IR settings are processed.*** [*Click Here*](https://jep-asset.akamaized.net/jio/plan/List_of_Countries.pdf) *for applicable list of countries* \\----------------- Does this mean I don't need to purchase a IR Pack even once, if the country that I am visiting is in their list? For reference, I was able to \"activate\" IR through the Jio App, but not sure if it will work unless I purchase a pack once. I just want to travel to the country and use Pay As You Go for the first time, without any packs. Is this possible? Thanks!!",
    "light_cleaned_comments": "I am in the same situation as you and I was told that you need to add Top Up ₹ to your account from which the per minute charges will be deducted. Same scenario here and assuming you made a decision and moved abroad, how was your experience and what would you advice me?"
}