{
    "id": "1dr8t9c",
    "title": "Shameless Promotion of betting apps in Lucknow metros.",
    "url": "https://www.reddit.com/r/india/comments/1dr8t9c/shameless_promotion_of_betting_apps_in_lucknow/",
    "selftext": "https://preview.redd.it/n162p3tbrh9d1.png?width=539&format=png&auto=webp&s=26e9267a8b17a5218610f34807b85e06a0d92c3c\n\nYesterday, while traveling on the Lucknow Metro, I was appalled to see posters advertising a betting app.\n\nPromoting betting apps in public spaces like the metro is problematic because:-   \n1) **Encourages Gambling Addiction:** Betting apps can be highly addictive and promote gambling behavior among individuals who might otherwise not engage in such activities. By advertising these apps, UPMRC is indirectly encouraging gambling, which can lead to addiction and financial ruin for many.  \n2) **Targets Vulnerable Populations:** Many metro commuters are young students and individuals from lower-income backgrounds. These groups are particularly vulnerable to the lure of quick money that betting apps promise, but the reality is often financial losses and debt. I am a student myself and i was already upset to see some of my friends put their money in these betting apps, seeing this was such a shock to me.  \n3) **Setting a Dangerous Precedent:** If public entities like UPMRC begin to rely on revenue from such sources, it sets a dangerous precedent for other public services to follow. This could lead to a widespread normalization of gambling advertisements in public spaces, further exacerbating the issues mentioned above.\n\nWe should speak up against this.",
    "flair": "Law & Courts",
    "score": 112,
    "num_comments": 16,
    "created_utc": 1719659296.0,
    "convurl": "https://b.thumbs.redditmedia.com/6AFBUC3LDTnVudFYZjcoTS6-8C5VXUiPwL_Q5IJEcno.jpg",
    "comments": [
        "Bhai kaunsa dangerous precedent?\n\nDream 11, Rummy Circle aur My Team 11 k bare main nhi suna?",
        "they are being promoted on social media and on tv channels which the giver themselves don't control but this is ads but directly by UPMRC which is a government organisation",
        "Capitalism",
        "Saal bhar zyada nahin chun chun ke gaadi paltai jayegi.\n\nBeta abhi toh kuch bhi nai hua hai\n\nAage aage dekho kya kya hota hai hum sabke sath\n\n\n[GPS chips to made mandatory for all vehicles.](https://www.business-standard.com/amp/industry/news/insurers-eye-windfall-from-proposed-satellite-based-toll-collection-system-124062701032_1.html)",
        "Meanwhile I'm hoping that the government makes gambling legal like in America, cuz that business model is straight up $$$",
        "Ok\nYou know what \n\nYou can always try to introduce famous businesses on the metro route to ask them to advertise in Lucknow metro",
        "Bro\n\nICT ka main sponsor ek betting app hai",
        "Zerodha, groww aur angel one wale ab offline promotions bhi karne lag gye kya ?",
        "Just wanting people to know that any website/video that has ads has chosen to allow the category of gambling in the ads.",
        "According to my information lucknow metro is mostly empty",
        "bruh i travel daily and it's always full",
        "The stats show different picture",
        "Since BJP has come, betting has become normalised even if illegal officially. Think of all those Dream11s... BJP just wants to make money, money and money.",
        "Most sports are now sponsored by betting apps, which is odd because betting is illegal for the players.",
        "Yeah I can't think of any betting apps that are approved by our so called sanatani hindu culture .",
        "If you're going to use chatGPT, atleast acknowledge that you wrote it using chatGPT.",
        "i wrote it myself then asked  chat gpt to fix my spelling and grammar and format it in points. my english not so professional sorry"
    ],
    "cleaned_text": "shameless promotion betting apps lucknow metros yesterday traveling lucknow metro appalled see posters advertising betting app promoting betting apps public spaces like metro problematic encourages gambling addiction betting apps highly addictive promote gambling behavior among individuals might otherwise engage activities advertising apps upmrc indirectly encouraging gambling lead addiction financial ruin many targets vulnerable populations many metro commuters young students individuals lowerincome backgrounds groups particularly vulnerable lure quick money betting apps promise reality often financial losses debt student already upset see friends put money betting apps seeing shock setting dangerous precedent public entities like upmrc begin rely revenue sources sets dangerous precedent public services follow could lead widespread normalization gambling advertisements public spaces exacerbating issues mentioned speak ",
    "cleaned_title": "shameless promotion betting apps lucknow metros",
    "cleaned_selftext": "yesterday traveling lucknow metro appalled see posters advertising betting app promoting betting apps public spaces like metro problematic encourages gambling addiction betting apps highly addictive promote gambling behavior among individuals might otherwise engage activities advertising apps upmrc indirectly encouraging gambling lead addiction financial ruin many targets vulnerable populations many metro commuters young students individuals lowerincome backgrounds groups particularly vulnerable lure quick money betting apps promise reality often financial losses debt student already upset see friends put money betting apps seeing shock setting dangerous precedent public entities like upmrc begin rely revenue sources sets dangerous precedent public services follow could lead widespread normalization gambling advertisements public spaces exacerbating issues mentioned speak",
    "cleaned_comments": "bhai kaunsa dangerous precedent dream rummy circle aur team k bare main nhi suna promoted social media tv channels giver dont control ads directly upmrc government organisation capitalism saal bhar zyada nahin chun chun ke gaadi paltai jayegi beta abhi toh kuch bhi nai hua hai aage aage dekho kya kya hota hai hum sabke sath gps chips made mandatory vehicleshttpswwwbusinessstandardcomampindustrynewsinsurerseyewindfallfromproposedsatellitebasedtollcollectionsystemhtml meanwhile im hoping government makes gambling legal like america cuz business model straight ok know always try introduce famous businesses metro route ask advertise lucknow metro bro ict ka main sponsor ek betting app hai zerodha groww aur angel one wale ab offline promotions bhi karne lag gye kya wanting people know websitevideo ads chosen allow category gambling ads according information lucknow metro mostly empty bruh travel daily always full stats show different picture since bjp come betting become normalised even illegal officially think dreams bjp wants make money money money sports sponsored betting apps odd betting illegal players yeah cant think betting apps approved called sanatani hindu culture youre going use chatgpt atleast acknowledge wrote using chatgpt wrote asked chat gpt fix spelling grammar format points english professional sorry",
    "light_cleaned_title": "Shameless Promotion of betting apps in Lucknow metros.",
    "light_cleaned_selftext": "Yesterday, while traveling on the Lucknow Metro, I was appalled to see posters advertising a betting app. Promoting betting apps in public spaces like the metro is problematic because:- 1) **Encourages Gambling Addiction:** Betting apps can be highly addictive and promote gambling behavior among individuals who might otherwise not engage in such activities. By advertising these apps, UPMRC is indirectly encouraging gambling, which can lead to addiction and financial ruin for many. 2) **Targets Vulnerable Populations:** Many metro commuters are young students and individuals from lower-income backgrounds. These groups are particularly vulnerable to the lure of quick money that betting apps promise, but the reality is often financial losses and debt. I am a student myself and i was already upset to see some of my friends put their money in these betting apps, seeing this was such a shock to me. 3) **Setting a Dangerous Precedent:** If public entities like UPMRC begin to rely on revenue from such sources, it sets a dangerous precedent for other public services to follow. This could lead to a widespread normalization of gambling advertisements in public spaces, further exacerbating the issues mentioned above. We should speak up against this.",
    "light_cleaned_comments": "Bhai kaunsa dangerous precedent? Dream 11, Rummy Circle aur My Team 11 k bare main nhi suna? they are being promoted on social media and on tv channels which the giver themselves don't control but this is ads but directly by UPMRC which is a government organisation Capitalism Saal bhar zyada nahin chun chun ke gaadi paltai jayegi. Beta abhi toh kuch bhi nai hua hai Aage aage dekho kya kya hota hai hum sabke sath [GPS chips to made mandatory for all vehicles.](https://www.business-standard.com/amp/industry/news/insurers-eye-windfall-from-proposed-satellite-based-toll-collection-system-124062701032_1.html) Meanwhile I'm hoping that the government makes gambling legal like in America, cuz that business model is straight up $$$ Ok You know what You can always try to introduce famous businesses on the metro route to ask them to advertise in Lucknow metro Bro ICT ka main sponsor ek betting app hai Zerodha, groww aur angel one wale ab offline promotions bhi karne lag gye kya ? Just wanting people to know that any website/video that has ads has chosen to allow the category of gambling in the ads. According to my information lucknow metro is mostly empty bruh i travel daily and it's always full The stats show different picture Since BJP has come, betting has become normalised even if illegal officially. Think of all those Dream11s... BJP just wants to make money, money and money. Most sports are now sponsored by betting apps, which is odd because betting is illegal for the players. Yeah I can't think of any betting apps that are approved by our so called sanatani hindu culture . If you're going to use chatGPT, atleast acknowledge that you wrote it using chatGPT. i wrote it myself then asked chat gpt to fix my spelling and grammar and format it in points. my english not so professional sorry"
}