{
    "id": "15bmveg",
    "title": "Local government officials in Bengaluru Deputy Commissioner's office seem to have utter disregard for Courts and Court orders. #mystory",
    "url": "https://www.reddit.com/r/india/comments/15bmveg/local_government_officials_in_bengaluru_deputy/",
    "selftext": "Some of you have been following my saga for a while. A link to my Petition if you [\\[wish to review the details\\]](https://www.change.org/RevenueKarnataka). TL;DR rather than find a network of agents to bribe officials, I decided to take a legal route and this has been my experience.  \n\nI took the matter to **Karnataka High Court** several times in the pas 5-6 years\n\n* **WP 46964/2017** \\- Court orders officials to act on my file  \"within 6 months\" \n* **WA 6697/2017 -** Filed Writ Appeal High Court orders officials to act on my file  \n* **WP 6929/2023 -** For this Writ Petition High Court orders officials to act on my file within 45 days. \n* **CCC 734/2023 -** Filed a **Contempt of Court** in **Karnataka High Court**  since officials failed to act on my file within 45 days of HC Order. \n\nLatest #mystory in [The Hindu](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece). \n\nOh the things one must do to stand up for one's legal rights! Grit! ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690517305.0,
    "convurl": "https://external-preview.redd.it/NhXebUw5gwSsq25iVbqNn_USzIZzoONTHEnV4IlTlQk.jpg",
    "comments": [],
    "cleaned_text": "local government officials bengaluru deputy commissioners office seem utter disregard courts court orders mystory following saga link petition wish review detailshttpswwwchangeorgrevenuekarnataka tldr rather find network agents bribe officials decided take legal route experience took matter karnataka high court several times pas years wp court orders officials act file within months wa filed writ appeal high court orders officials act file wp writ petition high court orders officials act file within days ccc filed contempt court karnataka high court since officials failed act file within days hc order latest mystory hinduhttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece oh things one must stand ones legal rights grit ",
    "cleaned_title": "local government officials bengaluru deputy commissioners office seem utter disregard courts court orders mystory",
    "cleaned_selftext": "following saga link petition wish review detailshttpswwwchangeorgrevenuekarnataka tldr rather find network agents bribe officials decided take legal route experience took matter karnataka high court several times pas years wp court orders officials act file within months wa filed writ appeal high court orders officials act file wp writ petition high court orders officials act file within days ccc filed contempt court karnataka high court since officials failed act file within days hc order latest mystory hinduhttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece oh things one must stand ones legal rights grit",
    "cleaned_comments": "",
    "light_cleaned_title": "Local government officials in Bengaluru Deputy Commissioner's office seem to have utter disregard for Courts and Court orders. #mystory",
    "light_cleaned_selftext": "Some of you have been following my saga for a while. A link to my Petition if you [\\[wish to review the details\\]](https://www.change.org/RevenueKarnataka). TL;DR rather than find a network of agents to bribe officials, I decided to take a legal route and this has been my experience. I took the matter to **Karnataka High Court** several times in the pas 5-6 years * **WP 46964/2017** \\- Court orders officials to act on my file \"within 6 months\" * **WA 6697/2017 -** Filed Writ Appeal High Court orders officials to act on my file * **WP 6929/2023 -** For this Writ Petition High Court orders officials to act on my file within 45 days. * **CCC 734/2023 -** Filed a **Contempt of Court** in **Karnataka High Court** since officials failed to act on my file within 45 days of HC Order. Latest #mystory in [The Hindu](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece). Oh the things one must do to stand up for one's legal rights! Grit!",
    "light_cleaned_comments": ""
}