{
    "id": "1e2oa8t",
    "title": "Trump says he is fine after being whisked off stage following apparent gunfire at rally",
    "url": "https://indianexpress.com/article/world/trump-says-he-is-fine-after-being-whisked-off-stage-following-apparent-gunfire-at-rally-9452007/",
    "selftext": "The US Secret Service and other law enforcement agencies did not immediately respond to messages. President Joe Biden has been briefed on the incident, the White House said.",
    "flair": "Crime",
    "score": 4,
    "num_comments": 8,
    "created_utc": 1720914256.0,
    "convurl": "https://external-preview.redd.it/AHDGodqSF7gAojZmoRHspTiWaQ_0CBh7j5IfLGZOF9o.jpg?auto=webp&s=7b73037e9dfb7878a6f05899f5da094bdd91d2c8",
    "comments": [
        "Definitely winning now",
        "This dude is definitely winning now!",
        ".",
        "Biden will have to pull a rabbit out of his as to top this, even then he won't.\n\nTrump is going to win again.\n\n  \nAmerica is fkcd. They need a miracle.",
        "Update : https://indianexpress.com/article/world/trump-fine-after-shooting-at-rally-campaign-says-prosecutor-says-gunman-and-1-attendee-are-dead-9452027/",
        "If the bullet actually grazed his ears, he was saved by a whisker man. One lucky guy.",
        "Biden needs to step down now and give space to someone younger.",
        "Don't worry. Trump won't win."
    ],
    "cleaned_text": "trump says fine whisked stage following apparent gunfire rally us secret service law enforcement agencies immediately respond messages president joe biden briefed incident white house said ",
    "cleaned_title": "trump says fine whisked stage following apparent gunfire rally",
    "cleaned_selftext": "us secret service law enforcement agencies immediately respond messages president joe biden briefed incident white house said",
    "cleaned_comments": "definitely winning dude definitely winning biden pull rabbit top even wont trump going win america fkcd need miracle update bullet actually grazed ears saved whisker man one lucky guy biden needs step give space someone younger dont worry trump wont win",
    "light_cleaned_title": "Trump says he is fine after being whisked off stage following apparent gunfire at rally",
    "light_cleaned_selftext": "The US Secret Service and other law enforcement agencies did not immediately respond to messages. President Joe Biden has been briefed on the incident, the White House said.",
    "light_cleaned_comments": "Definitely winning now This dude is definitely winning now! . Biden will have to pull a rabbit out of his as to top this, even then he won't. Trump is going to win again. America is fkcd. They need a miracle. Update : If the bullet actually grazed his ears, he was saved by a whisker man. One lucky guy. Biden needs to step down now and give space to someone younger. Don't worry. Trump won't win."
}