{
    "id": "1cvfdfu",
    "title": "Swati Maliwal & my two cents.",
    "url": "https://www.reddit.com/r/india/comments/1cvfdfu/swati_maliwal_my_two_cents/",
    "selftext": "As the month began and Delhi LG pointed his finger at Swati Maliwal for irregularities in employee recruitment, it was only a matter of time that they would come for Arvind Kejriwal too. I anticipated that they will try to drive a wedge using Swati Maliwal to point finger at AK for the recruitments in exchange of cash. Alas, I was wrong.\n\n  \nHowever, when the news broke that she was assaulted by Arvind Kejriwal's PA, it was clear that BJP is making it filthy game. It's not for the first time that such things have been alleged by Delhi opposition/officials. In 2018, they tried to sabotage the functioning saying [bureaucrats were manhandled](https://scroll.in/latest/870141/delhi-chief-secretary-assault-aap-government-may-live-stream-meetings-with-officials). There was another case where a \"party worker\" woman tried to walk up the dais to meet the CM but on being stopped by his guards, claimed that she was sexually assaulted. Interestingly, she claimed this when the room was packed with other attendees. BJP as opposition did try to rake up the issue back then as well. (I am unable to find the link, maybe my keywords are not accurate)\n\n  \nIn politics and war, its a common strategy not to target the person at helm, rather the people around them. Fidle Castro employed this strategy(FC advised to snipe down the second in command of the camp instead of the camp leader), its depicted in movies too (Gangs of wasseypur-Definite and Faizal). Manish Sisodia the closest AAP member was arrested on unfound charges, and long ago [AK's principal secretary too was charged with liquor smuggling:D](https://scroll.in/article/826947/first-person-arvind-kejriwals-principal-secretary-on-how-he-was-hounded-humiliated-and-maligned)\n\n  \nThese attempts to malign an image by levying ridiculous charges makes me doubt Swati Maliwal's claim of being assaulted. Now, let me clear my stand that I am not downplaying victims of sexual assault per se, but this particular case at hand. Swati Maliwal is not a casual woman out for a stroll in the park when she was attacked. She was at the CM's residence. Mind you, she wasn't even \"[dragged 15 meters](https://timesofindia.indiatimes.com/city/delhi/out-on-night-inspection-swati-maliwal-dragged-by-car-for-15m-at-delhi-aiims/articleshow/97147720.cms)\" in the middle of night either (though its good that she highlighted the issue of safety). \n\n\n\nShe knows what needs to be done incase of being assaulted:\n\n>make a video on her own phone. (ok, now one might claim that who would think of pulling out the phone to record one's assault)  \n>What about after the secretary went \"out of the room after assaulting & tearing her clothes\"? Why didn't she record herself & her bruises right after she sat comfortably on the couch.\n\n>She called the cops right? Cops should press release the call recordings and prove that she had been assaulted already by the time another bodyguard took the 50-sec clip. \n\nWhy didn't she go straight to police station and then to hospital to get herself checked. Isn't she aware that these things needs to be done ASAP? She deals with such cases day in and day out she can't claim innocence. Three days delay..? Seriously!  \nHer claim that she was dragged by her hair, falls flat after the release of CCTV footage by AAP of her being respectfully escorted out by Lady police. \n\nOne might attempt to vouch that AAP gave press statement that she was misbehaved with. Mind you, misbehaved & assault are entirely different thing. When there is a verbal spat, he might have gave her back in her own language & even that is misbehaving, not assault (\"Ganje saale, naukri kha jaungi\" were her words after all).\n\n>Why can't AAP release the complete footage if they are innocent? Why should they do it before hand? Let her make more statements, let her make more follies only then the real footage should be released. Most of her claims so far had been proven wrong by strategic release of footage, so this should be continued.\n\nIt's time these \"politically motivated assaults\" are dealt strongly and AAP should remain strong on the face of such malafide charges. Truth will prevail & if Swati Maliwal is speaking the truth, then she should win this all cheers to her, but if not, she should be made an example to all those women who make others life hell through their false charges & she should be thrown back to the streets whence she came.",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1716090858.0,
    "convurl": "https://external-preview.redd.it/3_qh7advNuY4g_28KyZhbM8h_Y_yER4knseeqWMrprY.jpg?auto=webp&s=89ff18e80543d58617504a3d1be30e0e03c8d096",
    "comments": [
        "Why did AAP delete CCTV footage then,and why did Bibhav format his phone? Also, could the same thing be said about the MeToo movement? Why did the victims take years to go to the police?",
        "It's a well planned scheme to get to Kejriwal. Since ED couldn't get anything out of Kejriwal, they turned their eyes on his PA. BJ party devised a plan or should we say a masterplan to get hold of his PA, Through the weakest link Swati Maliwal, this lady is tough as a tank, after being thrashed so brutally, she was walking out of CM's residence like a thalaivaa. Must say wow for this well planned scheme, they have the system in their hand, AIIMS can give the report they want, DP can fabricate any charges they want and ofcourse there are judges who dance to the tunes of MHA."
    ],
    "cleaned_text": "swati maliwal two cents month began delhi lg pointed finger swati maliwal irregularities employee recruitment matter time would come arvind kejriwal anticipated try drive wedge using swati maliwal point finger ak recruitments exchange cash alas wrong however news broke assaulted arvind kejriwals pa clear bjp making filthy game first time things alleged delhi oppositionofficials tried sabotage functioning saying bureaucrats manhandledhttpsscrollinlatestdelhichiefsecretaryassaultaapgovernmentmaylivestreammeetingswithofficials another case party worker woman tried walk dais meet cm stopped guards claimed sexually assaulted interestingly claimed room packed attendees bjp opposition try rake issue back well unable find link maybe keywords accurate politics war common strategy target person helm rather people around fidle castro employed strategyfc advised snipe second command camp instead camp leader depicted movies gangs wasseypurdefinite faizal manish sisodia closest aap member arrested unfound charges long ago aks principal secretary charged liquor smugglingdhttpsscrollinarticlefirstpersonarvindkejriwalsprincipalsecretaryonhowhewashoundedhumiliatedandmaligned attempts malign image levying ridiculous charges makes doubt swati maliwals claim assaulted let clear stand downplaying victims sexual assault per se particular case hand swati maliwal casual woman stroll park attacked cms residence mind wasnt even dragged metershttpstimesofindiaindiatimescomcitydelhioutonnightinspectionswatimaliwaldraggedbycarformatdelhiaiimsarticleshowcms middle night either though good highlighted issue safety knows needs done incase assaulted make video phone ok one might claim would think pulling phone record ones assault secretary went room assaulting tearing clothes didnt record bruises right sat comfortably couch called cops right cops press release call recordings prove assaulted already time another bodyguard took sec clip didnt go straight police station hospital get checked isnt aware things needs done asap deals cases day day cant claim innocence three days delay seriously claim dragged hair falls flat release cctv footage aap respectfully escorted lady police one might attempt vouch aap gave press statement misbehaved mind misbehaved assault entirely different thing verbal spat might gave back language even misbehaving assault ganje saale naukri kha jaungi words cant aap release complete footage innocent hand let make statements let make follies real footage released claims far proven wrong strategic release footage continued time politically motivated assaults dealt strongly aap remain strong face malafide charges truth prevail swati maliwal speaking truth win cheers made example women make others life hell false charges thrown back streets whence came ",
    "cleaned_title": "swati maliwal two cents",
    "cleaned_selftext": "month began delhi lg pointed finger swati maliwal irregularities employee recruitment matter time would come arvind kejriwal anticipated try drive wedge using swati maliwal point finger ak recruitments exchange cash alas wrong however news broke assaulted arvind kejriwals pa clear bjp making filthy game first time things alleged delhi oppositionofficials tried sabotage functioning saying bureaucrats manhandledhttpsscrollinlatestdelhichiefsecretaryassaultaapgovernmentmaylivestreammeetingswithofficials another case party worker woman tried walk dais meet cm stopped guards claimed sexually assaulted interestingly claimed room packed attendees bjp opposition try rake issue back well unable find link maybe keywords accurate politics war common strategy target person helm rather people around fidle castro employed strategyfc advised snipe second command camp instead camp leader depicted movies gangs wasseypurdefinite faizal manish sisodia closest aap member arrested unfound charges long ago aks principal secretary charged liquor smugglingdhttpsscrollinarticlefirstpersonarvindkejriwalsprincipalsecretaryonhowhewashoundedhumiliatedandmaligned attempts malign image levying ridiculous charges makes doubt swati maliwals claim assaulted let clear stand downplaying victims sexual assault per se particular case hand swati maliwal casual woman stroll park attacked cms residence mind wasnt even dragged metershttpstimesofindiaindiatimescomcitydelhioutonnightinspectionswatimaliwaldraggedbycarformatdelhiaiimsarticleshowcms middle night either though good highlighted issue safety knows needs done incase assaulted make video phone ok one might claim would think pulling phone record ones assault secretary went room assaulting tearing clothes didnt record bruises right sat comfortably couch called cops right cops press release call recordings prove assaulted already time another bodyguard took sec clip didnt go straight police station hospital get checked isnt aware things needs done asap deals cases day day cant claim innocence three days delay seriously claim dragged hair falls flat release cctv footage aap respectfully escorted lady police one might attempt vouch aap gave press statement misbehaved mind misbehaved assault entirely different thing verbal spat might gave back language even misbehaving assault ganje saale naukri kha jaungi words cant aap release complete footage innocent hand let make statements let make follies real footage released claims far proven wrong strategic release footage continued time politically motivated assaults dealt strongly aap remain strong face malafide charges truth prevail swati maliwal speaking truth win cheers made example women make others life hell false charges thrown back streets whence came",
    "cleaned_comments": "aap delete cctv footage thenand bibhav format phone also could thing said metoo movement victims take years go police well planned scheme get kejriwal since ed couldnt get anything kejriwal turned eyes pa bj party devised plan say masterplan get hold pa weakest link swati maliwal lady tough tank thrashed brutally walking cms residence like thalaivaa must say wow well planned scheme system hand aiims give report want dp fabricate charges want ofcourse judges dance tunes mha",
    "light_cleaned_title": "Swati Maliwal & my two cents.",
    "light_cleaned_selftext": "As the month began and Delhi LG pointed his finger at Swati Maliwal for irregularities in employee recruitment, it was only a matter of time that they would come for Arvind Kejriwal too. I anticipated that they will try to drive a wedge using Swati Maliwal to point finger at AK for the recruitments in exchange of cash. Alas, I was wrong. However, when the news broke that she was assaulted by Arvind Kejriwal's PA, it was clear that BJP is making it filthy game. It's not for the first time that such things have been alleged by Delhi opposition/officials. In 2018, they tried to sabotage the functioning saying [bureaucrats were manhandled](https://scroll.in/latest/870141/delhi-chief-secretary-assault-aap-government-may-live-stream-meetings-with-officials). There was another case where a \"party worker\" woman tried to walk up the dais to meet the CM but on being stopped by his guards, claimed that she was sexually assaulted. Interestingly, she claimed this when the room was packed with other attendees. BJP as opposition did try to rake up the issue back then as well. (I am unable to find the link, maybe my keywords are not accurate) In politics and war, its a common strategy not to target the person at helm, rather the people around them. Fidle Castro employed this strategy(FC advised to snipe down the second in command of the camp instead of the camp leader), its depicted in movies too (Gangs of wasseypur-Definite and Faizal). Manish Sisodia the closest AAP member was arrested on unfound charges, and long ago [AK's principal secretary too was charged with liquor smuggling:D](https://scroll.in/article/826947/first-person-arvind-kejriwals-principal-secretary-on-how-he-was-hounded-humiliated-and-maligned) These attempts to malign an image by levying ridiculous charges makes me doubt Swati Maliwal's claim of being assaulted. Now, let me clear my stand that I am not downplaying victims of sexual assault per se, but this particular case at hand. Swati Maliwal is not a casual woman out for a stroll in the park when she was attacked. She was at the CM's residence. Mind you, she wasn't even \"[dragged 15 meters](https://timesofindia.indiatimes.com/city/delhi/out-on-night-inspection-swati-maliwal-dragged-by-car-for-15m-at-delhi-aiims/articleshow/97147720.cms)\" in the middle of night either (though its good that she highlighted the issue of safety). She knows what needs to be done incase of being assaulted: >make a video on her own phone. (ok, now one might claim that who would think of pulling out the phone to record one's assault) >What about after the secretary went \"out of the room after assaulting & tearing her clothes\"? Why didn't she record herself & her bruises right after she sat comfortably on the couch. >She called the cops right? Cops should press release the call recordings and prove that she had been assaulted already by the time another bodyguard took the 50-sec clip. Why didn't she go straight to police station and then to hospital to get herself checked. Isn't she aware that these things needs to be done ASAP? She deals with such cases day in and day out she can't claim innocence. Three days delay..? Seriously! Her claim that she was dragged by her hair, falls flat after the release of CCTV footage by AAP of her being respectfully escorted out by Lady police. One might attempt to vouch that AAP gave press statement that she was misbehaved with. Mind you, misbehaved & assault are entirely different thing. When there is a verbal spat, he might have gave her back in her own language & even that is misbehaving, not assault (\"Ganje saale, naukri kha jaungi\" were her words after all). >Why can't AAP release the complete footage if they are innocent? Why should they do it before hand? Let her make more statements, let her make more follies only then the real footage should be released. Most of her claims so far had been proven wrong by strategic release of footage, so this should be continued. It's time these \"politically motivated assaults\" are dealt strongly and AAP should remain strong on the face of such malafide charges. Truth will prevail & if Swati Maliwal is speaking the truth, then she should win this all cheers to her, but if not, she should be made an example to all those women who make others life hell through their false charges & she should be thrown back to the streets whence she came.",
    "light_cleaned_comments": "Why did AAP delete CCTV footage then,and why did Bibhav format his phone? Also, could the same thing be said about the MeToo movement? Why did the victims take years to go to the police? It's a well planned scheme to get to Kejriwal. Since ED couldn't get anything out of Kejriwal, they turned their eyes on his PA. BJ party devised a plan or should we say a masterplan to get hold of his PA, Through the weakest link Swati Maliwal, this lady is tough as a tank, after being thrashed so brutally, she was walking out of CM's residence like a thalaivaa. Must say wow for this well planned scheme, they have the system in their hand, AIIMS can give the report they want, DP can fabricate any charges they want and ofcourse there are judges who dance to the tunes of MHA."
}