{
    "id": "1ep6fv0",
    "title": "My neighbor beaten me out of ego - Malviya Nagar, New Delhi ",
    "url": "https://v.redd.it/m95wehm88xhd1",
    "selftext": "Hello everyone, here is a video that I managed to capture while my neighbor (Deepak Sharma aka Deepak Chowdhary) was beating me with a heavy stick for no valid reason.\n\nWhat actually happened: \nI stay in a rented flat in Panchsheel Vihar, Malviya Nagar, New Delhi. Deepak, along with his brother and his entire family has recently purchased a flat in the same building where I have been residing. Now they wish to get hold on the entire building and on it’s parking space. To do so, they act as goons & create hooliganism.\n\nThis entire scene started as soon as I came downstairs with my pet dog to take him for a regular walk around noon of 20th July, 2024. Deepak obstructed my way and asked me to park my car ‘tameez se’, though my car was already parked decently. Also, Deepak has a separate space dedicated to park his car, still he has been trying to provoke me to fight with him for months over parking. On this day, right after a brief dialogue which he initiated with me, he suddenly started beating me. He already planned this entire incident and this is why he had the lathi pre-arranged around that space (downstairs - he stays on 2nd floor).\n\nDuring this, I called 112 and called my brother who is a practising lawyer in Delhi. Soon after my brother arrived at the place of this incident, the PCR arrived too. However, Deepak, his brother Pradeep, his father and some of his friends (Deepak’s father is famous as Chowdhary chai wala in that area) again beaten me and my brother in front of the PCR. We were being beaten by an entire mob at that time and hence we rushed to enter in the PCR to save our lives. Then the PCR took us for medical which took almost 5 hours to get completed. We were not supposed to leave the hospital unless the medical process was completed. The police/PCR left us at the hospital.\n\nIn the evening when we were discharged from the hospital, we reached at Malviya Nagar (New Delhi) Police Station to file a written complaint about this incident. There, we got to know that a false complaint has already been filed by Deepak’s wife that we have misbehaved with her. This is an absolutely fake complaint, neither me nor my brother even touched her. We were infact struggling to save ourselves from the mob that was beating us.\n\nWhat followed next:\n1. The incident happened on 20th July and I reported the same to police on the same day. However, police refused to give me a receiving on my complaint, no FIR was filed on my complaint. In fact, police started threatening me that Deepak’s wife has also submitted her complaint that I molested her and if I will ask police to take any action against Deepak, police will arrest me for molesting his wife.\n2. I posted this incident on insta as a reel and luckily the reel went viral. Soon after that, ACP Hauz Khas intervened and assured me that appropriate action will be taken. After ACP’s intervention, FIR was filed during the late hours of 24th July. \n3. Though FIR has been filed, no further action has been taken by police yet. Neither Deepak has been arrested yet nor police has recovered the danda yet. My IO (investigating officer) hardly picks up my call. \n4. Deepak is trying to dilute the incident. Right after he beaten me, he yelled that I misbehave with his children (not true). When the matter reached to police, he said that I misbehaved with his wife (not true). And now he is telling the neighbors that I threatened his father and misbehaved with his father (not true).\n5. I am getting pressurised by locals to compromise with Deepak. \n\nFacts:\n1. This entire incident was preplanned by Deepak in advance. He pre-arranged the danda at ground floor (near the staircase), though he and his family stays on 2nd floor.\n2. He consciously chose to beat me at such a spot which isn’t covered by any CCTV. If I wouldn’t have recorded the incident myself, I would have never been able to defend myself against his wife’s fake complaint. \n3. I wasn’t beaten by Deepak after any heated argument, I was beaten because Deepak planned to beat me. That is why he obstructed my way and initiated a dialogue with me at the first place. \n4. The beat officers (policemen who regularly take rounds to ensure safety of general public) are regular visitors of Deepak’s father’s chai shop. \n5. Last year, Deepak and his brother Pradeep tried to allege me that I stole their 1.5 lacs cash that they forget after keep the cash on my car. They even got a policeman who happens to be a friend to them, to investigate this matter. Interesting part: they never filed any complaint regarding this, the policeman came just in yaari, and later Deepak’s brother and the policeman both apologised in writing for conspiring against me. \n6. Deepak’s father has a chai ki dukaan (Chowdhary chai wala) in this same area and they have been staying in the same locality for around 30+ years (before purchasing the flat, they had another property in the same locality). They are trying to ignite the influential people (localites) of the locality that I regularly misbehave with everyone and since I am a bechelor, I shall not be allowed to stay in their locality (please note that I have been staying in this flat since 2015).\n\nThis is a clear case of conspiracy where pro-female laws are being misused to defend Deepak’s act.\n\nWhat am I seeking from you?:\nI’m seeking your help to teach a life lesson to Deepak while staying within the limits of law. Today, it was me, tomorrow, it may be you or your kid. People like Deepak are a threat to the society and since such people aren’t afraid of law, they do whatever they wish to.\n\nUnfortunately, the laws in our country are a joke. If a person isn’t influential or isn’t having funds, it’s next to impossible to get timely justice. This is not just my fight against Deepak, but our collective fight for humankind against unsocial elements like Deepak and corrupt system.\n\nOn the viral reel that I posted, I got a lot of support as well as a lot of criticism. Most of the support was in the form of- Deepak ka address do, or, Deepak ka number do, hum abhi theek karte hai usko. However, this is not what I think is right. We must unite and get the system pressurised to serve justice in this case.",
    "flair": "Crime",
    "score": 9,
    "num_comments": 0,
    "created_utc": 1723332486.0,
    "convurl": "https://external-preview.redd.it/ZnJnMmN3Yjg4eGhkMRtVtJCqLXrAEpfPwl4U6Nf4FYvMWPiYuik3rdPatgSv.png?format=pjpg&auto=webp&s=243d7dd1aa751be038ce02ed45efd3eeba194add",
    "comments": [],
    "cleaned_text": "neighbor beaten ego malviya nagar new delhi hello everyone video managed capture neighbor deepak sharma aka deepak chowdhary beating heavy stick valid reason actually happened stay rented flat panchsheel vihar malviya nagar new delhi deepak along brother entire family recently purchased flat building residing wish get hold entire building parking space act goons create hooliganism entire scene started soon came downstairs pet dog take regular walk around noon th july deepak obstructed way asked park car tameez se though car already parked decently also deepak separate space dedicated park car still trying provoke fight months parking day right brief dialogue initiated suddenly started beating already planned entire incident lathi prearranged around space downstairs stays nd floor called called brother practising lawyer delhi soon brother arrived place incident pcr arrived however deepak brother pradeep father friends deepaks father famous chowdhary chai wala area beaten brother front pcr beaten entire mob time hence rushed enter pcr save lives pcr took us medical took almost hours get completed supposed leave hospital unless medical process completed policepcr left us hospital evening discharged hospital reached malviya nagar new delhi police station file written complaint incident got know false complaint already filed deepaks wife misbehaved absolutely fake complaint neither brother even touched infact struggling save mob beating us followed next incident happened th july reported police day however police refused give receiving complaint fir filed complaint fact police started threatening deepaks wife also submitted complaint molested ask police take action deepak police arrest molesting wife posted incident insta reel luckily reel went viral soon acp hauz khas intervened assured appropriate action taken acps intervention fir filed late hours th july though fir filed action taken police yet neither deepak arrested yet police recovered danda yet io investigating officer hardly picks call deepak trying dilute incident right beaten yelled misbehave children true matter reached police said misbehaved wife true telling neighbors threatened father misbehaved father true getting pressurised locals compromise deepak facts entire incident preplanned deepak advance prearranged danda ground floor near staircase though family stays nd floor consciously chose beat spot isnt covered cctv wouldnt recorded incident would never able defend wifes fake complaint wasnt beaten deepak heated argument beaten deepak planned beat obstructed way initiated dialogue first place beat officers policemen regularly take rounds ensure safety general public regular visitors deepaks fathers chai shop last year deepak brother pradeep tried allege stole lacs cash forget keep cash car even got policeman happens friend investigate matter interesting part never filed complaint regarding policeman came yaari later deepaks brother policeman apologised writing conspiring deepaks father chai ki dukaan chowdhary chai wala area staying locality around years purchasing flat another property locality trying ignite influential people localites locality regularly misbehave everyone since bechelor shall allowed stay locality please note staying flat since clear case conspiracy profemale laws misused defend deepaks act seeking im seeking help teach life lesson deepak staying within limits law today tomorrow may kid people like deepak threat society since people arent afraid law whatever wish unfortunately laws country joke person isnt influential isnt funds next impossible get timely justice fight deepak collective fight humankind unsocial elements like deepak corrupt system viral reel posted got lot support well lot criticism support form deepak ka address deepak ka number hum abhi theek karte hai usko however think right must unite get system pressurised serve justice case ",
    "cleaned_title": "neighbor beaten ego malviya nagar new delhi",
    "cleaned_selftext": "hello everyone video managed capture neighbor deepak sharma aka deepak chowdhary beating heavy stick valid reason actually happened stay rented flat panchsheel vihar malviya nagar new delhi deepak along brother entire family recently purchased flat building residing wish get hold entire building parking space act goons create hooliganism entire scene started soon came downstairs pet dog take regular walk around noon th july deepak obstructed way asked park car tameez se though car already parked decently also deepak separate space dedicated park car still trying provoke fight months parking day right brief dialogue initiated suddenly started beating already planned entire incident lathi prearranged around space downstairs stays nd floor called called brother practising lawyer delhi soon brother arrived place incident pcr arrived however deepak brother pradeep father friends deepaks father famous chowdhary chai wala area beaten brother front pcr beaten entire mob time hence rushed enter pcr save lives pcr took us medical took almost hours get completed supposed leave hospital unless medical process completed policepcr left us hospital evening discharged hospital reached malviya nagar new delhi police station file written complaint incident got know false complaint already filed deepaks wife misbehaved absolutely fake complaint neither brother even touched infact struggling save mob beating us followed next incident happened th july reported police day however police refused give receiving complaint fir filed complaint fact police started threatening deepaks wife also submitted complaint molested ask police take action deepak police arrest molesting wife posted incident insta reel luckily reel went viral soon acp hauz khas intervened assured appropriate action taken acps intervention fir filed late hours th july though fir filed action taken police yet neither deepak arrested yet police recovered danda yet io investigating officer hardly picks call deepak trying dilute incident right beaten yelled misbehave children true matter reached police said misbehaved wife true telling neighbors threatened father misbehaved father true getting pressurised locals compromise deepak facts entire incident preplanned deepak advance prearranged danda ground floor near staircase though family stays nd floor consciously chose beat spot isnt covered cctv wouldnt recorded incident would never able defend wifes fake complaint wasnt beaten deepak heated argument beaten deepak planned beat obstructed way initiated dialogue first place beat officers policemen regularly take rounds ensure safety general public regular visitors deepaks fathers chai shop last year deepak brother pradeep tried allege stole lacs cash forget keep cash car even got policeman happens friend investigate matter interesting part never filed complaint regarding policeman came yaari later deepaks brother policeman apologised writing conspiring deepaks father chai ki dukaan chowdhary chai wala area staying locality around years purchasing flat another property locality trying ignite influential people localites locality regularly misbehave everyone since bechelor shall allowed stay locality please note staying flat since clear case conspiracy profemale laws misused defend deepaks act seeking im seeking help teach life lesson deepak staying within limits law today tomorrow may kid people like deepak threat society since people arent afraid law whatever wish unfortunately laws country joke person isnt influential isnt funds next impossible get timely justice fight deepak collective fight humankind unsocial elements like deepak corrupt system viral reel posted got lot support well lot criticism support form deepak ka address deepak ka number hum abhi theek karte hai usko however think right must unite get system pressurised serve justice case",
    "cleaned_comments": "",
    "light_cleaned_title": "My neighbor beaten me out of ego - Malviya Nagar, New Delhi",
    "light_cleaned_selftext": "Hello everyone, here is a video that I managed to capture while my neighbor (Deepak Sharma aka Deepak Chowdhary) was beating me with a heavy stick for no valid reason. What actually happened: I stay in a rented flat in Panchsheel Vihar, Malviya Nagar, New Delhi. Deepak, along with his brother and his entire family has recently purchased a flat in the same building where I have been residing. Now they wish to get hold on the entire building and on it’s parking space. To do so, they act as goons & create hooliganism. This entire scene started as soon as I came downstairs with my pet dog to take him for a regular walk around noon of 20th July, 2024. Deepak obstructed my way and asked me to park my car ‘tameez se’, though my car was already parked decently. Also, Deepak has a separate space dedicated to park his car, still he has been trying to provoke me to fight with him for months over parking. On this day, right after a brief dialogue which he initiated with me, he suddenly started beating me. He already planned this entire incident and this is why he had the lathi pre-arranged around that space (downstairs - he stays on 2nd floor). During this, I called 112 and called my brother who is a practising lawyer in Delhi. Soon after my brother arrived at the place of this incident, the PCR arrived too. However, Deepak, his brother Pradeep, his father and some of his friends (Deepak’s father is famous as Chowdhary chai wala in that area) again beaten me and my brother in front of the PCR. We were being beaten by an entire mob at that time and hence we rushed to enter in the PCR to save our lives. Then the PCR took us for medical which took almost 5 hours to get completed. We were not supposed to leave the hospital unless the medical process was completed. The police/PCR left us at the hospital. In the evening when we were discharged from the hospital, we reached at Malviya Nagar (New Delhi) Police Station to file a written complaint about this incident. There, we got to know that a false complaint has already been filed by Deepak’s wife that we have misbehaved with her. This is an absolutely fake complaint, neither me nor my brother even touched her. We were infact struggling to save ourselves from the mob that was beating us. What followed next: 1. The incident happened on 20th July and I reported the same to police on the same day. However, police refused to give me a receiving on my complaint, no FIR was filed on my complaint. In fact, police started threatening me that Deepak’s wife has also submitted her complaint that I molested her and if I will ask police to take any action against Deepak, police will arrest me for molesting his wife. 2. I posted this incident on insta as a reel and luckily the reel went viral. Soon after that, ACP Hauz Khas intervened and assured me that appropriate action will be taken. After ACP’s intervention, FIR was filed during the late hours of 24th July. 3. Though FIR has been filed, no further action has been taken by police yet. Neither Deepak has been arrested yet nor police has recovered the danda yet. My IO (investigating officer) hardly picks up my call. 4. Deepak is trying to dilute the incident. Right after he beaten me, he yelled that I misbehave with his children (not true). When the matter reached to police, he said that I misbehaved with his wife (not true). And now he is telling the neighbors that I threatened his father and misbehaved with his father (not true). 5. I am getting pressurised by locals to compromise with Deepak. Facts: 1. This entire incident was preplanned by Deepak in advance. He pre-arranged the danda at ground floor (near the staircase), though he and his family stays on 2nd floor. 2. He consciously chose to beat me at such a spot which isn’t covered by any CCTV. If I wouldn’t have recorded the incident myself, I would have never been able to defend myself against his wife’s fake complaint. 3. I wasn’t beaten by Deepak after any heated argument, I was beaten because Deepak planned to beat me. That is why he obstructed my way and initiated a dialogue with me at the first place. 4. The beat officers (policemen who regularly take rounds to ensure safety of general public) are regular visitors of Deepak’s father’s chai shop. 5. Last year, Deepak and his brother Pradeep tried to allege me that I stole their 1.5 lacs cash that they forget after keep the cash on my car. They even got a policeman who happens to be a friend to them, to investigate this matter. Interesting part: they never filed any complaint regarding this, the policeman came just in yaari, and later Deepak’s brother and the policeman both apologised in writing for conspiring against me. 6. Deepak’s father has a chai ki dukaan (Chowdhary chai wala) in this same area and they have been staying in the same locality for around 30+ years (before purchasing the flat, they had another property in the same locality). They are trying to ignite the influential people (localites) of the locality that I regularly misbehave with everyone and since I am a bechelor, I shall not be allowed to stay in their locality (please note that I have been staying in this flat since 2015). This is a clear case of conspiracy where pro-female laws are being misused to defend Deepak’s act. What am I seeking from you?: I’m seeking your help to teach a life lesson to Deepak while staying within the limits of law. Today, it was me, tomorrow, it may be you or your kid. People like Deepak are a threat to the society and since such people aren’t afraid of law, they do whatever they wish to. Unfortunately, the laws in our country are a joke. If a person isn’t influential or isn’t having funds, it’s next to impossible to get timely justice. This is not just my fight against Deepak, but our collective fight for humankind against unsocial elements like Deepak and corrupt system. On the viral reel that I posted, I got a lot of support as well as a lot of criticism. Most of the support was in the form of- Deepak ka address do, or, Deepak ka number do, hum abhi theek karte hai usko. However, this is not what I think is right. We must unite and get the system pressurised to serve justice in this case.",
    "light_cleaned_comments": ""
}