{
    "id": "1d2n737",
    "title": "Earlier this month, Delhi CM Arvind Kejriwal claimed that he was under round-the-clock CCTV surveillance during his time in Tihar Jail. The claim raises pressing questions about the legality & psychosocial effects of surveilling incarcerated persons.",
    "url": "https://www.reddit.com/r/india/comments/1d2n737/earlier_this_month_delhi_cm_arvind_kejriwal/",
    "selftext": "Earlier this month, Delhi CM ArvindKejriwal claimed that he was under round-the-clock CCTV surveillance during his time in Tihar Jail. The claim raises pressing questions about the legality & psychosocial effects of surveilling incarcerated persons.\n\n[https://www.hindustantimes.com/cities/delhi-news/pm-watched-me-in-jail-through-cctv-i-did-not-break-kejriwal-101715623095383.html](https://www.hindustantimes.com/cities/delhi-news/pm-watched-me-in-jail-through-cctv-i-did-not-break-kejriwal-101715623095383.html)  \n\nLet’s rewind the clock ⏱️In 2015, the Supreme Court directed Indian prisons to install CCTV cameras in response to increasing instances of torture & abuse of incarcerated persons by police or jail security, to enhance accountability within the penal system. \n\nHow’s that worked out so far? Well, data released by NCRB reveals that even after the SC direction, all prisons did not install CCTV cameras. For those that did, incidents of violence, abuse, unnatural custodial deaths, clashes, & escapes did not decrease but in fact went under the radar as there was no footage to corroborate, due to malfunctioning cameras. \n\n[https://www.deccanherald.com/india/cctv-in-prisons-a-violation-of-privacy-1166375.html](https://www.deccanherald.com/india/cctv-in-prisons-a-violation-of-privacy-1166375.html) \n\nAlso, erm, SC did not classify where CCTVs can or cannot be installed, or the procedure & safeguards for collecting, regulating, & protecting the data captured. Cameras may be placed inside cells, enabling extremely invasive surveillance & unchecked data use by jail security. \n\nA similar attempt at placing CCTV cameras in women’s barracks at the Mumbai's Byculla Prison was vehemently opposed by its residents on the grounds that it infringes on their right to privacy & dignity, especially as they're monitored by male security. \n\n[https://feministsindia.com/inmates-hunger-strike-stops-cctv-installations-inside-mumbai-jail-womens-barracks/](https://feministsindia.com/inmates-hunger-strike-stops-cctv-installations-inside-mumbai-jail-womens-barracks/) \n\nMoreover, pervasive & real-time CCTV surveillance in prisons can add to the thick air of fear, paranoia, and suspicion that incarcerated persons often feel towards jail security, and can make them hyper-conscious of their conduct, appearance, or mannerisms. \n\nBoth ECHR & UNODC have separately acknowledged that unchecked & unlawful use of physical security aids such as cameras by definition intrude on privacy & dignity, & must only be used with due regard to the rights of incarcerated and undertrial persons. So while the use of CCTV cameras in Indian prisons may not be unlawful, it is certainly awful (and to some extent unjustifiable as a reasonable restriction to privacy given its ineffectiveness). \n\nWatch this space for IFF’s explainer on surveillance in trial & incarceration contexts. \n\n",
    "flair": "Law & Courts",
    "score": 38,
    "num_comments": 1,
    "created_utc": 1716912570.0,
    "convurl": "https://external-preview.redd.it/cJmpwKYNLHy7wdaCwSIwktRc_IPmk7HGvsURMA5-Ch0.jpg?auto=webp&s=d321ced945b470bde2c97304a47df00516c0d873",
    "comments": [],
    "cleaned_text": "earlier month delhi cm arvind kejriwal claimed roundtheclock cctv surveillance time tihar jail claim raises pressing questions legality psychosocial effects surveilling incarcerated persons earlier month delhi cm arvindkejriwal claimed roundtheclock cctv surveillance time tihar jail claim raises pressing questions legality psychosocial effects surveilling incarcerated persons httpswwwhindustantimescomcitiesdelhinewspmwatchedmeinjailthroughcctvididnotbreakkejriwalhtmlhttpswwwhindustantimescomcitiesdelhinewspmwatchedmeinjailthroughcctvididnotbreakkejriwalhtml lets rewind clock supreme court directed indian prisons install cctv cameras response increasing instances torture abuse incarcerated persons police jail security enhance accountability within penal system hows worked far well data released ncrb reveals even sc direction prisons install cctv cameras incidents violence abuse unnatural custodial deaths clashes escapes decrease fact went radar footage corroborate due malfunctioning cameras httpswwwdeccanheraldcomindiacctvinprisonsaviolationofprivacyhtmlhttpswwwdeccanheraldcomindiacctvinprisonsaviolationofprivacyhtml also erm sc classify cctvs installed procedure safeguards collecting regulating protecting data captured cameras may placed inside cells enabling extremely invasive surveillance unchecked data use jail security similar attempt placing cctv cameras womens barracks mumbais byculla prison vehemently opposed residents grounds infringes right privacy dignity especially theyre monitored male security httpsfeministsindiacominmateshungerstrikestopscctvinstallationsinsidemumbaijailwomensbarrackshttpsfeministsindiacominmateshungerstrikestopscctvinstallationsinsidemumbaijailwomensbarracks moreover pervasive realtime cctv surveillance prisons add thick air fear paranoia suspicion incarcerated persons often feel towards jail security make hyperconscious conduct appearance mannerisms echr unodc separately acknowledged unchecked unlawful use physical security aids cameras definition intrude privacy dignity must used due regard rights incarcerated undertrial persons use cctv cameras indian prisons may unlawful certainly awful extent unjustifiable reasonable restriction privacy given ineffectiveness watch space iffs explainer surveillance trial incarceration contexts ",
    "cleaned_title": "earlier month delhi cm arvind kejriwal claimed roundtheclock cctv surveillance time tihar jail claim raises pressing questions legality psychosocial effects surveilling incarcerated persons",
    "cleaned_selftext": "earlier month delhi cm arvindkejriwal claimed roundtheclock cctv surveillance time tihar jail claim raises pressing questions legality psychosocial effects surveilling incarcerated persons httpswwwhindustantimescomcitiesdelhinewspmwatchedmeinjailthroughcctvididnotbreakkejriwalhtmlhttpswwwhindustantimescomcitiesdelhinewspmwatchedmeinjailthroughcctvididnotbreakkejriwalhtml lets rewind clock supreme court directed indian prisons install cctv cameras response increasing instances torture abuse incarcerated persons police jail security enhance accountability within penal system hows worked far well data released ncrb reveals even sc direction prisons install cctv cameras incidents violence abuse unnatural custodial deaths clashes escapes decrease fact went radar footage corroborate due malfunctioning cameras httpswwwdeccanheraldcomindiacctvinprisonsaviolationofprivacyhtmlhttpswwwdeccanheraldcomindiacctvinprisonsaviolationofprivacyhtml also erm sc classify cctvs installed procedure safeguards collecting regulating protecting data captured cameras may placed inside cells enabling extremely invasive surveillance unchecked data use jail security similar attempt placing cctv cameras womens barracks mumbais byculla prison vehemently opposed residents grounds infringes right privacy dignity especially theyre monitored male security httpsfeministsindiacominmateshungerstrikestopscctvinstallationsinsidemumbaijailwomensbarrackshttpsfeministsindiacominmateshungerstrikestopscctvinstallationsinsidemumbaijailwomensbarracks moreover pervasive realtime cctv surveillance prisons add thick air fear paranoia suspicion incarcerated persons often feel towards jail security make hyperconscious conduct appearance mannerisms echr unodc separately acknowledged unchecked unlawful use physical security aids cameras definition intrude privacy dignity must used due regard rights incarcerated undertrial persons use cctv cameras indian prisons may unlawful certainly awful extent unjustifiable reasonable restriction privacy given ineffectiveness watch space iffs explainer surveillance trial incarceration contexts",
    "cleaned_comments": "",
    "light_cleaned_title": "Earlier this month, Delhi CM Arvind Kejriwal claimed that he was under round-the-clock CCTV surveillance during his time in Tihar Jail. The claim raises pressing questions about the legality & psychosocial effects of surveilling incarcerated persons.",
    "light_cleaned_selftext": "Earlier this month, Delhi CM ArvindKejriwal claimed that he was under round-the-clock CCTV surveillance during his time in Tihar Jail. The claim raises pressing questions about the legality & psychosocial effects of surveilling incarcerated persons. [https://www.hindustantimes.com/cities/delhi-news/pm-watched-me-in-jail-through-cctv-i-did-not-break-kejriwal-101715623095383.html](https://www.hindustantimes.com/cities/delhi-news/pm-watched-me-in-jail-through-cctv-i-did-not-break-kejriwal-101715623095383.html) Let’s rewind the clock ⏱️In 2015, the Supreme Court directed Indian prisons to install CCTV cameras in response to increasing instances of torture & abuse of incarcerated persons by police or jail security, to enhance accountability within the penal system. How’s that worked out so far? Well, data released by NCRB reveals that even after the SC direction, all prisons did not install CCTV cameras. For those that did, incidents of violence, abuse, unnatural custodial deaths, clashes, & escapes did not decrease but in fact went under the radar as there was no footage to corroborate, due to malfunctioning cameras. [https://www.deccanherald.com/india/cctv-in-prisons-a-violation-of-privacy-1166375.html](https://www.deccanherald.com/india/cctv-in-prisons-a-violation-of-privacy-1166375.html) Also, erm, SC did not classify where CCTVs can or cannot be installed, or the procedure & safeguards for collecting, regulating, & protecting the data captured. Cameras may be placed inside cells, enabling extremely invasive surveillance & unchecked data use by jail security. A similar attempt at placing CCTV cameras in women’s barracks at the Mumbai's Byculla Prison was vehemently opposed by its residents on the grounds that it infringes on their right to privacy & dignity, especially as they're monitored by male security. [https://feministsindia.com/inmates-hunger-strike-stops-cctv-installations-inside-mumbai-jail-womens-barracks/](https://feministsindia.com/inmates-hunger-strike-stops-cctv-installations-inside-mumbai-jail-womens-barracks/) Moreover, pervasive & real-time CCTV surveillance in prisons can add to the thick air of fear, paranoia, and suspicion that incarcerated persons often feel towards jail security, and can make them hyper-conscious of their conduct, appearance, or mannerisms. Both ECHR & UNODC have separately acknowledged that unchecked & unlawful use of physical security aids such as cameras by definition intrude on privacy & dignity, & must only be used with due regard to the rights of incarcerated and undertrial persons. So while the use of CCTV cameras in Indian prisons may not be unlawful, it is certainly awful (and to some extent unjustifiable as a reasonable restriction to privacy given its ineffectiveness). Watch this space for IFF’s explainer on surveillance in trial & incarceration contexts.",
    "light_cleaned_comments": ""
}