{
    "id": "15bxt8y",
    "title": "Do they change remittances to India forever?",
    "url": "https://www.reddit.com/r/india/comments/15bxt8y/do_they_change_remittances_to_india_forever/",
    "selftext": "Hey folks,\n\nI am currently widely discussing the best option to transfer money to India (with people from UK reddit). I just got too annoyed of growing fees according to transfer size. And now someone suggested to use Atlantic Money who seem to charge a flat fixed fee.\n\nAnd honestly, the offer is crazy good. Are you aware of them? They also compare against Wise and just outpace them constantly: [https://atlantic.money/eu/en/wise](https://atlantic.money/eu/en/wise)   \n\n\n* Thread: [https://np.reddit.com/r/UKPersonalFinance/comments/15btm11/unacceptable\\_fees\\_when\\_sending\\_gbp\\_to\\_inr\\_use\\_ibkr/](https://np.reddit.com/r/UKPersonalFinance/comments/15btm11/unacceptable_fees_when_sending_gbp_to_inr_use_ibkr/)\n* Website: [http://atlantic.money/](http://atlantic.money/)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690551681.0,
    "convurl": "https://external-preview.redd.it/U4XvL8TXrjJG6tL_2_dFPFniC6MMt-msjLKaiV-5qPM.jpg?auto=webp&s=580a65322d232ae5ccdb14af5d1b14925304a93b",
    "comments": [
        "That's the best one I have come across. Might give it a shot",
        "You can probably try crypto",
        "nah, just not doing the job yet",
        "FUCK, i sent so much euros over the course of last month through wise. If I had known this."
    ],
    "cleaned_text": "change remittances india forever hey folks currently widely discussing best option transfer money india people uk reddit got annoyed growing fees according transfer size someone suggested use atlantic money seem charge flat fixed fee honestly offer crazy good aware also compare wise outpace constantly httpsatlanticmoneyeuenwisehttpsatlanticmoneyeuenwise thread httpsnpredditcomrukpersonalfinancecommentsbtmunacceptablefeeswhensendinggbptoinruseibkrhttpsnpredditcomrukpersonalfinancecommentsbtmunacceptablefeeswhensendinggbptoinruseibkr website httpatlanticmoneyhttpatlanticmoney ",
    "cleaned_title": "change remittances india forever",
    "cleaned_selftext": "hey folks currently widely discussing best option transfer money india people uk reddit got annoyed growing fees according transfer size someone suggested use atlantic money seem charge flat fixed fee honestly offer crazy good aware also compare wise outpace constantly httpsatlanticmoneyeuenwisehttpsatlanticmoneyeuenwise thread httpsnpredditcomrukpersonalfinancecommentsbtmunacceptablefeeswhensendinggbptoinruseibkrhttpsnpredditcomrukpersonalfinancecommentsbtmunacceptablefeeswhensendinggbptoinruseibkr website httpatlanticmoneyhttpatlanticmoney",
    "cleaned_comments": "thats best one come across might give shot probably try crypto nah job yet fuck sent much euros course last month wise known",
    "light_cleaned_title": "Do they change remittances to India forever?",
    "light_cleaned_selftext": "Hey folks, I am currently widely discussing the best option to transfer money to India (with people from UK reddit). I just got too annoyed of growing fees according to transfer size. And now someone suggested to use Atlantic Money who seem to charge a flat fixed fee. And honestly, the offer is crazy good. Are you aware of them? They also compare against Wise and just outpace them constantly: [https://atlantic.money/eu/en/wise](https://atlantic.money/eu/en/wise) * Thread: [https://np.reddit.com/r/UKPersonalFinance/comments/15btm11/unacceptable\\_fees\\_when\\_sending\\_gbp\\_to\\_inr\\_use\\_ibkr/](https://np.reddit.com/r/UKPersonalFinance/comments/15btm11/unacceptable_fees_when_sending_gbp_to_inr_use_ibkr/) * Website: [http://atlantic.money/](http://atlantic.money/)",
    "light_cleaned_comments": "That's the best one I have come across. Might give it a shot You can probably try crypto nah, just not doing the job yet FUCK, i sent so much euros over the course of last month through wise. If I had known this."
}