{
    "id": "1epjqui",
    "title": "This is disheartening",
    "url": "https://www.reddit.com/gallery/1epjqui",
    "selftext": "Please share as much as possible ",
    "flair": "Crime",
    "score": 28,
    "num_comments": 6,
    "created_utc": 1723379698,
    "convurl": "https://i.redd.it/r1nymv1n41id1.jpg",
    "comments": [
        "I don't understand why Indians are not outraged by this heinous crime.",
        "Guy who did this was married 4 times and  her wives left her due to his misconduct. Finally he killed a trainee.....",
        "If we remove Kejriwal and Mamta from Indian politics Modi & Shah will automatically go too. \n\nBecause they’re controlled opposition just here to make us think everyone is a clown on both sides. \n\nAlmost all except team Rahul Gandhi are a sellout to Tata Adani Ambani Mahindra.\n\nHeads I win, tails you lose\n\n\nI sometimes feel frustrated because the so called opposition has a lot of resources from Dhruv Rathee to Akash Banerjee and all their job is to convince how everyone on the political spectrum is a clown. While purposely ignoring the fact that Rahul Gandhi has a spine just like his grandmother who Nationalised banks and went against the cronies.\n\nAAP & TMC IT cell I like to call them. BJP and these guys are 1 hi thali ke chatte bathe \nParasitic Opportunistic politics since Anna Hazare and Arnab’s Nation wants to know.\n\nI feel even Nirbhaya and 26/11 were done by these loonies just to come in power. (Sadhvi Pragya & Hemant Karkare. Kejriwal vs Sheila Dixit)",
        "And the scumbag principal said in a statement that it was the girls fault for being working out for late. Absolute sh!thead, A$$hole",
        "Are you for real? Like really?",
        "The choice of the post is in bad taste and I should have posted my Rant elsewhere, especially since it’s not related to the current events. Apologies"
    ],
    "cleaned_text": "disheartening please share much possible ",
    "cleaned_title": "disheartening",
    "cleaned_selftext": "please share much possible",
    "cleaned_comments": "dont understand indians outraged heinous crime guy married times wives left due misconduct finally killed trainee remove kejriwal mamta indian politics modi shah automatically go theyre controlled opposition make us think everyone clown sides almost except team rahul gandhi sellout tata adani ambani mahindra heads win tails lose sometimes feel frustrated called opposition lot resources dhruv rathee akash banerjee job convince everyone political spectrum clown purposely ignoring fact rahul gandhi spine like grandmother nationalised banks went cronies aap tmc cell like call bjp guys hi thali ke chatte bathe parasitic opportunistic politics since anna hazare arnabs nation wants know feel even nirbhaya done loonies come power sadhvi pragya hemant karkare kejriwal vs sheila dixit scumbag principal said statement girls fault working late absolute shthead ahole real like really choice post bad taste posted rant elsewhere especially since related current events apologies",
    "light_cleaned_title": "This is disheartening",
    "light_cleaned_selftext": "Please share as much as possible",
    "light_cleaned_comments": "I don't understand why Indians are not outraged by this heinous crime. Guy who did this was married 4 times and her wives left her due to his misconduct. Finally he killed a trainee..... If we remove Kejriwal and Mamta from Indian politics Modi & Shah will automatically go too. Because they’re controlled opposition just here to make us think everyone is a clown on both sides. Almost all except team Rahul Gandhi are a sellout to Tata Adani Ambani Mahindra. Heads I win, tails you lose I sometimes feel frustrated because the so called opposition has a lot of resources from Dhruv Rathee to Akash Banerjee and all their job is to convince how everyone on the political spectrum is a clown. While purposely ignoring the fact that Rahul Gandhi has a spine just like his grandmother who Nationalised banks and went against the cronies. AAP & TMC IT cell I like to call them. BJP and these guys are 1 hi thali ke chatte bathe Parasitic Opportunistic politics since Anna Hazare and Arnab’s Nation wants to know. I feel even Nirbhaya and 26/11 were done by these loonies just to come in power. (Sadhvi Pragya & Hemant Karkare. Kejriwal vs Sheila Dixit) And the scumbag principal said in a statement that it was the girls fault for being working out for late. Absolute sh!thead, A$$hole Are you for real? Like really? The choice of the post is in bad taste and I should have posted my Rant elsewhere, especially since it’s not related to the current events. Apologies"
}