{
    "id": "15772ca",
    "title": "\"While We Watched\" Documentary Spotlights",
    "url": "https://www.reddit.com/r/india/comments/15772ca/while_we_watched_documentary_spotlights/",
    "selftext": "In this spotlight, Ravish Kumar and Vinay Shukla talks on [democracynow.org](https://democracynow.org)'s  YouTube channel about what is in this documentary. \n\nDo you guys think this will release in India and if does, what should be the good time for it to come out? \n\nWatch the discussion: [https://www.youtube.com/watch?v=TZRuxFnkVm8](https://www.youtube.com/watch?v=TZRuxFnkVm8)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690093693.0,
    "convurl": "https://external-preview.redd.it/W_OU5xzL0C2nj6rnk1Qn3O73ZgoOeVoZ6Pcg7Uc5pGk.jpg?auto=webp&s=14f0eee6571a4605353f615eef40c59eeef17c81",
    "comments": [
        "Mark Kermode reviewed it and gave it a thumbs up. Though I don't know that documentaries have any market in India for a theatrical release. It will probably get released on OTT though.",
        "Ravish is the type of human being you cant ignore even though view points are different",
        "it should get released in theatres even if on a small scale in posh areas"
    ],
    "cleaned_text": "watched documentary spotlights spotlight ravish kumar vinay shukla talks democracynoworghttpsdemocracynoworgs youtube channel documentary guys think release india good time come watch discussion httpswwwyoutubecomwatchvtzruxfnkvmhttpswwwyoutubecomwatchvtzruxfnkvm ",
    "cleaned_title": "watched documentary spotlights",
    "cleaned_selftext": "spotlight ravish kumar vinay shukla talks democracynoworghttpsdemocracynoworgs youtube channel documentary guys think release india good time come watch discussion httpswwwyoutubecomwatchvtzruxfnkvmhttpswwwyoutubecomwatchvtzruxfnkvm",
    "cleaned_comments": "mark kermode reviewed gave thumbs though dont know documentaries market india theatrical release probably get released ott though ravish type human cant ignore even though view points different get released theatres even small scale posh areas",
    "light_cleaned_title": "\"While We Watched\" Documentary Spotlights",
    "light_cleaned_selftext": "In this spotlight, Ravish Kumar and Vinay Shukla talks on [democracynow.org](https://democracynow.org)'s YouTube channel about what is in this documentary. Do you guys think this will release in India and if does, what should be the good time for it to come out? Watch the discussion: [https://www.youtube.com/watch?v=TZRuxFnkVm8](https://www.youtube.com/watch?v=TZRuxFnkVm8)",
    "light_cleaned_comments": "Mark Kermode reviewed it and gave it a thumbs up. Though I don't know that documentaries have any market in India for a theatrical release. It will probably get released on OTT though. Ravish is the type of human being you cant ignore even though view points are different it should get released in theatres even if on a small scale in posh areas"
}