{
    "id": "154nw28",
    "title": "Trying to restore my helmet.",
    "url": "https://www.reddit.com/r/india/comments/154nw28/trying_to_restore_my_helmet/",
    "selftext": "Guys, I'm trying to restore my Studds KS 1 Metro Helmet. Been with me for 8 years, through thick and thin, I cant throw him away! Also, I don't want to unnecessarily throw away a perfectly fine helmet.\n\nBut, the visor is damaged and I want to change the inner lining. Been to seven helmet shops, and two Honda showrooms, and they all say the same thing - \"It's too old, and we don't have the visor. Also, you can't use another helmet's visor.\"\n\nDo any of you have an old or damaged KS 1 Metro (it was sold to me by Honda, 8 years ago), with a good visor that you can sell/give me?\n\nSide note - I want to spray paint my Reddit DP (also my Yt channel logo) on my helmet, outlined in pink. Any good spray paint suggestions?\n\n&#x200B;\n\nhttps://preview.redd.it/nu3c3cs3r3db1.png?width=420&format=png&auto=webp&s=bafe6a8d5c566c3762e6cb3002af5e0793b21f60",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689851182.0,
    "convurl": "https://b.thumbs.redditmedia.com/Ptm3pKVNfKnggXYPKAznEBTcgYzbZlNeCI-j7CjzevA.jpg",
    "comments": [
        "You can purchase graffiti sprays by ordering from **Banna Spray Paints** and can purchase spray paints for all other types of spray painting needs like Home DIY etc from **Krayon Spray Paints** at affordable prices ranging from 250 Rupees to 399 Rupees.\n\nThey offer PAN India shipping, and you can purchase their spray paints directly from their official website. Check for any ongoing promotions or discounts that could help you get their products at an even cheaper price.\n\nTheir sprays can be applicable on various surfaces like Rubber, Glass, Clay, metal, plastic, wood and also have 100+ colors to choose from.\n\nThey also have various spray paint under all categories like: General Use, DIY art, Graffiti, Automotive, Wood, Rust Remover, High Temperature Resistant sprays, For Metallic and Nonmetallic surfaces and also have fluorescent Glow in the dark colors as well.  \n\n\n [Krayon Sprays | Multipurpose DIY Spray Paint](https://krayonsprays.com/)   \n\n\n [Banna Aerosol - Best quality spray paints for Graffiti, Automotive & Industrial use in India | Best spray paint manufacturers in India (bannasprays.com)](https://bannasprays.com/)"
    ],
    "cleaned_text": "trying restore helmet guys im trying restore studds ks metro helmet years thick thin cant throw away also dont want unnecessarily throw away perfectly fine helmet visor damaged want change inner lining seven helmet shops two honda showrooms say thing old dont visor also cant use another helmets visor old damaged ks metro sold honda years ago good visor sellgive side note want spray paint reddit dp also yt channel logo helmet outlined pink good spray paint suggestions xb ",
    "cleaned_title": "trying restore helmet",
    "cleaned_selftext": "guys im trying restore studds ks metro helmet years thick thin cant throw away also dont want unnecessarily throw away perfectly fine helmet visor damaged want change inner lining seven helmet shops two honda showrooms say thing old dont visor also cant use another helmets visor old damaged ks metro sold honda years ago good visor sellgive side note want spray paint reddit dp also yt channel logo helmet outlined pink good spray paint suggestions xb",
    "cleaned_comments": "purchase graffiti sprays ordering banna spray paints purchase spray paints types spray painting needs like home diy etc krayon spray paints affordable prices ranging rupees rupees offer pan india shipping purchase spray paints directly official website check ongoing promotions discounts could help get products even cheaper price sprays applicable various surfaces like rubber glass clay metal plastic wood also colors choose also various spray paint categories like general use diy art graffiti automotive wood rust remover high temperature resistant sprays metallic nonmetallic surfaces also fluorescent glow dark colors well krayon sprays multipurpose diy spray painthttpskrayonsprayscom banna aerosol best quality spray paints graffiti automotive industrial use india best spray paint manufacturers india bannasprayscomhttpsbannasprayscom",
    "light_cleaned_title": "Trying to restore my helmet.",
    "light_cleaned_selftext": "Guys, I'm trying to restore my Studds KS 1 Metro Helmet. Been with me for 8 years, through thick and thin, I cant throw him away! Also, I don't want to unnecessarily throw away a perfectly fine helmet. But, the visor is damaged and I want to change the inner lining. Been to seven helmet shops, and two Honda showrooms, and they all say the same thing - \"It's too old, and we don't have the visor. Also, you can't use another helmet's visor.\" Do any of you have an old or damaged KS 1 Metro (it was sold to me by Honda, 8 years ago), with a good visor that you can sell/give me? Side note - I want to spray paint my Reddit DP (also my Yt channel logo) on my helmet, outlined in pink. Any good spray paint suggestions? &#x200B;",
    "light_cleaned_comments": "You can purchase graffiti sprays by ordering from **Banna Spray Paints** and can purchase spray paints for all other types of spray painting needs like Home DIY etc from **Krayon Spray Paints** at affordable prices ranging from 250 Rupees to 399 Rupees. They offer PAN India shipping, and you can purchase their spray paints directly from their official website. Check for any ongoing promotions or discounts that could help you get their products at an even cheaper price. Their sprays can be applicable on various surfaces like Rubber, Glass, Clay, metal, plastic, wood and also have 100+ colors to choose from. They also have various spray paint under all categories like: General Use, DIY art, Graffiti, Automotive, Wood, Rust Remover, High Temperature Resistant sprays, For Metallic and Nonmetallic surfaces and also have fluorescent Glow in the dark colors as well. [Krayon Sprays | Multipurpose DIY Spray Paint](https://krayonsprays.com/) [Banna Aerosol - Best quality spray paints for Graffiti, Automotive & Industrial use in India | Best spray paint manufacturers in India (bannasprays.com)](https://bannasprays.com/)"
}