{
    "id": "16hgq9w",
    "title": "Facebook Shopping Scam: My Mom's Frustrating Experience with Amiga's Closet by Shivangi",
    "url": "https://www.reddit.com/r/india/comments/16hgq9w/facebook_shopping_scam_my_moms_frustrating/",
    "selftext": "This is more of a venting session, and I hope that anyone who might be too trusting in Facebook Live shopping can learn from my mom's ordeal. For the past two years, my mom, an avid supporter of small shops and sellers, has been exploring the world of Facebook shopping. Although this is her first negative experience, it has left her deeply disappointed and motivated to share her story with others to protect the unsuspecting.\n\nOn July 31, she made a purchase during a Facebook Live event from a store called \"Amiga's Closet by Shivangi.\" Prior to this, I had cautioned her against this particular store because it had very few viewers during its live broadcasts and minimal likes on its photos. Nevertheless, my mom's trust in people on Facebook remained unwavering. Fast forward to August 7 when the tops she ordered finally arrived. To her dismay, they appeared to have been used. The seller didn't acknowledge this initially, but my mom, considering the relatively small amount she spent (1100 rupees in total), assumed they might have been lightly worn around the house. However, one of the tops was in such dire condition, with discoloration around the armpit area and significant wear in the back (as evident in the photos), that my mom decided to request either a refund or a replacement.\n\nThe seller initially promised a replacement, but as more than a month passed without any updates, my mom became increasingly frustrated. On August 14, she inquired again and received a similar response. Fed up by September 12, she sent a strongly worded message. In response, the seller went live and shifted the blame onto my mom, even suggesting she was being generous by offering a replacement to this \"old lady\"—something that should have been expected given the quality of the item sold.\n\nThis experience underlines the risks associated with Facebook Live shopping and serves as a cautionary tale for those tempted by seemingly attractive offers. Be vigilant, and always trust your instincts when shopping online.\n\nhttps://preview.redd.it/qb55c65s8znb1.jpg?width=799&format=pjpg&auto=webp&s=a27214592a03ff916deaccfe02147b333a001cbf\n\nhttps://preview.redd.it/1w22s55s8znb1.jpg?width=799&format=pjpg&auto=webp&s=74356c89302e6066da9379690477e8b7187bdbb8\n\nhttps://preview.redd.it/nohe665s8znb1.jpg?width=795&format=pjpg&auto=webp&s=e7ae9b22df63a40a107bc7672458313cd94aabbc",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694591047.0,
    "convurl": "https://b.thumbs.redditmedia.com/7dxxxEHw-XqQ-GlU_CKNWdxDwL3o5PxtXYP5TkD919A.jpg",
    "comments": [
        "I'm unsure if this last screenshot was visible in the post. It's important to note that my mom's feelings extend beyond disappointment; she is also deeply distressed (reason for my rant). Rather than receiving an apology for the situation, she was confronted with the seller audaciously placing blame on her. Now, she's both furious and profoundly disheartened by the entire thing.\n\nhttps://preview.redd.it/t407f21l9znb1.jpeg?width=795&format=pjpg&auto=webp&s=7b099a28e06f28aed06f4932756bfec721bb64a2",
        "no one uses facebook nowadays. its full of scammers trying to milk out the remaining few"
    ],
    "cleaned_text": "facebook shopping scam moms frustrating experience amigas closet shivangi venting session hope anyone might trusting facebook live shopping learn moms ordeal past two years mom avid supporter small shops sellers exploring world facebook shopping although first negative experience left deeply disappointed motivated share story others protect unsuspecting july made purchase facebook live event store called amigas closet shivangi prior cautioned particular store viewers live broadcasts minimal likes photos nevertheless moms trust people facebook remained unwavering fast forward august tops ordered finally arrived dismay appeared used seller didnt acknowledge initially mom considering relatively small amount spent rupees total assumed might lightly worn around house however one tops dire condition discoloration around armpit area significant wear back evident photos mom decided request either refund replacement seller initially promised replacement month passed without updates mom became increasingly frustrated august inquired received similar response fed september sent strongly worded message response seller went live shifted blame onto mom even suggesting generous offering replacement old ladysomething expected given quality item sold experience underlines risks associated facebook live shopping serves cautionary tale tempted seemingly attractive offers vigilant always trust instincts shopping online ",
    "cleaned_title": "facebook shopping scam moms frustrating experience amigas closet shivangi",
    "cleaned_selftext": "venting session hope anyone might trusting facebook live shopping learn moms ordeal past two years mom avid supporter small shops sellers exploring world facebook shopping although first negative experience left deeply disappointed motivated share story others protect unsuspecting july made purchase facebook live event store called amigas closet shivangi prior cautioned particular store viewers live broadcasts minimal likes photos nevertheless moms trust people facebook remained unwavering fast forward august tops ordered finally arrived dismay appeared used seller didnt acknowledge initially mom considering relatively small amount spent rupees total assumed might lightly worn around house however one tops dire condition discoloration around armpit area significant wear back evident photos mom decided request either refund replacement seller initially promised replacement month passed without updates mom became increasingly frustrated august inquired received similar response fed september sent strongly worded message response seller went live shifted blame onto mom even suggesting generous offering replacement old ladysomething expected given quality item sold experience underlines risks associated facebook live shopping serves cautionary tale tempted seemingly attractive offers vigilant always trust instincts shopping online",
    "cleaned_comments": "im unsure last screenshot visible post important note moms feelings extend beyond disappointment also deeply distressed reason rant rather receiving apology situation confronted seller audaciously placing blame shes furious profoundly disheartened entire thing one uses facebook nowadays full scammers trying milk remaining",
    "light_cleaned_title": "Facebook Shopping Scam: My Mom's Frustrating Experience with Amiga's Closet by Shivangi",
    "light_cleaned_selftext": "This is more of a venting session, and I hope that anyone who might be too trusting in Facebook Live shopping can learn from my mom's ordeal. For the past two years, my mom, an avid supporter of small shops and sellers, has been exploring the world of Facebook shopping. Although this is her first negative experience, it has left her deeply disappointed and motivated to share her story with others to protect the unsuspecting. On July 31, she made a purchase during a Facebook Live event from a store called \"Amiga's Closet by Shivangi.\" Prior to this, I had cautioned her against this particular store because it had very few viewers during its live broadcasts and minimal likes on its photos. Nevertheless, my mom's trust in people on Facebook remained unwavering. Fast forward to August 7 when the tops she ordered finally arrived. To her dismay, they appeared to have been used. The seller didn't acknowledge this initially, but my mom, considering the relatively small amount she spent (1100 rupees in total), assumed they might have been lightly worn around the house. However, one of the tops was in such dire condition, with discoloration around the armpit area and significant wear in the back (as evident in the photos), that my mom decided to request either a refund or a replacement. The seller initially promised a replacement, but as more than a month passed without any updates, my mom became increasingly frustrated. On August 14, she inquired again and received a similar response. Fed up by September 12, she sent a strongly worded message. In response, the seller went live and shifted the blame onto my mom, even suggesting she was being generous by offering a replacement to this \"old lady\"—something that should have been expected given the quality of the item sold. This experience underlines the risks associated with Facebook Live shopping and serves as a cautionary tale for those tempted by seemingly attractive offers. Be vigilant, and always trust your instincts when shopping online.",
    "light_cleaned_comments": "I'm unsure if this last screenshot was visible in the post. It's important to note that my mom's feelings extend beyond disappointment; she is also deeply distressed (reason for my rant). Rather than receiving an apology for the situation, she was confronted with the seller audaciously placing blame on her. Now, she's both furious and profoundly disheartened by the entire thing. no one uses facebook nowadays. its full of scammers trying to milk out the remaining few"
}