{
    "id": "193tbm7",
    "title": "Supreme Court Reluctantly Adjourns Umar Khalid's Bail Plea As Kapil Sibal Said He Is Engaged Before Constitution Bench",
    "url": "https://www.verdictum.in/court-updates/supreme-court/supreme-court-adjourns-hearing-in-umar-khalids-bail-plea-1514462",
    "selftext": "Kapil Sibal's only qualification is his ability to navigate through the intricacies of SC and personal level relationships he has with the staff. Now that ability is neutralised by equally influential lawyers his ability to win cases has reduced to Zero.",
    "flair": "Law & Courts",
    "score": 102,
    "num_comments": 14,
    "created_utc": 1704948528.0,
    "convurl": "https://external-preview.redd.it/3ryXJmDH75Nfx7_n1gYw7k11PeTbtFi0kVwu-85GPX0.jpg?auto=webp&s=0376427acf97a439cba09d7e773cf111856cbc09",
    "comments": [
        "Khudka lawyer hi bol raha ' Jail mein hai, kya farak pad raha. Aur time do ' . Bizarre af",
        "There have been multiple instances in the past where sibal has been unavailable. Not sure what is happening with him.",
        "After Kapil Sibal's comments about Assam being part of Myanmar I am not sure how anyone can take him seriously anymore. If he could I am sure he would start advocating for every single state in the union to leave the country. \n\nHis views on Kashmir are hardly even palatable to my friends who support Congress including members of the party. No wonder he left and joined Samajwadi Party.",
        "It is a common thing for most lawyers to have dates clash with other cases however, Sibal could have easily sent a junior counsel from his team.",
        "He said it was part of Myanmar in the past which was historically accurate. Facts aren't anti national anti BJP",
        "Can you site some documents to support your claim? \n\nHow long did the burmese kingdoms occupy the land of Assam vs how long were these lands governed by Ahoms?",
        "https://en.m.wikipedia.org/wiki/Burmese_invasions_of_Assam",
        "And???\n\nA couple of years of occupation through invasion negates the several hundred years Assam was ruled by its indigenous population?\n\nI want you to argue within the context of what makes Kapil Sibal say that Rohingyas are people of the land of Assam?",
        "He didn't say Ahoms didnt rule for years. Or how the \"indigenous\" population ruled it. He said it was part of Myanmar which it was. You asked me to cite a source and I did. \n\nHave Rohingya people not inhabited North East India for years? Apart from being Muslim which tickles bigots like you what makes them less native to the state than than thousands of non native Assamese people who live there? \n\nWhat Sibal was illustrating is the history of who is and isn't native to a place is very complicated. Because the whole akhand Bharat Hindu rashtra fantasy only exists in fantasy. India was always an amalgamation of small kingdoms with people traveling between them all.",
        "So suddenly I am a bigot that hates muslim? I'm sorry brother that was such a disgusting thing to say to a stranger you dont even know. I'm out.\n\nLearn to be civilised and respect others when you talk to them first.",
        "Is it more disgusting than alleging Rohingyas are not native to Assam basis a poor understanding of history? Or anyone making an opposite claim hates Hindus?",
        "Ahoms are a Thai dynasty no? Not really indigenous.\n\nJust pointing it out adding to the intricacies of who is indigenous and who is not.",
        "They came in from Tibet/China apparently. But some of the kings converted to Hinduism from Buddhism, so for some history revisionists they were 100% pure Indian.",
        "Ah thanks thanks \n\nI mistook the Tai group of ethnicities to be Thai"
    ],
    "cleaned_text": "supreme court reluctantly adjourns umar khalids bail plea kapil sibal said engaged constitution bench kapil sibals qualification ability navigate intricacies sc personal level relationships staff ability neutralised equally influential lawyers ability win cases reduced zero ",
    "cleaned_title": "supreme court reluctantly adjourns umar khalids bail plea kapil sibal said engaged constitution bench",
    "cleaned_selftext": "kapil sibals qualification ability navigate intricacies sc personal level relationships staff ability neutralised equally influential lawyers ability win cases reduced zero",
    "cleaned_comments": "khudka lawyer hi bol raha jail mein hai kya farak pad raha aur time bizarre af multiple instances past sibal unavailable sure happening kapil sibals comments assam part myanmar sure anyone take seriously anymore could sure would start advocating every single state union leave country views kashmir hardly even palatable friends support congress including members party wonder left joined samajwadi party common thing lawyers dates clash cases however sibal could easily sent junior counsel team said part myanmar past historically accurate facts arent anti national anti bjp site documents support claim long burmese kingdoms occupy land assam vs long lands governed ahoms couple years occupation invasion negates several hundred years assam ruled indigenous population want argue within context makes kapil sibal say rohingyas people land assam didnt say ahoms didnt rule years indigenous population ruled said part myanmar asked cite source rohingya people inhabited north east india years apart muslim tickles bigots like makes less native state thousands non native assamese people live sibal illustrating history isnt native place complicated whole akhand bharat hindu rashtra fantasy exists fantasy india always amalgamation small kingdoms people traveling suddenly bigot hates muslim im sorry brother disgusting thing say stranger dont even know im learn civilised respect others talk first disgusting alleging rohingyas native assam basis poor understanding history anyone making opposite claim hates hindus ahoms thai dynasty really indigenous pointing adding intricacies indigenous came tibetchina apparently kings converted hinduism buddhism history revisionists pure indian ah thanks thanks mistook tai group ethnicities thai",
    "light_cleaned_title": "Supreme Court Reluctantly Adjourns Umar Khalid's Bail Plea As Kapil Sibal Said He Is Engaged Before Constitution Bench",
    "light_cleaned_selftext": "Kapil Sibal's only qualification is his ability to navigate through the intricacies of SC and personal level relationships he has with the staff. Now that ability is neutralised by equally influential lawyers his ability to win cases has reduced to Zero.",
    "light_cleaned_comments": "Khudka lawyer hi bol raha ' Jail mein hai, kya farak pad raha. Aur time do ' . Bizarre af There have been multiple instances in the past where sibal has been unavailable. Not sure what is happening with him. After Kapil Sibal's comments about Assam being part of Myanmar I am not sure how anyone can take him seriously anymore. If he could I am sure he would start advocating for every single state in the union to leave the country. His views on Kashmir are hardly even palatable to my friends who support Congress including members of the party. No wonder he left and joined Samajwadi Party. It is a common thing for most lawyers to have dates clash with other cases however, Sibal could have easily sent a junior counsel from his team. He said it was part of Myanmar in the past which was historically accurate. Facts aren't anti national anti BJP Can you site some documents to support your claim? How long did the burmese kingdoms occupy the land of Assam vs how long were these lands governed by Ahoms? And??? A couple of years of occupation through invasion negates the several hundred years Assam was ruled by its indigenous population? I want you to argue within the context of what makes Kapil Sibal say that Rohingyas are people of the land of Assam? He didn't say Ahoms didnt rule for years. Or how the \"indigenous\" population ruled it. He said it was part of Myanmar which it was. You asked me to cite a source and I did. Have Rohingya people not inhabited North East India for years? Apart from being Muslim which tickles bigots like you what makes them less native to the state than than thousands of non native Assamese people who live there? What Sibal was illustrating is the history of who is and isn't native to a place is very complicated. Because the whole akhand Bharat Hindu rashtra fantasy only exists in fantasy. India was always an amalgamation of small kingdoms with people traveling between them all. So suddenly I am a bigot that hates muslim? I'm sorry brother that was such a disgusting thing to say to a stranger you dont even know. I'm out. Learn to be civilised and respect others when you talk to them first. Is it more disgusting than alleging Rohingyas are not native to Assam basis a poor understanding of history? Or anyone making an opposite claim hates Hindus? Ahoms are a Thai dynasty no? Not really indigenous. Just pointing it out adding to the intricacies of who is indigenous and who is not. They came in from Tibet/China apparently. But some of the kings converted to Hinduism from Buddhism, so for some history revisionists they were 100% pure Indian. Ah thanks thanks I mistook the Tai group of ethnicities to be Thai"
}