{
    "id": "13xl2rk",
    "title": "Exclusive: Small newspapers get Govt ads worth crores under BJP Government: NewsLaundry",
    "url": "https://www.reddit.com/r/india/comments/13xl2rk/exclusive_small_newspapers_get_govt_ads_worth/",
    "selftext": "While the government has been surely keeping big media under control, I have a feeling that even small publishers in print media are paid to keep them loyal to the ruling party.\n\nThe story is under paywall but you can get an idea of what is going on.\n\n[https://www.newslaundry.com/2023/05/31/small-newspapers-but-with-govt-ads-worth-crores-its-nine-years-of-narendra-modi](https://www.newslaundry.com/2023/05/31/small-newspapers-but-with-govt-ads-worth-crores-its-nine-years-of-narendra-modi)",
    "flair": "Politics",
    "score": 69,
    "num_comments": 7,
    "created_utc": 1685634534.0,
    "convurl": "https://external-preview.redd.it/9XmxAWoVtA9n3bxErRoQe0efFC8ZUXNSQLL1QwMt7HY.jpg?auto=webp&v=enabled&s=7985231dbdaefa645342ef4c7da738b8c0d28e7d",
    "comments": [
        "How bad can it get if every small and big publisher is either paid or threatened. I am just wondering that only few online platforms would remain unbiased.\n\nAnd, they also have IT Cell and troll army to deal with online dissent. And, they can also promote some YouTube channels and websites to push their agenda.",
        "Also according to Newslaundry, these newspapers don't even qualify the norms for publishing Govt advertisements. The owner of one such newspaper is actually a relative of the BJP workers. \n\nNewslaundry also provided detailed research into their editorials which are blatantly plagiarised from other newspapers .....",
        "When government supports you and you support government, you feel you are above the law.",
        "It's black to white conversion, this money is often returned as donation or electoral bonds"
    ],
    "cleaned_text": "exclusive small newspapers get govt ads worth crores bjp government newslaundry government surely keeping big media control feeling even small publishers print media paid keep loyal ruling party story paywall get idea going httpswwwnewslaundrycomsmallnewspapersbutwithgovtadsworthcroresitsnineyearsofnarendramodihttpswwwnewslaundrycomsmallnewspapersbutwithgovtadsworthcroresitsnineyearsofnarendramodi ",
    "cleaned_title": "exclusive small newspapers get govt ads worth crores bjp government newslaundry",
    "cleaned_selftext": "government surely keeping big media control feeling even small publishers print media paid keep loyal ruling party story paywall get idea going httpswwwnewslaundrycomsmallnewspapersbutwithgovtadsworthcroresitsnineyearsofnarendramodihttpswwwnewslaundrycomsmallnewspapersbutwithgovtadsworthcroresitsnineyearsofnarendramodi",
    "cleaned_comments": "bad get every small big publisher either paid threatened wondering online platforms would remain unbiased also cell troll army deal online dissent also promote youtube channels websites push agenda also according newslaundry newspapers dont even qualify norms publishing govt advertisements owner one newspaper actually relative bjp workers newslaundry also provided detailed research editorials blatantly plagiarised newspapers government supports support government feel law black white conversion money often returned donation electoral bonds",
    "light_cleaned_title": "Exclusive: Small newspapers get Govt ads worth crores under BJP Government: NewsLaundry",
    "light_cleaned_selftext": "While the government has been surely keeping big media under control, I have a feeling that even small publishers in print media are paid to keep them loyal to the ruling party. The story is under paywall but you can get an idea of what is going on. [https://www.newslaundry.com/2023/05/31/small-newspapers-but-with-govt-ads-worth-crores-its-nine-years-of-narendra-modi](https://www.newslaundry.com/2023/05/31/small-newspapers-but-with-govt-ads-worth-crores-its-nine-years-of-narendra-modi)",
    "light_cleaned_comments": "How bad can it get if every small and big publisher is either paid or threatened. I am just wondering that only few online platforms would remain unbiased. And, they also have IT Cell and troll army to deal with online dissent. And, they can also promote some YouTube channels and websites to push their agenda. Also according to Newslaundry, these newspapers don't even qualify the norms for publishing Govt advertisements. The owner of one such newspaper is actually a relative of the BJP workers. Newslaundry also provided detailed research into their editorials which are blatantly plagiarised from other newspapers ..... When government supports you and you support government, you feel you are above the law. It's black to white conversion, this money is often returned as donation or electoral bonds"
}