{
    "id": "14f6nsw",
    "title": "Customer Horror Stories: Which company should everyone stay away from?",
    "url": "https://www.reddit.com/r/india/comments/14f6nsw/customer_horror_stories_which_company_should/",
    "selftext": "I've had a fair share of bad experiences with many companies. You must have too. I recently booked flights with [Booking.com](https://Booking.com) & got trash/non-existent support. Same has been with many others.  \n\n\nI'm mentioning my incidents in the comments. Let's build a repository of companies everyone should stay away from in the comments & why?",
    "flair": "AskIndia",
    "score": 8,
    "num_comments": 25,
    "created_utc": 1687351194.0,
    "convurl": "https://external-preview.redd.it/5TECEA-LacSD7PWFDsMkE9AHnXcJRs5PQbzwOi8hZJ8.jpg?auto=webp&v=enabled&s=d09cd0c64374825d66d0c5615943d32316ab5683",
    "comments": [
        "**Booking.com** : They're international first. I recently booked a flight with them & had to cancel it. The airline issued a full refund without any deductions but Booking refunded only a portion of it. Now, they don't have a number or email to contact & there's no support through the website. Cherry on the cake? All booking.com flight bookings are handled by gotogate.com which has such a marvellous reputation that I hardly found any positive review of them online. Overall, you'll be f\\*\\*ked & there'll be no one to contact easily.",
        "**Flipkart** (group) : This one, ohh! It's not just Flipkart, it's all the companies under their whole group. Flipkart, Myntra, Cleartrip etc. My hands would hurt if I start narrating everything about them, so I'll keep to the top ones.\n\n&#x200B;\n\nMyntra's amazing customer support considers \"Deletion\" of an account as \"Suspension\", which I accidently did. I sent them a mail to delete my account & they suspended/banned me. Cherry on the top, they don't have an option to un-suspend the account. Wow! Brilliant.\n\nFurthermore, their s\\*\\*t return policies, convenience charges, refund defaults to myntra credit & not bank balance, random suspension warnings should be enough for anyone to stay away from them. Anyone & Everyone will only realise it once they lose their money in one way or another because their management, policies & support is trash.\n\n&#x200B;\n\nFlipkart is the same. Rs. 29-99 as an extra charge to buy a mobile, in the same packaging like any other product? Hell no. I'm confused as to why have they been able to pull this s\\*\\*t off for so long & why is everyone paying it. Most of their phones are exclusive, meaning the customer can't buy it anywhere else. So taking anything over the MRP as a mandatory charge should be illegal because there's no competition. Similarly, Rs. 5-10 to pay using COD. WTF! I've had many purchases where I had to pay 500-1000 extra because the price was more on Amazon but at least their support is top notch & overall experience is amazing.\n\nOne more thing, their so called \"plus\" program. First, you can't really use those supercoins for a lot of things. Then, most won't realise but Flipkart has discriminatory pricing. For many products, open it while logged in & in incognito, you'll see a different price. Same is for supercoins. For Eg. A product priced Rs. 249 normally will be sold for Rs. 99 + 300 Supercoins if you buy it through their supercoins reward store.",
        "**Swiggy** : I haven't really used Zomato a lot, but when I did, the experience was decent. One reason is that Zomato has so many bu\\*\\*shit charges that I don't order with them. When I tried Swiggy, the pricing was alright so I used it. 2-3 orders were fine but when the 4th one was not, was I saw their true face. It's true that you can judge a company by how their customer support is. \n\nSwiggy's support just did it for me that I wouldn't deal with them every again and only use a credit card if I have to so that I can atleast dispute the charge. I had ordered a meal & some items & they items delivered were missing many & were not what was ordered. The amount must have been 1200. When we complained, they offered a refund of Rs. 240 something. Great! Items missing worth Rs. 600 and the refund of 240. \n\nThat's not all, the support even transferred this as a coupon which can be used on an order within a month. Marvellous! Now I have to spend more money to use my money because the coupon has its own restrictions like only eligible on orders over 1000 or something.",
        "**Paytm** : Again! Customer Support. Paytm is not a small startup. They're capable of having a decent end to end customer support experience but all they have is trash. There's no direct number to call, the one they have has to be jumped through hoops to talk to a human. Even if you get to talk, they'll create a ticket by sending you an email & now you'll be jumping back and forth over email without knowing when will they reply. \n\nThe problem gets bigger because Paytm doesn't provide the service themselves, they're a huge aggregator of everything. So if anything f\\*\\*ks up from any third party, you'll have to jump between that party and Paytm (through which you got the service) and lack of [C.support](https://C.support) will definitely make it messy. All they really have is chat bots which never reach a human.",
        "**Zingbus** : I had booked a ticket from Rajkot to Dwarka (Gujarat) a week ago from the date of departure. No issues there, payments done, tickets delivered, seats allotted and done.\n\nWe're in the middle of our rail journey and the moment we get off the train tomorrow morning, we were supposed to board the (zing)bus. But!!!\n\nJust now we received messages from them saying that they've cancelled the tickets.\n\nWhy? Don't know.\n\nSupport? Call their number and the automated message says that you can text them on WhatsApp. WTF! So the phone number can't be used to call you. Brilliant. Without WhatsApp, support doesn't exist.\n\nNo message in the cancellation stating the reason.\n\nThe only good thing? There was clear communication about the refund which has been automatically initiated.\n\nI checked travel websites and the bus isn't available as an option anymore, as if it didn't exist. I had been regularly checking that bus and more than half the seats seemed to have been empty. Probably, due to lack of passengers, they cancelled the bus completely.\n\nWith this kinda support and service, you're better off booking even a government bus. Atleast you can be sure that you won't be stranded somewhere. Luckily, we found another not so ideal bus but it won't be the case everywhere.\n\nBut with service like this, the chances are high that if you have connecting journeys and even 2-3 zingbus bookings in a long trip, your trip will come to a standstill even if they cancel one of the buses and then the Domino effect will have you miss your bookings after that where you were supposed to reach at a specific time.",
        "Asus:  won't share the story,  but no one should buy their products :)",
        "wrote this on their laptop. 🙃  \n\n\nNot sure about yours but I've had decent experience with them.",
        "In short, they use inferior quality products/parts and you are basically covered until you are under warranty and once it's over then you are f****",
        "Naaptol!\n\nWe all have been scammed atleast once by this s**t",
        "Jiomart: had been using for groceries for a couple of months. Once I bought a 30kg packet of rice and they were mostly broken and the rice was getting clumped. Called their customer service. They told me that since the bag is already open, they can’t do anything.",
        "Aqua Guard water purifier.....Their service person damaged the filter of my under warranty purifier during service. Then they asked me to pay full amount for the new filter, after 10 days they offered 50% discount, then blamed me for the delay in repair by not taking their calls. Thieves!!!",
        "I have an Asus laptop from 2010 which is still doing very well. Was a windows laptop and I moved it to Linux some years ago, and it is still working fine.",
        "Good thing you can extend warranty to 3 years with 1 year damage protection for 3k-4k rs. On that asuspromo site atleast for the more expensive laptops i think. \n\nThey're the only brand that compromise neither on performance,screen or battery life while staying compact imo",
        "Yeah! I had an extended warranty. Provided good & on time service for even a small issue. Came home on time, felt quite good overall.",
        "Ohh yess. Forgot this one. Refused to replace a new malfunctioning pen drive.",
        "Bharti Airtel: Shitty ass company, no option to talk to a customer support executive, can only chat with a bot that gives a pre programmed response.\nThose idiots did not even processed any of my request to install a broadband service, in the end i have to go to 3rd party provider for that.\n\nBSNL: The shitty face company their services are so worst that describing in words is not possible.\nThe officers just don't listen, had to disconnect my broadband service with them because of no internet occurence for most of the times, they said to give them an application, which we gave and the officer in charge lost it and blamed us for not giving it. They even asked us to pay four months of charges because the officer in charge was on leave for 4 months and so our application was not submitted.\n\nPaytm: Worst Company which I have encountered till now, i have my full KYC which was done manually by a shop which they have partnered with.\nDidn't get credited for 400 cashback points because Paytm logged me out of my account and cancelled my KYC. Can't even connect to customer support as they just close the case and mark it as resolved.\n\nFlipkart: Those ass face are worse, didn't ship any of  my orders on time and cancelled many of them citing technical glitch in their app. The refund process was so long that it took almost 14 days to refund the amount that to in form of supercoins.\n\nForgot to add one more:\nSymphony Coolers: Those f***ers are piece of shit, My parents  had purchased a product of them: Winter 80xl+ cooler, they claimed so much at the time of purchase but all the claim fell into ditch,\nClaimed Multi stage air purification technology: weird ass three foam like piece ( not long than half of a half piece of an A4 size paper each ) covering a very small area on foam pads\nClaimed cooler comes with six wheels for better stability: It literally fell down on first day when it was turned on.\nClaimed plastic body is strong and sturdy and will last for lifetime: Garbage, it so flimsy that if you look at it for too long and it will deform from that area.\nThis stupid cooler break it's leg and service personnel which Symphony sent took 4 days to place order for the part and it took another 2 weeks to give it to us, they even took our number and said that they will give us a call once the part is arrived but in the end we have to go to their office to take it and when asked they told us that they thought we will come to take it from them, seriously, even more they said that part was with them from day one.",
        "Hyundai with engine fires",
        "I paid 6k for 1 year normal extended warranty,  what's the catch?",
        "Woaaaaahhh,  \"If you look at it for too long and it will deform\" \n\nWhere's your crown?",
        "Zingbus  service has been cool for me . I've travelled from Himachal to Delhi many times using their service and it's always safe and great ( excluding the passengers I rarely deal with) \n\nOnce when we were traveling to the bus station for  the Volvo in Delhi we got very late due to heavy traffic and the guy just called us to make sure if we wanted to take their service or not. \n\nDriver still Waited 15 minutes more for us (sorry for those passangers tho) .top class!!",
        "Dell and Lenovo  are always my go to companies for laptops if u have a good budget . My friend has an Asus laptop and it's pretty great ngl. \nFor cheaper laptop Acer or msi is great but hp ?? \nFk hp!!",
        "Where did you get it from? asuspromo.in has the offer to extend official warranty by asus very cheap depending on the laptop",
        "Flipkart"
    ],
    "cleaned_text": "customer horror stories company everyone stay away ive fair share bad experiences many companies must recently booked flights bookingcomhttpsbookingcom got trashnonexistent support many others im mentioning incidents comments lets build repository companies everyone stay away comments ",
    "cleaned_title": "customer horror stories company everyone stay away",
    "cleaned_selftext": "ive fair share bad experiences many companies must recently booked flights bookingcomhttpsbookingcom got trashnonexistent support many others im mentioning incidents comments lets build repository companies everyone stay away comments",
    "cleaned_comments": "bookingcom theyre international first recently booked flight cancel airline issued full refund without deductions booking refunded portion dont number email contact theres support website cherry cake bookingcom flight bookings handled gotogatecom marvellous reputation hardly found positive review online overall youll fked therell one contact easily flipkart group one ohh flipkart companies whole group flipkart myntra cleartrip etc hands would hurt start narrating everything ill keep top ones xb myntras amazing customer support considers deletion account suspension accidently sent mail delete account suspendedbanned cherry top dont option unsuspend account wow brilliant furthermore st return policies convenience charges refund defaults myntra credit bank balance random suspension warnings enough anyone stay away anyone everyone realise lose money one way another management policies support trash xb flipkart rs extra charge buy mobile packaging like product hell im confused able pull st long everyone paying phones exclusive meaning customer cant buy anywhere else taking anything mrp mandatory charge illegal theres competition similarly rs pay using cod wtf ive many purchases pay extra price amazon least support top notch overall experience amazing one thing called plus program first cant really use supercoins lot things wont realise flipkart discriminatory pricing many products open logged incognito youll see different price supercoins eg product priced rs normally sold rs supercoins buy supercoins reward store swiggy havent really used zomato lot experience decent one reason zomato many bushit charges dont order tried swiggy pricing alright used orders fine th one saw true face true judge company customer support swiggys support wouldnt deal every use credit card atleast dispute charge ordered meal items items delivered missing many ordered amount must complained offered refund rs something great items missing worth rs refund thats support even transferred coupon used order within month marvellous spend money use money coupon restrictions like eligible orders something paytm customer support paytm small startup theyre capable decent end end customer support experience trash theres direct number call one jumped hoops talk human even get talk theyll create ticket sending email youll jumping back forth email without knowing reply problem gets bigger paytm doesnt provide service theyre huge aggregator everything anything fks third party youll jump party paytm got service lack csupporthttpscsupport definitely make messy really chat bots never reach human zingbus booked ticket rajkot dwarka gujarat week ago date departure issues payments done tickets delivered seats allotted done middle rail journey moment get train tomorrow morning supposed board zingbus received messages saying theyve cancelled tickets dont know support call number automated message says text whatsapp wtf phone number cant used call brilliant without whatsapp support doesnt exist message cancellation stating reason good thing clear communication refund automatically initiated checked travel websites bus isnt available option anymore didnt exist regularly checking bus half seats seemed empty probably due lack passengers cancelled bus completely kinda support service youre better booking even government bus atleast sure wont stranded somewhere luckily found another ideal bus wont case everywhere service like chances high connecting journeys even zingbus bookings long trip trip come standstill even cancel one buses domino effect miss bookings supposed reach specific time asus wont share story one buy products wrote laptop sure ive decent experience short use inferior quality productsparts basically covered warranty f naaptol scammed atleast st jiomart using groceries couple months bought kg packet rice mostly broken rice getting clumped called customer service told since bag already open cant anything aqua guard water purifiertheir service person damaged filter warranty purifier service asked pay full amount new filter days offered discount blamed delay repair taking calls thieves asus laptop still well windows laptop moved linux years ago still working fine good thing extend warranty years year damage protection kk rs asuspromo site atleast expensive laptops think theyre brand compromise neither performancescreen battery life staying compact imo yeah extended warranty provided good time service even small issue came home time felt quite good overall ohh yess forgot one refused replace new malfunctioning pen drive bharti airtel shitty ass company option talk customer support executive chat bot gives pre programmed response idiots even processed request install broadband service end go rd party provider bsnl shitty face company services worst describing words possible officers dont listen disconnect broadband service internet occurence times said give application gave officer charge lost blamed us giving even asked us pay four months charges officer charge leave months application submitted paytm worst company encountered till full kyc done manually shop partnered didnt get credited cashback points paytm logged account cancelled kyc cant even connect customer support close case mark resolved flipkart ass face worse didnt ship orders time cancelled many citing technical glitch app refund process long took almost days refund amount form supercoins forgot add one symphony coolers fers piece shit parents purchased product winter xl cooler claimed much time purchase claim fell ditch claimed multi stage air purification technology weird ass three foam like piece long half half piece size paper covering small area foam pads claimed cooler comes six wheels better stability literally fell first day turned claimed plastic body strong sturdy last lifetime garbage flimsy look long deform area stupid cooler break leg service personnel symphony sent took days place order part took another weeks give us even took number said give us call part arrived end go office take asked told us thought come take seriously even said part day one hyundai engine fires paid k year normal extended warranty whats catch woaaaaahhh look long deform wheres crown zingbus service cool ive travelled himachal delhi many times using service always safe great excluding passengers rarely deal traveling bus station volvo delhi got late due heavy traffic guy called us make sure wanted take service driver still waited minutes us sorry passangers tho top class dell lenovo always go companies laptops u good budget friend asus laptop pretty great ngl cheaper laptop acer msi great hp fk hp get asuspromoin offer extend official warranty asus cheap depending laptop flipkart",
    "light_cleaned_title": "Customer Horror Stories: Which company should everyone stay away from?",
    "light_cleaned_selftext": "I've had a fair share of bad experiences with many companies. You must have too. I recently booked flights with [Booking.com](https://Booking.com) & got trash/non-existent support. Same has been with many others. I'm mentioning my incidents in the comments. Let's build a repository of companies everyone should stay away from in the comments & why?",
    "light_cleaned_comments": "**Booking.com** : They're international first. I recently booked a flight with them & had to cancel it. The airline issued a full refund without any deductions but Booking refunded only a portion of it. Now, they don't have a number or email to contact & there's no support through the website. Cherry on the cake? All booking.com flight bookings are handled by gotogate.com which has such a marvellous reputation that I hardly found any positive review of them online. Overall, you'll be f\\*\\*ked & there'll be no one to contact easily. **Flipkart** (group) : This one, ohh! It's not just Flipkart, it's all the companies under their whole group. Flipkart, Myntra, Cleartrip etc. My hands would hurt if I start narrating everything about them, so I'll keep to the top ones. &#x200B; Myntra's amazing customer support considers \"Deletion\" of an account as \"Suspension\", which I accidently did. I sent them a mail to delete my account & they suspended/banned me. Cherry on the top, they don't have an option to un-suspend the account. Wow! Brilliant. Furthermore, their s\\*\\*t return policies, convenience charges, refund defaults to myntra credit & not bank balance, random suspension warnings should be enough for anyone to stay away from them. Anyone & Everyone will only realise it once they lose their money in one way or another because their management, policies & support is trash. &#x200B; Flipkart is the same. Rs. 29-99 as an extra charge to buy a mobile, in the same packaging like any other product? Hell no. I'm confused as to why have they been able to pull this s\\*\\*t off for so long & why is everyone paying it. Most of their phones are exclusive, meaning the customer can't buy it anywhere else. So taking anything over the MRP as a mandatory charge should be illegal because there's no competition. Similarly, Rs. 5-10 to pay using COD. WTF! I've had many purchases where I had to pay 500-1000 extra because the price was more on Amazon but at least their support is top notch & overall experience is amazing. One more thing, their so called \"plus\" program. First, you can't really use those supercoins for a lot of things. Then, most won't realise but Flipkart has discriminatory pricing. For many products, open it while logged in & in incognito, you'll see a different price. Same is for supercoins. For Eg. A product priced Rs. 249 normally will be sold for Rs. 99 + 300 Supercoins if you buy it through their supercoins reward store. **Swiggy** : I haven't really used Zomato a lot, but when I did, the experience was decent. One reason is that Zomato has so many bu\\*\\*shit charges that I don't order with them. When I tried Swiggy, the pricing was alright so I used it. 2-3 orders were fine but when the 4th one was not, was I saw their true face. It's true that you can judge a company by how their customer support is. Swiggy's support just did it for me that I wouldn't deal with them every again and only use a credit card if I have to so that I can atleast dispute the charge. I had ordered a meal & some items & they items delivered were missing many & were not what was ordered. The amount must have been 1200. When we complained, they offered a refund of Rs. 240 something. Great! Items missing worth Rs. 600 and the refund of 240. That's not all, the support even transferred this as a coupon which can be used on an order within a month. Marvellous! Now I have to spend more money to use my money because the coupon has its own restrictions like only eligible on orders over 1000 or something. **Paytm** : Again! Customer Support. Paytm is not a small startup. They're capable of having a decent end to end customer support experience but all they have is trash. There's no direct number to call, the one they have has to be jumped through hoops to talk to a human. Even if you get to talk, they'll create a ticket by sending you an email & now you'll be jumping back and forth over email without knowing when will they reply. The problem gets bigger because Paytm doesn't provide the service themselves, they're a huge aggregator of everything. So if anything f\\*\\*ks up from any third party, you'll have to jump between that party and Paytm (through which you got the service) and lack of [C.support](https://C.support) will definitely make it messy. All they really have is chat bots which never reach a human. **Zingbus** : I had booked a ticket from Rajkot to Dwarka (Gujarat) a week ago from the date of departure. No issues there, payments done, tickets delivered, seats allotted and done. We're in the middle of our rail journey and the moment we get off the train tomorrow morning, we were supposed to board the (zing)bus. But!!! Just now we received messages from them saying that they've cancelled the tickets. Why? Don't know. Support? Call their number and the automated message says that you can text them on WhatsApp. WTF! So the phone number can't be used to call you. Brilliant. Without WhatsApp, support doesn't exist. No message in the cancellation stating the reason. The only good thing? There was clear communication about the refund which has been automatically initiated. I checked travel websites and the bus isn't available as an option anymore, as if it didn't exist. I had been regularly checking that bus and more than half the seats seemed to have been empty. Probably, due to lack of passengers, they cancelled the bus completely. With this kinda support and service, you're better off booking even a government bus. Atleast you can be sure that you won't be stranded somewhere. Luckily, we found another not so ideal bus but it won't be the case everywhere. But with service like this, the chances are high that if you have connecting journeys and even 2-3 zingbus bookings in a long trip, your trip will come to a standstill even if they cancel one of the buses and then the Domino effect will have you miss your bookings after that where you were supposed to reach at a specific time. Asus: won't share the story, but no one should buy their products :) wrote this on their laptop. 🙃 Not sure about yours but I've had decent experience with them. In short, they use inferior quality products/parts and you are basically covered until you are under warranty and once it's over then you are f**** Naaptol! We all have been scammed atleast once by this s**t Jiomart: had been using for groceries for a couple of months. Once I bought a 30kg packet of rice and they were mostly broken and the rice was getting clumped. Called their customer service. They told me that since the bag is already open, they can’t do anything. Aqua Guard water purifier.....Their service person damaged the filter of my under warranty purifier during service. Then they asked me to pay full amount for the new filter, after 10 days they offered 50% discount, then blamed me for the delay in repair by not taking their calls. Thieves!!! I have an Asus laptop from 2010 which is still doing very well. Was a windows laptop and I moved it to Linux some years ago, and it is still working fine. Good thing you can extend warranty to 3 years with 1 year damage protection for 3k-4k rs. On that asuspromo site atleast for the more expensive laptops i think. They're the only brand that compromise neither on performance,screen or battery life while staying compact imo Yeah! I had an extended warranty. Provided good & on time service for even a small issue. Came home on time, felt quite good overall. Ohh yess. Forgot this one. Refused to replace a new malfunctioning pen drive. Bharti Airtel: Shitty ass company, no option to talk to a customer support executive, can only chat with a bot that gives a pre programmed response. Those idiots did not even processed any of my request to install a broadband service, in the end i have to go to 3rd party provider for that. BSNL: The shitty face company their services are so worst that describing in words is not possible. The officers just don't listen, had to disconnect my broadband service with them because of no internet occurence for most of the times, they said to give them an application, which we gave and the officer in charge lost it and blamed us for not giving it. They even asked us to pay four months of charges because the officer in charge was on leave for 4 months and so our application was not submitted. Paytm: Worst Company which I have encountered till now, i have my full KYC which was done manually by a shop which they have partnered with. Didn't get credited for 400 cashback points because Paytm logged me out of my account and cancelled my KYC. Can't even connect to customer support as they just close the case and mark it as resolved. Flipkart: Those ass face are worse, didn't ship any of my orders on time and cancelled many of them citing technical glitch in their app. The refund process was so long that it took almost 14 days to refund the amount that to in form of supercoins. Forgot to add one more: Symphony Coolers: Those f***ers are piece of shit, My parents had purchased a product of them: Winter 80xl+ cooler, they claimed so much at the time of purchase but all the claim fell into ditch, Claimed Multi stage air purification technology: weird ass three foam like piece ( not long than half of a half piece of an A4 size paper each ) covering a very small area on foam pads Claimed cooler comes with six wheels for better stability: It literally fell down on first day when it was turned on. Claimed plastic body is strong and sturdy and will last for lifetime: Garbage, it so flimsy that if you look at it for too long and it will deform from that area. This stupid cooler break it's leg and service personnel which Symphony sent took 4 days to place order for the part and it took another 2 weeks to give it to us, they even took our number and said that they will give us a call once the part is arrived but in the end we have to go to their office to take it and when asked they told us that they thought we will come to take it from them, seriously, even more they said that part was with them from day one. Hyundai with engine fires I paid 6k for 1 year normal extended warranty, what's the catch? Woaaaaahhh, \"If you look at it for too long and it will deform\" Where's your crown? Zingbus service has been cool for me . I've travelled from Himachal to Delhi many times using their service and it's always safe and great ( excluding the passengers I rarely deal with) Once when we were traveling to the bus station for the Volvo in Delhi we got very late due to heavy traffic and the guy just called us to make sure if we wanted to take their service or not. Driver still Waited 15 minutes more for us (sorry for those passangers tho) .top class!! Dell and Lenovo are always my go to companies for laptops if u have a good budget . My friend has an Asus laptop and it's pretty great ngl. For cheaper laptop Acer or msi is great but hp ?? Fk hp!! Where did you get it from? asuspromo.in has the offer to extend official warranty by asus very cheap depending on the laptop Flipkart"
}