{
    "id": "1eo874s",
    "title": "two innocent lives lost due to reckless driving and university negligence ",
    "url": "https://www.reddit.com/gallery/1eo874s",
    "selftext": "A tragic car accident occurred on February 23, 2024, involving two students from O.P. Jindal Global University,Sonepat, resulting in their deaths. The driver, Mannan Agarwal, was allegedly intoxicated and took control of the vehicle from a cab driver, recklessly speeding and causing the fatal crash. Despite being responsible for the accident, Mannan and the cab driver were released on bail with no consequences. And this is not Mannan’s first offence. The victims' families have received no support from the university, and no justice has been served six months later. The police didn’t investigate the case after the 23rd of February, no cctv footages were provided, no statements either and of course no newspaper was ready to cover the incident because the college belongs to Naveen Jindal. The incident highlights the university's negligence, lack of accountability, and inadequate safety measures. The owner of Golden Hut, where Mannan was served alcohol despite being below the legal drinking age, has also not been questioned. The victims' families are seeking justice and awareness through social media, sharing their story and evidence. I am attaching some screenshots from the twitter account of the mother of one of the victims.Help amplify their voices and demand accountability. I am attaching the one article that was published for proof as my previous post was deleted. ",
    "flair": "Crime",
    "score": 4,
    "num_comments": 1,
    "created_utc": 1723230620.0,
    "convurl": "https://i.redd.it/nw328d1dtohd1.jpg",
    "comments": [
        "Sad",
        "Essay writing time"
    ],
    "cleaned_text": "two innocent lives lost due reckless driving university negligence tragic car accident occurred february involving two students op jindal global universitysonepat resulting deaths driver mannan agarwal allegedly intoxicated took control vehicle cab driver recklessly speeding causing fatal crash despite responsible accident mannan cab driver released bail consequences mannans first offence victims families received support university justice served six months later police didnt investigate case rd february cctv footages provided statements either course newspaper ready cover incident college belongs naveen jindal incident highlights universitys negligence lack accountability inadequate safety measures owner golden hut mannan served alcohol despite legal drinking age also questioned victims families seeking justice awareness social media sharing story evidence attaching screenshots twitter account mother one victimshelp amplify voices demand accountability attaching one article published proof previous post deleted ",
    "cleaned_title": "two innocent lives lost due reckless driving university negligence",
    "cleaned_selftext": "tragic car accident occurred february involving two students op jindal global universitysonepat resulting deaths driver mannan agarwal allegedly intoxicated took control vehicle cab driver recklessly speeding causing fatal crash despite responsible accident mannan cab driver released bail consequences mannans first offence victims families received support university justice served six months later police didnt investigate case rd february cctv footages provided statements either course newspaper ready cover incident college belongs naveen jindal incident highlights universitys negligence lack accountability inadequate safety measures owner golden hut mannan served alcohol despite legal drinking age also questioned victims families seeking justice awareness social media sharing story evidence attaching screenshots twitter account mother one victimshelp amplify voices demand accountability attaching one article published proof previous post deleted",
    "cleaned_comments": "sad essay writing time",
    "light_cleaned_title": "two innocent lives lost due to reckless driving and university negligence",
    "light_cleaned_selftext": "A tragic car accident occurred on February 23, 2024, involving two students from O.P. Jindal Global University,Sonepat, resulting in their deaths. The driver, Mannan Agarwal, was allegedly intoxicated and took control of the vehicle from a cab driver, recklessly speeding and causing the fatal crash. Despite being responsible for the accident, Mannan and the cab driver were released on bail with no consequences. And this is not Mannan’s first offence. The victims' families have received no support from the university, and no justice has been served six months later. The police didn’t investigate the case after the 23rd of February, no cctv footages were provided, no statements either and of course no newspaper was ready to cover the incident because the college belongs to Naveen Jindal. The incident highlights the university's negligence, lack of accountability, and inadequate safety measures. The owner of Golden Hut, where Mannan was served alcohol despite being below the legal drinking age, has also not been questioned. The victims' families are seeking justice and awareness through social media, sharing their story and evidence. I am attaching some screenshots from the twitter account of the mother of one of the victims.Help amplify their voices and demand accountability. I am attaching the one article that was published for proof as my previous post was deleted.",
    "light_cleaned_comments": "Sad Essay writing time"
}