{
    "id": "13niefj",
    "title": "NDTV has released a new documentary on 9 years of Modi government",
    "url": "https://www.reddit.com/r/india/comments/13niefj/ndtv_has_released_a_new_documentary_on_9_years_of/",
    "selftext": "I apologise for the misleading title, because it is not NDTV, but aDaNiTV who has released it.\n\nArticle: [https://www.ndtv.com/india-news/on-9-years-of-pm-modi-a-look-at-indias-meteoric-rise-in-global-affairs-4043417](https://www.ndtv.com/india-news/on-9-years-of-pm-modi-a-look-at-indias-meteoric-rise-in-global-affairs-4043417)\n\n>...has made India a key stakeholder in global affairs, say political leaders, diplomats, economists and other experts.  \n>  \n>...\"strong leader who is confident in the presence of some of the most powerful leaders in the world, and who represents a growing economy, a nation with the highest population, a nation sought by the West for friendship, and an important geopolitical player that counters an expansionist China\"  \n>  \n>...\"started with a master stroke. He was the first Prime Minister of India to think of inviting the immediate neighbours of South Asia and Mauritius or near-neighbours to his inauguration\"...\n\nEpisode 1:\n\n[As Prime Minister Narendra Modi completes nine years at the helm, NDTV presents a documentary series capturing his contribution to shaping the India story. Episode one focuses on Modi diplomacy and how India's standing in the world was shaped by the PM's bold diplomatic moves.](https://www.ndtv.com/video/shows/9-years-of-pm-modi-a-documentary-series/9-years-of-pm-modi-documentary-series-episode-1-diplomacy-700493?rdr=1)\n\nEpisode 2:\n\n[How have Modi government's welfare schemes benefitted women and pushed the cause of the girl child? As Prime Minister Narendra Modi completes nine years at the helm, NDTV presents a documentary series capturing his contribution to shaping the India story. Episode two focuses on how women empowerment became a hallmark of PM Modi's governance.](https://www.ndtv.com/video/shows/9-years-of-pm-modi-a-documentary-series/9-years-of-pm-modi-documentary-series-episode-2-women-empowerment-700823)\n\nI think I heard someone saying, NDTV's management may, but values won't change, editorial team will remain same, etc. etc.\n\n[Owner of Narendra Damodardas TV](https://preview.redd.it/trurs9h3041b1.png?width=800&format=png&auto=webp&v=enabled&s=f11e54264707a43df11e119c4c8be8ac7d624ab9)",
    "flair": "Politics",
    "score": 149,
    "num_comments": 17,
    "created_utc": 1684642038.0,
    "convurl": "https://external-preview.redd.it/I_zbNDkUvcz1LYsyj-ijoMkVmYm7gIZMVaVN8vGQR4k.jpg?auto=webp&v=enabled&s=1495d40686cd630029b500ccd45f4009b1723ac7",
    "comments": [
        "Wadiya TV doing Wadiya TV things...",
        "all that adani moolah being put to good use,  they are sucking so hard now, i just took them off my twitter feed.",
        "Real sad to see the transformation of NDTV from being the hallmark of excellent journalism to just another bunch of goobers kissing this clown’s ass on command",
        "NDTV is a lost cause now. It used to be the only channel I switched to, they have taken away that also.",
        "as expected from adanitv.",
        "I removed twitter from my life feed.",
        "Now NDTV is not unbiased source. We don't don't want propoganda. It's predictable what's in that documentary.  If I vote for 2024 then i want changes in my life. I don't want to see typical Hindu khatare me hai and BJP is solution of stuff. Being Hindu i can see what's condition of our Temples and brahamin who works daily without any protection from government. Nobody is teaching Vedas. 9 years was enough to make positive changes for Hindu issues. I can only see hatred between religion and we start worshiping business person. Make common person understand this.",
        "As expected. I thought even the team at ndtv left the channel for good",
        "That's really aladeen",
        "Bigwigs did, but some left behind - may be for that steady income stream. Ideologies don’t feed you and your family."
    ],
    "cleaned_text": "ndtv released new documentary years modi government apologise misleading title ndtv adanitv released article httpswwwndtvcomindianewsonyearsofpmmodialookatindiasmeteoricriseinglobalaffairshttpswwwndtvcomindianewsonyearsofpmmodialookatindiasmeteoricriseinglobalaffairs made india key stakeholder global affairs say political leaders diplomats economists experts strong leader confident presence powerful leaders world represents growing economy nation highest population nation sought west friendship important geopolitical player counters expansionist china started master stroke first prime minister india think inviting immediate neighbours south asia mauritius nearneighbours inauguration episode prime minister narendra modi completes nine years helm ndtv presents documentary series capturing contribution shaping india story episode one focuses modi diplomacy indias standing world shaped pms bold diplomatic moveshttpswwwndtvcomvideoshowsyearsofpmmodiadocumentaryseriesyearsofpmmodidocumentaryseriesepisodediplomacyrdr episode modi governments welfare schemes benefitted women pushed cause girl child prime minister narendra modi completes nine years helm ndtv presents documentary series capturing contribution shaping india story episode two focuses women empowerment became hallmark pm modis governancehttpswwwndtvcomvideoshowsyearsofpmmodiadocumentaryseriesyearsofpmmodidocumentaryseriesepisodewomenempowerment think heard someone saying ndtvs management may values wont change editorial team remain etc etc owner narendra damodardas tvhttpspreviewreddittrurshbpngwidthformatpngautowebpvenabledsfeadfeccbeacdab ",
    "cleaned_title": "ndtv released new documentary years modi government",
    "cleaned_selftext": "apologise misleading title ndtv adanitv released article httpswwwndtvcomindianewsonyearsofpmmodialookatindiasmeteoricriseinglobalaffairshttpswwwndtvcomindianewsonyearsofpmmodialookatindiasmeteoricriseinglobalaffairs made india key stakeholder global affairs say political leaders diplomats economists experts strong leader confident presence powerful leaders world represents growing economy nation highest population nation sought west friendship important geopolitical player counters expansionist china started master stroke first prime minister india think inviting immediate neighbours south asia mauritius nearneighbours inauguration episode prime minister narendra modi completes nine years helm ndtv presents documentary series capturing contribution shaping india story episode one focuses modi diplomacy indias standing world shaped pms bold diplomatic moveshttpswwwndtvcomvideoshowsyearsofpmmodiadocumentaryseriesyearsofpmmodidocumentaryseriesepisodediplomacyrdr episode modi governments welfare schemes benefitted women pushed cause girl child prime minister narendra modi completes nine years helm ndtv presents documentary series capturing contribution shaping india story episode two focuses women empowerment became hallmark pm modis governancehttpswwwndtvcomvideoshowsyearsofpmmodiadocumentaryseriesyearsofpmmodidocumentaryseriesepisodewomenempowerment think heard someone saying ndtvs management may values wont change editorial team remain etc etc owner narendra damodardas tvhttpspreviewreddittrurshbpngwidthformatpngautowebpvenabledsfeadfeccbeacdab",
    "cleaned_comments": "wadiya tv wadiya tv things adani moolah put good use sucking hard took twitter feed real sad see transformation ndtv hallmark excellent journalism another bunch goobers kissing clowns ass command ndtv lost cause used channel switched taken away also expected adanitv removed twitter life feed ndtv unbiased source dont dont want propoganda predictable whats documentary vote want changes life dont want see typical hindu khatare hai bjp solution stuff hindu see whats condition temples brahamin works daily without protection government nobody teaching vedas years enough make positive changes hindu issues see hatred religion start worshiping business person make common person understand expected thought even team ndtv left channel good thats really aladeen bigwigs left behind may steady income stream ideologies dont feed family",
    "light_cleaned_title": "NDTV has released a new documentary on 9 years of Modi government",
    "light_cleaned_selftext": "I apologise for the misleading title, because it is not NDTV, but aDaNiTV who has released it. Article: [https://www.ndtv.com/india-news/on-9-years-of-pm-modi-a-look-at-indias-meteoric-rise-in-global-affairs-4043417](https://www.ndtv.com/india-news/on-9-years-of-pm-modi-a-look-at-indias-meteoric-rise-in-global-affairs-4043417) >...has made India a key stakeholder in global affairs, say political leaders, diplomats, economists and other experts. > >...\"strong leader who is confident in the presence of some of the most powerful leaders in the world, and who represents a growing economy, a nation with the highest population, a nation sought by the West for friendship, and an important geopolitical player that counters an expansionist China\" > >...\"started with a master stroke. He was the first Prime Minister of India to think of inviting the immediate neighbours of South Asia and Mauritius or near-neighbours to his inauguration\"... Episode 1: [As Prime Minister Narendra Modi completes nine years at the helm, NDTV presents a documentary series capturing his contribution to shaping the India story. Episode one focuses on Modi diplomacy and how India's standing in the world was shaped by the PM's bold diplomatic moves.](https://www.ndtv.com/video/shows/9-years-of-pm-modi-a-documentary-series/9-years-of-pm-modi-documentary-series-episode-1-diplomacy-700493?rdr=1) Episode 2: [How have Modi government's welfare schemes benefitted women and pushed the cause of the girl child? As Prime Minister Narendra Modi completes nine years at the helm, NDTV presents a documentary series capturing his contribution to shaping the India story. Episode two focuses on how women empowerment became a hallmark of PM Modi's governance.](https://www.ndtv.com/video/shows/9-years-of-pm-modi-a-documentary-series/9-years-of-pm-modi-documentary-series-episode-2-women-empowerment-700823) I think I heard someone saying, NDTV's management may, but values won't change, editorial team will remain same, etc. etc. [Owner of Narendra Damodardas TV](https://preview.redd.it/trurs9h3041b1.png?width=800&format=png&auto=webp&v=enabled&s=f11e54264707a43df11e119c4c8be8ac7d624ab9)",
    "light_cleaned_comments": "Wadiya TV doing Wadiya TV things... all that adani moolah being put to good use, they are sucking so hard now, i just took them off my twitter feed. Real sad to see the transformation of NDTV from being the hallmark of excellent journalism to just another bunch of goobers kissing this clown’s ass on command NDTV is a lost cause now. It used to be the only channel I switched to, they have taken away that also. as expected from adanitv. I removed twitter from my life feed. Now NDTV is not unbiased source. We don't don't want propoganda. It's predictable what's in that documentary. If I vote for 2024 then i want changes in my life. I don't want to see typical Hindu khatare me hai and BJP is solution of stuff. Being Hindu i can see what's condition of our Temples and brahamin who works daily without any protection from government. Nobody is teaching Vedas. 9 years was enough to make positive changes for Hindu issues. I can only see hatred between religion and we start worshiping business person. Make common person understand this. As expected. I thought even the team at ndtv left the channel for good That's really aladeen Bigwigs did, but some left behind - may be for that steady income stream. Ideologies don’t feed you and your family."
}