{
    "id": "158yz7y",
    "title": "Manipur journalist arrested under NSA for criticising CM, state govt",
    "url": "https://indianexpress.com/article/north-east-india/manipur/journalist-arrested-under-nsa-for-criticising-cm-state-govt-5473418/",
    "selftext": "The news back in 2018. Biren Singh is incredibly sensitive.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690263509.0,
    "convurl": "https://external-preview.redd.it/kcCXlT9Wxu50ibWtRpvSTsHz1hUH6Ud5kntjME9GUYA.jpg?auto=webp&s=ba63148f663a340fbc318253900974b3d1c12aa1",
    "comments": [
        "“I am saddened and shocked to learn that the present government of Manipur is observing birth anniversary of Rani of Jhansi. And the chief minister himself claims that the BJP government is observing this for her role in unification of India or her role in the freedom struggle. But…she has nothing to do with Manipur. You are observing this because the Centre asked you to do this”\n\nLooks like they wanted to arrest him for other reasons and this is the scapegoat they found."
    ],
    "cleaned_text": "manipur journalist arrested nsa criticising cm state govt news back biren singh incredibly sensitive ",
    "cleaned_title": "manipur journalist arrested nsa criticising cm state govt",
    "cleaned_selftext": "news back biren singh incredibly sensitive",
    "cleaned_comments": "saddened shocked learn present government manipur observing birth anniversary rani jhansi chief minister claims bjp government observing role unification india role freedom struggle butshe nothing manipur observing centre asked looks like wanted arrest reasons scapegoat found",
    "light_cleaned_title": "Manipur journalist arrested under NSA for criticising CM, state govt",
    "light_cleaned_selftext": "The news back in 2018. Biren Singh is incredibly sensitive.",
    "light_cleaned_comments": "“I am saddened and shocked to learn that the present government of Manipur is observing birth anniversary of Rani of Jhansi. And the chief minister himself claims that the BJP government is observing this for her role in unification of India or her role in the freedom struggle. But…she has nothing to do with Manipur. You are observing this because the Centre asked you to do this” Looks like they wanted to arrest him for other reasons and this is the scapegoat they found."
}