{
    "id": "151pigl",
    "title": "Someone tried to light our house on fire",
    "url": "https://www.reddit.com/gallery/151pigl",
    "selftext": "So the layout of my house is quite like this— its a two story building with a ground and first floor. There are 3 families living here, 1(My grandpa, mum dad and me), 2(Mama, Mami and my cousin sister) 3(Naani, my mother’s sister and her son). It used to be 3 separate families but they married each other. We own 3 rooms, a kitchen downstairs and a room small enough to just fit a single bed where grandpa sleeps and the main room where rest of us sleep. Mama Mami have 4 rooms upstairs and only Naani Bhai and aunty live downstairs. \n\nIt was 11.30 and we were all in bed by this time when someone started banging wildly on my aunt’s window screaming that there was a fire. It was our neighbour who had moved in just a couple months ago. My aunt and bhai went out to see our main door up in flames. They put out the fire with water and decided to tell us in the morning. Now the thing is, its clear that it was started deliberately. There’s used matchsticks lined right outside our door. The point of concern is also that our meter box was right by the gate. 10 minutes more of that fire and it would have been a disaster. We don’t have any proof but we’re pretty sure it was the next door neighbours. Our other neighbours came to see it and they were also of the same opinion. “Who else can do it except the ones that roam out at night?” Aka our next door neighbours who are also avid alcoholics might I add. We’ve had small feuds with them for a long time but the most recent one(end of june) was the worst and they’re envious of anyone’s success. Our house was very delapidated(its over a 100 years old) and my mama has a successful job so he put in like 4-5 lakhs to renovate it. We didn’t even have a main door before this. This obviously lit a fire under their arse and they’d pick fights over anything and everything. They’re also unemployed and their daughter works a small job but mostly stays out of home(she doesn’t like her parents either)\n\nI’m sorry this was long but what should we do next? Is there any legal action that can be taken against them? I like picked up a match from the front of our house with tongs and kept it in wrapping paper(did I watch too many crime shows?) IS there something that can be done? \n\nP.s. before you guys accuse me of karka fishing, I’m going to attach photos.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689561984.0,
    "convurl": "https://i.redd.it/de1bqcx4vfcb1.jpg",
    "comments": [
        "Install a cctv camera",
        "File a FIR and mention people of interest to the police. As, other fellow said install cctv. If possible get an insurance, if this happens in the future. I would also recommend you to post it on r/legaladviceindia , they might be able to give you a better course of action.",
        "On it",
        "Why would your neighbours warn you if they're the ones who started the fire?",
        "It was a different neighbour.",
        "Damn man that's scary",
        "This made me laugh 😂",
        "What's a karka and does it taste good? /s\n\nYou should lodge a complaint and take photos and stable videos of the evidence take a few backups of that same. Present one to the police keep it for urself too. \n\nIt's not prudent to accuse ur neighbours without proof even tho u are cent percent sure. I'd say do get multiple cctvs on ur premises and a dvr box, would cost around 10k but imo worth it. \nDo keep the cameras shielded from outsiders; away from the railing so that they won't get easily grabbed by intruders. Setup motion detection on them too, it's done thru the DVR box. Setup alerts on phones or on the DVR app, set it up locally or it'll eat up ur internet really quickly. \n\nTake phone numbers from ur friendlier neighbours.  \n\nPurchase a fire extinguisher and keep it somewhere it can be grabbed by any1 inside the house. One on each floor would suffice. \n\nLight the areas around the entrance or get the light switches to work from inside the house is u don't need to come out to see what is going on. \n\nAlso instead of using this plastic grill or whatever melted goo that is, use a metal grille or jaali it won't burn down that easily. Get it painted or it'll rust really quickly."
    ],
    "cleaned_text": "someone tried light house fire layout house quite like two story building ground first floor families living grandpa mum dad mama mami cousin sister naani mothers sister son used separate families married rooms kitchen downstairs room small enough fit single bed grandpa sleeps main room rest us sleep mama mami rooms upstairs naani bhai aunty live downstairs bed time someone started banging wildly aunts window screaming fire neighbour moved couple months ago aunt bhai went see main door flames put fire water decided tell us morning thing clear started deliberately theres used matchsticks lined right outside door point concern also meter box right gate minutes fire would disaster dont proof pretty sure next door neighbours neighbours came see also opinion else except ones roam night aka next door neighbours also avid alcoholics might add weve small feuds long time recent oneend june worst theyre envious anyones success house delapidatedits years old mama successful job put like lakhs renovate didnt even main door obviously lit fire arse theyd pick fights anything everything theyre also unemployed daughter works small job mostly stays homeshe doesnt like parents either im sorry long next legal action taken like picked match front house tongs kept wrapping paperdid watch many crime shows something done ps guys accuse karka fishing im going attach photos ",
    "cleaned_title": "someone tried light house fire",
    "cleaned_selftext": "layout house quite like two story building ground first floor families living grandpa mum dad mama mami cousin sister naani mothers sister son used separate families married rooms kitchen downstairs room small enough fit single bed grandpa sleeps main room rest us sleep mama mami rooms upstairs naani bhai aunty live downstairs bed time someone started banging wildly aunts window screaming fire neighbour moved couple months ago aunt bhai went see main door flames put fire water decided tell us morning thing clear started deliberately theres used matchsticks lined right outside door point concern also meter box right gate minutes fire would disaster dont proof pretty sure next door neighbours neighbours came see also opinion else except ones roam night aka next door neighbours also avid alcoholics might add weve small feuds long time recent oneend june worst theyre envious anyones success house delapidatedits years old mama successful job put like lakhs renovate didnt even main door obviously lit fire arse theyd pick fights anything everything theyre also unemployed daughter works small job mostly stays homeshe doesnt like parents either im sorry long next legal action taken like picked match front house tongs kept wrapping paperdid watch many crime shows something done ps guys accuse karka fishing im going attach photos",
    "cleaned_comments": "install cctv camera file fir mention people interest police fellow said install cctv possible get insurance happens future would also recommend post rlegaladviceindia might able give better course action would neighbours warn theyre ones started fire different neighbour damn man thats scary made laugh whats karka taste good lodge complaint take photos stable videos evidence take backups present one police keep urself prudent accuse ur neighbours without proof even tho u cent percent sure id say get multiple cctvs ur premises dvr box would cost around k imo worth keep cameras shielded outsiders away railing wont get easily grabbed intruders setup motion detection done thru dvr box setup alerts phones dvr app set locally itll eat ur internet really quickly take phone numbers ur friendlier neighbours purchase fire extinguisher keep somewhere grabbed inside house one floor would suffice light areas around entrance get light switches work inside house u dont need come see going also instead using plastic grill whatever melted goo use metal grille jaali wont burn easily get painted itll rust really quickly",
    "light_cleaned_title": "Someone tried to light our house on fire",
    "light_cleaned_selftext": "So the layout of my house is quite like this— its a two story building with a ground and first floor. There are 3 families living here, 1(My grandpa, mum dad and me), 2(Mama, Mami and my cousin sister) 3(Naani, my mother’s sister and her son). It used to be 3 separate families but they married each other. We own 3 rooms, a kitchen downstairs and a room small enough to just fit a single bed where grandpa sleeps and the main room where rest of us sleep. Mama Mami have 4 rooms upstairs and only Naani Bhai and aunty live downstairs. It was 11.30 and we were all in bed by this time when someone started banging wildly on my aunt’s window screaming that there was a fire. It was our neighbour who had moved in just a couple months ago. My aunt and bhai went out to see our main door up in flames. They put out the fire with water and decided to tell us in the morning. Now the thing is, its clear that it was started deliberately. There’s used matchsticks lined right outside our door. The point of concern is also that our meter box was right by the gate. 10 minutes more of that fire and it would have been a disaster. We don’t have any proof but we’re pretty sure it was the next door neighbours. Our other neighbours came to see it and they were also of the same opinion. “Who else can do it except the ones that roam out at night?” Aka our next door neighbours who are also avid alcoholics might I add. We’ve had small feuds with them for a long time but the most recent one(end of june) was the worst and they’re envious of anyone’s success. Our house was very delapidated(its over a 100 years old) and my mama has a successful job so he put in like 4-5 lakhs to renovate it. We didn’t even have a main door before this. This obviously lit a fire under their arse and they’d pick fights over anything and everything. They’re also unemployed and their daughter works a small job but mostly stays out of home(she doesn’t like her parents either) I’m sorry this was long but what should we do next? Is there any legal action that can be taken against them? I like picked up a match from the front of our house with tongs and kept it in wrapping paper(did I watch too many crime shows?) IS there something that can be done? P.s. before you guys accuse me of karka fishing, I’m going to attach photos.",
    "light_cleaned_comments": "Install a cctv camera File a FIR and mention people of interest to the police. As, other fellow said install cctv. If possible get an insurance, if this happens in the future. I would also recommend you to post it on r/legaladviceindia , they might be able to give you a better course of action. On it Why would your neighbours warn you if they're the ones who started the fire? It was a different neighbour. Damn man that's scary This made me laugh 😂 What's a karka and does it taste good? /s You should lodge a complaint and take photos and stable videos of the evidence take a few backups of that same. Present one to the police keep it for urself too. It's not prudent to accuse ur neighbours without proof even tho u are cent percent sure. I'd say do get multiple cctvs on ur premises and a dvr box, would cost around 10k but imo worth it. Do keep the cameras shielded from outsiders; away from the railing so that they won't get easily grabbed by intruders. Setup motion detection on them too, it's done thru the DVR box. Setup alerts on phones or on the DVR app, set it up locally or it'll eat up ur internet really quickly. Take phone numbers from ur friendlier neighbours. Purchase a fire extinguisher and keep it somewhere it can be grabbed by any1 inside the house. One on each floor would suffice. Light the areas around the entrance or get the light switches to work from inside the house is u don't need to come out to see what is going on. Also instead of using this plastic grill or whatever melted goo that is, use a metal grille or jaali it won't burn down that easily. Get it painted or it'll rust really quickly."
}