{
    "id": "153kqfl",
    "title": "Income Tax filing season - am I alone in asking for efficient Governance?",
    "url": "https://www.reddit.com/r/india/comments/153kqfl/income_tax_filing_season_am_i_alone_in_asking_for/",
    "selftext": "While filing my 2023 IT returns, I realized the boatload of ₹₹ in the past few years.\n\nAll the while, a file of mine is stuck with the local revenue department because I refuse a 'payout' of ₹s \n\n[#myStory in Tweet 🧵](https://twitter.com/PetitionIssue/status/1681515477749862402) - Do review and RT\n\nI am sure I am not alone in asking for efficient Governance?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689741349.0,
    "convurl": "https://external-preview.redd.it/hOfxKWhGnu7mdOyatBb9heX9liimLh3jtc9X8RjQNhQ.jpg?auto=webp&s=924b2e744aa944705900e9eeab1a74add0db18bb",
    "comments": [
        "The only solution is to emigrate. This is not the country to live in with suffocating corruption, communalism, poor civic sense, bad infrastructure, and negative ROI on taxes .",
        "Wish there was an easy way to do that.",
        "Yes, certainly not alone. If there was something we could do, we'd do for sure but there just no easy way to do this.",
        "Caught between the devil and deep-sea!",
        "WTF is this certificate of appreciation? Certificate of being the biggest idiot?"
    ],
    "cleaned_text": "income tax filing season alone asking efficient governance filing returns realized boatload past years file mine stuck local revenue department refuse payout mystory tweet httpstwittercompetitionissuestatus review rt sure alone asking efficient governance ",
    "cleaned_title": "income tax filing season alone asking efficient governance",
    "cleaned_selftext": "filing returns realized boatload past years file mine stuck local revenue department refuse payout mystory tweet httpstwittercompetitionissuestatus review rt sure alone asking efficient governance",
    "cleaned_comments": "solution emigrate country live suffocating corruption communalism poor civic sense bad infrastructure negative roi taxes wish easy way yes certainly alone something could wed sure easy way caught devil deepsea wtf certificate appreciation certificate biggest idiot",
    "light_cleaned_title": "Income Tax filing season - am I alone in asking for efficient Governance?",
    "light_cleaned_selftext": "While filing my 2023 IT returns, I realized the boatload of ₹₹ in the past few years. All the while, a file of mine is stuck with the local revenue department because I refuse a 'payout' of ₹s [#myStory in Tweet 🧵](https://twitter.com/PetitionIssue/status/1681515477749862402) - Do review and RT I am sure I am not alone in asking for efficient Governance?",
    "light_cleaned_comments": "The only solution is to emigrate. This is not the country to live in with suffocating corruption, communalism, poor civic sense, bad infrastructure, and negative ROI on taxes . Wish there was an easy way to do that. Yes, certainly not alone. If there was something we could do, we'd do for sure but there just no easy way to do this. Caught between the devil and deep-sea! WTF is this certificate of appreciation? Certificate of being the biggest idiot?"
}