{
    "id": "17522h1",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/17522h1/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&s=a1c77fa439c6564d49fe03ebbbb17f7912ce8d58",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696987809.0,
    "convurl": "https://b.thumbs.redditmedia.com/m_ShovQiTlZxA9OoTUUQhOcU8YUleyjqaX1Ezeq7SyI.jpg",
    "comments": [
        "Help needed to navigate Indian parental expectations \n\nI’m a 33 yr old woman, from Delhi but living in Mumbai for the past decade. I have been struggling a lot navigating the expectations that my family has from me. One big theme is my proclivity to lie to my mother about my life, as a way to avoid having any conflict ridden conversations. This has been bought up multiple times in family therapy sessions and I decided to change this by being more honest about who I am with her, for instance by wearing the clothes I normally wear or by going out in the nights to meet friends while I live with her temporarily in Delhi. Acc to me these were perfectly acceptable things to do and in my assessment would not have been things she minded. Turns out that she does, she was rather clear about it in subsequent therapy sessions. Now I am rather upset and confused, I see only two options: either I completely become a different person while I’m living with her or I continue to lie and do what I want to do. Any suggestions?",
        "I don't know what kind of therapeutic contract you have with your FT but couldn't you bring this issue in FT sessions? Issues of boundaries need to dealt in session. If she's sophisticated enough to go through therapy then she might understand your perspective."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "help needed navigate indian parental expectations im yr old woman delhi living mumbai past decade struggling lot navigating expectations family one big theme proclivity lie mother life way avoid conflict ridden conversations bought multiple times family therapy sessions decided change honest instance wearing clothes normally wear going nights meet friends live temporarily delhi acc perfectly acceptable things assessment would things minded turns rather clear subsequent therapy sessions rather upset confused see two options either completely become different person im living continue lie want suggestions dont know kind therapeutic contract ft couldnt bring issue ft sessions issues boundaries need dealt session shes sophisticated enough go therapy might understand perspective",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Help needed to navigate Indian parental expectations I’m a 33 yr old woman, from Delhi but living in Mumbai for the past decade. I have been struggling a lot navigating the expectations that my family has from me. One big theme is my proclivity to lie to my mother about my life, as a way to avoid having any conflict ridden conversations. This has been bought up multiple times in family therapy sessions and I decided to change this by being more honest about who I am with her, for instance by wearing the clothes I normally wear or by going out in the nights to meet friends while I live with her temporarily in Delhi. Acc to me these were perfectly acceptable things to do and in my assessment would not have been things she minded. Turns out that she does, she was rather clear about it in subsequent therapy sessions. Now I am rather upset and confused, I see only two options: either I completely become a different person while I’m living with her or I continue to lie and do what I want to do. Any suggestions? I don't know what kind of therapeutic contract you have with your FT but couldn't you bring this issue in FT sessions? Issues of boundaries need to dealt in session. If she's sophisticated enough to go through therapy then she might understand your perspective."
}