{
    "id": "12h9mre",
    "title": "How can one stay safe from diseases which happen out of nowhere?",
    "url": "https://www.reddit.com/r/india/comments/12h9mre/how_can_one_stay_safe_from_diseases_which_happen/",
    "selftext": "I just read the case of thewickedkarma, that guy got Lekemia out of nowhere and raised a funding on various subreddits. Unfortunately he pased away.\n\nSee this:  [http://m-lp.co/ankitkum3](http://m-lp.co/ankitkum3)\n\nI come across many new diseases and rants about them on Reddit. I feel shitscared, how they happen out of nowhere to such healthy people.\n\nPlease educate me.\n\nHow do these diseases happen out of nowhere? And how can one avoid such diseases and stay fit?",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 13,
    "created_utc": 1681108245.0,
    "convurl": "https://external-preview.redd.it/qlnq7x6GJGDsueSdkuO-f0SEWJ0rgShOgMW1VVb79u8.jpg?auto=webp&v=enabled&s=6eebb07216ef46178e86ea11a634f9c45c001800",
    "comments": [
        "Disease don't happen out of nowhere, some may have family history of that disease or he/she is having risk factors attributed to it's development.\n\nSome may have undiagnosed genetic problems which may present later in life, due to less genetic diversity (same caste-caste marriages) India is one of hub of genetic diseases.",
        "Kurzgesagt are best at explaining such things in common terms so go through these videos\nBoost Immunity:\nhttps://youtu.be/M-K7mxdN62M\n\nHow your body works:\nhttps://youtu.be/TYPFenJQciw\n\nImmune system:\nhttps://youtu.be/lXfEK8G8CUI\n\nIf you still have questions maybe you can come back and we can discuss",
        "Doctor here -\n\nEating healthy, avoidance of smoking and alcohol, proper diet, screening for early cancers, vaccines against specific cancers (eg. Cervical) and genetic testing if a family member has a known disorder causing cancer\n\nUnfortunately even with all these changes, you cannot prevent unexpected illness completely. Sometimes life is just unfair and unpredictable. Wicked karma seems like one of those unexpected cases (though I dont know his family history)\n\nUltimately death will come one day or another. It is what you make of the short life you have that will determine your legacy. Cheers\n\nRIP wickedkarma",
        "Get a primary care doctor and see them regularly.\n\nDon’t go to the doctor only when sick.",
        "Regular doctors appointments, be mindful of what your are putting in and on your body. Eat healthy. Don’t just buy cheaper perfumes or skincare products - they have shit tons of harmful chemicals in them which can lead to something serious. Regular exercise.",
        "thanks for a comment as it is coming with a person with the right background.\n\nthere are some cancer tests like PSA are they good. also which other cancer tests need to be done",
        "PSA is for prostate cancer screening. It is really good, but not for you (assuming you are young). Prostate cancer occurs at an older age. A high psa is also not diagnostic of prostate cancer. But a normal psa basically means there is no prostate ca.\n\nRemember that non-cancer illnesses do occur and are much more common. If you are not screening for those, no point screening for cancers either. When was the last time you checked your sugars, BP, cholesterol etc?\n\nIf you really want a cancer screening, just visit any specialist physician who has health check clinics. They do a thorough work-up for cancers as well as non-cancer illnesses. I wont name any such hospitals since I work in this field to avoid conflict of interest. But these clinics can probably be found in any city",
        "> (assuming you are young)\n\ni am 40+ and do comprehensive body checkup once in 3 years",
        "That is great then. You can do blood investigations for colon, pancreas and (if female) ovarian cancer. And ofcourse women need to undergo routine mammography and pap smear for breast and cervical cancers. \n\nYour blood cancers would be mostly (but not completely) covered by a simple cbc. However some blood cancers do not affect cbc early and it is not feasible to do bone marrow analysis without any symptoms.",
        "Info on Vaccine for cervical cancer is really confusing.Can you share a few things about it",
        "Most cases of cervical cancer in women (and penile cancer in men) happen because of a virus called HPV. We have vaccines available that prevents this virus. Go to any general practitioner and you'll get the vaccine. It is worth taking\n\nAbout 1-2 decades ago, cervical cancer used to be the commonest cancer in women. With this vaccine, improved sexual practices, and unfortunately rising rates of breast cancer, now Ca cervix is no longer the commonest",
        "1.wash hands\n2.Wash veggies\n3.Drino boiled water at all times\n4.Mouthwash 2 or 3 times a week\n5.Brush at night \n6.Bath properly\n7.Eat healthy foods\n8.Avoid outside food escpecially juices with ice\n9.eat cooked food ,don't eat anything raw \n10.Eating nutritious food should boost your immunity\n\nHard to escape genetic disease.Need a bit of luck and early diagonosis to scale it down"
    ],
    "cleaned_text": "one stay safe diseases happen nowhere read case thewickedkarma guy got lekemia nowhere raised funding various subreddits unfortunately pased away see httpmlpcoankitkumhttpmlpcoankitkum come across many new diseases rants reddit feel shitscared happen nowhere healthy people please educate diseases happen nowhere one avoid diseases stay fit ",
    "cleaned_title": "one stay safe diseases happen nowhere",
    "cleaned_selftext": "read case thewickedkarma guy got lekemia nowhere raised funding various subreddits unfortunately pased away see httpmlpcoankitkumhttpmlpcoankitkum come across many new diseases rants reddit feel shitscared happen nowhere healthy people please educate diseases happen nowhere one avoid diseases stay fit",
    "cleaned_comments": "disease dont happen nowhere may family history disease heshe risk factors attributed development may undiagnosed genetic problems may present later life due less genetic diversity castecaste marriages india one hub genetic diseases kurzgesagt best explaining things common terms go videos boost immunity body works immune system still questions maybe come back discuss doctor eating healthy avoidance smoking alcohol proper diet screening early cancers vaccines specific cancers eg cervical genetic testing family member known disorder causing cancer unfortunately even changes prevent unexpected illness completely sometimes life unfair unpredictable wicked karma seems like one unexpected cases though dont know family history ultimately death come one day another make short life determine legacy cheers rip wickedkarma get primary care doctor see regularly dont go doctor sick regular doctors appointments mindful putting body eat healthy dont buy cheaper perfumes skincare products shit tons harmful chemicals lead something serious regular exercise thanks comment coming person right background cancer tests like psa good also cancer tests need done psa prostate cancer screening really good assuming young prostate cancer occurs older age high psa also diagnostic prostate cancer normal psa basically means prostate ca remember noncancer illnesses occur much common screening point screening cancers either last time checked sugars bp cholesterol etc really want cancer screening visit specialist physician health check clinics thorough workup cancers well noncancer illnesses wont name hospitals since work field avoid conflict interest clinics probably found city assuming young comprehensive body checkup years great blood investigations colon pancreas female ovarian cancer ofcourse women need undergo routine mammography pap smear breast cervical cancers blood cancers would mostly completely covered simple cbc however blood cancers affect cbc early feasible bone marrow analysis without symptoms info vaccine cervical cancer really confusingcan share things cases cervical cancer women penile cancer men happen virus called hpv vaccines available prevents virus go general practitioner youll get vaccine worth taking decades ago cervical cancer used commonest cancer women vaccine improved sexual practices unfortunately rising rates breast cancer ca cervix longer commonest wash hands wash veggies drino boiled water times mouthwash times week brush night bath properly eat healthy foods avoid outside food escpecially juices ice eat cooked food dont eat anything raw eating nutritious food boost immunity hard escape genetic diseaseneed bit luck early diagonosis scale",
    "light_cleaned_title": "How can one stay safe from diseases which happen out of nowhere?",
    "light_cleaned_selftext": "I just read the case of thewickedkarma, that guy got Lekemia out of nowhere and raised a funding on various subreddits. Unfortunately he pased away. See this: [http://m-lp.co/ankitkum3](http://m-lp.co/ankitkum3) I come across many new diseases and rants about them on Reddit. I feel shitscared, how they happen out of nowhere to such healthy people. Please educate me. How do these diseases happen out of nowhere? And how can one avoid such diseases and stay fit?",
    "light_cleaned_comments": "Disease don't happen out of nowhere, some may have family history of that disease or he/she is having risk factors attributed to it's development. Some may have undiagnosed genetic problems which may present later in life, due to less genetic diversity (same caste-caste marriages) India is one of hub of genetic diseases. Kurzgesagt are best at explaining such things in common terms so go through these videos Boost Immunity: How your body works: Immune system: If you still have questions maybe you can come back and we can discuss Doctor here - Eating healthy, avoidance of smoking and alcohol, proper diet, screening for early cancers, vaccines against specific cancers (eg. Cervical) and genetic testing if a family member has a known disorder causing cancer Unfortunately even with all these changes, you cannot prevent unexpected illness completely. Sometimes life is just unfair and unpredictable. Wicked karma seems like one of those unexpected cases (though I dont know his family history) Ultimately death will come one day or another. It is what you make of the short life you have that will determine your legacy. Cheers RIP wickedkarma Get a primary care doctor and see them regularly. Don’t go to the doctor only when sick. Regular doctors appointments, be mindful of what your are putting in and on your body. Eat healthy. Don’t just buy cheaper perfumes or skincare products - they have shit tons of harmful chemicals in them which can lead to something serious. Regular exercise. thanks for a comment as it is coming with a person with the right background. there are some cancer tests like PSA are they good. also which other cancer tests need to be done PSA is for prostate cancer screening. It is really good, but not for you (assuming you are young). Prostate cancer occurs at an older age. A high psa is also not diagnostic of prostate cancer. But a normal psa basically means there is no prostate ca. Remember that non-cancer illnesses do occur and are much more common. If you are not screening for those, no point screening for cancers either. When was the last time you checked your sugars, BP, cholesterol etc? If you really want a cancer screening, just visit any specialist physician who has health check clinics. They do a thorough work-up for cancers as well as non-cancer illnesses. I wont name any such hospitals since I work in this field to avoid conflict of interest. But these clinics can probably be found in any city > (assuming you are young) i am 40+ and do comprehensive body checkup once in 3 years That is great then. You can do blood investigations for colon, pancreas and (if female) ovarian cancer. And ofcourse women need to undergo routine mammography and pap smear for breast and cervical cancers. Your blood cancers would be mostly (but not completely) covered by a simple cbc. However some blood cancers do not affect cbc early and it is not feasible to do bone marrow analysis without any symptoms. Info on Vaccine for cervical cancer is really confusing.Can you share a few things about it Most cases of cervical cancer in women (and penile cancer in men) happen because of a virus called HPV. We have vaccines available that prevents this virus. Go to any general practitioner and you'll get the vaccine. It is worth taking About 1-2 decades ago, cervical cancer used to be the commonest cancer in women. With this vaccine, improved sexual practices, and unfortunately rising rates of breast cancer, now Ca cervix is no longer the commonest 1.wash hands 2.Wash veggies 3.Drino boiled water at all times 4.Mouthwash 2 or 3 times a week 5.Brush at night 6.Bath properly 7.Eat healthy foods 8.Avoid outside food escpecially juices with ice 9.eat cooked food ,don't eat anything raw 10.Eating nutritious food should boost your immunity Hard to escape genetic disease.Need a bit of luck and early diagonosis to scale it down"
}