{
    "id": "1d1ruyw",
    "title": "Pakistani Mod Enables Racism Against Indians On a third party reddit.",
    "url": "https://www.reddit.com/gallery/1d1ruyw",
    "selftext": "So let me get this straight. Saying 'indians will suck any cock' is not bigotry but saying that Pakistanis calling indians slurs is laughable is somehow racist and bigoted.\n\nI was confused until I learned that the mod is Pakistani. Makes sense. ",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 14,
    "created_utc": 1716817486.0,
    "convurl": "https://i.redd.it/d2i2oult3z2d1.jpg",
    "comments": [
        "One is talking about himself, other is talking about someone else.",
        "Ignore and move on",
        "The response is from me, a Pakistani commenter, so I'm talking about my country as well. And about a genuine problem here too.\n\nIt's double standards coz the mod's a typical Pakistani. Self-reflection for thee but no reflection for me.",
        "It reads like pointing fingers, you could have written it differently.",
        "ah yes an indian saying ' we suck cock' is completely ok but a Pakistani criticizing his own countrymen needs to word shit differently?\n\nit's just the mod being a typical Pakistani. encourage self criticism among others but cry when it happens to you.\n\nwhat makes it worse is that it is an international subreddit",
        "Mate India right now actually has a problem with hating Muslims.The current political party's main agenda has been this. \n\nDo let me know if your current political party's main agenda has been about the pajeets?",
        "Post this on facepalm.",
        "post this on facepalm and share link",
        "Did I just see a pakistani getting downvoted on our own official sub for calling out double standards towards Indians?"
    ],
    "cleaned_text": "pakistani mod enables racism indians third party reddit let get straight saying indians suck cock bigotry saying pakistanis calling indians slurs laughable somehow racist bigoted confused learned mod pakistani makes sense ",
    "cleaned_title": "pakistani mod enables racism indians third party reddit",
    "cleaned_selftext": "let get straight saying indians suck cock bigotry saying pakistanis calling indians slurs laughable somehow racist bigoted confused learned mod pakistani makes sense",
    "cleaned_comments": "one talking talking someone else ignore move response pakistani commenter im talking country well genuine problem double standards coz mods typical pakistani selfreflection thee reflection reads like pointing fingers could written differently ah yes indian saying suck cock completely ok pakistani criticizing countrymen needs word shit differently mod typical pakistani encourage self criticism among others cry happens makes worse international subreddit mate india right actually problem hating muslimsthe current political partys main agenda let know current political partys main agenda pajeets post facepalm post facepalm share link see pakistani getting downvoted official sub calling double standards towards indians",
    "light_cleaned_title": "Pakistani Mod Enables Racism Against Indians On a third party reddit.",
    "light_cleaned_selftext": "So let me get this straight. Saying 'indians will suck any cock' is not bigotry but saying that Pakistanis calling indians slurs is laughable is somehow racist and bigoted. I was confused until I learned that the mod is Pakistani. Makes sense.",
    "light_cleaned_comments": "One is talking about himself, other is talking about someone else. Ignore and move on The response is from me, a Pakistani commenter, so I'm talking about my country as well. And about a genuine problem here too. It's double standards coz the mod's a typical Pakistani. Self-reflection for thee but no reflection for me. It reads like pointing fingers, you could have written it differently. ah yes an indian saying ' we suck cock' is completely ok but a Pakistani criticizing his own countrymen needs to word shit differently? it's just the mod being a typical Pakistani. encourage self criticism among others but cry when it happens to you. what makes it worse is that it is an international subreddit Mate India right now actually has a problem with hating Muslims.The current political party's main agenda has been this. Do let me know if your current political party's main agenda has been about the pajeets? Post this on facepalm. post this on facepalm and share link Did I just see a pakistani getting downvoted on our own official sub for calling out double standards towards Indians?"
}