{
    "id": "1519smh",
    "title": "Myntra fakes",
    "url": "https://www.reddit.com/gallery/1519smh",
    "selftext": "So, I brought a pair of Jeans from Myntra supposedly from Mango brand. They instead sent me Indian Garage Co. branded jeans with Mango paper tags and packing. I didn’t feel the need to check the actual branding and kept them and once I checked them after the return window, I raised multiple complaints, but according to them, the packaging was untempered, so they can’t do much. Can anything be done about this?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689523023.0,
    "convurl": "https://i.redd.it/mow86hadnccb1.jpg",
    "comments": [
        "Learn it as a lesson n next time you order something online ,check it well  before you remove tags",
        "Within the return window, it's easy. But since it's already ended. If you haven't wore them and not removed the tags, you can try calling them again and again, and lash out if they don't accept, as you are mugged here. But don't keep hopes high. Just remember to video record while opening items.",
        "Consumer forum, complaint from there. Company will respond. If you don't like their reply, you can approach consumer court.",
        "Buy any other black jeans from mango brand..raise a complaint regarding return of that product saying you received different product...return 1st pant instead of 2nd one..keep the 2nd one..",
        "This cheapery is exactly how systems that are designed to help people get ruined. They'll stop helping actual victims because people are doing all this. \n\nTwo wrongs do not make a right. OP please don't do this.",
        "If it would have been an Indian Garage Co. jeans, I would have made peace with it. But they have put a Mango logo in it as well and that is intentionally scamming people. Now, I don’t trust any of the clothes bought from Myntra. It feels like this happened to be a 2nd copy and rest were 1st copies.",
        " I got Levi's fake jeans i already raised a complaint let's see what will happen"
    ],
    "cleaned_text": "myntra fakes brought pair jeans myntra supposedly mango brand instead sent indian garage co branded jeans mango paper tags packing didnt feel need check actual branding kept checked return window raised multiple complaints according packaging untempered cant much anything done ",
    "cleaned_title": "myntra fakes",
    "cleaned_selftext": "brought pair jeans myntra supposedly mango brand instead sent indian garage co branded jeans mango paper tags packing didnt feel need check actual branding kept checked return window raised multiple complaints according packaging untempered cant much anything done",
    "cleaned_comments": "learn lesson n next time order something online check well remove tags within return window easy since already ended havent wore removed tags try calling lash dont accept mugged dont keep hopes high remember video record opening items consumer forum complaint company respond dont like reply approach consumer court buy black jeans mango brandraise complaint regarding return product saying received different productreturn st pant instead nd onekeep nd one cheapery exactly systems designed help people get ruined theyll stop helping actual victims people two wrongs make right op please dont would indian garage co jeans would made peace put mango logo well intentionally scamming people dont trust clothes bought myntra feels like happened nd copy rest st copies got levis fake jeans already raised complaint lets see happen",
    "light_cleaned_title": "Myntra fakes",
    "light_cleaned_selftext": "So, I brought a pair of Jeans from Myntra supposedly from Mango brand. They instead sent me Indian Garage Co. branded jeans with Mango paper tags and packing. I didn’t feel the need to check the actual branding and kept them and once I checked them after the return window, I raised multiple complaints, but according to them, the packaging was untempered, so they can’t do much. Can anything be done about this?",
    "light_cleaned_comments": "Learn it as a lesson n next time you order something online ,check it well before you remove tags Within the return window, it's easy. But since it's already ended. If you haven't wore them and not removed the tags, you can try calling them again and again, and lash out if they don't accept, as you are mugged here. But don't keep hopes high. Just remember to video record while opening items. Consumer forum, complaint from there. Company will respond. If you don't like their reply, you can approach consumer court. Buy any other black jeans from mango brand..raise a complaint regarding return of that product saying you received different product...return 1st pant instead of 2nd one..keep the 2nd one.. This cheapery is exactly how systems that are designed to help people get ruined. They'll stop helping actual victims because people are doing all this. Two wrongs do not make a right. OP please don't do this. If it would have been an Indian Garage Co. jeans, I would have made peace with it. But they have put a Mango logo in it as well and that is intentionally scamming people. Now, I don’t trust any of the clothes bought from Myntra. It feels like this happened to be a 2nd copy and rest were 1st copies. I got Levi's fake jeans i already raised a complaint let's see what will happen"
}