{
    "id": "15ishjr",
    "title": "Saw this Omni used for transporting little kids from school in Delhi.",
    "url": "https://www.reddit.com/gallery/15ishjr",
    "selftext": "Wonder how can they prevent kids to not touch the exhaust even by mistake!!",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691232367.0,
    "convurl": "https://i.redd.it/big5oas3u9gb1.jpg",
    "comments": [
        "New fear unlocked",
        "Omni vans were the protagonists in my kidnapping nightmares as a child. With this they have upgraded to my Final Destination nightmares.",
        "But being kidnapped comfortably now? :)",
        "I'd happily rather get kidnapped and not worry about my rent, emi, bills and pending tasks.",
        "Sameeeee",
        "A great upgrade, getting baked in a school bus isn't something I've missed from my school days.",
        "Is it a radiator fan ??",
        "Funny story. One of my friends had an Omni. One day I was coming from tuition when he and a few friends stopped it in front of me and pulled me inside. Apharan had just released so it was fun to pose. \n\nBut one of my colony uncle saw this and told my parents that someone kidnapped me. \n\nI returned home a few hours later only to see a crowd of people standing outside with two policemen taking notes. 😂\n\nI can't explain the hysterical reaction everyone had when they saw me. The policemen scolded my friends and I and told us not to hang around in Omno 😂",
        "Damm!!",
        "Aese friends to mei bhi deserve karta hu",
        "Exactly my thoughts, if this is for school kids. It's disaster waiting to happen.. not just fingers, even long hairs can get sucked...",
        "It’s much safer than the auto which transports about 9-10 people",
        "That's an accurate tag/ flair if there ever was one😭"
    ],
    "cleaned_text": "saw omni used transporting little kids school delhi wonder prevent kids touch exhaust even mistake ",
    "cleaned_title": "saw omni used transporting little kids school delhi",
    "cleaned_selftext": "wonder prevent kids touch exhaust even mistake",
    "cleaned_comments": "new fear unlocked omni vans protagonists kidnapping nightmares child upgraded final destination nightmares kidnapped comfortably id happily rather get kidnapped worry rent emi bills pending tasks sameeeee great upgrade getting baked school bus isnt something ive missed school days radiator fan funny story one friends omni one day coming tuition friends stopped front pulled inside apharan released fun pose one colony uncle saw told parents someone kidnapped returned home hours later see crowd people standing outside two policemen taking notes cant explain hysterical reaction everyone saw policemen scolded friends told us hang around omno damm aese friends mei bhi deserve karta hu exactly thoughts school kids disaster waiting happen fingers even long hairs get sucked much safer auto transports people thats accurate tag flair ever one",
    "light_cleaned_title": "Saw this Omni used for transporting little kids from school in Delhi.",
    "light_cleaned_selftext": "Wonder how can they prevent kids to not touch the exhaust even by mistake!!",
    "light_cleaned_comments": "New fear unlocked Omni vans were the protagonists in my kidnapping nightmares as a child. With this they have upgraded to my Final Destination nightmares. But being kidnapped comfortably now? :) I'd happily rather get kidnapped and not worry about my rent, emi, bills and pending tasks. Sameeeee A great upgrade, getting baked in a school bus isn't something I've missed from my school days. Is it a radiator fan ?? Funny story. One of my friends had an Omni. One day I was coming from tuition when he and a few friends stopped it in front of me and pulled me inside. Apharan had just released so it was fun to pose. But one of my colony uncle saw this and told my parents that someone kidnapped me. I returned home a few hours later only to see a crowd of people standing outside with two policemen taking notes. 😂 I can't explain the hysterical reaction everyone had when they saw me. The policemen scolded my friends and I and told us not to hang around in Omno 😂 Damm!! Aese friends to mei bhi deserve karta hu Exactly my thoughts, if this is for school kids. It's disaster waiting to happen.. not just fingers, even long hairs can get sucked... It’s much safer than the auto which transports about 9-10 people That's an accurate tag/ flair if there ever was one😭"
}