{
    "id": "158537m",
    "title": "Help needed for little puppy",
    "url": "https://www.reddit.com/gallery/158537m",
    "selftext": "\nWe feed and take care of street dogs of our area. One little puppy Zen was run over by some reckless csr driver and as a result she's suffered a fracture and her femur bone has been dislocated. The vet has suggested a corrective surgery. The surgery is going to cost 40,000 and has to be performed immediately. Please help us raise funds for Zen's surgery. I'm happy to ans any questions on the surgery or if u need any further details.\n\nPls contribute whatever amount you can, any help is much appreciated. \nAlso pls share it with maximum people you can\nTogether we can save a puppy from being crippled.\n\nUpi id - abhijeet.gupta.0002@okaxis",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690189260.0,
    "convurl": "https://i.redd.it/0b4j4tpfovdb1.jpg",
    "comments": [],
    "cleaned_text": "help needed little puppy feed take care street dogs area one little puppy zen run reckless csr driver result shes suffered fracture femur bone dislocated vet suggested corrective surgery surgery going cost performed immediately please help us raise funds zens surgery im happy ans questions surgery u need details pls contribute whatever amount help much appreciated also pls share maximum people together save puppy crippled upi id abhijeetguptaokaxis ",
    "cleaned_title": "help needed little puppy",
    "cleaned_selftext": "feed take care street dogs area one little puppy zen run reckless csr driver result shes suffered fracture femur bone dislocated vet suggested corrective surgery surgery going cost performed immediately please help us raise funds zens surgery im happy ans questions surgery u need details pls contribute whatever amount help much appreciated also pls share maximum people together save puppy crippled upi id abhijeetguptaokaxis",
    "cleaned_comments": "",
    "light_cleaned_title": "Help needed for little puppy",
    "light_cleaned_selftext": "We feed and take care of street dogs of our area. One little puppy Zen was run over by some reckless csr driver and as a result she's suffered a fracture and her femur bone has been dislocated. The vet has suggested a corrective surgery. The surgery is going to cost 40,000 and has to be performed immediately. Please help us raise funds for Zen's surgery. I'm happy to ans any questions on the surgery or if u need any further details. Pls contribute whatever amount you can, any help is much appreciated. Also pls share it with maximum people you can Together we can save a puppy from being crippled. Upi id - abhijeet.gupta.0002@okaxis",
    "light_cleaned_comments": ""
}