{
    "id": "1886e7s",
    "title": "Bomb threat to Bangalore schools",
    "url": "https://i.redd.it/bv9x2bmi2n3c1.jpg",
    "selftext": "Most of the schools in Bangalore closed early today  due to bomb threat",
    "flair": "Crime",
    "score": 200,
    "num_comments": 86,
    "created_utc": 1701417082.0,
    "convurl": "https://i.redd.it/bv9x2bmi2n3c1.jpg",
    "comments": [
        "Did they find the bomb?",
        "No. Most likely hoax",
        "Somebody doesn’t want to give their exams probably.",
        "This looks like a hoax nd somebody used Chat gpt clearlt",
        "Jundu Baam, tiger baam...",
        "Topmail was a smart choice",
        "Imagine thinking topmail is gonna save you from cops.😂",
        "Just Sanghi things",
        "No, it's jihadists who use bomb . Sanghis use lathi only.",
        "Why jihadists target children?",
        "Remember malala?",
        "Why snake bites? why dog barks? why jackal vicious?",
        "Chat gpt won't generate this though, probably a teenager who knew how to generate panic",
        "He should have use protonmail, poor guy is now gonna get caught",
        "this has definite chaddi energy",
        "Like how tough is it to get to know which email is the safest, he could have gotten away easily with ten more minutes of research",
        "This is a hoax for sure. Just hoping that police are able to trace them and strict action is taken against them.",
        "Even protonmail is required to reveal your ip address if law enforcement asks for it.",
        "Didnt know that but I know if you use enough precautions it is very tough to track a person from email, if I remember properly even the FBI couldn't find a black web drug trafficker until he revealed his identity by mistake.",
        "Threat source rss office",
        "Bro this is most definitely not a muslim writing it. It could be anyone using islam as bait considering the state of the country. COME ON.",
        "First give away is the email id, second give away is using Bismillah instead of inshallah",
        "I'm pretty sure this is a hoax and we'll find some right wing Hindu dude who wanted to get out of exams or something. This reads like a stereotype in the worst way",
        "Yes. If enough precautions are taken it will be difficult. Let's hope these idiots are not that prudent and have left some trail to be traced back to them.",
        "They had a hard time forcing twitter to certain account. Pulling this one off would be tough.\n\nIt's not the technical trail I'm worried. Whoever done it, could brag to his friends about it",
        "Cant they just get chat GPT to write a coherent threat atleast.",
        "Agree, then how is this a Hindu thing?",
        "Exam se bachne ki ninja technique",
        "Dekh kaar to lgta hai pissfull comunity ka kaam hai",
        "It will if you trick it.",
        "Very likely",
        "Agree, it could be anyone.\n\nBut the above comment blamed sanghis right at front.",
        "2 minutes tops",
        "Looks like someone hasn't received their free subsidies for today. 🤡",
        "Just did one simple mistake.  \nIn this context the mailer wrote Bismillah instead of Inshallah. Maybe he searched the direct meanings of this word and in English translation , Bismillah does look better but is completely wrong in this context.",
        "That's a real plausible explanation, but this is most likely some kid trying to get his exam postponed.",
        "Sure. \n\nNo need to say jihadists come with bombs tho if you wanna support the sanghis?? \n\nYoure promoting Islamophobia atp.",
        "is raspberry pi useful in this situation?",
        "Which one is asking for a friend",
        "allu arjun",
        "That is not how Bismillah is used in a sentence. That's how i know it's fake. True jihadi would not make this rookie error.",
        "It used to a long time ago, it's essentially vegetative when it comes to this now.",
        "Protonmail with a vpn",
        "Complete bs looks like a prank.",
        "Happened today at my old school. They evacuated the students and sent them home at like 11:30, it was exam day for a lot of them.",
        "It's still possible but way harder. For example, ask it a question in a language that it isn't that good at and you have a good chance of getting the result. Takes quite the effort and a lot of trial and error nevertheless.",
        "Probably to leave behind the hard evidence",
        "It looks nothing like chatgpt",
        "But why? If I take the literal translation in English it kinda makes sense if you use Bismillah",
        "Not how it's used though. The correct term would be Inshallah",
        "tutanota with vpn",
        "What kind of bomber warns of the attack first? Kya terrorist banega re tu? /s",
        "Pragya thakur says hi",
        "bismillah is used before starting anything. For eg, before starting to eat, you could say bismillah.\n\nInshallah is used when you plan to do something. For eg, if you plan to eat tomorrow, you could say InShaAllah I will eat tomorrow.",
        "Some activist in France or some European country had their information disclosed by protonmail when authorities asked him for it. \n\nTutanota is the best option along with a no logs VPN something like Mullvad.",
        "If it's in future tense then you use inshallah not Bismillah",
        "Fake as fck",
        "This is a cheap a\\*\\* school, even their microsoft office is not genuine. \n\n&#x200B;\n\nThis is some kid trying to get away from homework / exams\n\n&#x200B;\n\nI'm sure this was not even written by a Muslim. \n\nRead carefully and it is clear why.",
        "And do you have to provide any infor to create account?",
        "Exactly my thought , the guy who made this up clearly doesn’t mean business and I suspect he’s a Muslim in first place.",
        "Use a VPN and then go to telegram there is a bot that will give you a temporary email it will be deleted within 3hrs the name of the bot is temp mail bot pletty useful and you don't have to put any details so not traceable.",
        "Dude my list won't end. But since we are not arguing let's just say wrong is wrong.",
        "Exam day hu! Explains lot of things.",
        "It's clearly a fake email.",
        "Congratulations you are now probably on some list.",
        "https://scroll.in/article/1059500/why-people-are-pretending-to-be-muslim-in-india\n\n\nLines up with this",
        "https://scroll.in/article/1059500/why-people-are-pretending-to-be-muslim-in-india \n\nProbably another person pretending to be Muslim",
        "Bro we you don’t know for sure right?then why coming to conclusions?maybe a kid did it just to get a holiday,even if a terrorist planned to attack he might go for a public spots like train stations,bus etc",
        "Yaa exactly the email has Allah name and hindu guy did it well ya cause u all can't accept the fact that uneducated, terrorist people is what makes most muslim population",
        "The use of the email address \"kharijites\" is a giveaway it is fake as kharijites are those who had left the manifold of islam. So it is a derogatory term. So, calling themselves kharijites is like making fun of themselves",
        "Doesn’t telegram require a mobile number?",
        "Just FYI if you actually plant a bomb, no proton mail or VPN will be able to save you.",
        "Probably some kid from the school",
        "Attempt sahi hai par threatening ka tarika thoda kasual hai. 🤣",
        "Inshallah can be translated as - If god wills it or If I'm lucky or I really hope or I wish.\n\nSide note - In Spanish, there is a word Ohala, which has the same meaning as Inshallah, and they use it all the time in Spain, despite none of the people using it being Muslims or even religious.\n\nI used to do a double take every time I would hear it. I can't make myself say it though.",
        "Asking for a friend ?",
        "You're probably right about this person falsely claiming to be Muslim but I think using this article here is disingenuous.\n\nI want to be careful here because I'm not trying to blame a community but many people have seen the time between 2003-2011 when Islamic terrorism (supported by Pakistan) was a genuine threat, and bomb blasts used to occur quite frequently. In such an environment, it leads more credence to their fake threats if they pretend to be Muslim. \n\nAll stereotypes are based on some reality, and I'm not saying that's necessarily a good thing, but the article kind of just ignores this fact.",
        "No maan 🤣 Im into this stuuf ETHICALLY , just started learning how networking works and implemented",
        "Brave of you think i have used original identity to create this account. It's on VPN and in a sanbox to avoid targetted advertisement. Still who cares",
        "Signal par dhudna padega. Discord par hai kya koi esa boy"
    ],
    "cleaned_text": "bomb threat bangalore schools schools bangalore closed early today due bomb threat ",
    "cleaned_title": "bomb threat bangalore schools",
    "cleaned_selftext": "schools bangalore closed early today due bomb threat",
    "cleaned_comments": "find bomb likely hoax somebody doesnt want give exams probably looks like hoax nd somebody used chat gpt clearlt jundu baam tiger baam topmail smart choice imagine thinking topmail gon na save cops sanghi things jihadists use bomb sanghis use lathi jihadists target children remember malala snake bites dog barks jackal vicious chat gpt wont generate though probably teenager knew generate panic use protonmail poor guy gon na get caught definite chaddi energy like tough get know email safest could gotten away easily ten minutes research hoax sure hoping police able trace strict action taken even protonmail required reveal ip address law enforcement asks didnt know know use enough precautions tough track person email remember properly even fbi couldnt find black web drug trafficker revealed identity mistake threat source rss office bro definitely muslim writing could anyone using islam bait considering state country come first give away email id second give away using bismillah instead inshallah im pretty sure hoax well find right wing hindu dude wanted get exams something reads like stereotype worst way yes enough precautions taken difficult lets hope idiots prudent left trail traced back hard time forcing twitter certain account pulling one would tough technical trail im worried whoever done could brag friends cant get chat gpt write coherent threat atleast agree hindu thing exam se bachne ki ninja technique dekh kaar lgta hai pissfull comunity ka kaam hai trick likely agree could anyone comment blamed sanghis right front minutes tops looks like someone hasnt received free subsidies today one simple mistake context mailer wrote bismillah instead inshallah maybe searched direct meanings word english translation bismillah look better completely wrong context thats real plausible explanation likely kid trying get exam postponed sure need say jihadists come bombs tho wan na support sanghis youre promoting islamophobia atp raspberry pi useful situation one asking friend allu arjun bismillah used sentence thats know fake true jihadi would make rookie error used long time ago essentially vegetative comes protonmail vpn complete bs looks like prank happened today old school evacuated students sent home like exam day lot still possible way harder example ask question language isnt good good chance getting result takes quite effort lot trial error nevertheless probably leave behind hard evidence looks nothing like chatgpt take literal translation english kinda makes sense use bismillah used though correct term would inshallah tutanota vpn kind bomber warns attack first kya terrorist banega tu pragya thakur says hi bismillah used starting anything eg starting eat could say bismillah inshallah used plan something eg plan eat tomorrow could say inshaallah eat tomorrow activist france european country information disclosed protonmail authorities asked tutanota best option along logs vpn something like mullvad future tense use inshallah bismillah fake fck cheap school even microsoft office genuine xb kid trying get away homework exams xb im sure even written muslim read carefully clear provide infor create account exactly thought guy made clearly doesnt mean business suspect hes muslim first place use vpn go telegram bot give temporary email deleted within hrs name bot temp mail bot pletty useful dont put details traceable dude list wont end since arguing lets say wrong wrong exam day hu explains lot things clearly fake email congratulations probably list lines probably another person pretending muslim bro dont know sure rightthen coming conclusionsmaybe kid get holidayeven terrorist planned attack might go public spots like train stationsbus etc yaa exactly email allah name hindu guy well ya cause u cant accept fact uneducated terrorist people makes muslim population use email address kharijites giveaway fake kharijites left manifold islam derogatory term calling kharijites like making fun doesnt telegram require mobile number fyi actually plant bomb proton mail vpn able save probably kid school attempt sahi hai par threatening ka tarika thoda kasual hai inshallah translated god wills im lucky really hope wish side note spanish word ohala meaning inshallah use time spain despite none people using muslims even religious used double take every time would hear cant make say though asking friend youre probably right person falsely claiming muslim think using article disingenuous want careful im trying blame community many people seen time islamic terrorism supported pakistan genuine threat bomb blasts used occur quite frequently environment leads credence fake threats pretend muslim stereotypes based reality im saying thats necessarily good thing article kind ignores fact maan im stuuf ethically started learning networking works implemented brave think used original identity create account vpn sanbox avoid targetted advertisement still cares signal par dhudna padega discord par hai kya koi esa boy",
    "light_cleaned_title": "Bomb threat to Bangalore schools",
    "light_cleaned_selftext": "Most of the schools in Bangalore closed early today due to bomb threat",
    "light_cleaned_comments": "Did they find the bomb? No. Most likely hoax Somebody doesn’t want to give their exams probably. This looks like a hoax nd somebody used Chat gpt clearlt Jundu Baam, tiger baam... Topmail was a smart choice Imagine thinking topmail is gonna save you from cops.😂 Just Sanghi things No, it's jihadists who use bomb . Sanghis use lathi only. Why jihadists target children? Remember malala? Why snake bites? why dog barks? why jackal vicious? Chat gpt won't generate this though, probably a teenager who knew how to generate panic He should have use protonmail, poor guy is now gonna get caught this has definite chaddi energy Like how tough is it to get to know which email is the safest, he could have gotten away easily with ten more minutes of research This is a hoax for sure. Just hoping that police are able to trace them and strict action is taken against them. Even protonmail is required to reveal your ip address if law enforcement asks for it. Didnt know that but I know if you use enough precautions it is very tough to track a person from email, if I remember properly even the FBI couldn't find a black web drug trafficker until he revealed his identity by mistake. Threat source rss office Bro this is most definitely not a muslim writing it. It could be anyone using islam as bait considering the state of the country. COME ON. First give away is the email id, second give away is using Bismillah instead of inshallah I'm pretty sure this is a hoax and we'll find some right wing Hindu dude who wanted to get out of exams or something. This reads like a stereotype in the worst way Yes. If enough precautions are taken it will be difficult. Let's hope these idiots are not that prudent and have left some trail to be traced back to them. They had a hard time forcing twitter to certain account. Pulling this one off would be tough. It's not the technical trail I'm worried. Whoever done it, could brag to his friends about it Cant they just get chat GPT to write a coherent threat atleast. Agree, then how is this a Hindu thing? Exam se bachne ki ninja technique Dekh kaar to lgta hai pissfull comunity ka kaam hai It will if you trick it. Very likely Agree, it could be anyone. But the above comment blamed sanghis right at front. 2 minutes tops Looks like someone hasn't received their free subsidies for today. 🤡 Just did one simple mistake. In this context the mailer wrote Bismillah instead of Inshallah. Maybe he searched the direct meanings of this word and in English translation , Bismillah does look better but is completely wrong in this context. That's a real plausible explanation, but this is most likely some kid trying to get his exam postponed. Sure. No need to say jihadists come with bombs tho if you wanna support the sanghis?? Youre promoting Islamophobia atp. is raspberry pi useful in this situation? Which one is asking for a friend allu arjun That is not how Bismillah is used in a sentence. That's how i know it's fake. True jihadi would not make this rookie error. It used to a long time ago, it's essentially vegetative when it comes to this now. Protonmail with a vpn Complete bs looks like a prank. Happened today at my old school. They evacuated the students and sent them home at like 11:30, it was exam day for a lot of them. It's still possible but way harder. For example, ask it a question in a language that it isn't that good at and you have a good chance of getting the result. Takes quite the effort and a lot of trial and error nevertheless. Probably to leave behind the hard evidence It looks nothing like chatgpt But why? If I take the literal translation in English it kinda makes sense if you use Bismillah Not how it's used though. The correct term would be Inshallah tutanota with vpn What kind of bomber warns of the attack first? Kya terrorist banega re tu? /s Pragya thakur says hi bismillah is used before starting anything. For eg, before starting to eat, you could say bismillah. Inshallah is used when you plan to do something. For eg, if you plan to eat tomorrow, you could say InShaAllah I will eat tomorrow. Some activist in France or some European country had their information disclosed by protonmail when authorities asked him for it. Tutanota is the best option along with a no logs VPN something like Mullvad. If it's in future tense then you use inshallah not Bismillah Fake as fck This is a cheap a\\*\\* school, even their microsoft office is not genuine. &#x200B; This is some kid trying to get away from homework / exams &#x200B; I'm sure this was not even written by a Muslim. Read carefully and it is clear why. And do you have to provide any infor to create account? Exactly my thought , the guy who made this up clearly doesn’t mean business and I suspect he’s a Muslim in first place. Use a VPN and then go to telegram there is a bot that will give you a temporary email it will be deleted within 3hrs the name of the bot is temp mail bot pletty useful and you don't have to put any details so not traceable. Dude my list won't end. But since we are not arguing let's just say wrong is wrong. Exam day hu! Explains lot of things. It's clearly a fake email. Congratulations you are now probably on some list. Lines up with this Probably another person pretending to be Muslim Bro we you don’t know for sure right?then why coming to conclusions?maybe a kid did it just to get a holiday,even if a terrorist planned to attack he might go for a public spots like train stations,bus etc Yaa exactly the email has Allah name and hindu guy did it well ya cause u all can't accept the fact that uneducated, terrorist people is what makes most muslim population The use of the email address \"kharijites\" is a giveaway it is fake as kharijites are those who had left the manifold of islam. So it is a derogatory term. So, calling themselves kharijites is like making fun of themselves Doesn’t telegram require a mobile number? Just FYI if you actually plant a bomb, no proton mail or VPN will be able to save you. Probably some kid from the school Attempt sahi hai par threatening ka tarika thoda kasual hai. 🤣 Inshallah can be translated as - If god wills it or If I'm lucky or I really hope or I wish. Side note - In Spanish, there is a word Ohala, which has the same meaning as Inshallah, and they use it all the time in Spain, despite none of the people using it being Muslims or even religious. I used to do a double take every time I would hear it. I can't make myself say it though. Asking for a friend ? You're probably right about this person falsely claiming to be Muslim but I think using this article here is disingenuous. I want to be careful here because I'm not trying to blame a community but many people have seen the time between 2003-2011 when Islamic terrorism (supported by Pakistan) was a genuine threat, and bomb blasts used to occur quite frequently. In such an environment, it leads more credence to their fake threats if they pretend to be Muslim. All stereotypes are based on some reality, and I'm not saying that's necessarily a good thing, but the article kind of just ignores this fact. No maan 🤣 Im into this stuuf ETHICALLY , just started learning how networking works and implemented Brave of you think i have used original identity to create this account. It's on VPN and in a sanbox to avoid targetted advertisement. Still who cares Signal par dhudna padega. Discord par hai kya koi esa boy"
}