{
    "id": "17dg0x9",
    "title": "The \"Stone Man\" - India's unresolved serial killer case.",
    "url": "https://www.reddit.com/r/india/comments/17dg0x9/the_stone_man_indias_unresolved_serial_killer_case/",
    "selftext": " Hey everyone! 👋\n\nWhile doing some research on historical crime figures in India, I stumbled upon a fascinating (and chilling) case about the ever-mysterious [\"Stone Man\"](https://youtu.be/3XTDdGEIv5M).\n\n\"The Stoneman\" is responsible for a series of murders spanning several cities and decades - Mumbai in the 1980s, Calcutta in 1989, Guwahati in 2009, and parts of Assam in 2016. The victims, often homeless and vulnerable, were found with their skulls smashed, presumably with a stone, earning the murderer the moniker \"Stoneman.\" The identity of this killer remains shrouded in mystery to this day.\n\nDo you have any theories or insights about this case?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697932297.0,
    "convurl": "https://external-preview.redd.it/gh39dH7YNKR1zxXu1oiyC9xLPyY-B5dyhL0UjycqTis.jpg?auto=webp&s=6a47ba59abed6bf9198da469dfb284818782f6eb",
    "comments": [
        "Most likely copycats and not a single killer."
    ],
    "cleaned_text": "stone man indias unresolved serial killer case hey everyone research historical crime figures india stumbled upon fascinating chilling case evermysterious stone manhttpsyoutubextddgeivm stoneman responsible series murders spanning several cities decades mumbai calcutta guwahati parts assam victims often homeless vulnerable found skulls smashed presumably stone earning murderer moniker stoneman identity killer remains shrouded mystery day theories insights case ",
    "cleaned_title": "stone man indias unresolved serial killer case",
    "cleaned_selftext": "hey everyone research historical crime figures india stumbled upon fascinating chilling case evermysterious stone manhttpsyoutubextddgeivm stoneman responsible series murders spanning several cities decades mumbai calcutta guwahati parts assam victims often homeless vulnerable found skulls smashed presumably stone earning murderer moniker stoneman identity killer remains shrouded mystery day theories insights case",
    "cleaned_comments": "likely copycats single killer",
    "light_cleaned_title": "The \"Stone Man\" - India's unresolved serial killer case.",
    "light_cleaned_selftext": "Hey everyone! 👋 While doing some research on historical crime figures in India, I stumbled upon a fascinating (and chilling) case about the ever-mysterious [\"Stone Man\"](https://youtu.be/3XTDdGEIv5M). \"The Stoneman\" is responsible for a series of murders spanning several cities and decades - Mumbai in the 1980s, Calcutta in 1989, Guwahati in 2009, and parts of Assam in 2016. The victims, often homeless and vulnerable, were found with their skulls smashed, presumably with a stone, earning the murderer the moniker \"Stoneman.\" The identity of this killer remains shrouded in mystery to this day. Do you have any theories or insights about this case?",
    "light_cleaned_comments": "Most likely copycats and not a single killer."
}