{
    "id": "173ki04",
    "title": "Irena Akbar tries to justify Hamas' parading the woman!",
    "url": "https://i.redd.it/pfbkghoz94tb1.jpg",
    "selftext": "\nThis is shameful coming from a woman journalist. What's wrong with our media? Keeping the morals about who's good and who's bad aside, no woman deserves to be raped and paraded that way. Watching the video made my blood boil. And then I see a journalist trying to whitewash it because, meh, religion! This is beyond f*cked up!\n\nTweet link: https://twitter.com/irenaakbar/status/1710889174851854509?t=HVlpOBS-dPSF8hh_pvC1oA&s=19",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696831084.0,
    "convurl": "https://i.redd.it/pfbkghoz94tb1.jpg",
    "comments": [
        "Despicable mindset! Actually beyond despicable.\n\nAnd these are the “moderate”s?",
        "That's a lot of mental gymnastics by her.",
        "Who is this person? \n\nWhy is their view on war between 2 countries relevant to r/india?",
        "She was a journalist for Indian express.",
        "She's an Indian journo m Just like how we point out the hypocrisy of godi media, we also need to do for the other side :)",
        "Utterly disgusting",
        "> She's an Indian journo\n\nNow working for which news-media?",
        "Indian Express",
        "Moderate and Liberal Hindus don't mince words about Hindu extremists.\n\nNut why moderate/liberal muslims always apologetic and defensive of muslim terrorists?",
        "Cognitive dissonance peaking.",
        "*Former , but it raises questions what sort of influence she might have when she was in the media house.",
        "Who said shes a moderate? I had literally never heard of her before I saw bunch of Hindu's burst their nerve over this.",
        "\"I didn't see Egypt. It doesn't exist\"",
        "I am not saying she does not exist. Only asking for proof that she is representative of people other than her in any way?\n\nIts not like she is a terrorist accused as an MP of a ruling party or anything, is it?",
        "Yikes",
        "Is Arnab a representative of people? Sudhir Chaudhary? We bash them week-in week-out don't we?",
        "She completely ignored how Shani's dead body was paraded by the terrorists. The fucking audacity of this regressive fuckwit.",
        "> And these are the “moderate”s?\n\nNope. These people are not moderates. They are conservative rightwingers who only ally with moderates because conservative rightwingers from another religion are targeting them.",
        "Scared of getting beheaded",
        "Moderate and liberal hindu are also apologetic and defensive of M terrorists",
        "Lady you can fuck right off.",
        "She actually is a former reporter of Indian Express. That makes her a big fucking deal imo. Cause IE and the Hindu are said to be top unbiased Indian newspapers. Hence, them appointing people like her is a disgrace. \n\nAlso to add, she is totally anti-dalit. And wrote that dalits were raping muslim women and hence deserve to be dead or smthn.",
        "How does any of this make her a representative of moderate Muslims or liberals? And hence paint all of them as supporters of Hamas though?",
        "Not in India or the West they won't",
        "Address: Suite #304, Ashoka Apartments, 5 Way Lane, Jopling Road, Hazratganj,  Lucknow-226001, India +91-9810560252 u/irenaakbar Everyone Go buy art from her. She deserves all the attention for her logical explanation. All the very best u/irenaakbar"
    ],
    "cleaned_text": "irena akbar tries justify hamas parading woman shameful coming woman journalist whats wrong media keeping morals whos good whos bad aside woman deserves raped paraded way watching video made blood boil see journalist trying whitewash meh religion beyond fcked tweet link ",
    "cleaned_title": "irena akbar tries justify hamas parading woman",
    "cleaned_selftext": "shameful coming woman journalist whats wrong media keeping morals whos good whos bad aside woman deserves raped paraded way watching video made blood boil see journalist trying whitewash meh religion beyond fcked tweet link",
    "cleaned_comments": "despicable mindset actually beyond despicable moderates thats lot mental gymnastics person view war countries relevant rindia journalist indian express shes indian journo like point hypocrisy godi media also need side utterly disgusting shes indian journo working newsmedia indian express moderate liberal hindus dont mince words hindu extremists nut moderateliberal muslims always apologetic defensive muslim terrorists cognitive dissonance peaking former raises questions sort influence might media house said shes moderate literally never heard saw bunch hindus burst nerve didnt see egypt doesnt exist saying exist asking proof representative people way like terrorist accused mp ruling party anything yikes arnab representative people sudhir chaudhary bash weekin weekout dont completely ignored shanis dead body paraded terrorists fucking audacity regressive fuckwit moderates nope people moderates conservative rightwingers ally moderates conservative rightwingers another religion targeting scared getting beheaded moderate liberal hindu also apologetic defensive terrorists lady fuck right actually former reporter indian express makes big fucking deal imo cause ie hindu said top unbiased indian newspapers hence appointing people like disgrace also add totally antidalit wrote dalits raping muslim women hence deserve dead smthn make representative moderate muslims liberals hence paint supporters hamas though india west wont address suite ashoka apartments way lane jopling road hazratganj lucknow india uirenaakbar everyone go buy art deserves attention logical explanation best uirenaakbar",
    "light_cleaned_title": "Irena Akbar tries to justify Hamas' parading the woman!",
    "light_cleaned_selftext": "This is shameful coming from a woman journalist. What's wrong with our media? Keeping the morals about who's good and who's bad aside, no woman deserves to be raped and paraded that way. Watching the video made my blood boil. And then I see a journalist trying to whitewash it because, meh, religion! This is beyond f*cked up! Tweet link:",
    "light_cleaned_comments": "Despicable mindset! Actually beyond despicable. And these are the “moderate”s? That's a lot of mental gymnastics by her. Who is this person? Why is their view on war between 2 countries relevant to r/india? She was a journalist for Indian express. She's an Indian journo m Just like how we point out the hypocrisy of godi media, we also need to do for the other side :) Utterly disgusting > She's an Indian journo Now working for which news-media? Indian Express Moderate and Liberal Hindus don't mince words about Hindu extremists. Nut why moderate/liberal muslims always apologetic and defensive of muslim terrorists? Cognitive dissonance peaking. *Former , but it raises questions what sort of influence she might have when she was in the media house. Who said shes a moderate? I had literally never heard of her before I saw bunch of Hindu's burst their nerve over this. \"I didn't see Egypt. It doesn't exist\" I am not saying she does not exist. Only asking for proof that she is representative of people other than her in any way? Its not like she is a terrorist accused as an MP of a ruling party or anything, is it? Yikes Is Arnab a representative of people? Sudhir Chaudhary? We bash them week-in week-out don't we? She completely ignored how Shani's dead body was paraded by the terrorists. The fucking audacity of this regressive fuckwit. > And these are the “moderate”s? Nope. These people are not moderates. They are conservative rightwingers who only ally with moderates because conservative rightwingers from another religion are targeting them. Scared of getting beheaded Moderate and liberal hindu are also apologetic and defensive of M terrorists Lady you can fuck right off. She actually is a former reporter of Indian Express. That makes her a big fucking deal imo. Cause IE and the Hindu are said to be top unbiased Indian newspapers. Hence, them appointing people like her is a disgrace. Also to add, she is totally anti-dalit. And wrote that dalits were raping muslim women and hence deserve to be dead or smthn. How does any of this make her a representative of moderate Muslims or liberals? And hence paint all of them as supporters of Hamas though? Not in India or the West they won't Address: Suite #304, Ashoka Apartments, 5 Way Lane, Jopling Road, Hazratganj, Lucknow-226001, India +91-9810560252 u/irenaakbar Everyone Go buy art from her. She deserves all the attention for her logical explanation. All the very best u/irenaakbar"
}