{
    "id": "12k9bqh",
    "title": "Why free IPL on Jio vs paid on Disney? Airtel seeks Trai intervention",
    "url": "https://www.business-standard.com/companies/news/why-free-ipl-on-jio-vs-paid-on-dysney-airtel-seeks-trai-intervention-123041100329_1.html",
    "selftext": "Instead of focusing on their service and better consumer offers airtel went for this. Public should teach a lesson to them.",
    "flair": "Rant / Vent",
    "score": 65,
    "num_comments": 37,
    "created_utc": 1681354253.0,
    "convurl": "https://external-preview.redd.it/yVro0NdKqNtYRBZS_CwFXM_deY5RGlA8vdb4Y-_GE54.jpg?auto=webp&v=enabled&s=14c0442bc126a3fbc3fec53583ef4cfedef95cc7",
    "comments": [
        "It is a valid question",
        "So next year people will pay more for this. This year they provide free unlimited 5G till 31st December 2023. I'm using Jio 5G, speed is awesome. I'm used to 5G. Next year I will pay extra for 5G.",
        "> better consumer offers\n\nWhat is with this offers nonsense that every purchase must have some offer? End of the day a product costs what it costs and we need to pay if we want the product. A business can't magically give offers out of thin air. If they are giving offer some where, they are taking some where else. Why are people so obsessed with seeing that make-believe 75% off, 100% off and what not.",
        "Why is everything free from Jio ? Its killing any competition to create a monopoly. This is legit problem.",
        "Yeah. Long long ago jio  was free and they said it will. Always give cheap offers. But now my lifetime validity is gone. I don't believe them",
        "I think they just want to shutdown hotstar and it's service and they just need more traffic as compared to previous year so they can earn more by advertising the products becoz most of the revenue of ipl came from advertisement",
        "I think Jio is doing good. Calling it idiot doesn't do justice to the service",
        "A valid case. Its a monopolistic move by Jio.",
        "PREDATORY PRICING.",
        "How did I offend you? Learn how to discuss before calling someone idiot",
        "they do give cheap offers\n\n3G used to cost like 299 per GB before Jio revolutionised the telecom industry  \nwhat we have now isnt free but its still 100 times preferable to what it was before Jio",
        "> same content must be available across all platforms at same price and there should be pricing parity irrespective of technology\n\nWouldn’t this lead to price cartels?",
        "And speed will be 4mbps.\n\nCurrently Jio 5G is super fast is because there is no load. People who even have 5g smartphones aren't using 5G because you have to go and activate 5G from Jio's website.",
        "5G can support way more devices than 4G. That is one of its selling points.",
        "How? The backbone is still the same, a 20-40Gbps line for a single tower. I don't how they are going to support more than 500 users per tower with >200mbps.\n\nThe math doesn't compute.",
        "Who is using 200 mbps 24x7. Backbones can be upgraded.",
        "Na, not really. For that they would need to change the entire underground laid cable network which isn't going to be possible and it's not really worth it.\n\nMy point is nobody asked for 5G, it doesn't have any of the advantages that were touted as its main selling features. Like low latency, still getting upwards of 30ms latency. \n\nThey are just repacking actual 4g speeds which is supposed to be upwards of 100mbps, with a new fancy name called 5G when there is really no advantage.\n\nYou can't go against the laws of physics.",
        "people sayin back then data 1gb was 250, back then i could just use my sim for otp and incoming on a 20rs recharge for 6 months or even 1 year. Now i need to minimum recharge of 99 on vodafone or 155 on airtel. no lower tier available.",
        "Airtel is arguing from a DTH perspective,  and essentially they want regulation to have similar pricing on OTT as on DTH. Obviously DTH companies are losing subscribers to OTT platforms and this seems to be an effort to introduce regulations to counter that.  \nIf they want the same service to be priced the same irrespective of the medium used, then what's the point of selling broadcast rights and digital rights separately? For once, I'm actually siding with Jio here. They won the digital rights and now its their prerogative if they want to give away IPL streaming free of cost or charge an exorbitant sum of money.   \n\n\nHad Jio used this to push JioFiber or downgraded the streaming experience for other ISPs, then it would have been a concern, but right now I don't think they're doing anything wrong when it comes to IPL.",
        "Try bsnl/mtnl",
        "This statement has no logic. For 5G support you need dedicated 5G modem. How does it support way more devices than 4G?",
        ";-;\n\nIt's called connection density. 4G can support 0.1 Million devices per square km, while 5G can support 1 Million devices. 6G can support 10 Million.",
        "I can't vouch for speed, but much of the underground cable is optical, which supports the broadband framework. Copper cabling cannot give you the 1Gbps speed. Also the backend of Jio is not the same as 4G. It is offering a 5G SA architecture.\n\nAgain I am not claiming anything regarding speed of 5G in future as it depends much more on population density, than the speed supported by backend network. This is what gives the less populous countries, EU/US, in having higher speed too.",
        "This is probably a way to gain more subscribers and increase the prices next year. I don't mind Airtel doing the same.",
        "How to activate it on the website",
        "I didn't activate anything on its website. I still have 5g.",
        "From what I understand, since Jio didn't participate in 2g/3g spectrum bidding. Hence, they have a larger money pool than their peers.  \nIt is a private company and giving free stuff is all part of their marketing scheme to onboard more user base. It's same with how you see new startups offering lucrative deals to onboard new users. \n\n\nI feel, By another 2-3 years, jio might release their AR/VR experience headsets, and maybe first day first show movie releases right on your TV. Exciting time for Indian consumers, fortunately/unfortunately competitors have to keep up with them or they would perish.",
        "The amount of data is the same. People are not running 1 Gbps throughout the day. The faster you use it, the lesser you leech the network.",
        "I was talking about concurrency, nobody understood that for some reason. \n\nHow would giving higher speeds resolve concurrency issues which occurs because of the bandwidth available which is the same old same old?\n\nIf things have changed with 5G, I would love to learn some more of anyone can link to some research papers.",
        "very poor network/ almost non  existent customer support. , my landline is not working from over year mtnl just dont give a fuck.",
        "Yes, that's because another guy paying ₹480 to subsidize you total arpu of you and that guy will be (480+20)/2=250. So the telecom operators still get a profit even you recharge for ₹20. Currently it is not possible because of unlimited call packs. Only way to get ₹20 recharge back if half of the India's population agrees to subsidize other half",
        "tell that to people using phone for calls",
        "I mean you can still buy 2g sims Jio isn't stopping you from doing it\n\nand regardless I can now talk for hours on phone straight without any worries now whereas back in the day I'd be counting minutes because I may run out of talk time or some shit so phone calling is cheaper for me too",
        "I mean you have to recharge monthly that was not the case before for many feature phone users",
        "The existing underground cables have far more capacity - in the order of PBs per second. The limiting factor is all in the above ground equipment (routers, switches, etc). They can always be easily replaced",
        "Not necessarily. &nbsp; The people who were earlier watching 720p might now want to watch 1080p, for example."
    ],
    "cleaned_text": "free ipl jio vs paid disney airtel seeks trai intervention instead focusing service better consumer offers airtel went public teach lesson ",
    "cleaned_title": "free ipl jio vs paid disney airtel seeks trai intervention",
    "cleaned_selftext": "instead focusing service better consumer offers airtel went public teach lesson",
    "cleaned_comments": "valid question next year people pay year provide free unlimited g till st december im using jio g speed awesome im used g next year pay extra g better consumer offers offers nonsense every purchase must offer end day product costs costs need pay want product business cant magically give offers thin air giving offer taking else people obsessed seeing makebelieve everything free jio killing competition create monopoly legit problem yeah long long ago jio free said always give cheap offers lifetime validity gone dont believe think want shutdown hotstar service need traffic compared previous year earn advertising products becoz revenue ipl came advertisement think jio good calling idiot doesnt justice service valid case monopolistic move jio predatory pricing offend learn discuss calling someone idiot give cheap offers g used cost like per gb jio revolutionised telecom industry isnt free still times preferable jio content must available across platforms price pricing parity irrespective technology wouldnt lead price cartels speed mbps currently jio g super fast load people even g smartphones arent using g go activate g jios website g support way devices g one selling points backbone still gbps line single tower dont going support users per tower mbps math doesnt compute using mbps x backbones upgraded na really would need change entire underground laid cable network isnt going possible really worth point nobody asked g doesnt advantages touted main selling features like low latency still getting upwards ms latency repacking actual g speeds supposed upwards mbps new fancy name called g really advantage cant go laws physics people sayin back data gb back could use sim otp incoming rs recharge months even year need minimum recharge vodafone airtel lower tier available airtel arguing dth perspective essentially want regulation similar pricing ott dth obviously dth companies losing subscribers ott platforms seems effort introduce regulations counter want service priced irrespective medium used whats point selling broadcast rights digital rights separately im actually siding jio digital rights prerogative want give away ipl streaming free cost charge exorbitant sum money jio used push jiofiber downgraded streaming experience isps would concern right dont think theyre anything wrong comes ipl try bsnlmtnl statement logic g support need dedicated g modem support way devices g called connection density g support million devices per square km g support million devices g support million cant vouch speed much underground cable optical supports broadband framework copper cabling give gbps speed also backend jio g offering g sa architecture claiming anything regarding speed g future depends much population density speed supported backend network gives less populous countries euus higher speed probably way gain subscribers increase prices next year dont mind airtel activate website didnt activate anything website still g understand since jio didnt participate gg spectrum bidding hence larger money pool peers private company giving free stuff part marketing scheme onboard user base see new startups offering lucrative deals onboard new users feel another years jio might release arvr experience headsets maybe first day first show movie releases right tv exciting time indian consumers fortunatelyunfortunately competitors keep would perish amount data people running gbps throughout day faster use lesser leech network talking concurrency nobody understood reason would giving higher speeds resolve concurrency issues occurs bandwidth available old old things changed g would love learn anyone link research papers poor network almost non existent customer support landline working year mtnl dont give fuck yes thats another guy paying subsidize total arpu guy telecom operators still get profit even recharge currently possible unlimited call packs way get recharge back half indias population agrees subsidize half tell people using phone calls mean still buy g sims jio isnt stopping regardless talk hours phone straight without worries whereas back day id counting minutes may run talk time shit phone calling cheaper mean recharge monthly case many feature phone users existing underground cables far capacity order pbs per second limiting factor ground equipment routers switches etc always easily replaced necessarily nbsp people earlier watching p might want watch p example",
    "light_cleaned_title": "Why free IPL on Jio vs paid on Disney? Airtel seeks Trai intervention",
    "light_cleaned_selftext": "Instead of focusing on their service and better consumer offers airtel went for this. Public should teach a lesson to them.",
    "light_cleaned_comments": "It is a valid question So next year people will pay more for this. This year they provide free unlimited 5G till 31st December 2023. I'm using Jio 5G, speed is awesome. I'm used to 5G. Next year I will pay extra for 5G. > better consumer offers What is with this offers nonsense that every purchase must have some offer? End of the day a product costs what it costs and we need to pay if we want the product. A business can't magically give offers out of thin air. If they are giving offer some where, they are taking some where else. Why are people so obsessed with seeing that make-believe 75% off, 100% off and what not. Why is everything free from Jio ? Its killing any competition to create a monopoly. This is legit problem. Yeah. Long long ago jio was free and they said it will. Always give cheap offers. But now my lifetime validity is gone. I don't believe them I think they just want to shutdown hotstar and it's service and they just need more traffic as compared to previous year so they can earn more by advertising the products becoz most of the revenue of ipl came from advertisement I think Jio is doing good. Calling it idiot doesn't do justice to the service A valid case. Its a monopolistic move by Jio. PREDATORY PRICING. How did I offend you? Learn how to discuss before calling someone idiot they do give cheap offers 3G used to cost like 299 per GB before Jio revolutionised the telecom industry what we have now isnt free but its still 100 times preferable to what it was before Jio > same content must be available across all platforms at same price and there should be pricing parity irrespective of technology Wouldn’t this lead to price cartels? And speed will be 4mbps. Currently Jio 5G is super fast is because there is no load. People who even have 5g smartphones aren't using 5G because you have to go and activate 5G from Jio's website. 5G can support way more devices than 4G. That is one of its selling points. How? The backbone is still the same, a 20-40Gbps line for a single tower. I don't how they are going to support more than 500 users per tower with >200mbps. The math doesn't compute. Who is using 200 mbps 24x7. Backbones can be upgraded. Na, not really. For that they would need to change the entire underground laid cable network which isn't going to be possible and it's not really worth it. My point is nobody asked for 5G, it doesn't have any of the advantages that were touted as its main selling features. Like low latency, still getting upwards of 30ms latency. They are just repacking actual 4g speeds which is supposed to be upwards of 100mbps, with a new fancy name called 5G when there is really no advantage. You can't go against the laws of physics. people sayin back then data 1gb was 250, back then i could just use my sim for otp and incoming on a 20rs recharge for 6 months or even 1 year. Now i need to minimum recharge of 99 on vodafone or 155 on airtel. no lower tier available. Airtel is arguing from a DTH perspective, and essentially they want regulation to have similar pricing on OTT as on DTH. Obviously DTH companies are losing subscribers to OTT platforms and this seems to be an effort to introduce regulations to counter that. If they want the same service to be priced the same irrespective of the medium used, then what's the point of selling broadcast rights and digital rights separately? For once, I'm actually siding with Jio here. They won the digital rights and now its their prerogative if they want to give away IPL streaming free of cost or charge an exorbitant sum of money. Had Jio used this to push JioFiber or downgraded the streaming experience for other ISPs, then it would have been a concern, but right now I don't think they're doing anything wrong when it comes to IPL. Try bsnl/mtnl This statement has no logic. For 5G support you need dedicated 5G modem. How does it support way more devices than 4G? ;-; It's called connection density. 4G can support 0.1 Million devices per square km, while 5G can support 1 Million devices. 6G can support 10 Million. I can't vouch for speed, but much of the underground cable is optical, which supports the broadband framework. Copper cabling cannot give you the 1Gbps speed. Also the backend of Jio is not the same as 4G. It is offering a 5G SA architecture. Again I am not claiming anything regarding speed of 5G in future as it depends much more on population density, than the speed supported by backend network. This is what gives the less populous countries, EU/US, in having higher speed too. This is probably a way to gain more subscribers and increase the prices next year. I don't mind Airtel doing the same. How to activate it on the website I didn't activate anything on its website. I still have 5g. From what I understand, since Jio didn't participate in 2g/3g spectrum bidding. Hence, they have a larger money pool than their peers. It is a private company and giving free stuff is all part of their marketing scheme to onboard more user base. It's same with how you see new startups offering lucrative deals to onboard new users. I feel, By another 2-3 years, jio might release their AR/VR experience headsets, and maybe first day first show movie releases right on your TV. Exciting time for Indian consumers, fortunately/unfortunately competitors have to keep up with them or they would perish. The amount of data is the same. People are not running 1 Gbps throughout the day. The faster you use it, the lesser you leech the network. I was talking about concurrency, nobody understood that for some reason. How would giving higher speeds resolve concurrency issues which occurs because of the bandwidth available which is the same old same old? If things have changed with 5G, I would love to learn some more of anyone can link to some research papers. very poor network/ almost non existent customer support. , my landline is not working from over year mtnl just dont give a fuck. Yes, that's because another guy paying ₹480 to subsidize you total arpu of you and that guy will be (480+20)/2=250. So the telecom operators still get a profit even you recharge for ₹20. Currently it is not possible because of unlimited call packs. Only way to get ₹20 recharge back if half of the India's population agrees to subsidize other half tell that to people using phone for calls I mean you can still buy 2g sims Jio isn't stopping you from doing it and regardless I can now talk for hours on phone straight without any worries now whereas back in the day I'd be counting minutes because I may run out of talk time or some shit so phone calling is cheaper for me too I mean you have to recharge monthly that was not the case before for many feature phone users The existing underground cables have far more capacity - in the order of PBs per second. The limiting factor is all in the above ground equipment (routers, switches, etc). They can always be easily replaced Not necessarily. &nbsp; The people who were earlier watching 720p might now want to watch 1080p, for example."
}