{
    "id": "mps77k",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/mps77k/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games as your entire post, make sure to write a word or two about the games.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**The Gaming Thread is posted every two weeks on Tuesday mornings.**\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 30,
    "num_comments": 52,
    "created_utc": 1618277414,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "I've been playing forza horizon and sleeping dogs. I just randomly decided to play sleeping dogs and damn, it's been really fun.",
        "Got bored with a few games and then decided to start my 3rd Witcher 3 playthrough.",
        "Well, I'm trying to rebuild my own house in Sims 4, but there is literally no Indian themed furniture😅",
        "&gt;Start up computer &gt;Browse games &gt; Shut down\n\n&gt;Repeat",
        "CSGO",
        "The new path of exile league comes out this weekend. The next one month of my life is about to vanish",
        "Valorant, Rome total war 2",
        "Persona, Final fantasy VII",
        "Genshin impact, older COD games",
        "Nice to see people enjoy the game, honestly it was so well made that it deserves a sequel",
        "Gta SA 100% completed.",
        "Dota 2 lmao as usual. Its a great time to start playing dota 2. \n\nGenshin Impact on mobile. Its an okayish game. A bit too much of struggle and greed by the company behind the game.",
        "Age of empires 2 DE",
        "Mix of Ori and the blind forest, AOE2 DE, Dragon Age Inquisition.",
        "Does sims 4 have custom content? Sims 3 did and I really enjoyed making my own textures and patterns",
        "As someone who hasn't played the Mass Effect Trilogy, will ME Legendary Edition be worth picking up? I've only ever heard good things about it but I rarely have the time to game so I'm a bit apprehensive about jumping into something I might not be able to follow if I don't play for 10-15 days.",
        "Apex Legends, Dota, Street Fighter (SFV and Alpha 3) and Dragonball Fighterz for me lately. Been looking for a single player game lately.",
        "Yep, there is a lot of custom content.",
        "GTA Online. 2-3 of us friends playing during night in closed friends session. I am amateur at 24 lvl and they are 100+ and they are helping me level up",
        "Which starter",
        "I don't like new online games plus don't have great pc to run them too, so currently enjoying Project IGI and running my favourite PS1 games through emulator.",
        "Try Project IGI if you like Tactical Shooters, it's a pretty old game but immensely enjoyable and difficult too",
        "I recently built a new gaming PC after staying away from gaming for more than 4 years. Still, barely get time to game but been playing FS2020, F1 2020, X-Com: Enemy Unkown, and an indie game called Race the sun which is my favorite. Also Halo Masterchief collection because I missed out on most of the Halo titles",
        "Pac-Man",
        "Damn, I gave up while trying to get them oysters and balloons",
        "try pokemon games on emulator old and new both",
        "Any non-combat Space game you can suggest? Currently I'm playing Space Engineers and while I'm really enjoying the mechanics of the game, the sandbox style nature of the game means there is no purpose or goal or story in the game.\n\nI have played Orbiter and Kerbal and I liked both of them. But now I'm looking for a similar 'science' focused Space game that has some sort of a story or progression, and not the cliched space battles and fighting random nameless enemies. Any suggestions?",
        "At least you well played. My friends keep complaining about Schools and Supply lines and how can we forget Wrong side of the tracks and also Cesar Vialapando (mission). But what are balloons in SA?",
        "Aoe 2 DE",
        "Oh my bad, the balloons I was thinking was from gta vice city stories not San Andreas. Also tell your friends to use a controller, games become significantly easy with a controller",
        "Try Yugioh on Ps1 Emulator too",
        "Currently completing Hollow Knight . Very beautiful game but also a bit hard.",
        "Castlevania: Lord of shadows 1 and 2 both are good action adventure single player game; the game and story both are enchanting...",
        "Just gonna drop this here https://old.reddit.com/r/IndianGaming/comments/mouv0y/cities_skylines_india_1_year_anniversary_project/",
        "That’s cute",
        "Try GeForce now with a vpn. I've been using it for a few months",
        "Addicted to rocket league",
        "Worth every paisa. \n\nIt's an experience you will never forget. Play the game at your own pace, don't worry about spamming it and savour each and every moment especially from the 2nd installment onwards.",
        "Bhai Fighterz kaisa khel rahe ho? \n\nHigh seas?",
        "No Man's Sky.\n\nCombat is more or less optional and there's a specific mode as well where you can simply explore.",
        "Anyone interested in setting up a Dungeons &amp; Dragons board game team? We can try playing online for the time being",
        "Just finished cyberpunk 2077 main story and it was mind blowing.",
        "Slams or fireball ignite for now.. let's see once the patch notes are out. Wanna try the new skills too, but maybe that'll be my 2nd char",
        "And for some PC Blowing",
        "Astroneer",
        "Does it have a story and/or goal in the game? As far as I remember it's sort of like Space Engineers... meaning a sandbox game",
        "CSGO with some ets2",
        "One game I can get behind",
        "PS4, Disc Amazon ke khareeda",
        "Bruh that game was the bread and butter of my childhood lol",
        "Life is strange (2015) an absolute gem I recommend everyone to play it at least once.   And Assassins creed 3 is also a great game as well."
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings",
    "cleaned_comments": "ive playing forza horizon sleeping dogs randomly decided play sleeping dogs damn really fun got bored games decided start rd witcher playthrough well im trying rebuild house sims literally indian themed furniture gtstart computer gtbrowse games gt shut gtrepeat csgo new path exile league comes weekend next one month life vanish valorant rome total war persona final fantasy vii genshin impact older cod games nice see people enjoy game honestly well made deserves sequel gta sa completed dota lmao usual great time start playing dota genshin impact mobile okayish game bit much struggle greed company behind game age empires de mix ori blind forest aoe de dragon age inquisition sims custom content sims really enjoyed making textures patterns someone hasnt played mass effect trilogy legendary edition worth picking ive ever heard good things rarely time game im bit apprehensive jumping something might able follow dont play days apex legends dota street fighter sfv alpha dragonball fighterz lately looking single player game lately yep lot custom content gta online us friends playing night closed friends session amateur lvl helping level starter dont like new online games plus dont great pc run currently enjoying project igi running favourite ps games emulator try project igi like tactical shooters pretty old game immensely enjoyable difficult recently built new gaming pc staying away gaming years still barely get time game playing fs f xcom enemy unkown indie game called race sun favorite also halo masterchief collection missed halo titles pacman damn gave trying get oysters balloons try pokemon games emulator old new noncombat space game suggest currently im playing space engineers im really enjoying mechanics game sandbox style nature game means purpose goal story game played orbiter kerbal liked im looking similar science focused space game sort story progression cliched space battles fighting random nameless enemies suggestions least well played friends keep complaining schools supply lines forget wrong side tracks also cesar vialapando mission balloons sa aoe de oh bad balloons thinking gta vice city stories san andreas also tell friends use controller games become significantly easy controller try yugioh ps emulator currently completing hollow knight beautiful game also bit hard castlevania lord shadows good action adventure single player game game story enchanting gon na drop thats cute try geforce vpn ive using months addicted rocket league worth every paisa experience never forget play game pace dont worry spamming savour every moment especially nd installment onwards bhai fighterz kaisa khel rahe ho high seas mans sky combat less optional theres specific mode well simply explore anyone interested setting dungeons amp dragons board game team try playing online time finished cyberpunk main story mind blowing slams fireball ignite lets see patch notes wan na try new skills maybe thatll nd char pc blowing astroneer story andor goal game far remember sort like space engineers meaning sandbox game csgo ets one game get behind ps disc amazon ke khareeda bruh game bread butter childhood lol life strange absolute gem recommend everyone play least assassins creed also great game well",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games as your entire post, make sure to write a word or two about the games. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **The Gaming Thread is posted every two weeks on Tuesday mornings.**",
    "light_cleaned_comments": "I've been playing forza horizon and sleeping dogs. I just randomly decided to play sleeping dogs and damn, it's been really fun. Got bored with a few games and then decided to start my 3rd Witcher 3 playthrough. Well, I'm trying to rebuild my own house in Sims 4, but there is literally no Indian themed furniture😅 &gt;Start up computer &gt;Browse games &gt; Shut down &gt;Repeat CSGO The new path of exile league comes out this weekend. The next one month of my life is about to vanish Valorant, Rome total war 2 Persona, Final fantasy VII Genshin impact, older COD games Nice to see people enjoy the game, honestly it was so well made that it deserves a sequel Gta SA 100% completed. Dota 2 lmao as usual. Its a great time to start playing dota 2. Genshin Impact on mobile. Its an okayish game. A bit too much of struggle and greed by the company behind the game. Age of empires 2 DE Mix of Ori and the blind forest, AOE2 DE, Dragon Age Inquisition. Does sims 4 have custom content? Sims 3 did and I really enjoyed making my own textures and patterns As someone who hasn't played the Mass Effect Trilogy, will ME Legendary Edition be worth picking up? I've only ever heard good things about it but I rarely have the time to game so I'm a bit apprehensive about jumping into something I might not be able to follow if I don't play for 10-15 days. Apex Legends, Dota, Street Fighter (SFV and Alpha 3) and Dragonball Fighterz for me lately. Been looking for a single player game lately. Yep, there is a lot of custom content. GTA Online. 2-3 of us friends playing during night in closed friends session. I am amateur at 24 lvl and they are 100+ and they are helping me level up Which starter I don't like new online games plus don't have great pc to run them too, so currently enjoying Project IGI and running my favourite PS1 games through emulator. Try Project IGI if you like Tactical Shooters, it's a pretty old game but immensely enjoyable and difficult too I recently built a new gaming PC after staying away from gaming for more than 4 years. Still, barely get time to game but been playing FS2020, F1 2020, X-Com: Enemy Unkown, and an indie game called Race the sun which is my favorite. Also Halo Masterchief collection because I missed out on most of the Halo titles Pac-Man Damn, I gave up while trying to get them oysters and balloons try pokemon games on emulator old and new both Any non-combat Space game you can suggest? Currently I'm playing Space Engineers and while I'm really enjoying the mechanics of the game, the sandbox style nature of the game means there is no purpose or goal or story in the game. I have played Orbiter and Kerbal and I liked both of them. But now I'm looking for a similar 'science' focused Space game that has some sort of a story or progression, and not the cliched space battles and fighting random nameless enemies. Any suggestions? At least you well played. My friends keep complaining about Schools and Supply lines and how can we forget Wrong side of the tracks and also Cesar Vialapando (mission). But what are balloons in SA? Aoe 2 DE Oh my bad, the balloons I was thinking was from gta vice city stories not San Andreas. Also tell your friends to use a controller, games become significantly easy with a controller Try Yugioh on Ps1 Emulator too Currently completing Hollow Knight . Very beautiful game but also a bit hard. Castlevania: Lord of shadows 1 and 2 both are good action adventure single player game; the game and story both are enchanting... Just gonna drop this here That’s cute Try GeForce now with a vpn. I've been using it for a few months Addicted to rocket league Worth every paisa. It's an experience you will never forget. Play the game at your own pace, don't worry about spamming it and savour each and every moment especially from the 2nd installment onwards. Bhai Fighterz kaisa khel rahe ho? High seas? No Man's Sky. Combat is more or less optional and there's a specific mode as well where you can simply explore. Anyone interested in setting up a Dungeons &amp; Dragons board game team? We can try playing online for the time being Just finished cyberpunk 2077 main story and it was mind blowing. Slams or fireball ignite for now.. let's see once the patch notes are out. Wanna try the new skills too, but maybe that'll be my 2nd char And for some PC Blowing Astroneer Does it have a story and/or goal in the game? As far as I remember it's sort of like Space Engineers... meaning a sandbox game CSGO with some ets2 One game I can get behind PS4, Disc Amazon ke khareeda Bruh that game was the bread and butter of my childhood lol Life is strange (2015) an absolute gem I recommend everyone to play it at least once. And Assassins creed 3 is also a great game as well."
}