{
    "id": "146x041",
    "title": "Is the PLI Scheme that’s subsidising mobile phone manufacturing a value add to the Indian economy?",
    "url": "https://www.business-standard.com/economy/news/vedanta-foxconn-setback-shows-cracks-in-modi-s-24-bn-manufacturing-push-123060200094_1.html",
    "selftext": "As per Raghuram Rajan, the PLI scheme is not adding value, given that the govt is funding 6% of the invoice of iPhones manufactured in India. Even if we have become a net exporter of mobile phones to the tune of $10 billion, overall, we are now a net importer to the tune of $ 20 billion if we add up the imports of components from China. So essentially, we aren’t capturing a large portion of the value chain to justify the 6% subsidy, and we have become a much larger importer than before, which is poles opposite to what the PLI scheme was supposed to do. \n\nHere's my question😉\n\nIs every taxpaying Indian contributing a small percentage of their income/time to produce iPhones? \n\nWhich means that when taxpayers buy iPhones, then they are cherishing the fruit of their own labour :D \n\nI don't know why I'm reminded of the East India Company that bought raw materials from India and sold the finished products back to us. \n\nI don’t know if I’m oversimplifying or if I’m outright wrong.",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1686497806.0,
    "convurl": "https://external-preview.redd.it/bJwVa1i7UDe7Z9L1uSU76VLUHzix1QtJSK-9fKM1eKg.jpg?auto=webp&v=enabled&s=62245417333fe537e55c6a1b7659aca228f5c49c",
    "comments": [],
    "cleaned_text": "pli scheme thats subsidising mobile phone manufacturing value add indian economy per raghuram rajan pli scheme adding value given govt funding invoice iphones manufactured india even become net exporter mobile phones tune billion overall net importer tune billion add imports components china essentially arent capturing large portion value chain justify subsidy become much larger importer poles opposite pli scheme supposed heres question every taxpaying indian contributing small percentage incometime produce iphones means taxpayers buy iphones cherishing fruit labour dont know im reminded east india company bought raw materials india sold finished products back us dont know im oversimplifying im outright wrong ",
    "cleaned_title": "pli scheme thats subsidising mobile phone manufacturing value add indian economy",
    "cleaned_selftext": "per raghuram rajan pli scheme adding value given govt funding invoice iphones manufactured india even become net exporter mobile phones tune billion overall net importer tune billion add imports components china essentially arent capturing large portion value chain justify subsidy become much larger importer poles opposite pli scheme supposed heres question every taxpaying indian contributing small percentage incometime produce iphones means taxpayers buy iphones cherishing fruit labour dont know im reminded east india company bought raw materials india sold finished products back us dont know im oversimplifying im outright wrong",
    "cleaned_comments": "",
    "light_cleaned_title": "Is the PLI Scheme that’s subsidising mobile phone manufacturing a value add to the Indian economy?",
    "light_cleaned_selftext": "As per Raghuram Rajan, the PLI scheme is not adding value, given that the govt is funding 6% of the invoice of iPhones manufactured in India. Even if we have become a net exporter of mobile phones to the tune of $10 billion, overall, we are now a net importer to the tune of $ 20 billion if we add up the imports of components from China. So essentially, we aren’t capturing a large portion of the value chain to justify the 6% subsidy, and we have become a much larger importer than before, which is poles opposite to what the PLI scheme was supposed to do. Here's my question😉 Is every taxpaying Indian contributing a small percentage of their income/time to produce iPhones? Which means that when taxpayers buy iPhones, then they are cherishing the fruit of their own labour :D I don't know why I'm reminded of the East India Company that bought raw materials from India and sold the finished products back to us. I don’t know if I’m oversimplifying or if I’m outright wrong.",
    "light_cleaned_comments": ""
}