{
    "id": "16o6z10",
    "title": "Khalistani who was in NIA's wanted list yesterday, shot dead today in Canada.",
    "url": "https://www.reddit.com/gallery/16o6z10",
    "selftext": "Sukhdool Singh aka Sukha Duneke, a gangster who escaped to Canada from Punjab, India in 2017 on forged documents, was shot dead today in Winnipeg, Canada by unknown assailants.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695272607.0,
    "convurl": "https://i.redd.it/3a8tuhttjjpb1.jpg",
    "comments": [
        "Waiting for Canada to blame India now",
        "lol india aint backing down. Must be something serious to take such forced actions.",
        "How easy is it to forge documents and fake passports, that Canada is happily letting people in and granting them residency status, with eventual path to citizenship?",
        "GOI right now\n\nhttps://preview.redd.it/k7x2urobmjpb1.jpeg?width=720&format=pjpg&auto=webp&s=c78de46cf310969c5a29306296aade2c2c589aa3",
        "https://www.freepressjournal.in/world/gangster-sukhdool-singh-shot-dead-in-winnipeg-city-in-canada-in-suspected-gang-war",
        "Now Trudeau will blame India for this too.",
        "Well the fact that Dunki is releasing in a few months..",
        "I'm not sure If the government did have a hand in this, but it would be absolutely insane if it did. One assassination on a Five Eyes country is brazen, two will get us sanctioned",
        "If you're part of those terror networks, they can easily help you get through any system. But they are not doing you a favor, you would be going there for a mission and further their cause.",
        "Lolol. Interesting. Very interesting to see what's Canada's rection is?",
        "Things  about to get messy",
        "Highly doubt India is involved, Khalistanis are involved in a lot of internal organized crime in Canada and the timing seems to be too convenient",
        "Also media is saying it's [\"inter-gang rivalry\"](https://www.freepressjournal.in/world/gangster-sukhdool-singh-shot-dead-in-winnipeg-city-in-canada-in-suspected-gang-war). Same like how that Congress leader was killed by a Canada-based Khalistani few days ago",
        "Another one bites the dust\nThough if at all Indian operatives went there then it must be one easy ride for them to get into the country XD",
        "This!\n\nA few weeks ago, son was asking me - if Americans have CIA, British their MI6 and Israelis proud of Mossad, what does India have?",
        "I am not understanding the point here.. Canada was peaceful with law abiding citizens long back .. why do they allow Asian filth.. who makes their surroundings worse wherever they go.",
        "So the way it works here is when a person is murdered the police identify them.   \n\nGo ahead look on the Winnipeg PD website.  Or look up CBC Winnipeg or the Winnipeg Free Press.  Let me know if you find anything. I’ll be waiting with bated breath. \n\nhttps://www.winnipeg.ca/police/community/news-releases",
        "I am from Winnipeg and I'm hearing this now. No reports from any sources other than Indian media so far. Why?",
        "there is a reason india is anatagonising canada."
    ],
    "cleaned_text": "khalistani nias wanted list yesterday shot dead today canada sukhdool singh aka sukha duneke gangster escaped canada punjab india forged documents shot dead today winnipeg canada unknown assailants ",
    "cleaned_title": "khalistani nias wanted list yesterday shot dead today canada",
    "cleaned_selftext": "sukhdool singh aka sukha duneke gangster escaped canada punjab india forged documents shot dead today winnipeg canada unknown assailants",
    "cleaned_comments": "waiting canada blame india lol india aint backing must something serious take forced actions easy forge documents fake passports canada happily letting people granting residency status eventual path citizenship goi right trudeau blame india well fact dunki releasing months im sure government hand would absolutely insane one assassination five eyes country brazen two get us sanctioned youre part terror networks easily help get system favor would going mission cause lolol interesting interesting see whats canadas rection things get messy highly doubt india involved khalistanis involved lot internal organized crime canada timing seems convenient also media saying intergang rivalryhttpswwwfreepressjournalinworldgangstersukhdoolsinghshotdeadinwinnipegcityincanadainsuspectedgangwar like congress leader killed canadabased khalistani days ago another one bites dust though indian operatives went must one easy ride get country xd weeks ago son asking americans cia british mi israelis proud mossad india understanding point canada peaceful law abiding citizens long back allow asian filth makes surroundings worse wherever go way works person murdered police identify go ahead look winnipeg pd website look cbc winnipeg winnipeg free press let know find anything ill waiting bated breath winnipeg im hearing reports sources indian media far reason india anatagonising canada",
    "light_cleaned_title": "Khalistani who was in NIA's wanted list yesterday, shot dead today in Canada.",
    "light_cleaned_selftext": "Sukhdool Singh aka Sukha Duneke, a gangster who escaped to Canada from Punjab, India in 2017 on forged documents, was shot dead today in Winnipeg, Canada by unknown assailants.",
    "light_cleaned_comments": "Waiting for Canada to blame India now lol india aint backing down. Must be something serious to take such forced actions. How easy is it to forge documents and fake passports, that Canada is happily letting people in and granting them residency status, with eventual path to citizenship? GOI right now Now Trudeau will blame India for this too. Well the fact that Dunki is releasing in a few months.. I'm not sure If the government did have a hand in this, but it would be absolutely insane if it did. One assassination on a Five Eyes country is brazen, two will get us sanctioned If you're part of those terror networks, they can easily help you get through any system. But they are not doing you a favor, you would be going there for a mission and further their cause. Lolol. Interesting. Very interesting to see what's Canada's rection is? Things about to get messy Highly doubt India is involved, Khalistanis are involved in a lot of internal organized crime in Canada and the timing seems to be too convenient Also media is saying it's [\"inter-gang rivalry\"](https://www.freepressjournal.in/world/gangster-sukhdool-singh-shot-dead-in-winnipeg-city-in-canada-in-suspected-gang-war). Same like how that Congress leader was killed by a Canada-based Khalistani few days ago Another one bites the dust Though if at all Indian operatives went there then it must be one easy ride for them to get into the country XD This! A few weeks ago, son was asking me - if Americans have CIA, British their MI6 and Israelis proud of Mossad, what does India have? I am not understanding the point here.. Canada was peaceful with law abiding citizens long back .. why do they allow Asian filth.. who makes their surroundings worse wherever they go. So the way it works here is when a person is murdered the police identify them. Go ahead look on the Winnipeg PD website. Or look up CBC Winnipeg or the Winnipeg Free Press. Let me know if you find anything. I’ll be waiting with bated breath. I am from Winnipeg and I'm hearing this now. No reports from any sources other than Indian media so far. Why? there is a reason india is anatagonising canada."
}