{
    "id": "159ys5o",
    "title": "Any Indian Youtubers/Channels like Johnny Harris?",
    "url": "https://www.reddit.com/r/india/comments/159ys5o/any_indian_youtuberschannels_like_johnny_harris/",
    "selftext": "I’m trying to find Youtube channels similar to Johnny Harris’ channel that are more focused on our country or are from our country. I’ve discovered channels that lack good production capabilities, but their content is generally of higher quality. Or channels with better/consistent production that is lacking elsewhere. For people unfamiliar with his channel, here’s a [link](https://youtube.com/@johnnyharris). \n\nHis brand of independent journalism and storytelling is compelling and definitely has led me down quite a few rabbit holes. I agree, he’s made a few videos that could be taught as lessons about finding the line between being informative and a good storyteller. But largely, they’re well-researched and well-made. Whether you agree with his political inclinations, methods of research, and views is your choice. I’m just trying to find something I know I’ll find interesting, and maybe someone else might too.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690356711.0,
    "convurl": "https://external-preview.redd.it/hgAfVyLIKUifSwzhneHrO7fBYmUtOYW0awqq-g9KDLc.jpg?auto=webp&s=dbe20f589e929d8c4aa38f83017081ba7a4e195a",
    "comments": [],
    "cleaned_text": "indian youtuberschannels like johnny harris im trying find youtube channels similar johnny harris channel focused country country ive discovered channels lack good production capabilities content generally higher quality channels betterconsistent production lacking elsewhere people unfamiliar channel heres linkhttpsyoutubecomjohnnyharris brand independent journalism storytelling compelling definitely led quite rabbit holes agree hes made videos could taught lessons finding line informative good storyteller largely theyre wellresearched wellmade whether agree political inclinations methods research views choice im trying find something know ill find interesting maybe someone else might ",
    "cleaned_title": "indian youtuberschannels like johnny harris",
    "cleaned_selftext": "im trying find youtube channels similar johnny harris channel focused country country ive discovered channels lack good production capabilities content generally higher quality channels betterconsistent production lacking elsewhere people unfamiliar channel heres linkhttpsyoutubecomjohnnyharris brand independent journalism storytelling compelling definitely led quite rabbit holes agree hes made videos could taught lessons finding line informative good storyteller largely theyre wellresearched wellmade whether agree political inclinations methods research views choice im trying find something know ill find interesting maybe someone else might",
    "cleaned_comments": "",
    "light_cleaned_title": "Any Indian Youtubers/Channels like Johnny Harris?",
    "light_cleaned_selftext": "I’m trying to find Youtube channels similar to Johnny Harris’ channel that are more focused on our country or are from our country. I’ve discovered channels that lack good production capabilities, but their content is generally of higher quality. Or channels with better/consistent production that is lacking elsewhere. For people unfamiliar with his channel, here’s a [link](https://youtube.com/@johnnyharris). His brand of independent journalism and storytelling is compelling and definitely has led me down quite a few rabbit holes. I agree, he’s made a few videos that could be taught as lessons about finding the line between being informative and a good storyteller. But largely, they’re well-researched and well-made. Whether you agree with his political inclinations, methods of research, and views is your choice. I’m just trying to find something I know I’ll find interesting, and maybe someone else might too.",
    "light_cleaned_comments": ""
}