{
    "id": "12dadip",
    "title": "Why journalists don't interview other journalists?",
    "url": "https://www.reddit.com/r/india/comments/12dadip/why_journalists_dont_interview_other_journalists/",
    "selftext": "I can understand why politicians are hesitant to be interviewed by certain journalists, or they don't have debates, but why can't we have journalists being interviewed by each other?\n\n[Arnab has an interview with ANI](https://www.youtube.com/watch?v=6rwylMR4ecc).   \n[Ravish has an interview with Kunal Kamra](https://www.youtube.com/watch?v=stNh_di8OM8)  \n[Rubika Liaqat has an interview with ANI](https://www.youtube.com/watch?v=GcSMWpKOVGk)  \n[Palki Sharma has an interview with Ranveer BeerBiceps](https://www.youtube.com/watch?v=lfm33o25WCQ)  \n[Deepak Chaurasia has an interview with Newslaundry](https://www.youtube.com/watch?v=kmkyNG6NEvA)  \n[Ravish has a video with Deshbhakt](https://www.youtube.com/watch?v=UyXr-gZq4s0)  \n[Abhisar Sharma has a Live QnA with Dhruv Rathee](https://www.youtube.com/watch?v=9HBejYqQRn8)  \n[Karan Thapar has an interview with Newslaundry](https://www.youtube.com/watch?v=S0pgz2biUmE)  \n[Punya Prasun Bajpai has an interview with Kumar Shyam](https://www.youtube.com/watch?v=USjK4qVthRc)  \n[Barkha Dutt has an interview with Deshbhakt](https://www.youtube.com/watch?v=4WWylri_kic)\n\nClearly journalists have time to be interviewed. But why isn't anyone asking the question about why journalists choose their interviews while we judge politicians for choosing their interviewers. Journalism is considered the 4th pillar of Democracy. They often question interview Politicians, Celebrities, and notable personalities from other fields excluding journalism.\n\n  \nA majority of the population of India builds his/her opinion based on listening to their favorite journalists. All the interviews listed above have excerpts of them criticizing each other's work. Clearly they have a difference of opinion and as a human each journalist is entitled to their opinion. Why can't they agree to an interview being live cast on their channels respectively of each other?  \n\n\nI would pay money for an hour long interview of Arnab asking questions to Ravish on Republic one week, and next week Ravish asking questions to Arnab on Youtube. Or imagine Sudhir Chaudhary asking questions to Arfa Khanum Sherwani. Or Barkha Dutt interviewing Rubika Liaqat. \n\nOne can say certain politicians and celebrities do not enjoy live interviews, but it's hard to argue that journalists do not like live interviews.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1680759390.0,
    "convurl": "https://external-preview.redd.it/zp6eZQy4G0_NHZZ-RIbnHBusDG6sAua2TlFp9C14pqg.jpg?auto=webp&v=enabled&s=cbe3609e07442d9e9f2dee8443676861d41953ad",
    "comments": [
        "everyone likes to live in their echo chambers.",
        "For that we need a positive debate culture, or respectable journalistic standards. Most of them have become really unprofessional. It's a blatant right journalism and left journalism now. Personally I'd like to belief that both can be possible in one channel.\n\nHowever, majority of news channels are lapdog servants of a party and can not comment negatively in any circumstances to one party. This, the type of journalism they do, and the direct representation of believing that anyone saying otherwise is on the other side of the war, makes them believe that the other side is enemy for them. There's too much bitterness in them to sit in one place.",
        "I agree. But at the same time journalists should respect their profession. I really hope this message reaches these journalists. It will not just improve their TRPs, but it will also allow them to less black or white to the viewers.   \n\n\nI just feel an average voter would be more influenced by such interviews than politicians being interviewed by their favorite journalists or their least favorite journalist. The questions are very biased either way.",
        "I think most of them already know that, but they do this for the sake of money. Only some of the top ones actually believe their shit.",
        "They did. But very rarely.\n\nhttps://youtu.be/kmkyNG6NEvA"
    ],
    "cleaned_text": "journalists dont interview journalists understand politicians hesitant interviewed certain journalists dont debates cant journalists interviewed arnab interview anihttpswwwyoutubecomwatchvrwylmrecc ravish interview kunal kamrahttpswwwyoutubecomwatchvstnhdiom rubika liaqat interview anihttpswwwyoutubecomwatchvgcsmwpkovgk palki sharma interview ranveer beerbicepshttpswwwyoutubecomwatchvlfmowcq deepak chaurasia interview newslaundryhttpswwwyoutubecomwatchvkmkyngneva ravish video deshbhakthttpswwwyoutubecomwatchvuyxrgzqs abhisar sharma live qna dhruv ratheehttpswwwyoutubecomwatchvhbejyqqrn karan thapar interview newslaundryhttpswwwyoutubecomwatchvspgzbiume punya prasun bajpai interview kumar shyamhttpswwwyoutubecomwatchvusjkqvthrc barkha dutt interview deshbhakthttpswwwyoutubecomwatchvwwylrikic clearly journalists time interviewed isnt anyone asking question journalists choose interviews judge politicians choosing interviewers journalism considered th pillar democracy often question interview politicians celebrities notable personalities fields excluding journalism majority population india builds hisher opinion based listening favorite journalists interviews listed excerpts criticizing others work clearly difference opinion human journalist entitled opinion cant agree interview live cast channels respectively would pay money hour long interview arnab asking questions ravish republic one week next week ravish asking questions arnab youtube imagine sudhir chaudhary asking questions arfa khanum sherwani barkha dutt interviewing rubika liaqat one say certain politicians celebrities enjoy live interviews hard argue journalists like live interviews ",
    "cleaned_title": "journalists dont interview journalists",
    "cleaned_selftext": "understand politicians hesitant interviewed certain journalists dont debates cant journalists interviewed arnab interview anihttpswwwyoutubecomwatchvrwylmrecc ravish interview kunal kamrahttpswwwyoutubecomwatchvstnhdiom rubika liaqat interview anihttpswwwyoutubecomwatchvgcsmwpkovgk palki sharma interview ranveer beerbicepshttpswwwyoutubecomwatchvlfmowcq deepak chaurasia interview newslaundryhttpswwwyoutubecomwatchvkmkyngneva ravish video deshbhakthttpswwwyoutubecomwatchvuyxrgzqs abhisar sharma live qna dhruv ratheehttpswwwyoutubecomwatchvhbejyqqrn karan thapar interview newslaundryhttpswwwyoutubecomwatchvspgzbiume punya prasun bajpai interview kumar shyamhttpswwwyoutubecomwatchvusjkqvthrc barkha dutt interview deshbhakthttpswwwyoutubecomwatchvwwylrikic clearly journalists time interviewed isnt anyone asking question journalists choose interviews judge politicians choosing interviewers journalism considered th pillar democracy often question interview politicians celebrities notable personalities fields excluding journalism majority population india builds hisher opinion based listening favorite journalists interviews listed excerpts criticizing others work clearly difference opinion human journalist entitled opinion cant agree interview live cast channels respectively would pay money hour long interview arnab asking questions ravish republic one week next week ravish asking questions arnab youtube imagine sudhir chaudhary asking questions arfa khanum sherwani barkha dutt interviewing rubika liaqat one say certain politicians celebrities enjoy live interviews hard argue journalists like live interviews",
    "cleaned_comments": "everyone likes live echo chambers need positive debate culture respectable journalistic standards become really unprofessional blatant right journalism left journalism personally id like belief possible one channel however majority news channels lapdog servants party comment negatively circumstances one party type journalism direct representation believing anyone saying otherwise side war makes believe side enemy theres much bitterness sit one place agree time journalists respect profession really hope message reaches journalists improve trps also allow less black white viewers feel average voter would influenced interviews politicians interviewed favorite journalists least favorite journalist questions biased either way think already know sake money top ones actually believe shit rarely",
    "light_cleaned_title": "Why journalists don't interview other journalists?",
    "light_cleaned_selftext": "I can understand why politicians are hesitant to be interviewed by certain journalists, or they don't have debates, but why can't we have journalists being interviewed by each other? [Arnab has an interview with ANI](https://www.youtube.com/watch?v=6rwylMR4ecc). [Ravish has an interview with Kunal Kamra](https://www.youtube.com/watch?v=stNh_di8OM8) [Rubika Liaqat has an interview with ANI](https://www.youtube.com/watch?v=GcSMWpKOVGk) [Palki Sharma has an interview with Ranveer BeerBiceps](https://www.youtube.com/watch?v=lfm33o25WCQ) [Deepak Chaurasia has an interview with Newslaundry](https://www.youtube.com/watch?v=kmkyNG6NEvA) [Ravish has a video with Deshbhakt](https://www.youtube.com/watch?v=UyXr-gZq4s0) [Abhisar Sharma has a Live QnA with Dhruv Rathee](https://www.youtube.com/watch?v=9HBejYqQRn8) [Karan Thapar has an interview with Newslaundry](https://www.youtube.com/watch?v=S0pgz2biUmE) [Punya Prasun Bajpai has an interview with Kumar Shyam](https://www.youtube.com/watch?v=USjK4qVthRc) [Barkha Dutt has an interview with Deshbhakt](https://www.youtube.com/watch?v=4WWylri_kic) Clearly journalists have time to be interviewed. But why isn't anyone asking the question about why journalists choose their interviews while we judge politicians for choosing their interviewers. Journalism is considered the 4th pillar of Democracy. They often question interview Politicians, Celebrities, and notable personalities from other fields excluding journalism. A majority of the population of India builds his/her opinion based on listening to their favorite journalists. All the interviews listed above have excerpts of them criticizing each other's work. Clearly they have a difference of opinion and as a human each journalist is entitled to their opinion. Why can't they agree to an interview being live cast on their channels respectively of each other? I would pay money for an hour long interview of Arnab asking questions to Ravish on Republic one week, and next week Ravish asking questions to Arnab on Youtube. Or imagine Sudhir Chaudhary asking questions to Arfa Khanum Sherwani. Or Barkha Dutt interviewing Rubika Liaqat. One can say certain politicians and celebrities do not enjoy live interviews, but it's hard to argue that journalists do not like live interviews.",
    "light_cleaned_comments": "everyone likes to live in their echo chambers. For that we need a positive debate culture, or respectable journalistic standards. Most of them have become really unprofessional. It's a blatant right journalism and left journalism now. Personally I'd like to belief that both can be possible in one channel. However, majority of news channels are lapdog servants of a party and can not comment negatively in any circumstances to one party. This, the type of journalism they do, and the direct representation of believing that anyone saying otherwise is on the other side of the war, makes them believe that the other side is enemy for them. There's too much bitterness in them to sit in one place. I agree. But at the same time journalists should respect their profession. I really hope this message reaches these journalists. It will not just improve their TRPs, but it will also allow them to less black or white to the viewers. I just feel an average voter would be more influenced by such interviews than politicians being interviewed by their favorite journalists or their least favorite journalist. The questions are very biased either way. I think most of them already know that, but they do this for the sake of money. Only some of the top ones actually believe their shit. They did. But very rarely."
}