{
    "id": "1c15y4m",
    "title": "Supreme Court says Delhi Metro not obliged to pay ₹8,000 crore to Anil Ambani's firm | Mint",
    "url": "https://www.livemint.com/companies/news/delhi-metro-not-to-pay-rs-8-000-crore-to-reliance-infra-shares-anil-ambani-delhi-airport-metro-express-private-ltd-11712737279300.html",
    "selftext": "1. An arbitral tribunal (out of court body in layman language that adjudicates disputes) gave a 2000 cr award in favor of Anil Ambani's DAMEPL (Reliance);\n\n2. The award was against Delhi Metro (practically the taxpayer's money in the context);\n\n3. The amount ballooned to 8000 cr in 2024 due to interest;\n\n4. Delhi Metro appealed before Delhi High Court;\n\n5. Single Judge of Delhi HC dismissed Delhi Metro case and upheld award in favor of Reliance;\n\n6. Delhi Metro appealed before Division Bench of Delhi HC (basically a bench of 2 judges);\n\n The 2 judges (one of which was Sanjiv Khanna, now a SC judge) held the award to be perverse and allowed appeal in favor of Delhi Metro;\n\n7. Reliance appealed to Supreme Court, which in 2021 overturned the Delhi HC judgment. Basically SC ordered in favor of Reliance;\n\n8. A curative petition was filed by Delhi Metro (basically an appeal against an appeal in SC in rare cases) which was heard by CJI led bench also comprising judges Gavai and Surya Kant;\n\n9. Delhi Metro was represented by PS Narsimha (now an SC judge) before Delhi HC and by KK Venugopal (former Attorney General), Venkatramani (current Attorney General) before the Supreme Court amongst other lawyers.\n\n10. Reliance was represented by P. Chidamabram before the High Court and \nBy Harish Salve, Kapil Sibal before the Supreme Court amongst others. \n\nBasically the award saves 8000cr of taxpayer money that would have otherwise benefited Reliance, it seems. \n",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1712809074.0,
    "convurl": "https://external-preview.redd.it/6oiwkZ-BLoh8XMy3mp63x91m6GJ24dbgB40RW3IXT9Y.jpg",
    "comments": [],
    "cleaned_text": "supreme court says delhi metro obliged pay crore anil ambanis firm mint arbitral tribunal court body layman language adjudicates disputes gave cr award favor anil ambanis damepl reliance award delhi metro practically taxpayers money context amount ballooned cr due interest delhi metro appealed delhi high court single judge delhi hc dismissed delhi metro case upheld award favor reliance delhi metro appealed division bench delhi hc basically bench judges judges one sanjiv khanna sc judge held award perverse allowed appeal favor delhi metro reliance appealed supreme court overturned delhi hc judgment basically sc ordered favor reliance curative petition filed delhi metro basically appeal appeal sc rare cases heard cji led bench also comprising judges gavai surya kant delhi metro represented ps narsimha sc judge delhi hc kk venugopal former attorney general venkatramani current attorney general supreme court amongst lawyers reliance represented p chidamabram high court harish salve kapil sibal supreme court amongst others basically award saves cr taxpayer money would otherwise benefited reliance seems ",
    "cleaned_title": "supreme court says delhi metro obliged pay crore anil ambanis firm mint",
    "cleaned_selftext": "arbitral tribunal court body layman language adjudicates disputes gave cr award favor anil ambanis damepl reliance award delhi metro practically taxpayers money context amount ballooned cr due interest delhi metro appealed delhi high court single judge delhi hc dismissed delhi metro case upheld award favor reliance delhi metro appealed division bench delhi hc basically bench judges judges one sanjiv khanna sc judge held award perverse allowed appeal favor delhi metro reliance appealed supreme court overturned delhi hc judgment basically sc ordered favor reliance curative petition filed delhi metro basically appeal appeal sc rare cases heard cji led bench also comprising judges gavai surya kant delhi metro represented ps narsimha sc judge delhi hc kk venugopal former attorney general venkatramani current attorney general supreme court amongst lawyers reliance represented p chidamabram high court harish salve kapil sibal supreme court amongst others basically award saves cr taxpayer money would otherwise benefited reliance seems",
    "cleaned_comments": "",
    "light_cleaned_title": "Supreme Court says Delhi Metro not obliged to pay ₹8,000 crore to Anil Ambani's firm | Mint",
    "light_cleaned_selftext": "1. An arbitral tribunal (out of court body in layman language that adjudicates disputes) gave a 2000 cr award in favor of Anil Ambani's DAMEPL (Reliance); 2. The award was against Delhi Metro (practically the taxpayer's money in the context); 3. The amount ballooned to 8000 cr in 2024 due to interest; 4. Delhi Metro appealed before Delhi High Court; 5. Single Judge of Delhi HC dismissed Delhi Metro case and upheld award in favor of Reliance; 6. Delhi Metro appealed before Division Bench of Delhi HC (basically a bench of 2 judges); The 2 judges (one of which was Sanjiv Khanna, now a SC judge) held the award to be perverse and allowed appeal in favor of Delhi Metro; 7. Reliance appealed to Supreme Court, which in 2021 overturned the Delhi HC judgment. Basically SC ordered in favor of Reliance; 8. A curative petition was filed by Delhi Metro (basically an appeal against an appeal in SC in rare cases) which was heard by CJI led bench also comprising judges Gavai and Surya Kant; 9. Delhi Metro was represented by PS Narsimha (now an SC judge) before Delhi HC and by KK Venugopal (former Attorney General), Venkatramani (current Attorney General) before the Supreme Court amongst other lawyers. 10. Reliance was represented by P. Chidamabram before the High Court and By Harish Salve, Kapil Sibal before the Supreme Court amongst others. Basically the award saves 8000cr of taxpayer money that would have otherwise benefited Reliance, it seems.",
    "light_cleaned_comments": ""
}