{
    "id": "1gzd1id",
    "title": "Adani Group ₹2,200 Crore Bribery Case: Just the Tip of the Corruption Iceberg",
    "url": "https://www.reddit.com/r/india/comments/1gzd1id/adani_group_2200_crore_bribery_case_just_the_tip/",
    "selftext": "The allegations of a ₹2,200 crore ($265 million) bribe by the Adani Group to secure solar energy contracts have sparked widespread outrage. Social media is abuzz with indignation at the audacity and scale of this alleged corruption. However, the broader issue of institutionalized bribery, which affects every layer of society, remains largely unexamined.\n\nAt the grassroots level, corruption begins with small but significant instances. A few common example:\n\n* **RTO Offices**: Youngsters often find themselves paying bribes to secure their first driver’s licenses or during passport verification by local police. The urgency of individual needs makes refusal impractical.\n* **Traffic Violations**: A pervasive “chalta hai” attitude leads many to bribe traffic officers rather than paying the prescribed fines.\n* **Real Estate Transactions**: Anyone involved in buying or selling property knows the endemic corruption in sub-registrar offices and land-record departments.\n\nIn business, bribery becomes a normalized “cost of doing business,” encompassing everything from:\n\n* Greasing palms for trade permits and licenses,\n* Paying off inspectors during routine checks,\n* Securing GST approvals,\n* Facilitating smooth transportation of goods.\n\nAfter the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact. \n\n**Personal Reflections: A Case Study for Thought**\n\nOn a personal note, [I’ve spent years battling corruption in local government offices, from the Tahsildar to the Deputy Commissioner, armed with court orders and contempt notices. (link)](https://chng.it/VpXVwtKNyH) The fight? To avoid succumbing to the “huge” bribes demanded. MBA students might analyze as a case study in **\"Cost of Doing Business vs. Time Value of Money\"** in modern India",
    "flair": "Rant / Vent",
    "score": 24,
    "num_comments": 3,
    "created_utc": 1732517969.0,
    "convurl": "https://external-preview.redd.it/BgEq5aRGYJ1Riq5znL5iNgTtDFTPonlOjYcPJ3z6kBM.jpg?auto=webp&s=d1cb7d7dce1a8fc7832e9e63079af0c5e3f376e4",
    "comments": [
        ">After the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact.\n\n\nAnd this is why we shouldn't let these capitalists control our politics. When the pears\nPawars meet shah in adani's House, he's not talking politics, he's securing his profits. When Gautamdas flies in adani airplane to become the prime minister, Gautam is counting his coins. \n\n\nAnd those 2,200cr are only a tip of the adani bribery iceberg itself. The total profits he's made from the country in various power, infrastructure and other projects is much much higher. This is the evidence the Americans happened to catch in a specific investigation about specific investments he'd raised in the USA. ",
        "\\+ EVERY SINGLE THING they buy using tax money is heavily overpriced and in every step of the corruption hierarchy they pocket the difference.\n\nRotten to the core, needs to be purged inside out.",
        "I can tell about one government owned company. \n\nFor every purchase there is a flat rate of bribe with a tiered structure. Usually around 5 : 3 : 1.5 : 1 : 0.5. \n\nThus there is a basic corruption overhead of ~10% for literally every purchase or payment of services.  \n\nAdd to that larger level corruption where the money is paid to a minister and the minister directs the company. \n\nAdd to that the overhead of small bribes and gifts for lower (processing level) employees.  \n\nAnd it's the same no matter which party is in government. \n\nA bare minimum of 10% of taxpayer money is just lining up the pockets of ministers, bureaucrats and government + government owned company employees."
    ],
    "cleaned_text": "adani group crore bribery case tip corruption iceberg allegations crore million bribe adani group secure solar energy contracts sparked widespread outrage social media abuzz indignation audacity scale alleged corruption however broader issue institutionalized bribery affects every layer society remains largely unexamined grassroots level corruption begins small significant instances common example rto offices youngsters often find paying bribes secure first drivers licenses passport verification local police urgency individual needs makes refusal impractical traffic violations pervasive chalta hai attitude leads many bribe traffic officers rather paying prescribed fines real estate transactions anyone involved buying selling property knows endemic corruption subregistrar offices landrecord departments business bribery becomes normalized cost business encompassing everything greasing palms trade permits licenses paying inspectors routine checks securing gst approvals facilitating smooth transportation goods media frenzy fades cases like adanis crore alleged bribe often get reduced another entry ledger business company might calculated move hefty upfront payment secure multibilliondollar contract promises crore billion profits two decades justifying simply stating fact personal reflections case study thought personal note ive spent years battling corruption local government offices tahsildar deputy commissioner armed court orders contempt notices linkhttpschngitvpxvwtknyh fight avoid succumbing huge bribes demanded mba students might analyze case study cost business vs time value money modern india ",
    "cleaned_title": "adani group crore bribery case tip corruption iceberg",
    "cleaned_selftext": "allegations crore million bribe adani group secure solar energy contracts sparked widespread outrage social media abuzz indignation audacity scale alleged corruption however broader issue institutionalized bribery affects every layer society remains largely unexamined grassroots level corruption begins small significant instances common example rto offices youngsters often find paying bribes secure first drivers licenses passport verification local police urgency individual needs makes refusal impractical traffic violations pervasive chalta hai attitude leads many bribe traffic officers rather paying prescribed fines real estate transactions anyone involved buying selling property knows endemic corruption subregistrar offices landrecord departments business bribery becomes normalized cost business encompassing everything greasing palms trade permits licenses paying inspectors routine checks securing gst approvals facilitating smooth transportation goods media frenzy fades cases like adanis crore alleged bribe often get reduced another entry ledger business company might calculated move hefty upfront payment secure multibilliondollar contract promises crore billion profits two decades justifying simply stating fact personal reflections case study thought personal note ive spent years battling corruption local government offices tahsildar deputy commissioner armed court orders contempt notices linkhttpschngitvpxvwtknyh fight avoid succumbing huge bribes demanded mba students might analyze case study cost business vs time value money modern india",
    "cleaned_comments": "media frenzy fades cases like adanis crore alleged bribe often get reduced another entry ledger business company might calculated move hefty upfront payment secure multibilliondollar contract promises crore billion profits two decades justifying simply stating fact shouldnt let capitalists control politics pears pawars meet shah adanis house hes talking politics hes securing profits gautamdas flies adani airplane become prime minister gautam counting coins cr tip adani bribery iceberg total profits hes made country various power infrastructure projects much much higher evidence americans happened catch specific investigation specific investments hed raised usa every single thing buy using tax money heavily overpriced every step corruption hierarchy pocket difference rotten core needs purged inside tell one government owned company every purchase flat rate bribe tiered structure usually around thus basic corruption overhead literally every purchase payment services add larger level corruption money paid minister minister directs company add overhead small bribes gifts lower processing level employees matter party government bare minimum taxpayer money lining pockets ministers bureaucrats government government owned company employees",
    "light_cleaned_title": "Adani Group ₹2,200 Crore Bribery Case: Just the Tip of the Corruption Iceberg",
    "light_cleaned_selftext": "The allegations of a ₹2,200 crore ($265 million) bribe by the Adani Group to secure solar energy contracts have sparked widespread outrage. Social media is abuzz with indignation at the audacity and scale of this alleged corruption. However, the broader issue of institutionalized bribery, which affects every layer of society, remains largely unexamined. At the grassroots level, corruption begins with small but significant instances. A few common example: * **RTO Offices**: Youngsters often find themselves paying bribes to secure their first driver’s licenses or during passport verification by local police. The urgency of individual needs makes refusal impractical. * **Traffic Violations**: A pervasive “chalta hai” attitude leads many to bribe traffic officers rather than paying the prescribed fines. * **Real Estate Transactions**: Anyone involved in buying or selling property knows the endemic corruption in sub-registrar offices and land-record departments. In business, bribery becomes a normalized “cost of doing business,” encompassing everything from: * Greasing palms for trade permits and licenses, * Paying off inspectors during routine checks, * Securing GST approvals, * Facilitating smooth transportation of goods. After the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact. **Personal Reflections: A Case Study for Thought** On a personal note, [I’ve spent years battling corruption in local government offices, from the Tahsildar to the Deputy Commissioner, armed with court orders and contempt notices. (link)](https://chng.it/VpXVwtKNyH) The fight? To avoid succumbing to the “huge” bribes demanded. MBA students might analyze as a case study in **\"Cost of Doing Business vs. Time Value of Money\"** in modern India",
    "light_cleaned_comments": ">After the media frenzy fades, cases like Adani's ₹2,200 crore alleged bribe often get reduced to another entry in the ledger of doing business. For the company, this might be a calculated move: a hefty upfront payment to secure a multi-billion-dollar contract that promises ₹16,800 crore ($2 billion) in profits over two decades. I am not justifying it here, but simply stating the fact. And this is why we shouldn't let these capitalists control our politics. When the pears Pawars meet shah in adani's House, he's not talking politics, he's securing his profits. When Gautamdas flies in adani airplane to become the prime minister, Gautam is counting his coins. And those 2,200cr are only a tip of the adani bribery iceberg itself. The total profits he's made from the country in various power, infrastructure and other projects is much much higher. This is the evidence the Americans happened to catch in a specific investigation about specific investments he'd raised in the USA. \\+ EVERY SINGLE THING they buy using tax money is heavily overpriced and in every step of the corruption hierarchy they pocket the difference. Rotten to the core, needs to be purged inside out. I can tell about one government owned company. For every purchase there is a flat rate of bribe with a tiered structure. Usually around 5 : 3 : 1.5 : 1 : 0.5. Thus there is a basic corruption overhead of ~10% for literally every purchase or payment of services. Add to that larger level corruption where the money is paid to a minister and the minister directs the company. Add to that the overhead of small bribes and gifts for lower (processing level) employees. And it's the same no matter which party is in government. A bare minimum of 10% of taxpayer money is just lining up the pockets of ministers, bureaucrats and government + government owned company employees."
}