{
    "id": "ji9ipd",
    "title": "Kerala's Proposed Amendment to curb online abuse is eerie in its similarity to the unconstitutional S.66A",
    "url": "https://www.reddit.com/r/india/comments/ji9ipd/keralas_proposed_amendment_to_curb_online_abuse/",
    "selftext": "https://preview.redd.it/oq5zh3l8tdv51.png?width=1600&amp;format=png&amp;auto=webp&amp;s=fd2b74581c07629be1cdbd2a710838ee894c3fab\n\n# tl;dr\n\nWe wrote to the Government of Kerala cautioning them about the free speech risks that could arise from their proposed amendment of the Kerala Police Act, 2011. Our main recommendation was that any such amendment go through sufficient legal scrutiny and public consultation.   \n\n\n# The Proposed Amendment\n\nThe Government of Kerala [**announced**](https://www.keralacm.gov.in/2020/10/21/cabinet-decisions-21-10-2020/) on October 21, 2020 its decision to amend the Kerala Police Act, 2011. The amendment aims to prevent cyber attacks against women and children through the introduction of a new provision which would [**state**](https://timesofindia.indiatimes.com/city/thiruvananthapuram/kerala-police-act-amendment-could-end-up-gagging-the-media/articleshow/78800634.cms#:~:text=According%20to%20a%20press%20release,through%20any%20means%20of%20communication) that  \n\n\n&gt;“anyone who produces content, publishes or propagates it through any means of communication with an intention to threaten, insult or harm the reputation of an individual will be punished with an imprisonment of five years or a fine of Rs 10,000 or with both”.  \n\n\nWe note with concern that the text of this provision has not been made available on the official websites of the Government of Kerala and neither has it been put towards any public consultation. This is deviating from the norm of transparency and pre-legislative consultation.   \n\n\nIt is also a matter of concern that this amendment is being introduced through ordinance which raises serious concerns about its validity.  It is our opinion that any such amendment which curbs free speech on the internet needs to undergo sufficient legal scrutiny which can be achieved only if it is discussed and debated upon by the state legislature.  \n\n\n# Return of the Zombie\n\nThe decision of the Hon’ble Supreme Court in the landmark case of *Shreya Singhal v. Union of India* (2013) 12 SCC 73 had previously struck down S.66A of the Information Technology Act, 2000 and S. 118(d) of the Kerala Police Act, 2011 for being violative of the fundamental rights guaranteed by the Constitution of India under Article 19(1)(a) which guarantees the freedom of speech and expression to Indian citizens.  The Shreya Singhal decision highlights the need to ensure that overbroad restrictions on online speech are not used as a tool by the State to criminalise free speech on the internet.   \n\n\n&gt;“However, what has been said about Section 66A would apply directly to Section 118(d) of the Kerala Police Act, as causing annoyance in an indecent manner suffers from the same type of vagueness and over breadth, that led to the invalidity of Section 66A, and for the reasons given for striking down Section 66A, Section 118(d) also violates Article 19(1)(a) and not being a reasonable restriction on the said right and not being saved under any of the subject matters contained in Article 19(2) is hereby declared to be unconstitutional.”  \n\n\nThe introduction of amended provision in question is concerning because of its similarity to the unconstitutional S.66A. The provisions suffers from a similar vice of being void for vagueness. The phrases as mentioned in the press report of the proposed Section 118 (A) mentions, “insult” and, “harm” are elastic and devoid of context and precise definition. Hence, the provision is in violation of the decision of the Hon’ble Supreme Court in *Shreya Singhal v. Union of India* and puts users of the internet at risk.   \n\n\n# Our recommendations\n\n1. Introduction of any such amendment be done with full and complete transparency and not with haste. An important element is for the State Government to seek opinion on the proposed provision for compliance with the judgements of the Hon’ble Supreme Court from the State Advocate General’s office.\n2. We further recommended that a public consultation process be put in place to invite stakeholder comments from interested parties such as experts on online free speech, women’s rights activists and individuals/organisations that work at the intersection of these concerns.\n3. We urged for a fuller examination for creating an administrative and social toolkit in which legal responses play a role. Here, we recommended safeguarding free speech on the internet by moving away from criminalisation of online speech except under certain circumstances as contained in the International Covenant on Civil and Political Rights (ICCPR).   \n\n\n# We are building a Zombie Tracker!\n\nSection 66A of the Information Technology Act, 2000 was declared unconstitutional by the Supreme Court of India in March, 2015 in *Shreya Singhal v Union of India*. The Court declared that the provision was void ab initio i.e was deemed to never have existed on the statute books. The effect of this would be that all pending cases would be dismissed and no fresh cases would be instituted under S. 66A. However, in 2018, a [**research paper by Abhinav Sekhri and Apar Gupta**](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3275893) highlighted that Section 66A was being still used for legal prosecutions all over the country. Taking note of the above-mentioned study, People’s Union for Civil Liberties (‘PUCL’), one of the original petitioners in the Shreya Singhal case approached the court in January, 2019 highlighting the study and applying for directions to ensure implementation of the Court’s decision. Inspite of repeated directions by the Supreme Court as late as 2019, [**our preliminary research shows that, S. 66A is still being invoked in fresh cases**](https://internetfreedom.in/66a-zombies-continue-to-menace-free-speech-on-the-internet/). Our preliminary findings were backed by a [**recent media report which highlights the continued invocation of S.66A**](https://www.livelaw.in/news-updates/financial-assistance-of-5000-each-granted-to-16448-advocates-to-deal-with-covid-19-crisis-bar-council-of-delhi-tells-delhi-hc-159564?infinitescroll=1). Further, we noticed that the mountain of pending cases including a charge under S.66A is ever increasing. Therefore, we are building a tool to track registered cases which include a charge under S.66A. We intend to use the data and insights generated from it to bolster our advocacy efforts to ensure that no fresh charge is registered under S.66A and pending charges under S.66A are dismissed.  \n\n\nThe Zombie Tracker will be tracking cases which include a charge under S.66A at the district level, across 11 states: Andhra Pradesh, Assam, Delhi, Jharkhand, Karnataka, Maharashtra, Rajasthan, Sikkim, Tamil Nadu, Telangana, and West Bengal. The tracker will be collecting case data using the E-Courts application programming interface (API) , for the period 27th October 2009 to 15th February 2020.  \n\n\n# Important Documents\n\n1. Representation to the Government of Kerala on the Amendment to the Kerala Police Act, 2011 dated October 24, 2020 ([**link**](https://drive.google.com/file/d/1DWADjozg-jFEgl4-1fCtKoBHRDYGfTaT/view?usp=sharing))\n2. Update on IFF’s Zombie Tracker dated July 8, 2020 ([**link**](https://internetfreedom.in/update-on-zombie-tracker/))",
    "flair": "Policy/Economy",
    "score": 121,
    "num_comments": 4,
    "created_utc": 1603693059,
    "convurl": "https://b.thumbs.redditmedia.com/OHpIra4kn3kFHdmeYKri3m1_fhvkqJgJKQMNFeldTXc.jpg",
    "comments": [
        "Yes! It is Fucked up and waiting to be misused. How can we fight this legally?",
        "This law will be misused and is a regressive measure. Keep the fight on so that we can make Pinarayi government repeal this.",
        "Is this being challenged in court.",
        "\n\nThanks for updating us on it. I haven't heard of this till now.\n\nIf you want some feedback, the readability of the image you attached at the top is terrible. White text on light coloured background is a bad choice."
    ],
    "cleaned_text": "keralas proposed amendment curb online abuse eerie similarity unconstitutional sa tldr wrote government kerala cautioning free speech risks could arise proposed amendment kerala police act main recommendation amendment go sufficient legal scrutiny public consultation proposed amendment government kerala announcedhttpswwwkeralacmgovincabinetdecisions october decision amend kerala police act amendment aims prevent cyber attacks women children introduction new provision would statehttpstimesofindiaindiatimescomcitythiruvananthapuramkeralapoliceactamendmentcouldendupgaggingthemediaarticleshowcmstextaccordingtoapressreleasethroughanymeansofcommunication gtanyone produces content publishes propagates means communication intention threaten insult harm reputation individual punished imprisonment five years fine rs note concern text provision made available official websites government kerala neither put towards public consultation deviating norm transparency prelegislative consultation also matter concern amendment introduced ordinance raises serious concerns validity opinion amendment curbs free speech internet needs undergo sufficient legal scrutiny achieved discussed debated upon state legislature return zombie decision honble supreme court landmark case shreya singhal v union india scc previously struck sa information technology act kerala police act violative fundamental rights guaranteed constitution india article guarantees freedom speech expression indian citizens shreya singhal decision highlights need ensure overbroad restrictions online speech used tool state criminalise free speech internet gthowever said section would apply directly section kerala police act causing annoyance indecent manner suffers type vagueness breadth led invalidity section reasons given striking section section also violates article reasonable restriction said right saved subject matters contained article hereby declared unconstitutional introduction amended provision question concerning similarity unconstitutional sa provisions suffers similar vice void vagueness phrases mentioned press report proposed section mentions insult harm elastic devoid context precise definition hence provision violation decision honble supreme court shreya singhal v union india puts users internet risk recommendations introduction amendment done full complete transparency haste important element state government seek opinion proposed provision compliance judgements honble supreme court state advocate generals office recommended public consultation process put place invite stakeholder comments interested parties experts online free speech womens rights activists individualsorganisations work intersection concerns urged fuller examination creating administrative social toolkit legal responses play role recommended safeguarding free speech internet moving away criminalisation online speech except certain circumstances contained international covenant civil political rights iccpr building zombie tracker section information technology act declared unconstitutional supreme court india march shreya singhal v union india court declared provision void ab initio ie deemed never existed statute books effect would pending cases would dismissed fresh cases would instituted however research paper abhinav sekhri apar guptahttpspapersssrncomsolpaperscfmabstractid highlighted section still used legal prosecutions country taking note abovementioned study peoples union civil liberties pucl one original petitioners shreya singhal case approached court january highlighting study applying directions ensure implementation courts decision inspite repeated directions supreme court late preliminary research shows still invoked fresh caseshttpsinternetfreedominazombiescontinuetomenacefreespeechontheinternet preliminary findings backed recent media report highlights continued invocation sahttpswwwlivelawinnewsupdatesfinancialassistanceofeachgrantedtoadvocatestodealwithcovidcrisisbarcouncilofdelhitellsdelhihcinfinitescroll noticed mountain pending cases including charge sa ever increasing therefore building tool track registered cases include charge sa intend use data insights generated bolster advocacy efforts ensure fresh charge registered sa pending charges sa dismissed zombie tracker tracking cases include charge sa district level across states andhra pradesh assam delhi jharkhand karnataka maharashtra rajasthan sikkim tamil nadu telangana west bengal tracker collecting case data using ecourts application programming interface api period th october th february important documents representation government kerala amendment kerala police act dated october linkhttpsdrivegooglecomfileddwadjozgjfeglfctkobhrdygftatviewuspsharing update iffs zombie tracker dated july linkhttpsinternetfreedominupdateonzombietracker ",
    "cleaned_title": "keralas proposed amendment curb online abuse eerie similarity unconstitutional sa",
    "cleaned_selftext": "tldr wrote government kerala cautioning free speech risks could arise proposed amendment kerala police act main recommendation amendment go sufficient legal scrutiny public consultation proposed amendment government kerala announcedhttpswwwkeralacmgovincabinetdecisions october decision amend kerala police act amendment aims prevent cyber attacks women children introduction new provision would statehttpstimesofindiaindiatimescomcitythiruvananthapuramkeralapoliceactamendmentcouldendupgaggingthemediaarticleshowcmstextaccordingtoapressreleasethroughanymeansofcommunication gtanyone produces content publishes propagates means communication intention threaten insult harm reputation individual punished imprisonment five years fine rs note concern text provision made available official websites government kerala neither put towards public consultation deviating norm transparency prelegislative consultation also matter concern amendment introduced ordinance raises serious concerns validity opinion amendment curbs free speech internet needs undergo sufficient legal scrutiny achieved discussed debated upon state legislature return zombie decision honble supreme court landmark case shreya singhal v union india scc previously struck sa information technology act kerala police act violative fundamental rights guaranteed constitution india article guarantees freedom speech expression indian citizens shreya singhal decision highlights need ensure overbroad restrictions online speech used tool state criminalise free speech internet gthowever said section would apply directly section kerala police act causing annoyance indecent manner suffers type vagueness breadth led invalidity section reasons given striking section section also violates article reasonable restriction said right saved subject matters contained article hereby declared unconstitutional introduction amended provision question concerning similarity unconstitutional sa provisions suffers similar vice void vagueness phrases mentioned press report proposed section mentions insult harm elastic devoid context precise definition hence provision violation decision honble supreme court shreya singhal v union india puts users internet risk recommendations introduction amendment done full complete transparency haste important element state government seek opinion proposed provision compliance judgements honble supreme court state advocate generals office recommended public consultation process put place invite stakeholder comments interested parties experts online free speech womens rights activists individualsorganisations work intersection concerns urged fuller examination creating administrative social toolkit legal responses play role recommended safeguarding free speech internet moving away criminalisation online speech except certain circumstances contained international covenant civil political rights iccpr building zombie tracker section information technology act declared unconstitutional supreme court india march shreya singhal v union india court declared provision void ab initio ie deemed never existed statute books effect would pending cases would dismissed fresh cases would instituted however research paper abhinav sekhri apar guptahttpspapersssrncomsolpaperscfmabstractid highlighted section still used legal prosecutions country taking note abovementioned study peoples union civil liberties pucl one original petitioners shreya singhal case approached court january highlighting study applying directions ensure implementation courts decision inspite repeated directions supreme court late preliminary research shows still invoked fresh caseshttpsinternetfreedominazombiescontinuetomenacefreespeechontheinternet preliminary findings backed recent media report highlights continued invocation sahttpswwwlivelawinnewsupdatesfinancialassistanceofeachgrantedtoadvocatestodealwithcovidcrisisbarcouncilofdelhitellsdelhihcinfinitescroll noticed mountain pending cases including charge sa ever increasing therefore building tool track registered cases include charge sa intend use data insights generated bolster advocacy efforts ensure fresh charge registered sa pending charges sa dismissed zombie tracker tracking cases include charge sa district level across states andhra pradesh assam delhi jharkhand karnataka maharashtra rajasthan sikkim tamil nadu telangana west bengal tracker collecting case data using ecourts application programming interface api period th october th february important documents representation government kerala amendment kerala police act dated october linkhttpsdrivegooglecomfileddwadjozgjfeglfctkobhrdygftatviewuspsharing update iffs zombie tracker dated july linkhttpsinternetfreedominupdateonzombietracker",
    "cleaned_comments": "yes fucked waiting misused fight legally law misused regressive measure keep fight make pinarayi government repeal challenged court thanks updating us havent heard till want feedback readability image attached top terrible white text light coloured background bad choice",
    "light_cleaned_title": "Kerala's Proposed Amendment to curb online abuse is eerie in its similarity to the unconstitutional S.66A",
    "light_cleaned_selftext": "# tl;dr We wrote to the Government of Kerala cautioning them about the free speech risks that could arise from their proposed amendment of the Kerala Police Act, 2011. Our main recommendation was that any such amendment go through sufficient legal scrutiny and public consultation. # The Proposed Amendment The Government of Kerala [**announced**](https://www.keralacm.gov.in/2020/10/21/cabinet-decisions-21-10-2020/) on October 21, 2020 its decision to amend the Kerala Police Act, 2011. The amendment aims to prevent cyber attacks against women and children through the introduction of a new provision which would [**state**](https://timesofindia.indiatimes.com/city/thiruvananthapuram/kerala-police-act-amendment-could-end-up-gagging-the-media/articleshow/78800634.cms#:~:text=According%20to%20a%20press%20release,through%20any%20means%20of%20communication) that &gt;“anyone who produces content, publishes or propagates it through any means of communication with an intention to threaten, insult or harm the reputation of an individual will be punished with an imprisonment of five years or a fine of Rs 10,000 or with both”. We note with concern that the text of this provision has not been made available on the official websites of the Government of Kerala and neither has it been put towards any public consultation. This is deviating from the norm of transparency and pre-legislative consultation. It is also a matter of concern that this amendment is being introduced through ordinance which raises serious concerns about its validity. It is our opinion that any such amendment which curbs free speech on the internet needs to undergo sufficient legal scrutiny which can be achieved only if it is discussed and debated upon by the state legislature. # Return of the Zombie The decision of the Hon’ble Supreme Court in the landmark case of *Shreya Singhal v. Union of India* (2013) 12 SCC 73 had previously struck down S.66A of the Information Technology Act, 2000 and S. 118(d) of the Kerala Police Act, 2011 for being violative of the fundamental rights guaranteed by the Constitution of India under Article 19(1)(a) which guarantees the freedom of speech and expression to Indian citizens. The Shreya Singhal decision highlights the need to ensure that overbroad restrictions on online speech are not used as a tool by the State to criminalise free speech on the internet. &gt;“However, what has been said about Section 66A would apply directly to Section 118(d) of the Kerala Police Act, as causing annoyance in an indecent manner suffers from the same type of vagueness and over breadth, that led to the invalidity of Section 66A, and for the reasons given for striking down Section 66A, Section 118(d) also violates Article 19(1)(a) and not being a reasonable restriction on the said right and not being saved under any of the subject matters contained in Article 19(2) is hereby declared to be unconstitutional.” The introduction of amended provision in question is concerning because of its similarity to the unconstitutional S.66A. The provisions suffers from a similar vice of being void for vagueness. The phrases as mentioned in the press report of the proposed Section 118 (A) mentions, “insult” and, “harm” are elastic and devoid of context and precise definition. Hence, the provision is in violation of the decision of the Hon’ble Supreme Court in *Shreya Singhal v. Union of India* and puts users of the internet at risk. # Our recommendations 1. Introduction of any such amendment be done with full and complete transparency and not with haste. An important element is for the State Government to seek opinion on the proposed provision for compliance with the judgements of the Hon’ble Supreme Court from the State Advocate General’s office. 2. We further recommended that a public consultation process be put in place to invite stakeholder comments from interested parties such as experts on online free speech, women’s rights activists and individuals/organisations that work at the intersection of these concerns. 3. We urged for a fuller examination for creating an administrative and social toolkit in which legal responses play a role. Here, we recommended safeguarding free speech on the internet by moving away from criminalisation of online speech except under certain circumstances as contained in the International Covenant on Civil and Political Rights (ICCPR). # We are building a Zombie Tracker! Section 66A of the Information Technology Act, 2000 was declared unconstitutional by the Supreme Court of India in March, 2015 in *Shreya Singhal v Union of India*. The Court declared that the provision was void ab initio i.e was deemed to never have existed on the statute books. The effect of this would be that all pending cases would be dismissed and no fresh cases would be instituted under S. 66A. However, in 2018, a [**research paper by Abhinav Sekhri and Apar Gupta**](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3275893) highlighted that Section 66A was being still used for legal prosecutions all over the country. Taking note of the above-mentioned study, People’s Union for Civil Liberties (‘PUCL’), one of the original petitioners in the Shreya Singhal case approached the court in January, 2019 highlighting the study and applying for directions to ensure implementation of the Court’s decision. Inspite of repeated directions by the Supreme Court as late as 2019, [**our preliminary research shows that, S. 66A is still being invoked in fresh cases**](https://internetfreedom.in/66a-zombies-continue-to-menace-free-speech-on-the-internet/). Our preliminary findings were backed by a [**recent media report which highlights the continued invocation of S.66A**](https://www.livelaw.in/news-updates/financial-assistance-of-5000-each-granted-to-16448-advocates-to-deal-with-covid-19-crisis-bar-council-of-delhi-tells-delhi-hc-159564?infinitescroll=1). Further, we noticed that the mountain of pending cases including a charge under S.66A is ever increasing. Therefore, we are building a tool to track registered cases which include a charge under S.66A. We intend to use the data and insights generated from it to bolster our advocacy efforts to ensure that no fresh charge is registered under S.66A and pending charges under S.66A are dismissed. The Zombie Tracker will be tracking cases which include a charge under S.66A at the district level, across 11 states: Andhra Pradesh, Assam, Delhi, Jharkhand, Karnataka, Maharashtra, Rajasthan, Sikkim, Tamil Nadu, Telangana, and West Bengal. The tracker will be collecting case data using the E-Courts application programming interface (API) , for the period 27th October 2009 to 15th February 2020. # Important Documents 1. Representation to the Government of Kerala on the Amendment to the Kerala Police Act, 2011 dated October 24, 2020 ([**link**](https://drive.google.com/file/d/1DWADjozg-jFEgl4-1fCtKoBHRDYGfTaT/view?usp=sharing)) 2. Update on IFF’s Zombie Tracker dated July 8, 2020 ([**link**](https://internetfreedom.in/update-on-zombie-tracker/))",
    "light_cleaned_comments": "Yes! It is Fucked up and waiting to be misused. How can we fight this legally? This law will be misused and is a regressive measure. Keep the fight on so that we can make Pinarayi government repeal this. Is this being challenged in court. Thanks for updating us on it. I haven't heard of this till now. If you want some feedback, the readability of the image you attached at the top is terrible. White text on light coloured background is a bad choice."
}