{
    "id": "12captb",
    "title": "What is a good air purifier to combat allergens in India?",
    "url": "https://www.reddit.com/r/india/comments/12captb/what_is_a_good_air_purifier_to_combat_allergens/",
    "selftext": "Before you say Dyson - well, I looked at it and its out of my budget for the time being.\n\nI found [this](https://smartairfilters.com/in/en/product/sqair-air-purifier/) which seems budget-friendly and does the job, but would anyone have experience with this, or other models of air purifiers to combat allergens, dust, etc? How effective were air purifiers in combatting air purity and your allergic sneezes/reactions to changes in weather, dust, pollens, etc?",
    "flair": "AskIndia",
    "score": 8,
    "num_comments": 9,
    "created_utc": 1680675595.0,
    "convurl": "https://external-preview.redd.it/umGm2bsnDueNf4yUBYUUjlXK65f3ud1ytPdOPr9-bMM.jpg?auto=webp&v=enabled&s=0e04a68bc8c4f065a475beb4957d8068b8a09c3b",
    "comments": [
        "I've used a Philips but be warned, these need frequent cleaning and occasional filter replacement that costs money.\n\nI haven't heard of the brand you've linked, so no idea",
        "I have many Smart Air filters. The Sqair one is good looking, but for a very small room. And it's loud for the amount of air it pushes on max. \n\nThe good thing about smart air filters is mostly they use rectangular filters. That helps because in winters, every company comes out with filters and new models. By the next year, half the companies are gone and you can find replacement filters. \n\nXiaomi has stuck around and have replacements. Although they raised the prices from 1k to nearly 2.5 for nearly the same filter. \n\nBut you at least get the replacement. The latest model (main unit) also better than the earlier ones. App support is better now. Automatic on/off and scheduling works. I'll suggest go for Xiaomi 3 filter",
        "Dyson :)\n\nFind a 0% EMI option but get the best in the business, especially when it comes to your health.",
        "My room is smaller than the mentioned square feet, so isn't that taken care of?\n\nIt says 23 db, what is a good volume to look for?",
        "What makes it so much better than the ones that are more affordable?",
        "Besides being a proven leader in quality, reliability,  workmanship & parts, their filtration technology is miles ahead of the next economic brand, not to mention energy efficiency.",
        "Ah. Yeah, it looks amazing as well, but man. 50,000 is insane, even half of it is out of reach. I can literally buy a laptop with that kind of money. Cant justify that rate with brands less than 1/5th the price.\n\nThanks for the recommendation though.",
        "I don't know in db but you can hear it louder than an AC on max fan."
    ],
    "cleaned_text": "good air purifier combat allergens india say dyson well looked budget time found thishttpssmartairfilterscominenproductsqairairpurifier seems budgetfriendly job would anyone experience models air purifiers combat allergens dust etc effective air purifiers combatting air purity allergic sneezesreactions changes weather dust pollens etc ",
    "cleaned_title": "good air purifier combat allergens india",
    "cleaned_selftext": "say dyson well looked budget time found thishttpssmartairfilterscominenproductsqairairpurifier seems budgetfriendly job would anyone experience models air purifiers combat allergens dust etc effective air purifiers combatting air purity allergic sneezesreactions changes weather dust pollens etc",
    "cleaned_comments": "ive used philips warned need frequent cleaning occasional filter replacement costs money havent heard brand youve linked idea many smart air filters sqair one good looking small room loud amount air pushes max good thing smart air filters mostly use rectangular filters helps winters every company comes filters new models next year half companies gone find replacement filters xiaomi stuck around replacements although raised prices k nearly nearly filter least get replacement latest model main unit also better earlier ones app support better automatic onoff scheduling works ill suggest go xiaomi filter dyson find emi option get best business especially comes health room smaller mentioned square feet isnt taken care says db good volume look makes much better ones affordable besides proven leader quality reliability workmanship parts filtration technology miles ahead next economic brand mention energy efficiency ah yeah looks amazing well man insane even half reach literally buy laptop kind money cant justify rate brands less th price thanks recommendation though dont know db hear louder ac max fan",
    "light_cleaned_title": "What is a good air purifier to combat allergens in India?",
    "light_cleaned_selftext": "Before you say Dyson - well, I looked at it and its out of my budget for the time being. I found [this](https://smartairfilters.com/in/en/product/sqair-air-purifier/) which seems budget-friendly and does the job, but would anyone have experience with this, or other models of air purifiers to combat allergens, dust, etc? How effective were air purifiers in combatting air purity and your allergic sneezes/reactions to changes in weather, dust, pollens, etc?",
    "light_cleaned_comments": "I've used a Philips but be warned, these need frequent cleaning and occasional filter replacement that costs money. I haven't heard of the brand you've linked, so no idea I have many Smart Air filters. The Sqair one is good looking, but for a very small room. And it's loud for the amount of air it pushes on max. The good thing about smart air filters is mostly they use rectangular filters. That helps because in winters, every company comes out with filters and new models. By the next year, half the companies are gone and you can find replacement filters. Xiaomi has stuck around and have replacements. Although they raised the prices from 1k to nearly 2.5 for nearly the same filter. But you at least get the replacement. The latest model (main unit) also better than the earlier ones. App support is better now. Automatic on/off and scheduling works. I'll suggest go for Xiaomi 3 filter Dyson :) Find a 0% EMI option but get the best in the business, especially when it comes to your health. My room is smaller than the mentioned square feet, so isn't that taken care of? It says 23 db, what is a good volume to look for? What makes it so much better than the ones that are more affordable? Besides being a proven leader in quality, reliability, workmanship & parts, their filtration technology is miles ahead of the next economic brand, not to mention energy efficiency. Ah. Yeah, it looks amazing as well, but man. 50,000 is insane, even half of it is out of reach. I can literally buy a laptop with that kind of money. Cant justify that rate with brands less than 1/5th the price. Thanks for the recommendation though. I don't know in db but you can hear it louder than an AC on max fan."
}