{
    "id": "16blrs3",
    "title": "Ayodhya seer announces Rs 10 crore bounty on Udhayanidhi Stalin's head over 'sanatana dharma' remark",
    "url": "https://www.reddit.com/r/india/comments/16blrs3/ayodhya_seer_announces_rs_10_crore_bounty_on/",
    "selftext": " [Ayodhya seer announces Rs 10 crore bounty on Udhayanidhi Stalin's head over 'sanatana dharma' remark- The New Indian Express](https://www.newindianexpress.com/nation/2023/sep/04/ayodhya-seer-announces-rs-10-crore-bounty-on-udhayanidhi-stalins-head-over-sanatana-dharma-remark-2611626.html) \n\nIs this true?\n\nWhy are not such people getting arrested for announcing a bounty on someone's head?",
    "flair": "Rant / Vent",
    "score": 59,
    "num_comments": 13,
    "created_utc": 1694010539,
    "convurl": "https://external-preview.redd.it/GYw6edZwnWaw349HZ8y0wJpVGa8v_E6v7fC9DOcQyUA.jpg?auto=webp&s=fc0cc5698bf360c73b955fdfcf32a87cb57edc73",
    "comments": [
        "That's a crime... granted, he should be arrested...\nNow are the police ready to arrest Udhayanidhi for his remarks?",
        "A counter bounty of 100 crores placed on seers head by a Tamil organization, reports say. \n\nThis is getting ridiculous!",
        "Do you think Stalin Jr meant and end to Hinduism or castiest Hindus and their way of thinking? Have you heard about the \"Sanatan sanstha\" literal hindutvavadi terrorists.You know the guys who killed Dr Dabholkar Kalburgi and Gauri lankesh .However regrettable it is those guys are still Hindus and when incidents like sadhus organising a rally in support of Brij Bhushan become more and more common ie Hinduism is used as a shield to protect the BJP from criticism one has to argue the common hindu not being more outraged at the bastardisation of his/her  religion at the hands of Ajay Bhisht and Pragya Thakur and their ilk is turning more and more Hindus extremist and castiest if the common Hindu does not want to fight these forces",
        "This, plus in Tamil Nadu, Sanatan Dharm directly refers to casteism, discrimination stuff of Hinduism.",
        "India is like a big onlyf@ns for religious fanatics",
        "A counter bounty is places on this seer... \n\nIndia is like a big onlyf@ns for religious fanatics",
        "Protectors of the religion proving stalin points. Task failed successfully",
        "He didn't put a bounty on anyone's head, did he?",
        "Nope, I am from Tamilnadu and Santana Dharma doesn't refer to casteism. Just before Udayanidhi's speech, Veeramani of DK party spoke on the same dias and he literally said \"hinduism is sanatana Dharma\".",
        "He meant to end hinduism. Cos just before Udayanidhi's speech, Veeramani of DK party spoke and he literally equated hinduism and sanatana Dharma.",
        "~~bounty?~~\n\nYou mean a fatwa?",
        "I don't know enough, what I wrote is what I have read online, and heard from several Tamilians.",
        "No, in Tamilnadu, overall caste based discrimination is linked to hinduism, just like terr*rism is linked with Isl*m. Both naratives are wrong. We recently started calling hinduism as sanatana Dharma in TN, that too due to the political narrative these Dravidians set, saying Hinduism is the name given by foreigners.\n\nAnd yes I am debating the same in the Tamil Nadu sub. Thanks to Udai Anna, to have awakened a sleeping hindu like me."
    ],
    "cleaned_text": "ayodhya seer announces rs crore bounty udhayanidhi stalins head sanatana dharma remark ayodhya seer announces rs crore bounty udhayanidhi stalins head sanatana dharma remark new indian expresshttpswwwnewindianexpresscomnationsepayodhyaseerannouncesrscrorebountyonudhayanidhistalinsheadoversanatanadharmaremarkhtml true people getting arrested announcing bounty someones head ",
    "cleaned_title": "ayodhya seer announces rs crore bounty udhayanidhi stalins head sanatana dharma remark",
    "cleaned_selftext": "ayodhya seer announces rs crore bounty udhayanidhi stalins head sanatana dharma remark new indian expresshttpswwwnewindianexpresscomnationsepayodhyaseerannouncesrscrorebountyonudhayanidhistalinsheadoversanatanadharmaremarkhtml true people getting arrested announcing bounty someones head",
    "cleaned_comments": "thats crime granted arrested police ready arrest udhayanidhi remarks counter bounty crores placed seers head tamil organization reports say getting ridiculous think stalin jr meant end hinduism castiest hindus way thinking heard sanatan sanstha literal hindutvavadi terroristsyou know guys killed dr dabholkar kalburgi gauri lankesh however regrettable guys still hindus incidents like sadhus organising rally support brij bhushan become common ie hinduism used shield protect bjp criticism one argue common hindu outraged bastardisation hisher religion hands ajay bhisht pragya thakur ilk turning hindus extremist castiest common hindu want fight forces plus tamil nadu sanatan dharm directly refers casteism discrimination stuff hinduism india like big onlyfns religious fanatics counter bounty places seer india like big onlyfns religious fanatics protectors religion proving stalin points task failed successfully didnt put bounty anyones head nope tamilnadu santana dharma doesnt refer casteism udayanidhis speech veeramani dk party spoke dias literally said hinduism sanatana dharma meant end hinduism cos udayanidhis speech veeramani dk party spoke literally equated hinduism sanatana dharma bounty mean fatwa dont know enough wrote read online heard several tamilians tamilnadu overall caste based discrimination linked hinduism like terrrism linked islm naratives wrong recently started calling hinduism sanatana dharma tn due political narrative dravidians set saying hinduism name given foreigners yes debating tamil nadu sub thanks udai anna awakened sleeping hindu like",
    "light_cleaned_title": "Ayodhya seer announces Rs 10 crore bounty on Udhayanidhi Stalin's head over 'sanatana dharma' remark",
    "light_cleaned_selftext": "[Ayodhya seer announces Rs 10 crore bounty on Udhayanidhi Stalin's head over 'sanatana dharma' remark- The New Indian Express](https://www.newindianexpress.com/nation/2023/sep/04/ayodhya-seer-announces-rs-10-crore-bounty-on-udhayanidhi-stalins-head-over-sanatana-dharma-remark-2611626.html) Is this true? Why are not such people getting arrested for announcing a bounty on someone's head?",
    "light_cleaned_comments": "That's a crime... granted, he should be arrested... Now are the police ready to arrest Udhayanidhi for his remarks? A counter bounty of 100 crores placed on seers head by a Tamil organization, reports say. This is getting ridiculous! Do you think Stalin Jr meant and end to Hinduism or castiest Hindus and their way of thinking? Have you heard about the \"Sanatan sanstha\" literal hindutvavadi terrorists.You know the guys who killed Dr Dabholkar Kalburgi and Gauri lankesh .However regrettable it is those guys are still Hindus and when incidents like sadhus organising a rally in support of Brij Bhushan become more and more common ie Hinduism is used as a shield to protect the BJP from criticism one has to argue the common hindu not being more outraged at the bastardisation of his/her religion at the hands of Ajay Bhisht and Pragya Thakur and their ilk is turning more and more Hindus extremist and castiest if the common Hindu does not want to fight these forces This, plus in Tamil Nadu, Sanatan Dharm directly refers to casteism, discrimination stuff of Hinduism. India is like a big onlyf@ns for religious fanatics A counter bounty is places on this seer... India is like a big onlyf@ns for religious fanatics Protectors of the religion proving stalin points. Task failed successfully He didn't put a bounty on anyone's head, did he? Nope, I am from Tamilnadu and Santana Dharma doesn't refer to casteism. Just before Udayanidhi's speech, Veeramani of DK party spoke on the same dias and he literally said \"hinduism is sanatana Dharma\". He meant to end hinduism. Cos just before Udayanidhi's speech, Veeramani of DK party spoke and he literally equated hinduism and sanatana Dharma. ~~bounty?~~ You mean a fatwa? I don't know enough, what I wrote is what I have read online, and heard from several Tamilians. No, in Tamilnadu, overall caste based discrimination is linked to hinduism, just like terr*rism is linked with Isl*m. Both naratives are wrong. We recently started calling hinduism as sanatana Dharma in TN, that too due to the political narrative these Dravidians set, saying Hinduism is the name given by foreigners. And yes I am debating the same in the Tamil Nadu sub. Thanks to Udai Anna, to have awakened a sleeping hindu like me."
}