{
    "id": "13tv8y4",
    "title": "India inaugurates New Parliament House amidst opposing voices",
    "url": "https://www.reddit.com/r/india/comments/13tv8y4/india_inaugurates_new_parliament_house_amidst/",
    "selftext": "[\\(Modi in Parliament: Photo Credits ANI India\\)](https://preview.redd.it/0bjkizss7m2b1.png?width=549&format=png&auto=webp&v=enabled&s=4e9b62427bc55eb829edb4f380b91840a15571f1)\n\nModi continues on his mission for next elections. There are a lot of photo-ops and social media is full with Amrit Kaal posts . I can't understand what difference it will make. Will they finally start running the Parliament smoothly?\n\nIt is good that they have a new building but it is just a building.\n\nOne more such biased story.\n\n[https://jagmag.in/05423](https://jagmag.in/05423)\n\nI fail to understand how Indians can be fooled by all these gimmicks.",
    "flair": "Rant / Vent",
    "score": 139,
    "num_comments": 20,
    "created_utc": 1685262974.0,
    "convurl": "https://b.thumbs.redditmedia.com/ZvP8aNiY18Lc0-fKthZkhbNf2RoGdqIKX_MorTMyLzk.jpg",
    "comments": [
        "Why did n't Modi invite Vikas? Atleast Adani?",
        "Adani will stay low profile for some time. He is still trying to recover from the massive blow from the US short seller.",
        "Sarthak Goswami (on youtube) has posted a funny video where he said that it was such a big inauguration that Modi Ji wouldn't have let anyone else do it.\n\nSo, the opposition making this an issue that the President should have inaugurated it, is almost a non-issue. They had to find a better reasoning.",
        "Ha Ha. They go on visits abroad.",
        "Somebody’s truth is someone else’s propaganda…!!!",
        "\"One man's freedom fighter is another man's terrorist\"",
        "True that..!!",
        "In the post truth world, we can expect propaganda at a much better level. And spreading it is much easier these days, especially with WhatsApp University.",
        "I don't deny that. I am sure that in the future, there will be a need for more seating capacity. I am just wondering how everything done by the Modi government is turned into a splendor.",
        "So nice catchy post! have you heard about the requirements of additional MP's to represent the current population? There are ~560 seats now , and in a few years the number can shoot up to 800+.\n\nSure, if your idea is to get some camping chairs and find some space in current parliament great! \n\nBesides this was conceptualised and in work for over  15yrs. But yeah everything is political because you hate one political party and one man!",
        "Don't hate anyone. Hate is a strong word. Modi might have many faults but he provides a stable government.\n\nI don't like hero worship though.",
        "Brother this is a historical moment. Shut up, 🤫"
    ],
    "cleaned_text": "india inaugurates new parliament house amidst opposing voices modi parliament photo credits ani indiahttpspreviewredditbjkizssmbpngwidthformatpngautowebpvenabledsebbcebedbfbaf modi continues mission next elections lot photoops social media full amrit kaal posts cant understand difference make finally start running parliament smoothly good new building building one biased story httpsjagmaginhttpsjagmagin fail understand indians fooled gimmicks ",
    "cleaned_title": "india inaugurates new parliament house amidst opposing voices",
    "cleaned_selftext": "modi parliament photo credits ani indiahttpspreviewredditbjkizssmbpngwidthformatpngautowebpvenabledsebbcebedbfbaf modi continues mission next elections lot photoops social media full amrit kaal posts cant understand difference make finally start running parliament smoothly good new building building one biased story httpsjagmaginhttpsjagmagin fail understand indians fooled gimmicks",
    "cleaned_comments": "nt modi invite vikas atleast adani adani stay low profile time still trying recover massive blow us short seller sarthak goswami youtube posted funny video said big inauguration modi ji wouldnt let anyone else opposition making issue president inaugurated almost nonissue find better reasoning ha ha go visits abroad somebodys truth someone elses propaganda one mans freedom fighter another mans terrorist true post truth world expect propaganda much better level spreading much easier days especially whatsapp university dont deny sure future need seating capacity wondering everything done modi government turned splendor nice catchy post heard requirements additional mps represent current population seats years number shoot sure idea get camping chairs find space current parliament great besides conceptualised work yrs yeah everything political hate one political party one man dont hate anyone hate strong word modi might many faults provides stable government dont like hero worship though brother historical moment shut",
    "light_cleaned_title": "India inaugurates New Parliament House amidst opposing voices",
    "light_cleaned_selftext": "[\\(Modi in Parliament: Photo Credits ANI India\\)](https://preview.redd.it/0bjkizss7m2b1.png?width=549&format=png&auto=webp&v=enabled&s=4e9b62427bc55eb829edb4f380b91840a15571f1) Modi continues on his mission for next elections. There are a lot of photo-ops and social media is full with Amrit Kaal posts . I can't understand what difference it will make. Will they finally start running the Parliament smoothly? It is good that they have a new building but it is just a building. One more such biased story. [https://jagmag.in/05423](https://jagmag.in/05423) I fail to understand how Indians can be fooled by all these gimmicks.",
    "light_cleaned_comments": "Why did n't Modi invite Vikas? Atleast Adani? Adani will stay low profile for some time. He is still trying to recover from the massive blow from the US short seller. Sarthak Goswami (on youtube) has posted a funny video where he said that it was such a big inauguration that Modi Ji wouldn't have let anyone else do it. So, the opposition making this an issue that the President should have inaugurated it, is almost a non-issue. They had to find a better reasoning. Ha Ha. They go on visits abroad. Somebody’s truth is someone else’s propaganda…!!! \"One man's freedom fighter is another man's terrorist\" True that..!! In the post truth world, we can expect propaganda at a much better level. And spreading it is much easier these days, especially with WhatsApp University. I don't deny that. I am sure that in the future, there will be a need for more seating capacity. I am just wondering how everything done by the Modi government is turned into a splendor. So nice catchy post! have you heard about the requirements of additional MP's to represent the current population? There are ~560 seats now , and in a few years the number can shoot up to 800+. Sure, if your idea is to get some camping chairs and find some space in current parliament great! Besides this was conceptualised and in work for over 15yrs. But yeah everything is political because you hate one political party and one man! Don't hate anyone. Hate is a strong word. Modi might have many faults but he provides a stable government. I don't like hero worship though. Brother this is a historical moment. Shut up, 🤫"
}