{
    "id": "16cwerw",
    "title": "Modi: Taking The G20 To The Last Mile, Leaving None Behind – OpEd",
    "url": "https://www.eurasiareview.com/08092023-modi-taking-the-g20-to-the-last-mile-leaving-none-behind-oped/",
    "selftext": "Quite a long piece from someone who doesn’t believe in reading much!",
    "flair": "Politics",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1694135154.0,
    "convurl": "https://external-preview.redd.it/VvcCDzZAx5Vim5sPCyJikd4nX0KmVdYiV-5R29JrxLA.jpg?auto=webp&s=2d98383738eb0af2ff89dd622f818327f09d8ca0",
    "comments": [
        "Can someone help me understand what is Global South?",
        "Global South is developing countries with poverty, poor infrastructure and dense population. India is in the Northern hemisphere but falls in Global South due to the socio-economic indicators. \n\nEarlier there used to be the term \"East-West\" on economic-cultural lines, where East is poorer and West is richer but many Eastern nations like SE Asia, Japan, China aren't poor anymore and many Western countries are actually poor like Central America. \n\nHere is Wikipedia entry for more details: https://en.m.wikipedia.org/wiki/Global_North_and_Global_South",
        "India is falling into the trap of getting happy to just host this big prestige party instead of actually negotiating good deals for its people. It is an economic forum, not a marketing exercise. Get good deals.",
        "Modi 20 in delhi. It's a flood barrage of Modi posters and nothing else."
    ],
    "cleaned_text": "modi taking g last mile leaving none behind oped quite long piece someone doesnt believe reading much ",
    "cleaned_title": "modi taking g last mile leaving none behind oped",
    "cleaned_selftext": "quite long piece someone doesnt believe reading much",
    "cleaned_comments": "someone help understand global south global south developing countries poverty poor infrastructure dense population india northern hemisphere falls global south due socioeconomic indicators earlier used term eastwest economiccultural lines east poorer west richer many eastern nations like se asia japan china arent poor anymore many western countries actually poor like central america wikipedia entry details india falling trap getting happy host big prestige party instead actually negotiating good deals people economic forum marketing exercise get good deals modi delhi flood barrage modi posters nothing else",
    "light_cleaned_title": "Modi: Taking The G20 To The Last Mile, Leaving None Behind – OpEd",
    "light_cleaned_selftext": "Quite a long piece from someone who doesn’t believe in reading much!",
    "light_cleaned_comments": "Can someone help me understand what is Global South? Global South is developing countries with poverty, poor infrastructure and dense population. India is in the Northern hemisphere but falls in Global South due to the socio-economic indicators. Earlier there used to be the term \"East-West\" on economic-cultural lines, where East is poorer and West is richer but many Eastern nations like SE Asia, Japan, China aren't poor anymore and many Western countries are actually poor like Central America. Here is Wikipedia entry for more details: India is falling into the trap of getting happy to just host this big prestige party instead of actually negotiating good deals for its people. It is an economic forum, not a marketing exercise. Get good deals. Modi 20 in delhi. It's a flood barrage of Modi posters and nothing else."
}