{
    "id": "16akwq3",
    "title": "Update : Flipkart sent me a used phone with defects and is refusing to replace it.",
    "url": "https://www.reddit.com/r/india/comments/16akwq3/update_flipkart_sent_me_a_used_phone_with_defects/",
    "selftext": "Hey everyone! Last week I posted about purchasing a Samsung Galaxy S22 Ultra via Flipkart, which I learned was used and activated before I purchased it. - https://reddit.com/r/india/s/S8wXVVivLz Thank you all so much for sharing my tweet/retweeting, commenting/engaging in the tweet/etc.. I appreciate each one of you.\n\nAfter multiple calls and visits to an authorized Samsung service center, I was told today, by Samsung and Flipkart that nothing can be done. Samsung asked me to go to Flipkart for replacement, while Flipkart is asking me to contact Samsung. Moreover, Flipkart is now saying my return window is closed and I can't return the phone now.\n\nI am highly distraught now. Not sure how to go forward. I have a phone which I paid 86k for, which doesn't even turn on because the power button doesn't work. How should I proceed further?\n\nI've linked my new tweet here - https://twitter.com/70Rosh/status/1699006805920424217?t=hdtxo0zc0iLMlrdBOxdLLQ&s=19",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693911026.0,
    "convurl": "https://external-preview.redd.it/lDsXUyy37Lg0zp6JsldyU-JimEtIjfjb2L8rvTk1Soc.jpg?auto=webp&s=dfe9dd60355e2a9a668621847ee0c185369d4f49",
    "comments": [
        "Back in 2016 I bought a Sony Android TV from snapdeal, in a deal of over 60k. Had some problems with the thing (the package didn't have the mounting rod). Made a tweet about it, and shared it on reddit, tagged snapdeal on twitter as well. Snapdeal contacted me and said they would send the missing items separately, while their call center tried to close the deal saying they didn't promise any rod in their listing. I told them I was not gonna be shy of taking this to court, as the deal is of significant amount. They ended up sending the mounting rod a couple of days later.  But it was a shocker for me how they tried to cheat me in the first place.",
        "File a case in consumer court. They both will come begging with ways to resolve the issue in no time.",
        "Flipkart should be dissolved ffs.",
        "Threaten them with court.",
        "They need to be taught a lesson. Go to consumer forum.",
        "Seller ka naam batana",
        "Never buy from ScamKart",
        "If phone was activated before date of delivery. you should go to consumer court for refund.",
        "Nah, we need to have the execs and founders put in jail. If the judges actually had balls, they'd start jailing the founders and top execs for 10 days, for each and every instance of proven fraud. You'll find that the company will reform in hours.\n\nIt's because the people at the top never get punished that it continues happening. Got to punish the people at the very top, and change happens very very quickly.",
        "Yeah, go through consumer court. I tried a chargeback with my bank, let's see how it goes.",
        "There are certain protocols once implemented would avoid scams. But they don't."
    ],
    "cleaned_text": "update flipkart sent used phone defects refusing replace hey everyone last week posted purchasing samsung galaxy ultra via flipkart learned used activated purchased thank much sharing tweetretweeting commentingengaging tweetetc appreciate one multiple calls visits authorized samsung service center told today samsung flipkart nothing done samsung asked go flipkart replacement flipkart asking contact samsung moreover flipkart saying return window closed cant return phone highly distraught sure go forward phone paid k doesnt even turn power button doesnt work proceed ive linked new tweet ",
    "cleaned_title": "update flipkart sent used phone defects refusing replace",
    "cleaned_selftext": "hey everyone last week posted purchasing samsung galaxy ultra via flipkart learned used activated purchased thank much sharing tweetretweeting commentingengaging tweetetc appreciate one multiple calls visits authorized samsung service center told today samsung flipkart nothing done samsung asked go flipkart replacement flipkart asking contact samsung moreover flipkart saying return window closed cant return phone highly distraught sure go forward phone paid k doesnt even turn power button doesnt work proceed ive linked new tweet",
    "cleaned_comments": "back bought sony android tv snapdeal deal k problems thing package didnt mounting rod made tweet shared reddit tagged snapdeal twitter well snapdeal contacted said would send missing items separately call center tried close deal saying didnt promise rod listing told gon na shy taking court deal significant amount ended sending mounting rod couple days later shocker tried cheat first place file case consumer court come begging ways resolve issue time flipkart dissolved ffs threaten court need taught lesson go consumer forum seller ka naam batana never buy scamkart phone activated date delivery go consumer court refund nah need execs founders put jail judges actually balls theyd start jailing founders top execs days every instance proven fraud youll find company reform hours people top never get punished continues happening got punish people top change happens quickly yeah go consumer court tried chargeback bank lets see goes certain protocols implemented would avoid scams dont",
    "light_cleaned_title": "Update : Flipkart sent me a used phone with defects and is refusing to replace it.",
    "light_cleaned_selftext": "Hey everyone! Last week I posted about purchasing a Samsung Galaxy S22 Ultra via Flipkart, which I learned was used and activated before I purchased it. - Thank you all so much for sharing my tweet/retweeting, commenting/engaging in the tweet/etc.. I appreciate each one of you. After multiple calls and visits to an authorized Samsung service center, I was told today, by Samsung and Flipkart that nothing can be done. Samsung asked me to go to Flipkart for replacement, while Flipkart is asking me to contact Samsung. Moreover, Flipkart is now saying my return window is closed and I can't return the phone now. I am highly distraught now. Not sure how to go forward. I have a phone which I paid 86k for, which doesn't even turn on because the power button doesn't work. How should I proceed further? I've linked my new tweet here -",
    "light_cleaned_comments": "Back in 2016 I bought a Sony Android TV from snapdeal, in a deal of over 60k. Had some problems with the thing (the package didn't have the mounting rod). Made a tweet about it, and shared it on reddit, tagged snapdeal on twitter as well. Snapdeal contacted me and said they would send the missing items separately, while their call center tried to close the deal saying they didn't promise any rod in their listing. I told them I was not gonna be shy of taking this to court, as the deal is of significant amount. They ended up sending the mounting rod a couple of days later. But it was a shocker for me how they tried to cheat me in the first place. File a case in consumer court. They both will come begging with ways to resolve the issue in no time. Flipkart should be dissolved ffs. Threaten them with court. They need to be taught a lesson. Go to consumer forum. Seller ka naam batana Never buy from ScamKart If phone was activated before date of delivery. you should go to consumer court for refund. Nah, we need to have the execs and founders put in jail. If the judges actually had balls, they'd start jailing the founders and top execs for 10 days, for each and every instance of proven fraud. You'll find that the company will reform in hours. It's because the people at the top never get punished that it continues happening. Got to punish the people at the very top, and change happens very very quickly. Yeah, go through consumer court. I tried a chargeback with my bank, let's see how it goes. There are certain protocols once implemented would avoid scams. But they don't."
}