{
    "id": "1dhc0aw",
    "title": "Rant about how onexindia is just a circlejerk for incels and the future looks bleak at this point",
    "url": "https://www.reddit.com/r/india/comments/1dhc0aw/rant_about_how_onexindia_is_just_a_circlejerk_for/",
    "selftext": "Although there is no shortage of incels posting made-up shit on there, this post recently caught my eye.\n\nAlmost everything these people post is about how women are bad, alimony is the greatest evil on earth, and how twoxindia is worse than ISIS. It's almost brain rot to this insane level where not a single day goes by without them discussing how non-virgin girls are 'character-less.' \n\nThe joke is that these guys probably have never felt the touch of a lady, which is the most obvious thing ever because if they ever had, they probably wouldn't even post this.\n\nPeople on that sub are literally comparing cheaters to rapists, which in itself is such a sick thing to do. Like, bro, wtf even. \n\nThey make weird statements about the age of women and how sex before marriage is losing character, with the irony being that if these sick guys had a chance with any woman who dared to come close to them, they would be salivating like rabid dogs and would love to get laid, but they can't.\n\nThey say cheaters deserve all forms of abuse. Like, yes, cheating isn't a nice thing, but the extent they go to justify their virgin, insecure thoughts is almost sickening.\n\nThe amount of blackpill content on that sub is almost insane. \n\nI'll attach screenshots below of the people that replied to a comment I made on the post above. I won't hide the usernames because these sick, rabid fuckers deserve to be named and shamed. Mind you, it didn't take me more than a minute to find these comments, and if you put in like 5 minutes, you could find posts and comments way worse than these.\n\n[imgur link](https://imgur.com/a/I2YyXiK)",
    "flair": "Rant / Vent",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1718557258,
    "convurl": "https://external-preview.redd.it/04SXTfECQ6nsYdFmfxq9Lj0z971VTCDBAFn6iGjmuYg.jpg?auto=webp&s=9e0ac400d947daec8ac40f8cdf209aaf083ce567",
    "comments": [],
    "cleaned_text": "rant onexindia circlejerk incels future looks bleak point although shortage incels posting madeup shit post recently caught eye almost everything people post women bad alimony greatest evil earth twoxindia worse isis almost brain rot insane level single day goes without discussing nonvirgin girls characterless joke guys probably never felt touch lady obvious thing ever ever probably wouldnt even post people sub literally comparing cheaters rapists sick thing like bro wtf even make weird statements age women sex marriage losing character irony sick guys chance woman dared come close would salivating like rabid dogs would love get laid cant say cheaters deserve forms abuse like yes cheating isnt nice thing extent go justify virgin insecure thoughts almost sickening amount blackpill content sub almost insane ill attach screenshots people replied comment made post wont hide usernames sick rabid fuckers deserve named shamed mind didnt take minute find comments put like minutes could find posts comments way worse imgur linkhttpsimgurcomaiyyxik ",
    "cleaned_title": "rant onexindia circlejerk incels future looks bleak point",
    "cleaned_selftext": "although shortage incels posting madeup shit post recently caught eye almost everything people post women bad alimony greatest evil earth twoxindia worse isis almost brain rot insane level single day goes without discussing nonvirgin girls characterless joke guys probably never felt touch lady obvious thing ever ever probably wouldnt even post people sub literally comparing cheaters rapists sick thing like bro wtf even make weird statements age women sex marriage losing character irony sick guys chance woman dared come close would salivating like rabid dogs would love get laid cant say cheaters deserve forms abuse like yes cheating isnt nice thing extent go justify virgin insecure thoughts almost sickening amount blackpill content sub almost insane ill attach screenshots people replied comment made post wont hide usernames sick rabid fuckers deserve named shamed mind didnt take minute find comments put like minutes could find posts comments way worse imgur linkhttpsimgurcomaiyyxik",
    "cleaned_comments": "",
    "light_cleaned_title": "Rant about how onexindia is just a circlejerk for incels and the future looks bleak at this point",
    "light_cleaned_selftext": "Although there is no shortage of incels posting made-up shit on there, this post recently caught my eye. Almost everything these people post is about how women are bad, alimony is the greatest evil on earth, and how twoxindia is worse than ISIS. It's almost brain rot to this insane level where not a single day goes by without them discussing how non-virgin girls are 'character-less.' The joke is that these guys probably have never felt the touch of a lady, which is the most obvious thing ever because if they ever had, they probably wouldn't even post this. People on that sub are literally comparing cheaters to rapists, which in itself is such a sick thing to do. Like, bro, wtf even. They make weird statements about the age of women and how sex before marriage is losing character, with the irony being that if these sick guys had a chance with any woman who dared to come close to them, they would be salivating like rabid dogs and would love to get laid, but they can't. They say cheaters deserve all forms of abuse. Like, yes, cheating isn't a nice thing, but the extent they go to justify their virgin, insecure thoughts is almost sickening. The amount of blackpill content on that sub is almost insane. I'll attach screenshots below of the people that replied to a comment I made on the post above. I won't hide the usernames because these sick, rabid fuckers deserve to be named and shamed. Mind you, it didn't take me more than a minute to find these comments, and if you put in like 5 minutes, you could find posts and comments way worse than these. [imgur link](https://imgur.com/a/I2YyXiK)",
    "light_cleaned_comments": ""
}