{
    "id": "1cykula",
    "title": "What's going on! In our country ",
    "url": "https://www.reddit.com/gallery/1cykula",
    "selftext": "Way too much leverage for Richie's in our country. It's needs to stop 🛑",
    "flair": "Crime",
    "score": 483,
    "num_comments": 95,
    "created_utc": 1716440577,
    "convurl": "https://i.redd.it/3kt28gk2z32d1.jpg",
    "comments": [
        "What’s worse is first one didn’t even get attention in social media",
        "Bail ≠ acquittal\n\nYou're innocent until proven guilty. \n\nThe guy who crashed his Porsche is on bail as he's a kid. The law will decide guilt and punish accordingly in its own sweet time.",
        "Porsche in Pune and Mercedes in Nagpur - bail in 24 hours. Speedy justice \"for\" the rich. \n\nAnd the middle class and below have to have consent letter (the word letter is not specified in the traffic rule book - but used to intimidate for fine) from his father to drive his car or the fine is 5000. \n\nBut a 300 word essay for the Pune minor of 17yrs(also \"allegedly\" drunk - because the test they did failed but no one in their right mind does 100+ in city limits. Also the alibi of people in their party says they consumed alcohol)\n\nThis is what gives rise to the gunda culture, power hungry corrupt people.",
        "Modi Hai To Mumkin hai",
        "Upright bad driving skills ",
        "Yes! But we need to raise our voice and the criminal should be punished no matter what",
        "That kinda happens when you're driving under influence.",
        "If it makes you feel better, rich people get away with murder in a lot of countries.",
        "Iss ladki ke under, Pune accident mein marne wali bali ladki ki atma gush gaya he. The aap beeti series in reality.",
        "They are rich, once they have gotten bail it's basically equivalent to being free, the case may go on for years, but the kid will remain free",
        "Shocking...\nhttps://www.bbc.com/news/world-asia-india-35059007.amp",
        "Youa re hearingthis kind of incidents for the first time OP???\nThese has been going for ages now .There is no political willand also the society in general is not willing  to change",
        "There are around 463 deaths per day in India. Better Road safety and stricter policing is the order of the day. Make getting licences extremely difficult with extreme tests. Drunk and driving to 20 years jail minimum. Only rules like this will help solve the chaos on Indian roads.",
        " Money can buy you get out of jail card after committing murders in india.",
        "Jai gidi",
        "Factos.\n\nLaw is only for the poor and powerless.",
        "Have you seen a maruti driver doing this?\n\nBan all these luxury cars. 😤",
        "17 years 8 months",
        "was always the same thing. nothing new. its just getting more exposure now",
        "Traffic police just check helmets.",
        "I think they are deciding bail based on the vehicle . If you drive merc 24 hour , if you drive Porsche 15 hours .",
        "Dont know what the victim's family is going through,  such a pain is our judiciary. Paisa hi bolta hai yaha to. Business men leaving country after defaulting loans and farmers dying in their homes after harassment from banks and creditors. \nSometimes I feel like I should leave this country after my studies",
        ">the case may go on for years\n\nThis. When everything's cooled down, this case will be quitely closed.",
        "India mei garib hona aur uspr bhi lower caste se hona .....ek paap hai....ussee acha to mar jao.....ya to amir bano....kaise bhi",
        "The guardian should be thrown in jail if he's still considered minor. But they'll probably use their driver as scapegoat if things go that way.",
        "Even not in main media because they are busy bootlicking and window dressing. Swati Maliwal got so much coverage but what about the victims of that Revanna??",
        "One of these days such incidents are going to start a civil war in India.",
        "That's not how it works.",
        "Yeah 😔\n\nI have 1% hope that the law will be fair this time. Let's see.",
        "The Mercedes Woman was never arrested to this day.",
        "RemindMe! 1 year",
        "You want people to sit in jail while waiting for trial? I thought the consensus was bail is good and should be speedy. Why selective?",
        "Its the responsibility of local people first to raise voice. In second case Pune people took to the streets and social media to raise awareness then only established media highlighted it. Same should have been done by people og Nagpur for first case, otherwise news won't reach common people. In second case also now Agarwal's are trying to suppress or divert news in full force.",
        "I will be messaging you in 1 year on [**2025-05-23 05:53:00 UTC**](http://www.wolframalpha.com/input/?i=2025-05-23%2005:53:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1cykula/whats_going_on_in_our_country/l5aae7v/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1cykula%2Fwhats_going_on_in_our_country%2Fl5aae7v%2F%5D%0A%0ARemindMe%21%202025-05-23%2005%3A53%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201cykula)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "For the very first time I tend to agree with Rahul Gandhi on this incident about two India",
        "If you are filthy rich and/or have a political connection then you are free to do anything \nFrom these incidents it's confirmed",
        "The rich in our country can get away with almost anything. It may take time but they will always get away.",
        "Rules for thee, not for me",
        "That's a very poor argument imo",
        "The guy already can't drive until he's 25. \n\n\"Ooh but he's \"free\"\"",
        "Well, this is the country in which an Aston Martin once crashed into two cars, magically upgrading one from a Hyundai Elantra into a Skoda Superb and an old Audi A6 into a newer Audi A6.",
        "The guy couldn't drink until he's 18 and look what happened. He drank!",
        "no matter what you say but one thing is for sure the system only favors the rich whether it is police,law and order,etc\n\nyou can see this how police treats a poor and a rich",
        "We all need to be angry, we all need to show them what happens when you mess with the public, when you forget your place and act like gods on earth. We need to eat the rich, we need to get our justice.",
        "It's sarcasm...\n\nLike they are destroying pubs and talking about putting restrictions to Pune's night life.",
        "So? There's consequences.",
        "OMG, can't drive till 25, how will be survive. Thoughts and prayers with the kid who \"only\" killed 2 people and now poor fellow can't even drive a luxury car his dad gifted him till he's 25",
        "Disgusting and vile",
        "Do anyone name of the 17 year old and his father?",
        "Makes sense, Merc one can give less money as compared to Porsche one",
        "The case will be dragged on while he is free in bail and later the case will be pushed aside while he lives freely whereas the victim's family is bothered. The so called trial will be pushed aside quietly after sometime when social media outrage is gone",
        "Jus$tice ha$ been $erved. Our $y$tem is flawle$$.",
        "I wonder how much it is for Ferrari?",
        "The pune boy bullied former minister of Maharashtra’s son which forced that boy to transfer schools and when the porsche accident happened the boy told everyone that stop beating me and tell me how much money you want 💀💀💀 I am so shocked ppl like this exists. And imagine the influence his family has that he can bully a minister’s son and get away with it",
        "Money talks..",
        "Why did you even come to jail. E-bail!",
        "Indian police will take you straight to UK, Germany etc.",
        "This is very old news and it became an issue in Nagpur. The bloody lady apparently left the country",
        "It did become a big deal in Nagpur.",
        "This story was suppressed so quickly ..the deceased's  mother was a kidney patient and he had gone to buy her medicines in his Activa. \n\nThe drunk woman was coming home from partying when she hit the Activa. , The speed with which the matter was suprresed was alarming.",
        "Car culture should be abolished. Luxury cars should be banned in India, compelling everyone to use public transport. If public transport can be utilized as a vote bank tactic, why not encourage capitalists to use it as well?",
        "And they should but many more systematic changes are needed. \nIndividual enforcement can only go so far, it won't make a difference at scale.",
        "Don't know bro I have seen just too many instances of the rich guy getting a free out of jail card too many times. \n\nSpecially in car accidents, let's not call it accidents any more - you don't give a fast car to a minor in a public road and call it an accident. It's criminal negligence on all ends. \n\nThat too with minimal bail money or consequences. Regardless of the outrage. \n\nA 300 word essay is worth 2 lives? What a joke.\n\nPizza and burger were definitely fed to influence the alcohol/drug test. The guy hopped two restaurants in one night and was still hungry? I don't buy it. They could have done even better should have given them garlands and done a road parade and salutation of some form.\n\nI know I am being sarcastic on serious topic. But that's how ridiculous things are.\n\nFast cars give fast justice. Atleast for the one driving it.",
        "It's always been like that since the beginning, rich people always get away with everything, laws are designed and applicable to the general public only. Due to the Internet, we are getting aware of this more now. The hard truth is that this will never change. Just give it some days, and this car accident stuff will be forgotten by all and media will have some other stuff to play with. This kid will shift abroad and would live happily while the victims would suffer for their entire lives. The government or authorities don't care much about the general public (except during the election). We have 1.4 billion of these, and even if half of it get wiped out, that won't matter much to them. Justice is an expensive commodity that only rich and influential can afford.",
        "Such poor legal literacy and 0 knowledge of ground situations leads to people making dumbass comments. Some things to take note of :\n\n1. 1st stage of Bail is within 24 hours, almost everyone gets bail within this time.\n1. Bail is a right of everyone if the offence is bailable and is ready to furnish bail. Bail is not equal to acquittal and is rejected in pretty rare cases.\n2. Now a days people who cannot afford an advocate are provided one at the expense of the government at this stage as neither the government nor the courts want overcrowding of prisons. Even the requirement of surety is forgone in favor of not sending them to prison.\n3. Ofcourse the world is favourable to the rich, you have to be stupidly naive to think that economic status has no relevance in legal system. Rich people can afford better lawyers which makes all the difference.\n4. India is a massive country where information management is quite poor so rarely it does happen that a person stays in jail even if he can avail the benefit of the law to get out which would never happen with someone rich.",
        "I guess these rich brats carry licence to kill in these cars. If you hit someone resulting in death due to negligence/inebriated/rash driving etc, the fine should be 5Cr+ seizing the accident car+block driving for 5 years.",
        "Country and the court’s decision making being worse day by day",
        "its better than these murderers roaming free",
        "Too much population. Once again Too Fkin Much. And we all know which religion is to blame.",
        "Asli ID se aa Vedant",
        "But I thought you guys were against people sitting 10 years in jail for their trials?",
        "This is happening every day in our country, everyone knows of a case in their city. The Pune case came to light only because the victims were techies and their relatives were comparatively educated and contacted the media. In my own city a woman had mowed down someone with her car and before the police could do anything she was sent out of India and a settlement was reached with the victims. This is something everyone in my city knows but no one cares. People think that because the settlement is made with victims it's all okay, they forget that next time it may be themselves who are killed because of these drivers who keep on driving their expensive cars.",
        "Damn, Vedant Agarwal just found his soulmate",
        "Affects of BJP existing! 😂",
        "Not just that. Bro was served biryani and pizza in prison. Takes a pure psycho mindset to be able to eat peacefully after having taken 2 lives",
        "It's always been the case. These rich brats have been doing it. Similar to rape cases some of the cases just comes to our attention. It's a sad reality of our world, nothing has changed from the times of monarchy and colonialism, rich will always walk away scot free.",
        "Is there some sort of premium court kachahari processing that is included when you buy cars like Porche, Mercedes that I'm not aware of. Now these brands being super expensive makes sense...",
        "Our politicians are certified criminals. Genocide, extortion, and encounter killings is what got them to the top. If that's what represents our country at the highest level, is it any surprise to anyone that rich people can mow people down on the roads without any consequences? I think it's very much a continuity of the pattern. \n\nI don't know how a society can collectively change their mindset and outlook, and likely this will take decades, but we have a long way to go. People, especially the 15- 50 years age group, have to think that enough is enough. No one else is going to save us. \n\nThis applies right from the way we behave as a civil society to how we elect our politicians and what we demand out of them.",
        "Exactly as if the pub owners will be able to refuse a rich brat.  Must have gotten a barrage of 'tula maithe ka ki mazha baba kon aahe' if they refused to serve him booze.",
        "It's an accident, not murder that's why they get bail. They don't kill or hurt intentionally. It's an accident, that's why vehicles got insurance.",
        "A former minister how rich is this dude family",
        "His family also has connections with underworld",
        "This is sad. But i guess this is where the power of social media comes in. Juvenile Justice Board reversed the decision, cancelled bail for the kid. The father and the bar owner have been arrested. I guess that’s the one thing that works in this country. If even a fraction of us makes noise for the right cause things can change",
        "rich fuckin the poor. common public getting robbed by govt as always. you fed up with the shitty politics and poor quality of life. just india things.. mehh!😂",
        "They should refuse. Record him on camera whatever he says",
        "That will end badly for them only.",
        "Just read his grandfather (who vouched for him in juvenile justice board) has an attempt to murder case going on. His grandfather hired chotta shakeel gang for killing a corporator .",
        "As if things ended good for them now.",
        "Diversion hai bhai. They will be back to normal once elections are done. not the first club in Pune which fell into trouble",
        "He will never face the consequences of his actions, he will be free with no repercussions.",
        "Now they made it more ez to get a DL by leaving everything to the private driving schools, driving schools can issue licenses themselves after June 1",
        ">Diversion hai bhai\n\nYeah. Even kids know this now.",
        "Frl... I myself planning to persuade studying in foreign country"
    ],
    "cleaned_text": "whats going country way much leverage richies country needs stop ",
    "cleaned_title": "whats going country",
    "cleaned_selftext": "way much leverage richies country needs stop",
    "cleaned_comments": "whats worse first one didnt even get attention social media bail acquittal youre innocent proven guilty guy crashed porsche bail hes kid law decide guilt punish accordingly sweet time porsche pune mercedes nagpur bail hours speedy justice rich middle class consent letter word letter specified traffic rule book used intimidate fine father drive car fine word essay pune minor yrsalso allegedly drunk test failed one right mind city limits also alibi people party says consumed alcohol gives rise gunda culture power hungry corrupt people modi hai mumkin hai upright bad driving skills yes need raise voice criminal punished matter kinda happens youre driving influence makes feel better rich people get away murder lot countries iss ladki ke pune accident mein marne wali bali ladki ki atma gush gaya aap beeti series reality rich gotten bail basically equivalent free case may go years kid remain free shocking youa hearingthis kind incidents first time op going ages political willand also society general willing change around deaths per day india better road safety stricter policing order day make getting licences extremely difficult extreme tests drunk driving years jail minimum rules like help solve chaos indian roads money buy get jail card committing murders india jai gidi factos law poor powerless seen maruti driver ban luxury cars years months always thing nothing new getting exposure traffic police check helmets think deciding bail based vehicle drive merc hour drive porsche hours dont know victims family going pain judiciary paisa hi bolta hai yaha business men leaving country defaulting loans farmers dying homes harassment banks creditors sometimes feel like leave country studies case may go years everythings cooled case quitely closed india mei garib hona aur uspr bhi lower caste se hona ek paap haiussee acha mar jaoya amir banokaise bhi guardian thrown jail hes still considered minor theyll probably use driver scapegoat things go way even main media busy bootlicking window dressing swati maliwal got much coverage victims revanna one days incidents going start civil war india thats works yeah hope law fair time lets see mercedes woman never arrested day remindme year want people sit jail waiting trial thought consensus bail good speedy selective responsibility local people first raise voice second case pune people took streets social media raise awareness established media highlighted done people og nagpur first case otherwise news wont reach common people second case also agarwals trying suppress divert news full force messaging year utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentscykulawhatsgoingoninourcountrylaaevcontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfcykulafwhatsgoingoninourcountryflaaevfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletecykula infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback first time tend agree rahul gandhi incident two india filthy rich andor political connection free anything incidents confirmed rich country get away almost anything may take time always get away rules thee thats poor argument imo guy already cant drive hes ooh hes free well country aston martin crashed two cars magically upgrading one hyundai elantra skoda superb old audi newer audi guy couldnt drink hes look happened drank matter say one thing sure system favors rich whether policelaw orderetc see police treats poor rich need angry need show happens mess public forget place act like gods earth need eat rich need get justice sarcasm like destroying pubs talking putting restrictions punes night life theres consequences omg cant drive till survive thoughts prayers kid killed people poor fellow cant even drive luxury car dad gifted till hes disgusting vile anyone name year old father makes sense merc one give less money compared porsche one case dragged free bail later case pushed aside lives freely whereas victims family bothered called trial pushed aside quietly sometime social media outrage gone justice ha erved ytem flawle wonder much ferrari pune boy bullied former minister maharashtras son forced boy transfer schools porsche accident happened boy told everyone stop beating tell much money want shocked ppl like exists imagine influence family bully ministers son get away money talks even come jail ebail indian police take straight uk germany etc old news became issue nagpur bloody lady apparently left country become big deal nagpur story suppressed quickly deceaseds mother kidney patient gone buy medicines activa drunk woman coming home partying hit activa speed matter suprresed alarming car culture abolished luxury cars banned india compelling everyone use public transport public transport utilized vote bank tactic encourage capitalists use well many systematic changes needed individual enforcement go far wont make difference scale dont know bro seen many instances rich guy getting free jail card many times specially car accidents lets call accidents dont give fast car minor public road call accident criminal negligence ends minimal bail money consequences regardless outrage word essay worth lives joke pizza burger definitely fed influence alcoholdrug test guy hopped two restaurants one night still hungry dont buy could done even better given garlands done road parade salutation form know sarcastic serious topic thats ridiculous things fast cars give fast justice atleast one driving always like since beginning rich people always get away everything laws designed applicable general public due internet getting aware hard truth never change give days car accident stuff forgotten media stuff play kid shift abroad would live happily victims would suffer entire lives government authorities dont care much general public except election billion even half get wiped wont matter much justice expensive commodity rich influential afford poor legal literacy knowledge ground situations leads people making dumbass comments things take note st stage bail within hours almost everyone gets bail within time bail right everyone offence bailable ready furnish bail bail equal acquittal rejected pretty rare cases days people afford advocate provided one expense government stage neither government courts want overcrowding prisons even requirement surety forgone favor sending prison ofcourse world favourable rich stupidly naive think economic status relevance legal system rich people afford better lawyers makes difference india massive country information management quite poor rarely happen person stays jail even avail benefit law get would never happen someone rich guess rich brats carry licence kill cars hit someone resulting death due negligenceinebriatedrash driving etc fine cr seizing accident carblock driving years country courts decision making worse day day better murderers roaming free much population fkin much know religion blame asli id se aa vedant thought guys people sitting years jail trials happening every day country everyone knows case city pune case came light victims techies relatives comparatively educated contacted media city woman mowed someone car police could anything sent india settlement reached victims something everyone city knows one cares people think settlement made victims okay forget next time may killed drivers keep driving expensive cars damn vedant agarwal found soulmate affects bjp existing bro served biryani pizza prison takes pure psycho mindset able eat peacefully taken lives always case rich brats similar rape cases cases comes attention sad reality world nothing changed times monarchy colonialism rich always walk away scot free sort premium court kachahari processing included buy cars like porche mercedes im aware brands super expensive makes sense politicians certified criminals genocide extortion encounter killings got top thats represents country highest level surprise anyone rich people mow people roads without consequences think much continuity pattern dont know society collectively change mindset outlook likely take decades long way go people especially years age group think enough enough one else going save us applies right way behave civil society elect politicians demand exactly pub owners able refuse rich brat must gotten barrage tula maithe ka ki mazha baba kon aahe refused serve booze accident murder thats get bail dont kill hurt intentionally accident thats vehicles got insurance former minister rich dude family family also connections underworld sad guess power social media comes juvenile justice board reversed decision cancelled bail kid father bar owner arrested guess thats one thing works country even fraction us makes noise right cause things change rich fuckin poor common public getting robbed govt always fed shitty politics poor quality life india things mehh refuse record camera whatever says end badly read grandfather vouched juvenile justice board attempt murder case going grandfather hired chotta shakeel gang killing corporator things ended good diversion hai bhai back normal elections done first club pune fell trouble never face consequences actions free repercussions made ez get dl leaving everything private driving schools driving schools issue licenses june diversion hai bhai yeah even kids know frl planning persuade studying foreign country",
    "light_cleaned_title": "What's going on! In our country",
    "light_cleaned_selftext": "Way too much leverage for Richie's in our country. It's needs to stop 🛑",
    "light_cleaned_comments": "What’s worse is first one didn’t even get attention in social media Bail ≠ acquittal You're innocent until proven guilty. The guy who crashed his Porsche is on bail as he's a kid. The law will decide guilt and punish accordingly in its own sweet time. Porsche in Pune and Mercedes in Nagpur - bail in 24 hours. Speedy justice \"for\" the rich. And the middle class and below have to have consent letter (the word letter is not specified in the traffic rule book - but used to intimidate for fine) from his father to drive his car or the fine is 5000. But a 300 word essay for the Pune minor of 17yrs(also \"allegedly\" drunk - because the test they did failed but no one in their right mind does 100+ in city limits. Also the alibi of people in their party says they consumed alcohol) This is what gives rise to the gunda culture, power hungry corrupt people. Modi Hai To Mumkin hai Upright bad driving skills Yes! But we need to raise our voice and the criminal should be punished no matter what That kinda happens when you're driving under influence. If it makes you feel better, rich people get away with murder in a lot of countries. Iss ladki ke under, Pune accident mein marne wali bali ladki ki atma gush gaya he. The aap beeti series in reality. They are rich, once they have gotten bail it's basically equivalent to being free, the case may go on for years, but the kid will remain free Shocking... Youa re hearingthis kind of incidents for the first time OP??? These has been going for ages now .There is no political willand also the society in general is not willing to change There are around 463 deaths per day in India. Better Road safety and stricter policing is the order of the day. Make getting licences extremely difficult with extreme tests. Drunk and driving to 20 years jail minimum. Only rules like this will help solve the chaos on Indian roads. Money can buy you get out of jail card after committing murders in india. Jai gidi Factos. Law is only for the poor and powerless. Have you seen a maruti driver doing this? Ban all these luxury cars. 😤 17 years 8 months was always the same thing. nothing new. its just getting more exposure now Traffic police just check helmets. I think they are deciding bail based on the vehicle . If you drive merc 24 hour , if you drive Porsche 15 hours . Dont know what the victim's family is going through, such a pain is our judiciary. Paisa hi bolta hai yaha to. Business men leaving country after defaulting loans and farmers dying in their homes after harassment from banks and creditors. Sometimes I feel like I should leave this country after my studies >the case may go on for years This. When everything's cooled down, this case will be quitely closed. India mei garib hona aur uspr bhi lower caste se hona .....ek paap hai....ussee acha to mar jao.....ya to amir bano....kaise bhi The guardian should be thrown in jail if he's still considered minor. But they'll probably use their driver as scapegoat if things go that way. Even not in main media because they are busy bootlicking and window dressing. Swati Maliwal got so much coverage but what about the victims of that Revanna?? One of these days such incidents are going to start a civil war in India. That's not how it works. Yeah 😔 I have 1% hope that the law will be fair this time. Let's see. The Mercedes Woman was never arrested to this day. RemindMe! 1 year You want people to sit in jail while waiting for trial? I thought the consensus was bail is good and should be speedy. Why selective? Its the responsibility of local people first to raise voice. In second case Pune people took to the streets and social media to raise awareness then only established media highlighted it. Same should have been done by people og Nagpur for first case, otherwise news won't reach common people. In second case also now Agarwal's are trying to suppress or divert news in full force. I will be messaging you in 1 year on [**2025-05-23 05:53:00 UTC**](http://www.wolframalpha.com/input/?i=2025-05-23%2005:53:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1cykula/whats_going_on_in_our_country/l5aae7v/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1cykula%2Fwhats_going_on_in_our_country%2Fl5aae7v%2F%5D%0A%0ARemindMe%21%202025-05-23%2005%3A53%3A00%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201cykula) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| For the very first time I tend to agree with Rahul Gandhi on this incident about two India If you are filthy rich and/or have a political connection then you are free to do anything From these incidents it's confirmed The rich in our country can get away with almost anything. It may take time but they will always get away. Rules for thee, not for me That's a very poor argument imo The guy already can't drive until he's 25. \"Ooh but he's \"free\"\" Well, this is the country in which an Aston Martin once crashed into two cars, magically upgrading one from a Hyundai Elantra into a Skoda Superb and an old Audi A6 into a newer Audi A6. The guy couldn't drink until he's 18 and look what happened. He drank! no matter what you say but one thing is for sure the system only favors the rich whether it is police,law and order,etc you can see this how police treats a poor and a rich We all need to be angry, we all need to show them what happens when you mess with the public, when you forget your place and act like gods on earth. We need to eat the rich, we need to get our justice. It's sarcasm... Like they are destroying pubs and talking about putting restrictions to Pune's night life. So? There's consequences. OMG, can't drive till 25, how will be survive. Thoughts and prayers with the kid who \"only\" killed 2 people and now poor fellow can't even drive a luxury car his dad gifted him till he's 25 Disgusting and vile Do anyone name of the 17 year old and his father? Makes sense, Merc one can give less money as compared to Porsche one The case will be dragged on while he is free in bail and later the case will be pushed aside while he lives freely whereas the victim's family is bothered. The so called trial will be pushed aside quietly after sometime when social media outrage is gone Jus$tice ha$ been $erved. Our $y$tem is flawle$$. I wonder how much it is for Ferrari? The pune boy bullied former minister of Maharashtra’s son which forced that boy to transfer schools and when the porsche accident happened the boy told everyone that stop beating me and tell me how much money you want 💀💀💀 I am so shocked ppl like this exists. And imagine the influence his family has that he can bully a minister’s son and get away with it Money talks.. Why did you even come to jail. E-bail! Indian police will take you straight to UK, Germany etc. This is very old news and it became an issue in Nagpur. The bloody lady apparently left the country It did become a big deal in Nagpur. This story was suppressed so quickly ..the deceased's mother was a kidney patient and he had gone to buy her medicines in his Activa. The drunk woman was coming home from partying when she hit the Activa. , The speed with which the matter was suprresed was alarming. Car culture should be abolished. Luxury cars should be banned in India, compelling everyone to use public transport. If public transport can be utilized as a vote bank tactic, why not encourage capitalists to use it as well? And they should but many more systematic changes are needed. Individual enforcement can only go so far, it won't make a difference at scale. Don't know bro I have seen just too many instances of the rich guy getting a free out of jail card too many times. Specially in car accidents, let's not call it accidents any more - you don't give a fast car to a minor in a public road and call it an accident. It's criminal negligence on all ends. That too with minimal bail money or consequences. Regardless of the outrage. A 300 word essay is worth 2 lives? What a joke. Pizza and burger were definitely fed to influence the alcohol/drug test. The guy hopped two restaurants in one night and was still hungry? I don't buy it. They could have done even better should have given them garlands and done a road parade and salutation of some form. I know I am being sarcastic on serious topic. But that's how ridiculous things are. Fast cars give fast justice. Atleast for the one driving it. It's always been like that since the beginning, rich people always get away with everything, laws are designed and applicable to the general public only. Due to the Internet, we are getting aware of this more now. The hard truth is that this will never change. Just give it some days, and this car accident stuff will be forgotten by all and media will have some other stuff to play with. This kid will shift abroad and would live happily while the victims would suffer for their entire lives. The government or authorities don't care much about the general public (except during the election). We have 1.4 billion of these, and even if half of it get wiped out, that won't matter much to them. Justice is an expensive commodity that only rich and influential can afford. Such poor legal literacy and 0 knowledge of ground situations leads to people making dumbass comments. Some things to take note of : 1. 1st stage of Bail is within 24 hours, almost everyone gets bail within this time. 1. Bail is a right of everyone if the offence is bailable and is ready to furnish bail. Bail is not equal to acquittal and is rejected in pretty rare cases. 2. Now a days people who cannot afford an advocate are provided one at the expense of the government at this stage as neither the government nor the courts want overcrowding of prisons. Even the requirement of surety is forgone in favor of not sending them to prison. 3. Ofcourse the world is favourable to the rich, you have to be stupidly naive to think that economic status has no relevance in legal system. Rich people can afford better lawyers which makes all the difference. 4. India is a massive country where information management is quite poor so rarely it does happen that a person stays in jail even if he can avail the benefit of the law to get out which would never happen with someone rich. I guess these rich brats carry licence to kill in these cars. If you hit someone resulting in death due to negligence/inebriated/rash driving etc, the fine should be 5Cr+ seizing the accident car+block driving for 5 years. Country and the court’s decision making being worse day by day its better than these murderers roaming free Too much population. Once again Too Fkin Much. And we all know which religion is to blame. Asli ID se aa Vedant But I thought you guys were against people sitting 10 years in jail for their trials? This is happening every day in our country, everyone knows of a case in their city. The Pune case came to light only because the victims were techies and their relatives were comparatively educated and contacted the media. In my own city a woman had mowed down someone with her car and before the police could do anything she was sent out of India and a settlement was reached with the victims. This is something everyone in my city knows but no one cares. People think that because the settlement is made with victims it's all okay, they forget that next time it may be themselves who are killed because of these drivers who keep on driving their expensive cars. Damn, Vedant Agarwal just found his soulmate Affects of BJP existing! 😂 Not just that. Bro was served biryani and pizza in prison. Takes a pure psycho mindset to be able to eat peacefully after having taken 2 lives It's always been the case. These rich brats have been doing it. Similar to rape cases some of the cases just comes to our attention. It's a sad reality of our world, nothing has changed from the times of monarchy and colonialism, rich will always walk away scot free. Is there some sort of premium court kachahari processing that is included when you buy cars like Porche, Mercedes that I'm not aware of. Now these brands being super expensive makes sense... Our politicians are certified criminals. Genocide, extortion, and encounter killings is what got them to the top. If that's what represents our country at the highest level, is it any surprise to anyone that rich people can mow people down on the roads without any consequences? I think it's very much a continuity of the pattern. I don't know how a society can collectively change their mindset and outlook, and likely this will take decades, but we have a long way to go. People, especially the 15- 50 years age group, have to think that enough is enough. No one else is going to save us. This applies right from the way we behave as a civil society to how we elect our politicians and what we demand out of them. Exactly as if the pub owners will be able to refuse a rich brat. Must have gotten a barrage of 'tula maithe ka ki mazha baba kon aahe' if they refused to serve him booze. It's an accident, not murder that's why they get bail. They don't kill or hurt intentionally. It's an accident, that's why vehicles got insurance. A former minister how rich is this dude family His family also has connections with underworld This is sad. But i guess this is where the power of social media comes in. Juvenile Justice Board reversed the decision, cancelled bail for the kid. The father and the bar owner have been arrested. I guess that’s the one thing that works in this country. If even a fraction of us makes noise for the right cause things can change rich fuckin the poor. common public getting robbed by govt as always. you fed up with the shitty politics and poor quality of life. just india things.. mehh!😂 They should refuse. Record him on camera whatever he says That will end badly for them only. Just read his grandfather (who vouched for him in juvenile justice board) has an attempt to murder case going on. His grandfather hired chotta shakeel gang for killing a corporator . As if things ended good for them now. Diversion hai bhai. They will be back to normal once elections are done. not the first club in Pune which fell into trouble He will never face the consequences of his actions, he will be free with no repercussions. Now they made it more ez to get a DL by leaving everything to the private driving schools, driving schools can issue licenses themselves after June 1 >Diversion hai bhai Yeah. Even kids know this now. Frl... I myself planning to persuade studying in foreign country"
}