{
    "id": "1h41xmc",
    "title": "We need your support.",
    "url": "https://www.hindustantimes.com/cities/lucknow-news/privatisation-move-by-uppcl-corp-misleading-on-move-employee-terms-68-000-jobs-at-risk-101732805526510.html",
    "selftext": "The government's plan to privatize the Uttar Pradesh Power Corporation Limited (UPPCL) is a threat to our reliable and affordable electricity supply. This move will undoubtedly lead to:\n * Higher electricity costs: Private companies prioritize profits, leading to increased tariffs for consumers.\n * Job losses: Privatization often results in layoffs and job insecurity for UPPCL employees.\n * Compromised quality of service: Private companies may prioritize profit over service, leading to power cuts and poor infrastructure.\nJoin us in fighting the privatization of UPPCL. Your support is crucial!\n\n",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 7,
    "created_utc": 1733054933.0,
    "convurl": "https://external-preview.redd.it/hm34LE_8SkOMXuE3nCfVQuWW7mm2ds91FCEn2tYqIBQ.jpg?auto=webp&s=a6ec8d5411cc887f1d686f6081a45270415e2dd2",
    "comments": [
        "Chuttad Pradesh was fucked when BJP arrived.",
        "They will vote for the BJP, even when the BJP people are f++king their mothers and sisters. Privatisation, is a very key issue for these degenerates...",
        "I hope this happens, the people deserve what they voted for, they deserve to be in a blackout the bigoted assholes.",
        "If government employees showed respect and honesty in day-to-day interactions, people would have more sympathy. Instead, people are hit with insults, bribes, and shoddiness. I doubt people of UP have much sympathy for UPPCL employees. Affordable is the only one that sounds true. I doubt UPPCL is more reliable, has less power cuts, and has better infra compared to privatization.\n\nFrom my personal experiences, VSNL, BSNL, and passport office all improved after being privatized or partnering with private sector or getting private competition. Air India's the only one that seemed to have bucked that trend.\n\nAt least now, UPPCL employees should improve their behaviours toward customers. And the quality of service too if possible.",
        "You understand the gravity of the situation!"
    ],
    "cleaned_text": "need support governments plan privatize uttar pradesh power corporation limited uppcl threat reliable affordable electricity supply move undoubtedly lead higher electricity costs private companies prioritize profits leading increased tariffs consumers job losses privatization often results layoffs job insecurity uppcl employees compromised quality service private companies may prioritize profit service leading power cuts poor infrastructure join us fighting privatization uppcl support crucial ",
    "cleaned_title": "need support",
    "cleaned_selftext": "governments plan privatize uttar pradesh power corporation limited uppcl threat reliable affordable electricity supply move undoubtedly lead higher electricity costs private companies prioritize profits leading increased tariffs consumers job losses privatization often results layoffs job insecurity uppcl employees compromised quality service private companies may prioritize profit service leading power cuts poor infrastructure join us fighting privatization uppcl support crucial",
    "cleaned_comments": "chuttad pradesh fucked bjp arrived vote bjp even bjp people fking mothers sisters privatisation key issue degenerates hope happens people deserve voted deserve blackout bigoted assholes government employees showed respect honesty daytoday interactions people would sympathy instead people hit insults bribes shoddiness doubt people much sympathy uppcl employees affordable one sounds true doubt uppcl reliable less power cuts better infra compared privatization personal experiences vsnl bsnl passport office improved privatized partnering private sector getting private competition air indias one seemed bucked trend least uppcl employees improve behaviours toward customers quality service possible understand gravity situation",
    "light_cleaned_title": "We need your support.",
    "light_cleaned_selftext": "The government's plan to privatize the Uttar Pradesh Power Corporation Limited (UPPCL) is a threat to our reliable and affordable electricity supply. This move will undoubtedly lead to: * Higher electricity costs: Private companies prioritize profits, leading to increased tariffs for consumers. * Job losses: Privatization often results in layoffs and job insecurity for UPPCL employees. * Compromised quality of service: Private companies may prioritize profit over service, leading to power cuts and poor infrastructure. Join us in fighting the privatization of UPPCL. Your support is crucial!",
    "light_cleaned_comments": "Chuttad Pradesh was fucked when BJP arrived. They will vote for the BJP, even when the BJP people are f++king their mothers and sisters. Privatisation, is a very key issue for these degenerates... I hope this happens, the people deserve what they voted for, they deserve to be in a blackout the bigoted assholes. If government employees showed respect and honesty in day-to-day interactions, people would have more sympathy. Instead, people are hit with insults, bribes, and shoddiness. I doubt people of UP have much sympathy for UPPCL employees. Affordable is the only one that sounds true. I doubt UPPCL is more reliable, has less power cuts, and has better infra compared to privatization. From my personal experiences, VSNL, BSNL, and passport office all improved after being privatized or partnering with private sector or getting private competition. Air India's the only one that seemed to have bucked that trend. At least now, UPPCL employees should improve their behaviours toward customers. And the quality of service too if possible. You understand the gravity of the situation!"
}