{
    "id": "1dwnbo1",
    "title": "How compensation for Agniveers differs from that for regular soldiers",
    "url": "https://indianexpress.com/article/explained/compensation-agniveers-differs-from-regular-soldiers-9434369/",
    "selftext": "Rahul Gandhi has alleged that an Agniveer who died in January has not received compensation, an accusation the Govt and Army have denied. How much do families of Agniveers get in case of death, and under what heads?",
    "flair": "Policy/Economy",
    "score": 29,
    "num_comments": 6,
    "created_utc": 1720264733,
    "convurl": "https://external-preview.redd.it/k4uJgmfQca8HKZMtm_6sNduskQtLBc70TK0ExNFh2_4.jpg?auto=webp&s=61936143a0079d9c6d5e28eb9b41736fdc156705",
    "comments": [
        "INSURANCE: All regular soldiers contribute Rs 5,000 per month towards the Army Group Insurance Fund which insures them for Rs 50 lakh. Agniveers are insured for Rs 48 lakh, but they make no contribution from their salary towards the premium for this insurance.\nThe sum insured is paid to all soldiers and Agniveers irrespective of the cause of death.\nThe services have signed Memorandums of Understanding (MoUs) with the banks where the salaries of all defence personnel, including Agniveers, are credited under the defence salary package. These personnel are insured by the banks for various amounts as per the banks’ policies.\n\nEX GRATIA: A sum of Rs 44 lakh has been earmarked as ex gratia for Agniveers whose deaths are attributable and aggravated by military service, or occur during operations.\nThe ex gratia for a regular soldier can be Rs 25 lakh, Rs 35 lakh or Rs 45 lakh, depending on the nature of the casualty.\nDeaths, either of Agniveers or of regular soldiers, which are neither attributable to nor aggravated by military service are not eligible for any ex gratia.\nThe ex gratia from state governments varies from zero to Rs 1 crore, depending on the state. This is applicable to both Agniveers and regular soldiers who either die or suffer disabilities on duty.\n\nIN ADDITION: Agniveers and regular soldiers are given Rs 8 lakh in case of death in operations and Rs 2.5 lakh in case of death due to any other reason.\n\nSeva Nidhi for Agniveers\nSeva Nidhi is a contributory scheme applicable only to Agniveers. For those whose deaths are neither attributable to nor aggravated by military service, get the amount accumulated till the date of death, along with the government’s contribution and interest.\nAgniveers who die while on duty or in operations get the full pay for the unserved period up to four years, including the Seva Nidhi component.",
        "ONLY FOR REGULAR SOLDIERS\n\nSome benefits are exclusive to regular soldiers. Gratuity and monthly family pension, which is a substantial amount, are available only to regular soldiers.\nDeath gratuity of 15 days’ pay for every completed year of service or part thereof, subject to a maximum of Rs 25 lakh. This amount was recently revised from Rs 20 lakh after the Dearness Allowance (DA) crossed 50%.\nFamilies of soldiers who die due to reasons neither attributable to, nor aggravated by military service get ordinary family pension, which is 50% of the last pay drawn for up to 10 years, and 30% thereafter.\n\nIn case of deaths that are attributable to military service, a special family pension, which is 60% of the soldier’s last pay, applies. For soldiers killed in operations, a liberalised family pension, which 100% of the last pay, is given to the family. Liberalised family pensions are tax-free.\n\nThese pensions are revised as per the system of One Rank One Pay (OROP) and Pay Commission recommendations. The DA component is also added to the pensions.\n\nChildren of soldiers who die due to operational reasons are eligible for a children’s education allowance which is equal to the cost of school/ college fees and books till graduation. Transportation, hostel charges, and uniform costs are also included.\nFor other than battle casualties, an educational scholarship varying from Rs 10,000 per annum for Class 1 to Rs 50,000 per annum for professional courses is given. Wives of such soldiers are also entitled to Rs 20,000-50,000 per annum for graduation and professional courses.\n\n\nThe families of regular soldiers are entitled to benefits of the Ex-Servicemen Contributory Health Scheme (ECHS), a centrally-funded scheme along the lines of CGHS to provide medical care to armed forces pensioners and their families.",
        "A compressive article on who gets what and from whom.",
        "Can you summarise the point you're trying to make?",
        "I am not trying to make any point, indian express wrote this article. I have just posted it here as it is. \nInsurance - one by central govt and one by banks.\nEx gratia- paid by government.\nSevanidhi and remaining balance of salary of the term unserved \nThese are all paid to agniveer \nWhat he doesnt get\nPension\nGratuity \nEducation and health allowances to family\nThese all are only for regular army.\n\nOnly insurance has been paid till now to the martyr raga has mentioned.",
        "Ah ok.",
        "*‘Compensation, Insurance Different’: Rahul Gandhi Again Targets Modi Govt Amid Agniveer Row*\n\nhttps://english.jagran.com/india/congress-leader-rahul-gandhi-again-targets-modi-government-amid-agniveer-row-says-compensation-and-insurance-are-different-10171696\n\nRahul Gandhi shared a video in which he pointed out the difference between ‘insurance’ and ‘compensation’. \n\nIn the video, Ajay Kumar’s father emphasised that their family received Rs 50 lakh as insurance from a private bank and Rs 48 lakh from the Army Group Insurance Fund.\n\nThe Congress MP emphasised that the family had not received any ex-gratia payment from the government and also questioned why the salary arrears had not been credited to their bank account. \n\nNotably,  the 23-year-old Agniveer was killed on January 18 in a landmine blast near the Line of Control in Rajouri district of Jammu and Kashmir.\n\nAjay Kumar’s father reiterated that no money had been received from the central government and demanded that his family be given all the promised facilities, including a canteen card and pension.\n\n\"The family of every martyr who sacrifices his or her life for the country should be respected but the Modi government is discriminating against them. No matter what the government says, this is a matter of national security and I will keep raising it,\" Gandhi said.\n\n\"Rajnath Singh said that family of martyrs have been given Rs 1 crore. We haven't got that,\" the father of the martyr said. The Congress party has asked the central government to bring a \"white paper\" on the Agnipath scheme for short-term military recruitment so that the country would know the ground reality. \n\nThe grand old party also emphasised that Defence Minister Rajnath Singh lied in Parliament about the issue of compensation to families of Agnmiveers and demanded an apology for it."
    ],
    "cleaned_text": "compensation agniveers differs regular soldiers rahul gandhi alleged agniveer died january received compensation accusation govt army denied much families agniveers get case death heads ",
    "cleaned_title": "compensation agniveers differs regular soldiers",
    "cleaned_selftext": "rahul gandhi alleged agniveer died january received compensation accusation govt army denied much families agniveers get case death heads",
    "cleaned_comments": "insurance regular soldiers contribute rs per month towards army group insurance fund insures rs lakh agniveers insured rs lakh make contribution salary towards premium insurance sum insured paid soldiers agniveers irrespective cause death services signed memorandums understanding mous banks salaries defence personnel including agniveers credited defence salary package personnel insured banks various amounts per banks policies ex gratia sum rs lakh earmarked ex gratia agniveers whose deaths attributable aggravated military service occur operations ex gratia regular soldier rs lakh rs lakh rs lakh depending nature casualty deaths either agniveers regular soldiers neither attributable aggravated military service eligible ex gratia ex gratia state governments varies zero rs crore depending state applicable agniveers regular soldiers either die suffer disabilities duty addition agniveers regular soldiers given rs lakh case death operations rs lakh case death due reason seva nidhi agniveers seva nidhi contributory scheme applicable agniveers whose deaths neither attributable aggravated military service get amount accumulated till date death along governments contribution interest agniveers die duty operations get full pay unserved period four years including seva nidhi component regular soldiers benefits exclusive regular soldiers gratuity monthly family pension substantial amount available regular soldiers death gratuity days pay every completed year service part thereof subject maximum rs lakh amount recently revised rs lakh dearness allowance da crossed families soldiers die due reasons neither attributable aggravated military service get ordinary family pension last pay drawn years thereafter case deaths attributable military service special family pension soldiers last pay applies soldiers killed operations liberalised family pension last pay given family liberalised family pensions taxfree pensions revised per system one rank one pay orop pay commission recommendations da component also added pensions children soldiers die due operational reasons eligible childrens education allowance equal cost school college fees books till graduation transportation hostel charges uniform costs also included battle casualties educational scholarship varying rs per annum class rs per annum professional courses given wives soldiers also entitled rs per annum graduation professional courses families regular soldiers entitled benefits exservicemen contributory health scheme echs centrallyfunded scheme along lines cghs provide medical care armed forces pensioners families compressive article gets summarise point youre trying make trying make point indian express wrote article posted insurance one central govt one banks ex gratia paid government sevanidhi remaining balance salary term unserved paid agniveer doesnt get pension gratuity education health allowances family regular army insurance paid till martyr raga mentioned ah ok compensation insurance different rahul gandhi targets modi govt amid agniveer row rahul gandhi shared video pointed difference insurance compensation video ajay kumars father emphasised family received rs lakh insurance private bank rs lakh army group insurance fund congress mp emphasised family received exgratia payment government also questioned salary arrears credited bank account notably yearold agniveer killed january landmine blast near line control rajouri district jammu kashmir ajay kumars father reiterated money received central government demanded family given promised facilities including canteen card pension family every martyr sacrifices life country respected modi government discriminating matter government says matter national security keep raising gandhi said rajnath singh said family martyrs given rs crore havent got father martyr said congress party asked central government bring white paper agnipath scheme shortterm military recruitment country would know ground reality grand old party also emphasised defence minister rajnath singh lied parliament issue compensation families agnmiveers demanded apology",
    "light_cleaned_title": "How compensation for Agniveers differs from that for regular soldiers",
    "light_cleaned_selftext": "Rahul Gandhi has alleged that an Agniveer who died in January has not received compensation, an accusation the Govt and Army have denied. How much do families of Agniveers get in case of death, and under what heads?",
    "light_cleaned_comments": "INSURANCE: All regular soldiers contribute Rs 5,000 per month towards the Army Group Insurance Fund which insures them for Rs 50 lakh. Agniveers are insured for Rs 48 lakh, but they make no contribution from their salary towards the premium for this insurance. The sum insured is paid to all soldiers and Agniveers irrespective of the cause of death. The services have signed Memorandums of Understanding (MoUs) with the banks where the salaries of all defence personnel, including Agniveers, are credited under the defence salary package. These personnel are insured by the banks for various amounts as per the banks’ policies. EX GRATIA: A sum of Rs 44 lakh has been earmarked as ex gratia for Agniveers whose deaths are attributable and aggravated by military service, or occur during operations. The ex gratia for a regular soldier can be Rs 25 lakh, Rs 35 lakh or Rs 45 lakh, depending on the nature of the casualty. Deaths, either of Agniveers or of regular soldiers, which are neither attributable to nor aggravated by military service are not eligible for any ex gratia. The ex gratia from state governments varies from zero to Rs 1 crore, depending on the state. This is applicable to both Agniveers and regular soldiers who either die or suffer disabilities on duty. IN ADDITION: Agniveers and regular soldiers are given Rs 8 lakh in case of death in operations and Rs 2.5 lakh in case of death due to any other reason. Seva Nidhi for Agniveers Seva Nidhi is a contributory scheme applicable only to Agniveers. For those whose deaths are neither attributable to nor aggravated by military service, get the amount accumulated till the date of death, along with the government’s contribution and interest. Agniveers who die while on duty or in operations get the full pay for the unserved period up to four years, including the Seva Nidhi component. ONLY FOR REGULAR SOLDIERS Some benefits are exclusive to regular soldiers. Gratuity and monthly family pension, which is a substantial amount, are available only to regular soldiers. Death gratuity of 15 days’ pay for every completed year of service or part thereof, subject to a maximum of Rs 25 lakh. This amount was recently revised from Rs 20 lakh after the Dearness Allowance (DA) crossed 50%. Families of soldiers who die due to reasons neither attributable to, nor aggravated by military service get ordinary family pension, which is 50% of the last pay drawn for up to 10 years, and 30% thereafter. In case of deaths that are attributable to military service, a special family pension, which is 60% of the soldier’s last pay, applies. For soldiers killed in operations, a liberalised family pension, which 100% of the last pay, is given to the family. Liberalised family pensions are tax-free. These pensions are revised as per the system of One Rank One Pay (OROP) and Pay Commission recommendations. The DA component is also added to the pensions. Children of soldiers who die due to operational reasons are eligible for a children’s education allowance which is equal to the cost of school/ college fees and books till graduation. Transportation, hostel charges, and uniform costs are also included. For other than battle casualties, an educational scholarship varying from Rs 10,000 per annum for Class 1 to Rs 50,000 per annum for professional courses is given. Wives of such soldiers are also entitled to Rs 20,000-50,000 per annum for graduation and professional courses. The families of regular soldiers are entitled to benefits of the Ex-Servicemen Contributory Health Scheme (ECHS), a centrally-funded scheme along the lines of CGHS to provide medical care to armed forces pensioners and their families. A compressive article on who gets what and from whom. Can you summarise the point you're trying to make? I am not trying to make any point, indian express wrote this article. I have just posted it here as it is. Insurance - one by central govt and one by banks. Ex gratia- paid by government. Sevanidhi and remaining balance of salary of the term unserved These are all paid to agniveer What he doesnt get Pension Gratuity Education and health allowances to family These all are only for regular army. Only insurance has been paid till now to the martyr raga has mentioned. Ah ok. *‘Compensation, Insurance Different’: Rahul Gandhi Again Targets Modi Govt Amid Agniveer Row* Rahul Gandhi shared a video in which he pointed out the difference between ‘insurance’ and ‘compensation’. In the video, Ajay Kumar’s father emphasised that their family received Rs 50 lakh as insurance from a private bank and Rs 48 lakh from the Army Group Insurance Fund. The Congress MP emphasised that the family had not received any ex-gratia payment from the government and also questioned why the salary arrears had not been credited to their bank account. Notably, the 23-year-old Agniveer was killed on January 18 in a landmine blast near the Line of Control in Rajouri district of Jammu and Kashmir. Ajay Kumar’s father reiterated that no money had been received from the central government and demanded that his family be given all the promised facilities, including a canteen card and pension. \"The family of every martyr who sacrifices his or her life for the country should be respected but the Modi government is discriminating against them. No matter what the government says, this is a matter of national security and I will keep raising it,\" Gandhi said. \"Rajnath Singh said that family of martyrs have been given Rs 1 crore. We haven't got that,\" the father of the martyr said. The Congress party has asked the central government to bring a \"white paper\" on the Agnipath scheme for short-term military recruitment so that the country would know the ground reality. The grand old party also emphasised that Defence Minister Rajnath Singh lied in Parliament about the issue of compensation to families of Agnmiveers and demanded an apology for it."
}