{
    "id": "14ccnk4",
    "title": "Seeking Insights from Remote Workers in India!",
    "url": "https://www.reddit.com/r/india/comments/14ccnk4/seeking_insights_from_remote_workers_in_india/",
    "selftext": "Hello, fellow remote workers and work-from-home enthusiasts!\n\nI am conducting a survey for research purposes to gain valuable insights into the benefits and drawbacks of remote work and work-from-home arrangements. The aim is to inform strategies and policies that can enhance job satisfaction and work-life balance for remote workers like ourselves. If you have experience working remotely or have worked remotely in the past, your input would be incredibly valuable! By participating in this survey, you can contribute to a better understanding of the challenges and advantages of remote work within our country.\n\n[https://forms.gle/xqJLSRv5pTTsNYYp7](https://forms.gle/xqJLSRv5pTTsNYYp7)\n\nYour participation is completely **anonymous** and will take approximately 50-100 seconds to complete. To participate, simply click on the survey link provided above. Feel free to share the survey with other remote workers or individuals who have worked remotely in the past, as their perspectives are equally important.\n\nThank you so much for your time and valuable input!\n\n**Note: This survey is for research purposes only and does not involve any promotion or endorsement.**",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1687068326.0,
    "convurl": "https://external-preview.redd.it/oiknb1lkbO_WeYd7KsLiec0qJ4dnuddNeUqb67KUsho.jpg?auto=webp&v=enabled&s=10d06cedc786697d76d0ebb78b0c45dea9f1f304",
    "comments": [
        "No point calling it anonymous when you are collecting email addresses.  \n\n\nSwitch off the mandatory requirement to be signed in to google to fill in the form and you may get a better response, good will and trust  \n\n\nSee: [https://support.google.com/docs/thread/208364345/allow-users-without-a-google-account-to-fill-out-a-google-form?hl=en](https://support.google.com/docs/thread/208364345/allow-users-without-a-google-account-to-fill-out-a-google-form?hl=en)",
        "Email addresses are not collected but the sign in option is there to prevent spam. \nBut if you say so maybe I will turn that off.",
        "I think the final google sheet will still give you the email address using which the form was filled, so intentionally or not you will get the responders email address.  \n\n\nThere is a google form plugin that allows you to add Captcha. See Method 3 in this how to : [https://xfanatical.com/blog/3-ways-to-protect-google-forms-from-spamming/](https://xfanatical.com/blog/3-ways-to-protect-google-forms-from-spamming/)  \n\n\nNot tried it myself, but should solve the spam issue for you.",
        "Okay thank you so much."
    ],
    "cleaned_text": "seeking insights remote workers india hello fellow remote workers workfromhome enthusiasts conducting survey research purposes gain valuable insights benefits drawbacks remote work workfromhome arrangements aim inform strategies policies enhance job satisfaction worklife balance remote workers like experience working remotely worked remotely past input would incredibly valuable participating survey contribute better understanding challenges advantages remote work within country httpsformsglexqjlsrvpttsnyyphttpsformsglexqjlsrvpttsnyyp participation completely anonymous take approximately seconds complete participate simply click survey link provided feel free share survey remote workers individuals worked remotely past perspectives equally important thank much time valuable input note survey research purposes involve promotion endorsement ",
    "cleaned_title": "seeking insights remote workers india",
    "cleaned_selftext": "hello fellow remote workers workfromhome enthusiasts conducting survey research purposes gain valuable insights benefits drawbacks remote work workfromhome arrangements aim inform strategies policies enhance job satisfaction worklife balance remote workers like experience working remotely worked remotely past input would incredibly valuable participating survey contribute better understanding challenges advantages remote work within country httpsformsglexqjlsrvpttsnyyphttpsformsglexqjlsrvpttsnyyp participation completely anonymous take approximately seconds complete participate simply click survey link provided feel free share survey remote workers individuals worked remotely past perspectives equally important thank much time valuable input note survey research purposes involve promotion endorsement",
    "cleaned_comments": "point calling anonymous collecting email addresses switch mandatory requirement signed google fill form may get better response good trust see httpssupportgooglecomdocsthreadallowuserswithoutagoogleaccounttofilloutagoogleformhlenhttpssupportgooglecomdocsthreadallowuserswithoutagoogleaccounttofilloutagoogleformhlen email addresses collected sign option prevent spam say maybe turn think final google sheet still give email address using form filled intentionally get responders email address google form plugin allows add captcha see method httpsxfanaticalcomblogwaystoprotectgoogleformsfromspamminghttpsxfanaticalcomblogwaystoprotectgoogleformsfromspamming tried solve spam issue okay thank much",
    "light_cleaned_title": "Seeking Insights from Remote Workers in India!",
    "light_cleaned_selftext": "Hello, fellow remote workers and work-from-home enthusiasts! I am conducting a survey for research purposes to gain valuable insights into the benefits and drawbacks of remote work and work-from-home arrangements. The aim is to inform strategies and policies that can enhance job satisfaction and work-life balance for remote workers like ourselves. If you have experience working remotely or have worked remotely in the past, your input would be incredibly valuable! By participating in this survey, you can contribute to a better understanding of the challenges and advantages of remote work within our country. [https://forms.gle/xqJLSRv5pTTsNYYp7](https://forms.gle/xqJLSRv5pTTsNYYp7) Your participation is completely **anonymous** and will take approximately 50-100 seconds to complete. To participate, simply click on the survey link provided above. Feel free to share the survey with other remote workers or individuals who have worked remotely in the past, as their perspectives are equally important. Thank you so much for your time and valuable input! **Note: This survey is for research purposes only and does not involve any promotion or endorsement.**",
    "light_cleaned_comments": "No point calling it anonymous when you are collecting email addresses. Switch off the mandatory requirement to be signed in to google to fill in the form and you may get a better response, good will and trust See: [https://support.google.com/docs/thread/208364345/allow-users-without-a-google-account-to-fill-out-a-google-form?hl=en](https://support.google.com/docs/thread/208364345/allow-users-without-a-google-account-to-fill-out-a-google-form?hl=en) Email addresses are not collected but the sign in option is there to prevent spam. But if you say so maybe I will turn that off. I think the final google sheet will still give you the email address using which the form was filled, so intentionally or not you will get the responders email address. There is a google form plugin that allows you to add Captcha. See Method 3 in this how to : [https://xfanatical.com/blog/3-ways-to-protect-google-forms-from-spamming/](https://xfanatical.com/blog/3-ways-to-protect-google-forms-from-spamming/) Not tried it myself, but should solve the spam issue for you. Okay thank you so much."
}