{
    "id": "1d8ru6r",
    "title": "Do not buy from anything from AUTOSPARZ",
    "url": "https://i.redd.it/asfj90jtnr4d1.jpeg",
    "selftext": "ALERT ALL INDIANS. \n\nHello, if you are looking for car accessories \"online\", do not buy from autosparz website !\n\nProduct dikayenge in stock but you really dont know whether it is in stock or not. \nThey may take more than a month to dispatch the product or they may not dispatch at all and if you get frustrated and cancel the order they will never refund the money.\n\nTheir whatsapp support is useless infact the customer service is of no use. They do not read mails. They are based out of south india and and I don't want my Indian friends to fall in this TRAP.\n\nLook at the fucking reply.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1717599051.0,
    "convurl": "https://i.redd.it/asfj90jtnr4d1.jpeg",
    "comments": [
        "I’m also in the same trap. Waiting for weeks for a refund. Guy is a grade A scammer. Every week new excuse and new extension. Honestly have given up now. 3k ka fatka is not going to put me on the streets but a valuable lesson learnt not to deal with shady unknown websites.\n\nhttps://preview.redd.it/2vuh1nstor4d1.jpeg?width=1290&format=pjpg&auto=webp&s=edb8b90eda96ac517fcce3c41cf30cd2aca1c1d6",
        "did you receive your refund?",
        "Not yet"
    ],
    "cleaned_text": "buy anything autosparz alert indians hello looking car accessories online buy autosparz website product dikayenge stock really dont know whether stock may take month dispatch product may dispatch get frustrated cancel order never refund money whatsapp support useless infact customer service use read mails based south india dont want indian friends fall trap look fucking reply ",
    "cleaned_title": "buy anything autosparz",
    "cleaned_selftext": "alert indians hello looking car accessories online buy autosparz website product dikayenge stock really dont know whether stock may take month dispatch product may dispatch get frustrated cancel order never refund money whatsapp support useless infact customer service use read mails based south india dont want indian friends fall trap look fucking reply",
    "cleaned_comments": "im also trap waiting weeks refund guy grade scammer every week new excuse new extension honestly given k ka fatka going put streets valuable lesson learnt deal shady unknown websites receive refund yet",
    "light_cleaned_title": "Do not buy from anything from AUTOSPARZ",
    "light_cleaned_selftext": "ALERT ALL INDIANS. Hello, if you are looking for car accessories \"online\", do not buy from autosparz website ! Product dikayenge in stock but you really dont know whether it is in stock or not. They may take more than a month to dispatch the product or they may not dispatch at all and if you get frustrated and cancel the order they will never refund the money. Their whatsapp support is useless infact the customer service is of no use. They do not read mails. They are based out of south india and and I don't want my Indian friends to fall in this TRAP. Look at the fucking reply.",
    "light_cleaned_comments": "I’m also in the same trap. Waiting for weeks for a refund. Guy is a grade A scammer. Every week new excuse and new extension. Honestly have given up now. 3k ka fatka is not going to put me on the streets but a valuable lesson learnt not to deal with shady unknown websites. did you receive your refund? Not yet"
}