{
    "id": "1d8rio6",
    "title": "Indian men in Thailand",
    "url": "https://www.reddit.com/gallery/1d8rio6",
    "selftext": "Indian men behaviour in Thailand\n\nPosting from a throwaway account. Came across these comments on a travel sub. It is not new how most of Indian men react to when they are planning for Thailand. They have only one thought when Thailand is ever spoken about. When will Indian men understand it is NOT okay to behave like this in ANY place?? It may not be the most of the Indian men but it is most of Indian men in Thailand who do these sort of things. You really get a second hand embarrassment when you hear things like this. Don’t you think it is high time you fix it??? It’s not only people from other countries who are saying this but even my females friends you have been to Thailand stated the same that how intolerable Indian men are in Thailand. At least be shameful enough to know how to act and behave in public. This just feels like shit. ",
    "flair": "Rant / Vent",
    "score": 31,
    "num_comments": 56,
    "created_utc": 1717598228.0,
    "convurl": "https://i.redd.it/9lenu5ddlr4d1.jpg",
    "comments": [
        "I am not denying that Indian tourists aren't shitty. But, I cannot take the comment seriously when one of them states \"Indians bully the poorer Brits\" lmaoooo. C'mon, everyone and their mothers know British people have a bad rep while travelling.",
        "In which sub did you see these posts?",
        "There is a reason I had hidden those details.",
        "You should book yourself a ticket on any flight to Thailand leaving from India. You'll want to gouge out your eyes and poke your eardrums. But, I don't like how these foreigners generalize us and have a holier than thou attitude.",
        "You do realise the post is not about bullying Brits right?",
        "Pointing others mistake will not reduce our own. I think it’s high time we clean our house first.",
        "Long story short, don’t generalise Indian Men! Every country has these “types”! But I won’t outrightly deny it as well. \nSo let’s leave it at that!",
        "In this case, I don’t agree. It’s like most of Indian men are not like that but most of the Indian men who visit Thailand are like that and that is a good sample size to judge Indians. I mean if you are trying to deny that too the I don’t know what to say.",
        "No lies detected!",
        "Lol I have seen how uncle type people think about Thailand. It’s no wonder there are so many complaints about them.",
        "Well maybe you’re right because I haven’t yet been to Thailand to witness it firsthand!",
        "I personally find Indian men more misogynist, Indians are generally very conservative about social issues even leftist parties are only socially progressive about the caste, women's issues and LGBT issues are not seen as a concern in India. \n\nObviously those racist comments are unacceptable but I do believe that the Indian people being so conservative will have a tougher time integrating into liberal societies.",
        "Yes man they talk very reasonably in the post. Then in comments some Indian or other guy will make fun about some outrightly racist thing and then the OP will also second. I have seen this pattern. As they generalise I will also generalise. \n\nWe know there are issues, but this is not the right forum to solve them. We will work from within our society, grow richer and more educated. No need to service the rants from some random dude here",
        "In my experience, a lot of it boils down to jealousy. Indians have a lot more money than the trashy whites that visit. Compare phone they carry vs what Indians do, just for a simple example.\n\nOf course there are a ton of trashy Indians who visit but it's not as bad as those comments suggest. I've personally never given a fuck to white people and treat them for the sex tourist trash that they are. I can see why they hate me. They call us smelly while they walk around all day with literal shit in their asses because they don't wash. Fuck those trashy people.\n\nOn the other hand, there are tons of richer white people who don't have these prejudices and are a joy to hang out with.",
        "Sorry I lost interest mid way 😪",
        "Who are you? This is not the right forum to generalize and find solutions. We are addressing these issues at the appropriate level. Don't know what you want to get from here? DO you want us to accept that yes we all are creeps? Deal with the Indians in thailand however you want to but dont generalise",
        "Yeah bro whenever some other country write about india is dirty instead of improving ourselves we always try to defend ourselves and defamed them.",
        "It is very important to bring it here so people can become more aware of how it is affecting other side. Otherwise they will always be in this bubble without knowing and continue the same behaviour.",
        "We dont live in a close world. We know the issues . But I dont think it is healthy to engage with a foreigner on this who is going to propagate the stereotypes everywhere",
        "I am not engaging with anyone. I just saw this and posted it.",
        "Unrelated but this reminds me of an incident last year. My family went on a trip to Thailand. It was a speed boat site seeing. There was this tour guide “Yoyo” who was explaining the itinerary and safety instructions. She was speaking in a heavy accent but her English was legible. The speed boat was full of Indians who kept making fun of her accent and laughing as she spoke. Yoyo proceeded to say “first things first, RESPECT. I am here to help and if you respect me, I will respect you. I know you’re all Indians here and you have problems with this and maintaining timings but we have a schedule to follow so please be on time during site seeing.” One middle aged guy (who was one of the people who laughed at her) and his wife got offended and said “hey Yoyo you come to India you will know how Indians actually are”. There was some back and forth but didn’t get too serious. Guess what? Just like she predicted, the people in the boat had a serious problem with maintaining timings. It was actually very frustrating. My parents are timing fanatics so were always reached the boat first. Yoyo was like “I told you so” and we had no choice but to agree as all those people took their own sweet time to come back. Anyway, being late is inevitable sometimes but it was embarrassing the way they were making fun of her in front of her itself.",
        "In Amsterdam they're the worst. Throw bikes into canals if not locked up.",
        "Lol. So free. Seeing comments somewhere and coming and posting elsewhere. Cool . Have a nice day",
        "Indian men living in the US for decades still think it's ok to make rotted jokes about women and ogle young ladies. This isn't surprising. It doesn't mean it doesn't happen elsewhere, but the only house you can clean is your own.",
        "You do realise Internet doesn't like Indians and would make up any story because most people would gobble it up without a thought, right?",
        "Last time someone posted a similar screen shot from Canadian subreddit here and it was a Pakistani guy disguised as a Canadian women who posted intentionally against india. \n\n\nPeople in this were crying and asking for apologizes. \n\nJust a reminder",
        "Dude you can relax I am an Indian female. And these are intentional definitely but not to hurt someone but to learn from it.",
        "How is it elsewhere?? This is an Indian sub and it is about Indians. Why can’t for once you can stop defending and see things how it is??",
        "Our ego pseudo nationalism is too high.",
        "Dude people don’t want to accept it. Just see the rage in comment section. The level of offence these people are taking is laughable.",
        "Go to Goa and see how Indian men behave. In their own country if this is how they behave then Thailand is not a surprise.",
        "Unfortunately, I have seen most of these first hand. \n\nOur time in Thailand was a testament that a lot of these comments are speaking the truth. Our guide, Nooknik was harassed by some of the young men in our group. We also had separated breakfast area and I am going to be honest, it stung. The area allotted to us was small and the part of the restaurant with no natural light whereas the foreigners, mostly whites, had better seating areas with a great view. It was the same in every establishment we visited. We first thought that it was because we were a tour group but then I saw some east Asian tour group not receiving this treatment.\n\nOur hotel in Pattaya also had a few Tamil men bring in a ladyboy. They were mostly plastered drunk on the stairs and the only two standing took the ladyboy to their room. There were 6 men. Next morning, we heard from our guide that there was some commotion and that entire party of 6 was forced to cancel their stay. \n\nBut, unfortunately, I have also seen some shady things from the white foreigners. But it seems like they are not held as accountable as the Indians are.",
        "Ofc an identity crisis ridden Indian living in the West. I expected that only. I see 3 such posts every day. Own up to the thing that the country you belong to was/is poor, destitute, was colonized, and had lots of social issues. People will make fun of you and your race, and bombard you with stereotypes but try to think of yourself as an individual and not some group member. Other than that such anonymous confessions mean nothing. They have been malicious a lot of times with nefarious intentions",
        "Isnt this expected behavior. Are we surprised really?\nAnd these same people make a pikachu face when women pick bears.",
        "I think these habits are nurtured at home. If we disregard or joke about such issues here without calling people out, they'll always consider it's ok to do so. We as a culture really need to learn to spread awareness about social issues and stop one-upping each other for gaming the system.\nEven with the tipping culture, since we disregard people who do manual labour in our own country, do you really think we will give tips to bellboys in resorts and hotels outside India? We really take a lot for granted and until and unless it's not made aware, Indians will always have a bad repo as tourists",
        "Op, isnt this how they would behave here too if they have the liberty. I see men glorifying gng to thailand to \"enjoy\" themselves and all of them winking at each other. And this is the educated crowd.",
        "Thailand attracts the worst and it's their business model. U think this is and look up what Germans do there ur soul will tremble",
        "Dear OP\n\nA similar view along the lines of Indian men being ugly was posted in the sub and I commented that maybe attitude should be changed and the way I got down voted and trolled. None of the men were ready to accept or try and understand the point of view. The first step to change is accepting the deficiency and then working towards changing it! You have tall expectations is what I have come to say!!!",
        "You are doing everything other than addressing the real problem. Ofcourse things happened in the past but how long are you going to give the same excuse. Certain things are counted as mannerism and common sense which seems to be lacking here.",
        "I don’t agree with tipping culture too. We don’t have the culture of tipping. It is only if one feels really happy they like to tip.",
        "It was just an attempt to bring the how people from Thailand think about all of it. Thought people will try to learn from it but as usual they are doing what they do the best.",
        "I am a women. In no way it is affecting me or is about me. Saying a race they are ugly is racist. This is not. This is about basic mannerisms.",
        "How does it matter and how is it going to help us if someone is worst??",
        "Yes but one cannot change the appearance but what one can do is change attitude and behaviour. That goes a long way in changing perception. One can offset the other.",
        "That is what I was trying say.",
        "Worst is what Thailand caters to",
        "Indians be indianing. 💁‍♀️\n#notallmen ye bhi ake bolenge.",
        "I have seen this thing. Not acknowledging the situation but do everything to blame another side.",
        "Ma'am, I am doing a lot where it matters. We know the issues. You can try gelling with the whites.",
        "Ok, so you outright said that Indian men are ugly because their attitude is \"ugly\" and painted all in one brush and then you expect to get upvoted? The question was about physical appearance and you left no stone unturned to tell how Indian men are uncultured etc. Cut the crap.",
        "Expected the crass response. Nothing new in it."
    ],
    "cleaned_text": "indian men thailand indian men behaviour thailand posting throwaway account came across comments travel sub new indian men react planning thailand one thought thailand ever spoken indian men understand okay behave like place may indian men indian men thailand sort things really get second hand embarrassment hear things like dont think high time fix people countries saying even females friends thailand stated intolerable indian men thailand least shameful enough know act behave public feels like shit ",
    "cleaned_title": "indian men thailand",
    "cleaned_selftext": "indian men behaviour thailand posting throwaway account came across comments travel sub new indian men react planning thailand one thought thailand ever spoken indian men understand okay behave like place may indian men indian men thailand sort things really get second hand embarrassment hear things like dont think high time fix people countries saying even females friends thailand stated intolerable indian men thailand least shameful enough know act behave public feels like shit",
    "cleaned_comments": "denying indian tourists arent shitty take comment seriously one states indians bully poorer brits lmaoooo cmon everyone mothers know british people bad rep travelling sub see posts reason hidden details book ticket flight thailand leaving india youll want gouge eyes poke eardrums dont like foreigners generalize us holier thou attitude realise post bullying brits right pointing others mistake reduce think high time clean house first long story short dont generalise indian men every country types wont outrightly deny well lets leave case dont agree like indian men like indian men visit thailand like good sample size judge indians mean trying deny dont know say lies detected lol seen uncle type people think thailand wonder many complaints well maybe youre right havent yet thailand witness firsthand personally find indian men misogynist indians generally conservative social issues even leftist parties socially progressive caste womens issues lgbt issues seen concern india obviously racist comments unacceptable believe indian people conservative tougher time integrating liberal societies yes man talk reasonably post comments indian guy make fun outrightly racist thing op also second seen pattern generalise also generalise know issues right forum solve work within society grow richer educated need service rants random dude experience lot boils jealousy indians lot money trashy whites visit compare phone carry vs indians simple example course ton trashy indians visit bad comments suggest ive personally never given fuck white people treat sex tourist trash see hate call us smelly walk around day literal shit asses dont wash fuck trashy people hand tons richer white people dont prejudices joy hang sorry lost interest mid way right forum generalize find solutions addressing issues appropriate level dont know want get want us accept yes creeps deal indians thailand however want dont generalise yeah bro whenever country write india dirty instead improving always try defend defamed important bring people become aware affecting side otherwise always bubble without knowing continue behaviour dont live close world know issues dont think healthy engage foreigner going propagate stereotypes everywhere engaging anyone saw posted unrelated reminds incident last year family went trip thailand speed boat site seeing tour guide yoyo explaining itinerary safety instructions speaking heavy accent english legible speed boat full indians kept making fun accent laughing spoke yoyo proceeded say first things first respect help respect respect know youre indians problems maintaining timings schedule follow please time site seeing one middle aged guy one people laughed wife got offended said hey yoyo come india know indians actually back forth didnt get serious guess like predicted people boat serious problem maintaining timings actually frustrating parents timing fanatics always reached boat first yoyo like told choice agree people took sweet time come back anyway late inevitable sometimes embarrassing way making fun front amsterdam theyre worst throw bikes canals locked lol free seeing comments somewhere coming posting elsewhere cool nice day indian men living us decades still think ok make rotted jokes women ogle young ladies isnt surprising doesnt mean doesnt happen elsewhere house clean realise internet doesnt like indians would make story people would gobble without thought right last time someone posted similar screen shot canadian subreddit pakistani guy disguised canadian women posted intentionally india people crying asking apologizes reminder dude relax indian female intentional definitely hurt someone learn elsewhere indian sub indians cant stop defending see things ego pseudo nationalism high dude people dont want accept see rage comment section level offence people taking laughable go goa see indian men behave country behave thailand surprise unfortunately seen first hand time thailand testament lot comments speaking truth guide nooknik harassed young men group also separated breakfast area going honest stung area allotted us small part restaurant natural light whereas foreigners mostly whites better seating areas great view every establishment visited first thought tour group saw east asian tour group receiving treatment hotel pattaya also tamil men bring ladyboy mostly plastered drunk stairs two standing took ladyboy room men next morning heard guide commotion entire party forced cancel stay unfortunately also seen shady things white foreigners seems like held accountable indians ofc identity crisis ridden indian living west expected see posts every day thing country belong wasis poor destitute colonized lots social issues people make fun race bombard stereotypes try think individual group member anonymous confessions mean nothing malicious lot times nefarious intentions isnt expected behavior surprised really people make pikachu face women pick bears think habits nurtured home disregard joke issues without calling people theyll always consider ok culture really need learn spread awareness social issues stop oneupping gaming system even tipping culture since disregard people manual labour country really think give tips bellboys resorts hotels outside india really take lot granted unless made aware indians always bad repo tourists op isnt would behave liberty see men glorifying gng thailand enjoy winking educated crowd thailand attracts worst business model u think look germans ur soul tremble dear op similar view along lines indian men ugly posted sub commented maybe attitude changed way got voted trolled none men ready accept try understand point view first step change accepting deficiency working towards changing tall expectations come say everything addressing real problem ofcourse things happened past long going give excuse certain things counted mannerism common sense seems lacking dont agree tipping culture dont culture tipping one feels really happy like tip attempt bring people thailand think thought people try learn usual best women way affecting saying race ugly racist basic mannerisms matter going help us someone worst yes one change appearance one change attitude behaviour goes long way changing perception one offset trying say worst thailand caters indians indianing notallmen ye bhi ake bolenge seen thing acknowledging situation everything blame another side maam lot matters know issues try gelling whites ok outright said indian men ugly attitude ugly painted one brush expect get upvoted question physical appearance left stone unturned tell indian men uncultured etc cut crap expected crass response nothing new",
    "light_cleaned_title": "Indian men in Thailand",
    "light_cleaned_selftext": "Indian men behaviour in Thailand Posting from a throwaway account. Came across these comments on a travel sub. It is not new how most of Indian men react to when they are planning for Thailand. They have only one thought when Thailand is ever spoken about. When will Indian men understand it is NOT okay to behave like this in ANY place?? It may not be the most of the Indian men but it is most of Indian men in Thailand who do these sort of things. You really get a second hand embarrassment when you hear things like this. Don’t you think it is high time you fix it??? It’s not only people from other countries who are saying this but even my females friends you have been to Thailand stated the same that how intolerable Indian men are in Thailand. At least be shameful enough to know how to act and behave in public. This just feels like shit.",
    "light_cleaned_comments": "I am not denying that Indian tourists aren't shitty. But, I cannot take the comment seriously when one of them states \"Indians bully the poorer Brits\" lmaoooo. C'mon, everyone and their mothers know British people have a bad rep while travelling. In which sub did you see these posts? There is a reason I had hidden those details. You should book yourself a ticket on any flight to Thailand leaving from India. You'll want to gouge out your eyes and poke your eardrums. But, I don't like how these foreigners generalize us and have a holier than thou attitude. You do realise the post is not about bullying Brits right? Pointing others mistake will not reduce our own. I think it’s high time we clean our house first. Long story short, don’t generalise Indian Men! Every country has these “types”! But I won’t outrightly deny it as well. So let’s leave it at that! In this case, I don’t agree. It’s like most of Indian men are not like that but most of the Indian men who visit Thailand are like that and that is a good sample size to judge Indians. I mean if you are trying to deny that too the I don’t know what to say. No lies detected! Lol I have seen how uncle type people think about Thailand. It’s no wonder there are so many complaints about them. Well maybe you’re right because I haven’t yet been to Thailand to witness it firsthand! I personally find Indian men more misogynist, Indians are generally very conservative about social issues even leftist parties are only socially progressive about the caste, women's issues and LGBT issues are not seen as a concern in India. Obviously those racist comments are unacceptable but I do believe that the Indian people being so conservative will have a tougher time integrating into liberal societies. Yes man they talk very reasonably in the post. Then in comments some Indian or other guy will make fun about some outrightly racist thing and then the OP will also second. I have seen this pattern. As they generalise I will also generalise. We know there are issues, but this is not the right forum to solve them. We will work from within our society, grow richer and more educated. No need to service the rants from some random dude here In my experience, a lot of it boils down to jealousy. Indians have a lot more money than the trashy whites that visit. Compare phone they carry vs what Indians do, just for a simple example. Of course there are a ton of trashy Indians who visit but it's not as bad as those comments suggest. I've personally never given a fuck to white people and treat them for the sex tourist trash that they are. I can see why they hate me. They call us smelly while they walk around all day with literal shit in their asses because they don't wash. Fuck those trashy people. On the other hand, there are tons of richer white people who don't have these prejudices and are a joy to hang out with. Sorry I lost interest mid way 😪 Who are you? This is not the right forum to generalize and find solutions. We are addressing these issues at the appropriate level. Don't know what you want to get from here? DO you want us to accept that yes we all are creeps? Deal with the Indians in thailand however you want to but dont generalise Yeah bro whenever some other country write about india is dirty instead of improving ourselves we always try to defend ourselves and defamed them. It is very important to bring it here so people can become more aware of how it is affecting other side. Otherwise they will always be in this bubble without knowing and continue the same behaviour. We dont live in a close world. We know the issues . But I dont think it is healthy to engage with a foreigner on this who is going to propagate the stereotypes everywhere I am not engaging with anyone. I just saw this and posted it. Unrelated but this reminds me of an incident last year. My family went on a trip to Thailand. It was a speed boat site seeing. There was this tour guide “Yoyo” who was explaining the itinerary and safety instructions. She was speaking in a heavy accent but her English was legible. The speed boat was full of Indians who kept making fun of her accent and laughing as she spoke. Yoyo proceeded to say “first things first, RESPECT. I am here to help and if you respect me, I will respect you. I know you’re all Indians here and you have problems with this and maintaining timings but we have a schedule to follow so please be on time during site seeing.” One middle aged guy (who was one of the people who laughed at her) and his wife got offended and said “hey Yoyo you come to India you will know how Indians actually are”. There was some back and forth but didn’t get too serious. Guess what? Just like she predicted, the people in the boat had a serious problem with maintaining timings. It was actually very frustrating. My parents are timing fanatics so were always reached the boat first. Yoyo was like “I told you so” and we had no choice but to agree as all those people took their own sweet time to come back. Anyway, being late is inevitable sometimes but it was embarrassing the way they were making fun of her in front of her itself. In Amsterdam they're the worst. Throw bikes into canals if not locked up. Lol. So free. Seeing comments somewhere and coming and posting elsewhere. Cool . Have a nice day Indian men living in the US for decades still think it's ok to make rotted jokes about women and ogle young ladies. This isn't surprising. It doesn't mean it doesn't happen elsewhere, but the only house you can clean is your own. You do realise Internet doesn't like Indians and would make up any story because most people would gobble it up without a thought, right? Last time someone posted a similar screen shot from Canadian subreddit here and it was a Pakistani guy disguised as a Canadian women who posted intentionally against india. People in this were crying and asking for apologizes. Just a reminder Dude you can relax I am an Indian female. And these are intentional definitely but not to hurt someone but to learn from it. How is it elsewhere?? This is an Indian sub and it is about Indians. Why can’t for once you can stop defending and see things how it is?? Our ego pseudo nationalism is too high. Dude people don’t want to accept it. Just see the rage in comment section. The level of offence these people are taking is laughable. Go to Goa and see how Indian men behave. In their own country if this is how they behave then Thailand is not a surprise. Unfortunately, I have seen most of these first hand. Our time in Thailand was a testament that a lot of these comments are speaking the truth. Our guide, Nooknik was harassed by some of the young men in our group. We also had separated breakfast area and I am going to be honest, it stung. The area allotted to us was small and the part of the restaurant with no natural light whereas the foreigners, mostly whites, had better seating areas with a great view. It was the same in every establishment we visited. We first thought that it was because we were a tour group but then I saw some east Asian tour group not receiving this treatment. Our hotel in Pattaya also had a few Tamil men bring in a ladyboy. They were mostly plastered drunk on the stairs and the only two standing took the ladyboy to their room. There were 6 men. Next morning, we heard from our guide that there was some commotion and that entire party of 6 was forced to cancel their stay. But, unfortunately, I have also seen some shady things from the white foreigners. But it seems like they are not held as accountable as the Indians are. Ofc an identity crisis ridden Indian living in the West. I expected that only. I see 3 such posts every day. Own up to the thing that the country you belong to was/is poor, destitute, was colonized, and had lots of social issues. People will make fun of you and your race, and bombard you with stereotypes but try to think of yourself as an individual and not some group member. Other than that such anonymous confessions mean nothing. They have been malicious a lot of times with nefarious intentions Isnt this expected behavior. Are we surprised really? And these same people make a pikachu face when women pick bears. I think these habits are nurtured at home. If we disregard or joke about such issues here without calling people out, they'll always consider it's ok to do so. We as a culture really need to learn to spread awareness about social issues and stop one-upping each other for gaming the system. Even with the tipping culture, since we disregard people who do manual labour in our own country, do you really think we will give tips to bellboys in resorts and hotels outside India? We really take a lot for granted and until and unless it's not made aware, Indians will always have a bad repo as tourists Op, isnt this how they would behave here too if they have the liberty. I see men glorifying gng to thailand to \"enjoy\" themselves and all of them winking at each other. And this is the educated crowd. Thailand attracts the worst and it's their business model. U think this is and look up what Germans do there ur soul will tremble Dear OP A similar view along the lines of Indian men being ugly was posted in the sub and I commented that maybe attitude should be changed and the way I got down voted and trolled. None of the men were ready to accept or try and understand the point of view. The first step to change is accepting the deficiency and then working towards changing it! You have tall expectations is what I have come to say!!! You are doing everything other than addressing the real problem. Ofcourse things happened in the past but how long are you going to give the same excuse. Certain things are counted as mannerism and common sense which seems to be lacking here. I don’t agree with tipping culture too. We don’t have the culture of tipping. It is only if one feels really happy they like to tip. It was just an attempt to bring the how people from Thailand think about all of it. Thought people will try to learn from it but as usual they are doing what they do the best. I am a women. In no way it is affecting me or is about me. Saying a race they are ugly is racist. This is not. This is about basic mannerisms. How does it matter and how is it going to help us if someone is worst?? Yes but one cannot change the appearance but what one can do is change attitude and behaviour. That goes a long way in changing perception. One can offset the other. That is what I was trying say. Worst is what Thailand caters to Indians be indianing. 💁‍♀️ #notallmen ye bhi ake bolenge. I have seen this thing. Not acknowledging the situation but do everything to blame another side. Ma'am, I am doing a lot where it matters. We know the issues. You can try gelling with the whites. Ok, so you outright said that Indian men are ugly because their attitude is \"ugly\" and painted all in one brush and then you expect to get upvoted? The question was about physical appearance and you left no stone unturned to tell how Indian men are uncultured etc. Cut the crap. Expected the crass response. Nothing new in it."
}