{
    "id": "15vj591",
    "title": "How come Neeraj Epilepsy Clinic is still running?",
    "url": "https://www.reddit.com/r/india/comments/15vj591/how_come_neeraj_epilepsy_clinic_is_still_running/",
    "selftext": "Recently I came to know about world famous Neeraj Epilepsy Clinic  in Rishikesh India, as some acquaintance was trying to use it for epilepsy treatment. So I did some search.\n\nGoogle  have 2125 reviews with average 4.7 star, wow\n\nHindustan time has a article: Neeraj Clinic Provides Effective Epilepsy Treatment\n\n[https://www.hindustantimes.com/brand-stories/neeraj-clinic-provides-effective-epilepsy-treatment-under-the-aegis-of-smpl-101669285617665.html](https://www.hindustantimes.com/brand-stories/neeraj-clinic-provides-effective-epilepsy-treatment-under-the-aegis-of-smpl-101669285617665.html)\n\nbut that is a paid advertisement, similar paid articles in DNA etc.\n\nOk so I started searching more and found this\n\nIn 2017 R. K. Gupta founder of Neeraj Clinic was sentenced to 5 years\n\n[https://thelogicalindian.com/health/quack-epilepsy-specialist-sent-to-prison-by-court/](https://thelogicalindian.com/health/quack-epilepsy-specialist-sent-to-prison-by-court/)\n\nexcerpt from above:\n\n>“in the year 2000 — a three-member delegation comprising of Dr. V.N. Sharma, Dr. S.P. Singh and Dr. J. Rao of Karnataka of Indian Medical Association (IMA) anti-quackery cell visited and checked the working of the so-called epilepsy expert. They declared Gupta a quack. It was found that he was using Ashoka emblem on his prescription pad without holding any government office from which he should be punished. According to the findings, he was not even a registered medical practitioner. ”  \n\n\nthough he was released after 28 days, for lack of evidence\n\n[https://timesofindia.indiatimes.com/city/dehradun/doon-court-acquits-neeraj-clinics-rk-gupta/articleshow/62973168.cms](https://timesofindia.indiatimes.com/city/dehradun/doon-court-acquits-neeraj-clinics-rk-gupta/articleshow/62973168.cms)\n\nexcerpt from above:\n\n>It is to be noted that police had made an attempt to arrest Gupta on August 3, 2004, but people of Rishikesh protested and an angry crowd managed to free him. Gupta was accused of administering psychotropic substances to his patients in Neeraj Clinic.\n\nFurther search found these two other cases:\n\nRK gupta vs bhanwar kanwar (patient from 1993)\n\n[https://nja.gov.in/Concluded\\_Programmes/2018-19/SE-11\\_Mar\\_2019\\_PPTs/3.Bhanwar\\_Kanwar\\_vs\\_R.K.Gupta\\_Anr\\_on\\_5\\_April,\\_2013.pdf](https://nja.gov.in/Concluded_Programmes/2018-19/SE-11_Mar_2019_PPTs/3.Bhanwar_Kanwar_vs_R.K.Gupta_Anr_on_5_April,_2013.pdf)\n\nRK gupta vs neeru gupta (2006)\n\n[https://www.casemine.com/judgement/in/590a32754a932663936ff33a](https://www.casemine.com/judgement/in/590a32754a932663936ff33a)\n\nAs recent as 2019, they were making news\n\n[https://m.timesofindia.com/city/dehradun/2-held-for-passing-off-unauthorised-meds-as-epilepsy-cure/amp\\_articleshow/72298882.cms](https://m.timesofindia.com/city/dehradun/2-held-for-passing-off-unauthorised-meds-as-epilepsy-cure/amp_articleshow/72298882.cms)\n\n>According to police, Neeraj Clinic in the city had allegedly been giving out loose medicines. The head of the clinic, Dr RK Gupta, is absconding.\n\n&#x200B;\n\nSo now I am sitting here wondering, after all these cases, how come this is still allowed to run?",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692458773.0,
    "convurl": "https://external-preview.redd.it/-OIWJmHe37AADMk9M_za96L_UO15G--XKcHxzgYfZws.jpg?auto=webp&s=ff268339169f4c5077a8f84d6dba2e8c22e69dc9",
    "comments": [],
    "cleaned_text": "come neeraj epilepsy clinic still running recently came know world famous neeraj epilepsy clinic rishikesh india acquaintance trying use epilepsy treatment search google reviews average star wow hindustan time article neeraj clinic provides effective epilepsy treatment httpswwwhindustantimescombrandstoriesneerajclinicprovideseffectiveepilepsytreatmentundertheaegisofsmplhtmlhttpswwwhindustantimescombrandstoriesneerajclinicprovideseffectiveepilepsytreatmentundertheaegisofsmplhtml paid advertisement similar paid articles dna etc ok started searching found r k gupta founder neeraj clinic sentenced years httpsthelogicalindiancomhealthquackepilepsyspecialistsenttoprisonbycourthttpsthelogicalindiancomhealthquackepilepsyspecialistsenttoprisonbycourt excerpt year threemember delegation comprising dr vn sharma dr sp singh dr j rao karnataka indian medical association ima antiquackery cell visited checked working socalled epilepsy expert declared gupta quack found using ashoka emblem prescription pad without holding government office punished according findings even registered medical practitioner though released days lack evidence httpstimesofindiaindiatimescomcitydehradundooncourtacquitsneerajclinicsrkguptaarticleshowcmshttpstimesofindiaindiatimescomcitydehradundooncourtacquitsneerajclinicsrkguptaarticleshowcms excerpt noted police made attempt arrest gupta august people rishikesh protested angry crowd managed free gupta accused administering psychotropic substances patients neeraj clinic search found two cases rk gupta vs bhanwar kanwar patient httpsnjagovinconcludedprogrammessemarpptsbhanwarkanwarvsrkguptaanronaprilpdfhttpsnjagovinconcludedprogrammessemarpptsbhanwarkanwarvsrkguptaanronaprilpdf rk gupta vs neeru gupta httpswwwcaseminecomjudgementinaaffahttpswwwcaseminecomjudgementinaaffa recent making news httpsmtimesofindiacomcitydehradunheldforpassingoffunauthorisedmedsasepilepsycureamparticleshowcmshttpsmtimesofindiacomcitydehradunheldforpassingoffunauthorisedmedsasepilepsycureamparticleshowcms according police neeraj clinic city allegedly giving loose medicines head clinic dr rk gupta absconding xb sitting wondering cases come still allowed run ",
    "cleaned_title": "come neeraj epilepsy clinic still running",
    "cleaned_selftext": "recently came know world famous neeraj epilepsy clinic rishikesh india acquaintance trying use epilepsy treatment search google reviews average star wow hindustan time article neeraj clinic provides effective epilepsy treatment httpswwwhindustantimescombrandstoriesneerajclinicprovideseffectiveepilepsytreatmentundertheaegisofsmplhtmlhttpswwwhindustantimescombrandstoriesneerajclinicprovideseffectiveepilepsytreatmentundertheaegisofsmplhtml paid advertisement similar paid articles dna etc ok started searching found r k gupta founder neeraj clinic sentenced years httpsthelogicalindiancomhealthquackepilepsyspecialistsenttoprisonbycourthttpsthelogicalindiancomhealthquackepilepsyspecialistsenttoprisonbycourt excerpt year threemember delegation comprising dr vn sharma dr sp singh dr j rao karnataka indian medical association ima antiquackery cell visited checked working socalled epilepsy expert declared gupta quack found using ashoka emblem prescription pad without holding government office punished according findings even registered medical practitioner though released days lack evidence httpstimesofindiaindiatimescomcitydehradundooncourtacquitsneerajclinicsrkguptaarticleshowcmshttpstimesofindiaindiatimescomcitydehradundooncourtacquitsneerajclinicsrkguptaarticleshowcms excerpt noted police made attempt arrest gupta august people rishikesh protested angry crowd managed free gupta accused administering psychotropic substances patients neeraj clinic search found two cases rk gupta vs bhanwar kanwar patient httpsnjagovinconcludedprogrammessemarpptsbhanwarkanwarvsrkguptaanronaprilpdfhttpsnjagovinconcludedprogrammessemarpptsbhanwarkanwarvsrkguptaanronaprilpdf rk gupta vs neeru gupta httpswwwcaseminecomjudgementinaaffahttpswwwcaseminecomjudgementinaaffa recent making news httpsmtimesofindiacomcitydehradunheldforpassingoffunauthorisedmedsasepilepsycureamparticleshowcmshttpsmtimesofindiacomcitydehradunheldforpassingoffunauthorisedmedsasepilepsycureamparticleshowcms according police neeraj clinic city allegedly giving loose medicines head clinic dr rk gupta absconding xb sitting wondering cases come still allowed run",
    "cleaned_comments": "",
    "light_cleaned_title": "How come Neeraj Epilepsy Clinic is still running?",
    "light_cleaned_selftext": "Recently I came to know about world famous Neeraj Epilepsy Clinic in Rishikesh India, as some acquaintance was trying to use it for epilepsy treatment. So I did some search. Google have 2125 reviews with average 4.7 star, wow Hindustan time has a article: Neeraj Clinic Provides Effective Epilepsy Treatment [https://www.hindustantimes.com/brand-stories/neeraj-clinic-provides-effective-epilepsy-treatment-under-the-aegis-of-smpl-101669285617665.html](https://www.hindustantimes.com/brand-stories/neeraj-clinic-provides-effective-epilepsy-treatment-under-the-aegis-of-smpl-101669285617665.html) but that is a paid advertisement, similar paid articles in DNA etc. Ok so I started searching more and found this In 2017 R. K. Gupta founder of Neeraj Clinic was sentenced to 5 years [https://thelogicalindian.com/health/quack-epilepsy-specialist-sent-to-prison-by-court/](https://thelogicalindian.com/health/quack-epilepsy-specialist-sent-to-prison-by-court/) excerpt from above: >“in the year 2000 — a three-member delegation comprising of Dr. V.N. Sharma, Dr. S.P. Singh and Dr. J. Rao of Karnataka of Indian Medical Association (IMA) anti-quackery cell visited and checked the working of the so-called epilepsy expert. They declared Gupta a quack. It was found that he was using Ashoka emblem on his prescription pad without holding any government office from which he should be punished. According to the findings, he was not even a registered medical practitioner. ” though he was released after 28 days, for lack of evidence [https://timesofindia.indiatimes.com/city/dehradun/doon-court-acquits-neeraj-clinics-rk-gupta/articleshow/62973168.cms](https://timesofindia.indiatimes.com/city/dehradun/doon-court-acquits-neeraj-clinics-rk-gupta/articleshow/62973168.cms) excerpt from above: >It is to be noted that police had made an attempt to arrest Gupta on August 3, 2004, but people of Rishikesh protested and an angry crowd managed to free him. Gupta was accused of administering psychotropic substances to his patients in Neeraj Clinic. Further search found these two other cases: RK gupta vs bhanwar kanwar (patient from 1993) [https://nja.gov.in/Concluded\\_Programmes/2018-19/SE-11\\_Mar\\_2019\\_PPTs/3.Bhanwar\\_Kanwar\\_vs\\_R.K.Gupta\\_Anr\\_on\\_5\\_April,\\_2013.pdf](https://nja.gov.in/Concluded_Programmes/2018-19/SE-11_Mar_2019_PPTs/3.Bhanwar_Kanwar_vs_R.K.Gupta_Anr_on_5_April,_2013.pdf) RK gupta vs neeru gupta (2006) [https://www.casemine.com/judgement/in/590a32754a932663936ff33a](https://www.casemine.com/judgement/in/590a32754a932663936ff33a) As recent as 2019, they were making news [https://m.timesofindia.com/city/dehradun/2-held-for-passing-off-unauthorised-meds-as-epilepsy-cure/amp\\_articleshow/72298882.cms](https://m.timesofindia.com/city/dehradun/2-held-for-passing-off-unauthorised-meds-as-epilepsy-cure/amp_articleshow/72298882.cms) >According to police, Neeraj Clinic in the city had allegedly been giving out loose medicines. The head of the clinic, Dr RK Gupta, is absconding. &#x200B; So now I am sitting here wondering, after all these cases, how come this is still allowed to run?",
    "light_cleaned_comments": ""
}