{
    "id": "16c2jt3",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/16c2jt3/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&format=png&auto=webp&s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694050213.0,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Hello everyone,\nI need help regarding a job. What are the best sites to find job listings and receive interview calls (most importantly)? Have you come across any remote Digital Marketing jobs? I am planning to pursue a Data Analyst certification to upgrade my skills. Do you have any recommendations for courses or where I can obtain my certification(Institute recommendation ,preferably that offers 3-6 months ) ?",
        "Looking for a finance related internship.\n\nSkills : Financial Modelling , financial accounting , MS Excel , Python Programming\n\nUG Major : Math\n\nLocation : Remote\n\nDM if anyone interested.\n\nThanks.",
        "This was posted internally so if you are anyone you know fits the profile do let me know. \n\n1) Name of the company : Hinduja Tech Ltd\n\n2) Location: Chennai and others\n\n3) Requirements\n\nOur Openings\tRelevant Experience\tJob Location\n\nJava Full Stack Developer\t9 to 12 Years\tChennai\n\nSolution Architect\t\t10 to 15 Years\tChennai\n\nAngular Developer\t\t4 to 10 Years\tChennai\n\nData Engineer\t\t\t5 to 7 Years\tChennai I Hyderabad I Pune\n\nDevOps Engineer\t\t3 to 7 Years\tChennai Bengaluru\n\nReact UI Developer\t\t4 to 10 Years\tChennai\n\nSenior Business Analyst / Project Manager\t10 to 17 Years\tChennai\n\n\n4)  Preferred way of contacting  : DM me can refer internally."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall",
    "cleaned_comments": "hello everyone need help regarding job best sites find job listings receive interview calls importantly come across remote digital marketing jobs planning pursue data analyst certification upgrade skills recommendations courses obtain certificationinstitute recommendation preferably offers months looking finance related internship skills financial modelling financial accounting ms excel python programming ug major math location remote dm anyone interested thanks posted internally anyone know fits profile let know name company hinduja tech ltd location chennai others requirements openings relevant experience job location java full stack developer years chennai solution architect years chennai angular developer years chennai data engineer years chennai hyderabad pune devops engineer years chennai bengaluru react ui developer years chennai senior business analyst project manager years chennai preferred way contacting dm refer internally",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Hello everyone, I need help regarding a job. What are the best sites to find job listings and receive interview calls (most importantly)? Have you come across any remote Digital Marketing jobs? I am planning to pursue a Data Analyst certification to upgrade my skills. Do you have any recommendations for courses or where I can obtain my certification(Institute recommendation ,preferably that offers 3-6 months ) ? Looking for a finance related internship. Skills : Financial Modelling , financial accounting , MS Excel , Python Programming UG Major : Math Location : Remote DM if anyone interested. Thanks. This was posted internally so if you are anyone you know fits the profile do let me know. 1) Name of the company : Hinduja Tech Ltd 2) Location: Chennai and others 3) Requirements Our Openings Relevant Experience Job Location Java Full Stack Developer 9 to 12 Years Chennai Solution Architect 10 to 15 Years Chennai Angular Developer 4 to 10 Years Chennai Data Engineer 5 to 7 Years Chennai I Hyderabad I Pune DevOps Engineer 3 to 7 Years Chennai Bengaluru React UI Developer 4 to 10 Years Chennai Senior Business Analyst / Project Manager 10 to 17 Years Chennai 4) Preferred way of contacting : DM me can refer internally."
}