{
    "id": "1e15b8f",
    "title": "Special police team confirms Lawrence Bishnoi's TV interview was held in Punjab",
    "url": "https://www.indiatoday.in/india/story/special-team-confirms-lawrence-bishnois-tv-interview-was-held-in-punjab-2565061-2024-07-11",
    "selftext": "The Punjab and Haryana High Court has been informed by a SIT of the Punjab Police that one of the TV interviews of jailed gangster Lawrence Bishnoi in 2023 was conducted within the boundaries of Punjab.",
    "flair": "Law & Courts",
    "score": 10,
    "num_comments": 2,
    "created_utc": 1720747732.0,
    "convurl": "https://external-preview.redd.it/xuRkyuX8cEo_AFi1_5LpkyRWFOgOmfAiOGVEhjycTuM.jpg?auto=webp&s=481f488f5cdb6d2b3fff832a106a873525711815",
    "comments": [
        "This guy is a terrorist. But still some people hail him as a hero. \n\nThe same people blame a specific community for being terrorist sympathiser.",
        "Back in 2011, this Pissnoi guy was using school boys of Chandigarh to do his extortion, believe it or not, the only thing he answers to is Money.\n\nHis stooge himself said he phoned Moose Wala to ask for extortion money and Moose Wala abused him on the phone. He killed Moose Wala for clout to claim extortion money from other Punjabi singers.\n\nThis to mention, this nationalist is involved in drugs and weapons smuggling from Pakistan. Shame Indian media for glorifying him",
        "Indian media glorifies people like him to ridicule Sikhs and Punjabis. That's all"
    ],
    "cleaned_text": "special police team confirms lawrence bishnois tv interview held punjab punjab haryana high court informed sit punjab police one tv interviews jailed gangster lawrence bishnoi conducted within boundaries punjab ",
    "cleaned_title": "special police team confirms lawrence bishnois tv interview held punjab",
    "cleaned_selftext": "punjab haryana high court informed sit punjab police one tv interviews jailed gangster lawrence bishnoi conducted within boundaries punjab",
    "cleaned_comments": "guy terrorist still people hail hero people blame specific community terrorist sympathiser back pissnoi guy using school boys chandigarh extortion believe thing answers money stooge said phoned moose wala ask extortion money moose wala abused phone killed moose wala clout claim extortion money punjabi singers mention nationalist involved drugs weapons smuggling pakistan shame indian media glorifying indian media glorifies people like ridicule sikhs punjabis thats",
    "light_cleaned_title": "Special police team confirms Lawrence Bishnoi's TV interview was held in Punjab",
    "light_cleaned_selftext": "The Punjab and Haryana High Court has been informed by a SIT of the Punjab Police that one of the TV interviews of jailed gangster Lawrence Bishnoi in 2023 was conducted within the boundaries of Punjab.",
    "light_cleaned_comments": "This guy is a terrorist. But still some people hail him as a hero. The same people blame a specific community for being terrorist sympathiser. Back in 2011, this Pissnoi guy was using school boys of Chandigarh to do his extortion, believe it or not, the only thing he answers to is Money. His stooge himself said he phoned Moose Wala to ask for extortion money and Moose Wala abused him on the phone. He killed Moose Wala for clout to claim extortion money from other Punjabi singers. This to mention, this nationalist is involved in drugs and weapons smuggling from Pakistan. Shame Indian media for glorifying him Indian media glorifies people like him to ridicule Sikhs and Punjabis. That's all"
}