{
    "id": "18p2s54",
    "title": "Woman Judge Alleges Sexual Harassment, Appeals To CJI For Permission To End Life In A Letter",
    "url": "https://v.redd.it/a66vzswns08c1",
    "selftext": "UP Judge News: In Uttar Pradesh, a young woman judicial officer has penned an open letter to the Chief Justice of India, accusing her senior of sexual harassment during her previous posting. The letter, which has gone viral on social media, reveals the officer's distress, expressing a lack of hope for a fair inquiry or justice.\n\nThe two-page letter details the officer's initial enthusiasm upon joining the judicial service, only to endure severe abuse and harassment. She describes being treated like \"an unwanted insect\" and expresses disappointment that her complaints were not taken as the \"cardinal truth.\"",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1703326674.0,
    "convurl": "https://external-preview.redd.it/cW8xODlicG5zMDhjMTL3uMXvM7oLcMdus6MfcuH0Ef_xjxNS_Cuxv8A2q4NH.png?format=pjpg&auto=webp&s=320a136155def84589381a083db3b1b29b80cf8c",
    "comments": [
        "https://m.youtube.com/watch?v=UJpvL2cDpF0\n\nI think Indian express is a well reputed source."
    ],
    "cleaned_text": "woman judge alleges sexual harassment appeals cji permission end life letter judge news uttar pradesh young woman judicial officer penned open letter chief justice india accusing senior sexual harassment previous posting letter gone viral social media reveals officers distress expressing lack hope fair inquiry justice twopage letter details officers initial enthusiasm upon joining judicial service endure severe abuse harassment describes treated like unwanted insect expresses disappointment complaints taken cardinal truth ",
    "cleaned_title": "woman judge alleges sexual harassment appeals cji permission end life letter",
    "cleaned_selftext": "judge news uttar pradesh young woman judicial officer penned open letter chief justice india accusing senior sexual harassment previous posting letter gone viral social media reveals officers distress expressing lack hope fair inquiry justice twopage letter details officers initial enthusiasm upon joining judicial service endure severe abuse harassment describes treated like unwanted insect expresses disappointment complaints taken cardinal truth",
    "cleaned_comments": "think indian express well reputed source",
    "light_cleaned_title": "Woman Judge Alleges Sexual Harassment, Appeals To CJI For Permission To End Life In A Letter",
    "light_cleaned_selftext": "UP Judge News: In Uttar Pradesh, a young woman judicial officer has penned an open letter to the Chief Justice of India, accusing her senior of sexual harassment during her previous posting. The letter, which has gone viral on social media, reveals the officer's distress, expressing a lack of hope for a fair inquiry or justice. The two-page letter details the officer's initial enthusiasm upon joining the judicial service, only to endure severe abuse and harassment. She describes being treated like \"an unwanted insect\" and expresses disappointment that her complaints were not taken as the \"cardinal truth.\"",
    "light_cleaned_comments": "I think Indian express is a well reputed source."
}