{
    "id": "1763grd",
    "title": "Beware of Fake Reviews on AmbitionBox",
    "url": "https://www.reddit.com/r/india/comments/1763grd/beware_of_fake_reviews_on_ambitionbox/",
    "selftext": "I am looking for a decent job with 2 years of experience in accounting. I went for an interview in Noida at this company named as Setindiabiz Private Limited. I have applied for the job on naukri.com and as naukri.com is associated with AmbitionBox, I read the reviews before my interview. \n\nMy interview was about to start and the male manager (I think the boss) looked at my resume and realised that since I have experience, I will ask for at least 30K per month as salary. Before asking me anything, he said that he won't be giving me anything more than 25k since that's the budget for this post. I was so shocked to hear this as this is not how the interview process works. Without having any questions for me, he simply put out the number as if it's a sabji mandi and he is a vendor shouting prices. I told him that my previous salary was 32k and I won't take less than that. As expected, he asked me to leave.\n\nWho behaves like this with candidates? \n\nLater only I found out that there are some eye-opener reviews on ambition box which are downvoted by the management to cover up their failures. The reviews mostly point out job insecurity and non-payment along with the fact that a big company like them do not even sign employment agreements with the candidates so that the candidates should not sue them for such treatments. For each negative review posted, the company is posting at least 4 to 5 positive reviews. One of the reviews also says that the employees are given Rs 500 to post positive reviews. \n\nI talked to my college senior who has done his internship there. He said that the company hires 20 people and fires 15 people in two-three months period. You can't take leaves, there is no holiday except for 15th August and 2nd October. The company is run by one married couple and since they are Bihari, they are partial towards Bihari employees. My senior left his internship at this company as soon as he got another opportunity. \n\nI no longer know which website to trust for work culture reviews.\n\nThe link to these reviews : https://www.ambitionbox.com/reviews/setindiabiz-reviews",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697105557.0,
    "convurl": "https://external-preview.redd.it/Vj56O-j4UYQOShsv6VwlsE9SMHaIK-9qbSpG9AtWbcc.jpg?auto=webp&s=0537249f8a2254e9de5a80b44f3cc5b154965cbf",
    "comments": [
        "In my previous company, the founder & MD (a total toxic human) asked the employees to post reviews on Glassdoor. Most of them were new and were not exposed to the toxicity of the company so most reviews were positive.\n\nThe MD also said that we should report the negative ones as fake."
    ],
    "cleaned_text": "beware fake reviews ambitionbox looking decent job years experience accounting went interview noida company named setindiabiz private limited applied job naukricom naukricom associated ambitionbox read reviews interview interview start male manager think boss looked resume realised since experience ask least k per month salary asking anything said wont giving anything k since thats budget post shocked hear interview process works without questions simply put number sabji mandi vendor shouting prices told previous salary k wont take less expected asked leave behaves like candidates later found eyeopener reviews ambition box downvoted management cover failures reviews mostly point job insecurity nonpayment along fact big company like even sign employment agreements candidates candidates sue treatments negative review posted company posting least positive reviews one reviews also says employees given rs post positive reviews talked college senior done internship said company hires people fires people twothree months period cant take leaves holiday except th august nd october company run one married couple since bihari partial towards bihari employees senior left internship company soon got another opportunity longer know website trust work culture reviews link reviews ",
    "cleaned_title": "beware fake reviews ambitionbox",
    "cleaned_selftext": "looking decent job years experience accounting went interview noida company named setindiabiz private limited applied job naukricom naukricom associated ambitionbox read reviews interview interview start male manager think boss looked resume realised since experience ask least k per month salary asking anything said wont giving anything k since thats budget post shocked hear interview process works without questions simply put number sabji mandi vendor shouting prices told previous salary k wont take less expected asked leave behaves like candidates later found eyeopener reviews ambition box downvoted management cover failures reviews mostly point job insecurity nonpayment along fact big company like even sign employment agreements candidates candidates sue treatments negative review posted company posting least positive reviews one reviews also says employees given rs post positive reviews talked college senior done internship said company hires people fires people twothree months period cant take leaves holiday except th august nd october company run one married couple since bihari partial towards bihari employees senior left internship company soon got another opportunity longer know website trust work culture reviews link reviews",
    "cleaned_comments": "previous company founder md total toxic human asked employees post reviews glassdoor new exposed toxicity company reviews positive md also said report negative ones fake",
    "light_cleaned_title": "Beware of Fake Reviews on AmbitionBox",
    "light_cleaned_selftext": "I am looking for a decent job with 2 years of experience in accounting. I went for an interview in Noida at this company named as Setindiabiz Private Limited. I have applied for the job on naukri.com and as naukri.com is associated with AmbitionBox, I read the reviews before my interview. My interview was about to start and the male manager (I think the boss) looked at my resume and realised that since I have experience, I will ask for at least 30K per month as salary. Before asking me anything, he said that he won't be giving me anything more than 25k since that's the budget for this post. I was so shocked to hear this as this is not how the interview process works. Without having any questions for me, he simply put out the number as if it's a sabji mandi and he is a vendor shouting prices. I told him that my previous salary was 32k and I won't take less than that. As expected, he asked me to leave. Who behaves like this with candidates? Later only I found out that there are some eye-opener reviews on ambition box which are downvoted by the management to cover up their failures. The reviews mostly point out job insecurity and non-payment along with the fact that a big company like them do not even sign employment agreements with the candidates so that the candidates should not sue them for such treatments. For each negative review posted, the company is posting at least 4 to 5 positive reviews. One of the reviews also says that the employees are given Rs 500 to post positive reviews. I talked to my college senior who has done his internship there. He said that the company hires 20 people and fires 15 people in two-three months period. You can't take leaves, there is no holiday except for 15th August and 2nd October. The company is run by one married couple and since they are Bihari, they are partial towards Bihari employees. My senior left his internship at this company as soon as he got another opportunity. I no longer know which website to trust for work culture reviews. The link to these reviews :",
    "light_cleaned_comments": "In my previous company, the founder & MD (a total toxic human) asked the employees to post reviews on Glassdoor. Most of them were new and were not exposed to the toxicity of the company so most reviews were positive. The MD also said that we should report the negative ones as fake."
}