{
    "id": "12ml8jy",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/12ml8jy/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=ae6b7a10fa3272821e9904431dab0b993b36aae7",
    "flair": "Scheduled",
    "score": 11,
    "num_comments": 14,
    "created_utc": 1681522213.0,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "I watched Happy Family on Prime. They couldn't replicate the magic of Sarabhai vs Sarabhai & Khichdi.\n\nAtul Kulkarni was surprisingly good in comic role though.\n\n\nWatched The Pitchers S2, I felt it somehow glorified the toxic work culture in I.T. based startups.",
        "Where to watch Succession S4 in India?",
        "Am I the only one who didn't like john wick 4?\n\nAnd mandalorian s03e07 was awesome.",
        "The high seas",
        "John wick 4 sucked ass hair",
        "Scott Pilgrim is so funny and entertaining even after 13 years, its kind of unbelievable.",
        "Listened to this week LPOTL episode,good as always,Also finished Mr Robot S2 gawd it's good. Trying to complete Twin peaks.",
        "John Wick 3 was the best. That said 2nd half of John Wick 4 was really good but 1st half was crap",
        "Watched the old movie : Ijaazat. Stunned by the songs this album has, the lyrics are by far the best I have heard.\n\nAlso, a great movie. Way ahead of it's time :)\n\nEdit: Watch > watched",
        "Watched Damini, a stupendous movie. Didn't know Amir Khan also had an appearance.",
        "Those watching succession should also watch Barry. It's on the same level.",
        "Is anyone watching vinland saga season 2?"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall ",
    "cleaned_title": "biweekly movies tv shows documentaries podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionrestrictsronsortnewtall",
    "cleaned_comments": "watched happy family prime couldnt replicate magic sarabhai vs sarabhai khichdi atul kulkarni surprisingly good comic role though watched pitchers felt somehow glorified toxic work culture based startups watch succession india one didnt like john wick mandalorian se awesome high seas john wick sucked ass hair scott pilgrim funny entertaining even years kind unbelievable listened week lpotl episodegood alwaysalso finished mr robot gawd good trying complete twin peaks john wick best said nd half john wick really good st half crap watched old movie ijaazat stunned songs album lyrics far best heard also great movie way ahead time edit watch watched watched damini stupendous movie didnt know amir khan also appearance watching succession also watch barry level anyone watching vinland saga season",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries & Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "I watched Happy Family on Prime. They couldn't replicate the magic of Sarabhai vs Sarabhai & Khichdi. Atul Kulkarni was surprisingly good in comic role though. Watched The Pitchers S2, I felt it somehow glorified the toxic work culture in I.T. based startups. Where to watch Succession S4 in India? Am I the only one who didn't like john wick 4? And mandalorian s03e07 was awesome. The high seas John wick 4 sucked ass hair Scott Pilgrim is so funny and entertaining even after 13 years, its kind of unbelievable. Listened to this week LPOTL episode,good as always,Also finished Mr Robot S2 gawd it's good. Trying to complete Twin peaks. John Wick 3 was the best. That said 2nd half of John Wick 4 was really good but 1st half was crap Watched the old movie : Ijaazat. Stunned by the songs this album has, the lyrics are by far the best I have heard. Also, a great movie. Way ahead of it's time :) Edit: Watch > watched Watched Damini, a stupendous movie. Didn't know Amir Khan also had an appearance. Those watching succession should also watch Barry. It's on the same level. Is anyone watching vinland saga season 2?"
}