{
    "id": "161hj61",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/161hj61/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&s=bdf0b44db553b7c8c9f4a76aca3943d1728f7d3c",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693013409.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg",
    "comments": [
        "Almost done with Allan Quatermain by H Rider Haggard. Written in 1887, just a classic African adventure story.",
        "Mother by Maxim Gorky (1906)\n\nSet in Tsarist Russia. Talks about how a widowed illiterate mother becomes one of the leading figures of the revolution owing to her relationship with her revolutionary son. The story is kind of one dimensional but the socio political commentary is fantastic. People who dislike reading bland non fiction would love this to understand the ABCs of communism",
        "Also completed A tale of two cities by Dickens. Old classic literature can never get better than this, with so many memorable quotes and a beautiful story with one of the best character arcs ever",
        "Rereading How to build a car by Adrian Newey. Still one of my favourite autobiographies.",
        "Completed Crime and punishment by fyodor dotoevsky.",
        "How was it?",
        "Last book I read was Normal People by Sally Rooney",
        "It's really tough to read. Up until the very end.",
        "Ohh, could u suggest some easier ones then?",
        "Jane Austen=pride and prejudice\namartya sen-the argumentative indian\nShashi tharoor -the era of darkness.\nAlbert camus-the plague,Stranger\nSiddhartha - hermann hesse\nYukio mishima",
        "any murakami fan here?",
        "worth reading? its in my tbr",
        "Yes! I quite liked it but some people didn’t like it that much too so it depends! I personally loved it",
        "Currently reading The Infinite and the Divine. Going very slow, because of other things that I have to do.",
        "Currently onto 'A portrait of the artist as a young man' by joyce",
        "Currently reading through Complexity : A Guided Tour by Melanie Mitchell. What an amazing book about a difficult topic.",
        "Rereading Shadows of Self by Brandon Sanderson...",
        "Currently reading\n\n Thursday Murder Club by Richard Osman ,and\n\n Stories of Your Life and Other Stories by Ted Chiang",
        "Reading fairy tale by stephen king",
        "The God Delusion - Richard Dawkins\nThe future in the Past - Romila Thapar"
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "almost done allan quatermain h rider haggard written classic african adventure story mother maxim gorky set tsarist russia talks widowed illiterate mother becomes one leading figures revolution owing relationship revolutionary son story kind one dimensional socio political commentary fantastic people dislike reading bland non fiction would love understand abcs communism also completed tale two cities dickens old classic literature never get better many memorable quotes beautiful story one best character arcs ever rereading build car adrian newey still one favourite autobiographies completed crime punishment fyodor dotoevsky last book read normal people sally rooney really tough read end ohh could u suggest easier ones jane austenpride prejudice amartya senthe argumentative indian shashi tharoor era darkness albert camusthe plaguestranger siddhartha hermann hesse yukio mishima murakami fan worth reading tbr yes quite liked people didnt like much depends personally loved currently reading infinite divine going slow things currently onto portrait artist young man joyce currently reading complexity guided tour melanie mitchell amazing book difficult topic rereading shadows self brandon sanderson currently reading thursday murder club richard osman stories life stories ted chiang reading fairy tale stephen king god delusion richard dawkins future past romila thapar",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Almost done with Allan Quatermain by H Rider Haggard. Written in 1887, just a classic African adventure story. Mother by Maxim Gorky (1906) Set in Tsarist Russia. Talks about how a widowed illiterate mother becomes one of the leading figures of the revolution owing to her relationship with her revolutionary son. The story is kind of one dimensional but the socio political commentary is fantastic. People who dislike reading bland non fiction would love this to understand the ABCs of communism Also completed A tale of two cities by Dickens. Old classic literature can never get better than this, with so many memorable quotes and a beautiful story with one of the best character arcs ever Rereading How to build a car by Adrian Newey. Still one of my favourite autobiographies. Completed Crime and punishment by fyodor dotoevsky. How was it? Last book I read was Normal People by Sally Rooney It's really tough to read. Up until the very end. Ohh, could u suggest some easier ones then? Jane Austen=pride and prejudice amartya sen-the argumentative indian Shashi tharoor -the era of darkness. Albert camus-the plague,Stranger Siddhartha - hermann hesse Yukio mishima any murakami fan here? worth reading? its in my tbr Yes! I quite liked it but some people didn’t like it that much too so it depends! I personally loved it Currently reading The Infinite and the Divine. Going very slow, because of other things that I have to do. Currently onto 'A portrait of the artist as a young man' by joyce Currently reading through Complexity : A Guided Tour by Melanie Mitchell. What an amazing book about a difficult topic. Rereading Shadows of Self by Brandon Sanderson... Currently reading Thursday Murder Club by Richard Osman ,and Stories of Your Life and Other Stories by Ted Chiang Reading fairy tale by stephen king The God Delusion - Richard Dawkins The future in the Past - Romila Thapar"
}