{
    "id": "mg4rju",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/mg4rju/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games as your entire post, make sure to write a word or two about the games.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**The Gaming Thread is posted every two weeks on Tuesday mornings.**\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 16,
    "num_comments": 57,
    "created_utc": 1617067816,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Trying to complete RDR2. Also the swamp is the most terrifying place to be in at night.",
        "batman arkham knight. it's just impossible to complete in one night.",
        "Genshin Impact. Trying to reach AR31 and preparing for the grind after AR40. Story is worth the grind though.\n\n\nAR = Adventurer Rank\n\nAlso, Destiny 2 weekly reset is here so might do a grandmasters for title.\n\nP.S. Playing Subverse too. Check it out yourself.",
        "Ranked Grind on Apex, currently on Silver 4, just need a little more RP to get to Silver 3",
        "till you go to Roanoke Ridge",
        "Make sure to not use your Fragile Resins until you reach AR45 and domains of the highest level open. Then you're guaranteed a gold artifact with each run.",
        "Yup. Saving all fragile for AR 45. Might use original for low level domain rather than ley line blossom. I see more value there tbh.",
        "Yup, a much better option. I'm AR 55, and I rarely do blossoms even now. The game gives you enough Mora and Adventure books through the Battle Pass and the events, so you can make do without doing the blossoms unless you're in a hurry to level up a particular character.\n\nYou will feel a Mora pinch as your characters reach Lvl70+ and their talents go 6+, but that can be remedied by doing bounties, requests, and an occasional Wealth blossom or two in a week. No need to dedicate a large amount of your resin to it. Honestly, just take your time with leveling your characters up, embrace the RNG, and you'll enjoy the game's grind.",
        "Yup. All about the journey mate, all about the journey.",
        "Hitman 3",
        "What about PUBG Mobile in India? Still, banned?",
        "Just got Doom Eternal in the steam sale. It seems OKish, don’t get all the hype around it.",
        "Still playing Fire Emblem Three Houses",
        "I did. That was pretty wild too.\n\nThough the swamp has everything. Gators, Nightfolk and that ghost looking for her loved one.",
        "GTA SA",
        "Gosh it's so hard to kill the wither",
        "Paladins LULW.",
        "Two point hospital on xbox",
        "And once you get to the DLCs, it's so fast paced and unforgiving- it's a relentless assault of enemies- puts the best of FPS to shame",
        "That's disappointing man.....ideally it should've been one night",
        "Come guys let's play Titanfall 2 in a lobby of up to 12 (6v6). Some of the most fun to be had in FPS",
        "Control",
        "There are ghosts in RDR2?",
        "Classic! Will have fond memories of this one forever.",
        "Yeah. A few of them. There's a ghost train too. Caught that one completely at random while horse riding.",
        "People still play the KR version I think.",
        "Download APK using VPN on Android. Change App Store country and download on iOS/iPadOS.",
        "What platform?",
        "PC my man",
        "Him, as in Vladimir lem?",
        "Any recommendation for a good WW2 fps game ?",
        "I havent played much WW2 stuff 🙈\n\nWas BF1 WW2? And CoD World at War (it was my first FPS game, perhaps that's why it stands out).\n\nOther than these franchises, you might want to check out Medal of Honor",
        "Best villain ever.",
        "He was hiding in plain sight man... All the while I was thinking this Vinnie cogniti is a villain.. poor kid. Superb villain. Broke my heart that I had to kill him. Funny way to go, from some kind of chandelier or something.",
        "Wth.. that's so weird. It's honestly one of the most intense parts of the game dodging molotovs while runing around with an mp5 to shoot those blocks!!",
        "Roanoke ridge is just depressing af.",
        "Lol he does keep leaping around like a ninja everywhere.",
        "Any causal dota players?",
        "But 5 star artifacts can be complete shit too.",
        "Oh, of course. But 4 stars lose their value in end game when compared to 5 stars. Fragile Resins are a rare commodity, so best to save them for 5 stars, even if you can't guarantee a good 5 star artifact by using them.  If nothing, your shit 5 star artifacts are a better level up fodder for good artifacts than a whole bunch of worthless 4 stars.\n\nPersonally I don't even use my Fragiles to farm 5 stars, but save them for days when I decide to level up a character's talents. That way I can manage to farm all the necessary talent books in the same day. Feels like a better investment to me due to the guaranteed returns, but mathematically it makes no difference.",
        "Nice. I enjoy the grind. AR49 at the moment. I finish my dailies and just roam and forage for an hour or so. Farm ascendancy materials for team 2 for Spiral Sbyss. But I find great joy in min-maxing everybody, so that keeps me busy.",
        "Min-maxing for Spiral Abyss it pretty much the endgame, so yup, same here. Dailies, finish resin, roam around and farm crystals and mobs, sometimes co-op with random low level players to help them out. An hour or so each day. That's pretty much all the design of the game allows you to do.",
        "played it last week; loved the combat but the story was average at best.",
        "COD on Android phone.",
        "+1",
        "Any xbox players here ?",
        "Platform ?",
        "Bhai crusader 1 here.",
        "Free overwatch ftw",
        "PC"
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings",
    "cleaned_comments": "trying complete rdr also swamp terrifying place night batman arkham knight impossible complete one night genshin impact trying reach ar preparing grind ar story worth grind though ar adventurer rank also destiny weekly reset might grandmasters title ps playing subverse check ranked grind apex currently silver need little rp get silver till go roanoke ridge make sure use fragile resins reach ar domains highest level open youre guaranteed gold artifact run yup saving fragile ar might use original low level domain rather ley line blossom see value tbh yup much better option im ar rarely blossoms even game gives enough mora adventure books battle pass events make without blossoms unless youre hurry level particular character feel mora pinch characters reach lvl talents go remedied bounties requests occasional wealth blossom two week need dedicate large amount resin honestly take time leveling characters embrace rng youll enjoy games grind yup journey mate journey hitman pubg mobile india still banned got doom eternal steam sale seems okish dont get hype around still playing fire emblem three houses pretty wild though swamp everything gators nightfolk ghost looking loved one gta sa gosh hard kill wither paladins lulw two point hospital xbox get dlcs fast paced unforgiving relentless assault enemies puts best fps shame thats disappointing manideally shouldve one night come guys lets play titanfall lobby v fun fps control ghosts rdr classic fond memories one forever yeah theres ghost train caught one completely random horse riding people still play kr version think download apk using vpn android change app store country download iosipados platform pc man vladimir lem recommendation good ww fps game havent played much ww stuff bf ww cod world war first fps game perhaps thats stands franchises might want check medal honor best villain ever hiding plain sight man thinking vinnie cogniti villain poor kid superb villain broke heart kill funny way go kind chandelier something wth thats weird honestly one intense parts game dodging molotovs runing around mp shoot blocks roanoke ridge depressing af lol keep leaping around like ninja everywhere causal dota players star artifacts complete shit oh course stars lose value end game compared stars fragile resins rare commodity best save stars even cant guarantee good star artifact using nothing shit star artifacts better level fodder good artifacts whole bunch worthless stars personally dont even use fragiles farm stars save days decide level characters talents way manage farm necessary talent books day feels like better investment due guaranteed returns mathematically makes difference nice enjoy grind ar moment finish dailies roam forage hour farm ascendancy materials team spiral sbyss find great joy minmaxing everybody keeps busy minmaxing spiral abyss pretty much endgame yup dailies finish resin roam around farm crystals mobs sometimes coop random low level players help hour day thats pretty much design game allows played last week loved combat story average best cod android phone xbox players platform bhai crusader free overwatch ftw pc",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games as your entire post, make sure to write a word or two about the games. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **The Gaming Thread is posted every two weeks on Tuesday mornings.**",
    "light_cleaned_comments": "Trying to complete RDR2. Also the swamp is the most terrifying place to be in at night. batman arkham knight. it's just impossible to complete in one night. Genshin Impact. Trying to reach AR31 and preparing for the grind after AR40. Story is worth the grind though. AR = Adventurer Rank Also, Destiny 2 weekly reset is here so might do a grandmasters for title. P.S. Playing Subverse too. Check it out yourself. Ranked Grind on Apex, currently on Silver 4, just need a little more RP to get to Silver 3 till you go to Roanoke Ridge Make sure to not use your Fragile Resins until you reach AR45 and domains of the highest level open. Then you're guaranteed a gold artifact with each run. Yup. Saving all fragile for AR 45. Might use original for low level domain rather than ley line blossom. I see more value there tbh. Yup, a much better option. I'm AR 55, and I rarely do blossoms even now. The game gives you enough Mora and Adventure books through the Battle Pass and the events, so you can make do without doing the blossoms unless you're in a hurry to level up a particular character. You will feel a Mora pinch as your characters reach Lvl70+ and their talents go 6+, but that can be remedied by doing bounties, requests, and an occasional Wealth blossom or two in a week. No need to dedicate a large amount of your resin to it. Honestly, just take your time with leveling your characters up, embrace the RNG, and you'll enjoy the game's grind. Yup. All about the journey mate, all about the journey. Hitman 3 What about PUBG Mobile in India? Still, banned? Just got Doom Eternal in the steam sale. It seems OKish, don’t get all the hype around it. Still playing Fire Emblem Three Houses I did. That was pretty wild too. Though the swamp has everything. Gators, Nightfolk and that ghost looking for her loved one. GTA SA Gosh it's so hard to kill the wither Paladins LULW. Two point hospital on xbox And once you get to the DLCs, it's so fast paced and unforgiving- it's a relentless assault of enemies- puts the best of FPS to shame That's disappointing man.....ideally it should've been one night Come guys let's play Titanfall 2 in a lobby of up to 12 (6v6). Some of the most fun to be had in FPS Control There are ghosts in RDR2? Classic! Will have fond memories of this one forever. Yeah. A few of them. There's a ghost train too. Caught that one completely at random while horse riding. People still play the KR version I think. Download APK using VPN on Android. Change App Store country and download on iOS/iPadOS. What platform? PC my man Him, as in Vladimir lem? Any recommendation for a good WW2 fps game ? I havent played much WW2 stuff 🙈 Was BF1 WW2? And CoD World at War (it was my first FPS game, perhaps that's why it stands out). Other than these franchises, you might want to check out Medal of Honor Best villain ever. He was hiding in plain sight man... All the while I was thinking this Vinnie cogniti is a villain.. poor kid. Superb villain. Broke my heart that I had to kill him. Funny way to go, from some kind of chandelier or something. Wth.. that's so weird. It's honestly one of the most intense parts of the game dodging molotovs while runing around with an mp5 to shoot those blocks!! Roanoke ridge is just depressing af. Lol he does keep leaping around like a ninja everywhere. Any causal dota players? But 5 star artifacts can be complete shit too. Oh, of course. But 4 stars lose their value in end game when compared to 5 stars. Fragile Resins are a rare commodity, so best to save them for 5 stars, even if you can't guarantee a good 5 star artifact by using them. If nothing, your shit 5 star artifacts are a better level up fodder for good artifacts than a whole bunch of worthless 4 stars. Personally I don't even use my Fragiles to farm 5 stars, but save them for days when I decide to level up a character's talents. That way I can manage to farm all the necessary talent books in the same day. Feels like a better investment to me due to the guaranteed returns, but mathematically it makes no difference. Nice. I enjoy the grind. AR49 at the moment. I finish my dailies and just roam and forage for an hour or so. Farm ascendancy materials for team 2 for Spiral Sbyss. But I find great joy in min-maxing everybody, so that keeps me busy. Min-maxing for Spiral Abyss it pretty much the endgame, so yup, same here. Dailies, finish resin, roam around and farm crystals and mobs, sometimes co-op with random low level players to help them out. An hour or so each day. That's pretty much all the design of the game allows you to do. played it last week; loved the combat but the story was average at best. COD on Android phone. +1 Any xbox players here ? Platform ? Bhai crusader 1 here. Free overwatch ftw PC"
}