{
    "id": "14xejmf",
    "title": "Me after getting stuck in UP Govt sponsored traffic jams and seeing my tax money being thrown in the gutter.",
    "url": "https://v.redd.it/yioyba4mugbb1",
    "selftext": "So, Bageswar dham babji is having his 'katha' in Gre Noida and Govt has decided to block half of the city like it's babaji's jageer. The worst part is Gre Noida's infrastructure can easily handle all the people coming but still Govt thinks that  even main roads should be blocked for common public. What's your take on this? This doesn't seem right to me. This is not Kawad Yatra, Kumbh, Holi, Diwali, Ganesh Chaturthi or Durga Pooja.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1689138139.0,
    "convurl": "https://external-preview.redd.it/Y3psY2hsdmx1Z2JiMQtG5wGMIljVKQENIeRsW8n3U4krd9Z26zyk1dzhebod.png?format=pjpg&auto=webp&s=139e362965d9f16426af93b9ef08932f2ecbd035",
    "comments": [],
    "cleaned_text": "getting stuck govt sponsored traffic jams seeing tax money thrown gutter bageswar dham babji katha gre noida govt decided block half city like babajis jageer worst part gre noidas infrastructure easily handle people coming still govt thinks even main roads blocked common public whats take doesnt seem right kawad yatra kumbh holi diwali ganesh chaturthi durga pooja ",
    "cleaned_title": "getting stuck govt sponsored traffic jams seeing tax money thrown gutter",
    "cleaned_selftext": "bageswar dham babji katha gre noida govt decided block half city like babajis jageer worst part gre noidas infrastructure easily handle people coming still govt thinks even main roads blocked common public whats take doesnt seem right kawad yatra kumbh holi diwali ganesh chaturthi durga pooja",
    "cleaned_comments": "",
    "light_cleaned_title": "Me after getting stuck in UP Govt sponsored traffic jams and seeing my tax money being thrown in the gutter.",
    "light_cleaned_selftext": "So, Bageswar dham babji is having his 'katha' in Gre Noida and Govt has decided to block half of the city like it's babaji's jageer. The worst part is Gre Noida's infrastructure can easily handle all the people coming but still Govt thinks that even main roads should be blocked for common public. What's your take on this? This doesn't seem right to me. This is not Kawad Yatra, Kumbh, Holi, Diwali, Ganesh Chaturthi or Durga Pooja.",
    "light_cleaned_comments": ""
}