{
    "id": "12re2gm",
    "title": "Solution for same-sex unions was a tweaked Uniform Civil Code",
    "url": "https://www.reddit.com/r/india/comments/12re2gm/solution_for_samesex_unions_was_a_tweaked_uniform/",
    "selftext": "Hear me out. \n\nWhether you realise it or not; marriage is a contract between a couple, their religion, the state and the judiciary. Religions are conservative, so they oppose changes to existing religion-specific marriage laws that accommodate gay people. \n\nI’ll explain using excerpts from the [Wikipedia article on this issue](https://en.wikipedia.org/wiki/Recognition_of_same-sex_unions_in_India). \n\n> India does not possess a unified marriage law, and as such every citizen has the right to choose which law will apply to them based on their community or religion. Although **marriage is legislated at the federal level, the existence of multiple marriage laws complicates the issue.**\n\nYes, religion specific laws do complicate the issue because you need every religion to allow same sex unions now. Atheists can use the Special Marriage Act. \n\n> In 2017, a draft of a **Uniform Civil Code to legalise same-sex marriage was published**. Under the proposed code, marriage was defined as \"the legal union as prescribed under this Act of a *man with a woman, a man with another man, a woman with another woman, a transgender with another transgender or a transgender with a man or a woman*\".\n\nJust say two or more consenting adults. Yes, this would make it Muslim and polyamory friendly so the right wing BJPRSS government didn’t want that obviously.\n\n> A partnership was similarly defined. It also provided that any two persons who have been in a **partnership for more than two years shall have the same rights and obligations as married couples**, and mandated that all marriages be registered with the state. \n\nBJPRSS necessitated registering live-in relationships of 2 years as marriages. This should’ve been removed IMHO. \n\n> In addition, the draft stated that \"all married couples and couples in a partnership are entitled to adopt a child. **The sexual orientation of the married couple or the partners are not to be a bar to their right to adoption.**\n\nBut they also allowed adoption, which is mighty progressive of them. \n\n> The Bharatiya Janata Party (BJP) supports a Uniform Civil Code and was the first party in India to do so.\n\nGay rights people should have supported this. \n\n> Law Commission of India stated on 31 August 2018 that a Uniform Civil Code is \"neither necessary nor desirable at this stage\" in a 185-page consultation paper.\n\nThat was not a wise move. Law Commission should’ve asked for minor changes and approved it. \n\n> On 14 March 2023, during the press conference at the end of Akhil Bharatiya Pratinidhi Sabha, RSS General Secretary Dattatreya Hosabale backed the BJP-led Union Government's opposition to the extension of the right to marry for same-sex couples. He said marriage is an institution for the benefit of the family and society, not for physical and sexual enjoyment.\n\nBJPRSS has returned to form, now that it is for the Hindu religion. \n\n**TL;DR** it’s a goddamn mess that a tweaked gender neutral UCC could’ve solved. Now all religions are in the fray and it’s a slugfest. Gay atheists might be able to win thanks to Special Marriage Act if SC makes it gender neutral but gay Hindus, Christians and Muslims are screwed because their religions oppose same sex unions.\n\nPS. If I were gay, I would discard my religion and be happy with live-in relationship. Marriage sucks and divorce is worse! No one enjoys going to court multiple times to get unhitched. Leave the state out of your relationships. I recommend this even if you are not gay.",
    "flair": "Law & Courts",
    "score": 25,
    "num_comments": 47,
    "created_utc": 1681872333.0,
    "convurl": "https://external-preview.redd.it/yIsOoHEx144ob4Mxnvjx0uOFxOZL2SNf4JKA0xNyW7o.jpg?auto=webp&v=enabled&s=1b030daa9c6e808ce519e4226c6e8d23b6802f8e",
    "comments": [
        "Marriage is a contract between two adults. The contract is recognised and enforced by the state.\n\nThe first step is to remove religion from the state recognition of marriage. These are parallel systems.\n\nThe solution is a civil option, in parallel to the various marriage acts. A marriage recognised by the state and agnostic to gender, religion, or caste, and entitling the couple to the protection and recognition of the state and the benefits that flow from that.",
        "Isn’t that what the UCC was supposed to be? Minus the removal of existing marriage acts.",
        "Therein lies the difference.\n\nThe UCC was predicated on removing choice and the subtle compromises that allow our society to function.\n\nMy suggestion would add choice and let progress occur on its own timeline. Couples could elect a civil union and have the full legal rights of a married couple. Social and religious sanction in case of a civil union is an exercise left to them and no more the business of the state than the celebration of birthdays.\n\nA Hindu couple could choose a Hindu marriage under law or a civil union under law, and get married with a Hindu ceremony nevertheless (after all, the gods don't care about a temporal document anyway). Similarly, a Muslim couple could choose a Muslim Personal Law marriage or a civil union, while having an Islamic ceremony for religious and social reasons, and so forth....",
        "So you would be fine with UCC without the removal of existing marriage acts. \n\nI see the sense in your argument but it is a complicated way. Too many damn laws to enforce by already overstretched courts. Yes, a parallel transition stage is fine but eventually all marriage acts could go away because the UCC would cover them all. \n\nTweaks I wanted in UCC: Removal of mandatory registration of all live-in relationships and replacing approved gender combinations with “two or more consenting adults”.",
        "Two or more consenting adults would make Bajrang dal would be one large couple...",
        "You seem to not know about something called Special Marriages Act, 1954. \n\nThat said, while I have been a long time supporter of UCC, the authorship of such a progressive code should not be with the fascists.",
        "You seem to not have even read the TL;DR",
        "Have you listened to the arguments before the SCoI? Right from the get go, the canvas has been limited to Special Marriages Act, which is specifically for folks who don't want to involve their religion in their marriage, for whatever reason. So, your first premise that marriage is a contract \"with religion\" is not even applicable to SMA.",
        "Then why are any of the religions being represented? I thought SMA is free from their influence.\n\nhttps://twitter.com/livelawindia/status/1648233483347845120\n\nWhy is Sibal representing Jamiat-Ulema-i-Hind if this is just about SMA?",
        "Please stop. Just stop. UCC was never about accepting that marriage is a contract. It was always about marriage not being a contract under Hindu idea of marriage imposed on others. Divorce is harder under Hindu Marriage Act than Islamic Marriage Act for your kind information. \n\nHow long will people like you gaslight the LGBTQIA+ into thinking the government that is in court against adoption, blood donation, whose supporters blame people of the community dieing by suicide as being brainwashed by communists will include marriage equality in UCC?\n\nThe fucking audacity of \"gay rights people should have supported this\". How many court cases have you followed? I have read every court case related to my community. I have read every Circular, every Parliament speech. We know where the government stands. It is not a mystery. We know UCC is not about us. We don't have the privilege of not knowing where things stand and writing imaginary posts based on imaginary ideas that were never introduced, debated or supported by the party who is allegedly supposed to do it. \n\nMarriage for transgender persons is not included in the 2019 Act deliberately. All the arguments by government talks about \"biological man and biological woman\" even today.\n\nStop pretending we, the community are not aware of this tactic. \"help us in UCC. Once UCC is there, we will do the things we are opposing now\" is older than the no. of years ago I lost the will to live.\n\nWhen recommendation of removing trans people from going to jail for 10 years was made, the government said they can't do it before petitions are pending. Then they passed an Act which said violence against trand persons will have maximum penalty of two years and voted against the amendment to make it equal to cis persons. So the people who said we don't wanna interfere in the 10 year penalty for consensual sex but were okay with restricting the penalty for assault to two years maximum will include marriage rights for trans persons in UCC? \n\nAre we not seeing the same hearing? What part of it is making you think UCC will be queer friendly.\n\nWhen the government says harming you is 20 percent punishment of harming anyone else, will you accept the same government wants to give you rights? Yes or no?",
        "Because it was not clear initially that only sma was involved. Go listened to what Sibal said when he was called yesterday. He literally said, \"there's nothing for me to argue here.\"",
        "Nothing you said is based on reality of any of the Bill passed by the party...just blind optimism and apologism.",
        "Link me to the livelaw tweet pls. And why didn’t the court make it clear that it’s only about SMA earlier. It makes no sense. \n\nIn any case, none of this changes the fact that UCC was meant to address this issue. It even allowed for adoption of children by gay couples.\n\nI’m not a fan of BJPRSS by any means but someone has to explain to me why UCC wasn’t the right solution. \n\nOff topic: This reminds me of the farming reforms and protests. The reforms were needed and made sense. But BJPRSS failed in democratically getting them through. Same thing seems to have happened with UCC.",
        "I used the Wikipedia as a source. Please share yours along with a clear argument.",
        "I'm not on Twitter, but you can see it on the YouTube video. Will pull up the link tomorrow. \n\nFwiw, you and I are not disagreeing on much, except for your framing that marriage is a contract involving one's religion.",
        "And your advice to gay people re marriage. As a married gay guy, I'd beg to differ 😏",
        "Haha that seems to have triggered many people. I think most don’t even realise this basic fact. From the same Wikipedia article:\n\n> Special Marriage Act, 1954:[a] provides for marriage for all Indian citizens regardless of the religion of either party. Marriages contracted under this Act are registered with the state as a civil contract. The Act applies to partners of all religions or with no religious beliefs as well as interfaith couples.\n\n> Hindu Marriage Act, 1955: governs matters of marriage, separation and divorce of Hindus according to Hindu custom and rites.\n\n> Parsi Marriage and Divorce Act, 1936: regulates marriage and divorce for Parsis under Zoroastrian rites.\n\n> Anand Marriage Act, 1909: governs marriage for Sikhs.\n\n> Muslim Personal Law (Shariat) Application Act, 1937: deals with marriage, succession and inheritance among Muslims.\n\n> The Indian Christian Marriage Act, 1872: regulates the marriage and divorce of Indian Christians. An ordained minister of a church or a marriage registrar may conduct marriages under the Act",
        "That’s great! I’m glad you got what you wanted. How did you do it?",
        "Thanks! I live in the United States. So, it was not a problem. Most of our family came for the wedding and were thrilled.",
        "Please add a source for the UCC divorce claim. That would be another change required. It should be easy and doable online, no court visits needed. \n\nThe wiki article mentions that transgenders were included. Please add a source for your claim that they were excluded too. My suggestion was to remove all approved combinations of genders with “two or more consenting adults”.",
        "Ah. That’s different then. I thought maybe you are that couple in Gurgaon that got approval in Punjab HC.",
        "Your argument is based on the premise that the people who are in court to oppose marriage for non-heterosexuals will magically include marriage in UCC because why exactly?\n\nRead my other comment. We know where we stand for supporters for UCC. Have you read the text of any Bill passed between 2014-23? Do any of the Bills seem progressive to you? \n\n\"support the Rapist Rakshak Party for UCC and they will magically change their stances against things they are fighting in court now\" is not facts, and nothing in your source or Wikipedia suggests that. It is condescending to suggest the 'gay rights activists' don't know what they are doing. One of the woman petitioners is in relationship with another woman. Other lawyer is being helped by the lawyer who was supposed to be HC judge but the government didn't allow it because he is openly gay. What in the world makes you think the people whose lives are affected by the law and whose lives have been negatively affected by the law don't know what they are doing?\n\nLaw Commission also recommended that IPC should be amended to include male victims of rape by women. They are not binding and this draft meant absolutely nothing. The wording would have changed between draft and Cabinet approval to make it strictly heterosexual, obviously.",
        "My understanding is now that UCC is out of the window, this case is about modifying the various religious marriage acts and SMA for irreligious couples. So when you bring Hindu and Muslim religious leaders in, of course they will oppose gay rights. That’s kind of their thing. \n\nCalm and coherent responses to my comments will be more convincing. \n\nPlease understand I’m a layperson reading about this case and informing myself. You need to be clear, concise and bring source articles so I can read further.",
        "FWIW I think SC will approve changes to SMA by making it gender neutral if the feminists don’t oppose it. I think you will get SMA modified. \n\nhttps://www.reddit.com/r/india/comments/12qol05/historic_moment_gender_not_a_concept_of_where/jgtm6gq/",
        "You keep repeating claims from the draft. Please tell me when did the Draft get Cabinet approval.",
        "PS. I wish you both a long and happily married life!",
        "Yes, the bench seems to leaning that way. It was decided in yesterday's hearing that they will stick to SMA and not delve into personal laws in this hearing just like last time in 2018 they agreed with the government to not delve into civil rights. if you read the proceedings, you will see that the petitioners have repeatedly mentioned that they don't want a change to the amendment so the government can just strike the amendment itself because we know where the BJP stands. \n\nThe 2018 verdict established the doctrine of \"progressive realisation of rights\" means rights once given, can't be taken away. We are hoping similar doctrine is used in this verdict to protect it.\n\nLike I said before, people whose lives are affected by the things in court know what happened in court\n\nFYI after the last verdict, the government spokesperson went to news channels and said that if they didn't strike down 370, Kashmir legislature would have reversed it which is blatantly false because of the doctrine mentioned above.\n\nP.P.S: Feminists have nothing to do with SMA. NCW's Rekha Sharma will repeat whatever Rapist Rakshak asks her to repeat.",
        "On the first day of hearing, usually the bench decides what questions of law they are gonna decide on. The bench decided they won't delve into personal laws. But they also said this decision will not have any impact on future petitions against personal laws which is important because one of the reasons the petitions were filed was because someone went to court asking for marriage rights under HMA and it was important to make sure a negative ruling on that doesn't affect future rulings.",
        "Lol. You are comparing them to the Farm Act. Makes sense. Compare one half baked bad idea to another. Please enlighten as to why the clause of \"no civil servant will have any liability for actions done under Act in good faith\" was a good thing.",
        "Thanks! I get it now.",
        "WTF is that clause? It’s unconstitutional obv. \n\nI’m as anti-BJPRSS as possible so you don’t need to convince me on that. \n\nFarm laws was a debacle. UCC also seemingly was a debacle. \n\nThese are toxic people but a broken clock is right twice a day.",
        "Well, it seems the draft got shot down by legal commentators so no clue about cabinet approval. They could’ve got it approved like they did the farm laws. We all know how that went.",
        "How can the Farm Law be good when that clause existed? Can a bad Act with bad provisions be good because it claims to do something? It also said that disputes will be settled by DM and not judicial courts. Does it also seem like a good Act?\n\nYour claims are contradictory. I am telling you that the actual Act of laws tell us that claim is different from the actual thing, the same way when the insurance provider says you will get XYZ money, you are supposed to read the fine print of the policy. The fine print of Farm Acts tell us they were bad things packaged as good. The fine print of Trans Act shows us that UCC was never going to include LGBTQIA+. Yesterday also SG lied in apex court that the Trans Act covers discrimination against LGBTQIA+ which it doesn't.",
        "Sneaky fascists are sneaky. So will the SMA be made gender neutral or will it still be he or she, husband and wife?",
        "How can the claim be made that BJP was behind this version of UCC if the Cabinet never backed it then?",
        "The idea is spouse. But it is just the petition. The bench is of 5 people. A verdict of 3-2 will be needed that says this for it to happen.",
        "Yes. Provide options. Not every couple is religious, or of the same religion, or believes in letting religion dictate this aspect of their lives.\n\nIt isn't particularly more complicated than what we have now. It's adding one more mode of marriage, but a minimal one simpler than all the religious ones there are right now. Most importantly, it puts the reins back in the hands of individuals, not the government.\n\nMaybe in the year 2100 there are still 3% of couples who choose a Hindu or Muslim legal arrangement over a civil union, which has become the overwhelming choice. That's okay. They can coexist.",
        "Thank you!!",
        "I wish you get what is due to you.",
        "Draft laws aren’t set in stone and need changes before they are enacted, based on discussion.",
        "Just say two or more adults, are you seriously saying a guy would be able to have more than one wife just make it universal across all religions how is that not regressive.",
        "I appreciate the sentiment but many of my friends have already died of suicide waiting for their rights. A positive verdict won't bring them back."
    ],
    "cleaned_text": "solution samesex unions tweaked uniform civil code hear whether realise marriage contract couple religion state judiciary religions conservative oppose changes existing religionspecific marriage laws accommodate gay people ill explain using excerpts wikipedia article issuehttpsenwikipediaorgwikirecognitionofsamesexunionsinindia india possess unified marriage law every citizen right choose law apply based community religion although marriage legislated federal level existence multiple marriage laws complicates issue yes religion specific laws complicate issue need every religion allow sex unions atheists use special marriage act draft uniform civil code legalise samesex marriage published proposed code marriage defined legal union prescribed act man woman man another man woman another woman transgender another transgender transgender man woman say two consenting adults yes would make muslim polyamory friendly right wing bjprss government didnt want obviously partnership similarly defined also provided two persons partnership two years shall rights obligations married couples mandated marriages registered state bjprss necessitated registering livein relationships years marriages shouldve removed imho addition draft stated married couples couples partnership entitled adopt child sexual orientation married couple partners bar right adoption also allowed adoption mighty progressive bharatiya janata party bjp supports uniform civil code first party india gay rights people supported law commission india stated august uniform civil code neither necessary desirable stage page consultation paper wise move law commission shouldve asked minor changes approved march press conference end akhil bharatiya pratinidhi sabha rss general secretary dattatreya hosabale backed bjpled union governments opposition extension right marry samesex couples said marriage institution benefit family society physical sexual enjoyment bjprss returned form hindu religion tldr goddamn mess tweaked gender neutral ucc couldve solved religions fray slugfest gay atheists might able win thanks special marriage act sc makes gender neutral gay hindus christians muslims screwed religions oppose sex unions ps gay would discard religion happy livein relationship marriage sucks divorce worse one enjoys going court multiple times get unhitched leave state relationships recommend even gay ",
    "cleaned_title": "solution samesex unions tweaked uniform civil code",
    "cleaned_selftext": "hear whether realise marriage contract couple religion state judiciary religions conservative oppose changes existing religionspecific marriage laws accommodate gay people ill explain using excerpts wikipedia article issuehttpsenwikipediaorgwikirecognitionofsamesexunionsinindia india possess unified marriage law every citizen right choose law apply based community religion although marriage legislated federal level existence multiple marriage laws complicates issue yes religion specific laws complicate issue need every religion allow sex unions atheists use special marriage act draft uniform civil code legalise samesex marriage published proposed code marriage defined legal union prescribed act man woman man another man woman another woman transgender another transgender transgender man woman say two consenting adults yes would make muslim polyamory friendly right wing bjprss government didnt want obviously partnership similarly defined also provided two persons partnership two years shall rights obligations married couples mandated marriages registered state bjprss necessitated registering livein relationships years marriages shouldve removed imho addition draft stated married couples couples partnership entitled adopt child sexual orientation married couple partners bar right adoption also allowed adoption mighty progressive bharatiya janata party bjp supports uniform civil code first party india gay rights people supported law commission india stated august uniform civil code neither necessary desirable stage page consultation paper wise move law commission shouldve asked minor changes approved march press conference end akhil bharatiya pratinidhi sabha rss general secretary dattatreya hosabale backed bjpled union governments opposition extension right marry samesex couples said marriage institution benefit family society physical sexual enjoyment bjprss returned form hindu religion tldr goddamn mess tweaked gender neutral ucc couldve solved religions fray slugfest gay atheists might able win thanks special marriage act sc makes gender neutral gay hindus christians muslims screwed religions oppose sex unions ps gay would discard religion happy livein relationship marriage sucks divorce worse one enjoys going court multiple times get unhitched leave state relationships recommend even gay",
    "cleaned_comments": "marriage contract two adults contract recognised enforced state first step remove religion state recognition marriage parallel systems solution civil option parallel various marriage acts marriage recognised state agnostic gender religion caste entitling couple protection recognition state benefits flow isnt ucc supposed minus removal existing marriage acts therein lies difference ucc predicated removing choice subtle compromises allow society function suggestion would add choice let progress occur timeline couples could elect civil union full legal rights married couple social religious sanction case civil union exercise left business state celebration birthdays hindu couple could choose hindu marriage law civil union law get married hindu ceremony nevertheless gods dont care temporal document anyway similarly muslim couple could choose muslim personal law marriage civil union islamic ceremony religious social reasons forth would fine ucc without removal existing marriage acts see sense argument complicated way many damn laws enforce already overstretched courts yes parallel transition stage fine eventually marriage acts could go away ucc would cover tweaks wanted ucc removal mandatory registration livein relationships replacing approved gender combinations two consenting adults two consenting adults would make bajrang dal would one large couple seem know something called special marriages act said long time supporter ucc authorship progressive code fascists seem even read tldr listened arguments scoi right get go canvas limited special marriages act specifically folks dont want involve religion marriage whatever reason first premise marriage contract religion even applicable sma religions represented thought sma free influence sibal representing jamiatulemaihind sma please stop stop ucc never accepting marriage contract always marriage contract hindu idea marriage imposed others divorce harder hindu marriage act islamic marriage act kind information long people like gaslight lgbtqia thinking government court adoption blood donation whose supporters blame people community dieing suicide brainwashed communists include marriage equality ucc fucking audacity gay rights people supported many court cases followed read every court case related community read every circular every parliament speech know government stands mystery know ucc us dont privilege knowing things stand writing imaginary posts based imaginary ideas never introduced debated supported party allegedly supposed marriage transgender persons included act deliberately arguments government talks biological man biological woman even today stop pretending community aware tactic help us ucc ucc things opposing older years ago lost live recommendation removing trans people going jail years made government said cant petitions pending passed act said violence trand persons maximum penalty two years voted amendment make equal cis persons people said dont wan na interfere year penalty consensual sex okay restricting penalty assault two years maximum include marriage rights trans persons ucc seeing hearing part making think ucc queer friendly government says harming percent punishment harming anyone else accept government wants give rights yes clear initially sma involved go listened sibal said called yesterday literally said theres nothing argue nothing said based reality bill passed partyjust blind optimism apologism link livelaw tweet pls didnt court make clear sma earlier makes sense case none changes fact ucc meant address issue even allowed adoption children gay couples im fan bjprss means someone explain ucc wasnt right solution topic reminds farming reforms protests reforms needed made sense bjprss failed democratically getting thing seems happened ucc used wikipedia source please share along clear argument im twitter see youtube video pull link tomorrow fwiw disagreeing much except framing marriage contract involving ones religion advice gay people marriage married gay guy id beg differ haha seems triggered many people think dont even realise basic fact wikipedia article special marriage act provides marriage indian citizens regardless religion either party marriages contracted act registered state civil contract act applies partners religions religious beliefs well interfaith couples hindu marriage act governs matters marriage separation divorce hindus according hindu custom rites parsi marriage divorce act regulates marriage divorce parsis zoroastrian rites anand marriage act governs marriage sikhs muslim personal law shariat application act deals marriage succession inheritance among muslims indian christian marriage act regulates marriage divorce indian christians ordained minister church marriage registrar may conduct marriages act thats great im glad got wanted thanks live united states problem family came wedding thrilled please add source ucc divorce claim would another change required easy doable online court visits needed wiki article mentions transgenders included please add source claim excluded suggestion remove approved combinations genders two consenting adults ah thats different thought maybe couple gurgaon got approval punjab hc argument based premise people court oppose marriage nonheterosexuals magically include marriage ucc exactly read comment know stand supporters ucc read text bill passed bills seem progressive support rapist rakshak party ucc magically change stances things fighting court facts nothing source wikipedia suggests condescending suggest gay rights activists dont know one woman petitioners relationship another woman lawyer helped lawyer supposed hc judge government didnt allow openly gay world makes think people whose lives affected law whose lives negatively affected law dont know law commission also recommended ipc amended include male victims rape women binding draft meant absolutely nothing wording would changed draft cabinet approval make strictly heterosexual obviously understanding ucc window case modifying various religious marriage acts sma irreligious couples bring hindu muslim religious leaders course oppose gay rights thats kind thing calm coherent responses comments convincing please understand im layperson reading case informing need clear concise bring source articles read fwiw think sc approve changes sma making gender neutral feminists dont oppose think get sma modified keep repeating claims draft please tell draft get cabinet approval ps wish long happily married life yes bench seems leaning way decided yesterdays hearing stick sma delve personal laws hearing like last time agreed government delve civil rights read proceedings see petitioners repeatedly mentioned dont want change amendment government strike amendment know bjp stands verdict established doctrine progressive realisation rights means rights given cant taken away hoping similar doctrine used verdict protect like said people whose lives affected things court know happened court fyi last verdict government spokesperson went news channels said didnt strike kashmir legislature would reversed blatantly false doctrine mentioned pps feminists nothing sma ncws rekha sharma repeat whatever rapist rakshak asks repeat first day hearing usually bench decides questions law gon na decide bench decided wont delve personal laws also said decision impact future petitions personal laws important one reasons petitions filed someone went court asking marriage rights hma important make sure negative ruling doesnt affect future rulings lol comparing farm act makes sense compare one half baked bad idea another please enlighten clause civil servant liability actions done act good faith good thing thanks get wtf clause unconstitutional obv im antibjprss possible dont need convince farm laws debacle ucc also seemingly debacle toxic people broken clock right twice day well seems draft got shot legal commentators clue cabinet approval couldve got approved like farm laws know went farm law good clause existed bad act bad provisions good claims something also said disputes settled dm judicial courts also seem like good act claims contradictory telling actual act laws tell us claim different actual thing way insurance provider says get xyz money supposed read fine print policy fine print farm acts tell us bad things packaged good fine print trans act shows us ucc never going include lgbtqia yesterday also sg lied apex court trans act covers discrimination lgbtqia doesnt sneaky fascists sneaky sma made gender neutral still husband wife claim made bjp behind version ucc cabinet never backed idea spouse petition bench people verdict needed says happen yes provide options every couple religious religion believes letting religion dictate aspect lives isnt particularly complicated adding one mode marriage minimal one simpler religious ones right importantly puts reins back hands individuals government maybe year still couples choose hindu muslim legal arrangement civil union become overwhelming choice thats okay coexist thank wish get due draft laws arent set stone need changes enacted based discussion say two adults seriously saying guy would able one wife make universal across religions regressive appreciate sentiment many friends already died suicide waiting rights positive verdict wont bring back",
    "light_cleaned_title": "Solution for same-sex unions was a tweaked Uniform Civil Code",
    "light_cleaned_selftext": "Hear me out. Whether you realise it or not; marriage is a contract between a couple, their religion, the state and the judiciary. Religions are conservative, so they oppose changes to existing religion-specific marriage laws that accommodate gay people. I’ll explain using excerpts from the [Wikipedia article on this issue](https://en.wikipedia.org/wiki/Recognition_of_same-sex_unions_in_India). > India does not possess a unified marriage law, and as such every citizen has the right to choose which law will apply to them based on their community or religion. Although **marriage is legislated at the federal level, the existence of multiple marriage laws complicates the issue.** Yes, religion specific laws do complicate the issue because you need every religion to allow same sex unions now. Atheists can use the Special Marriage Act. > In 2017, a draft of a **Uniform Civil Code to legalise same-sex marriage was published**. Under the proposed code, marriage was defined as \"the legal union as prescribed under this Act of a *man with a woman, a man with another man, a woman with another woman, a transgender with another transgender or a transgender with a man or a woman*\". Just say two or more consenting adults. Yes, this would make it Muslim and polyamory friendly so the right wing BJPRSS government didn’t want that obviously. > A partnership was similarly defined. It also provided that any two persons who have been in a **partnership for more than two years shall have the same rights and obligations as married couples**, and mandated that all marriages be registered with the state. BJPRSS necessitated registering live-in relationships of 2 years as marriages. This should’ve been removed IMHO. > In addition, the draft stated that \"all married couples and couples in a partnership are entitled to adopt a child. **The sexual orientation of the married couple or the partners are not to be a bar to their right to adoption.** But they also allowed adoption, which is mighty progressive of them. > The Bharatiya Janata Party (BJP) supports a Uniform Civil Code and was the first party in India to do so. Gay rights people should have supported this. > Law Commission of India stated on 31 August 2018 that a Uniform Civil Code is \"neither necessary nor desirable at this stage\" in a 185-page consultation paper. That was not a wise move. Law Commission should’ve asked for minor changes and approved it. > On 14 March 2023, during the press conference at the end of Akhil Bharatiya Pratinidhi Sabha, RSS General Secretary Dattatreya Hosabale backed the BJP-led Union Government's opposition to the extension of the right to marry for same-sex couples. He said marriage is an institution for the benefit of the family and society, not for physical and sexual enjoyment. BJPRSS has returned to form, now that it is for the Hindu religion. **TL;DR** it’s a goddamn mess that a tweaked gender neutral UCC could’ve solved. Now all religions are in the fray and it’s a slugfest. Gay atheists might be able to win thanks to Special Marriage Act if SC makes it gender neutral but gay Hindus, Christians and Muslims are screwed because their religions oppose same sex unions. PS. If I were gay, I would discard my religion and be happy with live-in relationship. Marriage sucks and divorce is worse! No one enjoys going to court multiple times to get unhitched. Leave the state out of your relationships. I recommend this even if you are not gay.",
    "light_cleaned_comments": "Marriage is a contract between two adults. The contract is recognised and enforced by the state. The first step is to remove religion from the state recognition of marriage. These are parallel systems. The solution is a civil option, in parallel to the various marriage acts. A marriage recognised by the state and agnostic to gender, religion, or caste, and entitling the couple to the protection and recognition of the state and the benefits that flow from that. Isn’t that what the UCC was supposed to be? Minus the removal of existing marriage acts. Therein lies the difference. The UCC was predicated on removing choice and the subtle compromises that allow our society to function. My suggestion would add choice and let progress occur on its own timeline. Couples could elect a civil union and have the full legal rights of a married couple. Social and religious sanction in case of a civil union is an exercise left to them and no more the business of the state than the celebration of birthdays. A Hindu couple could choose a Hindu marriage under law or a civil union under law, and get married with a Hindu ceremony nevertheless (after all, the gods don't care about a temporal document anyway). Similarly, a Muslim couple could choose a Muslim Personal Law marriage or a civil union, while having an Islamic ceremony for religious and social reasons, and so forth.... So you would be fine with UCC without the removal of existing marriage acts. I see the sense in your argument but it is a complicated way. Too many damn laws to enforce by already overstretched courts. Yes, a parallel transition stage is fine but eventually all marriage acts could go away because the UCC would cover them all. Tweaks I wanted in UCC: Removal of mandatory registration of all live-in relationships and replacing approved gender combinations with “two or more consenting adults”. Two or more consenting adults would make Bajrang dal would be one large couple... You seem to not know about something called Special Marriages Act, 1954. That said, while I have been a long time supporter of UCC, the authorship of such a progressive code should not be with the fascists. You seem to not have even read the TL;DR Have you listened to the arguments before the SCoI? Right from the get go, the canvas has been limited to Special Marriages Act, which is specifically for folks who don't want to involve their religion in their marriage, for whatever reason. So, your first premise that marriage is a contract \"with religion\" is not even applicable to SMA. Then why are any of the religions being represented? I thought SMA is free from their influence. Why is Sibal representing Jamiat-Ulema-i-Hind if this is just about SMA? Please stop. Just stop. UCC was never about accepting that marriage is a contract. It was always about marriage not being a contract under Hindu idea of marriage imposed on others. Divorce is harder under Hindu Marriage Act than Islamic Marriage Act for your kind information. How long will people like you gaslight the LGBTQIA+ into thinking the government that is in court against adoption, blood donation, whose supporters blame people of the community dieing by suicide as being brainwashed by communists will include marriage equality in UCC? The fucking audacity of \"gay rights people should have supported this\". How many court cases have you followed? I have read every court case related to my community. I have read every Circular, every Parliament speech. We know where the government stands. It is not a mystery. We know UCC is not about us. We don't have the privilege of not knowing where things stand and writing imaginary posts based on imaginary ideas that were never introduced, debated or supported by the party who is allegedly supposed to do it. Marriage for transgender persons is not included in the 2019 Act deliberately. All the arguments by government talks about \"biological man and biological woman\" even today. Stop pretending we, the community are not aware of this tactic. \"help us in UCC. Once UCC is there, we will do the things we are opposing now\" is older than the no. of years ago I lost the will to live. When recommendation of removing trans people from going to jail for 10 years was made, the government said they can't do it before petitions are pending. Then they passed an Act which said violence against trand persons will have maximum penalty of two years and voted against the amendment to make it equal to cis persons. So the people who said we don't wanna interfere in the 10 year penalty for consensual sex but were okay with restricting the penalty for assault to two years maximum will include marriage rights for trans persons in UCC? Are we not seeing the same hearing? What part of it is making you think UCC will be queer friendly. When the government says harming you is 20 percent punishment of harming anyone else, will you accept the same government wants to give you rights? Yes or no? Because it was not clear initially that only sma was involved. Go listened to what Sibal said when he was called yesterday. He literally said, \"there's nothing for me to argue here.\" Nothing you said is based on reality of any of the Bill passed by the party...just blind optimism and apologism. Link me to the livelaw tweet pls. And why didn’t the court make it clear that it’s only about SMA earlier. It makes no sense. In any case, none of this changes the fact that UCC was meant to address this issue. It even allowed for adoption of children by gay couples. I’m not a fan of BJPRSS by any means but someone has to explain to me why UCC wasn’t the right solution. Off topic: This reminds me of the farming reforms and protests. The reforms were needed and made sense. But BJPRSS failed in democratically getting them through. Same thing seems to have happened with UCC. I used the Wikipedia as a source. Please share yours along with a clear argument. I'm not on Twitter, but you can see it on the YouTube video. Will pull up the link tomorrow. Fwiw, you and I are not disagreeing on much, except for your framing that marriage is a contract involving one's religion. And your advice to gay people re marriage. As a married gay guy, I'd beg to differ 😏 Haha that seems to have triggered many people. I think most don’t even realise this basic fact. From the same Wikipedia article: > Special Marriage Act, 1954:[a] provides for marriage for all Indian citizens regardless of the religion of either party. Marriages contracted under this Act are registered with the state as a civil contract. The Act applies to partners of all religions or with no religious beliefs as well as interfaith couples. > Hindu Marriage Act, 1955: governs matters of marriage, separation and divorce of Hindus according to Hindu custom and rites. > Parsi Marriage and Divorce Act, 1936: regulates marriage and divorce for Parsis under Zoroastrian rites. > Anand Marriage Act, 1909: governs marriage for Sikhs. > Muslim Personal Law (Shariat) Application Act, 1937: deals with marriage, succession and inheritance among Muslims. > The Indian Christian Marriage Act, 1872: regulates the marriage and divorce of Indian Christians. An ordained minister of a church or a marriage registrar may conduct marriages under the Act That’s great! I’m glad you got what you wanted. How did you do it? Thanks! I live in the United States. So, it was not a problem. Most of our family came for the wedding and were thrilled. Please add a source for the UCC divorce claim. That would be another change required. It should be easy and doable online, no court visits needed. The wiki article mentions that transgenders were included. Please add a source for your claim that they were excluded too. My suggestion was to remove all approved combinations of genders with “two or more consenting adults”. Ah. That’s different then. I thought maybe you are that couple in Gurgaon that got approval in Punjab HC. Your argument is based on the premise that the people who are in court to oppose marriage for non-heterosexuals will magically include marriage in UCC because why exactly? Read my other comment. We know where we stand for supporters for UCC. Have you read the text of any Bill passed between 2014-23? Do any of the Bills seem progressive to you? \"support the Rapist Rakshak Party for UCC and they will magically change their stances against things they are fighting in court now\" is not facts, and nothing in your source or Wikipedia suggests that. It is condescending to suggest the 'gay rights activists' don't know what they are doing. One of the woman petitioners is in relationship with another woman. Other lawyer is being helped by the lawyer who was supposed to be HC judge but the government didn't allow it because he is openly gay. What in the world makes you think the people whose lives are affected by the law and whose lives have been negatively affected by the law don't know what they are doing? Law Commission also recommended that IPC should be amended to include male victims of rape by women. They are not binding and this draft meant absolutely nothing. The wording would have changed between draft and Cabinet approval to make it strictly heterosexual, obviously. My understanding is now that UCC is out of the window, this case is about modifying the various religious marriage acts and SMA for irreligious couples. So when you bring Hindu and Muslim religious leaders in, of course they will oppose gay rights. That’s kind of their thing. Calm and coherent responses to my comments will be more convincing. Please understand I’m a layperson reading about this case and informing myself. You need to be clear, concise and bring source articles so I can read further. FWIW I think SC will approve changes to SMA by making it gender neutral if the feminists don’t oppose it. I think you will get SMA modified. You keep repeating claims from the draft. Please tell me when did the Draft get Cabinet approval. PS. I wish you both a long and happily married life! Yes, the bench seems to leaning that way. It was decided in yesterday's hearing that they will stick to SMA and not delve into personal laws in this hearing just like last time in 2018 they agreed with the government to not delve into civil rights. if you read the proceedings, you will see that the petitioners have repeatedly mentioned that they don't want a change to the amendment so the government can just strike the amendment itself because we know where the BJP stands. The 2018 verdict established the doctrine of \"progressive realisation of rights\" means rights once given, can't be taken away. We are hoping similar doctrine is used in this verdict to protect it. Like I said before, people whose lives are affected by the things in court know what happened in court FYI after the last verdict, the government spokesperson went to news channels and said that if they didn't strike down 370, Kashmir legislature would have reversed it which is blatantly false because of the doctrine mentioned above. P.P.S: Feminists have nothing to do with SMA. NCW's Rekha Sharma will repeat whatever Rapist Rakshak asks her to repeat. On the first day of hearing, usually the bench decides what questions of law they are gonna decide on. The bench decided they won't delve into personal laws. But they also said this decision will not have any impact on future petitions against personal laws which is important because one of the reasons the petitions were filed was because someone went to court asking for marriage rights under HMA and it was important to make sure a negative ruling on that doesn't affect future rulings. Lol. You are comparing them to the Farm Act. Makes sense. Compare one half baked bad idea to another. Please enlighten as to why the clause of \"no civil servant will have any liability for actions done under Act in good faith\" was a good thing. Thanks! I get it now. WTF is that clause? It’s unconstitutional obv. I’m as anti-BJPRSS as possible so you don’t need to convince me on that. Farm laws was a debacle. UCC also seemingly was a debacle. These are toxic people but a broken clock is right twice a day. Well, it seems the draft got shot down by legal commentators so no clue about cabinet approval. They could’ve got it approved like they did the farm laws. We all know how that went. How can the Farm Law be good when that clause existed? Can a bad Act with bad provisions be good because it claims to do something? It also said that disputes will be settled by DM and not judicial courts. Does it also seem like a good Act? Your claims are contradictory. I am telling you that the actual Act of laws tell us that claim is different from the actual thing, the same way when the insurance provider says you will get XYZ money, you are supposed to read the fine print of the policy. The fine print of Farm Acts tell us they were bad things packaged as good. The fine print of Trans Act shows us that UCC was never going to include LGBTQIA+. Yesterday also SG lied in apex court that the Trans Act covers discrimination against LGBTQIA+ which it doesn't. Sneaky fascists are sneaky. So will the SMA be made gender neutral or will it still be he or she, husband and wife? How can the claim be made that BJP was behind this version of UCC if the Cabinet never backed it then? The idea is spouse. But it is just the petition. The bench is of 5 people. A verdict of 3-2 will be needed that says this for it to happen. Yes. Provide options. Not every couple is religious, or of the same religion, or believes in letting religion dictate this aspect of their lives. It isn't particularly more complicated than what we have now. It's adding one more mode of marriage, but a minimal one simpler than all the religious ones there are right now. Most importantly, it puts the reins back in the hands of individuals, not the government. Maybe in the year 2100 there are still 3% of couples who choose a Hindu or Muslim legal arrangement over a civil union, which has become the overwhelming choice. That's okay. They can coexist. Thank you!! I wish you get what is due to you. Draft laws aren’t set in stone and need changes before they are enacted, based on discussion. Just say two or more adults, are you seriously saying a guy would be able to have more than one wife just make it universal across all religions how is that not regressive. I appreciate the sentiment but many of my friends have already died of suicide waiting for their rights. A positive verdict won't bring them back."
}