{
    "id": "15sl6sg",
    "title": "Narendra Modi's Chinese links, and Government's accusation in a mirror",
    "url": "https://www.reddit.com/r/india/comments/15sl6sg/narendra_modis_chinese_links_and_governments/",
    "selftext": "Six years ago, in one of his speech, Modi spoke of his connection with Chinese Premiere Xi Jingping. Few months later, he was went to China, without any agenda to meet Xi Jingping. Modi has visited China 5 times in 9 years. Only a few months after he became Prime Minister, Modi invited Xi to Ahmedabad to sit on a swing.\n\nIn 9 years of Modi rule, there have been numerous skirmishes with China, in which many soldiers have died. China has encroached on thousands of kilometers of Indian land, and entered hundreds of kilometers inside Indian border. China has even settled several villages in Indian territory.\n\nDespite all these setbacks, Prime Minister Modi has refused to even speak about China, let alone act against it. Chinese imports have skyrocketed after the Glawan valley clash in 2020. India has awarded thousands of crores of contract to China. Even the Statue of Unity of Sardar Vallabhbhai patel was made by China. Our national flags are also being made in China. Our brave foreign minister, S Jaishankar, who misses no chance to act like a common troll, had categorically said that India cannot stand up to China. Chinese companies have donated huge sums to PM-CARES fund, which Modi Government has claimed is not a Government fund, and it's details cannot be divulged under RTI.\n\nAny sane person would argue that Narendra Modi is on Xi's payroll. Interestingly, Modi Government recently accused opposition leaders and news channels of Chinese links.\n\n[Tawang: As Chinese border attacks continue, India’s imports from China have boomed](https://scroll.in/article/1039663/galwan-to-tawang-even-as-border-attacks-continue-indias-imports-from-china-have-boomed)\n\n[India’s imports from China rose sharply post Galwan clash: What trade data show | Explained News - The Indian Express](https://indianexpress.com/article/explained/explained-economics/indias-imports-from-china-rose-sharply-post-galwan-clash-what-trade-data-show-8325053/)\n\n[Second Chinese village along Arunachal border: Satellite images | India News - Times of India](https://timesofindia.indiatimes.com/india/second-chinese-village-along-arunachal-border-sat-images/articleshow/87788526.cms)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692178899.0,
    "convurl": "https://external-preview.redd.it/WyFDbX_L5AuMtXR6A9PT4jzo8H0kgHbrfayhHDheTas.jpg?auto=webp&amp;s=83e61f857e16562d2b80f835bea4356cad584fce",
    "comments": [
        "At this moment, only concerted efforts by good people to consciously boycott Xi-nese goods can have an effect. \n\nThe politicians are liars, the businessmen are profiteers and the people pay the price - in poverty and death.",
        "I wonder how much of the electoral bonds came from China."
    ],
    "cleaned_text": "narendra modis chinese links governments accusation mirror six years ago one speech modi spoke connection chinese premiere xi jingping months later went china without agenda meet xi jingping modi visited china times years months became prime minister modi invited xi ahmedabad sit swing years modi rule numerous skirmishes china many soldiers died china encroached thousands kilometers indian land entered hundreds kilometers inside indian border china even settled several villages indian territory despite setbacks prime minister modi refused even speak china let alone act chinese imports skyrocketed glawan valley clash india awarded thousands crores contract china even statue unity sardar vallabhbhai patel made china national flags also made china brave foreign minister jaishankar misses chance act like common troll categorically said india stand china chinese companies donated huge sums pmcares fund modi government claimed government fund details divulged rti sane person would argue narendra modi xis payroll interestingly modi government recently accused opposition leaders news channels chinese links tawang chinese border attacks continue indias imports china boomedhttpsscrollinarticlegalwantotawangevenasborderattackscontinueindiasimportsfromchinahaveboomed indias imports china rose sharply post galwan clash trade data show explained news indian expresshttpsindianexpresscomarticleexplainedexplainedeconomicsindiasimportsfromchinarosesharplypostgalwanclashwhattradedatashow second chinese village along arunachal border satellite images india news times indiahttpstimesofindiaindiatimescomindiasecondchinesevillagealongarunachalbordersatimagesarticleshowcms ",
    "cleaned_title": "narendra modis chinese links governments accusation mirror",
    "cleaned_selftext": "six years ago one speech modi spoke connection chinese premiere xi jingping months later went china without agenda meet xi jingping modi visited china times years months became prime minister modi invited xi ahmedabad sit swing years modi rule numerous skirmishes china many soldiers died china encroached thousands kilometers indian land entered hundreds kilometers inside indian border china even settled several villages indian territory despite setbacks prime minister modi refused even speak china let alone act chinese imports skyrocketed glawan valley clash india awarded thousands crores contract china even statue unity sardar vallabhbhai patel made china national flags also made china brave foreign minister jaishankar misses chance act like common troll categorically said india stand china chinese companies donated huge sums pmcares fund modi government claimed government fund details divulged rti sane person would argue narendra modi xis payroll interestingly modi government recently accused opposition leaders news channels chinese links tawang chinese border attacks continue indias imports china boomedhttpsscrollinarticlegalwantotawangevenasborderattackscontinueindiasimportsfromchinahaveboomed indias imports china rose sharply post galwan clash trade data show explained news indian expresshttpsindianexpresscomarticleexplainedexplainedeconomicsindiasimportsfromchinarosesharplypostgalwanclashwhattradedatashow second chinese village along arunachal border satellite images india news times indiahttpstimesofindiaindiatimescomindiasecondchinesevillagealongarunachalbordersatimagesarticleshowcms",
    "cleaned_comments": "moment concerted efforts good people consciously boycott xinese goods effect politicians liars businessmen profiteers people pay price poverty death wonder much electoral bonds came china",
    "light_cleaned_title": "Narendra Modi's Chinese links, and Government's accusation in a mirror",
    "light_cleaned_selftext": "Six years ago, in one of his speech, Modi spoke of his connection with Chinese Premiere Xi Jingping. Few months later, he was went to China, without any agenda to meet Xi Jingping. Modi has visited China 5 times in 9 years. Only a few months after he became Prime Minister, Modi invited Xi to Ahmedabad to sit on a swing. In 9 years of Modi rule, there have been numerous skirmishes with China, in which many soldiers have died. China has encroached on thousands of kilometers of Indian land, and entered hundreds of kilometers inside Indian border. China has even settled several villages in Indian territory. Despite all these setbacks, Prime Minister Modi has refused to even speak about China, let alone act against it. Chinese imports have skyrocketed after the Glawan valley clash in 2020. India has awarded thousands of crores of contract to China. Even the Statue of Unity of Sardar Vallabhbhai patel was made by China. Our national flags are also being made in China. Our brave foreign minister, S Jaishankar, who misses no chance to act like a common troll, had categorically said that India cannot stand up to China. Chinese companies have donated huge sums to PM-CARES fund, which Modi Government has claimed is not a Government fund, and it's details cannot be divulged under RTI. Any sane person would argue that Narendra Modi is on Xi's payroll. Interestingly, Modi Government recently accused opposition leaders and news channels of Chinese links. [Tawang: As Chinese border attacks continue, India’s imports from China have boomed](https://scroll.in/article/1039663/galwan-to-tawang-even-as-border-attacks-continue-indias-imports-from-china-have-boomed) [India’s imports from China rose sharply post Galwan clash: What trade data show | Explained News - The Indian Express](https://indianexpress.com/article/explained/explained-economics/indias-imports-from-china-rose-sharply-post-galwan-clash-what-trade-data-show-8325053/) [Second Chinese village along Arunachal border: Satellite images | India News - Times of India](https://timesofindia.indiatimes.com/india/second-chinese-village-along-arunachal-border-sat-images/articleshow/87788526.cms)",
    "light_cleaned_comments": "At this moment, only concerted efforts by good people to consciously boycott Xi-nese goods can have an effect. The politicians are liars, the businessmen are profiteers and the people pay the price - in poverty and death. I wonder how much of the electoral bonds came from China."
}