{
    "id": "12sz1f0",
    "title": "Should i buy 'Asus 15 Oled' from a seller named 'SMEZON' on Amazon?",
    "url": "https://www.reddit.com/gallery/12sz1f0",
    "selftext": "I have provided ratings and reviews for the said seller. \n\nAlso if fellow redditors could recommend a Laptop with better specs that fit in my budget of 47k. I would highly appreciate it.",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 8,
    "created_utc": 1681997987.0,
    "convurl": "https://i.redd.it/gfho1ni0m1va1.jpg",
    "comments": [
        "What's your use, specifically for?",
        "You can get this laptop  ASUS Vivobook 14 OLED,12th Gen Intel Core i3-1215U, 14\"(35.56 cm) 2.8K 16:10 90Hz,Laptop [https://smpx.to/meMMxm](https://smpx.to/meMMxm)   \nThis one is from  [Appario Retail Private Ltd](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A14CZOWI0VEHLG&isAmazonFulfilled=1&ref_=dp_merchant_link&asin=B0BHHBHZDG)  Amazon Official store for  ₹51,990 + Extra Bank offers.",
        "No, Buy from a store. They offer competitive rates plus waay waay better service",
        "Content viewing and academics.",
        "Actually display is an issue here. Also this is way out of my budget. But thank you for the recommendation.",
        "Actually this store is not ready to budge from 48k (without any accessories and NO bag) whereas on amazon it's selling @46k. \nAlso isn't it that the after sales services would be provided by the service centres rather than the store?",
        "This one OLED display & just over 50k with bank offers & all you can get this one under 50k which is great"
    ],
    "cleaned_text": "buy asus oled seller named smezon amazon provided ratings reviews said seller also fellow redditors could recommend laptop better specs fit budget k would highly appreciate ",
    "cleaned_title": "buy asus oled seller named smezon amazon",
    "cleaned_selftext": "provided ratings reviews said seller also fellow redditors could recommend laptop better specs fit budget k would highly appreciate",
    "cleaned_comments": "whats use specifically get laptop asus vivobook oledth gen intel core iu cm k hzlaptop httpssmpxtomemmxmhttpssmpxtomemmxm one appario retail private ltdhttpswwwamazoninspmarketplaceidatjruunkgvselleraczowivehlgisamazonfulfilledrefdpmerchantlinkasinbbhhbhzdg amazon official store extra bank offers buy store offer competitive rates plus waay waay better service content viewing academics actually display issue also way budget thank recommendation actually store ready budge k without accessories bag whereas amazon selling k also isnt sales services would provided service centres rather store one oled display k bank offers get one k great",
    "light_cleaned_title": "Should i buy 'Asus 15 Oled' from a seller named 'SMEZON' on Amazon?",
    "light_cleaned_selftext": "I have provided ratings and reviews for the said seller. Also if fellow redditors could recommend a Laptop with better specs that fit in my budget of 47k. I would highly appreciate it.",
    "light_cleaned_comments": "What's your use, specifically for? You can get this laptop ASUS Vivobook 14 OLED,12th Gen Intel Core i3-1215U, 14\"(35.56 cm) 2.8K 16:10 90Hz,Laptop [https://smpx.to/meMMxm](https://smpx.to/meMMxm) This one is from [Appario Retail Private Ltd](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A14CZOWI0VEHLG&isAmazonFulfilled=1&ref_=dp_merchant_link&asin=B0BHHBHZDG) Amazon Official store for ₹51,990 + Extra Bank offers. No, Buy from a store. They offer competitive rates plus waay waay better service Content viewing and academics. Actually display is an issue here. Also this is way out of my budget. But thank you for the recommendation. Actually this store is not ready to budge from 48k (without any accessories and NO bag) whereas on amazon it's selling @46k. Also isn't it that the after sales services would be provided by the service centres rather than the store? This one OLED display & just over 50k with bank offers & all you can get this one under 50k which is great"
}