{
    "id": "150knbl",
    "title": "Satyajit Ray. The finest filmaker of India.",
    "url": "https://youtu.be/SIQmW-p5yQ8",
    "selftext": "Just wanted to post this to start a discussion about the legendary Satyajit ray. The director that influenced master filmmakers around the world that we know today. Too bad that in his home country people didnt appreciate him as he deserved.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1689449147.0,
    "convurl": "https://external-preview.redd.it/3C2WBkHtMxuFwUR8qYsxI98R5RI7Jb81xPIcp16iyyI.jpg?auto=webp&amp;s=3f1e32060d524b233d3aec2240c946a754dd034e",
    "comments": [
        "Most of his movies were in Bengali so people not knowing that had trouble accessing his movies. I think those who had a certain kind of taste in movies appreciated it, even with subtitles.",
        "There is no second guessing that he was/is the finest filmmaker of India. His Hindi movies are accessible but Bengali are nowhere to be seen. Tried to search OTTs even Piracy subs but his Bengali movies are nowhere."
    ],
    "cleaned_text": "satyajit ray finest filmaker india wanted post start discussion legendary satyajit ray director influenced master filmmakers around world know today bad home country people didnt appreciate deserved ",
    "cleaned_title": "satyajit ray finest filmaker india",
    "cleaned_selftext": "wanted post start discussion legendary satyajit ray director influenced master filmmakers around world know today bad home country people didnt appreciate deserved",
    "cleaned_comments": "movies bengali people knowing trouble accessing movies think certain kind taste movies appreciated even subtitles second guessing wasis finest filmmaker india hindi movies accessible bengali nowhere seen tried search otts even piracy subs bengali movies nowhere",
    "light_cleaned_title": "Satyajit Ray. The finest filmaker of India.",
    "light_cleaned_selftext": "Just wanted to post this to start a discussion about the legendary Satyajit ray. The director that influenced master filmmakers around the world that we know today. Too bad that in his home country people didnt appreciate him as he deserved.",
    "light_cleaned_comments": "Most of his movies were in Bengali so people not knowing that had trouble accessing his movies. I think those who had a certain kind of taste in movies appreciated it, even with subtitles. There is no second guessing that he was/is the finest filmmaker of India. His Hindi movies are accessible but Bengali are nowhere to be seen. Tried to search OTTs even Piracy subs but his Bengali movies are nowhere."
}