{
    "id": "12bqpem",
    "title": "I don't get cricket fans why bother coming to a cinema just to watch ipl and ruin other people experience",
    "url": "https://www.reddit.com/gallery/12bqpem",
    "selftext": "Bro in front of me was flashbanging me while watching ipl in a house full show of john wick like bruh don't come to a movie show if you cant even focus, is this like adhd or what i literally had to tell him that its too bring and instead of keeping his phone aside he lowered the brightness like bruh 😡",
    "flair": "Rant / Vent",
    "score": 676,
    "num_comments": 83,
    "created_utc": 1680630485.0,
    "convurl": "https://i.redd.it/g99ve85rnwra1.jpg",
    "comments": [
        "2250×4000 dattani cinemas",
        "🤦‍♂️🤦‍♂️🤦‍♂️",
        "And its not like its a rare occurance i watch movies most of the time in theaters only with my uncle and someone will pick up their phone and talkbfor minutes  after blasting their mi ringtone,most the people just can't stop browsing Instagram and WhatsApp even though before every screening every cinema tells to put people phone on silent",
        "There are IPL screenings going on too. Go there instead.",
        "He probably got bored of the movie. Cant think of any other reasoning.",
        "Nah from the moment he stepped in",
        "Went to see JW4, late night show - third day - insignia. Given the high ticket prices, I was expecting a decent crowd or no crowd at all. Kinda jinxed myself — there enters a family of 6 in the row just ahead. 5 minutes in — all of them started the scrolling parade, WhatsApp, Instagram, Facebook, you name it. Replying to stories, discussing wedding cards and what not. There's a stage called anger and then comes the implosion. I went dead quiet in my head.",
        "Satta bhai Satta",
        "just tell him can u keep the fcuking phone we are not able to watch the movie \n\ncalmly",
        "I told him that exactly",
        "Their team is losing so they come there to forget it but eventually start checking score, should have mobile jammers in theaters , so they can disable mobile network",
        "Bro, OP went to watch a movie, the guy he is complaining should go to IPL screening",
        "Ikr",
        "Imagine a theater employees' or someone else's family has an emergency while they're around a movie theater.",
        "Just keep flashing your torch on his screen. Now that your experience is ruined, then why not ruin his as well🤷.\nSome people are literal asshole who have no manners on how to behave in theaters",
        "this is why i stopped going to movies, and random mfs chattering shit all throughout",
        "What was the reply?",
        "Thala for a reason",
        "Signal jammers are illegal, you shouldn't encourage private entities to be able to control the spectrum. The spectrum is your right, man.",
        "Ya. Fuck that. either spit on his screen or drag his ass out.",
        "Extremely annoying. I usually tell them off but it ruins my mood anyway.",
        "Ded",
        "First time politely, second time decent manner with a stress, third time, declare mutiny. Laatho ke bhut baato se nahi maante. If problem continues, ask for a refund from the hall manager or whoever is in charge.",
        "These kind of people and those guys whol blast music in bus or trains, most of them don't listen to polite requests. Have anyone of you ever done anything else?",
        "I also hate how, I can't reduce the brightness in Jiocinema app. It wouldn't have been a prob, if the brightness could have been lowered to the minimum level.",
        "Probably a betting fan. Hard to believe that the person is so much into cricket that they can’t miss a second of an IPL match at such an early stage of the tournament.",
        "Pee on him",
        "Then walk out of the theatre.",
        "No way someone's watching IPL during the John vs Killa scene. That was one of the most badass scenes ever.",
        "Yeah, but doesn't justify being an asshole and ruining it for others.",
        "May be he or she is married.",
        ">Went to see JW4, late night show - third day - insignia. Given the high ticket prices, I was expecting a decent crowd or no crowd at all. Kinda jinxed myself — there enters a family of 6 in the row just ahead. 5 minutes in — all of them started the scrolling parade, WhatsApp, Instagram, Facebook, you name it. Replying to stories, discussing wedding cards and what not. There's a stage called anger and then comes the implosion. I went dead quiet in my head.\n\nVery nice choice of words",
        "People don't know how to behave in theatres in this country. Infact it's getting worse day by day with people fillming scenes for stories on social media, going near the screen to dance and shouting at every single thing. It's not your \"love for cinema\" if you're ruining others' experience.",
        "Good idea. Ask once politely and then trouble them. They can't argue back as they broke into other's space and didn't maintain the decorum in the first place.",
        "IPL is just more opium version of the addicted drug.",
        "In Delhi, somebody would’ve started throwing hands.",
        "I hate that. I don't pick up phones during a movie. I may pick it up while working, but not in the theatre.",
        "Pee eww dipie",
        "This.",
        "Pretty sure he was betting.",
        "\n\n>. Given the high ticket prices, I was expecting a decent crowd\n\nWhat do you mean by this?\n\nPoor people are not well behaved? Or decent?\nRich people won't disturb you?\n\nSubtle classism 💀\n\n\nAnnoying people are annoying regardless of their wealth status.",
        "You should have brought a pencil",
        "I usually complain to the staff and they take care of it. Ita best not to fuck with people directly. Your agreement to wach the movie in peace for a certain amount of money is with the theatre management. They can either make that happen or give me my money back.",
        "I guess what he meant to say was, no normal person would come to a movie theatre in a late night show at such high prices just to scroll Social Media.\n\nFinding normal people is not so normal now ig.",
        "Nah, he absolutely didn't mean that\n\nWhat does high prices have to do with decent people?",
        "Looks like OP is in need of a pencil.",
        "Bro joined a league of ₹1 to win 1 Cr on dream11.",
        "I don't get why people even come to theatre.",
        "Bhai konsi movie thi",
        "Yes and some retards regardless of gender start scrolling through instagram in the middle of the movie for no reason at all, It so freaking annoying why the hell you even came to the movie for? To shove your phone screen in everyone's eyes!!! It's worse if it's a 3D movie!",
        "Thank you for saving my ass, good sir.",
        "What I meant by \"decent\" was a crowd who'd be there to really watch the movie rather than indulging into other miscellaneous activities. I should have articulated a little better, perhaps.",
        "I really hate the stories trend or whatever the fk that is. People don't have any basic etiquette in this country when it comes to watching movies.",
        "Ngl I still like watching movies on the big screen but shit like this ruins it for me. Now I avoid going on the weekends cos there will be more crowd.",
        "John wick 4 was anything but boring",
        "Well, good to proved wrong then 👍🏻",
        "It says \"decent crowd\" which means moderate crowd or not too crowded. Doesn't talk about the people.",
        "The only acceptable response to such dim witted creatures is to slap them mercilessly.",
        "Keep throwing popcorn at him",
        "In the last pic after he turned down the brightness",
        "I gotchu buddy!",
        "Calmly. Just like Dumbledore",
        "yes just like that",
        "If such people don't keep the phone down after telling once, they'll get a smack on the head or kick in the chair from me",
        "Calmy? Lmao. Good luck.",
        "I don't think the movie we talking abt would be boring",
        "This what happens when you give 2GB internat to Indians.",
        "Ughh stop unnecessarily picking out the worst possible interpretation",
        "Someone there might watch John Wick on their mobile, and OP can enjoy the movie with that person.",
        "Indians really creating their reddit accounts to argue",
        "Whole movie was wayy too fucking epic I mean if this movie failed to entertain you then nothing will lol",
        "POV : Tell me you're a dumbass  without telling me your a dumbass",
        "i was gonna say maybe the movie was boring but then it's john wick so 100% the dude's in the wrong",
        "Reason why I don't prefer multiplex. Wait for a few days till movie comes to OTT and I can watch without distraction.",
        "Dumbledore asked calmly",
        "Interesting. Do you get up in the middle of the movie and find someone to complain to? How do you go about it?",
        "These type of mfs and the ones who bring their toddlers to watch a movie should be dealt with strictly\n\nIf cricket is important, watch it somewhere else, don't ruin the movie for others, and the parents of toddlers who can't keep their kids from crying for half the movie should focus more on keeping their kids satisfied rather than taking them to the movies",
        "This should be a crime",
        "I did not like the movie at all. Felt like a Bollywood movie",
        "Yep. Usually they are right near the entrance. Just get up, go there, tell them."
    ],
    "cleaned_text": "dont get cricket fans bother coming cinema watch ipl ruin people experience bro front flashbanging watching ipl house full show john wick like bruh dont come movie show cant even focus like adhd literally tell bring instead keeping phone aside lowered brightness like bruh ",
    "cleaned_title": "dont get cricket fans bother coming cinema watch ipl ruin people experience",
    "cleaned_selftext": "bro front flashbanging watching ipl house full show john wick like bruh dont come movie show cant even focus like adhd literally tell bring instead keeping phone aside lowered brightness like bruh",
    "cleaned_comments": "dattani cinemas like rare occurance watch movies time theaters uncle someone pick phone talkbfor minutes blasting mi ringtonemost people cant stop browsing instagram whatsapp even though every screening every cinema tells put people phone silent ipl screenings going go instead probably got bored movie cant think reasoning nah moment stepped went see jw late night show third day insignia given high ticket prices expecting decent crowd crowd kinda jinxed enters family row ahead minutes started scrolling parade whatsapp instagram facebook name replying stories discussing wedding cards theres stage called anger comes implosion went dead quiet head satta bhai satta tell u keep fcuking phone able watch movie calmly told exactly team losing come forget eventually start checking score mobile jammers theaters disable mobile network bro op went watch movie guy complaining go ipl screening ikr imagine theater employees someone elses family emergency theyre around movie theater keep flashing torch screen experience ruined ruin well people literal asshole manners behave theaters stopped going movies random mfs chattering shit throughout reply thala reason signal jammers illegal shouldnt encourage private entities able control spectrum spectrum right man ya fuck either spit screen drag ass extremely annoying usually tell ruins mood anyway ded first time politely second time decent manner stress third time declare mutiny laatho ke bhut baato se nahi maante problem continues ask refund hall manager whoever charge kind people guys whol blast music bus trains dont listen polite requests anyone ever done anything else also hate cant reduce brightness jiocinema app wouldnt prob brightness could lowered minimum level probably betting fan hard believe person much cricket cant miss second ipl match early stage tournament pee walk theatre way someones watching ipl john vs killa scene one badass scenes ever yeah doesnt justify asshole ruining others may married went see jw late night show third day insignia given high ticket prices expecting decent crowd crowd kinda jinxed enters family row ahead minutes started scrolling parade whatsapp instagram facebook name replying stories discussing wedding cards theres stage called anger comes implosion went dead quiet head nice choice words people dont know behave theatres country infact getting worse day day people fillming scenes stories social media going near screen dance shouting every single thing love cinema youre ruining others experience good idea ask politely trouble cant argue back broke others space didnt maintain decorum first place ipl opium version addicted drug delhi somebody wouldve started throwing hands hate dont pick phones movie may pick working theatre pee eww dipie pretty sure betting given high ticket prices expecting decent crowd mean poor people well behaved decent rich people wont disturb subtle classism annoying people annoying regardless wealth status brought pencil usually complain staff take care ita best fuck people directly agreement wach movie peace certain amount money theatre management either make happen give money back guess meant say normal person would come movie theatre late night show high prices scroll social media finding normal people normal ig nah absolutely didnt mean high prices decent people looks like op need pencil bro joined league win cr dream dont get people even come theatre bhai konsi movie thi yes retards regardless gender start scrolling instagram middle movie reason freaking annoying hell even came movie shove phone screen everyones eyes worse movie thank saving ass good sir meant decent crowd whod really watch movie rather indulging miscellaneous activities articulated little better perhaps really hate stories trend whatever fk people dont basic etiquette country comes watching movies ngl still like watching movies big screen shit like ruins avoid going weekends cos crowd john wick anything boring well good proved wrong says decent crowd means moderate crowd crowded doesnt talk people acceptable response dim witted creatures slap mercilessly keep throwing popcorn last pic turned brightness gotchu buddy calmly like dumbledore yes like people dont keep phone telling theyll get smack head kick chair calmy lmao good luck dont think movie talking abt would boring happens give gb internat indians ughh stop unnecessarily picking worst possible interpretation someone might watch john wick mobile op enjoy movie person indians really creating reddit accounts argue whole movie wayy fucking epic mean movie failed entertain nothing lol pov tell youre dumbass without telling dumbass gon na say maybe movie boring john wick dudes wrong reason dont prefer multiplex wait days till movie comes ott watch without distraction dumbledore asked calmly interesting get middle movie find someone complain go type mfs ones bring toddlers watch movie dealt strictly cricket important watch somewhere else dont ruin movie others parents toddlers cant keep kids crying half movie focus keeping kids satisfied rather taking movies crime like movie felt like bollywood movie yep usually right near entrance get go tell",
    "light_cleaned_title": "I don't get cricket fans why bother coming to a cinema just to watch ipl and ruin other people experience",
    "light_cleaned_selftext": "Bro in front of me was flashbanging me while watching ipl in a house full show of john wick like bruh don't come to a movie show if you cant even focus, is this like adhd or what i literally had to tell him that its too bring and instead of keeping his phone aside he lowered the brightness like bruh 😡",
    "light_cleaned_comments": "2250×4000 dattani cinemas 🤦‍♂️🤦‍♂️🤦‍♂️ And its not like its a rare occurance i watch movies most of the time in theaters only with my uncle and someone will pick up their phone and talkbfor minutes after blasting their mi ringtone,most the people just can't stop browsing Instagram and WhatsApp even though before every screening every cinema tells to put people phone on silent There are IPL screenings going on too. Go there instead. He probably got bored of the movie. Cant think of any other reasoning. Nah from the moment he stepped in Went to see JW4, late night show - third day - insignia. Given the high ticket prices, I was expecting a decent crowd or no crowd at all. Kinda jinxed myself — there enters a family of 6 in the row just ahead. 5 minutes in — all of them started the scrolling parade, WhatsApp, Instagram, Facebook, you name it. Replying to stories, discussing wedding cards and what not. There's a stage called anger and then comes the implosion. I went dead quiet in my head. Satta bhai Satta just tell him can u keep the fcuking phone we are not able to watch the movie calmly I told him that exactly Their team is losing so they come there to forget it but eventually start checking score, should have mobile jammers in theaters , so they can disable mobile network Bro, OP went to watch a movie, the guy he is complaining should go to IPL screening Ikr Imagine a theater employees' or someone else's family has an emergency while they're around a movie theater. Just keep flashing your torch on his screen. Now that your experience is ruined, then why not ruin his as well🤷. Some people are literal asshole who have no manners on how to behave in theaters this is why i stopped going to movies, and random mfs chattering shit all throughout What was the reply? Thala for a reason Signal jammers are illegal, you shouldn't encourage private entities to be able to control the spectrum. The spectrum is your right, man. Ya. Fuck that. either spit on his screen or drag his ass out. Extremely annoying. I usually tell them off but it ruins my mood anyway. Ded First time politely, second time decent manner with a stress, third time, declare mutiny. Laatho ke bhut baato se nahi maante. If problem continues, ask for a refund from the hall manager or whoever is in charge. These kind of people and those guys whol blast music in bus or trains, most of them don't listen to polite requests. Have anyone of you ever done anything else? I also hate how, I can't reduce the brightness in Jiocinema app. It wouldn't have been a prob, if the brightness could have been lowered to the minimum level. Probably a betting fan. Hard to believe that the person is so much into cricket that they can’t miss a second of an IPL match at such an early stage of the tournament. Pee on him Then walk out of the theatre. No way someone's watching IPL during the John vs Killa scene. That was one of the most badass scenes ever. Yeah, but doesn't justify being an asshole and ruining it for others. May be he or she is married. >Went to see JW4, late night show - third day - insignia. Given the high ticket prices, I was expecting a decent crowd or no crowd at all. Kinda jinxed myself — there enters a family of 6 in the row just ahead. 5 minutes in — all of them started the scrolling parade, WhatsApp, Instagram, Facebook, you name it. Replying to stories, discussing wedding cards and what not. There's a stage called anger and then comes the implosion. I went dead quiet in my head. Very nice choice of words People don't know how to behave in theatres in this country. Infact it's getting worse day by day with people fillming scenes for stories on social media, going near the screen to dance and shouting at every single thing. It's not your \"love for cinema\" if you're ruining others' experience. Good idea. Ask once politely and then trouble them. They can't argue back as they broke into other's space and didn't maintain the decorum in the first place. IPL is just more opium version of the addicted drug. In Delhi, somebody would’ve started throwing hands. I hate that. I don't pick up phones during a movie. I may pick it up while working, but not in the theatre. Pee eww dipie This. Pretty sure he was betting. >. Given the high ticket prices, I was expecting a decent crowd What do you mean by this? Poor people are not well behaved? Or decent? Rich people won't disturb you? Subtle classism 💀 Annoying people are annoying regardless of their wealth status. You should have brought a pencil I usually complain to the staff and they take care of it. Ita best not to fuck with people directly. Your agreement to wach the movie in peace for a certain amount of money is with the theatre management. They can either make that happen or give me my money back. I guess what he meant to say was, no normal person would come to a movie theatre in a late night show at such high prices just to scroll Social Media. Finding normal people is not so normal now ig. Nah, he absolutely didn't mean that What does high prices have to do with decent people? Looks like OP is in need of a pencil. Bro joined a league of ₹1 to win 1 Cr on dream11. I don't get why people even come to theatre. Bhai konsi movie thi Yes and some retards regardless of gender start scrolling through instagram in the middle of the movie for no reason at all, It so freaking annoying why the hell you even came to the movie for? To shove your phone screen in everyone's eyes!!! It's worse if it's a 3D movie! Thank you for saving my ass, good sir. What I meant by \"decent\" was a crowd who'd be there to really watch the movie rather than indulging into other miscellaneous activities. I should have articulated a little better, perhaps. I really hate the stories trend or whatever the fk that is. People don't have any basic etiquette in this country when it comes to watching movies. Ngl I still like watching movies on the big screen but shit like this ruins it for me. Now I avoid going on the weekends cos there will be more crowd. John wick 4 was anything but boring Well, good to proved wrong then 👍🏻 It says \"decent crowd\" which means moderate crowd or not too crowded. Doesn't talk about the people. The only acceptable response to such dim witted creatures is to slap them mercilessly. Keep throwing popcorn at him In the last pic after he turned down the brightness I gotchu buddy! Calmly. Just like Dumbledore yes just like that If such people don't keep the phone down after telling once, they'll get a smack on the head or kick in the chair from me Calmy? Lmao. Good luck. I don't think the movie we talking abt would be boring This what happens when you give 2GB internat to Indians. Ughh stop unnecessarily picking out the worst possible interpretation Someone there might watch John Wick on their mobile, and OP can enjoy the movie with that person. Indians really creating their reddit accounts to argue Whole movie was wayy too fucking epic I mean if this movie failed to entertain you then nothing will lol POV : Tell me you're a dumbass without telling me your a dumbass i was gonna say maybe the movie was boring but then it's john wick so 100% the dude's in the wrong Reason why I don't prefer multiplex. Wait for a few days till movie comes to OTT and I can watch without distraction. Dumbledore asked calmly Interesting. Do you get up in the middle of the movie and find someone to complain to? How do you go about it? These type of mfs and the ones who bring their toddlers to watch a movie should be dealt with strictly If cricket is important, watch it somewhere else, don't ruin the movie for others, and the parents of toddlers who can't keep their kids from crying for half the movie should focus more on keeping their kids satisfied rather than taking them to the movies This should be a crime I did not like the movie at all. Felt like a Bollywood movie Yep. Usually they are right near the entrance. Just get up, go there, tell them."
}