{
    "id": "18tq8qq",
    "title": "Wrestling Body Office Moved Out Of BJP MP Brij Bhushan's Residence",
    "url": "https://www.ndtv.com/india-news/wrestling-federation-of-india-office-moved-out-of-bjp-mp-brij-bhushans-residence-4764833",
    "selftext": "Wrestling Body Office was being run from his residence 😳",
    "flair": "Politics",
    "score": 371,
    "num_comments": 26,
    "created_utc": 1703865299,
    "convurl": "https://external-preview.redd.it/YJYoUXKJ4SXalCTfPNLtrTGr9wbBpnZheveh0C-T1_A.jpg?auto=webp&s=547bf3574db7871e14f4ae8ca11cbdc1af2ef383",
    "comments": [
        "Work from home?",
        "Wth? Why was it in his residence in the first place?",
        "BJP MP Brij Bhushan Sharan Singh, after the sports ministry had recently raised serious objections to it.\n\nWow , now y'all wake up 🙄",
        "Why in the fucking first place ...",
        "Seeing all this it's a miracle we make any progress in non cricketing sports at all.",
        "This is BJPs own doing. \npretending they are correcting 70 years of Congress mistakes.",
        "Easy access to the bedroom.🤢🤮",
        "Clowns evrywhere",
        "UPA 2\nBJP 1\nBJP 2\n\n2012-2023 \n\nTook 3 successive Govts for a sports association's office to be moved out of the premises of a MP's house? \n\nI cant imagine how much reforms are needed to make sports associations work like legitimate organisations and not something for MPs to use to solidify their political career. I dont watch sports all that much but I follow news regarding sports governance and I am tired of this crap now. So many associations have been suspended by international bodies or by judiciary within India. At district and state associations  things are infinitely worse, speaking from what ive heard friends in state and national level teams say. \n\nOur athletes and sportspersons need better environment. Some politics is inevitable but I think radical reforms are needed to atleast ensure accountability and transparency.",
        "Probably so that he can show all his household expenses as expenses made for the office and  get taxpayer's money to reimburse him",
        "It says he was sexually harassing the guys...",
        "Pretty much every sport in every state is run like this (with the exception of cricket possibly).  \n\nI personally know that the Archery association in one particular state is run like the personal business of one individual. Anyone who has any ambition at all in archery in that state has to train under him (he has a few rivals, but if you train under them he won't even let you participate in any event), buy equipment through him etc.",
        "Brij bhusan fucked up saying dabdaba tha dabdaba rahega after winning wfi election lmao",
        "Cosmetic changes.",
        "Dungeon*",
        "I just can't help reading this as  Dabata tha Dabata rahega every time.",
        "Even worse he said that when a stooge of his won it\n\nLike at least pretend that the new president is neutral",
        "Is that enough?",
        "This is very much similar to some ghamandia and ahankari saying \"ek akela sab pe bhari\".",
        "meh\n\nno point trying to play for country.",
        "* the voters own doing",
        "Whats the alternative?",
        "Balatkar Janta Party ╭( ✖\\_✖ )╮",
        "So that he can more fun with players",
        "Dabta tha, dabata rahunga",
        "Do they get control over financial resources? "
    ],
    "cleaned_text": "wrestling body office moved bjp mp brij bhushans residence wrestling body office run residence ",
    "cleaned_title": "wrestling body office moved bjp mp brij bhushans residence",
    "cleaned_selftext": "wrestling body office run residence",
    "cleaned_comments": "work home wth residence first place bjp mp brij bhushan sharan singh sports ministry recently raised serious objections wow yall wake fucking first place seeing miracle make progress non cricketing sports bjps pretending correcting years congress mistakes easy access bedroom clowns evrywhere upa bjp bjp took successive govts sports associations office moved premises mps house cant imagine much reforms needed make sports associations work like legitimate organisations something mps use solidify political career dont watch sports much follow news regarding sports governance tired crap many associations suspended international bodies judiciary within india district state associations things infinitely worse speaking ive heard friends state national level teams say athletes sportspersons need better environment politics inevitable think radical reforms needed atleast ensure accountability transparency probably show household expenses expenses made office get taxpayers money reimburse says sexually harassing guys pretty much every sport every state run like exception cricket possibly personally know archery association one particular state run like personal business one individual anyone ambition archery state train rivals train wont even let participate event buy equipment etc brij bhusan fucked saying dabdaba tha dabdaba rahega winning wfi election lmao cosmetic changes dungeon cant help reading dabata tha dabata rahega every time even worse said stooge like least pretend new president neutral enough much similar ghamandia ahankari saying ek akela sab pe bhari meh point trying play country voters whats alternative balatkar janta party fun players dabta tha dabata rahunga get control financial resources",
    "light_cleaned_title": "Wrestling Body Office Moved Out Of BJP MP Brij Bhushan's Residence",
    "light_cleaned_selftext": "Wrestling Body Office was being run from his residence 😳",
    "light_cleaned_comments": "Work from home? Wth? Why was it in his residence in the first place? BJP MP Brij Bhushan Sharan Singh, after the sports ministry had recently raised serious objections to it. Wow , now y'all wake up 🙄 Why in the fucking first place ... Seeing all this it's a miracle we make any progress in non cricketing sports at all. This is BJPs own doing. pretending they are correcting 70 years of Congress mistakes. Easy access to the bedroom.🤢🤮 Clowns evrywhere UPA 2 BJP 1 BJP 2 2012-2023 Took 3 successive Govts for a sports association's office to be moved out of the premises of a MP's house? I cant imagine how much reforms are needed to make sports associations work like legitimate organisations and not something for MPs to use to solidify their political career. I dont watch sports all that much but I follow news regarding sports governance and I am tired of this crap now. So many associations have been suspended by international bodies or by judiciary within India. At district and state associations things are infinitely worse, speaking from what ive heard friends in state and national level teams say. Our athletes and sportspersons need better environment. Some politics is inevitable but I think radical reforms are needed to atleast ensure accountability and transparency. Probably so that he can show all his household expenses as expenses made for the office and get taxpayer's money to reimburse him It says he was sexually harassing the guys... Pretty much every sport in every state is run like this (with the exception of cricket possibly). I personally know that the Archery association in one particular state is run like the personal business of one individual. Anyone who has any ambition at all in archery in that state has to train under him (he has a few rivals, but if you train under them he won't even let you participate in any event), buy equipment through him etc. Brij bhusan fucked up saying dabdaba tha dabdaba rahega after winning wfi election lmao Cosmetic changes. Dungeon* I just can't help reading this as Dabata tha Dabata rahega every time. Even worse he said that when a stooge of his won it Like at least pretend that the new president is neutral Is that enough? This is very much similar to some ghamandia and ahankari saying \"ek akela sab pe bhari\". meh no point trying to play for country. * the voters own doing Whats the alternative? Balatkar Janta Party ╭( ✖\\_✖ )╮ So that he can more fun with players Dabta tha, dabata rahunga Do they get control over financial resources?"
}