{
    "id": "1hjoell",
    "title": "Indian Influencer scams",
    "url": "https://www.reddit.com/r/india/comments/1hjoell/indian_influencer_scams/",
    "selftext": "Brut.India just posted a video on how much these Instagram influencers make through their online profiles. We’re the ones mindlessly watching this content online, wasting our time and ruining our eyesight and they’re the ones making money and getting rich.\n\nLink to the video: https://youtu.be/JxAuDdYaVJI?si=5kImNs_EzG8lPz5S\n\nI know there are “fans” of these influencers, like Sakshi, who might argue that it’s their life and they can do whatever they want, and that’s absolutely true. They can, and they are doing it. But my question is for the youngsters who spend hours on this app, mindlessly scrolling and watching shit which you’ll forget the next day.\n\nTrust me, even I’m absolutely guilty of this. But watching that Brut.India video was an eye-opener, and the worst part of it all are the products they try to sell to us in the name of PROMOTION. They’re getting these FREE products that I’ve seen these influencers give out to friends or family or even through a giveaway, but also them promoting these products, saying how amazing it is, and urging us to BUY it. The funniest part of it all is that not only do they get these products, but they get paid to share these fake stories on Instagram, and we’re the ones who are actually losing money buying these.\n\nI urge everyone here to just check the hours you spend every day scrolling through these videos when you could be reading a book and see someone else benefiting through our DOOM. You think coke and sugar are addictive? Just uninstall the app for a week, and you can see for yourself how addictive this app is. Through all these advanced algorithms for suggestions, this app makes sure that we’re stuck in this app every time you open it, ruining your eyesight, wasting your time, reducing your attention span to 30 seconds, and, lastly, making someone like Urfi and Orry rich. You think paparazzis are making these folks rich? Pages like instantbollywood post like 100 videos a day of these celebs that we consume and comment and share giving them the money they need to promote these people. \n\nFor those who are wondering what you can do to get out of this loop:\n\nUNFOLLOW every single celebrity, business, and Insta celebs. Orry and Kim K are living their life in their fancy cars while you’re rotting in your bed. Why the fuck do you care so much about what new outfit they’re wearing or what their yoga routine is?\n\nSecondly, use “OneSec” app to control the time you spend on the app. Use tutorials online on how to set it up. https://youtu.be/UVKVTcYWTdQ?si=LV2aFkrKXdrYPWWu   \n\nPlease let this be an eye opener to anyone who's reading this. Stop giving these fake celebrities with no real talent any more of your attention and please remember there's no such thing as bad publicit. Everything is scripted and made so that we engage and consume.",
    "flair": "Rant / Vent",
    "score": 7,
    "num_comments": 2,
    "created_utc": 1734831547.0,
    "convurl": "https://external-preview.redd.it/V8lP_Oe5WyCh9oYhnWImOSbQ-36Nj_Twv0_2DPZOOaA.jpg?auto=webp&s=db866720408d6f6222b20fa8ac29eaf92b90eb06",
    "comments": [
        "It's called advertising.",
        "Huh . Did you just wake up ?"
    ],
    "cleaned_text": "indian influencer scams brutindia posted video much instagram influencers make online profiles ones mindlessly watching content online wasting time ruining eyesight theyre ones making money getting rich link video know fans influencers like sakshi might argue life whatever want thats absolutely true question youngsters spend hours app mindlessly scrolling watching shit youll forget next day trust even im absolutely guilty watching brutindia video eyeopener worst part products try sell us name promotion theyre getting free products ive seen influencers give friends family even giveaway also promoting products saying amazing urging us buy funniest part get products get paid share fake stories instagram ones actually losing money buying urge everyone check hours spend every day scrolling videos could reading book see someone else benefiting doom think coke sugar addictive uninstall app week see addictive app advanced algorithms suggestions app makes sure stuck app every time open ruining eyesight wasting time reducing attention span seconds lastly making someone like urfi orry rich think paparazzis making folks rich pages like instantbollywood post like videos day celebs consume comment share giving money need promote people wondering get loop unfollow every single celebrity business insta celebs orry kim k living life fancy cars youre rotting bed fuck care much new outfit theyre wearing yoga routine secondly use onesec app control time spend app use tutorials online set please let eye opener anyone whos reading stop giving fake celebrities real talent attention please remember theres thing bad publicit everything scripted made engage consume ",
    "cleaned_title": "indian influencer scams",
    "cleaned_selftext": "brutindia posted video much instagram influencers make online profiles ones mindlessly watching content online wasting time ruining eyesight theyre ones making money getting rich link video know fans influencers like sakshi might argue life whatever want thats absolutely true question youngsters spend hours app mindlessly scrolling watching shit youll forget next day trust even im absolutely guilty watching brutindia video eyeopener worst part products try sell us name promotion theyre getting free products ive seen influencers give friends family even giveaway also promoting products saying amazing urging us buy funniest part get products get paid share fake stories instagram ones actually losing money buying urge everyone check hours spend every day scrolling videos could reading book see someone else benefiting doom think coke sugar addictive uninstall app week see addictive app advanced algorithms suggestions app makes sure stuck app every time open ruining eyesight wasting time reducing attention span seconds lastly making someone like urfi orry rich think paparazzis making folks rich pages like instantbollywood post like videos day celebs consume comment share giving money need promote people wondering get loop unfollow every single celebrity business insta celebs orry kim k living life fancy cars youre rotting bed fuck care much new outfit theyre wearing yoga routine secondly use onesec app control time spend app use tutorials online set please let eye opener anyone whos reading stop giving fake celebrities real talent attention please remember theres thing bad publicit everything scripted made engage consume",
    "cleaned_comments": "called advertising huh wake",
    "light_cleaned_title": "Indian Influencer scams",
    "light_cleaned_selftext": "Brut.India just posted a video on how much these Instagram influencers make through their online profiles. We’re the ones mindlessly watching this content online, wasting our time and ruining our eyesight and they’re the ones making money and getting rich. Link to the video: I know there are “fans” of these influencers, like Sakshi, who might argue that it’s their life and they can do whatever they want, and that’s absolutely true. They can, and they are doing it. But my question is for the youngsters who spend hours on this app, mindlessly scrolling and watching shit which you’ll forget the next day. Trust me, even I’m absolutely guilty of this. But watching that Brut.India video was an eye-opener, and the worst part of it all are the products they try to sell to us in the name of PROMOTION. They’re getting these FREE products that I’ve seen these influencers give out to friends or family or even through a giveaway, but also them promoting these products, saying how amazing it is, and urging us to BUY it. The funniest part of it all is that not only do they get these products, but they get paid to share these fake stories on Instagram, and we’re the ones who are actually losing money buying these. I urge everyone here to just check the hours you spend every day scrolling through these videos when you could be reading a book and see someone else benefiting through our DOOM. You think coke and sugar are addictive? Just uninstall the app for a week, and you can see for yourself how addictive this app is. Through all these advanced algorithms for suggestions, this app makes sure that we’re stuck in this app every time you open it, ruining your eyesight, wasting your time, reducing your attention span to 30 seconds, and, lastly, making someone like Urfi and Orry rich. You think paparazzis are making these folks rich? Pages like instantbollywood post like 100 videos a day of these celebs that we consume and comment and share giving them the money they need to promote these people. For those who are wondering what you can do to get out of this loop: UNFOLLOW every single celebrity, business, and Insta celebs. Orry and Kim K are living their life in their fancy cars while you’re rotting in your bed. Why the fuck do you care so much about what new outfit they’re wearing or what their yoga routine is? Secondly, use “OneSec” app to control the time you spend on the app. Use tutorials online on how to set it up. Please let this be an eye opener to anyone who's reading this. Stop giving these fake celebrities with no real talent any more of your attention and please remember there's no such thing as bad publicit. Everything is scripted and made so that we engage and consume.",
    "light_cleaned_comments": "It's called advertising. Huh . Did you just wake up ?"
}