{
    "id": "upkb7n",
    "title": "What's wrong with some companies?",
    "url": "https://www.reddit.com/r/india/comments/upkb7n/whats_wrong_with_some_companies/",
    "selftext": "Offering these CTC to freshers even to masters students in year 2022 for such an important work like quality control and quality assurance of medicines, without which the medicine never can reach market. that's too is ctc means basic salary is even low. Its sad that all the money goes to the doctor while the background heroes get underpaid like this. (Its not same for every company)\n\nhttps://preview.redd.it/y10svcgpsgz81.jpg?width=776&amp;format=pjpg&amp;auto=webp&amp;s=6b0cc14f87d451d98dcb3b1fdf0d7905c221ce40",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 8,
    "created_utc": 1652544207,
    "convurl": "https://b.thumbs.redditmedia.com/Vf8vAZkAIEUCQEuV2I8_iC2Z8gpgw8Kb8WUQyq-qNOc.jpg",
    "comments": [
        "TBH, quality control in India has never been that important. Unfortunately even in Pharma the bottom line is more important than quality control.\n\n[https://www.amazon.in/Bottle-Lies-Inside-Story-Generic/dp/0062338781](https://www.amazon.in/Bottle-Lies-Inside-Story-Generic/dp/0062338781)\n\nThis book details some of these issues, although Im not sure how accurate it is.",
        "Can u share the book in pdf to me?",
        "[https://1lib.in/book/13653962/0c0552](https://1lib.in/book/13653962/0c0552)\n\nYou can find it here",
        "I'm unsure but this looks like a recruiting agency advertisement. One of my friend used to work in one of these in Delhi and their entire business model is to hire people on contract basis and pocket a portion of their salary (i.e you are employed by the agency X and contacted out to the actual company Y. This company pays agency X a fixed amount (say 30000rs per worker) for the month which the agency pockets and pays the actual person peanuts (like 10-15000rs) in their payroll).",
        "Pyramid scheme?",
        "Cause this is India. Here you will only be exploited by the companies without a good work life balance, pay or other benefits like overtime pay..\n\nThat's why I have moved to Canada and continuing my career here. I am very happy with the pay and work culture here.",
        "If it's an indian pharma based company it is going to pay less. If it is a MNC pharma then it will pay better.\n\nThe overall cost is also reflected in the MRP of Indian Pharma manufactured medicines compared to MNC manufactured counterparts"
    ],
    "cleaned_text": "whats wrong companies offering ctc freshers even masters students year important work like quality control quality assurance medicines without medicine never reach market thats ctc means basic salary even low sad money goes doctor background heroes get underpaid like every company ",
    "cleaned_title": "whats wrong companies",
    "cleaned_selftext": "offering ctc freshers even masters students year important work like quality control quality assurance medicines without medicine never reach market thats ctc means basic salary even low sad money goes doctor background heroes get underpaid like every company",
    "cleaned_comments": "tbh quality control india never important unfortunately even pharma bottom line important quality control httpswwwamazoninbottleliesinsidestorygenericdphttpswwwamazoninbottleliesinsidestorygenericdp book details issues although im sure accurate u share book pdf httpslibinbookchttpslibinbookc find im unsure looks like recruiting agency advertisement one friend used work one delhi entire business model hire people contract basis pocket portion salary ie employed agency x contacted actual company company pays agency x fixed amount say rs per worker month agency pockets pays actual person peanuts like rs payroll pyramid scheme cause india exploited companies without good work life balance pay benefits like overtime pay thats moved canada continuing career happy pay work culture indian pharma based company going pay less mnc pharma pay better overall cost also reflected mrp indian pharma manufactured medicines compared mnc manufactured counterparts",
    "light_cleaned_title": "What's wrong with some companies?",
    "light_cleaned_selftext": "Offering these CTC to freshers even to masters students in year 2022 for such an important work like quality control and quality assurance of medicines, without which the medicine never can reach market. that's too is ctc means basic salary is even low. Its sad that all the money goes to the doctor while the background heroes get underpaid like this. (Its not same for every company)",
    "light_cleaned_comments": "TBH, quality control in India has never been that important. Unfortunately even in Pharma the bottom line is more important than quality control. [https://www.amazon.in/Bottle-Lies-Inside-Story-Generic/dp/0062338781](https://www.amazon.in/Bottle-Lies-Inside-Story-Generic/dp/0062338781) This book details some of these issues, although Im not sure how accurate it is. Can u share the book in pdf to me? [https://1lib.in/book/13653962/0c0552](https://1lib.in/book/13653962/0c0552) You can find it here I'm unsure but this looks like a recruiting agency advertisement. One of my friend used to work in one of these in Delhi and their entire business model is to hire people on contract basis and pocket a portion of their salary (i.e you are employed by the agency X and contacted out to the actual company Y. This company pays agency X a fixed amount (say 30000rs per worker) for the month which the agency pockets and pays the actual person peanuts (like 10-15000rs) in their payroll). Pyramid scheme? Cause this is India. Here you will only be exploited by the companies without a good work life balance, pay or other benefits like overtime pay.. That's why I have moved to Canada and continuing my career here. I am very happy with the pay and work culture here. If it's an indian pharma based company it is going to pay less. If it is a MNC pharma then it will pay better. The overall cost is also reflected in the MRP of Indian Pharma manufactured medicines compared to MNC manufactured counterparts"
}