{
    "id": "18b23b8",
    "title": "No disruptions in Parliament this time, INDIA bloc parties resolve",
    "url": "https://www.thehindu.com/news/national/no-disruptions-this-time-india-bloc-parties-resolve/article67605113.ece",
    "selftext": "https://12ft.io/https://www.thehindu.com/news/national/no-disruptions-this-time-india-bloc-parties-resolve/article67605113.ece",
    "flair": "Politics",
    "score": 35,
    "num_comments": 6,
    "created_utc": 1701745310.0,
    "convurl": "https://external-preview.redd.it/Ba0EzJpSmr0TRahuLAOu60yGlrl2-69FoyEpeBSakGs.jpg?auto=webp&s=f85b71e495e8c462377605482804b1323f201619",
    "comments": [
        "I am really excited to see true democracy at play. Hopefully this sets a trend and isn't a one time exception!",
        "> According to the sources, it was resolved during the detailed discussion that this is effectively the last chance the Opposition will get to speak in Parliament    \n\nIf the mic of opposition works or JBP member don't start a ruckus. They could have other tricks up their sleeve was well.",
        "So a resolution has to adopted to not create a ruckus, implying that creating one is the norm and exceptions are to be made otherwise",
        "It was a norm during previous government's rule itself.",
        "Not saying any party/ collimation is the epitome of parliamentary decency, it's just that anti defection has ensured that parliamentary debates are less relevant and attention grabbing antics are becoming the norm which are a disgrace",
        "Good. Hope the treasury respects that. They also contribute to over 50% of the ruckus"
    ],
    "cleaned_text": "disruptions parliament time india bloc parties resolve  ",
    "cleaned_title": "disruptions parliament time india bloc parties resolve",
    "cleaned_selftext": "",
    "cleaned_comments": "really excited see true democracy play hopefully sets trend isnt one time exception according sources resolved detailed discussion effectively last chance opposition get speak parliament mic opposition works jbp member dont start ruckus could tricks sleeve well resolution adopted create ruckus implying creating one norm exceptions made otherwise norm previous governments rule saying party collimation epitome parliamentary decency anti defection ensured parliamentary debates less relevant attention grabbing antics becoming norm disgrace good hope treasury respects also contribute ruckus",
    "light_cleaned_title": "No disruptions in Parliament this time, INDIA bloc parties resolve",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "I am really excited to see true democracy at play. Hopefully this sets a trend and isn't a one time exception! > According to the sources, it was resolved during the detailed discussion that this is effectively the last chance the Opposition will get to speak in Parliament If the mic of opposition works or JBP member don't start a ruckus. They could have other tricks up their sleeve was well. So a resolution has to adopted to not create a ruckus, implying that creating one is the norm and exceptions are to be made otherwise It was a norm during previous government's rule itself. Not saying any party/ collimation is the epitome of parliamentary decency, it's just that anti defection has ensured that parliamentary debates are less relevant and attention grabbing antics are becoming the norm which are a disgrace Good. Hope the treasury respects that. They also contribute to over 50% of the ruckus"
}