{
    "id": "1gfg0g5",
    "title": "One small step for a man one giant leap for a insurance claim",
    "url": "https://i.redd.it/5xos31kb5uxd1.jpeg",
    "selftext": "I turned on flash merely 10 metres away from this and it was pitch darkness without the flash. ",
    "flair": "Rant / Vent",
    "score": 225,
    "num_comments": 17,
    "created_utc": 1730268766.0,
    "convurl": "https://i.redd.it/5xos31kb5uxd1.jpeg",
    "comments": [
        "Act of god detected, claim rejected.",
        "Neil Armstrong is proud of you",
        "Ye konsa flash h bhai. Poora road diwali jaisa krdia",
        "I fun 11",
        "I can the see the $5 Trillion economy inside the pit. 😱😱",
        "Man, I fell down one when I was shitfaced after Spain beat Netherlands in the world cup. I was mid-conversation with my girlfriend and after the people around dragged me out, I picked my phone and she was still talking as if nothing happened.",
        "That’s Modi Fication",
        "It was our non biological Supreme Master's miraculous other worldly power that helped you to navigate this dark age of cosmos. ",
        "She's a keeper. Come rain, come snow, she is going to stay by your side like the day you met.",
        "I hope her husband understands that🥲",
        "Insurance only work one way and unfortunately not our way",
        "Pennywise is waiting",
        "🤣🤣🤣",
        "🤣🤣",
        "You missed your journey to the Wonderland"
    ],
    "cleaned_text": "one small step man one giant leap insurance claim turned flash merely metres away pitch darkness without flash ",
    "cleaned_title": "one small step man one giant leap insurance claim",
    "cleaned_selftext": "turned flash merely metres away pitch darkness without flash",
    "cleaned_comments": "act god detected claim rejected neil armstrong proud ye konsa flash h bhai poora road diwali jaisa krdia fun see trillion economy inside pit man fell one shitfaced spain beat netherlands world cup midconversation girlfriend people around dragged picked phone still talking nothing happened thats modi fication non biological supreme masters miraculous worldly power helped navigate dark age cosmos shes keeper come rain come snow going stay side like day met hope husband understands insurance work one way unfortunately way pennywise waiting missed journey wonderland",
    "light_cleaned_title": "One small step for a man one giant leap for a insurance claim",
    "light_cleaned_selftext": "I turned on flash merely 10 metres away from this and it was pitch darkness without the flash.",
    "light_cleaned_comments": "Act of god detected, claim rejected. Neil Armstrong is proud of you Ye konsa flash h bhai. Poora road diwali jaisa krdia I fun 11 I can the see the $5 Trillion economy inside the pit. 😱😱 Man, I fell down one when I was shitfaced after Spain beat Netherlands in the world cup. I was mid-conversation with my girlfriend and after the people around dragged me out, I picked my phone and she was still talking as if nothing happened. That’s Modi Fication It was our non biological Supreme Master's miraculous other worldly power that helped you to navigate this dark age of cosmos. She's a keeper. Come rain, come snow, she is going to stay by your side like the day you met. I hope her husband understands that🥲 Insurance only work one way and unfortunately not our way Pennywise is waiting 🤣🤣🤣 🤣🤣 You missed your journey to the Wonderland"
}