{
    "id": "18gpd3p",
    "title": "What are the steps taken by Indian Govt for unemployment?",
    "url": "https://www.reddit.com/r/india/comments/18gpd3p/what_are_the_steps_taken_by_indian_govt_for/",
    "selftext": "Why is CMIE unemployment data not on any TV news discussion?  \nUnemployment rate has almost doubled in a few years. With more an more people left unemployed increases the crime eventually and these will then become the target of terrorist forces. This is a severe issue and also a ticking time bomb and yet no media coverage? No Qs being asked of our elected representatives?\n\nWhat are your thoughts? Are you satisfied with what our elected representatives are doing about it?  \nReference:  \n[Unemployment Rate In India (2008 To 2023): Current Rate, Historical Trends And More - Forbes India](https://www.forbesindia.com/article/explainers/unemployment-rate-in-india/87441/1)",
    "flair": "Policy/Economy",
    "score": 14,
    "num_comments": 19,
    "created_utc": 1702397273.0,
    "convurl": "https://external-preview.redd.it/mGOb5NUgom-HLNF6-lgFaCR89F5R6W2j_0u4zyPWfo0.jpg?auto=webp&s=8863bca200247da62c213ae07de143336c5bfda5",
    "comments": [
        "India is way past the critical thinking  and questioning point. \n\nDo the majority of people in Russia question why Putin is signing up for another term even after this catestrophy?",
        "What catastrophe?",
        ">What catastrophe?\n\nWhen awareness is lost, how do you question?",
        "Exactly. \n\nAnyone else coming here. I meant in the sense that you think people in the country get to know the problems there? \n\nThey Are at an advanced stage than at what we are. They don't know about the problems. Just brainwashed.",
        "Giving 5KG of free rations to 80 crore indians. What more are you eternal complainers want such a visionary government to do. \n\nIts a different matter that free distribution will last till next general elections but still!!!",
        "How else are they going to fight the religious war with the enemies of Hinduism if there aren't unemployed misguided youths, the very youths who are now being made to believe that the so called \"Hinduism\" is in danger ?? Agniveers fighting alongside will be the icing on the cake !",
        "1. Established IT Cell",
        "Instead of screaming for 70 hour working weeks, would it not be more productive to provide gainful employment to more people with more reasonable working hours? We have thousands of students graduating every year…or am I being too simplistic?",
        "Not very sure, that comment by N Murthy was probably for the top leaderships because it is difficult to find such top talent in India as most of them are settled abroad already. In case he meant it for juniors then (I might be wrong but) I kind of think the same way that companies like Infosys(his company) can start hiring more junior engineers and it will solve the problem of total amount of work being done by India in a year as well as employment issues. They say they have world class training and research centers, then why is it so difficult to pick up people and train them to get their work done why do they need more work hours? Do they lack cash in bank or any other resource?",
        "But then the Q is how can we prod the media to do its job better or what is its replacement? What can be done to bring such discussions to the forefront?",
        "I understand but we don't need a majority to Q. We just need a few people to do that just so that we cross the critical mass and then even others will join.  \n\n\nWhen Modi govt repealed the farm laws was it the majority of farmers that were protesting?",
        "All aren't brainwashed. There were protests but then the Govt is too powerful with their actions.  \n\n\nBut media not being able to question the govt and opposition not being able to play the devil's advocate well are big failures of electoral govt systems",
        ">We just need a few people to do that\n\nThose few people (activists) are in prison now, and they could by no way influence the mass. \n\nThe country has proved again and again, election after election, that it has no values or ethics in elections after elections. They also dont have an alternative to BJP.\n\n> When Modi govt repealed the farm laws was it the majority of farmers that were protesting?\n\nYes, it was farmers, mostly from Punjab/ Haryana. The protesters came to Delhi in mass and choked the city.  The protesters dont represent 50% of Indian farmers in numbers, but they had a lot of support from farmers  from almost all the states in India, verbal and nonverbal.",
        ">had a lot of support from farmers  from almost all the states in India, verbal and nonverbal\n\nDoesn't seem so from the lot I have spoken to.  \n\n\nI come from a family whose roots are in the village still and when I talked to the elders they were totally unaware as to what are the laws that will be passed and why such ruckus. When I prodded more they said they would like to have companies buy from them but not if it opens doors for being exploited. I think unless you place safeguards difficult enough for the companies to exploit the farmers who are at the bottom of the food chain and easiest to exploit due to owning/trying to sell perishable goods, they will be exploited. That's where I'm mad at the media and opposition that they did not being out these points.  \n\n\nI would even argue that if the laws were as fair as ruling party claimed then they have the support of the news media, they could have broken the law bit by bit and answered all opposition calling them into debates with Navika, etc in an attempt to educate the public, bring IAS officers and let them break it to the public with proper justification and even ask critics (like Raghuram Rajan, Abhijeet B) to chime in with Q.",
        "Why would they care as long as they are sleeping in beds of money ! Same applies to the politicians of this country, they are buying assets in foreign countries while they loot the idiotic indian population ! And when one day shit hits the fan in this country of idiots they will be the first to escape from this hell-hole which as of now they are busy digging deeper. \n\nEver wonder why Indians make the biggest share of immigrants and indians forgoing Indians citizenship in swaths cuz nobody capable enough to escape wants to live in this country ! And they know this country has fallen to the hounds in the hands of Criminals Elites a.k.a Bra-man Hindu supremacists ! There are examples everywhere as democracies gets hijacked and when elites lose control they just fkin escape... what happened in Lanka and remember who came to the rescue of that corrupt President, it was India. Basically one govt of criminals protecting another ! \n\nThe only thing that needs to be done is oppose EVM, if you wants to stop the hijack of democracy cuz once the laws that promote democracy are gone there won't be any democracy left to protect.",
        "THe number of people that want to join bullywood which was considered an outcast tells a lot",
        "Wait, so people really put that they worked for the BJP IT Cell in their resume?"
    ],
    "cleaned_text": "steps taken indian govt unemployment cmie unemployment data tv news discussion unemployment rate almost doubled years people left unemployed increases crime eventually become target terrorist forces severe issue also ticking time bomb yet media coverage qs asked elected representatives thoughts satisfied elected representatives reference unemployment rate india current rate historical trends forbes indiahttpswwwforbesindiacomarticleexplainersunemploymentrateinindia ",
    "cleaned_title": "steps taken indian govt unemployment",
    "cleaned_selftext": "cmie unemployment data tv news discussion unemployment rate almost doubled years people left unemployed increases crime eventually become target terrorist forces severe issue also ticking time bomb yet media coverage qs asked elected representatives thoughts satisfied elected representatives reference unemployment rate india current rate historical trends forbes indiahttpswwwforbesindiacomarticleexplainersunemploymentrateinindia",
    "cleaned_comments": "india way past critical thinking questioning point majority people russia question putin signing another term even catestrophy catastrophe catastrophe awareness lost question exactly anyone else coming meant sense think people country get know problems advanced stage dont know problems brainwashed giving kg free rations crore indians eternal complainers want visionary government different matter free distribution last till next general elections still else going fight religious war enemies hinduism arent unemployed misguided youths youths made believe called hinduism danger agniveers fighting alongside icing cake established cell instead screaming hour working weeks would productive provide gainful employment people reasonable working hours thousands students graduating every yearor simplistic sure comment n murthy probably top leaderships difficult find top talent india settled abroad already case meant juniors might wrong kind think way companies like infosyshis company start hiring junior engineers solve problem total amount work done india year well employment issues say world class training research centers difficult pick people train get work done need work hours lack cash bank resource q prod media job better replacement done bring discussions forefront understand dont need majority q need people cross critical mass even others join modi govt repealed farm laws majority farmers protesting arent brainwashed protests govt powerful actions media able question govt opposition able play devils advocate well big failures electoral govt systems need people people activists prison could way influence mass country proved election election values ethics elections elections also dont alternative bjp modi govt repealed farm laws majority farmers protesting yes farmers mostly punjab haryana protesters came delhi mass choked city protesters dont represent indian farmers numbers lot support farmers almost states india verbal nonverbal lot support farmers almost states india verbal nonverbal doesnt seem lot spoken come family whose roots village still talked elders totally unaware laws passed ruckus prodded said would like companies buy opens doors exploited think unless place safeguards difficult enough companies exploit farmers bottom food chain easiest exploit due owningtrying sell perishable goods exploited thats im mad media opposition points would even argue laws fair ruling party claimed support news media could broken law bit bit answered opposition calling debates navika etc attempt educate public bring ias officers let break public proper justification even ask critics like raghuram rajan abhijeet b chime q would care long sleeping beds money applies politicians country buying assets foreign countries loot idiotic indian population one day shit hits fan country idiots first escape hellhole busy digging deeper ever wonder indians make biggest share immigrants indians forgoing indians citizenship swaths cuz nobody capable enough escape wants live country know country fallen hounds hands criminals elites aka braman hindu supremacists examples everywhere democracies gets hijacked elites lose control fkin escape happened lanka remember came rescue corrupt president india basically one govt criminals protecting another thing needs done oppose evm wants stop hijack democracy cuz laws promote democracy gone wont democracy left protect number people want join bullywood considered outcast tells lot wait people really put worked bjp cell resume",
    "light_cleaned_title": "What are the steps taken by Indian Govt for unemployment?",
    "light_cleaned_selftext": "Why is CMIE unemployment data not on any TV news discussion? Unemployment rate has almost doubled in a few years. With more an more people left unemployed increases the crime eventually and these will then become the target of terrorist forces. This is a severe issue and also a ticking time bomb and yet no media coverage? No Qs being asked of our elected representatives? What are your thoughts? Are you satisfied with what our elected representatives are doing about it? Reference: [Unemployment Rate In India (2008 To 2023): Current Rate, Historical Trends And More - Forbes India](https://www.forbesindia.com/article/explainers/unemployment-rate-in-india/87441/1)",
    "light_cleaned_comments": "India is way past the critical thinking and questioning point. Do the majority of people in Russia question why Putin is signing up for another term even after this catestrophy? What catastrophe? >What catastrophe? When awareness is lost, how do you question? Exactly. Anyone else coming here. I meant in the sense that you think people in the country get to know the problems there? They Are at an advanced stage than at what we are. They don't know about the problems. Just brainwashed. Giving 5KG of free rations to 80 crore indians. What more are you eternal complainers want such a visionary government to do. Its a different matter that free distribution will last till next general elections but still!!! How else are they going to fight the religious war with the enemies of Hinduism if there aren't unemployed misguided youths, the very youths who are now being made to believe that the so called \"Hinduism\" is in danger ?? Agniveers fighting alongside will be the icing on the cake ! 1. Established IT Cell Instead of screaming for 70 hour working weeks, would it not be more productive to provide gainful employment to more people with more reasonable working hours? We have thousands of students graduating every year…or am I being too simplistic? Not very sure, that comment by N Murthy was probably for the top leaderships because it is difficult to find such top talent in India as most of them are settled abroad already. In case he meant it for juniors then (I might be wrong but) I kind of think the same way that companies like Infosys(his company) can start hiring more junior engineers and it will solve the problem of total amount of work being done by India in a year as well as employment issues. They say they have world class training and research centers, then why is it so difficult to pick up people and train them to get their work done why do they need more work hours? Do they lack cash in bank or any other resource? But then the Q is how can we prod the media to do its job better or what is its replacement? What can be done to bring such discussions to the forefront? I understand but we don't need a majority to Q. We just need a few people to do that just so that we cross the critical mass and then even others will join. When Modi govt repealed the farm laws was it the majority of farmers that were protesting? All aren't brainwashed. There were protests but then the Govt is too powerful with their actions. But media not being able to question the govt and opposition not being able to play the devil's advocate well are big failures of electoral govt systems >We just need a few people to do that Those few people (activists) are in prison now, and they could by no way influence the mass. The country has proved again and again, election after election, that it has no values or ethics in elections after elections. They also dont have an alternative to BJP. > When Modi govt repealed the farm laws was it the majority of farmers that were protesting? Yes, it was farmers, mostly from Punjab/ Haryana. The protesters came to Delhi in mass and choked the city. The protesters dont represent 50% of Indian farmers in numbers, but they had a lot of support from farmers from almost all the states in India, verbal and nonverbal. >had a lot of support from farmers from almost all the states in India, verbal and nonverbal Doesn't seem so from the lot I have spoken to. I come from a family whose roots are in the village still and when I talked to the elders they were totally unaware as to what are the laws that will be passed and why such ruckus. When I prodded more they said they would like to have companies buy from them but not if it opens doors for being exploited. I think unless you place safeguards difficult enough for the companies to exploit the farmers who are at the bottom of the food chain and easiest to exploit due to owning/trying to sell perishable goods, they will be exploited. That's where I'm mad at the media and opposition that they did not being out these points. I would even argue that if the laws were as fair as ruling party claimed then they have the support of the news media, they could have broken the law bit by bit and answered all opposition calling them into debates with Navika, etc in an attempt to educate the public, bring IAS officers and let them break it to the public with proper justification and even ask critics (like Raghuram Rajan, Abhijeet B) to chime in with Q. Why would they care as long as they are sleeping in beds of money ! Same applies to the politicians of this country, they are buying assets in foreign countries while they loot the idiotic indian population ! And when one day shit hits the fan in this country of idiots they will be the first to escape from this hell-hole which as of now they are busy digging deeper. Ever wonder why Indians make the biggest share of immigrants and indians forgoing Indians citizenship in swaths cuz nobody capable enough to escape wants to live in this country ! And they know this country has fallen to the hounds in the hands of Criminals Elites a.k.a Bra-man Hindu supremacists ! There are examples everywhere as democracies gets hijacked and when elites lose control they just fkin escape... what happened in Lanka and remember who came to the rescue of that corrupt President, it was India. Basically one govt of criminals protecting another ! The only thing that needs to be done is oppose EVM, if you wants to stop the hijack of democracy cuz once the laws that promote democracy are gone there won't be any democracy left to protect. THe number of people that want to join bullywood which was considered an outcast tells a lot Wait, so people really put that they worked for the BJP IT Cell in their resume?"
}