{
    "id": "1dhzwaj",
    "title": "Recently wrongful reporting of 2 incidents in Himachal Pradesh by Punjab media were brought to rest by this official HP Police report. ",
    "url": "https://www.reddit.com/gallery/1dhzwaj",
    "selftext": "*Source* https://x.com/himachalpolice/status/1802662229927686371?t=5a1L-O2Kz9pc6qonTO4vfw&s=19\n\n\nOne involved a Chandigarh ASI obstructing traffic with his car, and the other had two brothers forcibly holding local women's hands under the pretext of palmistry.\n\nIn both case, physical altercation led to wrongful reporting by some Punjab based news outlets with intentions to malign Himachal. ",
    "flair": "Crime",
    "score": 6,
    "num_comments": 0,
    "created_utc": 1718635700.0,
    "convurl": "https://i.redd.it/8t8oeataa57d1.jpg",
    "comments": [],
    "cleaned_text": "recently wrongful reporting incidents himachal pradesh punjab media brought rest official hp police report source one involved chandigarh asi obstructing traffic car two brothers forcibly holding local womens hands pretext palmistry case physical altercation led wrongful reporting punjab based news outlets intentions malign himachal ",
    "cleaned_title": "recently wrongful reporting incidents himachal pradesh punjab media brought rest official hp police report",
    "cleaned_selftext": "source one involved chandigarh asi obstructing traffic car two brothers forcibly holding local womens hands pretext palmistry case physical altercation led wrongful reporting punjab based news outlets intentions malign himachal",
    "cleaned_comments": "",
    "light_cleaned_title": "Recently wrongful reporting of 2 incidents in Himachal Pradesh by Punjab media were brought to rest by this official HP Police report.",
    "light_cleaned_selftext": "*Source* One involved a Chandigarh ASI obstructing traffic with his car, and the other had two brothers forcibly holding local women's hands under the pretext of palmistry. In both case, physical altercation led to wrongful reporting by some Punjab based news outlets with intentions to malign Himachal.",
    "light_cleaned_comments": ""
}