{
    "id": "16bnh6o",
    "title": "India has already decided that all Khalastanis deserve to die, it's alright, Understandable opinion BUT WHY CREATE FALSE REASONS.... ISN'T BEING KHALASTANI REASON ENOUGH???",
    "url": "https://www.reddit.com/r/india/comments/16bnh6o/india_has_already_decided_that_all_khalastanis/",
    "selftext": "https://www.google.com/amp/s/www.hindustantimes.com/india-news/waris-punjab-de-chief-s-brother-in-law-named-primary-accused-in-attack-on-indian-high-commission-in-canada-101687549686353-amp.html\n\n^ why does India print false news like Grenade Attack on Ottawa Indian High Consulate. \n\nOr San Francisco, Indian High Consulate arson. False news. \n\nOr Sydney Targeted attacks on Hindus. False news. \n\nOr Mandir Vandalizations in Brampton, Mississauga, Sydney etc.  or which it's highly likely that Indians themselves were behind it. Haryana guy caught in CCTV once, Gujaratis caught with Spraycans once in Sydney. \n\n\n\nWhy stupid & false statements like paxtan connection, yeh connection voh connection..... When being Khalastani is enough to justify killing why DO YOU PEOPLE TELL LIES?????? \n\n\nI'm not justifying anything, I know India belongs to Hindus.... And all others deserve to die. It's established. \n\nBut why justify it with lies when you know that you're right.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694014720.0,
    "convurl": "https://external-preview.redd.it/aet-mgd8ruhehciF3E4fqqD0wYQyGwUy7OVnBnrxLE4.jpg?auto=webp&s=458f9775f3b913499df0e777f6e0fb59f33a0cac",
    "comments": [
        "This shows that hopefully there isn't blind hatred yet and it has to be manufactured."
    ],
    "cleaned_text": "india already decided khalastanis deserve die alright understandable opinion create false reasons isnt khalastani reason enough india print false news like grenade attack ottawa indian high consulate san francisco indian high consulate arson false news sydney targeted attacks hindus false news mandir vandalizations brampton mississauga sydney etc highly likely indians behind haryana guy caught cctv gujaratis caught spraycans sydney stupid false statements like paxtan connection yeh connection voh connection khalastani enough justify killing people tell lies im justifying anything know india belongs hindus others deserve die established justify lies know youre right ",
    "cleaned_title": "india already decided khalastanis deserve die alright understandable opinion create false reasons isnt khalastani reason enough",
    "cleaned_selftext": "india print false news like grenade attack ottawa indian high consulate san francisco indian high consulate arson false news sydney targeted attacks hindus false news mandir vandalizations brampton mississauga sydney etc highly likely indians behind haryana guy caught cctv gujaratis caught spraycans sydney stupid false statements like paxtan connection yeh connection voh connection khalastani enough justify killing people tell lies im justifying anything know india belongs hindus others deserve die established justify lies know youre right",
    "cleaned_comments": "shows hopefully isnt blind hatred yet manufactured",
    "light_cleaned_title": "India has already decided that all Khalastanis deserve to die, it's alright, Understandable opinion BUT WHY CREATE FALSE REASONS.... ISN'T BEING KHALASTANI REASON ENOUGH???",
    "light_cleaned_selftext": "^ why does India print false news like Grenade Attack on Ottawa Indian High Consulate. Or San Francisco, Indian High Consulate arson. False news. Or Sydney Targeted attacks on Hindus. False news. Or Mandir Vandalizations in Brampton, Mississauga, Sydney etc. or which it's highly likely that Indians themselves were behind it. Haryana guy caught in CCTV once, Gujaratis caught with Spraycans once in Sydney. Why stupid & false statements like paxtan connection, yeh connection voh connection..... When being Khalastani is enough to justify killing why DO YOU PEOPLE TELL LIES?????? I'm not justifying anything, I know India belongs to Hindus.... And all others deserve to die. It's established. But why justify it with lies when you know that you're right.",
    "light_cleaned_comments": "This shows that hopefully there isn't blind hatred yet and it has to be manufactured."
}