{
    "id": "1acg565",
    "title": "Niti Aayog’s claim of a steep fall in poverty doesn’t pass the smell test",
    "url": "https://www.reddit.com/gallery/1acg565",
    "selftext": "A change in the methodology of calculating poverty by using the global multidimensional poverty index methodology’s indicators and adding two more to it call into question the accuracy of these claims\n\nThe ultimate test of poverty reduction is not freebies provided by the state but the ability of people to earn enough income that enables them to consume bare necessities\n\nLATHA VENKATESH JANUARY 23, 2024 / 04:24 PM IST\n\nhttps://www.moneycontrol.com/news/opinion/niti-aayogs-claim-of-a-steep-fall-in-poverty-doesnt-pass-the-smell-test-12106021.html",
    "flair": "Policy/Economy",
    "score": 85,
    "num_comments": 24,
    "created_utc": 1706376884.0,
    "convurl": "https://i.redd.it/l30x3ffjq0fc1.png",
    "comments": [
        "Source:\n\nhttps://www.moneycontrol.com/news/opinion/niti-aayogs-claim-of-a-steep-fall-in-poverty-doesnt-pass-the-smell-test-12106021.html",
        "Premium article is behind paywall so check out the images for full text.",
        "That's how it has been since 2016.\n\nThey can twerk data and change the assessment factors, but they can not change the reality. Eventually, it will bite them.",
        "All this to make themselves feel better.\n\nI mean the poor are still poor. They know they are poor and fudging data has not changed their living standard.",
        "The biggest problem is upper middle class crowd who are doing well for themselves, so they believe the rest of the country too is doing it. But reality is different, and we all know that. Plus, they are a highly misinformed group. They don't even make an effort to read the Wikipedia page. Whatever comes their way they believe as long as it supports them.",
        "https://preview.redd.it/qddq5sm1g1fc1.jpeg?width=1170&format=pjpg&auto=webp&s=a6bb1bae4f11a93d28313aebcfb6995d070a126e\n\nHDI has also flattened since 2014, but supposedly all the ✨REAL✨ development happened after 2014. 🤡",
        "Folks TCS starting package in 2012 was 3.5 lacs … its still 3.5 in 2024. I guess the poverty thresholds haven’t changed much.",
        "Change the method of evaluation if you cannot do a better job. This has been the go to strategy for BJP to inflate all performance indicators.\n\nSadly, bhakts don't have the cranial capacity to dig deep and talk about methodology etc. They get what they need to scream in WhatsApp groups and run their mouths with big claims of numbers which are nowhere near reality.\n\nWait till you learn about how they tweaked road length measure methodology to inflate the lengths of total roads built by BJP.\n\nhttps://www.hindustantimes.com/india-news/now-new-concept-to-measure-length-of-highways-from-april-1/story-Q44qGgFzl4DsAPv5OIG0YI.html",
        "All I can say to this is\n\nhttps://www.reddit.com/r/india/comments/19dcthb/what_is_indias_mandir_per_capita_mpc_and_mandir/",
        "Nah. It won't bite them. Its only biting the people.",
        "They thrive on misinformation. They will only invest in things that help them get more votes.\n\nKeeping people poor and dependent on freebies has been convenient enough.",
        "True and they are people you will see on social media. Lower classes are too busy just surviving until the next election comes and they get more freebies.",
        "Holy f*ck. That's a really good analysis.",
        "So that's how the highway construction rate got ott.",
        "Yeah. what you are mentioning is a very big economic problem known as the middle income trap.\n\nCould be very hard to get out of it if strict measures are not taken right now.",
        "Yup, they basically count each lane different. So if a 4 lane road is constructed for 1k.m, earlier it was counted as 1k.m, now it's 4 k.m.",
        "That's insane. For statisticians that's just blasphemous. A complete mockery of the field.",
        "Since you talked about statisticians, just a reminder that the last census was done in 2011...so any claim about any socio-economic-demographic shift is all hog wash.",
        "> All this to make themselves feel better.\n\nThis is to gaslight the people.    \n\nAre 50% of the people earning atleast 1/4 th of the EWS limit?",
        "Not even close.\n\nThe question is which 50% if you are including billionaires and middle class that won't be fair because the majority is lower class. \n\n50% of poorest in India are earning less than 2 percent of the EWS limit",
        "Gujarat Model of manipulating data now applied to the whole country. Can't explain it to your WhatsApp uncle groups.",
        ">Can't explain it to your WhatsApp uncle groups.\n\nTrue 😂. They are too far gone.",
        "Thats why I am using EWS as a standard, that the govt created for Economically Weak Section, to refer to \"poverty line as 1/4 of EWS\"."
    ],
    "cleaned_text": "niti aayogs claim steep fall poverty doesnt pass smell test change methodology calculating poverty using global multidimensional poverty index methodologys indicators adding two call question accuracy claims ultimate test poverty reduction freebies provided state ability people earn enough income enables consume bare necessities latha venkatesh january pm ist ",
    "cleaned_title": "niti aayogs claim steep fall poverty doesnt pass smell test",
    "cleaned_selftext": "change methodology calculating poverty using global multidimensional poverty index methodologys indicators adding two call question accuracy claims ultimate test poverty reduction freebies provided state ability people earn enough income enables consume bare necessities latha venkatesh january pm ist",
    "cleaned_comments": "source premium article behind paywall check images full text thats since twerk data change assessment factors change reality eventually bite make feel better mean poor still poor know poor fudging data changed living standard biggest problem upper middle class crowd well believe rest country reality different know plus highly misinformed group dont even make effort read wikipedia page whatever comes way believe long supports hdi also flattened since supposedly real development happened folks tcs starting package lacs still guess poverty thresholds havent changed much change method evaluation better job go strategy bjp inflate performance indicators sadly bhakts dont cranial capacity dig deep talk methodology etc get need scream whatsapp groups run mouths big claims numbers nowhere near reality wait till learn tweaked road length measure methodology inflate lengths total roads built bjp say nah wont bite biting people thrive misinformation invest things help get votes keeping people poor dependent freebies convenient enough true people see social media lower classes busy surviving next election comes get freebies holy fck thats really good analysis thats highway construction rate got ott yeah mentioning big economic problem known middle income trap could hard get strict measures taken right yup basically count lane different lane road constructed km earlier counted km km thats insane statisticians thats blasphemous complete mockery field since talked statisticians reminder last census done claim socioeconomicdemographic shift hog wash make feel better gaslight people people earning atleast th ews limit even close question including billionaires middle class wont fair majority lower class poorest india earning less percent ews limit gujarat model manipulating data applied whole country cant explain whatsapp uncle groups cant explain whatsapp uncle groups true far gone thats using ews standard govt created economically weak section refer poverty line ews",
    "light_cleaned_title": "Niti Aayog’s claim of a steep fall in poverty doesn’t pass the smell test",
    "light_cleaned_selftext": "A change in the methodology of calculating poverty by using the global multidimensional poverty index methodology’s indicators and adding two more to it call into question the accuracy of these claims The ultimate test of poverty reduction is not freebies provided by the state but the ability of people to earn enough income that enables them to consume bare necessities LATHA VENKATESH JANUARY 23, 2024 / 04:24 PM IST",
    "light_cleaned_comments": "Source: Premium article is behind paywall so check out the images for full text. That's how it has been since 2016. They can twerk data and change the assessment factors, but they can not change the reality. Eventually, it will bite them. All this to make themselves feel better. I mean the poor are still poor. They know they are poor and fudging data has not changed their living standard. The biggest problem is upper middle class crowd who are doing well for themselves, so they believe the rest of the country too is doing it. But reality is different, and we all know that. Plus, they are a highly misinformed group. They don't even make an effort to read the Wikipedia page. Whatever comes their way they believe as long as it supports them. HDI has also flattened since 2014, but supposedly all the ✨REAL✨ development happened after 2014. 🤡 Folks TCS starting package in 2012 was 3.5 lacs … its still 3.5 in 2024. I guess the poverty thresholds haven’t changed much. Change the method of evaluation if you cannot do a better job. This has been the go to strategy for BJP to inflate all performance indicators. Sadly, bhakts don't have the cranial capacity to dig deep and talk about methodology etc. They get what they need to scream in WhatsApp groups and run their mouths with big claims of numbers which are nowhere near reality. Wait till you learn about how they tweaked road length measure methodology to inflate the lengths of total roads built by BJP. All I can say to this is Nah. It won't bite them. Its only biting the people. They thrive on misinformation. They will only invest in things that help them get more votes. Keeping people poor and dependent on freebies has been convenient enough. True and they are people you will see on social media. Lower classes are too busy just surviving until the next election comes and they get more freebies. Holy f*ck. That's a really good analysis. So that's how the highway construction rate got ott. Yeah. what you are mentioning is a very big economic problem known as the middle income trap. Could be very hard to get out of it if strict measures are not taken right now. Yup, they basically count each lane different. So if a 4 lane road is constructed for 1k.m, earlier it was counted as 1k.m, now it's 4 k.m. That's insane. For statisticians that's just blasphemous. A complete mockery of the field. Since you talked about statisticians, just a reminder that the last census was done in 2011...so any claim about any socio-economic-demographic shift is all hog wash. > All this to make themselves feel better. This is to gaslight the people. Are 50% of the people earning atleast 1/4 th of the EWS limit? Not even close. The question is which 50% if you are including billionaires and middle class that won't be fair because the majority is lower class. 50% of poorest in India are earning less than 2 percent of the EWS limit Gujarat Model of manipulating data now applied to the whole country. Can't explain it to your WhatsApp uncle groups. >Can't explain it to your WhatsApp uncle groups. True 😂. They are too far gone. Thats why I am using EWS as a standard, that the govt created for Economically Weak Section, to refer to \"poverty line as 1/4 of EWS\"."
}