{
    "id": "14fww17",
    "title": "Guys please help me get rid of these!",
    "url": "https://www.reddit.com/gallery/14fww17",
    "selftext": "What is this thing called and how do i get rid of it from my workplace washroom? A couple of days ago, there were only 4. I used a piece of paper, got this pede on it and threw it out. The next day, i donno HOWWW there were suddenly more than 10. Yesterday there were 18 of these. It's starting to scare me now. Please help me with getting rid of them. Any help welcome. TIA!",
    "flair": "AskIndia",
    "score": 7,
    "num_comments": 27,
    "created_utc": 1687419855.0,
    "convurl": "https://i.redd.it/9uowoyjkxi7b1.jpg",
    "comments": [
        "Why do you wanna get rid of them? They are so cute :-)",
        "Pls come and take them to your place bro. 🤒",
        "Pest control?",
        "Will/does pest control work on these weird caterpillars?",
        "i think they are centipedes. we just use a broom to chuck them out of the house :/",
        "Most likely, how clean is your washroom? Is it well-sanitized, and does it have an exhaust fan? These creatures are attracted to moist environments. Aur agar bahar garmi ho toh they make their way in. Also, check for potential entry points. Seal using white cement. Consider using a HIT spray to target where they reside, you might discover a few more.\n\nIf none of these work, call pest control.",
        "Saar, 18 of those. And it's scary af. How to avoid more of these, is actually an important question.",
        "THIS! This sounds helpful. Will do so. Thanks a lot.",
        "Davai aati h pesticide spray",
        "bro they are pretty common in monsoon, as soon as monsoon starts they come out of hibernation.\n\nYou dont have to worry about them, they are not harmful, they do not bite, they do not attack.\n\n(You can trust me on this one coz I come from a place (tribal area in MH) where I have seen them in 100s and 1000s of hoards)\n\nEdit: If you try to throw them they will enclose themselves in ring form just like mimosa plant (touch me not plant)",
        "Put them near your ears you will not see them again",
        "It's time to clean your drain pipes. There's no way if the \"Nahni Traps\" are in the proper condition they can come out of it.",
        "These are called centipede and eat other insects I e cockroach etc",
        "Bhnchod😂",
        "Dude, you throw it??? Got a hell of courage to do this",
        "the 2nd pic is crazy , that things needs to be in F1",
        "Bro they are centipedes be aware of them they bite they can be even little bit poisonous their bite can cause pain keep them away from your ears they can go inside, best way is throw them out or kill them all and then do some paste control so that more of them don't come in",
        "What you're talking about is a millipede. This looks like a centipede and they're very venomous.",
        "Call your Chinese friend 💅",
        "nope, its not centipede or millipede.\n\ncentipede and millipede are reddish brown in colour and much longer than this with many more pair of legs and larger in size.\n\nAnd trust me I have seen many centipedes, millipedes, above worm, and many other type of worms, insects and have Eaten a few as well. Got bitten by many of them have taken Ayurvedic jadi buti for the same that too multiple times.\n\nOne weird worm/insect I come across is the one \"whenever you cut a lobe that worm that worm used to produce spark/fire from that disjointed lobe, this was pretty scary a first\".\n\n(I have spent first 16 yrs of my life in roaming around forests bro)\n\nI hope you read that fully. I can tell you many more amazing wonders of Indian jungles that I have seen or experienced myself.\n\nThank you.",
        "Maybe start a Chinese restaurant.",
        "Hanz.... Get die flammenwerfer !",
        "Bhai jaha dikhe uspe pesaab kar do",
        "Unko khale show ur dominance brother 💪💪",
        "you should start some village/forest tourism",
        "will give it a thought. Thanks."
    ],
    "cleaned_text": "guys please help get rid thing called get rid workplace washroom couple days ago used piece paper got pede threw next day donno howww suddenly yesterday starting scare please help getting rid help welcome tia ",
    "cleaned_title": "guys please help get rid",
    "cleaned_selftext": "thing called get rid workplace washroom couple days ago used piece paper got pede threw next day donno howww suddenly yesterday starting scare please help getting rid help welcome tia",
    "cleaned_comments": "wan na get rid cute pls come take place bro pest control willdoes pest control work weird caterpillars think centipedes use broom chuck house likely clean washroom wellsanitized exhaust fan creatures attracted moist environments aur agar bahar garmi ho toh make way also check potential entry points seal using white cement consider using hit spray target reside might discover none work call pest control saar scary af avoid actually important question sounds helpful thanks lot davai aati h pesticide spray bro pretty common monsoon soon monsoon starts come hibernation dont worry harmful bite attack trust one coz come place tribal area mh seen hoards edit try throw enclose ring form like mimosa plant touch plant put near ears see time clean drain pipes theres way nahni traps proper condition come called centipede eat insects e cockroach etc bhnchod dude throw got hell courage nd pic crazy things needs f bro centipedes aware bite even little bit poisonous bite cause pain keep away ears go inside best way throw kill paste control dont come youre talking millipede looks like centipede theyre venomous call chinese friend nope centipede millipede centipede millipede reddish brown colour much longer many pair legs larger size trust seen many centipedes millipedes worm many type worms insects eaten well got bitten many taken ayurvedic jadi buti multiple times one weird worminsect come across one whenever cut lobe worm worm used produce sparkfire disjointed lobe pretty scary first spent first yrs life roaming around forests bro hope read fully tell many amazing wonders indian jungles seen experienced thank maybe start chinese restaurant hanz get die flammenwerfer bhai jaha dikhe uspe pesaab kar unko khale show ur dominance brother start villageforest tourism give thought thanks",
    "light_cleaned_title": "Guys please help me get rid of these!",
    "light_cleaned_selftext": "What is this thing called and how do i get rid of it from my workplace washroom? A couple of days ago, there were only 4. I used a piece of paper, got this pede on it and threw it out. The next day, i donno HOWWW there were suddenly more than 10. Yesterday there were 18 of these. It's starting to scare me now. Please help me with getting rid of them. Any help welcome. TIA!",
    "light_cleaned_comments": "Why do you wanna get rid of them? They are so cute :-) Pls come and take them to your place bro. 🤒 Pest control? Will/does pest control work on these weird caterpillars? i think they are centipedes. we just use a broom to chuck them out of the house :/ Most likely, how clean is your washroom? Is it well-sanitized, and does it have an exhaust fan? These creatures are attracted to moist environments. Aur agar bahar garmi ho toh they make their way in. Also, check for potential entry points. Seal using white cement. Consider using a HIT spray to target where they reside, you might discover a few more. If none of these work, call pest control. Saar, 18 of those. And it's scary af. How to avoid more of these, is actually an important question. THIS! This sounds helpful. Will do so. Thanks a lot. Davai aati h pesticide spray bro they are pretty common in monsoon, as soon as monsoon starts they come out of hibernation. You dont have to worry about them, they are not harmful, they do not bite, they do not attack. (You can trust me on this one coz I come from a place (tribal area in MH) where I have seen them in 100s and 1000s of hoards) Edit: If you try to throw them they will enclose themselves in ring form just like mimosa plant (touch me not plant) Put them near your ears you will not see them again It's time to clean your drain pipes. There's no way if the \"Nahni Traps\" are in the proper condition they can come out of it. These are called centipede and eat other insects I e cockroach etc Bhnchod😂 Dude, you throw it??? Got a hell of courage to do this the 2nd pic is crazy , that things needs to be in F1 Bro they are centipedes be aware of them they bite they can be even little bit poisonous their bite can cause pain keep them away from your ears they can go inside, best way is throw them out or kill them all and then do some paste control so that more of them don't come in What you're talking about is a millipede. This looks like a centipede and they're very venomous. Call your Chinese friend 💅 nope, its not centipede or millipede. centipede and millipede are reddish brown in colour and much longer than this with many more pair of legs and larger in size. And trust me I have seen many centipedes, millipedes, above worm, and many other type of worms, insects and have Eaten a few as well. Got bitten by many of them have taken Ayurvedic jadi buti for the same that too multiple times. One weird worm/insect I come across is the one \"whenever you cut a lobe that worm that worm used to produce spark/fire from that disjointed lobe, this was pretty scary a first\". (I have spent first 16 yrs of my life in roaming around forests bro) I hope you read that fully. I can tell you many more amazing wonders of Indian jungles that I have seen or experienced myself. Thank you. Maybe start a Chinese restaurant. Hanz.... Get die flammenwerfer ! Bhai jaha dikhe uspe pesaab kar do Unko khale show ur dominance brother 💪💪 you should start some village/forest tourism will give it a thought. Thanks."
}