{
    "id": "1aiq8i9",
    "title": "Facing Mental Trauma and Abuse by Amazon India Delivery Agents",
    "url": "https://www.reddit.com/r/india/comments/1aiq8i9/facing_mental_trauma_and_abuse_by_amazon_india/",
    "selftext": "For the past 10 days I have been working remotely from my ancestral village of Nattrasankottai which is about 10 km from Sivagangai, Tamil Nadu which is the nearest town.   \n \n\nSo I was thinking of setting up a remote working setup here as I had already secured a working broadband connection and decided to order table and chair from Amazon and that was a very big mistake I made, and I wanted to share that story over here.   \n \n\nSo on January 26, I placed an order for a Nilkamal Foldable Plastic Table along with 2 Cello Chairs and additionally a Gas lighter for Kitchen Use. The Chairs were delivered on January 30 without and this delivery was done by another warehouse agency that's connected to Amazon I believe, and their delivery process was very smooth and professional and I faced no issue with that delivery. \n\nThe issue happened with the table as that was to be delivered by another warehouse agency it seems and they were the ones to deliver the Gas lighter as well. So when the gas lighter was delivered on January-29 the delivery agent Adhi said the package will take a few days to deliver as they would have to bring it on a Min Truck as its a bigger package in Size. \n\nBut what these delivery people did is on January-29 they marked it as no one was there to pick up the parcel and returned the item back to Seller. At that point I immediately reached out to Amazon and mentioned that I was there at the address whole time and that the delivery agency basically doesn’t want to do the delivery and that’s why they have marked in such way and returned the package.\n\nAmazon support person Mr.Shubham on 29th January assured me that this would not be repeated and he asked me to order the table again and with that assurance I ordered the same Nilkamal Table again.\n\nI was hoping that the package would be delivered without any issue this time and this is where something completely unexpected happened. The delivery person Adhi came on the 3rd February morning and mentioned that they cannot do delivery as it’s a big package and that I have to go and pick up the parcel from their location, which is about 10-11km from my location.\n\nWhen I got the phone number of his supervisor Sivasankar and questioned him about why they are refusing to do door step delivery Sivasankar started using terms like (in Tamil) “If you want the package come and pick it up…if not don’t order from Amazon…As you wish go and make a complaint Amazon app, I don’t care if you make a complaint” and then he went on to abuse me on the call.\n\nAbout 30 minutes ago another person named Venkadesan who works along with Sivasankar called me from the same number and mentioned same thing like if you wish to raise a complain go and do it in the app and so on and started abusing me in Tamil using words like Dog. (I have the audio recording of this conversation, but not sharing it here).\n\nThis abuse put me in mental trauma and also I was worried about my physical safety as the delivery agent has my phone number as well the address, so I immediately reached out to Amazon Call Support and also put out a tweet thread mentioning that I am worried about my physical safety (https://twitter.com/PriyadharshanK/status/1753699465712505019). The Call Support was once again standard reply saying they are sorry and that they will look into the matter and they told there will be a guaranteed delivery before the of the day (03-February-2024).\n\nThe twitter support response for my tweet was if you feel concerned about physical safety, make a complaint at the nearest police station (Tweet attached). The nearest police station is about 10km from my location, and I decided not to go to the police station but just stay safe at my home.\n\nhttps://preview.redd.it/noag8m1o5lgc1.png?width=807&format=png&auto=webp&s=6ddf1a4013144901bcb5690a52004b3d312bfbb7\n\nAbout 5PM yesterday Venkadesan from the delivery agency called me and mentioned that they cannot do delivery today as it would cost them cost extra petrol charges to deliver a single package, so they won’t deliver the package and that only the next day at 11AM they will deliver the package. Once he mentioned this, they once again marked it on the Amazon tracker as Delivery attempted but no one was there to pick up the package, so they will reattempt it tomorrow.\n\nI once again called Amazon Call Support and mentioned that even though you guaranteed me a delivery by the end of the day (3rd Feb) I haven’t got my package and for that they escalated the call to their higher up person Mr.Sriram who after listening to all the events, mentioned he will escalate the call to his higher up, but after a few minutes of holding he got back to me and mentioned his higher up won’t attend customer calls and that he has taken note of this poor delivery behavior and has taken a complaint against the delivery person and the agency.\n\nToday(Feb-4) around 3PM Venkadesan and Adhi of the delivery agency came on a scooter carrying the package and the package and when I looked at the outside packaging it seemed to have been damaged about 40% so I asked them if this is how the package was and he said yes, so I decided to share the OTP and collect the package under the assumption the package inside would be intact.\n\nWhen I opened the package I could clearly see someone having opened the package and have caused damage to the package as plastic chips of the table were broken off and was falling away. I have a very strong guess that the delivery agents opened the package and caused damage to the table and put it back.\n\nhttps://preview.redd.it/reaj38vf5lgc1.jpg?width=1160&format=pjpg&auto=webp&s=f0fd5cf547abe3597f30ec7eae854eb5c7e0a387\n\nhttps://preview.redd.it/lrmh3cvf5lgc1.jpg?width=1160&format=pjpg&auto=webp&s=b306c37ab69ace2db0ea6153b3175b5570919892\n\nhttps://preview.redd.it/f15msdvf5lgc1.jpg?width=512&format=pjpg&auto=webp&s=938b8d703f0eaacfebd283cc6be39489694e939e\n\nhttps://preview.redd.it/y54seavf5lgc1.jpg?width=1160&format=pjpg&auto=webp&s=73624c7cade2ce4c6de7b1720186d3fa1e9a5eed\n\nI recorded the delivery agent dropping the package as well as me opening the package after they left to ensure I have record of the incidents.\n\nhttps://reddit.com/link/1aiq8i9/video/2scwcfdh5lgc1/player\n\nI immediately reached out to Amazon customer support again and after going lot of front and back Mr.Sandip from Customer Support of Furniture team offered if I wanted a refund or a replacement of the package.\n\nI mentioned to Mr.Sandip that if the replacement will be sent back via the same delivery agents the new package might also get the same fate as the previous one, and that it would be pointless for me to even try that option so I requested him to issue a refund. I also mentioned that if possible please send a different pickup person to pick up the return of this parcel, as I do not feel comfortable interacting with the delivery agent who had previously abused me over the phone.  \n\nThis whole incident has left me with a very bad consumer experience with Amazon and having been a Prime Member for more than 10 years (I had Prime Membership when I was in the US, and when I was back in India, I had a Business Prime as well as the Individual Prime account) this incident has put me on a lot of mental trauma as I was with their customer support for close to 1.5 hours yesterday and close to 1 hour today explaining my situation and how that their delivery agents are refusing to deliver services if it is in a rural area.\n\nA few points that I really want to raise based on this incident\n\n1)Do people in Rural areas not deserve the same treatment as people living in the cities? As the delivery agent is asking me to come and pick up the parcel 10 km away\n\n2)If a Prime customer itself is treated so badly and has to keep going through loops of automated support and standard textbook I am sorry we will raise a complaint against the delivery agent, then what would be the situation if you are non Prime member?\n\n3)Is there any redressal mechanism that Amazon has if a delivery agent abuses the customer using unparliamentary and abusive words?\n\n4)Amazon hasn’t offered me any sort of compensation for all the mental trauma that I have gone through, and in general I just feel this is so unjustified as I as a customer order through Amazon with a trust that the product would be delivered in a simple and hassle free manner on my doorstep, but this particular experience has made me spend more than 3 hours talking to customer support in addition to getting abused by their delivery agent.\n\n5)If the delivery agent can mark as he wishes that the customer was not at the address location and can send the parcel back even without attempting to deliver, then it is fundamentally wrong thing as Amazon should have a way to track GPS coordinates of the delivery person to really ensure if they tried to deliver and if the door was locked.   \n6)If an educated person like me has to go through so much, then how can an uneducated person living in rural areas manage to use apps like Amazon if the customer support is so frustrating?  \n\n\nI am currently waiting for the return package to be picked up on 6th February and the refund be issued by Amazon. This whole ordeal has taken so much of my time over the past few days, I felt like that there has to be some action that Amazon should take related to the points that I have raised and there must be redressal mechanism when a customer gets verbally abused by Amazon Delivery Person team.  \nThis whole incident that which I first raised in Twitter was picked up by journalist Jagannathan and was also reported on bunch of news portals - [https://www.cricketnmore.com/sports-news/worried-about-physical-safety-gm-kannappan-approaches-amazon-after-delivery-faux-pas-12885](https://www.cricketnmore.com/sports-news/worried-about-physical-safety-gm-kannappan-approaches-amazon-after-delivery-faux-pas-12885)   \n ",
    "flair": "Rant / Vent",
    "score": 208,
    "num_comments": 46,
    "created_utc": 1707060103.0,
    "convurl": "https://external-preview.redd.it/VtXmiTM2l62eLLN_DQrEIl1avQqkNgL-Fn6zXLNvklQ.jpg?auto=webp&s=44f1fe924f0d49e2eef93c7335bf767837ec0cfd",
    "comments": [
        "Amazon has gotten a lot worse whereas flipkart has improved with open package policy.",
        "Would definitely encourage you to email Amazon first then use that email to raise complaints in the consumer helpline ( INGRAM)\nLastly, CPGRAMS as well",
        "I have called and spoken to their customer support close to 3 hours over the past two days, and it has been overall such a frustrating experience as I had to explain my issue from the start again and again to every agent who connected with me.\n\nEven when I tell the CS person that please talk directly to the delivery agent and give them some sort of warning their response is they don't have the option and all they can do is just take a note as a complaint and will take some internal action in a few business days.  \n  \nEven now I mentioned Amazon that the possibility of the same delivery agent comming to pick up the package as its a rural area (There is only like 1 delivery agent I think for this ZIP code) and I would prefer if someone else can come to pick it up and their response is we will try what we can do, and they mentioned if the situation arises where the same agent comes for refund pickup and for some reason don't pick up the package, then again reach out to us.  \n  \nThe fact that I have to reach out every single time and that Amazon cannot communicate in anyway realtime to delivery agent and mention the issue is so frustrating.",
        "If you have call recording go to costumer court.. they will mostly settle.",
        "Anyone here with any prior experience related to going to consumer court? Is the process very time consuming? Reason I am asking is because Indian judiciary is known to take ages to settle cases, and I don't want to fight some case for years.",
        "The issue is not just about poor delivery, it is about the audacity these delivery agents have when they deliver to rural areas, as they have the belief that people in rural areas won't raise their voice and that they can do as they wish which is what hurts me the most.\n\nDo people in rural areas get these products at a discount or what!? It's the same pricing they pay as someone in a city, and then these delivery agents acting like they are the Masters and when Questioning what they are doing is not right, that they start to abuse you verbally.\n\nThe other issue is that Amazon Support having no realtime answer to solve an issue like this and mentions we will resolve this issue in X Business Days, but by then the delivery agent might show all his anger on your parcel or might show anger on your parcel everytime you order as there is like only 1 delivery agent and agency.\n\nThis is like in old times they say don't piss off the rural postman, as if not you won't get any posts or envelopes. It's like that!",
        "Drop a mail to Jeff bezos, I remember watching his interview where he mentioned he has a team going through customer complaints received on his mail and that is why his email is easily available on the internet.",
        "I believe you should take this lightly. These things happen in life and should try to face the situation without letting it affect your mental health. Don’t stress yourself over this brother. This whole ordeal could have been avoided. Firstly you didn’t had to contact the delivery agents yourself. If the agents had wrongly updated as “customer unavailable” or something, you could have just left a note to Amazon support. Your money was always safe. Secondly you could have rejected the delivery after seeing the state of it.\n\nI would suggest leave it at this for your mental peace as it looks like it has clearly cause you enough stress already. Also don’t worry about those guys returning to pick it you. They are coming to YOUR house, YOUR space.",
        "Raise a complaint here https://consumerhelpline.gov.in process was a lot of back and forth, but I received a resolution in my favour in a month’s time.",
        "Thanks for the advice! I have sent out an email just now sharing the whole incident. Let's see if they take any action!",
        "I took it lightly the 1st time when they marked it as refused to deliver and contacted Amazon Support. When they came back in person for the reorder to mention that the only option for me to get the package is by picking it up in their place, I got really frustrated and when I questioned them then what is the purpose of ordering via Amazon, the delivery supervisor started abusing and as a customer paying for the parcel as well to get abused and that can't be taken lightly.\n\nThe supervisor was having a tone of do whatever you want as he was under the impression that someone ordering from a rural place would be someone illiterate and won't have any way to bring it to public attention and then the abuse by him and his team member was when it really became stressful. \n\nYou are talking about my house, my space, but remember this location is not a city with cameras everywhere or such thing, but it's rural space and as I mentioned the nearest police station is about 10KM away.",
        "Ok, will do that tomorrow! Hopefully there is some resolution :)",
        "Op try posting it on r/legaladviceindia also.",
        "I agree - not worth a battle fighting. Return the package and move on. Leave a bad review for seller and item and buy it from somewhere else !",
        "Should've stayed in the US ngl",
        "Their \"warehouse\" is probably a small godown with 2-3 bikes for delivery. They don't have a fleet of trucks like Fulfilled Warehouses and would probably have to hire one just for your single package. They have no control over the package size or dimensions that they have to deliver, and Amazon doesn't provide vehicles to them unlike to agents in USA where you came from. Sorry to say but you can't move to some remove village and expect services of metro cities. \n\nEven after that when they told they would deliver tomorrow, immediately you went and started complaining to Amazon. You feel so threatened about your physical safety that you keep escalating the issue instead of going to police. Finally some poor guy carried this huge package along with that huge delivery bag on his 2 wheeler, endangering his own safety to bring you your entitled package, and you are still complaining. Wow.",
        "Are they doing so for free, if he's paying the money honestly he deserves the service. Amazon is a billion dollar company,  they can afford the expense. Also how can you justify somebody abusing a customer instead of doing their job?",
        "No, he paid Nilkamal and Amazon. Amazon has conveniently shirked responsibility by dumping the huge package onto this small delivery company. Amazon can afford it, but again OP is not dealing with Amazon, rather he is complaining to Amazon about the small business.\n\nAbusing is wrong of course, and I can't find where I justified it.",
        "If they don't have the ability to deliver then Amazon should not take orders from the ZIP code. My understanding is there 2 delivery teams (Let's say K and S)from the nearby bigger cities which are 10km away from my location on opposite directions. and I have ordered a fridge about an year ago to the same location and it was delivered by the warehouse team K that delivered me the fridge with no issues and also the chairs which is a bigger package as well with 0 issues about a week ago. This warehouse team has delivered me in the most professional way coming on a mini truck.\n\nComing to the warehouse team S is the problem. This team is located in a big city where there is lot of activity and amazon orders, so this team is basically trying to shirk their responsbility as they don't want to send their truck to deliver this package.\n\nAbout your point I can't expect services like a metro, if so Amazon should not offer furniture delivery for that ZIP code. If you understand Tamil see the first video where the delivery person flat out refuses to deliver and because these guys are lazy that's why at first instance they cancelled the package and forced me to reorder again and then the next day once I put pressure to Amazon he came along with his buddy on scooter (I have mentioned two names on my post as well) to give the package. So the package isnt that big that it had to be transported via mini truck it could have been delivered if two people came on a scooter the way they delivered to me eventually.  I am also certain they have a truck as on the phone call that they abused me the delivery person Venkadesan was saying to me if we cancel today we will send it to you on truck next day, and that's when I confronted them saying last time that's not what you did, and you just straight up cancelled the order without sending it on any truck, he had no response. The other point is the guy is running a delivery/courier agency he is expected to have whatever resources to run the agency, he cannot be poorly equipped and put the onus on the customer to come and collect the package? If I have to go and pick up the package and let's assume I don't have a car, I would have to spend close to 500-600 Rupees for the truck+cost and that's the primary reason why we order in Amazon at first place right?? The convenience of door step delivery!\n\n  \nMy Qn comes up why should a rural area not have the same expectation as a city when Amazon promises delivery to this ZIP code? Imagine if I have to go through so much hoops and still not get my product, people in this area how can they ever order anything from here? A person if they order from a rural area technically they are paying more than an urban area if you think of PPP(Purchasing Power Parity). I am talking from a consumer rights perspective as well.\n\n  \nI made this post because the delivery person kept repeating if you wish to complain Amazon go and complain, I don't give a damn as he was thinking he was dealing with someone who would not complain and when I did really complain, they got mad and went on to show their anger on the product.",
        "To add on the delivery agency is not running the show for charity, they are not a NGO but a business who is expected to have the resources for which they are paid.\n\nI also run a business and the fundamentals of the business is to do what you promise to do. If a courier company refuses to deliver a parcel, they are basically not doing their job, straight up that's the point.\n\nIf you Qn their inefficiency and you will get abused in return, then its not inefficiency but the delivery agency feeling entitled that they can do as they wish without regarding for consumer rights.",
        "I can complain only to Amazon, as I made the payment to Amazon and not to some random delivery agency. \n\nThe delivery agency works for Amazon, and I don't work for Amazon or for that delivery agency, expecting me to pay for the package as well and go and collect it from their delivery warehouse.",
        "I don't regret moving back to India!",
        "Technically my time is much more valuable than fighting this battle, as I have lot more important things to do, but I really wanted to bring attention to it that even when you pay for a service and you don't get it in Rural India, then from a broader perspective how Rural India will ever grow?\n\nWhy I am highlighting this is because, I actually run a Pvt Ltd company, and we hire people(remote) from rural/semi rural areas to be part of our customer support team that gives support to US customers and I am strongly inspired by Mr.Sridhar Vembu and ZOHO principle of building and the potential of Rural india.\n\nThat was also the reason why I was trying to work out of my ancestral village and we have rolled out an offer letter to a person this week from a nearby town to be part of our team. I am actually thinking of building a team out of my ancestral village.\n\nFrom a PPP(Purchasing Power Parity) perspective a person in Rural India technically pays more for the product as their income source is limited and let's say even if they do order that they won't get their product is something absolutely not right!\n\nSome might say, who in rural areas are going to order from Amazon for a furniture! I also don't know the stats, but I know they do delivery of small products of about 75-100 packets everyday in this place where I am based on my observation as I see the delivery agent passing by my house on a daily basis.",
        "You really thought you are contributing something here, right?\n\nWhat do you suggest, OP must know limitations of all businesses in his village and avoid unintentionally demanding those services? Or do you believe every business that is scummy to take up a task or service that it's ill-prepared to deliver as justified?",
        "I have faced almost the same situation here in Delhi at my parents' government residence except it had a different outcome. \n\nOne of the delivery boys misbehaved with my father's gunman after the latter told him to behave. He said something along the lines of, \"now you will see\" and fled from the door with the package canceling it.\n\nI was briefed on the situation when I got back from office. It started because he didn't want the package to be checked. For security reasons, every package is opened here and then paid for here.\n\nI reordered and it got canceled again. I would order a bunch of stuff and half of it would get canceled.\n\nI had talks at length with the customer support and threatened them with legal and illegal action at every step. Every time, a call was picked up, I told the agent to escalate to a higher department and I did this at every step until I reached the highest ones and was able to sufficiently detail what was happening.\n\nOne of their agents who did make deliveries here came to my house crying with the next package. He told me that there was one person at his warehouse trying to make my address undeliverable and making his colleagues do the same. He begged me not to do something to make them lose business.\n\nIt continued but less frequently until I was told that the delivery boys responsible had been permanently fired and my house would not be marked undeliverable.\n\nAlso now, none of them try to boss around anyone at any of my addresses and we open the packages, and even test out electronic ones before they are paid.\n\nThese Amazon delivery agents are goons and think their company protects them as private agents. Do not be afraid of them, brother. Threaten them back however you can.\n\nEveryone is scared of losing their jobs, including these good for nothing people. Raise your voice and do not be afraid.",
        "Till now I had good experience with Amazon.",
        "email Executive Customer Relations team.\n\n[ecr@amazon.in](mailto:ecr@amazon.in)",
        "this kept happening with me for past 2 months. so many cancelled orders. dozen convos with cc n several calls n issue still persists. how did u reached higher level authority?\nMy issue is also compounded by the fact that majority of boxes I receive either r damaged or in open box condition so I cancelled them n it led to arguments with delivery boy.",
        "bro i am working from home in a rural area 10km away from main city for 4 years and using Amazon for more than 5 years and never in these years amazon delivery agent agreed to deliver it to my place so i have to ask my friend in city to accept parcel at his home and during weekends i got to his house and pick it up its very sad that zomato delivers but a company like Amazon refuses was very difficult to transport heavy and big objects for me on bike",
        "So this is a systemic problem by Amazon rural deliveries then.",
        "I faced many issues with Amazon marking something as delivered even though it wasnt. Amazon would assure a refund but sometimes they did and sometimes they didnt and I cant be bothered to track every refund as they take at least a week to refund. So I started ordering everything as Cash on Delivery. The delivery boys make more of an effort for COD packages.\n\nAlso Amazon day is pretty useless in India. Even if you are willing to wait a few days to get everything together instead of 5-6 deliveries in a day, they just ignore it and still send it 5-6 packages.\n\nSo now I just order on the earliest day and stopped bothering about being home to collect the parcel. I will simply reorder it if they come and I am not at home. As everything is COD no question of refunds. \n\nTreat your customers like shit and they will raise your delivery costs.\n\nWhen I lived in the US , Amazon was a breeze. Order Amazon Day and everything comes in one parcel.",
        "I told them I will be leveling harassment charges against them for mistreating a customer. I made up bs about getting the next delivery boy locked up too anyway I could. Just say that you're with a lawyer and keep on escalating.\n\nIf they argue policy, tell them their policy has to comply with the consumer laws in India, else they are operating illegally.\n\nTell them what a loyal customer you have been over the years and that your family has used it for decades. They will take you seriously if you make them realize how much shitty the delivery team has been to you.",
        "cod is wht I did - b/c of consecutive cancel orders they disable cod option. Ialways add instructions regarding packaging n still hardly any is followed so now after every order I just talk with cc n get instructions confirmed. Yes, sometimes they forget to refund so customer has to go through hassle of keeping the log of refund.",
        "This worked out! So that email that I sent out to Mr.Jeff Bezos was forwarded to their Amazon India Business Escalation team, and I have got a reply they will do a detailed analysis on the incident and will take some internal actions appropriately, but won't be able to share the finding publicly.",
        "Given the current state of the country Im surprised",
        "sadly its true.. my only complain is if delivery agent is not willing to deliver few kilometres outside the city amazon should not show on the app that they will deliver on my location which doesn't happen and creates mistrust",
        "India has so much potential if you are building a business.",
        "So as mentioned in one of the comments above I wrote a detailed email to Jeff Bezos email ID and someone from Amazon India Business Escalation Team reached out via email quoting that email that I had sent to Mr.Jeff Bezos.\n\nI would suggest that you stand up for your consumer rights and try to get the package delivered at your address and not pick it up from your friends location.\n\nOnly when we fight for our rights, we will get it!",
        "Reaching to the highest level authorities ensured your address was not blocked right? That's all you managed to achieve or did they give you any other compensation?",
        "They offered to give me my prime subscription extension of another 6 months for free. When I said no, they offered another year. I said I just wanted them to take care of their incompetent delivery staff. Yes, all the times that ass and his friends marked my address as undeliverable was marked as invalidated. At one point, the person on the phone instructed me to call the delivery agent assigned for my delivery that day and to let him hear what is said on the phone by keeping the calls merged. \n\nI did so and as usual, whoever it was rejected it despite calling the number thrice. Then the guy on the call did so. His was picked up and he told whoever the delivery agent was that he will lose his job unless he went to my address that day. After that, he called me again when the delivery agent had reached my house. He wanted to stay on call to hear what the delivery agent says to my staff. The delivery agent said that he didn’t have the package as he never picked it up from the warehouse when he started that morning but did assure me that he will deliver it the next day. \n\nAfter that, I handed him the phone with the authority still on the line and he got an earful and then the guy on the call told me to wait for the order tomorrow and that it will never happen again. It never has again now.",
        "Interesting! so as like someone suggested in the comments I wrote to Jeff Bezos email ID and that email has now been fwd to Amazon India Business Escalations Team",
        "Best of luck !",
        "Amazon has good service in my hometown, which is a tehsil so kinda rural, I don't even live there I just order stuff for my parents and have never faced any issues. One time they even accepted a return for a prodcut which didn't even had return available. Flipkart guys otoh are assholes, esp the guy who manages the warehouse, and even the Flipkart customer serice isn't much helpful. I once bought a phone on exchange, the Flipkart guy who was in charge straight up refused to come at my house and asked me to come to their warehouse for phone inspection and threatened that he'd cancel it if we don't. I told him I live out of town so he agreed to come the next day, but he didn't, next day I got notification that my order was cancelled. When I called FK Customer care they just kept deflecting it by apologies, then I decided to sort of boycott Fk and only order cheap stuff (I had bought more than lakhs of product from FK and this is how they treated me).\n\nThis is probably more due to shitty employees rather than Amazon. I'd still advice you to raise this issue further so that they come to know of it and take action and fire those a**holes.",
        "Happy that it worked out for you.👌",
        "Hey I have like done the complaint but there is no response from consumer forum \n\nShould I wait or do something else ?",
        "How long has it been? For me the entire process, from the first complaint to getting a refund took a month. \n\nThere’s a hotline number you can call to follow up on the consumer helpline website.",
        "Hotline number noted , will call it tomorrow then and thanks for reply\n\nHere is your payment for consultation\n\nhttps://preview.redd.it/unz8tsc8x2fd1.jpeg?width=1640&format=pjpg&auto=webp&s=52f521bf451ab3a7a65c93e7c21f007655fbc6a1",
        "Can you share the email id of Mr. Jeff?",
        "Hello. What happened later"
    ],
    "cleaned_text": "facing mental trauma abuse amazon india delivery agents past days working remotely ancestral village nattrasankottai km sivagangai tamil nadu nearest town thinking setting remote working setup already secured working broadband connection decided order table chair amazon big mistake made wanted share story january placed order nilkamal foldable plastic table along cello chairs additionally gas lighter kitchen use chairs delivered january without delivery done another warehouse agency thats connected amazon believe delivery process smooth professional faced issue delivery issue happened table delivered another warehouse agency seems ones deliver gas lighter well gas lighter delivered january delivery agent adhi said package take days deliver would bring min truck bigger package size delivery people january marked one pick parcel returned item back seller point immediately reached amazon mentioned address whole time delivery agency basically doesnt want delivery thats marked way returned package amazon support person mrshubham th january assured would repeated asked order table assurance ordered nilkamal table hoping package would delivered without issue time something completely unexpected happened delivery person adhi came rd february morning mentioned delivery big package go pick parcel location km location got phone number supervisor sivasankar questioned refusing door step delivery sivasankar started using terms like tamil want package come pick upif dont order amazonas wish go make complaint amazon app dont care make complaint went abuse call minutes ago another person named venkadesan works along sivasankar called number mentioned thing like wish raise complain go app started abusing tamil using words like dog audio recording conversation sharing abuse put mental trauma also worried physical safety delivery agent phone number well address immediately reached amazon call support also put tweet thread mentioning worried physical safety httpstwittercompriyadharshankstatus call support standard reply saying sorry look matter told guaranteed delivery day february twitter support response tweet feel concerned physical safety make complaint nearest police station tweet attached nearest police station km location decided go police station stay safe home pm yesterday venkadesan delivery agency called mentioned delivery today would cost cost extra petrol charges deliver single package wont deliver package next day deliver package mentioned marked amazon tracker delivery attempted one pick package reattempt tomorrow called amazon call support mentioned even though guaranteed delivery end day rd feb havent got package escalated call higher person mrsriram listening events mentioned escalate call higher minutes holding got back mentioned higher wont attend customer calls taken note poor delivery behavior taken complaint delivery person agency todayfeb around pm venkadesan adhi delivery agency came scooter carrying package package looked outside packaging seemed damaged asked package said yes decided share otp collect package assumption package inside would intact opened package could clearly see someone opened package caused damage package plastic chips table broken falling away strong guess delivery agents opened package caused damage table put back recorded delivery agent dropping package well opening package left ensure record incidents immediately reached amazon customer support going lot front back mrsandip customer support furniture team offered wanted refund replacement package mentioned mrsandip replacement sent back via delivery agents new package might also get fate previous one would pointless even try option requested issue refund also mentioned possible please send different pickup person pick return parcel feel comfortable interacting delivery agent previously abused phone whole incident left bad consumer experience amazon prime member years prime membership us back india business prime well individual prime account incident put lot mental trauma customer support close hours yesterday close hour today explaining situation delivery agents refusing deliver services rural area points really want raise based incident people rural areas deserve treatment people living cities delivery agent asking come pick parcel km away prime customer treated badly keep going loops automated support standard textbook sorry raise complaint delivery agent would situation non prime member redressal mechanism amazon delivery agent abuses customer using unparliamentary abusive words amazon hasnt offered sort compensation mental trauma gone general feel unjustified customer order amazon trust product would delivered simple hassle free manner doorstep particular experience made spend hours talking customer support addition getting abused delivery agent delivery agent mark wishes customer address location send parcel back even without attempting deliver fundamentally wrong thing amazon way track gps coordinates delivery person really ensure tried deliver door locked educated person like go much uneducated person living rural areas manage use apps like amazon customer support frustrating currently waiting return package picked th february refund issued amazon whole ordeal taken much time past days felt like action amazon take related points raised must redressal mechanism customer gets verbally abused amazon delivery person team whole incident first raised twitter picked journalist jagannathan also reported bunch news portals httpswwwcricketnmorecomsportsnewsworriedaboutphysicalsafetygmkannappanapproachesamazonafterdeliveryfauxpashttpswwwcricketnmorecomsportsnewsworriedaboutphysicalsafetygmkannappanapproachesamazonafterdeliveryfauxpas ",
    "cleaned_title": "facing mental trauma abuse amazon india delivery agents",
    "cleaned_selftext": "past days working remotely ancestral village nattrasankottai km sivagangai tamil nadu nearest town thinking setting remote working setup already secured working broadband connection decided order table chair amazon big mistake made wanted share story january placed order nilkamal foldable plastic table along cello chairs additionally gas lighter kitchen use chairs delivered january without delivery done another warehouse agency thats connected amazon believe delivery process smooth professional faced issue delivery issue happened table delivered another warehouse agency seems ones deliver gas lighter well gas lighter delivered january delivery agent adhi said package take days deliver would bring min truck bigger package size delivery people january marked one pick parcel returned item back seller point immediately reached amazon mentioned address whole time delivery agency basically doesnt want delivery thats marked way returned package amazon support person mrshubham th january assured would repeated asked order table assurance ordered nilkamal table hoping package would delivered without issue time something completely unexpected happened delivery person adhi came rd february morning mentioned delivery big package go pick parcel location km location got phone number supervisor sivasankar questioned refusing door step delivery sivasankar started using terms like tamil want package come pick upif dont order amazonas wish go make complaint amazon app dont care make complaint went abuse call minutes ago another person named venkadesan works along sivasankar called number mentioned thing like wish raise complain go app started abusing tamil using words like dog audio recording conversation sharing abuse put mental trauma also worried physical safety delivery agent phone number well address immediately reached amazon call support also put tweet thread mentioning worried physical safety httpstwittercompriyadharshankstatus call support standard reply saying sorry look matter told guaranteed delivery day february twitter support response tweet feel concerned physical safety make complaint nearest police station tweet attached nearest police station km location decided go police station stay safe home pm yesterday venkadesan delivery agency called mentioned delivery today would cost cost extra petrol charges deliver single package wont deliver package next day deliver package mentioned marked amazon tracker delivery attempted one pick package reattempt tomorrow called amazon call support mentioned even though guaranteed delivery end day rd feb havent got package escalated call higher person mrsriram listening events mentioned escalate call higher minutes holding got back mentioned higher wont attend customer calls taken note poor delivery behavior taken complaint delivery person agency todayfeb around pm venkadesan adhi delivery agency came scooter carrying package package looked outside packaging seemed damaged asked package said yes decided share otp collect package assumption package inside would intact opened package could clearly see someone opened package caused damage package plastic chips table broken falling away strong guess delivery agents opened package caused damage table put back recorded delivery agent dropping package well opening package left ensure record incidents immediately reached amazon customer support going lot front back mrsandip customer support furniture team offered wanted refund replacement package mentioned mrsandip replacement sent back via delivery agents new package might also get fate previous one would pointless even try option requested issue refund also mentioned possible please send different pickup person pick return parcel feel comfortable interacting delivery agent previously abused phone whole incident left bad consumer experience amazon prime member years prime membership us back india business prime well individual prime account incident put lot mental trauma customer support close hours yesterday close hour today explaining situation delivery agents refusing deliver services rural area points really want raise based incident people rural areas deserve treatment people living cities delivery agent asking come pick parcel km away prime customer treated badly keep going loops automated support standard textbook sorry raise complaint delivery agent would situation non prime member redressal mechanism amazon delivery agent abuses customer using unparliamentary abusive words amazon hasnt offered sort compensation mental trauma gone general feel unjustified customer order amazon trust product would delivered simple hassle free manner doorstep particular experience made spend hours talking customer support addition getting abused delivery agent delivery agent mark wishes customer address location send parcel back even without attempting deliver fundamentally wrong thing amazon way track gps coordinates delivery person really ensure tried deliver door locked educated person like go much uneducated person living rural areas manage use apps like amazon customer support frustrating currently waiting return package picked th february refund issued amazon whole ordeal taken much time past days felt like action amazon take related points raised must redressal mechanism customer gets verbally abused amazon delivery person team whole incident first raised twitter picked journalist jagannathan also reported bunch news portals httpswwwcricketnmorecomsportsnewsworriedaboutphysicalsafetygmkannappanapproachesamazonafterdeliveryfauxpashttpswwwcricketnmorecomsportsnewsworriedaboutphysicalsafetygmkannappanapproachesamazonafterdeliveryfauxpas",
    "cleaned_comments": "amazon gotten lot worse whereas flipkart improved open package policy would definitely encourage email amazon first use email raise complaints consumer helpline ingram lastly cpgrams well called spoken customer support close hours past two days overall frustrating experience explain issue start every agent connected even tell cs person please talk directly delivery agent give sort warning response dont option take note complaint take internal action business days even mentioned amazon possibility delivery agent comming pick package rural area like delivery agent think zip code would prefer someone else come pick response try mentioned situation arises agent comes refund pickup reason dont pick package reach us fact reach every single time amazon communicate anyway realtime delivery agent mention issue frustrating call recording go costumer court mostly settle anyone prior experience related going consumer court process time consuming reason asking indian judiciary known take ages settle cases dont want fight case years issue poor delivery audacity delivery agents deliver rural areas belief people rural areas wont raise voice wish hurts people rural areas get products discount pricing pay someone city delivery agents acting like masters questioning right start abuse verbally issue amazon support realtime answer solve issue like mentions resolve issue x business days delivery agent might show anger parcel might show anger parcel everytime order like delivery agent agency like old times say dont piss rural postman wont get posts envelopes like drop mail jeff bezos remember watching interview mentioned team going customer complaints received mail email easily available internet believe take lightly things happen life try face situation without letting affect mental health dont stress brother whole ordeal could avoided firstly didnt contact delivery agents agents wrongly updated customer unavailable something could left note amazon support money always safe secondly could rejected delivery seeing state would suggest leave mental peace looks like clearly cause enough stress already also dont worry guys returning pick coming house space raise complaint process lot back forth received resolution favour months time thanks advice sent email sharing whole incident lets see take action took lightly st time marked refused deliver contacted amazon support came back person reorder mention option get package picking place got really frustrated questioned purpose ordering via amazon delivery supervisor started abusing customer paying parcel well get abused cant taken lightly supervisor tone whatever want impression someone ordering rural place would someone illiterate wont way bring public attention abuse team member really became stressful talking house space remember location city cameras everywhere thing rural space mentioned nearest police station km away ok tomorrow hopefully resolution op try posting rlegaladviceindia also agree worth battle fighting return package move leave bad review seller item buy somewhere else shouldve stayed us ngl warehouse probably small godown bikes delivery dont fleet trucks like fulfilled warehouses would probably hire one single package control package size dimensions deliver amazon doesnt provide vehicles unlike agents usa came sorry say cant move remove village expect services metro cities even told would deliver tomorrow immediately went started complaining amazon feel threatened physical safety keep escalating issue instead going police finally poor guy carried huge package along huge delivery bag wheeler endangering safety bring entitled package still complaining wow free hes paying money honestly deserves service amazon billion dollar company afford expense also justify somebody abusing customer instead job paid nilkamal amazon amazon conveniently shirked responsibility dumping huge package onto small delivery company amazon afford op dealing amazon rather complaining amazon small business abusing wrong course cant find justified dont ability deliver amazon take orders zip code understanding delivery teams lets say k sfrom nearby bigger cities km away location opposite directions ordered fridge year ago location delivered warehouse team k delivered fridge issues also chairs bigger package well issues week ago warehouse team delivered professional way coming mini truck coming warehouse team problem team located big city lot activity amazon orders team basically trying shirk responsbility dont want send truck deliver package point cant expect services like metro amazon offer furniture delivery zip code understand tamil see first video delivery person flat refuses deliver guys lazy thats first instance cancelled package forced reorder next day put pressure amazon came along buddy scooter mentioned two names post well give package package isnt big transported via mini truck could delivered two people came scooter way delivered eventually also certain truck phone call abused delivery person venkadesan saying cancel today send truck next day thats confronted saying last time thats straight cancelled order without sending truck response point guy running deliverycourier agency expected whatever resources run agency poorly equipped put onus customer come collect package go pick package lets assume dont car would spend close rupees truckcost thats primary reason order amazon first place right convenience door step delivery qn comes rural area expectation city amazon promises delivery zip code imagine go much hoops still get product people area ever order anything person order rural area technically paying urban area think ppppurchasing power parity talking consumer rights perspective well made post delivery person kept repeating wish complain amazon go complain dont give damn thinking dealing someone would complain really complain got mad went show anger product add delivery agency running show charity ngo business expected resources paid also run business fundamentals business promise courier company refuses deliver parcel basically job straight thats point qn inefficiency get abused return inefficiency delivery agency feeling entitled wish without regarding consumer rights complain amazon made payment amazon random delivery agency delivery agency works amazon dont work amazon delivery agency expecting pay package well go collect delivery warehouse dont regret moving back india technically time much valuable fighting battle lot important things really wanted bring attention even pay service dont get rural india broader perspective rural india ever grow highlighting actually run pvt ltd company hire peopleremote ruralsemi rural areas part customer support team gives support us customers strongly inspired mrsridhar vembu zoho principle building potential rural india also reason trying work ancestral village rolled offer letter person week nearby town part team actually thinking building team ancestral village ppppurchasing power parity perspective person rural india technically pays product income source limited lets say even order wont get product something absolutely right might say rural areas going order amazon furniture also dont know stats know delivery small products packets everyday place based observation see delivery agent passing house daily basis really thought contributing something right suggest op must know limitations businesses village avoid unintentionally demanding services believe every business scummy take task service illprepared deliver justified faced almost situation delhi parents government residence except different outcome one delivery boys misbehaved fathers gunman latter told behave said something along lines see fled door package canceling briefed situation got back office started didnt want package checked security reasons every package opened paid reordered got canceled would order bunch stuff half would get canceled talks length customer support threatened legal illegal action every step every time call picked told agent escalate higher department every step reached highest ones able sufficiently detail happening one agents make deliveries came house crying next package told one person warehouse trying make address undeliverable making colleagues begged something make lose business continued less frequently told delivery boys responsible permanently fired house would marked undeliverable also none try boss around anyone addresses open packages even test electronic ones paid amazon delivery agents goons think company protects private agents afraid brother threaten back however everyone scared losing jobs including good nothing people raise voice afraid till good experience amazon email executive customer relations team ecramazoninmailtoecramazonin kept happening past months many cancelled orders dozen convos cc n several calls n issue still persists u reached higher level authority issue also compounded fact majority boxes receive either r damaged open box condition cancelled n led arguments delivery boy bro working home rural area km away main city years using amazon years never years amazon delivery agent agreed deliver place ask friend city accept parcel home weekends got house pick sad zomato delivers company like amazon refuses difficult transport heavy big objects bike systemic problem amazon rural deliveries faced many issues amazon marking something delivered even though wasnt amazon would assure refund sometimes sometimes didnt cant bothered track every refund take least week refund started ordering everything cash delivery delivery boys make effort cod packages also amazon day pretty useless india even willing wait days get everything together instead deliveries day ignore still send packages order earliest day stopped bothering home collect parcel simply reorder come home everything cod question refunds treat customers like shit raise delivery costs lived us amazon breeze order amazon day everything comes one parcel told leveling harassment charges mistreating customer made bs getting next delivery boy locked anyway could say youre lawyer keep escalating argue policy tell policy comply consumer laws india else operating illegally tell loyal customer years family used decades take seriously make realize much shitty delivery team cod wht bc consecutive cancel orders disable cod option ialways add instructions regarding packaging n still hardly followed every order talk cc n get instructions confirmed yes sometimes forget refund customer go hassle keeping log refund worked email sent mrjeff bezos forwarded amazon india business escalation team got reply detailed analysis incident take internal actions appropriately wont able share finding publicly given current state country im surprised sadly true complain delivery agent willing deliver kilometres outside city amazon show app deliver location doesnt happen creates mistrust india much potential building business mentioned one comments wrote detailed email jeff bezos email id someone amazon india business escalation team reached via email quoting email sent mrjeff bezos would suggest stand consumer rights try get package delivered address pick friends location fight rights get reaching highest level authorities ensured address blocked right thats managed achieve give compensation offered give prime subscription extension another months free said offered another year said wanted take care incompetent delivery staff yes times ass friends marked address undeliverable marked invalidated one point person phone instructed call delivery agent assigned delivery day let hear said phone keeping calls merged usual whoever rejected despite calling number thrice guy call picked told whoever delivery agent lose job unless went address day called delivery agent reached house wanted stay call hear delivery agent says staff delivery agent said didnt package never picked warehouse started morning assure deliver next day handed phone authority still line got earful guy call told wait order tomorrow never happen never interesting like someone suggested comments wrote jeff bezos email id email fwd amazon india business escalations team best luck amazon good service hometown tehsil kinda rural dont even live order stuff parents never faced issues one time even accepted return prodcut didnt even return available flipkart guys otoh assholes esp guy manages warehouse even flipkart customer serice isnt much helpful bought phone exchange flipkart guy charge straight refused come house asked come warehouse phone inspection threatened hed cancel dont told live town agreed come next day didnt next day got notification order cancelled called fk customer care kept deflecting apologies decided sort boycott fk order cheap stuff bought lakhs product fk treated probably due shitty employees rather amazon id still advice raise issue come know take action fire aholes happy worked hey like done complaint response consumer forum wait something else long entire process first complaint getting refund took month theres hotline number call follow consumer helpline website hotline number noted call tomorrow thanks reply payment consultation share email id mr jeff hello happened later",
    "light_cleaned_title": "Facing Mental Trauma and Abuse by Amazon India Delivery Agents",
    "light_cleaned_selftext": "For the past 10 days I have been working remotely from my ancestral village of Nattrasankottai which is about 10 km from Sivagangai, Tamil Nadu which is the nearest town. So I was thinking of setting up a remote working setup here as I had already secured a working broadband connection and decided to order table and chair from Amazon and that was a very big mistake I made, and I wanted to share that story over here. So on January 26, I placed an order for a Nilkamal Foldable Plastic Table along with 2 Cello Chairs and additionally a Gas lighter for Kitchen Use. The Chairs were delivered on January 30 without and this delivery was done by another warehouse agency that's connected to Amazon I believe, and their delivery process was very smooth and professional and I faced no issue with that delivery. The issue happened with the table as that was to be delivered by another warehouse agency it seems and they were the ones to deliver the Gas lighter as well. So when the gas lighter was delivered on January-29 the delivery agent Adhi said the package will take a few days to deliver as they would have to bring it on a Min Truck as its a bigger package in Size. But what these delivery people did is on January-29 they marked it as no one was there to pick up the parcel and returned the item back to Seller. At that point I immediately reached out to Amazon and mentioned that I was there at the address whole time and that the delivery agency basically doesn’t want to do the delivery and that’s why they have marked in such way and returned the package. Amazon support person Mr.Shubham on 29th January assured me that this would not be repeated and he asked me to order the table again and with that assurance I ordered the same Nilkamal Table again. I was hoping that the package would be delivered without any issue this time and this is where something completely unexpected happened. The delivery person Adhi came on the 3rd February morning and mentioned that they cannot do delivery as it’s a big package and that I have to go and pick up the parcel from their location, which is about 10-11km from my location. When I got the phone number of his supervisor Sivasankar and questioned him about why they are refusing to do door step delivery Sivasankar started using terms like (in Tamil) “If you want the package come and pick it up…if not don’t order from Amazon…As you wish go and make a complaint Amazon app, I don’t care if you make a complaint” and then he went on to abuse me on the call. About 30 minutes ago another person named Venkadesan who works along with Sivasankar called me from the same number and mentioned same thing like if you wish to raise a complain go and do it in the app and so on and started abusing me in Tamil using words like Dog. (I have the audio recording of this conversation, but not sharing it here). This abuse put me in mental trauma and also I was worried about my physical safety as the delivery agent has my phone number as well the address, so I immediately reached out to Amazon Call Support and also put out a tweet thread mentioning that I am worried about my physical safety (https://twitter.com/PriyadharshanK/status/1753699465712505019). The Call Support was once again standard reply saying they are sorry and that they will look into the matter and they told there will be a guaranteed delivery before the of the day (03-February-2024). The twitter support response for my tweet was if you feel concerned about physical safety, make a complaint at the nearest police station (Tweet attached). The nearest police station is about 10km from my location, and I decided not to go to the police station but just stay safe at my home. About 5PM yesterday Venkadesan from the delivery agency called me and mentioned that they cannot do delivery today as it would cost them cost extra petrol charges to deliver a single package, so they won’t deliver the package and that only the next day at 11AM they will deliver the package. Once he mentioned this, they once again marked it on the Amazon tracker as Delivery attempted but no one was there to pick up the package, so they will reattempt it tomorrow. I once again called Amazon Call Support and mentioned that even though you guaranteed me a delivery by the end of the day (3rd Feb) I haven’t got my package and for that they escalated the call to their higher up person Mr.Sriram who after listening to all the events, mentioned he will escalate the call to his higher up, but after a few minutes of holding he got back to me and mentioned his higher up won’t attend customer calls and that he has taken note of this poor delivery behavior and has taken a complaint against the delivery person and the agency. Today(Feb-4) around 3PM Venkadesan and Adhi of the delivery agency came on a scooter carrying the package and the package and when I looked at the outside packaging it seemed to have been damaged about 40% so I asked them if this is how the package was and he said yes, so I decided to share the OTP and collect the package under the assumption the package inside would be intact. When I opened the package I could clearly see someone having opened the package and have caused damage to the package as plastic chips of the table were broken off and was falling away. I have a very strong guess that the delivery agents opened the package and caused damage to the table and put it back. I recorded the delivery agent dropping the package as well as me opening the package after they left to ensure I have record of the incidents. I immediately reached out to Amazon customer support again and after going lot of front and back Mr.Sandip from Customer Support of Furniture team offered if I wanted a refund or a replacement of the package. I mentioned to Mr.Sandip that if the replacement will be sent back via the same delivery agents the new package might also get the same fate as the previous one, and that it would be pointless for me to even try that option so I requested him to issue a refund. I also mentioned that if possible please send a different pickup person to pick up the return of this parcel, as I do not feel comfortable interacting with the delivery agent who had previously abused me over the phone. This whole incident has left me with a very bad consumer experience with Amazon and having been a Prime Member for more than 10 years (I had Prime Membership when I was in the US, and when I was back in India, I had a Business Prime as well as the Individual Prime account) this incident has put me on a lot of mental trauma as I was with their customer support for close to 1.5 hours yesterday and close to 1 hour today explaining my situation and how that their delivery agents are refusing to deliver services if it is in a rural area. A few points that I really want to raise based on this incident 1)Do people in Rural areas not deserve the same treatment as people living in the cities? As the delivery agent is asking me to come and pick up the parcel 10 km away 2)If a Prime customer itself is treated so badly and has to keep going through loops of automated support and standard textbook I am sorry we will raise a complaint against the delivery agent, then what would be the situation if you are non Prime member? 3)Is there any redressal mechanism that Amazon has if a delivery agent abuses the customer using unparliamentary and abusive words? 4)Amazon hasn’t offered me any sort of compensation for all the mental trauma that I have gone through, and in general I just feel this is so unjustified as I as a customer order through Amazon with a trust that the product would be delivered in a simple and hassle free manner on my doorstep, but this particular experience has made me spend more than 3 hours talking to customer support in addition to getting abused by their delivery agent. 5)If the delivery agent can mark as he wishes that the customer was not at the address location and can send the parcel back even without attempting to deliver, then it is fundamentally wrong thing as Amazon should have a way to track GPS coordinates of the delivery person to really ensure if they tried to deliver and if the door was locked. 6)If an educated person like me has to go through so much, then how can an uneducated person living in rural areas manage to use apps like Amazon if the customer support is so frustrating? I am currently waiting for the return package to be picked up on 6th February and the refund be issued by Amazon. This whole ordeal has taken so much of my time over the past few days, I felt like that there has to be some action that Amazon should take related to the points that I have raised and there must be redressal mechanism when a customer gets verbally abused by Amazon Delivery Person team. This whole incident that which I first raised in Twitter was picked up by journalist Jagannathan and was also reported on bunch of news portals - [https://www.cricketnmore.com/sports-news/worried-about-physical-safety-gm-kannappan-approaches-amazon-after-delivery-faux-pas-12885](https://www.cricketnmore.com/sports-news/worried-about-physical-safety-gm-kannappan-approaches-amazon-after-delivery-faux-pas-12885)",
    "light_cleaned_comments": "Amazon has gotten a lot worse whereas flipkart has improved with open package policy. Would definitely encourage you to email Amazon first then use that email to raise complaints in the consumer helpline ( INGRAM) Lastly, CPGRAMS as well I have called and spoken to their customer support close to 3 hours over the past two days, and it has been overall such a frustrating experience as I had to explain my issue from the start again and again to every agent who connected with me. Even when I tell the CS person that please talk directly to the delivery agent and give them some sort of warning their response is they don't have the option and all they can do is just take a note as a complaint and will take some internal action in a few business days. Even now I mentioned Amazon that the possibility of the same delivery agent comming to pick up the package as its a rural area (There is only like 1 delivery agent I think for this ZIP code) and I would prefer if someone else can come to pick it up and their response is we will try what we can do, and they mentioned if the situation arises where the same agent comes for refund pickup and for some reason don't pick up the package, then again reach out to us. The fact that I have to reach out every single time and that Amazon cannot communicate in anyway realtime to delivery agent and mention the issue is so frustrating. If you have call recording go to costumer court.. they will mostly settle. Anyone here with any prior experience related to going to consumer court? Is the process very time consuming? Reason I am asking is because Indian judiciary is known to take ages to settle cases, and I don't want to fight some case for years. The issue is not just about poor delivery, it is about the audacity these delivery agents have when they deliver to rural areas, as they have the belief that people in rural areas won't raise their voice and that they can do as they wish which is what hurts me the most. Do people in rural areas get these products at a discount or what!? It's the same pricing they pay as someone in a city, and then these delivery agents acting like they are the Masters and when Questioning what they are doing is not right, that they start to abuse you verbally. The other issue is that Amazon Support having no realtime answer to solve an issue like this and mentions we will resolve this issue in X Business Days, but by then the delivery agent might show all his anger on your parcel or might show anger on your parcel everytime you order as there is like only 1 delivery agent and agency. This is like in old times they say don't piss off the rural postman, as if not you won't get any posts or envelopes. It's like that! Drop a mail to Jeff bezos, I remember watching his interview where he mentioned he has a team going through customer complaints received on his mail and that is why his email is easily available on the internet. I believe you should take this lightly. These things happen in life and should try to face the situation without letting it affect your mental health. Don’t stress yourself over this brother. This whole ordeal could have been avoided. Firstly you didn’t had to contact the delivery agents yourself. If the agents had wrongly updated as “customer unavailable” or something, you could have just left a note to Amazon support. Your money was always safe. Secondly you could have rejected the delivery after seeing the state of it. I would suggest leave it at this for your mental peace as it looks like it has clearly cause you enough stress already. Also don’t worry about those guys returning to pick it you. They are coming to YOUR house, YOUR space. Raise a complaint here process was a lot of back and forth, but I received a resolution in my favour in a month’s time. Thanks for the advice! I have sent out an email just now sharing the whole incident. Let's see if they take any action! I took it lightly the 1st time when they marked it as refused to deliver and contacted Amazon Support. When they came back in person for the reorder to mention that the only option for me to get the package is by picking it up in their place, I got really frustrated and when I questioned them then what is the purpose of ordering via Amazon, the delivery supervisor started abusing and as a customer paying for the parcel as well to get abused and that can't be taken lightly. The supervisor was having a tone of do whatever you want as he was under the impression that someone ordering from a rural place would be someone illiterate and won't have any way to bring it to public attention and then the abuse by him and his team member was when it really became stressful. You are talking about my house, my space, but remember this location is not a city with cameras everywhere or such thing, but it's rural space and as I mentioned the nearest police station is about 10KM away. Ok, will do that tomorrow! Hopefully there is some resolution :) Op try posting it on r/legaladviceindia also. I agree - not worth a battle fighting. Return the package and move on. Leave a bad review for seller and item and buy it from somewhere else ! Should've stayed in the US ngl Their \"warehouse\" is probably a small godown with 2-3 bikes for delivery. They don't have a fleet of trucks like Fulfilled Warehouses and would probably have to hire one just for your single package. They have no control over the package size or dimensions that they have to deliver, and Amazon doesn't provide vehicles to them unlike to agents in USA where you came from. Sorry to say but you can't move to some remove village and expect services of metro cities. Even after that when they told they would deliver tomorrow, immediately you went and started complaining to Amazon. You feel so threatened about your physical safety that you keep escalating the issue instead of going to police. Finally some poor guy carried this huge package along with that huge delivery bag on his 2 wheeler, endangering his own safety to bring you your entitled package, and you are still complaining. Wow. Are they doing so for free, if he's paying the money honestly he deserves the service. Amazon is a billion dollar company, they can afford the expense. Also how can you justify somebody abusing a customer instead of doing their job? No, he paid Nilkamal and Amazon. Amazon has conveniently shirked responsibility by dumping the huge package onto this small delivery company. Amazon can afford it, but again OP is not dealing with Amazon, rather he is complaining to Amazon about the small business. Abusing is wrong of course, and I can't find where I justified it. If they don't have the ability to deliver then Amazon should not take orders from the ZIP code. My understanding is there 2 delivery teams (Let's say K and S)from the nearby bigger cities which are 10km away from my location on opposite directions. and I have ordered a fridge about an year ago to the same location and it was delivered by the warehouse team K that delivered me the fridge with no issues and also the chairs which is a bigger package as well with 0 issues about a week ago. This warehouse team has delivered me in the most professional way coming on a mini truck. Coming to the warehouse team S is the problem. This team is located in a big city where there is lot of activity and amazon orders, so this team is basically trying to shirk their responsbility as they don't want to send their truck to deliver this package. About your point I can't expect services like a metro, if so Amazon should not offer furniture delivery for that ZIP code. If you understand Tamil see the first video where the delivery person flat out refuses to deliver and because these guys are lazy that's why at first instance they cancelled the package and forced me to reorder again and then the next day once I put pressure to Amazon he came along with his buddy on scooter (I have mentioned two names on my post as well) to give the package. So the package isnt that big that it had to be transported via mini truck it could have been delivered if two people came on a scooter the way they delivered to me eventually. I am also certain they have a truck as on the phone call that they abused me the delivery person Venkadesan was saying to me if we cancel today we will send it to you on truck next day, and that's when I confronted them saying last time that's not what you did, and you just straight up cancelled the order without sending it on any truck, he had no response. The other point is the guy is running a delivery/courier agency he is expected to have whatever resources to run the agency, he cannot be poorly equipped and put the onus on the customer to come and collect the package? If I have to go and pick up the package and let's assume I don't have a car, I would have to spend close to 500-600 Rupees for the truck+cost and that's the primary reason why we order in Amazon at first place right?? The convenience of door step delivery! My Qn comes up why should a rural area not have the same expectation as a city when Amazon promises delivery to this ZIP code? Imagine if I have to go through so much hoops and still not get my product, people in this area how can they ever order anything from here? A person if they order from a rural area technically they are paying more than an urban area if you think of PPP(Purchasing Power Parity). I am talking from a consumer rights perspective as well. I made this post because the delivery person kept repeating if you wish to complain Amazon go and complain, I don't give a damn as he was thinking he was dealing with someone who would not complain and when I did really complain, they got mad and went on to show their anger on the product. To add on the delivery agency is not running the show for charity, they are not a NGO but a business who is expected to have the resources for which they are paid. I also run a business and the fundamentals of the business is to do what you promise to do. If a courier company refuses to deliver a parcel, they are basically not doing their job, straight up that's the point. If you Qn their inefficiency and you will get abused in return, then its not inefficiency but the delivery agency feeling entitled that they can do as they wish without regarding for consumer rights. I can complain only to Amazon, as I made the payment to Amazon and not to some random delivery agency. The delivery agency works for Amazon, and I don't work for Amazon or for that delivery agency, expecting me to pay for the package as well and go and collect it from their delivery warehouse. I don't regret moving back to India! Technically my time is much more valuable than fighting this battle, as I have lot more important things to do, but I really wanted to bring attention to it that even when you pay for a service and you don't get it in Rural India, then from a broader perspective how Rural India will ever grow? Why I am highlighting this is because, I actually run a Pvt Ltd company, and we hire people(remote) from rural/semi rural areas to be part of our customer support team that gives support to US customers and I am strongly inspired by Mr.Sridhar Vembu and ZOHO principle of building and the potential of Rural india. That was also the reason why I was trying to work out of my ancestral village and we have rolled out an offer letter to a person this week from a nearby town to be part of our team. I am actually thinking of building a team out of my ancestral village. From a PPP(Purchasing Power Parity) perspective a person in Rural India technically pays more for the product as their income source is limited and let's say even if they do order that they won't get their product is something absolutely not right! Some might say, who in rural areas are going to order from Amazon for a furniture! I also don't know the stats, but I know they do delivery of small products of about 75-100 packets everyday in this place where I am based on my observation as I see the delivery agent passing by my house on a daily basis. You really thought you are contributing something here, right? What do you suggest, OP must know limitations of all businesses in his village and avoid unintentionally demanding those services? Or do you believe every business that is scummy to take up a task or service that it's ill-prepared to deliver as justified? I have faced almost the same situation here in Delhi at my parents' government residence except it had a different outcome. One of the delivery boys misbehaved with my father's gunman after the latter told him to behave. He said something along the lines of, \"now you will see\" and fled from the door with the package canceling it. I was briefed on the situation when I got back from office. It started because he didn't want the package to be checked. For security reasons, every package is opened here and then paid for here. I reordered and it got canceled again. I would order a bunch of stuff and half of it would get canceled. I had talks at length with the customer support and threatened them with legal and illegal action at every step. Every time, a call was picked up, I told the agent to escalate to a higher department and I did this at every step until I reached the highest ones and was able to sufficiently detail what was happening. One of their agents who did make deliveries here came to my house crying with the next package. He told me that there was one person at his warehouse trying to make my address undeliverable and making his colleagues do the same. He begged me not to do something to make them lose business. It continued but less frequently until I was told that the delivery boys responsible had been permanently fired and my house would not be marked undeliverable. Also now, none of them try to boss around anyone at any of my addresses and we open the packages, and even test out electronic ones before they are paid. These Amazon delivery agents are goons and think their company protects them as private agents. Do not be afraid of them, brother. Threaten them back however you can. Everyone is scared of losing their jobs, including these good for nothing people. Raise your voice and do not be afraid. Till now I had good experience with Amazon. email Executive Customer Relations team. [ecr@amazon.in](mailto:ecr@amazon.in) this kept happening with me for past 2 months. so many cancelled orders. dozen convos with cc n several calls n issue still persists. how did u reached higher level authority? My issue is also compounded by the fact that majority of boxes I receive either r damaged or in open box condition so I cancelled them n it led to arguments with delivery boy. bro i am working from home in a rural area 10km away from main city for 4 years and using Amazon for more than 5 years and never in these years amazon delivery agent agreed to deliver it to my place so i have to ask my friend in city to accept parcel at his home and during weekends i got to his house and pick it up its very sad that zomato delivers but a company like Amazon refuses was very difficult to transport heavy and big objects for me on bike So this is a systemic problem by Amazon rural deliveries then. I faced many issues with Amazon marking something as delivered even though it wasnt. Amazon would assure a refund but sometimes they did and sometimes they didnt and I cant be bothered to track every refund as they take at least a week to refund. So I started ordering everything as Cash on Delivery. The delivery boys make more of an effort for COD packages. Also Amazon day is pretty useless in India. Even if you are willing to wait a few days to get everything together instead of 5-6 deliveries in a day, they just ignore it and still send it 5-6 packages. So now I just order on the earliest day and stopped bothering about being home to collect the parcel. I will simply reorder it if they come and I am not at home. As everything is COD no question of refunds. Treat your customers like shit and they will raise your delivery costs. When I lived in the US , Amazon was a breeze. Order Amazon Day and everything comes in one parcel. I told them I will be leveling harassment charges against them for mistreating a customer. I made up bs about getting the next delivery boy locked up too anyway I could. Just say that you're with a lawyer and keep on escalating. If they argue policy, tell them their policy has to comply with the consumer laws in India, else they are operating illegally. Tell them what a loyal customer you have been over the years and that your family has used it for decades. They will take you seriously if you make them realize how much shitty the delivery team has been to you. cod is wht I did - b/c of consecutive cancel orders they disable cod option. Ialways add instructions regarding packaging n still hardly any is followed so now after every order I just talk with cc n get instructions confirmed. Yes, sometimes they forget to refund so customer has to go through hassle of keeping the log of refund. This worked out! So that email that I sent out to Mr.Jeff Bezos was forwarded to their Amazon India Business Escalation team, and I have got a reply they will do a detailed analysis on the incident and will take some internal actions appropriately, but won't be able to share the finding publicly. Given the current state of the country Im surprised sadly its true.. my only complain is if delivery agent is not willing to deliver few kilometres outside the city amazon should not show on the app that they will deliver on my location which doesn't happen and creates mistrust India has so much potential if you are building a business. So as mentioned in one of the comments above I wrote a detailed email to Jeff Bezos email ID and someone from Amazon India Business Escalation Team reached out via email quoting that email that I had sent to Mr.Jeff Bezos. I would suggest that you stand up for your consumer rights and try to get the package delivered at your address and not pick it up from your friends location. Only when we fight for our rights, we will get it! Reaching to the highest level authorities ensured your address was not blocked right? That's all you managed to achieve or did they give you any other compensation? They offered to give me my prime subscription extension of another 6 months for free. When I said no, they offered another year. I said I just wanted them to take care of their incompetent delivery staff. Yes, all the times that ass and his friends marked my address as undeliverable was marked as invalidated. At one point, the person on the phone instructed me to call the delivery agent assigned for my delivery that day and to let him hear what is said on the phone by keeping the calls merged. I did so and as usual, whoever it was rejected it despite calling the number thrice. Then the guy on the call did so. His was picked up and he told whoever the delivery agent was that he will lose his job unless he went to my address that day. After that, he called me again when the delivery agent had reached my house. He wanted to stay on call to hear what the delivery agent says to my staff. The delivery agent said that he didn’t have the package as he never picked it up from the warehouse when he started that morning but did assure me that he will deliver it the next day. After that, I handed him the phone with the authority still on the line and he got an earful and then the guy on the call told me to wait for the order tomorrow and that it will never happen again. It never has again now. Interesting! so as like someone suggested in the comments I wrote to Jeff Bezos email ID and that email has now been fwd to Amazon India Business Escalations Team Best of luck ! Amazon has good service in my hometown, which is a tehsil so kinda rural, I don't even live there I just order stuff for my parents and have never faced any issues. One time they even accepted a return for a prodcut which didn't even had return available. Flipkart guys otoh are assholes, esp the guy who manages the warehouse, and even the Flipkart customer serice isn't much helpful. I once bought a phone on exchange, the Flipkart guy who was in charge straight up refused to come at my house and asked me to come to their warehouse for phone inspection and threatened that he'd cancel it if we don't. I told him I live out of town so he agreed to come the next day, but he didn't, next day I got notification that my order was cancelled. When I called FK Customer care they just kept deflecting it by apologies, then I decided to sort of boycott Fk and only order cheap stuff (I had bought more than lakhs of product from FK and this is how they treated me). This is probably more due to shitty employees rather than Amazon. I'd still advice you to raise this issue further so that they come to know of it and take action and fire those a**holes. Happy that it worked out for you.👌 Hey I have like done the complaint but there is no response from consumer forum Should I wait or do something else ? How long has it been? For me the entire process, from the first complaint to getting a refund took a month. There’s a hotline number you can call to follow up on the consumer helpline website. Hotline number noted , will call it tomorrow then and thanks for reply Here is your payment for consultation Can you share the email id of Mr. Jeff? Hello. What happened later"
}