{
    "id": "12c61vr",
    "title": "Recalling the story of the Maliana communal violence of 1987",
    "url": "https://indianexpress.com/article/explained/recalling-the-story-of-the-maliana-communal-violence-of-1987-8538314/",
    "selftext": "68 Muslims were killed, allegedly by a mob accompanied by personnel of the UP PAC, in Maliana on May 23, 1987. This came a day after the Hashimpura massacre, for which 16 ex-PAC men were convicted in 2018",
    "flair": "Law & Courts",
    "score": 21,
    "num_comments": 3,
    "created_utc": 1680663193.0,
    "convurl": "https://external-preview.redd.it/vpkVF92oJbyyd8Qlg7xoySqKbIRV9P2EtKI0fHxAM60.jpg?auto=webp&v=enabled&s=0328bf61d24885d11b3f7e313067e035471a51b4",
    "comments": [
        "A district court in Meerut last week acquitted all 41 accused in the May 23, 1987 massacre in Maliana village outside the town, in which 68 Muslims were killed by a mob that allegedly included personnel of the Uttar Pradesh Provincial Armed Constabulary (PAC)",
        "1987 ki cheez aaj kyu bhai?",
        "Because it took this long in 2023 to give a verdict. Justice delayed situation"
    ],
    "cleaned_text": "recalling story maliana communal violence muslims killed allegedly mob accompanied personnel pac maliana may came day hashimpura massacre expac men convicted ",
    "cleaned_title": "recalling story maliana communal violence",
    "cleaned_selftext": "muslims killed allegedly mob accompanied personnel pac maliana may came day hashimpura massacre expac men convicted",
    "cleaned_comments": "district court meerut last week acquitted accused may massacre maliana village outside town muslims killed mob allegedly included personnel uttar pradesh provincial armed constabulary pac ki cheez aaj kyu bhai took long give verdict justice delayed situation",
    "light_cleaned_title": "Recalling the story of the Maliana communal violence of 1987",
    "light_cleaned_selftext": "68 Muslims were killed, allegedly by a mob accompanied by personnel of the UP PAC, in Maliana on May 23, 1987. This came a day after the Hashimpura massacre, for which 16 ex-PAC men were convicted in 2018",
    "light_cleaned_comments": "A district court in Meerut last week acquitted all 41 accused in the May 23, 1987 massacre in Maliana village outside the town, in which 68 Muslims were killed by a mob that allegedly included personnel of the Uttar Pradesh Provincial Armed Constabulary (PAC) 1987 ki cheez aaj kyu bhai? Because it took this long in 2023 to give a verdict. Justice delayed situation"
}