{
    "id": "15j1q5t",
    "title": "Fear, Depression in Indian Muslims Is Palpable Even Among Those Who Are ‘Privileged’",
    "url": "https://m.thewire.in/article/communalism/fear-depression-in-indian-muslims-is-palpable-even-among-those-who-are-privileged?fbclid=IwAR087vSHernCIpA5zz6VIlfqcQhkukVrZZROU3faVg4OUwOPztjMV6Q6BU0_aem_AVrdYJuc2HxZxzMkbGUCRGF0w9L7n2nF40UjXwYbaMdFSWjAawjHcQiiGuxtv3dRiTk",
    "selftext": "This hits hard. This country has become totally unrecognisable. 😞",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691257162.0,
    "convurl": "https://external-preview.redd.it/t41QH7X5HIt9M4ZKz9ndhk51pSKaJzXvf5X34ndcohg.jpg?auto=webp&s=52bed36969b032cb79ef75f1750a9bc8709e8861",
    "comments": [
        "Yeah. It's worrying to select location for college, job, housing, and also in terms of business relationships. \n\nIt's scary world out there. A dude got beaten to death' in middle of Gurgaon, so call millennium city or some shit, just a few kms from my office on Sohna road. \n\nParents are scared, asked me to avoid traveling to work, but company is adamant on WFO.",
        "The family if a close friend of mine lives in Gurgaon. They have the extended families in old Delhi. Once after a dinner together, the aunt from old Delhi packed dinner of left over mutton nihari for them to take back to Gurgaon. The cousins refused because they were scared of they get stopped on a checkpoint and chips see their licence and get to know their name, the mutton could be construed for beef and they could be lynched. These are well to do folks working in MNCs .",
        "No need for license or stopping. Vehicle registration data has been sold by the government. This is already used by mobs.",
        "Genuinely curious question: Why do you/your family continue to stay in Gurgaon (or north India in general)? Have you considered going south if not out of India?",
        "We have a family home in Delhi, so I stay there and commute daily to Gurgaon for work where most of the corporates stay. \n\nI had given up on chance to move to a Gulf country in 2012, as I wanted to work in India and saw good opportunities here, however now I am considering for moving elsewhere.",
        "Yeah. Family used to travel from native place via train and we used to pack food for travel and others in Delhi, we have stopped doing that because of fear of being lynched. We prefer to eat train food or chips now.",
        "Good for you, man. It's never too late and stay safe until then!",
        "Housing is a distance dream if you are from Muslim family. I belong from a Muslim family but I'm an Atheist. Finding a house was traumatizing for me. Once a broker called someone to confirm if they would give the house to a Muslim family and it was on speaker, that guy on the call legit said \"Mulla logo bilkul nai dena, age se koi mulla hoga to sidha mana kar dena\"",
        "Targeted attacks during riots also make me not want to stay in majority areas. First part is crossing the hurdle of getting housing and then all drama with eating habits, religious festivals, and then still fear of your neighbours causing you harm during riots. That's too much.",
        "Ya then people cry about why Muslims live in Muslim majority area only, these people firstly don't allow them to get housing, then these targeted riots are going on for decades and decades. \n\nAlso I don't understand about this eating habits thing, a lot of Hindus themselves eat meat or eggs then why have problems if their tenets eat it? Like these people are always happy to eat biryani, mutton masala and all that are made by Muslims but are not okay with them getting housing? With all this religious bullshit I don't think this country is ever going to be developed. Call the west all the shit you want but at least they don't have riots in the name of imaginary idols.",
        "Development comes with economy which hardly depends on social movement or even contribution of all the members of society. I mean, Nazi Germany did pretty well economic wise with lots of current market leading companies founded during those times, the fast moving highways that are still the best in the world. And other colonial powers also became economic powerhouses from looting other nations. \n\nSo we are also seeing same in India. Gurgaon is the corporate center of India, it's hardly a cosmopolitan city but mostly a majority community led place, we are seeing maddening pace of highways development and other economic development. \n\nI think it is question of equity and parity in terms of development that will be missing. Muslims are already doing small, service type roles in the economy and hardly form 7-8 percent of India's working population. It's negligible to what the total Indian population is. We don't matter basically, so it's on us to stand up and be counted. Majority community would love us to disappear and most won't even notice."
    ],
    "cleaned_text": "fear depression indian muslims palpable even among privileged hits hard country become totally unrecognisable ",
    "cleaned_title": "fear depression indian muslims palpable even among privileged",
    "cleaned_selftext": "hits hard country become totally unrecognisable",
    "cleaned_comments": "yeah worrying select location college job housing also terms business relationships scary world dude got beaten death middle gurgaon call millennium city shit kms office sohna road parents scared asked avoid traveling work company adamant wfo family close friend mine lives gurgaon extended families old delhi dinner together aunt old delhi packed dinner left mutton nihari take back gurgaon cousins refused scared get stopped checkpoint chips see licence get know name mutton could construed beef could lynched well folks working mncs need license stopping vehicle registration data sold government already used mobs genuinely curious question youyour family continue stay gurgaon north india general considered going south india family home delhi stay commute daily gurgaon work corporates stay given chance move gulf country wanted work india saw good opportunities however considering moving elsewhere yeah family used travel native place via train used pack food travel others delhi stopped fear lynched prefer eat train food chips good man never late stay safe housing distance dream muslim family belong muslim family im atheist finding house traumatizing broker called someone confirm would give house muslim family speaker guy call legit said mulla logo bilkul nai dena age se koi mulla hoga sidha mana kar dena targeted attacks riots also make want stay majority areas first part crossing hurdle getting housing drama eating habits religious festivals still fear neighbours causing harm riots thats much ya people cry muslims live muslim majority area people firstly dont allow get housing targeted riots going decades decades also dont understand eating habits thing lot hindus eat meat eggs problems tenets eat like people always happy eat biryani mutton masala made muslims okay getting housing religious bullshit dont think country ever going developed call west shit want least dont riots name imaginary idols development comes economy hardly depends social movement even contribution members society mean nazi germany pretty well economic wise lots current market leading companies founded times fast moving highways still best world colonial powers also became economic powerhouses looting nations also seeing india gurgaon corporate center india hardly cosmopolitan city mostly majority community led place seeing maddening pace highways development economic development think question equity parity terms development missing muslims already small service type roles economy hardly form percent indias working population negligible total indian population dont matter basically us stand counted majority community would love us disappear wont even notice",
    "light_cleaned_title": "Fear, Depression in Indian Muslims Is Palpable Even Among Those Who Are ‘Privileged’",
    "light_cleaned_selftext": "This hits hard. This country has become totally unrecognisable. 😞",
    "light_cleaned_comments": "Yeah. It's worrying to select location for college, job, housing, and also in terms of business relationships. It's scary world out there. A dude got beaten to death' in middle of Gurgaon, so call millennium city or some shit, just a few kms from my office on Sohna road. Parents are scared, asked me to avoid traveling to work, but company is adamant on WFO. The family if a close friend of mine lives in Gurgaon. They have the extended families in old Delhi. Once after a dinner together, the aunt from old Delhi packed dinner of left over mutton nihari for them to take back to Gurgaon. The cousins refused because they were scared of they get stopped on a checkpoint and chips see their licence and get to know their name, the mutton could be construed for beef and they could be lynched. These are well to do folks working in MNCs . No need for license or stopping. Vehicle registration data has been sold by the government. This is already used by mobs. Genuinely curious question: Why do you/your family continue to stay in Gurgaon (or north India in general)? Have you considered going south if not out of India? We have a family home in Delhi, so I stay there and commute daily to Gurgaon for work where most of the corporates stay. I had given up on chance to move to a Gulf country in 2012, as I wanted to work in India and saw good opportunities here, however now I am considering for moving elsewhere. Yeah. Family used to travel from native place via train and we used to pack food for travel and others in Delhi, we have stopped doing that because of fear of being lynched. We prefer to eat train food or chips now. Good for you, man. It's never too late and stay safe until then! Housing is a distance dream if you are from Muslim family. I belong from a Muslim family but I'm an Atheist. Finding a house was traumatizing for me. Once a broker called someone to confirm if they would give the house to a Muslim family and it was on speaker, that guy on the call legit said \"Mulla logo bilkul nai dena, age se koi mulla hoga to sidha mana kar dena\" Targeted attacks during riots also make me not want to stay in majority areas. First part is crossing the hurdle of getting housing and then all drama with eating habits, religious festivals, and then still fear of your neighbours causing you harm during riots. That's too much. Ya then people cry about why Muslims live in Muslim majority area only, these people firstly don't allow them to get housing, then these targeted riots are going on for decades and decades. Also I don't understand about this eating habits thing, a lot of Hindus themselves eat meat or eggs then why have problems if their tenets eat it? Like these people are always happy to eat biryani, mutton masala and all that are made by Muslims but are not okay with them getting housing? With all this religious bullshit I don't think this country is ever going to be developed. Call the west all the shit you want but at least they don't have riots in the name of imaginary idols. Development comes with economy which hardly depends on social movement or even contribution of all the members of society. I mean, Nazi Germany did pretty well economic wise with lots of current market leading companies founded during those times, the fast moving highways that are still the best in the world. And other colonial powers also became economic powerhouses from looting other nations. So we are also seeing same in India. Gurgaon is the corporate center of India, it's hardly a cosmopolitan city but mostly a majority community led place, we are seeing maddening pace of highways development and other economic development. I think it is question of equity and parity in terms of development that will be missing. Muslims are already doing small, service type roles in the economy and hardly form 7-8 percent of India's working population. It's negligible to what the total Indian population is. We don't matter basically, so it's on us to stand up and be counted. Majority community would love us to disappear and most won't even notice."
}