{
    "id": "14255o1",
    "title": "Non Indian women marrying Indian guy and making her whole social media life about his culture is a legit genre in youtube and it is absolutely weird, what do yall think?",
    "url": "https://www.reddit.com/r/india/comments/14255o1/non_indian_women_marrying_indian_guy_and_making/",
    "selftext": " \n\nI thought it was just a few interested in Indian culture, so i checked on youtube. It is a literal genre in there. Thousands and thousands of channels of a non indian woman married to an indian guy and their channel/insta is all about his culture. Literally nothing else. Its not like these channels have just a few subscribers. Its millions of subscribers, millions of views ,millions of likes. Its so damn weird. I thought maybe it is because of white skin obsession among indians. But there hundreds of channels of women from other non white ethnicities like middle eastern, black, chinese, korean,japanese, thai etc. Its really weird. What do yall think?\n\nEDIT: If you dont believe me i am gonna link a few here , these are some of the thousands of channels out there. People asking why I have jot it down, there was a post jotting them down in a sub , I just copy pasted the links from there.\n\n[https://www.youtube.com/@Jenniji](https://www.youtube.com/@Jenniji)\n\n[https://www.youtube.com/c/IndiaInDetails](https://www.youtube.com/c/IndiaInDetails)\n\n[https://www.youtube.com/channel/UCKrVABtlJe8apZSPK6eP20g/videos](https://www.youtube.com/channel/UCKrVABtlJe8apZSPK6eP20g/videos)\n\n[https://www.youtube.com/channel/UC2gZh8iGgLI7xLkxaoMkKSg](https://www.youtube.com/channel/UC2gZh8iGgLI7xLkxaoMkKSg)\n\n[https://www.youtube.com/channel/UCHGhWgNbi6Mt3C2pn98m1tQ](https://www.youtube.com/channel/UCHGhWgNbi6Mt3C2pn98m1tQ)\n\n[https://www.youtube.com/@myneighbortumul-indianlife5029](https://www.youtube.com/@myneighbortumul-indianlife5029)\n\n[https://www.youtube.com/@SnYdays](https://www.youtube.com/@SnYdays)\n\n[https://www.youtube.com/@AamandBasil/shorts](https://www.youtube.com/@AamandBasil/shorts)\n\n[https://www.youtube.com/@stayawara](https://www.youtube.com/@stayawara)\n\n[https://www.youtube.com/@anshmandy8088](https://www.youtube.com/@anshmandy8088)\n\n[https://www.youtube.com/@lokeshchinavlogs](https://www.youtube.com/@lokeshchinavlogs)\n\n[https://www.youtube.com/@dostinana](https://www.youtube.com/@dostinana)\n\n[https://www.youtube.com/@1turkish1indian43](https://www.youtube.com/@1turkish1indian43)\n\n[https://www.youtube.com/c/MithileshBackpacker/videos](https://www.youtube.com/c/MithileshBackpacker/videos)\n\n[https://www.youtube.com/c/LegionsLife/videos](https://www.youtube.com/c/LegionsLife/videos)\n\n[https://www.youtube.com/c/ProTarun](https://www.youtube.com/c/ProTarun)\n\n[https://www.youtube.com/@-KorindianDiaries](https://www.youtube.com/@-KorindianDiaries)\n\n[https://www.youtube.com/channel/UCmCf00nmCloUBqeWMWt-gfA/videos](https://www.youtube.com/channel/UCmCf00nmCloUBqeWMWt-gfA/videos)\n\n[https://www.youtube.com/c/IndianItalianCoupleWorld/videos](https://www.youtube.com/c/IndianItalianCoupleWorld/videos)\n\n[https://www.youtube.com/c/Nomadikker/videos](https://www.youtube.com/c/Nomadikker/videos)\n\n[https://www.youtube.com/channel/UC9fHmD77xVEGHUq1U3mtoqQ/videos](https://www.youtube.com/channel/UC9fHmD77xVEGHUq1U3mtoqQ/videos)\n\n[https://www.youtube.com/channel/UCcToWOuqIUrsuBz9wO6t-4g/videos](https://www.youtube.com/channel/UCcToWOuqIUrsuBz9wO6t-4g/videos)\n\n[https://www.youtube.com/c/INDIANLIFEINRUSSIANSTYLE/videos](https://www.youtube.com/c/INDIANLIFEINRUSSIANSTYLE/videos)\n\n[https://www.youtube.com/channel/UCWyA43e4Fce5LhDF-0CQalg/videos](https://www.youtube.com/channel/UCWyA43e4Fce5LhDF-0CQalg/videos)\n\n[https://www.youtube.com/c/Lushal](https://www.youtube.com/c/Lushal)\n\n[https://www.youtube.com/@ahzmiandazhar6719](https://www.youtube.com/@ahzmiandazhar6719)\n\n[https://www.youtube.com/@keyannaanderson3128](https://www.youtube.com/@keyannaanderson3128)\n\n[https://www.youtube.com/@jarrydthabang9199](https://www.youtube.com/@jarrydthabang9199)\n\n[https://www.youtube.com/channel/UCrRLCxHC7avNO1z8fWMIX2g/videos](https://www.youtube.com/channel/UCrRLCxHC7avNO1z8fWMIX2g/videos)\n\n[https://www.youtube.com/c/LetsMeetAbroad/videos](https://www.youtube.com/c/LetsMeetAbroad/videos)\n\n[https://www.youtube.com/c/BasantJangraVlogsvideo/videos](https://www.youtube.com/c/BasantJangraVlogsvideo/videos)\n\n[https://www.youtube.com/c/ForeignerinIndia/videos](https://www.youtube.com/c/ForeignerinIndia/videos)\n\n[https://www.youtube.com/c/InternationalFamilyVlogs/videos](https://www.youtube.com/c/InternationalFamilyVlogs/videos)\n\n[https://www.youtube.com/c/TheIndianPolishConnection/videos](https://www.youtube.com/c/TheIndianPolishConnection/videos)\n\n[https://www.youtube.com/c/IndoIranianLovestory/videos](https://www.youtube.com/c/IndoIranianLovestory/videos)\n\n[https://www.youtube.com/channel/UCBEYrN24T2HB9sN5aGuUQKQ/videos](https://www.youtube.com/channel/UCBEYrN24T2HB9sN5aGuUQKQ/videos)\n\n[https://www.youtube.com/c/premkimforever/videos](https://www.youtube.com/c/premkimforever/videos)\n\n[https://www.youtube.com/user/MarikaGeorgievna/videos](https://www.youtube.com/user/MarikaGeorgievna/videos)\n\n[https://www.youtube.com/channel/UCDucpnFtfpZxEx0j8sTpmUA/videos](https://www.youtube.com/channel/UCDucpnFtfpZxEx0j8sTpmUA/videos)\n\n[https://www.youtube.com/channel/UCWf9w7kBZapELBH4L203leA/videos](https://www.youtube.com/channel/UCWf9w7kBZapELBH4L203leA/videos)\n\n[https://www.youtube.com/c/PiyushHarne/videos](https://www.youtube.com/c/PiyushHarne/videos)\n\n[https://www.youtube.com/c/IndianInChinaVlog/videos](https://www.youtube.com/c/IndianInChinaVlog/videos)\n\n[https://www.youtube.com/c/RomiesVlogs/videos](https://www.youtube.com/c/RomiesVlogs/videos)\n\n[https://www.youtube.com/c/MukkuOksii/videos](https://www.youtube.com/c/MukkuOksii/videos)\n\n[https://www.youtube.com/c/TasyaSelfMom/videos](https://www.youtube.com/c/TasyaSelfMom/videos)\n\n[https://www.youtube.com/c/NamastefromUSA/videos](https://www.youtube.com/c/NamastefromUSA/videos)\n\n[https://www.youtube.com/channel/UCxq523tQwXhcgDDqBuwoiMQ](https://www.youtube.com/channel/UCxq523tQwXhcgDDqBuwoiMQ)\n\n[https://www.youtube.com/channel/UCwvWq7bx1t8MNrdXjD\\_YheA/videos](https://www.youtube.com/channel/UCwvWq7bx1t8MNrdXjD_YheA/videos])\n\n[https://www.youtube.com/watch?v=5WeseXWeS1c](https://www.youtube.com/watch?v=5WeseXWeS1c)\n\n[https://www.youtube.com/c/RamandPie/videos](https://www.youtube.com/c/RamandPie/videos)\n\n[https://www.youtube.com/channel/UCEwRYOwLLu4GQJIr\\_nuU7wg/videos](https://www.youtube.com/channel/UCEwRYOwLLu4GQJIr_nuU7wg/videos)\n\n[https://www.youtube.com/channel/UCTXEBNXZQ4ZaC4u9PMMOjBw/videos](https://www.youtube.com/channel/UCTXEBNXZQ4ZaC4u9PMMOjBw/videos)\n\n[https://www.youtube.com/channel/UCVpLFuaXLL-FwVeTNGprYPw/videos](https://www.youtube.com/channel/UCVpLFuaXLL-FwVeTNGprYPw/videos)\n\n[https://www.youtube.com/channel/UC\\_xUnjvDyVBdTguDrkTjWSw](https://www.youtube.com/channel/UC_xUnjvDyVBdTguDrkTjWSw)\n\n[https://www.youtube.com/c/Elizab3thJoy](https://www.youtube.com/c/Elizab3thJoy)\n\n[https://www.youtube.com/c/abhinavkari](https://www.youtube.com/c/abhinavkari)\n\n[https://www.youtube.com/c/AmanSara](https://www.youtube.com/c/AmanSara)\n\n[https://www.youtube.com/channel/UCiN83YWd65Ta4NAj3cpHzPg](https://www.youtube.com/channel/UCiN83YWd65Ta4NAj3cpHzPg)\n\n[https://www.youtube.com/@OnlyOneGiulia/videos](https://www.youtube.com/@OnlyOneGiulia/videos)\n\n[https://www.youtube.com/@TravelVlogIv/videos](https://www.youtube.com/@TravelVlogIv/videos)",
    "flair": "Rant / Vent",
    "score": 2310,
    "num_comments": 549,
    "created_utc": 1686029885.0,
    "convurl": "https://external-preview.redd.it/oYBx-FeQqOKk2Bp_-TY0pY1vNjRVXRiba71lGpTWm84.jpg?auto=webp&v=enabled&s=b764b7acd06db0e8c39a41af2be8179b9149e059",
    "comments": [
        "You do understand how marketing works right. It's the same reason why you have an entire genre of folks reviewing Indian movies who are not Indians.",
        "People can do what pleases them as long as they’re not doing anything illegal and no attempts are made to generalise any community. That’s pretty much how YouTube works. People watch whatever is interesting to them. This is perhaps one of them",
        "I don't see that as a problem. General channels putting daily vlogs are the problem not someone trying to create a niche for themselves. And that's how YouTube works.   \nIn my personal opinion, its beautiful how two people accept each other's culture  for love.",
        "Isn't western culture the dominant one? Everyone is already familiar with things. How many people would watch a video of an Indian woman going to Arby's. \n\nToday I spoke only English with Americans.\n\nFirst time trying Pumpkin spice latte.\n \nShopping in a farmers market/Walmart.\n\nCelebrating Thanksgiving with my husband's family.\n\nToday I tried traditional american lululemon and uggs",
        "No its great that people show their different lives so others can also expand their horizons.",
        "What are they actually marketing?",
        "No it is more about the lack of good content creation by Indians. Most of their viewers will be from India itself and not from other countries.",
        "The girl in the picture is not married yet and lives quite nearby to where I live",
        "Not my monkey, not my circus.\n\nMaybe algorithm pushes such videos more, but you shall see not much of it if you click on *not interested/don't recommend such videos*.",
        "Damn u found so many channels",
        "Get a novel exotic theme from a foreign culture that you have heard about but have no idea of, get more traffic,more sponsors and more advertising money.",
        "\"Culture\"",
        "It is not just non-Indian women. It is foreigners of all kinds posting videos about India. It is Indians too. It is Indian women married to Indian men who are IPS, IAS, army officers etc who have no quality content, nothing worth watching but is a primary income source for them.\n\nWhy? Indians are huge in number, lazy with an internet. They comment on these videos like simps and go crazy that they are being talked about because of inferiority complex and validation.\n\nThe comments are really cringe.",
        "Who cares let them do there thing",
        "dude, ikr, it's so wholesome. I've seen american-japanese couples doing the same, but people don't see a problem with that. inferiority complex bohot bhad gayi hai desh mein istg",
        "What was your keyword , you got so many channels",
        "There are a billion indian viewers. They're just targeting a large market.",
        "Ig it's coz India is the most populated country and our audience is emotional fool. We feel proud getting validation from foreigners that our country and it's culture is great.",
        "Is she that German female?",
        "What do you mean by ‘absolutely weird’?",
        "Lol its the \"Today I packed in my husband's lunch box.. bhindi ki sabzi, methi parathas which are very good for health, this aam ka achaar, for snack I packed moongfali, and yummy yummy fresh nimbu paani\". These are like women in mid 20s and I'm a fucking legit uncle, and even women my age don't behave like this!!",
        "If it's not harming anyone then how is it a problem?",
        "Yep",
        "No it is not weird. It’s their choice and their way of marketing themselves.",
        "If it suits them and harms no one then there's no reason to make a fuss about it. \nIndian women marrying Indian men are also making similar type videos. Suits them. Harms no one. Nothing to fuss here too. \nThere are many consumers to such content. \nNo hate being spread, no propoganda thrown. A light pastime. \nDon't stress yourself unnecessarily, OP.",
        "Wow we get the point , you didn't have to create a whole godamn archive , you're just promoting them now .\n\nAnd yes it's not just wedding stuff look at the reaction channels and foreign vloggers sugar coating and giving that sweet validation it is",
        "OP posted the same thing on ABCD subreddit and got called out. Why do you care what they do?",
        "my man did his research 💀",
        "It's cause we are a huge population and most of them get boners for white people validating anything Indian. \nI'm increasingly seeing white people just so much as \"mentioning\" india or anything Indian and their views spike like crazy. Don't even get me started on the hard simping in comments. \n\nI mean I think it's amazing that people are appreciating each others' cultures. But let's be real here. 80% of them are just in it for the money that comes with crazy views.",
        "Not sure that's accurate observation. I'm from Kerala and we have hundreds of travel vloggers who go all around the world. Matter of fact, recently a malayali travel vlogger was even in Sudan when the war broke out.",
        "I want validation about my culture from white people. /s",
        "I don’t see what’s wrong about it. Indian culture is difficult to assimilate into as an outsider, and these women just create content based on their experiences, showing a different lifestyle. It’s quite normal. I think it’s awesome that they accept it so well.",
        ">i am gonna link a few here\n\nBro pasted the entire channel list of YouTube. XD",
        "The world is a pretty big place you never known what people will like, plus they are just living life, not bothering anyone, let them enjoy and have fun.",
        "😅😂",
        "India is the world's biggest market and it makes sense for people to take advantage of it",
        "It's vice versa also. Indians also do the same when they stay in other countries or get married to someone from other countries.",
        "Sudhir will make a show on culture zihad, u gave him an idea😅",
        "pandering to indian audience is a good strategy... 1.5 billion people generate a lot of clicks and ad revenue...",
        "Lol that fuckinlegituncle",
        "This is some research lol",
        "My favorite Youtuber is a Non Indian guy married to a Indian Girl and made his whole Social life not only the culture of his wife but of entire subcontinent. And his videos are wholesome.",
        "We are suckers and watch the videos and them views. If China had an open internet, they'd be reviewing Chinese television.",
        "It’s not like they are getting into a fake relationship just to make a YouTube career. Fact is there are so many Indian immigrants in western countries so it’s only natural that a lot of them are now engaged with foreign partners.",
        "Karl rock?",
        "It's not just validation from white people, it's validation from any foreigner. We are extremely insecure about our culture and we love praise. There are a multitude of low effort reaction videos by foreigners on random Indian things which get lakhs and lakhs of views. India is a goldmine for views.",
        ">I am gonna link a few here.\n\nLiterally links every channel of genre.",
        ">traditional american lululemon and uggs\n\nLmaoo 😹",
        "There are thousands of Instagram accounts of small underage kids managed by their parents. Kids, who should really be playing in the parks, watching cartoons, do stupid things like any other kid would while normally growing up. \n\nThe bad part about this, parents putting up “DM for collaboration” in bio and invading their children’s privacy online where creepy individuals gets to see sensitive moments being put online for attention and views publicly.\n\nThis is a sad beginning of a generation growing up on reels, lacking important human experiences as an innocent future of tomorrow",
        "Most indians would go bonker if they have to choose between : \n\nSex\n\nFood\n\nWhite skin praising us \n\nOp, As you have worked hard to gather data, can you tell me how many of those girls are non white?",
        "I mean we are 1.5 billion here. And patriotism, sentiments about indian culture and respect for Indian traditions are our weak spots. So it is not shocking that people are taking advantage of this to make money.\n\nThere is an Instagram influencer who is dating a Korean guy. She has made her whole influencer career around \"dating a Korean\"  she literally posts thirst trap pictures of her bf and the Indian kpop fans are drooling in her comment section. So it works both ways actually.",
        "Too many Indians with access to the internet, that's why.",
        "You cracked the puzzle!\n\nEvery \"influencer\" wants their content (travel or culture related) to include content from China and India.  It gets the clicks and views that no other group can provide.\n\nSince the influencer accounts are based outside of India, presumably, their remuneration package from YouTube is far more lucrative than if it were a China/ India based account.",
        "quite a few, check from the bottom of the list",
        "\n\nEvery \"influencer\" wants their content (travel or culture rekated) to include content from China and India.  It gets the clicks and views that no other group can provide.\n\nSince the influencer accounts are based outside of India, presumably, their remuneration package from YouTube is far more lucrative than if it were a China/ India based account.",
        "Its a career option",
        "It would be interesting to see what happens if the roles are reversed and Indian woman / man marrying non Indian and then they make their insta about foreign culture or country. \n\nWould they get shamed for not promoting their own culture or turning on their culture. \n\nWould the man get it rough or the woman? It would be very interesting to observe the same.",
        "It's the same with many Indian women married to Non- Indians especially Koreans and have their whole channel dedicated to Korean culture. It's more like obsession at this point.",
        "Its easy to get views and followers. We have around 600m smartphone users. Even if 1 % people crave validation from foreigners, that makes 6m followers. And in reality that number is higher than 1%",
        "nah i tried to find, there were at most 5-6 channels that i could get, i got more korean woman indian man channels which  is surprising.",
        "YouTube and Instagram",
        "Tbh, a video of an actual Indian resident going to Arby’s would do well in India. Maybe if they just stay off the beef, lol",
        "yup",
        "Search engine and algorithms reward youtubers if they target a huge number of people.\n\nThe word \"Indian\" and \"India\" are buzzwords which make sure that such videos are shown in your feed as per your location. This makes an Indian a target audience and we Indians represent almost 17% of world population. So it makes sense to make videos on anything that is Indian.",
        "What difference does it make to your life? People have terminally online syndrome these days.",
        "I am surprised that's the only number of channels you could find.....I have come across at least 20 of those channels on insta. Don't ask me to link, i don't care to follow or save their channels. Also i am not trying to compare both of these, so numbers don't matter to me. To me both are absolutely ridiculous obsession.\n\nEdit: the 20 i mentioned were married ones 💀",
        "Indians patriotism can easily be taken advantage of and used to generate revenue. We feel validated and boastful when foreigners adapt our culture and think we are great but in reality we are being used by them to get money..",
        "Bro, the weirdest shit is you cataloging all these youtubers. wtf.",
        "yeah i know what you are saying, i tried to find only married ones ,thats why ig",
        "Foreigners making money by showing India to Indians who’ve lived here all their life 😂 They cracked the code and it’s us who are the fools.",
        "They make millions just by recording themselves taking shit on toilet. Why wouldn't they do it ? It made them millionares just by eating, sleeping,  shitting and pissing. No hard work , nothing no 9 to 5. No balance sheets, no forecast model , no investment just raining millions just because we have lot of pervs in India who like to hila watching those cringe foreign wives.",
        "They just want to get validation. Of course, there are millions in the audience who will lap up this.",
        "India is the biggest market for social media. Every business wants to exploit market. This is nothing new.",
        "And millions out of them who are obssessed with Goris!",
        "> i am gonna link a few here\n\nWow. You really don't know the meaning of few.",
        "That's not a few.",
        "What unemployment and cheap internet does to 40% of the mfs in India",
        "I mean that's just giving what sells. Everyone could use a little fame and money. Youtube views give them both.",
        "She knows many Indian guys like White girls. They’re just using the demand and making cash",
        "1. India is one of YouTube's largest markets. So you can see people injecting Indian elements (like Indian celeb pics in body building videos)even into otherwise regular content. So it's not a surprise that you have videos specifically targeting Indian audiences.\n2. Indians love being validated by whites.\n\nThese 2 imho guarantee a fair view count/subscribership.",
        "India represents the single largest market in terms of viewership numbers for YouTube, IG reels and FB shorts. It’s an easy, cheap money making tactic",
        "Not marketing anything, “selling” validation",
        "Me reading this post while travelling with my non Indian girlfriend and making YouTube videos 😭😭😭",
        "***laughs in Jaby Koay***",
        "White supremacy I'd guess",
        "My comment on same a few days back \nhttps://www.reddit.com/r/india/comments/13z4hod/how_to_earn_in_india_if_you_are_foreigner/jmpvq3w?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
        "I remember this! He was downvoted heavily too I believe. They are getting called out here again",
        "Seems like some of you guys have too much time. Having issues with almost everything harmless that goes around.\n\nSocial media is business. You make videos which gets you the most views. We are over a billion people which brings them the required views.",
        "A white or a foreigner doing anything remotely related to india makes u a fortune on social media.",
        "Thanks for increasing their subscribers",
        "Nope \n\nWe have all kinds of genres and considering how much we Indians love it when some foreigner shows love for our country or culture it's not at all weird or surprising for me",
        "Meanwhile Indian men watching this be like: these foreign women are good and sanskaari why can't indian women be like this 😭",
        "We Indians crave validation from foreigners, especially whites. We have a vast jobless population and world's cheapest data. So for any content creator, India is a huge market for garnering views. Hence content by foreigners on Indian topics is a major genre. It includes white women married to Indians, foreigners reacting to all things Indian - dance, music, actors, food, movies, places, economy, military, and everything under the Sun.",
        "You have an option to just not watch them? Are they forcing you to watch their content? There are youtube channels available for every weird kink in the world you can imagine. For eg. \nhttps://youtu.be/dES4baX808Q\n\nLinking their channels here because you hate their content will definitely bring unnecessary hate on their channels. Just not cool dude.",
        "I agree. They have found their markets.",
        "Not an Indian but to be fair, it’s not just Indians dealing with these cringey shit, it’s also a lot of other ethnic groups, my country including, coming from a small country in Africa and ppl are absolutely obsessed with us, they review our music, react to our food and our women’s looks. I guess nothing can be done because the internet is an open domain and any idiot can target any group of ppl for whatever reason, mainly for marketing.",
        "Game is the game brother, in this age of earning money via social media, it's upto the person what they do and we are free to follow or ignore based on our preferences. I understood long time back that the things I've considered as crass/cringey had huge following and the niche that interested me were weird for many.\n\nSimply put, it's a free country/world. As long as what they are doing is legal and somewhat ethical, it should be fine.",
        "There is a quora writer who married a guy from Bihar and made her day job to bs about day to day life.\n\nIirc, her name is Samantha",
        "Aur kahan milega itna content.\n\n~ Kunal Kamra",
        "As cringy they are , you are worse . Also some of the ones you mentioned are basic travel vlogs . There are a good amount of channels about foreigners in Japan , Korea and germany and what not. Not sure what's your problem.",
        "That's the worst part. And those- see foreigners are accepting our dharma so why are Indians gravitating towards SHAMELESS foreign culture. So brain dead of these idiots",
        "Have you ever seen a teenager moving abroad for 'studies' fir wo bhi hamara kahan rahta hai?",
        "I think that's just weird.",
        "Their channel. More subscribers and views means more revenue from YouTube ads",
        "Don't forget all the Royal Enfield \"review\" videos of the non-Indians.",
        "The population. \n\nT-Series has suggest subscriber base because our population is high and T-series is a well known well established brand. \n\nA brand of similar stature in small country like Uk would not have that kind of subscriber base because the country’s population is low and hence people who know the brand and relate to it are low. \n\nIndian population is so high, the number of YouTube views generated would be very high as well. So content on Indian culture works. These might also be people who were already married but now that this genre is rising they started making content out of it.",
        "WTF is that!!??\n\nAnyway agree with your point.",
        "bruh make some orginal posts , this post is ditto copy from a identical posts from abcdesis  sub",
        "It would be particularly weird if the HUSBAND isn't really into Indian culture, himself, but white wife is.  Because it implies that he's sort of just this prop in his wife's fantasy.\n\nThough a lot of the channels you linked seem to go both ways (boyfriend/husband and his experiences with his wife's western culture.)",
        "I think you posted this same damn post in r/ABCDesis last week and got flamed for being weirdly obsessed with indian people marrying non indians. So you must have decided to post it here expecting a different response. Lmao. \n\n\nLeave people alone.",
        "It's cringe, but it's a hustle, everyone out here trying to make money. Their own countries social media channelts are probably overcrowded at this point, and they're carving out a niche of their own. What that says about Indians, and  our obsession with validation from white people is something else.",
        "I don't think it's that bad, if she's obsessed with Indian culture it's alright everyone has their preferences, what's odd here is the scale at which she's doing it on social media.",
        "It's kinda ironic that OP has marketed all these channels on a subreddit of over 1m Indians :D",
        "as others have mentioned, it gets clicks from thirsty Indians and from clueless curious westerners..you can give a culture clash twist to it..it gets the clicks and so the money...nowadays everything needs to be monetized and used for entertainment. We had major drug tragedy here and now we have an \"exciting\" fast paced show on netflix making light of all these people who died.....stop paying attention these things and focus on your own self improvement is the only way forward.",
        "Generic influencer/vlogger revenue model. For example, \"Our Stupid Reactions\" on YT grew to have an entire team of Indians working under them to manage review recommendations and content. Their income sources were YT and Patreon, afaik. \n\n\nThey had also interviewed Pankaj Tripathi and AR Rehman the last I watched of those two.",
        "This happens with many other nationalities and cultures as well. This gives them double target audience. Western people who are interested in other cultures and people from other cultures who like to watch foreigners explore their culture.\n\nWith robots & A.I. taking away many jobs people will turn to this kind of gigs to earn their livelihood.",
        "Somehow I feel the viewer traffic on that content will be driven by Indians too. 🙉🤦🏻‍♀️",
        "Hah, my first thought was one sponsored by Arby's Roast beef sandwich deal. Like a shock video gimmick. Be like an American posting videos of chowing down on Bosintang.",
        "You do understand that you are doing marketing for this. We understand it too.",
        "Well if out of those 1 m there are people who will get hooked on these channels let them be. Maybe they deserve that.",
        "So I actually went through some of the links and was rather surprised to find so many channels with the same concept....\n\nKudos to the OP for the links !!!\n\nAlthough I must say... I went through 10-15 links ... And I found it to be cringe. Sort of made me sick to my stomach. Literally!\n\nThe video titles specially -\n\nGoing out to dinner with my 'American' wife\nGoing to meet with X with my 'Italian' wife\nHow I met my 'Turkish' wife\n\n(FFS)\n\nAlso gotta realize with India's social media population, India becomes an easy soft target to gain more followers/subscribers. And the fascination to gain immediate approval by talking/speaking to a 'white' foreigner/expat never dies.",
        "Indian's have a weird fetish of seeking validation from non Indians especially fair skinned non Indian.",
        "Some take this one step forward beyond social media. Use it as an opportunity for proxy entry into Indian politics - la  Kirandeep Kaur ('Waris Punjab De')",
        "Nothing weird. Yall are just nosy and think ur entitled to have a say cause it's \"our culture\"\n\nNow let me see u commenting on interracial couples where the Indian completely adopts American culture. \n\nObsession with Western culture is so internalised it comes out in many ways",
        "An average Indian is obsessed with White people. And a lot of them have figured it out. A white person doing anything basic pertaining to India, Indians, Bollywood etc will get million views very easily.",
        "Not really. I know Indians who are married to foreigners and it ain't like this.  \n\nThis is happening solely because of the majority of Indians feeling good about getting attention and validation from foreigners and they are monetizing on the same.  \n\nJust go see the Jaby Koay channel. It works on this psychology. They started out reviewing content/movies from everywhere but became completely Bollywood focused after the attention and positive responses they started receiving from Indian people. Not saying that their content is low effort or that they don't respect our country, because they do and they've actually been putting a lot of effort into their content, given the large audience their channel is garnering. But the psychology behind it all is cringe.",
        "Themselves lol",
        "It's her choice. Why does it bother you?!",
        "Thanks to our infinite fucking abilities, we are a country with hundreds of millions of internet users. Our obsession with fair skin, makes us like anything that supports it. These YouTubers are earning solid money through their content. They aren’t harming anyone. They’re just making hay while the sun still shines.",
        ">Not really. I know Indians who are married to foreigners and it ain't like this\n\nWell on the contrary, I know Indians who are married to foreigners and are like this. Well I guess we find all types of people. \n\n>Just go see the Jaby Koay channel. It works on this psychology. They started out reviewing content/movies from everywhere but became very focused on Bollywood after the attention and positive responses they started receiving from Indian people. Not saying that their content is low effort or that they don't respect our country, because they do and they've actually been putting a lot of effort into their content, given the large audience their channel is garnering. But the psychology behind it all is cringe.\n\nI'm not supporting Indians/Foreigners here. I'm just saying things can be either way. 🙂",
        "People sell the most what people buy the most, it is as simple as that",
        "holy shit. someone fell really deep into that rabbit hole haha",
        "The post felt like - WHy sHOuld thEY prOMote InDIa?",
        "Pretty understandable, if they are into \"ancient spirituality\" india is the best. Look at for example gwyneth paltrow, she is selling energy rocks and shit. Much better then to join an allready existing culture than trying to invent your own.",
        "\n\nNo it's not weird. There are many foreigners who really look up to India - many foreigners are actually have more pride in India's culture and history than some indians themselves.\n\nSo maybe it's that interest that let them met an Indian guy, and it's that interest and enthusiasm that make them shoot videos about \"his culture\".",
        "Tbh as an American with boring taste in videos, I would probably watch all of these if they showed up on my YouTube recommended",
        "indians should stop giving these people free views. this will never stop so neither will the 'make money quick' schemes.",
        "I haven't seen this longing for external validation from Chinese people compared to Indians nor the infatuation with the lighter skin tone(you could credit that to them having a large strata of lighter skin tone populace). So even if Chinese had open internet, I don't see how foreigners could gauge their attention by reviewing their culture/media.",
        "I watch Karolina Goswami (India in details) and it is good. She provides sources to her claims etc and generally makes good content. Her personal life seems good to. She is married to Anurag for 7 years and also has kids with him.\n\nI don't think its weird. Yes, you should remember your roots, but there is nothing wrong with appreciating and adopting some of the cultures of your spouse. A small scale version of this is females migrating from south india to north india after marrying a north indian. Yes she should keep her south indian heritage in mind but there is nothing wrong with appreciating and participating in north indian culture.\n\nI don't think they married just for starting a youtube channel. They might have married for other reasons such as love etc. And now they have this opportunity in front of them. Indian people love seeking validation from western people. And these youtubers could tap into that to reach more audience and make more money. But there is nothing sinister about what they are doing. They are seeing an opportunity and taking full advantage of it.\n\nActually saying that this is weird could be construed as racism. Because you are insulting immigrants on the basis of their ethnicity. That is the definition of racism.",
        "Yet to be classified mental disorder ?",
        "The other way around as well. Some men also married Indian women and moved to India.",
        "We like it when white people validate us",
        "That's not true actually... They have the same ingrained biases and insecurities as we do. Their aspirations and fallacies are the same as us - in the sense that they're defined by the western gaze. It just doesn't appear out in the open because of language and communication barriers. However they don't have the same level of self hate as much as South Asians.",
        "> I thought it was just a few interested in Indian culture\n\nIt's not that weird or uncommon in many western countries. Yes, the channels and \"influencers\" are probably cringey af. There's too many listed here to even begin to look at and not interested in these people anyway. \nWhere I live in the US we have a large amount of Indian immigrants ( immigrants in general, as most places in US), Indian communities, grocery, shopping, restaurants. Interracial marriage is not weird or uncommon and both cultures are usually embraced in a relationship, esp when one is living in a country probably very far away. \n\nSource: am non Indian married to an Indian",
        "Maybe we’re just a little curious as to how non-Indians would view indian entertainment.",
        "Its modern day colonization. Same way chai latte, turmeric milk, yoga, chakras etc have become mainstream in the west. Its seriously disgusting.",
        "Lululemon is Canadian, UGG is Aussie lol",
        "You married an Indian, you knew what you were getting into. Period",
        "Haha😂",
        "Chinese and no infatuation with being light skin? 😂😂, now ask Chinese about this, all Asian countries are the same, only if you could see their weibo(social media over there).",
        "I don't see why this is a problem or even a talking point that's worthy of a post? \n\n>I thought maybe it is because of white skin obsession among indians.\n\nWhy do you immediately think of an inferiority complex among other Indians when you see such videos??? Weird",
        "Bruh, there is a good chunk of Chinese and Koreans population who are obsessed with being white and pale af. [Fair skin has been an historically obsession in east Asia.](https://nextshark.com/east-asian-pale-skin-beauty-standard)",
        "Money 💰",
        "China is one of the biggest markets for skin lightening. Infact not just China, but the entirely of East Asia. The rest of Asia (south asia, south east asia and middle east) comes a close, very close second.\n\nSimilar is the craze for western validation. Again neither of this info was available to you due to a.lack of open internet in china and b. you (assuming) not being a part of relevant online communities (like kpop, cdramas, kdramas, asian makeup trends, weibo and weverse etc).",
        "Not judging or anything, but I'm impressed OP spent so much time finding this many channels and linking it here, and OP doesn't even like the genre or the videos.",
        "Social media engines refine and present content according to your own interests based on your clicks. There is no genre in youtube it is just a collection of what people clicked next.",
        "You have white families reacting to Bollywood movies, Americans reacting to Indian music etc etc. They are just increasing their audiences.\n\nYou name a category and there's probably a few content creators catering to that subject.",
        "I'm just here for the vlog where it says she was a spy for her country and used me,lol.",
        "Okay, apart from the marketing reasons for targeting overpopulated Indian viewers another reason can be that foreign women appreciate Indian men, unlike privileged desi girls. Just saying.",
        "What’s so weird about this.. the weird thing is you posting this lol.. it’s definitely a new phenomena happening in india but an obvious one since there’s such an influx of singleEuropean women coming to India to live.",
        "I’ve seen this trend with Indian-Korean couples as well",
        "Average right-winger",
        "Gotta say I just got time to check the 1st channel, but respect to her Kannda, its really good. Doesnt look like a cash grab at all, looks like someone who genuinely integrates.",
        "Gotta say I just got time to check the 1st channel, but respect to her Kannda, its really good. Doesnt look like a cash grab at all, looks like someone who genuinely integrates.",
        "Gotta say I just got time to check the 1st channel, but respect to her Kannda, its really good. Doesnt look like a cash grab at all, looks like someone who genuinely integrates.",
        "Tumko dikkat kya hai bhai. Acchi baat hai - people are spreading our culture",
        "Reading this as a non Indian who stumbled onto this  by accident is so funny because it's the exact same that  that these man  say here as well .",
        "It's the same in germany. These im from XXX living in germany kind of videos are really popular",
        "You mean the passport bros who go to poorer countries looking for traditional, submissive women, because they hate the 'wayward modern women' of the west?",
        "Samantha is a writer who married a Tamizhan. She published 2 books.\n\nJessica is a Podcaster who married a Bihari and creates hindi learning content.",
        "I only clicked on the first link, and I gotta say that woman is doing the best job speaking Kannada that I’ve ever seen any white person pull off. Pretty amazing stuff",
        "Their views have declined sharply over the past year or so and that makes me unreasonably happy. Hate these \"reviewers\" selling validation.",
        "Its just business to market to other than indian locals",
        "As an Indian married to a non-indian in this thread, finding out that my wife can be my sugar mommy: https://media.tenor.com/Lva6Gfs-lsMAAAAd/i-am-rich.gif",
        "Yeah, kinda but most of them are in their 50s",
        "Lol Not just YouTube, there’s a next level of cringe that happens in Quora where a white woman called Samantha has married some Tamil dude.\n\nYou have every mother fuckin Indian irrespective of gender, age or state having a group orgy for whatever the fuck she does, ordinary things like wearing a saree or eating a ladoo gets hundreds and thousands of upvotes. \n\nAre Indians so pathetic that they want validation from every white person?",
        "You were the target audience cos you seem very interested. I remember in 2012 there was a channel (Ray William Johnson) reviewing all kinds of weird youtube channels. One of them was a guy just farting apparently, and it seemed to have audience. So there is a crowd for everything.",
        "The content creators are making money since there's a lot of people watching that shit - Capitalism at its finest.\n\nThe only thing weird in this is that you do not seem to know how money works",
        "Discovery, tlc, nat geo, fox etc.  have been doing this shit for years",
        "Sab views k bhuke hai. Gorey log target indians to get views. India, indian culture, indian food, gorey ladki wearing saree mention kiya toh kaam easy hota hai unka.",
        "Men manipulating their way out of holding themselves accountable goes beyond borders.",
        "Wahi to problem hai, bhai sahab ko.",
        "Mithilesh Backpacker randibaaz hai.",
        "Feeds the \"Our culture is best\" philosophy",
        "It's unoriginal and very cookie cutter.",
        "![gif](giphy|vHolffNR6Oi6UpHMOa|downsized)",
        "Well most are lonely  guys in their 50s, who have married some divorced  woman with children from another country(mostly Thailand), I don't really believe that the wife's are the victim here.",
        "Holy shit dude the second one just straight up seem like a propoganda channel , with psudo history damn it's got over a million subs tf",
        "Also thinking about the guy she married…kya kismat hai re teri",
        "I'm American and this comment made me laugh really hard, especially the Walmart part.",
        "Anything india gets insane views especially when it involves a white person.",
        "I rather watch American doing American things. Like Red necks shooting guns in their backyard aur some kid shooting others. Jokes aside, I usually watch their tutorials on tools and stuff. And then watch the same thing by an Indian cause he would have found a much simpler and easier way of the same.",
        "Regardless, the power dynamic's skewed towards one person more.",
        "Indian love validation from foreigners. Its the same with koreans now. Indians have started loving validation from them as well. So now everyone is doing such content.",
        "It's really weird and awful and I can't decide whether it's just cynical pandering or brainwashing.\n\n(I am a foreigner living in India, BTW. And I love it here but I can honestly say I've never posted a cringey YouTube video about \"my experience of India\" \":) ).",
        "Indians are \n\n#OBSESSED \n\nWith foreigners simping over \" Indian \" culture. \n\nNot all 1.x billion of us ofcourse but a LARGE number of us.",
        "I vote the: “OP is the women in the first link” conspiracy theory.",
        "Hot girls tho. Ngl",
        "Real baat pe right-winger bol dunga, r/india hi h cool lagunga",
        "Yeah, in the wife's directon. \n\nHe makes  the money, but usually, these women are married(so 50% of the assets are his and in most cases, has to pay alimonies).\nAlso, and usally these kind of women aren't that kind of shy reserved type of person. They know what they want and how to get it.",
        "Idk man I think this is just a white woman thing. Like, they’ll marry someone of colour and suddenly that’s their whole identity now",
        "So what. If they showed no interest there would be complaints. Now too much interest? \n\nI don’t see a downside",
        "Bollywood has been hiring white chicks from eastern europe for the back of their item songs for a while now. It happens in every country with a more homogeonous population. These people are just doing the same and following the simp money that wants to see hot foreign chicks.",
        "Few years ago, when  vlogs about personal lives  were just new , it didn't make sense to me why people want to follow someone else's life. Literally , they were like about eating breakfast together kind of stuff , playing with kids ....Like daily routine stuff. This family is all white and the followers were also white. I asked a fan of that show and he mentioned that his family was dysfunctional and never knew what it was like to have normal life.\n\nI think most of these people have personal tragedies and these shows give them emotional satisfaction.",
        "china, japan and korea's obsession with light skin is the only one in the entire world that is greater than india's. it's so bad that most people don't even know that these countries ahve people with medium/tan skin.",
        "they are also in a foreign environment where they don't usually speak the language and have trouble communicating with people outside of their husband, completely dependent on them for money, and out of their comfort zone/familiar environment. totally not a perfect recipe for abuse",
        "Curry and kimchi something?",
        "Idk. I've heard plenty of horror stories involving abuse. These men will try to have the upper hand at any cost. It makes sense that these women will get vicious too. Anyway, the point is the men sought these women out because they know their living conditions aren't the best. This is in itself kind of self-serving and dishonest. It's also hard to blame these women for trying to survive.",
        "The reason you're saying that because men are more likely to marry a non-Indian person because men are more likely to go abroad for different purposes than a woman. Same way you'll see most Indian people who make content about abroad are mostly men. There's significant imbalance from the start. That's why you see that same imbalance everywhere.",
        "You had so much time to put up this rant and post so many links.",
        "Yes, but another American tradition is not knowing things are not American and claiming them as your own.",
        "Damn, didn't expect germans to be the same. I thought, that's in Europe, why would they need validation? It looks like it's just 'mericans capitalising over any foreign culture.",
        "Wow, that's a lot of channels. Chad Indian guys.",
        "Wow had no idea something like this existed. I'm glad that reddit is pretty much the only social media I'm on. \n\nHow did you even come up with this list? Obsessed maybe? \nLooks like there is an audience for this kind of content if you found so many. Dunno what the rant is about to be honest.",
        "Well, it's nice to hear what other people's  think about us and see how foreigners see germany and it depicts something familiar through a different lens. These kind of things work quite well with audiences. If you then put in some harmless but true  stereotypes, where you can relate to, it makes some pretty good content.",
        "This also works the other way. Indians marrying a foreigner and making their entire social media just around it",
        "But it's not like *all* of them will end up abusing. If a guy with low confidence and a woman who wants to move away can benefit from each other, what's the harm?\n\nThe presumption of every woman as weak and vulnerable is getting old.",
        "I realized how different my yt recommendation changed permanently when I went to US just for a week.",
        "summon indians for easy views",
        "With 7+ billion people in the world, everything is a genre",
        "This is nothing new, [Ananda Coomaraswamy](https://en.m.wikipedia.org/wiki/Ananda_Coomaraswamy) is a famous indologist whose seminal work created the field of Indology. His father was a Sri Lankan Tamil but mother English, although his father died when he was young, it’s his mother in the late 1800’s who introduced Ananda to Indian art and culture which she had to study herself and making him what he later became. \n\nI believe this is a common phenomenon, when a woman marries below her status in their society they give up their previous identity and fully immerse in their spouses identity one reason being they get recognition from the adopted community for it. Sociologists have studied this phenomenon. White women marrying black men, immerse themselves in black culture for example.",
        "Boring taste? You really care about random strangers opinions of what you watch on your free time,bruh?\n\nLmao\n\nwait until this normies op discovers other weird stuff on yt. Like pimple popping asmr.",
        "This should be at top! views is the fire that feeds all.",
        "I agree with you to some extent. But not every case follows this path.",
        "And fuck those reaction channels too...",
        "1.5 ? Dude u living under a rock ? Well i can't blame u really feels like yesterday",
        "I consider my own taste boring lol, not really worried about what others think of it",
        "What changed, if you remember?",
        "My non-desi wife hasn’t ever even tried on a saree and lost access to her Instagram account a couple of years ago. 😂\n\nEven then our pictures and videos were about travel and alpinism. \n\nThere are plenty on the other side of the spectrum but I guess they aren’t the ones making all the noise.",
        "> It is Indian women married to Indian men who are IPS, IAS, army officers etc who have no quality content\n\nWhy specifically IPS, IAS, army officers? It could be anyone right?",
        "Thank you for this. Who cares what people do? Let them live their life and do their thing. \n\nWhat does the OP care what other people do?",
        "Let people do what they want as long as you or anyone else are not affected.\n\nIt's not a hard concept.",
        "They show the government accommodation, government vehicles and share about their life as spouse of the officers. Indians worship central government officers specially these professions.\n\nFor other professions, the person himself/herself makes such office tour videos. \n\nIt is super cringe.",
        "They are all white, pretty women. hm....",
        "It’s a fantasy for many Indian men. I once had a straight friend who explained it to me like ‘it’s like dressing up barbie in our own clothes’ and that was a turn on for him.’ Even among the white girls there is a hierarchy, it’s a certain profile which is blue eyed, blonde haired.",
        "Like OP.  The fck is that research for a useless topic",
        "Bro did his research",
        "God damn, man came with a fuck ton of sources lmao\n\nEdit: I also won’t be surprised if most of them aren’t actually married but have actually just partnered with some Indian dude to create that brand image.",
        "well, it's giving average Indian men hope someday they will also get white women. what could be the any reason for views?",
        "most of them are indians who feel proud that some outsider is obsessing over indian culture and following it to the T, unlike many other local native Indian women who are more liberal and modern :P as simple as that.",
        "well there are people who dont appreciate their dharma. \n\nyou san find the same for women converting to islam. usually called isis brides but in short follow the same trend to change their religion",
        "Absolutely dude! Came across it when I was watching videos on the kerala story",
        "There are lots of Indians, it’s not that hard to find an Indian to marry, again there are lots of Indians, so there are lots of people who will be watching content related to India.",
        "Step 1: praise india and indian culture, if possible speak broken Hindi and wear indian clothes   \nStep 2: wait for the video to go viral   \nStep 3: the hyper nationalists flood the comment section with \"feeling piraud endian armi\" , \"saar endia best saar\"           \nStep 4:.....    \nStep 5: 5X followers in a single day,more likes and comments than you can imagine. **Profit**",
        "This is one of the easiest contents to produce for Youtube, and I've seen similar ones for pretty much any country with a large internet using population.",
        "World Cheapest data??? Must be nice 😭",
        "But don't you agree that it's fun to fantasize",
        "you do realise there are a number of telugu channels which do exactly this.\n\nLike think of the most mundane things in your daily life and they will make a video on it",
        "I'm more impressed by the fact that there used to be interracial marriage so long ago",
        "Thangod and thankyou for saying it it's effin annoying.",
        "It is the perfect recipe for abuse, I totally agree. \n\nBut not everyone will accept the  abuse. There are strong women out there who will not take the abuse. And at least in my experience, the Thai wife's seem to be quite strong and independent.",
        "Can a non Indian woman marry me?\n\nNot racist, just want to help make a ton of money.",
        "Aaj aaram se baith k dekhta mai ye saare videos",
        "This is not unusual and it's not just happening in India. There are so many YouTubers/instagrammers who marry outside their country- to men in Japan, Korea, Thailand....again these are predominantly white women with these accounts who are documenting their lives and their experience with the new culture. As someone mentioned above there are some Indian women making similar content. I've also remember seeing a Vietnamese woman on IG who talks about cultural differences in Germany and her life with her German fiance. \n\n I agree a lot of content creators target an Indian audience because there are so many of us (in addition to the foreigners married to Indians, just look at the number of react to an Indian movie/song videos out there)\n\nThere is so much beauty and diversity in India that does not get talked about in other countries and movies like slumdog millionaire didn't help. Nor do ppl like a white business man I once met who only went to Mumbai for one meeting-literally airport to meeting and back to the airport- and was loudly proclaiming that all there is in India are shacks and slums. \n\nI do think there is a genuine interest in India from other foreigners that these videos feed into. And if it means that a more positive narrative is formed and we get more tourism out of it, I'm ok with it.",
        "I don't think I'd care enough to complain about it.",
        "😂🤣",
        "😂",
        "No need to gatekeep culture. My wife is gori, she loves me and my parents and she embraces our culture.  Some people love sharing their life online cuz people are interested, and alot of Indian men are dirty and like shit like that.",
        "Goris who are literally impressed by India",
        "Thanks for spitting the truth, otherwise people also thought NATU NATU was the best song for the year. It is just population that makes the market and they are capitalizing on it.",
        "I personally find it a bit odd but also cute and wholesome. After all, this kind of thing gets a lot of likes and positive reactions so why would they not do it.",
        "why are you giving these people more attention though",
        "Sanskari Gori Bahu 😂😂😂",
        "Ek foreigner wifey to mai bhy deserve karta hun🙂👉👈",
        "... I now have something to hope for.",
        "His father was one of the few amongst the elite colonially educated people from Colombo, Sri Lanka who married English women.",
        "Did you just copy paste this from the nri sub?",
        "Do you post this every few days?",
        "This is bizness",
        "I find rampant religion hating & shoving one's religion down another's throat also weird, go eat a bag of dicks OP",
        "Is generally watch Cities skylines, succession and Indian geopolitics videos. In the US i got a lot of prank videos, video of people stealing kia and EXPLAING HOW TO STEAL ONE ( why did the algo think im gonna steal a kia?), daily show with trevor.  tons of ben shapiro videos which made interested in US politics and after going down the rabbit hole I found out about Hasan Minhaj . I was in new york and jersey was just stunned that's it the shock was too much. Too big for my brain to comprehend.",
        "Well , I don't mind it .",
        "People need to outrage on everything these days.",
        "I’m white , not in India, and I’m embarrassed. Shes using(appropriating/colonizing) your culture for her benefit. Goes way beyond admiring y’alls culture. Creepy",
        "Multicultural marraiges are just increasing and people are embracing other cultures. \n\nOf course all content creators are going to keep looking for different things to showcase an catch the attention of viewers. I don't think embracing different cultures is so horrible, if anything it's so much better than making content off of your kids or something",
        "I think Latinx could be said to be somewhat into white skin. Meanwhile wyte people buy cream that makes them tan color, including me.",
        "holyshit bro thts lot of research work u hv done here",
        "I wouldn't mind it happening to me.",
        "All thanks to jio, population size and rate of unemployment. And the obsession of indians for validation from the world. \n\nSame thing has happened with vlogging / travel yt channels. Theres now just way too many that put out tonnes of videos centred around India which makes ppl want to watch them. Either they’re curious about what foreigners think of India or again seek validation from them.",
        "OP maybe don’t get so obsessed with this either, otherwise you’re making it all about non-Indian people making their social media presence about indian culture because they married an Indian guy. For some reason women are way more into their social media presence than men…way more. But yeah it is weird, it is mainly because they want attention, that’s it.",
        "How is it weird? Why do you have a problem with this?",
        "Where is Jenniji's husband?",
        "Have you not thought that it is simply interesting to get a perspective on your country from people not born in it? Why is everything about validation?",
        "Indian men are obsessed with non Indian women",
        "I find nothing wrong, it’s a free world, after all.",
        "How about both sides.\n\nTons of Indians interested in seeing an outsider explore some part of their culture...\n\nAnd tons of outsiders interested in seeing someone like them exploring some part of that massive Indian culture.\n\nIt seems pretty constructive at helping foster understanding.",
        "If she looks like that she can keep me in a fuckin cage lmao",
        "Everyone has a different experience sherlock. Just because you don't agree, doesn't make it any less",
        "Also don't try to read any comment which starts with \"as an Indian\". You'll get second hand embarrassment.",
        "Validation obsession. Indians love watching and commenting on videos that speak highly of India.",
        "You posted this on r/ABCDesis too right. Leave people tf alone",
        "No. I don't think so at all. Indian women with non Indian guys do it too.",
        "As someone with parents from 2 different countries and I grew up in 2 different countries I wish there was more mixing/blending of cultures (with nuance and avoiding religion) but the topic is too charged for me to talk to some people about it.\n\nIt's so cringy to me when people who haven't experienced much racism/ethnicity/culture stuff get shut down the people who've experienced a lifetime of it.",
        "Imagine an Indian woman married to a foreigners creating this type of content .what would be ur reaction?",
        "Some of her content is actually weird and based on \"each and everything in India is the great\"",
        "Criticism and appreciation are both important.",
        "It's nothing weird. This happens in all the cross mixed cultures. You just have to search and watch certain types of videos and algorithm will do it's things.\n\nMay it be East Asia, Or India or some other culture. \n\nIt's just happens to be that India is the most populous country. The people you found are few hundred, India has 1.4 Billion people. What's weird?\n\nIf you think this is weird then you haven't seen foreign channels promoting other culture.",
        "Why are you bothered?",
        "As an interracial person who was raised in both countries, I feel annoyed about this post.\n\n\nWhy do a lot of white people seem to assume the worst when other white people talk about different cultures?  I think they're missing the point.\n\n\nI'd rather people empathize with my experience rather than focusing their anger on white people and sprinkling a bit of pity on me.",
        "You don't want to know what Americans thinks about India..",
        "Great, now I not only have to worry if she is golddigger but also aspirant vlogger who wants to make a career out of me",
        "Great, now I not only have to worry if she is golddigger but also aspirant vlogger who wants to make a career out of me.",
        "the average Indian is obsessed with the white person's validation, that much is obvious\n\nit's a gullible market that's easy to exploit, no wonder this is so prolific",
        "XD.. You were born in the 90's, weren't you?",
        "I would want the person I married to be super into my culture.  It would be nice if my friends and neighbors were too because it'd probably help them understand me better so I'd feel a bit less isolated because of my ethnicity/culture being different from theirs.\n\n\nWho wouldn't want to be invited to neighborhood cookouts where they have food from your culture too?\n\n\nJust go about it with nuance in mind.",
        "Who the fuck wants to learn about their white culture?",
        "I read only one line from her and knew it waste of time to check her.\n\nShe said\"people from Indian slums are also happy\". \n\n\nThat's idiotic\n\n\nMy best friend is married to an Australian but doesn't pretend to be any different than she has been. Her husband also likes Indian culture but doesn't make it look fake. \n\nI m friends with an American family who is proud of their culture but also appreciates Indian culture. They don't pretend that their previous life was useless. They consider my conversation with them as an addition to their knowledge.\n\nEven if talk about me. I m from punjab living in Mumbai. It doesn't mean I have forgotton Punjab.",
        "I read only one line from her and knew it waste of time to check her.\n\nShe said\"people from Indian slums are also happy\". \n\n\nThat's idiotic\n\n\nMy best friend is married to an Australian but doesn't pretend to be any different than she has been. Her husband also likes Indian culture but doesn't make it look fake. \n\nI m friends with an American family who is proud of their culture but also appreciates Indian culture. They don't pretend that their previous life was useless. They consider my conversation with them as an addition to their knowledge.\n\nEven if talk about me. I m from punjab living in Mumbai. It doesn't mean I have forgotton Punjab.",
        "One gets the green card and the other gets fame and money! Win-win!",
        "So, are you white?  I'm not and I wish there was more mixing of cultures out there.\n\n\nIn my experience, white people seem more comfortable pointing out what other white people did \"wrong\" rather than having a conversation about the non-white person's experience.  It's like having an ambulance go to the site of an accident to reprimand the un-hurt drunk driver instead of helping the injured car crash victim.",
        "So, are you white?  I'm not and I wish there was more mixing of cultures out there.\n\n\nIn my experience, white people seem more comfortable pointing out what other white people did \"wrong\" rather than having a conversation about the non-white person's experience.  It's like having an ambulance go to the site of an accident to reprimand the un-hurt drunk driver instead of helping the injured car crash victim.",
        "i dont remember the name but there is a subreddit where people post  for links of categories like this :P",
        "There's difference between wanting people you love/well wishers to know about your partner's culture and massively advertising to the whole world every damn thing. Absolutely be super into your partner's culture but i most definitely would be weirded out when it becomes a whole damn business and obsession. An obsession which doesn't look positively but more negatively because of the way it's been used. But you do you 👍✌🏻",
        "Not the worst thing in the world. Let them do their own thing.",
        "reason : population and clickbaits :P",
        "First of all, western culture is not as rigid as Indian culture. And secondly, why would I care? As long as no side is being insulted it’s fine",
        "Nothing different?I too would be curious what different cultures are like. Not a big deal. I do not get offended by others sharing their experiences",
        "I do not want to change your mind, I want to say my piece.\n\n\nI'm multiracial.  It pains me to not have blended cultures more than it does when people accidentally do something offensive.\n\n\nI live in a really white area.  Yes, it might be weird if a white person made it a business but I don't think that those things are usually from a bad place and I think it's generally harmless.  We don't even have Indian restaurants or Asian markets within an hour drive of where I live.\n\n\nLike, having non white people in movies.  Sure, it can be seen as a cash grab, but for someone who isn't white it can be amazing to see people who look like you on the big screen.",
        "Some PPL geninunly like Indian culture and post abt it , the rest know that if you do anything related to India and upload it Indians will come rushing, PPL from different nationalities from Japan to US are reaching to India and Indians are flooding them with views , likes and subscriptons 😂🤦‍♂️🥲",
        "I'm missing out on a money making market obviously 💰😦",
        "*reacting",
        "I think India in details is a legit YouTube channel that Carolina Goswami has been running since quite few years even before her marriage...",
        "Why is this even a topic? I honestly feel you are too worried about Indian men marrying non Indian women",
        "Is that a problem?",
        "Bro **checked YouTube** indeed.",
        "I think saying that they make their whole social media life about his culture is not correct. Just to give you an example: you linked \"Let's Meet Abroad\" - yes, they made videos about their wedding in India, but since then they have been traveling the world and vlogging about that.\nOr \"Indian in China\" is literally about an Indian guy in China. \n\nI think what all these people have in common is that they like sharing cultures, learning more about other cultures, and they just have fun vlogging their life. There's nothing wrong with that.",
        "I think it's weird. My ex-husband is Indian. I made it a point to try to understand and eventually appreciate his culture, simply because I loved him. It did not become my world but he did. ❤️ 🥺\n\nregardless it's obvious why she's doing it 😒",
        "Absolutely nothing new; people often love with their partner's culture.",
        "There's plenty more exotic ones. I recall a couple of them with an Italian guy and a Greek guy.",
        "As an Indian man who has lived abroad for 15 years now, I can tell you there are lots of myths among Western women about how Indian marriages and families are oppressive. If these vids help bust those myths, that's a good thing, even if it's done for marketing and clout.  \n\n Maybe it helps other non Indian  women decide whether they'll have a good cultural fit if they dated or married Indian men. \n\nI don't see what's wrong with this, unless there's someone's actively spreading misinformation.",
        "This is standard in pretty much every country lol. People everywhere are fascinated by “exotic” things, people or opinions so when they see a foreigner(aka exotic person) react to local traditions and practices from an exotic perspective, they’re just kind of drawn to that. It isn’t just an Indian thing like people think..",
        "I think for Indians anything western is aspirational. Desiring White girls is just an extension of that. A white girl who is obsessed with India is in turn a validation of “India shining” theme. Who doesn’t like to be feted?",
        "Mylovefromkorea",
        "That's a win win if you ask me.",
        "Entertainment is a way to escape the mundaneness of our daily lives. A gateway to a fantasy. What's it matter where it comes from, as long as it follows an acceptable level of moral code.",
        ">Thousands and thousands of channels of a non indian woman married to an indian guy and their channel/insta is all about his culture.\n\nMe reading the start of this post - Fuck off and stop exaggerating. \n\nLooking at the multiple links at end: Not that I'm going to check, but I'm giving you the benefit of doubt.",
        "wow you ve done some research lol",
        "Some people will consider it an insult. But both sides exist \n\nI have seen Two cases in my life. \n\nMy best friend married to a white man. I never saw her that happy when she was getting married. I was against this marriage but i chsnged my mind when i saw her happy. She is more comfortable there. She likes western culture and more free there. But she hasn't forsaken India in her\n\nSecond case is a white girl from USa . She is like a younger sister to me. She has no specific liking for Indian culture. But she loves specific parts. She wishes me Rakhi every year. \n\n\nI consider these cases to real appreciation because they cone without forgetting their own\n..",
        "A lot of people will get offended",
        "Why are you so obsessed with this OP? \n\nYou made the exact same post in /r/ABCDesis a few days ago. It seems a bit unhinged.",
        "i think he used chat gpt",
        "These are white monkey jobs. They are very common in china as well we are not unique in this regard.",
        "India is viewed as a poor & cultural nation in western world, you see many of them only visit poor/slum areas do wierd things which average Indian wouldn't do. It's all just to showcase their peers back in their home country & boost their ego.",
        "Bro I watched that video bro it was fire! Don't insult the bhindi ki sabzi and methi parathas it reminds me of home.",
        "😂😂😂",
        "I think he wanted to make a point which he very well made by providing this humoungous list of creators.",
        "I think that's the new propoganda technique \n\" If she's white \n    She's right 😏 \" u know .\n\n( Ps : not tryna be racist towards white ppl I'm pale asf too so u know can't be racist /s)",
        "nice\n\nthen what do you think about Indian women marrying Korean guys and doing the same? :)",
        "Got laughed out of r/ABCDesis for posting this exact same post.\n\nhttps://np.reddit.com/r/ABCDesis/comments/13xdzkm/non_indian_women_mrrying_indian_guy_and_making/",
        "I'd say anything white is aspirational.",
        "Not sure, but who is downvoting your comment?",
        "Not just movies but food too and then in the comments you'll see all kind of validations we seek from foreigners.",
        "Non Indians marrying indian automatically inherit a verified YouTube channel and an Instagram page where we can see them vlog everyday.",
        "What are you on about?",
        "the content feels forced, exaggerated, and it seems like the woman is exploiting her partner's culture for personal gain and attention. It's strange and inappropriate.",
        "Thanks for the channel recommendations.",
        "So what? You should be proud that they are embracing the culture. I bet most of these people are more Indian cultured than native Indians themselves. Don’t be that annoying gate keeper. Share and spread the culture. It’s all love people.",
        "Lol bro you hurting. Those are just E-thots soaking up Indian men's attention and money.",
        "IndiaInDetails Yikes,She Way To PsuedoScientic",
        "This is the videos of black people pretending they’ve never heard Queen before but for a bigger audience",
        "What’s your problem with any of it, OP?",
        "it's called globalisation.",
        "This also exists. \"My American husband in...(Italy, Thailand, etc)\" or \"Explaining the thanksgiving holiday to my Norwegian wife\". It guarantees at least Two built-in audiences for every video. And it's endlessly replicable. Thanksgiving video went well? Now you have Easter, Independence Day, or different cultural experiences or foods or whatever. It's a content mine. If you're charming at all, some dope will watch it, and eyeballs = $$$. And to be fair, some of its more entertaining or enlightening than the heavily researched and funded programming on television and streaming services. The motivation is clear. Just like OP probably knew taking this angle on this topic would incite engagement--both positive and negative. \n\nThe only weird thing actually going on here is that we will end up spending our lives knowing just a little surface level information about thousands of other people on the internet instead of ever discovering the deep things about ourselves, our family and close communities. \n\nThis is nothing new. TV, circuses, public executions, celebrities, royal weddings, sporting matches--all competing for your attention to prevent you from realizing your own worth. Your neighbor's individual humanity. The sacred divine within you is a problem for the very few people that can afford to create the distractions that prevent you from realizing it.",
        "Your research on list of channel are phenomenal. Guide hehehee",
        "It helps rather than hurts when it’s a big euro country that a lot of ethnic minorities are interested in, a lot of ppl in the US (where I live) don’t know much about Germany which is considered 1 of the best of not the best country in that continent.",
        "If there’s no malice in it then who cares?  Theres a million weeabos on youtube and it all seems pretty harmless.",
        "It shows that you are from the us",
        "Both are very different",
        "Must be some rabid culture warrior. There was nothing offensive in my comment.",
        "I like that karl dude",
        "The only common thread between the channels is Indian guy with non-Indian women. Some of the channels are made by the guy. Many of the channels barely focus on Indian culture. It’s a dumb compilation.  OP is the one who is obsessed with this topic, while claiming other people are obsessed.",
        "> Validation\n\nCalm down with this current decade pop-psychology crap. People can just be interested in other cultures without it requiring psychoanalysis.",
        "whatever gets you view, I always wondered who watches vblogs but I guess lot of people do just looking at their view counts and subs. Weird kink, but hey you do you.",
        "About what? Are they showing primarily negative aspects?",
        "Boy or girl gets citizenship...end of deal",
        "Just say India as an average looking Gori mem or Gori bhaiya. You have a legitimate career.",
        "It has begun.. the 2nd wave of Aryan Invasion has been initiated.. :/",
        "Fucking legend",
        "This type of channel does well in most Asian countries, not just India. I'm living in Taiwan now and there are TV shows here where they invite foreigners from different countries to share their experiences and opinions about local culture. A ton of popular international YouTubers here as well.\n\nMy understanding is that for relatively homogeneous societies there is an innate human curiosity to see what an outsider thinks about your culture, especially the aspects that you care about. That's why these do well...",
        "A few links, continues to link half the channels on YouTube.",
        "Yeah, I was married to an Indian woman for a while. I wore the attire for Diwali and that’s about it. Going nuts over it is stupid.",
        "1. Is it not considered that many of the viewers are actually non-indians?\n2. I have watched some foreigner travel videos to India to see their own experiences and how they are treated\n3. I have not been to everywhere in India so it's still interesting to see about new places?",
        "Frankly, I don't watch vlogs. So I don't have much idea what they are all about .\n\n\nBut, there was a comedy video where a Pakistani is angry thay his daughter is dating an Indian. He is asked \"what is ur problem\". He replies \"I wouldn't have had any problem if it was my son and ur daughter. We can watch our community grow not decrease\". Same logic can be applied here",
        "Wait what? What was that about black people and Queen?",
        "HA HA HA ... Aspiring Hindu Indian Men are loosing India's 'Love Jihad' War to Lower Middle Class White Girls and this is being documented via live-stream and Vlog posts.",
        "You mean a Chutney Toy Boy.",
        "Post-modern peep po*n for aspiring Indian Boys ...",
        "All night long...",
        "There is zero logic in your reasoning.",
        "Why?",
        "Maybe there are lots of interracial couples in love? I'm sure I could make a list of ones active on YouTube or Insta where one spouse is a particular race. But I try to avoid selection bias.",
        "I don't see a problem here, on the other hand, we also have people who hunt down scammers, that's interesting and shameful example: https://youtu.be/N0HfSLa9l3w",
        "Wtf dude.",
        "It's abnormal because it's rare. Lot of Indian women have western style channels and no one cares because everyone does it. The more Indians start marrying foreigners, the less rare these situations become and you'll find it quite normal.",
        "Looks like people are lapping it up and it $$$. There will be people who think tjis is cringe but end of the day who is laughing their way to the bank?\n\nKardashians and their clones have done this for decades and it’s a tried and tested moneymaker. \n\nAnyway, the real cringe is people getting offended because its Indian and a personal affront to them somehow.",
        "That was my first thought as well.\n\nOne way to gain publicity for yourself without seeming obvious is to speak badly about yourself in public.",
        "Which country btw? Morocco? Nigeria?",
        "Indians feel pride when someone who is non Indian says something about India or discuss India. These people monetize on that.\n\nThere is one guy who used to do reaction video on YouTube, most of the content were Hollywood, but when he changed it to Indian movies, his channel exploded. So that’s his main content now.",
        "🇸🇴",
        "Well, it brings in easy money. Fair play to them.",
        "Anything foreign is aspirational. Remember, China Korea, Japan, Australia, Singapore, New Zealand, Thailand, etc. are Eastern countries for us.",
        "Anything foreign is aspirational. Remember, China Korea, Japan, Australia, Singapore, New Zealand, Thailand, etc. are Eastern countries for us.",
        "Let’s just get to the point India is the largest consumer of youtube videos and if there is a demand supply will start coming",
        "I mean our whole childhood was how to be fair. Most of our mom make sure that we don’t stay in sunlight as much as possible to remain fair. Even if your skin is of dark color there must be some kind of attempt taken by your parents to try and make you white. \nSo i would say it was programmed into us that hey if you are white color or fair skinned you are above other people",
        "I think it's because there's a target for it lol $$$",
        "I don’t see a problem if they adopt and show Indian culture to masses and in return get paid by youtube",
        "Rule no 1: Never try to argue with a woman from any of the TwoX subs. They are conditioned to portray women as victims and men as animals daily. No matter what the context.",
        "Who’s the girl in the pic above?",
        "Holy shit! I thought you would point out to like 3 4 channels, but you brought the school with you. Damn, that is a lot of channels. \n\nI think the answer lies in number of indian viewers and our fondness to talk about our culture. If it is a foreigner adopting it, is even better.\n\nJust look at number of youtube videos of white people eating kurkure or other generic indian snacks and reviewing them. Half the comments are like \"proud to be indian\". bhai, it is a video of someone eating an unhealthy snack with sol intention of getting views, what about it makes you so proud to be indian.",
        "Yikes yikes yikes some serious objectification going on",
        "There's something depressing about exociticising another culture from afar and living in your head. We don't know these people, their stories and their lives - beyond superficial things.",
        "I can't stop laughing. I'm sure they have a production team and fake food",
        "One thing baffles me. Why do all these foreigners even bother targeting their videos towards Indians when infact they are not going to get a lot of money for the views that they get from Indians. The CPM is abysmally low for Indian viewers, $0.5-$1 globally.\nSo if you are uploading one video a week and average viewership is around 1mil views that translates to only a $1000 which is very low for these foreigners.",
        "Definitely the work ethic of a guy procrastinating from something more important:P",
        "It’s called business",
        "It’s all about white skin lovers on one side and views hungry creators on the other side",
        "damn you gave me a nice idea\n\ni need to find a pakistani girl now and marry her (hopefully)\n\nevery day or two i can make a clickbait title calling her an ISI spy and boom i'll have millions of subs in a few days 😂😂",
        "Could youtube be promoting this? For some reason? They keep coming into my youtube feed even though I never searched for anything like these.",
        "> **is a legit genre in youtube and it is absolutely weird, what do yall think?** \n\nUs Indians are insanely OBSESSED about our culture & about foreigners praising our culture so, W for such YouTubers, they realized an easy way towards Ad. revenue & stuff.",
        "Username checks out",
        "There was a microgenre of youtube vid that was popular for a bit of young black people reacting to dad rock and phil collins and stuff and being like wow damn this is crazy",
        "Whenever I see such channels and influencers; I always feel she(the Western woman) would have been a nobody. This way she is fending for herself, with good level of validation",
        "hehehe",
        "Oh right. I remember seeing a few of those videos a while back. It seemed to have cooled down since then though.",
        "Guys with low confidence are the ones who end up being abusive lol.",
        "The fact that he died just a month before Independence is heartbreaking",
        "I believe if they cant be loyal to their culture, how can they to be loyal to mine",
        "Which sub did you get the links from..",
        "what do u mean by legit?",
        "Just that she was genuinely interested in Indian culture / economy and the country as a whole and not the other way round as presented by OP (i.e. that she married an Indian guy first and then made a YouTube channel embracing indian culture and creating india centric content).",
        "She said rhet how people in slums are always so happy in India. I don't like people who glorify poverty. \n\nFirst and only time I read something of her. \n\nThat gives me impression that she isn't genuine\n\nAnd it's not work other way. My friend has married an Austrlaian and apparently she loves Australia now. She even likes Aussie Wildlife(I was shocked too). If she makes a vlog, she will get all kinds of abuse",
        "Look mate...no one's perfect and you can have your own biases as well right...that said, in her channel, videos go quite a few years back and more often than not, she has been praising India and its progress with substantiated research and well articulated articles....",
        "Glorifying poverty is a turn off for me. I don't look down on poor but there is nothing in glorious in poverty. \n\n\nAnd there is something like confirmation bias. \"Substanated research and we'll articulated\" generally means articles written confirming beliefs. It is applicable to me.\n\nI know an American family. They are my second favorite family outside India. U can call them stereotypical patriotic  Americans which u see on TV. When they praise India or something Indian. I believe that they are genuine because they love their own culture. \n\nPS: I respect people who can say something along the lines of \"meri bole Jo boli wah na choddu Mai. Yo meri Taraf se clear madam sorry re\".",
        "What's the point of this post?? Like let people be",
        "K"
    ],
    "cleaned_text": "non indian women marrying indian guy making whole social media life culture legit genre youtube absolutely weird yall think thought interested indian culture checked youtube literal genre thousands thousands channels non indian woman married indian guy channelinsta culture literally nothing else like channels subscribers millions subscribers millions views millions likes damn weird thought maybe white skin obsession among indians hundreds channels women non white ethnicities like middle eastern black chinese koreanjapanese thai etc really weird yall think edit dont believe gon na link thousands channels people asking jot post jotting sub copy pasted links httpswwwyoutubecomjennijihttpswwwyoutubecomjenniji httpswwwyoutubecomcindiaindetailshttpswwwyoutubecomcindiaindetails httpswwwyoutubecomchanneluckrvabtljeapzspkepgvideoshttpswwwyoutubecomchanneluckrvabtljeapzspkepgvideos httpswwwyoutubecomchannelucgzhigglixlkxaomkksghttpswwwyoutubecomchannelucgzhigglixlkxaomkksg httpswwwyoutubecomchanneluchghwgnbimtcpnmtqhttpswwwyoutubecomchanneluchghwgnbimtcpnmtq httpswwwyoutubecommyneighbortumulindianlifehttpswwwyoutubecommyneighbortumulindianlife httpswwwyoutubecomsnydayshttpswwwyoutubecomsnydays httpswwwyoutubecomaamandbasilshortshttpswwwyoutubecomaamandbasilshorts httpswwwyoutubecomstayawarahttpswwwyoutubecomstayawara httpswwwyoutubecomanshmandyhttpswwwyoutubecomanshmandy httpswwwyoutubecomlokeshchinavlogshttpswwwyoutubecomlokeshchinavlogs httpswwwyoutubecomdostinanahttpswwwyoutubecomdostinana httpswwwyoutubecomturkishindianhttpswwwyoutubecomturkishindian httpswwwyoutubecomcmithileshbackpackervideoshttpswwwyoutubecomcmithileshbackpackervideos httpswwwyoutubecomclegionslifevideoshttpswwwyoutubecomclegionslifevideos httpswwwyoutubecomcprotarunhttpswwwyoutubecomcprotarun httpswwwyoutubecomkorindiandiarieshttpswwwyoutubecomkorindiandiaries httpswwwyoutubecomchannelucmcfnmcloubqewmwtgfavideoshttpswwwyoutubecomchannelucmcfnmcloubqewmwtgfavideos httpswwwyoutubecomcindianitaliancoupleworldvideoshttpswwwyoutubecomcindianitaliancoupleworldvideos httpswwwyoutubecomcnomadikkervideoshttpswwwyoutubecomcnomadikkervideos httpswwwyoutubecomchannelucfhmdxveghuqumtoqqvideoshttpswwwyoutubecomchannelucfhmdxveghuqumtoqqvideos httpswwwyoutubecomchannelucctowouqiursubzwotgvideoshttpswwwyoutubecomchannelucctowouqiursubzwotgvideos httpswwwyoutubecomcindianlifeinrussianstylevideoshttpswwwyoutubecomcindianlifeinrussianstylevideos httpswwwyoutubecomchannelucwyaefcelhdfcqalgvideoshttpswwwyoutubecomchannelucwyaefcelhdfcqalgvideos httpswwwyoutubecomclushalhttpswwwyoutubecomclushal httpswwwyoutubecomahzmiandazharhttpswwwyoutubecomahzmiandazhar httpswwwyoutubecomkeyannaandersonhttpswwwyoutubecomkeyannaanderson httpswwwyoutubecomjarrydthabanghttpswwwyoutubecomjarrydthabang httpswwwyoutubecomchannelucrrlcxhcavnozfwmixgvideoshttpswwwyoutubecomchannelucrrlcxhcavnozfwmixgvideos httpswwwyoutubecomcletsmeetabroadvideoshttpswwwyoutubecomcletsmeetabroadvideos httpswwwyoutubecomcbasantjangravlogsvideovideoshttpswwwyoutubecomcbasantjangravlogsvideovideos httpswwwyoutubecomcforeignerinindiavideoshttpswwwyoutubecomcforeignerinindiavideos httpswwwyoutubecomcinternationalfamilyvlogsvideoshttpswwwyoutubecomcinternationalfamilyvlogsvideos httpswwwyoutubecomctheindianpolishconnectionvideoshttpswwwyoutubecomctheindianpolishconnectionvideos httpswwwyoutubecomcindoiranianlovestoryvideoshttpswwwyoutubecomcindoiranianlovestoryvideos httpswwwyoutubecomchannelucbeyrnthbsnaguuqkqvideoshttpswwwyoutubecomchannelucbeyrnthbsnaguuqkqvideos httpswwwyoutubecomcpremkimforevervideoshttpswwwyoutubecomcpremkimforevervideos httpswwwyoutubecomusermarikageorgievnavideoshttpswwwyoutubecomusermarikageorgievnavideos httpswwwyoutubecomchannelucducpnftfpzxexjstpmuavideoshttpswwwyoutubecomchannelucducpnftfpzxexjstpmuavideos httpswwwyoutubecomchannelucwfwkbzapelbhlleavideoshttpswwwyoutubecomchannelucwfwkbzapelbhlleavideos httpswwwyoutubecomcpiyushharnevideoshttpswwwyoutubecomcpiyushharnevideos httpswwwyoutubecomcindianinchinavlogvideoshttpswwwyoutubecomcindianinchinavlogvideos httpswwwyoutubecomcromiesvlogsvideoshttpswwwyoutubecomcromiesvlogsvideos httpswwwyoutubecomcmukkuoksiivideoshttpswwwyoutubecomcmukkuoksiivideos httpswwwyoutubecomctasyaselfmomvideoshttpswwwyoutubecomctasyaselfmomvideos httpswwwyoutubecomcnamastefromusavideoshttpswwwyoutubecomcnamastefromusavideos httpswwwyoutubecomchannelucxqtqwxhcgddqbuwoimqhttpswwwyoutubecomchannelucxqtqwxhcgddqbuwoimq httpswwwyoutubecomchannelucwvwqbxtmnrdxjdyheavideoshttpswwwyoutubecomchannelucwvwqbxtmnrdxjdyheavideos httpswwwyoutubecomwatchvwesexweschttpswwwyoutubecomwatchvwesexwesc httpswwwyoutubecomcramandpievideoshttpswwwyoutubecomcramandpievideos httpswwwyoutubecomchannelucewryowllugqjirnuuwgvideoshttpswwwyoutubecomchannelucewryowllugqjirnuuwgvideos httpswwwyoutubecomchanneluctxebnxzqzacupmmojbwvideoshttpswwwyoutubecomchanneluctxebnxzqzacupmmojbwvideos httpswwwyoutubecomchannelucvplfuaxllfwvetngprypwvideoshttpswwwyoutubecomchannelucvplfuaxllfwvetngprypwvideos httpswwwyoutubecomchannelucxunjvdyvbdtgudrktjwswhttpswwwyoutubecomchannelucxunjvdyvbdtgudrktjwsw httpswwwyoutubecomcelizabthjoyhttpswwwyoutubecomcelizabthjoy httpswwwyoutubecomcabhinavkarihttpswwwyoutubecomcabhinavkari httpswwwyoutubecomcamansarahttpswwwyoutubecomcamansara httpswwwyoutubecomchannelucinywdtanajcphzpghttpswwwyoutubecomchannelucinywdtanajcphzpg httpswwwyoutubecomonlyonegiuliavideoshttpswwwyoutubecomonlyonegiuliavideos httpswwwyoutubecomtravelvlogivvideoshttpswwwyoutubecomtravelvlogivvideos ",
    "cleaned_title": "non indian women marrying indian guy making whole social media life culture legit genre youtube absolutely weird yall think",
    "cleaned_selftext": "thought interested indian culture checked youtube literal genre thousands thousands channels non indian woman married indian guy channelinsta culture literally nothing else like channels subscribers millions subscribers millions views millions likes damn weird thought maybe white skin obsession among indians hundreds channels women non white ethnicities like middle eastern black chinese koreanjapanese thai etc really weird yall think edit dont believe gon na link thousands channels people asking jot post jotting sub copy pasted links httpswwwyoutubecomjennijihttpswwwyoutubecomjenniji httpswwwyoutubecomcindiaindetailshttpswwwyoutubecomcindiaindetails httpswwwyoutubecomchanneluckrvabtljeapzspkepgvideoshttpswwwyoutubecomchanneluckrvabtljeapzspkepgvideos httpswwwyoutubecomchannelucgzhigglixlkxaomkksghttpswwwyoutubecomchannelucgzhigglixlkxaomkksg httpswwwyoutubecomchanneluchghwgnbimtcpnmtqhttpswwwyoutubecomchanneluchghwgnbimtcpnmtq httpswwwyoutubecommyneighbortumulindianlifehttpswwwyoutubecommyneighbortumulindianlife httpswwwyoutubecomsnydayshttpswwwyoutubecomsnydays httpswwwyoutubecomaamandbasilshortshttpswwwyoutubecomaamandbasilshorts httpswwwyoutubecomstayawarahttpswwwyoutubecomstayawara httpswwwyoutubecomanshmandyhttpswwwyoutubecomanshmandy httpswwwyoutubecomlokeshchinavlogshttpswwwyoutubecomlokeshchinavlogs httpswwwyoutubecomdostinanahttpswwwyoutubecomdostinana httpswwwyoutubecomturkishindianhttpswwwyoutubecomturkishindian httpswwwyoutubecomcmithileshbackpackervideoshttpswwwyoutubecomcmithileshbackpackervideos httpswwwyoutubecomclegionslifevideoshttpswwwyoutubecomclegionslifevideos httpswwwyoutubecomcprotarunhttpswwwyoutubecomcprotarun httpswwwyoutubecomkorindiandiarieshttpswwwyoutubecomkorindiandiaries httpswwwyoutubecomchannelucmcfnmcloubqewmwtgfavideoshttpswwwyoutubecomchannelucmcfnmcloubqewmwtgfavideos httpswwwyoutubecomcindianitaliancoupleworldvideoshttpswwwyoutubecomcindianitaliancoupleworldvideos httpswwwyoutubecomcnomadikkervideoshttpswwwyoutubecomcnomadikkervideos httpswwwyoutubecomchannelucfhmdxveghuqumtoqqvideoshttpswwwyoutubecomchannelucfhmdxveghuqumtoqqvideos httpswwwyoutubecomchannelucctowouqiursubzwotgvideoshttpswwwyoutubecomchannelucctowouqiursubzwotgvideos httpswwwyoutubecomcindianlifeinrussianstylevideoshttpswwwyoutubecomcindianlifeinrussianstylevideos httpswwwyoutubecomchannelucwyaefcelhdfcqalgvideoshttpswwwyoutubecomchannelucwyaefcelhdfcqalgvideos httpswwwyoutubecomclushalhttpswwwyoutubecomclushal httpswwwyoutubecomahzmiandazharhttpswwwyoutubecomahzmiandazhar httpswwwyoutubecomkeyannaandersonhttpswwwyoutubecomkeyannaanderson httpswwwyoutubecomjarrydthabanghttpswwwyoutubecomjarrydthabang httpswwwyoutubecomchannelucrrlcxhcavnozfwmixgvideoshttpswwwyoutubecomchannelucrrlcxhcavnozfwmixgvideos httpswwwyoutubecomcletsmeetabroadvideoshttpswwwyoutubecomcletsmeetabroadvideos httpswwwyoutubecomcbasantjangravlogsvideovideoshttpswwwyoutubecomcbasantjangravlogsvideovideos httpswwwyoutubecomcforeignerinindiavideoshttpswwwyoutubecomcforeignerinindiavideos httpswwwyoutubecomcinternationalfamilyvlogsvideoshttpswwwyoutubecomcinternationalfamilyvlogsvideos httpswwwyoutubecomctheindianpolishconnectionvideoshttpswwwyoutubecomctheindianpolishconnectionvideos httpswwwyoutubecomcindoiranianlovestoryvideoshttpswwwyoutubecomcindoiranianlovestoryvideos httpswwwyoutubecomchannelucbeyrnthbsnaguuqkqvideoshttpswwwyoutubecomchannelucbeyrnthbsnaguuqkqvideos httpswwwyoutubecomcpremkimforevervideoshttpswwwyoutubecomcpremkimforevervideos httpswwwyoutubecomusermarikageorgievnavideoshttpswwwyoutubecomusermarikageorgievnavideos httpswwwyoutubecomchannelucducpnftfpzxexjstpmuavideoshttpswwwyoutubecomchannelucducpnftfpzxexjstpmuavideos httpswwwyoutubecomchannelucwfwkbzapelbhlleavideoshttpswwwyoutubecomchannelucwfwkbzapelbhlleavideos httpswwwyoutubecomcpiyushharnevideoshttpswwwyoutubecomcpiyushharnevideos httpswwwyoutubecomcindianinchinavlogvideoshttpswwwyoutubecomcindianinchinavlogvideos httpswwwyoutubecomcromiesvlogsvideoshttpswwwyoutubecomcromiesvlogsvideos httpswwwyoutubecomcmukkuoksiivideoshttpswwwyoutubecomcmukkuoksiivideos httpswwwyoutubecomctasyaselfmomvideoshttpswwwyoutubecomctasyaselfmomvideos httpswwwyoutubecomcnamastefromusavideoshttpswwwyoutubecomcnamastefromusavideos httpswwwyoutubecomchannelucxqtqwxhcgddqbuwoimqhttpswwwyoutubecomchannelucxqtqwxhcgddqbuwoimq httpswwwyoutubecomchannelucwvwqbxtmnrdxjdyheavideoshttpswwwyoutubecomchannelucwvwqbxtmnrdxjdyheavideos httpswwwyoutubecomwatchvwesexweschttpswwwyoutubecomwatchvwesexwesc httpswwwyoutubecomcramandpievideoshttpswwwyoutubecomcramandpievideos httpswwwyoutubecomchannelucewryowllugqjirnuuwgvideoshttpswwwyoutubecomchannelucewryowllugqjirnuuwgvideos httpswwwyoutubecomchanneluctxebnxzqzacupmmojbwvideoshttpswwwyoutubecomchanneluctxebnxzqzacupmmojbwvideos httpswwwyoutubecomchannelucvplfuaxllfwvetngprypwvideoshttpswwwyoutubecomchannelucvplfuaxllfwvetngprypwvideos httpswwwyoutubecomchannelucxunjvdyvbdtgudrktjwswhttpswwwyoutubecomchannelucxunjvdyvbdtgudrktjwsw httpswwwyoutubecomcelizabthjoyhttpswwwyoutubecomcelizabthjoy httpswwwyoutubecomcabhinavkarihttpswwwyoutubecomcabhinavkari httpswwwyoutubecomcamansarahttpswwwyoutubecomcamansara httpswwwyoutubecomchannelucinywdtanajcphzpghttpswwwyoutubecomchannelucinywdtanajcphzpg httpswwwyoutubecomonlyonegiuliavideoshttpswwwyoutubecomonlyonegiuliavideos httpswwwyoutubecomtravelvlogivvideoshttpswwwyoutubecomtravelvlogivvideos",
    "cleaned_comments": "understand marketing works right reason entire genre folks reviewing indian movies indians people pleases long theyre anything illegal attempts made generalise community thats pretty much youtube works people watch whatever interesting perhaps one dont see problem general channels putting daily vlogs problem someone trying create niche thats youtube works personal opinion beautiful two people accept others culture love isnt western culture dominant one everyone already familiar things many people would watch video indian woman going arbys today spoke english americans first time trying pumpkin spice latte shopping farmers marketwalmart celebrating thanksgiving husbands family today tried traditional american lululemon uggs great people show different lives others also expand horizons actually marketing lack good content creation indians viewers india countries girl picture married yet lives quite nearby live monkey circus maybe algorithm pushes videos shall see much click interesteddont recommend videos damn u found many channels get novel exotic theme foreign culture heard idea get trafficmore sponsors advertising money culture nonindian women foreigners kinds posting videos india indians indian women married indian men ips ias army officers etc quality content nothing worth watching primary income source indians huge number lazy internet comment videos like simps go crazy talked inferiority complex validation comments really cringe cares let thing dude ikr wholesome ive seen americanjapanese couples people dont see problem inferiority complex bohot bhad gayi hai desh mein istg keyword got many channels billion indian viewers theyre targeting large market ig coz india populated country audience emotional fool feel proud getting validation foreigners country culture great german female mean absolutely weird lol today packed husbands lunch box bhindi ki sabzi methi parathas good health aam ka achaar snack packed moongfali yummy yummy fresh nimbu paani like women mid im fucking legit uncle even women age dont behave like harming anyone problem yep weird choice way marketing suits harms one theres reason make fuss indian women marrying indian men also making similar type videos suits harms one nothing fuss many consumers content hate spread propoganda thrown light pastime dont stress unnecessarily op wow get point didnt create whole godamn archive youre promoting yes wedding stuff look reaction channels foreign vloggers sugar coating giving sweet validation op posted thing abcd subreddit got called care man research cause huge population get boners white people validating anything indian im increasingly seeing white people much mentioning india anything indian views spike like crazy dont even get started hard simping comments mean think amazing people appreciating others cultures lets real money comes crazy views sure thats accurate observation im kerala hundreds travel vloggers go around world matter fact recently malayali travel vlogger even sudan war broke want validation culture white people dont see whats wrong indian culture difficult assimilate outsider women create content based experiences showing different lifestyle quite normal think awesome accept well gon na link bro pasted entire channel list youtube xd world pretty big place never known people like plus living life bothering anyone let enjoy fun india worlds biggest market makes sense people take advantage vice versa also indians also stay countries get married someone countries sudhir make show culture zihad u gave idea pandering indian audience good strategy billion people generate lot clicks ad revenue lol fuckinlegituncle research lol favorite youtuber non indian guy married indian girl made whole social life culture wife entire subcontinent videos wholesome suckers watch videos views china open internet theyd reviewing chinese television like getting fake relationship make youtube career fact many indian immigrants western countries natural lot engaged foreign partners karl rock validation white people validation foreigner extremely insecure culture love praise multitude low effort reaction videos foreigners random indian things get lakhs lakhs views india goldmine views gon na link literally links every channel genre traditional american lululemon uggs lmaoo thousands instagram accounts small underage kids managed parents kids really playing parks watching cartoons stupid things like kid would normally growing bad part parents putting dm collaboration bio invading childrens privacy online creepy individuals gets see sensitive moments put online attention views publicly sad beginning generation growing reels lacking important human experiences innocent future tomorrow indians would go bonker choose sex food white skin praising us op worked hard gather data tell many girls non white mean billion patriotism sentiments indian culture respect indian traditions weak spots shocking people taking advantage make money instagram influencer dating korean guy made whole influencer career around dating korean literally posts thirst trap pictures bf indian kpop fans drooling comment section works ways actually many indians access internet thats cracked puzzle every influencer wants content travel culture related include content china india gets clicks views group provide since influencer accounts based outside india presumably remuneration package youtube far lucrative china india based account quite check bottom list every influencer wants content travel culture rekated include content china india gets clicks views group provide since influencer accounts based outside india presumably remuneration package youtube far lucrative china india based account career option would interesting see happens roles reversed indian woman man marrying non indian make insta foreign culture country would get shamed promoting culture turning culture would man get rough woman would interesting observe many indian women married non indians especially koreans whole channel dedicated korean culture like obsession point easy get views followers around smartphone users even people crave validation foreigners makes followers reality number higher nah tried find channels could get got korean woman indian man channels surprising youtube instagram tbh video actual indian resident going arbys would well india maybe stay beef lol yup search engine algorithms reward youtubers target huge number people word indian india buzzwords make sure videos shown feed per location makes indian target audience indians represent almost world population makes sense make videos anything indian difference make life people terminally online syndrome days surprised thats number channels could findi come across least channels insta dont ask link dont care follow save channels also trying compare numbers dont matter absolutely ridiculous obsession edit mentioned married ones indians patriotism easily taken advantage used generate revenue feel validated boastful foreigners adapt culture think great reality used get money bro weirdest shit cataloging youtubers wtf yeah know saying tried find married ones thats ig foreigners making money showing india indians whove lived life cracked code us fools make millions recording taking shit toilet wouldnt made millionares eating sleeping shitting pissing hard work nothing balance sheets forecast model investment raining millions lot pervs india like hila watching cringe foreign wives want get validation course millions audience lap india biggest market social media every business wants exploit market nothing new millions obssessed goris gon na link wow really dont know meaning thats unemployment cheap internet mfs india mean thats giving sells everyone could use little fame money youtube views give knows many indian guys like white girls theyre using demand making cash india one youtubes largest markets see people injecting indian elements like indian celeb pics body building videoseven otherwise regular content surprise videos specifically targeting indian audiences indians love validated whites imho guarantee fair view countsubscribership india represents single largest market terms viewership numbers youtube ig reels fb shorts easy cheap money making tactic marketing anything selling validation reading post travelling non indian girlfriend making youtube videos laughs jaby koay white supremacy id guess comment days back remember downvoted heavily believe getting called seems like guys much time issues almost everything harmless goes around social media business make videos gets views billion people brings required views white foreigner anything remotely related india makes u fortune social media thanks increasing subscribers nope kinds genres considering much indians love foreigner shows love country culture weird surprising meanwhile indian men watching like foreign women good sanskaari cant indian women like indians crave validation foreigners especially whites vast jobless population worlds cheapest data content creator india huge market garnering views hence content foreigners indian topics major genre includes white women married indians foreigners reacting things indian dance music actors food movies places economy military everything sun option watch forcing watch content youtube channels available every weird kink world imagine eg linking channels hate content definitely bring unnecessary hate channels cool dude agree found markets indian fair indians dealing cringey shit also lot ethnic groups country including coming small country africa ppl absolutely obsessed us review music react food womens looks guess nothing done internet open domain idiot target group ppl whatever reason mainly marketing game game brother age earning money via social media upto person free follow ignore based preferences understood long time back things ive considered crasscringey huge following niche interested weird many simply put free countryworld long legal somewhat ethical fine quora writer married guy bihar made day job bs day day life iirc name samantha aur kahan milega itna content kunal kamra cringy worse also ones mentioned basic travel vlogs good amount channels foreigners japan korea germany sure whats problem thats worst part see foreigners accepting dharma indians gravitating towards shameless foreign culture brain dead idiots ever seen teenager moving abroad studies fir wo bhi hamara kahan rahta hai think thats weird channel subscribers views means revenue youtube ads dont forget royal enfield review videos nonindians population tseries suggest subscriber base population high tseries well known well established brand brand similar stature small country like uk would kind subscriber base countrys population low hence people know brand relate low indian population high number youtube views generated would high well content indian culture works might also people already married genre rising started making content wtf anyway agree point bruh make orginal posts post ditto copy identical posts abcdesis sub would particularly weird husband isnt really indian culture white wife implies hes sort prop wifes fantasy though lot channels linked seem go ways boyfriendhusband experiences wifes western culture think posted damn post rabcdesis last week got flamed weirdly obsessed indian people marrying non indians must decided post expecting different response lmao leave people alone cringe hustle everyone trying make money countries social media channelts probably overcrowded point theyre carving niche says indians obsession validation white people something else dont think bad shes obsessed indian culture alright everyone preferences whats odd scale shes social media kinda ironic op marketed channels subreddit indians others mentioned gets clicks thirsty indians clueless curious westernersyou give culture clash twist itit gets clicks moneynowadays everything needs monetized used entertainment major drug tragedy exciting fast paced show netflix making light people diedstop paying attention things focus self improvement way forward generic influencervlogger revenue model example stupid reactions yt grew entire team indians working manage review recommendations content income sources yt patreon afaik also interviewed pankaj tripathi ar rehman last watched two happens many nationalities cultures well gives double target audience western people interested cultures people cultures like watch foreigners explore culture robots ai taking away many jobs people turn kind gigs earn livelihood somehow feel viewer traffic content driven indians hah first thought one sponsored arbys roast beef sandwich deal like shock video gimmick like american posting videos chowing bosintang understand marketing understand well people get hooked channels let maybe deserve actually went links rather surprised find many channels concept kudos op links although must say went links found cringe sort made sick stomach literally video titles specially going dinner american wife going meet x italian wife met turkish wife ffs also got ta realize indias social media population india becomes easy soft target gain followerssubscribers fascination gain immediate approval talkingspeaking white foreignerexpat never dies indians weird fetish seeking validation non indians especially fair skinned non indian take one step forward beyond social media use opportunity proxy entry indian politics la kirandeep kaur waris punjab de nothing weird yall nosy think ur entitled say cause culture let see u commenting interracial couples indian completely adopts american culture obsession western culture internalised comes many ways average indian obsessed white people lot figured white person anything basic pertaining india indians bollywood etc get million views easily really know indians married foreigners aint like happening solely majority indians feeling good getting attention validation foreigners monetizing go see jaby koay channel works psychology started reviewing contentmovies everywhere became completely bollywood focused attention positive responses started receiving indian people saying content low effort dont respect country theyve actually putting lot effort content given large audience channel garnering psychology behind cringe lol choice bother thanks infinite fucking abilities country hundreds millions internet users obsession fair skin makes us like anything supports youtubers earning solid money content arent harming anyone theyre making hay sun still shines really know indians married foreigners aint like well contrary know indians married foreigners like well guess find types people go see jaby koay channel works psychology started reviewing contentmovies everywhere became focused bollywood attention positive responses started receiving indian people saying content low effort dont respect country theyve actually putting lot effort content given large audience channel garnering psychology behind cringe im supporting indiansforeigners im saying things either way people sell people buy simple holy shit someone fell really deep rabbit hole haha post felt like promote india pretty understandable ancient spirituality india best look example gwyneth paltrow selling energy rocks shit much better join allready existing culture trying invent weird many foreigners really look india many foreigners actually pride indias culture history indians maybe interest let met indian guy interest enthusiasm make shoot videos culture tbh american boring taste videos would probably watch showed youtube recommended indians stop giving people free views never stop neither make money quick schemes havent seen longing external validation chinese people compared indians infatuation lighter skin toneyou could credit large strata lighter skin tone populace even chinese open internet dont see foreigners could gauge attention reviewing culturemedia watch karolina goswami india details good provides sources claims etc generally makes good content personal life seems good married anurag years also kids dont think weird yes remember roots nothing wrong appreciating adopting cultures spouse small scale version females migrating south india north india marrying north indian yes keep south indian heritage mind nothing wrong appreciating participating north indian culture dont think married starting youtube channel might married reasons love etc opportunity front indian people love seeking validation western people youtubers could tap reach audience make money nothing sinister seeing opportunity taking full advantage actually saying weird could construed racism insulting immigrants basis ethnicity definition racism yet classified mental disorder way around well men also married indian women moved india like white people validate us thats true actually ingrained biases insecurities aspirations fallacies us sense theyre defined western gaze doesnt appear open language communication barriers however dont level self hate much south asians thought interested indian culture weird uncommon many western countries yes channels influencers probably cringey af theres many listed even begin look interested people anyway live us large amount indian immigrants immigrants general places us indian communities grocery shopping restaurants interracial marriage weird uncommon cultures usually embraced relationship esp one living country probably far away source non indian married indian maybe little curious nonindians would view indian entertainment modern day colonization way chai latte turmeric milk yoga chakras etc become mainstream west seriously disgusting lululemon canadian ugg aussie lol married indian knew getting period haha chinese infatuation light skin ask chinese asian countries could see weibosocial media dont see problem even talking point thats worthy post thought maybe white skin obsession among indians immediately think inferiority complex among indians see videos weird bruh good chunk chinese koreans population obsessed white pale af fair skin historically obsession east asiahttpsnextsharkcomeastasianpaleskinbeautystandard money china one biggest markets skin lightening infact china entirely east asia rest asia south asia south east asia middle east comes close close second similar craze western validation neither info available due alack open internet china b assuming part relevant online communities like kpop cdramas kdramas asian makeup trends weibo weverse etc judging anything im impressed op spent much time finding many channels linking op doesnt even like genre videos social media engines refine present content according interests based clicks genre youtube collection people clicked next white families reacting bollywood movies americans reacting indian music etc etc increasing audiences name category theres probably content creators catering subject im vlog says spy country used melol okay apart marketing reasons targeting overpopulated indian viewers another reason foreign women appreciate indian men unlike privileged desi girls saying whats weird weird thing posting lol definitely new phenomena happening india obvious one since theres influx singleeuropean women coming india live ive seen trend indiankorean couples well average rightwinger got ta say got time check st channel respect kannda really good doesnt look like cash grab looks like someone genuinely integrates got ta say got time check st channel respect kannda really good doesnt look like cash grab looks like someone genuinely integrates got ta say got time check st channel respect kannda really good doesnt look like cash grab looks like someone genuinely integrates tumko dikkat kya hai bhai acchi baat hai people spreading culture reading non indian stumbled onto accident funny exact man say well germany im xxx living germany kind videos really popular mean passport bros go poorer countries looking traditional submissive women hate wayward modern women west samantha writer married tamizhan published books jessica podcaster married bihari creates hindi learning content clicked first link got ta say woman best job speaking kannada ive ever seen white person pull pretty amazing stuff views declined sharply past year makes unreasonably happy hate reviewers selling validation business market indian locals indian married nonindian thread finding wife sugar mommy yeah kinda lol youtube theres next level cringe happens quora white woman called samantha married tamil dude every mother fuckin indian irrespective gender age state group orgy whatever fuck ordinary things like wearing saree eating ladoo gets hundreds thousands upvotes indians pathetic want validation every white person target audience cos seem interested remember channel ray william johnson reviewing kinds weird youtube channels one guy farting apparently seemed audience crowd everything content creators making money since theres lot people watching shit capitalism finest thing weird seem know money works discovery tlc nat geo fox etc shit years sab views k bhuke hai gorey log target indians get views india indian culture indian food gorey ladki wearing saree mention kiya toh kaam easy hota hai unka men manipulating way holding accountable goes beyond borders wahi problem hai bhai sahab ko mithilesh backpacker randibaaz hai feeds culture best philosophy unoriginal cookie cutter gifgiphyvholffnroiuphmoadownsized well lonely guys married divorced woman children another countrymostly thailand dont really believe wifes victim holy shit dude second one straight seem like propoganda channel psudo history damn got million subs tf also thinking guy marriedkya kismat hai teri im american comment made laugh really hard especially walmart part anything india gets insane views especially involves white person rather watch american american things like red necks shooting guns backyard aur kid shooting others jokes aside usually watch tutorials tools stuff watch thing indian cause would found much simpler easier way regardless power dynamics skewed towards one person indian love validation foreigners koreans indians started loving validation well everyone content really weird awful cant decide whether cynical pandering brainwashing foreigner living india btw love honestly say ive never posted cringey youtube video experience india indians obsessed foreigners simping indian culture x billion us ofcourse large number us vote op women first link conspiracy theory hot girls tho ngl real baat pe rightwinger bol dunga rindia hi h cool lagunga yeah wifes directon makes money usually women marriedso assets cases pay alimonies also usally kind women arent kind shy reserved type person know want get idk man think white woman thing like theyll marry someone colour suddenly thats whole identity showed interest would complaints much interest dont see downside bollywood hiring white chicks eastern europe back item songs happens every country homogeonous population people following simp money wants see hot foreign chicks years ago vlogs personal lives new didnt make sense people want follow someone elses life literally like eating breakfast together kind stuff playing kids like daily routine stuff family white followers also white asked fan show mentioned family dysfunctional never knew like normal life think people personal tragedies shows give emotional satisfaction china japan koreas obsession light skin one entire world greater indias bad people dont even know countries ahve people mediumtan skin also foreign environment dont usually speak language trouble communicating people outside husband completely dependent money comfort zonefamiliar environment totally perfect recipe abuse curry kimchi something idk ive heard plenty horror stories involving abuse men try upper hand cost makes sense women get vicious anyway point men sought women know living conditions arent best kind selfserving dishonest also hard blame women trying survive reason youre saying men likely marry nonindian person men likely go abroad different purposes woman way youll see indian people make content abroad mostly men theres significant imbalance start thats see imbalance everywhere much time put rant post many links yes another american tradition knowing things american claiming damn didnt expect germans thought thats europe would need validation looks like mericans capitalising foreign culture wow thats lot channels chad indian guys wow idea something like existed im glad reddit pretty much social media im even come list obsessed maybe looks like audience kind content found many dunno rant honest well nice hear peoples think us see foreigners see germany depicts something familiar different lens kind things work quite well audiences put harmless true stereotypes relate makes pretty good content also works way indians marrying foreigner making entire social media around like end abusing guy low confidence woman wants move away benefit whats harm presumption every woman weak vulnerable getting old realized different yt recommendation changed permanently went us week summon indians easy views billion people world everything genre nothing new ananda coomaraswamyhttpsenmwikipediaorgwikianandacoomaraswamy famous indologist whose seminal work created field indology father sri lankan tamil mother english although father died young mother late introduced ananda indian art culture study making later became believe common phenomenon woman marries status society give previous identity fully immerse spouses identity one reason get recognition adopted community sociologists studied phenomenon white women marrying black men immerse black culture example boring taste really care random strangers opinions watch free timebruh lmao wait normies op discovers weird stuff yt like pimple popping asmr top views fire feeds agree extent every case follows path fuck reaction channels dude u living rock well cant blame u really feels like yesterday consider taste boring lol really worried others think changed remember nondesi wife hasnt ever even tried saree lost access instagram account couple years ago even pictures videos travel alpinism plenty side spectrum guess arent ones making noise indian women married indian men ips ias army officers etc quality content specifically ips ias army officers could anyone right thank cares people let live life thing op care people let people want long anyone else affected hard concept show government accommodation government vehicles share life spouse officers indians worship central government officers specially professions professions person himselfherself makes office tour videos super cringe white pretty women hm fantasy many indian men straight friend explained like like dressing barbie clothes turn even among white girls hierarchy certain profile blue eyed blonde haired like op fck research useless topic bro research god damn man came fuck ton sources lmao edit also wont surprised arent actually married actually partnered indian dude create brand image well giving average indian men hope someday also get white women could reason views indians feel proud outsider obsessing indian culture following unlike many local native indian women liberal modern p simple well people dont appreciate dharma san find women converting islam usually called isis brides short follow trend change religion absolutely dude came across watching videos kerala story lots indians hard find indian marry lots indians lots people watching content related india step praise india indian culture possible speak broken hindi wear indian clothes step wait video go viral step hyper nationalists flood comment section feeling piraud endian armi saar endia best saar step step x followers single daymore likes comments imagine profit one easiest contents produce youtube ive seen similar ones pretty much country large internet using population world cheapest data must nice dont agree fun fantasize realise number telugu channels exactly like think mundane things daily life make video im impressed fact used interracial marriage long ago thangod thankyou saying effin annoying perfect recipe abuse totally agree everyone accept abuse strong women take abuse least experience thai wifes seem quite strong independent non indian woman marry racist want help make ton money aaj aaram se baith k dekhta mai ye saare videos unusual happening india many youtubersinstagrammers marry outside country men japan korea thailandagain predominantly white women accounts documenting lives experience new culture someone mentioned indian women making similar content ive also remember seeing vietnamese woman ig talks cultural differences germany life german fiance agree lot content creators target indian audience many us addition foreigners married indians look number react indian moviesong videos much beauty diversity india get talked countries movies like slumdog millionaire didnt help ppl like white business man met went mumbai one meetingliterally airport meeting back airport loudly proclaiming india shacks slums think genuine interest india foreigners videos feed means positive narrative formed get tourism im ok dont think id care enough complain need gatekeep culture wife gori loves parents embraces culture people love sharing life online cuz people interested alot indian men dirty like shit like goris literally impressed india thanks spitting truth otherwise people also thought natu natu best song year population makes market capitalizing personally find bit odd also cute wholesome kind thing gets lot likes positive reactions would giving people attention though sanskari gori bahu ek foreigner wifey mai bhy deserve karta hun something hope father one amongst elite colonially educated people colombo sri lanka married english women copy paste nri sub post every days bizness find rampant religion hating shoving ones religion anothers throat also weird go eat bag dicks op generally watch cities skylines succession indian geopolitics videos us got lot prank videos video people stealing kia explaing steal one algo think im gon na steal kia daily show trevor tons ben shapiro videos made interested us politics going rabbit hole found hasan minhaj new york jersey stunned thats shock much big brain comprehend well dont mind people need outrage everything days im white india im embarrassed shes usingappropriatingcolonizing culture benefit goes way beyond admiring yalls culture creepy multicultural marraiges increasing people embracing cultures course content creators going keep looking different things showcase catch attention viewers dont think embracing different cultures horrible anything much better making content kids something think latinx could said somewhat white skin meanwhile wyte people buy cream makes tan color including holyshit bro thts lot research work u hv done wouldnt mind happening thanks jio population size rate unemployment obsession indians validation world thing happened vlogging travel yt channels theres way many put tonnes videos centred around india makes ppl want watch either theyre curious foreigners think india seek validation op maybe dont get obsessed either otherwise youre making nonindian people making social media presence indian culture married indian guy reason women way social media presence menway yeah weird mainly want attention thats weird problem jennijis husband thought simply interesting get perspective country people born everything validation indian men obsessed non indian women find nothing wrong free world sides tons indians interested seeing outsider explore part culture tons outsiders interested seeing someone like exploring part massive indian culture seems pretty constructive helping foster understanding looks like keep fuckin cage lmao everyone different experience sherlock dont agree doesnt make less also dont try read comment starts indian youll get second hand embarrassment validation obsession indians love watching commenting videos speak highly india posted rabcdesis right leave people tf alone dont think indian women non indian guys someone parents different countries grew different countries wish mixingblending cultures nuance avoiding religion topic charged talk people cringy people havent experienced much racismethnicityculture stuff get shut people whove experienced lifetime imagine indian woman married foreigners creating type content would ur reaction content actually weird based everything india great criticism appreciation important nothing weird happens cross mixed cultures search watch certain types videos algorithm things may east asia india culture happens india populous country people found hundred india billion people whats weird think weird havent seen foreign channels promoting culture bothered interracial person raised countries feel annoyed post lot white people seem assume worst white people talk different cultures think theyre missing point id rather people empathize experience rather focusing anger white people sprinkling bit pity dont want know americans thinks india great worry golddigger also aspirant vlogger wants make career great worry golddigger also aspirant vlogger wants make career average indian obsessed white persons validation much obvious gullible market thats easy exploit wonder prolific xd born werent would want person married super culture would nice friends neighbors itd probably help understand better id feel bit less isolated ethnicityculture different wouldnt want invited neighborhood cookouts food culture go nuance mind fuck wants learn white culture read one line knew waste time check saidpeople indian slums also happy thats idiotic best friend married australian doesnt pretend different husband also likes indian culture doesnt make look fake friends american family proud culture also appreciates indian culture dont pretend previous life useless consider conversation addition knowledge even talk punjab living mumbai doesnt mean forgotton punjab read one line knew waste time check saidpeople indian slums also happy thats idiotic best friend married australian doesnt pretend different husband also likes indian culture doesnt make look fake friends american family proud culture also appreciates indian culture dont pretend previous life useless consider conversation addition knowledge even talk punjab living mumbai doesnt mean forgotton punjab one gets green card gets fame money winwin white im wish mixing cultures experience white people seem comfortable pointing white people wrong rather conversation nonwhite persons experience like ambulance go site accident reprimand unhurt drunk driver instead helping injured car crash victim white im wish mixing cultures experience white people seem comfortable pointing white people wrong rather conversation nonwhite persons experience like ambulance go site accident reprimand unhurt drunk driver instead helping injured car crash victim dont remember name subreddit people post links categories like p theres difference wanting people lovewell wishers know partners culture massively advertising whole world every damn thing absolutely super partners culture definitely would weirded becomes whole damn business obsession obsession doesnt look positively negatively way used worst thing world let thing reason population clickbaits p first western culture rigid indian culture secondly would care long side insulted fine nothing differenti would curious different cultures like big deal get offended others sharing experiences want change mind want say piece im multiracial pains blended cultures people accidentally something offensive live really white area yes might weird white person made business dont think things usually bad place think generally harmless dont even indian restaurants asian markets within hour drive live like non white people movies sure seen cash grab someone isnt white amazing see people look like big screen ppl geninunly like indian culture post abt rest know anything related india upload indians come rushing ppl different nationalities japan us reaching india indians flooding views likes subscriptons im missing money making market obviously reacting think india details legit youtube channel carolina goswami running since quite years even marriage even topic honestly feel worried indian men marrying non indian women problem bro checked youtube indeed think saying make whole social media life culture correct give example linked lets meet abroad yes made videos wedding india since traveling world vlogging indian china literally indian guy china think people common like sharing cultures learning cultures fun vlogging life theres nothing wrong think weird exhusband indian made point try understand eventually appreciate culture simply loved become world regardless obvious shes absolutely nothing new people often love partners culture theres plenty exotic ones recall couple italian guy greek guy indian man lived abroad years tell lots myths among western women indian marriages families oppressive vids help bust myths thats good thing even done marketing clout maybe helps non indian women decide whether theyll good cultural fit dated married indian men dont see whats wrong unless theres someones actively spreading misinformation standard pretty much every country lol people everywhere fascinated exotic things people opinions see foreigneraka exotic person react local traditions practices exotic perspective theyre kind drawn isnt indian thing like people think think indians anything western aspirational desiring white girls extension white girl obsessed india turn validation india shining theme doesnt like feted mylovefromkorea thats win win ask entertainment way escape mundaneness daily lives gateway fantasy whats matter comes long follows acceptable level moral code thousands thousands channels non indian woman married indian guy channelinsta culture reading start post fuck stop exaggerating looking multiple links end im going check im giving benefit doubt wow done research lol people consider insult sides exist seen two cases life best friend married white man never saw happy getting married marriage chsnged mind saw happy comfortable likes western culture free hasnt forsaken india second case white girl usa like younger sister specific liking indian culture loves specific parts wishes rakhi every year consider cases real appreciation cone without forgetting lot people get offended obsessed op made exact post rabcdesis days ago seems bit unhinged think used chat gpt white monkey jobs common china well unique regard india viewed poor cultural nation western world see many visit poorslum areas wierd things average indian wouldnt showcase peers back home country boost ego bro watched video bro fire dont insult bhindi ki sabzi methi parathas reminds home think wanted make point well made providing humoungous list creators think thats new propoganda technique shes white shes right u know ps tryna racist towards white ppl im pale asf u know cant racist nice think indian women marrying korean guys got laughed rabcdesis posting exact post id say anything white aspirational sure downvoting comment movies food comments youll see kind validations seek foreigners non indians marrying indian automatically inherit verified youtube channel instagram page see vlog everyday content feels forced exaggerated seems like woman exploiting partners culture personal gain attention strange inappropriate thanks channel recommendations proud embracing culture bet people indian cultured native indians dont annoying gate keeper share spread culture love people lol bro hurting ethots soaking indian mens attention money indiaindetails yikesshe way psuedoscientic videos black people pretending theyve never heard queen bigger audience whats problem op called globalisation also exists american husband initaly thailand etc explaining thanksgiving holiday norwegian wife guarantees least two builtin audiences every video endlessly replicable thanksgiving video went well easter independence day different cultural experiences foods whatever content mine youre charming dope watch eyeballs fair entertaining enlightening heavily researched funded programming television streaming services motivation clear like op probably knew taking angle topic would incite engagementboth positive negative weird thing actually going end spending lives knowing little surface level information thousands people internet instead ever discovering deep things family close communities nothing new tv circuses public executions celebrities royal weddings sporting matchesall competing attention prevent realizing worth neighbors individual humanity sacred divine within problem people afford create distractions prevent realizing research list channel phenomenal guide hehehee helps rather hurts big euro country lot ethnic minorities interested lot ppl us live dont know much germany considered best best country continent theres malice cares theres million weeabos youtube seems pretty harmless shows us different must rabid culture warrior nothing offensive comment like karl dude common thread channels indian guy nonindian women channels made guy many channels barely focus indian culture dumb compilation op one obsessed topic claiming people obsessed validation calm current decade poppsychology crap people interested cultures without requiring psychoanalysis whatever gets view always wondered watches vblogs guess lot people looking view counts subs weird kink hey showing primarily negative aspects boy girl gets citizenshipend deal say india average looking gori mem gori bhaiya legitimate career begun nd wave aryan invasion initiated fucking legend type channel well asian countries india im living taiwan tv shows invite foreigners different countries share experiences opinions local culture ton popular international youtubers well understanding relatively homogeneous societies innate human curiosity see outsider thinks culture especially aspects care thats well links continues link half channels youtube yeah married indian woman wore attire diwali thats going nuts stupid considered many viewers actually nonindians watched foreigner travel videos india see experiences treated everywhere india still interesting see new places frankly dont watch vlogs dont much idea comedy video pakistani angry thay daughter dating indian asked ur problem replies wouldnt problem son ur daughter watch community grow decrease logic applied wait black people queen ha ha ha aspiring hindu indian men loosing indias love jihad war lower middle class white girls documented via livestream vlog posts mean chutney toy boy postmodern peep pon aspiring indian boys night long zero logic reasoning maybe lots interracial couples love im sure could make list ones active youtube insta one spouse particular race try avoid selection bias dont see problem hand also people hunt scammers thats interesting shameful example wtf dude abnormal rare lot indian women western style channels one cares everyone indians start marrying foreigners less rare situations become youll find quite normal looks like people lapping people think tjis cringe end day laughing way bank kardashians clones done decades tried tested moneymaker anyway real cringe people getting offended indian personal affront somehow first thought well one way gain publicity without seeming obvious speak badly public country btw morocco nigeria indians feel pride someone non indian says something india discuss india people monetize one guy used reaction video youtube content hollywood changed indian movies channel exploded thats main content well brings easy money fair play anything foreign aspirational remember china korea japan australia singapore new zealand thailand etc eastern countries us anything foreign aspirational remember china korea japan australia singapore new zealand thailand etc eastern countries us lets get point india largest consumer youtube videos demand supply start coming mean whole childhood fair mom make sure dont stay sunlight much possible remain fair even skin dark color must kind attempt taken parents try make white would say programmed us hey white color fair skinned people think theres target lol dont see problem adopt show indian culture masses return get paid youtube rule never try argue woman twox subs conditioned portray women victims men animals daily matter context whos girl pic holy shit thought would point like channels brought school damn lot channels think answer lies number indian viewers fondness talk culture foreigner adopting even better look number youtube videos white people eating kurkure generic indian snacks reviewing half comments like proud indian bhai video someone eating unhealthy snack sol intention getting views makes proud indian yikes yikes yikes serious objectification going theres something depressing exociticising another culture afar living head dont know people stories lives beyond superficial things cant stop laughing im sure production team fake food one thing baffles foreigners even bother targeting videos towards indians infact going get lot money views get indians cpm abysmally low indian viewers globally uploading one video week average viewership around mil views translates low foreigners definitely work ethic guy procrastinating something importantp called business white skin lovers one side views hungry creators side damn gave nice idea need find pakistani girl marry hopefully every day two make clickbait title calling isi spy boom ill millions subs days could youtube promoting reason keep coming youtube feed even though never searched anything like legit genre youtube absolutely weird yall think us indians insanely obsessed culture foreigners praising culture w youtubers realized easy way towards ad revenue stuff username checks microgenre youtube vid popular bit young black people reacting dad rock phil collins stuff like wow damn crazy whenever see channels influencers always feel shethe western woman would nobody way fending good level validation hehehe oh right remember seeing videos back seemed cooled since though guys low confidence ones end abusive lol fact died month independence heartbreaking believe cant loyal culture loyal mine sub get links u mean legit genuinely interested indian culture economy country whole way round presented op ie married indian guy first made youtube channel embracing indian culture creating india centric content said rhet people slums always happy india dont like people glorify poverty first time read something gives impression isnt genuine work way friend married austrlaian apparently loves australia even likes aussie wildlifei shocked makes vlog get kinds abuse look mateno ones perfect biases well rightthat said channel videos go quite years back often praising india progress substantiated research well articulated articles glorifying poverty turn dont look poor nothing glorious poverty something like confirmation bias substanated research well articulated generally means articles written confirming beliefs applicable know american family second favorite family outside india u call stereotypical patriotic americans u see tv praise india something indian believe genuine love culture ps respect people say something along lines meri bole jo boli wah na choddu mai yo meri taraf se clear madam sorry whats point post like let people k",
    "light_cleaned_title": "Non Indian women marrying Indian guy and making her whole social media life about his culture is a legit genre in youtube and it is absolutely weird, what do yall think?",
    "light_cleaned_selftext": "I thought it was just a few interested in Indian culture, so i checked on youtube. It is a literal genre in there. Thousands and thousands of channels of a non indian woman married to an indian guy and their channel/insta is all about his culture. Literally nothing else. Its not like these channels have just a few subscribers. Its millions of subscribers, millions of views ,millions of likes. Its so damn weird. I thought maybe it is because of white skin obsession among indians. But there hundreds of channels of women from other non white ethnicities like middle eastern, black, chinese, korean,japanese, thai etc. Its really weird. What do yall think? EDIT: If you dont believe me i am gonna link a few here , these are some of the thousands of channels out there. People asking why I have jot it down, there was a post jotting them down in a sub , I just copy pasted the links from there. [https://www.youtube.com/@Jenniji](https://www.youtube.com/@Jenniji) [https://www.youtube.com/c/IndiaInDetails](https://www.youtube.com/c/IndiaInDetails) [https://www.youtube.com/channel/UCKrVABtlJe8apZSPK6eP20g/videos](https://www.youtube.com/channel/UCKrVABtlJe8apZSPK6eP20g/videos) [https://www.youtube.com/channel/UC2gZh8iGgLI7xLkxaoMkKSg](https://www.youtube.com/channel/UC2gZh8iGgLI7xLkxaoMkKSg) [https://www.youtube.com/channel/UCHGhWgNbi6Mt3C2pn98m1tQ](https://www.youtube.com/channel/UCHGhWgNbi6Mt3C2pn98m1tQ) [https://www.youtube.com/@myneighbortumul-indianlife5029](https://www.youtube.com/@myneighbortumul-indianlife5029) [https://www.youtube.com/@SnYdays](https://www.youtube.com/@SnYdays) [https://www.youtube.com/@AamandBasil/shorts](https://www.youtube.com/@AamandBasil/shorts) [https://www.youtube.com/@stayawara](https://www.youtube.com/@stayawara) [https://www.youtube.com/@anshmandy8088](https://www.youtube.com/@anshmandy8088) [https://www.youtube.com/@lokeshchinavlogs](https://www.youtube.com/@lokeshchinavlogs) [https://www.youtube.com/@dostinana](https://www.youtube.com/@dostinana) [https://www.youtube.com/@1turkish1indian43](https://www.youtube.com/@1turkish1indian43) [https://www.youtube.com/c/MithileshBackpacker/videos](https://www.youtube.com/c/MithileshBackpacker/videos) [https://www.youtube.com/c/LegionsLife/videos](https://www.youtube.com/c/LegionsLife/videos) [https://www.youtube.com/c/ProTarun](https://www.youtube.com/c/ProTarun) [https://www.youtube.com/@-KorindianDiaries](https://www.youtube.com/@-KorindianDiaries) [https://www.youtube.com/channel/UCmCf00nmCloUBqeWMWt-gfA/videos](https://www.youtube.com/channel/UCmCf00nmCloUBqeWMWt-gfA/videos) [https://www.youtube.com/c/IndianItalianCoupleWorld/videos](https://www.youtube.com/c/IndianItalianCoupleWorld/videos) [https://www.youtube.com/c/Nomadikker/videos](https://www.youtube.com/c/Nomadikker/videos) [https://www.youtube.com/channel/UC9fHmD77xVEGHUq1U3mtoqQ/videos](https://www.youtube.com/channel/UC9fHmD77xVEGHUq1U3mtoqQ/videos) [https://www.youtube.com/channel/UCcToWOuqIUrsuBz9wO6t-4g/videos](https://www.youtube.com/channel/UCcToWOuqIUrsuBz9wO6t-4g/videos) [https://www.youtube.com/c/INDIANLIFEINRUSSIANSTYLE/videos](https://www.youtube.com/c/INDIANLIFEINRUSSIANSTYLE/videos) [https://www.youtube.com/channel/UCWyA43e4Fce5LhDF-0CQalg/videos](https://www.youtube.com/channel/UCWyA43e4Fce5LhDF-0CQalg/videos) [https://www.youtube.com/c/Lushal](https://www.youtube.com/c/Lushal) [https://www.youtube.com/@ahzmiandazhar6719](https://www.youtube.com/@ahzmiandazhar6719) [https://www.youtube.com/@keyannaanderson3128](https://www.youtube.com/@keyannaanderson3128) [https://www.youtube.com/@jarrydthabang9199](https://www.youtube.com/@jarrydthabang9199) [https://www.youtube.com/channel/UCrRLCxHC7avNO1z8fWMIX2g/videos](https://www.youtube.com/channel/UCrRLCxHC7avNO1z8fWMIX2g/videos) [https://www.youtube.com/c/LetsMeetAbroad/videos](https://www.youtube.com/c/LetsMeetAbroad/videos) [https://www.youtube.com/c/BasantJangraVlogsvideo/videos](https://www.youtube.com/c/BasantJangraVlogsvideo/videos) [https://www.youtube.com/c/ForeignerinIndia/videos](https://www.youtube.com/c/ForeignerinIndia/videos) [https://www.youtube.com/c/InternationalFamilyVlogs/videos](https://www.youtube.com/c/InternationalFamilyVlogs/videos) [https://www.youtube.com/c/TheIndianPolishConnection/videos](https://www.youtube.com/c/TheIndianPolishConnection/videos) [https://www.youtube.com/c/IndoIranianLovestory/videos](https://www.youtube.com/c/IndoIranianLovestory/videos) [https://www.youtube.com/channel/UCBEYrN24T2HB9sN5aGuUQKQ/videos](https://www.youtube.com/channel/UCBEYrN24T2HB9sN5aGuUQKQ/videos) [https://www.youtube.com/c/premkimforever/videos](https://www.youtube.com/c/premkimforever/videos) [https://www.youtube.com/user/MarikaGeorgievna/videos](https://www.youtube.com/user/MarikaGeorgievna/videos) [https://www.youtube.com/channel/UCDucpnFtfpZxEx0j8sTpmUA/videos](https://www.youtube.com/channel/UCDucpnFtfpZxEx0j8sTpmUA/videos) [https://www.youtube.com/channel/UCWf9w7kBZapELBH4L203leA/videos](https://www.youtube.com/channel/UCWf9w7kBZapELBH4L203leA/videos) [https://www.youtube.com/c/PiyushHarne/videos](https://www.youtube.com/c/PiyushHarne/videos) [https://www.youtube.com/c/IndianInChinaVlog/videos](https://www.youtube.com/c/IndianInChinaVlog/videos) [https://www.youtube.com/c/RomiesVlogs/videos](https://www.youtube.com/c/RomiesVlogs/videos) [https://www.youtube.com/c/MukkuOksii/videos](https://www.youtube.com/c/MukkuOksii/videos) [https://www.youtube.com/c/TasyaSelfMom/videos](https://www.youtube.com/c/TasyaSelfMom/videos) [https://www.youtube.com/c/NamastefromUSA/videos](https://www.youtube.com/c/NamastefromUSA/videos) [https://www.youtube.com/channel/UCxq523tQwXhcgDDqBuwoiMQ](https://www.youtube.com/channel/UCxq523tQwXhcgDDqBuwoiMQ) [https://www.youtube.com/channel/UCwvWq7bx1t8MNrdXjD\\_YheA/videos](https://www.youtube.com/channel/UCwvWq7bx1t8MNrdXjD_YheA/videos]) [https://www.youtube.com/watch?v=5WeseXWeS1c](https://www.youtube.com/watch?v=5WeseXWeS1c) [https://www.youtube.com/c/RamandPie/videos](https://www.youtube.com/c/RamandPie/videos) [https://www.youtube.com/channel/UCEwRYOwLLu4GQJIr\\_nuU7wg/videos](https://www.youtube.com/channel/UCEwRYOwLLu4GQJIr_nuU7wg/videos) [https://www.youtube.com/channel/UCTXEBNXZQ4ZaC4u9PMMOjBw/videos](https://www.youtube.com/channel/UCTXEBNXZQ4ZaC4u9PMMOjBw/videos) [https://www.youtube.com/channel/UCVpLFuaXLL-FwVeTNGprYPw/videos](https://www.youtube.com/channel/UCVpLFuaXLL-FwVeTNGprYPw/videos) [https://www.youtube.com/channel/UC\\_xUnjvDyVBdTguDrkTjWSw](https://www.youtube.com/channel/UC_xUnjvDyVBdTguDrkTjWSw) [https://www.youtube.com/c/Elizab3thJoy](https://www.youtube.com/c/Elizab3thJoy) [https://www.youtube.com/c/abhinavkari](https://www.youtube.com/c/abhinavkari) [https://www.youtube.com/c/AmanSara](https://www.youtube.com/c/AmanSara) [https://www.youtube.com/channel/UCiN83YWd65Ta4NAj3cpHzPg](https://www.youtube.com/channel/UCiN83YWd65Ta4NAj3cpHzPg) [https://www.youtube.com/@OnlyOneGiulia/videos](https://www.youtube.com/@OnlyOneGiulia/videos) [https://www.youtube.com/@TravelVlogIv/videos](https://www.youtube.com/@TravelVlogIv/videos)",
    "light_cleaned_comments": "You do understand how marketing works right. It's the same reason why you have an entire genre of folks reviewing Indian movies who are not Indians. People can do what pleases them as long as they’re not doing anything illegal and no attempts are made to generalise any community. That’s pretty much how YouTube works. People watch whatever is interesting to them. This is perhaps one of them I don't see that as a problem. General channels putting daily vlogs are the problem not someone trying to create a niche for themselves. And that's how YouTube works. In my personal opinion, its beautiful how two people accept each other's culture for love. Isn't western culture the dominant one? Everyone is already familiar with things. How many people would watch a video of an Indian woman going to Arby's. Today I spoke only English with Americans. First time trying Pumpkin spice latte. Shopping in a farmers market/Walmart. Celebrating Thanksgiving with my husband's family. Today I tried traditional american lululemon and uggs No its great that people show their different lives so others can also expand their horizons. What are they actually marketing? No it is more about the lack of good content creation by Indians. Most of their viewers will be from India itself and not from other countries. The girl in the picture is not married yet and lives quite nearby to where I live Not my monkey, not my circus. Maybe algorithm pushes such videos more, but you shall see not much of it if you click on *not interested/don't recommend such videos*. Damn u found so many channels Get a novel exotic theme from a foreign culture that you have heard about but have no idea of, get more traffic,more sponsors and more advertising money. \"Culture\" It is not just non-Indian women. It is foreigners of all kinds posting videos about India. It is Indians too. It is Indian women married to Indian men who are IPS, IAS, army officers etc who have no quality content, nothing worth watching but is a primary income source for them. Why? Indians are huge in number, lazy with an internet. They comment on these videos like simps and go crazy that they are being talked about because of inferiority complex and validation. The comments are really cringe. Who cares let them do there thing dude, ikr, it's so wholesome. I've seen american-japanese couples doing the same, but people don't see a problem with that. inferiority complex bohot bhad gayi hai desh mein istg What was your keyword , you got so many channels There are a billion indian viewers. They're just targeting a large market. Ig it's coz India is the most populated country and our audience is emotional fool. We feel proud getting validation from foreigners that our country and it's culture is great. Is she that German female? What do you mean by ‘absolutely weird’? Lol its the \"Today I packed in my husband's lunch box.. bhindi ki sabzi, methi parathas which are very good for health, this aam ka achaar, for snack I packed moongfali, and yummy yummy fresh nimbu paani\". These are like women in mid 20s and I'm a fucking legit uncle, and even women my age don't behave like this!! If it's not harming anyone then how is it a problem? Yep No it is not weird. It’s their choice and their way of marketing themselves. If it suits them and harms no one then there's no reason to make a fuss about it. Indian women marrying Indian men are also making similar type videos. Suits them. Harms no one. Nothing to fuss here too. There are many consumers to such content. No hate being spread, no propoganda thrown. A light pastime. Don't stress yourself unnecessarily, OP. Wow we get the point , you didn't have to create a whole godamn archive , you're just promoting them now . And yes it's not just wedding stuff look at the reaction channels and foreign vloggers sugar coating and giving that sweet validation it is OP posted the same thing on ABCD subreddit and got called out. Why do you care what they do? my man did his research 💀 It's cause we are a huge population and most of them get boners for white people validating anything Indian. I'm increasingly seeing white people just so much as \"mentioning\" india or anything Indian and their views spike like crazy. Don't even get me started on the hard simping in comments. I mean I think it's amazing that people are appreciating each others' cultures. But let's be real here. 80% of them are just in it for the money that comes with crazy views. Not sure that's accurate observation. I'm from Kerala and we have hundreds of travel vloggers who go all around the world. Matter of fact, recently a malayali travel vlogger was even in Sudan when the war broke out. I want validation about my culture from white people. /s I don’t see what’s wrong about it. Indian culture is difficult to assimilate into as an outsider, and these women just create content based on their experiences, showing a different lifestyle. It’s quite normal. I think it’s awesome that they accept it so well. >i am gonna link a few here Bro pasted the entire channel list of YouTube. XD The world is a pretty big place you never known what people will like, plus they are just living life, not bothering anyone, let them enjoy and have fun. 😅😂 India is the world's biggest market and it makes sense for people to take advantage of it It's vice versa also. Indians also do the same when they stay in other countries or get married to someone from other countries. Sudhir will make a show on culture zihad, u gave him an idea😅 pandering to indian audience is a good strategy... 1.5 billion people generate a lot of clicks and ad revenue... Lol that fuckinlegituncle This is some research lol My favorite Youtuber is a Non Indian guy married to a Indian Girl and made his whole Social life not only the culture of his wife but of entire subcontinent. And his videos are wholesome. We are suckers and watch the videos and them views. If China had an open internet, they'd be reviewing Chinese television. It’s not like they are getting into a fake relationship just to make a YouTube career. Fact is there are so many Indian immigrants in western countries so it’s only natural that a lot of them are now engaged with foreign partners. Karl rock? It's not just validation from white people, it's validation from any foreigner. We are extremely insecure about our culture and we love praise. There are a multitude of low effort reaction videos by foreigners on random Indian things which get lakhs and lakhs of views. India is a goldmine for views. >I am gonna link a few here. Literally links every channel of genre. >traditional american lululemon and uggs Lmaoo 😹 There are thousands of Instagram accounts of small underage kids managed by their parents. Kids, who should really be playing in the parks, watching cartoons, do stupid things like any other kid would while normally growing up. The bad part about this, parents putting up “DM for collaboration” in bio and invading their children’s privacy online where creepy individuals gets to see sensitive moments being put online for attention and views publicly. This is a sad beginning of a generation growing up on reels, lacking important human experiences as an innocent future of tomorrow Most indians would go bonker if they have to choose between : Sex Food White skin praising us Op, As you have worked hard to gather data, can you tell me how many of those girls are non white? I mean we are 1.5 billion here. And patriotism, sentiments about indian culture and respect for Indian traditions are our weak spots. So it is not shocking that people are taking advantage of this to make money. There is an Instagram influencer who is dating a Korean guy. She has made her whole influencer career around \"dating a Korean\" she literally posts thirst trap pictures of her bf and the Indian kpop fans are drooling in her comment section. So it works both ways actually. Too many Indians with access to the internet, that's why. You cracked the puzzle! Every \"influencer\" wants their content (travel or culture related) to include content from China and India. It gets the clicks and views that no other group can provide. Since the influencer accounts are based outside of India, presumably, their remuneration package from YouTube is far more lucrative than if it were a China/ India based account. quite a few, check from the bottom of the list Every \"influencer\" wants their content (travel or culture rekated) to include content from China and India. It gets the clicks and views that no other group can provide. Since the influencer accounts are based outside of India, presumably, their remuneration package from YouTube is far more lucrative than if it were a China/ India based account. Its a career option It would be interesting to see what happens if the roles are reversed and Indian woman / man marrying non Indian and then they make their insta about foreign culture or country. Would they get shamed for not promoting their own culture or turning on their culture. Would the man get it rough or the woman? It would be very interesting to observe the same. It's the same with many Indian women married to Non- Indians especially Koreans and have their whole channel dedicated to Korean culture. It's more like obsession at this point. Its easy to get views and followers. We have around 600m smartphone users. Even if 1 % people crave validation from foreigners, that makes 6m followers. And in reality that number is higher than 1% nah i tried to find, there were at most 5-6 channels that i could get, i got more korean woman indian man channels which is surprising. YouTube and Instagram Tbh, a video of an actual Indian resident going to Arby’s would do well in India. Maybe if they just stay off the beef, lol yup Search engine and algorithms reward youtubers if they target a huge number of people. The word \"Indian\" and \"India\" are buzzwords which make sure that such videos are shown in your feed as per your location. This makes an Indian a target audience and we Indians represent almost 17% of world population. So it makes sense to make videos on anything that is Indian. What difference does it make to your life? People have terminally online syndrome these days. I am surprised that's the only number of channels you could find.....I have come across at least 20 of those channels on insta. Don't ask me to link, i don't care to follow or save their channels. Also i am not trying to compare both of these, so numbers don't matter to me. To me both are absolutely ridiculous obsession. Edit: the 20 i mentioned were married ones 💀 Indians patriotism can easily be taken advantage of and used to generate revenue. We feel validated and boastful when foreigners adapt our culture and think we are great but in reality we are being used by them to get money.. Bro, the weirdest shit is you cataloging all these youtubers. wtf. yeah i know what you are saying, i tried to find only married ones ,thats why ig Foreigners making money by showing India to Indians who’ve lived here all their life 😂 They cracked the code and it’s us who are the fools. They make millions just by recording themselves taking shit on toilet. Why wouldn't they do it ? It made them millionares just by eating, sleeping, shitting and pissing. No hard work , nothing no 9 to 5. No balance sheets, no forecast model , no investment just raining millions just because we have lot of pervs in India who like to hila watching those cringe foreign wives. They just want to get validation. Of course, there are millions in the audience who will lap up this. India is the biggest market for social media. Every business wants to exploit market. This is nothing new. And millions out of them who are obssessed with Goris! > i am gonna link a few here Wow. You really don't know the meaning of few. That's not a few. What unemployment and cheap internet does to 40% of the mfs in India I mean that's just giving what sells. Everyone could use a little fame and money. Youtube views give them both. She knows many Indian guys like White girls. They’re just using the demand and making cash 1. India is one of YouTube's largest markets. So you can see people injecting Indian elements (like Indian celeb pics in body building videos)even into otherwise regular content. So it's not a surprise that you have videos specifically targeting Indian audiences. 2. Indians love being validated by whites. These 2 imho guarantee a fair view count/subscribership. India represents the single largest market in terms of viewership numbers for YouTube, IG reels and FB shorts. It’s an easy, cheap money making tactic Not marketing anything, “selling” validation Me reading this post while travelling with my non Indian girlfriend and making YouTube videos 😭😭😭 ***laughs in Jaby Koay*** White supremacy I'd guess My comment on same a few days back I remember this! He was downvoted heavily too I believe. They are getting called out here again Seems like some of you guys have too much time. Having issues with almost everything harmless that goes around. Social media is business. You make videos which gets you the most views. We are over a billion people which brings them the required views. A white or a foreigner doing anything remotely related to india makes u a fortune on social media. Thanks for increasing their subscribers Nope We have all kinds of genres and considering how much we Indians love it when some foreigner shows love for our country or culture it's not at all weird or surprising for me Meanwhile Indian men watching this be like: these foreign women are good and sanskaari why can't indian women be like this 😭 We Indians crave validation from foreigners, especially whites. We have a vast jobless population and world's cheapest data. So for any content creator, India is a huge market for garnering views. Hence content by foreigners on Indian topics is a major genre. It includes white women married to Indians, foreigners reacting to all things Indian - dance, music, actors, food, movies, places, economy, military, and everything under the Sun. You have an option to just not watch them? Are they forcing you to watch their content? There are youtube channels available for every weird kink in the world you can imagine. For eg. Linking their channels here because you hate their content will definitely bring unnecessary hate on their channels. Just not cool dude. I agree. They have found their markets. Not an Indian but to be fair, it’s not just Indians dealing with these cringey shit, it’s also a lot of other ethnic groups, my country including, coming from a small country in Africa and ppl are absolutely obsessed with us, they review our music, react to our food and our women’s looks. I guess nothing can be done because the internet is an open domain and any idiot can target any group of ppl for whatever reason, mainly for marketing. Game is the game brother, in this age of earning money via social media, it's upto the person what they do and we are free to follow or ignore based on our preferences. I understood long time back that the things I've considered as crass/cringey had huge following and the niche that interested me were weird for many. Simply put, it's a free country/world. As long as what they are doing is legal and somewhat ethical, it should be fine. There is a quora writer who married a guy from Bihar and made her day job to bs about day to day life. Iirc, her name is Samantha Aur kahan milega itna content. ~ Kunal Kamra As cringy they are , you are worse . Also some of the ones you mentioned are basic travel vlogs . There are a good amount of channels about foreigners in Japan , Korea and germany and what not. Not sure what's your problem. That's the worst part. And those- see foreigners are accepting our dharma so why are Indians gravitating towards SHAMELESS foreign culture. So brain dead of these idiots Have you ever seen a teenager moving abroad for 'studies' fir wo bhi hamara kahan rahta hai? I think that's just weird. Their channel. More subscribers and views means more revenue from YouTube ads Don't forget all the Royal Enfield \"review\" videos of the non-Indians. The population. T-Series has suggest subscriber base because our population is high and T-series is a well known well established brand. A brand of similar stature in small country like Uk would not have that kind of subscriber base because the country’s population is low and hence people who know the brand and relate to it are low. Indian population is so high, the number of YouTube views generated would be very high as well. So content on Indian culture works. These might also be people who were already married but now that this genre is rising they started making content out of it. WTF is that!!?? Anyway agree with your point. bruh make some orginal posts , this post is ditto copy from a identical posts from abcdesis sub It would be particularly weird if the HUSBAND isn't really into Indian culture, himself, but white wife is. Because it implies that he's sort of just this prop in his wife's fantasy. Though a lot of the channels you linked seem to go both ways (boyfriend/husband and his experiences with his wife's western culture.) I think you posted this same damn post in r/ABCDesis last week and got flamed for being weirdly obsessed with indian people marrying non indians. So you must have decided to post it here expecting a different response. Lmao. Leave people alone. It's cringe, but it's a hustle, everyone out here trying to make money. Their own countries social media channelts are probably overcrowded at this point, and they're carving out a niche of their own. What that says about Indians, and our obsession with validation from white people is something else. I don't think it's that bad, if she's obsessed with Indian culture it's alright everyone has their preferences, what's odd here is the scale at which she's doing it on social media. It's kinda ironic that OP has marketed all these channels on a subreddit of over 1m Indians :D as others have mentioned, it gets clicks from thirsty Indians and from clueless curious westerners..you can give a culture clash twist to it..it gets the clicks and so the money...nowadays everything needs to be monetized and used for entertainment. We had major drug tragedy here and now we have an \"exciting\" fast paced show on netflix making light of all these people who died.....stop paying attention these things and focus on your own self improvement is the only way forward. Generic influencer/vlogger revenue model. For example, \"Our Stupid Reactions\" on YT grew to have an entire team of Indians working under them to manage review recommendations and content. Their income sources were YT and Patreon, afaik. They had also interviewed Pankaj Tripathi and AR Rehman the last I watched of those two. This happens with many other nationalities and cultures as well. This gives them double target audience. Western people who are interested in other cultures and people from other cultures who like to watch foreigners explore their culture. With robots & A.I. taking away many jobs people will turn to this kind of gigs to earn their livelihood. Somehow I feel the viewer traffic on that content will be driven by Indians too. 🙉🤦🏻‍♀️ Hah, my first thought was one sponsored by Arby's Roast beef sandwich deal. Like a shock video gimmick. Be like an American posting videos of chowing down on Bosintang. You do understand that you are doing marketing for this. We understand it too. Well if out of those 1 m there are people who will get hooked on these channels let them be. Maybe they deserve that. So I actually went through some of the links and was rather surprised to find so many channels with the same concept.... Kudos to the OP for the links !!! Although I must say... I went through 10-15 links ... And I found it to be cringe. Sort of made me sick to my stomach. Literally! The video titles specially - Going out to dinner with my 'American' wife Going to meet with X with my 'Italian' wife How I met my 'Turkish' wife (FFS) Also gotta realize with India's social media population, India becomes an easy soft target to gain more followers/subscribers. And the fascination to gain immediate approval by talking/speaking to a 'white' foreigner/expat never dies. Indian's have a weird fetish of seeking validation from non Indians especially fair skinned non Indian. Some take this one step forward beyond social media. Use it as an opportunity for proxy entry into Indian politics - la Kirandeep Kaur ('Waris Punjab De') Nothing weird. Yall are just nosy and think ur entitled to have a say cause it's \"our culture\" Now let me see u commenting on interracial couples where the Indian completely adopts American culture. Obsession with Western culture is so internalised it comes out in many ways An average Indian is obsessed with White people. And a lot of them have figured it out. A white person doing anything basic pertaining to India, Indians, Bollywood etc will get million views very easily. Not really. I know Indians who are married to foreigners and it ain't like this. This is happening solely because of the majority of Indians feeling good about getting attention and validation from foreigners and they are monetizing on the same. Just go see the Jaby Koay channel. It works on this psychology. They started out reviewing content/movies from everywhere but became completely Bollywood focused after the attention and positive responses they started receiving from Indian people. Not saying that their content is low effort or that they don't respect our country, because they do and they've actually been putting a lot of effort into their content, given the large audience their channel is garnering. But the psychology behind it all is cringe. Themselves lol It's her choice. Why does it bother you?! Thanks to our infinite fucking abilities, we are a country with hundreds of millions of internet users. Our obsession with fair skin, makes us like anything that supports it. These YouTubers are earning solid money through their content. They aren’t harming anyone. They’re just making hay while the sun still shines. >Not really. I know Indians who are married to foreigners and it ain't like this Well on the contrary, I know Indians who are married to foreigners and are like this. Well I guess we find all types of people. >Just go see the Jaby Koay channel. It works on this psychology. They started out reviewing content/movies from everywhere but became very focused on Bollywood after the attention and positive responses they started receiving from Indian people. Not saying that their content is low effort or that they don't respect our country, because they do and they've actually been putting a lot of effort into their content, given the large audience their channel is garnering. But the psychology behind it all is cringe. I'm not supporting Indians/Foreigners here. I'm just saying things can be either way. 🙂 People sell the most what people buy the most, it is as simple as that holy shit. someone fell really deep into that rabbit hole haha The post felt like - WHy sHOuld thEY prOMote InDIa? Pretty understandable, if they are into \"ancient spirituality\" india is the best. Look at for example gwyneth paltrow, she is selling energy rocks and shit. Much better then to join an allready existing culture than trying to invent your own. No it's not weird. There are many foreigners who really look up to India - many foreigners are actually have more pride in India's culture and history than some indians themselves. So maybe it's that interest that let them met an Indian guy, and it's that interest and enthusiasm that make them shoot videos about \"his culture\". Tbh as an American with boring taste in videos, I would probably watch all of these if they showed up on my YouTube recommended indians should stop giving these people free views. this will never stop so neither will the 'make money quick' schemes. I haven't seen this longing for external validation from Chinese people compared to Indians nor the infatuation with the lighter skin tone(you could credit that to them having a large strata of lighter skin tone populace). So even if Chinese had open internet, I don't see how foreigners could gauge their attention by reviewing their culture/media. I watch Karolina Goswami (India in details) and it is good. She provides sources to her claims etc and generally makes good content. Her personal life seems good to. She is married to Anurag for 7 years and also has kids with him. I don't think its weird. Yes, you should remember your roots, but there is nothing wrong with appreciating and adopting some of the cultures of your spouse. A small scale version of this is females migrating from south india to north india after marrying a north indian. Yes she should keep her south indian heritage in mind but there is nothing wrong with appreciating and participating in north indian culture. I don't think they married just for starting a youtube channel. They might have married for other reasons such as love etc. And now they have this opportunity in front of them. Indian people love seeking validation from western people. And these youtubers could tap into that to reach more audience and make more money. But there is nothing sinister about what they are doing. They are seeing an opportunity and taking full advantage of it. Actually saying that this is weird could be construed as racism. Because you are insulting immigrants on the basis of their ethnicity. That is the definition of racism. Yet to be classified mental disorder ? The other way around as well. Some men also married Indian women and moved to India. We like it when white people validate us That's not true actually... They have the same ingrained biases and insecurities as we do. Their aspirations and fallacies are the same as us - in the sense that they're defined by the western gaze. It just doesn't appear out in the open because of language and communication barriers. However they don't have the same level of self hate as much as South Asians. > I thought it was just a few interested in Indian culture It's not that weird or uncommon in many western countries. Yes, the channels and \"influencers\" are probably cringey af. There's too many listed here to even begin to look at and not interested in these people anyway. Where I live in the US we have a large amount of Indian immigrants ( immigrants in general, as most places in US), Indian communities, grocery, shopping, restaurants. Interracial marriage is not weird or uncommon and both cultures are usually embraced in a relationship, esp when one is living in a country probably very far away. Source: am non Indian married to an Indian Maybe we’re just a little curious as to how non-Indians would view indian entertainment. Its modern day colonization. Same way chai latte, turmeric milk, yoga, chakras etc have become mainstream in the west. Its seriously disgusting. Lululemon is Canadian, UGG is Aussie lol You married an Indian, you knew what you were getting into. Period Haha😂 Chinese and no infatuation with being light skin? 😂😂, now ask Chinese about this, all Asian countries are the same, only if you could see their weibo(social media over there). I don't see why this is a problem or even a talking point that's worthy of a post? >I thought maybe it is because of white skin obsession among indians. Why do you immediately think of an inferiority complex among other Indians when you see such videos??? Weird Bruh, there is a good chunk of Chinese and Koreans population who are obsessed with being white and pale af. [Fair skin has been an historically obsession in east Asia.](https://nextshark.com/east-asian-pale-skin-beauty-standard) Money 💰 China is one of the biggest markets for skin lightening. Infact not just China, but the entirely of East Asia. The rest of Asia (south asia, south east asia and middle east) comes a close, very close second. Similar is the craze for western validation. Again neither of this info was available to you due to a.lack of open internet in china and b. you (assuming) not being a part of relevant online communities (like kpop, cdramas, kdramas, asian makeup trends, weibo and weverse etc). Not judging or anything, but I'm impressed OP spent so much time finding this many channels and linking it here, and OP doesn't even like the genre or the videos. Social media engines refine and present content according to your own interests based on your clicks. There is no genre in youtube it is just a collection of what people clicked next. You have white families reacting to Bollywood movies, Americans reacting to Indian music etc etc. They are just increasing their audiences. You name a category and there's probably a few content creators catering to that subject. I'm just here for the vlog where it says she was a spy for her country and used me,lol. Okay, apart from the marketing reasons for targeting overpopulated Indian viewers another reason can be that foreign women appreciate Indian men, unlike privileged desi girls. Just saying. What’s so weird about this.. the weird thing is you posting this lol.. it’s definitely a new phenomena happening in india but an obvious one since there’s such an influx of singleEuropean women coming to India to live. I’ve seen this trend with Indian-Korean couples as well Average right-winger Gotta say I just got time to check the 1st channel, but respect to her Kannda, its really good. Doesnt look like a cash grab at all, looks like someone who genuinely integrates. Gotta say I just got time to check the 1st channel, but respect to her Kannda, its really good. Doesnt look like a cash grab at all, looks like someone who genuinely integrates. Gotta say I just got time to check the 1st channel, but respect to her Kannda, its really good. Doesnt look like a cash grab at all, looks like someone who genuinely integrates. Tumko dikkat kya hai bhai. Acchi baat hai - people are spreading our culture Reading this as a non Indian who stumbled onto this by accident is so funny because it's the exact same that that these man say here as well . It's the same in germany. These im from XXX living in germany kind of videos are really popular You mean the passport bros who go to poorer countries looking for traditional, submissive women, because they hate the 'wayward modern women' of the west? Samantha is a writer who married a Tamizhan. She published 2 books. Jessica is a Podcaster who married a Bihari and creates hindi learning content. I only clicked on the first link, and I gotta say that woman is doing the best job speaking Kannada that I’ve ever seen any white person pull off. Pretty amazing stuff Their views have declined sharply over the past year or so and that makes me unreasonably happy. Hate these \"reviewers\" selling validation. Its just business to market to other than indian locals As an Indian married to a non-indian in this thread, finding out that my wife can be my sugar mommy: Yeah, kinda but most of them are in their 50s Lol Not just YouTube, there’s a next level of cringe that happens in Quora where a white woman called Samantha has married some Tamil dude. You have every mother fuckin Indian irrespective of gender, age or state having a group orgy for whatever the fuck she does, ordinary things like wearing a saree or eating a ladoo gets hundreds and thousands of upvotes. Are Indians so pathetic that they want validation from every white person? You were the target audience cos you seem very interested. I remember in 2012 there was a channel (Ray William Johnson) reviewing all kinds of weird youtube channels. One of them was a guy just farting apparently, and it seemed to have audience. So there is a crowd for everything. The content creators are making money since there's a lot of people watching that shit - Capitalism at its finest. The only thing weird in this is that you do not seem to know how money works Discovery, tlc, nat geo, fox etc. have been doing this shit for years Sab views k bhuke hai. Gorey log target indians to get views. India, indian culture, indian food, gorey ladki wearing saree mention kiya toh kaam easy hota hai unka. Men manipulating their way out of holding themselves accountable goes beyond borders. Wahi to problem hai, bhai sahab ko. Mithilesh Backpacker randibaaz hai. Feeds the \"Our culture is best\" philosophy It's unoriginal and very cookie cutter. ![gif](giphy|vHolffNR6Oi6UpHMOa|downsized) Well most are lonely guys in their 50s, who have married some divorced woman with children from another country(mostly Thailand), I don't really believe that the wife's are the victim here. Holy shit dude the second one just straight up seem like a propoganda channel , with psudo history damn it's got over a million subs tf Also thinking about the guy she married…kya kismat hai re teri I'm American and this comment made me laugh really hard, especially the Walmart part. Anything india gets insane views especially when it involves a white person. I rather watch American doing American things. Like Red necks shooting guns in their backyard aur some kid shooting others. Jokes aside, I usually watch their tutorials on tools and stuff. And then watch the same thing by an Indian cause he would have found a much simpler and easier way of the same. Regardless, the power dynamic's skewed towards one person more. Indian love validation from foreigners. Its the same with koreans now. Indians have started loving validation from them as well. So now everyone is doing such content. It's really weird and awful and I can't decide whether it's just cynical pandering or brainwashing. (I am a foreigner living in India, BTW. And I love it here but I can honestly say I've never posted a cringey YouTube video about \"my experience of India\" \":) ). Indians are #OBSESSED With foreigners simping over \" Indian \" culture. Not all 1.x billion of us ofcourse but a LARGE number of us. I vote the: “OP is the women in the first link” conspiracy theory. Hot girls tho. Ngl Real baat pe right-winger bol dunga, r/india hi h cool lagunga Yeah, in the wife's directon. He makes the money, but usually, these women are married(so 50% of the assets are his and in most cases, has to pay alimonies). Also, and usally these kind of women aren't that kind of shy reserved type of person. They know what they want and how to get it. Idk man I think this is just a white woman thing. Like, they’ll marry someone of colour and suddenly that’s their whole identity now So what. If they showed no interest there would be complaints. Now too much interest? I don’t see a downside Bollywood has been hiring white chicks from eastern europe for the back of their item songs for a while now. It happens in every country with a more homogeonous population. These people are just doing the same and following the simp money that wants to see hot foreign chicks. Few years ago, when vlogs about personal lives were just new , it didn't make sense to me why people want to follow someone else's life. Literally , they were like about eating breakfast together kind of stuff , playing with kids ....Like daily routine stuff. This family is all white and the followers were also white. I asked a fan of that show and he mentioned that his family was dysfunctional and never knew what it was like to have normal life. I think most of these people have personal tragedies and these shows give them emotional satisfaction. china, japan and korea's obsession with light skin is the only one in the entire world that is greater than india's. it's so bad that most people don't even know that these countries ahve people with medium/tan skin. they are also in a foreign environment where they don't usually speak the language and have trouble communicating with people outside of their husband, completely dependent on them for money, and out of their comfort zone/familiar environment. totally not a perfect recipe for abuse Curry and kimchi something? Idk. I've heard plenty of horror stories involving abuse. These men will try to have the upper hand at any cost. It makes sense that these women will get vicious too. Anyway, the point is the men sought these women out because they know their living conditions aren't the best. This is in itself kind of self-serving and dishonest. It's also hard to blame these women for trying to survive. The reason you're saying that because men are more likely to marry a non-Indian person because men are more likely to go abroad for different purposes than a woman. Same way you'll see most Indian people who make content about abroad are mostly men. There's significant imbalance from the start. That's why you see that same imbalance everywhere. You had so much time to put up this rant and post so many links. Yes, but another American tradition is not knowing things are not American and claiming them as your own. Damn, didn't expect germans to be the same. I thought, that's in Europe, why would they need validation? It looks like it's just 'mericans capitalising over any foreign culture. Wow, that's a lot of channels. Chad Indian guys. Wow had no idea something like this existed. I'm glad that reddit is pretty much the only social media I'm on. How did you even come up with this list? Obsessed maybe? Looks like there is an audience for this kind of content if you found so many. Dunno what the rant is about to be honest. Well, it's nice to hear what other people's think about us and see how foreigners see germany and it depicts something familiar through a different lens. These kind of things work quite well with audiences. If you then put in some harmless but true stereotypes, where you can relate to, it makes some pretty good content. This also works the other way. Indians marrying a foreigner and making their entire social media just around it But it's not like *all* of them will end up abusing. If a guy with low confidence and a woman who wants to move away can benefit from each other, what's the harm? The presumption of every woman as weak and vulnerable is getting old. I realized how different my yt recommendation changed permanently when I went to US just for a week. summon indians for easy views With 7+ billion people in the world, everything is a genre This is nothing new, [Ananda Coomaraswamy](https://en.m.wikipedia.org/wiki/Ananda_Coomaraswamy) is a famous indologist whose seminal work created the field of Indology. His father was a Sri Lankan Tamil but mother English, although his father died when he was young, it’s his mother in the late 1800’s who introduced Ananda to Indian art and culture which she had to study herself and making him what he later became. I believe this is a common phenomenon, when a woman marries below her status in their society they give up their previous identity and fully immerse in their spouses identity one reason being they get recognition from the adopted community for it. Sociologists have studied this phenomenon. White women marrying black men, immerse themselves in black culture for example. Boring taste? You really care about random strangers opinions of what you watch on your free time,bruh? Lmao wait until this normies op discovers other weird stuff on yt. Like pimple popping asmr. This should be at top! views is the fire that feeds all. I agree with you to some extent. But not every case follows this path. And fuck those reaction channels too... 1.5 ? Dude u living under a rock ? Well i can't blame u really feels like yesterday I consider my own taste boring lol, not really worried about what others think of it What changed, if you remember? My non-desi wife hasn’t ever even tried on a saree and lost access to her Instagram account a couple of years ago. 😂 Even then our pictures and videos were about travel and alpinism. There are plenty on the other side of the spectrum but I guess they aren’t the ones making all the noise. > It is Indian women married to Indian men who are IPS, IAS, army officers etc who have no quality content Why specifically IPS, IAS, army officers? It could be anyone right? Thank you for this. Who cares what people do? Let them live their life and do their thing. What does the OP care what other people do? Let people do what they want as long as you or anyone else are not affected. It's not a hard concept. They show the government accommodation, government vehicles and share about their life as spouse of the officers. Indians worship central government officers specially these professions. For other professions, the person himself/herself makes such office tour videos. It is super cringe. They are all white, pretty women. hm.... It’s a fantasy for many Indian men. I once had a straight friend who explained it to me like ‘it’s like dressing up barbie in our own clothes’ and that was a turn on for him.’ Even among the white girls there is a hierarchy, it’s a certain profile which is blue eyed, blonde haired. Like OP. The fck is that research for a useless topic Bro did his research God damn, man came with a fuck ton of sources lmao Edit: I also won’t be surprised if most of them aren’t actually married but have actually just partnered with some Indian dude to create that brand image. well, it's giving average Indian men hope someday they will also get white women. what could be the any reason for views? most of them are indians who feel proud that some outsider is obsessing over indian culture and following it to the T, unlike many other local native Indian women who are more liberal and modern :P as simple as that. well there are people who dont appreciate their dharma. you san find the same for women converting to islam. usually called isis brides but in short follow the same trend to change their religion Absolutely dude! Came across it when I was watching videos on the kerala story There are lots of Indians, it’s not that hard to find an Indian to marry, again there are lots of Indians, so there are lots of people who will be watching content related to India. Step 1: praise india and indian culture, if possible speak broken Hindi and wear indian clothes Step 2: wait for the video to go viral Step 3: the hyper nationalists flood the comment section with \"feeling piraud endian armi\" , \"saar endia best saar\" Step 4:..... Step 5: 5X followers in a single day,more likes and comments than you can imagine. **Profit** This is one of the easiest contents to produce for Youtube, and I've seen similar ones for pretty much any country with a large internet using population. World Cheapest data??? Must be nice 😭 But don't you agree that it's fun to fantasize you do realise there are a number of telugu channels which do exactly this. Like think of the most mundane things in your daily life and they will make a video on it I'm more impressed by the fact that there used to be interracial marriage so long ago Thangod and thankyou for saying it it's effin annoying. It is the perfect recipe for abuse, I totally agree. But not everyone will accept the abuse. There are strong women out there who will not take the abuse. And at least in my experience, the Thai wife's seem to be quite strong and independent. Can a non Indian woman marry me? Not racist, just want to help make a ton of money. Aaj aaram se baith k dekhta mai ye saare videos This is not unusual and it's not just happening in India. There are so many YouTubers/instagrammers who marry outside their country- to men in Japan, Korea, Thailand....again these are predominantly white women with these accounts who are documenting their lives and their experience with the new culture. As someone mentioned above there are some Indian women making similar content. I've also remember seeing a Vietnamese woman on IG who talks about cultural differences in Germany and her life with her German fiance. I agree a lot of content creators target an Indian audience because there are so many of us (in addition to the foreigners married to Indians, just look at the number of react to an Indian movie/song videos out there) There is so much beauty and diversity in India that does not get talked about in other countries and movies like slumdog millionaire didn't help. Nor do ppl like a white business man I once met who only went to Mumbai for one meeting-literally airport to meeting and back to the airport- and was loudly proclaiming that all there is in India are shacks and slums. I do think there is a genuine interest in India from other foreigners that these videos feed into. And if it means that a more positive narrative is formed and we get more tourism out of it, I'm ok with it. I don't think I'd care enough to complain about it. 😂🤣 😂 No need to gatekeep culture. My wife is gori, she loves me and my parents and she embraces our culture. Some people love sharing their life online cuz people are interested, and alot of Indian men are dirty and like shit like that. Goris who are literally impressed by India Thanks for spitting the truth, otherwise people also thought NATU NATU was the best song for the year. It is just population that makes the market and they are capitalizing on it. I personally find it a bit odd but also cute and wholesome. After all, this kind of thing gets a lot of likes and positive reactions so why would they not do it. why are you giving these people more attention though Sanskari Gori Bahu 😂😂😂 Ek foreigner wifey to mai bhy deserve karta hun🙂👉👈 ... I now have something to hope for. His father was one of the few amongst the elite colonially educated people from Colombo, Sri Lanka who married English women. Did you just copy paste this from the nri sub? Do you post this every few days? This is bizness I find rampant religion hating & shoving one's religion down another's throat also weird, go eat a bag of dicks OP Is generally watch Cities skylines, succession and Indian geopolitics videos. In the US i got a lot of prank videos, video of people stealing kia and EXPLAING HOW TO STEAL ONE ( why did the algo think im gonna steal a kia?), daily show with trevor. tons of ben shapiro videos which made interested in US politics and after going down the rabbit hole I found out about Hasan Minhaj . I was in new york and jersey was just stunned that's it the shock was too much. Too big for my brain to comprehend. Well , I don't mind it . People need to outrage on everything these days. I’m white , not in India, and I’m embarrassed. Shes using(appropriating/colonizing) your culture for her benefit. Goes way beyond admiring y’alls culture. Creepy Multicultural marraiges are just increasing and people are embracing other cultures. Of course all content creators are going to keep looking for different things to showcase an catch the attention of viewers. I don't think embracing different cultures is so horrible, if anything it's so much better than making content off of your kids or something I think Latinx could be said to be somewhat into white skin. Meanwhile wyte people buy cream that makes them tan color, including me. holyshit bro thts lot of research work u hv done here I wouldn't mind it happening to me. All thanks to jio, population size and rate of unemployment. And the obsession of indians for validation from the world. Same thing has happened with vlogging / travel yt channels. Theres now just way too many that put out tonnes of videos centred around India which makes ppl want to watch them. Either they’re curious about what foreigners think of India or again seek validation from them. OP maybe don’t get so obsessed with this either, otherwise you’re making it all about non-Indian people making their social media presence about indian culture because they married an Indian guy. For some reason women are way more into their social media presence than men…way more. But yeah it is weird, it is mainly because they want attention, that’s it. How is it weird? Why do you have a problem with this? Where is Jenniji's husband? Have you not thought that it is simply interesting to get a perspective on your country from people not born in it? Why is everything about validation? Indian men are obsessed with non Indian women I find nothing wrong, it’s a free world, after all. How about both sides. Tons of Indians interested in seeing an outsider explore some part of their culture... And tons of outsiders interested in seeing someone like them exploring some part of that massive Indian culture. It seems pretty constructive at helping foster understanding. If she looks like that she can keep me in a fuckin cage lmao Everyone has a different experience sherlock. Just because you don't agree, doesn't make it any less Also don't try to read any comment which starts with \"as an Indian\". You'll get second hand embarrassment. Validation obsession. Indians love watching and commenting on videos that speak highly of India. You posted this on r/ABCDesis too right. Leave people tf alone No. I don't think so at all. Indian women with non Indian guys do it too. As someone with parents from 2 different countries and I grew up in 2 different countries I wish there was more mixing/blending of cultures (with nuance and avoiding religion) but the topic is too charged for me to talk to some people about it. It's so cringy to me when people who haven't experienced much racism/ethnicity/culture stuff get shut down the people who've experienced a lifetime of it. Imagine an Indian woman married to a foreigners creating this type of content .what would be ur reaction? Some of her content is actually weird and based on \"each and everything in India is the great\" Criticism and appreciation are both important. It's nothing weird. This happens in all the cross mixed cultures. You just have to search and watch certain types of videos and algorithm will do it's things. May it be East Asia, Or India or some other culture. It's just happens to be that India is the most populous country. The people you found are few hundred, India has 1.4 Billion people. What's weird? If you think this is weird then you haven't seen foreign channels promoting other culture. Why are you bothered? As an interracial person who was raised in both countries, I feel annoyed about this post. Why do a lot of white people seem to assume the worst when other white people talk about different cultures? I think they're missing the point. I'd rather people empathize with my experience rather than focusing their anger on white people and sprinkling a bit of pity on me. You don't want to know what Americans thinks about India.. Great, now I not only have to worry if she is golddigger but also aspirant vlogger who wants to make a career out of me Great, now I not only have to worry if she is golddigger but also aspirant vlogger who wants to make a career out of me. the average Indian is obsessed with the white person's validation, that much is obvious it's a gullible market that's easy to exploit, no wonder this is so prolific XD.. You were born in the 90's, weren't you? I would want the person I married to be super into my culture. It would be nice if my friends and neighbors were too because it'd probably help them understand me better so I'd feel a bit less isolated because of my ethnicity/culture being different from theirs. Who wouldn't want to be invited to neighborhood cookouts where they have food from your culture too? Just go about it with nuance in mind. Who the fuck wants to learn about their white culture? I read only one line from her and knew it waste of time to check her. She said\"people from Indian slums are also happy\". That's idiotic My best friend is married to an Australian but doesn't pretend to be any different than she has been. Her husband also likes Indian culture but doesn't make it look fake. I m friends with an American family who is proud of their culture but also appreciates Indian culture. They don't pretend that their previous life was useless. They consider my conversation with them as an addition to their knowledge. Even if talk about me. I m from punjab living in Mumbai. It doesn't mean I have forgotton Punjab. I read only one line from her and knew it waste of time to check her. She said\"people from Indian slums are also happy\". That's idiotic My best friend is married to an Australian but doesn't pretend to be any different than she has been. Her husband also likes Indian culture but doesn't make it look fake. I m friends with an American family who is proud of their culture but also appreciates Indian culture. They don't pretend that their previous life was useless. They consider my conversation with them as an addition to their knowledge. Even if talk about me. I m from punjab living in Mumbai. It doesn't mean I have forgotton Punjab. One gets the green card and the other gets fame and money! Win-win! So, are you white? I'm not and I wish there was more mixing of cultures out there. In my experience, white people seem more comfortable pointing out what other white people did \"wrong\" rather than having a conversation about the non-white person's experience. It's like having an ambulance go to the site of an accident to reprimand the un-hurt drunk driver instead of helping the injured car crash victim. So, are you white? I'm not and I wish there was more mixing of cultures out there. In my experience, white people seem more comfortable pointing out what other white people did \"wrong\" rather than having a conversation about the non-white person's experience. It's like having an ambulance go to the site of an accident to reprimand the un-hurt drunk driver instead of helping the injured car crash victim. i dont remember the name but there is a subreddit where people post for links of categories like this :P There's difference between wanting people you love/well wishers to know about your partner's culture and massively advertising to the whole world every damn thing. Absolutely be super into your partner's culture but i most definitely would be weirded out when it becomes a whole damn business and obsession. An obsession which doesn't look positively but more negatively because of the way it's been used. But you do you 👍✌🏻 Not the worst thing in the world. Let them do their own thing. reason : population and clickbaits :P First of all, western culture is not as rigid as Indian culture. And secondly, why would I care? As long as no side is being insulted it’s fine Nothing different?I too would be curious what different cultures are like. Not a big deal. I do not get offended by others sharing their experiences I do not want to change your mind, I want to say my piece. I'm multiracial. It pains me to not have blended cultures more than it does when people accidentally do something offensive. I live in a really white area. Yes, it might be weird if a white person made it a business but I don't think that those things are usually from a bad place and I think it's generally harmless. We don't even have Indian restaurants or Asian markets within an hour drive of where I live. Like, having non white people in movies. Sure, it can be seen as a cash grab, but for someone who isn't white it can be amazing to see people who look like you on the big screen. Some PPL geninunly like Indian culture and post abt it , the rest know that if you do anything related to India and upload it Indians will come rushing, PPL from different nationalities from Japan to US are reaching to India and Indians are flooding them with views , likes and subscriptons 😂🤦‍♂️🥲 I'm missing out on a money making market obviously 💰😦 *reacting I think India in details is a legit YouTube channel that Carolina Goswami has been running since quite few years even before her marriage... Why is this even a topic? I honestly feel you are too worried about Indian men marrying non Indian women Is that a problem? Bro **checked YouTube** indeed. I think saying that they make their whole social media life about his culture is not correct. Just to give you an example: you linked \"Let's Meet Abroad\" - yes, they made videos about their wedding in India, but since then they have been traveling the world and vlogging about that. Or \"Indian in China\" is literally about an Indian guy in China. I think what all these people have in common is that they like sharing cultures, learning more about other cultures, and they just have fun vlogging their life. There's nothing wrong with that. I think it's weird. My ex-husband is Indian. I made it a point to try to understand and eventually appreciate his culture, simply because I loved him. It did not become my world but he did. ❤️ 🥺 regardless it's obvious why she's doing it 😒 Absolutely nothing new; people often love with their partner's culture. There's plenty more exotic ones. I recall a couple of them with an Italian guy and a Greek guy. As an Indian man who has lived abroad for 15 years now, I can tell you there are lots of myths among Western women about how Indian marriages and families are oppressive. If these vids help bust those myths, that's a good thing, even if it's done for marketing and clout. Maybe it helps other non Indian women decide whether they'll have a good cultural fit if they dated or married Indian men. I don't see what's wrong with this, unless there's someone's actively spreading misinformation. This is standard in pretty much every country lol. People everywhere are fascinated by “exotic” things, people or opinions so when they see a foreigner(aka exotic person) react to local traditions and practices from an exotic perspective, they’re just kind of drawn to that. It isn’t just an Indian thing like people think.. I think for Indians anything western is aspirational. Desiring White girls is just an extension of that. A white girl who is obsessed with India is in turn a validation of “India shining” theme. Who doesn’t like to be feted? Mylovefromkorea That's a win win if you ask me. Entertainment is a way to escape the mundaneness of our daily lives. A gateway to a fantasy. What's it matter where it comes from, as long as it follows an acceptable level of moral code. >Thousands and thousands of channels of a non indian woman married to an indian guy and their channel/insta is all about his culture. Me reading the start of this post - Fuck off and stop exaggerating. Looking at the multiple links at end: Not that I'm going to check, but I'm giving you the benefit of doubt. wow you ve done some research lol Some people will consider it an insult. But both sides exist I have seen Two cases in my life. My best friend married to a white man. I never saw her that happy when she was getting married. I was against this marriage but i chsnged my mind when i saw her happy. She is more comfortable there. She likes western culture and more free there. But she hasn't forsaken India in her Second case is a white girl from USa . She is like a younger sister to me. She has no specific liking for Indian culture. But she loves specific parts. She wishes me Rakhi every year. I consider these cases to real appreciation because they cone without forgetting their own .. A lot of people will get offended Why are you so obsessed with this OP? You made the exact same post in /r/ABCDesis a few days ago. It seems a bit unhinged. i think he used chat gpt These are white monkey jobs. They are very common in china as well we are not unique in this regard. India is viewed as a poor & cultural nation in western world, you see many of them only visit poor/slum areas do wierd things which average Indian wouldn't do. It's all just to showcase their peers back in their home country & boost their ego. Bro I watched that video bro it was fire! Don't insult the bhindi ki sabzi and methi parathas it reminds me of home. 😂😂😂 I think he wanted to make a point which he very well made by providing this humoungous list of creators. I think that's the new propoganda technique \" If she's white She's right 😏 \" u know . ( Ps : not tryna be racist towards white ppl I'm pale asf too so u know can't be racist /s) nice then what do you think about Indian women marrying Korean guys and doing the same? :) Got laughed out of r/ABCDesis for posting this exact same post. I'd say anything white is aspirational. Not sure, but who is downvoting your comment? Not just movies but food too and then in the comments you'll see all kind of validations we seek from foreigners. Non Indians marrying indian automatically inherit a verified YouTube channel and an Instagram page where we can see them vlog everyday. What are you on about? the content feels forced, exaggerated, and it seems like the woman is exploiting her partner's culture for personal gain and attention. It's strange and inappropriate. Thanks for the channel recommendations. So what? You should be proud that they are embracing the culture. I bet most of these people are more Indian cultured than native Indians themselves. Don’t be that annoying gate keeper. Share and spread the culture. It’s all love people. Lol bro you hurting. Those are just E-thots soaking up Indian men's attention and money. IndiaInDetails Yikes,She Way To PsuedoScientic This is the videos of black people pretending they’ve never heard Queen before but for a bigger audience What’s your problem with any of it, OP? it's called globalisation. This also exists. \"My American husband in...(Italy, Thailand, etc)\" or \"Explaining the thanksgiving holiday to my Norwegian wife\". It guarantees at least Two built-in audiences for every video. And it's endlessly replicable. Thanksgiving video went well? Now you have Easter, Independence Day, or different cultural experiences or foods or whatever. It's a content mine. If you're charming at all, some dope will watch it, and eyeballs = $$$. And to be fair, some of its more entertaining or enlightening than the heavily researched and funded programming on television and streaming services. The motivation is clear. Just like OP probably knew taking this angle on this topic would incite engagement--both positive and negative. The only weird thing actually going on here is that we will end up spending our lives knowing just a little surface level information about thousands of other people on the internet instead of ever discovering the deep things about ourselves, our family and close communities. This is nothing new. TV, circuses, public executions, celebrities, royal weddings, sporting matches--all competing for your attention to prevent you from realizing your own worth. Your neighbor's individual humanity. The sacred divine within you is a problem for the very few people that can afford to create the distractions that prevent you from realizing it. Your research on list of channel are phenomenal. Guide hehehee It helps rather than hurts when it’s a big euro country that a lot of ethnic minorities are interested in, a lot of ppl in the US (where I live) don’t know much about Germany which is considered 1 of the best of not the best country in that continent. If there’s no malice in it then who cares? Theres a million weeabos on youtube and it all seems pretty harmless. It shows that you are from the us Both are very different Must be some rabid culture warrior. There was nothing offensive in my comment. I like that karl dude The only common thread between the channels is Indian guy with non-Indian women. Some of the channels are made by the guy. Many of the channels barely focus on Indian culture. It’s a dumb compilation. OP is the one who is obsessed with this topic, while claiming other people are obsessed. > Validation Calm down with this current decade pop-psychology crap. People can just be interested in other cultures without it requiring psychoanalysis. whatever gets you view, I always wondered who watches vblogs but I guess lot of people do just looking at their view counts and subs. Weird kink, but hey you do you. About what? Are they showing primarily negative aspects? Boy or girl gets citizenship...end of deal Just say India as an average looking Gori mem or Gori bhaiya. You have a legitimate career. It has begun.. the 2nd wave of Aryan Invasion has been initiated.. :/ Fucking legend This type of channel does well in most Asian countries, not just India. I'm living in Taiwan now and there are TV shows here where they invite foreigners from different countries to share their experiences and opinions about local culture. A ton of popular international YouTubers here as well. My understanding is that for relatively homogeneous societies there is an innate human curiosity to see what an outsider thinks about your culture, especially the aspects that you care about. That's why these do well... A few links, continues to link half the channels on YouTube. Yeah, I was married to an Indian woman for a while. I wore the attire for Diwali and that’s about it. Going nuts over it is stupid. 1. Is it not considered that many of the viewers are actually non-indians? 2. I have watched some foreigner travel videos to India to see their own experiences and how they are treated 3. I have not been to everywhere in India so it's still interesting to see about new places? Frankly, I don't watch vlogs. So I don't have much idea what they are all about . But, there was a comedy video where a Pakistani is angry thay his daughter is dating an Indian. He is asked \"what is ur problem\". He replies \"I wouldn't have had any problem if it was my son and ur daughter. We can watch our community grow not decrease\". Same logic can be applied here Wait what? What was that about black people and Queen? HA HA HA ... Aspiring Hindu Indian Men are loosing India's 'Love Jihad' War to Lower Middle Class White Girls and this is being documented via live-stream and Vlog posts. You mean a Chutney Toy Boy. Post-modern peep po*n for aspiring Indian Boys ... All night long... There is zero logic in your reasoning. Why? Maybe there are lots of interracial couples in love? I'm sure I could make a list of ones active on YouTube or Insta where one spouse is a particular race. But I try to avoid selection bias. I don't see a problem here, on the other hand, we also have people who hunt down scammers, that's interesting and shameful example: Wtf dude. It's abnormal because it's rare. Lot of Indian women have western style channels and no one cares because everyone does it. The more Indians start marrying foreigners, the less rare these situations become and you'll find it quite normal. Looks like people are lapping it up and it $$$. There will be people who think tjis is cringe but end of the day who is laughing their way to the bank? Kardashians and their clones have done this for decades and it’s a tried and tested moneymaker. Anyway, the real cringe is people getting offended because its Indian and a personal affront to them somehow. That was my first thought as well. One way to gain publicity for yourself without seeming obvious is to speak badly about yourself in public. Which country btw? Morocco? Nigeria? Indians feel pride when someone who is non Indian says something about India or discuss India. These people monetize on that. There is one guy who used to do reaction video on YouTube, most of the content were Hollywood, but when he changed it to Indian movies, his channel exploded. So that’s his main content now. 🇸🇴 Well, it brings in easy money. Fair play to them. Anything foreign is aspirational. Remember, China Korea, Japan, Australia, Singapore, New Zealand, Thailand, etc. are Eastern countries for us. Anything foreign is aspirational. Remember, China Korea, Japan, Australia, Singapore, New Zealand, Thailand, etc. are Eastern countries for us. Let’s just get to the point India is the largest consumer of youtube videos and if there is a demand supply will start coming I mean our whole childhood was how to be fair. Most of our mom make sure that we don’t stay in sunlight as much as possible to remain fair. Even if your skin is of dark color there must be some kind of attempt taken by your parents to try and make you white. So i would say it was programmed into us that hey if you are white color or fair skinned you are above other people I think it's because there's a target for it lol $$$ I don’t see a problem if they adopt and show Indian culture to masses and in return get paid by youtube Rule no 1: Never try to argue with a woman from any of the TwoX subs. They are conditioned to portray women as victims and men as animals daily. No matter what the context. Who’s the girl in the pic above? Holy shit! I thought you would point out to like 3 4 channels, but you brought the school with you. Damn, that is a lot of channels. I think the answer lies in number of indian viewers and our fondness to talk about our culture. If it is a foreigner adopting it, is even better. Just look at number of youtube videos of white people eating kurkure or other generic indian snacks and reviewing them. Half the comments are like \"proud to be indian\". bhai, it is a video of someone eating an unhealthy snack with sol intention of getting views, what about it makes you so proud to be indian. Yikes yikes yikes some serious objectification going on There's something depressing about exociticising another culture from afar and living in your head. We don't know these people, their stories and their lives - beyond superficial things. I can't stop laughing. I'm sure they have a production team and fake food One thing baffles me. Why do all these foreigners even bother targeting their videos towards Indians when infact they are not going to get a lot of money for the views that they get from Indians. The CPM is abysmally low for Indian viewers, $0.5-$1 globally. So if you are uploading one video a week and average viewership is around 1mil views that translates to only a $1000 which is very low for these foreigners. Definitely the work ethic of a guy procrastinating from something more important:P It’s called business It’s all about white skin lovers on one side and views hungry creators on the other side damn you gave me a nice idea i need to find a pakistani girl now and marry her (hopefully) every day or two i can make a clickbait title calling her an ISI spy and boom i'll have millions of subs in a few days 😂😂 Could youtube be promoting this? For some reason? They keep coming into my youtube feed even though I never searched for anything like these. > **is a legit genre in youtube and it is absolutely weird, what do yall think?** Us Indians are insanely OBSESSED about our culture & about foreigners praising our culture so, W for such YouTubers, they realized an easy way towards Ad. revenue & stuff. Username checks out There was a microgenre of youtube vid that was popular for a bit of young black people reacting to dad rock and phil collins and stuff and being like wow damn this is crazy Whenever I see such channels and influencers; I always feel she(the Western woman) would have been a nobody. This way she is fending for herself, with good level of validation hehehe Oh right. I remember seeing a few of those videos a while back. It seemed to have cooled down since then though. Guys with low confidence are the ones who end up being abusive lol. The fact that he died just a month before Independence is heartbreaking I believe if they cant be loyal to their culture, how can they to be loyal to mine Which sub did you get the links from.. what do u mean by legit? Just that she was genuinely interested in Indian culture / economy and the country as a whole and not the other way round as presented by OP (i.e. that she married an Indian guy first and then made a YouTube channel embracing indian culture and creating india centric content). She said rhet how people in slums are always so happy in India. I don't like people who glorify poverty. First and only time I read something of her. That gives me impression that she isn't genuine And it's not work other way. My friend has married an Austrlaian and apparently she loves Australia now. She even likes Aussie Wildlife(I was shocked too). If she makes a vlog, she will get all kinds of abuse Look mate...no one's perfect and you can have your own biases as well right...that said, in her channel, videos go quite a few years back and more often than not, she has been praising India and its progress with substantiated research and well articulated articles.... Glorifying poverty is a turn off for me. I don't look down on poor but there is nothing in glorious in poverty. And there is something like confirmation bias. \"Substanated research and we'll articulated\" generally means articles written confirming beliefs. It is applicable to me. I know an American family. They are my second favorite family outside India. U can call them stereotypical patriotic Americans which u see on TV. When they praise India or something Indian. I believe that they are genuine because they love their own culture. PS: I respect people who can say something along the lines of \"meri bole Jo boli wah na choddu Mai. Yo meri Taraf se clear madam sorry re\". What's the point of this post?? Like let people be K"
}