{
    "id": "14xjiuw",
    "title": "India Pak PubG Love Story",
    "url": "https://www.reddit.com/r/india/comments/14xjiuw/india_pak_pubg_love_story/",
    "selftext": "Seema Haider, a Pakistani citizen and Sachin Meena, an India citizen fell in love while playing PubG. They got married and she came to India via Nepal Border. She has 4 kids from the previous marriage and her husband claims they were still married when she left. What is your opinion on this situation?\n\nSources:\n\nhttps://www.independent.co.uk/asia/south-asia/seema-haider-pakistani-girl-pubg-b2373108.html\n\nhttps://www.google.com/amp/s/www.thestatesman.com/who-is/who-is-seema-haider-who-sneaks-in-india-with-4-kids-to-meet-her-pubg-lover-1503196775.html/amp\n\nhttps://www.google.com/amp/s/m.timesofindia.com/city/noida/in-india-for-love-bail-to-pak-woman-indian-lover/amp_articleshow/101587439.cms",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689154322.0,
    "convurl": "https://external-preview.redd.it/b1wGEO_O207-Z54jwlsGZfEBz8Anw-WEIqDovF13ifc.jpg?auto=webp&s=1118c63fef95f48ecea19845cba3310083da7371",
    "comments": [],
    "cleaned_text": "india pak pubg love story seema haider pakistani citizen sachin meena india citizen fell love playing pubg got married came india via nepal border kids previous marriage husband claims still married left opinion situation sources ",
    "cleaned_title": "india pak pubg love story",
    "cleaned_selftext": "seema haider pakistani citizen sachin meena india citizen fell love playing pubg got married came india via nepal border kids previous marriage husband claims still married left opinion situation sources",
    "cleaned_comments": "",
    "light_cleaned_title": "India Pak PubG Love Story",
    "light_cleaned_selftext": "Seema Haider, a Pakistani citizen and Sachin Meena, an India citizen fell in love while playing PubG. They got married and she came to India via Nepal Border. She has 4 kids from the previous marriage and her husband claims they were still married when she left. What is your opinion on this situation? Sources:",
    "light_cleaned_comments": ""
}