{
    "id": "13cgqeb",
    "title": "Double engine (link in the comments and description)",
    "url": "https://i.redd.it/ul5rqtn4bsya1.jpg",
    "selftext": "https://twitter.com/penpencildraw/status/1655485383914713090?s=46&t=QyllwZ5uzjhk3YlyAJ68dg",
    "flair": "Politics",
    "score": 1207,
    "num_comments": 40,
    "created_utc": 1683610743.0,
    "convurl": "https://i.redd.it/ul5rqtn4bsya1.jpg",
    "comments": [
        "https://twitter.com/penpencildraw/status/1655485383914713090?s=46&t=QyllwZ5uzjhk3YlyAJ68dg",
        "We should have same party in center , state and bbmp ... then it's easy to demand answers if no work is done. \n\nRight now all they do is point fingers at each other.\n\nGuys relax, i did not say we should just hand things over to any one party (btw people are assuming i meant bjp. i never said which party should be in power. its just mind that assumed its bjp). Anyways, all meant was it would be nice if the same party got ELECTED in all the 3 levels.. any party",
        "You won't be getting any answers at all if that happens.",
        "I thought Bangalore and a lot of Karnataka had the same party everywhere and they still point fingers at each other.",
        ">double engine\n\nHe means double commission",
        "That's why we should have Congress in all three forms of government that OP mentioned",
        "That is not how democracy works. It is in the best interest of people to prevent concentration of power in one hand.",
        "Yes what's the use of federalism. Let's just name modiji as supreme chancellor of the union. That way you can ask the questions to 1 man and not have to waste time with ringing different ministries.",
        "Exactly不不不  Fuck governments and fuck politicians..",
        "Me in UP who still can't ask questions : :(",
        "I think he means double penetration lol",
        "Double engines to rail us from the front and the back /s",
        "It is already the case for Bangalore that the same party is in power at all levels for the past few years. \n\nHow many answers have you got again?",
        "Double engine is against democracy and our federal setup. Government of India is g for the whole of India.",
        "Sab log, Modi ke naam pe bill phaad lo. Karnataka is the worst in doing it. Double engine...smh.",
        "ED wants to know your location",
        "Bold of you to assume that they will run out of people to point fingers at for lack of progress.",
        "Jokes on you I am already broke.",
        "Now now don't go asking for answers. All you'll get are IT/ED raids and maybe a UAPA if you're extra special.",
        "You need to be able to speak to question the wrongs"
    ],
    "cleaned_text": "double engine link comments description  ",
    "cleaned_title": "double engine link comments description",
    "cleaned_selftext": "",
    "cleaned_comments": "party center state bbmp easy demand answers work done right point fingers guys relax say hand things one party btw people assuming meant bjp never said party power mind assumed bjp anyways meant would nice party got elected levels party wont getting answers happens thought bangalore lot karnataka party everywhere still point fingers double engine means double commission thats congress three forms government op mentioned democracy works best interest people prevent concentration power one hand yes whats use federalism lets name modiji supreme chancellor union way ask questions man waste time ringing different ministries exactly fuck governments fuck politicians still cant ask questions think means double penetration lol double engines rail us front back already case bangalore party power levels past years many answers got double engine democracy federal setup government india g whole india sab log modi ke naam pe bill phaad lo karnataka worst double enginesmh ed wants know location bold assume run people point fingers lack progress jokes already broke dont go asking answers youll get ited raids maybe uapa youre extra special need able speak question wrongs",
    "light_cleaned_title": "Double engine (link in the comments and description)",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "We should have same party in center , state and bbmp ... then it's easy to demand answers if no work is done. Right now all they do is point fingers at each other. Guys relax, i did not say we should just hand things over to any one party (btw people are assuming i meant bjp. i never said which party should be in power. its just mind that assumed its bjp). Anyways, all meant was it would be nice if the same party got ELECTED in all the 3 levels.. any party You won't be getting any answers at all if that happens. I thought Bangalore and a lot of Karnataka had the same party everywhere and they still point fingers at each other. >double engine He means double commission That's why we should have Congress in all three forms of government that OP mentioned That is not how democracy works. It is in the best interest of people to prevent concentration of power in one hand. Yes what's the use of federalism. Let's just name modiji as supreme chancellor of the union. That way you can ask the questions to 1 man and not have to waste time with ringing different ministries. Exactly不不不 Fuck governments and fuck politicians.. Me in UP who still can't ask questions : :( I think he means double penetration lol Double engines to rail us from the front and the back /s It is already the case for Bangalore that the same party is in power at all levels for the past few years. How many answers have you got again? Double engine is against democracy and our federal setup. Government of India is g for the whole of India. Sab log, Modi ke naam pe bill phaad lo. Karnataka is the worst in doing it. Double engine...smh. ED wants to know your location Bold of you to assume that they will run out of people to point fingers at for lack of progress. Jokes on you I am already broke. Now now don't go asking for answers. All you'll get are IT/ED raids and maybe a UAPA if you're extra special. You need to be able to speak to question the wrongs"
}