{
    "id": "1e1h29d",
    "title": "Why Delhi CM Arvind Kejriwal will not walk out of jail despite interim bail in ED case",
    "url": "https://indianexpress.com/article/cities/delhi/why-arvind-kejriwal-will-not-walk-out-of-jail-despite-interim-bail-ed-excise-policy-case-9448502/",
    "selftext": "Apart from his arrest by the Enforcement Directorate, Delhi Chief Minister Arvind Kejriwal was also arrested by the Central Bureau of Investigation in a corruption case linked to the Delhi excise policy.",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1720789144.0,
    "convurl": "https://external-preview.redd.it/wATVeVTvRaq6Q6Im_zsQFBCiCUbQwm8Vt03gxtJotRE.jpg?auto=webp&s=9397dc6b64b2486e39e5149b8b1bc9092aa616da",
    "comments": [
        "Though the Supreme Court on Friday granted interim bail to Delhi Chief Minister Arvind Kejriwal after he challenged his arrest by the Enforcement Directorate (ED) in the excise policy case, the Aam Aadmi Party (AAP) national convener will not walk out of jail just yet.\n\nThis is because Kejriwal is still in judicial custody till July 12 in the Central Bureau of Investigation’s (CBI’s) corruption case linked to the now-scrapped Delhi excise policy.\n\nWhile granting Kejriwal bail, the bench of Justices Sanjiv Khanna and Dipankar Datta referred some questions regarding the need and necessity of the arrest to a larger bench of the Supreme Court.\n\nNotably, Kejriwal had moved the high court seeking bail in the CBI case, without first moving the trial court. The CBI’s counsel D P Singh had argued this before a single-judge bench of Justice Neena Bansal Krishna on July 5."
    ],
    "cleaned_text": "delhi cm arvind kejriwal walk jail despite interim bail ed case apart arrest enforcement directorate delhi chief minister arvind kejriwal also arrested central bureau investigation corruption case linked delhi excise policy ",
    "cleaned_title": "delhi cm arvind kejriwal walk jail despite interim bail ed case",
    "cleaned_selftext": "apart arrest enforcement directorate delhi chief minister arvind kejriwal also arrested central bureau investigation corruption case linked delhi excise policy",
    "cleaned_comments": "though supreme court friday granted interim bail delhi chief minister arvind kejriwal challenged arrest enforcement directorate ed excise policy case aam aadmi party aap national convener walk jail yet kejriwal still judicial custody till july central bureau investigations cbis corruption case linked nowscrapped delhi excise policy granting kejriwal bail bench justices sanjiv khanna dipankar datta referred questions regarding need necessity arrest larger bench supreme court notably kejriwal moved high court seeking bail cbi case without first moving trial court cbis counsel p singh argued singlejudge bench justice neena bansal krishna july",
    "light_cleaned_title": "Why Delhi CM Arvind Kejriwal will not walk out of jail despite interim bail in ED case",
    "light_cleaned_selftext": "Apart from his arrest by the Enforcement Directorate, Delhi Chief Minister Arvind Kejriwal was also arrested by the Central Bureau of Investigation in a corruption case linked to the Delhi excise policy.",
    "light_cleaned_comments": "Though the Supreme Court on Friday granted interim bail to Delhi Chief Minister Arvind Kejriwal after he challenged his arrest by the Enforcement Directorate (ED) in the excise policy case, the Aam Aadmi Party (AAP) national convener will not walk out of jail just yet. This is because Kejriwal is still in judicial custody till July 12 in the Central Bureau of Investigation’s (CBI’s) corruption case linked to the now-scrapped Delhi excise policy. While granting Kejriwal bail, the bench of Justices Sanjiv Khanna and Dipankar Datta referred some questions regarding the need and necessity of the arrest to a larger bench of the Supreme Court. Notably, Kejriwal had moved the high court seeking bail in the CBI case, without first moving the trial court. The CBI’s counsel D P Singh had argued this before a single-judge bench of Justice Neena Bansal Krishna on July 5."
}