{
    "id": "1dyv3ei",
    "title": "Overcrowded Prisons; Cases Pending Per Judge Rising: India's Criminal Justice System in 9 Charts",
    "url": "https://thewire.in/rights/overcrowded-prisons-cases-pending-per-judge-rising-indias-criminal-justice-system-in-9-charts",
    "selftext": "How can we trust the system for justice when we are hit by a rich kid's car, when this is the condition of it. ",
    "flair": "Law & Courts",
    "score": 135,
    "num_comments": 18,
    "created_utc": 1720504934.0,
    "convurl": "https://external-preview.redd.it/WGcBa7uiHkzXWUeX-ldB-241uRaGoh6wSeu0YRKEcSQ.jpg?auto=webp&s=8a3030e806b099a305076bddd00a44df49fe4eec",
    "comments": [
        "Source of the data- \nIndia Justice Report (IJR) 2022- An initiative of Tata Trusts",
        "https://preview.redd.it/k1b7teb8qfbd1.png?width=1024&format=png&auto=webp&s=f7467f397501c6aaa9905f3cc50597723f2c2adc\n\n**Policing concentrated in urban areas**",
        "**Police training academies are overloaded**\n\nhttps://preview.redd.it/sz5ib6uiqfbd1.png?width=744&format=png&auto=webp&s=d59314fc2117d85798610fa5fe0cfa846283a227",
        "**Number of undertrial prisoners increasing**\n\nhttps://preview.redd.it/018997bxqfbd1.png?width=1024&format=png&auto=webp&s=c2ca8bb775ff9a22cd07c327dafa12ca70c49784",
        "**Cases pending per judge rising**\n\nhttps://preview.redd.it/8hal30y1rfbd1.png?width=825&format=png&auto=webp&s=2755f34c5ee65e07c9e888bd825e3f50e2a99365",
        "**Share of women high court judges remains low**\n\nhttps://preview.redd.it/6mdt1tn6rfbd1.png?width=919&format=png&auto=webp&s=de716ae92835a473f5df207bd269ae84639330d0",
        "**No state/UT fulfilled all quotas for SC/ST/OBC judges at district-court level**\n\nhttps://preview.redd.it/b5x7wtorrfbd1.png?width=883&format=png&auto=webp&s=dd8ac0389bb6201c3e6780866ef04082e8f49d30",
        "> Police training academies are overloaded For 26.88 lakh police personnel, India has only 211 training schools and academies. \n\n\n> While research from across the world suggests that training across fields – including sensitisation, information on legal changes and courses for specialisation – cannot be a one-off event for police personnel. However, with not enough training institutes and the ones that do exist training an average of 12,744 people every year, the scope for this is limited. \n\n\n> In most states, a very small part of the total police budget is spent on training.",
        "True. \n\nThe reason I made this post is because we outrage about singular cases when we should outrage over the condition of our systems. Hopefully data might help some Indians better understand the problem.",
        "It's going to go further downhill with the BNS.",
        "Hmm let's see how that goes...",
        "#New Criminal Laws Will Create “a Prosecutorial Nightmare and a Disneyland for Defence Councils”\n\nIn an interview to discuss the new criminal laws which came into force yesterday and to explain his deep and fundamental concerns with them, one of the Supreme Court’s highly regarded advocates, Nipun Saxena, says the new criminal laws will create “a prosecutorial nightmare and a Disneyland for defence councils”. Asked if he thinks it would be “a potential mess” he replied “absolutely”. \n\n\nhttp://m.youtube.com/watch?v=-kHfPl5I97Q&pp=ygUXQm5zIHRoZSB3aXJlIGludGVydmlldyA%3D",
        "Thanks for the link mate.",
        "High time we remove the word JUSTICE and just call it INDIAN CRIMINAL SYSTEM",
        "Not just criminal justice. Same with civil cases. One of the cases being fought by our society for common plot is stuck due to political pressure.",
        "Ya and most citizens think justice is not something that concerns them... Until it does."
    ],
    "cleaned_text": "overcrowded prisons cases pending per judge rising indias criminal justice system charts trust system justice hit rich kids car condition ",
    "cleaned_title": "overcrowded prisons cases pending per judge rising indias criminal justice system charts",
    "cleaned_selftext": "trust system justice hit rich kids car condition",
    "cleaned_comments": "source data india justice report ijr initiative tata trusts policing concentrated urban areas police training academies overloaded number undertrial prisoners increasing cases pending per judge rising share women high court judges remains low stateut fulfilled quotas scstobc judges districtcourt level police training academies overloaded lakh police personnel india training schools academies research across world suggests training across fields including sensitisation information legal changes courses specialisation oneoff event police personnel however enough training institutes ones exist training average people every year scope limited states small part total police budget spent training true reason made post outrage singular cases outrage condition systems hopefully data might help indians better understand problem going go downhill bns hmm lets see goes new criminal laws create prosecutorial nightmare disneyland defence councils interview discuss new criminal laws came force yesterday explain deep fundamental concerns one supreme courts highly regarded advocates nipun saxena says new criminal laws create prosecutorial nightmare disneyland defence councils asked thinks would potential mess replied absolutely thanks link mate high time remove word justice call indian criminal system criminal justice civil cases one cases fought society common plot stuck due political pressure ya citizens think justice something concerns",
    "light_cleaned_title": "Overcrowded Prisons; Cases Pending Per Judge Rising: India's Criminal Justice System in 9 Charts",
    "light_cleaned_selftext": "How can we trust the system for justice when we are hit by a rich kid's car, when this is the condition of it.",
    "light_cleaned_comments": "Source of the data- India Justice Report (IJR) 2022- An initiative of Tata Trusts **Policing concentrated in urban areas** **Police training academies are overloaded** **Number of undertrial prisoners increasing** **Cases pending per judge rising** **Share of women high court judges remains low** **No state/UT fulfilled all quotas for SC/ST/OBC judges at district-court level** > Police training academies are overloaded For 26.88 lakh police personnel, India has only 211 training schools and academies. > While research from across the world suggests that training across fields – including sensitisation, information on legal changes and courses for specialisation – cannot be a one-off event for police personnel. However, with not enough training institutes and the ones that do exist training an average of 12,744 people every year, the scope for this is limited. > In most states, a very small part of the total police budget is spent on training. True. The reason I made this post is because we outrage about singular cases when we should outrage over the condition of our systems. Hopefully data might help some Indians better understand the problem. It's going to go further downhill with the BNS. Hmm let's see how that goes... #New Criminal Laws Will Create “a Prosecutorial Nightmare and a Disneyland for Defence Councils” In an interview to discuss the new criminal laws which came into force yesterday and to explain his deep and fundamental concerns with them, one of the Supreme Court’s highly regarded advocates, Nipun Saxena, says the new criminal laws will create “a prosecutorial nightmare and a Disneyland for defence councils”. Asked if he thinks it would be “a potential mess” he replied “absolutely”. Thanks for the link mate. High time we remove the word JUSTICE and just call it INDIAN CRIMINAL SYSTEM Not just criminal justice. Same with civil cases. One of the cases being fought by our society for common plot is stuck due to political pressure. Ya and most citizens think justice is not something that concerns them... Until it does."
}