{
    "id": "14bi7dg",
    "title": "Law & order in Manipur needs urgent attention at highest level: Ex-Army chief Ved Malik",
    "url": "https://indianexpress.com/article/india/manipur-clashes-law-and-order-ved-malik-tweet-8668269/",
    "selftext": "https://indianexpress.com/article/india/polls-approaching-in-5-states-pm-to-meet-bjp-volunteers-in-bhopal-8668148/ \n\nMeanwhile, PM to meet BJP volunteers in Bhopal, Polls approaching in 5 States.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1686979137.0,
    "convurl": "https://external-preview.redd.it/j0IBZI6Sfo_ZSYoHF51sy64Xb-PuWlHgl9VFiSPmrCo.jpg?auto=webp&v=enabled&s=c26c5cbdb0c563ccb1260fa6f0adc4f19bd9283f",
    "comments": [
        "Can one imagine Modi and Shah imposing President’s rule in Manipur? No. That’ll be admission of defeat. They’d let Kuki’s die by arming Meitei’s\n\nAny other visit from Shah will also symbolize defeat so forget about it. Not happening",
        "there is no upcoming elections over there. So NO. Bjp's priority are only winning elections, If they were to take action or address issue or media started covering this 24*7 it would be them admitting they lost control which wont look for upcoming polls.",
        "Manipur is gearing up for civil war, everybody's  arming themselves and I fear it's  gonna be armed forces sitting on the sideline  and media as always covering some nepo kid or some muslim who did love jihad.",
        "It’s their standard operational mode, they’ll only enforce President’s rule if it has any consequence in their floating voter base in rest of India cause anything else is just admission of failure, that they won’t do. Also any involvement from Rahul Gandhi will trigger them too. Seriously let Rahul Gandhi visit Manipur once and meet the victims of this violence and BJP will shift their whole focus on Manipur, whether to solve the issue or not, don’t know but definitely will focus on Manipur then with full force, led by Smriti Irani."
    ],
    "cleaned_text": "law order manipur needs urgent attention highest level exarmy chief ved malik meanwhile pm meet bjp volunteers bhopal polls approaching states ",
    "cleaned_title": "law order manipur needs urgent attention highest level exarmy chief ved malik",
    "cleaned_selftext": "meanwhile pm meet bjp volunteers bhopal polls approaching states",
    "cleaned_comments": "one imagine modi shah imposing presidents rule manipur thatll admission defeat theyd let kukis die arming meiteis visit shah also symbolize defeat forget happening upcoming elections bjps priority winning elections take action address issue media started covering would admitting lost control wont look upcoming polls manipur gearing civil war everybodys arming fear gon na armed forces sitting sideline media always covering nepo kid muslim love jihad standard operational mode theyll enforce presidents rule consequence floating voter base rest india cause anything else admission failure wont also involvement rahul gandhi trigger seriously let rahul gandhi visit manipur meet victims violence bjp shift whole focus manipur whether solve issue dont know definitely focus manipur full force led smriti irani",
    "light_cleaned_title": "Law & order in Manipur needs urgent attention at highest level: Ex-Army chief Ved Malik",
    "light_cleaned_selftext": "Meanwhile, PM to meet BJP volunteers in Bhopal, Polls approaching in 5 States.",
    "light_cleaned_comments": "Can one imagine Modi and Shah imposing President’s rule in Manipur? No. That’ll be admission of defeat. They’d let Kuki’s die by arming Meitei’s Any other visit from Shah will also symbolize defeat so forget about it. Not happening there is no upcoming elections over there. So NO. Bjp's priority are only winning elections, If they were to take action or address issue or media started covering this 24*7 it would be them admitting they lost control which wont look for upcoming polls. Manipur is gearing up for civil war, everybody's arming themselves and I fear it's gonna be armed forces sitting on the sideline and media as always covering some nepo kid or some muslim who did love jihad. It’s their standard operational mode, they’ll only enforce President’s rule if it has any consequence in their floating voter base in rest of India cause anything else is just admission of failure, that they won’t do. Also any involvement from Rahul Gandhi will trigger them too. Seriously let Rahul Gandhi visit Manipur once and meet the victims of this violence and BJP will shift their whole focus on Manipur, whether to solve the issue or not, don’t know but definitely will focus on Manipur then with full force, led by Smriti Irani."
}