{
    "id": "1ao4dtv",
    "title": "Guys,Some very bad things are happening in West Bengal. Mass Systemic rape of women of all ages are being perpetrated by local TMC leaders in Sandeshkhali. The police was in cahoots with the leader and even escorted these women to the party offices of the leaders where they were raped every night.",
    "url": "https://www.reddit.com/r/india/comments/1ao4dtv/guyssome_very_bad_things_are_happening_in_west/",
    "selftext": "The  National commission of Women's Tweet.\n\n[https://twitter.com/NCWIndia/status/1756209062772162935](https://twitter.com/NCWIndia/status/1756209062772162935)\n\n&#x200B;\n\n[High level Committee on their way to the incident site to investigate and visit the victims.](https://preview.redd.it/m7unb41nfxhc1.jpg?width=719&format=pjpg&auto=webp&s=bc1fd4e7a917ee9392336d999ae275541b27d8e2)\n\nThe incidents that were happening at that place was straight out of nightmares and deeply gruesome. The local TMC leaders and goons would choose any women (married, unmarried, mothers , daughters they spared no body ) that they liked and forced them to come to their party offices or their houses. Special vehicles were arranged to transport the women to these locations. After raping them the entire night they were let go in the morning. \n\nMost disturbing and unsettling part of the entire incident was that the police escorted these women to these rape dens and made sure no body lodged any complaints and everything was kept under wrap. If their husbands or sons protested they were threatened with death so most of them kept quiet. These atrocities have been going for so long and the world was oblivious to it. \n\nPlease spread the word so that these poor helpless women can finally get some justice.",
    "flair": "Crime",
    "score": 146,
    "num_comments": 34,
    "created_utc": 1707644573.0,
    "convurl": "https://b.thumbs.redditmedia.com/UbjIg0FeNjS2WdqwiDVYK5NHgXfX3lb3yzqYJk4s_Rw.jpg",
    "comments": [
        "Women of Sandeshkhali said the TMC leader Shahjahan Sheikh and his goons raped Hindu women only. It was a religiously motivated attack.",
        "What is the Chief Minister doing?",
        "Time to kill them all",
        "Sucking minority cocks for votes",
        "HAMBA BAMBA LAMBA DAMBA BAMBA BAMBA KHAMBA KHAMBA",
        "This country is fucking doomed.",
        "Politically motivated misinformation by the BJP. They especially added “Hindus” to rile up the masses. Typical BJP playbook.",
        "I hope the Indian media questions and grills mamta bannerjee as much as they do modi.",
        "Is west bengal the new bihar?",
        "I don't think so. I have been living 70kms away from Sandeshkhali and I am aware of the ground reality. TMC Goons along with Police are torturing Hindus. \n\nSandeshkhali has been a hot spot of religiously motivated crime against Hindus and it's a fact. You can google yourself and see news about this place and search results as old as 10-15 years is gonna appear",
        "Don't u know she is very liberal and anti-facist and will never tolerate anything like this /s",
        "Ah yes ! The most progressive and liberal state which is very women friendly acc. to Bongs. \n\nBengalis use to preach the entire nation how their culture is superior to others in the entire country lol\n\nAlso, the only state with a female CM, go figure !",
        "Whenever her party MLAs are involved, she straight up blames the victim and questions the credibility of the incident. Be it the Nadia case or Park Street, despite being a woman herself, she turns a blind eye.",
        "WTF! Why would you want to kill the women? They’re victims here",
        "So you want them to give her a free pass and ask how she eats mango? \n\nShe should be held responsible for this",
        "They do question modi ??????",
        "Well... Its TMC's raj. Dont get surprised if their dead bodies are found hanging on trees",
        " Damn it got nuked. Op post it in other subs",
        "Ya, atleast online they do. Mamta bannerjee escapes all accountability.",
        "Is akshay kumar representative of media?",
        "Obviously I meant kill the rapists you troglodyte.",
        "Always has been",
        "Nah give them a fair trial and sentence them to life in prison if evidence proves this. You shouldn’t behave like animals and abandon the rule of law just because the other side does so",
        "I'll wait before even reacting to this.. \n\nSeems fishy, seems like the kind of thing a certain party claims.. Then ignores after proven fake.",
        "Some things are unacceptable, they would do well to remember who holds power in all the key positions of the government. Having the majority in certain districts does not imply open season on the minorities there. There must be a degree of dread.",
        "Are you a moron?",
        "I don't understand how Muslims are eternally victims in your mind who can do no wrong.\n\nIt's always the Hindu's fault for not turning the other cheek and not letting their women get raped."
    ],
    "cleaned_text": "guyssome bad things happening west bengal mass systemic rape women ages perpetrated local tmc leaders sandeshkhali police cahoots leader even escorted women party offices leaders raped every night national commission womens tweet httpstwittercomncwindiastatushttpstwittercomncwindiastatus xb high level committee way incident site investigate visit victimshttpspreviewredditmunbnfxhcjpgwidthformatpjpgautowebpsbcfdeaeedaebde incidents happening place straight nightmares deeply gruesome local tmc leaders goons would choose women married unmarried mothers daughters spared body liked forced come party offices houses special vehicles arranged transport women locations raping entire night let go morning disturbing unsettling part entire incident police escorted women rape dens made sure body lodged complaints everything kept wrap husbands sons protested threatened death kept quiet atrocities going long world oblivious please spread word poor helpless women finally get justice ",
    "cleaned_title": "guyssome bad things happening west bengal mass systemic rape women ages perpetrated local tmc leaders sandeshkhali police cahoots leader even escorted women party offices leaders raped every night",
    "cleaned_selftext": "national commission womens tweet httpstwittercomncwindiastatushttpstwittercomncwindiastatus xb high level committee way incident site investigate visit victimshttpspreviewredditmunbnfxhcjpgwidthformatpjpgautowebpsbcfdeaeedaebde incidents happening place straight nightmares deeply gruesome local tmc leaders goons would choose women married unmarried mothers daughters spared body liked forced come party offices houses special vehicles arranged transport women locations raping entire night let go morning disturbing unsettling part entire incident police escorted women rape dens made sure body lodged complaints everything kept wrap husbands sons protested threatened death kept quiet atrocities going long world oblivious please spread word poor helpless women finally get justice",
    "cleaned_comments": "women sandeshkhali said tmc leader shahjahan sheikh goons raped hindu women religiously motivated attack chief minister time kill sucking minority cocks votes hamba bamba lamba damba bamba bamba khamba khamba country fucking doomed politically motivated misinformation bjp especially added hindus rile masses typical bjp playbook hope indian media questions grills mamta bannerjee much modi west bengal new bihar dont think living kms away sandeshkhali aware ground reality tmc goons along police torturing hindus sandeshkhali hot spot religiously motivated crime hindus fact google see news place search results old years gon na appear dont u know liberal antifacist never tolerate anything like ah yes progressive liberal state women friendly acc bongs bengalis use preach entire nation culture superior others entire country lol also state female cm go figure whenever party mlas involved straight blames victim questions credibility incident nadia case park street despite woman turns blind eye wtf would want kill women theyre victims want give free pass ask eats mango held responsible question modi well tmcs raj dont get surprised dead bodies found hanging trees damn got nuked op post subs ya atleast online mamta bannerjee escapes accountability akshay kumar representative media obviously meant kill rapists troglodyte always nah give fair trial sentence life prison evidence proves shouldnt behave like animals abandon rule law side ill wait even reacting seems fishy seems like kind thing certain party claims ignores proven fake things unacceptable would well remember holds power key positions government majority certain districts imply open season minorities must degree dread moron dont understand muslims eternally victims mind wrong always hindus fault turning cheek letting women get raped",
    "light_cleaned_title": "Guys,Some very bad things are happening in West Bengal. Mass Systemic rape of women of all ages are being perpetrated by local TMC leaders in Sandeshkhali. The police was in cahoots with the leader and even escorted these women to the party offices of the leaders where they were raped every night.",
    "light_cleaned_selftext": "The National commission of Women's Tweet. [https://twitter.com/NCWIndia/status/1756209062772162935](https://twitter.com/NCWIndia/status/1756209062772162935) &#x200B; [High level Committee on their way to the incident site to investigate and visit the victims.](https://preview.redd.it/m7unb41nfxhc1.jpg?width=719&format=pjpg&auto=webp&s=bc1fd4e7a917ee9392336d999ae275541b27d8e2) The incidents that were happening at that place was straight out of nightmares and deeply gruesome. The local TMC leaders and goons would choose any women (married, unmarried, mothers , daughters they spared no body ) that they liked and forced them to come to their party offices or their houses. Special vehicles were arranged to transport the women to these locations. After raping them the entire night they were let go in the morning. Most disturbing and unsettling part of the entire incident was that the police escorted these women to these rape dens and made sure no body lodged any complaints and everything was kept under wrap. If their husbands or sons protested they were threatened with death so most of them kept quiet. These atrocities have been going for so long and the world was oblivious to it. Please spread the word so that these poor helpless women can finally get some justice.",
    "light_cleaned_comments": "Women of Sandeshkhali said the TMC leader Shahjahan Sheikh and his goons raped Hindu women only. It was a religiously motivated attack. What is the Chief Minister doing? Time to kill them all Sucking minority cocks for votes HAMBA BAMBA LAMBA DAMBA BAMBA BAMBA KHAMBA KHAMBA This country is fucking doomed. Politically motivated misinformation by the BJP. They especially added “Hindus” to rile up the masses. Typical BJP playbook. I hope the Indian media questions and grills mamta bannerjee as much as they do modi. Is west bengal the new bihar? I don't think so. I have been living 70kms away from Sandeshkhali and I am aware of the ground reality. TMC Goons along with Police are torturing Hindus. Sandeshkhali has been a hot spot of religiously motivated crime against Hindus and it's a fact. You can google yourself and see news about this place and search results as old as 10-15 years is gonna appear Don't u know she is very liberal and anti-facist and will never tolerate anything like this /s Ah yes ! The most progressive and liberal state which is very women friendly acc. to Bongs. Bengalis use to preach the entire nation how their culture is superior to others in the entire country lol Also, the only state with a female CM, go figure ! Whenever her party MLAs are involved, she straight up blames the victim and questions the credibility of the incident. Be it the Nadia case or Park Street, despite being a woman herself, she turns a blind eye. WTF! Why would you want to kill the women? They’re victims here So you want them to give her a free pass and ask how she eats mango? She should be held responsible for this They do question modi ?????? Well... Its TMC's raj. Dont get surprised if their dead bodies are found hanging on trees Damn it got nuked. Op post it in other subs Ya, atleast online they do. Mamta bannerjee escapes all accountability. Is akshay kumar representative of media? Obviously I meant kill the rapists you troglodyte. Always has been Nah give them a fair trial and sentence them to life in prison if evidence proves this. You shouldn’t behave like animals and abandon the rule of law just because the other side does so I'll wait before even reacting to this.. Seems fishy, seems like the kind of thing a certain party claims.. Then ignores after proven fake. Some things are unacceptable, they would do well to remember who holds power in all the key positions of the government. Having the majority in certain districts does not imply open season on the minorities there. There must be a degree of dread. Are you a moron? I don't understand how Muslims are eternally victims in your mind who can do no wrong. It's always the Hindu's fault for not turning the other cheek and not letting their women get raped."
}