{
    "id": "12vc2fk",
    "title": "Lost my first earned 10k to fraud. BEWARE.",
    "url": "https://www.reddit.com/r/india/comments/12vc2fk/lost_my_first_earned_10k_to_fraud_beware/",
    "selftext": "As a college student, i recently earned 10k and lost it all today to a fraud.\n\nHere's what happened:-\nFriday (around 8pm) :- i deposit my money to my Indian bank account.\nSaturday (8pm):- i received a text saying that 10k have been withdrawn from my bank account through aeps (aadhar enabled payment system)\n\nIdk how it happened, i didn't even received any otp to confirm the transaction. Aeps shouldn't work without my fingerprint.\n\nEither someone cloned my fingerprint or got access to my biometric data. Or someone maanged to bypass the fingerprint authentication system.idk which one is it. At thr end of the day, it's me who lost the money. I'm completely broken now.\n\nI lodged the complaint in cyber crime portal. Will inform the bank on Monday. I don't really have any hopes tho.\n\nWe all have our bank accounts linked to aadhar, it can happen to any of us. SO BEWARE.\n\nEDIT:- I just checked my aadhar authentication history on aadhar's website. It says \"no record found\", means these hackers probably found a way to withdraw money without aadhar authentication.\n\nEdit 2:- [A similar case for people who didn't know it can happen ](https://m-timesofindia-com.cdn.ampproject.org/v/s/m.timesofindia.com/city/lucknow/cyber-fraud-man-loses-rs-30000-from-bank-account-through-aeps/amp_articleshow/82791673.cms?amp_gsa=1&amp_js_v=a9&usqp=mq331AQIUAKwASCAAgM%3D#amp_tf=From%20%251%24s&aoh=16822266108804&referrer=https%3A%2F%2Fwww.google.com)",
    "flair": "Crime",
    "score": 66,
    "num_comments": 48,
    "created_utc": 1682182624.0,
    "convurl": "https://external-preview.redd.it/ZIqFoEiY8-2hf67lO0Mz7Oi6KOe1Jq4m2keMGU7MfJc.jpg?auto=webp&v=enabled&s=54430b18a3b6c2a1ac49ac3ab5f01fb4fd0a6958",
    "comments": [
        "Lock your biometrics from aadhar website. This will prevent unauthorised access.",
        "Soch bro tucche type chor ye sab kar sakte hain to govt kya kar sakti hai agar karne pe aa gayi to\n\nadhar vagerah database isiliye banwaye gaye hain",
        "Done,wish i knew that sooner .",
        "Don't banks need it or something? What are the pitfalls?",
        "> Friday (around 8pm) :- i deposit my money to my Indian bank account.\n\nHow is it possible? Evening bank? Most banks close their counter by 4 PM. Did you deposit via ATM? Then money won't be credited before Monday.",
        "You can unlock them anytime with a single click. Otp authentication still works even when the biometrics are locked.",
        "Ohh my bad, i should've been more clear. I have two Bank accounts. One i use for daily upi transactions and other for saving or keeping money aside. I transferred money from my upi bank,(federal Bank) to indian bank. Using gpay.",
        "Ah okay",
        "People who tend to lose their phone, don't do this.\n\nAadhar biometric unlocking requires OTP, but if u lost your phone n go to service provider, they will need to verify your fingerprint to give new sim.\n\nWhich won't be possible because your biometrics is locked.\n\nIt's a fucking loop.\n\nBe sure of what you are getting into.",
        "Heard that AEPS was discontinued recently because of frauds like this, wakanda bank was yours? It's infuriating that bank won't allow us to disable this feature.",
        "Won't email suffice? For sending the OTP??\nSince email is also linked to Aadhar..",
        "Fi account?",
        "Can you share screenshot of sms.. seems the post is fraud...",
        "OP, you can ask your bank to deseed your aadhar.",
        "ELI5 how this AEPS works and how to prevent fraud (since like majority of places require your aadhar and/or biometrics)",
        "Yeah",
        "https://preview.redd.it/hlc29svaalva1.jpeg?width=720&format=pjpg&auto=webp&v=enabled&s=a284e3583d78091fc16e6e29ea234937eef44a5c\n\nHere",
        "Mine was indian bank. I'm surprised that there isn't any noise about this fraud in the public,else i'd have disabled my biometrics.",
        "Damn, then what am i supposed to do now?. Am afraid of having money in my bank accounts now since they all are linked to aadhar. And my aadhar clearly have been compromised.",
        "Reach out ur bank immediately bro only bank can help in this situation",
        "How is this possible. This is the first im hearing about this. Can someone explain how did this happen?",
        "Did u do txn of 500 on 21st Apr ? Probably the same person used ur credentials for more money.. where was that txn done ? And how come precious Indian bank smses were coming on sim2 and the last one came on sim 1.. also, bank smses wont usually have comma for 10,000.....\n are you trying to fool us..",
        "No, there are recent reports of this. It appears to be some loop hole which needs immediate fix",
        "Sorry i’m late but from what I know, RBI have this rule where every banking customer has an insurance of some X amount eg. 1Lakh or so. You have to reach the bank within 4 hours of money deduction and ask for a grievance form or something! These banks won’t let you have it so u need to lift the bank on your head and be confident that you weren’t the one who withdrew the money and I need a backend investigation on this thing! If you are successful in filling the grievance it is said that you will eventually get your money back within some time. BUT GETTING THE GRIEVANCE FORM FROM THEM IS A BIT OF A PROBLEM LOL coz Bank will have to pay you for their mistakes at the end. \n.\nComing from a cybersecurity student. \nSorry for my RIP english.",
        "I didn't do that txn of 500 either. It's my fault that i didn't see that msg, else i'd have blocked everything. I usually have so many messages so i tend to ignore a lot of them. I didn't notice that 500 txn message at all and that's completely my fault.\n\n\n\n>how come precious Indian bank smses were coming on sim2 and the last one came on sim 1..\n\nI don't really understand what you mean by that.All the indian bank messages are coming on sim1 only. Since it's linked to my bank account. \n\n>bank smses wont usually have comma for 10,000..... are you trying to fool us..\n\nI have no Idea about it. You can see the message is from Indian bank itself. I checked the balance as well and the money has been deducted. I'm not trying to fool any one.",
        "I couldn't go to bank since bank is off till Monday. But i did lodged a complaint at cyber security portal, would that work? I will go to bank first thing on Monday. I did try to contact the branch manager but he was just so rude and didn't want to listen at all . He said to visit the branch on Monday and hanged up.",
        "[this is a similar case](https://www.moneylife.in/article/fraud-alert-beware-of-aadhaar-enabled-payment-system-frauds-and-fake-apps/70183.html)\n\nIt's not happening for the first time . There's some kind of loop hole in this whole aeps system itself.",
        "Banks are closed till monday . All i could do is to report it on cyber crime portal.",
        "Man this is serious\nAlthough my account has zero balance but still it is worrisome\nDid you use AEPS before with some banking correspondent??",
        "No, i have never used aeps. Infact i didn't even know it existed till i lost my money. I mainly use upi apps or imps/neft for my transactions.",
        "Difficult for me to get proper sleep if my account has some balance \nBank should have option to disable AEPS altogether \nNeed to contact bank They can close a particular payment channel",
        "Why did you remove also how did the hackers gain information?",
        "https://www.reddit.com/r/india/comments/12vc2fk/lost_my_first_earned_10k_to_fraud_beware/jhckab2?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
        "Why would you think it's a \"story\" though? I don't get it.",
        "As I told you these managers won’t talk properly coz they are the ones who will have to pay you and ofc they don’t want to. sorry to say but Idts you’ll get anything back coz it is said after 4 hours it is nearly impossible to track down the transaction step by step. But you should not lose hope and fingers crossed! Hard earned money is valuable even if it is 100 or 10000. Keep taking updates from the cybercell and pray.",
        "Thanks for the clarification. Have you used AePS or fingerprint registration recently? It seems your fingerprint is stolen. From the SMS screenshot, it is clear that someone has withdrawn cash using your fingerprints. This should be easily traceable.",
        "Aadhaar OTPs aren't sent in email",
        "Why do they collect email ID then?",
        "The fraud relies on an Aadhar Number and Biometrics (fingerprint usually) leak. To do a transaction with AEPS, you only need a Bank Name, Aadhar Number, and a Biometrics verification.\n\nFraudster plugs in those details, gets cash, and the fraud is successful.\n\nEdit: To prevent it, lock your biometrics for Aadhar.",
        "Damn, most people especially elderly will fall to this kind of fraud easily. I hope government takes some steps.",
        "so got ur money?",
        "Noop",
        "Any update to this situation? \n\n1. Did you figure out how the scammers got your biometrics?\n\n2. Did you get any status update from the cyber police about your case? Or even an acknowledgement that a case has been opened/closed/resolved/etc?\n\n3. How did the bank react? Did they tell you what will happen/how to avoid in future?\n\n4. Have you been told you'll get your money back? I saw some reddit commenters saying RBI has an insurance to make sure scam victims are compensated, not sure if it's true",
        "Hey,\n\n\n1.they probably bypassed the biometric lock, idk how. There's not much info about it.\n2. Cyber police did absolutely nothing \n3. Bank was trying to put it on me, as if that's my fault. But i showed them rbi guidelines for the situation, and then they acted accordingly.\n4. Yes i got my money bank, although it took a year and countless bank visits.",
        "Interesting that you got the money even though the cops didn't catch the culprits.  \n\nDid you do anything to prevent this in future? Like asking your bank to disable AEPS or locking biometrics etc"
    ],
    "cleaned_text": "lost first earned k fraud beware college student recently earned k lost today fraud heres happened friday around pm deposit money indian bank account saturday pm received text saying k withdrawn bank account aeps aadhar enabled payment system idk happened didnt even received otp confirm transaction aeps shouldnt work without fingerprint either someone cloned fingerprint got access biometric data someone maanged bypass fingerprint authentication systemidk one thr end day lost money im completely broken lodged complaint cyber crime portal inform bank monday dont really hopes tho bank accounts linked aadhar happen us beware edit checked aadhar authentication history aadhars website says record found means hackers probably found way withdraw money without aadhar authentication edit similar case people didnt know happen httpsmtimesofindiacomcdnampprojectorgvsmtimesofindiacomcitylucknowcyberfraudmanlosesrsfrombankaccountthroughaepsamparticleshowcmsampgsaampjsvausqpmqaqiuakwascaagmdamptffromsaohreferrerhttpsaffwwwgooglecom ",
    "cleaned_title": "lost first earned k fraud beware",
    "cleaned_selftext": "college student recently earned k lost today fraud heres happened friday around pm deposit money indian bank account saturday pm received text saying k withdrawn bank account aeps aadhar enabled payment system idk happened didnt even received otp confirm transaction aeps shouldnt work without fingerprint either someone cloned fingerprint got access biometric data someone maanged bypass fingerprint authentication systemidk one thr end day lost money im completely broken lodged complaint cyber crime portal inform bank monday dont really hopes tho bank accounts linked aadhar happen us beware edit checked aadhar authentication history aadhars website says record found means hackers probably found way withdraw money without aadhar authentication edit similar case people didnt know happen httpsmtimesofindiacomcdnampprojectorgvsmtimesofindiacomcitylucknowcyberfraudmanlosesrsfrombankaccountthroughaepsamparticleshowcmsampgsaampjsvausqpmqaqiuakwascaagmdamptffromsaohreferrerhttpsaffwwwgooglecom",
    "cleaned_comments": "lock biometrics aadhar website prevent unauthorised access soch bro tucche type chor ye sab kar sakte hain govt kya kar sakti hai agar karne pe aa gayi adhar vagerah database isiliye banwaye gaye hain donewish knew sooner dont banks need something pitfalls friday around pm deposit money indian bank account possible evening bank banks close counter pm deposit via atm money wont credited monday unlock anytime single click otp authentication still works even biometrics locked ohh bad shouldve clear two bank accounts one use daily upi transactions saving keeping money aside transferred money upi bankfederal bank indian bank using gpay ah okay people tend lose phone dont aadhar biometric unlocking requires otp u lost phone n go service provider need verify fingerprint give new sim wont possible biometrics locked fucking loop sure getting heard aeps discontinued recently frauds like wakanda bank infuriating bank wont allow us disable feature wont email suffice sending otp since email also linked aadhar fi account share screenshot sms seems post fraud op ask bank deseed aadhar eli aeps works prevent fraud since like majority places require aadhar andor biometrics yeah mine indian bank im surprised isnt noise fraud publicelse id disabled biometrics damn supposed afraid money bank accounts since linked aadhar aadhar clearly compromised reach ur bank immediately bro bank help situation possible first im hearing someone explain happen u txn st apr probably person used ur credentials money txn done come precious indian bank smses coming sim last one came sim also bank smses wont usually comma trying fool us recent reports appears loop hole needs immediate fix sorry im late know rbi rule every banking customer insurance x amount eg lakh reach bank within hours money deduction ask grievance form something banks wont let u need lift bank head confident werent one withdrew money need backend investigation thing successful filling grievance said eventually get money back within time getting grievance form bit problem lol coz bank pay mistakes end coming cybersecurity student sorry rip english didnt txn either fault didnt see msg else id blocked everything usually many messages tend ignore lot didnt notice txn message thats completely fault come precious indian bank smses coming sim last one came sim dont really understand mean thatall indian bank messages coming sim since linked bank account bank smses wont usually comma trying fool us idea see message indian bank checked balance well money deducted im trying fool one couldnt go bank since bank till monday lodged complaint cyber security portal would work go bank first thing monday try contact branch manager rude didnt want listen said visit branch monday hanged similar casehttpswwwmoneylifeinarticlefraudalertbewareofaadhaarenabledpaymentsystemfraudsandfakeappshtml happening first time theres kind loop hole whole aeps system banks closed till monday could report cyber crime portal man serious although account zero balance still worrisome use aeps banking correspondent never used aeps infact didnt even know existed till lost money mainly use upi apps impsneft transactions difficult get proper sleep account balance bank option disable aeps altogether need contact bank close particular payment channel remove also hackers gain information would think story though dont get told managers wont talk properly coz ones pay ofc dont want sorry say idts youll get anything back coz said hours nearly impossible track transaction step step lose hope fingers crossed hard earned money valuable even keep taking updates cybercell pray thanks clarification used aeps fingerprint registration recently seems fingerprint stolen sms screenshot clear someone withdrawn cash using fingerprints easily traceable aadhaar otps arent sent email collect email id fraud relies aadhar number biometrics fingerprint usually leak transaction aeps need bank name aadhar number biometrics verification fraudster plugs details gets cash fraud successful edit prevent lock biometrics aadhar damn people especially elderly fall kind fraud easily hope government takes steps got ur money noop update situation figure scammers got biometrics get status update cyber police case even acknowledgement case openedclosedresolvedetc bank react tell happenhow avoid future told youll get money back saw reddit commenters saying rbi insurance make sure scam victims compensated sure true hey probably bypassed biometric lock idk theres much info cyber police absolutely nothing bank trying put thats fault showed rbi guidelines situation acted accordingly yes got money bank although took year countless bank visits interesting got money even though cops didnt catch culprits anything prevent future like asking bank disable aeps locking biometrics etc",
    "light_cleaned_title": "Lost my first earned 10k to fraud. BEWARE.",
    "light_cleaned_selftext": "As a college student, i recently earned 10k and lost it all today to a fraud. Here's what happened:- Friday (around 8pm) :- i deposit my money to my Indian bank account. Saturday (8pm):- i received a text saying that 10k have been withdrawn from my bank account through aeps (aadhar enabled payment system) Idk how it happened, i didn't even received any otp to confirm the transaction. Aeps shouldn't work without my fingerprint. Either someone cloned my fingerprint or got access to my biometric data. Or someone maanged to bypass the fingerprint authentication system.idk which one is it. At thr end of the day, it's me who lost the money. I'm completely broken now. I lodged the complaint in cyber crime portal. Will inform the bank on Monday. I don't really have any hopes tho. We all have our bank accounts linked to aadhar, it can happen to any of us. SO BEWARE. EDIT:- I just checked my aadhar authentication history on aadhar's website. It says \"no record found\", means these hackers probably found a way to withdraw money without aadhar authentication. Edit 2:- [A similar case for people who didn't know it can happen ](https://m-timesofindia-com.cdn.ampproject.org/v/s/m.timesofindia.com/city/lucknow/cyber-fraud-man-loses-rs-30000-from-bank-account-through-aeps/amp_articleshow/82791673.cms?amp_gsa=1&amp_js_v=a9&usqp=mq331AQIUAKwASCAAgM%3D#amp_tf=From%20%251%24s&aoh=16822266108804&referrer=https%3A%2F%2Fwww.google.com)",
    "light_cleaned_comments": "Lock your biometrics from aadhar website. This will prevent unauthorised access. Soch bro tucche type chor ye sab kar sakte hain to govt kya kar sakti hai agar karne pe aa gayi to adhar vagerah database isiliye banwaye gaye hain Done,wish i knew that sooner . Don't banks need it or something? What are the pitfalls? > Friday (around 8pm) :- i deposit my money to my Indian bank account. How is it possible? Evening bank? Most banks close their counter by 4 PM. Did you deposit via ATM? Then money won't be credited before Monday. You can unlock them anytime with a single click. Otp authentication still works even when the biometrics are locked. Ohh my bad, i should've been more clear. I have two Bank accounts. One i use for daily upi transactions and other for saving or keeping money aside. I transferred money from my upi bank,(federal Bank) to indian bank. Using gpay. Ah okay People who tend to lose their phone, don't do this. Aadhar biometric unlocking requires OTP, but if u lost your phone n go to service provider, they will need to verify your fingerprint to give new sim. Which won't be possible because your biometrics is locked. It's a fucking loop. Be sure of what you are getting into. Heard that AEPS was discontinued recently because of frauds like this, wakanda bank was yours? It's infuriating that bank won't allow us to disable this feature. Won't email suffice? For sending the OTP?? Since email is also linked to Aadhar.. Fi account? Can you share screenshot of sms.. seems the post is fraud... OP, you can ask your bank to deseed your aadhar. ELI5 how this AEPS works and how to prevent fraud (since like majority of places require your aadhar and/or biometrics) Yeah Here Mine was indian bank. I'm surprised that there isn't any noise about this fraud in the public,else i'd have disabled my biometrics. Damn, then what am i supposed to do now?. Am afraid of having money in my bank accounts now since they all are linked to aadhar. And my aadhar clearly have been compromised. Reach out ur bank immediately bro only bank can help in this situation How is this possible. This is the first im hearing about this. Can someone explain how did this happen? Did u do txn of 500 on 21st Apr ? Probably the same person used ur credentials for more money.. where was that txn done ? And how come precious Indian bank smses were coming on sim2 and the last one came on sim 1.. also, bank smses wont usually have comma for 10,000..... are you trying to fool us.. No, there are recent reports of this. It appears to be some loop hole which needs immediate fix Sorry i’m late but from what I know, RBI have this rule where every banking customer has an insurance of some X amount eg. 1Lakh or so. You have to reach the bank within 4 hours of money deduction and ask for a grievance form or something! These banks won’t let you have it so u need to lift the bank on your head and be confident that you weren’t the one who withdrew the money and I need a backend investigation on this thing! If you are successful in filling the grievance it is said that you will eventually get your money back within some time. BUT GETTING THE GRIEVANCE FORM FROM THEM IS A BIT OF A PROBLEM LOL coz Bank will have to pay you for their mistakes at the end. . Coming from a cybersecurity student. Sorry for my RIP english. I didn't do that txn of 500 either. It's my fault that i didn't see that msg, else i'd have blocked everything. I usually have so many messages so i tend to ignore a lot of them. I didn't notice that 500 txn message at all and that's completely my fault. >how come precious Indian bank smses were coming on sim2 and the last one came on sim 1.. I don't really understand what you mean by that.All the indian bank messages are coming on sim1 only. Since it's linked to my bank account. >bank smses wont usually have comma for 10,000..... are you trying to fool us.. I have no Idea about it. You can see the message is from Indian bank itself. I checked the balance as well and the money has been deducted. I'm not trying to fool any one. I couldn't go to bank since bank is off till Monday. But i did lodged a complaint at cyber security portal, would that work? I will go to bank first thing on Monday. I did try to contact the branch manager but he was just so rude and didn't want to listen at all . He said to visit the branch on Monday and hanged up. [this is a similar case](https://www.moneylife.in/article/fraud-alert-beware-of-aadhaar-enabled-payment-system-frauds-and-fake-apps/70183.html) It's not happening for the first time . There's some kind of loop hole in this whole aeps system itself. Banks are closed till monday . All i could do is to report it on cyber crime portal. Man this is serious Although my account has zero balance but still it is worrisome Did you use AEPS before with some banking correspondent?? No, i have never used aeps. Infact i didn't even know it existed till i lost my money. I mainly use upi apps or imps/neft for my transactions. Difficult for me to get proper sleep if my account has some balance Bank should have option to disable AEPS altogether Need to contact bank They can close a particular payment channel Why did you remove also how did the hackers gain information? Why would you think it's a \"story\" though? I don't get it. As I told you these managers won’t talk properly coz they are the ones who will have to pay you and ofc they don’t want to. sorry to say but Idts you’ll get anything back coz it is said after 4 hours it is nearly impossible to track down the transaction step by step. But you should not lose hope and fingers crossed! Hard earned money is valuable even if it is 100 or 10000. Keep taking updates from the cybercell and pray. Thanks for the clarification. Have you used AePS or fingerprint registration recently? It seems your fingerprint is stolen. From the SMS screenshot, it is clear that someone has withdrawn cash using your fingerprints. This should be easily traceable. Aadhaar OTPs aren't sent in email Why do they collect email ID then? The fraud relies on an Aadhar Number and Biometrics (fingerprint usually) leak. To do a transaction with AEPS, you only need a Bank Name, Aadhar Number, and a Biometrics verification. Fraudster plugs in those details, gets cash, and the fraud is successful. Edit: To prevent it, lock your biometrics for Aadhar. Damn, most people especially elderly will fall to this kind of fraud easily. I hope government takes some steps. so got ur money? Noop Any update to this situation? 1. Did you figure out how the scammers got your biometrics? 2. Did you get any status update from the cyber police about your case? Or even an acknowledgement that a case has been opened/closed/resolved/etc? 3. How did the bank react? Did they tell you what will happen/how to avoid in future? 4. Have you been told you'll get your money back? I saw some reddit commenters saying RBI has an insurance to make sure scam victims are compensated, not sure if it's true Hey, 1.they probably bypassed the biometric lock, idk how. There's not much info about it. 2. Cyber police did absolutely nothing 3. Bank was trying to put it on me, as if that's my fault. But i showed them rbi guidelines for the situation, and then they acted accordingly. 4. Yes i got my money bank, although it took a year and countless bank visits. Interesting that you got the money even though the cops didn't catch the culprits. Did you do anything to prevent this in future? Like asking your bank to disable AEPS or locking biometrics etc"
}