{
    "id": "16gve3l",
    "title": "Acer India scammed me! Kindly help me get back my money. More details below.",
    "url": "https://www.reddit.com/r/india/comments/16gve3l/acer_india_scammed_me_kindly_help_me_get_back_my/",
    "selftext": "\nAfter a Flipkart horror, I decided to purchase an acer aspire 5 from the acer e-store. The laptop what I received came with a minor dent in the top lid and the product description mentioned that the laptop comes with backlit keyboard. The one I received didn't have a backlit keyboard. Acer basically scammed me. It's been more than two weeks since I raised a return on refund request and they are not at all responding to my emails.\n\nKindly retweet this tweet and help me get back my money.\n\nTweet link: \nhttps://twitter.com/ncklntro/status/1699772801094451538?t=u30C4sfz97lIqfHNnFOpHA&s=19\n\nThank you :)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694534912.0,
    "convurl": "https://external-preview.redd.it/FI23kWGcYVyYchVsfleMcB9eSZEeOw1Tx4kB0t5YNks.jpg?auto=webp&s=ff0fd77588662b7f6a0e6ac9bd2ca43f57ec5941",
    "comments": [
        "Bro raise a CC with all available information and interaction. I hope you had a video unboxing. You will have a strong case",
        "Thanks for your support, I have raised a case in consumer court (online) with some supporting documents (I do have more, should I upload them too?). They aren't responding there either :( \nGovernment officials asked for an update as well yet no response. Unfortunately I didn't take any unboxing video but I took unboxing images with timestamp. Service engineer visited a week ago and confirmed it has a poor workmanship and missing backlight. Acer isn't acknowledging it either. They straight up refusing to refund. Their site clearly mentions that there is a return policy in case of any problems. I hope they'll resolve it soon. Worst customer service ever only next to Flipkart.",
        "After a fk horror, you still chose to buy it online? Kahan se laate ho itni himmat.",
        "Just go to consumer forum. It's not that difficult. You don't have to hire any lawyer, can plead yourself.",
        "I got an Acer Aspire 7 from Acer e store just like you in Feb 2022. Mine is working perfectly fine and have done heavy gaming on it as well. Sounds like bad luck bro. Anyway I hope you get it sorted.",
        "Reach out to consumer support helpline and let them send a mail.",
        "I know, right? I hope I'm not victim blaming but when you buy expensive electronics, which most average people don't do very often, just spend a few hours of your life going to a store physically and inspect the product before paying for it.",
        "The local store was selling the same laptop for 6k higher with no return policy. Unfortunately amazon didn't sell this that time or I would have definitely gone with amazon. Their customer support is excellent (in my experience)",
        "I'm glad that your device is working fine. You would have probably been in the same situation if you had received a damaged one. Thanks, I hope they'll resolve it soon.",
        "For now I have lodged a complaint online (NCH) If it doesn't work I'll definitely try the local consumer court, thanks for the suggestion",
        "Done that, acer isn't responding to them too :("
    ],
    "cleaned_text": "acer india scammed kindly help get back money details flipkart horror decided purchase acer aspire acer estore laptop received came minor dent top lid product description mentioned laptop comes backlit keyboard one received didnt backlit keyboard acer basically scammed two weeks since raised return refund request responding emails kindly retweet tweet help get back money tweet link thank ",
    "cleaned_title": "acer india scammed kindly help get back money details",
    "cleaned_selftext": "flipkart horror decided purchase acer aspire acer estore laptop received came minor dent top lid product description mentioned laptop comes backlit keyboard one received didnt backlit keyboard acer basically scammed two weeks since raised return refund request responding emails kindly retweet tweet help get back money tweet link thank",
    "cleaned_comments": "bro raise cc available information interaction hope video unboxing strong case thanks support raised case consumer court online supporting documents upload arent responding either government officials asked update well yet response unfortunately didnt take unboxing video took unboxing images timestamp service engineer visited week ago confirmed poor workmanship missing backlight acer isnt acknowledging either straight refusing refund site clearly mentions return policy case problems hope theyll resolve soon worst customer service ever next flipkart fk horror still chose buy online kahan se laate ho itni himmat go consumer forum difficult dont hire lawyer plead got acer aspire acer e store like feb mine working perfectly fine done heavy gaming well sounds like bad luck bro anyway hope get sorted reach consumer support helpline let send mail know right hope im victim blaming buy expensive electronics average people dont often spend hours life going store physically inspect product paying local store selling laptop k higher return policy unfortunately amazon didnt sell time would definitely gone amazon customer support excellent experience im glad device working fine would probably situation received damaged one thanks hope theyll resolve soon lodged complaint online nch doesnt work ill definitely try local consumer court thanks suggestion done acer isnt responding",
    "light_cleaned_title": "Acer India scammed me! Kindly help me get back my money. More details below.",
    "light_cleaned_selftext": "After a Flipkart horror, I decided to purchase an acer aspire 5 from the acer e-store. The laptop what I received came with a minor dent in the top lid and the product description mentioned that the laptop comes with backlit keyboard. The one I received didn't have a backlit keyboard. Acer basically scammed me. It's been more than two weeks since I raised a return on refund request and they are not at all responding to my emails. Kindly retweet this tweet and help me get back my money. Tweet link: Thank you :)",
    "light_cleaned_comments": "Bro raise a CC with all available information and interaction. I hope you had a video unboxing. You will have a strong case Thanks for your support, I have raised a case in consumer court (online) with some supporting documents (I do have more, should I upload them too?). They aren't responding there either :( Government officials asked for an update as well yet no response. Unfortunately I didn't take any unboxing video but I took unboxing images with timestamp. Service engineer visited a week ago and confirmed it has a poor workmanship and missing backlight. Acer isn't acknowledging it either. They straight up refusing to refund. Their site clearly mentions that there is a return policy in case of any problems. I hope they'll resolve it soon. Worst customer service ever only next to Flipkart. After a fk horror, you still chose to buy it online? Kahan se laate ho itni himmat. Just go to consumer forum. It's not that difficult. You don't have to hire any lawyer, can plead yourself. I got an Acer Aspire 7 from Acer e store just like you in Feb 2022. Mine is working perfectly fine and have done heavy gaming on it as well. Sounds like bad luck bro. Anyway I hope you get it sorted. Reach out to consumer support helpline and let them send a mail. I know, right? I hope I'm not victim blaming but when you buy expensive electronics, which most average people don't do very often, just spend a few hours of your life going to a store physically and inspect the product before paying for it. The local store was selling the same laptop for 6k higher with no return policy. Unfortunately amazon didn't sell this that time or I would have definitely gone with amazon. Their customer support is excellent (in my experience) I'm glad that your device is working fine. You would have probably been in the same situation if you had received a damaged one. Thanks, I hope they'll resolve it soon. For now I have lodged a complaint online (NCH) If it doesn't work I'll definitely try the local consumer court, thanks for the suggestion Done that, acer isn't responding to them too :("
}