{
    "id": "18oy3xl",
    "title": "Lok Sabha witnesses sharp exchange between Speaker Om Birla and Minister Hardeep Singh Puri",
    "url": "https://www.thehindu.com/news/national/lok-sabha-witnesses-sharp-exchange-between-speaker-om-birla-and-union-minister-hardeep-singh-puri/article67662094.ece/amp/",
    "selftext": "Speaker asks Hardeep Singh Puri to only reply in Hindi. To which Mr Puri said that he can reply in English, to which the speaker said give me a written statement that he wants to use Punjabi. \n\nLooks like Hindi is being imposed on the parliament and rest of India.",
    "flair": "Law & Courts",
    "score": 260,
    "num_comments": 25,
    "created_utc": 1703307537.0,
    "convurl": "https://external-preview.redd.it/QxC2L29uznWknQzw6mccyJZjaGRrTPB5h3lK7W5H19E.jpg?auto=webp&s=1cf98f012b6e6453ff64597f61746a5d28a1d4ab",
    "comments": [
        "Hardeep puri also took a pinch on birla and said i can give bhojpuri touch while speaking hindi if you want .",
        "BJP enacting a farce to pretend that LS is functioning normally in the absence of the Opposition MPs.",
        "Least interested in these dramas, this house has become a puppetry house of Modiji and his chamchas.",
        "They have made a mockery out of the speaker’s chair.",
        "They have made a mockery out of the speaker’s chair.",
        "These guys are worse actors than the rejects from dramatics society in my school.",
        "A nautanki to coverup the suspension. The Jat and Farmer enactment didn’t work I think",
        "If you’re going to write something with an article link, at least write it correctly. \n\nThis is what happened, as per the article you shared. \n\n> During the Question Hour, BJP MP from Delhi, Manoj Tiwari, had asked a question about difficulties faced by migrant labourers in Delhi and West Bengal in the absence of Ayushman Bharat cards.\n\n> Just when the Minister started replying in English, Mr. Birla requested him to speak in Hindi if possible. “Mr. Speaker, I will reply in Hindi. I can reply in Punjabi if you wish, Manoj ji understands Punjabi....But a direction from the Chair comes on the use of language,” Mr. Puri said as he started speaking in Punjabi.\n\n> Mr. Birla intervened and said “You know many languages. You can reply in English as well. That is not a problem.” He added,“If you want to reply in Punjabi, you have to give it to me in writing”.",
        "Who made this WhatsApp uncle the lok sabha speaker? I checked his age and is 61 but looks like in his 80s",
        "Bhai, in case you haven't noticed, this whole country is being run be Whatsapp uncles",
        "https://preview.redd.it/fi4vy3lju08c1.png?width=1080&format=pjpg&auto=webp&s=ffe205724b80779d569de3975c987be5301b5bb1",
        "Modi, not modiji. He doesn't deserve any respect after what he has done to the parliament and a lot of things in general.",
        "Gobiji",
        "I think this belongs to r/LeopardsAteMyFace.",
        "Maybe his career as a lawmaker is more relevant?",
        "It's ModiG. G rhymes with my desire to Undo the last 10 years!",
        "The speaker absolutely had no problem with the use of English. It's interesting how casually charges of Hinthi imposition are thrown around nowadays. I guess election times make people do things.",
        "Misleading headline",
        "See they have their own agreements and disagreements in spite of absebtof opposition. That's what they want to show off",
        "Speaker can’t dictate in which language a MP can address parliament. That’s the whole point even Mr Puri addressed.",
        "Demonitisation news circulated on what's app before the prime minister announced it. The entire establishment is what's app uncles.",
        "go watch video he didnt dictated he said i request you ,if you can give reply in hindi if you know hindi if not then you can continue in english as well to which he starts saying something in punjabi to which speaker said if you wnt to give answer in punjabi its fine but u have to give something in written.i dont think its a imposition",
        "Freedom of speech bhi gaya baad ma\n.",
        "[Don't call me 'Modiji', I am Modi](https://economictimes.indiatimes.com/news/politics-and-nation/dont-call-me-modiji-i-am-modi-pm-gives-credit-of-poll-victories-to-bjp-workers/articleshow/105816807.cms)   \n\n\n> He said that the public knows him only by the name Modi, so there is no need to create a distance between them by adding formal titles like 'Adarniya', 'Shri', and 'Ji' to his name.    \n\nRemember this when someone's sentiments gets hurt for not addressing him properly.",
        "I won't forget what this liar has done to the parliament."
    ],
    "cleaned_text": "lok sabha witnesses sharp exchange speaker om birla minister hardeep singh puri speaker asks hardeep singh puri reply hindi mr puri said reply english speaker said give written statement wants use punjabi looks like hindi imposed parliament rest india ",
    "cleaned_title": "lok sabha witnesses sharp exchange speaker om birla minister hardeep singh puri",
    "cleaned_selftext": "speaker asks hardeep singh puri reply hindi mr puri said reply english speaker said give written statement wants use punjabi looks like hindi imposed parliament rest india",
    "cleaned_comments": "hardeep puri also took pinch birla said give bhojpuri touch speaking hindi want bjp enacting farce pretend ls functioning normally absence opposition mps least interested dramas house become puppetry house modiji chamchas made mockery speakers chair made mockery speakers chair guys worse actors rejects dramatics society school nautanki coverup suspension jat farmer enactment didnt work think youre going write something article link least write correctly happened per article shared question hour bjp mp delhi manoj tiwari asked question difficulties faced migrant labourers delhi west bengal absence ayushman bharat cards minister started replying english mr birla requested speak hindi possible mr speaker reply hindi reply punjabi wish manoj ji understands punjabibut direction chair comes use language mr puri said started speaking punjabi mr birla intervened said know many languages reply english well problem addedif want reply punjabi give writing made whatsapp uncle lok sabha speaker checked age looks like bhai case havent noticed whole country run whatsapp uncles modi modiji doesnt deserve respect done parliament lot things general gobiji think belongs rleopardsatemyface maybe career lawmaker relevant modig g rhymes desire undo last years speaker absolutely problem use english interesting casually charges hinthi imposition thrown around nowadays guess election times make people things misleading headline see agreements disagreements spite absebtof opposition thats want show speaker cant dictate language mp address parliament thats whole point even mr puri addressed demonitisation news circulated whats app prime minister announced entire establishment whats app uncles go watch video didnt dictated said request give reply hindi know hindi continue english well starts saying something punjabi speaker said wnt give answer punjabi fine u give something writteni dont think imposition freedom speech bhi gaya baad dont call modiji modihttpseconomictimesindiatimescomnewspoliticsandnationdontcallmemodijiiammodipmgivescreditofpollvictoriestobjpworkersarticleshowcms said public knows name modi need create distance adding formal titles like adarniya shri ji name remember someones sentiments gets hurt addressing properly wont forget liar done parliament",
    "light_cleaned_title": "Lok Sabha witnesses sharp exchange between Speaker Om Birla and Minister Hardeep Singh Puri",
    "light_cleaned_selftext": "Speaker asks Hardeep Singh Puri to only reply in Hindi. To which Mr Puri said that he can reply in English, to which the speaker said give me a written statement that he wants to use Punjabi. Looks like Hindi is being imposed on the parliament and rest of India.",
    "light_cleaned_comments": "Hardeep puri also took a pinch on birla and said i can give bhojpuri touch while speaking hindi if you want . BJP enacting a farce to pretend that LS is functioning normally in the absence of the Opposition MPs. Least interested in these dramas, this house has become a puppetry house of Modiji and his chamchas. They have made a mockery out of the speaker’s chair. They have made a mockery out of the speaker’s chair. These guys are worse actors than the rejects from dramatics society in my school. A nautanki to coverup the suspension. The Jat and Farmer enactment didn’t work I think If you’re going to write something with an article link, at least write it correctly. This is what happened, as per the article you shared. > During the Question Hour, BJP MP from Delhi, Manoj Tiwari, had asked a question about difficulties faced by migrant labourers in Delhi and West Bengal in the absence of Ayushman Bharat cards. > Just when the Minister started replying in English, Mr. Birla requested him to speak in Hindi if possible. “Mr. Speaker, I will reply in Hindi. I can reply in Punjabi if you wish, Manoj ji understands Punjabi....But a direction from the Chair comes on the use of language,” Mr. Puri said as he started speaking in Punjabi. > Mr. Birla intervened and said “You know many languages. You can reply in English as well. That is not a problem.” He added,“If you want to reply in Punjabi, you have to give it to me in writing”. Who made this WhatsApp uncle the lok sabha speaker? I checked his age and is 61 but looks like in his 80s Bhai, in case you haven't noticed, this whole country is being run be Whatsapp uncles Modi, not modiji. He doesn't deserve any respect after what he has done to the parliament and a lot of things in general. Gobiji I think this belongs to r/LeopardsAteMyFace. Maybe his career as a lawmaker is more relevant? It's ModiG. G rhymes with my desire to Undo the last 10 years! The speaker absolutely had no problem with the use of English. It's interesting how casually charges of Hinthi imposition are thrown around nowadays. I guess election times make people do things. Misleading headline See they have their own agreements and disagreements in spite of absebtof opposition. That's what they want to show off Speaker can’t dictate in which language a MP can address parliament. That’s the whole point even Mr Puri addressed. Demonitisation news circulated on what's app before the prime minister announced it. The entire establishment is what's app uncles. go watch video he didnt dictated he said i request you ,if you can give reply in hindi if you know hindi if not then you can continue in english as well to which he starts saying something in punjabi to which speaker said if you wnt to give answer in punjabi its fine but u have to give something in written.i dont think its a imposition Freedom of speech bhi gaya baad ma . [Don't call me 'Modiji', I am Modi](https://economictimes.indiatimes.com/news/politics-and-nation/dont-call-me-modiji-i-am-modi-pm-gives-credit-of-poll-victories-to-bjp-workers/articleshow/105816807.cms) > He said that the public knows him only by the name Modi, so there is no need to create a distance between them by adding formal titles like 'Adarniya', 'Shri', and 'Ji' to his name. Remember this when someone's sentiments gets hurt for not addressing him properly. I won't forget what this liar has done to the parliament."
}