{
    "id": "1fuutxw",
    "title": " 200 major railway accidents took place in past five years, 351 people killed, show data ",
    "url": "https://www.thehindu.com/news/national/200-major-railway-accidents-took-place-in-past-five-years-351-people-killed-show-data/article68710277.ece",
    "selftext": "As many as 297 persons died and 637 were injured in the 10 most consequential accidents, including Balasore triple train tragedy in June last year. This was followed by East Coast Railway zone, which saw 15 accidents that caused 20 deaths and 79 injuries. The most recent major accident was the Kanchanjunga Express accident that claimed 10 lives and occurred in July earlier this year.\n\nIn Central Railway zone, there were 22 accidents with one death and two injuries. In Eastern Railway, there were 12 accidents with one death and nine injuries while East Central zone saw 18 accidents with eight deaths and 33 injuries.\n\n\nIn the North Central zone, 21 accidents were reported that caused two deaths and 49 injuries, while the Northern Railway reported 25 accidents with five deaths and five injuries.\n\nSouth Central Railway reported 12 accidents with one death and 26 injuries, while South East Central zone reported nine accidents with three deaths and six injuries.\n\nNorth East Frontier Railway saw nine accidents with nine deaths and 45 injuries, while North Western Zone saw ten accidents with 70 injuries. West Central zone reported seven accidents with one death and nine injuries, while Western zone reported 12 accidents with three deaths.",
    "flair": "Policy/Economy",
    "score": 13,
    "num_comments": 1,
    "created_utc": 1727913895.0,
    "convurl": "https://external-preview.redd.it/7Uzk6KLECkTEAJ9RTx1-8QsRtxQMgGFL7NcKrCHBj_w.jpg?auto=webp&amp;v=enabled&amp;s=6ebcd94c0f27ad2def26ab8a25d883213a61b901",
    "comments": [
        "Nice, now how many bus accidents?"
    ],
    "cleaned_text": "major railway accidents took place past five years people killed show data many persons died injured consequential accidents including balasore triple train tragedy june last year followed east coast railway zone saw accidents caused deaths injuries recent major accident kanchanjunga express accident claimed lives occurred july earlier year central railway zone accidents one death two injuries eastern railway accidents one death nine injuries east central zone saw accidents eight deaths injuries north central zone accidents reported caused two deaths injuries northern railway reported accidents five deaths five injuries south central railway reported accidents one death injuries south east central zone reported nine accidents three deaths six injuries north east frontier railway saw nine accidents nine deaths injuries north western zone saw ten accidents injuries west central zone reported seven accidents one death nine injuries western zone reported accidents three deaths ",
    "cleaned_title": "major railway accidents took place past five years people killed show data",
    "cleaned_selftext": "many persons died injured consequential accidents including balasore triple train tragedy june last year followed east coast railway zone saw accidents caused deaths injuries recent major accident kanchanjunga express accident claimed lives occurred july earlier year central railway zone accidents one death two injuries eastern railway accidents one death nine injuries east central zone saw accidents eight deaths injuries north central zone accidents reported caused two deaths injuries northern railway reported accidents five deaths five injuries south central railway reported accidents one death injuries south east central zone reported nine accidents three deaths six injuries north east frontier railway saw nine accidents nine deaths injuries north western zone saw ten accidents injuries west central zone reported seven accidents one death nine injuries western zone reported accidents three deaths",
    "cleaned_comments": "nice many bus accidents",
    "light_cleaned_title": "200 major railway accidents took place in past five years, 351 people killed, show data",
    "light_cleaned_selftext": "As many as 297 persons died and 637 were injured in the 10 most consequential accidents, including Balasore triple train tragedy in June last year. This was followed by East Coast Railway zone, which saw 15 accidents that caused 20 deaths and 79 injuries. The most recent major accident was the Kanchanjunga Express accident that claimed 10 lives and occurred in July earlier this year. In Central Railway zone, there were 22 accidents with one death and two injuries. In Eastern Railway, there were 12 accidents with one death and nine injuries while East Central zone saw 18 accidents with eight deaths and 33 injuries. In the North Central zone, 21 accidents were reported that caused two deaths and 49 injuries, while the Northern Railway reported 25 accidents with five deaths and five injuries. South Central Railway reported 12 accidents with one death and 26 injuries, while South East Central zone reported nine accidents with three deaths and six injuries. North East Frontier Railway saw nine accidents with nine deaths and 45 injuries, while North Western Zone saw ten accidents with 70 injuries. West Central zone reported seven accidents with one death and nine injuries, while Western zone reported 12 accidents with three deaths.",
    "light_cleaned_comments": "Nice, now how many bus accidents?"
}