{
    "id": "msha2n",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/msha2n/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 35,
    "num_comments": 83,
    "created_utc": 1618623019,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "So I've been seeing this AMAZING Netflix series called Paava Kadhaigal. \nIt tackles social issues like LGBTQ and women treatement in our society. \nI really recommend and urge you all to watch it. It's really thought provoking and the acting is on another level. \nIt is south Indian but there is no over the top action scenes or anything😅",
        "Sergei Bondarchuk's War and Peace adaptation. Ridiculous how they filmed something so grand in scale with no CGI.\n\nThe Father. Watch this just for Anthony Hopkins. You won't regret it.",
        "Love and monsters is a good watch. Loved the premise and the characters.",
        "&gt;. It is south Indian but there is no over the top action scenes or anything😅\n\nTamil*\nWe don't call Hindi films as North Indian do we?",
        "Loved 'Joji'",
        "Line of Duty on netflix , i really dunno how the hell did i miss this brilliant series all these years.\n\n also watch Amend again on netflix  .",
        "The first story is mind blowing. Too real",
        "+1 cannot recommend Line of Duty more! Re watching it again with my wife",
        "hey guys. foreigner here. can you recommend me some good Hindi tv series?\n\ni am fascinated by India/south asia and i study Hindi these days. trying to improve and practice my language by watching indian tv/films.\n\nones which i LOVED so far are: \n\nYah Meri Family - heartwarming, realistic and very amusing middle class family story.\n\nPanchayat (2020) - really great and delicate. amazing actors and seems very realistic.\n\nBandish Bandits - it was good, mostly thanks to the indian classical music parts, a tad too melodramatic for me at times.\n\nCAN YOU RECOMMEND ME ANYTHING ALONG THESE LINES? smart comedies or dark dramas are also welcomed. \n\nDhanyavad",
        "Asuran - Touching story (Prime) 7/10\n\nRun - Interesting thriller (Netflix) 7/10\n\nUdaan ( Tamil) - Inspiring, touching but unrealistic (Prime) 6/10",
        "Take my upvote, you madrasi :p",
        "I recently discovered the podcast \"Umeed\" by Zakir Khan. It's on Gaana. It has a unique take to some things in life which we often don't pay attention too.",
        "My B 😬😅",
        "Made in heaven, Paatal lok, Panchayat..",
        "Watch \"Gullak\" if you can find it where you are. 2 short seasons based on the life a typical lower middle class Indian nuclear family. Snippets of daily life which are eerily accurate and still has humour in it aplenty.  \n\n&amp;#x200B;\n\nPaatal Lok is a must watch and falls squarely in the dark drama/ thriller category.",
        "Spaced 1st season was very good, 2nd was meh",
        "thanks ji, both sound really great. already watched and loved panchayat. hogaya.",
        "great! thank you. it sounds really good.",
        "Kindly suggest some thought provoking _hatt ke_ movies released in the last few years. I don't want to watch the typical 'girl boy love story' masala films. They are incredibly boring. \n\nSome movies I watched recently and liked:\nPink, Pagglait, Thappad, Ludo, Lunchbox, Hindi Medium.\n\nPreference on comedy and/or light-heartedness. Any suggestions?",
        "How about TVF pitchers?",
        "'Invincible' on Prime. Dark superhero - animated series. 8/10",
        "bezati mat karwa bhai",
        "Any game recommendation for android?",
        "Masaan and Udaan",
        "Try r/AndroidGaming",
        "Scam1992?",
        "Kumbalangi Nights",
        "Watched **Grand army** on Netflix.\n\n\n\nSo so much better than Euphoria, finished in one day.",
        "Watched an old musical called \"Begin Again\". It was nice.",
        "Its really nice the first time you watch it but its really bad on the second watch. Also didn't realize it's classified as old now haha",
        "Rang De Basanti. Worth rewatching",
        "Such a decent chutiya!!",
        "Not an easy documentary to watch but it's important to know that a world exists around us that we are not aware of and it's fucked up and right here in India.\n\n[Stolen Innocence on YouTube](https://youtu.be/eTtBnPxNpYs)",
        "It's a good one time watch.\n\nMy bad! It was released in 2013 but somehow my mind had read it as 2006.",
        "+1 to gullak, amazing show and very underrated",
        "Just watched 'Mandy'. Trippy /  hallucinatory visuals and pretty cool cinematography. One of the unique films I've seen in a while.",
        "I liked the movie as well. I liked how it was a non-romantic relationship btwn the characters and ofcourse the cheezy ending.",
        "I forgot the name, Someone reading the comment, please try to guess.\n\nOne of the most fabulous movies of the decade. I will give a loose description-/\n\n*movie ko 3 saal lage bnne mei, Khazana lene jata hai vo neeche. Horror genre*",
        "Have been watching some old thrillers- Orphan, The sixth sense, Shawshank Redemption and Life is beautifull. \n\nWill watch some more today.",
        "Tumbbad?",
        "Yesss. Tumbbad. U have watched it already I guess.",
        "No I googled it based on the clues you gave. Horror is normally not my preferred genre since most horror movies rely on jump scares which scare the bejesus out of me, but I'll take a look at this. Thanks :)",
        "Watched Nobody (2021) yesterday, loved it. It's like John Wick.",
        "watched citizen kane recently. I must say it's one of the best movies I have ever watched.",
        "Aamis (The Ravening) it's an Assamese movie, one of the best Indian films I've come across so far. Not light-hearted at all, for that you can try Jaane Bhi Do Yaaro oldie but goldie",
        "Where did you watch it?",
        "~~Downloaded from torrent~~ I don't remember xD",
        "81 all out - a podcast about cricket. They review and talk about ongoing series (mostly test cricket), interview cricket authors, commentators and cricketers too. Hosted by Siddarth Vaidyanathan, a cricket author. Has very fun and interesting conversations. Should listen to the episode where Prem Panicker was the guest.",
        "So true. One of the recent series that has me waiting for the next episode",
        "I read the whole comic . Awesome",
        "The Magnificent Seven(new one)\n\n\nLoved it\n\n\nNow I will watch the old one then I will watch Seven Samurai.\n\n\nI love westerns and samurai movies",
        "More like Home Alone : Adult Version :)",
        "Photograph Maybe?",
        "Kota Factory",
        "Is it really good? people say it is okay but the rating is quite bad...",
        "hatt ke style comedy: bahut hua sammaan\n\naction/romcom: mard ko dard nahi hota",
        "ROtten tomatoes is run by boring old boomers . If you like westerns its a fun action flick. Not the greatest of them. But it'll keep you hooked.",
        "RT is quite ass, I am aware. They infamously gave a 0% rating to Dave Chappelle's Sticks and stones, a special that made me laugh my guts out. \n\nthing is, imdb rating of the movie is also not that great. But okay I'll watch it",
        "If you like westerns that is. If you dont then maybe avoid it.\n\nChappelles awesome though.",
        "64% on rotten tomatoes is not bad, I’d say",
        "I like westerns. Especially loved the Hateful eight, django and buster scruggs. but I also like those old timey westerns like the dollars trilogy",
        "that's fair. I do have an absurdly high benchmark for ratings. I generally only watch movies with imdb ratings above 7",
        "I don’t trust IMDb at all. They have surprisingly high ratings for some shitty but popular movies, and their ratings for Indian movies are absolutely unreliable.",
        "you are correct about indian movies part, but I don't watch many indian movies anyway. I don't trust rotten tomatoes at all though",
        "The Priest. It's a malayalam movie on prime. It's a thriller. Good one time watch.",
        "Shaitaan Haveli on Amazon Prime. It's a horror comedy inspired by Indian B grade horror movies in the 80's",
        "The Sopranos &lt;3",
        "If you haven't watched it yet, watch Nobody. Bob odenkirk is just amazing and i hope he and john wick will share the universe.",
        "Netflix ?",
        "The lost bay of the great pirates.",
        "Which platform?",
        "Thanks",
        "Not watched those films 😅",
        "Have you watched The Wild Bunch?",
        "\"Q: Into the Storm\" Documentary on HBO. Great watch!",
        "I don't play much on my phone, but here are some that I have liked recently:  \n\n\nThe Almost Gone  \nCard Thief  \nTiny Room  \nHidden Through Time  \nThe House of Da Vinci",
        "I made this list if anyone interested in horror, thriller, crime\n\n [Underrated movies &amp; shows - IMDb](https://www.imdb.com/list/ls090509747/)",
        "I will now",
        "Omg, Thank you kind stranger ❤️"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "ive seeing amazing netflix series called paava kadhaigal tackles social issues like lgbtq women treatement society really recommend urge watch really thought provoking acting another level south indian top action scenes anything sergei bondarchuks war peace adaptation ridiculous filmed something grand scale cgi father watch anthony hopkins wont regret love monsters good watch loved premise characters gt south indian top action scenes anything tamil dont call hindi films north indian loved joji line duty netflix really dunno hell miss brilliant series years also watch amend netflix first story mind blowing real recommend line duty watching wife hey guys foreigner recommend good hindi tv series fascinated indiasouth asia study hindi days trying improve practice language watching indian tvfilms ones loved far yah meri family heartwarming realistic amusing middle class family story panchayat really great delicate amazing actors seems realistic bandish bandits good mostly thanks indian classical music parts tad melodramatic times recommend anything along lines smart comedies dark dramas also welcomed dhanyavad asuran touching story prime run interesting thriller netflix udaan tamil inspiring touching unrealistic prime take upvote madrasi p recently discovered podcast umeed zakir khan gaana unique take things life often dont pay attention b made heaven paatal lok panchayat watch gullak find short seasons based life typical lower middle class indian nuclear family snippets daily life eerily accurate still humour aplenty ampxb paatal lok must watch falls squarely dark drama thriller category spaced st season good nd meh thanks ji sound really great already watched loved panchayat hogaya great thank sounds really good kindly suggest thought provoking hatt ke movies released last years dont want watch typical girl boy love story masala films incredibly boring movies watched recently liked pink pagglait thappad ludo lunchbox hindi medium preference comedy andor lightheartedness suggestions tvf pitchers invincible prime dark superhero animated series bezati mat karwa bhai game recommendation android masaan udaan try randroidgaming scam kumbalangi nights watched grand army netflix much better euphoria finished one day watched old musical called begin nice really nice first time watch really bad second watch also didnt realize classified old haha rang de basanti worth rewatching decent chutiya easy documentary watch important know world exists around us aware fucked right india stolen innocence youtubehttpsyoutubeettbnpxnpys good one time watch bad released somehow mind read gullak amazing show underrated watched mandy trippy hallucinatory visuals pretty cool cinematography one unique films ive seen liked movie well liked nonromantic relationship btwn characters ofcourse cheezy ending forgot name someone reading comment please try guess one fabulous movies decade give loose description movie ko saal lage bnne mei khazana lene jata hai vo neeche horror genre watching old thrillers orphan sixth sense shawshank redemption life beautifull watch today tumbbad yesss tumbbad u watched already guess googled based clues gave horror normally preferred genre since horror movies rely jump scares scare bejesus ill take look thanks watched nobody yesterday loved like john wick watched citizen kane recently must say one best movies ever watched aamis ravening assamese movie one best indian films ive come across far lighthearted try jaane bhi yaaro oldie goldie watch downloaded torrent dont remember xd podcast cricket review talk ongoing series mostly test cricket interview cricket authors commentators cricketers hosted siddarth vaidyanathan cricket author fun interesting conversations listen episode prem panicker guest true one recent series waiting next episode read whole comic awesome magnificent sevennew one loved watch old one watch seven samurai love westerns samurai movies like home alone adult version photograph maybe kota factory really good people say okay rating quite bad hatt ke style comedy bahut hua sammaan actionromcom mard ko dard nahi hota rotten tomatoes run boring old boomers like westerns fun action flick greatest itll keep hooked rt quite ass aware infamously gave rating dave chappelles sticks stones special made laugh guts thing imdb rating movie also great okay ill watch like westerns dont maybe avoid chappelles awesome though rotten tomatoes bad id say like westerns especially loved hateful eight django buster scruggs also like old timey westerns like dollars trilogy thats fair absurdly high benchmark ratings generally watch movies imdb ratings dont trust imdb surprisingly high ratings shitty popular movies ratings indian movies absolutely unreliable correct indian movies part dont watch many indian movies anyway dont trust rotten tomatoes though priest malayalam movie prime thriller good one time watch shaitaan haveli amazon prime horror comedy inspired indian b grade horror movies sopranos lt havent watched yet watch nobody bob odenkirk amazing hope john wick share universe netflix lost bay great pirates platform thanks watched films watched wild bunch q storm documentary hbo great watch dont play much phone liked recently almost gone card thief tiny room hidden time house da vinci made list anyone interested horror thriller crime underrated movies amp shows imdbhttpswwwimdbcomlistls omg thank kind stranger",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "So I've been seeing this AMAZING Netflix series called Paava Kadhaigal. It tackles social issues like LGBTQ and women treatement in our society. I really recommend and urge you all to watch it. It's really thought provoking and the acting is on another level. It is south Indian but there is no over the top action scenes or anything😅 Sergei Bondarchuk's War and Peace adaptation. Ridiculous how they filmed something so grand in scale with no CGI. The Father. Watch this just for Anthony Hopkins. You won't regret it. Love and monsters is a good watch. Loved the premise and the characters. &gt;. It is south Indian but there is no over the top action scenes or anything😅 Tamil* We don't call Hindi films as North Indian do we? Loved 'Joji' Line of Duty on netflix , i really dunno how the hell did i miss this brilliant series all these years. also watch Amend again on netflix . The first story is mind blowing. Too real +1 cannot recommend Line of Duty more! Re watching it again with my wife hey guys. foreigner here. can you recommend me some good Hindi tv series? i am fascinated by India/south asia and i study Hindi these days. trying to improve and practice my language by watching indian tv/films. ones which i LOVED so far are: Yah Meri Family - heartwarming, realistic and very amusing middle class family story. Panchayat (2020) - really great and delicate. amazing actors and seems very realistic. Bandish Bandits - it was good, mostly thanks to the indian classical music parts, a tad too melodramatic for me at times. CAN YOU RECOMMEND ME ANYTHING ALONG THESE LINES? smart comedies or dark dramas are also welcomed. Dhanyavad Asuran - Touching story (Prime) 7/10 Run - Interesting thriller (Netflix) 7/10 Udaan ( Tamil) - Inspiring, touching but unrealistic (Prime) 6/10 Take my upvote, you madrasi :p I recently discovered the podcast \"Umeed\" by Zakir Khan. It's on Gaana. It has a unique take to some things in life which we often don't pay attention too. My B 😬😅 Made in heaven, Paatal lok, Panchayat.. Watch \"Gullak\" if you can find it where you are. 2 short seasons based on the life a typical lower middle class Indian nuclear family. Snippets of daily life which are eerily accurate and still has humour in it aplenty.  Paatal Lok is a must watch and falls squarely in the dark drama/ thriller category. Spaced 1st season was very good, 2nd was meh thanks ji, both sound really great. already watched and loved panchayat. hogaya. great! thank you. it sounds really good. Kindly suggest some thought provoking _hatt ke_ movies released in the last few years. I don't want to watch the typical 'girl boy love story' masala films. They are incredibly boring. Some movies I watched recently and liked: Pink, Pagglait, Thappad, Ludo, Lunchbox, Hindi Medium. Preference on comedy and/or light-heartedness. Any suggestions? How about TVF pitchers? 'Invincible' on Prime. Dark superhero - animated series. 8/10 bezati mat karwa bhai Any game recommendation for android? Masaan and Udaan Try r/AndroidGaming Scam1992? Kumbalangi Nights Watched **Grand army** on Netflix. So so much better than Euphoria, finished in one day. Watched an old musical called \"Begin Again\". It was nice. Its really nice the first time you watch it but its really bad on the second watch. Also didn't realize it's classified as old now haha Rang De Basanti. Worth rewatching Such a decent chutiya!! Not an easy documentary to watch but it's important to know that a world exists around us that we are not aware of and it's fucked up and right here in India. [Stolen Innocence on YouTube](https://youtu.be/eTtBnPxNpYs) It's a good one time watch. My bad! It was released in 2013 but somehow my mind had read it as 2006. +1 to gullak, amazing show and very underrated Just watched 'Mandy'. Trippy / hallucinatory visuals and pretty cool cinematography. One of the unique films I've seen in a while. I liked the movie as well. I liked how it was a non-romantic relationship btwn the characters and ofcourse the cheezy ending. I forgot the name, Someone reading the comment, please try to guess. One of the most fabulous movies of the decade. I will give a loose description-/ *movie ko 3 saal lage bnne mei, Khazana lene jata hai vo neeche. Horror genre* Have been watching some old thrillers- Orphan, The sixth sense, Shawshank Redemption and Life is beautifull. Will watch some more today. Tumbbad? Yesss. Tumbbad. U have watched it already I guess. No I googled it based on the clues you gave. Horror is normally not my preferred genre since most horror movies rely on jump scares which scare the bejesus out of me, but I'll take a look at this. Thanks :) Watched Nobody (2021) yesterday, loved it. It's like John Wick. watched citizen kane recently. I must say it's one of the best movies I have ever watched. Aamis (The Ravening) it's an Assamese movie, one of the best Indian films I've come across so far. Not light-hearted at all, for that you can try Jaane Bhi Do Yaaro oldie but goldie Where did you watch it? ~~Downloaded from torrent~~ I don't remember xD 81 all out - a podcast about cricket. They review and talk about ongoing series (mostly test cricket), interview cricket authors, commentators and cricketers too. Hosted by Siddarth Vaidyanathan, a cricket author. Has very fun and interesting conversations. Should listen to the episode where Prem Panicker was the guest. So true. One of the recent series that has me waiting for the next episode I read the whole comic . Awesome The Magnificent Seven(new one) Loved it Now I will watch the old one then I will watch Seven Samurai. I love westerns and samurai movies More like Home Alone : Adult Version :) Photograph Maybe? Kota Factory Is it really good? people say it is okay but the rating is quite bad... hatt ke style comedy: bahut hua sammaan action/romcom: mard ko dard nahi hota ROtten tomatoes is run by boring old boomers . If you like westerns its a fun action flick. Not the greatest of them. But it'll keep you hooked. RT is quite ass, I am aware. They infamously gave a 0% rating to Dave Chappelle's Sticks and stones, a special that made me laugh my guts out. thing is, imdb rating of the movie is also not that great. But okay I'll watch it If you like westerns that is. If you dont then maybe avoid it. Chappelles awesome though. 64% on rotten tomatoes is not bad, I’d say I like westerns. Especially loved the Hateful eight, django and buster scruggs. but I also like those old timey westerns like the dollars trilogy that's fair. I do have an absurdly high benchmark for ratings. I generally only watch movies with imdb ratings above 7 I don’t trust IMDb at all. They have surprisingly high ratings for some shitty but popular movies, and their ratings for Indian movies are absolutely unreliable. you are correct about indian movies part, but I don't watch many indian movies anyway. I don't trust rotten tomatoes at all though The Priest. It's a malayalam movie on prime. It's a thriller. Good one time watch. Shaitaan Haveli on Amazon Prime. It's a horror comedy inspired by Indian B grade horror movies in the 80's The Sopranos &lt;3 If you haven't watched it yet, watch Nobody. Bob odenkirk is just amazing and i hope he and john wick will share the universe. Netflix ? The lost bay of the great pirates. Which platform? Thanks Not watched those films 😅 Have you watched The Wild Bunch? \"Q: Into the Storm\" Documentary on HBO. Great watch! I don't play much on my phone, but here are some that I have liked recently: The Almost Gone Card Thief Tiny Room Hidden Through Time The House of Da Vinci I made this list if anyone interested in horror, thriller, crime [Underrated movies &amp; shows - IMDb](https://www.imdb.com/list/ls090509747/) I will now Omg, Thank you kind stranger ❤️"
}