{
    "id": "13te59n",
    "title": "Selected for RBI's cbdt pilot program with ICICI bank-is this a scam?",
    "url": "https://imgur.com/a/TJutBF0",
    "selftext": "Got a WhatsApp message from what looks like a legit business account of icici bank saying I've been \"selected\" for their digital currency pilot program. Is this a scam or legit? Has anyone else got such a message? What should I do?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1685210932.0,
    "convurl": "https://external-preview.redd.it/_q7FF08FZt9ld_AUZJjFucml-U4_6WGeR6rsJ-_mUf0.jpg?auto=webp&v=enabled&s=4c18c6f9b020f7671e6e95ad48eaf118bae13d5c",
    "comments": [
        "Not a scam",
        "Ok thanks",
        "Not a scam. I got the invite couple months ago and put in a few hundred rupees in digital currency. But not a single shopkeeper in my vicinity had digital rupee enabled. Couldn't even use it to pay via UPI. Transferred the money back to my account and uninstalled the app.",
        "Ok. Thanks. Ya then probably gonna give this a pass. Btw, have you ever used funds from your icici account to buy crypto?",
        "Nope.",
        "Ok cool"
    ],
    "cleaned_text": "selected rbis cbdt pilot program icici bankis scam got whatsapp message looks like legit business account icici bank saying ive selected digital currency pilot program scam legit anyone else got message ",
    "cleaned_title": "selected rbis cbdt pilot program icici bankis scam",
    "cleaned_selftext": "got whatsapp message looks like legit business account icici bank saying ive selected digital currency pilot program scam legit anyone else got message",
    "cleaned_comments": "scam ok thanks scam got invite couple months ago put hundred rupees digital currency single shopkeeper vicinity digital rupee enabled couldnt even use pay via upi transferred money back account uninstalled app ok thanks ya probably gon na give pass btw ever used funds icici account buy crypto nope ok cool",
    "light_cleaned_title": "Selected for RBI's cbdt pilot program with ICICI bank-is this a scam?",
    "light_cleaned_selftext": "Got a WhatsApp message from what looks like a legit business account of icici bank saying I've been \"selected\" for their digital currency pilot program. Is this a scam or legit? Has anyone else got such a message? What should I do?",
    "light_cleaned_comments": "Not a scam Ok thanks Not a scam. I got the invite couple months ago and put in a few hundred rupees in digital currency. But not a single shopkeeper in my vicinity had digital rupee enabled. Couldn't even use it to pay via UPI. Transferred the money back to my account and uninstalled the app. Ok. Thanks. Ya then probably gonna give this a pass. Btw, have you ever used funds from your icici account to buy crypto? Nope. Ok cool"
}