{
    "id": "1gvn4qb",
    "title": "Freshworks to cut 13% of global workforce amid strong Q3 earnings and AI demand",
    "url": "https://www.livemint.com/companies/news/freshworks-to-cut-13-of-global-workforce-amid-strong-q3-earnings-and-ai-demand-11730956208828.html",
    "selftext": "Freshworks",
    "flair": "Policy/Economy",
    "score": 299,
    "num_comments": 13,
    "created_utc": 1732101233.0,
    "convurl": "https://external-preview.redd.it/VvAN6O4z4JNSY91F5czQbJgzH7SOgD2CMF_h4qu-VK0.jpg?auto=webp&s=0a36b80ebff3dd372865691dff27838e97845b23",
    "comments": [
        ">  plans to lay off 13% of its workforce, affecting 660 employees, to streamline operations. The company reported strong Q3 earnings, raising its revenue expectations. Freshworks anticipates $11-$13 million in restructuring costs and aims for a successful fiscal year end by December 2024.\n\nThis company has more India based staff affected. \n\nMany companies are announcing layoff not sure what is in store for 2025 ",
        "The company beat earnings estimates and then decided to fire people",
        "They must have got the money for severance, so decided to cut off people.",
        "firing experienced emps to get cheap labour",
        "Similar pattern to all the big companies (Google as an example) that beat estimates but still laid off stuff.\nAt this point shareholder greed has no bounds. Anything to make the share price go up and increase their personal wealth.",
        "Like employees are working for free and not ready to jump ship the moment they get a better deal.\n\nOr see the company through when it's in tough times 😂\n\nEveryone's greedy af anyway.",
        "Employees don’t preach about how all employees are family…\n\nEmployees get a disproportionately small return on their effort invested …\n\nEmployees work overtime without being compensated …",
        "Thats the greed they talked about in the Bible",
        "Those people did their jobs. Built great products. Now they are out and time for management and shareholders to reap the benefits.",
        "A friend of my mine works there and told me they've been laying off people in mass since they got a new CEO earlier this year. They had their latest round of firings earlier this month.",
        "That's the conditioning of the companies though, if staff were treat properly \"like family\" rather than a number who must be 100% efficient paid the least possible and not allowed to be ill, then workers wouldn't be leaving so often.",
        "* Company makes losses -> Layoff people\n* Company makes great profits -> Layoff people",
        "Bastards destroying the world, billionaires must not exist",
        "Not surprised. \n\nAn org I know made $6Bn last quarter and is cutting close to 15% of staff globally",
        "This happened 2 weeks ago."
    ],
    "cleaned_text": "freshworks cut global workforce amid strong q earnings ai demand freshworks ",
    "cleaned_title": "freshworks cut global workforce amid strong q earnings ai demand",
    "cleaned_selftext": "freshworks",
    "cleaned_comments": "plans lay workforce affecting employees streamline operations company reported strong q earnings raising revenue expectations freshworks anticipates million restructuring costs aims successful fiscal year end december company india based staff affected many companies announcing layoff sure store company beat earnings estimates decided fire people must got money severance decided cut people firing experienced emps get cheap labour similar pattern big companies google example beat estimates still laid stuff point shareholder greed bounds anything make share price go increase personal wealth like employees working free ready jump ship moment get better deal see company tough times everyones greedy af anyway employees dont preach employees family employees get disproportionately small return effort invested employees work overtime without compensated thats greed talked bible people jobs built great products time management shareholders reap benefits friend mine works told theyve laying people mass since got new ceo earlier year latest round firings earlier month thats conditioning companies though staff treat properly like family rather number must efficient paid least possible allowed ill workers wouldnt leaving often company makes losses layoff people company makes great profits layoff people bastards destroying world billionaires must exist surprised org know made bn last quarter cutting close staff globally happened weeks ago",
    "light_cleaned_title": "Freshworks to cut 13% of global workforce amid strong Q3 earnings and AI demand",
    "light_cleaned_selftext": "Freshworks",
    "light_cleaned_comments": "> plans to lay off 13% of its workforce, affecting 660 employees, to streamline operations. The company reported strong Q3 earnings, raising its revenue expectations. Freshworks anticipates $11-$13 million in restructuring costs and aims for a successful fiscal year end by December 2024. This company has more India based staff affected. Many companies are announcing layoff not sure what is in store for 2025 The company beat earnings estimates and then decided to fire people They must have got the money for severance, so decided to cut off people. firing experienced emps to get cheap labour Similar pattern to all the big companies (Google as an example) that beat estimates but still laid off stuff. At this point shareholder greed has no bounds. Anything to make the share price go up and increase their personal wealth. Like employees are working for free and not ready to jump ship the moment they get a better deal. Or see the company through when it's in tough times 😂 Everyone's greedy af anyway. Employees don’t preach about how all employees are family… Employees get a disproportionately small return on their effort invested … Employees work overtime without being compensated … Thats the greed they talked about in the Bible Those people did their jobs. Built great products. Now they are out and time for management and shareholders to reap the benefits. A friend of my mine works there and told me they've been laying off people in mass since they got a new CEO earlier this year. They had their latest round of firings earlier this month. That's the conditioning of the companies though, if staff were treat properly \"like family\" rather than a number who must be 100% efficient paid the least possible and not allowed to be ill, then workers wouldn't be leaving so often. * Company makes losses -> Layoff people * Company makes great profits -> Layoff people Bastards destroying the world, billionaires must not exist Not surprised. An org I know made $6Bn last quarter and is cutting close to 15% of staff globally This happened 2 weeks ago."
}