{
    "id": "1ea7vl0",
    "title": "2020 Northeast Delhi riots: High court orders CBI probe into death of man ‘forced to sing national anthem’",
    "url": "https://indianexpress.com/article/cities/delhi/2020-northeast-riots-high-court-orders-cbi-probe-death-man-forced-sing-national-anthem-9470964/",
    "selftext": "Faizan was seen in a purported video lying injured as security personnel allegedly forced him to sing 'Vande Mataram' and the national anthem during the 2020 Northeast Delhi riots.",
    "flair": "Law & Courts",
    "score": 67,
    "num_comments": 5,
    "created_utc": 1721741370.0,
    "convurl": "https://external-preview.redd.it/w-e_jWAqSlq3qRaY91gglchcUO8hsHWN8R3fuIbfEYE.jpg?auto=webp&s=c690aa3c2e3655f842dea33617f51610f7b4a3f1",
    "comments": [
        "Umar Khalid is in jail for practically doing nothing but even some of the murderers are free.",
        "Hindutvavadi home minister Amit's hindutvavadi parrot, CBI, will \"probe\" into a hindutvavadi atrocity by Amit's hindutvavadi dog, Delhi police.",
        "Court should have ordered for judicial enquiry.",
        "All this is just eyewash. Nothing is gonna happen.",
        "Exactly. They feel it's 'safer' in CBI's hands as we all know how 'independent' CBI is."
    ],
    "cleaned_text": "northeast delhi riots high court orders cbi probe death man forced sing national anthem faizan seen purported video lying injured security personnel allegedly forced sing vande mataram national anthem northeast delhi riots ",
    "cleaned_title": "northeast delhi riots high court orders cbi probe death man forced sing national anthem",
    "cleaned_selftext": "faizan seen purported video lying injured security personnel allegedly forced sing vande mataram national anthem northeast delhi riots",
    "cleaned_comments": "umar khalid jail practically nothing even murderers free hindutvavadi home minister amits hindutvavadi parrot cbi probe hindutvavadi atrocity amits hindutvavadi dog delhi police court ordered judicial enquiry eyewash nothing gon na happen exactly feel safer cbis hands know independent cbi",
    "light_cleaned_title": "2020 Northeast Delhi riots: High court orders CBI probe into death of man ‘forced to sing national anthem’",
    "light_cleaned_selftext": "Faizan was seen in a purported video lying injured as security personnel allegedly forced him to sing 'Vande Mataram' and the national anthem during the 2020 Northeast Delhi riots.",
    "light_cleaned_comments": "Umar Khalid is in jail for practically doing nothing but even some of the murderers are free. Hindutvavadi home minister Amit's hindutvavadi parrot, CBI, will \"probe\" into a hindutvavadi atrocity by Amit's hindutvavadi dog, Delhi police. Court should have ordered for judicial enquiry. All this is just eyewash. Nothing is gonna happen. Exactly. They feel it's 'safer' in CBI's hands as we all know how 'independent' CBI is."
}