{
    "id": "163ibrp",
    "title": "Should teachers share their political opinions with students?",
    "url": "https://www.reddit.com/r/india/comments/163ibrp/should_teachers_share_their_political_opinions/",
    "selftext": " Hello r/india community,\n\nWe, the team at Frontline Magazine, recently published a story titled '**Should Teachers Share Their Political Opinions with Students?**'. Given the recent events surrounding Prof. Sabyasachi Das's resignation from Ashoka University and the dismissal of Karan Sangwan from UnAcademy, the debate on this topic has intensified. Author Apoorvanand, who teaches at DU, raises crucial questions regarding these incidents. His coverage of the situation involving Tejaswini Desai, Associate Professor of Physics at Kolhapur Institute of Technology, has become one of the most widely read and discussed articles in Frontline.\n\nWe believe this article is particularly relevant for sharing here. We invite you to share your thoughts and comments on the story. Your insights are valuable to us.\n\nHere is the link to the article: [Should teachers share their political opinions with students?](https://frontline.thehindu.com/the-nation/education/controversy-should-teachers-share-their-political-opinions-with-students-sabyasachi-das-ashoka-university-karan-sangwan-unacademy/article67223267.ece)\n\nWhy are we posting here, you might wonder? As the Frontline team, we are dedicated to bridging the gap between our journalism and various communities, with the aim of encouraging meaningful conversations and constructive debates. Your engagement is essential to achieving this goal. We will be posting one well-written story here every week. Thanks to Mods for the support.\n\nThanks,  \nFrontline Magazine Team",
    "flair": "Politics",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1693218184.0,
    "convurl": "https://external-preview.redd.it/D5LWB8IRjvuRVDas2cIjMcPNUL0Tl6_vMLg7EjU8rU0.jpg?auto=webp&s=5ea5201b2b9dd67227dbe6b33506f75429d02387",
    "comments": [],
    "cleaned_text": "teachers share political opinions students hello rindia community team frontline magazine recently published story titled teachers share political opinions students given recent events surrounding prof sabyasachi dass resignation ashoka university dismissal karan sangwan unacademy debate topic intensified author apoorvanand teaches du raises crucial questions regarding incidents coverage situation involving tejaswini desai associate professor physics kolhapur institute technology become one widely read discussed articles frontline believe article particularly relevant sharing invite share thoughts comments story insights valuable us link article teachers share political opinions studentshttpsfrontlinethehinducomthenationeducationcontroversyshouldteacherssharetheirpoliticalopinionswithstudentssabyasachidasashokauniversitykaransangwanunacademyarticleece posting might wonder frontline team dedicated bridging gap journalism various communities aim encouraging meaningful conversations constructive debates engagement essential achieving goal posting one wellwritten story every week thanks mods support thanks frontline magazine team ",
    "cleaned_title": "teachers share political opinions students",
    "cleaned_selftext": "hello rindia community team frontline magazine recently published story titled teachers share political opinions students given recent events surrounding prof sabyasachi dass resignation ashoka university dismissal karan sangwan unacademy debate topic intensified author apoorvanand teaches du raises crucial questions regarding incidents coverage situation involving tejaswini desai associate professor physics kolhapur institute technology become one widely read discussed articles frontline believe article particularly relevant sharing invite share thoughts comments story insights valuable us link article teachers share political opinions studentshttpsfrontlinethehinducomthenationeducationcontroversyshouldteacherssharetheirpoliticalopinionswithstudentssabyasachidasashokauniversitykaransangwanunacademyarticleece posting might wonder frontline team dedicated bridging gap journalism various communities aim encouraging meaningful conversations constructive debates engagement essential achieving goal posting one wellwritten story every week thanks mods support thanks frontline magazine team",
    "cleaned_comments": "",
    "light_cleaned_title": "Should teachers share their political opinions with students?",
    "light_cleaned_selftext": "Hello r/india community, We, the team at Frontline Magazine, recently published a story titled '**Should Teachers Share Their Political Opinions with Students?**'. Given the recent events surrounding Prof. Sabyasachi Das's resignation from Ashoka University and the dismissal of Karan Sangwan from UnAcademy, the debate on this topic has intensified. Author Apoorvanand, who teaches at DU, raises crucial questions regarding these incidents. His coverage of the situation involving Tejaswini Desai, Associate Professor of Physics at Kolhapur Institute of Technology, has become one of the most widely read and discussed articles in Frontline. We believe this article is particularly relevant for sharing here. We invite you to share your thoughts and comments on the story. Your insights are valuable to us. Here is the link to the article: [Should teachers share their political opinions with students?](https://frontline.thehindu.com/the-nation/education/controversy-should-teachers-share-their-political-opinions-with-students-sabyasachi-das-ashoka-university-karan-sangwan-unacademy/article67223267.ece) Why are we posting here, you might wonder? As the Frontline team, we are dedicated to bridging the gap between our journalism and various communities, with the aim of encouraging meaningful conversations and constructive debates. Your engagement is essential to achieving this goal. We will be posting one well-written story here every week. Thanks to Mods for the support. Thanks, Frontline Magazine Team",
    "light_cleaned_comments": ""
}