{
    "id": "1g4w4g6",
    "title": "Never buy from Jodi Life ",
    "url": "https://www.reddit.com/gallery/1g4w4g6",
    "selftext": "\nHello everyone, I bought a suit and saree from Jodi life, posting here for your reference what is advertised and what I recieved.\n\nThe suit costed me INR 19,000 without dupatta, not worth a single penny. Has spots all over and the silk has no return policy, when I asked them why were the spots not there in photoshoot they ghosted me !\n\nReal color is very far from photoshoot, they sent a screenshot saying we have declared colors seem different on screen, what about the spots please ?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1729074365.0,
    "convurl": "https://i.redd.it/656t2hqsh3vd1.jpg",
    "comments": [
        "I mean don’t get me wrong, but why would u buy clothes esp indian attire for ₹19k ONLINE??😅\n If I m spending so much on clothes, then I have to feel and try them before buying!",
        "I just trusted them, they are famous, a lot of advertising, a lot of celebrities wearing their brand and I personally liked it"
    ],
    "cleaned_text": "never buy jodi life hello everyone bought suit saree jodi life posting reference advertised recieved suit costed inr without dupatta worth single penny spots silk return policy asked spots photoshoot ghosted real color far photoshoot sent screenshot saying declared colors seem different screen spots please ",
    "cleaned_title": "never buy jodi life",
    "cleaned_selftext": "hello everyone bought suit saree jodi life posting reference advertised recieved suit costed inr without dupatta worth single penny spots silk return policy asked spots photoshoot ghosted real color far photoshoot sent screenshot saying declared colors seem different screen spots please",
    "cleaned_comments": "mean dont get wrong would u buy clothes esp indian attire k online spending much clothes feel try buying trusted famous lot advertising lot celebrities wearing brand personally liked",
    "light_cleaned_title": "Never buy from Jodi Life",
    "light_cleaned_selftext": "Hello everyone, I bought a suit and saree from Jodi life, posting here for your reference what is advertised and what I recieved. The suit costed me INR 19,000 without dupatta, not worth a single penny. Has spots all over and the silk has no return policy, when I asked them why were the spots not there in photoshoot they ghosted me ! Real color is very far from photoshoot, they sent a screenshot saying we have declared colors seem different on screen, what about the spots please ?",
    "light_cleaned_comments": "I mean don’t get me wrong, but why would u buy clothes esp indian attire for ₹19k ONLINE??😅 If I m spending so much on clothes, then I have to feel and try them before buying! I just trusted them, they are famous, a lot of advertising, a lot of celebrities wearing their brand and I personally liked it"
}