{
    "id": "17rcgc7",
    "title": "Peeche pad gaye hain besharam.",
    "url": "https://www.reddit.com/gallery/17rcgc7",
    "selftext": "Roti kya kya nahi karwati.",
    "flair": "Crime",
    "score": 9,
    "num_comments": 14,
    "created_utc": 1699534961.0,
    "convurl": "https://i.redd.it/earpeivzlbzb1.jpg",
    "comments": [
        "i am not kidding you, i got more or less the same message on telegram from \"hr rukmini\" just yesterday hahahahaha. i wish i had taken screenshots before reporting and deleting the chat!",
        "there is no point in arguing with them. Just block or have some fun.",
        "+254\nAuto block",
        "Just block looks like a scam to me",
        "Take the bait, they will really pay you 250rs \n\nKeep continuing till they demand money or stop paying you \n\nDon’t let the greed overtook you and you scammed the scamster\n\nHonestly they play a number game. Even if you scam them petty amount, they gonna jump to next target",
        "i said it before and i will say it again....ask for nudes",
        "Take help from Google translation and start talking in a different language.",
        "Give 5 star send screenshot... \nAfter receiving money make that 1 star...\nBusinesses who do this type of scam should get 1 star...\nFree 150",
        "I got the same message too"
    ],
    "cleaned_text": "peeche pad gaye hain besharam roti kya kya nahi karwati ",
    "cleaned_title": "peeche pad gaye hain besharam",
    "cleaned_selftext": "roti kya kya nahi karwati",
    "cleaned_comments": "kidding got less message telegram hr rukmini yesterday hahahahaha wish taken screenshots reporting deleting chat point arguing block fun auto block block looks like scam take bait really pay rs keep continuing till demand money stop paying dont let greed overtook scammed scamster honestly play number game even scam petty amount gon na jump next target said say againask nudes take help google translation start talking different language give star send screenshot receiving money make star businesses type scam get star free got message",
    "light_cleaned_title": "Peeche pad gaye hain besharam.",
    "light_cleaned_selftext": "Roti kya kya nahi karwati.",
    "light_cleaned_comments": "i am not kidding you, i got more or less the same message on telegram from \"hr rukmini\" just yesterday hahahahaha. i wish i had taken screenshots before reporting and deleting the chat! there is no point in arguing with them. Just block or have some fun. +254 Auto block Just block looks like a scam to me Take the bait, they will really pay you 250rs Keep continuing till they demand money or stop paying you Don’t let the greed overtook you and you scammed the scamster Honestly they play a number game. Even if you scam them petty amount, they gonna jump to next target i said it before and i will say it again....ask for nudes Take help from Google translation and start talking in a different language. Give 5 star send screenshot... After receiving money make that 1 star... Businesses who do this type of scam should get 1 star... Free 150 I got the same message too"
}