{
    "id": "15ozqnt",
    "title": "Multiple hours of power cuts in a capital metro city in 2023, how is this still a thing ?",
    "url": "https://www.reddit.com/r/india/comments/15ozqnt/multiple_hours_of_power_cuts_in_a_capital_metro/",
    "selftext": ">Bengaluru to see 4-hour power outages in many areas today, tomorrow;  \n>  \n>Karnataka capital Bengaluru's power supply companies have scheduled some more power cuts for the weekend, i.e., on Saturday and Sunday amid carrying out several projects. According to data shared by the Bangalore Electricity Supply Company (BESCOM), these works include Jalasiri 24x7 water supply work, road widening, underground drainage plant electrification and quarterly maintenance work.\n\nYou know what ? People who haven't lived in Bangalore won't believe that India's tech capital and one of the biggest metro cities even has this problem. It's so ludicrous.\n\n[https://www.hindustantimes.com/cities/bengaluru-news/bengaluru-to-see-4-hour-power-outages-in-many-areas-today-tomorrow-check-our-full-area-list-101691812641352.html](https://www.hindustantimes.com/cities/bengaluru-news/bengaluru-to-see-4-hour-power-outages-in-many-areas-today-tomorrow-check-our-full-area-list-101691812641352.html)",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691831492.0,
    "convurl": "https://external-preview.redd.it/0L08bdFsl91nZao8mR2-DBfBkRMTB7qnt6nf2BmrH0I.jpg?auto=webp&s=af54d4c92cfee48ca8f26b6333620768dfd88528",
    "comments": [],
    "cleaned_text": "multiple hours power cuts capital metro city still thing bengaluru see hour power outages many areas today tomorrow karnataka capital bengalurus power supply companies scheduled power cuts weekend ie saturday sunday amid carrying several projects according data shared bangalore electricity supply company bescom works include jalasiri x water supply work road widening underground drainage plant electrification quarterly maintenance work know people havent lived bangalore wont believe indias tech capital one biggest metro cities even problem ludicrous httpswwwhindustantimescomcitiesbengalurunewsbengalurutoseehourpoweroutagesinmanyareastodaytomorrowcheckourfullarealisthtmlhttpswwwhindustantimescomcitiesbengalurunewsbengalurutoseehourpoweroutagesinmanyareastodaytomorrowcheckourfullarealisthtml ",
    "cleaned_title": "multiple hours power cuts capital metro city still thing",
    "cleaned_selftext": "bengaluru see hour power outages many areas today tomorrow karnataka capital bengalurus power supply companies scheduled power cuts weekend ie saturday sunday amid carrying several projects according data shared bangalore electricity supply company bescom works include jalasiri x water supply work road widening underground drainage plant electrification quarterly maintenance work know people havent lived bangalore wont believe indias tech capital one biggest metro cities even problem ludicrous httpswwwhindustantimescomcitiesbengalurunewsbengalurutoseehourpoweroutagesinmanyareastodaytomorrowcheckourfullarealisthtmlhttpswwwhindustantimescomcitiesbengalurunewsbengalurutoseehourpoweroutagesinmanyareastodaytomorrowcheckourfullarealisthtml",
    "cleaned_comments": "",
    "light_cleaned_title": "Multiple hours of power cuts in a capital metro city in 2023, how is this still a thing ?",
    "light_cleaned_selftext": ">Bengaluru to see 4-hour power outages in many areas today, tomorrow; > >Karnataka capital Bengaluru's power supply companies have scheduled some more power cuts for the weekend, i.e., on Saturday and Sunday amid carrying out several projects. According to data shared by the Bangalore Electricity Supply Company (BESCOM), these works include Jalasiri 24x7 water supply work, road widening, underground drainage plant electrification and quarterly maintenance work. You know what ? People who haven't lived in Bangalore won't believe that India's tech capital and one of the biggest metro cities even has this problem. It's so ludicrous. [https://www.hindustantimes.com/cities/bengaluru-news/bengaluru-to-see-4-hour-power-outages-in-many-areas-today-tomorrow-check-our-full-area-list-101691812641352.html](https://www.hindustantimes.com/cities/bengaluru-news/bengaluru-to-see-4-hour-power-outages-in-many-areas-today-tomorrow-check-our-full-area-list-101691812641352.html)",
    "light_cleaned_comments": ""
}