{
    "id": "jhq7ul",
    "title": "The economic gap between India and China has been growing, and yes, it has not even been shrinking once.",
    "url": "https://www.reddit.com/r/india/comments/jhq7ul/the_economic_gap_between_india_and_china_has_been/",
    "selftext": "Hello everyone, this is the first time I post on this sub,  my English is not very good sry. We’ve always heard that India is fifth in GDP, and will be third in the next few years, and we will be the fastest growing economy.Maybe some years later,we will be real superpower but not just a meme.\n\nAs we all know, the last year and the years to come will be a very difficult time for India.  The economy, according to report by the IMF ,  Bangladesh will surpass India in GDP per capita. \n\nI know, some would say, it’s caused by covid-19 virus, China and the international situation. And when that’s over, we’ll be on the right path again.\n\nI did a calculation of whether we are close or not to China’s GDP in a country of same 1.3 billion plus people. Not gonna to use absolute numbers, because it’s not fair to compare an smaller one to a large, so let’s use the ratio of Indian GDP to Chinese.\n\nMy data comes from wikipedia and the IMF’s official website, where 2020 -- 2025 is the number in the IMF’s latest October report.  Time will start in 1990 because of the economic reforms we have undertaken.\n\n[here it is.](https://preview.redd.it/4656p51ab7v51.png?width=2681&amp;format=png&amp;auto=webp&amp;s=b3d7e9d1662bfe12e4f42d7eef0f875675f7b81d)\n\nwoh\n\n[more clear](https://preview.redd.it/x1ko2sxbc7v51.png?width=1809&amp;format=png&amp;auto=webp&amp;s=15471bf83f8eb1fcdc77b4935d61e4dfeb4e838c)\n\nTbh, I was surprised. I knew that China’s GDP is very high, so their “absolute increment” must be bigger than ours, but I didn’t expect the ratio to keep falling. Put another way:  The relative value of India’s economy to China’s has been falling , and yes, the last time we tried to reverse was in 2019, we got it back above 20 percent, but that will stay at 17 percent for the long term as the economic winter approaches. \n\nEveryone is thinking about “how to replicate China’s economic miracle, ” but China’s economy didn’t initially outpace America’s at once,but the ratio of \"Chinese gdp/USA gdp\" kept growing until one day, China’s absolute growth spiked America’s. And we India can’t even do that, which means we have a smaller base and a slower growth rate, so how do we surpass a giant like China? \n\nPlease understand my broken English. How should India develop? What should be our immediate and long-term goals?  I was so lost.",
    "flair": "Policy/Economy",
    "score": 42,
    "num_comments": 3,
    "created_utc": 1603615474,
    "convurl": "https://b.thumbs.redditmedia.com/j55udYDoe5zQ0l5Nzm792_swWEv8FMjUMjXcmMkG8Yo.jpg",
    "comments": [
        "Don't worry. \n\nRW had suggested to develop own development model. In this model we will be the most developed nation in world.",
        "Good comparison. But do the ratio other ways, helps compare directly that how much times more China is to our size and it nearly adds Indian GDP every five years? Also, include US in your analysis please.\n\nVery interesting work.",
        "If you are serious, here are my suggestion. Learn from the Chinese race and particular, their post Mao leaders such as Deng Xiaoping and Lee Kuan Yew of Singapore. Find out how they did it. \n\nChina took inspiration from LKY's Singapore. Find out about what did LKY did right that inspired Deng to do implement his policies in China. Find out what did Jiang Zhemin did, what did Zhu Rongji did and what di Hu Jintao did. Then find out what kind of leader Xi Jingping is.\n\nChina has always been a nation and a society that is ruled from the top. Its policies are dictated by the central government. Study its leaders and the leader's policies."
    ],
    "cleaned_text": "economic gap india china growing yes even shrinking hello everyone first time post sub english good sry weve always heard india fifth gdp third next years fastest growing economymaybe years laterwe real superpower meme know last year years come difficult time india economy according report imf bangladesh surpass india gdp per capita know would say caused covid virus china international situation thats well right path calculation whether close chinas gdp country billion plus people gon na use absolute numbers fair compare smaller one large lets use ratio indian gdp chinese data comes wikipedia imfs official website number imfs latest october report time start economic reforms undertaken ishttpspreviewredditpabvpngwidthampformatpngampautowebpampsbdedbfeefdeefffbd woh clearhttpspreviewredditxkosxbcvpngwidthampformatpngampautowebpampsbffebfcdcbdedfebec tbh surprised knew chinas gdp high absolute increment must bigger didnt expect ratio keep falling put another way relative value indias economy chinas falling yes last time tried reverse got back percent stay percent long term economic winter approaches everyone thinking replicate chinas economic miracle chinas economy didnt initially outpace americas oncebut ratio chinese gdpusa gdp kept growing one day chinas absolute growth spiked americas india cant even means smaller base slower growth rate surpass giant like china please understand broken english india develop immediate longterm goals lost ",
    "cleaned_title": "economic gap india china growing yes even shrinking",
    "cleaned_selftext": "hello everyone first time post sub english good sry weve always heard india fifth gdp third next years fastest growing economymaybe years laterwe real superpower meme know last year years come difficult time india economy according report imf bangladesh surpass india gdp per capita know would say caused covid virus china international situation thats well right path calculation whether close chinas gdp country billion plus people gon na use absolute numbers fair compare smaller one large lets use ratio indian gdp chinese data comes wikipedia imfs official website number imfs latest october report time start economic reforms undertaken ishttpspreviewredditpabvpngwidthampformatpngampautowebpampsbdedbfeefdeefffbd woh clearhttpspreviewredditxkosxbcvpngwidthampformatpngampautowebpampsbffebfcdcbdedfebec tbh surprised knew chinas gdp high absolute increment must bigger didnt expect ratio keep falling put another way relative value indias economy chinas falling yes last time tried reverse got back percent stay percent long term economic winter approaches everyone thinking replicate chinas economic miracle chinas economy didnt initially outpace americas oncebut ratio chinese gdpusa gdp kept growing one day chinas absolute growth spiked americas india cant even means smaller base slower growth rate surpass giant like china please understand broken english india develop immediate longterm goals lost",
    "cleaned_comments": "dont worry rw suggested develop development model model developed nation world good comparison ratio ways helps compare directly much times china size nearly adds indian gdp every five years also include us analysis please interesting work serious suggestion learn chinese race particular post mao leaders deng xiaoping lee kuan yew singapore find china took inspiration lkys singapore find lky right inspired deng implement policies china find jiang zhemin zhu rongji di hu jintao find kind leader xi jingping china always nation society ruled top policies dictated central government study leaders leaders policies",
    "light_cleaned_title": "The economic gap between India and China has been growing, and yes, it has not even been shrinking once.",
    "light_cleaned_selftext": "Hello everyone, this is the first time I post on this sub, my English is not very good sry. We’ve always heard that India is fifth in GDP, and will be third in the next few years, and we will be the fastest growing economy.Maybe some years later,we will be real superpower but not just a meme. As we all know, the last year and the years to come will be a very difficult time for India. The economy, according to report by the IMF , Bangladesh will surpass India in GDP per capita. I know, some would say, it’s caused by covid-19 virus, China and the international situation. And when that’s over, we’ll be on the right path again. I did a calculation of whether we are close or not to China’s GDP in a country of same 1.3 billion plus people. Not gonna to use absolute numbers, because it’s not fair to compare an smaller one to a large, so let’s use the ratio of Indian GDP to Chinese. My data comes from wikipedia and the IMF’s official website, where 2020 -- 2025 is the number in the IMF’s latest October report. Time will start in 1990 because of the economic reforms we have undertaken. [here it is.](https://preview.redd.it/4656p51ab7v51.png?width=2681&amp;format=png&amp;auto=webp&amp;s=b3d7e9d1662bfe12e4f42d7eef0f875675f7b81d) woh [more clear](https://preview.redd.it/x1ko2sxbc7v51.png?width=1809&amp;format=png&amp;auto=webp&amp;s=15471bf83f8eb1fcdc77b4935d61e4dfeb4e838c) Tbh, I was surprised. I knew that China’s GDP is very high, so their “absolute increment” must be bigger than ours, but I didn’t expect the ratio to keep falling. Put another way: The relative value of India’s economy to China’s has been falling , and yes, the last time we tried to reverse was in 2019, we got it back above 20 percent, but that will stay at 17 percent for the long term as the economic winter approaches. Everyone is thinking about “how to replicate China’s economic miracle, ” but China’s economy didn’t initially outpace America’s at once,but the ratio of \"Chinese gdp/USA gdp\" kept growing until one day, China’s absolute growth spiked America’s. And we India can’t even do that, which means we have a smaller base and a slower growth rate, so how do we surpass a giant like China? Please understand my broken English. How should India develop? What should be our immediate and long-term goals? I was so lost.",
    "light_cleaned_comments": "Don't worry. RW had suggested to develop own development model. In this model we will be the most developed nation in world. Good comparison. But do the ratio other ways, helps compare directly that how much times more China is to our size and it nearly adds Indian GDP every five years? Also, include US in your analysis please. Very interesting work. If you are serious, here are my suggestion. Learn from the Chinese race and particular, their post Mao leaders such as Deng Xiaoping and Lee Kuan Yew of Singapore. Find out how they did it. China took inspiration from LKY's Singapore. Find out about what did LKY did right that inspired Deng to do implement his policies in China. Find out what did Jiang Zhemin did, what did Zhu Rongji did and what di Hu Jintao did. Then find out what kind of leader Xi Jingping is. China has always been a nation and a society that is ruled from the top. Its policies are dictated by the central government. Study its leaders and the leader's policies."
}