{
    "id": "18g0hw2",
    "title": "China's infrastructure is truly incredible!",
    "url": "https://www.reddit.com/r/india/comments/18g0hw2/chinas_infrastructure_is_truly_incredible/",
    "selftext": "After reading through a post today about an Indian's experience in China and their infrastructure, which I already aware of somewhat, I got curious and started researching and came across this channel on youtube.\n\n[(31) The World WON'T Believe China's New Infrastructure (America Jealous) - YouTube](https://www.youtube.com/watch?v=7bHpaAOpQcg)\n\nI am absolutely astonished at how good they have it in China - the cities are remarkably clean and efficient and pollution free (clear blue sky and no noise), the top 9 Metro systems are in China and the infrastructure is truly phenomenal, their stations are better than most international airports and the tech is truly inspiring, the longest high speed rail network is in China including the trains which have the highest average speed in the world - a truly astonishing 292 kmph! They have the most amazing bridges, the largest dam by far, so big infact that it effects the rotation of the earth, the longest highway network in the world and so on and so forth.\n\nMind you the guy in the channel is comparing Chinese infrastructure to the best in USA and Europe to come to his conclusions and we cant even match SEA countries. It feels like we are atleast a century behind and we wont ever catch up. It is so humbling and at the same time so inspiring to see what a country can do in such a short span of time if they have the will. Would we ever reach this level of finesse? I highly doubt it but I can take the solace in the fact that if we ever worked as well as China does we can too. If there is any country which can break US's hegemony on the world, its China and I dont think US can do anything.  \n\n\nP.S. It is also refreshing to see that the videos are not laced with \"Proud Chinese\" or \"China Mata Ki Jai\" comments under them. Very few comments from Chinese but even when they are, they are mostly appreciative rather than \"superiority\". ",
    "flair": "Rant / Vent",
    "score": 34,
    "num_comments": 37,
    "created_utc": 1702319719.0,
    "convurl": "https://external-preview.redd.it/ZO4SF0QbCe2dHqOPQfK3TChgC9FznWPQNQ7dDD4mz_U.jpg?auto=webp&s=7f71bc2ba421963d07108a3813c3209dba210236",
    "comments": [
        "In its hayday, chinese real estate sector was 35% of its GDP. Even with recent troubles (evergrande crisis etc.), it's still \\~28%. For comparison, India's real estate sector is 6% of its GDP.",
        "China number 1 ?",
        "Of the eastern hemisphere, yes.",
        "For all the shortcoming of the current Chinese system/economy , there is no denying the fact about the amazing Progress made by the Chinese. It will take us decades to reach where China is today.",
        "6% officially. All of us know that most of black money from politicians and bureaucrats in actually invested in real estate. There is a reason why our housing is so poorly built and so expensive at the same time.",
        "if evergrande wouldve happened in any other country the bubble wouldve burst but the control on information gives the real estate sector leeway to do bs. \n\nEven for the US its around 12%...China made up a facade for people to keep investing in protected by its censorship. Generally only high per capita income countries have such a large share in Real estate.",
        "Given they have the largest network of highways and an astonishing spread of high speed rail, I'd reckon they are the best in the world. The stats for high speed rail are especially astonishing - Japan is the number two when it comes high speed rail and they have a total track length of 3000 odd kms, China is at 41000 kms already and will be closer to 80000 kms by 2035!\n\n [Length of the highspeed rail network worldwide 2022, by country | Statista](https://www.statista.com/statistics/1265995/length-of-highspeed-railway-lines-in-use-worldwide-by-country/)",
        "https://preview.redd.it/meawsbtbft5c1.jpeg?width=740&format=pjpg&auto=webp&s=6f1a3de55718e7e639b910af5256e4074cafb7a9",
        "CCP posting propaganda on r/india now",
        "And what would this propaganda do hutiye? That we ask our government to replicate what chinese have done? Whats wrong with that?",
        "debts, lots of it",
        "so...Indian RE is good inverstment ?",
        "yeah sanghis are slacking off....busy making baby indians i guess",
        "Based on all the indices, India is 11-18 years behind where China is today. Does that mean India will look like this 18 years from now? Definitely not. \n\nWhile you can blame the governance apathy, people's lack of civic sense, etc., one of the biggest hurdles (in a good and a bad way) is democracy. \n\nI live in Dubai which is a kingdom. The government has steadfastly improved infrastructure, and has been investing in everything that will make Dubai compete with the best across different sectors. \n\nThe con with a kingdom is that it depends on the King/Queen. A Tughlaqian ruler may have taken the country in the opposite direction, again with very little resistance.\n\nChina with its autocratic governance too is.\n\nWith a democracy, you sort of stay in the middle and are able to move on steadily. But the problem is there is too much resistance to anything. Dubai was able to carve out an entire island off the sea. Disregarding the pluses and minuses of it, a similar project in India will never take off because of opposition from environmentalists. Even constructing a road off the sea coast in Mumbai has faced so much hurdle, despite the fact that the alternative is for millions in congested traffic pumping out harmful gases out of their vehicles  every single day. \n\nThere is no point in wishing we were autocratic, or a better democracy. It is what it is, and we learn to live with what we have.",
        "And India is debt free? For all the debt we have, what have we got to show for it apart from one individual becoming the richest man in the world?",
        "Indices do not tell you the whole story or infact any story beyond meaningless numbers. While our per capita GDP may just be 3 times smaller our population is much poorer because the divide between the rich and poor is huge. This is also explains the difference between consumption numbers. For e.g. Mercedes sells more than half a million cars in China every year and they sell an average of 17000 (yes thousand) in India in a year. Basically Chinese buy more mercedes in a month than we in India do in 5 years!  Also the fact that 800 million people in India need government to provide food grains for their daily sustenance.",
        "What about this is propaganda?",
        "You are saying that as if China is so communist, everyone makes the same wages in the country. They have their own wage gap between the rich and the poor. \n\nAnd what Mercedes sells is immaterial. How many Mahindras do they buy? Brands have different positioning, pricing, popularity and market share in every geography. It's meaningless. \n\nAlso the fact that the new Chinese cities may be car-centric forcing people to spend money on cars while Indian cities, even the most modern areas, are still motorable by cycles and bikes. \n\nIndices do not tell the whole story, but they tell you a good enough indication of the trajectory",
        "I don’t know, India has lots of debts too ? For doing what ?",
        "This. This chalta hai attitude and accepting the fate is what that has made today's India a shithole that has become. We elect most corrupt, criminals as our leaders to lead us and then sit out and complain why we aren't making progress .",
        "You realize every country is a shithole in some form or the other once you live there long enough.",
        "I was in China for a while and now that I live in NA, people often talk about how cool some of the skyscrapers are and the skyline is incredible but it's pretty insignificant in comparison to Shanghai",
        "*\" And what Mercedes sells is immaterial. How many Mahindras do they buy? Brands have different positioning, pricing, popularity and market share in every geography. It's meaningless.\"*  \nWhy is it immaterial? A car is an aspirational purchase in India and luxury brands even more so. They signal to the world that you have arrived. We are similar sized population wise. Chinese economy is 6 times bigger than Indian economy so our consumption pattern should be relatively similar, assuming all else is equal meaning we should be buying atleast 1/6th of what Chinese consumers are buying. But we are not. We are 1/6th of the 1/6th. I should not even have to write so much - just go out on the street even in a major city and see the poverty all around. Rural India is even worse off.",
        "India has higher debt to gdp percentage than China by the way",
        "You are contradicting yourself. \n\nIf Mercedes is such a luxury brand, and China has so many of them (meaning there are so many rich people who can afford it), then it only means that there are a good number of poor people to weigh the averages down, don't you think? \n\nAnd yet, you say wealth-poor gap in India is causing GDP per capita to be skewed. \n\nIndians and Chinese are two different demographics. What appeals to them is not the same as what appeals to us, simply because there are a multiple of factors at play here. \n\nIn India. people have a lot of trust in local manufacturers (not because of the brand appeal, but because we know a Maruti and Mahindra spare part can be so easily obtained compared to foreign parts). So a lot of even the ultra-wealthy black money hoarders will go for a Tata or Maruti than foreign brands (which too have begun to pick up by the way). \n\nGo out on the streets and see is not an answer. As I mentioned in my opening post, India is a democracy - we can afford to not hide our poverty, unlike China where everything is embellished to look better. \n\nAgain, my point is not that India is as good as China. If you think that is my point, reread to get what I mean.",
        "Democracy can't have growth like china.\n\nToo much freedom gives too much obstacles for progress",
        "It's been dragged to around 19% now from mid-20%s in late 2010s. They intentionally deflated this, which spooked the usual Gordan Chang-esque Western commentators that China or it's Economy is Collapsing, when the reality was it was/IS being done intentionally.",
        "Benevolent Emperor vs Bad Emperor Problem. Quite well-known historical and philosophical but also a Real-world problem/challenge/question.\n\nA monarchy though has higher odds of going bad since parent-child need not always be similarly competent and secondly and critically IF one gets a Bad Emperor in such a System it lasts longer because mechanism to remove such leaders is harder (they're actually rulers for Life not just figuratively/rhetorically).\n\nHowever if the System itself is tuned in a way that mandates Term-Age Limits then a massive obstacle to that philosophical question gets removed since EVEN IF a bad emperor comes they can not stay beyond a certain time frame.\n\nAnd lastly, such Systems (usually Monarchy but its within that spectrum) have been norm throughout human history for a reason. It's so because Even When they mess up with bad leaders/policies or what not, because the System is not Hyper-Stable (like Democractic System is) it means it can easily break up and be formed again under new Leadership.\n\nWhat this does is, create more number of cycles (good & bad) but because the Good Cycles has higher upper ceilings, it recovers quickly. More quickly than what a Democractic System with it's stagnant growth can achieve. So in X long number of years, the former system either is at same place as Democracy or much higher level.\n\nSystems Debate has become taboo in West and that has percolated into Western narrative dominated societies like India as well. Fukuyama virus in action.\n\nHistory as matter of fact is NOT Dead or Over. China proved it.\n\nHumans have NOT exhausted their experimentation with Governance Systems. Only human collectives that have the balls to dare make it. This is a known constant that human history itself is witness to.",
        "So he is cherry-picking a bit in the video. New York infrastructure is probably mediocre in America.  For context, I live in LA california, and it's not that bad. The issue is that there's is almost no real public infrastructure in the states. It's a car driven infrastructure. And we probably won't be able to pivot out of it without radical changes. TLDR : our infrastructure is rapidly aging, so it's only going to get worse over time. Because every project here is 3x over budget 2x longer time frame. The issue is that the U.S spends way too much on the military and the broken health care system. Which only benefits the top 1% of elite Americans. My personal gripe is that public service is in decline because  everything is being commoditized for profit. California spent over a hundred billion for a high-speed rail line from SD to sf. And we barely got anything to show for it. I'm certain that in the coming decades, it'll still be entirely plane and car focused.",
        "\\>While our per capita GDP may just be 3 times smaller our population is much poorer because the divide between the rich and poor is huge\n\nChina has higher income inequality than India (Check the gini coefficient).",
        "Where did you even get your data? This source says China has 83% while India has 81.9%\n\nSource: https://www.thehindu.com/business/Economy/india-has-high-debt-like-china-but-risks-are-moderated-imf/article67407321.ece",
        "wtf is the debt spent on ?",
        "https://www.statista.com/chart/amp/6908/the-worlds-most-unequal-countries/ \nThis is based on available data. You also have to factor in black money and the fact that India is one of the most corrupt countries in the world.",
        "Using GINI coefficient is way better way of assessing income inequality than this data",
        "You should really get better sources. China's infrastructure ranks quite low and the stuff you're watching is propaganda from the CCP. Not accurate at all to the reality."
    ],
    "cleaned_text": "chinas infrastructure truly incredible reading post today indians experience china infrastructure already aware somewhat got curious started researching came across channel youtube world wont believe chinas new infrastructure america jealous youtubehttpswwwyoutubecomwatchvbhpaaopqcg absolutely astonished good china cities remarkably clean efficient pollution free clear blue sky noise top metro systems china infrastructure truly phenomenal stations better international airports tech truly inspiring longest high speed rail network china including trains highest average speed world truly astonishing kmph amazing bridges largest dam far big infact effects rotation earth longest highway network world forth mind guy channel comparing chinese infrastructure best usa europe come conclusions cant even match sea countries feels like atleast century behind wont ever catch humbling time inspiring see country short span time would ever reach level finesse highly doubt take solace fact ever worked well china country break uss hegemony world china dont think us anything ps also refreshing see videos laced proud chinese china mata ki jai comments comments chinese even mostly appreciative rather superiority ",
    "cleaned_title": "chinas infrastructure truly incredible",
    "cleaned_selftext": "reading post today indians experience china infrastructure already aware somewhat got curious started researching came across channel youtube world wont believe chinas new infrastructure america jealous youtubehttpswwwyoutubecomwatchvbhpaaopqcg absolutely astonished good china cities remarkably clean efficient pollution free clear blue sky noise top metro systems china infrastructure truly phenomenal stations better international airports tech truly inspiring longest high speed rail network china including trains highest average speed world truly astonishing kmph amazing bridges largest dam far big infact effects rotation earth longest highway network world forth mind guy channel comparing chinese infrastructure best usa europe come conclusions cant even match sea countries feels like atleast century behind wont ever catch humbling time inspiring see country short span time would ever reach level finesse highly doubt take solace fact ever worked well china country break uss hegemony world china dont think us anything ps also refreshing see videos laced proud chinese china mata ki jai comments comments chinese even mostly appreciative rather superiority",
    "cleaned_comments": "hayday chinese real estate sector gdp even recent troubles evergrande crisis etc still comparison indias real estate sector gdp china number eastern hemisphere yes shortcoming current chinese systemeconomy denying fact amazing progress made chinese take us decades reach china today officially us know black money politicians bureaucrats actually invested real estate reason housing poorly built expensive time evergrande wouldve happened country bubble wouldve burst control information gives real estate sector leeway bs even us around china made facade people keep investing protected censorship generally high per capita income countries large share real estate given largest network highways astonishing spread high speed rail id reckon best world stats high speed rail especially astonishing japan number two comes high speed rail total track length odd kms china kms already closer kms length highspeed rail network worldwide country statistahttpswwwstatistacomstatisticslengthofhighspeedrailwaylinesinuseworldwidebycountry ccp posting propaganda rindia would propaganda hutiye ask government replicate chinese done whats wrong debts lots soindian good inverstment yeah sanghis slacking offbusy making baby indians guess based indices india years behind china today mean india look like years definitely blame governance apathy peoples lack civic sense etc one biggest hurdles good bad way democracy live dubai kingdom government steadfastly improved infrastructure investing everything make dubai compete best across different sectors con kingdom depends kingqueen tughlaqian ruler may taken country opposite direction little resistance china autocratic governance democracy sort stay middle able move steadily problem much resistance anything dubai able carve entire island sea disregarding pluses minuses similar project india never take opposition environmentalists even constructing road sea coast mumbai faced much hurdle despite fact alternative millions congested traffic pumping harmful gases vehicles every single day point wishing autocratic better democracy learn live india debt free debt got show apart one individual becoming richest man world indices tell whole story infact story beyond meaningless numbers per capita gdp may times smaller population much poorer divide rich poor huge also explains difference consumption numbers eg mercedes sells half million cars china every year sell average yes thousand india year basically chinese buy mercedes month india years also fact million people india need government provide food grains daily sustenance propaganda saying china communist everyone makes wages country wage gap rich poor mercedes sells immaterial many mahindras buy brands different positioning pricing popularity market share every geography meaningless also fact new chinese cities may carcentric forcing people spend money cars indian cities even modern areas still motorable cycles bikes indices tell whole story tell good enough indication trajectory dont know india lots debts chalta hai attitude accepting fate made todays india shithole become elect corrupt criminals leaders lead us sit complain arent making progress realize every country shithole form live long enough china live na people often talk cool skyscrapers skyline incredible pretty insignificant comparison shanghai mercedes sells immaterial many mahindras buy brands different positioning pricing popularity market share every geography meaningless immaterial car aspirational purchase india luxury brands even signal world arrived similar sized population wise chinese economy times bigger indian economy consumption pattern relatively similar assuming else equal meaning buying atleast th chinese consumers buying th th even write much go street even major city see poverty around rural india even worse india higher debt gdp percentage china way contradicting mercedes luxury brand china many meaning many rich people afford means good number poor people weigh averages dont think yet say wealthpoor gap india causing gdp per capita skewed indians chinese two different demographics appeals appeals us simply multiple factors play india people lot trust local manufacturers brand appeal know maruti mahindra spare part easily obtained compared foreign parts lot even ultrawealthy black money hoarders go tata maruti foreign brands begun pick way go streets see answer mentioned opening post india democracy afford hide poverty unlike china everything embellished look better point india good china think point reread get mean democracy cant growth like china much freedom gives much obstacles progress dragged around mids late intentionally deflated spooked usual gordan changesque western commentators china economy collapsing reality wasis done intentionally benevolent emperor vs bad emperor problem quite wellknown historical philosophical also realworld problemchallengequestion monarchy though higher odds going bad since parentchild need always similarly competent secondly critically one gets bad emperor system lasts longer mechanism remove leaders harder theyre actually rulers life figurativelyrhetorically however system tuned way mandates termage limits massive obstacle philosophical question gets removed since even bad emperor comes stay beyond certain time frame lastly systems usually monarchy within spectrum norm throughout human history reason even mess bad leaderspolicies system hyperstable like democractic system means easily break formed new leadership create number cycles good bad good cycles higher upper ceilings recovers quickly quickly democractic system stagnant growth achieve x long number years former system either place democracy much higher level systems debate become taboo west percolated western narrative dominated societies like india well fukuyama virus action history matter fact dead china proved humans exhausted experimentation governance systems human collectives balls dare make known constant human history witness cherrypicking bit video new york infrastructure probably mediocre america context live la california bad issue theres almost real public infrastructure states car driven infrastructure probably wont able pivot without radical changes tldr infrastructure rapidly aging going get worse time every project x budget x longer time frame issue us spends way much military broken health care system benefits top elite americans personal gripe public service decline everything commoditized profit california spent hundred billion highspeed rail line sd sf barely got anything show im certain coming decades itll still entirely plane car focused per capita gdp may times smaller population much poorer divide rich poor huge china higher income inequality india check gini coefficient even get data source says china india source wtf debt spent based available data also factor black money fact india one corrupt countries world using gini coefficient way better way assessing income inequality data really get better sources chinas infrastructure ranks quite low stuff youre watching propaganda ccp accurate reality",
    "light_cleaned_title": "China's infrastructure is truly incredible!",
    "light_cleaned_selftext": "After reading through a post today about an Indian's experience in China and their infrastructure, which I already aware of somewhat, I got curious and started researching and came across this channel on youtube. [(31) The World WON'T Believe China's New Infrastructure (America Jealous) - YouTube](https://www.youtube.com/watch?v=7bHpaAOpQcg) I am absolutely astonished at how good they have it in China - the cities are remarkably clean and efficient and pollution free (clear blue sky and no noise), the top 9 Metro systems are in China and the infrastructure is truly phenomenal, their stations are better than most international airports and the tech is truly inspiring, the longest high speed rail network is in China including the trains which have the highest average speed in the world - a truly astonishing 292 kmph! They have the most amazing bridges, the largest dam by far, so big infact that it effects the rotation of the earth, the longest highway network in the world and so on and so forth. Mind you the guy in the channel is comparing Chinese infrastructure to the best in USA and Europe to come to his conclusions and we cant even match SEA countries. It feels like we are atleast a century behind and we wont ever catch up. It is so humbling and at the same time so inspiring to see what a country can do in such a short span of time if they have the will. Would we ever reach this level of finesse? I highly doubt it but I can take the solace in the fact that if we ever worked as well as China does we can too. If there is any country which can break US's hegemony on the world, its China and I dont think US can do anything. P.S. It is also refreshing to see that the videos are not laced with \"Proud Chinese\" or \"China Mata Ki Jai\" comments under them. Very few comments from Chinese but even when they are, they are mostly appreciative rather than \"superiority\".",
    "light_cleaned_comments": "In its hayday, chinese real estate sector was 35% of its GDP. Even with recent troubles (evergrande crisis etc.), it's still \\~28%. For comparison, India's real estate sector is 6% of its GDP. China number 1 ? Of the eastern hemisphere, yes. For all the shortcoming of the current Chinese system/economy , there is no denying the fact about the amazing Progress made by the Chinese. It will take us decades to reach where China is today. 6% officially. All of us know that most of black money from politicians and bureaucrats in actually invested in real estate. There is a reason why our housing is so poorly built and so expensive at the same time. if evergrande wouldve happened in any other country the bubble wouldve burst but the control on information gives the real estate sector leeway to do bs. Even for the US its around 12%...China made up a facade for people to keep investing in protected by its censorship. Generally only high per capita income countries have such a large share in Real estate. Given they have the largest network of highways and an astonishing spread of high speed rail, I'd reckon they are the best in the world. The stats for high speed rail are especially astonishing - Japan is the number two when it comes high speed rail and they have a total track length of 3000 odd kms, China is at 41000 kms already and will be closer to 80000 kms by 2035! [Length of the highspeed rail network worldwide 2022, by country | Statista](https://www.statista.com/statistics/1265995/length-of-highspeed-railway-lines-in-use-worldwide-by-country/) CCP posting propaganda on r/india now And what would this propaganda do hutiye? That we ask our government to replicate what chinese have done? Whats wrong with that? debts, lots of it so...Indian RE is good inverstment ? yeah sanghis are slacking off....busy making baby indians i guess Based on all the indices, India is 11-18 years behind where China is today. Does that mean India will look like this 18 years from now? Definitely not. While you can blame the governance apathy, people's lack of civic sense, etc., one of the biggest hurdles (in a good and a bad way) is democracy. I live in Dubai which is a kingdom. The government has steadfastly improved infrastructure, and has been investing in everything that will make Dubai compete with the best across different sectors. The con with a kingdom is that it depends on the King/Queen. A Tughlaqian ruler may have taken the country in the opposite direction, again with very little resistance. China with its autocratic governance too is. With a democracy, you sort of stay in the middle and are able to move on steadily. But the problem is there is too much resistance to anything. Dubai was able to carve out an entire island off the sea. Disregarding the pluses and minuses of it, a similar project in India will never take off because of opposition from environmentalists. Even constructing a road off the sea coast in Mumbai has faced so much hurdle, despite the fact that the alternative is for millions in congested traffic pumping out harmful gases out of their vehicles every single day. There is no point in wishing we were autocratic, or a better democracy. It is what it is, and we learn to live with what we have. And India is debt free? For all the debt we have, what have we got to show for it apart from one individual becoming the richest man in the world? Indices do not tell you the whole story or infact any story beyond meaningless numbers. While our per capita GDP may just be 3 times smaller our population is much poorer because the divide between the rich and poor is huge. This is also explains the difference between consumption numbers. For e.g. Mercedes sells more than half a million cars in China every year and they sell an average of 17000 (yes thousand) in India in a year. Basically Chinese buy more mercedes in a month than we in India do in 5 years! Also the fact that 800 million people in India need government to provide food grains for their daily sustenance. What about this is propaganda? You are saying that as if China is so communist, everyone makes the same wages in the country. They have their own wage gap between the rich and the poor. And what Mercedes sells is immaterial. How many Mahindras do they buy? Brands have different positioning, pricing, popularity and market share in every geography. It's meaningless. Also the fact that the new Chinese cities may be car-centric forcing people to spend money on cars while Indian cities, even the most modern areas, are still motorable by cycles and bikes. Indices do not tell the whole story, but they tell you a good enough indication of the trajectory I don’t know, India has lots of debts too ? For doing what ? This. This chalta hai attitude and accepting the fate is what that has made today's India a shithole that has become. We elect most corrupt, criminals as our leaders to lead us and then sit out and complain why we aren't making progress . You realize every country is a shithole in some form or the other once you live there long enough. I was in China for a while and now that I live in NA, people often talk about how cool some of the skyscrapers are and the skyline is incredible but it's pretty insignificant in comparison to Shanghai *\" And what Mercedes sells is immaterial. How many Mahindras do they buy? Brands have different positioning, pricing, popularity and market share in every geography. It's meaningless.\"* Why is it immaterial? A car is an aspirational purchase in India and luxury brands even more so. They signal to the world that you have arrived. We are similar sized population wise. Chinese economy is 6 times bigger than Indian economy so our consumption pattern should be relatively similar, assuming all else is equal meaning we should be buying atleast 1/6th of what Chinese consumers are buying. But we are not. We are 1/6th of the 1/6th. I should not even have to write so much - just go out on the street even in a major city and see the poverty all around. Rural India is even worse off. India has higher debt to gdp percentage than China by the way You are contradicting yourself. If Mercedes is such a luxury brand, and China has so many of them (meaning there are so many rich people who can afford it), then it only means that there are a good number of poor people to weigh the averages down, don't you think? And yet, you say wealth-poor gap in India is causing GDP per capita to be skewed. Indians and Chinese are two different demographics. What appeals to them is not the same as what appeals to us, simply because there are a multiple of factors at play here. In India. people have a lot of trust in local manufacturers (not because of the brand appeal, but because we know a Maruti and Mahindra spare part can be so easily obtained compared to foreign parts). So a lot of even the ultra-wealthy black money hoarders will go for a Tata or Maruti than foreign brands (which too have begun to pick up by the way). Go out on the streets and see is not an answer. As I mentioned in my opening post, India is a democracy - we can afford to not hide our poverty, unlike China where everything is embellished to look better. Again, my point is not that India is as good as China. If you think that is my point, reread to get what I mean. Democracy can't have growth like china. Too much freedom gives too much obstacles for progress It's been dragged to around 19% now from mid-20%s in late 2010s. They intentionally deflated this, which spooked the usual Gordan Chang-esque Western commentators that China or it's Economy is Collapsing, when the reality was it was/IS being done intentionally. Benevolent Emperor vs Bad Emperor Problem. Quite well-known historical and philosophical but also a Real-world problem/challenge/question. A monarchy though has higher odds of going bad since parent-child need not always be similarly competent and secondly and critically IF one gets a Bad Emperor in such a System it lasts longer because mechanism to remove such leaders is harder (they're actually rulers for Life not just figuratively/rhetorically). However if the System itself is tuned in a way that mandates Term-Age Limits then a massive obstacle to that philosophical question gets removed since EVEN IF a bad emperor comes they can not stay beyond a certain time frame. And lastly, such Systems (usually Monarchy but its within that spectrum) have been norm throughout human history for a reason. It's so because Even When they mess up with bad leaders/policies or what not, because the System is not Hyper-Stable (like Democractic System is) it means it can easily break up and be formed again under new Leadership. What this does is, create more number of cycles (good & bad) but because the Good Cycles has higher upper ceilings, it recovers quickly. More quickly than what a Democractic System with it's stagnant growth can achieve. So in X long number of years, the former system either is at same place as Democracy or much higher level. Systems Debate has become taboo in West and that has percolated into Western narrative dominated societies like India as well. Fukuyama virus in action. History as matter of fact is NOT Dead or Over. China proved it. Humans have NOT exhausted their experimentation with Governance Systems. Only human collectives that have the balls to dare make it. This is a known constant that human history itself is witness to. So he is cherry-picking a bit in the video. New York infrastructure is probably mediocre in America. For context, I live in LA california, and it's not that bad. The issue is that there's is almost no real public infrastructure in the states. It's a car driven infrastructure. And we probably won't be able to pivot out of it without radical changes. TLDR : our infrastructure is rapidly aging, so it's only going to get worse over time. Because every project here is 3x over budget 2x longer time frame. The issue is that the U.S spends way too much on the military and the broken health care system. Which only benefits the top 1% of elite Americans. My personal gripe is that public service is in decline because everything is being commoditized for profit. California spent over a hundred billion for a high-speed rail line from SD to sf. And we barely got anything to show for it. I'm certain that in the coming decades, it'll still be entirely plane and car focused. \\>While our per capita GDP may just be 3 times smaller our population is much poorer because the divide between the rich and poor is huge China has higher income inequality than India (Check the gini coefficient). Where did you even get your data? This source says China has 83% while India has 81.9% Source: wtf is the debt spent on ? This is based on available data. You also have to factor in black money and the fact that India is one of the most corrupt countries in the world. Using GINI coefficient is way better way of assessing income inequality than this data You should really get better sources. China's infrastructure ranks quite low and the stuff you're watching is propaganda from the CCP. Not accurate at all to the reality."
}