{
    "id": "15ozk92",
    "title": "Relatives/acquaintances/CAs of sarkari officials, how much do people earn through under the table income?",
    "url": "https://www.reddit.com/r/india/comments/15ozk92/relativesacquaintancescas_of_sarkari_officials/",
    "selftext": "I am looking to grind for government jobs, since IT sector does not have much scope. It is riddled with job instability, AI automation etc. which makes it an unsafe sector for workers. I was recently researching on under the table income in sarkari naukris and I found out that amongst the people who were caught, there is a lot of upside in under the table income. Here are  a few examples,\n\n* [₹500 cr in kickbacks in 16 months](https://www.indiatoday.in/india/story/chhattisgarh-ias-officer-arrested-enforcement-directorate-corruption-case-2285363-2022-10-14)\n* There are reports of some officers having [₹800 cr, ₹350 cr, ₹300 cr, ₹500 cr in assets](https://lagatar24.com/pooja-singhal-is-not-the-only-ias-officer-who-is-corrupt-know-10-most-corrupt-bureaucrats-in-country/96231/). Some of the tainted officials were even reinstated after investigation by subsequent governments.\n\nIt is also seen that subsequent governments tend to [reinstate the tainted officials](https://theprint.in/india/governance/cleared-and-reinstated-what-happens-to-many-ias-officers-suspended-for-misconduct/688994/).This kind of information of under the table income is not freely available on the internet (YouTube, Twitter, Reddit). So, relatives/acquaintances/CAs of sarkari officials, how much do people earn through under the table income?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691830909.0,
    "convurl": "https://external-preview.redd.it/g00nxdXrqR27F1ul4AL7Q8iNb1M9bxBGz8ZH3DAHbaA.jpg?auto=webp&s=da5cb836ebefb196da085b66823cc5230e0315fa",
    "comments": [],
    "cleaned_text": "relativesacquaintancescas sarkari officials much people earn table income looking grind government jobs since sector much scope riddled job instability ai automation etc makes unsafe sector workers recently researching table income sarkari naukris found amongst people caught lot upside table income examples cr kickbacks monthshttpswwwindiatodayinindiastorychhattisgarhiasofficerarrestedenforcementdirectoratecorruptioncase reports officers cr cr cr cr assetshttpslagatarcompoojasinghalisnottheonlyiasofficerwhoiscorruptknowmostcorruptbureaucratsincountry tainted officials even reinstated investigation subsequent governments also seen subsequent governments tend reinstate tainted officialshttpstheprintinindiagovernanceclearedandreinstatedwhathappenstomanyiasofficerssuspendedformisconductthis kind information table income freely available internet youtube twitter reddit relativesacquaintancescas sarkari officials much people earn table income ",
    "cleaned_title": "relativesacquaintancescas sarkari officials much people earn table income",
    "cleaned_selftext": "looking grind government jobs since sector much scope riddled job instability ai automation etc makes unsafe sector workers recently researching table income sarkari naukris found amongst people caught lot upside table income examples cr kickbacks monthshttpswwwindiatodayinindiastorychhattisgarhiasofficerarrestedenforcementdirectoratecorruptioncase reports officers cr cr cr cr assetshttpslagatarcompoojasinghalisnottheonlyiasofficerwhoiscorruptknowmostcorruptbureaucratsincountry tainted officials even reinstated investigation subsequent governments also seen subsequent governments tend reinstate tainted officialshttpstheprintinindiagovernanceclearedandreinstatedwhathappenstomanyiasofficerssuspendedformisconductthis kind information table income freely available internet youtube twitter reddit relativesacquaintancescas sarkari officials much people earn table income",
    "cleaned_comments": "",
    "light_cleaned_title": "Relatives/acquaintances/CAs of sarkari officials, how much do people earn through under the table income?",
    "light_cleaned_selftext": "I am looking to grind for government jobs, since IT sector does not have much scope. It is riddled with job instability, AI automation etc. which makes it an unsafe sector for workers. I was recently researching on under the table income in sarkari naukris and I found out that amongst the people who were caught, there is a lot of upside in under the table income. Here are a few examples, * [₹500 cr in kickbacks in 16 months](https://www.indiatoday.in/india/story/chhattisgarh-ias-officer-arrested-enforcement-directorate-corruption-case-2285363-2022-10-14) * There are reports of some officers having [₹800 cr, ₹350 cr, ₹300 cr, ₹500 cr in assets](https://lagatar24.com/pooja-singhal-is-not-the-only-ias-officer-who-is-corrupt-know-10-most-corrupt-bureaucrats-in-country/96231/). Some of the tainted officials were even reinstated after investigation by subsequent governments. It is also seen that subsequent governments tend to [reinstate the tainted officials](https://theprint.in/india/governance/cleared-and-reinstated-what-happens-to-many-ias-officers-suspended-for-misconduct/688994/).This kind of information of under the table income is not freely available on the internet (YouTube, Twitter, Reddit). So, relatives/acquaintances/CAs of sarkari officials, how much do people earn through under the table income?",
    "light_cleaned_comments": ""
}