{
    "id": "15ey107",
    "title": "Rahul Gandhi was arrogant during defamation case sentencing: Gujarat MLA in court",
    "url": "https://www.indiatoday.in/law/story/rahul-gandhi-arrogant-defamation-case-sentencing-gujarat-mla-purnesh-modi-supreme-court-2414389-2023-07-31",
    "selftext": "If being arrogant was a crime, Modi, Shah and Yogi will be on life term without bail.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 14,
    "created_utc": 1690852330.0,
    "convurl": "https://external-preview.redd.it/nogOfi7B83cNy_y7z8UpeE5tecg9JN73-kxaMr3jyNs.jpg?auto=webp&s=102a7f064c23081a3db340a17875d850558e78e1",
    "comments": [
        "And this how you lose a case. To claim that being arrogant during the case hearing is why one should be punished.\n\nBut then maybe the Supreme Court will buy this stupidity of an argument",
        "😂",
        "What about cylinderalla madam? Isn't she arrogant?",
        "Why is Modi so shit scared of Rahul Gandhi?\n\nAfter all, he is just a buffoon, right?",
        "Seems like there is a lot of effort being spent on someone the opposition seems to think is a failed politician. One would almost think his name was not Gandhi but Nehru",
        "I heard the SC judge handling RGs case is also gujrati. Let's see",
        "Fascism 101: opposition is weak and extremely powerful simultaneously. RaGa is weak powerless but BJP will twist the whole machinery to curtail his abilities cuz he is the biggest threat, all at the same time.",
        "Logic my girlfriend uses to win arguments",
        "Haha. Brilliant.",
        "56 inch chest  jhon seena ka to paseena nikal Raha hai.",
        "Oh it's the humility police"
    ],
    "cleaned_text": "rahul gandhi arrogant defamation case sentencing gujarat mla court arrogant crime modi shah yogi life term without bail ",
    "cleaned_title": "rahul gandhi arrogant defamation case sentencing gujarat mla court",
    "cleaned_selftext": "arrogant crime modi shah yogi life term without bail",
    "cleaned_comments": "lose case claim arrogant case hearing one punished maybe supreme court buy stupidity argument cylinderalla madam isnt arrogant modi shit scared rahul gandhi buffoon right seems like lot effort spent someone opposition seems think failed politician one would almost think name gandhi nehru heard sc judge handling rgs case also gujrati lets see fascism opposition weak extremely powerful simultaneously raga weak powerless bjp twist whole machinery curtail abilities cuz biggest threat time logic girlfriend uses win arguments haha brilliant inch chest jhon seena ka paseena nikal raha hai oh humility police",
    "light_cleaned_title": "Rahul Gandhi was arrogant during defamation case sentencing: Gujarat MLA in court",
    "light_cleaned_selftext": "If being arrogant was a crime, Modi, Shah and Yogi will be on life term without bail.",
    "light_cleaned_comments": "And this how you lose a case. To claim that being arrogant during the case hearing is why one should be punished. But then maybe the Supreme Court will buy this stupidity of an argument 😂 What about cylinderalla madam? Isn't she arrogant? Why is Modi so shit scared of Rahul Gandhi? After all, he is just a buffoon, right? Seems like there is a lot of effort being spent on someone the opposition seems to think is a failed politician. One would almost think his name was not Gandhi but Nehru I heard the SC judge handling RGs case is also gujrati. Let's see Fascism 101: opposition is weak and extremely powerful simultaneously. RaGa is weak powerless but BJP will twist the whole machinery to curtail his abilities cuz he is the biggest threat, all at the same time. Logic my girlfriend uses to win arguments Haha. Brilliant. 56 inch chest jhon seena ka to paseena nikal Raha hai. Oh it's the humility police"
}