{
    "id": "1ctaigx",
    "title": "Ghatkopar billboard incident- update.",
    "url": "https://www.ndtv.com/india-news/mumbai-hoarding-collapse-petrol-pump-on-which-mumbai-billboard-fell-didnt-have-clearance-5676054",
    "selftext": "We knew that the Billboard didn't have the clearance. \nNow investigation shows:\n\"The land on which the petrol pump operates falls within the jurisdiction of the housing department, requiring approval from the Revenue Department for commercial use. Lack of clarity regarding how commercial activities were sanctioned at the site without obtaining permissions from the Revenue Department has prompted inquiries directed at the Police Housing Development Corporation.\"\n- from the article. ",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1715858332.0,
    "convurl": "https://external-preview.redd.it/tagc2SivaGod05nKqzC5LzSX43jz9iEt14ox6ZDbA4I.jpg?auto=webp&s=40661f5d6b485b04322c9c9615a5b1b046f72050",
    "comments": [],
    "cleaned_text": "ghatkopar billboard incident update knew billboard didnt clearance investigation shows land petrol pump operates falls within jurisdiction housing department requiring approval revenue department commercial use lack clarity regarding commercial activities sanctioned site without obtaining permissions revenue department prompted inquiries directed police housing development corporation article ",
    "cleaned_title": "ghatkopar billboard incident update",
    "cleaned_selftext": "knew billboard didnt clearance investigation shows land petrol pump operates falls within jurisdiction housing department requiring approval revenue department commercial use lack clarity regarding commercial activities sanctioned site without obtaining permissions revenue department prompted inquiries directed police housing development corporation article",
    "cleaned_comments": "",
    "light_cleaned_title": "Ghatkopar billboard incident- update.",
    "light_cleaned_selftext": "We knew that the Billboard didn't have the clearance. Now investigation shows: \"The land on which the petrol pump operates falls within the jurisdiction of the housing department, requiring approval from the Revenue Department for commercial use. Lack of clarity regarding how commercial activities were sanctioned at the site without obtaining permissions from the Revenue Department has prompted inquiries directed at the Police Housing Development Corporation.\" - from the article.",
    "light_cleaned_comments": ""
}