{
    "id": "15cfqnu",
    "title": "[Repost] Sudha Murthy is not just a meme, she is a toxic human being, never forget",
    "url": "https://www.reddit.com/r/india/comments/15cfqnu/repost_sudha_murthy_is_not_just_a_meme_she_is_a/",
    "selftext": "Kind of a repost because ya'll downvoted me for talking shit about simple Sudha Murthy. \n\nLink to the old post: [https://www.reddit.com/r/india/comments/ypbguq/muh\\_middle\\_class\\_sudha\\_murthy\\_from\\_infosys\\_bows/](https://www.reddit.com/r/india/comments/ypbguq/muh_middle_class_sudha_murthy_from_infosys_bows/)\n\nNow the picture shows some funny old man, Sudha bowing down to him, right?\n\nWell, the funny old man is poison spewing, vile mouth piece of the ongoing dictatorship of India. Think of Heinrich Himmler of Modi.\n\nHis comment from yesterday about Bapu:  \n\n\n>“Mahatma Gandhi’s name is Mohandas Karamchand Gandhi, but Karamchand  Gandhi was not Mahatma Gandhi’s father. Mohandas was a Muslim landlord.”\n\nLink to news: [https://www.financialexpress.com/india-news/sambhaji-bhide-questions-mahatma-gandhis-lineage-congress-demands-arrest/3191510/](https://www.financialexpress.com/india-news/sambhaji-bhide-questions-mahatma-gandhis-lineage-congress-demands-arrest/3191510/) \n\nYeah and the Sudha Murthy, the so called middle class Marie Antoinette, is seen bowing down to this evil guy. What does that tell us about her?\n\nHer spoon comment from yesterday ([https://www.bbc.com/news/world-asia-india-66336500](https://www.bbc.com/news/world-asia-india-66336500)) is not a casual one. It is a freudian slip of her toxic puritan thought process.\n\nNext time when you see someone talk about her simplicity and middle class behaviors, remember this.\n\nNever forget.\n\nMurthy couple, Milekani gang, the infosys mafia, all of them are evil humans and they only interest themselves in holding on to their corrupt deeds to gather wealth and power and fool the middle class by spewing this simplicity bullshit.\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690595435.0,
    "convurl": "https://external-preview.redd.it/Qv82b3wxOb_y32eYzK3rRm7nNGraI8YHX6mIUfwWR2M.jpg?auto=webp&s=f923b33bc19927dc444759d89ec7193ffc7370d1",
    "comments": [
        "People are so simple minded, that put loud mouths, big muscled guys, and rich people on a pedestal as leaders, instead of using them to their own benefit.",
        "Never put rich people on pedestals. In India, more often than not they are rich because they managed to exploit the exploited some way.",
        "This bhide guy is also behind turning Bhima Koregaon into a big, and consequently also responsible for Fr. Stan Swamy's death.",
        "This bhide guy is also behind turning Bhima Koregaon into a big deal, and consequently also responsible for Fr. Stan Swamy's death.",
        "Years ago I heard stories of how Murthy would wash his own plates and not drive a luxury car and stayed in the same house for many years. \n\nNow it's her time. \n\nQuestion is how will this play out.\n\nRajya Sabha for her or both? Or Presidents post to Murthy?",
        "Look who's talking",
        "u/Diligent_Tangerine29",
        "Castiest pos",
        "Thank you for pointing it out to me.   \n\n\nif she really understood people she should have known these type of people are the problem to people she is trying to help. It is sad I thought she was different given some things she did and effort she took but she might not be after all.",
        "I'm convinced Sudha Murthy ghost-wrote her book. That woman is so full of shit, it's unbelievable. \n\nHer stories are the kind of crap you see on r/AmItheAsshole and honestly, the Whatsapp forwards sent by unkils and aunties which mention here are almost indistinguishable from her own written work. \n\nThe worst part of this frugality shit is that Narayan Murthy projects it onto his employees. Infosys has not increased it's fresher salaries in a decade. The world has changed, and these people are massively invested in keeping their traditional garbage to make sure they can get cheaper labor.",
        "> I'm convinced Sudha Murthy ghost-wrote her book. That woman is so full of shit, it's unbelievable.\n\nThis is hardly far-fetched. Many famous people can't write for shit and employ ghostwriters."
    ],
    "cleaned_text": "repost sudha murthy meme toxic human never forget kind repost yall downvoted talking shit simple sudha murthy link old post httpswwwredditcomrindiacommentsypbguqmuhmiddleclasssudhamurthyfrominfosysbowshttpswwwredditcomrindiacommentsypbguqmuhmiddleclasssudhamurthyfrominfosysbows picture shows funny old man sudha bowing right well funny old man poison spewing vile mouth piece ongoing dictatorship india think heinrich himmler modi comment yesterday bapu mahatma gandhis name mohandas karamchand gandhi karamchand gandhi mahatma gandhis father mohandas muslim landlord link news httpswwwfinancialexpresscomindianewssambhajibhidequestionsmahatmagandhislineagecongressdemandsarresthttpswwwfinancialexpresscomindianewssambhajibhidequestionsmahatmagandhislineagecongressdemandsarrest yeah sudha murthy called middle class marie antoinette seen bowing evil guy tell us spoon comment yesterday httpswwwbbccomnewsworldasiaindiahttpswwwbbccomnewsworldasiaindia casual one freudian slip toxic puritan thought process next time see someone talk simplicity middle class behaviors remember never forget murthy couple milekani gang infosys mafia evil humans interest holding corrupt deeds gather wealth power fool middle class spewing simplicity bullshit xb ",
    "cleaned_title": "repost sudha murthy meme toxic human never forget",
    "cleaned_selftext": "kind repost yall downvoted talking shit simple sudha murthy link old post httpswwwredditcomrindiacommentsypbguqmuhmiddleclasssudhamurthyfrominfosysbowshttpswwwredditcomrindiacommentsypbguqmuhmiddleclasssudhamurthyfrominfosysbows picture shows funny old man sudha bowing right well funny old man poison spewing vile mouth piece ongoing dictatorship india think heinrich himmler modi comment yesterday bapu mahatma gandhis name mohandas karamchand gandhi karamchand gandhi mahatma gandhis father mohandas muslim landlord link news httpswwwfinancialexpresscomindianewssambhajibhidequestionsmahatmagandhislineagecongressdemandsarresthttpswwwfinancialexpresscomindianewssambhajibhidequestionsmahatmagandhislineagecongressdemandsarrest yeah sudha murthy called middle class marie antoinette seen bowing evil guy tell us spoon comment yesterday httpswwwbbccomnewsworldasiaindiahttpswwwbbccomnewsworldasiaindia casual one freudian slip toxic puritan thought process next time see someone talk simplicity middle class behaviors remember never forget murthy couple milekani gang infosys mafia evil humans interest holding corrupt deeds gather wealth power fool middle class spewing simplicity bullshit xb",
    "cleaned_comments": "people simple minded put loud mouths big muscled guys rich people pedestal leaders instead using benefit never put rich people pedestals india often rich managed exploit exploited way bhide guy also behind turning bhima koregaon big consequently also responsible fr stan swamys death bhide guy also behind turning bhima koregaon big deal consequently also responsible fr stan swamys death years ago heard stories murthy would wash plates drive luxury car stayed house many years time question play rajya sabha presidents post murthy look whos talking udiligenttangerine castiest pos thank pointing really understood people known type people problem people trying help sad thought different given things effort took might im convinced sudha murthy ghostwrote book woman full shit unbelievable stories kind crap see ramitheasshole honestly whatsapp forwards sent unkils aunties mention almost indistinguishable written work worst part frugality shit narayan murthy projects onto employees infosys increased fresher salaries decade world changed people massively invested keeping traditional garbage make sure get cheaper labor im convinced sudha murthy ghostwrote book woman full shit unbelievable hardly farfetched many famous people cant write shit employ ghostwriters",
    "light_cleaned_title": "[Repost] Sudha Murthy is not just a meme, she is a toxic human being, never forget",
    "light_cleaned_selftext": "Kind of a repost because ya'll downvoted me for talking shit about simple Sudha Murthy. Link to the old post: [https://www.reddit.com/r/india/comments/ypbguq/muh\\_middle\\_class\\_sudha\\_murthy\\_from\\_infosys\\_bows/](https://www.reddit.com/r/india/comments/ypbguq/muh_middle_class_sudha_murthy_from_infosys_bows/) Now the picture shows some funny old man, Sudha bowing down to him, right? Well, the funny old man is poison spewing, vile mouth piece of the ongoing dictatorship of India. Think of Heinrich Himmler of Modi. His comment from yesterday about Bapu: >“Mahatma Gandhi’s name is Mohandas Karamchand Gandhi, but Karamchand Gandhi was not Mahatma Gandhi’s father. Mohandas was a Muslim landlord.” Link to news: [https://www.financialexpress.com/india-news/sambhaji-bhide-questions-mahatma-gandhis-lineage-congress-demands-arrest/3191510/](https://www.financialexpress.com/india-news/sambhaji-bhide-questions-mahatma-gandhis-lineage-congress-demands-arrest/3191510/) Yeah and the Sudha Murthy, the so called middle class Marie Antoinette, is seen bowing down to this evil guy. What does that tell us about her? Her spoon comment from yesterday ([https://www.bbc.com/news/world-asia-india-66336500](https://www.bbc.com/news/world-asia-india-66336500)) is not a casual one. It is a freudian slip of her toxic puritan thought process. Next time when you see someone talk about her simplicity and middle class behaviors, remember this. Never forget. Murthy couple, Milekani gang, the infosys mafia, all of them are evil humans and they only interest themselves in holding on to their corrupt deeds to gather wealth and power and fool the middle class by spewing this simplicity bullshit. &#x200B;",
    "light_cleaned_comments": "People are so simple minded, that put loud mouths, big muscled guys, and rich people on a pedestal as leaders, instead of using them to their own benefit. Never put rich people on pedestals. In India, more often than not they are rich because they managed to exploit the exploited some way. This bhide guy is also behind turning Bhima Koregaon into a big, and consequently also responsible for Fr. Stan Swamy's death. This bhide guy is also behind turning Bhima Koregaon into a big deal, and consequently also responsible for Fr. Stan Swamy's death. Years ago I heard stories of how Murthy would wash his own plates and not drive a luxury car and stayed in the same house for many years. Now it's her time. Question is how will this play out. Rajya Sabha for her or both? Or Presidents post to Murthy? Look who's talking u/Diligent_Tangerine29 Castiest pos Thank you for pointing it out to me. if she really understood people she should have known these type of people are the problem to people she is trying to help. It is sad I thought she was different given some things she did and effort she took but she might not be after all. I'm convinced Sudha Murthy ghost-wrote her book. That woman is so full of shit, it's unbelievable. Her stories are the kind of crap you see on r/AmItheAsshole and honestly, the Whatsapp forwards sent by unkils and aunties which mention here are almost indistinguishable from her own written work. The worst part of this frugality shit is that Narayan Murthy projects it onto his employees. Infosys has not increased it's fresher salaries in a decade. The world has changed, and these people are massively invested in keeping their traditional garbage to make sure they can get cheaper labor. > I'm convinced Sudha Murthy ghost-wrote her book. That woman is so full of shit, it's unbelievable. This is hardly far-fetched. Many famous people can't write for shit and employ ghostwriters."
}