{
    "id": "1h0voqa",
    "title": "Consumer court orders Flipkart to pay ₹10,000 for not allowing return of substandard product",
    "url": "https://search.app?link=https%3A%2F%2Fwww.barandbench.com%2Fnews%2Flitigation%2Fconsumer-court-orders-flipkart-pay-10000-not-allowing-return-substandard-product&utm_campaign=aga&utm_source=agsadl1%2Cagsadl3%2Csh%2Fx%2Fgs%2Fm2%2F4",
    "selftext": "The consumer forum held that the inability to accept return of product on the ground of 'no return policy' of Flipkart amounted to unfair trade practice and was a deficiency in service",
    "flair": "Law & Courts",
    "score": 266,
    "num_comments": 9,
    "created_utc": 1732680547.0,
    "convurl": "https://external-preview.redd.it/22-cLpggTUgzPv4Zxw2kVaI7XYJfK_Yf1lQJL1VlZiI.jpg?auto=webp&s=792993ed63d12422cd43a63863be8d00814c0b87",
    "comments": [
        "Lol yeah that will teach them, such a huge fine that the company will go bankrupt soon",
        "That consumer should circulate a how-to manual on social media so others can sue flipkart etc in consumer court",
        "Had it been in some other countries, the government would have stopped the company to do business for few months. It's India, here everything is okay. ",
        "class action law suits are not available as a legal option in India, so the amounts are going to be small",
        "Would that even offset the filing cost/hassle ?!",
        "Which country would do that that exactly?"
    ],
    "cleaned_text": "consumer court orders flipkart pay allowing return substandard product consumer forum held inability accept return product ground return policy flipkart amounted unfair trade practice deficiency service ",
    "cleaned_title": "consumer court orders flipkart pay allowing return substandard product",
    "cleaned_selftext": "consumer forum held inability accept return product ground return policy flipkart amounted unfair trade practice deficiency service",
    "cleaned_comments": "lol yeah teach huge fine company go bankrupt soon consumer circulate howto manual social media others sue flipkart etc consumer court countries government would stopped company business months india everything okay class action law suits available legal option india amounts going small would even offset filing costhassle country would exactly",
    "light_cleaned_title": "Consumer court orders Flipkart to pay ₹10,000 for not allowing return of substandard product",
    "light_cleaned_selftext": "The consumer forum held that the inability to accept return of product on the ground of 'no return policy' of Flipkart amounted to unfair trade practice and was a deficiency in service",
    "light_cleaned_comments": "Lol yeah that will teach them, such a huge fine that the company will go bankrupt soon That consumer should circulate a how-to manual on social media so others can sue flipkart etc in consumer court Had it been in some other countries, the government would have stopped the company to do business for few months. It's India, here everything is okay. class action law suits are not available as a legal option in India, so the amounts are going to be small Would that even offset the filing cost/hassle ?! Which country would do that that exactly?"
}