{
    "id": "y3g9ib",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/y3g9ib/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, eating places, pictures, experiences etc.\n\n**Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 8,
    "created_utc": 1665711009,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "I do  lots of experiments. But mine are not for taste purpose. Just to save time, energy and enhance health effects. Just sharing. Try at your own risk.\n\nFor last two years, I have been mixing instant coffee powder to orange juice in morning. And  coffee powder to kefir in evening. I fill one full glass and empty it within 10 seconds. And it has a very bad taste.",
        "Had Avial the other day which is basically A Mix Veg dish in Kerala style made with raw bananas, pumpkin , coconut paste etc.\n\nWas a little dry but flavor was good. Would recommend.",
        "So I got in to fermented drinks in a major way in the past month or so, am on my second batch of Kombucha and first batch of Gingerbug.\n\nLoving the results so far and excited to experiment with different flavors.",
        "How do you know it will have a positive effect?",
        "Thanks for asking. You made me to do research about negative effects of this combo. And to my surprise, many people love this orange coffee, and kefir coffee combo. ( Mine is without any sweetners and normal temp, so doesn't taste very good, but as I see the benefits, I like it. ) There are some other recipe on net. Other positives..If I drink all four separately with intervals I don't get time and I miss one or two. Both are two minutes recipe so I am ready to do easily. Coffee is doubtful, but orange juice, and kefir have so many advantages. Kefir is just great. Super probiotic. \n\nAnd I will share one more breakfast which I have been doing last three days. \nIt is not a recipe kind, but it is unique I guess ( for a mad like me). And it is superfast. Just after toothbrush, I ate one banana and kept roaming then picked up packet of dates ( these are Lion's date type) while roaming here and there finished 4-5, then filled half glass water (no sugar), mixed half spoon of Nescafe gold ( I like that gold, it is awesome) drank and ate 2-3 dates more and sat here to type. Finished.",
        "Another recipe. Now I am wfh so evening coffee is with kefir. Generally I keep some coffee powder in a small plastic bottle ( took empty vitamin bottle from my mother) and some lemons in my bag. And evening coffee for me in office, fill 750ml water bottle, squeeze lemon, add powder..shake it, open it and drink it. It tastes nice (no sugar or salt). This is my recipe which goes with me everywhere. When I went to visit relative( they don't like coffee). I made my own this coffee and enjoyed) \n\nMy mother likes tea, so sometimes she gives me tea ( she says, oh this is extra than one cup) so I have to take it. I mix little coffee powder and drink it. But here is another surprise. I mix one cup of water too.  I don't like to sip my coffee. When I go to opposite shop with my friends for coffee, I don't like that hot, I mix with water and drink fast. \n\nAnother recipe is, coffee in cold drink ( pepsi or coke) yeah it already contains coffee ( less amount) so sometimes I think, why not. And I mix more coffee and enjoy it like coffee.\n\nI don't take more than two times, any combo. And not after 6pm.",
        "I too got into fermented. First I tried fermented cucumber. Carrot etc. But I found that I have use more salt. Not good for BP etc. Then I found kefir. I chose milk kefir over water kefir. I also thought of kombucha and miso. And I haven't tried it.",
        "And as I wrote earlier.. I have tried kefir+coffee, which doesn't taste good. I have been mixing boiled oat, after letting it cool with kefir.  I have heard that there is a recipe of eating  overnight oat with kefir , I have to try this next."
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "lots experiments mine taste purpose save time energy enhance health effects sharing try risk last two years mixing instant coffee powder orange juice morning coffee powder kefir evening fill one full glass empty within seconds bad taste avial day basically mix veg dish kerala style made raw bananas pumpkin coconut paste etc little dry flavor good would recommend got fermented drinks major way past month second batch kombucha first batch gingerbug loving results far excited experiment different flavors know positive effect thanks asking made research negative effects combo surprise many people love orange coffee kefir coffee combo mine without sweetners normal temp doesnt taste good see benefits like recipe net positivesif drink four separately intervals dont get time miss one two two minutes recipe ready easily coffee doubtful orange juice kefir many advantages kefir great super probiotic share one breakfast last three days recipe kind unique guess mad like superfast toothbrush ate one banana kept roaming picked packet dates lions date type roaming finished filled half glass water sugar mixed half spoon nescafe gold like gold awesome drank ate dates sat type finished another recipe wfh evening coffee kefir generally keep coffee powder small plastic bottle took empty vitamin bottle mother lemons bag evening coffee office fill ml water bottle squeeze lemon add powdershake open drink tastes nice sugar salt recipe goes everywhere went visit relative dont like coffee made coffee enjoyed mother likes tea sometimes gives tea says oh extra one cup take mix little coffee powder drink another surprise mix one cup water dont like sip coffee go opposite shop friends coffee dont like hot mix water drink fast another recipe coffee cold drink pepsi coke yeah already contains coffee less amount sometimes think mix coffee enjoy like coffee dont take two times combo pm got fermented first tried fermented cucumber carrot etc found use salt good bp etc found kefir chose milk kefir water kefir also thought kombucha miso havent tried wrote earlier tried kefircoffee doesnt taste good mixing boiled oat letting cool kefir heard recipe eating overnight oat kefir try next",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, eating places, pictures, experiences etc. **Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I do lots of experiments. But mine are not for taste purpose. Just to save time, energy and enhance health effects. Just sharing. Try at your own risk. For last two years, I have been mixing instant coffee powder to orange juice in morning. And coffee powder to kefir in evening. I fill one full glass and empty it within 10 seconds. And it has a very bad taste. Had Avial the other day which is basically A Mix Veg dish in Kerala style made with raw bananas, pumpkin , coconut paste etc. Was a little dry but flavor was good. Would recommend. So I got in to fermented drinks in a major way in the past month or so, am on my second batch of Kombucha and first batch of Gingerbug. Loving the results so far and excited to experiment with different flavors. How do you know it will have a positive effect? Thanks for asking. You made me to do research about negative effects of this combo. And to my surprise, many people love this orange coffee, and kefir coffee combo. ( Mine is without any sweetners and normal temp, so doesn't taste very good, but as I see the benefits, I like it. ) There are some other recipe on net. Other positives..If I drink all four separately with intervals I don't get time and I miss one or two. Both are two minutes recipe so I am ready to do easily. Coffee is doubtful, but orange juice, and kefir have so many advantages. Kefir is just great. Super probiotic. And I will share one more breakfast which I have been doing last three days. It is not a recipe kind, but it is unique I guess ( for a mad like me). And it is superfast. Just after toothbrush, I ate one banana and kept roaming then picked up packet of dates ( these are Lion's date type) while roaming here and there finished 4-5, then filled half glass water (no sugar), mixed half spoon of Nescafe gold ( I like that gold, it is awesome) drank and ate 2-3 dates more and sat here to type. Finished. Another recipe. Now I am wfh so evening coffee is with kefir. Generally I keep some coffee powder in a small plastic bottle ( took empty vitamin bottle from my mother) and some lemons in my bag. And evening coffee for me in office, fill 750ml water bottle, squeeze lemon, add powder..shake it, open it and drink it. It tastes nice (no sugar or salt). This is my recipe which goes with me everywhere. When I went to visit relative( they don't like coffee). I made my own this coffee and enjoyed) My mother likes tea, so sometimes she gives me tea ( she says, oh this is extra than one cup) so I have to take it. I mix little coffee powder and drink it. But here is another surprise. I mix one cup of water too. I don't like to sip my coffee. When I go to opposite shop with my friends for coffee, I don't like that hot, I mix with water and drink fast. Another recipe is, coffee in cold drink ( pepsi or coke) yeah it already contains coffee ( less amount) so sometimes I think, why not. And I mix more coffee and enjoy it like coffee. I don't take more than two times, any combo. And not after 6pm. I too got into fermented. First I tried fermented cucumber. Carrot etc. But I found that I have use more salt. Not good for BP etc. Then I found kefir. I chose milk kefir over water kefir. I also thought of kombucha and miso. And I haven't tried it. And as I wrote earlier.. I have tried kefir+coffee, which doesn't taste good. I have been mixing boiled oat, after letting it cool with kefir. I have heard that there is a recipe of eating overnight oat with kefir , I have to try this next."
}