{
    "id": "1hkv3ei",
    "title": "CBI court holds 3 former Punjab cops guilty in 32-year-old fake encounter case",
    "url": "https://indianexpress.com/article/cities/chandigarh/cbi-court-punjab-cops-guilty-fake-encounter-case-9740624/",
    "selftext": "Jagdeep Singh Makhan and Gurnam Singh Pali were killed in a fake encounter by a Punjab Police team led by Gurbachan Singh on November 30, 1992.",
    "flair": "Law & Courts",
    "score": 184,
    "num_comments": 3,
    "created_utc": 1734981420.0,
    "convurl": "https://external-preview.redd.it/orOfuOFMac3oXRlEdG9jQPqhNQpHv-XUHvs_l_tDESk.jpg?auto=webp&s=862af07f9f00a80344856104035e375aac2aff6d",
    "comments": [
        "**[6733 extra judicial killings in Panjab (custodial & encounters)](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544)** are still waiting to be investigated, as CBI has told Punjab & Haryana High Court that it’s not feasible.\nEven though we know the number is way higher.",
        "This world is a joke honestly. The pending cases in courts is also a nice reminder that nobody is getting any justice in this place.",
        "Saar we never killed sikhs in fake encounters saar",
        "Yes fake encounters did take place and they condemnable too yet they are being convicted too, albeit the slow pace and rotten judicial process of this nation.\n\nHow about calling out manochahal, Jarnail Singh rode and other so called kharkus for instigating and ordering killings of Hindus and dissident Sikhs in Punjab?"
    ],
    "cleaned_text": "cbi court holds former punjab cops guilty yearold fake encounter case jagdeep singh makhan gurnam singh pali killed fake encounter punjab police team led gurbachan singh november ",
    "cleaned_title": "cbi court holds former punjab cops guilty yearold fake encounter case",
    "cleaned_selftext": "jagdeep singh makhan gurnam singh pali killed fake encounter punjab police team led gurbachan singh november",
    "cleaned_comments": "extra judicial killings panjab custodial encountershttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible still waiting investigated cbi told punjab haryana high court feasible even though know number way higher world joke honestly pending cases courts also nice reminder nobody getting justice place saar never killed sikhs fake encounters saar yes fake encounters take place condemnable yet convicted albeit slow pace rotten judicial process nation calling manochahal jarnail singh rode called kharkus instigating ordering killings hindus dissident sikhs punjab",
    "light_cleaned_title": "CBI court holds 3 former Punjab cops guilty in 32-year-old fake encounter case",
    "light_cleaned_selftext": "Jagdeep Singh Makhan and Gurnam Singh Pali were killed in a fake encounter by a Punjab Police team led by Gurbachan Singh on November 30, 1992.",
    "light_cleaned_comments": "**[6733 extra judicial killings in Panjab (custodial & encounters)](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544)** are still waiting to be investigated, as CBI has told Punjab & Haryana High Court that it’s not feasible. Even though we know the number is way higher. This world is a joke honestly. The pending cases in courts is also a nice reminder that nobody is getting any justice in this place. Saar we never killed sikhs in fake encounters saar Yes fake encounters did take place and they condemnable too yet they are being convicted too, albeit the slow pace and rotten judicial process of this nation. How about calling out manochahal, Jarnail Singh rode and other so called kharkus for instigating and ordering killings of Hindus and dissident Sikhs in Punjab?"
}