{
    "id": "1egnv5i",
    "title": "Infosys under investigation for GST evasion of over Rs 32,000 crore",
    "url": "https://economictimes.indiatimes.com/tech/information-tech/infosys-under-investigation-for-rs-32000-crore-in-gst-evasion/articleshow/112171866.cms",
    "selftext": "On the other hand Narayana Murphy wanted everyone to work 80 hours per week. ",
    "flair": "Law & Courts",
    "score": 670,
    "num_comments": 81,
    "created_utc": 1722434291.0,
    "convurl": "https://external-preview.redd.it/wGGA4xBg5sOVYhB42K6XcSEOmI19kHFzLBfzO76wJPA.jpg?auto=webp&s=54bce60563f7e14ffd150bc9eb44ef355bbacbdf",
    "comments": [
        "Do it for the nation !",
        "leo appraisal na dene ka ek or reason. \n\n70 hr kaam krne ka result",
        "Fucking finally.",
        "Countdown till the news simply disappears. Today is day 1",
        "Electoral bonds purchase will make this disappear.",
        "70hrs effect",
        "Lol their yearly profit itself is around 27k crore. Their balance sheet is going to get fcked.",
        "Pay GST and make india a developed country, Moorthi!",
        "looks bizarre. the amount looks ridiculous. besides, it must be accounted for somewhere. \n\njust an annoyance",
        "The leach in chief's company NO!!!!",
        "One phone call and everything will be alright \n\nJust wait n watch",
        "Didn't INFY make the GST portal?",
        "Do you work before asking others to work for the country fucker.",
        "Isn't Sudha Murthy the current MP, will there be any consequences to her MP stand due to this corruption charges?",
        "70 hours niklenge ab",
        "Scratch a deshbhakt and a scoundrel bleeds. This is true for all these motherfucking businessmen trying to loot us in the name of \"Bharat\"",
        "yes bro its just a misplaced ledger entry.",
        "eej of bijnesh",
        "OMG! now every infosys employee will have to work 140 hours a week to cover the fines!",
        "70 hours",
        "no sir! a forgotten or delayed electoral bond /s",
        "While I absolutely have no empathy for Infy and Moorthy, this pattern of reopening GST files years after the filing is making India an inhospitable place to run a business. \n\nWhat were the officials over the last 7 years that they caught the issue today? And why is this GST evasion never opened for the two A & A brothers of you know who! At this point, I wouldn’t be surprised if they are doing this because Infy donated some money on the wrong side or didn’t donate to the right side.",
        "wdym?\ninfosys 1yr profit before tax is around 43k crore",
        "I don’t know why people are downvoting you but this pattern of reopening GST files years after the filing is making India an inhospitable place to run a business. And to be clear, I have no empathy whatsoever for Infy and Moorthy.\n\nWhat were the officials over the last 7 years that they caught the issue today? And why is this GST evasion never opened for the two A & A brothers of you know who! At this point, I wouldn’t be surprised if they are doing this because Infy donated some money on the wrong side or didn’t donate to the right side.",
        "PAT is 27k, so now they have to pay additional GST which they didn't pay.",
        "Lol, that’s probably a prerequisite to become an MP",
        "Now infosys associates will have now work 24 x 7 for one year to pay this off.",
        "A year ago I attending an online coaching. This was run by just 1 teacher, and I remember he reduced the initial fee so that the total fee including gst does not get too high for students. Small or middle level businesses maintaing everything so that they don't get fuked by govt while this one organisation alone owes this much.",
        "Social service Anouncement for people who are at Infosys : The next time some one puts you on an improvement plan. Show those sucker's this notice and ask them to wash their ass first.",
        "So this is where his 14 hours are being spent ? In plotting and scheming how to evade taxes and the these fuckers wants us to work 12 hours a day . I mean come on man",
        "My CAs will work 70 hours a week, 70 weeks a year to fix this \n\n\\- Brits former father in law",
        "Yes they are the ones who did the shitty job on the GST portal.",
        "Why is it former father in law?",
        "It's neither the government officer's mistake, nor Infosys' mistake. The government has employees to collect as much taxes as possible. The companies have many accounts and lawyers to make sure that the company pays less taxes. The issue between them is based on different interpretations of the law. If interpreted in the government's way, the company owes them money. Infosys thinks that they don't. Both are right in their own way. Stuff like this always happens with every law that exists in the world. In GST, it's about money and gets unnecessarily publicized. Media is the culprit for making a mountain out of a molehill.",
        "I think it's accrued over the years. Unlikely to deal a significant blow to the company because we are way too proud of Infosys. Too big to fail!",
        "Ohh you sweet summer child!",
        "That is why Sudha Murthy joined Rajya sabha ",
        "Sunak is no longer the prime minister",
        "They make us fool and they will get tax benefit, steal from middle classes and pretend to be a self made billionaire . That is why India government don't want tax transperency ",
        "I think he should take Ola CEO'S advice and try to work 20 hours a day, don't take holidays off double the 70 hour he works, for the nation of course.",
        "Best govt can do is put the camera on simpil sudha in RS",
        "bhai ye desi sub m angrezi idiom??",
        "Vijay Mallya was also an MP when Kingfisher was getting investigated",
        "Pai & Moorthy sir \n\nY can’t you pay these amount to make India global super power\n\nYou want all IT employee to work for 14 hour why can’t you do one small sacrifice \n\nYou can ask special permission to pay full 32000 Crore to Bangalore \n\nBuilt Metro & Infra \n\nUr already filthy rich you can sacrifice this amount ",
        "Lol Brits in general. Gotcha",
        "Narayan Murthy is busy working 16 hours a day. No time to pay taxes, mate.",
        "Yo Murthy, let's talk.",
        "Wonder how many 70 hour weeks it would take to make that much ?",
        "नारायण नारायण 🎼🎵",
        "That woman is also a joker. Full of lies. I read her book - in one story, on the same day she met 3 students of hers (beneficiaries of her charity to pay fees for them). One gave free saree, the other overcharged her for something or was a pilot and the third treated her (what’s a story without a doctor and a pilot in it). People are really stupid to encourage these sociopaths who will do or say anything to be in the limelight. Their ego drives them, not their ambitions to better society. I wish they could just enjoy their retirement and do charitable things without that hunger to be in the news.",
        "Work for 18 hours to compensate it.",
        "The same Murthy who's daughter married Rishi Sunak and lived in San Marino with a monthly rent of 50K USD? The same Murthy who's duaghtet claimed to have no interference or financial laundering from Infosys but turned out she had a major stake in it? That one?",
        "That's the plan",
        "Bohot hui GST ki maar, Ab ki maar mo........ Wait what ?",
        "B-b-b-but we have to be grateful to our tyrannical oligarchs for giving us jobs!\n\n- Modi bhakts",
        "Remindme! 1 week",
        "I will be messaging you in 7 days on [**2024-08-07 20:36:57 UTC**](http://www.wolframalpha.com/input/?i=2024-08-07%2020:36:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1egnv5i/infosys_under_investigation_for_gst_evasion_of/lfvdu05/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1egnv5i%2Finfosys_under_investigation_for_gst_evasion_of%2Flfvdu05%2F%5D%0A%0ARemindMe%21%202024-08-07%2020%3A36%3A57%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201egnv5i)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "Well in past,\nBefore computer age\nA truck with cash was enough,,\nThese days ,",
        "Vijay Mallya's first stint in the Rajya Sabha from 2002 had been as a Congress-backed Independent. He was among the four MPs that the Congress had got elected.",
        "Shakedown commences on software industry….",
        "While i hate that guy with every fibre of my being, i also believe this evasion is probably just due to difference in interpretation of some section or something.",
        "Obviously a miscalculation. Thoda electoral bond ki kami hai",
        "Why would that affect her seat in the Rajya Sabha",
        "Hilarious how no one expects the company will have to pay anything more than a bribe to politicos.",
        "What prevents Infosys from shifting the base to the UAE ? \n\nOpening GST files years later does complicate things for any business tbh.",
        "Murty's 70 hours, Madam's spoon and Son in law will sort it out.",
        "Lol, she ain't kejri",
        "Give him a break, he starved on the streets of Europe and had to hitchhike.",
        "Govt should understand Mr Murty's situation. Now he got more mouths to feed from his pension. His son in law lost his job a month ago. Please show leninecy",
        "70 ghante kaam karnewala gyani kaha hai ? Chor saaala",
        "As a former employee of Infosys, I'm glad to hear this.\nFew months ago, there were insider trading charges and a fine, and now, this. The upper management is simply enjoying low risk, high rewards with little consequences.\nThe profit sharing has been highly skewed in the favour of the upper management despite such instances of mismanagement. I wonder what do majority shareholders have to say over this.",
        "Very simple couple",
        "It's because of this - [https://www.india.com/business/india-cannot-match-china-dont-use-grand-terms-like-hub-and-vishwa-guru-narayana-murthys-blunt-observation-7125879/](https://www.india.com/business/india-cannot-match-china-dont-use-grand-terms-like-hub-and-vishwa-guru-narayana-murthys-blunt-observation-7125879/)\n\nChronology samajh lijiye",
        "Indian laws are so shit and vague lol \n\nIf a developing country wants to learn how NOT to set taxation policies, it only needs to look at the mess that is India. \n\nTax terrorism at its best",
        "It's a simple misunderstanding",
        "Still simple, saying stupid things like not knowing address on British PM duhhhh",
        "She is A leader representing her state, Her company is setting a wrong example by evading tax. there were similar cases in the past where the MPs were disqualified. see below\n\n[https://scroll.in/latest/1056208/supreme-court-stays-disqualification-of-jd-s-leader-prajwal-revanna-as-mp](https://scroll.in/latest/1056208/supreme-court-stays-disqualification-of-jd-s-leader-prajwal-revanna-as-mp)",
        "She isn't representing any state she is a nominated memeber",
        "nominated member from where? Moon?",
        "What type of drugs are you on \nNominated members represent the country as an whole \nThey don't have any constituency/state \nReply back when you are off drugs 👍\nYou didn't even have an coherent response to the other points i mentioned \nHave a nice day",
        "its not about nomination, its about where from where she belong and where her roots are. any common man can tell she is a native of Karnataka and she lived her whole life there. She is famous just because of the corrupt Infosys , Sudha was chairperson of Infosys and obviously in the name of 'philanthropy' evaded tax. Don't play the game of big titles like 'nomination'. Just use common sense.\n\nI am surprised , there are people like you who still try support corrupt leaders despite of proven facts.",
        "for your reading [pleasure](https://www.moneycontrol.com/news/business/cbic-directs-use-of-june-circular-to-address-gst-issues-on-related-party-service-imports-report-12786020.html#google_vignette?utm_medium=social&utm_source=telegram&utm_campaign=regular-editorial)",
        "Today our great govt decided to give Infosys relief over GST... 80 hrs week 🤮🤢",
        "Meanwhile I am paying taxes, having no road where I live 🙂 shit govt, shit infosys"
    ],
    "cleaned_text": "infosys investigation gst evasion rs crore hand narayana murphy wanted everyone work hours per week ",
    "cleaned_title": "infosys investigation gst evasion rs crore",
    "cleaned_selftext": "hand narayana murphy wanted everyone work hours per week",
    "cleaned_comments": "nation leo appraisal na dene ka ek reason hr kaam krne ka result fucking finally countdown till news simply disappears today day electoral bonds purchase make disappear hrs effect lol yearly profit around k crore balance sheet going get fcked pay gst make india developed country moorthi looks bizarre amount looks ridiculous besides must accounted somewhere annoyance leach chiefs company one phone call everything alright wait n watch didnt infy make gst portal work asking others work country fucker isnt sudha murthy current mp consequences mp stand due corruption charges hours niklenge ab scratch deshbhakt scoundrel bleeds true motherfucking businessmen trying loot us name bharat yes bro misplaced ledger entry eej bijnesh omg every infosys employee work hours week cover fines hours sir forgotten delayed electoral bond absolutely empathy infy moorthy pattern reopening gst files years filing making india inhospitable place run business officials last years caught issue today gst evasion never opened two brothers know point wouldnt surprised infy donated money wrong side didnt donate right side wdym infosys yr profit tax around k crore dont know people downvoting pattern reopening gst files years filing making india inhospitable place run business clear empathy whatsoever infy moorthy officials last years caught issue today gst evasion never opened two brothers know point wouldnt surprised infy donated money wrong side didnt donate right side pat k pay additional gst didnt pay lol thats probably prerequisite become mp infosys associates work x one year pay year ago attending online coaching run teacher remember reduced initial fee total fee including gst get high students small middle level businesses maintaing everything dont get fuked govt one organisation alone owes much social service anouncement people infosys next time one puts improvement plan show suckers notice ask wash ass first hours spent plotting scheming evade taxes fuckers wants us work hours day mean come man cas work hours week weeks year fix brits former father law yes ones shitty job gst portal former father law neither government officers mistake infosys mistake government employees collect much taxes possible companies many accounts lawyers make sure company pays less taxes issue based different interpretations law interpreted governments way company owes money infosys thinks dont right way stuff like always happens every law exists world gst money gets unnecessarily publicized media culprit making mountain molehill think accrued years unlikely deal significant blow company way proud infosys big fail ohh sweet summer child sudha murthy joined rajya sabha sunak longer prime minister make us fool get tax benefit steal middle classes pretend self made billionaire india government dont want tax transperency think take ola ceos advice try work hours day dont take holidays double hour works nation course best govt put camera simpil sudha rs bhai ye desi sub angrezi idiom vijay mallya also mp kingfisher getting investigated pai moorthy sir cant pay amount make india global super power want employee work hour cant one small sacrifice ask special permission pay full crore bangalore built metro infra ur already filthy rich sacrifice amount lol brits general gotcha narayan murthy busy working hours day time pay taxes mate yo murthy lets talk wonder many hour weeks would take make much woman also joker full lies read book one story day met students beneficiaries charity pay fees one gave free saree overcharged something pilot third treated whats story without doctor pilot people really stupid encourage sociopaths say anything limelight ego drives ambitions better society wish could enjoy retirement charitable things without hunger news work hours compensate murthy whos daughter married rishi sunak lived san marino monthly rent k usd murthy whos duaghtet claimed interference financial laundering infosys turned major stake one thats plan bohot hui gst ki maar ab ki maar mo wait bbbbut grateful tyrannical oligarchs giving us jobs modi bhakts remindme week messaging days utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsegnviinfosysunderinvestigationforgstevasionoflfvducontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfegnvifinfosysunderinvestigationforgstevasionofflfvdufdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeleteegnvi infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback well past computer age truck cash enough days vijay mallyas first stint rajya sabha congressbacked independent among four mps congress got elected shakedown commences software industry hate guy every fibre also believe evasion probably due difference interpretation section something obviously miscalculation thoda electoral bond ki kami hai would affect seat rajya sabha hilarious one expects company pay anything bribe politicos prevents infosys shifting base uae opening gst files years later complicate things business tbh murtys hours madams spoon son law sort lol aint kejri give break starved streets europe hitchhike govt understand mr murtys situation got mouths feed pension son law lost job month ago please show leninecy ghante kaam karnewala gyani kaha hai chor saaala former employee infosys im glad hear months ago insider trading charges fine upper management simply enjoying low risk high rewards little consequences profit sharing highly skewed favour upper management despite instances mismanagement wonder majority shareholders say simple couple httpswwwindiacombusinessindiacannotmatchchinadontusegrandtermslikehubandvishwagurunarayanamurthysbluntobservationhttpswwwindiacombusinessindiacannotmatchchinadontusegrandtermslikehubandvishwagurunarayanamurthysbluntobservation chronology samajh lijiye indian laws shit vague lol developing country wants learn set taxation policies needs look mess india tax terrorism best simple misunderstanding still simple saying stupid things like knowing address british pm duhhhh leader representing state company setting wrong example evading tax similar cases past mps disqualified see httpsscrollinlatestsupremecourtstaysdisqualificationofjdsleaderprajwalrevannaasmphttpsscrollinlatestsupremecourtstaysdisqualificationofjdsleaderprajwalrevannaasmp isnt representing state nominated memeber nominated member moon type drugs nominated members represent country whole dont constituencystate reply back drugs didnt even coherent response points mentioned nice day nomination belong roots common man tell native karnataka lived whole life famous corrupt infosys sudha chairperson infosys obviously name philanthropy evaded tax dont play game big titles like nomination use common sense surprised people like still try support corrupt leaders despite proven facts reading pleasurehttpswwwmoneycontrolcomnewsbusinesscbicdirectsuseofjunecirculartoaddressgstissuesonrelatedpartyserviceimportsreporthtmlgooglevignetteutmmediumsocialutmsourcetelegramutmcampaignregulareditorial today great govt decided give infosys relief gst hrs week meanwhile paying taxes road live shit govt shit infosys",
    "light_cleaned_title": "Infosys under investigation for GST evasion of over Rs 32,000 crore",
    "light_cleaned_selftext": "On the other hand Narayana Murphy wanted everyone to work 80 hours per week.",
    "light_cleaned_comments": "Do it for the nation ! leo appraisal na dene ka ek or reason. 70 hr kaam krne ka result Fucking finally. Countdown till the news simply disappears. Today is day 1 Electoral bonds purchase will make this disappear. 70hrs effect Lol their yearly profit itself is around 27k crore. Their balance sheet is going to get fcked. Pay GST and make india a developed country, Moorthi! looks bizarre. the amount looks ridiculous. besides, it must be accounted for somewhere. just an annoyance The leach in chief's company NO!!!! One phone call and everything will be alright Just wait n watch Didn't INFY make the GST portal? Do you work before asking others to work for the country fucker. Isn't Sudha Murthy the current MP, will there be any consequences to her MP stand due to this corruption charges? 70 hours niklenge ab Scratch a deshbhakt and a scoundrel bleeds. This is true for all these motherfucking businessmen trying to loot us in the name of \"Bharat\" yes bro its just a misplaced ledger entry. eej of bijnesh OMG! now every infosys employee will have to work 140 hours a week to cover the fines! 70 hours no sir! a forgotten or delayed electoral bond /s While I absolutely have no empathy for Infy and Moorthy, this pattern of reopening GST files years after the filing is making India an inhospitable place to run a business. What were the officials over the last 7 years that they caught the issue today? And why is this GST evasion never opened for the two A & A brothers of you know who! At this point, I wouldn’t be surprised if they are doing this because Infy donated some money on the wrong side or didn’t donate to the right side. wdym? infosys 1yr profit before tax is around 43k crore I don’t know why people are downvoting you but this pattern of reopening GST files years after the filing is making India an inhospitable place to run a business. And to be clear, I have no empathy whatsoever for Infy and Moorthy. What were the officials over the last 7 years that they caught the issue today? And why is this GST evasion never opened for the two A & A brothers of you know who! At this point, I wouldn’t be surprised if they are doing this because Infy donated some money on the wrong side or didn’t donate to the right side. PAT is 27k, so now they have to pay additional GST which they didn't pay. Lol, that’s probably a prerequisite to become an MP Now infosys associates will have now work 24 x 7 for one year to pay this off. A year ago I attending an online coaching. This was run by just 1 teacher, and I remember he reduced the initial fee so that the total fee including gst does not get too high for students. Small or middle level businesses maintaing everything so that they don't get fuked by govt while this one organisation alone owes this much. Social service Anouncement for people who are at Infosys : The next time some one puts you on an improvement plan. Show those sucker's this notice and ask them to wash their ass first. So this is where his 14 hours are being spent ? In plotting and scheming how to evade taxes and the these fuckers wants us to work 12 hours a day . I mean come on man My CAs will work 70 hours a week, 70 weeks a year to fix this \\- Brits former father in law Yes they are the ones who did the shitty job on the GST portal. Why is it former father in law? It's neither the government officer's mistake, nor Infosys' mistake. The government has employees to collect as much taxes as possible. The companies have many accounts and lawyers to make sure that the company pays less taxes. The issue between them is based on different interpretations of the law. If interpreted in the government's way, the company owes them money. Infosys thinks that they don't. Both are right in their own way. Stuff like this always happens with every law that exists in the world. In GST, it's about money and gets unnecessarily publicized. Media is the culprit for making a mountain out of a molehill. I think it's accrued over the years. Unlikely to deal a significant blow to the company because we are way too proud of Infosys. Too big to fail! Ohh you sweet summer child! That is why Sudha Murthy joined Rajya sabha Sunak is no longer the prime minister They make us fool and they will get tax benefit, steal from middle classes and pretend to be a self made billionaire . That is why India government don't want tax transperency I think he should take Ola CEO'S advice and try to work 20 hours a day, don't take holidays off double the 70 hour he works, for the nation of course. Best govt can do is put the camera on simpil sudha in RS bhai ye desi sub m angrezi idiom?? Vijay Mallya was also an MP when Kingfisher was getting investigated Pai & Moorthy sir Y can’t you pay these amount to make India global super power You want all IT employee to work for 14 hour why can’t you do one small sacrifice You can ask special permission to pay full 32000 Crore to Bangalore Built Metro & Infra Ur already filthy rich you can sacrifice this amount Lol Brits in general. Gotcha Narayan Murthy is busy working 16 hours a day. No time to pay taxes, mate. Yo Murthy, let's talk. Wonder how many 70 hour weeks it would take to make that much ? नारायण नारायण 🎼🎵 That woman is also a joker. Full of lies. I read her book - in one story, on the same day she met 3 students of hers (beneficiaries of her charity to pay fees for them). One gave free saree, the other overcharged her for something or was a pilot and the third treated her (what’s a story without a doctor and a pilot in it). People are really stupid to encourage these sociopaths who will do or say anything to be in the limelight. Their ego drives them, not their ambitions to better society. I wish they could just enjoy their retirement and do charitable things without that hunger to be in the news. Work for 18 hours to compensate it. The same Murthy who's daughter married Rishi Sunak and lived in San Marino with a monthly rent of 50K USD? The same Murthy who's duaghtet claimed to have no interference or financial laundering from Infosys but turned out she had a major stake in it? That one? That's the plan Bohot hui GST ki maar, Ab ki maar mo........ Wait what ? B-b-b-but we have to be grateful to our tyrannical oligarchs for giving us jobs! - Modi bhakts Remindme! 1 week I will be messaging you in 7 days on [**2024-08-07 20:36:57 UTC**](http://www.wolframalpha.com/input/?i=2024-08-07%2020:36:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/1egnv5i/infosys_under_investigation_for_gst_evasion_of/lfvdu05/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F1egnv5i%2Finfosys_under_investigation_for_gst_evasion_of%2Flfvdu05%2F%5D%0A%0ARemindMe%21%202024-08-07%2020%3A36%3A57%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201egnv5i) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| Well in past, Before computer age A truck with cash was enough,, These days , Vijay Mallya's first stint in the Rajya Sabha from 2002 had been as a Congress-backed Independent. He was among the four MPs that the Congress had got elected. Shakedown commences on software industry…. While i hate that guy with every fibre of my being, i also believe this evasion is probably just due to difference in interpretation of some section or something. Obviously a miscalculation. Thoda electoral bond ki kami hai Why would that affect her seat in the Rajya Sabha Hilarious how no one expects the company will have to pay anything more than a bribe to politicos. What prevents Infosys from shifting the base to the UAE ? Opening GST files years later does complicate things for any business tbh. Murty's 70 hours, Madam's spoon and Son in law will sort it out. Lol, she ain't kejri Give him a break, he starved on the streets of Europe and had to hitchhike. Govt should understand Mr Murty's situation. Now he got more mouths to feed from his pension. His son in law lost his job a month ago. Please show leninecy 70 ghante kaam karnewala gyani kaha hai ? Chor saaala As a former employee of Infosys, I'm glad to hear this. Few months ago, there were insider trading charges and a fine, and now, this. The upper management is simply enjoying low risk, high rewards with little consequences. The profit sharing has been highly skewed in the favour of the upper management despite such instances of mismanagement. I wonder what do majority shareholders have to say over this. Very simple couple It's because of this - [https://www.india.com/business/india-cannot-match-china-dont-use-grand-terms-like-hub-and-vishwa-guru-narayana-murthys-blunt-observation-7125879/](https://www.india.com/business/india-cannot-match-china-dont-use-grand-terms-like-hub-and-vishwa-guru-narayana-murthys-blunt-observation-7125879/) Chronology samajh lijiye Indian laws are so shit and vague lol If a developing country wants to learn how NOT to set taxation policies, it only needs to look at the mess that is India. Tax terrorism at its best It's a simple misunderstanding Still simple, saying stupid things like not knowing address on British PM duhhhh She is A leader representing her state, Her company is setting a wrong example by evading tax. there were similar cases in the past where the MPs were disqualified. see below [https://scroll.in/latest/1056208/supreme-court-stays-disqualification-of-jd-s-leader-prajwal-revanna-as-mp](https://scroll.in/latest/1056208/supreme-court-stays-disqualification-of-jd-s-leader-prajwal-revanna-as-mp) She isn't representing any state she is a nominated memeber nominated member from where? Moon? What type of drugs are you on Nominated members represent the country as an whole They don't have any constituency/state Reply back when you are off drugs 👍 You didn't even have an coherent response to the other points i mentioned Have a nice day its not about nomination, its about where from where she belong and where her roots are. any common man can tell she is a native of Karnataka and she lived her whole life there. She is famous just because of the corrupt Infosys , Sudha was chairperson of Infosys and obviously in the name of 'philanthropy' evaded tax. Don't play the game of big titles like 'nomination'. Just use common sense. I am surprised , there are people like you who still try support corrupt leaders despite of proven facts. for your reading [pleasure](https://www.moneycontrol.com/news/business/cbic-directs-use-of-june-circular-to-address-gst-issues-on-related-party-service-imports-report-12786020.html#google_vignette?utm_medium=social&utm_source=telegram&utm_campaign=regular-editorial) Today our great govt decided to give Infosys relief over GST... 80 hrs week 🤮🤢 Meanwhile I am paying taxes, having no road where I live 🙂 shit govt, shit infosys"
}