{
    "id": "13zaytu",
    "title": "Seeking Advice: Where to Buy My First MacBook?",
    "url": "https://www.reddit.com/r/india/comments/13zaytu/seeking_advice_where_to_buy_my_first_macbook/",
    "selftext": " \n\nHi community,\n\nI'm currently in the market for my first MacBook, but unfortunately, there are very limited stores in my city, and they aren't offering any discounts. So, I decided to explore online options and came across two websites that caught my attention. I'm hoping to get some insights and reviews from those who have experience with these sellers.\n\n1. iTech Store: I found an appealing deal on iTech Store where they are selling the MacBook M1 Pro 16-inch for 160k. Since there is no physical store in my city, I'm a bit hesitant and also unsure about their return policy. Here's the link to the product: [**iTech Store MacBook M1 Pro 16-inch**](https://itechstore.co.in/product/16-inch-macbook-pro-m1-pro-chip-with-10%e2%80%91core-cpu-and-16%e2%80%91core-gpu-512gb-ssd-space-grey/)\n\nHave any of you bought an Apple product from their website? I would appreciate hearing about your experiences and insights.\n\n1. Aptronics: Another option I came across is Aptronics. They offer the MacBook M1 Pro 14-inch for 150k. Although Aptronics doesn't have a physical store in my city either, I noticed that they have multiple stores across different cities. I have taken a look at their Instagram page, reviews, and feedback, which seemed positive. Here's the link to the product: [**Aptronix MacBook M1 Pro 14-inch**](https://www.aptronixindia.com/14-inch-macbook-pro-apple-m1-pro-chip-2021)\n\nIf any of you have purchased anything from either of these websites or have any insights into their credibility, please share your reviews.\n\nI would greatly appreciate your advice in making the right decision on where to purchase my first MacBook. Thank you in advance for your help!",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 6,
    "created_utc": 1685794310.0,
    "convurl": "https://external-preview.redd.it/mL1W1hHmFJcZIHZBe-0Ieo-1_nSjCVnw7SEQbdSZ24A.jpg?auto=webp&v=enabled&s=b414d1e32050757dd7e13549d3da2606bf62cbd4",
    "comments": [
        "Unidays can give you discounts if you can verify a college email ID with them",
        "from apple store for the best warranty.",
        "Don't forget to buy service pack",
        "what is service pack ?",
        "https://support.apple.com/en-us/HT202702",
        "Itech store is legit."
    ],
    "cleaned_text": "seeking advice buy first macbook hi community im currently market first macbook unfortunately limited stores city arent offering discounts decided explore online options came across two websites caught attention im hoping get insights reviews experience sellers itech store found appealing deal itech store selling macbook pro inch k since physical store city im bit hesitant also unsure return policy heres link product itech store macbook pro inchhttpsitechstorecoinproductinchmacbookpromprochipwithecorecpuandecoregpugbssdspacegrey bought apple product website would appreciate hearing experiences insights aptronics another option came across aptronics offer macbook pro inch k although aptronics doesnt physical store city either noticed multiple stores across different cities taken look instagram page reviews feedback seemed positive heres link product aptronix macbook pro inchhttpswwwaptronixindiacominchmacbookproapplemprochip purchased anything either websites insights credibility please share reviews would greatly appreciate advice making right decision purchase first macbook thank advance help ",
    "cleaned_title": "seeking advice buy first macbook",
    "cleaned_selftext": "hi community im currently market first macbook unfortunately limited stores city arent offering discounts decided explore online options came across two websites caught attention im hoping get insights reviews experience sellers itech store found appealing deal itech store selling macbook pro inch k since physical store city im bit hesitant also unsure return policy heres link product itech store macbook pro inchhttpsitechstorecoinproductinchmacbookpromprochipwithecorecpuandecoregpugbssdspacegrey bought apple product website would appreciate hearing experiences insights aptronics another option came across aptronics offer macbook pro inch k although aptronics doesnt physical store city either noticed multiple stores across different cities taken look instagram page reviews feedback seemed positive heres link product aptronix macbook pro inchhttpswwwaptronixindiacominchmacbookproapplemprochip purchased anything either websites insights credibility please share reviews would greatly appreciate advice making right decision purchase first macbook thank advance help",
    "cleaned_comments": "unidays give discounts verify college email id apple store best warranty dont forget buy service pack service pack itech store legit",
    "light_cleaned_title": "Seeking Advice: Where to Buy My First MacBook?",
    "light_cleaned_selftext": "Hi community, I'm currently in the market for my first MacBook, but unfortunately, there are very limited stores in my city, and they aren't offering any discounts. So, I decided to explore online options and came across two websites that caught my attention. I'm hoping to get some insights and reviews from those who have experience with these sellers. 1. iTech Store: I found an appealing deal on iTech Store where they are selling the MacBook M1 Pro 16-inch for 160k. Since there is no physical store in my city, I'm a bit hesitant and also unsure about their return policy. Here's the link to the product: [**iTech Store MacBook M1 Pro 16-inch**](https://itechstore.co.in/product/16-inch-macbook-pro-m1-pro-chip-with-10%e2%80%91core-cpu-and-16%e2%80%91core-gpu-512gb-ssd-space-grey/) Have any of you bought an Apple product from their website? I would appreciate hearing about your experiences and insights. 1. Aptronics: Another option I came across is Aptronics. They offer the MacBook M1 Pro 14-inch for 150k. Although Aptronics doesn't have a physical store in my city either, I noticed that they have multiple stores across different cities. I have taken a look at their Instagram page, reviews, and feedback, which seemed positive. Here's the link to the product: [**Aptronix MacBook M1 Pro 14-inch**](https://www.aptronixindia.com/14-inch-macbook-pro-apple-m1-pro-chip-2021) If any of you have purchased anything from either of these websites or have any insights into their credibility, please share your reviews. I would greatly appreciate your advice in making the right decision on where to purchase my first MacBook. Thank you in advance for your help!",
    "light_cleaned_comments": "Unidays can give you discounts if you can verify a college email ID with them from apple store for the best warranty. Don't forget to buy service pack what is service pack ? Itech store is legit."
}