{
    "id": "1c2bhwn",
    "title": "Help needed to file PIL seeking suo moto cognizance to Investigate the extortion proceeds of illegal Electoral bonds scheme",
    "url": "https://www.reddit.com/r/india/comments/1c2bhwn/help_needed_to_file_pil_seeking_suo_moto/",
    "selftext": "We Need to help to file a PIL to chief justice of India regarding the unprecedented concentration of power and misuse of the power to influence electoral outcomes using extortion money from the now declared illegal electoral bonds, request all advocates to review and suggest improvements to the following, can post edited version of this after your edits:\n\nTo\n\nThe Hon'ble Chief Justice of India Supreme Court of India Tilak Marg, New Delhi - 110001\n\nRespected Sir,\n\nI am a committed advocate for transparency and integrity in governance. I am compelled to write to you due to troubling developments that pose a significant threat to the ethical foundation and fairness of our democratic processes. Recent investigative reports, particularly an alarming article from\n\n[https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds](https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds)\n\n, outline a pattern where at least 21 companies purchased electoral bonds after being subjected to raids by central agencies. This pattern suggests a potential use of state machinery to coerce or pressure corporations into financially supporting the Bharatiya Janata Party (BJP) under duress, subsequently influencing political and policy outcomes in a manner that conflicts with the principles of a free and fair democratic society.\n\n**Key Points of Concern:**\n\n1. **Illegal Nature of Electoral Bonds**: Following the Supreme Court's ruling that electoral bonds have been utilized in ways that contravene our legal framework, there is an urgent need to address the continuation of their use, especially when such usage involves elements of coercion and extortion as indicated by the incidents involving these 21 companies.\n2. **Violation of Constitutional and Legal Standards**: The practice, as reported, appears to violate the Representation of the People Act, which mandates political finance transparency and fairness. Additionally, it may also contravene the Prevention of Corruption Act, given that the extorted funds represent an abuse of power by those in positions of governmental authority.\n3. **Impact on Electoral Fairness**: The substantial funds allegedly secured through these bonds have potentially provided the BJP with a disproportionate influence over the political landscape, thereby undermining the level playing field necessary for democratic elections and eroding public trust in electoral integrity. In light of these severe allegations, I respectfully urge the Supreme Court to take suo moto cognizance of this matter. An independent investigation into these practices is crucial to ascertain the full extent of any wrongdoing and to reaffirm the nation’s commitment to justice and democratic principles.\n\n**Requested Actions:**\n\n* **Immediate Investigation**: Launch an independent inquiry to investigate these allegations thoroughly.\n* **Legislative Review and Reform**: Recommend necessary legislative reforms to prevent misuse of electoral financing mechanisms.\n* **Judicial Intervention**: Consider the disqualification of the BJP from the upcoming 2024 Lok Sabha elections if these allegations are substantiated, to preserve the sanctity and fairness of our electoral process. Our democracy relies on the equitable and lawful conduct of all political entities, and it is imperative that this issue is addressed promptly to restore public confidence in our electoral system. Thank you for your attention to this pressing issue. I am hopeful for your swift and decisive action in this regard. Yours faithfully,\n\n**Annexures:**\n\n**Summary of Allegations and Evidence.**\n\nGiven the Supreme Court's ruling that electoral bonds are illegal and the funds raised through them constitute proceeds of crime, a strong legal argument to disqualify the Bharatiya Janata Party (BJP) from participating in the 2024 Lok Sabha elections can be structured around the following points:\n\n**Argument Basis: Violation of Legal and Constitutional Norms**\n\nLegal Precedent and Compliance:\n\nPrimary Argument: The BJP has engaged in systematic violations of the Representation of the People Act and the Indian Penal Code by using electoral bonds deemed illegal by the Supreme Court. This usage constitutes a deliberate engagement in criminal activity to finance their electoral campaigns.\n\nSupporting Evidence: Detailed records of the amounts raised through electoral bonds, correlating these funds with the BJP’s spending on election campaigns and other political activities.\n\nConstitutional Violations:\n\nDemocratic Integrity: The use of illicit funds directly undermines the fairness and integrity of elections, which is a fundamental principle upheld by the Constitution of India.\n\nEquality Before Law: By financing its operations through illegal means, the BJP has gained an unfair advantage over other political parties, violating the principle of equality before law as enshrined in Article 14 of the Constitution.\n\n**Impact on Electoral Fairness:**\n\nUnfair Advantage: The funds obtained through electoral bonds have likely provided the BJP with significant financial resources that have been used to disproportionately influence electoral outcomes and voter perceptions, thus compromising the level playing field required for free and fair elections.\n\nManipulation of Democratic Processes: The financial power derived from illegal bonds could be used to manipulate media, policy, and public opinion, further entrenching the party’s position and stifling democratic competition.\n\nThe case involving companies like Megha Engineering, which reportedly faced raids and subsequently purchased electoral bonds, underscores a troubling intertwining of political funding and potential coercion. This scenario suggests that parties benefiting from such transactions might wield power to indirectly 'extort' contributions through state mechanisms. If substantiated, this could erode public trust, hinting at a quid pro quo that skews policy-making in favor of benefactors, thus undermining democratic principles and fairness in political competition. Consequently, any ruling party engaged in leveraging electoral bonds in such a manner arguably warrants scrutiny and disqualification to maintain electoral integrity and public confidence in democratic institutions. Read more here [https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds](https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds)\n\n**Legal Remedies Sought**\n\nImmediate Disqualification: Call for the immediate disqualification of the BJP from the upcoming 2024 Lok Sabha elections based on their engagement in criminal activities as established by the Supreme Court’s ruling on electoral bonds.\n\nForfeiture of Illegal Funds: Request the court to order the forfeiture of all funds raised through electoral bonds, with directions on how these funds should be managed or repurposed for public good, perhaps in enhancing electoral transparency and integrity mechanisms.\n\nMonitoring and Compliance for Future Elections:\n\nPropose that the Election Commission set stricter compliance and monitoring mechanisms to oversee political party financing, ensuring no recurrence of similar violations.\n\nAdvocate for legislative amendments to close loopholes in political funding and strengthen the framework for transparent and accountable election financing.\n\n**Legal Argument for Disqualification**\n\nEstablishing the Crime of Extortion:\n\nEvidence that shows a pattern where companies, after facing raids or threats of prosecution by state agencies, have purchased electoral bonds. This suggests a coercive practice that may qualify as extortion.\n\nEvidences Highlight any direct or indirect communication from BJP representatives that could be interpreted as coercive or suggestive of quid pro quo arrangements with these companies.\n\nLinking Funds to Electoral Bonds:\n\nEvidences Detail how these funds, classified as proceeds from a crime (extortion), have been channeled into the BJP’s coffers via electoral bonds. Evidences Provide financial records, whistleblower testimonies, or investigative reports that trace the flow of money.\n\nConstitutional and Legal Violations:\n\nRepresentation of the People Act: Evidences Argue that the use of funds obtained through illegal means violates this Act, which demands lawful and transparent financing of political activities.\n\nPrevention of Corruption Act: Evidences Make a case that the actions of the BJP constitute a misuse of official position for pecuniary gain, influencing the performance of public duties and resulting in undue advantage.\n\nConstitutional Principles: Evidences Assert that these practices breach the fundamental democratic principles enshrined in the Constitution, such as fairness, equality, and transparency in elections.\n\nThis aims to uphold the integrity of the electoral process by ensuring that all political parties adhere to the laws and principles that govern democratic competition in India. The goal is not just to address specific allegations of misconduct but to reinforce a system of checks and balances that prevents future abuses of power in political financing.",
    "flair": "Law & Courts",
    "score": 10,
    "num_comments": 5,
    "created_utc": 1712934418,
    "convurl": "https://external-preview.redd.it/34jH0kVBHZ38s4_0Zlp8uCwZbexKLf-JsiXR85AzLeE.jpg?auto=webp&s=b150e5773b7c57825dc0b42f84fda05f9c0904fe",
    "comments": [
        "You should try r/legaladviceindia\n\nGood initiative, people of this country have been screwed over enough."
    ],
    "cleaned_text": "help needed file pil seeking suo moto cognizance investigate extortion proceeds illegal electoral bonds scheme need help file pil chief justice india regarding unprecedented concentration power misuse power influence electoral outcomes using extortion money declared illegal electoral bonds request advocates review suggest improvements following post edited version edits honble chief justice india supreme court india tilak marg new delhi respected sir committed advocate transparency integrity governance compelled write due troubling developments pose significant threat ethical foundation fairness democratic processes recent investigative reports particularly alarming article httpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbondshttpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbonds outline pattern least companies purchased electoral bonds subjected raids central agencies pattern suggests potential use state machinery coerce pressure corporations financially supporting bharatiya janata party bjp duress subsequently influencing political policy outcomes manner conflicts principles free fair democratic society key points concern illegal nature electoral bonds following supreme courts ruling electoral bonds utilized ways contravene legal framework urgent need address continuation use especially usage involves elements coercion extortion indicated incidents involving companies violation constitutional legal standards practice reported appears violate representation people act mandates political finance transparency fairness additionally may also contravene prevention corruption act given extorted funds represent abuse power positions governmental authority impact electoral fairness substantial funds allegedly secured bonds potentially provided bjp disproportionate influence political landscape thereby undermining level playing field necessary democratic elections eroding public trust electoral integrity light severe allegations respectfully urge supreme court take suo moto cognizance matter independent investigation practices crucial ascertain full extent wrongdoing reaffirm nations commitment justice democratic principles requested actions immediate investigation launch independent inquiry investigate allegations thoroughly legislative review reform recommend necessary legislative reforms prevent misuse electoral financing mechanisms judicial intervention consider disqualification bjp upcoming lok sabha elections allegations substantiated preserve sanctity fairness electoral process democracy relies equitable lawful conduct political entities imperative issue addressed promptly restore public confidence electoral system thank attention pressing issue hopeful swift decisive action regard faithfully annexures summary allegations evidence given supreme courts ruling electoral bonds illegal funds raised constitute proceeds crime strong legal argument disqualify bharatiya janata party bjp participating lok sabha elections structured around following points argument basis violation legal constitutional norms legal precedent compliance primary argument bjp engaged systematic violations representation people act indian penal code using electoral bonds deemed illegal supreme court usage constitutes deliberate engagement criminal activity finance electoral campaigns supporting evidence detailed records amounts raised electoral bonds correlating funds bjps spending election campaigns political activities constitutional violations democratic integrity use illicit funds directly undermines fairness integrity elections fundamental principle upheld constitution india equality law financing operations illegal means bjp gained unfair advantage political parties violating principle equality law enshrined article constitution impact electoral fairness unfair advantage funds obtained electoral bonds likely provided bjp significant financial resources used disproportionately influence electoral outcomes voter perceptions thus compromising level playing field required free fair elections manipulation democratic processes financial power derived illegal bonds could used manipulate media policy public opinion entrenching partys position stifling democratic competition case involving companies like megha engineering reportedly faced raids subsequently purchased electoral bonds underscores troubling intertwining political funding potential coercion scenario suggests parties benefiting transactions might wield power indirectly extort contributions state mechanisms substantiated could erode public trust hinting quid pro quo skews policymaking favor benefactors thus undermining democratic principles fairness political competition consequently ruling party engaged leveraging electoral bonds manner arguably warrants scrutiny disqualification maintain electoral integrity public confidence democratic institutions read httpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbondshttpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbonds legal remedies sought immediate disqualification call immediate disqualification bjp upcoming lok sabha elections based engagement criminal activities established supreme courts ruling electoral bonds forfeiture illegal funds request court order forfeiture funds raised electoral bonds directions funds managed repurposed public good perhaps enhancing electoral transparency integrity mechanisms monitoring compliance future elections propose election commission set stricter compliance monitoring mechanisms oversee political party financing ensuring recurrence similar violations advocate legislative amendments close loopholes political funding strengthen framework transparent accountable election financing legal argument disqualification establishing crime extortion evidence shows pattern companies facing raids threats prosecution state agencies purchased electoral bonds suggests coercive practice may qualify extortion evidences highlight direct indirect communication bjp representatives could interpreted coercive suggestive quid pro quo arrangements companies linking funds electoral bonds evidences detail funds classified proceeds crime extortion channeled bjps coffers via electoral bonds evidences provide financial records whistleblower testimonies investigative reports trace flow money constitutional legal violations representation people act evidences argue use funds obtained illegal means violates act demands lawful transparent financing political activities prevention corruption act evidences make case actions bjp constitute misuse official position pecuniary gain influencing performance public duties resulting undue advantage constitutional principles evidences assert practices breach fundamental democratic principles enshrined constitution fairness equality transparency elections aims uphold integrity electoral process ensuring political parties adhere laws principles govern democratic competition india goal address specific allegations misconduct reinforce system checks balances prevents future abuses power political financing ",
    "cleaned_title": "help needed file pil seeking suo moto cognizance investigate extortion proceeds illegal electoral bonds scheme",
    "cleaned_selftext": "need help file pil chief justice india regarding unprecedented concentration power misuse power influence electoral outcomes using extortion money declared illegal electoral bonds request advocates review suggest improvements following post edited version edits honble chief justice india supreme court india tilak marg new delhi respected sir committed advocate transparency integrity governance compelled write due troubling developments pose significant threat ethical foundation fairness democratic processes recent investigative reports particularly alarming article httpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbondshttpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbonds outline pattern least companies purchased electoral bonds subjected raids central agencies pattern suggests potential use state machinery coerce pressure corporations financially supporting bharatiya janata party bjp duress subsequently influencing political policy outcomes manner conflicts principles free fair democratic society key points concern illegal nature electoral bonds following supreme courts ruling electoral bonds utilized ways contravene legal framework urgent need address continuation use especially usage involves elements coercion extortion indicated incidents involving companies violation constitutional legal standards practice reported appears violate representation people act mandates political finance transparency fairness additionally may also contravene prevention corruption act given extorted funds represent abuse power positions governmental authority impact electoral fairness substantial funds allegedly secured bonds potentially provided bjp disproportionate influence political landscape thereby undermining level playing field necessary democratic elections eroding public trust electoral integrity light severe allegations respectfully urge supreme court take suo moto cognizance matter independent investigation practices crucial ascertain full extent wrongdoing reaffirm nations commitment justice democratic principles requested actions immediate investigation launch independent inquiry investigate allegations thoroughly legislative review reform recommend necessary legislative reforms prevent misuse electoral financing mechanisms judicial intervention consider disqualification bjp upcoming lok sabha elections allegations substantiated preserve sanctity fairness electoral process democracy relies equitable lawful conduct political entities imperative issue addressed promptly restore public confidence electoral system thank attention pressing issue hopeful swift decisive action regard faithfully annexures summary allegations evidence given supreme courts ruling electoral bonds illegal funds raised constitute proceeds crime strong legal argument disqualify bharatiya janata party bjp participating lok sabha elections structured around following points argument basis violation legal constitutional norms legal precedent compliance primary argument bjp engaged systematic violations representation people act indian penal code using electoral bonds deemed illegal supreme court usage constitutes deliberate engagement criminal activity finance electoral campaigns supporting evidence detailed records amounts raised electoral bonds correlating funds bjps spending election campaigns political activities constitutional violations democratic integrity use illicit funds directly undermines fairness integrity elections fundamental principle upheld constitution india equality law financing operations illegal means bjp gained unfair advantage political parties violating principle equality law enshrined article constitution impact electoral fairness unfair advantage funds obtained electoral bonds likely provided bjp significant financial resources used disproportionately influence electoral outcomes voter perceptions thus compromising level playing field required free fair elections manipulation democratic processes financial power derived illegal bonds could used manipulate media policy public opinion entrenching partys position stifling democratic competition case involving companies like megha engineering reportedly faced raids subsequently purchased electoral bonds underscores troubling intertwining political funding potential coercion scenario suggests parties benefiting transactions might wield power indirectly extort contributions state mechanisms substantiated could erode public trust hinting quid pro quo skews policymaking favor benefactors thus undermining democratic principles fairness political competition consequently ruling party engaged leveraging electoral bonds manner arguably warrants scrutiny disqualification maintain electoral integrity public confidence democratic institutions read httpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbondshttpsscrollinarticleafterraidsbycentralagenciesthesecompaniespurchasedelectoralbonds legal remedies sought immediate disqualification call immediate disqualification bjp upcoming lok sabha elections based engagement criminal activities established supreme courts ruling electoral bonds forfeiture illegal funds request court order forfeiture funds raised electoral bonds directions funds managed repurposed public good perhaps enhancing electoral transparency integrity mechanisms monitoring compliance future elections propose election commission set stricter compliance monitoring mechanisms oversee political party financing ensuring recurrence similar violations advocate legislative amendments close loopholes political funding strengthen framework transparent accountable election financing legal argument disqualification establishing crime extortion evidence shows pattern companies facing raids threats prosecution state agencies purchased electoral bonds suggests coercive practice may qualify extortion evidences highlight direct indirect communication bjp representatives could interpreted coercive suggestive quid pro quo arrangements companies linking funds electoral bonds evidences detail funds classified proceeds crime extortion channeled bjps coffers via electoral bonds evidences provide financial records whistleblower testimonies investigative reports trace flow money constitutional legal violations representation people act evidences argue use funds obtained illegal means violates act demands lawful transparent financing political activities prevention corruption act evidences make case actions bjp constitute misuse official position pecuniary gain influencing performance public duties resulting undue advantage constitutional principles evidences assert practices breach fundamental democratic principles enshrined constitution fairness equality transparency elections aims uphold integrity electoral process ensuring political parties adhere laws principles govern democratic competition india goal address specific allegations misconduct reinforce system checks balances prevents future abuses power political financing",
    "cleaned_comments": "try rlegaladviceindia good initiative people country screwed enough",
    "light_cleaned_title": "Help needed to file PIL seeking suo moto cognizance to Investigate the extortion proceeds of illegal Electoral bonds scheme",
    "light_cleaned_selftext": "We Need to help to file a PIL to chief justice of India regarding the unprecedented concentration of power and misuse of the power to influence electoral outcomes using extortion money from the now declared illegal electoral bonds, request all advocates to review and suggest improvements to the following, can post edited version of this after your edits: To The Hon'ble Chief Justice of India Supreme Court of India Tilak Marg, New Delhi - 110001 Respected Sir, I am a committed advocate for transparency and integrity in governance. I am compelled to write to you due to troubling developments that pose a significant threat to the ethical foundation and fairness of our democratic processes. Recent investigative reports, particularly an alarming article from [https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds](https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds) , outline a pattern where at least 21 companies purchased electoral bonds after being subjected to raids by central agencies. This pattern suggests a potential use of state machinery to coerce or pressure corporations into financially supporting the Bharatiya Janata Party (BJP) under duress, subsequently influencing political and policy outcomes in a manner that conflicts with the principles of a free and fair democratic society. **Key Points of Concern:** 1. **Illegal Nature of Electoral Bonds**: Following the Supreme Court's ruling that electoral bonds have been utilized in ways that contravene our legal framework, there is an urgent need to address the continuation of their use, especially when such usage involves elements of coercion and extortion as indicated by the incidents involving these 21 companies. 2. **Violation of Constitutional and Legal Standards**: The practice, as reported, appears to violate the Representation of the People Act, which mandates political finance transparency and fairness. Additionally, it may also contravene the Prevention of Corruption Act, given that the extorted funds represent an abuse of power by those in positions of governmental authority. 3. **Impact on Electoral Fairness**: The substantial funds allegedly secured through these bonds have potentially provided the BJP with a disproportionate influence over the political landscape, thereby undermining the level playing field necessary for democratic elections and eroding public trust in electoral integrity. In light of these severe allegations, I respectfully urge the Supreme Court to take suo moto cognizance of this matter. An independent investigation into these practices is crucial to ascertain the full extent of any wrongdoing and to reaffirm the nation’s commitment to justice and democratic principles. **Requested Actions:** * **Immediate Investigation**: Launch an independent inquiry to investigate these allegations thoroughly. * **Legislative Review and Reform**: Recommend necessary legislative reforms to prevent misuse of electoral financing mechanisms. * **Judicial Intervention**: Consider the disqualification of the BJP from the upcoming 2024 Lok Sabha elections if these allegations are substantiated, to preserve the sanctity and fairness of our electoral process. Our democracy relies on the equitable and lawful conduct of all political entities, and it is imperative that this issue is addressed promptly to restore public confidence in our electoral system. Thank you for your attention to this pressing issue. I am hopeful for your swift and decisive action in this regard. Yours faithfully, **Annexures:** **Summary of Allegations and Evidence.** Given the Supreme Court's ruling that electoral bonds are illegal and the funds raised through them constitute proceeds of crime, a strong legal argument to disqualify the Bharatiya Janata Party (BJP) from participating in the 2024 Lok Sabha elections can be structured around the following points: **Argument Basis: Violation of Legal and Constitutional Norms** Legal Precedent and Compliance: Primary Argument: The BJP has engaged in systematic violations of the Representation of the People Act and the Indian Penal Code by using electoral bonds deemed illegal by the Supreme Court. This usage constitutes a deliberate engagement in criminal activity to finance their electoral campaigns. Supporting Evidence: Detailed records of the amounts raised through electoral bonds, correlating these funds with the BJP’s spending on election campaigns and other political activities. Constitutional Violations: Democratic Integrity: The use of illicit funds directly undermines the fairness and integrity of elections, which is a fundamental principle upheld by the Constitution of India. Equality Before Law: By financing its operations through illegal means, the BJP has gained an unfair advantage over other political parties, violating the principle of equality before law as enshrined in Article 14 of the Constitution. **Impact on Electoral Fairness:** Unfair Advantage: The funds obtained through electoral bonds have likely provided the BJP with significant financial resources that have been used to disproportionately influence electoral outcomes and voter perceptions, thus compromising the level playing field required for free and fair elections. Manipulation of Democratic Processes: The financial power derived from illegal bonds could be used to manipulate media, policy, and public opinion, further entrenching the party’s position and stifling democratic competition. The case involving companies like Megha Engineering, which reportedly faced raids and subsequently purchased electoral bonds, underscores a troubling intertwining of political funding and potential coercion. This scenario suggests that parties benefiting from such transactions might wield power to indirectly 'extort' contributions through state mechanisms. If substantiated, this could erode public trust, hinting at a quid pro quo that skews policy-making in favor of benefactors, thus undermining democratic principles and fairness in political competition. Consequently, any ruling party engaged in leveraging electoral bonds in such a manner arguably warrants scrutiny and disqualification to maintain electoral integrity and public confidence in democratic institutions. Read more here [https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds](https://scroll.in/article/1065267/after-raids-by-central-agencies-these-21-companies-purchased-electoral-bonds) **Legal Remedies Sought** Immediate Disqualification: Call for the immediate disqualification of the BJP from the upcoming 2024 Lok Sabha elections based on their engagement in criminal activities as established by the Supreme Court’s ruling on electoral bonds. Forfeiture of Illegal Funds: Request the court to order the forfeiture of all funds raised through electoral bonds, with directions on how these funds should be managed or repurposed for public good, perhaps in enhancing electoral transparency and integrity mechanisms. Monitoring and Compliance for Future Elections: Propose that the Election Commission set stricter compliance and monitoring mechanisms to oversee political party financing, ensuring no recurrence of similar violations. Advocate for legislative amendments to close loopholes in political funding and strengthen the framework for transparent and accountable election financing. **Legal Argument for Disqualification** Establishing the Crime of Extortion: Evidence that shows a pattern where companies, after facing raids or threats of prosecution by state agencies, have purchased electoral bonds. This suggests a coercive practice that may qualify as extortion. Evidences Highlight any direct or indirect communication from BJP representatives that could be interpreted as coercive or suggestive of quid pro quo arrangements with these companies. Linking Funds to Electoral Bonds: Evidences Detail how these funds, classified as proceeds from a crime (extortion), have been channeled into the BJP’s coffers via electoral bonds. Evidences Provide financial records, whistleblower testimonies, or investigative reports that trace the flow of money. Constitutional and Legal Violations: Representation of the People Act: Evidences Argue that the use of funds obtained through illegal means violates this Act, which demands lawful and transparent financing of political activities. Prevention of Corruption Act: Evidences Make a case that the actions of the BJP constitute a misuse of official position for pecuniary gain, influencing the performance of public duties and resulting in undue advantage. Constitutional Principles: Evidences Assert that these practices breach the fundamental democratic principles enshrined in the Constitution, such as fairness, equality, and transparency in elections. This aims to uphold the integrity of the electoral process by ensuring that all political parties adhere to the laws and principles that govern democratic competition in India. The goal is not just to address specific allegations of misconduct but to reinforce a system of checks and balances that prevents future abuses of power in political financing.",
    "light_cleaned_comments": "You should try r/legaladviceindia Good initiative, people of this country have been screwed over enough."
}