{
    "id": "15qna4p",
    "title": "3 Years Jail For Spreading Fake News, Says Proposed Criminal Bill",
    "url": "https://www.ndtv.com/india-news/3-years-jail-for-spreading-fake-news-says-propsed-criminal-bill-4291781",
    "selftext": "What is your opinion on this?",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 50,
    "created_utc": 1691996775.0,
    "convurl": "https://external-preview.redd.it/L9IOy4zXxS12wWCe6ottSO97z0AMB1vsoHVNrZ-ZIHg.jpg?auto=webp&s=ef4d30536ba0e71f8d77266ffaa25d660888d2bb",
    "comments": [
        "*Conditions Apply\nRules apply only for opposing parties and people",
        "Amit malviya be like : ese bills ko hum apne ***** pe rakhte hai",
        "Amit Malviya  should be locked in even before the the said bill is approved",
        "And its a fake news if PIB says so...",
        "Yep! And only govt approved fact checkers allowed, all other fact checkers deemed as fake news… 🤐",
        "Government can flag any news as fake if it goes against their agenda. Just another step towards Hindu Rashtra.",
        "This will be a tool for misuse against opponents. If they were to impose it the HM and his IT cell coolies would be behind bars too.",
        "another tool created to randomly arrest people ..",
        "And should the news be approved by the Ministry or Truth first?",
        "The government is going about it as if they will never ever lose an election from now. There will come a time when all this will come to bite them in the bum.",
        "Good. The whole rape crimes in Manipur conflict started because of fake news.",
        "Oye pols a gayi pols",
        "Meanwhile modi parliament - 🤡",
        "Ah yes, \"fake news\"...that which the government finds unpalatable!",
        "Literally every WhatsApp uncle should be in jail then",
        "Any \"Bill\" that pertains to the regulation of information is effectively dead in the water the moment it is conceived.\n\nThe internet will not and cannot be regulated.\n\nEven a fascist anti freedom regime like the CCP has failed miserably at that. What hope does anyone else have.\n\nInformation is free.",
        "भारतीय न्यूज़ चैनलों के पेट पर लात?",
        "How dare you deny the great Vikramaditya's existence, he conquered 90% of the world! You're behind bars, fake news spreader!",
        "Noooo. Now what will happen to the 1 cr self employed 2rs tweeters/commenters?",
        "By this logic, OP India editors should be given 3 life sentences",
        "Can we use this to jail members of this government, including the PM and HM, for constant lies and deception? /s",
        "Amit Malware should ideally get life sentence under this, lol. But then, Mota Rajan (Shah) will make an exception for him and let him spread more fake news.\n\nLike Franklin D. Roosevelt once said, \"He may be a son of a bitch. But he's our son of a bitch.\"",
        "Does not apply for Bhajpa workers",
        "Aadhe BJP aur Congress politicians will be in jail then.",
        "then they have to hold party meetings in jails.",
        "Ripe for abuse and misuse.\n\nDO NOT SUPPORT",
        "And the Govt would decide what is a fake news :). Lol what could go wrong.",
        "Ga*nd",
        "Why is India transforming like china",
        "So Modi will go to jail?",
        "The illusion of freedom, controlled by fascists",
        "I am waiting outside the parliament don't see any police yet they must be coming soon.",
        "Sabse pehla Vishwaguru ko dalo, sala demonetization ka sabse bada fake news racket chalaya usne",
        "They got a plan to stay in power forever. the new parliament is all about it.",
        "information may be free. But this is to catch the informer themselves.",
        "This is why encryption exists.\n\nUsing VPNs isn't illegal.",
        "i think it almost is. they are working on it. \n\nMy dude, our lawmakers are point blank. If govt asks for your device access, you gotta give it to them straight. Encryption, password be damned.\n\nThey made that a law.",
        "Amit malviya, u just got a life sentence.",
        "Govt will be building larger jails soon.",
        "I don't think u understand.\n\nUsing encrypted web communication isnt illegal so u can surf the web anon. They cannot stop u.\n\nThis along with VPNs effectively means u can spread whatever info u want and they won't even know which device is the source of the news.",
        "Well hello CNN...",
        "Reminds me of this:    \nhttps://xkcd.com/538/",
        "lol. straight up.\n\nThere is always an xkcd.",
        "It doesn't matter what kind of bills pass through if the enforcer of them i.e the Govt will only enforce them selectively.. If something like this becomes law, the Govt will use it against any media outlet that criticises them or shows them in a bad light and ignore their bootlickers that churn fake news everyday."
    ],
    "cleaned_text": "years jail spreading fake news says proposed criminal bill opinion ",
    "cleaned_title": "years jail spreading fake news says proposed criminal bill",
    "cleaned_selftext": "opinion",
    "cleaned_comments": "conditions apply rules apply opposing parties people amit malviya like ese bills ko hum apne pe rakhte hai amit malviya locked even said bill approved fake news pib says yep govt approved fact checkers allowed fact checkers deemed fake news government flag news fake goes agenda another step towards hindu rashtra tool misuse opponents impose hm cell coolies would behind bars another tool created randomly arrest people news approved ministry truth first government going never ever lose election come time come bite bum good whole rape crimes manipur conflict started fake news oye pols gayi pols meanwhile modi parliament ah yes fake newsthat government finds unpalatable literally every whatsapp uncle jail bill pertains regulation information effectively dead water moment conceived internet regulated even fascist anti freedom regime like ccp failed miserably hope anyone else information free dare deny great vikramadityas existence conquered world youre behind bars fake news spreader noooo happen cr self employed rs tweeterscommenters logic op india editors given life sentences use jail members government including pm hm constant lies deception amit malware ideally get life sentence lol mota rajan shah make exception let spread fake news like franklin roosevelt said may son bitch hes son bitch apply bhajpa workers aadhe bjp aur congress politicians jail hold party meetings jails ripe abuse misuse support govt would decide fake news lol could go wrong gand india transforming like china modi go jail illusion freedom controlled fascists waiting outside parliament dont see police yet must coming soon sabse pehla vishwaguru ko dalo sala demonetization ka sabse bada fake news racket chalaya usne got plan stay power forever new parliament information may free catch informer encryption exists using vpns isnt illegal think almost working dude lawmakers point blank govt asks device access got ta give straight encryption password damned made law amit malviya u got life sentence govt building larger jails soon dont think u understand using encrypted web communication isnt illegal u surf web anon stop u along vpns effectively means u spread whatever info u want wont even know device source news well hello cnn reminds lol straight always xkcd doesnt matter kind bills pass enforcer ie govt enforce selectively something like becomes law govt use media outlet criticises shows bad light ignore bootlickers churn fake news everyday",
    "light_cleaned_title": "3 Years Jail For Spreading Fake News, Says Proposed Criminal Bill",
    "light_cleaned_selftext": "What is your opinion on this?",
    "light_cleaned_comments": "*Conditions Apply Rules apply only for opposing parties and people Amit malviya be like : ese bills ko hum apne ***** pe rakhte hai Amit Malviya should be locked in even before the the said bill is approved And its a fake news if PIB says so... Yep! And only govt approved fact checkers allowed, all other fact checkers deemed as fake news… 🤐 Government can flag any news as fake if it goes against their agenda. Just another step towards Hindu Rashtra. This will be a tool for misuse against opponents. If they were to impose it the HM and his IT cell coolies would be behind bars too. another tool created to randomly arrest people .. And should the news be approved by the Ministry or Truth first? The government is going about it as if they will never ever lose an election from now. There will come a time when all this will come to bite them in the bum. Good. The whole rape crimes in Manipur conflict started because of fake news. Oye pols a gayi pols Meanwhile modi parliament - 🤡 Ah yes, \"fake news\"...that which the government finds unpalatable! Literally every WhatsApp uncle should be in jail then Any \"Bill\" that pertains to the regulation of information is effectively dead in the water the moment it is conceived. The internet will not and cannot be regulated. Even a fascist anti freedom regime like the CCP has failed miserably at that. What hope does anyone else have. Information is free. भारतीय न्यूज़ चैनलों के पेट पर लात? How dare you deny the great Vikramaditya's existence, he conquered 90% of the world! You're behind bars, fake news spreader! Noooo. Now what will happen to the 1 cr self employed 2rs tweeters/commenters? By this logic, OP India editors should be given 3 life sentences Can we use this to jail members of this government, including the PM and HM, for constant lies and deception? /s Amit Malware should ideally get life sentence under this, lol. But then, Mota Rajan (Shah) will make an exception for him and let him spread more fake news. Like Franklin D. Roosevelt once said, \"He may be a son of a bitch. But he's our son of a bitch.\" Does not apply for Bhajpa workers Aadhe BJP aur Congress politicians will be in jail then. then they have to hold party meetings in jails. Ripe for abuse and misuse. DO NOT SUPPORT And the Govt would decide what is a fake news :). Lol what could go wrong. Ga*nd Why is India transforming like china So Modi will go to jail? The illusion of freedom, controlled by fascists I am waiting outside the parliament don't see any police yet they must be coming soon. Sabse pehla Vishwaguru ko dalo, sala demonetization ka sabse bada fake news racket chalaya usne They got a plan to stay in power forever. the new parliament is all about it. information may be free. But this is to catch the informer themselves. This is why encryption exists. Using VPNs isn't illegal. i think it almost is. they are working on it. My dude, our lawmakers are point blank. If govt asks for your device access, you gotta give it to them straight. Encryption, password be damned. They made that a law. Amit malviya, u just got a life sentence. Govt will be building larger jails soon. I don't think u understand. Using encrypted web communication isnt illegal so u can surf the web anon. They cannot stop u. This along with VPNs effectively means u can spread whatever info u want and they won't even know which device is the source of the news. Well hello CNN... Reminds me of this: lol. straight up. There is always an xkcd. It doesn't matter what kind of bills pass through if the enforcer of them i.e the Govt will only enforce them selectively.. If something like this becomes law, the Govt will use it against any media outlet that criticises them or shows them in a bad light and ignore their bootlickers that churn fake news everyday."
}