{
    "id": "szaznu",
    "title": "Ragging is no more ? or is it ?",
    "url": "https://www.reddit.com/r/india/comments/szaznu/ragging_is_no_more_or_is_it/",
    "selftext": "So my college is about to begin in person classes and just today the whatsapp group was flooded with lots of messages regarding some apparent rules set by assh\\*les in 2nd,3rd and 4th year. (You'll see in a moment why I called them that) that we'd have to \"follow\" or else \"you know what they will do\". I asked that guy we made CR of our class and he said \"you will know what they will do once you come to the campus\".\n\n[List of their rules](https://preview.redd.it/8l62jm0t5jj81.png?width=376&amp;format=png&amp;auto=webp&amp;s=dc82f6d6ad51f27b3a398d3a94004176fa010ffd)\n\nMy college does have an anti-ragging cell. And I know the contact of the teacher in charge of that, what should I do ?\n\nThese rules btw, come in light of recent events : A guy from (1st year) some other department got drunk in front of the seniors and was like about to jump from the terrace. so now they are doing such stupid things to all the students of 1st year ?\n\nTheir f\\*cking dress code includes : no open neck t-shirts. I am a male and this is for boys. Like wtf do they have with open neck t shirts ? almost all my clothes are open neck. Also who the fuck are these assholes to decided what I wear or not wear ?\n\nAlso they want us to remember the names of all the senior CRs for some reason ? like why ? this is top level narcissism and the kids must be really f\\*cked up in their head.\n\nDoes this qualify as ragging ? FUCK THESE ASSHOLES\n\nEdit #1 : People think I am complaining about that no drink thing but I would like to clarify I am a teetotaler myself",
    "flair": "Rant / Vent",
    "score": 40,
    "num_comments": 40,
    "created_utc": 1645599451,
    "convurl": "https://b.thumbs.redditmedia.com/0d89zkCZOpsMW9r7ui_26C1c68wqMqBrTsULSytFmDM.jpg",
    "comments": [
        "I will agree with no drinking point but tell those fools to pay fees on your behalf since they don't own you, you have freedom. What's the teacher stance on this? And it's better to fight than Table No. 21 crap happening. And yea be careful since you are in minority plus every class has boot lickers who are gonna betray 1st year plans to takedown seniors itself",
        "like when my college had begun everyone had gotten an email form the chairperson of anti-ragging committee. And people have complained about the seniors in past as well. No teacher knows about it as of now. In that email from Chairman of Anti Ragging committee (he too is a professor from ETC department) he had said, \"avoid attending un-necessary meetings by seniors\"",
        "Some students had complained about some seniors like a month or two ago, some action was taken....so idk if the anti-ragging cell is completely corrupt",
        "remindme! in 1 hour",
        "I will be messaging you in 1 hour on [**2022-02-23 10:22:18 UTC**](http://www.wolframalpha.com/input/?i=2022-02-23%2010:22:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/szaznu/ragging_is_no_more_or_is_it/hy2xhpr/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2Fszaznu%2Fragging_is_no_more_or_is_it%2Fhy2xhpr%2F%5D%0A%0ARemindMe%21%202022-02-23%2010%3A22%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20szaznu)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "hmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm",
        "I hate to say this - but - first-year undergrads in college think they know everything and can get away with being brash just because they’re in college. \n\nTrust me kid, you wouldn’t survive with this attitude in college had this been 2005. \n\nThis is not ragging. \n\nI agree with 1 and 7 - idiots get drunk as fuck and then do shit that makes other drinkers embarrassed. Also, you’re probably not of legal age to even drink. That guy had no fuckin clue about the kind of risk he posed to folks around him - had he gone ahead and done something stupid while drunk, his seniors would be on the hook. \n\nI highly recommend growing a thick skin when you’re in college.",
        "I am not upset about the drinking thing, I am a teetotaler myself. I don't gib a fuck whether someone drinks or not",
        "Bro here needs to measure diameter of college ground with pencil for using profanity towards seniors.\\\\s",
        "LOL, enjoy engg life dude",
        "It is ragging. Do not fall into the peer pressure to drink though.\n\nDo not back down. Anticipate when they would try to pull that intro shit and keep your phone voice recording on. In my college, only the people who bent were even ragged.\n\nYou will find some genuine seniors who don't do this intro crap. Anyone who says that this intro crap is to build character is being disingenuous. It is mostly egotistical seniors who won't tolerate their same arrogant tone thrown back at them. \n\nDon't stand for that crap and don't do the same to your juniors. Those seniors fear for their careers too. The complaint can also be done in a police station, but they probably would not push you enough to do that.",
        "YO",
        "bruh it was bot command, also if there political connected or rich kids , keep your head down ,\n\nif not , dont go asking for trouble unless they target you",
        "Same rules at my college 🤷‍♀️ parents say \"just bear with it, what can you do\", teachers joke about it, seniors go \"this is not ragging, this is just interaction, we're preparing you for the real world\" and we go \"yeah, sucks but pretty much expected, could be worse\"\n\nRemembering the names of every senior is the WORST though I've been here for a year and I'm still struggling to remember the names and faces of half my own classmates, I'm pretty bad at that\n\nKinda sucks that as soon as the whole ragging thing became toned down from the severe, news headline making stuff, everyone just acts like it's part of college culture instead of removing it all together",
        "remindme! In 30 years",
        "I will be messaging you in 30 years on [**2052-02-23 13:45:20 UTC**](http://www.wolframalpha.com/input/?i=2052-02-23%2013:45:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/szaznu/ragging_is_no_more_or_is_it/hy3kapv/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2Fszaznu%2Fragging_is_no_more_or_is_it%2Fhy3kapv%2F%5D%0A%0ARemindMe%21%202052-02-23%2013%3A45%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20szaznu)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "what if OP himself maybe political connection but not rich kid also what if OP knows rich kid ?",
        "I hate the kinda parents who say just bear with it. UGC needs to update its guidelines.",
        "This is not my first time in a hostel. I have been in hostel in the past during JEE preparation",
        "Tbh it's the only thing they can do cause the parents of some kids complained and the kids got into trouble for that because the seniors have setting with the administration staff",
        "O\\_O",
        "Tweet this to some govt handle, add the college name here, buggers don't even know how to wear a tie yet ask freshers to follow such draconian rules...\nRest assured any restrictions imposed to affect mental well being can be a criminal offence. You need not worry kid if they look too intimidating file an fir",
        "yeah which police station in India would be willing to file an FIR related to a criminal offence affecting mental health ? If I mention the college name, kids in my class would consider me a rat ; in fact, a few of them are reddittors even",
        "Best, I think I could do is approach the anti-ragging squad but if things get worse then I'd have to approach the police, with a good lawyer because under normal circumstances they'd just brush it off even though every kid has to sign an affidavit saying that they'd abide by UGC guidelines and yes you are probably right that this must be violation of some UGC guideline",
        "The intro part sounds as hazing to me, and trust me authorities do take this shit seriously.\nOn a rather unrelated note, hazing sounds pathetic...and rather cowardly ...and this is coming from someone who worked in paramilitary. We had hazing in our days but all my seniors later regretted doing that..",
        "yep, I think so too. Like they have a proper format for their intro part and like as per their \"rules\" we had to send our immediate correspondents (kids who are just 1 year senior to us but same roll number in same department) an email in that intro format. We had to do this like 2 months ago, I hadn't done it but today scared of ragging and stuff I did send the email and that guy's reply at like 7-8PM was are you in the campus ? so yeah sounds like a plan for hazing. Luckily I am not in the college campus rn.\n\nAnd even when I get there, I have just decided to ignore all of their bullshit. I am not bragging or anything but I am more interested in my studies and get lost in them so I wouldn't get time to play fodder for their little ego satisfying activities.",
        "But what about other kids ratting me out ? like the seniors specifically targetting me if I complain to the authorities ? the authorities do say that they will maintain anonymity (the prof in charge is a younger guy than the rest older boomer folks) if someone comes forward with a complaint from their academic email id.",
        "Bro, complain directly to the anti ragging cell of HRD ministry anonymously. They view ragging very seriously and immediate action will be taken. Complaining to the college anti ragging cell will only get you to be targeted by seniors and batchmates alike.",
        "&gt;anti ragging cell of HRD ministry \n\nwdym ? could you give me a link to the website of this cell/committee you are talking about ?",
        "Laughable. You don't have to follow anything except the non-drinking one coz that's the only one they can actually do something about (rat on you). Finished my college 2 years ago, can say with guarantee seniors hold no real power over you, there isn't shit they can do (In engineering. Medical colleges operate under different circumstances as I've heard). Chill out man, live as you like.",
        "Lol. Idk which college you went to but seriously, you actually believe seniors can make a students life difficult?? Also, CR is nothing but a glorified teachers pet. If you did follow through similar rules then I hate to say it but man you're the worst pushover ever.",
        "Terrace not allowed is quite common coz some people try to suicide from what I've heard.",
        "&gt; Do not drink\n\n&gt; Sports banned\n\nWhat kinda boring sanghi seniors are these",
        "okie thanks, I have decided already to not gib a f\\*ck about them and besides I am a teetotaler",
        "Most hardcore kind it seems, my own class has like 15-20 hardcore sanghi Gen Zs out of 68 students",
        "well if you'd have read the whole post you'd come to know that one stupid idiot was about to do that precisely while drunk hence that rule",
        "What is your point?",
        "&gt;some people try to suicide from what I've heard.\n\nwhen in my post I had mentioned :\n\n&gt;A guy from (1st year) some other department got drunk in front of the seniors and was like about to jump from the terrace.",
        "Yes, your post talks of your college not all colleges in general like my reply does.",
        "Op can you give us an update what happened",
        "Yeah it's like the students can't do shit about it even if they ate severely damaged (emotionally)",
        "Pls provide link. And can we do it anonymously?",
        "That's the thing.. when u're new to a college you don't know who to trust and whom to not so it's hard to figure out what to do in a situation like this since it can backfire on you.\n\nIn my institute, if u speak anything about a senior ragging to a professor and if that professor actually supports ragging which more than half of profs in our clg do then he'll just tell that senior that you told on him and then you're fucked again. \n\nI just got ragged yesterday and I don't know what to do other than talk to some trusted seniors.. so i talked to them and they said that FIRs se bhi farak nhi padta... I was like WTF?? And the last year students don't voluntarily rag juniors bcoz they know that they will be at a risk just before getting the degree and moving out.\n\nI cried today morning knowing that I was ragged yesterday and it's hard man. Ppl study for 2-3 some even more to come to this shit... And the thing u said that seniors can't make ur life shit... I didn't understand how that is true.. they can pressurize u to do things na. Pls explain how to not be bothered by the seniors... And yes we also have an intro and we hv to greet every senior every single fucking time we see them. Fucking hell.",
        "Yes pls"
    ],
    "cleaned_text": "ragging college begin person classes today whatsapp group flooded lots messages regarding apparent rules set asshles ndrd th year youll see moment called wed follow else know asked guy made cr class said know come campus list ruleshttpspreviewredditljmtjjpngwidthampformatpngampautowebpampsdcfdadfbadafaffd college antiragging cell know contact teacher charge rules btw come light recent events guy st year department got drunk front seniors like jump terrace stupid things students st year fcking dress code includes open neck tshirts male boys like wtf open neck shirts almost clothes open neck also fuck assholes decided wear wear also want us remember names senior crs reason like top level narcissism kids must really fcked head qualify ragging fuck assholes edit people think complaining drink thing would like clarify teetotaler ",
    "cleaned_title": "ragging",
    "cleaned_selftext": "college begin person classes today whatsapp group flooded lots messages regarding apparent rules set asshles ndrd th year youll see moment called wed follow else know asked guy made cr class said know come campus list ruleshttpspreviewredditljmtjjpngwidthampformatpngampautowebpampsdcfdadfbadafaffd college antiragging cell know contact teacher charge rules btw come light recent events guy st year department got drunk front seniors like jump terrace stupid things students st year fcking dress code includes open neck tshirts male boys like wtf open neck shirts almost clothes open neck also fuck assholes decided wear wear also want us remember names senior crs reason like top level narcissism kids must really fcked head qualify ragging fuck assholes edit people think complaining drink thing would like clarify teetotaler",
    "cleaned_comments": "agree drinking point tell fools pay fees behalf since dont freedom whats teacher stance better fight table crap happening yea careful since minority plus every class boot lickers gon na betray st year plans takedown seniors like college begun everyone gotten email form chairperson antiragging committee people complained seniors past well teacher knows email chairman anti ragging committee professor etc department said avoid attending unnecessary meetings seniors students complained seniors like month two ago action takenso idk antiragging cell completely corrupt remindme hour messaging hour utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsszaznuraggingisnomoreorisithyxhprcontext click linkhttpswwwredditcommessagecomposetoremindmebotampsubjectreminderampmessagebhttpsaffwwwredditcomfrfindiafcommentsfszaznufraggingisnomoreorisitfhyxhprfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotampsubjectdeletecommentampmessagedeleteszaznu infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotampsubjectreminderampmessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotampsubjectlistofremindersampmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulampsubjectremindmebotfeedback hmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm hate say firstyear undergrads college think know everything get away brash theyre college trust kid wouldnt survive attitude college ragging agree idiots get drunk fuck shit makes drinkers embarrassed also youre probably legal age even drink guy fuckin clue kind risk posed folks around gone ahead done something stupid drunk seniors would hook highly recommend growing thick skin youre college upset drinking thing teetotaler dont gib fuck whether someone drinks bro needs measure diameter college ground pencil using profanity towards seniorss lol enjoy engg life dude ragging fall peer pressure drink though back anticipate would try pull intro shit keep phone voice recording college people bent even ragged find genuine seniors dont intro crap anyone says intro crap build character disingenuous mostly egotistical seniors wont tolerate arrogant tone thrown back dont stand crap dont juniors seniors fear careers complaint also done police station probably would push enough yo bruh bot command also political connected rich kids keep head dont go asking trouble unless target rules college parents say bear teachers joke seniors go ragging interaction preparing real world go yeah sucks pretty much expected could worse remembering names every senior worst though ive year im still struggling remember names faces half classmates im pretty bad kinda sucks soon whole ragging thing became toned severe news headline making stuff everyone acts like part college culture instead removing together remindme years messaging years utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsszaznuraggingisnomoreorisithykapvcontext click linkhttpswwwredditcommessagecomposetoremindmebotampsubjectreminderampmessagebhttpsaffwwwredditcomfrfindiafcommentsfszaznufraggingisnomoreorisitfhykapvfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotampsubjectdeletecommentampmessagedeleteszaznu infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotampsubjectreminderampmessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotampsubjectlistofremindersampmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulampsubjectremindmebotfeedback op maybe political connection rich kid also op knows rich kid hate kinda parents say bear ugc needs update guidelines first time hostel hostel past jee preparation tbh thing cause parents kids complained kids got trouble seniors setting administration staff oo tweet govt handle add college name buggers dont even know wear tie yet ask freshers follow draconian rules rest assured restrictions imposed affect mental well criminal offence need worry kid look intimidating file fir yeah police station india would willing file fir related criminal offence affecting mental health mention college name kids class would consider rat fact reddittors even best think could approach antiragging squad things get worse id approach police good lawyer normal circumstances theyd brush even though every kid sign affidavit saying theyd abide ugc guidelines yes probably right must violation ugc guideline intro part sounds hazing trust authorities take shit seriously rather unrelated note hazing sounds patheticand rather cowardly coming someone worked paramilitary hazing days seniors later regretted yep think like proper format intro part like per rules send immediate correspondents kids year senior us roll number department email intro format like months ago hadnt done today scared ragging stuff send email guys reply like pm campus yeah sounds like plan hazing luckily college campus rn even get decided ignore bullshit bragging anything interested studies get lost wouldnt get time play fodder little ego satisfying activities kids ratting like seniors specifically targetting complain authorities authorities say maintain anonymity prof charge younger guy rest older boomer folks someone comes forward complaint academic email id bro complain directly anti ragging cell hrd ministry anonymously view ragging seriously immediate action taken complaining college anti ragging cell get targeted seniors batchmates alike gtanti ragging cell hrd ministry wdym could give link website cellcommittee talking laughable dont follow anything except nondrinking one coz thats one actually something rat finished college years ago say guarantee seniors hold real power isnt shit engineering medical colleges operate different circumstances ive heard chill man live like lol idk college went seriously actually believe seniors make students life difficult also cr nothing glorified teachers pet follow similar rules hate say man youre worst pushover ever terrace allowed quite common coz people try suicide ive heard gt drink gt sports banned kinda boring sanghi seniors okie thanks decided already gib fck besides teetotaler hardcore kind seems class like hardcore sanghi gen zs students well youd read whole post youd come know one stupid idiot precisely drunk hence rule point gtsome people try suicide ive heard post mentioned gta guy st year department got drunk front seniors like jump terrace yes post talks college colleges general like reply op give us update happened yeah like students cant shit even ate severely damaged emotionally pls provide link anonymously thats thing ure new college dont know trust hard figure situation like since backfire institute u speak anything senior ragging professor professor actually supports ragging half profs clg hell tell senior told youre fucked got ragged yesterday dont know talk trusted seniors talked said firs se bhi farak nhi padta like wtf last year students dont voluntarily rag juniors bcoz know risk getting degree moving cried today morning knowing ragged yesterday hard man ppl study even come shit thing u said seniors cant make ur life shit didnt understand true pressurize u things na pls explain bothered seniors yes also intro hv greet every senior every single fucking time see fucking hell yes pls",
    "light_cleaned_title": "Ragging is no more ? or is it ?",
    "light_cleaned_selftext": "So my college is about to begin in person classes and just today the whatsapp group was flooded with lots of messages regarding some apparent rules set by assh\\*les in 2nd,3rd and 4th year. (You'll see in a moment why I called them that) that we'd have to \"follow\" or else \"you know what they will do\". I asked that guy we made CR of our class and he said \"you will know what they will do once you come to the campus\". [List of their rules](https://preview.redd.it/8l62jm0t5jj81.png?width=376&amp;format=png&amp;auto=webp&amp;s=dc82f6d6ad51f27b3a398d3a94004176fa010ffd) My college does have an anti-ragging cell. And I know the contact of the teacher in charge of that, what should I do ? These rules btw, come in light of recent events : A guy from (1st year) some other department got drunk in front of the seniors and was like about to jump from the terrace. so now they are doing such stupid things to all the students of 1st year ? Their f\\*cking dress code includes : no open neck t-shirts. I am a male and this is for boys. Like wtf do they have with open neck t shirts ? almost all my clothes are open neck. Also who the fuck are these assholes to decided what I wear or not wear ? Also they want us to remember the names of all the senior CRs for some reason ? like why ? this is top level narcissism and the kids must be really f\\*cked up in their head. Does this qualify as ragging ? FUCK THESE ASSHOLES Edit #1 : People think I am complaining about that no drink thing but I would like to clarify I am a teetotaler myself",
    "light_cleaned_comments": "I will agree with no drinking point but tell those fools to pay fees on your behalf since they don't own you, you have freedom. What's the teacher stance on this? And it's better to fight than Table No. 21 crap happening. And yea be careful since you are in minority plus every class has boot lickers who are gonna betray 1st year plans to takedown seniors itself like when my college had begun everyone had gotten an email form the chairperson of anti-ragging committee. And people have complained about the seniors in past as well. No teacher knows about it as of now. In that email from Chairman of Anti Ragging committee (he too is a professor from ETC department) he had said, \"avoid attending un-necessary meetings by seniors\" Some students had complained about some seniors like a month or two ago, some action was taken....so idk if the anti-ragging cell is completely corrupt remindme! in 1 hour I will be messaging you in 1 hour on [**2022-02-23 10:22:18 UTC**](http://www.wolframalpha.com/input/?i=2022-02-23%2010:22:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/szaznu/ragging_is_no_more_or_is_it/hy2xhpr/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2Fszaznu%2Fragging_is_no_more_or_is_it%2Fhy2xhpr%2F%5D%0A%0ARemindMe%21%202022-02-23%2010%3A22%3A18%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20szaznu) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)| |-|-|-|-| hmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm I hate to say this - but - first-year undergrads in college think they know everything and can get away with being brash just because they’re in college. Trust me kid, you wouldn’t survive with this attitude in college had this been 2005. This is not ragging. I agree with 1 and 7 - idiots get drunk as fuck and then do shit that makes other drinkers embarrassed. Also, you’re probably not of legal age to even drink. That guy had no fuckin clue about the kind of risk he posed to folks around him - had he gone ahead and done something stupid while drunk, his seniors would be on the hook. I highly recommend growing a thick skin when you’re in college. I am not upset about the drinking thing, I am a teetotaler myself. I don't gib a fuck whether someone drinks or not Bro here needs to measure diameter of college ground with pencil for using profanity towards seniors.\\\\s LOL, enjoy engg life dude It is ragging. Do not fall into the peer pressure to drink though. Do not back down. Anticipate when they would try to pull that intro shit and keep your phone voice recording on. In my college, only the people who bent were even ragged. You will find some genuine seniors who don't do this intro crap. Anyone who says that this intro crap is to build character is being disingenuous. It is mostly egotistical seniors who won't tolerate their same arrogant tone thrown back at them. Don't stand for that crap and don't do the same to your juniors. Those seniors fear for their careers too. The complaint can also be done in a police station, but they probably would not push you enough to do that. YO bruh it was bot command, also if there political connected or rich kids , keep your head down , if not , dont go asking for trouble unless they target you Same rules at my college 🤷‍♀️ parents say \"just bear with it, what can you do\", teachers joke about it, seniors go \"this is not ragging, this is just interaction, we're preparing you for the real world\" and we go \"yeah, sucks but pretty much expected, could be worse\" Remembering the names of every senior is the WORST though I've been here for a year and I'm still struggling to remember the names and faces of half my own classmates, I'm pretty bad at that Kinda sucks that as soon as the whole ragging thing became toned down from the severe, news headline making stuff, everyone just acts like it's part of college culture instead of removing it all together remindme! In 30 years I will be messaging you in 30 years on [**2052-02-23 13:45:20 UTC**](http://www.wolframalpha.com/input/?i=2052-02-23%2013:45:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/szaznu/ragging_is_no_more_or_is_it/hy3kapv/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2Fszaznu%2Fragging_is_no_more_or_is_it%2Fhy3kapv%2F%5D%0A%0ARemindMe%21%202052-02-23%2013%3A45%3A20%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20szaznu) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)| |-|-|-|-| what if OP himself maybe political connection but not rich kid also what if OP knows rich kid ? I hate the kinda parents who say just bear with it. UGC needs to update its guidelines. This is not my first time in a hostel. I have been in hostel in the past during JEE preparation Tbh it's the only thing they can do cause the parents of some kids complained and the kids got into trouble for that because the seniors have setting with the administration staff O\\_O Tweet this to some govt handle, add the college name here, buggers don't even know how to wear a tie yet ask freshers to follow such draconian rules... Rest assured any restrictions imposed to affect mental well being can be a criminal offence. You need not worry kid if they look too intimidating file an fir yeah which police station in India would be willing to file an FIR related to a criminal offence affecting mental health ? If I mention the college name, kids in my class would consider me a rat ; in fact, a few of them are reddittors even Best, I think I could do is approach the anti-ragging squad but if things get worse then I'd have to approach the police, with a good lawyer because under normal circumstances they'd just brush it off even though every kid has to sign an affidavit saying that they'd abide by UGC guidelines and yes you are probably right that this must be violation of some UGC guideline The intro part sounds as hazing to me, and trust me authorities do take this shit seriously. On a rather unrelated note, hazing sounds pathetic...and rather cowardly ...and this is coming from someone who worked in paramilitary. We had hazing in our days but all my seniors later regretted doing that.. yep, I think so too. Like they have a proper format for their intro part and like as per their \"rules\" we had to send our immediate correspondents (kids who are just 1 year senior to us but same roll number in same department) an email in that intro format. We had to do this like 2 months ago, I hadn't done it but today scared of ragging and stuff I did send the email and that guy's reply at like 7-8PM was are you in the campus ? so yeah sounds like a plan for hazing. Luckily I am not in the college campus rn. And even when I get there, I have just decided to ignore all of their bullshit. I am not bragging or anything but I am more interested in my studies and get lost in them so I wouldn't get time to play fodder for their little ego satisfying activities. But what about other kids ratting me out ? like the seniors specifically targetting me if I complain to the authorities ? the authorities do say that they will maintain anonymity (the prof in charge is a younger guy than the rest older boomer folks) if someone comes forward with a complaint from their academic email id. Bro, complain directly to the anti ragging cell of HRD ministry anonymously. They view ragging very seriously and immediate action will be taken. Complaining to the college anti ragging cell will only get you to be targeted by seniors and batchmates alike. &gt;anti ragging cell of HRD ministry wdym ? could you give me a link to the website of this cell/committee you are talking about ? Laughable. You don't have to follow anything except the non-drinking one coz that's the only one they can actually do something about (rat on you). Finished my college 2 years ago, can say with guarantee seniors hold no real power over you, there isn't shit they can do (In engineering. Medical colleges operate under different circumstances as I've heard). Chill out man, live as you like. Lol. Idk which college you went to but seriously, you actually believe seniors can make a students life difficult?? Also, CR is nothing but a glorified teachers pet. If you did follow through similar rules then I hate to say it but man you're the worst pushover ever. Terrace not allowed is quite common coz some people try to suicide from what I've heard. &gt; Do not drink &gt; Sports banned What kinda boring sanghi seniors are these okie thanks, I have decided already to not gib a f\\*ck about them and besides I am a teetotaler Most hardcore kind it seems, my own class has like 15-20 hardcore sanghi Gen Zs out of 68 students well if you'd have read the whole post you'd come to know that one stupid idiot was about to do that precisely while drunk hence that rule What is your point? &gt;some people try to suicide from what I've heard. when in my post I had mentioned : &gt;A guy from (1st year) some other department got drunk in front of the seniors and was like about to jump from the terrace. Yes, your post talks of your college not all colleges in general like my reply does. Op can you give us an update what happened Yeah it's like the students can't do shit about it even if they ate severely damaged (emotionally) Pls provide link. And can we do it anonymously? That's the thing.. when u're new to a college you don't know who to trust and whom to not so it's hard to figure out what to do in a situation like this since it can backfire on you. In my institute, if u speak anything about a senior ragging to a professor and if that professor actually supports ragging which more than half of profs in our clg do then he'll just tell that senior that you told on him and then you're fucked again. I just got ragged yesterday and I don't know what to do other than talk to some trusted seniors.. so i talked to them and they said that FIRs se bhi farak nhi padta... I was like WTF?? And the last year students don't voluntarily rag juniors bcoz they know that they will be at a risk just before getting the degree and moving out. I cried today morning knowing that I was ragged yesterday and it's hard man. Ppl study for 2-3 some even more to come to this shit... And the thing u said that seniors can't make ur life shit... I didn't understand how that is true.. they can pressurize u to do things na. Pls explain how to not be bothered by the seniors... And yes we also have an intro and we hv to greet every senior every single fucking time we see them. Fucking hell. Yes pls"
}