{
    "id": "ks78s3",
    "title": "Bridge the #DigitalDivide: On chronic inequalities in internet access",
    "url": "https://www.reddit.com/r/india/comments/ks78s3/bridge_the_digitaldivide_on_chronic_inequalities/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/jq5curfwqu961.png?width=1600&amp;format=png&amp;auto=webp&amp;s=6a23273ade445a3d1c6992f2f9cb9cb17df87760\n\n## Tl;dr\n\nIn a first, the[ **National Family Health Survey**](http://rchiips.org/NFHS/NFHS-5_FCTS/NFHS-5%20State%20Factsheet%20Compendium_Phase-I.pdf) recorded the percentage of men and women who have ever used the internet from 3.07 lacs households across 17 states and 5 union territories. The Survey revealed that, while internet penetration in the country is rising, a persistent digital divide still remains due to factors such as gender gaps and the rural-urban divide.\n\n## State of access to digital infrastructure\n\nAs of 2019, out of 5,97,618 inhabited villages, [**5,69,897 are covered by mobile services**](http://164.100.24.220/loksabhaquestions/annex/173/AS245.pdf). Furthermore, 1,50,029 gram panchayats have been connected by the BharatNet Project, out of which 1,36,693 have been made service ready. As per TRAI’s [**Yearly Performance Indicators Report for 2019**](https://www.trai.gov.in/sites/default/files/YIR_25112020_0.pdf), India had 718.74 million internet subscribers as of 31st December 2019, an increase of 18.95% over the 604.21 million subscribers in 2018. Internet subscriptions in rural India amounted to 268.43 million - about 60% of the total of internet subscriptions in urban India, 450.21 million. As was widely expected, Indians access the internet overwhelmingly (96%) through mobile devices.\n\nThe [**Indian Telecom Services Performance Indicators report for April – June, 2020**](https://www.trai.gov.in/sites/default/files/Report_09112020_0.pdf) showed that in June 2020, the number of internet subscribers increased to 749.07 million, a 0.79% increase over the previous quarter, and a 4.2% increase over December 2019. The number of urban and rural subscribers increased to 455.98 million and 293.09 million respectively. The least number of internet subscriptions were in Himachal Pradesh (6.08 million), Jammu and Kashmir (7.50 million), and the North East service area (7.53 million). Overall internet tele-density (the number of internet subscribers per 100 persons) increased to 55.41 (2.1% increase from December 2019), with rural and urban internet tele-densities at 33.00 and 98.35 respectively (10.6% and -7.4% change respectively with respect to December 2019).\n\nThe table below displays the monthly growth of broadband subscribers in 2020 based on TRAI’s [**monthly subscription reports**](https://www.trai.gov.in/release-publication/reports/telecom-subscriptions-reports).\n\n&amp;#x200B;\n\n[Internet Broadband \\(≥ 512 Kbps download speed\\) in 2020](https://preview.redd.it/g3gn1uoyqu961.png?width=504&amp;format=png&amp;auto=webp&amp;s=d4c60e16a35d7f532b7ab27b228b5c991dacc98c)\n\n## Gaps in availability persist\n\nThus, while the data does show that on the whole access to digital infrastructure is increasing, significant digital disparities still remain. These figures highlight the rural-urban divide in terms of access to the internet, with the number of rural subscribers, despite making up a significant majority of the population, being only 64% of the number of urban subscribers. Rural internet density is also at about a third of urban internet density. Clearly, large strides must still be made to reduce rural-urban differentials.\n\nOther imbalances are also visible. The stark gender based polarities in access to internet service can be seen through data compiled from the National Family Health Survey by Indiaspend.  Their [**report**](https://www.indiaspend.com/gendercheck/4-in-5-bihar-women-have-never-used-the-internet-702855) indicates that in eight states and two union territories - Bihar (20.6%), Andhra Pradesh (21.0%), Tripura (22.9%), West Bengal (25.5%), Telangana (26.5%), Assam (28.2%), Gujarat (30.8%), Meghalaya (34.7%), Andaman &amp; Nicobar Islands (34.8%), Karnataka (35.0%), and Dadra &amp; Nagar Haveli and Daman &amp; Diu (36.7%) - less than 40 percent women have used the internet. Comparatively, in the same states, more than 40% men have used the internet. In only three states and one union territory did more than 50% women from rural areas ackowledge to have used the internet - Goa (%), Kerala (57.5%), Sikkim (68.1%), and Ladakh (54%).\n\nMeanwhile, there were only 6 states and 1 union territory - Meghalaya (42.1%), Assam (42.3%), Bihar (43.6%), Tripura (45.7%), Andaman and Nicobar Islands (46.5%), West Bengal (46.7%), and Andhra Pradesh (48.8%)  - in which less than 50% of the men had used the internet. Even in states with low overall internet penetration such as Bihar, the percentage of women who have used the internet was less than half of that of men.\n\nFurthermore, these figures do not help in providing a full picture. The survey only measured if a person had *ever* used the internet, and did not collect details about the availability of internet services or the regularity of their usage. Thus, while the survey shows awareness about the internet, it does not necessarily cover the actual usage of the internet, and so actual digital divides may be larger.\n\n## Evidence from the field\n\nConversations we've had with people have also revealed that even where improvements are taking place, several impediments and disruptions plague service delivery. Consider the case of the Andaman and Nicobar Islands. In June last year, [**issues with internet access in the islands**](https://internetfreedom.in/for-the-people-of-andaman-nicobar-islands-4g-internet-at-reasonable-tariffs-is-still-a-dream/) were brought to our notice. Subsequently, we helped the people of the islands write to the [**PMO, the DoT**](https://internetfreedom.in/we-wrote-to-the-pmo-dot-on-the-access-to-internet-issue-which-is-persisting-in-the-andaman-nicobar-islands/) and to [**MP Kuldeep Rai Sharma**](https://internetfreedom.in/the-fight-for-fast-and-affordable-internet-in-andaman-nicobar-islands-continues/). These efforts bore fruit in August, when the Prime Minister inaugurated the Chennai and Andaman &amp; Nicobar Islands (CANI) Submarine Cable Systems Project.\n\nRecently, we decided to speak to stakeholders in the Andaman and Nicobar Islands we'd reached out to earlier. They said that while some baseline level of access had indeed been established, several problems remained. One significant issue seemed to be the exorbitant tariff rates, as even the best plan ( that anyways delivered a slow-to-medium speed at a monthly data cap) would cost 2-3 times the tariff for 5G unlimited plans in other areas of the country. In an economy devastated by the pandemic, this has led to many people discontinuing their internet connections. The connection has also been erratic, with some people reporting multiple days without the internet. Lastly, there have been informal reports about the governemnt planning to shift the burden of providing high speed internet onto private companies. Stakeholders indicated that such a move might prove to be detrimental, since private telecom service providers would be more likely to shift the high entry costs onto the users.\n\n## Steps taken\n\nUltimately, efforts to improve and expand India's digital infrastructure must be ramped up. Such a task has been made paramount due to the Covid-19 pandemic, which has, in all likelihood, increased inequalities in access to the internet. In this light, the Department of Telecommunications' PM WANI scheme seems to be a good move *prima facie.* The scheme aims to set up public wifi hotspots throughout the country in a decentralised manner through Public Data Offices which provide wifi services locally. We will put out an explainer describing and analysing the scheme in the coming days.\n\n## Important Documents\n\n1. IndiaSpend's article  '4 In 5 Bihar Women Have Never Used The Internet' ([**link**](https://www.indiaspend.com/gendercheck/4-in-5-bihar-women-have-never-used-the-internet-702855))\n2. Representation to PMO and DoT on the CANI Project in Andaman &amp; Nicobar Islands for 4G Internet Access dated June 26, 2020 ([**link**](https://drive.google.com/file/d/1YB3BEiFNiCQdnf7tptQcnQW_slEkcWjA/view?usp=sharing))\n3. Letter to Shri Kuldeep Rai Sharma on the CANI Project dated July 25, 2020 ([**link**](https://drive.google.com/file/d/1N0L4inmL8he6VzZl6NtNYBiM9pCUCBtE/view?usp=sharing))\n4. Representation to the DoT on Internet Access issues in Odisha dated September 8, 2020 ([**link**](https://drive.google.com/file/d/184IjztlGMbgp5_ETVh2RzVERyPqgFerk/view?usp=sharing))\n\n*\\* This post was written with significant contributions from Anushree Verma, a 3rd year student of law at NALSAR University of Law, Hyderabad.*",
    "flair": "Policy/Economy",
    "score": 10,
    "num_comments": 0,
    "created_utc": 1610000005,
    "convurl": "https://b.thumbs.redditmedia.com/dHuYh2pTAfBtdOeGzSCIAASCYZVxFJSvbm_o7RpvOEA.jpg",
    "comments": [],
    "cleaned_text": "bridge digitaldivide chronic inequalities internet access ampxb tldr first national family health surveyhttprchiipsorgnfhsnfhsfctsnfhsstatefactsheetcompendiumphaseipdf recorded percentage men women ever used internet lacs households across states union territories survey revealed internet penetration country rising persistent digital divide still remains due factors gender gaps ruralurban divide state access digital infrastructure inhabited villages covered mobile serviceshttploksabhaquestionsannexaspdf furthermore gram panchayats connected bharatnet project made service ready per trais yearly performance indicators report httpswwwtraigovinsitesdefaultfilesyirpdf india million internet subscribers st december increase million subscribers internet subscriptions rural india amounted million total internet subscriptions urban india million widely expected indians access internet overwhelmingly mobile devices indian telecom services performance indicators report april june httpswwwtraigovinsitesdefaultfilesreportpdf showed june number internet subscribers increased million increase previous quarter increase december number urban rural subscribers increased million million respectively least number internet subscriptions himachal pradesh million jammu kashmir million north east service area million overall internet teledensity number internet subscribers per persons increased increase december rural urban internet teledensities respectively change respectively respect december table displays monthly growth broadband subscribers based trais monthly subscription reportshttpswwwtraigovinreleasepublicationreportstelecomsubscriptionsreports ampxb internet broadband kbps download speed httpspreviewredditggnuoyqupngwidthampformatpngampautowebpampsdceadfbabbbcdaccc gaps availability persist thus data show whole access digital infrastructure increasing significant digital disparities still remain figures highlight ruralurban divide terms access internet number rural subscribers despite making significant majority population number urban subscribers rural internet density also third urban internet density clearly large strides must still made reduce ruralurban differentials imbalances also visible stark gender based polarities access internet service seen data compiled national family health survey indiaspend reporthttpswwwindiaspendcomgendercheckinbiharwomenhaveneverusedtheinternet indicates eight states two union territories bihar andhra pradesh tripura west bengal telangana assam gujarat meghalaya andaman amp nicobar islands karnataka dadra amp nagar haveli daman amp diu less percent women used internet comparatively states men used internet three states one union territory women rural areas ackowledge used internet goa kerala sikkim ladakh meanwhile states union territory meghalaya assam bihar tripura andaman nicobar islands west bengal andhra pradesh less men used internet even states low overall internet penetration bihar percentage women used internet less half men furthermore figures help providing full picture survey measured person ever used internet collect details availability internet services regularity usage thus survey shows awareness internet necessarily cover actual usage internet actual digital divides may larger evidence field conversations weve people also revealed even improvements taking place several impediments disruptions plague service delivery consider case andaman nicobar islands june last year issues internet access islandshttpsinternetfreedominforthepeopleofandamannicobarislandsginternetatreasonabletariffsisstilladream brought notice subsequently helped people islands write pmo dothttpsinternetfreedominwewrotetothepmodotontheaccesstointernetissuewhichispersistingintheandamannicobarislands mp kuldeep rai sharmahttpsinternetfreedominthefightforfastandaffordableinternetinandamannicobarislandscontinues efforts bore fruit august prime minister inaugurated chennai andaman amp nicobar islands cani submarine cable systems project recently decided speak stakeholders andaman nicobar islands wed reached earlier said baseline level access indeed established several problems remained one significant issue seemed exorbitant tariff rates even best plan anyways delivered slowtomedium speed monthly data cap would cost times tariff g unlimited plans areas country economy devastated pandemic led many people discontinuing internet connections connection also erratic people reporting multiple days without internet lastly informal reports governemnt planning shift burden providing high speed internet onto private companies stakeholders indicated move might prove detrimental since private telecom service providers would likely shift high entry costs onto users steps taken ultimately efforts improve expand indias digital infrastructure must ramped task made paramount due covid pandemic likelihood increased inequalities access internet light department telecommunications pm wani scheme seems good move prima facie scheme aims set public wifi hotspots throughout country decentralised manner public data offices provide wifi services locally put explainer describing analysing scheme coming days important documents indiaspends article bihar women never used internet linkhttpswwwindiaspendcomgendercheckinbiharwomenhaveneverusedtheinternet representation pmo dot cani project andaman amp nicobar islands g internet access dated june linkhttpsdrivegooglecomfiledybbeifnicqdnftptqcnqwslekcwjaviewuspsharing letter shri kuldeep rai sharma cani project dated july linkhttpsdrivegooglecomfilednlinmlhevzzlntnybimpcucbteviewuspsharing representation dot internet access issues odisha dated september linkhttpsdrivegooglecomfiledijztlgmbgpetvhrzverypqgferkviewuspsharing post written significant contributions anushree verma rd year student law nalsar university law hyderabad ",
    "cleaned_title": "bridge digitaldivide chronic inequalities internet access",
    "cleaned_selftext": "ampxb tldr first national family health surveyhttprchiipsorgnfhsnfhsfctsnfhsstatefactsheetcompendiumphaseipdf recorded percentage men women ever used internet lacs households across states union territories survey revealed internet penetration country rising persistent digital divide still remains due factors gender gaps ruralurban divide state access digital infrastructure inhabited villages covered mobile serviceshttploksabhaquestionsannexaspdf furthermore gram panchayats connected bharatnet project made service ready per trais yearly performance indicators report httpswwwtraigovinsitesdefaultfilesyirpdf india million internet subscribers st december increase million subscribers internet subscriptions rural india amounted million total internet subscriptions urban india million widely expected indians access internet overwhelmingly mobile devices indian telecom services performance indicators report april june httpswwwtraigovinsitesdefaultfilesreportpdf showed june number internet subscribers increased million increase previous quarter increase december number urban rural subscribers increased million million respectively least number internet subscriptions himachal pradesh million jammu kashmir million north east service area million overall internet teledensity number internet subscribers per persons increased increase december rural urban internet teledensities respectively change respectively respect december table displays monthly growth broadband subscribers based trais monthly subscription reportshttpswwwtraigovinreleasepublicationreportstelecomsubscriptionsreports ampxb internet broadband kbps download speed httpspreviewredditggnuoyqupngwidthampformatpngampautowebpampsdceadfbabbbcdaccc gaps availability persist thus data show whole access digital infrastructure increasing significant digital disparities still remain figures highlight ruralurban divide terms access internet number rural subscribers despite making significant majority population number urban subscribers rural internet density also third urban internet density clearly large strides must still made reduce ruralurban differentials imbalances also visible stark gender based polarities access internet service seen data compiled national family health survey indiaspend reporthttpswwwindiaspendcomgendercheckinbiharwomenhaveneverusedtheinternet indicates eight states two union territories bihar andhra pradesh tripura west bengal telangana assam gujarat meghalaya andaman amp nicobar islands karnataka dadra amp nagar haveli daman amp diu less percent women used internet comparatively states men used internet three states one union territory women rural areas ackowledge used internet goa kerala sikkim ladakh meanwhile states union territory meghalaya assam bihar tripura andaman nicobar islands west bengal andhra pradesh less men used internet even states low overall internet penetration bihar percentage women used internet less half men furthermore figures help providing full picture survey measured person ever used internet collect details availability internet services regularity usage thus survey shows awareness internet necessarily cover actual usage internet actual digital divides may larger evidence field conversations weve people also revealed even improvements taking place several impediments disruptions plague service delivery consider case andaman nicobar islands june last year issues internet access islandshttpsinternetfreedominforthepeopleofandamannicobarislandsginternetatreasonabletariffsisstilladream brought notice subsequently helped people islands write pmo dothttpsinternetfreedominwewrotetothepmodotontheaccesstointernetissuewhichispersistingintheandamannicobarislands mp kuldeep rai sharmahttpsinternetfreedominthefightforfastandaffordableinternetinandamannicobarislandscontinues efforts bore fruit august prime minister inaugurated chennai andaman amp nicobar islands cani submarine cable systems project recently decided speak stakeholders andaman nicobar islands wed reached earlier said baseline level access indeed established several problems remained one significant issue seemed exorbitant tariff rates even best plan anyways delivered slowtomedium speed monthly data cap would cost times tariff g unlimited plans areas country economy devastated pandemic led many people discontinuing internet connections connection also erratic people reporting multiple days without internet lastly informal reports governemnt planning shift burden providing high speed internet onto private companies stakeholders indicated move might prove detrimental since private telecom service providers would likely shift high entry costs onto users steps taken ultimately efforts improve expand indias digital infrastructure must ramped task made paramount due covid pandemic likelihood increased inequalities access internet light department telecommunications pm wani scheme seems good move prima facie scheme aims set public wifi hotspots throughout country decentralised manner public data offices provide wifi services locally put explainer describing analysing scheme coming days important documents indiaspends article bihar women never used internet linkhttpswwwindiaspendcomgendercheckinbiharwomenhaveneverusedtheinternet representation pmo dot cani project andaman amp nicobar islands g internet access dated june linkhttpsdrivegooglecomfiledybbeifnicqdnftptqcnqwslekcwjaviewuspsharing letter shri kuldeep rai sharma cani project dated july linkhttpsdrivegooglecomfilednlinmlhevzzlntnybimpcucbteviewuspsharing representation dot internet access issues odisha dated september linkhttpsdrivegooglecomfiledijztlgmbgpetvhrzverypqgferkviewuspsharing post written significant contributions anushree verma rd year student law nalsar university law hyderabad",
    "cleaned_comments": "",
    "light_cleaned_title": "Bridge the #DigitalDivide: On chronic inequalities in internet access",
    "light_cleaned_selftext": "## Tl;dr In a first, the[ **National Family Health Survey**](http://rchiips.org/NFHS/NFHS-5_FCTS/NFHS-5%20State%20Factsheet%20Compendium_Phase-I.pdf) recorded the percentage of men and women who have ever used the internet from 3.07 lacs households across 17 states and 5 union territories. The Survey revealed that, while internet penetration in the country is rising, a persistent digital divide still remains due to factors such as gender gaps and the rural-urban divide. ## State of access to digital infrastructure As of 2019, out of 5,97,618 inhabited villages, [**5,69,897 are covered by mobile services**](http://164.100.24.220/loksabhaquestions/annex/173/AS245.pdf). Furthermore, 1,50,029 gram panchayats have been connected by the BharatNet Project, out of which 1,36,693 have been made service ready. As per TRAI’s [**Yearly Performance Indicators Report for 2019**](https://www.trai.gov.in/sites/default/files/YIR_25112020_0.pdf), India had 718.74 million internet subscribers as of 31st December 2019, an increase of 18.95% over the 604.21 million subscribers in 2018. Internet subscriptions in rural India amounted to 268.43 million - about 60% of the total of internet subscriptions in urban India, 450.21 million. As was widely expected, Indians access the internet overwhelmingly (96%) through mobile devices. The [**Indian Telecom Services Performance Indicators report for April – June, 2020**](https://www.trai.gov.in/sites/default/files/Report_09112020_0.pdf) showed that in June 2020, the number of internet subscribers increased to 749.07 million, a 0.79% increase over the previous quarter, and a 4.2% increase over December 2019. The number of urban and rural subscribers increased to 455.98 million and 293.09 million respectively. The least number of internet subscriptions were in Himachal Pradesh (6.08 million), Jammu and Kashmir (7.50 million), and the North East service area (7.53 million). Overall internet tele-density (the number of internet subscribers per 100 persons) increased to 55.41 (2.1% increase from December 2019), with rural and urban internet tele-densities at 33.00 and 98.35 respectively (10.6% and -7.4% change respectively with respect to December 2019). The table below displays the monthly growth of broadband subscribers in 2020 based on TRAI’s [**monthly subscription reports**](https://www.trai.gov.in/release-publication/reports/telecom-subscriptions-reports).  [Internet Broadband \\(≥ 512 Kbps download speed\\) in 2020](https://preview.redd.it/g3gn1uoyqu961.png?width=504&amp;format=png&amp;auto=webp&amp;s=d4c60e16a35d7f532b7ab27b228b5c991dacc98c) ## Gaps in availability persist Thus, while the data does show that on the whole access to digital infrastructure is increasing, significant digital disparities still remain. These figures highlight the rural-urban divide in terms of access to the internet, with the number of rural subscribers, despite making up a significant majority of the population, being only 64% of the number of urban subscribers. Rural internet density is also at about a third of urban internet density. Clearly, large strides must still be made to reduce rural-urban differentials. Other imbalances are also visible. The stark gender based polarities in access to internet service can be seen through data compiled from the National Family Health Survey by Indiaspend. Their [**report**](https://www.indiaspend.com/gendercheck/4-in-5-bihar-women-have-never-used-the-internet-702855) indicates that in eight states and two union territories - Bihar (20.6%), Andhra Pradesh (21.0%), Tripura (22.9%), West Bengal (25.5%), Telangana (26.5%), Assam (28.2%), Gujarat (30.8%), Meghalaya (34.7%), Andaman &amp; Nicobar Islands (34.8%), Karnataka (35.0%), and Dadra &amp; Nagar Haveli and Daman &amp; Diu (36.7%) - less than 40 percent women have used the internet. Comparatively, in the same states, more than 40% men have used the internet. In only three states and one union territory did more than 50% women from rural areas ackowledge to have used the internet - Goa (%), Kerala (57.5%), Sikkim (68.1%), and Ladakh (54%). Meanwhile, there were only 6 states and 1 union territory - Meghalaya (42.1%), Assam (42.3%), Bihar (43.6%), Tripura (45.7%), Andaman and Nicobar Islands (46.5%), West Bengal (46.7%), and Andhra Pradesh (48.8%) - in which less than 50% of the men had used the internet. Even in states with low overall internet penetration such as Bihar, the percentage of women who have used the internet was less than half of that of men. Furthermore, these figures do not help in providing a full picture. The survey only measured if a person had *ever* used the internet, and did not collect details about the availability of internet services or the regularity of their usage. Thus, while the survey shows awareness about the internet, it does not necessarily cover the actual usage of the internet, and so actual digital divides may be larger. ## Evidence from the field Conversations we've had with people have also revealed that even where improvements are taking place, several impediments and disruptions plague service delivery. Consider the case of the Andaman and Nicobar Islands. In June last year, [**issues with internet access in the islands**](https://internetfreedom.in/for-the-people-of-andaman-nicobar-islands-4g-internet-at-reasonable-tariffs-is-still-a-dream/) were brought to our notice. Subsequently, we helped the people of the islands write to the [**PMO, the DoT**](https://internetfreedom.in/we-wrote-to-the-pmo-dot-on-the-access-to-internet-issue-which-is-persisting-in-the-andaman-nicobar-islands/) and to [**MP Kuldeep Rai Sharma**](https://internetfreedom.in/the-fight-for-fast-and-affordable-internet-in-andaman-nicobar-islands-continues/). These efforts bore fruit in August, when the Prime Minister inaugurated the Chennai and Andaman &amp; Nicobar Islands (CANI) Submarine Cable Systems Project. Recently, we decided to speak to stakeholders in the Andaman and Nicobar Islands we'd reached out to earlier. They said that while some baseline level of access had indeed been established, several problems remained. One significant issue seemed to be the exorbitant tariff rates, as even the best plan ( that anyways delivered a slow-to-medium speed at a monthly data cap) would cost 2-3 times the tariff for 5G unlimited plans in other areas of the country. In an economy devastated by the pandemic, this has led to many people discontinuing their internet connections. The connection has also been erratic, with some people reporting multiple days without the internet. Lastly, there have been informal reports about the governemnt planning to shift the burden of providing high speed internet onto private companies. Stakeholders indicated that such a move might prove to be detrimental, since private telecom service providers would be more likely to shift the high entry costs onto the users. ## Steps taken Ultimately, efforts to improve and expand India's digital infrastructure must be ramped up. Such a task has been made paramount due to the Covid-19 pandemic, which has, in all likelihood, increased inequalities in access to the internet. In this light, the Department of Telecommunications' PM WANI scheme seems to be a good move *prima facie.* The scheme aims to set up public wifi hotspots throughout the country in a decentralised manner through Public Data Offices which provide wifi services locally. We will put out an explainer describing and analysing the scheme in the coming days. ## Important Documents 1. IndiaSpend's article '4 In 5 Bihar Women Have Never Used The Internet' ([**link**](https://www.indiaspend.com/gendercheck/4-in-5-bihar-women-have-never-used-the-internet-702855)) 2. Representation to PMO and DoT on the CANI Project in Andaman &amp; Nicobar Islands for 4G Internet Access dated June 26, 2020 ([**link**](https://drive.google.com/file/d/1YB3BEiFNiCQdnf7tptQcnQW_slEkcWjA/view?usp=sharing)) 3. Letter to Shri Kuldeep Rai Sharma on the CANI Project dated July 25, 2020 ([**link**](https://drive.google.com/file/d/1N0L4inmL8he6VzZl6NtNYBiM9pCUCBtE/view?usp=sharing)) 4. Representation to the DoT on Internet Access issues in Odisha dated September 8, 2020 ([**link**](https://drive.google.com/file/d/184IjztlGMbgp5_ETVh2RzVERyPqgFerk/view?usp=sharing)) *\\* This post was written with significant contributions from Anushree Verma, a 3rd year student of law at NALSAR University of Law, Hyderabad.*",
    "light_cleaned_comments": ""
}