{
    "id": "1d8juje",
    "title": "Beware of Meesho fraud",
    "url": "https://www.reddit.com/r/india/comments/1d8juje/beware_of_meesho_fraud/",
    "selftext": "Today my mom got scammed by a Meesho call center representative. All she wanted was to get refund on an item she purchased and she clicked on the help center button on the Meesho app and the guy who is the official representative of Meesho picks up and sends her a link on WhatsApp which is basically a dummy site used to funnel payment information. \n\n[This is the WhatsApp message she got.](https://preview.redd.it/3znp6td1dp4d1.jpg?width=576&format=pjpg&auto=webp&s=0cc821b7bb632e1d23dbcdc1832ea730e0c8e219)\n\nShe was asked to enter the debit card details along with CVV number etc. And the guy was still on the call and instructed her to pick up the call that she will be getting from the bank. My mom got suspicious and didn't proceed further and called me over. I quickly realized what was going on and thankfully, because she didn't pick up the call from the bank, the bank (IDFC First) automatically blocked the debit card and froze the account. \n\n[We got an SMS from the bank saying that there was an attempt to make a transaction worth about 10k.](https://preview.redd.it/cr08ep76cp4d1.jpg?width=576&format=pjpg&auto=webp&s=249719836802fa8a68bdff8e72ec513f5bde0948)\n\nI guess what's happened is that because Meesho doesn't have any kind of regulatory framework or monitoring systems in place for their call center employees, some of these scammers operate their side hustle like this. \n\nSadly most customers of Meesho are the older generation and rural people who don't know how to use Amazon or other more reputed platforms. I'm not sure if that is the case or if this is something that Meesho does on an official basis. Wouldn't be surprised if the latter was the case. \n\nPlease be cautious and let anyone in your family know about these kinds of scams. Spread the message about how unreliable Meesho is.",
    "flair": "Crime",
    "score": 12,
    "num_comments": 8,
    "created_utc": 1717571496.0,
    "convurl": "https://b.thumbs.redditmedia.com/WBEvLOWRCMdhHq8dgD1-3x5cj9SPTxTUURk5ZzWkGBw.jpg",
    "comments": [
        "Sad thing is that even the national cyber crime reporting portal is not working. I can't even sign up for an account to be able to register a complaint.\n\nhttps://preview.redd.it/b8vetedzop4d1.png?width=1744&format=png&auto=webp&s=b005b60442425b74b7e88c516c981adca3ccb37d\n\nThe OTP and captcha fields are disabled and even with manually enabling them via the browser's inspect control doesn't allow me to register for an account. How does this even happen?",
        "First register under \"click here for new user\"",
        "I have. I had to do this to take screenshot. I have tried registering from various browsers and followed all the steps. Can you check if you're able to register for a new account?",
        "This belongs to r/indiatech",
        "Not really. This is meant as a PSA to the larger public so that they can warn their friends and family to be cautious using a platform that has been infiltrated by scammers.",
        "did you click get otp?",
        "i am able to create it. you need to wait a bit after clicking get otp.",
        "I've a small web-based service that will help users identify whether a site(/webpage) belongs to a company or not. This would help people who are note tech savvy to a limit, where they can easily verify without causing any confusion.  And Meesho like most other Indian sites are available to verify. \n\nIt's called authifyURL (url.authifyweb(dot)com).   \n  \nHow to use  \n\\_\\_\\_\n\n* Search for the company name. \n* Once selected, submit the URL.\n\nIt will tell whether it fake or real.\n\n   \nHope it helps."
    ],
    "cleaned_text": "beware meesho fraud today mom got scammed meesho call center representative wanted get refund item purchased clicked help center button meesho app guy official representative meesho picks sends link whatsapp basically dummy site used funnel payment information whatsapp message gothttpspreviewredditznptddpdjpgwidthformatpjpgautowebpsccbbbeddbcdceaece asked enter debit card details along cvv number etc guy still call instructed pick call getting bank mom got suspicious didnt proceed called quickly realized going thankfully didnt pick call bank bank idfc first automatically blocked debit card froze account got sms bank saying attempt make transaction worth khttpspreviewredditcrepcpdjpgwidthformatpjpgautowebpsfaabdffeecfbde guess whats happened meesho doesnt kind regulatory framework monitoring systems place call center employees scammers operate side hustle like sadly customers meesho older generation rural people dont know use amazon reputed platforms im sure case something meesho official basis wouldnt surprised latter case please cautious let anyone family know kinds scams spread message unreliable meesho ",
    "cleaned_title": "beware meesho fraud",
    "cleaned_selftext": "today mom got scammed meesho call center representative wanted get refund item purchased clicked help center button meesho app guy official representative meesho picks sends link whatsapp basically dummy site used funnel payment information whatsapp message gothttpspreviewredditznptddpdjpgwidthformatpjpgautowebpsccbbbeddbcdceaece asked enter debit card details along cvv number etc guy still call instructed pick call getting bank mom got suspicious didnt proceed called quickly realized going thankfully didnt pick call bank bank idfc first automatically blocked debit card froze account got sms bank saying attempt make transaction worth khttpspreviewredditcrepcpdjpgwidthformatpjpgautowebpsfaabdffeecfbde guess whats happened meesho doesnt kind regulatory framework monitoring systems place call center employees scammers operate side hustle like sadly customers meesho older generation rural people dont know use amazon reputed platforms im sure case something meesho official basis wouldnt surprised latter case please cautious let anyone family know kinds scams spread message unreliable meesho",
    "cleaned_comments": "sad thing even national cyber crime reporting portal working cant even sign account able register complaint otp captcha fields disabled even manually enabling via browsers inspect control doesnt allow register account even happen first register click new user take screenshot tried registering various browsers followed steps check youre able register new account belongs rindiatech really meant psa larger public warn friends family cautious using platform infiltrated scammers click get otp able create need wait bit clicking get otp ive small webbased service help users identify whether sitewebpage belongs company would help people note tech savvy limit easily verify without causing confusion meesho like indian sites available verify called authifyurl urlauthifywebdotcom use search company name selected submit url tell whether fake real hope helps",
    "light_cleaned_title": "Beware of Meesho fraud",
    "light_cleaned_selftext": "Today my mom got scammed by a Meesho call center representative. All she wanted was to get refund on an item she purchased and she clicked on the help center button on the Meesho app and the guy who is the official representative of Meesho picks up and sends her a link on WhatsApp which is basically a dummy site used to funnel payment information. [This is the WhatsApp message she got.](https://preview.redd.it/3znp6td1dp4d1.jpg?width=576&format=pjpg&auto=webp&s=0cc821b7bb632e1d23dbcdc1832ea730e0c8e219) She was asked to enter the debit card details along with CVV number etc. And the guy was still on the call and instructed her to pick up the call that she will be getting from the bank. My mom got suspicious and didn't proceed further and called me over. I quickly realized what was going on and thankfully, because she didn't pick up the call from the bank, the bank (IDFC First) automatically blocked the debit card and froze the account. [We got an SMS from the bank saying that there was an attempt to make a transaction worth about 10k.](https://preview.redd.it/cr08ep76cp4d1.jpg?width=576&format=pjpg&auto=webp&s=249719836802fa8a68bdff8e72ec513f5bde0948) I guess what's happened is that because Meesho doesn't have any kind of regulatory framework or monitoring systems in place for their call center employees, some of these scammers operate their side hustle like this. Sadly most customers of Meesho are the older generation and rural people who don't know how to use Amazon or other more reputed platforms. I'm not sure if that is the case or if this is something that Meesho does on an official basis. Wouldn't be surprised if the latter was the case. Please be cautious and let anyone in your family know about these kinds of scams. Spread the message about how unreliable Meesho is.",
    "light_cleaned_comments": "Sad thing is that even the national cyber crime reporting portal is not working. I can't even sign up for an account to be able to register a complaint. The OTP and captcha fields are disabled and even with manually enabling them via the browser's inspect control doesn't allow me to register for an account. How does this even happen? First register under \"click here for new user\" I have. I had to do this to take screenshot. I have tried registering from various browsers and followed all the steps. Can you check if you're able to register for a new account? This belongs to r/indiatech Not really. This is meant as a PSA to the larger public so that they can warn their friends and family to be cautious using a platform that has been infiltrated by scammers. did you click get otp? i am able to create it. you need to wait a bit after clicking get otp. I've a small web-based service that will help users identify whether a site(/webpage) belongs to a company or not. This would help people who are note tech savvy to a limit, where they can easily verify without causing any confusion. And Meesho like most other Indian sites are available to verify. It's called authifyURL (url.authifyweb(dot)com). How to use \\_\\_\\_ * Search for the company name. * Once selected, submit the URL. It will tell whether it fake or real. Hope it helps."
}