{
    "id": "1hebvry",
    "title": "Days after Atul Subhash, a Bengaluru police constable's body is found after he jumped in front of a train. The suicide note mentions harassment by his wife and her family members.",
    "url": "https://i.redd.it/cmcwo3ekkv6e1.png",
    "selftext": "Legal & social systemic bias against male victims of abuse is so bad that a head constable of police was also completely powerless against domestic abuse by his wife and her family.\n\nA man dies by suicide in India every 4 minutes, and the rate of male suicide in India is growing 9 times faster than women. This is now the fastest accelerating male suicide rate in the whole world. India is the only country where working class men deal with provider pressure and systemic legal bias both oppressing them, leaving millions to fall between the cracks.\n\n",
    "flair": "Law & Courts",
    "score": 184,
    "num_comments": 44,
    "created_utc": 1734208609.0,
    "convurl": "https://i.redd.it/cmcwo3ekkv6e1.png",
    "comments": [
        "Source: https://m.economictimes.com/news/india/amid-outrage-over-atul-subhashs-case-bengaluru-cop-commits-suicide-blames-wife-for-harassment-in-death-note/articleshow/116318324.cms",
        "more and more such reports of male suicides will surface over the next few weeks…. And watch the neo-feminist, man-hating movement take over this as well and attempt to explain their plight to be worse and blame the men for that also….",
        "I feel really bad for the train driver, some people just have zero consideration for others",
        "Its real sad",
        "Yep, the wife was really inconsiderate.",
        "But what did the poor train driver do to be traumatized by this? He had no part in this.",
        "The train driver is not the first victim in this country. You sound like you have never seen any evil in society.",
        "Anyone who attempts to derail this conversation, call them out because they can be many things but feminist is not one of them. Anyone who attempts to undermine experiences of male victims are misandrists. And misandry and feminism are kinda incompatible. I recall a thread on twoX about how misandry isn't a real thing, we must question feminism instead of shaming it; a few flawed individuals shouldn't be allowed to gatekeep feminism.",
        "\nThis is not a man vs woman issue but rather a systemic one. Instead of creating an us vs them scenario, we all should come together and find solutions for them.\nAnd they are right, the plight of women is worse statistically and frankly its quite obvious.\nMore such reports will appear because such news are picked up more by the public after a similar popular event has occured, otherwise no one would have cared.",
        "I agree with you, in an ideal world this is not a man v women issue…. But just for some reality check, on the very issue of Athletics Subhash, the protest kn Delhi, what % of the protesters are women? Less than 10%. So much as your comment comes from a place of “less not do man v women , and we all must come together and solve this”, just a casual survey of the outrage demographics should give you the answer. \n\nAlso, when any such issues against men is raised, I assure you the number of men who are outraged at that is far higher, because we know that we have to support our women. Where is the support in the other direction? All I hear and see  is more man hate",
        "[source ](https://indiankanoon.org/doc/167238818/)\nHe committed a rape-murder case on a minor, and was charged with life imprisonment in 2020, when he was 29 years old. He committed suicide in 2024 due to this charge. Please research more carefully.",
        "Yes but he's just as much a victim. Nobody should suffer the trauma where they end up witnessing someone using them involuntarily to commit suicide",
        "Ye sb feminism nonsense hai. He was an innocent victim who fell to harassment from his wife. Men are very oppressed in India and women have lots of benefits. /s",
        "It is expected for men to relate more to male related issues just like it happens to women in their case.\nI dont think its appropriate to look at those self proclaimed feminists who dont sympathise with men related issues and paint them as the view of feminism.\nIncrese in women issues lead them to take the stand for themselves in the form of feminism (as most of them were due to men even if one thinks those men are small in number, others havent done much to help these women otherwise we would have seen a decline in this issue).\nWomen historically have been subjected to poor treatment and have less voice in the society, a situation which is not improving sufficiently. When women hear about cases of domestic abuse, rape, they are bound to feel a sense on distrust with men and sometimes even hate them. \nI personally sympathise with them and feel that it is sort of the blame of male community as whole,\nBut it should not come out as injustice and harm against innocent men",
        "All dead men are saints /s",
        "So would you be ok with Men sitting on the sidelines during issues of hardships against women? Or would your expect men to help and voice and be supportive of women? \n\nYour comment seems to intend to gaslight men into thinking their issues are their problems only… and women issues are also men’s issue since they have caused majority of them.. which is EXACTLY what my original comment that you replied to, was about… congratulations we have come full circle !",
        "In my personal observation, it seems that many women in India pay little attention to issues affecting men. However, a single mention of a woman being raped often shocks an entire family, as rape against women is regarded as one of the most heinous crimes in society—which is justified. But this raises an important question: why is there so little discussion about male rape?\n\nStatistics suggest that most cases of male rape are perpetrated by women rather than other men, yet these figures rarely, if ever, receive attention in public discourse. \n\nAt this point, I’ve stopped expecting much understanding or acknowledgment from most women regarding these issues. It feels like men must stand together and support one another because, in the end, we only have ourselves to rely on.",
        "Man, India is so polarized on Gender that people are willing to eat shitty and false narrative just to talk trash about the other gender.",
        "Seems to me the people rooting for equality and for the society to get less patriarchal didn't account for overall consequences.",
        "So, you sympathize with them because society treats them poorly? I find this argument unconvincing because the same could be said about male rape cases, which are significantly high when cases of women assaulting men are included. In fact, the numbers are comparable to those of female rape cases, yet male victims receive no level of attention or empathy.\n\nIf a man is raped by a woman then he is supposed to keep it to himself forever till he dies.",
        "There's another fake news like this being spread [wife harassment ](https://x.com/StoicOnWheels/status/1867539153497600230?t=c47d7qkT8sj2N7o21snVuA&s=19)\n\nWhen in reality the guy committed suicide due to some property dispute and politics.\n\nhttps://preview.redd.it/3e32qv6q0w6e1.png?width=1080&format=pjpg&auto=webp&s=d0a403efa10244588847a696371193d0e1adee2d",
        "https://preview.redd.it/2ieu89fr0w6e1.png?width=1080&format=pjpg&auto=webp&s=0d5e383b39e06731703b587ef2d533663cbb47ee",
        "hmmm, he committed a rape-murder case on a minor, and was charged with life imprisonment in 2020, when he was 29 years old. He committed suicide in 2024 due to this charge.",
        "Tbh did not even read the post. I just made a blanket opinion because I think there's truth to it.",
        "I never said men should sit outside during issues of hardship against women. I actually said that men arent doing enough to resolve, yes because they are majorly caused by them.\n\n\nI never said that mens issues are only their issue.\n\nMy previous comment was because in your reply to my 1st comment, where you said that men were voicing a lot  for women which is simply not the case nor is it sufficient to resolve the issue.\n\nMen havent cretaed a sense of trust in the eyes of women and thus they voice a lot less than compared to for themselves as it is an almost daily and more frequent problem for them.\nSurely some will take mens issues lightly which is wrong, but when some men act as if they are in eternal danger in an unequal world for men whereas actually they have been the one dominating, women do feel a sense of their issues not being taken seriously",
        "Numbers are not comparable to female rape cases, what??\nI have a problem with those men considering their issues as bigger problem than men and due to those 'feminists'.\nThis creates a situation where actually majorly affected group of women feel that their problems are highjacked.\n\nI agree that mens issues are not taken seriosly by society,\n but another thought is that society is itself majorly dominated by men. First men need to organise themselves and speak against all forms of gender injustice. This gets masked by those men who do injustices agianst women\n\nI belive that like minded people should come together and strive to make better reforms so that we all collectively have to deal less with this",
        "Men rape does not get much attention unfortunately. I think this might be beacuse women rape is a much much more prevalent and likely occurence whereas male rape is an anomaly. \nMen need to take issue into their own hands and voice against them, surely all those who oppose inujstices agianst men will join and it will also include women.",
        "This entire comment is gaslighting of men again…. Like wth… ? According to you the issues against men is a result of all men, but the issues against women are a result of a few bad apples… and therefore the entirety of women are unable to relate and  hence keep quiet… this is your argument?\n\nno sane man will argue that women have a rough road in India; or that ther are many issues that need more support; but at least that’s acknowledging the problem. \n\nEducated women seem to think male issues are non-existent…",
        "More than sympathy, I see them just pouncing at every opportunity to willify women and fuel the \"women bad\" narrative. The no. of upvotes to posts like these are concerning.\n\nAs someone said once,\n\nThe reason why this case is getting such publicity esp by the male demographic is not because they want justice but because it plays into their fantasy of women being oppressors. It allows them to voice their desires about taking away the \"rights\" they've bestowed.",
        "Why do they so badly want to be oppressed by women? Mommy issues? /s 🤠",
        "I don’t get why killing yourself is seen as a proof of being ‘innocent’ in India.",
        "Pent up anger from the government fucking them everywhere. They find women on the lower end of the food chain so...",
        "Ikr! They want to cancel the issues women face. It's extremely common for, well, narcissists, for lack of a better word, to play the victim. It's called DARVO (Deny, Attack, Reverse Victim and Offender), and men have been doing it a LOT lately.",
        "Bro, patriarchy also contributes to male suicides by making men seem emasculated for seeking mental health, or even crying. Patriarchy means nothing but the assigned gender role of men being strong logical creatures who are meant to run the world, and women to serve them. This leaves little room for men to have emotions, to express them with safe outlets.\n\nMale mental health is a complex issue more nuanced than a simple men vs “evil feminists” warfare.",
        "30-35 years back men/in-laws used to abuse daughter-in-law. Then laws(498A/B, Domestic violence etc...) were made which were created to take care of that but now they are being misused by women to abuse mother-in-law and husband.\n\nDon't know where this will lead to? and when it will come to end?",
        "Lot of baggage you got there. I didn't even mention feminism.",
        "Oh you didn’t know? Death absolves every one of all their crimes unless they are NOT male.",
        "Facts. Male victimhood and male supremacy have always been two sides of the same coin.",
        "Patriarchy harms men and little boys.",
        "Sure. The millenials must be just flourishing without it.",
        "Numbers are comparable to female rape cases, there has been several studies and surveys done by US/UK which clearly shows that a massive number of men gets raped by women yearly, it's just most people in India live under the rock to never question the reality.\n\n\nThere is no bigger issue, both male & female rape are same and should be seen through same lenses but one has laws/police/media on their side while the other gender have nothing with them, men after being raped by their woman will still have to pay the alimony.\n\n\nI don't even want to talk about DV here or the cheating laws.\n\n\nWait, why men alone?\n\nWhen a female was raped then almost half of the people who protests are male, yet when we don't even have a fucking law to protect ourselves and still women can't protest together?\n\n\nWhy is that only one gender needs to work on it. I strictly believe that both genders should have worked on it and discussed about it but I have never seen a single woman in India ever spoke a word about this topic.\n\nI don't have any trust left from opposite sex to ever raise their voice for men. They'd rather be misinformed about male rape and call it a day.",
        "In which utopia?",
        "The one where you are able to read sarcasm",
        "So you agree patriarchy still exists and is harmful.\nGreat.",
        "Sure buddy. Whatever you say at this point.",
        "Thanks girl!",
        "Logical fallacies are the bread and butter of incels and female incels/femcels aka feminists. \n\nThey are so stupid and delusional to the point where they fail to understand that issues of gender are not mutually exclusive. Just because women face x issue does not mean men do not face x issue. \n\nJust because women face an issue on one scale does not mean that the issues men face on a different scale are irrelevant or acceptable. This kind of thinking is regressive and it's in no way progressive. \n\nThe issues men face should not be discounted by saying that women face x or y or z issues and the issues women face should not be discounted by saying that men face x or y or z issues. \n\nThe so called people who want gender equality are quick to trivialize men's issue by citing different issues women face but they get all up in arms when women's issues are trivialized. This is hypocritical of them. \n\nBut I do have to say that this isn't a man vs women issue.  \n   \nThis is a man vs feminists issue. \n\nNot all women identify as feminists. Many feminists I know have abandoned the label because the actions of feminists and the actions of female incels are very similar all across the globe. \n\nFor example, feminists in India protested against gender neutral rape laws and they were successful. Only truly sick individuals will want to make sure that rape of one gender is legal.   \nIf the feminists are trying to protect women who rape men, then they are no better than the incels who support andrew tate. \n\nYou can see how in this respect, feminists/femcels and incels are really similar. \n\nAnother example is the feminists being vocal against gender neutral DV laws that protects male victims. Victimization is not mutually exclusive in case of rape or DV. Even many studies and stats are present that shows that considerable amount of men are victims of DV and rape. \n\nYou can see how feminists are reinforcing gender stereotypes and in the process reinforcing and supporting patriarchy. \n\nConsidering how in India, feminists are supporting female incels who rape men and abuse men, It's no wonder anti feminism is rampant. At this point, anti feminism is synonymous to anti female inceldom."
    ],
    "cleaned_text": "days atul subhash bengaluru police constables body found jumped front train suicide note mentions harassment wife family members legal social systemic bias male victims abuse bad head constable police also completely powerless domestic abuse wife family man dies suicide india every minutes rate male suicide india growing times faster women fastest accelerating male suicide rate whole world india country working class men deal provider pressure systemic legal bias oppressing leaving millions fall cracks ",
    "cleaned_title": "days atul subhash bengaluru police constables body found jumped front train suicide note mentions harassment wife family members",
    "cleaned_selftext": "legal social systemic bias male victims abuse bad head constable police also completely powerless domestic abuse wife family man dies suicide india every minutes rate male suicide india growing times faster women fastest accelerating male suicide rate whole world india country working class men deal provider pressure systemic legal bias oppressing leaving millions fall cracks",
    "cleaned_comments": "source reports male suicides surface next weeks watch neofeminist manhating movement take well attempt explain plight worse blame men also feel really bad train driver people zero consideration others real sad yep wife really inconsiderate poor train driver traumatized part train driver first victim country sound like never seen evil society anyone attempts derail conversation call many things feminist one anyone attempts undermine experiences male victims misandrists misandry feminism kinda incompatible recall thread twox misandry isnt real thing must question feminism instead shaming flawed individuals shouldnt allowed gatekeep feminism man vs woman issue rather systemic one instead creating us vs scenario come together find solutions right plight women worse statistically frankly quite obvious reports appear news picked public similar popular event occured otherwise one would cared agree ideal world man v women issue reality check issue athletics subhash protest kn delhi protesters women less much comment comes place less man v women must come together solve casual survey outrage demographics give answer also issues men raised assure number men outraged far higher know support women support direction hear see man hate source httpsindiankanoonorgdoc committed rapemurder case minor charged life imprisonment years old committed suicide due charge please research carefully yes hes much victim nobody suffer trauma end witnessing someone using involuntarily commit suicide ye sb feminism nonsense hai innocent victim fell harassment wife men oppressed india women lots benefits expected men relate male related issues like happens women case dont think appropriate look self proclaimed feminists dont sympathise men related issues paint view feminism increse women issues lead take stand form feminism due men even one thinks men small number others havent done much help women otherwise would seen decline issue women historically subjected poor treatment less voice society situation improving sufficiently women hear cases domestic abuse rape bound feel sense distrust men sometimes even hate personally sympathise feel sort blame male community whole come injustice harm innocent men dead men saints would ok men sitting sidelines issues hardships women would expect men help voice supportive women comment seems intend gaslight men thinking issues problems women issues also mens issue since caused majority exactly original comment replied congratulations come full circle personal observation seems many women india pay little attention issues affecting men however single mention woman raped often shocks entire family rape women regarded one heinous crimes societywhich justified raises important question little discussion male rape statistics suggest cases male rape perpetrated women rather men yet figures rarely ever receive attention public discourse point ive stopped expecting much understanding acknowledgment women regarding issues feels like men must stand together support one another end rely man india polarized gender people willing eat shitty false narrative talk trash gender seems people rooting equality society get less patriarchal didnt account overall consequences sympathize society treats poorly find argument unconvincing could said male rape cases significantly high cases women assaulting men included fact numbers comparable female rape cases yet male victims receive level attention empathy man raped woman supposed keep forever till dies theres another fake news like spread wife harassment httpsxcomstoiconwheelsstatustcdqktsjnosnvuas reality guy committed suicide due property dispute politics hmmm committed rapemurder case minor charged life imprisonment years old committed suicide due charge tbh even read post made blanket opinion think theres truth never said men sit outside issues hardship women actually said men arent enough resolve yes majorly caused never said mens issues issue previous comment reply st comment said men voicing lot women simply case sufficient resolve issue men havent cretaed sense trust eyes women thus voice lot less compared almost daily frequent problem surely take mens issues lightly wrong men act eternal danger unequal world men whereas actually one dominating women feel sense issues taken seriously numbers comparable female rape cases problem men considering issues bigger problem men due feminists creates situation actually majorly affected group women feel problems highjacked agree mens issues taken seriosly society another thought society majorly dominated men first men need organise speak forms gender injustice gets masked men injustices agianst women belive like minded people come together strive make better reforms collectively deal less men rape get much attention unfortunately think might beacuse women rape much much prevalent likely occurence whereas male rape anomaly men need take issue hands voice surely oppose inujstices agianst men join also include women entire comment gaslighting men like wth according issues men result men issues women result bad apples therefore entirety women unable relate hence keep quiet argument sane man argue women rough road india ther many issues need support least thats acknowledging problem educated women seem think male issues nonexistent sympathy see pouncing every opportunity willify women fuel women bad narrative upvotes posts like concerning someone said reason case getting publicity esp male demographic want justice plays fantasy women oppressors allows voice desires taking away rights theyve bestowed badly want oppressed women mommy issues dont get killing seen proof innocent india pent anger government fucking everywhere find women lower end food chain ikr want cancel issues women face extremely common well narcissists lack better word play victim called darvo deny attack reverse victim offender men lot lately bro patriarchy also contributes male suicides making men seem emasculated seeking mental health even crying patriarchy means nothing assigned gender role men strong logical creatures meant run world women serve leaves little room men emotions express safe outlets male mental health complex issue nuanced simple men vs evil feminists warfare years back meninlaws used abuse daughterinlaw lawsab domestic violence etc made created take care misused women abuse motherinlaw husband dont know lead come end lot baggage got didnt even mention feminism oh didnt know death absolves every one crimes unless male facts male victimhood male supremacy always two sides coin patriarchy harms men little boys sure millenials must flourishing without numbers comparable female rape cases several studies surveys done usuk clearly shows massive number men gets raped women yearly people india live rock never question reality bigger issue male female rape seen lenses one lawspolicemedia side gender nothing men raped woman still pay alimony dont even want talk dv cheating laws wait men alone female raped almost half people protests male yet dont even fucking law protect still women cant protest together one gender needs work strictly believe genders worked discussed never seen single woman india ever spoke word topic dont trust left opposite sex ever raise voice men theyd rather misinformed male rape call day utopia one able read sarcasm agree patriarchy still exists harmful great sure buddy whatever say point thanks girl logical fallacies bread butter incels female incelsfemcels aka feminists stupid delusional point fail understand issues gender mutually exclusive women face x issue mean men face x issue women face issue one scale mean issues men face different scale irrelevant acceptable kind thinking regressive way progressive issues men face discounted saying women face x z issues issues women face discounted saying men face x z issues called people want gender equality quick trivialize mens issue citing different issues women face get arms womens issues trivialized hypocritical say isnt man vs women issue man vs feminists issue women identify feminists many feminists know abandoned label actions feminists actions female incels similar across globe example feminists india protested gender neutral rape laws successful truly sick individuals want make sure rape one gender legal feminists trying protect women rape men better incels support andrew tate see respect feministsfemcels incels really similar another example feminists vocal gender neutral dv laws protects male victims victimization mutually exclusive case rape dv even many studies stats present shows considerable amount men victims dv rape see feminists reinforcing gender stereotypes process reinforcing supporting patriarchy considering india feminists supporting female incels rape men abuse men wonder anti feminism rampant point anti feminism synonymous anti female inceldom",
    "light_cleaned_title": "Days after Atul Subhash, a Bengaluru police constable's body is found after he jumped in front of a train. The suicide note mentions harassment by his wife and her family members.",
    "light_cleaned_selftext": "Legal & social systemic bias against male victims of abuse is so bad that a head constable of police was also completely powerless against domestic abuse by his wife and her family. A man dies by suicide in India every 4 minutes, and the rate of male suicide in India is growing 9 times faster than women. This is now the fastest accelerating male suicide rate in the whole world. India is the only country where working class men deal with provider pressure and systemic legal bias both oppressing them, leaving millions to fall between the cracks.",
    "light_cleaned_comments": "Source: more and more such reports of male suicides will surface over the next few weeks…. And watch the neo-feminist, man-hating movement take over this as well and attempt to explain their plight to be worse and blame the men for that also…. I feel really bad for the train driver, some people just have zero consideration for others Its real sad Yep, the wife was really inconsiderate. But what did the poor train driver do to be traumatized by this? He had no part in this. The train driver is not the first victim in this country. You sound like you have never seen any evil in society. Anyone who attempts to derail this conversation, call them out because they can be many things but feminist is not one of them. Anyone who attempts to undermine experiences of male victims are misandrists. And misandry and feminism are kinda incompatible. I recall a thread on twoX about how misandry isn't a real thing, we must question feminism instead of shaming it; a few flawed individuals shouldn't be allowed to gatekeep feminism. This is not a man vs woman issue but rather a systemic one. Instead of creating an us vs them scenario, we all should come together and find solutions for them. And they are right, the plight of women is worse statistically and frankly its quite obvious. More such reports will appear because such news are picked up more by the public after a similar popular event has occured, otherwise no one would have cared. I agree with you, in an ideal world this is not a man v women issue…. But just for some reality check, on the very issue of Athletics Subhash, the protest kn Delhi, what % of the protesters are women? Less than 10%. So much as your comment comes from a place of “less not do man v women , and we all must come together and solve this”, just a casual survey of the outrage demographics should give you the answer. Also, when any such issues against men is raised, I assure you the number of men who are outraged at that is far higher, because we know that we have to support our women. Where is the support in the other direction? All I hear and see is more man hate [source ](https://indiankanoon.org/doc/167238818/) He committed a rape-murder case on a minor, and was charged with life imprisonment in 2020, when he was 29 years old. He committed suicide in 2024 due to this charge. Please research more carefully. Yes but he's just as much a victim. Nobody should suffer the trauma where they end up witnessing someone using them involuntarily to commit suicide Ye sb feminism nonsense hai. He was an innocent victim who fell to harassment from his wife. Men are very oppressed in India and women have lots of benefits. /s It is expected for men to relate more to male related issues just like it happens to women in their case. I dont think its appropriate to look at those self proclaimed feminists who dont sympathise with men related issues and paint them as the view of feminism. Increse in women issues lead them to take the stand for themselves in the form of feminism (as most of them were due to men even if one thinks those men are small in number, others havent done much to help these women otherwise we would have seen a decline in this issue). Women historically have been subjected to poor treatment and have less voice in the society, a situation which is not improving sufficiently. When women hear about cases of domestic abuse, rape, they are bound to feel a sense on distrust with men and sometimes even hate them. I personally sympathise with them and feel that it is sort of the blame of male community as whole, But it should not come out as injustice and harm against innocent men All dead men are saints /s So would you be ok with Men sitting on the sidelines during issues of hardships against women? Or would your expect men to help and voice and be supportive of women? Your comment seems to intend to gaslight men into thinking their issues are their problems only… and women issues are also men’s issue since they have caused majority of them.. which is EXACTLY what my original comment that you replied to, was about… congratulations we have come full circle ! In my personal observation, it seems that many women in India pay little attention to issues affecting men. However, a single mention of a woman being raped often shocks an entire family, as rape against women is regarded as one of the most heinous crimes in society—which is justified. But this raises an important question: why is there so little discussion about male rape? Statistics suggest that most cases of male rape are perpetrated by women rather than other men, yet these figures rarely, if ever, receive attention in public discourse. At this point, I’ve stopped expecting much understanding or acknowledgment from most women regarding these issues. It feels like men must stand together and support one another because, in the end, we only have ourselves to rely on. Man, India is so polarized on Gender that people are willing to eat shitty and false narrative just to talk trash about the other gender. Seems to me the people rooting for equality and for the society to get less patriarchal didn't account for overall consequences. So, you sympathize with them because society treats them poorly? I find this argument unconvincing because the same could be said about male rape cases, which are significantly high when cases of women assaulting men are included. In fact, the numbers are comparable to those of female rape cases, yet male victims receive no level of attention or empathy. If a man is raped by a woman then he is supposed to keep it to himself forever till he dies. There's another fake news like this being spread [wife harassment ](https://x.com/StoicOnWheels/status/1867539153497600230?t=c47d7qkT8sj2N7o21snVuA&s=19) When in reality the guy committed suicide due to some property dispute and politics. hmmm, he committed a rape-murder case on a minor, and was charged with life imprisonment in 2020, when he was 29 years old. He committed suicide in 2024 due to this charge. Tbh did not even read the post. I just made a blanket opinion because I think there's truth to it. I never said men should sit outside during issues of hardship against women. I actually said that men arent doing enough to resolve, yes because they are majorly caused by them. I never said that mens issues are only their issue. My previous comment was because in your reply to my 1st comment, where you said that men were voicing a lot for women which is simply not the case nor is it sufficient to resolve the issue. Men havent cretaed a sense of trust in the eyes of women and thus they voice a lot less than compared to for themselves as it is an almost daily and more frequent problem for them. Surely some will take mens issues lightly which is wrong, but when some men act as if they are in eternal danger in an unequal world for men whereas actually they have been the one dominating, women do feel a sense of their issues not being taken seriously Numbers are not comparable to female rape cases, what?? I have a problem with those men considering their issues as bigger problem than men and due to those 'feminists'. This creates a situation where actually majorly affected group of women feel that their problems are highjacked. I agree that mens issues are not taken seriosly by society, but another thought is that society is itself majorly dominated by men. First men need to organise themselves and speak against all forms of gender injustice. This gets masked by those men who do injustices agianst women I belive that like minded people should come together and strive to make better reforms so that we all collectively have to deal less with this Men rape does not get much attention unfortunately. I think this might be beacuse women rape is a much much more prevalent and likely occurence whereas male rape is an anomaly. Men need to take issue into their own hands and voice against them, surely all those who oppose inujstices agianst men will join and it will also include women. This entire comment is gaslighting of men again…. Like wth… ? According to you the issues against men is a result of all men, but the issues against women are a result of a few bad apples… and therefore the entirety of women are unable to relate and hence keep quiet… this is your argument? no sane man will argue that women have a rough road in India; or that ther are many issues that need more support; but at least that’s acknowledging the problem. Educated women seem to think male issues are non-existent… More than sympathy, I see them just pouncing at every opportunity to willify women and fuel the \"women bad\" narrative. The no. of upvotes to posts like these are concerning. As someone said once, The reason why this case is getting such publicity esp by the male demographic is not because they want justice but because it plays into their fantasy of women being oppressors. It allows them to voice their desires about taking away the \"rights\" they've bestowed. Why do they so badly want to be oppressed by women? Mommy issues? /s 🤠 I don’t get why killing yourself is seen as a proof of being ‘innocent’ in India. Pent up anger from the government fucking them everywhere. They find women on the lower end of the food chain so... Ikr! They want to cancel the issues women face. It's extremely common for, well, narcissists, for lack of a better word, to play the victim. It's called DARVO (Deny, Attack, Reverse Victim and Offender), and men have been doing it a LOT lately. Bro, patriarchy also contributes to male suicides by making men seem emasculated for seeking mental health, or even crying. Patriarchy means nothing but the assigned gender role of men being strong logical creatures who are meant to run the world, and women to serve them. This leaves little room for men to have emotions, to express them with safe outlets. Male mental health is a complex issue more nuanced than a simple men vs “evil feminists” warfare. 30-35 years back men/in-laws used to abuse daughter-in-law. Then laws(498A/B, Domestic violence etc...) were made which were created to take care of that but now they are being misused by women to abuse mother-in-law and husband. Don't know where this will lead to? and when it will come to end? Lot of baggage you got there. I didn't even mention feminism. Oh you didn’t know? Death absolves every one of all their crimes unless they are NOT male. Facts. Male victimhood and male supremacy have always been two sides of the same coin. Patriarchy harms men and little boys. Sure. The millenials must be just flourishing without it. Numbers are comparable to female rape cases, there has been several studies and surveys done by US/UK which clearly shows that a massive number of men gets raped by women yearly, it's just most people in India live under the rock to never question the reality. There is no bigger issue, both male & female rape are same and should be seen through same lenses but one has laws/police/media on their side while the other gender have nothing with them, men after being raped by their woman will still have to pay the alimony. I don't even want to talk about DV here or the cheating laws. Wait, why men alone? When a female was raped then almost half of the people who protests are male, yet when we don't even have a fucking law to protect ourselves and still women can't protest together? Why is that only one gender needs to work on it. I strictly believe that both genders should have worked on it and discussed about it but I have never seen a single woman in India ever spoke a word about this topic. I don't have any trust left from opposite sex to ever raise their voice for men. They'd rather be misinformed about male rape and call it a day. In which utopia? The one where you are able to read sarcasm So you agree patriarchy still exists and is harmful. Great. Sure buddy. Whatever you say at this point. Thanks girl! Logical fallacies are the bread and butter of incels and female incels/femcels aka feminists. They are so stupid and delusional to the point where they fail to understand that issues of gender are not mutually exclusive. Just because women face x issue does not mean men do not face x issue. Just because women face an issue on one scale does not mean that the issues men face on a different scale are irrelevant or acceptable. This kind of thinking is regressive and it's in no way progressive. The issues men face should not be discounted by saying that women face x or y or z issues and the issues women face should not be discounted by saying that men face x or y or z issues. The so called people who want gender equality are quick to trivialize men's issue by citing different issues women face but they get all up in arms when women's issues are trivialized. This is hypocritical of them. But I do have to say that this isn't a man vs women issue. This is a man vs feminists issue. Not all women identify as feminists. Many feminists I know have abandoned the label because the actions of feminists and the actions of female incels are very similar all across the globe. For example, feminists in India protested against gender neutral rape laws and they were successful. Only truly sick individuals will want to make sure that rape of one gender is legal. If the feminists are trying to protect women who rape men, then they are no better than the incels who support andrew tate. You can see how in this respect, feminists/femcels and incels are really similar. Another example is the feminists being vocal against gender neutral DV laws that protects male victims. Victimization is not mutually exclusive in case of rape or DV. Even many studies and stats are present that shows that considerable amount of men are victims of DV and rape. You can see how feminists are reinforcing gender stereotypes and in the process reinforcing and supporting patriarchy. Considering how in India, feminists are supporting female incels who rape men and abuse men, It's no wonder anti feminism is rampant. At this point, anti feminism is synonymous to anti female inceldom."
}