{
    "id": "16nfh9x",
    "title": "Jaypee homebuyers not delivered flats since last 14 years",
    "url": "https://www.hindustantimes.com/cities/noida-news/jaypee-homebuyers-demand-flat-delivery-101695146889338.html",
    "selftext": "My father bought this flat in 2010 with a delivery date of 2013, it’s 2023 still no flat has been delivered . There are 22000 like us with no help from government. People took loan for the flat payment and and now stuck with paying both emi’s and rent with no idea when the flat procession will be given. \n\nToday we did a rally outside the Jaypee office with the intention that this would be highlighted at a greater scale. \n\nRequest you all to share pls and help the poor homebuyers",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 10,
    "created_utc": 1695196884.0,
    "convurl": "https://external-preview.redd.it/2qKhuR_YaiHQP3t0sWOQdbv3CNXiitENSLIECZo56ec.jpg?auto=webp&s=ea191f68b9986ba49e4d54a09c223828088c3253",
    "comments": [
        " https://x.com/Rashmi_S23/status/1704394395704029584?t=2bz65GF5d9i_CownG5IBdg&s=08",
        "https://preview.redd.it/our94yfsadpb1.jpeg?width=621&format=pjpg&auto=webp&s=06908c6f78a7a1a9464163fb6a40921c8c3e765d",
        "you could make a case for payment of the emis and rent from the builders. since these reassurances would be verbal mostly, i dont know about its validity. One important thing is that 22000 people are a huge number to argue against.\n\nyou need a lawyer with huge balls, though.",
        "The case is already in Supreme Court and after 14 years they roped in a new builder who finally agreed to build the flats but now Nclt and yeida are again putting nonsense demands from that builder . No body wants to prioritise the homebuyers. Sometimes it feels we public is so helpless man",
        "Pls retweet",
        "did the supreme court reach a verdict or they are also look like they will take a century to do it?\n\n&#x200B;\n\ni really feel for you man, and i hope you get this resolved.",
        "The promoters of jaypee are no longer the promoters of jaypee if that makes sense. No point rallying outside the Jaypee office because no one there has skin in the game anymore. They moved on to other companies such as Gaursons. \n\nQuite unfortunate but best would be to trouble Surkasha Group as they are to be delivering on it.",
        "That is true - suraksha people are also sitting inside this Jaypee office only",
        "No completely - the did give the bid to suraksha a construction company to build the houses but now again their is a deadlock between the demands of up development authority and that company . Amidst all this only the homebuyers are suffering",
        "Never buy unfinished flats in India.\n\nA lot of states have had similar stories happen to them in the past decade.\n\nAlso make sure that it's a RERA project.",
        "Jay pee - why anyone trust a name like this? \n\n/s",
        "Worst thing is 95% of the people are just silent spectator , they have lost all hope\nI think , they don’t join rally or anything",
        "This was bought before RERA came into existence and I agree - learned it the hard way - but only buy finished flats",
        "Contact Congress leader RG"
    ],
    "cleaned_text": "jaypee homebuyers delivered flats since last years father bought flat delivery date still flat delivered like us help government people took loan flat payment stuck paying emis rent idea flat procession given today rally outside jaypee office intention would highlighted greater scale request share pls help poor homebuyers ",
    "cleaned_title": "jaypee homebuyers delivered flats since last years",
    "cleaned_selftext": "father bought flat delivery date still flat delivered like us help government people took loan flat payment stuck paying emis rent idea flat procession given today rally outside jaypee office intention would highlighted greater scale request share pls help poor homebuyers",
    "cleaned_comments": "could make case payment emis rent builders since reassurances would verbal mostly dont know validity one important thing people huge number argue need lawyer huge balls though case already supreme court years roped new builder finally agreed build flats nclt yeida putting nonsense demands builder body wants prioritise homebuyers sometimes feels public helpless man pls retweet supreme court reach verdict also look like take century xb really feel man hope get resolved promoters jaypee longer promoters jaypee makes sense point rallying outside jaypee office one skin game anymore moved companies gaursons quite unfortunate best would trouble surkasha group delivering true suraksha people also sitting inside jaypee office completely give bid suraksha construction company build houses deadlock demands development authority company amidst homebuyers suffering never buy unfinished flats india lot states similar stories happen past decade also make sure rera project jay pee anyone trust name like worst thing people silent spectator lost hope think dont join rally anything bought rera came existence agree learned hard way buy finished flats contact congress leader rg",
    "light_cleaned_title": "Jaypee homebuyers not delivered flats since last 14 years",
    "light_cleaned_selftext": "My father bought this flat in 2010 with a delivery date of 2013, it’s 2023 still no flat has been delivered . There are 22000 like us with no help from government. People took loan for the flat payment and and now stuck with paying both emi’s and rent with no idea when the flat procession will be given. Today we did a rally outside the Jaypee office with the intention that this would be highlighted at a greater scale. Request you all to share pls and help the poor homebuyers",
    "light_cleaned_comments": "you could make a case for payment of the emis and rent from the builders. since these reassurances would be verbal mostly, i dont know about its validity. One important thing is that 22000 people are a huge number to argue against. you need a lawyer with huge balls, though. The case is already in Supreme Court and after 14 years they roped in a new builder who finally agreed to build the flats but now Nclt and yeida are again putting nonsense demands from that builder . No body wants to prioritise the homebuyers. Sometimes it feels we public is so helpless man Pls retweet did the supreme court reach a verdict or they are also look like they will take a century to do it? &#x200B; i really feel for you man, and i hope you get this resolved. The promoters of jaypee are no longer the promoters of jaypee if that makes sense. No point rallying outside the Jaypee office because no one there has skin in the game anymore. They moved on to other companies such as Gaursons. Quite unfortunate but best would be to trouble Surkasha Group as they are to be delivering on it. That is true - suraksha people are also sitting inside this Jaypee office only No completely - the did give the bid to suraksha a construction company to build the houses but now again their is a deadlock between the demands of up development authority and that company . Amidst all this only the homebuyers are suffering Never buy unfinished flats in India. A lot of states have had similar stories happen to them in the past decade. Also make sure that it's a RERA project. Jay pee - why anyone trust a name like this? /s Worst thing is 95% of the people are just silent spectator , they have lost all hope I think , they don’t join rally or anything This was bought before RERA came into existence and I agree - learned it the hard way - but only buy finished flats Contact Congress leader RG"
}