{
    "id": "15toeom",
    "title": "What has made Gadar 2 such a massive blockbuster Hit ??? let me know your views",
    "url": "https://www.reddit.com/r/india/comments/15toeom/what_has_made_gadar_2_such_a_massive_blockbuster/",
    "selftext": "  \n\nAs it was a long weekend, I decided it’s time to watch a good movie. I heard Gadar 2 was releasing on august 11 and so I thought ...why not check the second part. I recalled how Gadar was a super hit movie in the year 2001 and so I tried to book the tickets online. I was surprised to notice that the online tickets were filling up so fast that I decided not to waste time on the seats or rows but just booked the tickets that seemed to be vacant and Gosh it was a right decision!\n\nThe next day I visited the theatre with my family...it was Sunday evening and as I entered the theatre I was shocked to see the long lines of people waiting to enter the theatre. I don’t remember I had seen such long lines and yes I do recall that the time I once saw such long lines of people waiting was at the time of watching Titanic movie which I Went to watch with my friends at Regal theatre in Mumbai back in the year 1997 and trust me since then I have seen number of movies but I had never seen so much rush or crowd outside the theatre.\n\nAs I made my way inside the movie hall, I notice the entire theatre was Housefull and just like me most of the people had come to watch the movie with their families. As the movie started, I could understand the reason why it was Housefull. The movie showed our sunny paji with the same levels of energy, enthusiasm and spirit we saw way back in the first part. Amisha Patel looked stunningly beautiful but she seemed to have lost more weight than in the first part. The best part of this movie was even after a gap of 22 years most of the characters were still the same and one surprise part was sonny’s son in the movie jete who’s now grown up into a handsome young man played by Utkarsh Sharma. Also there’s a new addition to the family in the form of Muskan (Simrat Kaur) who plays the role perfectly and moves with her jetee to India.\n\nThe movie showed glimpses of past as the story moved on and direction of Anil Sharma was to the point and perfect. The emotions, the dialogue’s, the action and the family bond along with the patriotism created such an explosion in the theatre that the audience would just cheer up and repeat the dialogues of sunny paji. Every time he made the entry the audience would clap or cheer for him.\n\nThe audience was enjoying every bit of the movie and the way sunny paji gave blows to the General or the army people in the movie.\n\nAs I walked out of the movie hall, I saw every one coming out with energy, shouting, cheering for India and repeating the movie dialogues. I wondered about those critic ratings I have read and seen for this movie and most of them gave a 2 or maximum 3 stars for this movie... but what the critics failed to understand was that the audience was emotionally connected with the movie and that’s the biggest reason that this movie is getting bigger and bigger day by day in terms of box office earnings and also worldwide.\n\nWhat’s more interesting is that the movie has built such a momentum that people have not starting asking for Gadar part 3 as the audience seems too much connected and involved with Tara sing his family and his love for the country.\n\nDo click on this link to watch more about Gadar 2 https://youtu.be/BM6I-KDjukE let me know your comments and views do you wish to watch Gadar 3???\n\nOne thing I would also like to mention is there is no fake PR campaigns in this movie. it’s as clean as our Sunny paji’s character. The people who made the movie are so down to earth intact some reports started sunny deol charged only Rs.20 cr for this movie and still he going on strong. Some experts say it may cross 2000 cr and so on…For me I enjoyed each and every moment of the movie as I cheered with the crowd and my heart filled with the emotions of an Indian proud to be called an Indian. So if you have not watched this movie yet do watch this movie with your family in the theatres and trust me you will love each and every moment of this movie right from the hand pump scene to the melodious song “Main niklaa Gaddi lekar .. to the hammer banging scenes of Sunny paji and bashing the General.\n\nIt’s a total paisaa wasool movie and offers you much more than just a movie.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692280654.0,
    "convurl": "https://external-preview.redd.it/qt_4jaIKGev8H5Ypy1KXxM0QBtS2EM4WP1i7OzDQBRg.jpg?auto=webp&s=e8a6e8c4e89803ab048fc39a7336b57c707a7d4f",
    "comments": [
        "A post written by social media intern at PR",
        "Interesting. I heard it was shit.",
        "I swear..",
        "You heard, I witnessed. It was shit.",
        "I only saw bhakts going gaga over this movie as their favourite nail polish is gifted to them.",
        "This post reads so unoriginal and chatgpt like.",
        "sequel to a hit film",
        "way better than the propaganda called kerala story atleast it's fictional and does not make up incidents",
        "Well atleast the team didn't prayed to namazi for a better opening."
    ],
    "cleaned_text": "made gadar massive blockbuster hit let know views long weekend decided time watch good movie heard gadar releasing august thought check second part recalled gadar super hit movie year tried book tickets online surprised notice online tickets filling fast decided waste time seats rows booked tickets seemed vacant gosh right decision next day visited theatre familyit sunday evening entered theatre shocked see long lines people waiting enter theatre dont remember seen long lines yes recall time saw long lines people waiting time watching titanic movie went watch friends regal theatre mumbai back year trust since seen number movies never seen much rush crowd outside theatre made way inside movie hall notice entire theatre housefull like people come watch movie families movie started could understand reason housefull movie showed sunny paji levels energy enthusiasm spirit saw way back first part amisha patel looked stunningly beautiful seemed lost weight first part best part movie even gap years characters still one surprise part sonnys son movie jete whos grown handsome young man played utkarsh sharma also theres new addition family form muskan simrat kaur plays role perfectly moves jetee india movie showed glimpses past story moved direction anil sharma point perfect emotions dialogues action family bond along patriotism created explosion theatre audience would cheer repeat dialogues sunny paji every time made entry audience would clap cheer audience enjoying every bit movie way sunny paji gave blows general army people movie walked movie hall saw every one coming energy shouting cheering india repeating movie dialogues wondered critic ratings read seen movie gave maximum stars movie critics failed understand audience emotionally connected movie thats biggest reason movie getting bigger bigger day day terms box office earnings also worldwide whats interesting movie built momentum people starting asking gadar part audience seems much connected involved tara sing family love country click link watch gadar let know comments views wish watch gadar one thing would also like mention fake pr campaigns movie clean sunny pajis character people made movie earth intact reports started sunny deol charged rs cr movie still going strong experts say may cross cr onfor enjoyed every moment movie cheered crowd heart filled emotions indian proud called indian watched movie yet watch movie family theatres trust love every moment movie right hand pump scene melodious song main niklaa gaddi lekar hammer banging scenes sunny paji bashing general total paisaa wasool movie offers much movie ",
    "cleaned_title": "made gadar massive blockbuster hit let know views",
    "cleaned_selftext": "long weekend decided time watch good movie heard gadar releasing august thought check second part recalled gadar super hit movie year tried book tickets online surprised notice online tickets filling fast decided waste time seats rows booked tickets seemed vacant gosh right decision next day visited theatre familyit sunday evening entered theatre shocked see long lines people waiting enter theatre dont remember seen long lines yes recall time saw long lines people waiting time watching titanic movie went watch friends regal theatre mumbai back year trust since seen number movies never seen much rush crowd outside theatre made way inside movie hall notice entire theatre housefull like people come watch movie families movie started could understand reason housefull movie showed sunny paji levels energy enthusiasm spirit saw way back first part amisha patel looked stunningly beautiful seemed lost weight first part best part movie even gap years characters still one surprise part sonnys son movie jete whos grown handsome young man played utkarsh sharma also theres new addition family form muskan simrat kaur plays role perfectly moves jetee india movie showed glimpses past story moved direction anil sharma point perfect emotions dialogues action family bond along patriotism created explosion theatre audience would cheer repeat dialogues sunny paji every time made entry audience would clap cheer audience enjoying every bit movie way sunny paji gave blows general army people movie walked movie hall saw every one coming energy shouting cheering india repeating movie dialogues wondered critic ratings read seen movie gave maximum stars movie critics failed understand audience emotionally connected movie thats biggest reason movie getting bigger bigger day day terms box office earnings also worldwide whats interesting movie built momentum people starting asking gadar part audience seems much connected involved tara sing family love country click link watch gadar let know comments views wish watch gadar one thing would also like mention fake pr campaigns movie clean sunny pajis character people made movie earth intact reports started sunny deol charged rs cr movie still going strong experts say may cross cr onfor enjoyed every moment movie cheered crowd heart filled emotions indian proud called indian watched movie yet watch movie family theatres trust love every moment movie right hand pump scene melodious song main niklaa gaddi lekar hammer banging scenes sunny paji bashing general total paisaa wasool movie offers much movie",
    "cleaned_comments": "post written social media intern pr interesting heard shit swear heard witnessed shit saw bhakts going gaga movie favourite nail polish gifted post reads unoriginal chatgpt like sequel hit film way better propaganda called kerala story atleast fictional make incidents well atleast team didnt prayed namazi better opening",
    "light_cleaned_title": "What has made Gadar 2 such a massive blockbuster Hit ??? let me know your views",
    "light_cleaned_selftext": "As it was a long weekend, I decided it’s time to watch a good movie. I heard Gadar 2 was releasing on august 11 and so I thought ...why not check the second part. I recalled how Gadar was a super hit movie in the year 2001 and so I tried to book the tickets online. I was surprised to notice that the online tickets were filling up so fast that I decided not to waste time on the seats or rows but just booked the tickets that seemed to be vacant and Gosh it was a right decision! The next day I visited the theatre with my family...it was Sunday evening and as I entered the theatre I was shocked to see the long lines of people waiting to enter the theatre. I don’t remember I had seen such long lines and yes I do recall that the time I once saw such long lines of people waiting was at the time of watching Titanic movie which I Went to watch with my friends at Regal theatre in Mumbai back in the year 1997 and trust me since then I have seen number of movies but I had never seen so much rush or crowd outside the theatre. As I made my way inside the movie hall, I notice the entire theatre was Housefull and just like me most of the people had come to watch the movie with their families. As the movie started, I could understand the reason why it was Housefull. The movie showed our sunny paji with the same levels of energy, enthusiasm and spirit we saw way back in the first part. Amisha Patel looked stunningly beautiful but she seemed to have lost more weight than in the first part. The best part of this movie was even after a gap of 22 years most of the characters were still the same and one surprise part was sonny’s son in the movie jete who’s now grown up into a handsome young man played by Utkarsh Sharma. Also there’s a new addition to the family in the form of Muskan (Simrat Kaur) who plays the role perfectly and moves with her jetee to India. The movie showed glimpses of past as the story moved on and direction of Anil Sharma was to the point and perfect. The emotions, the dialogue’s, the action and the family bond along with the patriotism created such an explosion in the theatre that the audience would just cheer up and repeat the dialogues of sunny paji. Every time he made the entry the audience would clap or cheer for him. The audience was enjoying every bit of the movie and the way sunny paji gave blows to the General or the army people in the movie. As I walked out of the movie hall, I saw every one coming out with energy, shouting, cheering for India and repeating the movie dialogues. I wondered about those critic ratings I have read and seen for this movie and most of them gave a 2 or maximum 3 stars for this movie... but what the critics failed to understand was that the audience was emotionally connected with the movie and that’s the biggest reason that this movie is getting bigger and bigger day by day in terms of box office earnings and also worldwide. What’s more interesting is that the movie has built such a momentum that people have not starting asking for Gadar part 3 as the audience seems too much connected and involved with Tara sing his family and his love for the country. Do click on this link to watch more about Gadar 2 let me know your comments and views do you wish to watch Gadar 3??? One thing I would also like to mention is there is no fake PR campaigns in this movie. it’s as clean as our Sunny paji’s character. The people who made the movie are so down to earth intact some reports started sunny deol charged only Rs.20 cr for this movie and still he going on strong. Some experts say it may cross 2000 cr and so on…For me I enjoyed each and every moment of the movie as I cheered with the crowd and my heart filled with the emotions of an Indian proud to be called an Indian. So if you have not watched this movie yet do watch this movie with your family in the theatres and trust me you will love each and every moment of this movie right from the hand pump scene to the melodious song “Main niklaa Gaddi lekar .. to the hammer banging scenes of Sunny paji and bashing the General. It’s a total paisaa wasool movie and offers you much more than just a movie.",
    "light_cleaned_comments": "A post written by social media intern at PR Interesting. I heard it was shit. I swear.. You heard, I witnessed. It was shit. I only saw bhakts going gaga over this movie as their favourite nail polish is gifted to them. This post reads so unoriginal and chatgpt like. sequel to a hit film way better than the propaganda called kerala story atleast it's fictional and does not make up incidents Well atleast the team didn't prayed to namazi for a better opening."
}