{
    "id": "158xp10",
    "title": "Passport verification: Bengaluru constable suspended for taking bribe",
    "url": "https://www.deccanherald.com/city/bengaluru-crime/passport-verification-bengaluru-constable-suspended-for-taking-bribe-1239718.html",
    "selftext": "\"Shivakumar, in charge of passport verification at the Parappana Agrahara police station, was suspended following a complaint registered through feedback submitted after scanning the QR code introduced in all the police stations under the name Loka Spandana. \"\n\n\"Loka Spandana is a new initiative of the Bengaluru city police that allows visitors to give feedback about their experience by scanning the QR code installed at the police station.\"",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1690259537.0,
    "convurl": "https://external-preview.redd.it/qnxXlSSx5EmPmlKn4pP2KG5Xo9ZOiTe9SRl7x9qh1Ss.jpg?auto=webp&s=47985c8b5c72360be5033062fc018727fa9e95b1",
    "comments": [],
    "cleaned_text": "passport verification bengaluru constable suspended taking bribe shivakumar charge passport verification parappana agrahara police station suspended following complaint registered feedback submitted scanning qr code introduced police stations name loka spandana loka spandana new initiative bengaluru city police allows visitors give feedback experience scanning qr code installed police station ",
    "cleaned_title": "passport verification bengaluru constable suspended taking bribe",
    "cleaned_selftext": "shivakumar charge passport verification parappana agrahara police station suspended following complaint registered feedback submitted scanning qr code introduced police stations name loka spandana loka spandana new initiative bengaluru city police allows visitors give feedback experience scanning qr code installed police station",
    "cleaned_comments": "",
    "light_cleaned_title": "Passport verification: Bengaluru constable suspended for taking bribe",
    "light_cleaned_selftext": "\"Shivakumar, in charge of passport verification at the Parappana Agrahara police station, was suspended following a complaint registered through feedback submitted after scanning the QR code introduced in all the police stations under the name Loka Spandana. \" \"Loka Spandana is a new initiative of the Bengaluru city police that allows visitors to give feedback about their experience by scanning the QR code installed at the police station.\"",
    "light_cleaned_comments": ""
}