{
    "id": "16v2izt",
    "title": "Dr. Kabil khans interview. The one who was targeted by UP gov, for being a hero.",
    "url": "https://youtu.be/pn42jeSa9hg?si=3kxJooY4ThQ3Rxcn",
    "selftext": "The start is Malayalam but the interview is in English...",
    "flair": "Politics",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1695963703.0,
    "convurl": "https://external-preview.redd.it/riHITpcCwZWEMxmAgKuHe6w_trJodxi8QUdMluhxMfE.jpg?auto=webp&s=81e584a293a78497d8676929079c3b3dca5b419f",
    "comments": [
        "Isn't his name Kafeel Khan? His only fault was trying to save the life of young children. Of course Little Fanta the hero of  UP did not want Kafeel Khan to be a hero by saving dying children.",
        "What he is saying is heart touching, 1 year in jail for doing his duty to his fellow citizens. And those who were supposed to take care of their citizens were waiting for 10% commission",
        "They tried harming his family and reputation also. His only fault is he was kind towards his patients. If people in power were 1%  as kind hearted as him,our nation would have been much better.\n\nIndia is a rich country where the rulers prevent the wealth being used for the welfare of its people."
    ],
    "cleaned_text": "dr kabil khans interview one targeted gov hero start malayalam interview english ",
    "cleaned_title": "dr kabil khans interview one targeted gov hero",
    "cleaned_selftext": "start malayalam interview english",
    "cleaned_comments": "isnt name kafeel khan fault trying save life young children course little fanta hero want kafeel khan hero saving dying children saying heart touching year jail duty fellow citizens supposed take care citizens waiting commission tried harming family reputation also fault kind towards patients people power kind hearted himour nation would much better india rich country rulers prevent wealth used welfare people",
    "light_cleaned_title": "Dr. Kabil khans interview. The one who was targeted by UP gov, for being a hero.",
    "light_cleaned_selftext": "The start is Malayalam but the interview is in English...",
    "light_cleaned_comments": "Isn't his name Kafeel Khan? His only fault was trying to save the life of young children. Of course Little Fanta the hero of UP did not want Kafeel Khan to be a hero by saving dying children. What he is saying is heart touching, 1 year in jail for doing his duty to his fellow citizens. And those who were supposed to take care of their citizens were waiting for 10% commission They tried harming his family and reputation also. His only fault is he was kind towards his patients. If people in power were 1% as kind hearted as him,our nation would have been much better. India is a rich country where the rulers prevent the wealth being used for the welfare of its people."
}