{
    "id": "16benyy",
    "title": "We do not involve in scams, because...",
    "url": "https://www.reddit.com/r/india/comments/16benyy/we_do_not_involve_in_scams_because/",
    "selftext": "We're master extortionists bro\n\nhttps://www.livemint.com/news/india/demand-for-2-3-tn-sparked-rbi-govt-clash-says-acharya/amp-11693852197905.html",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693988987.0,
    "convurl": "https://external-preview.redd.it/oo408o6UwLV3lxTJhcfGIg5bvjuIgD4e8jekkQ1q4t4.jpg?auto=webp&s=432b3afd537fb705aefff1e35f2049b5d17c7320",
    "comments": [
        "Do you not see the difference? The money govt was asking for was for its expenditure.\n\nAlso, the money it was asking for doesn't belong to RBI. This is a better explainer: https://www.capitalmind.in/2018/12/abeyaar-rbi-is-hoarding-too-much-capital-and-can-pay-a-chunk-to-the-government/",
        "Ever wonder how legit information sources are behind paywalls, and bakwaas misinformation websites are free to everyone \n\nFunny how that works",
        "Worst article written by an asshole.. RBI isn't country's enemy.. it's main objective is to protect nation's wealth and maintain financial stability..",
        "Lol. Imagine thinking election expenditure is something RBI should give."
    ],
    "cleaned_text": "involve scams master extortionists bro ",
    "cleaned_title": "involve scams",
    "cleaned_selftext": "master extortionists bro",
    "cleaned_comments": "see difference money govt asking expenditure also money asking doesnt belong rbi better explainer ever wonder legit information sources behind paywalls bakwaas misinformation websites free everyone funny works worst article written asshole rbi isnt countrys enemy main objective protect nations wealth maintain financial stability lol imagine thinking election expenditure something rbi give",
    "light_cleaned_title": "We do not involve in scams, because...",
    "light_cleaned_selftext": "We're master extortionists bro",
    "light_cleaned_comments": "Do you not see the difference? The money govt was asking for was for its expenditure. Also, the money it was asking for doesn't belong to RBI. This is a better explainer: Ever wonder how legit information sources are behind paywalls, and bakwaas misinformation websites are free to everyone Funny how that works Worst article written by an asshole.. RBI isn't country's enemy.. it's main objective is to protect nation's wealth and maintain financial stability.. Lol. Imagine thinking election expenditure is something RBI should give."
}