{
    "id": "15tbxdb",
    "title": "Is there a workaround with attachment error while filing EPFO Grievance?",
    "url": "https://www.reddit.com/r/india/comments/15tbxdb/is_there_a_workaround_with_attachment_error_while/",
    "selftext": "I'm stuck in an endless loop. When creating a grievance, I'm not able to upload a pdf file as it's giving me this error\n\n&#x200B;\n\nhttps://preview.redd.it/uxsfyh9felib1.png?width=668&format=png&auto=webp&s=ef826581132de7bd6c52625367e43d0bb91e19e7\n\nAnd since it's a mandatory to have an attachment, I cannot submit the form also as it's giving me \"Please attach document\" message upon doing so.\n\nThe attachment size is also less (less than 150kb), it's a PDF file (which is the only one accepted), so unsure how to proceed ahead.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692244171.0,
    "convurl": "https://b.thumbs.redditmedia.com/xHWemjXFsQzww2Vu_BsaEksCwNuoeITsKcuTaNqLwNU.jpg",
    "comments": [
        "Change the name of file to small 4-6 letter word without any special characters and spaces and try again",
        "Try reducing the length of the name.",
        "Thanks. That did the trick. But I got another problem. Updated OP with details.",
        "Thanks. That did the trick. But another problem arose. Updated OP with details.",
        "That i cannot help with - i dont live in India and havent used the portal.. it was a guess looking at what cud have gone wrong",
        "Ok for tracking number, try raising another grievance. It will show an error saying you have already raised a grievance with so and so tracking number. Copy that. That's how I found mine.",
        "No problem. Appreciate your inputs.",
        "Let me try that out.",
        "Yep, this works. Thanks for the tip.",
        ">how \n\nhappy to help",
        "Great! It worked! Thanks",
        "Hi all, I have reduced the name of the file to 3 character length and its size is 78 Kb and its in Pdf format. Still I am facing the issue that error uploading the document",
        "Try during working hours (10 to 5)",
        "I did during this time only. The error keeps on coming."
    ],
    "cleaned_text": "workaround attachment error filing epfo grievance im stuck endless loop creating grievance im able upload pdf file giving error xb since mandatory attachment submit form also giving please attach document message upon attachment size also less less kb pdf file one accepted unsure proceed ahead ",
    "cleaned_title": "workaround attachment error filing epfo grievance",
    "cleaned_selftext": "im stuck endless loop creating grievance im able upload pdf file giving error xb since mandatory attachment submit form also giving please attach document message upon attachment size also less less kb pdf file one accepted unsure proceed ahead",
    "cleaned_comments": "change name file small letter word without special characters spaces try try reducing length name thanks trick got another problem updated op details thanks trick another problem arose updated op details help dont live india havent used portal guess looking cud gone wrong ok tracking number try raising another grievance show error saying already raised grievance tracking number copy thats found mine problem appreciate inputs let try yep works thanks tip happy help great worked thanks hi reduced name file character length size kb pdf format still facing issue error uploading document try working hours time error keeps coming",
    "light_cleaned_title": "Is there a workaround with attachment error while filing EPFO Grievance?",
    "light_cleaned_selftext": "I'm stuck in an endless loop. When creating a grievance, I'm not able to upload a pdf file as it's giving me this error &#x200B; And since it's a mandatory to have an attachment, I cannot submit the form also as it's giving me \"Please attach document\" message upon doing so. The attachment size is also less (less than 150kb), it's a PDF file (which is the only one accepted), so unsure how to proceed ahead.",
    "light_cleaned_comments": "Change the name of file to small 4-6 letter word without any special characters and spaces and try again Try reducing the length of the name. Thanks. That did the trick. But I got another problem. Updated OP with details. Thanks. That did the trick. But another problem arose. Updated OP with details. That i cannot help with - i dont live in India and havent used the portal.. it was a guess looking at what cud have gone wrong Ok for tracking number, try raising another grievance. It will show an error saying you have already raised a grievance with so and so tracking number. Copy that. That's how I found mine. No problem. Appreciate your inputs. Let me try that out. Yep, this works. Thanks for the tip. >how happy to help Great! It worked! Thanks Hi all, I have reduced the name of the file to 3 character length and its size is 78 Kb and its in Pdf format. Still I am facing the issue that error uploading the document Try during working hours (10 to 5) I did during this time only. The error keeps on coming."
}