{
    "id": "1byo4mn",
    "title": "IMF distances itself from 8% growth projection for India: Report",
    "url": "https://www.reddit.com/r/india/comments/1byo4mn/imf_distances_itself_from_8_growth_projection_for/",
    "selftext": "**Good morning, everyone!**\n\n**IMF Distances Itself from India's Growth Projection**\n\nToday's news sheds light on the recent divergence between the International Monetary Fund (IMF) and Krishnamurthy Subramanian, an executive director at the IMF, regarding India's growth projection. Here's a closer look:\n\n**1. IMF's Clarification:** The IMF made it clear that the 8% growth projection attributed to Subramanian does not represent their official stance on India's economic growth.\n\n**2. Subramanian's Assertion:** Krishnamurthy Subramanian, India's representative at the IMF, put forward a bold projection of 8% growth for India's economy, diverging from the IMF's estimates.\n\n**3. IMF's Growth Estimate:** Contrary to Subramanian's projection, the IMF anticipates India's GDP to expand by 6.7% in the fiscal year 2023–24, reflecting a more conservative outlook.\n\n**4. Official IMF View:** The IMF reiterated that Subramanian's growth figures do not align with their official views and forecasts for India's economic performance.\n\n**5. Subramanian's Response:** In response to IMF's statement, Subramanian defended his projection, citing past inaccuracies in IMF's economists' estimates regarding India's growth trajectory.\n\nSource- [https://www.indiatoday.in/business/story/imf-clarifies-krishnamurthy-subramanian-statement-about-india-growth-projections-2523822-2024-04-05](https://www.indiatoday.in/business/story/imf-clarifies-krishnamurthy-subramanian-statement-about-india-growth-projections-2523822-2024-04-05)",
    "flair": "Policy/Economy",
    "score": 64,
    "num_comments": 7,
    "created_utc": 1712547861.0,
    "convurl": "https://external-preview.redd.it/uCZYD9ItBFOBtv5O1p4n7MiK_Enyacj0Mpox77FqvGo.jpg?auto=webp&s=9d31c54e353668470237ed6875d4ecf29d06fc78",
    "comments": [
        "Bruh",
        "Don’t worry, ModiZee would create their own IMF.",
        "You dare say No to Modi, he will send ED to IMF 😀 also on a completely different note, I remember reading in a different article, parameters being used by current administration to calculate GDP are not inline with regular process being followed by others. Since I don’t have much insights on how it’s calculated vs how current Modi administration is doing, appreciate if anyone has more insights into this.",
        "Conspiracy of imf",
        "Hum apna khud ka IMF banayege aur apni desi report chapege",
        "How dare you question modinomics, we only track growth of adani here"
    ],
    "cleaned_text": "imf distances growth projection india report good morning everyone imf distances indias growth projection todays news sheds light recent divergence international monetary fund imf krishnamurthy subramanian executive director imf regarding indias growth projection heres closer look imfs clarification imf made clear growth projection attributed subramanian represent official stance indias economic growth subramanians assertion krishnamurthy subramanian indias representative imf put forward bold projection growth indias economy diverging imfs estimates imfs growth estimate contrary subramanians projection imf anticipates indias gdp expand fiscal year reflecting conservative outlook official imf view imf reiterated subramanians growth figures align official views forecasts indias economic performance subramanians response response imfs statement subramanian defended projection citing past inaccuracies imfs economists estimates regarding indias growth trajectory source httpswwwindiatodayinbusinessstoryimfclarifieskrishnamurthysubramanianstatementaboutindiagrowthprojectionshttpswwwindiatodayinbusinessstoryimfclarifieskrishnamurthysubramanianstatementaboutindiagrowthprojections ",
    "cleaned_title": "imf distances growth projection india report",
    "cleaned_selftext": "good morning everyone imf distances indias growth projection todays news sheds light recent divergence international monetary fund imf krishnamurthy subramanian executive director imf regarding indias growth projection heres closer look imfs clarification imf made clear growth projection attributed subramanian represent official stance indias economic growth subramanians assertion krishnamurthy subramanian indias representative imf put forward bold projection growth indias economy diverging imfs estimates imfs growth estimate contrary subramanians projection imf anticipates indias gdp expand fiscal year reflecting conservative outlook official imf view imf reiterated subramanians growth figures align official views forecasts indias economic performance subramanians response response imfs statement subramanian defended projection citing past inaccuracies imfs economists estimates regarding indias growth trajectory source httpswwwindiatodayinbusinessstoryimfclarifieskrishnamurthysubramanianstatementaboutindiagrowthprojectionshttpswwwindiatodayinbusinessstoryimfclarifieskrishnamurthysubramanianstatementaboutindiagrowthprojections",
    "cleaned_comments": "bruh dont worry modizee would create imf dare say modi send ed imf also completely different note remember reading different article parameters used current administration calculate gdp inline regular process followed others since dont much insights calculated vs current modi administration appreciate anyone insights conspiracy imf hum apna khud ka imf banayege aur apni desi report chapege dare question modinomics track growth adani",
    "light_cleaned_title": "IMF distances itself from 8% growth projection for India: Report",
    "light_cleaned_selftext": "**Good morning, everyone!** **IMF Distances Itself from India's Growth Projection** Today's news sheds light on the recent divergence between the International Monetary Fund (IMF) and Krishnamurthy Subramanian, an executive director at the IMF, regarding India's growth projection. Here's a closer look: **1. IMF's Clarification:** The IMF made it clear that the 8% growth projection attributed to Subramanian does not represent their official stance on India's economic growth. **2. Subramanian's Assertion:** Krishnamurthy Subramanian, India's representative at the IMF, put forward a bold projection of 8% growth for India's economy, diverging from the IMF's estimates. **3. IMF's Growth Estimate:** Contrary to Subramanian's projection, the IMF anticipates India's GDP to expand by 6.7% in the fiscal year 2023–24, reflecting a more conservative outlook. **4. Official IMF View:** The IMF reiterated that Subramanian's growth figures do not align with their official views and forecasts for India's economic performance. **5. Subramanian's Response:** In response to IMF's statement, Subramanian defended his projection, citing past inaccuracies in IMF's economists' estimates regarding India's growth trajectory. Source- [https://www.indiatoday.in/business/story/imf-clarifies-krishnamurthy-subramanian-statement-about-india-growth-projections-2523822-2024-04-05](https://www.indiatoday.in/business/story/imf-clarifies-krishnamurthy-subramanian-statement-about-india-growth-projections-2523822-2024-04-05)",
    "light_cleaned_comments": "Bruh Don’t worry, ModiZee would create their own IMF. You dare say No to Modi, he will send ED to IMF 😀 also on a completely different note, I remember reading in a different article, parameters being used by current administration to calculate GDP are not inline with regular process being followed by others. Since I don’t have much insights on how it’s calculated vs how current Modi administration is doing, appreciate if anyone has more insights into this. Conspiracy of imf Hum apna khud ka IMF banayege aur apni desi report chapege How dare you question modinomics, we only track growth of adani here"
}