{
    "id": "1cgnzsu",
    "title": "India emerges as world’s services factory: Goldman Sachs report",
    "url": "https://timesofindia.indiatimes.com/business/india-business/india-emerges-as-worlds-services-factory-report/articleshow/109707130.cms",
    "selftext": "India emerges as world’s services factory:  Goldman Sachs report\n\n https://timesofindia.indiatimes.com/business/india-business/india-emerges-as-worlds-services-factory-report/articleshow/109707130.cms",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 3,
    "created_utc": 1714466638,
    "convurl": "https://external-preview.redd.it/GdSNne98ZNwkBQgGe3fknoSXD-QwKKBOUX3k1WMCSG0.jpg?auto=webp&s=8c2284160fcc0bd5d451e4ed2cf2546a6f7c00b1",
    "comments": [
        "What it should say is global developers hub. A software giant we can be with the amount of expertise here but fk this government and their one man god propaganda, can grow in a scenario like this.",
        "Yeah cuz Sanghi Murthy wants people to work 70 hours. No innovation nothing. Just making broken apps for govt and foreign companies and taking pride in that? No thank you.",
        "https://preview.redd.it/8yewop0y2rxc1.jpeg?width=2266&format=pjpg&auto=webp&s=062b0d29230dc735f70cd82476c3f75e3d71decc"
    ],
    "cleaned_text": "india emerges worlds services factory goldman sachs report india emerges worlds services factory goldman sachs report ",
    "cleaned_title": "india emerges worlds services factory goldman sachs report",
    "cleaned_selftext": "india emerges worlds services factory goldman sachs report",
    "cleaned_comments": "say global developers hub software giant amount expertise fk government one man god propaganda grow scenario like yeah cuz sanghi murthy wants people work hours innovation nothing making broken apps govt foreign companies taking pride thank",
    "light_cleaned_title": "India emerges as world’s services factory: Goldman Sachs report",
    "light_cleaned_selftext": "India emerges as world’s services factory: Goldman Sachs report",
    "light_cleaned_comments": "What it should say is global developers hub. A software giant we can be with the amount of expertise here but fk this government and their one man god propaganda, can grow in a scenario like this. Yeah cuz Sanghi Murthy wants people to work 70 hours. No innovation nothing. Just making broken apps for govt and foreign companies and taking pride in that? No thank you."
}