{
    "id": "1er63wg",
    "title": "Auto Driver Assaulted Cyclist KA03AL5194",
    "url": "https://v.redd.it/w2p5tmny8fid1",
    "selftext": "Auto Driver Assaulted Cyclist KA03AL5194\n\nHi people of Bengaluru. Today I observed an incident where an Auto Driver ran into a bicycle from behind. The collision was very minor and the Auto driver was at fault for not braking in time.\n\nPost the collision, the Auto Driver chased the cyclist and cornered him. Post that, he got out from his Auto and physically assaulted this guy. He grabbed his neck really tightly and backed off as people started turning up.\n\nThankfully my dash cam caught everything and I’m sharing the recording. The whole incident made my blood boil, I stopped my car just a few meters ahead and got off to help the cyclist, but by that time both the cyclist and auto wala had dispersed. There was a huge queue of cars behind me hence I couldn’t stop instantly, but I’m still not over the fact that I couldn’t help a fellow mate out.\n\nThe Auto’s number is clearly visible in the video: KA 03 AL 5194. This happened at Eco space.\n\nIf any of you know the cyclist, or if you yourself are reading this buddy, please reach out to me for any sort of evidence you might need. For now, I request you all to please share this across all platforms. I don’t have a twitter account hence can’t post it there as of now.\n\nPlease help me reach out to the victim here. He was visibly shaken by all of this and sadly I couldn’t intervene in time. I really want this Auto Driver to be punished. This was a case of assault without any provocation. \n\nI tried posting this Bangalore subReddit but it doesn’t allow videos to be uploaded.",
    "flair": "Crime",
    "score": 28,
    "num_comments": 3,
    "created_utc": 1723550651.0,
    "convurl": "https://external-preview.redd.it/Y2w2ZXVqYnk4ZmlkMfxiob31S8v48qQKxpqLUpHVt770p-iEpY1Z1UBAkTyW.png?format=pjpg&auto=webp&s=20a8240494e49108127086d25f5adceda5288de4",
    "comments": [
        "Waiting for the victim to contact me. Will tweet by tomorrow if I’m still not able to get in touch with them.\n\nhttps://preview.redd.it/gyurubsevkid1.jpeg?width=1170&format=pjpg&auto=webp&s=cd9778acfa4c8cf239515f097ff75770c832c0e7",
        "This content is owned by me. [OC]"
    ],
    "cleaned_text": "auto driver assaulted cyclist kaal auto driver assaulted cyclist kaal hi people bengaluru today observed incident auto driver ran bicycle behind collision minor auto driver fault braking time post collision auto driver chased cyclist cornered post got auto physically assaulted guy grabbed neck really tightly backed people started turning thankfully dash cam caught everything im sharing recording whole incident made blood boil stopped car meters ahead got help cyclist time cyclist auto wala dispersed huge queue cars behind hence couldnt stop instantly im still fact couldnt help fellow mate autos number clearly visible video ka al happened eco space know cyclist reading buddy please reach sort evidence might need request please share across platforms dont twitter account hence cant post please help reach victim visibly shaken sadly couldnt intervene time really want auto driver punished case assault without provocation tried posting bangalore subreddit doesnt allow videos uploaded ",
    "cleaned_title": "auto driver assaulted cyclist kaal",
    "cleaned_selftext": "auto driver assaulted cyclist kaal hi people bengaluru today observed incident auto driver ran bicycle behind collision minor auto driver fault braking time post collision auto driver chased cyclist cornered post got auto physically assaulted guy grabbed neck really tightly backed people started turning thankfully dash cam caught everything im sharing recording whole incident made blood boil stopped car meters ahead got help cyclist time cyclist auto wala dispersed huge queue cars behind hence couldnt stop instantly im still fact couldnt help fellow mate autos number clearly visible video ka al happened eco space know cyclist reading buddy please reach sort evidence might need request please share across platforms dont twitter account hence cant post please help reach victim visibly shaken sadly couldnt intervene time really want auto driver punished case assault without provocation tried posting bangalore subreddit doesnt allow videos uploaded",
    "cleaned_comments": "waiting victim contact tweet tomorrow im still able get touch content owned oc",
    "light_cleaned_title": "Auto Driver Assaulted Cyclist KA03AL5194",
    "light_cleaned_selftext": "Auto Driver Assaulted Cyclist KA03AL5194 Hi people of Bengaluru. Today I observed an incident where an Auto Driver ran into a bicycle from behind. The collision was very minor and the Auto driver was at fault for not braking in time. Post the collision, the Auto Driver chased the cyclist and cornered him. Post that, he got out from his Auto and physically assaulted this guy. He grabbed his neck really tightly and backed off as people started turning up. Thankfully my dash cam caught everything and I’m sharing the recording. The whole incident made my blood boil, I stopped my car just a few meters ahead and got off to help the cyclist, but by that time both the cyclist and auto wala had dispersed. There was a huge queue of cars behind me hence I couldn’t stop instantly, but I’m still not over the fact that I couldn’t help a fellow mate out. The Auto’s number is clearly visible in the video: KA 03 AL 5194. This happened at Eco space. If any of you know the cyclist, or if you yourself are reading this buddy, please reach out to me for any sort of evidence you might need. For now, I request you all to please share this across all platforms. I don’t have a twitter account hence can’t post it there as of now. Please help me reach out to the victim here. He was visibly shaken by all of this and sadly I couldn’t intervene in time. I really want this Auto Driver to be punished. This was a case of assault without any provocation. I tried posting this Bangalore subReddit but it doesn’t allow videos to be uploaded.",
    "light_cleaned_comments": "Waiting for the victim to contact me. Will tweet by tomorrow if I’m still not able to get in touch with them. This content is owned by me. [OC]"
}