{
    "id": "16yisrq",
    "title": "Delhi Police raids locations linked to NewsClick, its journalists",
    "url": "https://www.reddit.com/r/india/comments/16yisrq/delhi_police_raids_locations_linked_to_newsclick/",
    "selftext": " A Special Cell of Delhi Police on Tuesday raided at least 30 locations linked to NewsClick and its journalists.  Police recovered the dumped data from laptops and mobile phones of some journalists of NewsClick. The Special Cell has registered a new case and started the investigation, officials said. \n\nRead here👇\n\n[https://www.cnbctv18.com/india/delhi-police-raids-locations-linked-to-newsclick-its-journalists-arrests-17930091.htm](https://www.cnbctv18.com/india/delhi-police-raids-locations-linked-to-newsclick-its-journalists-arrests-17930091.htm)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696308351.0,
    "convurl": "https://external-preview.redd.it/rPCk5uo4ejG-iyMaTtcrk-De6lGVyE6IYKs9pARe6Fw.jpg?auto=webp&s=45d13ef853e58d129bfd069c7b163a92a058380a",
    "comments": [],
    "cleaned_text": "delhi police raids locations linked newsclick journalists special cell delhi police tuesday raided least locations linked newsclick journalists police recovered dumped data laptops mobile phones journalists newsclick special cell registered new case started investigation officials said read httpswwwcnbctvcomindiadelhipoliceraidslocationslinkedtonewsclickitsjournalistsarrestshtmhttpswwwcnbctvcomindiadelhipoliceraidslocationslinkedtonewsclickitsjournalistsarrestshtm ",
    "cleaned_title": "delhi police raids locations linked newsclick journalists",
    "cleaned_selftext": "special cell delhi police tuesday raided least locations linked newsclick journalists police recovered dumped data laptops mobile phones journalists newsclick special cell registered new case started investigation officials said read httpswwwcnbctvcomindiadelhipoliceraidslocationslinkedtonewsclickitsjournalistsarrestshtmhttpswwwcnbctvcomindiadelhipoliceraidslocationslinkedtonewsclickitsjournalistsarrestshtm",
    "cleaned_comments": "",
    "light_cleaned_title": "Delhi Police raids locations linked to NewsClick, its journalists",
    "light_cleaned_selftext": "A Special Cell of Delhi Police on Tuesday raided at least 30 locations linked to NewsClick and its journalists. Police recovered the dumped data from laptops and mobile phones of some journalists of NewsClick. The Special Cell has registered a new case and started the investigation, officials said. Read here👇 [https://www.cnbctv18.com/india/delhi-police-raids-locations-linked-to-newsclick-its-journalists-arrests-17930091.htm](https://www.cnbctv18.com/india/delhi-police-raids-locations-linked-to-newsclick-its-journalists-arrests-17930091.htm)",
    "light_cleaned_comments": ""
}