{
    "id": "16jb207",
    "title": "Express View on INDIA’s media boycott: Withdraw the list",
    "url": "https://indianexpress.com/article/opinion/editorials/opposition-india-bloc-media-boycott-list-8941391/",
    "selftext": "TV anchors with hateful tongues, on bended knee, need to be called out. But INDIA's boycott list whips up a mob, threatens press freedom. It should go",
    "flair": "Politics",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1694778343.0,
    "convurl": "https://external-preview.redd.it/IOIfnB2hzaOWloYWXY_p7aME3-U2NmxK8Lo5CqZLNGY.jpg?auto=webp&s=f133436e828a56d2ad908a78bb9671198d622b6c",
    "comments": [
        ">The Opposition must keep raising the very valid issue of why citizens in the world's largest democracy need — and deserve — better than anchors with a hateful tongue, on bended knee. But to do this effectively, it must withdraw its list.",
        "> There is no space for blacklists in a democracy, all they do is mark out targets for the mob of your choice. \n\nIn that case, I wonder why Indian Express has this censorship policy for their comments:\n\n> You shall not use, upload, post, email, transmit or otherwise make available any content or comment that is unlawful, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, invasive of another's privacy, hateful, and/or racially, ethnically or otherwise objectionable.\n\nIE's problem is that it has a bothsidesist view of our politics. So it draws a false equivalence between a powerless opposition essentially sulking from mean mediapersons and a powerful government censoring media using laws and enforcement agencies. \n\nINDIA alliance \"whipping up a mob\" and \"threatens press freedom\" are rhetoric without any basis on the ground. There is no mob at all. There is no \"Secular Dal\" who'll go throw stones at those media offices or hand out rape threats like candies.",
        "Opposition..is threatening press freedom?????? \n\n\nThese listed TV anchors and news channels are literally \"hateful tongues\", \"on bended knees\", peddling whichever narrative the ruling party wants, anyone who strays the path is either attacked by ED, IT dept, CBI or bought from one of the many corporates which are backed by BJP.\n\nHow come now you guys care about press freedom when the opposition calls it out?",
        "Citing an example  of Koo if there's one way traffic where only Bhakts assemble  viewership drops , more importantly  the shouting stops. Right now opposition  is the punching  🎒  for these anchors /channels .Without  the  🎒 who will they punch",
        "As you sow, so shall you reap.",
        "Nah this is not journalism, screw them and many more wannabes."
    ],
    "cleaned_text": "express view indias media boycott withdraw list tv anchors hateful tongues bended knee need called indias boycott list whips mob threatens press freedom go ",
    "cleaned_title": "express view indias media boycott withdraw list",
    "cleaned_selftext": "tv anchors hateful tongues bended knee need called indias boycott list whips mob threatens press freedom go",
    "cleaned_comments": "opposition must keep raising valid issue citizens worlds largest democracy need deserve better anchors hateful tongue bended knee effectively must withdraw list space blacklists democracy mark targets mob choice case wonder indian express censorship policy comments shall use upload post email transmit otherwise make available content comment unlawful harmful threatening abusive harassing tortious defamatory vulgar obscene invasive anothers privacy hateful andor racially ethnically otherwise objectionable ies problem bothsidesist view politics draws false equivalence powerless opposition essentially sulking mean mediapersons powerful government censoring media using laws enforcement agencies india alliance whipping mob threatens press freedom rhetoric without basis ground mob secular dal wholl go throw stones media offices hand rape threats like candies oppositionis threatening press freedom listed tv anchors news channels literally hateful tongues bended knees peddling whichever narrative ruling party wants anyone strays path either attacked ed dept cbi bought one many corporates backed bjp come guys care press freedom opposition calls citing example koo theres one way traffic bhakts assemble viewership drops importantly shouting stops right opposition punching anchors channels without punch sow shall reap nah journalism screw many wannabes",
    "light_cleaned_title": "Express View on INDIA’s media boycott: Withdraw the list",
    "light_cleaned_selftext": "TV anchors with hateful tongues, on bended knee, need to be called out. But INDIA's boycott list whips up a mob, threatens press freedom. It should go",
    "light_cleaned_comments": ">The Opposition must keep raising the very valid issue of why citizens in the world's largest democracy need — and deserve — better than anchors with a hateful tongue, on bended knee. But to do this effectively, it must withdraw its list. > There is no space for blacklists in a democracy, all they do is mark out targets for the mob of your choice. In that case, I wonder why Indian Express has this censorship policy for their comments: > You shall not use, upload, post, email, transmit or otherwise make available any content or comment that is unlawful, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, invasive of another's privacy, hateful, and/or racially, ethnically or otherwise objectionable. IE's problem is that it has a bothsidesist view of our politics. So it draws a false equivalence between a powerless opposition essentially sulking from mean mediapersons and a powerful government censoring media using laws and enforcement agencies. INDIA alliance \"whipping up a mob\" and \"threatens press freedom\" are rhetoric without any basis on the ground. There is no mob at all. There is no \"Secular Dal\" who'll go throw stones at those media offices or hand out rape threats like candies. Opposition..is threatening press freedom?????? These listed TV anchors and news channels are literally \"hateful tongues\", \"on bended knees\", peddling whichever narrative the ruling party wants, anyone who strays the path is either attacked by ED, IT dept, CBI or bought from one of the many corporates which are backed by BJP. How come now you guys care about press freedom when the opposition calls it out? Citing an example of Koo if there's one way traffic where only Bhakts assemble viewership drops , more importantly the shouting stops. Right now opposition is the punching 🎒 for these anchors /channels .Without the 🎒 who will they punch As you sow, so shall you reap. Nah this is not journalism, screw them and many more wannabes."
}