{
    "id": "1bibcop",
    "title": "Bjp worker assaults a child in Kerala because he was standing in front of their poster.",
    "url": "https://youtu.be/8Dk5KmE-6sA?feature=sharedK",
    "selftext": "Bjp have zero seats in Kerala, imagine if they came to power :(",
    "flair": "Crime",
    "score": 125,
    "num_comments": 13,
    "created_utc": 1710820960.0,
    "convurl": "https://external-preview.redd.it/72WPCKmuG5AxD5t2Sd5CrS_56QtqSA36p19_oD_A70U.jpg?auto=webp&s=f6f1df4fe3d7adb59225095ee1d67a8da75feb87",
    "comments": [
        "Am waiting for IT cell comments now justifying this🤣",
        "The name of the child is Babur. He stood in front blocking Hanuman Chalisa from reaching everyone.\n\nJai ShriRam.",
        "Nazi shit, we've to get out there and vote these bastards out",
        "Oops they are already out in kerala, and they are not coming in anytime soon lol.",
        "South India needs to vote against the BJP hard this year. After this year's election and delimitation, the BJP doesnt need their votes anymore. The north's Cultural imposition will happen to the south. They are already being starved of funds.",
        "Filth attracts filth people.",
        "Let me try, he was farting on the posters and you are asking us to tolerate this!",
        "Cunts!!!!",
        "But the same news channels will not show news of Congress workers assaulting Hindus for standing in front of the poster /S",
        "You know whats worse when u find out the kid was standing in front of his house  and they just put posters on his wall and hit him for standing infront of his house.",
        "പൂറി മോൻ"
    ],
    "cleaned_text": "bjp worker assaults child kerala standing front poster bjp zero seats kerala imagine came power ",
    "cleaned_title": "bjp worker assaults child kerala standing front poster",
    "cleaned_selftext": "bjp zero seats kerala imagine came power",
    "cleaned_comments": "waiting cell comments justifying name child babur stood front blocking hanuman chalisa reaching everyone jai shriram nazi shit weve get vote bastards oops already kerala coming anytime soon lol south india needs vote bjp hard year years election delimitation bjp doesnt need votes anymore norths cultural imposition happen south already starved funds filth attracts filth people let try farting posters asking us tolerate cunts news channels show news congress workers assaulting hindus standing front poster know whats worse u find kid standing front house put posters wall hit standing infront house",
    "light_cleaned_title": "Bjp worker assaults a child in Kerala because he was standing in front of their poster.",
    "light_cleaned_selftext": "Bjp have zero seats in Kerala, imagine if they came to power :(",
    "light_cleaned_comments": "Am waiting for IT cell comments now justifying this🤣 The name of the child is Babur. He stood in front blocking Hanuman Chalisa from reaching everyone. Jai ShriRam. Nazi shit, we've to get out there and vote these bastards out Oops they are already out in kerala, and they are not coming in anytime soon lol. South India needs to vote against the BJP hard this year. After this year's election and delimitation, the BJP doesnt need their votes anymore. The north's Cultural imposition will happen to the south. They are already being starved of funds. Filth attracts filth people. Let me try, he was farting on the posters and you are asking us to tolerate this! Cunts!!!! But the same news channels will not show news of Congress workers assaulting Hindus for standing in front of the poster /S You know whats worse when u find out the kid was standing in front of his house and they just put posters on his wall and hit him for standing infront of his house. പൂറി മോൻ"
}