{
    "id": "1gs5g9c",
    "title": "Work 70 hours for Narayana Murthy Kids",
    "url": "https://www.reddit.com/r/india/comments/1gs5g9c/work_70_hours_for_narayana_murthy_kids/",
    "selftext": "[https://www.youtube.com/watch?v=AC32bgXP0yU](https://www.youtube.com/watch?v=AC32bgXP0yU)\n\n1. Sending million of dollars every year to UK.\n2. Infosys is dying and growing even less than the dollar-INR appreciation. Surviving only on government orders and personally hoping to get a Rajya Sabha seat by praising pathetic goverment to send more money to his kids.\n3. Infosys stock is super overvalued with no innovation, even higher than growing google, meta.\n4. Still pays 4,500 USD/year to engineers, where US/Europe/Dubai minimum wage is \\~15$/hour.\n5. If you are the owner you will work every second for your company, insane to compare working for your own business versus working for others, even when stock options aren't part of the compensation package.\n6. Five-day workweek enhances productivity rather than diminishing it.\n\nhttps://preview.redd.it/w2uven6rl31e1.png?width=2074&format=png&auto=webp&s=05427649a0a89da7bc9b10ee600b71220c98bb0b\n\nhttps://preview.redd.it/w46v588ul31e1.png?width=1408&format=png&auto=webp&s=cdc00ac9e5d49457f9ae3667c47990e8bdf36ecc\n\nhttps://preview.redd.it/dfad398ul31e1.png?width=1450&format=png&auto=webp&s=f49042674736eb0d3eb11d37ed2225d53cc1f515\n\nhttps://preview.redd.it/cmt4ii0vl31e1.png?width=1414&format=png&auto=webp&s=1f743fede97a5f0b64283f2aebaf3ab3a629f1bd\n\nhttps://preview.redd.it/vn1wzpjwl31e1.png?width=1470&format=png&auto=webp&s=1c0e06ee528765648f54584858a80405d75e95be\n\nhttps://preview.redd.it/e5ec1awwl31e1.png?width=1494&format=png&auto=webp&s=aaebf1cc87988fc1fcc4fc84176d91f8b498a194\n\nhttps://preview.redd.it/judaaz2zl31e1.png?width=1496&format=png&auto=webp&s=c7cc220d022333c5ac883bb15c6475f1916bb0e6\n\nhttps://preview.redd.it/hedo5oc0m31e1.png?width=1382&format=png&auto=webp&s=5987a2ec819ea56e1d774a89cfe8e61564fc00c1\n\nhttps://preview.redd.it/xmjsxoc0m31e1.png?width=1634&format=png&auto=webp&s=ab0bcb6ab53542203eed2d934913102144dfdf2d\n\nhttps://preview.redd.it/ht29foc0m31e1.png?width=1500&format=png&auto=webp&s=8f654f9e19cb76b45c60fbcdd2106701c90b70f9\n\nhttps://preview.redd.it/gn6i5xvwm31e1.png?width=1460&format=png&auto=webp&s=be6400ed1d95545ed6ff0c3f63127b8ad1230045\n\n",
    "flair": "Policy/Economy",
    "score": 317,
    "num_comments": 39,
    "created_utc": 1731701383.0,
    "convurl": "https://external-preview.redd.it/h0j-nzfxrFIBzH6B3jPGKfLSJ0W2MxfQ9etyMP73DgY.jpg?auto=webp&s=c09631133aee6a41833788da276bd59c56bf0007",
    "comments": [
        "Ask him to pay us on hourly basis with good rates then we’ll be onboard",
        "*Narayana Murthy, the co-founder of Infosys, in March 2024, gifted 1,500,000 shares to his grandson, Ekagrah Rohan Murty. The gift was made off-market on March 15, 2024, and is worth approximately ₹240 crore. Ekagrah is now possibly the youngest millionaire in India.*\n\nSomeone calculate how many generations needed to earn that money for a single common man.",
        "I have been warned already to not use the term, so I am gonna use it in hindi. 'Amiro ko khao'",
        "While I don't agree with the comments from Murthy, your comparisons with product firms is wrong. If you want to compare do it with wipro, CTS, Accenture etc...\n\nThe reason is, in services companies your revenue is based on hours billed which is a function of number of people working...it scales only 1:1\n\nIn case of product companies, scaling is different, a product made once is sold multiple times, incremental effort is limited to sales and marketing, revenue\\margins thus are not fully dependent on number of heads",
        "doesn't matter, if others are overvalued too, as the investor only thing matter is current valuation, growth and future prospect",
        "No, the cost economics are different. \n\nWhen growth is a function of number of people employed vs make once sell x number of times, the prospects change.",
        "again doesn't matter what is the cost economics, only thing matter is valuation, growth and future prospect.",
        "All of you reading this post, you are just wasting time. You need to work and make more money for Narayana Murthy, so that he can gift it to his grandchildren. \n\nEvery minute you waste here, his grandkids are losing money. Get to work!!!",
        "So you’re saying his Business model is bad for the people working for him.\n\nMakes sense to destroy it on grounds of cruelty then.",
        "The model isn't bad in itself but the way Infy or similar operate is. They compete mostly on price against other players and to do that they seem to only hurt the employees.\n\nIt is the white collar equivalent of outsourced garment manufacturing to Vietnam or Bangladesh...",
        "This man, like all the capitalist blood sucking leechers, is too greedy and can't even hide his greed in the public. Suckers like Musk, GAFA owners are at least wise enough to hide their greed. ",
        "Don't forget spoon aunty's husband's grandson works 18hts a day as a toddler. Otherwise, he wouldn't have earned equity worth hundreds of crores already. Would he?",
        "That poor toddler works 18hrs a day, 7 days a week for spoon aunty's husband. Don't you know?",
        "I think the world would be a better place if Mr Murthy shares whatever he is smoking. Top class shit.",
        "/r/hailcorporate\n\n\n\n\n>The model isn't bad in itself but the way Infy or similar operate is.\n\n\nFfs, you admitted earlier that every single one of these slave farms operate the same way. Exploitation of slaves is the business model. There isn't any other. ",
        "We should stop talking about him...he is a modern day slave owner. He wants more slaves to grind their lives to make him money.",
        "https://preview.redd.it/rr5ukseg961e1.png?width=1080&format=pjpg&auto=webp&s=00ce7dd9a533384b61fc7f07f4a500356d72bd3b",
        "Hmm no. It's not what you think it is. Hourly or daily basis means you don't get 'paid leaves' and many other benefits. What you need is overtime pay.",
        "He is looting Indians and Saving his money in England , When I see him he looks exactly like \"Gollam\" of LOTR\n\nhttps://preview.redd.it/pk5ryu80c61e1.jpeg?width=500&format=pjpg&auto=webp&s=54cf904c2043d36d1ecbbb025beffcd84f6cc722",
        "Economics may be different but people's needs are the same. People need rest, recreation, family time. People work for their families not to be away from their families.",
        "When you expect people to work 18 hours a day for 6-7 days a week, it is a bad model. All that will lead to is burn out and attrition. More the turnover, more the hiring, training and retaining costs, more the errors and lower the morale.",
        "At what point do statements like this qualify as stock price manipulation ?",
        "N Murthy is a joker",
        "Working overtime will not anyways benefit society and country.\nIf I have to actually work for society I will do social work in spare time than working for Directors.",
        "interviewer is almost as big a joker as murthy, she just keep smiling at each of his ridiculous statements, clearly she got where she is based on her looks not her imaginary journalistic skills",
        "Billed most projects in dollars, but not transferring the benefit of 'fall of rupee' to employees.",
        "Tumhe ameer kha chuke hain aur tum unke pet me ho.\n\nJaago ya digest ho jaao.",
        "Gifting his grandson £22m even before he is grown and he expects us to be his slave and work for him 70 hours for a bare minimum salary. What a man👏👏",
        "kitne vele hai log",
        "Here's another reminder that billionaires are not your friends!",
        "Bigger international players or niche players in the same segment have higher bill rates and better pay for employees.  But WITCH companies abuse their position as a mass employer.",
        "He wants slaves at this point and hes hiding behind nationalism.",
        "We can use USA model of hourly pay they provide leave as well",
        "Never work for WITCH....",
        "The fact is people like Murthy, other CEOs, PM, even upper management don't really work hard so working long is easier and can make these statements. In fact attending some function, after travelling for 4 hours in comfort and talking half baked shit coming out of their brains is considered work. Most of the hard work is done for them, and they just take a decision based on facts presented. Yes, some are more successful than others and that's their talent similar to some brokers finding more success, but it's not hard work, mostly good LUCK, iq, health and gut instincts.\n\nAgree, that these people are gifted with higher IQ and good physical health with later being important, but they don't work to even 50% of their capacity \n\nFocused coding for 4hrs is hard, doing this for 8hrs is tiring, you may push yourself to 12hrs occasionally and that maybe possible to do this for a few months when you are younger but it is physically impossible to do this day in day out for a number of years.\n\nSame with physical labour, yeah a watchman can probably work 12 without burning out, but not a construction worker.",
        "So Narayana Murthy, our silicon sage, has decreed that 70 hours of toil shall be the new mantra for success? Let's unpack this cosmic joke, shall we?\n\nListen up, you keyboard-tapping, chai-guzzling, dark-circle-sporting \"hustle culture\" warriors! Murthy's not just selling a work ethic; he's peddling a one-way ticket to burnout nirvana! 70 hours a week? Why stop there? Why not 168 hours? Sleep is for the weak, and family time is clearly overrated!\n\nYou call this advice? I call it a masterclass in how to turn humans into code-spewing, bug-fixing robots! But fear not, for in this grand circus of capitalism, you're not just clowns - you're the whole damn show!\n\nLet's break down this 70-hour enlightenment plan:\n1. 70 hours of work + 56 hours of sleep = 126 hours\n2. That leaves you 42 whole hours for:\n   - Commuting (in soul-crushing traffic)\n   - Eating (instant noodles count as a food group, right?)\n   - Personal hygiene (optional, apparently)\n   - Contemplating your life choices (recommended)\n\nBut wait, there's more! In this grand scheme, you're not just an employee - you're a \"wealth creator\"! For whom, you ask? Well, that's the real punchline, isn't it?\n\nHere's the cosmic truth, my overtime-loving acolytes: You're not working 70 hours a week to change the world. You're doing it to change your boss's car from a Mercedes to a Lamborghini!\n\nRemember, in the grand bazaar of life, you're not selling your time - you're bargaining away your very existence. And for what? A pat on the back and the privilege of doing it all again next week?\n\nSo go ahead, my little hamsters on the corporate wheel. Run those 70 hours. Chase that cheese. But remember: At the end of the rat race, you're still a rat.\n\nAnd to Narayana Murthy, I say this: If working long hours was the key to success, every rickshaw driver in India would be a billionaire.\n\nNow go forth and spread this wisdom like a computer virus through your overworked, underpaid colleagues. And maybe, just maybe, in the midst of your 70-hour delirium, you'll find the cosmic joke in all of this."
    ],
    "cleaned_text": "work hours narayana murthy kids httpswwwyoutubecomwatchvacbgxpyuhttpswwwyoutubecomwatchvacbgxpyu sending million dollars every year uk infosys dying growing even less dollarinr appreciation surviving government orders personally hoping get rajya sabha seat praising pathetic goverment send money kids infosys stock super overvalued innovation even higher growing google meta still pays usdyear engineers useuropedubai minimum wage hour owner work every second company insane compare working business versus working others even stock options arent part compensation package fiveday workweek enhances productivity rather diminishing ",
    "cleaned_title": "work hours narayana murthy kids",
    "cleaned_selftext": "httpswwwyoutubecomwatchvacbgxpyuhttpswwwyoutubecomwatchvacbgxpyu sending million dollars every year uk infosys dying growing even less dollarinr appreciation surviving government orders personally hoping get rajya sabha seat praising pathetic goverment send money kids infosys stock super overvalued innovation even higher growing google meta still pays usdyear engineers useuropedubai minimum wage hour owner work every second company insane compare working business versus working others even stock options arent part compensation package fiveday workweek enhances productivity rather diminishing",
    "cleaned_comments": "ask pay us hourly basis good rates well onboard narayana murthy cofounder infosys march gifted shares grandson ekagrah rohan murty gift made offmarket march worth approximately crore ekagrah possibly youngest millionaire india someone calculate many generations needed earn money single common man warned already use term gon na use hindi amiro ko khao dont agree comments murthy comparisons product firms wrong want compare wipro cts accenture etc reason services companies revenue based hours billed function number people workingit scales case product companies scaling different product made sold multiple times incremental effort limited sales marketing revenuemargins thus fully dependent number heads doesnt matter others overvalued investor thing matter current valuation growth future prospect cost economics different growth function number people employed vs make sell x number times prospects change doesnt matter cost economics thing matter valuation growth future prospect reading post wasting time need work make money narayana murthy gift grandchildren every minute waste grandkids losing money get work youre saying business model bad people working makes sense destroy grounds cruelty model isnt bad way infy similar operate compete mostly price players seem hurt employees white collar equivalent outsourced garment manufacturing vietnam bangladesh man like capitalist blood sucking leechers greedy cant even hide greed public suckers like musk gafa owners least wise enough hide greed dont forget spoon auntys husbands grandson works hts day toddler otherwise wouldnt earned equity worth hundreds crores already would poor toddler works hrs day days week spoon auntys husband dont know think world would better place mr murthy shares whatever smoking top class shit rhailcorporate model isnt bad way infy similar operate ffs admitted earlier every single one slave farms operate way exploitation slaves business model isnt stop talking himhe modern day slave owner wants slaves grind lives make money hmm think hourly daily basis means dont get paid leaves many benefits need overtime pay looting indians saving money england see looks exactly like gollam lotr economics may different peoples needs people need rest recreation family time people work families away families expect people work hours day days week bad model lead burn attrition turnover hiring training retaining costs errors lower morale point statements like qualify stock price manipulation n murthy joker working overtime anyways benefit society country actually work society social work spare time working directors interviewer almost big joker murthy keep smiling ridiculous statements clearly got based looks imaginary journalistic skills billed projects dollars transferring benefit fall rupee employees tumhe ameer kha chuke hain aur tum unke pet ho jaago ya digest ho jaao gifting grandson even grown expects us slave work hours bare minimum salary man kitne vele hai log heres another reminder billionaires friends bigger international players niche players segment higher bill rates better pay employees witch companies abuse position mass employer wants slaves point hes hiding behind nationalism use usa model hourly pay provide leave well never work witch fact people like murthy ceos pm even upper management dont really work hard working long easier make statements fact attending function travelling hours comfort talking half baked shit coming brains considered work hard work done take decision based facts presented yes successful others thats talent similar brokers finding success hard work mostly good luck iq health gut instincts agree people gifted higher iq good physical health later important dont work even capacity focused coding hrs hard hrs tiring may push hrs occasionally maybe possible months younger physically impossible day day number years physical labour yeah watchman probably work without burning construction worker narayana murthy silicon sage decreed hours toil shall new mantra success lets unpack cosmic joke shall listen keyboardtapping chaiguzzling darkcirclesporting hustle culture warriors murthys selling work ethic hes peddling oneway ticket burnout nirvana hours week stop hours sleep weak family time clearly overrated call advice call masterclass turn humans codespewing bugfixing robots fear grand circus capitalism youre clowns youre whole damn show lets break hour enlightenment plan hours work hours sleep hours leaves whole hours commuting soulcrushing traffic eating instant noodles count food group right personal hygiene optional apparently contemplating life choices recommended wait theres grand scheme youre employee youre wealth creator ask well thats real punchline isnt heres cosmic truth overtimeloving acolytes youre working hours week change world youre change bosss car mercedes lamborghini remember grand bazaar life youre selling time youre bargaining away existence pat back privilege next week go ahead little hamsters corporate wheel run hours chase cheese remember end rat race youre still rat narayana murthy say working long hours key success every rickshaw driver india would billionaire go forth spread wisdom like computer virus overworked underpaid colleagues maybe maybe midst hour delirium youll find cosmic joke",
    "light_cleaned_title": "Work 70 hours for Narayana Murthy Kids",
    "light_cleaned_selftext": "[https://www.youtube.com/watch?v=AC32bgXP0yU](https://www.youtube.com/watch?v=AC32bgXP0yU) 1. Sending million of dollars every year to UK. 2. Infosys is dying and growing even less than the dollar-INR appreciation. Surviving only on government orders and personally hoping to get a Rajya Sabha seat by praising pathetic goverment to send more money to his kids. 3. Infosys stock is super overvalued with no innovation, even higher than growing google, meta. 4. Still pays 4,500 USD/year to engineers, where US/Europe/Dubai minimum wage is \\~15$/hour. 5. If you are the owner you will work every second for your company, insane to compare working for your own business versus working for others, even when stock options aren't part of the compensation package. 6. Five-day workweek enhances productivity rather than diminishing it.",
    "light_cleaned_comments": "Ask him to pay us on hourly basis with good rates then we’ll be onboard *Narayana Murthy, the co-founder of Infosys, in March 2024, gifted 1,500,000 shares to his grandson, Ekagrah Rohan Murty. The gift was made off-market on March 15, 2024, and is worth approximately ₹240 crore. Ekagrah is now possibly the youngest millionaire in India.* Someone calculate how many generations needed to earn that money for a single common man. I have been warned already to not use the term, so I am gonna use it in hindi. 'Amiro ko khao' While I don't agree with the comments from Murthy, your comparisons with product firms is wrong. If you want to compare do it with wipro, CTS, Accenture etc... The reason is, in services companies your revenue is based on hours billed which is a function of number of people working...it scales only 1:1 In case of product companies, scaling is different, a product made once is sold multiple times, incremental effort is limited to sales and marketing, revenue\\margins thus are not fully dependent on number of heads doesn't matter, if others are overvalued too, as the investor only thing matter is current valuation, growth and future prospect No, the cost economics are different. When growth is a function of number of people employed vs make once sell x number of times, the prospects change. again doesn't matter what is the cost economics, only thing matter is valuation, growth and future prospect. All of you reading this post, you are just wasting time. You need to work and make more money for Narayana Murthy, so that he can gift it to his grandchildren. Every minute you waste here, his grandkids are losing money. Get to work!!! So you’re saying his Business model is bad for the people working for him. Makes sense to destroy it on grounds of cruelty then. The model isn't bad in itself but the way Infy or similar operate is. They compete mostly on price against other players and to do that they seem to only hurt the employees. It is the white collar equivalent of outsourced garment manufacturing to Vietnam or Bangladesh... This man, like all the capitalist blood sucking leechers, is too greedy and can't even hide his greed in the public. Suckers like Musk, GAFA owners are at least wise enough to hide their greed. Don't forget spoon aunty's husband's grandson works 18hts a day as a toddler. Otherwise, he wouldn't have earned equity worth hundreds of crores already. Would he? That poor toddler works 18hrs a day, 7 days a week for spoon aunty's husband. Don't you know? I think the world would be a better place if Mr Murthy shares whatever he is smoking. Top class shit. /r/hailcorporate >The model isn't bad in itself but the way Infy or similar operate is. Ffs, you admitted earlier that every single one of these slave farms operate the same way. Exploitation of slaves is the business model. There isn't any other. We should stop talking about him...he is a modern day slave owner. He wants more slaves to grind their lives to make him money. Hmm no. It's not what you think it is. Hourly or daily basis means you don't get 'paid leaves' and many other benefits. What you need is overtime pay. He is looting Indians and Saving his money in England , When I see him he looks exactly like \"Gollam\" of LOTR Economics may be different but people's needs are the same. People need rest, recreation, family time. People work for their families not to be away from their families. When you expect people to work 18 hours a day for 6-7 days a week, it is a bad model. All that will lead to is burn out and attrition. More the turnover, more the hiring, training and retaining costs, more the errors and lower the morale. At what point do statements like this qualify as stock price manipulation ? N Murthy is a joker Working overtime will not anyways benefit society and country. If I have to actually work for society I will do social work in spare time than working for Directors. interviewer is almost as big a joker as murthy, she just keep smiling at each of his ridiculous statements, clearly she got where she is based on her looks not her imaginary journalistic skills Billed most projects in dollars, but not transferring the benefit of 'fall of rupee' to employees. Tumhe ameer kha chuke hain aur tum unke pet me ho. Jaago ya digest ho jaao. Gifting his grandson £22m even before he is grown and he expects us to be his slave and work for him 70 hours for a bare minimum salary. What a man👏👏 kitne vele hai log Here's another reminder that billionaires are not your friends! Bigger international players or niche players in the same segment have higher bill rates and better pay for employees. But WITCH companies abuse their position as a mass employer. He wants slaves at this point and hes hiding behind nationalism. We can use USA model of hourly pay they provide leave as well Never work for WITCH.... The fact is people like Murthy, other CEOs, PM, even upper management don't really work hard so working long is easier and can make these statements. In fact attending some function, after travelling for 4 hours in comfort and talking half baked shit coming out of their brains is considered work. Most of the hard work is done for them, and they just take a decision based on facts presented. Yes, some are more successful than others and that's their talent similar to some brokers finding more success, but it's not hard work, mostly good LUCK, iq, health and gut instincts. Agree, that these people are gifted with higher IQ and good physical health with later being important, but they don't work to even 50% of their capacity Focused coding for 4hrs is hard, doing this for 8hrs is tiring, you may push yourself to 12hrs occasionally and that maybe possible to do this for a few months when you are younger but it is physically impossible to do this day in day out for a number of years. Same with physical labour, yeah a watchman can probably work 12 without burning out, but not a construction worker. So Narayana Murthy, our silicon sage, has decreed that 70 hours of toil shall be the new mantra for success? Let's unpack this cosmic joke, shall we? Listen up, you keyboard-tapping, chai-guzzling, dark-circle-sporting \"hustle culture\" warriors! Murthy's not just selling a work ethic; he's peddling a one-way ticket to burnout nirvana! 70 hours a week? Why stop there? Why not 168 hours? Sleep is for the weak, and family time is clearly overrated! You call this advice? I call it a masterclass in how to turn humans into code-spewing, bug-fixing robots! But fear not, for in this grand circus of capitalism, you're not just clowns - you're the whole damn show! Let's break down this 70-hour enlightenment plan: 1. 70 hours of work + 56 hours of sleep = 126 hours 2. That leaves you 42 whole hours for: - Commuting (in soul-crushing traffic) - Eating (instant noodles count as a food group, right?) - Personal hygiene (optional, apparently) - Contemplating your life choices (recommended) But wait, there's more! In this grand scheme, you're not just an employee - you're a \"wealth creator\"! For whom, you ask? Well, that's the real punchline, isn't it? Here's the cosmic truth, my overtime-loving acolytes: You're not working 70 hours a week to change the world. You're doing it to change your boss's car from a Mercedes to a Lamborghini! Remember, in the grand bazaar of life, you're not selling your time - you're bargaining away your very existence. And for what? A pat on the back and the privilege of doing it all again next week? So go ahead, my little hamsters on the corporate wheel. Run those 70 hours. Chase that cheese. But remember: At the end of the rat race, you're still a rat. And to Narayana Murthy, I say this: If working long hours was the key to success, every rickshaw driver in India would be a billionaire. Now go forth and spread this wisdom like a computer virus through your overworked, underpaid colleagues. And maybe, just maybe, in the midst of your 70-hour delirium, you'll find the cosmic joke in all of this."
}