{
    "id": "16f57fs",
    "title": "Is it worth immigrating to Canada for a better life ?",
    "url": "https://www.reddit.com/r/india/comments/16f57fs/is_it_worth_immigrating_to_canada_for_a_better/",
    "selftext": "https://www.forbes.com/sites/stuartanderson/2023/03/06/indian-immigration-to-canada-has-tripled-since-2013/\n\nAsking for a friend who is moderately successful in India who is considering moving from India to Canada for a better life.  Canada accepts many people from India and Canada is generally very safe country to live in.\n\nThoughts ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694364799.0,
    "convurl": "https://external-preview.redd.it/4dwPdCBuPKZkcoicmtCbUvhSlwks_C7m6C6jm3LK5gE.jpg?auto=webp&s=0b8c1019351b63a9273c5adc2ad61631c7187b82",
    "comments": [
        "Nooooooooo Nooooooooooo Nooooooooo, the reason's already out there.",
        "What’s the reason ?",
        "People are living in a tent outside University. Don't waste your time and money.",
        "Depends on how you define a better life. I was working in a MNC in India, grossing around 50lpa. Paid off car, property nearly paid off, maids, blah blah.\n\nI moved her last year, and it's been a bit of a struggle. The first year or two is the hardest, it's nothing like moving from Bangalore to Gurgaon (obviously). For us, it took time to find a job, get the documents sorted (child care benefit, tax stuff, drivers license), get a credit history rolling to start applying for credit (auto loan being a priority).\n\nIf you don't have a car, you better be able to afford the rents living in downtown because while the public transport is decent, it has its own sets of problems. Financially speaking, we are in a \"worse\" state than India but it is purely from money saved perspective and not the quality of life.\n\nFrom and emotional and mental point of view - I have absolutely no regrets moving to Canada. But keep in mind i am from IT, so finding a well paying job was easy for me which is a HUGE deal as things are expensive here. Can things be better? Of course.",
        "They enrolled into education mills - a borderline scam. Sorry, but they were mislead before they even landed here.",
        "Absolutely not. Canada has developed a massive anti-Indian sentiment due to mass immigration. My friends in Canada talk about it all the time, you can read articles/reddit subs as well. Avoid strongly.",
        "Absolutely not. Mass immigration from India is becoming a problem there. A lot of people face discrimination and disappointment. Avoid.",
        "Unless you get a good paying job, Canada is not worth it.",
        "Name one country where you can live without a good paying job. While I sort of understand your comment, it's extremely basic and lacks a lot of context.",
        "I just dropped my friend and his son to the airport. They are immigrating to Canada, through the wife who is a citizen. He hopes to become a nurse in Newfoundland and someday move into trucking.\n\nLife is pretty much set for him. He is not going the education route. He is confident that he will be able to purchase a home in 2 years working as a nurse for 100Cad/hour.",
        "No. No. No.\n\nPeople are just going out of FOMO! \nIf your friend is going for a job directly (sponsored) then surely go ahead.\nIf not, then don’t. Unnecessarily spending huge money on universities just to immigrate and struggle doesn’t make sense.\n\nI came to UK with a sponsored visa and a high salary package and i am disliking it. I mean the lifestyle in general. I like being in my comfort zone in India with my friends and family. I came because of stupid instagram reels fomo.\n\nWhat happens when you friend who goes for university and realises it is not what he expected? It will just put him under stress and shit.\n\nSo decide accordingly. Don’t just see people moving and you move.",
        "Immigrating to Pakistan right now will give you a better life than immigrating to Canada",
        "You can even live in America by yourself with minimum wage, depending on the state. You can also benefit from food stamps etc, which Canada does not have.\n\nRent in bumfuck nowhere, Canada earning minimum wage, just accommodation will take 80%+ of your wage.",
        "Nope.\n\nDon’t.\n\nNot worth it.",
        "Listen buddy I'm not gonna sugarcoat it. \nIf you come to study here at a \"college\", you're fucked. Recruiters will not give a second look to you when your application squares up with that of a UofT, York, McMaster, Waterloo etc universities. \n\nIf you're going to migrate here looking for a job and you're in digital marketing or HR, you're fucked. The market is over-saturated. \n\nIf you're going to migrate here looking for a job and you're in IT, you probably will be able to land a job. But, it will take time AND it depends on your communication skills.\n\nIf you plan to live in Toronto or Vancouver, you will burn through your savings faster than you can recoup them. From that POV, Alberta or Manitoba are relatively cheaper but the IT job prospects reduce drastically and so does the salary.",
        "I'm in Canada and suggestion to Anyone considering COL is way too high. If you have money, come here. Don't take a loan, high chances you will be struggling.",
        "Just look into Canadas reddit, you will realize how much problem they are facing because of immigrants. So dont go to Canada.",
        ">working as a nurse for 100Cad/hour.\n\nWow I'm a little dubious.  Even the IT guys don't make this much usually",
        "Can you elaborate how you are mentally and emotionally better there ?\n\nI lived abroad and it's insane mentally living alone away from my parents.",
        "I am with my wife and kid - so loneliness isn't an issue for me. But I can relate to your situation. I was in Australia for my studies and worked there for a couple of years before I came back. Back then, it was quite depressing initially until I finally found a decent friend circle with shared interests.\n\nAs for Canada, my main reason for moving wasn't financial, but to get away from, what I believe, is the disgusting state of politics and media in India. I am a Muslim by birth, and I didn't want my daughter (double whammy being a girl) to be raised in a environment where racism is often celebrated. Is there racism in Canada? Absolutely, but unlike in India, it's not overt or celebrated, and you can fight back against it and garner support for it as well. This to me is a huge plus. Even now, when I speak with some of my Indian \"friends\" who claim to be \"broad minded\", their elitist bullshit is very visceral. The fact that my daughter can go to her school, and playground without being exposed to all the toxicity that I have personally seen is something that I can't put a price on.\n\nComing back to your situation, weigh the pros and cons, loneliness can be hard - only made worse if you are an introvert like me. Join some social groups, try to come out of your shell, go explore a bit. The parent angle is a real one, but I was lucky enough that my parents don't need me for financial support, and at some point of time, you need to think of your future and put yourself first.",
        "Can you tell us how much are you making in Canada from your job? I am kind of the same background as you.",
        "Nurses are paid horribly here. Tell him he's living a pipe dream.",
        "CAD 160k per annum - took me a 2-3 months to land this job, and this was before the tech layoffs. Average I was getting was around CAD 120k per annum which is fine if you can adjust and bide your time. Where you decide to live is a huge factor as well - want to live close to downtown Toronto - Things are expensive. Ok with a bit of commute - much more manageable.\n\nBut before coming here, get a reality check. I know some who came here and wanted everything from day 1 - luxury cars, detached home and what not, only to come here and get shocked. Go on Linkedin and other job portals and scout out job opportunities, get a sense of the market. Read up on the cost of living for the city you are planning to initially settle in. We got lucky that our application was delayed by the pandemic by nearly 2 years. So we had plenty of time to read up and research.\n\nThe biggest question you need to ask yourself is - why do you want to move? If it's just for money, then countries like Dubai might be better where you can make lots of money and retire quickly.",
        "He’ll be lucky to make $40/hr as a nurse. That’s assuming Canada even recognizes his credentials if he has any.",
        "The Indian credentials have been accepted. He next needs to appear for the NCLEX exam .",
        "That’s good but even then nurses don’t make $100/hr. $40/hr in most Canadian cities is not enough to buy a house either. Hopefully his wife has a high paying job.",
        "Haha lol no, wife wants to be an insta influencer whilst working at a bank backend earning 10$/hour. \n\nHope it works for him \n\nHe always has been over confident.",
        "I understand the state of politics and the media. No one abroad gives shit to issues that can make people kill each other here in India. Especially in UP and other states like these. I also agree with the fact that educated people of India are blinded by propaganda and cannot think of their own.\n\nIt's good you found a good place for your child.",
        "Good luck finding somewhere to live. Canada is facing immigration problems and dont have homes for everyone. Lot of african and indian immigrants are living in tents. Keep in mind that winter is freezing cold and deadly for those who are not prepared 6 months a year.",
        "Which company did you join, can you DM if don’t feel like sharing here?",
        "As someone from Atlantic Canada he will never make that much as a nurse. But they are always hiring nurses. But he will make insane amounts of money doing long haul trucking. He could get trained to do both for far far far less than any University degree. Canada has far more trades jobs that pay well at this point then office type jobs. Also buying a house in 2 years is a pipe dream mainly because you have to build credit. He DOES have the ability to buy houses though. Atlantic Canada and Alberta are the only places normal people (Canadian born or otherwise) can afford to buy property. B.C. And Ontario are so SO SO expensive its unreal. You can make 100k/year in ontario and have lower QoL than someone making 50K/year in Newfoundland. Most people will get trades, work portions of the year in Alberta and then use that money to buy property back East. \nSo i’m trying to say your friend’s timeline is a bit condensed. It will take him longer than 2-years lol but in under 10 he easily could own a house. \nMillionaires barely can afford Vancouver.",
        "The company is in US, not a big one like FAANG. I work for them via a staffing company set up in Quebec. Don't think name will help you out at all as it's not some popular company.",
        "For women it will always be a better life living in Canada.   \nMaybe not so much for pampered men though.",
        "You have been defrauded by whoever told you that. Nurses make 45$ an hour. Before tax. So they take home closer to 24$ after cost of living.. you get my drift. Telling you from someone who had multiple nurses in my family.",
        "These are the welfare people you don’t want in your country.",
        "Why would anyone pick this over someone who went to school in canada or america. the cheating alone in india has completely eroded any faith I have in any \"diploma\" from an Indian school.",
        "just stay in India and make it worth living there",
        "Nurses make more than It people. Atleast twice as much. They're usually way more in demand and many even move to the US because they get paid even more",
        "No. Canada sucks!",
        "Not right now. :( There’s a lot of cultural/political/infrastructural tension. Continue thriving in India!",
        "Yes WOMEN can do BUSINESS there",
        "How did you get a sponsored job in UK? Any guidance? I am a business consultant mainly a project manager and BA in payments"
    ],
    "cleaned_text": "worth immigrating canada better life asking friend moderately successful india considering moving india canada better life canada accepts many people india canada generally safe country live thoughts ",
    "cleaned_title": "worth immigrating canada better life",
    "cleaned_selftext": "asking friend moderately successful india considering moving india canada better life canada accepts many people india canada generally safe country live thoughts",
    "cleaned_comments": "nooooooooo nooooooooooo nooooooooo reasons already whats reason people living tent outside university dont waste time money depends define better life working mnc india grossing around lpa paid car property nearly paid maids blah blah moved last year bit struggle first year two hardest nothing like moving bangalore gurgaon obviously us took time find job get documents sorted child care benefit tax stuff drivers license get credit history rolling start applying credit auto loan priority dont car better able afford rents living downtown public transport decent sets problems financially speaking worse state india purely money saved perspective quality life emotional mental point view absolutely regrets moving canada keep mind finding well paying job easy huge deal things expensive things better course enrolled education mills borderline scam sorry mislead even landed absolutely canada developed massive antiindian sentiment due mass immigration friends canada talk time read articlesreddit subs well avoid strongly absolutely mass immigration india becoming problem lot people face discrimination disappointment avoid unless get good paying job canada worth name one country live without good paying job sort understand comment extremely basic lacks lot context dropped friend son airport immigrating canada wife citizen hopes become nurse newfoundland someday move trucking life pretty much set going education route confident able purchase home years working nurse cadhour people going fomo friend going job directly sponsored surely go ahead dont unnecessarily spending huge money universities immigrate struggle doesnt make sense came uk sponsored visa high salary package disliking mean lifestyle general like comfort zone india friends family came stupid instagram reels fomo happens friend goes university realises expected put stress shit decide accordingly dont see people moving move immigrating pakistan right give better life immigrating canada even live america minimum wage depending state also benefit food stamps etc canada rent bumfuck nowhere canada earning minimum wage accommodation take wage nope dont worth listen buddy im gon na sugarcoat come study college youre fucked recruiters give second look application squares uoft york mcmaster waterloo etc universities youre going migrate looking job youre digital marketing hr youre fucked market oversaturated youre going migrate looking job youre probably able land job take time depends communication skills plan live toronto vancouver burn savings faster recoup pov alberta manitoba relatively cheaper job prospects reduce drastically salary im canada suggestion anyone considering col way high money come dont take loan high chances struggling look canadas reddit realize much problem facing immigrants dont go canada working nurse cadhour wow im little dubious even guys dont make much usually elaborate mentally emotionally better lived abroad insane mentally living alone away parents wife kid loneliness isnt issue relate situation australia studies worked couple years came back back quite depressing initially finally found decent friend circle shared interests canada main reason moving wasnt financial get away believe disgusting state politics media india muslim birth didnt want daughter double whammy girl raised environment racism often celebrated racism canada absolutely unlike india overt celebrated fight back garner support well huge plus even speak indian friends claim broad minded elitist bullshit visceral fact daughter go school playground without exposed toxicity personally seen something cant put price coming back situation weigh pros cons loneliness hard made worse introvert like join social groups try come shell go explore bit parent angle real one lucky enough parents dont need financial support point time need think future put first tell us much making canada job kind background nurses paid horribly tell hes living pipe dream cad k per annum took months land job tech layoffs average getting around cad k per annum fine adjust bide time decide live huge factor well want live close downtown toronto things expensive ok bit commute much manageable coming get reality check know came wanted everything day luxury cars detached home come get shocked go linkedin job portals scout job opportunities get sense market read cost living city planning initially settle got lucky application delayed pandemic nearly years plenty time read research biggest question need ask want move money countries like dubai might better make lots money retire quickly hell lucky make hr nurse thats assuming canada even recognizes credentials indian credentials accepted next needs appear nclex exam thats good even nurses dont make hr hr canadian cities enough buy house either hopefully wife high paying job haha lol wife wants insta influencer whilst working bank backend earning hour hope works always confident understand state politics media one abroad gives shit issues make people kill india especially states like also agree fact educated people india blinded propaganda think good found good place child good luck finding somewhere live canada facing immigration problems dont homes everyone lot african indian immigrants living tents keep mind winter freezing cold deadly prepared months year company join dm dont feel like sharing someone atlantic canada never make much nurse always hiring nurses make insane amounts money long haul trucking could get trained far far far less university degree canada far trades jobs pay well point office type jobs also buying house years pipe dream mainly build credit ability buy houses though atlantic canada alberta places normal people canadian born otherwise afford buy property bc ontario expensive unreal make kyear ontario lower qol someone making kyear newfoundland people get trades work portions year alberta use money buy property back east im trying say friends timeline bit condensed take longer years lol easily could house millionaires barely afford vancouver company us big one like faang work via staffing company set quebec dont think name help popular company women always better life living canada maybe much pampered men though defrauded whoever told nurses make hour tax take home closer cost living get drift telling someone multiple nurses family welfare people dont want country would anyone pick someone went school canada america cheating alone india completely eroded faith diploma indian school stay india make worth living nurses make people atleast twice much theyre usually way demand many even move us get paid even canada sucks right theres lot culturalpoliticalinfrastructural tension continue thriving india yes women business get sponsored job uk guidance business consultant mainly project manager ba payments",
    "light_cleaned_title": "Is it worth immigrating to Canada for a better life ?",
    "light_cleaned_selftext": "Asking for a friend who is moderately successful in India who is considering moving from India to Canada for a better life. Canada accepts many people from India and Canada is generally very safe country to live in. Thoughts ?",
    "light_cleaned_comments": "Nooooooooo Nooooooooooo Nooooooooo, the reason's already out there. What’s the reason ? People are living in a tent outside University. Don't waste your time and money. Depends on how you define a better life. I was working in a MNC in India, grossing around 50lpa. Paid off car, property nearly paid off, maids, blah blah. I moved her last year, and it's been a bit of a struggle. The first year or two is the hardest, it's nothing like moving from Bangalore to Gurgaon (obviously). For us, it took time to find a job, get the documents sorted (child care benefit, tax stuff, drivers license), get a credit history rolling to start applying for credit (auto loan being a priority). If you don't have a car, you better be able to afford the rents living in downtown because while the public transport is decent, it has its own sets of problems. Financially speaking, we are in a \"worse\" state than India but it is purely from money saved perspective and not the quality of life. From and emotional and mental point of view - I have absolutely no regrets moving to Canada. But keep in mind i am from IT, so finding a well paying job was easy for me which is a HUGE deal as things are expensive here. Can things be better? Of course. They enrolled into education mills - a borderline scam. Sorry, but they were mislead before they even landed here. Absolutely not. Canada has developed a massive anti-Indian sentiment due to mass immigration. My friends in Canada talk about it all the time, you can read articles/reddit subs as well. Avoid strongly. Absolutely not. Mass immigration from India is becoming a problem there. A lot of people face discrimination and disappointment. Avoid. Unless you get a good paying job, Canada is not worth it. Name one country where you can live without a good paying job. While I sort of understand your comment, it's extremely basic and lacks a lot of context. I just dropped my friend and his son to the airport. They are immigrating to Canada, through the wife who is a citizen. He hopes to become a nurse in Newfoundland and someday move into trucking. Life is pretty much set for him. He is not going the education route. He is confident that he will be able to purchase a home in 2 years working as a nurse for 100Cad/hour. No. No. No. People are just going out of FOMO! If your friend is going for a job directly (sponsored) then surely go ahead. If not, then don’t. Unnecessarily spending huge money on universities just to immigrate and struggle doesn’t make sense. I came to UK with a sponsored visa and a high salary package and i am disliking it. I mean the lifestyle in general. I like being in my comfort zone in India with my friends and family. I came because of stupid instagram reels fomo. What happens when you friend who goes for university and realises it is not what he expected? It will just put him under stress and shit. So decide accordingly. Don’t just see people moving and you move. Immigrating to Pakistan right now will give you a better life than immigrating to Canada You can even live in America by yourself with minimum wage, depending on the state. You can also benefit from food stamps etc, which Canada does not have. Rent in bumfuck nowhere, Canada earning minimum wage, just accommodation will take 80%+ of your wage. Nope. Don’t. Not worth it. Listen buddy I'm not gonna sugarcoat it. If you come to study here at a \"college\", you're fucked. Recruiters will not give a second look to you when your application squares up with that of a UofT, York, McMaster, Waterloo etc universities. If you're going to migrate here looking for a job and you're in digital marketing or HR, you're fucked. The market is over-saturated. If you're going to migrate here looking for a job and you're in IT, you probably will be able to land a job. But, it will take time AND it depends on your communication skills. If you plan to live in Toronto or Vancouver, you will burn through your savings faster than you can recoup them. From that POV, Alberta or Manitoba are relatively cheaper but the IT job prospects reduce drastically and so does the salary. I'm in Canada and suggestion to Anyone considering COL is way too high. If you have money, come here. Don't take a loan, high chances you will be struggling. Just look into Canadas reddit, you will realize how much problem they are facing because of immigrants. So dont go to Canada. >working as a nurse for 100Cad/hour. Wow I'm a little dubious. Even the IT guys don't make this much usually Can you elaborate how you are mentally and emotionally better there ? I lived abroad and it's insane mentally living alone away from my parents. I am with my wife and kid - so loneliness isn't an issue for me. But I can relate to your situation. I was in Australia for my studies and worked there for a couple of years before I came back. Back then, it was quite depressing initially until I finally found a decent friend circle with shared interests. As for Canada, my main reason for moving wasn't financial, but to get away from, what I believe, is the disgusting state of politics and media in India. I am a Muslim by birth, and I didn't want my daughter (double whammy being a girl) to be raised in a environment where racism is often celebrated. Is there racism in Canada? Absolutely, but unlike in India, it's not overt or celebrated, and you can fight back against it and garner support for it as well. This to me is a huge plus. Even now, when I speak with some of my Indian \"friends\" who claim to be \"broad minded\", their elitist bullshit is very visceral. The fact that my daughter can go to her school, and playground without being exposed to all the toxicity that I have personally seen is something that I can't put a price on. Coming back to your situation, weigh the pros and cons, loneliness can be hard - only made worse if you are an introvert like me. Join some social groups, try to come out of your shell, go explore a bit. The parent angle is a real one, but I was lucky enough that my parents don't need me for financial support, and at some point of time, you need to think of your future and put yourself first. Can you tell us how much are you making in Canada from your job? I am kind of the same background as you. Nurses are paid horribly here. Tell him he's living a pipe dream. CAD 160k per annum - took me a 2-3 months to land this job, and this was before the tech layoffs. Average I was getting was around CAD 120k per annum which is fine if you can adjust and bide your time. Where you decide to live is a huge factor as well - want to live close to downtown Toronto - Things are expensive. Ok with a bit of commute - much more manageable. But before coming here, get a reality check. I know some who came here and wanted everything from day 1 - luxury cars, detached home and what not, only to come here and get shocked. Go on Linkedin and other job portals and scout out job opportunities, get a sense of the market. Read up on the cost of living for the city you are planning to initially settle in. We got lucky that our application was delayed by the pandemic by nearly 2 years. So we had plenty of time to read up and research. The biggest question you need to ask yourself is - why do you want to move? If it's just for money, then countries like Dubai might be better where you can make lots of money and retire quickly. He’ll be lucky to make $40/hr as a nurse. That’s assuming Canada even recognizes his credentials if he has any. The Indian credentials have been accepted. He next needs to appear for the NCLEX exam . That’s good but even then nurses don’t make $100/hr. $40/hr in most Canadian cities is not enough to buy a house either. Hopefully his wife has a high paying job. Haha lol no, wife wants to be an insta influencer whilst working at a bank backend earning 10$/hour. Hope it works for him He always has been over confident. I understand the state of politics and the media. No one abroad gives shit to issues that can make people kill each other here in India. Especially in UP and other states like these. I also agree with the fact that educated people of India are blinded by propaganda and cannot think of their own. It's good you found a good place for your child. Good luck finding somewhere to live. Canada is facing immigration problems and dont have homes for everyone. Lot of african and indian immigrants are living in tents. Keep in mind that winter is freezing cold and deadly for those who are not prepared 6 months a year. Which company did you join, can you DM if don’t feel like sharing here? As someone from Atlantic Canada he will never make that much as a nurse. But they are always hiring nurses. But he will make insane amounts of money doing long haul trucking. He could get trained to do both for far far far less than any University degree. Canada has far more trades jobs that pay well at this point then office type jobs. Also buying a house in 2 years is a pipe dream mainly because you have to build credit. He DOES have the ability to buy houses though. Atlantic Canada and Alberta are the only places normal people (Canadian born or otherwise) can afford to buy property. B.C. And Ontario are so SO SO expensive its unreal. You can make 100k/year in ontario and have lower QoL than someone making 50K/year in Newfoundland. Most people will get trades, work portions of the year in Alberta and then use that money to buy property back East. So i’m trying to say your friend’s timeline is a bit condensed. It will take him longer than 2-years lol but in under 10 he easily could own a house. Millionaires barely can afford Vancouver. The company is in US, not a big one like FAANG. I work for them via a staffing company set up in Quebec. Don't think name will help you out at all as it's not some popular company. For women it will always be a better life living in Canada. Maybe not so much for pampered men though. You have been defrauded by whoever told you that. Nurses make 45$ an hour. Before tax. So they take home closer to 24$ after cost of living.. you get my drift. Telling you from someone who had multiple nurses in my family. These are the welfare people you don’t want in your country. Why would anyone pick this over someone who went to school in canada or america. the cheating alone in india has completely eroded any faith I have in any \"diploma\" from an Indian school. just stay in India and make it worth living there Nurses make more than It people. Atleast twice as much. They're usually way more in demand and many even move to the US because they get paid even more No. Canada sucks! Not right now. :( There’s a lot of cultural/political/infrastructural tension. Continue thriving in India! Yes WOMEN can do BUSINESS there How did you get a sponsored job in UK? Any guidance? I am a business consultant mainly a project manager and BA in payments"
}