{
    "id": "151znrd",
    "title": "Academic Research on non Anime viewers in India",
    "url": "https://forms.gle/sEF41H422Tr7swD56",
    "selftext": "Greetings everyone,\n\nI am currently working on an academic research for which I need your help.\n \nI am doing a research on Anime viewers vs Non Anime viewers on 'THE EFFECTS OF WATCHING  ANIME ON INDIAN ADULTS'. So if you're someone who doesn't watch Anime, please fill the form. (I have responses for Anime viewers, I need non Anime viewers rn)\n\nInclusion Criteria:\n1) Indian resident above 18years of age\n2) Non Anime viewers. \n\nThank you for filling the form 🙏💛",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689594396.0,
    "convurl": "https://external-preview.redd.it/gzk18JKzCWCotCvqW5CWT65ygCj7bl2U770tPYerEtg.jpg?auto=webp&s=80e06c0596065193c5f83615026c56941bb6fd77",
    "comments": [
        "There's an issue with the form, I  the questions regarding how often one way he's dramas, there is no option to select 'NIL'.",
        "cz if you do not watch online dramas at all, this firm becomes nil",
        "Oh, Okay. So, you want people watch shows other than anime to fill the form but not those who doesn't watch anything? Am I right?",
        "Yes",
        "Okay 👍"
    ],
    "cleaned_text": "academic research non anime viewers india greetings everyone currently working academic research need help research anime viewers vs non anime viewers effects watching anime indian adults youre someone doesnt watch anime please fill form responses anime viewers need non anime viewers rn inclusion criteria indian resident years age non anime viewers thank filling form ",
    "cleaned_title": "academic research non anime viewers india",
    "cleaned_selftext": "greetings everyone currently working academic research need help research anime viewers vs non anime viewers effects watching anime indian adults youre someone doesnt watch anime please fill form responses anime viewers need non anime viewers rn inclusion criteria indian resident years age non anime viewers thank filling form",
    "cleaned_comments": "theres issue form questions regarding often one way hes dramas option select nil cz watch online dramas firm becomes nil oh okay want people watch shows anime fill form doesnt watch anything right yes okay",
    "light_cleaned_title": "Academic Research on non Anime viewers in India",
    "light_cleaned_selftext": "Greetings everyone, I am currently working on an academic research for which I need your help. I am doing a research on Anime viewers vs Non Anime viewers on 'THE EFFECTS OF WATCHING ANIME ON INDIAN ADULTS'. So if you're someone who doesn't watch Anime, please fill the form. (I have responses for Anime viewers, I need non Anime viewers rn) Inclusion Criteria: 1) Indian resident above 18years of age 2) Non Anime viewers. Thank you for filling the form 🙏💛",
    "light_cleaned_comments": "There's an issue with the form, I the questions regarding how often one way he's dramas, there is no option to select 'NIL'. cz if you do not watch online dramas at all, this firm becomes nil Oh, Okay. So, you want people watch shows other than anime to fill the form but not those who doesn't watch anything? Am I right? Yes Okay 👍"
}