{
    "id": "14etk3n",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/14etk3n/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 2,
    "num_comments": 11,
    "created_utc": 1687311010.0,
    "convurl": "https://external-preview.redd.it/FUATMZm8JLDTc_Im2P2hwXDebj9H8XTUE2E46u7I0hY.jpg?auto=webp&amp;s=5fc929642494ebb18a5845c8f59781f1ae11880f",
    "comments": [
        "Just feeling behind in life as I can’t go for MS and all of my friends went there. And worse, feeling lonely as I don’t have close friends and even love.",
        "I’m moving for the seventh time in the last 5 years. I’m tired and exhausted and having severe panic attacks. I feel like someone is sitting on my chest. Somedays all I want to do is sleep and never wake up again. I feel like I have no secure place in my life. I’m just tired down to my bones.",
        "Feeling left behind while i watch my friends and peers succeed and achieve so much. Feeling like a failure because ive never managed to ever set a goal and acheive it. But getting diagnosed with ADHD was finally releiving. Finally understanding that i was not just lazy amd i had an actual problem.\n Ive been setting goals and trying to achieve them slowly. Hope i succeed. I dont wait until the last minute deadline to do things anymore. So thats a progress",
        "I feel good now. I live alone (21 M) in a metro city far from home. My mental got devastated since last year. I used to be a people pleaser, anxious and overthinker ( i still do that ). I have generalised anxiety disorder and got dpdr after smoking some weed (though i recovered in 30 days, if you’re suffering from this then PM for help). I am not a regular smoker, i have smoked only 3-4 times in one year.\n\nMy family never understood me mentally neither the people who are around me. They only call me when they need me. I have some close friends but they live far away and we can’t talk regularly due to busy schedule.\n\nNever had a relationship.I always failed in love. First time I missed the opportunity and second love was already taken.\nI feel like it’s not in my fate to get loved. I feel jealous and suicidal sometimes due to loneliness.\n\n\nBut I have realised my mistakes. The problem with me was I never took my stand, always let others use me as a thing. I never focused on my health.I never appreciated my positive side ( i have a very good job and an excellent academic record in my college).I also went to a psychiatrist for treatment and it has helped me lot in my childhood trauma, anxiety and depersonalisation disorder.\n\n\nI realised that all of this suffering is not worth to take too seriously, if i die alone, who cares? if i am sad, who cares? if i have dpdr or anxiety, who cares?, if i am happy, who cares ? Answer - no one except you.\n\nI stopped chasing people and started focusing on my health and my hobbies. I feel way happier than before. Those who want to stay with you, will stay no matter what. If god is on my side then I don’t need to worry. Everything will be okay in the end no matter what. People might say that this is just a coping mechanism for my mistakes but I don’t care anymore. If it helps me then it’s okay. I am still on meds but that will be over soon. \n\nI am alone but atleast i have my own back if anything happens to me, I live with my fears but it doesn’t bother me now. \n\nJust believe in yourself and never underestimate yourself.\n\nSorry for bad comprehension and feel free to contact if you need help",
        "Shaabash mere sher!",
        "Hey, don't give up or be sad. Take it within your stride. You've managed good so far.",
        "Everyone has a different journey. Your friends start it with their MS. You start your adventure here. Wait till 5 years."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "feeling behind life cant go ms friends went worse feeling lonely dont close friends even love im moving seventh time last years im tired exhausted severe panic attacks feel like someone sitting chest somedays want sleep never wake feel like secure place life im tired bones feeling left behind watch friends peers succeed achieve much feeling like failure ive never managed ever set goal acheive getting diagnosed adhd finally releiving finally understanding lazy amd actual problem ive setting goals trying achieve slowly hope succeed dont wait last minute deadline things anymore thats progress feel good live alone metro city far home mental got devastated since last year used people pleaser anxious overthinker still generalised anxiety disorder got dpdr smoking weed though recovered days youre suffering pm help regular smoker smoked times one year family never understood mentally neither people around call need close friends live far away cant talk regularly due busy schedule never relationshipi always failed love first time missed opportunity second love already taken feel like fate get loved feel jealous suicidal sometimes due loneliness realised mistakes problem never took stand always let others use thing never focused healthi never appreciated positive side good job excellent academic record collegei also went psychiatrist treatment helped lot childhood trauma anxiety depersonalisation disorder realised suffering worth take seriously die alone cares sad cares dpdr anxiety cares happy cares answer one except stopped chasing people started focusing health hobbies feel way happier want stay stay matter god side dont need worry everything okay end matter people might say coping mechanism mistakes dont care anymore helps okay still meds soon alone atleast back anything happens live fears doesnt bother believe never underestimate sorry bad comprehension feel free contact need help shaabash mere sher hey dont give sad take within stride youve managed good far everyone different journey friends start ms start adventure wait till years",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Just feeling behind in life as I can’t go for MS and all of my friends went there. And worse, feeling lonely as I don’t have close friends and even love. I’m moving for the seventh time in the last 5 years. I’m tired and exhausted and having severe panic attacks. I feel like someone is sitting on my chest. Somedays all I want to do is sleep and never wake up again. I feel like I have no secure place in my life. I’m just tired down to my bones. Feeling left behind while i watch my friends and peers succeed and achieve so much. Feeling like a failure because ive never managed to ever set a goal and acheive it. But getting diagnosed with ADHD was finally releiving. Finally understanding that i was not just lazy amd i had an actual problem. Ive been setting goals and trying to achieve them slowly. Hope i succeed. I dont wait until the last minute deadline to do things anymore. So thats a progress I feel good now. I live alone (21 M) in a metro city far from home. My mental got devastated since last year. I used to be a people pleaser, anxious and overthinker ( i still do that ). I have generalised anxiety disorder and got dpdr after smoking some weed (though i recovered in 30 days, if you’re suffering from this then PM for help). I am not a regular smoker, i have smoked only 3-4 times in one year. My family never understood me mentally neither the people who are around me. They only call me when they need me. I have some close friends but they live far away and we can’t talk regularly due to busy schedule. Never had a relationship.I always failed in love. First time I missed the opportunity and second love was already taken. I feel like it’s not in my fate to get loved. I feel jealous and suicidal sometimes due to loneliness. But I have realised my mistakes. The problem with me was I never took my stand, always let others use me as a thing. I never focused on my health.I never appreciated my positive side ( i have a very good job and an excellent academic record in my college).I also went to a psychiatrist for treatment and it has helped me lot in my childhood trauma, anxiety and depersonalisation disorder. I realised that all of this suffering is not worth to take too seriously, if i die alone, who cares? if i am sad, who cares? if i have dpdr or anxiety, who cares?, if i am happy, who cares ? Answer - no one except you. I stopped chasing people and started focusing on my health and my hobbies. I feel way happier than before. Those who want to stay with you, will stay no matter what. If god is on my side then I don’t need to worry. Everything will be okay in the end no matter what. People might say that this is just a coping mechanism for my mistakes but I don’t care anymore. If it helps me then it’s okay. I am still on meds but that will be over soon. I am alone but atleast i have my own back if anything happens to me, I live with my fears but it doesn’t bother me now. Just believe in yourself and never underestimate yourself. Sorry for bad comprehension and feel free to contact if you need help Shaabash mere sher! Hey, don't give up or be sad. Take it within your stride. You've managed good so far. Everyone has a different journey. Your friends start it with their MS. You start your adventure here. Wait till 5 years."
}