{
    "id": "1542j0x",
    "title": "Manipur gangrape happened on May 4th, FIR was filed on May 18th, but the investigation has begun only TODAY",
    "url": "https://www.reddit.com/r/india/comments/1542j0x/manipur_gangrape_happened_on_may_4th_fir_was/",
    "selftext": "[Statement by Manipur police](https://twitter.com/amitmalviya/status/1681711021126189081) dated today, 19th July says that the \"abduction, gangrape, murder etc\" of 2 Kuki girls happened way back on May 4th. The statement further reads that \"The State is making all-out effort to arrest the culprits at the earliest\"\n\nA report by [Scroll](https://scroll.in/article/1052938/video-shows-kuki-women-being-paraded-naked-by-a-mob-manipur-police-confirm-fir-filed) (and other media channels) say \"Based on the complaint, the police said a zero FIR has been registered in the Saikul police station of Kangpokpi district on May 18.\"\n\nQuestion is it's been 2 months since the incident. The police knew about this. The BJP govt of Manipur knew about this. What were doing all this while? Were they protecting the rapists because they were Meiteis? Why is the investigation starting only now! Why is the police claiming to arrest the culpritsts \"at the earliest\" now!!\n\nDon't think that this violence is only limited between Meiteis and Kukis. The State has known about it for 2 months and has done nothing about it. They themselves are responsible. What's more shocking is that the Prime Minister is least bothered. Forget about visiting the state, he hasn't even said a word yet",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689790496.0,
    "convurl": "https://external-preview.redd.it/Mb2-JvqIbiNcZ_bh3hHo3fd1ou4tlE6nwWgW2ixHQig.jpg?auto=webp&s=0e953c8318b5ee3730806fca343ed3c5734a87b7",
    "comments": [],
    "cleaned_text": "manipur gangrape happened may th fir filed may th investigation begun today statement manipur policehttpstwittercomamitmalviyastatus dated today th july says abduction gangrape murder etc kuki girls happened way back may th statement reads state making allout effort arrest culprits earliest report scrollhttpsscrollinarticlevideoshowskukiwomenbeingparadednakedbyamobmanipurpoliceconfirmfirfiled media channels say based complaint police said zero fir registered saikul police station kangpokpi district may question months since incident police knew bjp govt manipur knew protecting rapists meiteis investigation starting police claiming arrest culpritsts earliest dont think violence limited meiteis kukis state known months done nothing responsible whats shocking prime minister least bothered forget visiting state hasnt even said word yet ",
    "cleaned_title": "manipur gangrape happened may th fir filed may th investigation begun today",
    "cleaned_selftext": "statement manipur policehttpstwittercomamitmalviyastatus dated today th july says abduction gangrape murder etc kuki girls happened way back may th statement reads state making allout effort arrest culprits earliest report scrollhttpsscrollinarticlevideoshowskukiwomenbeingparadednakedbyamobmanipurpoliceconfirmfirfiled media channels say based complaint police said zero fir registered saikul police station kangpokpi district may question months since incident police knew bjp govt manipur knew protecting rapists meiteis investigation starting police claiming arrest culpritsts earliest dont think violence limited meiteis kukis state known months done nothing responsible whats shocking prime minister least bothered forget visiting state hasnt even said word yet",
    "cleaned_comments": "",
    "light_cleaned_title": "Manipur gangrape happened on May 4th, FIR was filed on May 18th, but the investigation has begun only TODAY",
    "light_cleaned_selftext": "[Statement by Manipur police](https://twitter.com/amitmalviya/status/1681711021126189081) dated today, 19th July says that the \"abduction, gangrape, murder etc\" of 2 Kuki girls happened way back on May 4th. The statement further reads that \"The State is making all-out effort to arrest the culprits at the earliest\" A report by [Scroll](https://scroll.in/article/1052938/video-shows-kuki-women-being-paraded-naked-by-a-mob-manipur-police-confirm-fir-filed) (and other media channels) say \"Based on the complaint, the police said a zero FIR has been registered in the Saikul police station of Kangpokpi district on May 18.\" Question is it's been 2 months since the incident. The police knew about this. The BJP govt of Manipur knew about this. What were doing all this while? Were they protecting the rapists because they were Meiteis? Why is the investigation starting only now! Why is the police claiming to arrest the culpritsts \"at the earliest\" now!! Don't think that this violence is only limited between Meiteis and Kukis. The State has known about it for 2 months and has done nothing about it. They themselves are responsible. What's more shocking is that the Prime Minister is least bothered. Forget about visiting the state, he hasn't even said a word yet",
    "light_cleaned_comments": ""
}