{
    "id": "1b7tstf",
    "title": "Parle always disappoint me. Not the first time. It happens to me earlier also.",
    "url": "https://i.redd.it/fj5rdyej1omc1.jpeg",
    "selftext": "Fungus is very common problem nowadays specially in parle biscuit. Please be aware of this while eating please look before you eat or give to your small baby.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1709709974.0,
    "convurl": "https://i.redd.it/fj5rdyej1omc1.jpeg",
    "comments": [
        "I am more dissappointed with the fact that of all the places you could've chosen to place these biscuits on and click a pic, you chose your laptop's keypad.",
        "I don't think that's fungus; it's sugar bloom. Common with lots of chocolate chip cookies",
        "?",
        "I doubt it's fungus. If it was it would've been on the whole biscuit right and not just the choco chips? It's probably sugar bloom on the chocolates. But I'm a visual eater and I wouldn't eat it too.",
        "Its sugar which got crystallized",
        "You’re Goddamn Right.\n\nThat’s 99.1% pure crystal sugar."
    ],
    "cleaned_text": "parle always disappoint first time happens earlier also fungus common problem nowadays specially parle biscuit please aware eating please look eat give small baby ",
    "cleaned_title": "parle always disappoint first time happens earlier also",
    "cleaned_selftext": "fungus common problem nowadays specially parle biscuit please aware eating please look eat give small baby",
    "cleaned_comments": "dissappointed fact places couldve chosen place biscuits click pic chose laptops keypad dont think thats fungus sugar bloom common lots chocolate chip cookies doubt fungus wouldve whole biscuit right choco chips probably sugar bloom chocolates im visual eater wouldnt eat sugar got crystallized youre goddamn right thats pure crystal sugar",
    "light_cleaned_title": "Parle always disappoint me. Not the first time. It happens to me earlier also.",
    "light_cleaned_selftext": "Fungus is very common problem nowadays specially in parle biscuit. Please be aware of this while eating please look before you eat or give to your small baby.",
    "light_cleaned_comments": "I am more dissappointed with the fact that of all the places you could've chosen to place these biscuits on and click a pic, you chose your laptop's keypad. I don't think that's fungus; it's sugar bloom. Common with lots of chocolate chip cookies ? I doubt it's fungus. If it was it would've been on the whole biscuit right and not just the choco chips? It's probably sugar bloom on the chocolates. But I'm a visual eater and I wouldn't eat it too. Its sugar which got crystallized You’re Goddamn Right. That’s 99.1% pure crystal sugar."
}