{
    "id": "1hce41o",
    "title": "Judiciary draws its power from two fountains, public acceptance of the authority of the judiciary and the integrity of the judiciary. ",
    "url": "https://www.thehindu.com/news/national/the-code-of-conduct-judges-need-to-follow/article68970576.ece/amp/",
    "selftext": "Justice Yadav has said that \n\n> *The country would function as per the wishes of the majority living in Hindustan. He remarked that while children of one community are taught kindness and tolerance, it would be difficult to expect the same from children of “another community” especially when they witness animal slaughter.*\n\nOn the push for the Uniform Civil Code, Justice Yadav has said that \n\n> *Hindus revere women as goddesses even as members of the “other community” practice polygamy, Halala or triple talaq.*\n\nThe Supreme Court, in a statement, said \n\n> *it has taken note of the newspaper reports on Justice Yadav’s speech. It said details have been asked from the Allahabad High Court and that the “matter is under consideration”.*",
    "flair": "Law & Courts",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1733981241.0,
    "convurl": "https://external-preview.redd.it/r_1iVyNGL5KdHAXegFK4h--buWu8980rd5_8SL5_yBY.jpg?auto=webp&s=102057315b10d5d7445653d65f8fd08b7547dcb8",
    "comments": [
        "[Six core values are recognized: *Independence, impartiality, integrity, propriety, equality and finally competence and diligence.* ](https://www.judicialintegritygroup.org/images/resources/documents/ECOSOC_2006_23_Engl.pdf)"
    ],
    "cleaned_text": "judiciary draws power two fountains public acceptance authority judiciary integrity judiciary justice yadav said country would function per wishes majority living hindustan remarked children one community taught kindness tolerance would difficult expect children another community especially witness animal slaughter push uniform civil code justice yadav said hindus revere women goddesses even members community practice polygamy halala triple talaq supreme court statement said taken note newspaper reports justice yadavs speech said details asked allahabad high court matter consideration ",
    "cleaned_title": "judiciary draws power two fountains public acceptance authority judiciary integrity judiciary",
    "cleaned_selftext": "justice yadav said country would function per wishes majority living hindustan remarked children one community taught kindness tolerance would difficult expect children another community especially witness animal slaughter push uniform civil code justice yadav said hindus revere women goddesses even members community practice polygamy halala triple talaq supreme court statement said taken note newspaper reports justice yadavs speech said details asked allahabad high court matter consideration",
    "cleaned_comments": "six core values recognized independence impartiality integrity propriety equality finally competence diligence httpswwwjudicialintegritygrouporgimagesresourcesdocumentsecosocenglpdf",
    "light_cleaned_title": "Judiciary draws its power from two fountains, public acceptance of the authority of the judiciary and the integrity of the judiciary.",
    "light_cleaned_selftext": "Justice Yadav has said that > *The country would function as per the wishes of the majority living in Hindustan. He remarked that while children of one community are taught kindness and tolerance, it would be difficult to expect the same from children of “another community” especially when they witness animal slaughter.* On the push for the Uniform Civil Code, Justice Yadav has said that > *Hindus revere women as goddesses even as members of the “other community” practice polygamy, Halala or triple talaq.* The Supreme Court, in a statement, said > *it has taken note of the newspaper reports on Justice Yadav’s speech. It said details have been asked from the Allahabad High Court and that the “matter is under consideration”.*",
    "light_cleaned_comments": "[Six core values are recognized: *Independence, impartiality, integrity, propriety, equality and finally competence and diligence.* ](https://www.judicialintegritygroup.org/images/resources/documents/ECOSOC_2006_23_Engl.pdf)"
}