{
    "id": "16mo1je",
    "title": "Thoughts: Technician Who Helped Build Chandrayaan-3 Launchpad Now Selling Idlis",
    "url": "https://www.ndtv.com/india-news/technician-who-helped-build-chandrayaan-3-launchpad-now-selling-idlis-read-his-story-4403414",
    "selftext": "According to the BBC, around 2,800 employees of the HEC claim that have not received their salaries for the past 18 months.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 17,
    "created_utc": 1695121669.0,
    "convurl": "https://external-preview.redd.it/ZgyxVlh2Z7j9hdI2PU82j8WW_q0_at2a5ln0x-XOtdg.jpg?auto=webp&s=092af7eb3f5b92c73a443242d6b74c1c0d28befd",
    "comments": [
        ">In 2012, he quit his job in a private company and joined HEC on a salary of ₹ 8,000. Being a government company, he had hoped that his future would be bright but things did not turn out to be in his favour.\n\nNo one has job security any more, not even PSU people.",
        "His mistake was selling idols as opposed to pakodas as the supreme leader had suggested",
        "Please refer PIB's fact check to thie claim",
        "He is a contact worker ..employed by HEC under fixed contract. Most probably even then he is not on the pay roll of HEC but some 3rd party vendor. The title is very misleading",
        "I don't see any fact check against this.\n\nTheir last fact check was that ISRO employees get paid on time while conveniently ignoring that most of the the work gets out sourced to multiple govt and private entities and they too count as contributors. This guy belongs HEC which is one such govt entity.",
        "That's what I am saying. He is just a contract worker working for some 3rd party agency in HEC site. He is not an employee of HEC.",
        "Well he could've made use of the sewer gas technology. \n\nJokes aside I hope the government pays off their salaries.",
        "Their fact check on Twitter says HEC did not work on anything related to Chandrayaan 3. Which is odd because there is a news article from July which talks of HEC engineers celebrating Chandrayaan lift off.",
        "Wake up darling we got another propaganda to post",
        "Classic rookie mistake",
        " \n\n## According to the BBC, around 2,800 employees of the HEC claim that have not received their salaries for the past 18 months.",
        "Kebab mat laao idhar",
        "Yeh mere liye tha?",
        "If you don’t know how the PSUs work, what are the roles of contract workers and on roll staff and you just want to by what BBC has to say rather than an officer from PSU who dealt with hundreds of contract workers in my career..then god save you",
        "BBC is pretty hostile towards India for some reason.",
        "See brother, it's not propoganda of the good guys do it. Then it's just Emotional Truth"
    ],
    "cleaned_text": "thoughts technician helped build chandrayaan launchpad selling idlis according bbc around employees hec claim received salaries past months ",
    "cleaned_title": "thoughts technician helped build chandrayaan launchpad selling idlis",
    "cleaned_selftext": "according bbc around employees hec claim received salaries past months",
    "cleaned_comments": "quit job private company joined hec salary government company hoped future would bright things turn favour one job security even psu people mistake selling idols opposed pakodas supreme leader suggested please refer pibs fact check thie claim contact worker employed hec fixed contract probably even pay roll hec rd party vendor title misleading dont see fact check last fact check isro employees get paid time conveniently ignoring work gets sourced multiple govt private entities count contributors guy belongs hec one govt entity thats saying contract worker working rd party agency hec site employee hec well couldve made use sewer gas technology jokes aside hope government pays salaries fact check twitter says hec work anything related chandrayaan odd news article july talks hec engineers celebrating chandrayaan lift wake darling got another propaganda post classic rookie mistake according bbc around employees hec claim received salaries past months kebab mat laao idhar yeh mere liye tha dont know psus work roles contract workers roll staff want bbc say rather officer psu dealt hundreds contract workers careerthen god save bbc pretty hostile towards india reason see brother propoganda good guys emotional truth",
    "light_cleaned_title": "Thoughts: Technician Who Helped Build Chandrayaan-3 Launchpad Now Selling Idlis",
    "light_cleaned_selftext": "According to the BBC, around 2,800 employees of the HEC claim that have not received their salaries for the past 18 months.",
    "light_cleaned_comments": ">In 2012, he quit his job in a private company and joined HEC on a salary of ₹ 8,000. Being a government company, he had hoped that his future would be bright but things did not turn out to be in his favour. No one has job security any more, not even PSU people. His mistake was selling idols as opposed to pakodas as the supreme leader had suggested Please refer PIB's fact check to thie claim He is a contact worker ..employed by HEC under fixed contract. Most probably even then he is not on the pay roll of HEC but some 3rd party vendor. The title is very misleading I don't see any fact check against this. Their last fact check was that ISRO employees get paid on time while conveniently ignoring that most of the the work gets out sourced to multiple govt and private entities and they too count as contributors. This guy belongs HEC which is one such govt entity. That's what I am saying. He is just a contract worker working for some 3rd party agency in HEC site. He is not an employee of HEC. Well he could've made use of the sewer gas technology. Jokes aside I hope the government pays off their salaries. Their fact check on Twitter says HEC did not work on anything related to Chandrayaan 3. Which is odd because there is a news article from July which talks of HEC engineers celebrating Chandrayaan lift off. Wake up darling we got another propaganda to post Classic rookie mistake ## According to the BBC, around 2,800 employees of the HEC claim that have not received their salaries for the past 18 months. Kebab mat laao idhar Yeh mere liye tha? If you don’t know how the PSUs work, what are the roles of contract workers and on roll staff and you just want to by what BBC has to say rather than an officer from PSU who dealt with hundreds of contract workers in my career..then god save you BBC is pretty hostile towards India for some reason. See brother, it's not propoganda of the good guys do it. Then it's just Emotional Truth"
}