{
    "id": "128frg1",
    "title": "Do you use a vacmop in India?",
    "url": "https://www.reddit.com/r/india/comments/128frg1/do_you_use_a_vacmop_in_india/",
    "selftext": "Our house has 2 portions that are open and have lots of plants hence they collect lots of dust. Cleaning them daily is a task and maids have been useless so far. They come and go , some are inadequate , some go missing for a couple days without prior notice. Daily we have to \"jhadu\" the place to take out the dirt and soil from plants , and then mop the place, cuz of the stains. I was thinking of buying a vacmop. Does anyone use a vacmop in india and can they be better and less time consuming than traditional \"jhadu pocha\".\n\nA couple things I need it to do-\n\n1. take out the soil that our pets daily manage to dig out of the flowerpots.\n2. take out the stains , for eg when we water the plants, sometimes it falls out and that combined with dirt , our pets step into it and leave stains on the floor.\n3. can do both dry and wet cleaning.\n4. Is corded, cuz our house is quite big and most cordless runs only 30-35 mins on full recharge.\n\nSo far I've found [https://www.eurekaforbes.com/vacuum-cleaners/euroclean-mop-n-vac](https://www.eurekaforbes.com/vacuum-cleaners/euroclean-mop-n-vac) , has anyone used it?",
    "flair": "AskIndia",
    "score": 5,
    "num_comments": 10,
    "created_utc": 1680337432.0,
    "convurl": "https://external-preview.redd.it/KbcdWg4kof79PAesNS7yE3lHLo0EMinoJmkXOwnBeMQ.jpg?auto=webp&v=enabled&s=0e126b80fb64272ace97bc342dce509fbc6e9282",
    "comments": [
        "Yes, we have had this model since mid 2020.\n\nIt works well enough, but we've had the machine just stop working out of the blue thrice. First time, support was useless, they did some hack-job, which failed again and ultimately replaced it with a new machine. Took over a month. \n\nThe second time it turned out to be a problem with the cord. They again took quite a while to replace it. The cord failed yet again(this time it was out of warranty). We replaced it ourselves and it has worked okay since then.\n\nI'll warn you that initially it can be quite painful for your arm. And by all means wash and let the brush dry out thoroughly after use.",
        "sounds like too much of a hassle.",
        "It does do its job very well when it's working. I just wish they had better support. Idk if its particularly bad in my city or something.",
        "I have this and love it. It is heavier than your regular vacuum cleaner so that will take a little getting used to, but its really not that big a deal. I've had mine since mid 2021 and haven't had any issues with it so far. \n\nI have really bad dust allergies so sweeping is out of the question for me. This is a breeze because it does both your sweeping and mopping in one go. \n\nA few things I find annoying though is that the cord is not retractable. Also, because of the design of the head, there will be a 1 inch border on the ground alongside your walls that won't get cleaned. I wish the bezel part of the head wasn't that thick.",
        "1. any reparations/malfunctioning in 2 years?\n2. how's the suction? Especially for open houses?\n3. how's the stain removal?\n4. can we use it daily?",
        "1. I bought mine in August 2021 so it's just been 1.5 years so far. No malfunctions or repairs needed yet. \n2. Suction is fairly decent. I'm not quite sure how to answer that. It will pick up loose dirt, dust and even sticky things like cooked rice and even a broken raw egg just fine. \n3. Hard set stains no, it isn't strong enough for those. I spilled red wine on my carpet and the mop n vac cleaned it up without a trace, but that was immediately after I spilled it. Had I left the wine to sit for some time, I'm not so sure. Also, things like clay, play dough, patafix on the ground can't be cleaned with this. \n4. Yes you can use it daily. Whenever we have guests and small kids have made a mess after eating, I like to quickly take this out and spot clean so that the food doesn't get trampled on and spread around. \n\nYou can call Eureka Forbes and they'll come home to do a demo. That will give you a  idea of its capabilities and limitations before you make a purchase.",
        ">You can call Eureka Forbes and they'll come home to do a demo. That will give you a  idea of its capabilities and limitations before you make a purchase.\n\nthats cool. thanks",
        "Only the rich use vacuum cleaners in India. Middle class people use jhaadu",
        "Checkout out Tineco dry/wet vacuum. It’s the best in its category and quite affordable. You have to be realistic however: if you have pets in India or lots of potted soil inside the house, keeping a place clean is probably a lost cause."
    ],
    "cleaned_text": "use vacmop india house portions open lots plants hence collect lots dust cleaning daily task maids useless far come go inadequate go missing couple days without prior notice daily jhadu place take dirt soil plants mop place cuz stains thinking buying vacmop anyone use vacmop india better less time consuming traditional jhadu pocha couple things need take soil pets daily manage dig flowerpots take stains eg water plants sometimes falls combined dirt pets step leave stains floor dry wet cleaning corded cuz house quite big cordless runs mins full recharge far ive found httpswwweurekaforbescomvacuumcleanerseurocleanmopnvachttpswwweurekaforbescomvacuumcleanerseurocleanmopnvac anyone used ",
    "cleaned_title": "use vacmop india",
    "cleaned_selftext": "house portions open lots plants hence collect lots dust cleaning daily task maids useless far come go inadequate go missing couple days without prior notice daily jhadu place take dirt soil plants mop place cuz stains thinking buying vacmop anyone use vacmop india better less time consuming traditional jhadu pocha couple things need take soil pets daily manage dig flowerpots take stains eg water plants sometimes falls combined dirt pets step leave stains floor dry wet cleaning corded cuz house quite big cordless runs mins full recharge far ive found httpswwweurekaforbescomvacuumcleanerseurocleanmopnvachttpswwweurekaforbescomvacuumcleanerseurocleanmopnvac anyone used",
    "cleaned_comments": "yes model since mid works well enough weve machine stop working blue thrice first time support useless hackjob failed ultimately replaced new machine took month second time turned problem cord took quite replace cord failed yet againthis time warranty replaced worked okay since ill warn initially quite painful arm means wash let brush dry thoroughly use sounds like much hassle job well working wish better support idk particularly bad city something love heavier regular vacuum cleaner take little getting used really big deal ive mine since mid havent issues far really bad dust allergies sweeping question breeze sweeping mopping one go things find annoying though cord retractable also design head inch border ground alongside walls wont get cleaned wish bezel part head wasnt thick reparationsmalfunctioning years hows suction especially open houses hows stain removal use daily bought mine august years far malfunctions repairs needed yet suction fairly decent im quite sure answer pick loose dirt dust even sticky things like cooked rice even broken raw egg fine hard set stains isnt strong enough spilled red wine carpet mop n vac cleaned without trace immediately spilled left wine sit time im sure also things like clay play dough patafix ground cant cleaned yes use daily whenever guests small kids made mess eating like quickly take spot clean food doesnt get trampled spread around call eureka forbes theyll come home demo give idea capabilities limitations make purchase call eureka forbes theyll come home demo give idea capabilities limitations make purchase thats cool thanks rich use vacuum cleaners india middle class people use jhaadu checkout tineco drywet vacuum best category quite affordable realistic however pets india lots potted soil inside house keeping place clean probably lost cause",
    "light_cleaned_title": "Do you use a vacmop in India?",
    "light_cleaned_selftext": "Our house has 2 portions that are open and have lots of plants hence they collect lots of dust. Cleaning them daily is a task and maids have been useless so far. They come and go , some are inadequate , some go missing for a couple days without prior notice. Daily we have to \"jhadu\" the place to take out the dirt and soil from plants , and then mop the place, cuz of the stains. I was thinking of buying a vacmop. Does anyone use a vacmop in india and can they be better and less time consuming than traditional \"jhadu pocha\". A couple things I need it to do- 1. take out the soil that our pets daily manage to dig out of the flowerpots. 2. take out the stains , for eg when we water the plants, sometimes it falls out and that combined with dirt , our pets step into it and leave stains on the floor. 3. can do both dry and wet cleaning. 4. Is corded, cuz our house is quite big and most cordless runs only 30-35 mins on full recharge. So far I've found [https://www.eurekaforbes.com/vacuum-cleaners/euroclean-mop-n-vac](https://www.eurekaforbes.com/vacuum-cleaners/euroclean-mop-n-vac) , has anyone used it?",
    "light_cleaned_comments": "Yes, we have had this model since mid 2020. It works well enough, but we've had the machine just stop working out of the blue thrice. First time, support was useless, they did some hack-job, which failed again and ultimately replaced it with a new machine. Took over a month. The second time it turned out to be a problem with the cord. They again took quite a while to replace it. The cord failed yet again(this time it was out of warranty). We replaced it ourselves and it has worked okay since then. I'll warn you that initially it can be quite painful for your arm. And by all means wash and let the brush dry out thoroughly after use. sounds like too much of a hassle. It does do its job very well when it's working. I just wish they had better support. Idk if its particularly bad in my city or something. I have this and love it. It is heavier than your regular vacuum cleaner so that will take a little getting used to, but its really not that big a deal. I've had mine since mid 2021 and haven't had any issues with it so far. I have really bad dust allergies so sweeping is out of the question for me. This is a breeze because it does both your sweeping and mopping in one go. A few things I find annoying though is that the cord is not retractable. Also, because of the design of the head, there will be a 1 inch border on the ground alongside your walls that won't get cleaned. I wish the bezel part of the head wasn't that thick. 1. any reparations/malfunctioning in 2 years? 2. how's the suction? Especially for open houses? 3. how's the stain removal? 4. can we use it daily? 1. I bought mine in August 2021 so it's just been 1.5 years so far. No malfunctions or repairs needed yet. 2. Suction is fairly decent. I'm not quite sure how to answer that. It will pick up loose dirt, dust and even sticky things like cooked rice and even a broken raw egg just fine. 3. Hard set stains no, it isn't strong enough for those. I spilled red wine on my carpet and the mop n vac cleaned it up without a trace, but that was immediately after I spilled it. Had I left the wine to sit for some time, I'm not so sure. Also, things like clay, play dough, patafix on the ground can't be cleaned with this. 4. Yes you can use it daily. Whenever we have guests and small kids have made a mess after eating, I like to quickly take this out and spot clean so that the food doesn't get trampled on and spread around. You can call Eureka Forbes and they'll come home to do a demo. That will give you a idea of its capabilities and limitations before you make a purchase. >You can call Eureka Forbes and they'll come home to do a demo. That will give you a idea of its capabilities and limitations before you make a purchase. thats cool. thanks Only the rich use vacuum cleaners in India. Middle class people use jhaadu Checkout out Tineco dry/wet vacuum. It’s the best in its category and quite affordable. You have to be realistic however: if you have pets in India or lots of potted soil inside the house, keeping a place clean is probably a lost cause."
}