{
    "id": "14tw2i5",
    "title": "WB panchayat polls: Polling booth vandalised, ballot papers set on fire in Coochbehar",
    "url": "https://www.thestatesman.com/bengal/wb-panchayat-polls-polling-booth-vandalised-ballot-papers-set-on-fire-in-coochbehar-1503198213.html",
    "selftext": "I never thought I would be able to show my kids elections of 90s, but here it is. Kids this is how elections were rigged in 90s",
    "flair": "Politics",
    "score": 40,
    "num_comments": 12,
    "created_utc": 1688797879.0,
    "convurl": "https://external-preview.redd.it/Uw2F0A9MC0z1kw6K-RarMaZ-LANBfm3XjM5nTGXFBJY.jpg?auto=webp&s=38fed10dd445dcdd402e9015568485a3f784ac29",
    "comments": [
        "Why is there no megathread related to the violence in West Bengal. There is no other post except this. If this was a BJP run state then there would have been 20 posts at least.",
        "Bangal is the last bastion of free speech. If you start criticizing that then what is left?",
        "Free speech means fair elections then",
        "Have you actually been to r/Kolkata?",
        "yes , but that is not the point I am making though.",
        "It's a well known fact that she's Mudi in a saree"
    ],
    "cleaned_text": "wb panchayat polls polling booth vandalised ballot papers set fire coochbehar never thought would able show kids elections kids elections rigged ",
    "cleaned_title": "wb panchayat polls polling booth vandalised ballot papers set fire coochbehar",
    "cleaned_selftext": "never thought would able show kids elections kids elections rigged",
    "cleaned_comments": "megathread related violence west bengal post except bjp run state would posts least bangal last bastion free speech start criticizing left free speech means fair elections actually rkolkata yes point making though well known fact shes mudi saree",
    "light_cleaned_title": "WB panchayat polls: Polling booth vandalised, ballot papers set on fire in Coochbehar",
    "light_cleaned_selftext": "I never thought I would be able to show my kids elections of 90s, but here it is. Kids this is how elections were rigged in 90s",
    "light_cleaned_comments": "Why is there no megathread related to the violence in West Bengal. There is no other post except this. If this was a BJP run state then there would have been 20 posts at least. Bangal is the last bastion of free speech. If you start criticizing that then what is left? Free speech means fair elections then Have you actually been to r/Kolkata? yes , but that is not the point I am making though. It's a well known fact that she's Mudi in a saree"
}