{
    "id": "18mxih6",
    "title": "Death penalty for mob lynching under new criminal law, says Amit Shah",
    "url": "https://www.livemint.com/news/india/mob-lynching-accused-to-be-punished-with-death-penalty-under-new-law-amit-shah-new-criminal-laws-lok-sabha-parliament-11703081391105.html",
    "selftext": "Union Home Minister Amit Shah said a provision for capital punishment for committing the crime of mob lynching has been included in the new criminal laws.",
    "flair": "Law & Courts",
    "score": 59,
    "num_comments": 11,
    "created_utc": 1703086866.0,
    "convurl": "https://external-preview.redd.it/RMz79FfwsGmWkEayPDcziN05KKzk-h4dIFQpwLcEmJ4.jpg?auto=webp&s=0df99de3cbbc4a8ec9e779bafae631a000342504",
    "comments": [
        "😂 election drama",
        "I wonder if this will also apply to \"gau rakshaks\" who lynch innocent people for funsies?",
        "It feels like there is a lot he is not saying..the caveats, the exceptions etc.",
        "Friendly fire on?",
        "Death penalty for whom exactly? For a whole mob? \nSo if 15 people beat a guy to death all of them get death?\nThis has so much room to be misused. The cops can pickup anybody from the scene and makeup a case.\nThese are the debates that would have happened in the parliament if it had gone through the due process. But we will harm generations of Indians just because we need to stay in power.",
        "BJP works get count in mob?",
        "This is a good law, but not sure how are they going to enforce it. In a mob lynching in tribal areas, the entire village is responsible for killing someone because they belive she is a witch. Is this enforceable?\n\nHow about the mob lynching done by BJP/RSS followers ?\n\nOr, this is just another law that never gets a conviction and TODO for the next ruling party to fix?",
        "And these 9 comments here are probably more of a discussion than what happened (or rather, was allowed to happen) in the Parliament.",
        "Death sentence for rapist"
    ],
    "cleaned_text": "death penalty mob lynching new criminal law says amit shah union home minister amit shah said provision capital punishment committing crime mob lynching included new criminal laws ",
    "cleaned_title": "death penalty mob lynching new criminal law says amit shah",
    "cleaned_selftext": "union home minister amit shah said provision capital punishment committing crime mob lynching included new criminal laws",
    "cleaned_comments": "election drama wonder also apply gau rakshaks lynch innocent people funsies feels like lot sayingthe caveats exceptions etc friendly fire death penalty exactly whole mob people beat guy death get death much room misused cops pickup anybody scene makeup case debates would happened parliament gone due process harm generations indians need stay power bjp works get count mob good law sure going enforce mob lynching tribal areas entire village responsible killing someone belive witch enforceable mob lynching done bjprss followers another law never gets conviction todo next ruling party fix comments probably discussion happened rather allowed happen parliament death sentence rapist",
    "light_cleaned_title": "Death penalty for mob lynching under new criminal law, says Amit Shah",
    "light_cleaned_selftext": "Union Home Minister Amit Shah said a provision for capital punishment for committing the crime of mob lynching has been included in the new criminal laws.",
    "light_cleaned_comments": "😂 election drama I wonder if this will also apply to \"gau rakshaks\" who lynch innocent people for funsies? It feels like there is a lot he is not saying..the caveats, the exceptions etc. Friendly fire on? Death penalty for whom exactly? For a whole mob? So if 15 people beat a guy to death all of them get death? This has so much room to be misused. The cops can pickup anybody from the scene and makeup a case. These are the debates that would have happened in the parliament if it had gone through the due process. But we will harm generations of Indians just because we need to stay in power. BJP works get count in mob? This is a good law, but not sure how are they going to enforce it. In a mob lynching in tribal areas, the entire village is responsible for killing someone because they belive she is a witch. Is this enforceable? How about the mob lynching done by BJP/RSS followers ? Or, this is just another law that never gets a conviction and TODO for the next ruling party to fix? And these 9 comments here are probably more of a discussion than what happened (or rather, was allowed to happen) in the Parliament. Death sentence for rapist"
}