{
    "id": "14utdlw",
    "title": "Bengal panchayat polls: Ballot boxes set on fire, filled with water, thrown into pond and some in ‘relay race’",
    "url": "https://v.redd.it/9ttsy9hjjwab1",
    "selftext": "https://m.timesofindia.com/city/kolkata/ballot-boxes-set-on-fire-filled-with-water-thrown-into-pond-and-some-in-relay-race/articleshow/101606527.cms",
    "flair": "Politics",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1688892176.0,
    "convurl": "https://external-preview.redd.it/dTBiMzJ2M2pqd2FiMYqnU-gEjTxZqT7zrmNvRLQwxx9IMDMgTF6tXWgbz7F1.png?format=pjpg&auto=webp&v=enabled&s=d1a9b6830fa8ea7baf4ed5e5e685ee3ffc9273ac",
    "comments": [
        "Bro has a bright future in Olympics.",
        "Genuine question -- Isn't voting done thru EVM? or is it the case that the local votes are done thru ballot boxes",
        "So are the elections going to be reheld or are we going to call this joke a democracy?",
        "What is funny is that suvendu adhikari openly declared his plan of throwing ballot box in the water before the elections happened. That is one promise kept. /s",
        "Panchayat elections in WB (dunno about other states) are done via paper ballots.\n\nVidhansabha and Loksabha are via EVMs, of course.",
        "Acc. to mahua moitra, this is the highest ideal of democracy."
    ],
    "cleaned_text": "bengal panchayat polls ballot boxes set fire filled water thrown pond relay race  ",
    "cleaned_title": "bengal panchayat polls ballot boxes set fire filled water thrown pond relay race",
    "cleaned_selftext": "",
    "cleaned_comments": "bro bright future olympics genuine question isnt voting done thru evm case local votes done thru ballot boxes elections going reheld going call joke democracy funny suvendu adhikari openly declared plan throwing ballot box water elections happened one promise kept panchayat elections wb dunno states done via paper ballots vidhansabha loksabha via evms course acc mahua moitra highest ideal democracy",
    "light_cleaned_title": "Bengal panchayat polls: Ballot boxes set on fire, filled with water, thrown into pond and some in ‘relay race’",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Bro has a bright future in Olympics. Genuine question -- Isn't voting done thru EVM? or is it the case that the local votes are done thru ballot boxes So are the elections going to be reheld or are we going to call this joke a democracy? What is funny is that suvendu adhikari openly declared his plan of throwing ballot box in the water before the elections happened. That is one promise kept. /s Panchayat elections in WB (dunno about other states) are done via paper ballots. Vidhansabha and Loksabha are via EVMs, of course. Acc. to mahua moitra, this is the highest ideal of democracy."
}