{
    "id": "16oy729",
    "title": "For all the extremist claiming Canada has no proof",
    "url": "https://www.reddit.com/gallery/16oy729",
    "selftext": "Modi is actively trying to suppress the sikh community in India and Canada",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695348340.0,
    "convurl": "https://i.redd.it/j7etvkb1tppb1.jpg",
    "comments": [
        "Not concerned about what Khalistanis say, but these people should be punished. \n\nIt’s a big shame. Half of parliament have criminal cases, and they protect each other across party lines from being arrested. BJP also celebrating and using rapists for campaigning, opposition didn’t do anything.",
        "I thought Tytler was convicted at one point, that said two of the three in this infographic are dead already. The case against Tytler is apparently ongoing hopefully he'd be convicted, HS Phoolka is pursuing the case against him.",
        "He only got charged now in 2023. Might die without getting justice since he’s 79, which would be a shame",
        "No involvement of Balram Jhakhar is cited anywhere with anti Sikh riots of 1984. Not in any lists. \nChandra Sekhar was in Janata Dal and only became PM from 1990 to 1991 and 1990 was peak of Sikh militancy with most civilians killed by them. And, Govt was looking to take action against it.\n\nWhat are the sources of the comments even?\n\nJagdish Tytler is one that has been accused most, but most of the evidence was destroyed during Congress led Govts. \n\nFixing Judiciary and police requires cost and transparency which no political leaders want as most have had criminal involvements."
    ],
    "cleaned_text": "extremist claiming canada proof modi actively trying suppress sikh community india canada ",
    "cleaned_title": "extremist claiming canada proof",
    "cleaned_selftext": "modi actively trying suppress sikh community india canada",
    "cleaned_comments": "concerned khalistanis say people punished big shame half parliament criminal cases protect across party lines arrested bjp also celebrating using rapists campaigning opposition didnt anything thought tytler convicted one point said two three infographic dead already case tytler apparently ongoing hopefully hed convicted hs phoolka pursuing case got charged might die without getting justice since hes would shame involvement balram jhakhar cited anywhere anti sikh riots lists chandra sekhar janata dal became pm peak sikh militancy civilians killed govt looking take action sources comments even jagdish tytler one accused evidence destroyed congress led govts fixing judiciary police requires cost transparency political leaders want criminal involvements",
    "light_cleaned_title": "For all the extremist claiming Canada has no proof",
    "light_cleaned_selftext": "Modi is actively trying to suppress the sikh community in India and Canada",
    "light_cleaned_comments": "Not concerned about what Khalistanis say, but these people should be punished. It’s a big shame. Half of parliament have criminal cases, and they protect each other across party lines from being arrested. BJP also celebrating and using rapists for campaigning, opposition didn’t do anything. I thought Tytler was convicted at one point, that said two of the three in this infographic are dead already. The case against Tytler is apparently ongoing hopefully he'd be convicted, HS Phoolka is pursuing the case against him. He only got charged now in 2023. Might die without getting justice since he’s 79, which would be a shame No involvement of Balram Jhakhar is cited anywhere with anti Sikh riots of 1984. Not in any lists. Chandra Sekhar was in Janata Dal and only became PM from 1990 to 1991 and 1990 was peak of Sikh militancy with most civilians killed by them. And, Govt was looking to take action against it. What are the sources of the comments even? Jagdish Tytler is one that has been accused most, but most of the evidence was destroyed during Congress led Govts. Fixing Judiciary and police requires cost and transparency which no political leaders want as most have had criminal involvements."
}