{
    "id": "18alyor",
    "title": "Under siege: Huge network of Chinese fake accounts set up to disrupt India, US 2024 polls exposed",
    "url": "https://www.firstpost.com/tech/meta-exposes-huge-network-of-chinese-fake-accounts-set-up-to-disrupt-india-us-2024-polls-13462072.html",
    "selftext": "What you all think  which side is favoured by chine?\n and why?",
    "flair": "Politics",
    "score": 475,
    "num_comments": 64,
    "created_utc": 1701701953.0,
    "convurl": "https://external-preview.redd.it/Nhj51CB25nL3zk0Y6gIkLbm5AhBAF4KYPxvUyATlTlQ.jpg?auto=webp&s=3fa07e664eace13f9abf5c5f1299ba47593bf493",
    "comments": [
        "They don't need to do anything even the congress trying to get modi 3rd term",
        "> Meta, in a report, has revealed that it identified and took down about 4,700 fake Chinese accounts that were set up to disrupt the 2024 elections in India and China. These accounts, pretending to be Americans and Indians, were spreading false information on divisive topics.\n\nWhat about the Indian elected representatives, including ministers spreading false information nationally, internationally, and officially?",
        "Dude either  you are infected with disease called 'WHATABOUTISM' or u r the same guy who opened these 4700 account !",
        "Well , one party thrives on apesement of minority and another on apesement of majority it's obvious bjp is going to win",
        "Probably on twitter",
        "Who cares the enemies if your own countrymen and leaders are sabotaging the democracy  and backstabbing their own citizens in their own country?",
        "Probably Republicans and our you know who party.",
        "\"Meta also shut down two other smaller networks—another Chinese-originated network of 13 fake accounts and seven groups that were targeting India and Tibet by posing as journalists and activists, and a Russian network of six Facebook accounts, one page and three Instagram accounts targeting English-speaking audiences around the world.\"\n\nfrom forbes. seems the main focus was us",
        "Are muslims not the citizens? Why they call it apeasement? They should also be represented, whats the problem?!",
        "Honestly the best protection against this would be turn the conversation into native languages. I really want to see Chinese spies speak in Kannada",
        "True story. I am also one of those Chinese planted  propaganda accounts.",
        "yeah they are citizens and they should be represented. But the OP is saying that bjp does things to please the majority and congress does things to please the minority so its clear that bjp would win. He/She is not saying anything against any community, just commenting on the general strategy of these two parties.",
        "I’m always saddened by the fact that people take social media and random opinions seriously. Social media was supposed to be for entertainment and lame jokes and it has now become a tool for propaganda. 😔",
        "Itna jaldi reveal nahi karna tha.",
        "It's a bot account no matter the topic ! I will only push my agenda. Smh.",
        "And how exactly does Congress appease the minority?       \nAnd if that worked so well, why did the lose the election in Punjab? Last I checked, OBCs and SCs are the majority, which is why BJP is scared shitless of a caste census like in Bihar, because they might end up demanding proportional representation in the legislature and government institutions. AAP is BJP-lite when it comes to protecting minorities, Delhi's students, working class and both Muslims and Sikhs have learnt that over and over, even Christmas dinners at Delhi's churches were not spared by Bajrang Dal.         \nPeople are welcome to shoot themselves in their foot, I mean Yogi won in UP again after his covid handling - but that doesn't mean that Congress appeases the minority - they haven't even been in power for 10 years now.",
        "Literally a Chinese copy of a russian product lol",
        "The BJP also caters to a minority, it's just the rich.",
        "Yes u r right it's universal truth every govts caters to wealthy and elites.",
        "Meh. They will AI their way out of it.",
        "This one in particular is selling India out to them",
        ">Social media was supposed to be for entertainment and lame jokes\n\nThat's a weird statement to make\nDoes legacy media not have entertainment and lame jokes (or 24x7 propoganda for that matter)\n\nAll media is used for entertainment, information and for propoganda.",
        "How did Godi media arrive at this headline? Any US publication (US where Meta/Facebook has headquarters in) saying the same thing?\n\n> [BBC: Meta takes down China-based network of thousands of fake accounts, 30-Nov-2023](https://www.bbc.com/news/technology-67560513)\n\n> Meta said the large Chinese network was stopped before it took off among real users.\n\n> Ben Nimmo, who leads investigations into inauthentic behaviour on the company's platforms, said such networks \"still struggle to build audiences, but they're a warning\".\n\n> \"Foreign threat actors are attempting to reach people across the internet ahead of next year's elections, and we need to remain alert.\"\n\n> The company said it also discovered **two smaller networks, one based in China and focusing on India and Tibet**, and one based in Russia which posted primarily in English about the invasion of Ukraine and promoted Telegram channels.\n\nThey might be a fraction of what Whatsapp University in Godi universe is capable of. The Indian publications should do some research and publish real examples of (1) Which propaganda accounts  (2) What kind of propaganda (3) What is their reach, instead of such sensational headlines favoring Dear Leader.",
        "The term for such Chinese state-sponsored propagandists/trolls is \"Wumaos\".\n\nThere are plenty on Quora as well.",
        "Actual report from Meta can be accessed here: \n\nhttps://transparency.fb[dot]com/metasecurity/threat-reporting\n\n> Nov 2023: Meta’s Adversarial Threat Report, Third Quarter 2023\n\n\n> 1. China: We removed **13 accounts and seven Groups in China that targeted primarily India and the\nTibet region** and, to a lesser extent, the United States. This small network operated fictitious\npersonas on Facebook and X (formerly Twitter) posing as journalists, lawyers and human-rights\nactivists. We found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in the region.\n2. China: We removed **4,789 Facebook accounts in China that targeted the United States and\nposed as Americans across different platforms** to post about US politics and US-China relations.\nWe removed this network before it was able to gain engagement from authentic communities on\nour apps. We found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in the region.",
        "Actual report from Meta can be accessed here: \n\nhttps://transparency [dot] fb [dot] com/metasecurity/threat-reporting\n\n> Nov 2023: Meta’s Adversarial Threat Report, Third Quarter 2023\n\n\n> 1. China: We removed **13 accounts and seven Groups in China that targeted primarily India and the\nTibet region** and, to a lesser extent, the United States. This small network operated fictitious\npersonas on Facebook and X (formerly Twitter) posing as journalists, lawyers and human-rights\nactivists. We found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in the region.\n2. China: We removed **4,789 Facebook accounts in China that targeted the United States and\nposed as Americans across different platforms** to post about US politics and US-China relations.\nWe removed this network before it was able to gain engagement from authentic communities on\nour apps. We found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in the region.",
        "Actual report from Meta can be accessed on Meta website, but can't be linked here due to Reddit policy on Facebook links: \n\n> Nov 2023: Meta’s Adversarial Threat Report, Third Quarter 2023\n\n\n> 1. China: We removed **13 accounts and seven Groups in China that targeted primarily India and the\nTibet region** and, to a lesser extent, the United States. This small network operated fictitious\npersonas on Facebook and X (formerly Twitter) posing as journalists, lawyers and human-rights\nactivists. We found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in the region.\n2. China: We removed **4,789 Facebook accounts in China that targeted the United States and\nposed as Americans across different platforms** to post about US politics and US-China relations.\nWe removed this network before it was able to gain engagement from authentic communities on\nour apps. We found this activity as part of our internal investigation into suspected coordinated\ninauthentic behavior in the region.",
        "> from forbes. seems the main focus was us\n\nFacts aren't relevant when arriving at sensational headline by Godi Media",
        "r /india is the biggest example.",
        "AI is extremely bad at translating into languages without sufficient datasets.",
        "If there is such a weak opposition , nothing can be done about it, the same ruling party will be in power for the next decade",
        "So you're telling all Congress needs to do is appease majority and they win ?",
        "OP who posted this story doesn't want to go  beyond headline i.e. further into analysis of 'misinformation' and 'fake-news' plaguing the Indian society - Whatsapp groups/Facebook pages etc in the name of religion.\n\nThey are limited by their inability to go beyond the headline number '4700', it doesn't matter that 4700 accounts targeted US, and that when it comes to India, it is only some 13 accounts.",
        "The author of this story on FirstPost, Mehul Reuben Das, is so shoddy in his journalism skills, apparently.\n\nHe wrote a FirstPost story, based on a sh** post on Twitter which said Sam Altman got fired due to Microsoft Teams vs Google Meet conflict.\n\nSh** posting account on Twitter: https://twitter.com/shantanugoel/status/1726988269492265023\n\nFirstPost story, removed now: https://www.firstpost.com/tech/google-meet-vs-microsoft-teams-the-bizarre-reason-stopping-sam-altmans-return-to-openai-13406402.html",
        "Congree needs to implement all the welfare schemes they created for the poor. Modi removed ensured implementation. Thats the difference. People need to feel they are being served at the basic level.",
        "Make the mfs speak Tulu.",
        "Same as in US, Republicans cater to the wealthy and play the Cristian card",
        "If it has been shut down then it was against BJP.",
        "There's a lot of propaganda in common with the way Russia was attacking american democracy and how the current government is attacking democracy.",
        "BJP is a wannabe dictator party. If and when they loose election, it would get pretty ugly pretty fast",
        "Modi is China's favored option looking at how Har-shankar publically admitted defeat in Galwan occupation.",
        "Without propaganda by advertisers and governments legacy media would not even thrive.",
        "You're right (I assume you meant News Media specifically)\n\nBut they're not really thriving though, are they?",
        "Technically on cable TV, TV shows are still paid for by consumers accepting to watch commercials in exchange. Now imagine if the commercials are Himalaya/Dabur peddling their pseudoscience products, or Coke/Nestle recommending fast food. If you're watching Kashmir files etc on TV that's funded both by advertisers and government. So it's not just news media",
        "You're right, but I was under the impression that entertainment channels get ads from all sorts of businesses including cars, consumer goods, tech products\nWhereas news channels rely heavily on political ads or pseudoscientific products like you mentioned \n\nI could be wrong, it's been years since I watched Cable TV.",
        "China will support Modi.",
        "There are Youtube vlogs (in Kannada) by Indian medical students in China, also some Kannada speaking business person has a vlog as well.",
        "That part seems incorrect since the PDF of the report says only 13 Accounts were relevant in India.\n\nThe over 4700 one was for US.",
        "Its only a problem, if its Chinese fake accounts. Others are ok. /Sarcasm",
        "That will splinter conversation among Indians as well.",
        "I'm pretty sure there are a lot of propoganda trolls here too! All paid for by various stakeholders."
    ],
    "cleaned_text": "siege huge network chinese fake accounts set disrupt india us polls exposed think side favoured chine ",
    "cleaned_title": "siege huge network chinese fake accounts set disrupt india us polls exposed",
    "cleaned_selftext": "think side favoured chine",
    "cleaned_comments": "dont need anything even congress trying get modi rd term meta report revealed identified took fake chinese accounts set disrupt elections india china accounts pretending americans indians spreading false information divisive topics indian elected representatives including ministers spreading false information nationally internationally officially dude either infected disease called whataboutism u r guy opened account well one party thrives apesement minority another apesement majority obvious bjp going win probably twitter cares enemies countrymen leaders sabotaging democracy backstabbing citizens country probably republicans know party meta also shut two smaller networksanother chineseoriginated network fake accounts seven groups targeting india tibet posing journalists activists russian network six facebook accounts one page three instagram accounts targeting englishspeaking audiences around world forbes seems main focus us muslims citizens call apeasement also represented whats problem honestly best protection would turn conversation native languages really want see chinese spies speak kannada true story also one chinese planted propaganda accounts yeah citizens represented op saying bjp things please majority congress things please minority clear bjp would win heshe saying anything community commenting general strategy two parties im always saddened fact people take social media random opinions seriously social media supposed entertainment lame jokes become tool propaganda itna jaldi reveal nahi karna tha bot account matter topic push agenda smh exactly congress appease minority worked well lose election punjab last checked obcs scs majority bjp scared shitless caste census like bihar might end demanding proportional representation legislature government institutions aap bjplite comes protecting minorities delhis students working class muslims sikhs learnt even christmas dinners delhis churches spared bajrang dal people welcome shoot foot mean yogi covid handling doesnt mean congress appeases minority havent even power years literally chinese copy russian product lol bjp also caters minority rich yes u r right universal truth every govts caters wealthy elites meh ai way one particular selling india social media supposed entertainment lame jokes thats weird statement make legacy media entertainment lame jokes x propoganda matter media used entertainment information propoganda godi media arrive headline us publication us metafacebook headquarters saying thing bbc meta takes chinabased network thousands fake accounts novhttpswwwbbccomnewstechnology meta said large chinese network stopped took among real users ben nimmo leads investigations inauthentic behaviour companys platforms said networks still struggle build audiences theyre warning foreign threat actors attempting reach people across internet ahead next years elections need remain alert company said also discovered two smaller networks one based china focusing india tibet one based russia posted primarily english invasion ukraine promoted telegram channels might fraction whatsapp university godi universe capable indian publications research publish real examples propaganda accounts kind propaganda reach instead sensational headlines favoring dear leader term chinese statesponsored propagandiststrolls wumaos plenty quora well actual report meta accessed nov metas adversarial threat report third quarter china removed accounts seven groups china targeted primarily india tibet region lesser extent united states small network operated fictitious personas facebook x formerly twitter posing journalists lawyers humanrights activists found activity part internal investigation suspected coordinated inauthentic behavior region china removed facebook accounts china targeted united states posed americans across different platforms post us politics uschina relations removed network able gain engagement authentic communities apps found activity part internal investigation suspected coordinated inauthentic behavior region actual report meta accessed dot fb dot commetasecuritythreatreporting nov metas adversarial threat report third quarter china removed accounts seven groups china targeted primarily india tibet region lesser extent united states small network operated fictitious personas facebook x formerly twitter posing journalists lawyers humanrights activists found activity part internal investigation suspected coordinated inauthentic behavior region china removed facebook accounts china targeted united states posed americans across different platforms post us politics uschina relations removed network able gain engagement authentic communities apps found activity part internal investigation suspected coordinated inauthentic behavior region actual report meta accessed meta website cant linked due reddit policy facebook links nov metas adversarial threat report third quarter china removed accounts seven groups china targeted primarily india tibet region lesser extent united states small network operated fictitious personas facebook x formerly twitter posing journalists lawyers humanrights activists found activity part internal investigation suspected coordinated inauthentic behavior region china removed facebook accounts china targeted united states posed americans across different platforms post us politics uschina relations removed network able gain engagement authentic communities apps found activity part internal investigation suspected coordinated inauthentic behavior region forbes seems main focus us facts arent relevant arriving sensational headline godi media r india biggest example ai extremely bad translating languages without sufficient datasets weak opposition nothing done ruling party power next decade youre telling congress needs appease majority win op posted story doesnt want go beyond headline ie analysis misinformation fakenews plaguing indian society whatsapp groupsfacebook pages etc name religion limited inability go beyond headline number doesnt matter accounts targeted us comes india accounts author story firstpost mehul reuben das shoddy journalism skills apparently wrote firstpost story based sh post twitter said sam altman got fired due microsoft teams vs google meet conflict sh posting account twitter firstpost story removed congree needs implement welfare schemes created poor modi removed ensured implementation thats difference people need feel served basic level make mfs speak tulu us republicans cater wealthy play cristian card shut bjp theres lot propaganda common way russia attacking american democracy current government attacking democracy bjp wannabe dictator party loose election would get pretty ugly pretty fast modi chinas favored option looking harshankar publically admitted defeat galwan occupation without propaganda advertisers governments legacy media would even thrive youre right assume meant news media specifically theyre really thriving though technically cable tv tv shows still paid consumers accepting watch commercials exchange imagine commercials himalayadabur peddling pseudoscience products cokenestle recommending fast food youre watching kashmir files etc tv thats funded advertisers government news media youre right impression entertainment channels get ads sorts businesses including cars consumer goods tech products whereas news channels rely heavily political ads pseudoscientific products like mentioned could wrong years since watched cable tv china support modi youtube vlogs kannada indian medical students china also kannada speaking business person vlog well part seems incorrect since pdf report says accounts relevant india one us problem chinese fake accounts others ok sarcasm splinter conversation among indians well im pretty sure lot propoganda trolls paid various stakeholders",
    "light_cleaned_title": "Under siege: Huge network of Chinese fake accounts set up to disrupt India, US 2024 polls exposed",
    "light_cleaned_selftext": "What you all think which side is favoured by chine? and why?",
    "light_cleaned_comments": "They don't need to do anything even the congress trying to get modi 3rd term > Meta, in a report, has revealed that it identified and took down about 4,700 fake Chinese accounts that were set up to disrupt the 2024 elections in India and China. These accounts, pretending to be Americans and Indians, were spreading false information on divisive topics. What about the Indian elected representatives, including ministers spreading false information nationally, internationally, and officially? Dude either you are infected with disease called 'WHATABOUTISM' or u r the same guy who opened these 4700 account ! Well , one party thrives on apesement of minority and another on apesement of majority it's obvious bjp is going to win Probably on twitter Who cares the enemies if your own countrymen and leaders are sabotaging the democracy and backstabbing their own citizens in their own country? Probably Republicans and our you know who party. \"Meta also shut down two other smaller networks—another Chinese-originated network of 13 fake accounts and seven groups that were targeting India and Tibet by posing as journalists and activists, and a Russian network of six Facebook accounts, one page and three Instagram accounts targeting English-speaking audiences around the world.\" from forbes. seems the main focus was us Are muslims not the citizens? Why they call it apeasement? They should also be represented, whats the problem?! Honestly the best protection against this would be turn the conversation into native languages. I really want to see Chinese spies speak in Kannada True story. I am also one of those Chinese planted propaganda accounts. yeah they are citizens and they should be represented. But the OP is saying that bjp does things to please the majority and congress does things to please the minority so its clear that bjp would win. He/She is not saying anything against any community, just commenting on the general strategy of these two parties. I’m always saddened by the fact that people take social media and random opinions seriously. Social media was supposed to be for entertainment and lame jokes and it has now become a tool for propaganda. 😔 Itna jaldi reveal nahi karna tha. It's a bot account no matter the topic ! I will only push my agenda. Smh. And how exactly does Congress appease the minority? And if that worked so well, why did the lose the election in Punjab? Last I checked, OBCs and SCs are the majority, which is why BJP is scared shitless of a caste census like in Bihar, because they might end up demanding proportional representation in the legislature and government institutions. AAP is BJP-lite when it comes to protecting minorities, Delhi's students, working class and both Muslims and Sikhs have learnt that over and over, even Christmas dinners at Delhi's churches were not spared by Bajrang Dal. People are welcome to shoot themselves in their foot, I mean Yogi won in UP again after his covid handling - but that doesn't mean that Congress appeases the minority - they haven't even been in power for 10 years now. Literally a Chinese copy of a russian product lol The BJP also caters to a minority, it's just the rich. Yes u r right it's universal truth every govts caters to wealthy and elites. Meh. They will AI their way out of it. This one in particular is selling India out to them >Social media was supposed to be for entertainment and lame jokes That's a weird statement to make Does legacy media not have entertainment and lame jokes (or 24x7 propoganda for that matter) All media is used for entertainment, information and for propoganda. How did Godi media arrive at this headline? Any US publication (US where Meta/Facebook has headquarters in) saying the same thing? > [BBC: Meta takes down China-based network of thousands of fake accounts, 30-Nov-2023](https://www.bbc.com/news/technology-67560513) > Meta said the large Chinese network was stopped before it took off among real users. > Ben Nimmo, who leads investigations into inauthentic behaviour on the company's platforms, said such networks \"still struggle to build audiences, but they're a warning\". > \"Foreign threat actors are attempting to reach people across the internet ahead of next year's elections, and we need to remain alert.\" > The company said it also discovered **two smaller networks, one based in China and focusing on India and Tibet**, and one based in Russia which posted primarily in English about the invasion of Ukraine and promoted Telegram channels. They might be a fraction of what Whatsapp University in Godi universe is capable of. The Indian publications should do some research and publish real examples of (1) Which propaganda accounts (2) What kind of propaganda (3) What is their reach, instead of such sensational headlines favoring Dear Leader. The term for such Chinese state-sponsored propagandists/trolls is \"Wumaos\". There are plenty on Quora as well. Actual report from Meta can be accessed here: > Nov 2023: Meta’s Adversarial Threat Report, Third Quarter 2023 > 1. China: We removed **13 accounts and seven Groups in China that targeted primarily India and the Tibet region** and, to a lesser extent, the United States. This small network operated fictitious personas on Facebook and X (formerly Twitter) posing as journalists, lawyers and human-rights activists. We found this activity as part of our internal investigation into suspected coordinated inauthentic behavior in the region. 2. China: We removed **4,789 Facebook accounts in China that targeted the United States and posed as Americans across different platforms** to post about US politics and US-China relations. We removed this network before it was able to gain engagement from authentic communities on our apps. We found this activity as part of our internal investigation into suspected coordinated inauthentic behavior in the region. Actual report from Meta can be accessed here: [dot] fb [dot] com/metasecurity/threat-reporting > Nov 2023: Meta’s Adversarial Threat Report, Third Quarter 2023 > 1. China: We removed **13 accounts and seven Groups in China that targeted primarily India and the Tibet region** and, to a lesser extent, the United States. This small network operated fictitious personas on Facebook and X (formerly Twitter) posing as journalists, lawyers and human-rights activists. We found this activity as part of our internal investigation into suspected coordinated inauthentic behavior in the region. 2. China: We removed **4,789 Facebook accounts in China that targeted the United States and posed as Americans across different platforms** to post about US politics and US-China relations. We removed this network before it was able to gain engagement from authentic communities on our apps. We found this activity as part of our internal investigation into suspected coordinated inauthentic behavior in the region. Actual report from Meta can be accessed on Meta website, but can't be linked here due to Reddit policy on Facebook links: > Nov 2023: Meta’s Adversarial Threat Report, Third Quarter 2023 > 1. China: We removed **13 accounts and seven Groups in China that targeted primarily India and the Tibet region** and, to a lesser extent, the United States. This small network operated fictitious personas on Facebook and X (formerly Twitter) posing as journalists, lawyers and human-rights activists. We found this activity as part of our internal investigation into suspected coordinated inauthentic behavior in the region. 2. China: We removed **4,789 Facebook accounts in China that targeted the United States and posed as Americans across different platforms** to post about US politics and US-China relations. We removed this network before it was able to gain engagement from authentic communities on our apps. We found this activity as part of our internal investigation into suspected coordinated inauthentic behavior in the region. > from forbes. seems the main focus was us Facts aren't relevant when arriving at sensational headline by Godi Media r /india is the biggest example. AI is extremely bad at translating into languages without sufficient datasets. If there is such a weak opposition , nothing can be done about it, the same ruling party will be in power for the next decade So you're telling all Congress needs to do is appease majority and they win ? OP who posted this story doesn't want to go beyond headline i.e. further into analysis of 'misinformation' and 'fake-news' plaguing the Indian society - Whatsapp groups/Facebook pages etc in the name of religion. They are limited by their inability to go beyond the headline number '4700', it doesn't matter that 4700 accounts targeted US, and that when it comes to India, it is only some 13 accounts. The author of this story on FirstPost, Mehul Reuben Das, is so shoddy in his journalism skills, apparently. He wrote a FirstPost story, based on a sh** post on Twitter which said Sam Altman got fired due to Microsoft Teams vs Google Meet conflict. Sh** posting account on Twitter: FirstPost story, removed now: Congree needs to implement all the welfare schemes they created for the poor. Modi removed ensured implementation. Thats the difference. People need to feel they are being served at the basic level. Make the mfs speak Tulu. Same as in US, Republicans cater to the wealthy and play the Cristian card If it has been shut down then it was against BJP. There's a lot of propaganda in common with the way Russia was attacking american democracy and how the current government is attacking democracy. BJP is a wannabe dictator party. If and when they loose election, it would get pretty ugly pretty fast Modi is China's favored option looking at how Har-shankar publically admitted defeat in Galwan occupation. Without propaganda by advertisers and governments legacy media would not even thrive. You're right (I assume you meant News Media specifically) But they're not really thriving though, are they? Technically on cable TV, TV shows are still paid for by consumers accepting to watch commercials in exchange. Now imagine if the commercials are Himalaya/Dabur peddling their pseudoscience products, or Coke/Nestle recommending fast food. If you're watching Kashmir files etc on TV that's funded both by advertisers and government. So it's not just news media You're right, but I was under the impression that entertainment channels get ads from all sorts of businesses including cars, consumer goods, tech products Whereas news channels rely heavily on political ads or pseudoscientific products like you mentioned I could be wrong, it's been years since I watched Cable TV. China will support Modi. There are Youtube vlogs (in Kannada) by Indian medical students in China, also some Kannada speaking business person has a vlog as well. That part seems incorrect since the PDF of the report says only 13 Accounts were relevant in India. The over 4700 one was for US. Its only a problem, if its Chinese fake accounts. Others are ok. /Sarcasm That will splinter conversation among Indians as well. I'm pretty sure there are a lot of propoganda trolls here too! All paid for by various stakeholders."
}