{
    "id": "1847t97",
    "title": "Just a year after Modiji's speech on freebie culture, BJB is promising free scooty?",
    "url": "https://www.reddit.com/r/india/comments/1847t97/just_a_year_after_modijis_speech_on_freebie/",
    "selftext": "Anyone wanting reference of what I'm talking - [https://economictimes.indiatimes.com/news/elections/assembly-elections/rajasthan-assembly-elections/bjp-releases-party-manifesto-in-rajasthan/articleshow/105253721.cms](https://economictimes.indiatimes.com/news/elections/assembly-elections/rajasthan-assembly-elections/bjp-releases-party-manifesto-in-rajasthan/articleshow/105253721.cms)  \n\n\n[https://www.news18.com/news/india/stop-free-revdi-culture-heritage-enough-for-ups-growth-what-modi-said-at-bundelkhand-e-way-launch-5565121.html](https://www.news18.com/news/india/stop-free-revdi-culture-heritage-enough-for-ups-growth-what-modi-said-at-bundelkhand-e-way-launch-5565121.html)  \n\n\nHas any media channel questioned Modiji on this?  \n\n\nNo wonder we need so many gods.",
    "flair": "Politics",
    "score": 119,
    "num_comments": 12,
    "created_utc": 1700994246.0,
    "convurl": "https://external-preview.redd.it/vMeMmvN-E0GF2820krQlA90b4WtCyPN-qqvcsAN5QpQ.jpg?auto=webp&s=c3a033bcca88850838a992d94b38b3b4a56da3e7",
    "comments": [
        "Echange offer bhi hai kya? I need to change my scooter. 😂",
        "They don't want a repeat of India shining. Freebie culture is always a race to the bottom.",
        "BJP though people would have grown over freebies. After Karnataka loss they are doing the same.",
        "BJP was also promising free scooties in the Delhi election that they lost, and followed with the freebie/rewdi-culture speech. They're like teflon. They'll say one thing, do the opposite, but nothing sticks.",
        "At least give something ,which can improve their life standards ,like free electricity",
        "Ab public hi aisi hai toh Modi ji karey kya.. /s",
        "Yup they took have folded now. That's the slippery slope with freebies , if you want to stay relevant you too jump in ultimately the minority which pays tax bears the cost. And they will look for a way out. \n\nWe are sliding down the proverbial slippery slope , all aboard!",
        "nonsense, even BJP's manifesto in KA had plenty of \"freebies\"",
        "Modi wants to do india shining but cant"
    ],
    "cleaned_text": "year modijis speech freebie culture bjb promising free scooty anyone wanting reference im talking httpseconomictimesindiatimescomnewselectionsassemblyelectionsrajasthanassemblyelectionsbjpreleasespartymanifestoinrajasthanarticleshowcmshttpseconomictimesindiatimescomnewselectionsassemblyelectionsrajasthanassemblyelectionsbjpreleasespartymanifestoinrajasthanarticleshowcms httpswwwnewscomnewsindiastopfreerevdicultureheritageenoughforupsgrowthwhatmodisaidatbundelkhandewaylaunchhtmlhttpswwwnewscomnewsindiastopfreerevdicultureheritageenoughforupsgrowthwhatmodisaidatbundelkhandewaylaunchhtml media channel questioned modiji wonder need many gods ",
    "cleaned_title": "year modijis speech freebie culture bjb promising free scooty",
    "cleaned_selftext": "anyone wanting reference im talking httpseconomictimesindiatimescomnewselectionsassemblyelectionsrajasthanassemblyelectionsbjpreleasespartymanifestoinrajasthanarticleshowcmshttpseconomictimesindiatimescomnewselectionsassemblyelectionsrajasthanassemblyelectionsbjpreleasespartymanifestoinrajasthanarticleshowcms httpswwwnewscomnewsindiastopfreerevdicultureheritageenoughforupsgrowthwhatmodisaidatbundelkhandewaylaunchhtmlhttpswwwnewscomnewsindiastopfreerevdicultureheritageenoughforupsgrowthwhatmodisaidatbundelkhandewaylaunchhtml media channel questioned modiji wonder need many gods",
    "cleaned_comments": "echange offer bhi hai kya need change scooter dont want repeat india shining freebie culture always race bottom bjp though people would grown freebies karnataka loss bjp also promising free scooties delhi election lost followed freebierewdiculture speech theyre like teflon theyll say one thing opposite nothing sticks least give something improve life standards like free electricity ab public hi aisi hai toh modi ji karey kya yup took folded thats slippery slope freebies want stay relevant jump ultimately minority pays tax bears cost look way sliding proverbial slippery slope aboard nonsense even bjps manifesto ka plenty freebies modi wants india shining cant",
    "light_cleaned_title": "Just a year after Modiji's speech on freebie culture, BJB is promising free scooty?",
    "light_cleaned_selftext": "Anyone wanting reference of what I'm talking - [https://economictimes.indiatimes.com/news/elections/assembly-elections/rajasthan-assembly-elections/bjp-releases-party-manifesto-in-rajasthan/articleshow/105253721.cms](https://economictimes.indiatimes.com/news/elections/assembly-elections/rajasthan-assembly-elections/bjp-releases-party-manifesto-in-rajasthan/articleshow/105253721.cms) [https://www.news18.com/news/india/stop-free-revdi-culture-heritage-enough-for-ups-growth-what-modi-said-at-bundelkhand-e-way-launch-5565121.html](https://www.news18.com/news/india/stop-free-revdi-culture-heritage-enough-for-ups-growth-what-modi-said-at-bundelkhand-e-way-launch-5565121.html) Has any media channel questioned Modiji on this? No wonder we need so many gods.",
    "light_cleaned_comments": "Echange offer bhi hai kya? I need to change my scooter. 😂 They don't want a repeat of India shining. Freebie culture is always a race to the bottom. BJP though people would have grown over freebies. After Karnataka loss they are doing the same. BJP was also promising free scooties in the Delhi election that they lost, and followed with the freebie/rewdi-culture speech. They're like teflon. They'll say one thing, do the opposite, but nothing sticks. At least give something ,which can improve their life standards ,like free electricity Ab public hi aisi hai toh Modi ji karey kya.. /s Yup they took have folded now. That's the slippery slope with freebies , if you want to stay relevant you too jump in ultimately the minority which pays tax bears the cost. And they will look for a way out. We are sliding down the proverbial slippery slope , all aboard! nonsense, even BJP's manifesto in KA had plenty of \"freebies\" Modi wants to do india shining but cant"
}