{
    "id": "15uoljq",
    "title": "Survey Help!",
    "url": "https://www.reddit.com/r/india/comments/15uoljq/survey_help/",
    "selftext": "Hello everyone, im currently working on finding the solution some social problem, which i think might positively or negativly affect our future. But i still want some pointers from the general public to understand their view point , which will boost my confidence and have a clear direction in solving this issue.   \nPlease take a few minutes to help out with this survey  \n\n\nSurvey Link below\n\n[https://forms.gle/bk8sUbiP92eG3Ldr7](https://forms.gle/bk8sUbiP92eG3Ldr7)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1692374631.0,
    "convurl": "https://external-preview.redd.it/HLeplpTx4qop_l7VhV3nhInAP4LXLlHl2jwhfdnkPpU.jpg?auto=webp&s=b676337e91c402acfa9715f2a8474b33583c9a48",
    "comments": [],
    "cleaned_text": "survey help hello everyone im currently working finding solution social problem think might positively negativly affect future still want pointers general public understand view point boost confidence clear direction solving issue please take minutes help survey survey link httpsformsglebksubipegldrhttpsformsglebksubipegldr ",
    "cleaned_title": "survey help",
    "cleaned_selftext": "hello everyone im currently working finding solution social problem think might positively negativly affect future still want pointers general public understand view point boost confidence clear direction solving issue please take minutes help survey survey link httpsformsglebksubipegldrhttpsformsglebksubipegldr",
    "cleaned_comments": "",
    "light_cleaned_title": "Survey Help!",
    "light_cleaned_selftext": "Hello everyone, im currently working on finding the solution some social problem, which i think might positively or negativly affect our future. But i still want some pointers from the general public to understand their view point , which will boost my confidence and have a clear direction in solving this issue. Please take a few minutes to help out with this survey Survey Link below [https://forms.gle/bk8sUbiP92eG3Ldr7](https://forms.gle/bk8sUbiP92eG3Ldr7)",
    "light_cleaned_comments": ""
}