{
    "id": "18rz4he",
    "title": "The dark world of illegal loan apps in India | Cybercrime | Al Jazeera",
    "url": "https://www.aljazeera.com/economy/2023/12/25/the-dark-world-of-illegal-loan-apps-in-india",
    "selftext": "I don't think any govt (except maybe UPA-2) has given so much free reign to illegal debt, gambling and loan apps in India. RBI governors have been frequently changed to accommodate such things, the whims and fancies of our High Leader and his entourage. So many common people are now struggling under high debt and no help from govt or police.\nGovt is promoting usury, gambling, debt, high interests for common people and zero interest for the billionaires. The emphasis on spending billions on freight corridors while acting highly miserly on education, healthcare, even passenger railways are indicative. Seriously is this how Modi is saving Hinduism in India?",
    "flair": "Crime",
    "score": 17,
    "num_comments": 2,
    "created_utc": 1703678359.0,
    "convurl": "https://external-preview.redd.it/FSY61LFtt-M1CfGY6OqiVi5qw6nFJ-9iUmCdHV-LSf8.jpg?auto=webp&s=a9d192a98666adc3e7949a970883b94f493a11b4",
    "comments": [
        "The government is promoting \"Gambling, debt and high interest\".....lmao. Where did you pass from, Whatsapp University? First of all, promoting debt and high interest don't go hand in hand. Secondly, the RBI is responsible for the interest rates and not the government. The rates are high to decrease inflation cus when rates are high people are more likely to put money in FDs and take less loan which decreases the money circulating in the economy. \n\nAnd please explain how the government is promoting Gambling by increasing the taxes on gambling income?"
    ],
    "cleaned_text": "dark world illegal loan apps india cybercrime al jazeera dont think govt except maybe upa given much free reign illegal debt gambling loan apps india rbi governors frequently changed accommodate things whims fancies high leader entourage many common people struggling high debt help govt police govt promoting usury gambling debt high interests common people zero interest billionaires emphasis spending billions freight corridors acting highly miserly education healthcare even passenger railways indicative seriously modi saving hinduism india ",
    "cleaned_title": "dark world illegal loan apps india cybercrime al jazeera",
    "cleaned_selftext": "dont think govt except maybe upa given much free reign illegal debt gambling loan apps india rbi governors frequently changed accommodate things whims fancies high leader entourage many common people struggling high debt help govt police govt promoting usury gambling debt high interests common people zero interest billionaires emphasis spending billions freight corridors acting highly miserly education healthcare even passenger railways indicative seriously modi saving hinduism india",
    "cleaned_comments": "government promoting gambling debt high interestlmao pass whatsapp university first promoting debt high interest dont go hand hand secondly rbi responsible interest rates government rates high decrease inflation cus rates high people likely put money fds take less loan decreases money circulating economy please explain government promoting gambling increasing taxes gambling income",
    "light_cleaned_title": "The dark world of illegal loan apps in India | Cybercrime | Al Jazeera",
    "light_cleaned_selftext": "I don't think any govt (except maybe UPA-2) has given so much free reign to illegal debt, gambling and loan apps in India. RBI governors have been frequently changed to accommodate such things, the whims and fancies of our High Leader and his entourage. So many common people are now struggling under high debt and no help from govt or police. Govt is promoting usury, gambling, debt, high interests for common people and zero interest for the billionaires. The emphasis on spending billions on freight corridors while acting highly miserly on education, healthcare, even passenger railways are indicative. Seriously is this how Modi is saving Hinduism in India?",
    "light_cleaned_comments": "The government is promoting \"Gambling, debt and high interest\".....lmao. Where did you pass from, Whatsapp University? First of all, promoting debt and high interest don't go hand in hand. Secondly, the RBI is responsible for the interest rates and not the government. The rates are high to decrease inflation cus when rates are high people are more likely to put money in FDs and take less loan which decreases the money circulating in the economy. And please explain how the government is promoting Gambling by increasing the taxes on gambling income?"
}