{
    "id": "16gnmsp",
    "title": "Do you support Women Reservation Bill ? Let's Discuss",
    "url": "https://www.reddit.com/r/india/comments/16gnmsp/do_you_support_women_reservation_bill_lets_discuss/",
    "selftext": "The **Women's Reservation Bill** or **The Constitution (108th Amendment) Bill, 9 th March, 2010**, is a bill passed in the [Parliament of India](https://en.wikipedia.org/wiki/Parliament_of_India) which says to amend the [Constitution of India](https://en.wikipedia.org/wiki/Constitution_of_India) to reserve 1/3 of all seats in the lower house of Parliament of India, the [Lok Sabha](https://en.wikipedia.org/wiki/Lok_Sabha), and in all state [legislative assemblies](https://en.wikipedia.org/wiki/Legislative_assemblies) for women. The seats were proposed to be reserved in rotation and would have been determined by draw of lots in such a way that a seat would be reserved only once in three consecutive general elections.\n\nThe [Rajya Sabha](https://en.wikipedia.org/wiki/Rajya_Sabha) passed the bill on 9 March 2010.[\\[1\\]](https://en.wikipedia.org/wiki/Women%27s_Reservation_Bill#cite_note-ra-1) However, the [Lok Sabha](https://en.wikipedia.org/wiki/Lok_Sabha) voted on the bill.[\\[2\\]](https://en.wikipedia.org/wiki/Women%27s_Reservation_Bill#cite_note-2)[\\[3\\]](https://en.wikipedia.org/wiki/Women%27s_Reservation_Bill#cite_note-3) The bill lapsed since it was still completed in Lok Sabha and the Lok Sabha expired during this two times in 2014 and 2019.  \n\n\nThe Indian government is planning to reintroduce this bill in the upcoming Special Parliament Session.\n\nLast time, it failed to pass in the Parliament, because of its opposition from two parties: RJD and SP. Their argument behind opposing the bill was that they were seeking amendments in it, including a reservation within the women’s quota for SC, ST and OBC women.   \nTheir reasoning was that the Backward Community was already underrepresented and if this women reservation bill was passed, even more seats would go to upper castes. **Historically and even under the current Lok Sabha, amongst women MPs, there are more MPs from upper caste than backward classes.**\n\nWhat are your views on this? Do you support Women Reservation? Or do you also want reservations for backward classes demanded by RJD and SP? Or do you not support Women Reservation at all?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694514218.0,
    "convurl": "https://external-preview.redd.it/5mgVZFF4U9EM9fLU0oDvSrdkYNr7poK8NVUnwHsMA2I.jpg?auto=webp&s=7ec9548edf524870ccd4d5b31525c52a3c9a0ece",
    "comments": [
        "Yes",
        "I dont think it will improve the quality of law makers, but I dont think it will reduce the quality either. Also it should be close to 50% It makes sense to add in transgender quote too since we may not get another opportunity to do so again for a long time.\n\nWhat I want to see in reform in electoral systems tbh.",
        "The intention is good but knowing Indian politics I would assume a good chunk of these reserved seats for women would be filled by yesteryear actress or serial actresses who have no idea the problems women face at middle to lower strata of society thus making this bill nothing but another scheme for the privileged by the privileged. E.g. smriti Irani, hema malini, Jaya bachan. I don’t think Indian voter is smart enough to vote for capable politicians and would much rather vote for celebrities/ same religious belief/ same caste. We first need to create better voters before we demand better politicians. Most people who vote are brain dead zombies who just give their vote away without questioning the capabilities or ideology of the politicians.",
        "On paper, yes. \n\nOther reservations should also be applied to this quota. For example there are 84 seats reserved for SCs, of this 28 should be reserved for women.\n\nThe other way of ensuring reservation is the womens quota to be from the 412 general seats. I do not support that since it doesn't force the development of women leaders from marginalized communities. \n\nSince a third gender has been recognized in Indian since several years now, any gender based reservation should also include transgenders. \n\nI do have qualms whether this would change anything. When the Pradhan position of some villages were reserved for women, it became common practice for the wifes of the previous Pradhan's to become titular heads while their husbands actually dealt with everything. Then we also have the example of Rabri Devi. \n\nHowever I am hopeful that if thetre are a whopping ~180 women MPs, at least a few would be independent leaders (as in not influenced by husbands). And given the opportunity some of these might also come out of the shackles of their husbands. \n\nFor the last two paragraphs: Refer to Panchayat lol.",
        "That’s right… it reflects on the voters because seats are contested and at the end of the day if the constituency ends up choosing a celebrity who lives far away over someone who is local and can potentially represent their voice better it’s a collective choice the district has made…\n\nMaybe they think the celebrity would deliver their voice, just like they deliver dialogue on screen…"
    ],
    "cleaned_text": "support women reservation bill lets discuss womens reservation bill constitution th amendment bill th march bill passed parliament indiahttpsenwikipediaorgwikiparliamentofindia says amend constitution indiahttpsenwikipediaorgwikiconstitutionofindia reserve seats lower house parliament india lok sabhahttpsenwikipediaorgwikiloksabha state legislative assemblieshttpsenwikipediaorgwikilegislativeassemblies women seats proposed reserved rotation would determined draw lots way seat would reserved three consecutive general elections rajya sabhahttpsenwikipediaorgwikirajyasabha passed bill march httpsenwikipediaorgwikiwomensreservationbillcitenotera however lok sabhahttpsenwikipediaorgwikiloksabha voted billhttpsenwikipediaorgwikiwomensreservationbillcitenotehttpsenwikipediaorgwikiwomensreservationbillcitenote bill lapsed since still completed lok sabha lok sabha expired two times indian government planning reintroduce bill upcoming special parliament session last time failed pass parliament opposition two parties rjd sp argument behind opposing bill seeking amendments including reservation within womens quota sc st obc women reasoning backward community already underrepresented women reservation bill passed even seats would go upper castes historically even current lok sabha amongst women mps mps upper caste backward classes views support women reservation also want reservations backward classes demanded rjd sp support women reservation ",
    "cleaned_title": "support women reservation bill lets discuss",
    "cleaned_selftext": "womens reservation bill constitution th amendment bill th march bill passed parliament indiahttpsenwikipediaorgwikiparliamentofindia says amend constitution indiahttpsenwikipediaorgwikiconstitutionofindia reserve seats lower house parliament india lok sabhahttpsenwikipediaorgwikiloksabha state legislative assemblieshttpsenwikipediaorgwikilegislativeassemblies women seats proposed reserved rotation would determined draw lots way seat would reserved three consecutive general elections rajya sabhahttpsenwikipediaorgwikirajyasabha passed bill march httpsenwikipediaorgwikiwomensreservationbillcitenotera however lok sabhahttpsenwikipediaorgwikiloksabha voted billhttpsenwikipediaorgwikiwomensreservationbillcitenotehttpsenwikipediaorgwikiwomensreservationbillcitenote bill lapsed since still completed lok sabha lok sabha expired two times indian government planning reintroduce bill upcoming special parliament session last time failed pass parliament opposition two parties rjd sp argument behind opposing bill seeking amendments including reservation within womens quota sc st obc women reasoning backward community already underrepresented women reservation bill passed even seats would go upper castes historically even current lok sabha amongst women mps mps upper caste backward classes views support women reservation also want reservations backward classes demanded rjd sp support women reservation",
    "cleaned_comments": "yes dont think improve quality law makers dont think reduce quality either also close makes sense add transgender quote since may get another opportunity long time want see reform electoral systems tbh intention good knowing indian politics would assume good chunk reserved seats women would filled yesteryear actress serial actresses idea problems women face middle lower strata society thus making bill nothing another scheme privileged privileged eg smriti irani hema malini jaya bachan dont think indian voter smart enough vote capable politicians would much rather vote celebrities religious belief caste first need create better voters demand better politicians people vote brain dead zombies give vote away without questioning capabilities ideology politicians paper yes reservations also applied quota example seats reserved scs reserved women way ensuring reservation womens quota general seats support since doesnt force development women leaders marginalized communities since third gender recognized indian since several years gender based reservation also include transgenders qualms whether would change anything pradhan position villages reserved women became common practice wifes previous pradhans become titular heads husbands actually dealt everything also example rabri devi however hopeful thetre whopping women mps least would independent leaders influenced husbands given opportunity might also come shackles husbands last two paragraphs refer panchayat lol thats right reflects voters seats contested end day constituency ends choosing celebrity lives far away someone local potentially represent voice better collective choice district made maybe think celebrity would deliver voice like deliver dialogue screen",
    "light_cleaned_title": "Do you support Women Reservation Bill ? Let's Discuss",
    "light_cleaned_selftext": "The **Women's Reservation Bill** or **The Constitution (108th Amendment) Bill, 9 th March, 2010**, is a bill passed in the [Parliament of India](https://en.wikipedia.org/wiki/Parliament_of_India) which says to amend the [Constitution of India](https://en.wikipedia.org/wiki/Constitution_of_India) to reserve 1/3 of all seats in the lower house of Parliament of India, the [Lok Sabha](https://en.wikipedia.org/wiki/Lok_Sabha), and in all state [legislative assemblies](https://en.wikipedia.org/wiki/Legislative_assemblies) for women. The seats were proposed to be reserved in rotation and would have been determined by draw of lots in such a way that a seat would be reserved only once in three consecutive general elections. The [Rajya Sabha](https://en.wikipedia.org/wiki/Rajya_Sabha) passed the bill on 9 March 2010.[\\[1\\]](https://en.wikipedia.org/wiki/Women%27s_Reservation_Bill#cite_note-ra-1) However, the [Lok Sabha](https://en.wikipedia.org/wiki/Lok_Sabha) voted on the bill.[\\[2\\]](https://en.wikipedia.org/wiki/Women%27s_Reservation_Bill#cite_note-2)[\\[3\\]](https://en.wikipedia.org/wiki/Women%27s_Reservation_Bill#cite_note-3) The bill lapsed since it was still completed in Lok Sabha and the Lok Sabha expired during this two times in 2014 and 2019. The Indian government is planning to reintroduce this bill in the upcoming Special Parliament Session. Last time, it failed to pass in the Parliament, because of its opposition from two parties: RJD and SP. Their argument behind opposing the bill was that they were seeking amendments in it, including a reservation within the women’s quota for SC, ST and OBC women. Their reasoning was that the Backward Community was already underrepresented and if this women reservation bill was passed, even more seats would go to upper castes. **Historically and even under the current Lok Sabha, amongst women MPs, there are more MPs from upper caste than backward classes.** What are your views on this? Do you support Women Reservation? Or do you also want reservations for backward classes demanded by RJD and SP? Or do you not support Women Reservation at all?",
    "light_cleaned_comments": "Yes I dont think it will improve the quality of law makers, but I dont think it will reduce the quality either. Also it should be close to 50% It makes sense to add in transgender quote too since we may not get another opportunity to do so again for a long time. What I want to see in reform in electoral systems tbh. The intention is good but knowing Indian politics I would assume a good chunk of these reserved seats for women would be filled by yesteryear actress or serial actresses who have no idea the problems women face at middle to lower strata of society thus making this bill nothing but another scheme for the privileged by the privileged. E.g. smriti Irani, hema malini, Jaya bachan. I don’t think Indian voter is smart enough to vote for capable politicians and would much rather vote for celebrities/ same religious belief/ same caste. We first need to create better voters before we demand better politicians. Most people who vote are brain dead zombies who just give their vote away without questioning the capabilities or ideology of the politicians. On paper, yes. Other reservations should also be applied to this quota. For example there are 84 seats reserved for SCs, of this 28 should be reserved for women. The other way of ensuring reservation is the womens quota to be from the 412 general seats. I do not support that since it doesn't force the development of women leaders from marginalized communities. Since a third gender has been recognized in Indian since several years now, any gender based reservation should also include transgenders. I do have qualms whether this would change anything. When the Pradhan position of some villages were reserved for women, it became common practice for the wifes of the previous Pradhan's to become titular heads while their husbands actually dealt with everything. Then we also have the example of Rabri Devi. However I am hopeful that if thetre are a whopping ~180 women MPs, at least a few would be independent leaders (as in not influenced by husbands). And given the opportunity some of these might also come out of the shackles of their husbands. For the last two paragraphs: Refer to Panchayat lol. That’s right… it reflects on the voters because seats are contested and at the end of the day if the constituency ends up choosing a celebrity who lives far away over someone who is local and can potentially represent their voice better it’s a collective choice the district has made… Maybe they think the celebrity would deliver their voice, just like they deliver dialogue on screen…"
}