{
    "id": "13x5g3d",
    "title": "16 parties confirm participation for the June 12 Opposition meet",
    "url": "https://www.thehindu.com/news/national/16-parties-confirm-participation-for-the-june-12-opposition-meet/article66916899.ece",
    "selftext": "Non paywall: https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2F16-parties-confirm-participation-for-the-june-12-opposition-meet%2Farticle66916899.ece",
    "flair": "Politics",
    "score": 54,
    "num_comments": 6,
    "created_utc": 1685585512.0,
    "convurl": "https://external-preview.redd.it/nckS5pueL1loIcsIvt_Kesy2Z8M6OPbR9SssqsRdd3U.jpg?auto=webp&v=enabled&s=a48b883fbdaf8f60abfb9bf135edf0d00f534eb5",
    "comments": [
        ">In the very first Opposition meeting, to discuss electoral strategy for the 2024 Lok Sabha election against the BJP, 16 parties have confirmed their presence. Though according to sources, both Congress president Mallikarjun Kharge and former president Rahul Gandhi might skip the meeting hosted by Janata Dal (United) leader and Bihar Chief Minister Nitish Kumar on June 12, citing “scheduling” problems. \n\n>The Congress wanted the meeting to be postponed for June 23. But it was felt that it is difficult to arrive at a date that will be suitable for everyone so the meeting should continue as per the finalised schedule. \n\n>The Congress has assured that it will depute one of its leaders to attend the meeting. “If the Congress wants to show that it cares about Opposition unity, it must depute one of the Chief Ministers to attend in the absence of Mr. Kharge and Mr. Gandhi,” a senior Opposition leader quipped. \n\n>While the Congress bigwigs might be absent, West Bengal Chief Minister Mamata Banerjee and her nephew Abhishek Banerjee, Delhi Chief Minister Arvind Kejriwal, former Maharashtra Chief Minister Uddhav Thackeray and Nationalist Congress Party (NCP) patriarch Sharad Pawar, among others have confirmed their presence. While this is just a preliminary meeting, the Opposition is aiming to arrive at an agreement for fielding one common candidate against BJP on every Lok Sabha seat. ",
        "Even if the opposition is not able to secure power at the center , but becomes a credible opposition by significantly increasing it's number of seats , its a win for Indian democracy..",
        "If the opposition is able to unite and share seats to make sure secular votes don't get divided, they will definitely win. What I am more interested in is if they come to power, what are they going to do to strengthen the democratic institutions, because if they have no such plans, then it's obvious that they plan to use the institutions weakened by Modi to their own advantage.\n\nWhich idiotic laws enacted by Modi are they planning to rollback? Or is it that they don't have enough courage and conviction to do what is right? Will they investigate the corrupt practices in the last 10 years and punish the ones responsible, or do they themselves plan to indulge in similar corrupt practices and hope the next government will ignore everything similarly.\n\nSome specific questions, will they abolish electoral bonds? What do they plan to do to strengthen federalism and give more autonomy to the states? Will they investigate demonetization which is often referred to as the biggest loot in independent India? Will they relax income tax slabs and cut tax on fuel? Do they plan to fix GST? Will democracy be restored in J&K?",
        "The least they should aim for is to ensure bjp doesn't gets majority on its own and that nda + pseudo opposition loses the majority in rajya sabha",
        ">Will they investigate the corrupt practices in the last 10 years and punish the ones responsible\n\nAtleast AM Singhvi said in raipur session that they'll for a commission to investigate all misuse of central agencies when in power. But yes they need to be clear on the specific laws you mentioned in the last para"
    ],
    "cleaned_text": "parties confirm participation june opposition meet non paywall ",
    "cleaned_title": "parties confirm participation june opposition meet",
    "cleaned_selftext": "non paywall",
    "cleaned_comments": "first opposition meeting discuss electoral strategy lok sabha election bjp parties confirmed presence though according sources congress president mallikarjun kharge former president rahul gandhi might skip meeting hosted janata dal united leader bihar chief minister nitish kumar june citing scheduling problems congress wanted meeting postponed june felt difficult arrive date suitable everyone meeting continue per finalised schedule congress assured depute one leaders attend meeting congress wants show cares opposition unity must depute one chief ministers attend absence mr kharge mr gandhi senior opposition leader quipped congress bigwigs might absent west bengal chief minister mamata banerjee nephew abhishek banerjee delhi chief minister arvind kejriwal former maharashtra chief minister uddhav thackeray nationalist congress party ncp patriarch sharad pawar among others confirmed presence preliminary meeting opposition aiming arrive agreement fielding one common candidate bjp every lok sabha seat even opposition able secure power center becomes credible opposition significantly increasing number seats win indian democracy opposition able unite share seats make sure secular votes dont get divided definitely win interested come power going strengthen democratic institutions plans obvious plan use institutions weakened modi advantage idiotic laws enacted modi planning rollback dont enough courage conviction right investigate corrupt practices last years punish ones responsible plan indulge similar corrupt practices hope next government ignore everything similarly specific questions abolish electoral bonds plan strengthen federalism give autonomy states investigate demonetization often referred biggest loot independent india relax income tax slabs cut tax fuel plan fix gst democracy restored jk least aim ensure bjp doesnt gets majority nda pseudo opposition loses majority rajya sabha investigate corrupt practices last years punish ones responsible atleast singhvi said raipur session theyll commission investigate misuse central agencies power yes need clear specific laws mentioned last para",
    "light_cleaned_title": "16 parties confirm participation for the June 12 Opposition meet",
    "light_cleaned_selftext": "Non paywall:",
    "light_cleaned_comments": ">In the very first Opposition meeting, to discuss electoral strategy for the 2024 Lok Sabha election against the BJP, 16 parties have confirmed their presence. Though according to sources, both Congress president Mallikarjun Kharge and former president Rahul Gandhi might skip the meeting hosted by Janata Dal (United) leader and Bihar Chief Minister Nitish Kumar on June 12, citing “scheduling” problems. >The Congress wanted the meeting to be postponed for June 23. But it was felt that it is difficult to arrive at a date that will be suitable for everyone so the meeting should continue as per the finalised schedule. >The Congress has assured that it will depute one of its leaders to attend the meeting. “If the Congress wants to show that it cares about Opposition unity, it must depute one of the Chief Ministers to attend in the absence of Mr. Kharge and Mr. Gandhi,” a senior Opposition leader quipped. >While the Congress bigwigs might be absent, West Bengal Chief Minister Mamata Banerjee and her nephew Abhishek Banerjee, Delhi Chief Minister Arvind Kejriwal, former Maharashtra Chief Minister Uddhav Thackeray and Nationalist Congress Party (NCP) patriarch Sharad Pawar, among others have confirmed their presence. While this is just a preliminary meeting, the Opposition is aiming to arrive at an agreement for fielding one common candidate against BJP on every Lok Sabha seat. Even if the opposition is not able to secure power at the center , but becomes a credible opposition by significantly increasing it's number of seats , its a win for Indian democracy.. If the opposition is able to unite and share seats to make sure secular votes don't get divided, they will definitely win. What I am more interested in is if they come to power, what are they going to do to strengthen the democratic institutions, because if they have no such plans, then it's obvious that they plan to use the institutions weakened by Modi to their own advantage. Which idiotic laws enacted by Modi are they planning to rollback? Or is it that they don't have enough courage and conviction to do what is right? Will they investigate the corrupt practices in the last 10 years and punish the ones responsible, or do they themselves plan to indulge in similar corrupt practices and hope the next government will ignore everything similarly. Some specific questions, will they abolish electoral bonds? What do they plan to do to strengthen federalism and give more autonomy to the states? Will they investigate demonetization which is often referred to as the biggest loot in independent India? Will they relax income tax slabs and cut tax on fuel? Do they plan to fix GST? Will democracy be restored in J&K? The least they should aim for is to ensure bjp doesn't gets majority on its own and that nda + pseudo opposition loses the majority in rajya sabha >Will they investigate the corrupt practices in the last 10 years and punish the ones responsible Atleast AM Singhvi said in raipur session that they'll for a commission to investigate all misuse of central agencies when in power. But yes they need to be clear on the specific laws you mentioned in the last para"
}