{
    "id": "14lfjkc",
    "title": "AAP’s uncertain foray into anti-BJP bloc",
    "url": "https://www.thehindu.com/news/national/aaps-uncertain-foray-into-anti-bjp-bloc/article67019945.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Faaps-uncertain-foray-into-anti-bjp-bloc%2Farticle67019945.ece",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1687973158.0,
    "convurl": "https://external-preview.redd.it/emW7jyZ113cGWgLJfYmbTnQ_H4KTNvq7AmkI2iXlEqE.jpg?auto=webp&v=enabled&s=5895028855086ef9c586ae887e277baf1698ec3a",
    "comments": [
        ">During the four-hour-long meeting. Mr. Kejriwal traversed from one end to the other. In his speech, according to the sources, he passionately argued that the Opposition parties should keep their own interests aside, concede a seat or two if required, and cherish the other’s victory as their own.\n\n>Ultimatum\n\n>He later slithered down from this high ground, engaging in a bitter exchange with the Congress, asking them to give a public assurance on supporting the AAP’s campaign against the ordinance promulgated by the Centre, which effectively reversed the Supreme Court’s May 11 judgement that granted the Delhi State government control over the bureaucracy. “It has to be done now, he dictated,” one of the leaders who attended the meeting said.\n\n\n\n>Vanished after meet\n\n\n>After the meeting, Mr. Kejriwal sat down for lunch but he was nowhere to be seen when it was time for the press conference. After hunting for him, harried Opposition leaders called the protocol officer who was assigned to assist him, sources said. “The protocol officer told us that he had gone to the bathroom and has not been seen since then,” one of the attendees told The Hindu. Addressing the press conference later, Bihar Chief Minister Nitish Kumar tried to cover for the absence of his counterpart from Delhi, saying that he had had a flight and had to leave. \n\n>But this cover was blown with the AAP’s statement that, in the future, it would be “difficult” to be part of Opposition meetings with the Congress, until the Congress agreed to oppose the ordinance. \n\n>In an interview to The Hindu four days after the Opposition meeting, AAP’s general secretary for organisation Sandeep Pathak claimed that the AAP’s presence in the meeting had only been to muster support against the ordinance, and that they intended to contest the general election alone. His comments, however, fly in the face of the Bihar CM’s assertion after the meeting that the 15 Opposition parties had agreed to fight the BJP together."
    ],
    "cleaned_text": "aaps uncertain foray antibjp bloc  ",
    "cleaned_title": "aaps uncertain foray antibjp bloc",
    "cleaned_selftext": "",
    "cleaned_comments": "fourhourlong meeting mr kejriwal traversed one end speech according sources passionately argued opposition parties keep interests aside concede seat two required cherish others victory ultimatum later slithered high ground engaging bitter exchange congress asking give public assurance supporting aaps campaign ordinance promulgated centre effectively reversed supreme courts may judgement granted delhi state government control bureaucracy done dictated one leaders attended meeting said vanished meet meeting mr kejriwal sat lunch nowhere seen time press conference hunting harried opposition leaders called protocol officer assigned assist sources said protocol officer told us gone bathroom seen since one attendees told hindu addressing press conference later bihar chief minister nitish kumar tried cover absence counterpart delhi saying flight leave cover blown aaps statement future would difficult part opposition meetings congress congress agreed oppose ordinance interview hindu four days opposition meeting aaps general secretary organisation sandeep pathak claimed aaps presence meeting muster support ordinance intended contest general election alone comments however fly face bihar cms assertion meeting opposition parties agreed fight bjp together",
    "light_cleaned_title": "AAP’s uncertain foray into anti-BJP bloc",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">During the four-hour-long meeting. Mr. Kejriwal traversed from one end to the other. In his speech, according to the sources, he passionately argued that the Opposition parties should keep their own interests aside, concede a seat or two if required, and cherish the other’s victory as their own. >Ultimatum >He later slithered down from this high ground, engaging in a bitter exchange with the Congress, asking them to give a public assurance on supporting the AAP’s campaign against the ordinance promulgated by the Centre, which effectively reversed the Supreme Court’s May 11 judgement that granted the Delhi State government control over the bureaucracy. “It has to be done now, he dictated,” one of the leaders who attended the meeting said. >Vanished after meet >After the meeting, Mr. Kejriwal sat down for lunch but he was nowhere to be seen when it was time for the press conference. After hunting for him, harried Opposition leaders called the protocol officer who was assigned to assist him, sources said. “The protocol officer told us that he had gone to the bathroom and has not been seen since then,” one of the attendees told The Hindu. Addressing the press conference later, Bihar Chief Minister Nitish Kumar tried to cover for the absence of his counterpart from Delhi, saying that he had had a flight and had to leave. >But this cover was blown with the AAP’s statement that, in the future, it would be “difficult” to be part of Opposition meetings with the Congress, until the Congress agreed to oppose the ordinance. >In an interview to The Hindu four days after the Opposition meeting, AAP’s general secretary for organisation Sandeep Pathak claimed that the AAP’s presence in the meeting had only been to muster support against the ordinance, and that they intended to contest the general election alone. His comments, however, fly in the face of the Bihar CM’s assertion after the meeting that the 15 Opposition parties had agreed to fight the BJP together."
}