{
    "id": "16bt304",
    "title": "India vs Bharat Debate: Everything You Need To Know | TimelineDaily",
    "url": "https://timelinedaily.com/india/india-vs-bharat-debate-everything-you-need-to-know",
    "selftext": "This article throws some insights to what went through in a constitution drafting meeting on the name Bharat and India. \n\nWhat caught my interest is how the meeting was conducted, registering differing views, and finally going for a naming strategy that fits so well to the state of our country back then and to my knowledge and conviction, to this day and the future as well. We, as citizens has always used these two words interchangeably without feeling any conflict at all. This should have been a non-issue.\n\nI think the ruling party has opened a Pandoras box by allowing this \"rumor\" to take up media space. In my opinion, it was politically detrimental to the ruling party. Fact that the PM, who keeps shut on other burning issues, came out to kill the rumor, clearly shows it.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694027687.0,
    "convurl": "https://external-preview.redd.it/5L9y3uv401eFU1k319KA_xONAZHKsxw9sL0wJbN5Wn0.jpg?auto=webp&s=a8a3a18a5623aee25b0f76e79c501c702c0794a0",
    "comments": [],
    "cleaned_text": "india vs bharat debate everything need know timelinedaily article throws insights went constitution drafting meeting name bharat india caught interest meeting conducted registering differing views finally going naming strategy fits well state country back knowledge conviction day future well citizens always used two words interchangeably without feeling conflict nonissue think ruling party opened pandoras box allowing rumor take media space opinion politically detrimental ruling party fact pm keeps shut burning issues came kill rumor clearly shows ",
    "cleaned_title": "india vs bharat debate everything need know timelinedaily",
    "cleaned_selftext": "article throws insights went constitution drafting meeting name bharat india caught interest meeting conducted registering differing views finally going naming strategy fits well state country back knowledge conviction day future well citizens always used two words interchangeably without feeling conflict nonissue think ruling party opened pandoras box allowing rumor take media space opinion politically detrimental ruling party fact pm keeps shut burning issues came kill rumor clearly shows",
    "cleaned_comments": "",
    "light_cleaned_title": "India vs Bharat Debate: Everything You Need To Know | TimelineDaily",
    "light_cleaned_selftext": "This article throws some insights to what went through in a constitution drafting meeting on the name Bharat and India. What caught my interest is how the meeting was conducted, registering differing views, and finally going for a naming strategy that fits so well to the state of our country back then and to my knowledge and conviction, to this day and the future as well. We, as citizens has always used these two words interchangeably without feeling any conflict at all. This should have been a non-issue. I think the ruling party has opened a Pandoras box by allowing this \"rumor\" to take up media space. In my opinion, it was politically detrimental to the ruling party. Fact that the PM, who keeps shut on other burning issues, came out to kill the rumor, clearly shows it.",
    "light_cleaned_comments": ""
}