{
    "id": "172qe6g",
    "title": "CROCS selling poor quality products for premium price",
    "url": "https://www.reddit.com/gallery/172qe6g",
    "selftext": "I recently bought a pair of CROCS from their retail outlet. It seems they have zero quality checks before they put their products into the stores. The glue is clearly visible along the joints and the footwear has minor damage marks. All this after you pay exorbitant price for the footwear. I know, I should have checked the product before buying, but I think damaged products should not pass quality checks in first place. I could only inspect the product after I reached home and unpacked the footwear to admire its novelty for the last time before I put it on for use. It is only then I observed the sh*t of quality these footwear are. I immediately did reach out to the customer care of CROCS with my concerns and even heard back from them, where they asked me if I have used the footwear and to share the pictures of the footwear. I did as was asked but there is radio silence from their end since. Little do I believe that they'll do anything about it, so this is just a rant before I undo the tags on the footwear, blame capitalism for my stupidity and start using the flawed product that I bought for mere social validation.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696740292.0,
    "convurl": "https://i.redd.it/y58if8c0swsb1.png",
    "comments": [
        "CROCS is simply overrated and overpriced. \n\nI have a similar unbranded footwear which I bought for Rs.150 which lasted about 6 months, which was more than i asked for.",
        "The crocs that you get now are trashy.\nI had purchased a pair about 10 years ago, which I'm still using till today.\n\nGranted, I do.t use it everyday, but when you compare 6 months to 10 years, it's a hell of a difference.",
        "Look like a defective piece, did you buy it from crocs directly Or through third party seller like through Ecommerce website?",
        "Crocs like footwear from sketchers seems good. I have a pair and so far its good. I owned older crocs. Newer ones don't feel to be of good quality.",
        "I live in dubai, even when you buy 1200 aed worth nikes you get issues like this. I thought that because we are buying expensive premium product there will be quality upto satisfaction but realized it's quality assured for use not visuals.\n\nSo my nikes got some stitch issues and gum visible on thin line but these are visual issues and considered cosmetic damage.",
        "I bought the pairs from a CROCS outlet in Thane and I am in another city right now. I did contact the customer care, but no reply.",
        "If you brought it from an offline store, it's easier to check the defects, you gotta pay attention, also the glue part is pretty common in shoes, seen them on 8k nike shoes which are about to hit 10 yeass \n\n, try your best to get it replaced before the replacement window is finished",
        "They would be imported seconds.. which are imported and sold here I feel.\n\nJust like how we get $ tagged clothing for 200-300 in India.",
        "Precisely, I went to a Paragon exclusive store and they had footwear that resembled crocs selling for rs 300, bought them, they are super comfortable, so much that I stopped wearing my crocs all together and switched to these.. 8 months and still going strong. Never going to buy those overpriced clogs again !",
        "Crocs are ugly"
    ],
    "cleaned_text": "crocs selling poor quality products premium price recently bought pair crocs retail outlet seems zero quality checks put products stores glue clearly visible along joints footwear minor damage marks pay exorbitant price footwear know checked product buying think damaged products pass quality checks first place could inspect product reached home unpacked footwear admire novelty last time put use observed sht quality footwear immediately reach customer care crocs concerns even heard back asked used footwear share pictures footwear asked radio silence end since little believe theyll anything rant undo tags footwear blame capitalism stupidity start using flawed product bought mere social validation ",
    "cleaned_title": "crocs selling poor quality products premium price",
    "cleaned_selftext": "recently bought pair crocs retail outlet seems zero quality checks put products stores glue clearly visible along joints footwear minor damage marks pay exorbitant price footwear know checked product buying think damaged products pass quality checks first place could inspect product reached home unpacked footwear admire novelty last time put use observed sht quality footwear immediately reach customer care crocs concerns even heard back asked used footwear share pictures footwear asked radio silence end since little believe theyll anything rant undo tags footwear blame capitalism stupidity start using flawed product bought mere social validation",
    "cleaned_comments": "crocs simply overrated overpriced similar unbranded footwear bought rs lasted months asked crocs get trashy purchased pair years ago im still using till today granted dot use everyday compare months years hell difference look like defective piece buy crocs directly third party seller like ecommerce website crocs like footwear sketchers seems good pair far good owned older crocs newer ones dont feel good quality live dubai even buy aed worth nikes get issues like thought buying expensive premium product quality upto satisfaction realized quality assured use visuals nikes got stitch issues gum visible thin line visual issues considered cosmetic damage bought pairs crocs outlet thane another city right contact customer care reply brought offline store easier check defects got ta pay attention also glue part pretty common shoes seen k nike shoes hit yeass try best get replaced replacement window finished would imported seconds imported sold feel like get tagged clothing india precisely went paragon exclusive store footwear resembled crocs selling rs bought super comfortable much stopped wearing crocs together switched months still going strong never going buy overpriced clogs crocs ugly",
    "light_cleaned_title": "CROCS selling poor quality products for premium price",
    "light_cleaned_selftext": "I recently bought a pair of CROCS from their retail outlet. It seems they have zero quality checks before they put their products into the stores. The glue is clearly visible along the joints and the footwear has minor damage marks. All this after you pay exorbitant price for the footwear. I know, I should have checked the product before buying, but I think damaged products should not pass quality checks in first place. I could only inspect the product after I reached home and unpacked the footwear to admire its novelty for the last time before I put it on for use. It is only then I observed the sh*t of quality these footwear are. I immediately did reach out to the customer care of CROCS with my concerns and even heard back from them, where they asked me if I have used the footwear and to share the pictures of the footwear. I did as was asked but there is radio silence from their end since. Little do I believe that they'll do anything about it, so this is just a rant before I undo the tags on the footwear, blame capitalism for my stupidity and start using the flawed product that I bought for mere social validation.",
    "light_cleaned_comments": "CROCS is simply overrated and overpriced. I have a similar unbranded footwear which I bought for Rs.150 which lasted about 6 months, which was more than i asked for. The crocs that you get now are trashy. I had purchased a pair about 10 years ago, which I'm still using till today. Granted, I do.t use it everyday, but when you compare 6 months to 10 years, it's a hell of a difference. Look like a defective piece, did you buy it from crocs directly Or through third party seller like through Ecommerce website? Crocs like footwear from sketchers seems good. I have a pair and so far its good. I owned older crocs. Newer ones don't feel to be of good quality. I live in dubai, even when you buy 1200 aed worth nikes you get issues like this. I thought that because we are buying expensive premium product there will be quality upto satisfaction but realized it's quality assured for use not visuals. So my nikes got some stitch issues and gum visible on thin line but these are visual issues and considered cosmetic damage. I bought the pairs from a CROCS outlet in Thane and I am in another city right now. I did contact the customer care, but no reply. If you brought it from an offline store, it's easier to check the defects, you gotta pay attention, also the glue part is pretty common in shoes, seen them on 8k nike shoes which are about to hit 10 yeass , try your best to get it replaced before the replacement window is finished They would be imported seconds.. which are imported and sold here I feel. Just like how we get $ tagged clothing for 200-300 in India. Precisely, I went to a Paragon exclusive store and they had footwear that resembled crocs selling for rs 300, bought them, they are super comfortable, so much that I stopped wearing my crocs all together and switched to these.. 8 months and still going strong. Never going to buy those overpriced clogs again ! Crocs are ugly"
}