{
    "id": "1536j23",
    "title": "Is Vande Bharat just stunt to show we are progressing?",
    "url": "https://i.redd.it/cj4inty3qrcb1.jpg",
    "selftext": "The Vande Bharat (Gen 1 -- till date) a.k.a Train 18 is just a publicity stunt they say it capable of running at 160 kmph but it run only specific kmph per section. What I think we should have different track for such trains. Already there are only 2 train that run along. This train seems to be myth with increase fare already we don't have such facilities to run train faster neither Ambitious project like Mumbai-Ahemdabad Bullet Train completed. Why government keep pushing such more train and what will happen to Duranto, Shatabdi, Rajdhani if sleeper Vande Bharat are introduced",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689705545.0,
    "convurl": "https://i.redd.it/cj4inty3qrcb1.jpg",
    "comments": [
        "Such a bad take. Yes the average speed isn't 160, it still came out to be > 110 on the Delhi Kanpur - Prayagraj stretch. \n\n There is absolute need to decentralize the population choking the 6 major cities, having fast connectivity to cities where people can live and work in a different city is the way the clog gets removed, and other cities get better. You can't improve a city till connectivity gets better, companies are willing to settle there. Just look at the load intercity trains pull on everyday in India!! \n\nFares reduce when you have enough of them running on the route and infrastructure gets better. Flights used to cost a fair chunk of your salary, still does in some part, but as the demand increases the operation costs gradually start decreasing.",
        "VBE are EMUs i.e they don't have a locomotive as such they are easier on the tracks, as a 100 ton locomotive isn't crushing them daily. This isn't a new tech btw, all metro systems are EMUs only but it's the first time they were designed completely inhouse by Indian railways. \n\nAnother feature of EMUs is faster pickup of speed as such they should be in have faster run time than a locomotive train set of similar size.  \n\nSo yeah there is a technological advancent, don't dismiss it as having been done before but the tech knowdlege is spreding across Indian railways locomotive divisons as manufactring picks up with increased local supply chain. You think China went to world biggest makers of locomotives without such iterative process of improvement ? \n\nAs for tracks this a common problem in India, Rajdhaani express trainsets are rated for 130 km/hr of operation,most of them don't even run at 80 km/hr on average in reality. \n\nThe solution to that is to lay more track which we are doing, it'a continious process. Here are new tracks being added. [https://indiarailinfo.com/atlas](https://indiarailinfo.com/atlas), here a resource to check all the new tracks being laid, also includes track doubling/tripling and quadrupling in some cases.",
        "Vande Bharat is more like what's the best possible on the current infrastructure given the limitations. The rail infrastructure is massive and it would cost a lot to build actual high speed train lines covering that wide distances, just look at the Bullet train project. Concepts like Train 18 are trying to find efficiency where they can. Gatiman and Shatabdi did the same earlier. \n\nThe advertising by the govt of course wants to claim it's the best train ever made by anyone worldwide and unfortunately, people will believe that. Plenty of reasons why people believe shit of this govt, no point beating the same old drum. \n\nOn the question of are we progressing, I believe yes. It is a significant achievement to make a train in the country. Otherwise any country can get Bullet trains by taking loans and tech from Japan.",
        "In a country where train derailments happen on a frequent basis, one would think that it's better to first improve the existing infrastructure instead of investing in more of these trains. But no! It's all about showing off.",
        "Fake Bullet train with actual bullet train charges. 🤭",
        "Actually bullet train costs a bomb to travel btw",
        "If Vande Bharat is a stunt, then let it be.I am still rooting for it.\n\n\nI don't understand this mentality, why do we have to shit talk about everything govt does. Can't we appreciate something good is being done? \n\n**Vande Bharat may not be the fastest or swankiest railroad in the world, but it's leaps and bounds ahead of what we have had till now**. **It's a step in right direction and sooner and later we will catch up to rest of the world.**\n\nAnd i am against this typical Indian mindset of criticising every thing. \n\nIf govt gives subsidy /freebies , then we call it vote bank politics to appease the poor. \n\nNow when govt builds something for the middle class to enjoy , then we start giving moral lectures about how this money  could have been used for hospitals or what not, why can't we appreciate this was built to appease middle class and we fucking deserve it. \n\nNow before you start criticising that it's very costly, well no Ambani is riding that train, and govt runs enough general coaches to cater to masses. So stop cribbing, paise kamao BC so you can enjoy these services or be satisfied riding in general coach.",
        "For your information (derailment and collision are rare cause of rail accidents)[https://theprint.in/india/2-6-lakh-people-died-in-rail-accidents-in-india-in-past-10-yrs-most-werent-killed-in-collisions/1610557/]",
        "Rare it may, it still happens quite often. Also do not ever forget that the railway infrastructure for normal people in India is abhorrent, dirty, overcrowded and dilapidated. We shouldn't sugarcoat the reality. Launching vande bharat does nothing to improve the overall infrastructure of the railways that has been neglected for years and years.",
        "Yes that is true, it's a long way to go, but in this case the govt is trying top to down approach. By making intercity travel experience better, govt wants to cash in the travellers who would have instead flown to other city. \n\nThis affluent part of society, would then be willing to spend more, hence giving incentives to Buisnesses to set up stalls and other services. And when these buisnesses come , they will want clean stations and working amenities,hence intentivizing stations to keep cleaner to attract more buisness. Thus by making it good for the rich, the poor inadvertently benefit. Govt can't keep a station clean if it's not making money.\n\nCase in point, compare the stations of Delhi and jaipur metro. Delhi metro stations are sparkling clean while jaipur metro stations are in sorry conditions, this is because Delhi metro has buisnesses on its premises and jaipur metro is a ghost town. Plus other reasons like ridership is also there.",
        "Jargon Marketing only Vande  is being promoted or Flagged off  whilst rest of train standards are way down   and  for his innumerable Bhakts especially NRIS who are mostly upper caste",
        "I still dont understand why they didn't use these for rrts",
        "I am not criticizing.Look it good to have such trains aur Paisa to kamate hi hai. But it totally based on how they run in jam packed rail network.",
        "Vande bharat is a stunt. But vande bharat is not complete shit show. It is giving me hopes for better cities in future. But still we need more tracks than fancy slow vande bharats which also slows down other trains for it to run at 80kmph"
    ],
    "cleaned_text": "vande bharat stunt show progressing vande bharat gen till date aka train publicity stunt say capable running kmph run specific kmph per section think different track trains already train run along train seems myth increase fare already dont facilities run train faster neither ambitious project like mumbaiahemdabad bullet train completed government keep pushing train happen duranto shatabdi rajdhani sleeper vande bharat introduced ",
    "cleaned_title": "vande bharat stunt show progressing",
    "cleaned_selftext": "vande bharat gen till date aka train publicity stunt say capable running kmph run specific kmph per section think different track trains already train run along train seems myth increase fare already dont facilities run train faster neither ambitious project like mumbaiahemdabad bullet train completed government keep pushing train happen duranto shatabdi rajdhani sleeper vande bharat introduced",
    "cleaned_comments": "bad take yes average speed isnt still came delhi kanpur prayagraj stretch absolute need decentralize population choking major cities fast connectivity cities people live work different city way clog gets removed cities get better cant improve city till connectivity gets better companies willing settle look load intercity trains pull everyday india fares reduce enough running route infrastructure gets better flights used cost fair chunk salary still part demand increases operation costs gradually start decreasing vbe emus ie dont locomotive easier tracks ton locomotive isnt crushing daily isnt new tech btw metro systems emus first time designed completely inhouse indian railways another feature emus faster pickup speed faster run time locomotive train set similar size yeah technological advancent dont dismiss done tech knowdlege spreding across indian railways locomotive divisons manufactring picks increased local supply chain think china went world biggest makers locomotives without iterative process improvement tracks common problem india rajdhaani express trainsets rated kmhr operationmost dont even run kmhr average reality solution lay track ita continious process new tracks added httpsindiarailinfocomatlashttpsindiarailinfocomatlas resource check new tracks laid also includes track doublingtripling quadrupling cases vande bharat like whats best possible current infrastructure given limitations rail infrastructure massive would cost lot build actual high speed train lines covering wide distances look bullet train project concepts like train trying find efficiency gatiman shatabdi earlier advertising govt course wants claim best train ever made anyone worldwide unfortunately people believe plenty reasons people believe shit govt point beating old drum question progressing believe yes significant achievement make train country otherwise country get bullet trains taking loans tech japan country train derailments happen frequent basis one would think better first improve existing infrastructure instead investing trains showing fake bullet train actual bullet train charges actually bullet train costs bomb travel btw vande bharat stunt let bei still rooting dont understand mentality shit talk everything govt cant appreciate something good done vande bharat may fastest swankiest railroad world leaps bounds ahead till step right direction sooner later catch rest world typical indian mindset criticising every thing govt gives subsidy freebies call vote bank politics appease poor govt builds something middle class enjoy start giving moral lectures money could used hospitals cant appreciate built appease middle class fucking deserve start criticising costly well ambani riding train govt runs enough general coaches cater masses stop cribbing paise kamao bc enjoy services satisfied riding general coach information derailment collision rare cause rail accidentshttpstheprintinindialakhpeoplediedinrailaccidentsinindiainpastyrsmostwerentkilledincollisions rare may still happens quite often also ever forget railway infrastructure normal people india abhorrent dirty overcrowded dilapidated shouldnt sugarcoat reality launching vande bharat nothing improve overall infrastructure railways neglected years years yes true long way go case govt trying top approach making intercity travel experience better govt wants cash travellers would instead flown city affluent part society would willing spend hence giving incentives buisnesses set stalls services buisnesses come want clean stations working amenitieshence intentivizing stations keep cleaner attract buisness thus making good rich poor inadvertently benefit govt cant keep station clean making money case point compare stations delhi jaipur metro delhi metro stations sparkling clean jaipur metro stations sorry conditions delhi metro buisnesses premises jaipur metro ghost town plus reasons like ridership also jargon marketing vande promoted flagged whilst rest train standards way innumerable bhakts especially nris mostly upper caste still dont understand didnt use rrts criticizinglook good trains aur paisa kamate hi hai totally based run jam packed rail network vande bharat stunt vande bharat complete shit show giving hopes better cities future still need tracks fancy slow vande bharats also slows trains run kmph",
    "light_cleaned_title": "Is Vande Bharat just stunt to show we are progressing?",
    "light_cleaned_selftext": "The Vande Bharat (Gen 1 -- till date) a.k.a Train 18 is just a publicity stunt they say it capable of running at 160 kmph but it run only specific kmph per section. What I think we should have different track for such trains. Already there are only 2 train that run along. This train seems to be myth with increase fare already we don't have such facilities to run train faster neither Ambitious project like Mumbai-Ahemdabad Bullet Train completed. Why government keep pushing such more train and what will happen to Duranto, Shatabdi, Rajdhani if sleeper Vande Bharat are introduced",
    "light_cleaned_comments": "Such a bad take. Yes the average speed isn't 160, it still came out to be > 110 on the Delhi Kanpur - Prayagraj stretch. There is absolute need to decentralize the population choking the 6 major cities, having fast connectivity to cities where people can live and work in a different city is the way the clog gets removed, and other cities get better. You can't improve a city till connectivity gets better, companies are willing to settle there. Just look at the load intercity trains pull on everyday in India!! Fares reduce when you have enough of them running on the route and infrastructure gets better. Flights used to cost a fair chunk of your salary, still does in some part, but as the demand increases the operation costs gradually start decreasing. VBE are EMUs i.e they don't have a locomotive as such they are easier on the tracks, as a 100 ton locomotive isn't crushing them daily. This isn't a new tech btw, all metro systems are EMUs only but it's the first time they were designed completely inhouse by Indian railways. Another feature of EMUs is faster pickup of speed as such they should be in have faster run time than a locomotive train set of similar size. So yeah there is a technological advancent, don't dismiss it as having been done before but the tech knowdlege is spreding across Indian railways locomotive divisons as manufactring picks up with increased local supply chain. You think China went to world biggest makers of locomotives without such iterative process of improvement ? As for tracks this a common problem in India, Rajdhaani express trainsets are rated for 130 km/hr of operation,most of them don't even run at 80 km/hr on average in reality. The solution to that is to lay more track which we are doing, it'a continious process. Here are new tracks being added. [https://indiarailinfo.com/atlas](https://indiarailinfo.com/atlas), here a resource to check all the new tracks being laid, also includes track doubling/tripling and quadrupling in some cases. Vande Bharat is more like what's the best possible on the current infrastructure given the limitations. The rail infrastructure is massive and it would cost a lot to build actual high speed train lines covering that wide distances, just look at the Bullet train project. Concepts like Train 18 are trying to find efficiency where they can. Gatiman and Shatabdi did the same earlier. The advertising by the govt of course wants to claim it's the best train ever made by anyone worldwide and unfortunately, people will believe that. Plenty of reasons why people believe shit of this govt, no point beating the same old drum. On the question of are we progressing, I believe yes. It is a significant achievement to make a train in the country. Otherwise any country can get Bullet trains by taking loans and tech from Japan. In a country where train derailments happen on a frequent basis, one would think that it's better to first improve the existing infrastructure instead of investing in more of these trains. But no! It's all about showing off. Fake Bullet train with actual bullet train charges. 🤭 Actually bullet train costs a bomb to travel btw If Vande Bharat is a stunt, then let it be.I am still rooting for it. I don't understand this mentality, why do we have to shit talk about everything govt does. Can't we appreciate something good is being done? **Vande Bharat may not be the fastest or swankiest railroad in the world, but it's leaps and bounds ahead of what we have had till now**. **It's a step in right direction and sooner and later we will catch up to rest of the world.** And i am against this typical Indian mindset of criticising every thing. If govt gives subsidy /freebies , then we call it vote bank politics to appease the poor. Now when govt builds something for the middle class to enjoy , then we start giving moral lectures about how this money could have been used for hospitals or what not, why can't we appreciate this was built to appease middle class and we fucking deserve it. Now before you start criticising that it's very costly, well no Ambani is riding that train, and govt runs enough general coaches to cater to masses. So stop cribbing, paise kamao BC so you can enjoy these services or be satisfied riding in general coach. For your information (derailment and collision are rare cause of rail accidents)[https://theprint.in/india/2-6-lakh-people-died-in-rail-accidents-in-india-in-past-10-yrs-most-werent-killed-in-collisions/1610557/] Rare it may, it still happens quite often. Also do not ever forget that the railway infrastructure for normal people in India is abhorrent, dirty, overcrowded and dilapidated. We shouldn't sugarcoat the reality. Launching vande bharat does nothing to improve the overall infrastructure of the railways that has been neglected for years and years. Yes that is true, it's a long way to go, but in this case the govt is trying top to down approach. By making intercity travel experience better, govt wants to cash in the travellers who would have instead flown to other city. This affluent part of society, would then be willing to spend more, hence giving incentives to Buisnesses to set up stalls and other services. And when these buisnesses come , they will want clean stations and working amenities,hence intentivizing stations to keep cleaner to attract more buisness. Thus by making it good for the rich, the poor inadvertently benefit. Govt can't keep a station clean if it's not making money. Case in point, compare the stations of Delhi and jaipur metro. Delhi metro stations are sparkling clean while jaipur metro stations are in sorry conditions, this is because Delhi metro has buisnesses on its premises and jaipur metro is a ghost town. Plus other reasons like ridership is also there. Jargon Marketing only Vande is being promoted or Flagged off whilst rest of train standards are way down and for his innumerable Bhakts especially NRIS who are mostly upper caste I still dont understand why they didn't use these for rrts I am not criticizing.Look it good to have such trains aur Paisa to kamate hi hai. But it totally based on how they run in jam packed rail network. Vande bharat is a stunt. But vande bharat is not complete shit show. It is giving me hopes for better cities in future. But still we need more tracks than fancy slow vande bharats which also slows down other trains for it to run at 80kmph"
}