{
    "id": "1992axb",
    "title": "Tesla - A good or a bad entity?",
    "url": "https://www.reddit.com/r/india/comments/1992axb/tesla_a_good_or_a_bad_entity/",
    "selftext": "Everyone knows Tesla, and it's celebrity billionaire owner Elon Musk. Tesla is considering Maharashtra, Tamil Nadu and Gujarat to set up their electric vehicle (EV) factory. Tesla is also expected to make an initial investment of USD 2 billion to set up shop in India, and would look to increase purchases of auto parts from the nation to as much as USD 15 billion, reported by Bloomberg. \n\nNow let's understand how Tesla makes money, so in the US, under California ZEV Program ( Zero Emission Vehicle) Tesla gets a different type of currency known as Carbon Credits, since it manufactures EV vehicles. \n\nCarbon credits, also known as carbon offsets, are permits that allow the owner to emit a certain amount of carbon dioxide or other greenhouse gases. \n1 Carbon Credit = 1 Ton of Greenhouse gas\nCost of 1 Carbon Credit = $40-$80\n\nTesla then Sells these carbon credits to other companies that fail to meet their Greenhouse emission standards and makes huge profits. So basically you can use this currency to pay for how much your company pollutes. So in reality there is no real sustainability. Other companies can PURCHASE all the good you did for the environment. Welcome to ✨ capitalism ✨ \n\nhttps://carboncredits.com/teslas-record-carbon-credit-sales-up-94-year-over-year/\n\nGuess who is going to start this new Carbon Credit Market? Ofcourse the Indian Government is.\n\nhttps://pib.gov.in/PressReleasePage.aspx?PRID=1923458\n\nThe government plans to develop the Indian Carbon Market (ICM) where a national framework will be established with an objective to decarbonise the Indian economy by pricing the Green House Gas (GHG) emission through trading of the Carbon Credit Certificates.\n\nSo yes it's no suprise Tesla is interested in India. It has a big automobile market, Tesla can farm carbon credits like crazy and then sell it to other multicorps for a huge profit. Tesla is in the carbon credit business, not the EV business. \n\nTesla has also been notorious for mistreatment of workers, underpaying and overworking their employees.\n\n\nhttps://www.washingtonpost.com/business/2023/09/28/tesla-federal-lawsuit-racial-harassment/\n\nhttps://www.theguardian.com/us-news/2023/apr/03/tesla-racial-harassment-lawsuit-award-california-factory\n\nhttps://auto.economictimes.indiatimes.com/news/passenger-vehicle/tesla-workers-report-robot-injuries-explosions-at-us-cybertruck-factory/105413596\n\nhttps://revealnews.org/article/tesla-says-its-factory-is-safer-but-it-left-injuries-off-the-books/\n\nhttps://www.thehindu.com/sci-tech/science/at-spacex-worker-injuries-soar-in-elon-musks-rush-to-mars/article67531431.ece\n\nElon Musk also hates Unions that is why Tesla is facing a workers strike in Sweden and Denmark, because the unions in sweden are demanding pay approved by a collective agreement. And these strikes are spreading in Europe.\n\nhttps://apnews.com/article/tesla-strike-union-sweden-labor-dispute-5124a0074f6b4c5b7f503b5353afe8b3\n\n\nhttps://www.businessinsider.in/tech/news/elon-musk-has-started-a-war-with-tesla-workers-that-hes-unlikely-to-win/articleshow/106044664.cms\n\nIt's just my opinion that Tesla is not a great company. People need to realise multicorps are focused on earning money and not the welfare of the people. You need to start asking do these foreign investments actually benefit the people? Or are they exploitative under loose labour laws? They only objective is to maximize profits, at any expense. This is just information I think people should know. You're free to come to your own conclusions.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1705512676.0,
    "convurl": "https://external-preview.redd.it/DpE60ud52DY9onBKqBo7T7wp9KxkEK4VkTmAe3r3dlI.jpg?auto=webp&s=7b482df97aab9b4b9f60fe55ac32d9924065fdfb",
    "comments": [],
    "cleaned_text": "tesla good bad entity everyone knows tesla celebrity billionaire owner elon musk tesla considering maharashtra tamil nadu gujarat set electric vehicle ev factory tesla also expected make initial investment usd billion set shop india would look increase purchases auto parts nation much usd billion reported bloomberg lets understand tesla makes money us california zev program zero emission vehicle tesla gets different type currency known carbon credits since manufactures ev vehicles carbon credits also known carbon offsets permits allow owner emit certain amount carbon dioxide greenhouse gases carbon credit ton greenhouse gas cost carbon credit tesla sells carbon credits companies fail meet greenhouse emission standards makes huge profits basically use currency pay much company pollutes reality real sustainability companies purchase good environment welcome capitalism guess going start new carbon credit market ofcourse indian government government plans develop indian carbon market icm national framework established objective decarbonise indian economy pricing green house gas ghg emission trading carbon credit certificates yes suprise tesla interested india big automobile market tesla farm carbon credits like crazy sell multicorps huge profit tesla carbon credit business ev business tesla also notorious mistreatment workers underpaying overworking employees elon musk also hates unions tesla facing workers strike sweden denmark unions sweden demanding pay approved collective agreement strikes spreading europe opinion tesla great company people need realise multicorps focused earning money welfare people need start asking foreign investments actually benefit people exploitative loose labour laws objective maximize profits expense information think people know youre free come conclusions ",
    "cleaned_title": "tesla good bad entity",
    "cleaned_selftext": "everyone knows tesla celebrity billionaire owner elon musk tesla considering maharashtra tamil nadu gujarat set electric vehicle ev factory tesla also expected make initial investment usd billion set shop india would look increase purchases auto parts nation much usd billion reported bloomberg lets understand tesla makes money us california zev program zero emission vehicle tesla gets different type currency known carbon credits since manufactures ev vehicles carbon credits also known carbon offsets permits allow owner emit certain amount carbon dioxide greenhouse gases carbon credit ton greenhouse gas cost carbon credit tesla sells carbon credits companies fail meet greenhouse emission standards makes huge profits basically use currency pay much company pollutes reality real sustainability companies purchase good environment welcome capitalism guess going start new carbon credit market ofcourse indian government government plans develop indian carbon market icm national framework established objective decarbonise indian economy pricing green house gas ghg emission trading carbon credit certificates yes suprise tesla interested india big automobile market tesla farm carbon credits like crazy sell multicorps huge profit tesla carbon credit business ev business tesla also notorious mistreatment workers underpaying overworking employees elon musk also hates unions tesla facing workers strike sweden denmark unions sweden demanding pay approved collective agreement strikes spreading europe opinion tesla great company people need realise multicorps focused earning money welfare people need start asking foreign investments actually benefit people exploitative loose labour laws objective maximize profits expense information think people know youre free come conclusions",
    "cleaned_comments": "",
    "light_cleaned_title": "Tesla - A good or a bad entity?",
    "light_cleaned_selftext": "Everyone knows Tesla, and it's celebrity billionaire owner Elon Musk. Tesla is considering Maharashtra, Tamil Nadu and Gujarat to set up their electric vehicle (EV) factory. Tesla is also expected to make an initial investment of USD 2 billion to set up shop in India, and would look to increase purchases of auto parts from the nation to as much as USD 15 billion, reported by Bloomberg. Now let's understand how Tesla makes money, so in the US, under California ZEV Program ( Zero Emission Vehicle) Tesla gets a different type of currency known as Carbon Credits, since it manufactures EV vehicles. Carbon credits, also known as carbon offsets, are permits that allow the owner to emit a certain amount of carbon dioxide or other greenhouse gases. 1 Carbon Credit = 1 Ton of Greenhouse gas Cost of 1 Carbon Credit = $40-$80 Tesla then Sells these carbon credits to other companies that fail to meet their Greenhouse emission standards and makes huge profits. So basically you can use this currency to pay for how much your company pollutes. So in reality there is no real sustainability. Other companies can PURCHASE all the good you did for the environment. Welcome to ✨ capitalism ✨ Guess who is going to start this new Carbon Credit Market? Ofcourse the Indian Government is. The government plans to develop the Indian Carbon Market (ICM) where a national framework will be established with an objective to decarbonise the Indian economy by pricing the Green House Gas (GHG) emission through trading of the Carbon Credit Certificates. So yes it's no suprise Tesla is interested in India. It has a big automobile market, Tesla can farm carbon credits like crazy and then sell it to other multicorps for a huge profit. Tesla is in the carbon credit business, not the EV business. Tesla has also been notorious for mistreatment of workers, underpaying and overworking their employees. Elon Musk also hates Unions that is why Tesla is facing a workers strike in Sweden and Denmark, because the unions in sweden are demanding pay approved by a collective agreement. And these strikes are spreading in Europe. It's just my opinion that Tesla is not a great company. People need to realise multicorps are focused on earning money and not the welfare of the people. You need to start asking do these foreign investments actually benefit the people? Or are they exploitative under loose labour laws? They only objective is to maximize profits, at any expense. This is just information I think people should know. You're free to come to your own conclusions.",
    "light_cleaned_comments": ""
}