{
    "id": "1h5hs36",
    "title": "Child malnourishment in Gujarat is fact.",
    "url": "https://www.reddit.com/gallery/1h5hs36",
    "selftext": "Gujarat is as per with states like Bihar or Jharkhand in terms of malnourishment among children. The state and central govs are of same party for a long time. Gujarat is one of the highest tax paying state of India. But this results mark the questions on people wellfare and where the people's money is going. https://pib.gov.in/PressReleasePage.aspx?PRID=1806601",
    "flair": "Policy/Economy",
    "score": 993,
    "num_comments": 258,
    "created_utc": 1733209643.0,
    "convurl": "https://i.redd.it/q0fr76a42l4e1.jpg",
    "comments": [
        "Average GOA W🗿",
        "##Correct me if I am wrong \n\nIt's pretty bad for Goa imo, goa's population is nearly 16 Lakhs and having 20-30% of child malnutrition is wild",
        "Vegetarian state, of course",
        "I think the main issue is vegetarianism.",
        "And I can guarantee you that most if not all those who are malnourished are migrants who are brought in by our politicians for votes and who cannot afford one kid but have minimum four. Goa is the only state of India where natives are way less than the migrants.",
        "Kerala always Tops",
        "Major W for kerala. Surprised that coastal odisha and capital is doing so well in child welfare compared to the rest of the state.",
        "Coastal Odisha has been the biggest beneficiary of state government priorities (The BJP government).",
        "Indian diet in general",
        "Kerala ✨",
        "Meanwhile Punjab be like , hunger ? Malnourishment ? Wtf is that ?",
        "corruption",
        "Follow it India. You have to reach that level by tooth and nail. After all it is Gujarat Model.",
        "r/usernamechecksout",
        "As a Malayali all I can say is I'll continue eating my beef (for all the sanghis about to have a meltdown reading my comment, yes I will also be eating pork).\n\nGujju gang can continue eating their sugar and carb rich diet with almost non existent protein content for the rest of their lives.",
        "Coastal region are mostly green, probably due to eating habits which include fish in diet which is good source of protein and other nutrients.",
        "haryana is a predominantly vegetarian state btw.",
        "Those critical districts in Karnataka contains a large sections of Lingayat communities who are influenced by their Lingayat seers who also wield a lot of power in Karnataka politics too. And these asshole seers have been actively protesting the inclusion of eggs in the mid-day meals. It shows that they care more about their religion more than the health of the children.\n\nhttps://www.telegraphindia.com/india/14-year-old-threatens-against-non-inclusion-of-eggs-in-mid-day-meal/cid/1843372",
        "Western Odisha is green too, child malnourishment depends more on factors like economic and social development. It is an undeniable fact that GoO is biased towards Eastern Odisha.",
        "Lekin bro voh masjid ke neeche mandir ?",
        "Malayali ano ? 😅",
        "Nice one",
        "Everyone in India cares more about religion that anything else.",
        "Shining gujjurat\n\nHahaha.",
        "Piraud momant saar 🫡",
        "I used to think the left was logical. The obvious inference from this is mismanagement and of course religious involvement. But to think that the only reason is protein deficiency and that only meat can solve this during a \n\n1. Climate crisis that is exacerbated by meat farming\n2. Knowing full well that science has shown that one can become an athlete and live long with a full vegan diet goes to show how ignorant even the left is\n\nI realise they would rather hate on the sanghis even at cost of sounding illogical like them.\n\nAgain I am not saying we should stop meat or whatever. But come on. We can’t deny we need to change our consumption ways and actually encourage anyone trying to save the world by going vegan.",
        "Honestly, even if Indians eat non vegetarian, they don't truly benefit by a big margin because most of them (in the northern side, at least) eat it only once a week or so. \n\nIndia is in dire need of protein awareness.",
        "we should make gujarat more red",
        "This is not about meat eaters and non meat eaters. This about people denied their rights and gov doing nothing in the sensitive issues like this. This is about saving our children.",
        "Why do you think PM eats MUSHROOMS!",
        "Does India even acknowledge the extreme over population issues instead of blaming stuff like “vegetarian region”, “poverty” etc ? Does the government and people even talk about the over population issues ?",
        "Coastal areas will usually have better nutrition than the same inland areas since seafood is highly nutritious and the ocean is extremely productive.",
        "Can't they just catch a fish and label it plant based plant meat ",
        "Religion trumps Protein.",
        "Mfks be eating Maida and rawa for 7 days and want everyone to stop eating eggs and meat.",
        "Vegan protein is extremely expensive if you want it to approach the quality of animal protein. Unless you’re extremely good at meal planning, you’re going to need to eat either heavily processed plant protein - which much of india doesn’t have access to - or massive amounts of carbs and calories to meet a protein requirement. \n\n\nI’m not saying veganism is bad, it’s objectively better for the environment and reduces suffering of animals when compared with an omnivorous diet… but it’s extremely restrictive.\n\n\nIn India we have a child malnourishment problem. The climate issue is massive, but India’s per capita contribution is minuscule compared to much of the world and frankly the health of Indian children matters more than a small increase in our contribution to climate change.",
        "labours from other states",
        "Cowbelt ☕",
        "You may diss Kerala for it's government. But communism and INC in it early years is what made Kerala ace these parameters.",
        "ANTI NATIONAL BRO YOU ARE. JAI HIND JAI MATA DI. IN GUJARAT WE DON'T MIX WATER IN SAMBHAR NOR JUST GIVE SALT TO EAT WITH RICE.\n\n/s",
        "Hoii major credit goes to this dumbfucks digambar kamat and pramod savant",
        "Ahem!\n\nhttps://preview.redd.it/2o3sx5vl2m4e1.jpeg?width=1080&format=pjpg&auto=webp&s=d160571d811a6aaf0cdc6c4327f1a99cfe04640b",
        "Once a week? Maybe in the north. Everyone I know eats fish on a daily basis. Maybe chicken/beef/pork twice a week.",
        "Again I agree with all you said. The transformation has to be gradual and till then children health should be projected. My beef (pun intended) was with those being proud of their meat eating because sanghis are morons. I fear the left in India is becoming what is hates just with new gods (beef, pork etc etc)…. The problem is this binary thinking.",
        "It's the damn religious vegetarianism that hurts the kids.",
        "This is a conspiracy by Soros. Everything is well in Ramrajya/s",
        "How does hyderabad have medium prevalence?",
        "Even in south too except Kerala. Chicken is usually eaten only once a week by most Indians since they can't afford it more than once weekly.",
        "Well both care more about nagpur",
        "Veganism or vegetarianism is a major issue for causing these problems. If atleast these people were non vegetarian some of these issues could have been resolved to some extent.\n\nAnd when i say being non vegetarian, i mean those people should have atleast non veg 3 or 4 days. It aint that cheap but being vegetarian and nutrient and protein sufficient is next to impossible in india being a vegetarian.",
        "They think mutton is beef and then you want to do this",
        "Yeah good luck with that approach. An athlete being a vegetarian has lots of money to get his protein and nutrients from plant sources. Even though its more bad to the environment he can sustain that stupid approch because of his wealth. Thats not the case with common people.",
        "That’s a fair perspective actually as I do see too many Indians jumping straight to the other side like “I’m going to eat all the meat, LMAO!”\n\nIt’s also wrong and dumb.",
        "*BJD Government(The new Govt. is just 4-5 months old and it took years altogether for the previous govt. To achieve this)",
        "Understand something, the kids are stunted due to lack of calories. The govt has failed to create the basic supply chain to feed the kids. The govt magically supplying eggs and meat to the kids is not going to solve the problem.",
        "Sorry, I meant the BJD government",
        "Kutch in gujarat is shown as very highly malnourished whereas it has the highest per capita income (district) in gujarat . Something is off about this data.",
        "How dare you talk shit about Ameryca of India /s",
        "On Gujarat's malnutrition, one famous person once said, \"[Gujarat's malnutrition due to figure-conscious girls](https://www.indiatoday.in/india/story/go-figure-figure-conscious-gujarati-girls-cause-malnutrition-in-the-state-says-modi-114703-2012-08-28)\".\n\n\"Gujarat is also a middle-class state. The middle-class is more beauty conscious than health conscious.\"\n\n\"If a mother tells her daughter to have milk, they'll have a fight. She'll tell her mother, \"I won't drink milk. I'll get fat.\"",
        "Keep coping.",
        "Malnourishment and Stunting seems to be major concern for North and Western India.🇮🇳",
        "Gujarat's got problems. But I'm pretty sure its not as simple as \"eat more meat bro\" that most of the idiots here seem to think is the problem.",
        "I'm so glad I grew up eating sea food and red meat on the regular.",
        "Kerala W with our fish loving population. 😎",
        "Delulu is the solulu",
        "The amount of blind dislikes without arguing in the validity of my comment shows how sensitive the left has become of its stances that it is scared of challenging itself. at this point India’s left is as religious as the right. Religious about atheism religious about meat religious about anything against the right. P",
        "It's like the more malnourished these seers are the more stupid decisions they make. Yeah who would've thought right? 🤡",
        "Literally going to hamper brain development and growth. But if living in misery was an Olympic level sport then these losers would top it.",
        "Children are very fussy eaters and sometimes you cannot force just a narrow diet onto them.\n\nMy own daughter went through periods of only eating fish, chicken, beef, eggs etc when she was young and didn't want to eat anything else. \n\nAnd children will often just eat unhealthily if they cannot get the food they need - the result is they will be both physically and mentally stunted. Let them choose to become vegetarians after they turn 18 years old if it is important to them and it can be their own decision.",
        "\"on par with states like bihar and jharkand\"💀",
        "Science has shown you can become an athlete with just a vegan diet but have you found a cost effective way to source everything? If it was already perfect then why are some of the most malnourished people also from vegetarian states (not even vegan).\n\nThis whole \"leftist\" argument being used everywhere by the sangh shows how blind and delusional you and the rest of the sangh are. Anything that remotely targets Gujjus? Yeah that must be leftist propaganda 🤡",
        "The left is alright with your life choices. Eat what you want and worship whom you want. Can't say the same thing about the right wing.",
        "I think many people are taking more issue with your generalizing about the left being sensitive and illogical than your issues on meat vs veg.",
        "am not even kidding , it is UP BIHAR in disguise , all sikhs going to canada and we are left with laborers",
        "All the coastal areas are green. That's awesome tbh.",
        "Rather a protein deficient stats.",
        "In response to a thread that is generalising a whole problem as saying it is a problem because of meat. And do we really want to pull that thread on generalisation when we ourselves engage in name calling like sanghis that are also generalising. All I am saying is the comments section reminded me of a worrying trend in India just like this malnutrition post reminded others or sanghis",
        "thing is where non veg is not tabboo or made at home every day this is not an issue. mf’s will save to get a bunglow and won’t invest in food",
        "How is malnourishment measured?",
        "GJ - America without guns and drugs",
        "R/RepostSleuthBot",
        "r/RepostSleuthBot",
        "u/RepostSleuthBot ",
        "ofc we prolly have the least healthy diet",
        "yeah this survey is 10 years old and Kutch and north Gujarat in general has majorly improved in last 10 years, before that conditions were unliveable there, but don't speak logic here just say Gujarat bad",
        "Natil evedeya",
        "Punjab is mostly vegetarian and yet green. \n\nIs it really vegetarianism and religion that you need to attack here ? \n\nThe real reason is welfare as OP rightly pointed out. The map is inline with income inequality.",
        "https://preview.redd.it/c85z1t9e4n4e1.jpeg?width=3000&format=pjpg&auto=webp&s=bcbf1a7250a20fb0819883fd5f005c077383bf42",
        "National average for vegetarianism is 29%. \n\nUP itself is 47% vegetarian. \n\nPeople forcing others to eat meat are as worse as the people forcing them to not eat meat.",
        "West Bengalil ninnanu... I learnt malayalam because I like this language. I'm originally half Bengali- half Odia",
        "> I'm so glad I grew up eating sea food\n\nI wish I did. I can't handle  most fish except for canned Tuna and haddock. The smell and taste just get to me. Even with shellfish, unless it's farm grown, it's difficult. I've tried over the years to force myself to get get used to the taste but it's never worked unless the fish is super processed. \n\nMy SO loves most fish but we get restricted at home because of me.",
        "i see this in my own house yr. My parents are so brainwashed about being vegetarian ( we used to be non vegetarian 10 years ago ). \n\nTheir health has just gone downhill since then. All they eat is high carb diet and they wonder why they have uncontrolled diabetes.\n\nWhat's worse is that they wine about me eating nonveg. According to them I'm being unhealthy and hedonistic.",
        "🗿",
        "I'd say it's an acquired taste and something you'll have to keep having until it becomes alright. Kinda like beer.",
        "please get some real food in your belly, you are not making sense",
        "Try salmon or else mahi mahi (hard to find but see if frozen food suppliers have like cambay tiger)",
        "It's changing",
        "Just eat Meat 🍖 or Fish 🐟 or Egg 🥚 and it will solve all the problems of Malnutrition & other health issues. \nJust Humans are the foremost APEX PREDATOR that earth has ever produced & Homo sapiens Ancestors won the world from dangerous PREDATORS in pre historic time with barely any tools. And now their descendants in india specifically, are fighting on what should be eaten or not & who are higher on society by their birthing parents. Such wretched wokeism entered india thousands years back, that it consequences are still felt to this day. 😢",
        "I am CURIOUS why people in UP and Bihar asks for these things, they perform really bad compared to other states across different categories",
        "I've had Salmon. Alaskan fresh I can eat(As in I helped catch it). Canned and Atlantic not so much. it becomes too \"fishy\".",
        "Yup then try the mahi mahi. It’s not fishy at all. It’s a bit harder to find but it is definitely a good option for people who don’t like the fishy taste (myself included). \n\nTry searching a recipe for panko and macadamia nut crusted mahi mahi and thank me later :)",
        "Funny you should mention beer. THAT I did have here and there growing up when an uncle or father's friend would pass me a sip. \n\nMy SO also says to keep trying to eat it. And I have over the years but it didn't take.",
        "I have been lushing orotein to family. Its a lain to even get their protein content to 20 gms.",
        "Vegetarianism is a clear red-herring here. Punjab is one of the most vegetarian states, despite that it has low malnutrition. The issue at heart is income inequality, solve that and you fix many issues: malnutrition, stunted development, anemia in women, diabetes etc.\n\nYes, it may be by creating a more meat-eating culture, but we all know that is an uphill battle that is ultimately not even worth fighting. \n\nIt's honestly much more efficient to subsidies healthier foods and tax the unhealthy (but I doubt that can happen in gujarat) \n\nThere is also a major opportunity here: lab grown meat will do great business in these states. It will be much easier to get around the moral objections with lab grown meat as well. \n\nOnce a meat-eating culture is created, a meat-producing culture is also created, ie farmers\" livelihoods get tied with people eating meat. This is the sole reason why lab grown meat isn't being produced in the west (in fact, it's getting banned). Farmer lobbies are powerful and worth a lot of votes, so it's best to introduce lab grown meat before there is a meat-eating culture.",
        "😍",
        "যে চমৎকার",
        "Gujrat 🤡\nBihar🤡\nJhat koi nahi janta h 🤡",
        "Veg is costly in gujarat itself.. \nReally struggled to find any good non veg restaurants in ahmedabad outer circle. Literally Rikshavala type hygienic non veg food s available here. 🤐 \nBeing from the south, that was literally very very hard to put up with",
        "നുമ്മട ഫുഡ്‌..",
        "Overlay with vegetarianism may give us a good link for the malnutrition, there was other data showing protein deficiency in the Indian diet in general.\n\nI guess the linked data is the effects of malnutrition like stunted growth. Is there anything with the cause?",
        "I agree to your points. One thing that i am trying to point is humans have always been more meat eating than veg eating. Eatable veggies were very rare in the past and humans mostly relied on hunting for food. We modified the veggies and fruits for what they are today.\n\nWe invented agriculture to reduce the effort of hunting and veggies are even hard to digest. So it is very natural for humans to eat meat than having veg. We are omnivores. This is what the culture here is trying to prevent. Its trying to throw away something that is very natural to us and most have fallen for it.\n\nAnd these same people who rant about meat eating  breeds animals for eggs and dairy products. I have zero respect for the people who fights for vegetarianism and actively consume dairy products and eggs. Vegans are a different breed altogether.",
        "In India it is measured by tracking the ratios of carbohydrates, proteins and fats in a sample population's diet. It is a recent initiative to start tracking this 2023 I think. This data shows a bad picture, but we need this data to do anything about the problem.",
        "Punjab and Haryana will have lot of dairy in their diet. Being vegetarian is not necessarily bad if you are balancing your diet with other sources with same nutrition.\n\n Thier diet may be developed because of what is easily available and practical, other reasons like religion for deciding diet with blind faith deserves to be attacked.",
        "Red area 🫥",
        "Lmao",
        "I see. Can you point me to a source of this information? Doesn't sound right to me. How can that macro ratio be useful  in concluding anything? Nutrition means micronutrients, right? Iron, vitamins ,Zinc etc . Tracking macros nutrients doesn't make any sense. Each of the macros could be anywhere on the  nutrient dense to nutrient empty scale, depending on the source",
        "I am a Hindu and vegetarian, but I have recently embraced eggs. They are a cheap source of protein. Eggs should be made compulsory in schools. I understand a lot of people have their personal religious views, but for growing children, we need to make eggs compulsory. A grown man can then take a sane decision if they want to be a non vegetarian or not.",
        "And hamburgers",
        "Agreed",
        "Considering everyone hates on Kerala and it’s communism, at least in this aspect, socialism is working.",
        "see again",
        "Punjab?",
        "Did you translate it 😂 ? যে doesn't make sense here it'll be কি চমৎকার ",
        "Google translate bro",
        "Nutrition covers all the things. First whether you get enough calories, then if you get a good balance of macros and finally whether you get enough fresh vegetables and fruits.",
        "It's difficult to get enough calories when you skip calorie-dense foods like eggs.",
        "The amount of people blaming vegetarian diet while blatantly ignoring Punjab and even Haryana is appalling.  Instead of advocating for non veg inclusion, which is extremely tougher, the red states can try adopting more veg protein options like Punjab.",
        "Atleast spell “labourers” right if you’re gonna be a prick",
        "who tf cares on this shit posting platform. I aint giving any exam. You are not gonna deduct any marks lil bro",
        "What is up with Northern Karnataka? I know they are drought hit districts but have they always been neglected?",
        "More like common Kerala W. A major W would be if it increased its jobs . As a Keralite, we need to find ways to increase job opportunities",
        "Manga karyam parayumbo thenga karyam parayunnoda?",
        "Or maybe facts hurt and they do not align with your political view.",
        "So why not implement it throughout the country ? Why is it necessary to choose a road where religious people are hurt, when the other route is equally viable ?\n\nI am an atheist myself, but I don't wake up with the thought of hating religious people every morning. \n\nI understand some practices are objectively wrong. But vegetarianism / veganism, even if it is due to religion is great. If people do good, I don't think anyone else should care, whether it is for charity, profit or religion.",
        "Like someone pointed out, if you don’t control carbs and sugar, protein diet is not going to save you from diabetes. And Keralites are notorious for their love of tapioca.",
        "Absolutely terrible that we have such technology and services available, and so many religious people who donate millions to religion institutes, and none of that solves the hunger of a poor unfortunate kid who had the misfortune of being born in a big situation.",
        "Haryana?",
        "Haryana?",
        "Ehmmm\n\nhttps://preview.redd.it/t6nbn2ezwp4e1.jpeg?width=1080&format=pjpg&auto=webp&s=ecad357a440817e202c2069dce786f8fcf51a1d7",
        "Why keep having children then?",
        "Also beef is nutritious 🤷🏻‍♂️",
        "Nobody listened when we said beef is nutritious 🤷🏻‍♂️",
        "I think its rice though. We love tapioca but its not a regular dish for the majority. Rice is.",
        "> And these same people who rant about meat eating breeds animals for eggs and dairy products. I have zero respect for the people who fights for vegetarianism and actively consume dairy products and eggs. Vegans are a different breed altogether.\n\nYeah dairy products have moral issues as well but one step at a time.\n\n> One thing that i am trying to point is humans have always been more meat eating than veg eating. Eatable veggies were very rare in the past and humans mostly relied on hunting for food. We modified the veggies and fruits for what they are today.\n\nYeah, this [article ](https://www.nationalgeographic.com/foodfeatures/evolution-of-diet/) is a good read and agrees with what you're saying. However, humans have been on an agricultural diet for over 10k years, we have eaten a lot more veggies in this time than when we were mainly hunter-gatherers, so this has been plenty time to adapt. It's not like before 5 years ago everyone was a pure meat eater and now they're thrusting vegetarianism on everyone. Both meat and veggies have been modified for what they are today.\n\n> This is what the culture here is trying to prevent. Its trying to throw away something that is very natural to us and most have fallen for it.\n\nThis culture empathises with the sufferings of animals. That is good. Currently it usually does mean a nonnutritious diet, but the answer isn't to kill animals when lab grown meat is an available technology. In the rest of the world, startups are currently aiming to create lab-grown meat that tastes and feels like meat. In India, you want the opposite, you want the lab-grown meat to look, feel and taste as different as real meat if you want to sell it to the vegetarian masses, this is why India is a really unique opportunity in this sector and practically no competition exists here either.",
        "It's not malnutrition. It's dieting. They're trying to make Gujrat supermodels.",
        "Yet we have highest life expectancy",
        "That’s due to high carb diet dude. Yet somehow managed to have higher life expectancy maybe that same because of the health sector but still most of the households here have at least 1 diabetes patients but they’re still live their fullest less bothered",
        "Because eggs are easier to transport, cook, store and are cheaper than diary, if we compare how much protein our body gets from them.\n\nIt's a very \"easy\" source of nutrition that religious fanatics are so aggressively against because their priority is far from the wellbeing of the community.",
        "How is malnourishment defined here ?",
        "eating sea food from child hood is the key\nafter 20s u cannot start liking sea food\ncheers to my parents for forcing me to eat seafood at childhood",
        "Being vegetarian is not at all unhealthy. Matter of fact, most Indians are not vegetarians or non vegetarians. They are 'carbitarians'. Ever seen Indians eating raw vegetables and fruits on a daily basis with zero masala and salt? It's our eating habits. Kerala is a non vegetarian state and people are comparatively healthy and yet they also have the highest diabetes/blood sugar patients with respect to population.",
        "Lol! They think vegetarianism is equal to rice and chapati. No Indian is truly vegetarian or non vegetarian. We hardly include vegetables and fruits in our diet. Our food is full of masala and oil, be it vegetarian or non vegetarian. We are carbitarians at best. :p",
        "\\*in diabetes.",
        "Red meat on the regular sounds like a nightmare for my stomach🥲",
        "It's not about veg/non veg tbh. It's about how we cook. Be it vegetarian/non vegetarian, all our food is full of oil and spices. Moreover, we hardly include raw vegetables and fruits in our diet. That is why South being a 'W' in this aspect takes a major 'L' when it comes to diabetes and heart diseases compared to the North.",
        "Precisely why Punjab ranks above so many non veg dominant states.",
        "Shut up, gujarat is model state 🥰",
        "And precisely why all South Indian states suffer from diabetes and heart diseases.",
        "Supercool Indian spotted.",
        "Let's assume eggs are the end all be all solution for nutrition in India.\n( Even though lentils are cheaper per gram of protein, protein powder has better absorption, and protein itself is not complete nutrition, fibers etc matter too and India's data for malnourished has children with literally no food at all )\n\nMy question is, why insist on forcing religious people to consume eggs ? If nutrition is the priority why not protein and vitamin supplements which everyone is fine with ? Why not choose the path of least resistance? Why *insist* on eggs ? \n\nSeems more of a political statement to me than a genuine concern for unhealthy religious people.",
        "I would just like to mention that the map shown in the first image takes reference from NFHS-4 report which was conducted in 2015-2016, since then a new survey has been conducted in 2019-2021 called NFHS-5. Between the two reports average stunting in children went from an average of 38.4% to 35.5%. Here's the latest report as of 2024: [NFHS-5](https://mohfw.gov.in/sites/default/files/NFHS-5_Phase-II_0.pdf)",
        "The overlap with Hindutva is amazing.",
        "... and tasty. It also clears the roads.",
        "> eat it only once a week or so\n\nI am vegetarian about once a month",
        "Whose mushroom?",
        "No one is forcing religious people to eat eggs. But why should the majority be forced to refrain from healthy nutritious foods if a few people don't want to eat it?",
        "Speak for yourself",
        "Think it's something you get accustomed to. But yeah everything has to be balanced",
        "Yeah some of them are blue also",
        "Confused noises\n\nWdym",
        "bro you should get your eyes checked for color blindness. there is no blue anywhere.",
        "https://preview.redd.it/evs8iv6zqr4e1.png?width=1080&format=pjpg&auto=webp&s=be4ba4f0940b10f17312180009fdd03ccfc54977\n\nYou should get your eyes checked 🤣",
        "lol, i was looking at the last image.",
        "Tbf we have jobs, it's just the society deemed it unacceptable which goes to athithi thozhilali. So oru vazhi nokkiyal nammuk tenga ind but no one wants it\n\n\nWe just got high standards",
        ">Even though lentils are cheaper per gram of protein, protein powder has better absorption, \n\nThis is objectively incorrect LMFAO. Protein powder is significantly more expensive. \n\n\n>and protein itself is not complete nutrition, fibers etc matter too and India's data for malnourished has children with literally no food at all\n\nI never said eggs compensates for fiber/vitamin/mineral consumption. Indians are severely oriented deficient and that's something that needs to be addressed. \n\n>National Family Health Survey (NFHS) Data: The revelation from the National Family Health Survey-4 (2015–16) paints a stark picture of protein inadequacy in India. Remarkably, this data exposes that an astonishing 73% of Indian households fall short of attaining the recommended daily intake of proteins\n\n\nSince you cannot Google. \n\n\n\n>Why *insist* on eggs ? \n\nYou expecting someone who cannot afford a daily meal to have protein supplement has to be the most out of touch bullshit I've read all day.\n\n1 egg costs 6rs\n\nYou need 3 eggs to fulfill your daily protein intake \n\nTell me how much it would cost per serving of your precious protein powders and you might just crack this puzzle in the process.\n\n\nOh and you'd need about 90gm-100gm of UNCOOKED dal to match that. 100gm dal costs 30rs so even if we are ready to eat multiple bowls of dal, we aren't matching how value for money egg is.",
        "I hope this post comes in r/gujarat . But it wont. I have seen them only talk about the good stuff and picking up bad comments about their state and talking about it.",
        "Don't need for beef ,chicken is enough , most Hindus even in Tamil nadu don't eat beef",
        "How is new government working ?",
        "So we can include pork in school lunch ?",
        "In MDM they give you just one food item. I mean that's it. Not a whole meal. In most cases you definitely don't have an option. Been through that. The scheme is that bad and yet so successful. Should be a reality check for people on how poor the Indian lower class is that they're desperate for that. I hate that most people here are not aware how easy it is to access ration in Southern states which massively helps this map. In Maharashtra for example you have to present 25 documents and 7 bribes to access this privilege.\n\nThat said, I am alright with it being presented as an *option*, but I don't understand the hate for not eating eggs/being vegetarian and presenting eggs as the sole nutritious option. \n\nYou also could include supplemented salads or mixed Dal chawal with tofu in MDM which would actually be nutritious, offer fruits etc but even that never sees the light of day. Would be equally nutritious if not more. Most importantly this is a solution both sides agree to ! Not to mention plant based food will always be more cheaper compared to eggs in a resource strapped country. That's just basic thermodynamics.\n\nFighting for eggs feels like solving a problem that does not exist. You need more nutritious food? Need funding. If you have the funds, eggs no eggs does not really matter.",
        "Oh so now we are judging on what we eat. Huh.",
        "What do you mean by \"even in TN\"?",
        "Most left leaning state in india.",
        "Most tamilian are trained to believe they are not Hindus",
        "Sure",
        "Nah. The majority of my family are vegetarians themselves. I don't judge them. The reason I judge people in this region is because of how much of a fuzz they create over something as simple as meat consumption. You'd rarely ever find lunatics like that down South.",
        "What? Where did that come from😅. Who said anything about any political party. Do you think only leftists eat beef l? Do you think BJPians in Kerala dont eat beef?",
        "Whaat? I have tamil friends and Im hearing this for the first time. Are you a tamilian yourself?",
        "Yes I'm Tamil , it very common in social media slowly creeping into cinemas , your religion (North Indian ) is different ,your Ariyan I'm Dravidian divide is very politicislzed by Dravidian organizations.\n\nThey even use கீழடி as proof Hinduism is imported into Tamil Nadu.\nBut கீழடி is industrial site most religious vestegious would be found sarounding  in cities or living areas",
        "Hindu is keyword here ,most conservative Muslims I have seen are in kerala.Kerala's  enlightenment didn't reach its minorities.\n\nBut have seen ex Muslims growing have talked to some in clubhouse.",
        "Every where you see in india ,its Hindus are progressive like these in varying percentage. But Muslims didn't get touched by these progressive ideas .",
        "It always was. \n\nGujarat model is artificial fuckery.",
        "It will stir controversy, left leaning parties would argue it will deter Muslims parents sending their children to school like hijab.\nI know you or people in sub is not against it",
        "So does punjab ngl",
        "RARE BUT NONETHELESS WELCOME ANDHRA PRADESH W",
        ">This is objectively incorrect LMFAO. Protein powder is significantly more expensive.\n\nI said lentils are cheaper you can't read ? LMFAO. You must not even realise how heavily eggs are subsidised do you ? \n\n>protein powder has better absorption\n\nAnyways I typed a long reply explaining stuff, but then I realised you literally cannot read or comprehend what I have written above or check your sources written by some shady guy who is remotely not a dietician. There are so many googleable factual errors in your answer, the irony lol.  \n\n[https://medium.com/@Naveen23/unveiling-the-protein-deficiency-challenge-in-india-a-closer-look-at-alarming-statistics-b40da5a16cce](https://medium.com/@Naveen23/unveiling-the-protein-deficiency-challenge-in-india-a-closer-look-at-alarming-statistics-b40da5a16cce)\n\nNowhere did I mention eggs to not be an option did I ? But you couldn't stick to the point. So there's that. \n\n>You expecting someone who cannot afford a daily meal to have protein supplement has to be the most out of touch bullshit I've read all day.\n\nExpecting a person to stay full for an entire day on eggs probably is the most out of touch bullshit I've read all year. Guess you have a lot of eggs inside your head you need to clear.",
        "India is not a vegetarian country. That was my point. Nor* those highlighted states are vegetarian",
        ">Expecting a person to stay full for an entire day on eggs\n\nOh your dumbassery assumed I suggested surviving on 3 eggs for an entire day. \nAs opposed to what, surviving a whole day on 100gm of dal? I can't figure out how you drew that conclusion out. \nMy bad, I thought you had a functioning brain. \n\n\n>Nowhere did I mention eggs to not be an option did I ?\n\nYou specifically asked why I insisted on eggs. I don't understand how you managed to confuse yourself with something you said. So there's that.\n\n>You must not even realise how heavily eggs are subsidised do you ? \n\nOkay? People still get it at cheaper rates? What kind of braindead take is this LMFAO\n\n>There are so many googleable factual errors in your answer, the irony lol.  \n\nLiterally every single information I typed out was after googling the details up but you would know fuckall about that haha",
        "Surprised about Punjab and Haryana",
        "India has a very poor perspective on what a good diet means. No matter vegetarian or non-vegetarian, the average Indian diet is loaded with carbs, fats and sugar. Coupled with laziness and zero attention to physical health, malnutrition is very common.",
        "High carb diet and lack of exercise. It has nothing to do with eating meat lol. First, you need to have something to eat inorder to be diabetic amiryt",
        "Why do you think so? Does non-veg diet lead to those problems?",
        "Thats what, if you dont want to eat meat. Then dont, stop shaming or boycotting the family over meat consumption we are omnivores not herbivores",
        "What the hell is a carbitarian? \nOur pesticide laden veggies and fruits shouldn't be eaten raw in the first place. And contrary to general consensus, cooking generally improves nutritional availability in foods.\nDiabetes in Kerala is due to high carb diet, especially eating a lot of rice daily, if anything they should reduce carbs and should be eating more meat and veggies.",
        "Lmao, who said to you nutrition means just micro nutrients? That's secondary to macros anyday",
        "You do know that the highlighted states have higher vegetarian population than the average state and not every child is malnourished hence it will be comparable to the vegetarian population with lower income",
        "Then please explain. Why is most of the cowbelt so malnourished?",
        "Better to be diabetic than being malnourished, amiryt.\nAlso we have highest life expectancy, lol. Shouldn't you be worrying more about the malnourished kids in your region?",
        "A single sheet of paper can't decide the condition of my nation!",
        "This anti beef retardation is one of the stupidest ideas which makes Indians a laughing stock. “Cow piss drinkers” is what we are called and the saddest part is that it’s not untrue.",
        "Chetta, oru plate beef fry",
        "Ulli Sura would like to have a word",
        "When will we be like CHAD KERALA? 🔥🐐🚩",
        "Rampant poverty and administrative malpractice probably play big roles. Just a hunch, but probably an accurate hunch.\n\nPunjab has more vegetarians per rata than most other Indian states and it seems to be doing fine in the graph. Meanwhile, less than 10% of the people in Bihar are vegetarians, but that state is still red af.",
        "The problem with Job creation is that it needs land and mineral resources for being able to create IT/ Manufacturing hubs. \n\nKerala is extremely densely populated with natural and agricultural resources which cannot be got rid of to make mines , Hubs or any sort of mega infrastructure project for ecological reasons . \n\nI really don’t think killing crops and deforestation is what we even need as a country with all this global warming shit 😀. I rather a nation of gulfies with remittance economy than starved , polluted and broken down lands. \n\nAnd the point of being a country is that we allot infrastructure projects according to the land layout and resources available. But central govt consistently failed to do that and this is why state govts are doing the heavy work in this regard. Other South Indian states with more mineral resources, barren non agricultural lands and what not have actually managed to do this not to mention infrastructure projects connecting the places within states well. \n\nMore importantly at least a highly aware and educated/skilled population means a lot more easiness to migrate meaning more remittances can be made.",
        "I am very sorry, I was confusing a non government research paper with the NFHS survey and MPI report. The MPI report does not consider  anything other than BMI and weight. \n\n[National MPI report 2021](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.niti.gov.in/sites/default/files/2021-11/National_MPI_India-11242021.pdf&ved=2ahUKEwj5xeTT2Y2KAxXonq8BHQQBHK4QFnoECBYQAQ&usg=AOvVaw15-Stkm-rBLsriBsWAcH8U)\n\nOn Page 16, the Nutrition Indicator is explained.",
        "I am very sorry, I was confusing a non government research paper with the NFHS survey and MPI report. The MPI report does not consider  anything other than BMI and weight. \n\n[National MPI report 2021](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.niti.gov.in/sites/default/files/2021-11/National_MPI_India-11242021.pdf&ved=2ahUKEwj5xeTT2Y2KAxXonq8BHQQBHK4QFnoECBYQAQ&usg=AOvVaw15-Stkm-rBLsriBsWAcH8U)\n\nOn Page 16, the Nutrition Indicator is explained.",
        "I think job opportunities in Kerala is relatively less because there are way less IT/ Industrial hubs in proportional to the educated population ( which tbh is too many ) or even regular population.\n\nAlmost all states with good jobs almost always have a bustling metro / capital with huge IT / finance hubs and some core industrial/ manufacturing towns ( TN, Karnataka and Maharashtra as examples ) . This does need geographical resources to make it happen also",
        "In Kerala and TN they eat more than once a week actually. \n\nBeef access does make eating meat a lot more cheaper actually",
        "Surprise Surprise, Dhokla has no nutritional value",
        "Fish Lovin, Beef Lovin, Pork Lovin, Mutton Lovin, and most importantly nutrition lovin!",
        "Beef really isn't. If we go by that, why Punjab has lower malnutrition than Kerala? They don't eat beef at all",
        "Are you color blind by any chance?",
        "No I am not. It just shows only 4-5 districts of Kerala having low malnutrition while one district has more than 30%. Punjab has from 20-30% as a whole here with ig one district having lower than 20%. So every Punjab indeed has better here",
        "Ah so you are just bad at geography and maybe statistics",
        "Well, I agree with most of your points . But \"depending on remittances \" is not gonna work anymore as people are migrating more to western countries than gulf which allows getting a PR and staying there , thus people building/buying  houses there instead of sending money to build in kerala. Kerala is gonna have a bad bad time in the future. \n\nWe need to seriously increase our IT, electronic , Pharma and other companies which requires lower land. IT has to be decentralised as we can't afford to have a city like Bangalore with roads so small and land already densely packed",
        "I meant, there is no need to bash on kerala on a post that the state clearly performs good. This post is not even about kerala. No one said kerala is perfect, but appreciate the good things thats happening too. This is like scolding the kid who just won a race, because he lost an exam last month.",
        "Valid. And it's not like our economy is in dire condition as well, we have like the 6th largest GDP per capita. It's only our youth wanting even better life",
        "And what is your claim on that?",
        "None of the yellow is part of Kerala and even if it had one yellow, it doesn't put Punjab above it.",
        "Actually, half of the portion of yellow is in Kerala. From where the Kerala-Tamil Nadu dam passes through. And yes it does put Punjab above because even if we ignore this data, Punjabis lives more than an avg Malayalee",
        "Lmao",
        "Your region also tops in literacy. Sad that you got left behind.",
        "Huh?",
        "Carbitarian is fancy term invented by me. :p Also, what I wanted say is that we hardly include salads and fruits in our diet. A population surviving on carbs, carbs and only carbs shouldn't call itself vegetarian.",
        "Sorry brother no offense. And my \"beef\" comment was supposed to be a joke. Sorry if it wasn't a good one.",
        "I didn't even got offended but ok",
        "Did they ask for this?",
        "They do, \n\nMight be biased, but I have seen many people saying, \n\nThey don't need hospital, school etc, issues like inflatration, religion are bigger thing for them.",
        "Kabka census h?",
        "Nai pata hota toh muh band karke bhaita karo",
        "Nai pata hota toh muh band karke bhaita karo",
        "Jey chomotkar? 🤣 google translate zindabad",
        "I liked that. Labourers and not laborers. Brit spelling is a rarity these days.",
        "Magic mushrooms? Really?",
        "It's fine, at least they tried",
        "Cow Belt is called Cow Belt for a reason!"
    ],
    "cleaned_text": "child malnourishment gujarat fact gujarat per states like bihar jharkhand terms malnourishment among children state central govs party long time gujarat one highest tax paying state india results mark questions people wellfare peoples money going ",
    "cleaned_title": "child malnourishment gujarat fact",
    "cleaned_selftext": "gujarat per states like bihar jharkhand terms malnourishment among children state central govs party long time gujarat one highest tax paying state india results mark questions people wellfare peoples money going",
    "cleaned_comments": "average goa w correct wrong pretty bad goa imo goas population nearly lakhs child malnutrition wild vegetarian state course think main issue vegetarianism guarantee malnourished migrants brought politicians votes afford one kid minimum four goa state india natives way less migrants kerala always tops major w kerala surprised coastal odisha capital well child welfare compared rest state coastal odisha biggest beneficiary state government priorities bjp government indian diet general kerala meanwhile punjab like hunger malnourishment wtf corruption follow india reach level tooth nail gujarat model rusernamechecksout malayali say ill continue eating beef sanghis meltdown reading comment yes also eating pork gujju gang continue eating sugar carb rich diet almost non existent protein content rest lives coastal region mostly green probably due eating habits include fish diet good source protein nutrients haryana predominantly vegetarian state btw critical districts karnataka contains large sections lingayat communities influenced lingayat seers also wield lot power karnataka politics asshole seers actively protesting inclusion eggs midday meals shows care religion health children western odisha green child malnourishment depends factors like economic social development undeniable fact goo biased towards eastern odisha lekin bro voh masjid ke neeche mandir malayali ano nice one everyone india cares religion anything else shining gujjurat hahaha piraud momant saar used think left logical obvious inference mismanagement course religious involvement think reason protein deficiency meat solve climate crisis exacerbated meat farming knowing full well science shown one become athlete live long full vegan diet goes show ignorant even left realise would rather hate sanghis even cost sounding illogical like saying stop meat whatever come cant deny need change consumption ways actually encourage anyone trying save world going vegan honestly even indians eat non vegetarian dont truly benefit big margin northern side least eat week india dire need protein awareness make gujarat red meat eaters non meat eaters people denied rights gov nothing sensitive issues like saving children think pm eats mushrooms india even acknowledge extreme population issues instead blaming stuff like vegetarian region poverty etc government people even talk population issues coastal areas usually better nutrition inland areas since seafood highly nutritious ocean extremely productive cant catch fish label plant based plant meat religion trumps protein mfks eating maida rawa days want everyone stop eating eggs meat vegan protein extremely expensive want approach quality animal protein unless youre extremely good meal planning youre going need eat either heavily processed plant protein much india doesnt access massive amounts carbs calories meet protein requirement im saying veganism bad objectively better environment reduces suffering animals compared omnivorous diet extremely restrictive india child malnourishment problem climate issue massive indias per capita contribution minuscule compared much world frankly health indian children matters small increase contribution climate change labours states cowbelt may diss kerala government communism inc early years made kerala ace parameters anti national bro jai hind jai mata di gujarat dont mix water sambhar give salt eat rice hoii major credit goes dumbfucks digambar kamat pramod savant ahem week maybe north everyone know eats fish daily basis maybe chickenbeefpork twice week agree said transformation gradual till children health projected beef pun intended proud meat eating sanghis morons fear left india becoming hates new gods beef pork etc etc problem binary thinking damn religious vegetarianism hurts kids conspiracy soros everything well ramrajyas hyderabad medium prevalence even south except kerala chicken usually eaten week indians since cant afford weekly well care nagpur veganism vegetarianism major issue causing problems atleast people non vegetarian issues could resolved extent say non vegetarian mean people atleast non veg days aint cheap vegetarian nutrient protein sufficient next impossible india vegetarian think mutton beef want yeah good luck approach athlete vegetarian lots money get protein nutrients plant sources even though bad environment sustain stupid approch wealth thats case common people thats fair perspective actually see many indians jumping straight side like im going eat meat lmao also wrong dumb bjd governmentthe new govt months old took years altogether previous govt achieve understand something kids stunted due lack calories govt failed create basic supply chain feed kids govt magically supplying eggs meat kids going solve problem sorry meant bjd government kutch gujarat shown highly malnourished whereas highest per capita income district gujarat something data dare talk shit ameryca india gujarats malnutrition one famous person said gujarats malnutrition due figureconscious girlshttpswwwindiatodayinindiastorygofigurefigureconsciousgujaratigirlscausemalnutritioninthestatesaysmodi gujarat also middleclass state middleclass beauty conscious health conscious mother tells daughter milk theyll fight shell tell mother wont drink milk ill get fat keep coping malnourishment stunting seems major concern north western india gujarats got problems im pretty sure simple eat meat bro idiots seem think problem im glad grew eating sea food red meat regular kerala w fish loving population delulu solulu amount blind dislikes without arguing validity comment shows sensitive left become stances scared challenging point indias left religious right religious atheism religious meat religious anything right p like malnourished seers stupid decisions make yeah wouldve thought right literally going hamper brain development growth living misery olympic level sport losers would top children fussy eaters sometimes force narrow diet onto daughter went periods eating fish chicken beef eggs etc young didnt want eat anything else children often eat unhealthily get food need result physically mentally stunted let choose become vegetarians turn years old important decision par states like bihar jharkand science shown become athlete vegan diet found cost effective way source everything already perfect malnourished people also vegetarian states even vegan whole leftist argument used everywhere sangh shows blind delusional rest sangh anything remotely targets gujjus yeah must leftist propaganda left alright life choices eat want worship want cant say thing right wing think many people taking issue generalizing left sensitive illogical issues meat vs veg even kidding bihar disguise sikhs going canada left laborers coastal areas green thats awesome tbh rather protein deficient stats response thread generalising whole problem saying problem meat really want pull thread generalisation engage name calling like sanghis also generalising saying comments section reminded worrying trend india like malnutrition post reminded others sanghis thing non veg tabboo made home every day issue mfs save get bunglow wont invest food malnourishment measured gj america without guns drugs rrepostsleuthbot rrepostsleuthbot urepostsleuthbot ofc prolly least healthy diet yeah survey years old kutch north gujarat general majorly improved last years conditions unliveable dont speak logic say gujarat bad natil evedeya punjab mostly vegetarian yet green really vegetarianism religion need attack real reason welfare op rightly pointed map inline income inequality national average vegetarianism vegetarian people forcing others eat meat worse people forcing eat meat west bengalil ninnanu learnt malayalam like language im originally half bengali half odia im glad grew eating sea food wish cant handle fish except canned tuna haddock smell taste get even shellfish unless farm grown difficult ive tried years force get get used taste never worked unless fish super processed loves fish get restricted home see house yr parents brainwashed vegetarian used non vegetarian years ago health gone downhill since eat high carb diet wonder uncontrolled diabetes whats worse wine eating nonveg according im unhealthy hedonistic id say acquired taste something youll keep becomes alright kinda like beer please get real food belly making sense try salmon else mahi mahi hard find see frozen food suppliers like cambay tiger changing eat meat fish egg solve problems malnutrition health issues humans foremost apex predator earth ever produced homo sapiens ancestors world dangerous predators pre historic time barely tools descendants india specifically fighting eaten higher society birthing parents wretched wokeism entered india thousands years back consequences still felt day curious people bihar asks things perform really bad compared states across different categories ive salmon alaskan fresh eatas helped catch canned atlantic much becomes fishy yup try mahi mahi fishy bit harder find definitely good option people dont like fishy taste included try searching recipe panko macadamia nut crusted mahi mahi thank later funny mention beer growing uncle fathers friend would pass sip also says keep trying eat years didnt take lushing orotein family lain even get protein content gms vegetarianism clear redherring punjab one vegetarian states despite low malnutrition issue heart income inequality solve fix many issues malnutrition stunted development anemia women diabetes etc yes may creating meateating culture know uphill battle ultimately even worth fighting honestly much efficient subsidies healthier foods tax unhealthy doubt happen gujarat also major opportunity lab grown meat great business states much easier get around moral objections lab grown meat well meateating culture created meatproducing culture also created ie farmers livelihoods get tied people eating meat sole reason lab grown meat isnt produced west fact getting banned farmer lobbies powerful worth lot votes best introduce lab grown meat meateating culture gujrat bihar jhat koi nahi janta h veg costly gujarat really struggled find good non veg restaurants ahmedabad outer circle literally rikshavala type hygienic non veg food available south literally hard put overlay vegetarianism may give us good link malnutrition data showing protein deficiency indian diet general guess linked data effects malnutrition like stunted growth anything cause agree points one thing trying point humans always meat eating veg eating eatable veggies rare past humans mostly relied hunting food modified veggies fruits today invented agriculture reduce effort hunting veggies even hard digest natural humans eat meat veg omnivores culture trying prevent trying throw away something natural us fallen people rant meat eating breeds animals eggs dairy products zero respect people fights vegetarianism actively consume dairy products eggs vegans different breed altogether india measured tracking ratios carbohydrates proteins fats sample populations diet recent initiative start tracking think data shows bad picture need data anything problem punjab haryana lot dairy diet vegetarian necessarily bad balancing diet sources nutrition thier diet may developed easily available practical reasons like religion deciding diet blind faith deserves attacked red area lmao see point source information doesnt sound right macro ratio useful concluding anything nutrition means micronutrients right iron vitamins zinc etc tracking macros nutrients doesnt make sense macros could anywhere nutrient dense nutrient empty scale depending source hindu vegetarian recently embraced eggs cheap source protein eggs made compulsory schools understand lot people personal religious views growing children need make eggs compulsory grown man take sane decision want non vegetarian hamburgers agreed considering everyone hates kerala communism least aspect socialism working see punjab translate doesnt make sense itll google translate bro nutrition covers things first whether get enough calories get good balance macros finally whether get enough fresh vegetables fruits difficult get enough calories skip caloriedense foods like eggs amount people blaming vegetarian diet blatantly ignoring punjab even haryana appalling instead advocating non veg inclusion extremely tougher red states try adopting veg protein options like punjab atleast spell labourers right youre gon na prick tf cares shit posting platform aint giving exam gon na deduct marks lil bro northern karnataka know drought hit districts always neglected like common kerala w major w would increased jobs keralite need find ways increase job opportunities manga karyam parayumbo thenga karyam parayunnoda maybe facts hurt align political view implement throughout country necessary choose road religious people hurt route equally viable atheist dont wake thought hating religious people every morning understand practices objectively wrong vegetarianism veganism even due religion great people good dont think anyone else care whether charity profit religion like someone pointed dont control carbs sugar protein diet going save diabetes keralites notorious love tapioca absolutely terrible technology services available many religious people donate millions religion institutes none solves hunger poor unfortunate kid misfortune born big situation haryana haryana ehmmm keep children also beef nutritious nobody listened said beef nutritious think rice though love tapioca regular dish majority rice people rant meat eating breeds animals eggs dairy products zero respect people fights vegetarianism actively consume dairy products eggs vegans different breed altogether yeah dairy products moral issues well one step time one thing trying point humans always meat eating veg eating eatable veggies rare past humans mostly relied hunting food modified veggies fruits today yeah article httpswwwnationalgeographiccomfoodfeaturesevolutionofdiet good read agrees youre saying however humans agricultural diet k years eaten lot veggies time mainly huntergatherers plenty time adapt like years ago everyone pure meat eater theyre thrusting vegetarianism everyone meat veggies modified today culture trying prevent trying throw away something natural us fallen culture empathises sufferings animals good currently usually mean nonnutritious diet answer isnt kill animals lab grown meat available technology rest world startups currently aiming create labgrown meat tastes feels like meat india want opposite want labgrown meat look feel taste different real meat want sell vegetarian masses india really unique opportunity sector practically competition exists either malnutrition dieting theyre trying make gujrat supermodels yet highest life expectancy thats due high carb diet dude yet somehow managed higher life expectancy maybe health sector still households least diabetes patients theyre still live fullest less bothered eggs easier transport cook store cheaper diary compare much protein body gets easy source nutrition religious fanatics aggressively priority far wellbeing community malnourishment defined eating sea food child hood key u start liking sea food cheers parents forcing eat seafood childhood vegetarian unhealthy matter fact indians vegetarians non vegetarians carbitarians ever seen indians eating raw vegetables fruits daily basis zero masala salt eating habits kerala non vegetarian state people comparatively healthy yet also highest diabetesblood sugar patients respect population lol think vegetarianism equal rice chapati indian truly vegetarian non vegetarian hardly include vegetables fruits diet food full masala oil vegetarian non vegetarian carbitarians best p diabetes red meat regular sounds like nightmare stomach vegnon veg tbh cook vegetariannon vegetarian food full oil spices moreover hardly include raw vegetables fruits diet south w aspect takes major l comes diabetes heart diseases compared north precisely punjab ranks many non veg dominant states shut gujarat model state precisely south indian states suffer diabetes heart diseases supercool indian spotted lets assume eggs end solution nutrition india even though lentils cheaper per gram protein protein powder better absorption protein complete nutrition fibers etc matter indias data malnourished children literally food question insist forcing religious people consume eggs nutrition priority protein vitamin supplements everyone fine choose path least resistance insist eggs seems political statement genuine concern unhealthy religious people would like mention map shown first image takes reference nfhs report conducted since new survey conducted called nfhs two reports average stunting children went average heres latest report nfhshttpsmohfwgovinsitesdefaultfilesnfhsphaseiipdf overlap hindutva amazing tasty also clears roads eat week vegetarian month whose mushroom one forcing religious people eat eggs majority forced refrain healthy nutritious foods people dont want eat speak think something get accustomed yeah everything balanced yeah blue also confused noises wdym bro get eyes checked color blindness blue anywhere get eyes checked lol looking last image tbf jobs society deemed unacceptable goes athithi thozhilali oru vazhi nokkiyal nammuk tenga ind one wants got high standards even though lentils cheaper per gram protein protein powder better absorption objectively incorrect lmfao protein powder significantly expensive protein complete nutrition fibers etc matter indias data malnourished children literally food never said eggs compensates fibervitaminmineral consumption indians severely oriented deficient thats something needs addressed national family health survey nfhs data revelation national family health survey paints stark picture protein inadequacy india remarkably data exposes astonishing indian households fall short attaining recommended daily intake proteins since google insist eggs expecting someone afford daily meal protein supplement touch bullshit ive read day egg costs rs need eggs fulfill daily protein intake tell much would cost per serving precious protein powders might crack puzzle process oh youd need gmgm uncooked dal match gm dal costs rs even ready eat multiple bowls dal arent matching value money egg hope post comes rgujarat wont seen talk good stuff picking bad comments state talking dont need beef chicken enough hindus even tamil nadu dont eat beef new government working include pork school lunch mdm give one food item mean thats whole meal cases definitely dont option scheme bad yet successful reality check people poor indian lower class theyre desperate hate people aware easy access ration southern states massively helps map maharashtra example present documents bribes access privilege said alright presented option dont understand hate eating eggsbeing vegetarian presenting eggs sole nutritious option also could include supplemented salads mixed dal chawal tofu mdm would actually nutritious offer fruits etc even never sees light day would equally nutritious importantly solution sides agree mention plant based food always cheaper compared eggs resource strapped country thats basic thermodynamics fighting eggs feels like solving problem exist need nutritious food need funding funds eggs eggs really matter oh judging eat huh mean even tn left leaning state india tamilian trained believe hindus sure nah majority family vegetarians dont judge reason judge people region much fuzz create something simple meat consumption youd rarely ever find lunatics like south come said anything political party think leftists eat beef l think bjpians kerala dont eat beef whaat tamil friends im hearing first time tamilian yes im tamil common social media slowly creeping cinemas religion north indian different ariyan im dravidian divide politicislzed dravidian organizations even use proof hinduism imported tamil nadu industrial site religious vestegious would found sarounding cities living areas hindu keyword conservative muslims seen keralakeralas enlightenment didnt reach minorities seen ex muslims growing talked clubhouse every see india hindus progressive like varying percentage muslims didnt get touched progressive ideas always gujarat model artificial fuckery stir controversy left leaning parties would argue deter muslims parents sending children school like hijab know people sub punjab ngl rare nonetheless welcome andhra pradesh w objectively incorrect lmfao protein powder significantly expensive said lentils cheaper cant read lmfao must even realise heavily eggs subsidised protein powder better absorption anyways typed long reply explaining stuff realised literally read comprehend written check sources written shady guy remotely dietician many googleable factual errors answer irony lol httpsmediumcomnaveenunveilingtheproteindeficiencychallengeinindiaacloserlookatalarmingstatisticsbdaaccehttpsmediumcomnaveenunveilingtheproteindeficiencychallengeinindiaacloserlookatalarmingstatisticsbdaacce nowhere mention eggs option couldnt stick point theres expecting someone afford daily meal protein supplement touch bullshit ive read day expecting person stay full entire day eggs probably touch bullshit ive read year guess lot eggs inside head need clear india vegetarian country point highlighted states vegetarian expecting person stay full entire day eggs oh dumbassery assumed suggested surviving eggs entire day opposed surviving whole day gm dal cant figure drew conclusion bad thought functioning brain nowhere mention eggs option specifically asked insisted eggs dont understand managed confuse something said theres must even realise heavily eggs subsidised okay people still get cheaper rates kind braindead take lmfao many googleable factual errors answer irony lol literally every single information typed googling details would know fuckall haha surprised punjab haryana india poor perspective good diet means matter vegetarian nonvegetarian average indian diet loaded carbs fats sugar coupled laziness zero attention physical health malnutrition common high carb diet lack exercise nothing eating meat lol first need something eat inorder diabetic amiryt think nonveg diet lead problems thats dont want eat meat dont stop shaming boycotting family meat consumption omnivores herbivores hell carbitarian pesticide laden veggies fruits shouldnt eaten raw first place contrary general consensus cooking generally improves nutritional availability foods diabetes kerala due high carb diet especially eating lot rice daily anything reduce carbs eating meat veggies lmao said nutrition means micro nutrients thats secondary macros anyday know highlighted states higher vegetarian population average state every child malnourished hence comparable vegetarian population lower income please explain cowbelt malnourished better diabetic malnourished amiryt also highest life expectancy lol shouldnt worrying malnourished kids region single sheet paper cant decide condition nation anti beef retardation one stupidest ideas makes indians laughing stock cow piss drinkers called saddest part untrue chetta oru plate beef fry ulli sura would like word like chad kerala rampant poverty administrative malpractice probably play big roles hunch probably accurate hunch punjab vegetarians per rata indian states seems fine graph meanwhile less people bihar vegetarians state still red af problem job creation needs land mineral resources able create manufacturing hubs kerala extremely densely populated natural agricultural resources got rid make mines hubs sort mega infrastructure project ecological reasons really dont think killing crops deforestation even need country global warming shit rather nation gulfies remittance economy starved polluted broken lands point country allot infrastructure projects according land layout resources available central govt consistently failed state govts heavy work regard south indian states mineral resources barren non agricultural lands actually managed mention infrastructure projects connecting places within states well importantly least highly aware educatedskilled population means lot easiness migrate meaning remittances made sorry confusing non government research paper nfhs survey mpi report mpi report consider anything bmi weight national mpi report httpswwwgooglecomurlsatsourcewebrctjopiurlhttpswwwnitigovinsitesdefaultfilesnationalmpiindiapdfvedahukewjxettykaxxonqbhqqbhkqfnoecbyqaqusgaovvawstkmrblsribswachu page nutrition indicator explained sorry confusing non government research paper nfhs survey mpi report mpi report consider anything bmi weight national mpi report httpswwwgooglecomurlsatsourcewebrctjopiurlhttpswwwnitigovinsitesdefaultfilesnationalmpiindiapdfvedahukewjxettykaxxonqbhqqbhkqfnoecbyqaqusgaovvawstkmrblsribswachu page nutrition indicator explained think job opportunities kerala relatively less way less industrial hubs proportional educated population tbh many even regular population almost states good jobs almost always bustling metro capital huge finance hubs core industrial manufacturing towns tn karnataka maharashtra examples need geographical resources make happen also kerala tn eat week actually beef access make eating meat lot cheaper actually surprise surprise dhokla nutritional value fish lovin beef lovin pork lovin mutton lovin importantly nutrition lovin beef really isnt go punjab lower malnutrition kerala dont eat beef color blind chance shows districts kerala low malnutrition one district punjab whole ig one district lower every punjab indeed better ah bad geography maybe statistics well agree points depending remittances gon na work anymore people migrating western countries gulf allows getting pr staying thus people buildingbuying houses instead sending money build kerala kerala gon na bad bad time future need seriously increase electronic pharma companies requires lower land decentralised cant afford city like bangalore roads small land already densely packed meant need bash kerala post state clearly performs good post even kerala one said kerala perfect appreciate good things thats happening like scolding kid race lost exam last month valid like economy dire condition well like th largest gdp per capita youth wanting even better life claim none yellow part kerala even one yellow doesnt put punjab actually half portion yellow kerala keralatamil nadu dam passes yes put punjab even ignore data punjabis lives avg malayalee lmao region also tops literacy sad got left behind huh carbitarian fancy term invented p also wanted say hardly include salads fruits diet population surviving carbs carbs carbs shouldnt call vegetarian sorry brother offense beef comment supposed joke sorry wasnt good one didnt even got offended ok ask might biased seen many people saying dont need hospital school etc issues like inflatration religion bigger thing kabka census h nai pata hota toh muh band karke bhaita karo nai pata hota toh muh band karke bhaita karo jey chomotkar google translate zindabad liked labourers laborers brit spelling rarity days magic mushrooms really fine least tried cow belt called cow belt reason",
    "light_cleaned_title": "Child malnourishment in Gujarat is fact.",
    "light_cleaned_selftext": "Gujarat is as per with states like Bihar or Jharkhand in terms of malnourishment among children. The state and central govs are of same party for a long time. Gujarat is one of the highest tax paying state of India. But this results mark the questions on people wellfare and where the people's money is going.",
    "light_cleaned_comments": "Average GOA W🗿 ##Correct me if I am wrong It's pretty bad for Goa imo, goa's population is nearly 16 Lakhs and having 20-30% of child malnutrition is wild Vegetarian state, of course I think the main issue is vegetarianism. And I can guarantee you that most if not all those who are malnourished are migrants who are brought in by our politicians for votes and who cannot afford one kid but have minimum four. Goa is the only state of India where natives are way less than the migrants. Kerala always Tops Major W for kerala. Surprised that coastal odisha and capital is doing so well in child welfare compared to the rest of the state. Coastal Odisha has been the biggest beneficiary of state government priorities (The BJP government). Indian diet in general Kerala ✨ Meanwhile Punjab be like , hunger ? Malnourishment ? Wtf is that ? corruption Follow it India. You have to reach that level by tooth and nail. After all it is Gujarat Model. r/usernamechecksout As a Malayali all I can say is I'll continue eating my beef (for all the sanghis about to have a meltdown reading my comment, yes I will also be eating pork). Gujju gang can continue eating their sugar and carb rich diet with almost non existent protein content for the rest of their lives. Coastal region are mostly green, probably due to eating habits which include fish in diet which is good source of protein and other nutrients. haryana is a predominantly vegetarian state btw. Those critical districts in Karnataka contains a large sections of Lingayat communities who are influenced by their Lingayat seers who also wield a lot of power in Karnataka politics too. And these asshole seers have been actively protesting the inclusion of eggs in the mid-day meals. It shows that they care more about their religion more than the health of the children. Western Odisha is green too, child malnourishment depends more on factors like economic and social development. It is an undeniable fact that GoO is biased towards Eastern Odisha. Lekin bro voh masjid ke neeche mandir ? Malayali ano ? 😅 Nice one Everyone in India cares more about religion that anything else. Shining gujjurat Hahaha. Piraud momant saar 🫡 I used to think the left was logical. The obvious inference from this is mismanagement and of course religious involvement. But to think that the only reason is protein deficiency and that only meat can solve this during a 1. Climate crisis that is exacerbated by meat farming 2. Knowing full well that science has shown that one can become an athlete and live long with a full vegan diet goes to show how ignorant even the left is I realise they would rather hate on the sanghis even at cost of sounding illogical like them. Again I am not saying we should stop meat or whatever. But come on. We can’t deny we need to change our consumption ways and actually encourage anyone trying to save the world by going vegan. Honestly, even if Indians eat non vegetarian, they don't truly benefit by a big margin because most of them (in the northern side, at least) eat it only once a week or so. India is in dire need of protein awareness. we should make gujarat more red This is not about meat eaters and non meat eaters. This about people denied their rights and gov doing nothing in the sensitive issues like this. This is about saving our children. Why do you think PM eats MUSHROOMS! Does India even acknowledge the extreme over population issues instead of blaming stuff like “vegetarian region”, “poverty” etc ? Does the government and people even talk about the over population issues ? Coastal areas will usually have better nutrition than the same inland areas since seafood is highly nutritious and the ocean is extremely productive. Can't they just catch a fish and label it plant based plant meat Religion trumps Protein. Mfks be eating Maida and rawa for 7 days and want everyone to stop eating eggs and meat. Vegan protein is extremely expensive if you want it to approach the quality of animal protein. Unless you’re extremely good at meal planning, you’re going to need to eat either heavily processed plant protein - which much of india doesn’t have access to - or massive amounts of carbs and calories to meet a protein requirement. I’m not saying veganism is bad, it’s objectively better for the environment and reduces suffering of animals when compared with an omnivorous diet… but it’s extremely restrictive. In India we have a child malnourishment problem. The climate issue is massive, but India’s per capita contribution is minuscule compared to much of the world and frankly the health of Indian children matters more than a small increase in our contribution to climate change. labours from other states Cowbelt ☕ You may diss Kerala for it's government. But communism and INC in it early years is what made Kerala ace these parameters. ANTI NATIONAL BRO YOU ARE. JAI HIND JAI MATA DI. IN GUJARAT WE DON'T MIX WATER IN SAMBHAR NOR JUST GIVE SALT TO EAT WITH RICE. /s Hoii major credit goes to this dumbfucks digambar kamat and pramod savant Ahem! Once a week? Maybe in the north. Everyone I know eats fish on a daily basis. Maybe chicken/beef/pork twice a week. Again I agree with all you said. The transformation has to be gradual and till then children health should be projected. My beef (pun intended) was with those being proud of their meat eating because sanghis are morons. I fear the left in India is becoming what is hates just with new gods (beef, pork etc etc)…. The problem is this binary thinking. It's the damn religious vegetarianism that hurts the kids. This is a conspiracy by Soros. Everything is well in Ramrajya/s How does hyderabad have medium prevalence? Even in south too except Kerala. Chicken is usually eaten only once a week by most Indians since they can't afford it more than once weekly. Well both care more about nagpur Veganism or vegetarianism is a major issue for causing these problems. If atleast these people were non vegetarian some of these issues could have been resolved to some extent. And when i say being non vegetarian, i mean those people should have atleast non veg 3 or 4 days. It aint that cheap but being vegetarian and nutrient and protein sufficient is next to impossible in india being a vegetarian. They think mutton is beef and then you want to do this Yeah good luck with that approach. An athlete being a vegetarian has lots of money to get his protein and nutrients from plant sources. Even though its more bad to the environment he can sustain that stupid approch because of his wealth. Thats not the case with common people. That’s a fair perspective actually as I do see too many Indians jumping straight to the other side like “I’m going to eat all the meat, LMAO!” It’s also wrong and dumb. *BJD Government(The new Govt. is just 4-5 months old and it took years altogether for the previous govt. To achieve this) Understand something, the kids are stunted due to lack of calories. The govt has failed to create the basic supply chain to feed the kids. The govt magically supplying eggs and meat to the kids is not going to solve the problem. Sorry, I meant the BJD government Kutch in gujarat is shown as very highly malnourished whereas it has the highest per capita income (district) in gujarat . Something is off about this data. How dare you talk shit about Ameryca of India /s On Gujarat's malnutrition, one famous person once said, \"[Gujarat's malnutrition due to figure-conscious girls](https://www.indiatoday.in/india/story/go-figure-figure-conscious-gujarati-girls-cause-malnutrition-in-the-state-says-modi-114703-2012-08-28)\". \"Gujarat is also a middle-class state. The middle-class is more beauty conscious than health conscious.\" \"If a mother tells her daughter to have milk, they'll have a fight. She'll tell her mother, \"I won't drink milk. I'll get fat.\" Keep coping. Malnourishment and Stunting seems to be major concern for North and Western India.🇮🇳 Gujarat's got problems. But I'm pretty sure its not as simple as \"eat more meat bro\" that most of the idiots here seem to think is the problem. I'm so glad I grew up eating sea food and red meat on the regular. Kerala W with our fish loving population. 😎 Delulu is the solulu The amount of blind dislikes without arguing in the validity of my comment shows how sensitive the left has become of its stances that it is scared of challenging itself. at this point India’s left is as religious as the right. Religious about atheism religious about meat religious about anything against the right. P It's like the more malnourished these seers are the more stupid decisions they make. Yeah who would've thought right? 🤡 Literally going to hamper brain development and growth. But if living in misery was an Olympic level sport then these losers would top it. Children are very fussy eaters and sometimes you cannot force just a narrow diet onto them. My own daughter went through periods of only eating fish, chicken, beef, eggs etc when she was young and didn't want to eat anything else. And children will often just eat unhealthily if they cannot get the food they need - the result is they will be both physically and mentally stunted. Let them choose to become vegetarians after they turn 18 years old if it is important to them and it can be their own decision. \"on par with states like bihar and jharkand\"💀 Science has shown you can become an athlete with just a vegan diet but have you found a cost effective way to source everything? If it was already perfect then why are some of the most malnourished people also from vegetarian states (not even vegan). This whole \"leftist\" argument being used everywhere by the sangh shows how blind and delusional you and the rest of the sangh are. Anything that remotely targets Gujjus? Yeah that must be leftist propaganda 🤡 The left is alright with your life choices. Eat what you want and worship whom you want. Can't say the same thing about the right wing. I think many people are taking more issue with your generalizing about the left being sensitive and illogical than your issues on meat vs veg. am not even kidding , it is UP BIHAR in disguise , all sikhs going to canada and we are left with laborers All the coastal areas are green. That's awesome tbh. Rather a protein deficient stats. In response to a thread that is generalising a whole problem as saying it is a problem because of meat. And do we really want to pull that thread on generalisation when we ourselves engage in name calling like sanghis that are also generalising. All I am saying is the comments section reminded me of a worrying trend in India just like this malnutrition post reminded others or sanghis thing is where non veg is not tabboo or made at home every day this is not an issue. mf’s will save to get a bunglow and won’t invest in food How is malnourishment measured? GJ - America without guns and drugs R/RepostSleuthBot r/RepostSleuthBot u/RepostSleuthBot ofc we prolly have the least healthy diet yeah this survey is 10 years old and Kutch and north Gujarat in general has majorly improved in last 10 years, before that conditions were unliveable there, but don't speak logic here just say Gujarat bad Natil evedeya Punjab is mostly vegetarian and yet green. Is it really vegetarianism and religion that you need to attack here ? The real reason is welfare as OP rightly pointed out. The map is inline with income inequality. National average for vegetarianism is 29%. UP itself is 47% vegetarian. People forcing others to eat meat are as worse as the people forcing them to not eat meat. West Bengalil ninnanu... I learnt malayalam because I like this language. I'm originally half Bengali- half Odia > I'm so glad I grew up eating sea food I wish I did. I can't handle most fish except for canned Tuna and haddock. The smell and taste just get to me. Even with shellfish, unless it's farm grown, it's difficult. I've tried over the years to force myself to get get used to the taste but it's never worked unless the fish is super processed. My SO loves most fish but we get restricted at home because of me. i see this in my own house yr. My parents are so brainwashed about being vegetarian ( we used to be non vegetarian 10 years ago ). Their health has just gone downhill since then. All they eat is high carb diet and they wonder why they have uncontrolled diabetes. What's worse is that they wine about me eating nonveg. According to them I'm being unhealthy and hedonistic. 🗿 I'd say it's an acquired taste and something you'll have to keep having until it becomes alright. Kinda like beer. please get some real food in your belly, you are not making sense Try salmon or else mahi mahi (hard to find but see if frozen food suppliers have like cambay tiger) It's changing Just eat Meat 🍖 or Fish 🐟 or Egg 🥚 and it will solve all the problems of Malnutrition & other health issues. Just Humans are the foremost APEX PREDATOR that earth has ever produced & Homo sapiens Ancestors won the world from dangerous PREDATORS in pre historic time with barely any tools. And now their descendants in india specifically, are fighting on what should be eaten or not & who are higher on society by their birthing parents. Such wretched wokeism entered india thousands years back, that it consequences are still felt to this day. 😢 I am CURIOUS why people in UP and Bihar asks for these things, they perform really bad compared to other states across different categories I've had Salmon. Alaskan fresh I can eat(As in I helped catch it). Canned and Atlantic not so much. it becomes too \"fishy\". Yup then try the mahi mahi. It’s not fishy at all. It’s a bit harder to find but it is definitely a good option for people who don’t like the fishy taste (myself included). Try searching a recipe for panko and macadamia nut crusted mahi mahi and thank me later :) Funny you should mention beer. THAT I did have here and there growing up when an uncle or father's friend would pass me a sip. My SO also says to keep trying to eat it. And I have over the years but it didn't take. I have been lushing orotein to family. Its a lain to even get their protein content to 20 gms. Vegetarianism is a clear red-herring here. Punjab is one of the most vegetarian states, despite that it has low malnutrition. The issue at heart is income inequality, solve that and you fix many issues: malnutrition, stunted development, anemia in women, diabetes etc. Yes, it may be by creating a more meat-eating culture, but we all know that is an uphill battle that is ultimately not even worth fighting. It's honestly much more efficient to subsidies healthier foods and tax the unhealthy (but I doubt that can happen in gujarat) There is also a major opportunity here: lab grown meat will do great business in these states. It will be much easier to get around the moral objections with lab grown meat as well. Once a meat-eating culture is created, a meat-producing culture is also created, ie farmers\" livelihoods get tied with people eating meat. This is the sole reason why lab grown meat isn't being produced in the west (in fact, it's getting banned). Farmer lobbies are powerful and worth a lot of votes, so it's best to introduce lab grown meat before there is a meat-eating culture. 😍 যে চমৎকার Gujrat 🤡 Bihar🤡 Jhat koi nahi janta h 🤡 Veg is costly in gujarat itself.. Really struggled to find any good non veg restaurants in ahmedabad outer circle. Literally Rikshavala type hygienic non veg food s available here. 🤐 Being from the south, that was literally very very hard to put up with നുമ്മട ഫുഡ്‌.. Overlay with vegetarianism may give us a good link for the malnutrition, there was other data showing protein deficiency in the Indian diet in general. I guess the linked data is the effects of malnutrition like stunted growth. Is there anything with the cause? I agree to your points. One thing that i am trying to point is humans have always been more meat eating than veg eating. Eatable veggies were very rare in the past and humans mostly relied on hunting for food. We modified the veggies and fruits for what they are today. We invented agriculture to reduce the effort of hunting and veggies are even hard to digest. So it is very natural for humans to eat meat than having veg. We are omnivores. This is what the culture here is trying to prevent. Its trying to throw away something that is very natural to us and most have fallen for it. And these same people who rant about meat eating breeds animals for eggs and dairy products. I have zero respect for the people who fights for vegetarianism and actively consume dairy products and eggs. Vegans are a different breed altogether. In India it is measured by tracking the ratios of carbohydrates, proteins and fats in a sample population's diet. It is a recent initiative to start tracking this 2023 I think. This data shows a bad picture, but we need this data to do anything about the problem. Punjab and Haryana will have lot of dairy in their diet. Being vegetarian is not necessarily bad if you are balancing your diet with other sources with same nutrition. Thier diet may be developed because of what is easily available and practical, other reasons like religion for deciding diet with blind faith deserves to be attacked. Red area 🫥 Lmao I see. Can you point me to a source of this information? Doesn't sound right to me. How can that macro ratio be useful in concluding anything? Nutrition means micronutrients, right? Iron, vitamins ,Zinc etc . Tracking macros nutrients doesn't make any sense. Each of the macros could be anywhere on the nutrient dense to nutrient empty scale, depending on the source I am a Hindu and vegetarian, but I have recently embraced eggs. They are a cheap source of protein. Eggs should be made compulsory in schools. I understand a lot of people have their personal religious views, but for growing children, we need to make eggs compulsory. A grown man can then take a sane decision if they want to be a non vegetarian or not. And hamburgers Agreed Considering everyone hates on Kerala and it’s communism, at least in this aspect, socialism is working. see again Punjab? Did you translate it 😂 ? যে doesn't make sense here it'll be কি চমৎকার Google translate bro Nutrition covers all the things. First whether you get enough calories, then if you get a good balance of macros and finally whether you get enough fresh vegetables and fruits. It's difficult to get enough calories when you skip calorie-dense foods like eggs. The amount of people blaming vegetarian diet while blatantly ignoring Punjab and even Haryana is appalling. Instead of advocating for non veg inclusion, which is extremely tougher, the red states can try adopting more veg protein options like Punjab. Atleast spell “labourers” right if you’re gonna be a prick who tf cares on this shit posting platform. I aint giving any exam. You are not gonna deduct any marks lil bro What is up with Northern Karnataka? I know they are drought hit districts but have they always been neglected? More like common Kerala W. A major W would be if it increased its jobs . As a Keralite, we need to find ways to increase job opportunities Manga karyam parayumbo thenga karyam parayunnoda? Or maybe facts hurt and they do not align with your political view. So why not implement it throughout the country ? Why is it necessary to choose a road where religious people are hurt, when the other route is equally viable ? I am an atheist myself, but I don't wake up with the thought of hating religious people every morning. I understand some practices are objectively wrong. But vegetarianism / veganism, even if it is due to religion is great. If people do good, I don't think anyone else should care, whether it is for charity, profit or religion. Like someone pointed out, if you don’t control carbs and sugar, protein diet is not going to save you from diabetes. And Keralites are notorious for their love of tapioca. Absolutely terrible that we have such technology and services available, and so many religious people who donate millions to religion institutes, and none of that solves the hunger of a poor unfortunate kid who had the misfortune of being born in a big situation. Haryana? Haryana? Ehmmm Why keep having children then? Also beef is nutritious 🤷🏻‍♂️ Nobody listened when we said beef is nutritious 🤷🏻‍♂️ I think its rice though. We love tapioca but its not a regular dish for the majority. Rice is. > And these same people who rant about meat eating breeds animals for eggs and dairy products. I have zero respect for the people who fights for vegetarianism and actively consume dairy products and eggs. Vegans are a different breed altogether. Yeah dairy products have moral issues as well but one step at a time. > One thing that i am trying to point is humans have always been more meat eating than veg eating. Eatable veggies were very rare in the past and humans mostly relied on hunting for food. We modified the veggies and fruits for what they are today. Yeah, this [article ](https://www.nationalgeographic.com/foodfeatures/evolution-of-diet/) is a good read and agrees with what you're saying. However, humans have been on an agricultural diet for over 10k years, we have eaten a lot more veggies in this time than when we were mainly hunter-gatherers, so this has been plenty time to adapt. It's not like before 5 years ago everyone was a pure meat eater and now they're thrusting vegetarianism on everyone. Both meat and veggies have been modified for what they are today. > This is what the culture here is trying to prevent. Its trying to throw away something that is very natural to us and most have fallen for it. This culture empathises with the sufferings of animals. That is good. Currently it usually does mean a nonnutritious diet, but the answer isn't to kill animals when lab grown meat is an available technology. In the rest of the world, startups are currently aiming to create lab-grown meat that tastes and feels like meat. In India, you want the opposite, you want the lab-grown meat to look, feel and taste as different as real meat if you want to sell it to the vegetarian masses, this is why India is a really unique opportunity in this sector and practically no competition exists here either. It's not malnutrition. It's dieting. They're trying to make Gujrat supermodels. Yet we have highest life expectancy That’s due to high carb diet dude. Yet somehow managed to have higher life expectancy maybe that same because of the health sector but still most of the households here have at least 1 diabetes patients but they’re still live their fullest less bothered Because eggs are easier to transport, cook, store and are cheaper than diary, if we compare how much protein our body gets from them. It's a very \"easy\" source of nutrition that religious fanatics are so aggressively against because their priority is far from the wellbeing of the community. How is malnourishment defined here ? eating sea food from child hood is the key after 20s u cannot start liking sea food cheers to my parents for forcing me to eat seafood at childhood Being vegetarian is not at all unhealthy. Matter of fact, most Indians are not vegetarians or non vegetarians. They are 'carbitarians'. Ever seen Indians eating raw vegetables and fruits on a daily basis with zero masala and salt? It's our eating habits. Kerala is a non vegetarian state and people are comparatively healthy and yet they also have the highest diabetes/blood sugar patients with respect to population. Lol! They think vegetarianism is equal to rice and chapati. No Indian is truly vegetarian or non vegetarian. We hardly include vegetables and fruits in our diet. Our food is full of masala and oil, be it vegetarian or non vegetarian. We are carbitarians at best. :p \\*in diabetes. Red meat on the regular sounds like a nightmare for my stomach🥲 It's not about veg/non veg tbh. It's about how we cook. Be it vegetarian/non vegetarian, all our food is full of oil and spices. Moreover, we hardly include raw vegetables and fruits in our diet. That is why South being a 'W' in this aspect takes a major 'L' when it comes to diabetes and heart diseases compared to the North. Precisely why Punjab ranks above so many non veg dominant states. Shut up, gujarat is model state 🥰 And precisely why all South Indian states suffer from diabetes and heart diseases. Supercool Indian spotted. Let's assume eggs are the end all be all solution for nutrition in India. ( Even though lentils are cheaper per gram of protein, protein powder has better absorption, and protein itself is not complete nutrition, fibers etc matter too and India's data for malnourished has children with literally no food at all ) My question is, why insist on forcing religious people to consume eggs ? If nutrition is the priority why not protein and vitamin supplements which everyone is fine with ? Why not choose the path of least resistance? Why *insist* on eggs ? Seems more of a political statement to me than a genuine concern for unhealthy religious people. I would just like to mention that the map shown in the first image takes reference from NFHS-4 report which was conducted in 2015-2016, since then a new survey has been conducted in 2019-2021 called NFHS-5. Between the two reports average stunting in children went from an average of 38.4% to 35.5%. Here's the latest report as of 2024: [NFHS-5](https://mohfw.gov.in/sites/default/files/NFHS-5_Phase-II_0.pdf) The overlap with Hindutva is amazing. ... and tasty. It also clears the roads. > eat it only once a week or so I am vegetarian about once a month Whose mushroom? No one is forcing religious people to eat eggs. But why should the majority be forced to refrain from healthy nutritious foods if a few people don't want to eat it? Speak for yourself Think it's something you get accustomed to. But yeah everything has to be balanced Yeah some of them are blue also Confused noises Wdym bro you should get your eyes checked for color blindness. there is no blue anywhere. You should get your eyes checked 🤣 lol, i was looking at the last image. Tbf we have jobs, it's just the society deemed it unacceptable which goes to athithi thozhilali. So oru vazhi nokkiyal nammuk tenga ind but no one wants it We just got high standards >Even though lentils are cheaper per gram of protein, protein powder has better absorption, This is objectively incorrect LMFAO. Protein powder is significantly more expensive. >and protein itself is not complete nutrition, fibers etc matter too and India's data for malnourished has children with literally no food at all I never said eggs compensates for fiber/vitamin/mineral consumption. Indians are severely oriented deficient and that's something that needs to be addressed. >National Family Health Survey (NFHS) Data: The revelation from the National Family Health Survey-4 (2015–16) paints a stark picture of protein inadequacy in India. Remarkably, this data exposes that an astonishing 73% of Indian households fall short of attaining the recommended daily intake of proteins Since you cannot Google. >Why *insist* on eggs ? You expecting someone who cannot afford a daily meal to have protein supplement has to be the most out of touch bullshit I've read all day. 1 egg costs 6rs You need 3 eggs to fulfill your daily protein intake Tell me how much it would cost per serving of your precious protein powders and you might just crack this puzzle in the process. Oh and you'd need about 90gm-100gm of UNCOOKED dal to match that. 100gm dal costs 30rs so even if we are ready to eat multiple bowls of dal, we aren't matching how value for money egg is. I hope this post comes in r/gujarat . But it wont. I have seen them only talk about the good stuff and picking up bad comments about their state and talking about it. Don't need for beef ,chicken is enough , most Hindus even in Tamil nadu don't eat beef How is new government working ? So we can include pork in school lunch ? In MDM they give you just one food item. I mean that's it. Not a whole meal. In most cases you definitely don't have an option. Been through that. The scheme is that bad and yet so successful. Should be a reality check for people on how poor the Indian lower class is that they're desperate for that. I hate that most people here are not aware how easy it is to access ration in Southern states which massively helps this map. In Maharashtra for example you have to present 25 documents and 7 bribes to access this privilege. That said, I am alright with it being presented as an *option*, but I don't understand the hate for not eating eggs/being vegetarian and presenting eggs as the sole nutritious option. You also could include supplemented salads or mixed Dal chawal with tofu in MDM which would actually be nutritious, offer fruits etc but even that never sees the light of day. Would be equally nutritious if not more. Most importantly this is a solution both sides agree to ! Not to mention plant based food will always be more cheaper compared to eggs in a resource strapped country. That's just basic thermodynamics. Fighting for eggs feels like solving a problem that does not exist. You need more nutritious food? Need funding. If you have the funds, eggs no eggs does not really matter. Oh so now we are judging on what we eat. Huh. What do you mean by \"even in TN\"? Most left leaning state in india. Most tamilian are trained to believe they are not Hindus Sure Nah. The majority of my family are vegetarians themselves. I don't judge them. The reason I judge people in this region is because of how much of a fuzz they create over something as simple as meat consumption. You'd rarely ever find lunatics like that down South. What? Where did that come from😅. Who said anything about any political party. Do you think only leftists eat beef l? Do you think BJPians in Kerala dont eat beef? Whaat? I have tamil friends and Im hearing this for the first time. Are you a tamilian yourself? Yes I'm Tamil , it very common in social media slowly creeping into cinemas , your religion (North Indian ) is different ,your Ariyan I'm Dravidian divide is very politicislzed by Dravidian organizations. They even use கீழடி as proof Hinduism is imported into Tamil Nadu. But கீழடி is industrial site most religious vestegious would be found sarounding in cities or living areas Hindu is keyword here ,most conservative Muslims I have seen are in kerala.Kerala's enlightenment didn't reach its minorities. But have seen ex Muslims growing have talked to some in clubhouse. Every where you see in india ,its Hindus are progressive like these in varying percentage. But Muslims didn't get touched by these progressive ideas . It always was. Gujarat model is artificial fuckery. It will stir controversy, left leaning parties would argue it will deter Muslims parents sending their children to school like hijab. I know you or people in sub is not against it So does punjab ngl RARE BUT NONETHELESS WELCOME ANDHRA PRADESH W >This is objectively incorrect LMFAO. Protein powder is significantly more expensive. I said lentils are cheaper you can't read ? LMFAO. You must not even realise how heavily eggs are subsidised do you ? >protein powder has better absorption Anyways I typed a long reply explaining stuff, but then I realised you literally cannot read or comprehend what I have written above or check your sources written by some shady guy who is remotely not a dietician. There are so many googleable factual errors in your answer, the irony lol. [https://medium.com/@Naveen23/unveiling-the-protein-deficiency-challenge-in-india-a-closer-look-at-alarming-statistics-b40da5a16cce](https://medium.com/@Naveen23/unveiling-the-protein-deficiency-challenge-in-india-a-closer-look-at-alarming-statistics-b40da5a16cce) Nowhere did I mention eggs to not be an option did I ? But you couldn't stick to the point. So there's that. >You expecting someone who cannot afford a daily meal to have protein supplement has to be the most out of touch bullshit I've read all day. Expecting a person to stay full for an entire day on eggs probably is the most out of touch bullshit I've read all year. Guess you have a lot of eggs inside your head you need to clear. India is not a vegetarian country. That was my point. Nor* those highlighted states are vegetarian >Expecting a person to stay full for an entire day on eggs Oh your dumbassery assumed I suggested surviving on 3 eggs for an entire day. As opposed to what, surviving a whole day on 100gm of dal? I can't figure out how you drew that conclusion out. My bad, I thought you had a functioning brain. >Nowhere did I mention eggs to not be an option did I ? You specifically asked why I insisted on eggs. I don't understand how you managed to confuse yourself with something you said. So there's that. >You must not even realise how heavily eggs are subsidised do you ? Okay? People still get it at cheaper rates? What kind of braindead take is this LMFAO >There are so many googleable factual errors in your answer, the irony lol. Literally every single information I typed out was after googling the details up but you would know fuckall about that haha Surprised about Punjab and Haryana India has a very poor perspective on what a good diet means. No matter vegetarian or non-vegetarian, the average Indian diet is loaded with carbs, fats and sugar. Coupled with laziness and zero attention to physical health, malnutrition is very common. High carb diet and lack of exercise. It has nothing to do with eating meat lol. First, you need to have something to eat inorder to be diabetic amiryt Why do you think so? Does non-veg diet lead to those problems? Thats what, if you dont want to eat meat. Then dont, stop shaming or boycotting the family over meat consumption we are omnivores not herbivores What the hell is a carbitarian? Our pesticide laden veggies and fruits shouldn't be eaten raw in the first place. And contrary to general consensus, cooking generally improves nutritional availability in foods. Diabetes in Kerala is due to high carb diet, especially eating a lot of rice daily, if anything they should reduce carbs and should be eating more meat and veggies. Lmao, who said to you nutrition means just micro nutrients? That's secondary to macros anyday You do know that the highlighted states have higher vegetarian population than the average state and not every child is malnourished hence it will be comparable to the vegetarian population with lower income Then please explain. Why is most of the cowbelt so malnourished? Better to be diabetic than being malnourished, amiryt. Also we have highest life expectancy, lol. Shouldn't you be worrying more about the malnourished kids in your region? A single sheet of paper can't decide the condition of my nation! This anti beef retardation is one of the stupidest ideas which makes Indians a laughing stock. “Cow piss drinkers” is what we are called and the saddest part is that it’s not untrue. Chetta, oru plate beef fry Ulli Sura would like to have a word When will we be like CHAD KERALA? 🔥🐐🚩 Rampant poverty and administrative malpractice probably play big roles. Just a hunch, but probably an accurate hunch. Punjab has more vegetarians per rata than most other Indian states and it seems to be doing fine in the graph. Meanwhile, less than 10% of the people in Bihar are vegetarians, but that state is still red af. The problem with Job creation is that it needs land and mineral resources for being able to create IT/ Manufacturing hubs. Kerala is extremely densely populated with natural and agricultural resources which cannot be got rid of to make mines , Hubs or any sort of mega infrastructure project for ecological reasons . I really don’t think killing crops and deforestation is what we even need as a country with all this global warming shit 😀. I rather a nation of gulfies with remittance economy than starved , polluted and broken down lands. And the point of being a country is that we allot infrastructure projects according to the land layout and resources available. But central govt consistently failed to do that and this is why state govts are doing the heavy work in this regard. Other South Indian states with more mineral resources, barren non agricultural lands and what not have actually managed to do this not to mention infrastructure projects connecting the places within states well. More importantly at least a highly aware and educated/skilled population means a lot more easiness to migrate meaning more remittances can be made. I am very sorry, I was confusing a non government research paper with the NFHS survey and MPI report. The MPI report does not consider anything other than BMI and weight. [National MPI report 2021](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.niti.gov.in/sites/default/files/2021-11/National_MPI_India-11242021.pdf&ved=2ahUKEwj5xeTT2Y2KAxXonq8BHQQBHK4QFnoECBYQAQ&usg=AOvVaw15-Stkm-rBLsriBsWAcH8U) On Page 16, the Nutrition Indicator is explained. I am very sorry, I was confusing a non government research paper with the NFHS survey and MPI report. The MPI report does not consider anything other than BMI and weight. [National MPI report 2021](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.niti.gov.in/sites/default/files/2021-11/National_MPI_India-11242021.pdf&ved=2ahUKEwj5xeTT2Y2KAxXonq8BHQQBHK4QFnoECBYQAQ&usg=AOvVaw15-Stkm-rBLsriBsWAcH8U) On Page 16, the Nutrition Indicator is explained. I think job opportunities in Kerala is relatively less because there are way less IT/ Industrial hubs in proportional to the educated population ( which tbh is too many ) or even regular population. Almost all states with good jobs almost always have a bustling metro / capital with huge IT / finance hubs and some core industrial/ manufacturing towns ( TN, Karnataka and Maharashtra as examples ) . This does need geographical resources to make it happen also In Kerala and TN they eat more than once a week actually. Beef access does make eating meat a lot more cheaper actually Surprise Surprise, Dhokla has no nutritional value Fish Lovin, Beef Lovin, Pork Lovin, Mutton Lovin, and most importantly nutrition lovin! Beef really isn't. If we go by that, why Punjab has lower malnutrition than Kerala? They don't eat beef at all Are you color blind by any chance? No I am not. It just shows only 4-5 districts of Kerala having low malnutrition while one district has more than 30%. Punjab has from 20-30% as a whole here with ig one district having lower than 20%. So every Punjab indeed has better here Ah so you are just bad at geography and maybe statistics Well, I agree with most of your points . But \"depending on remittances \" is not gonna work anymore as people are migrating more to western countries than gulf which allows getting a PR and staying there , thus people building/buying houses there instead of sending money to build in kerala. Kerala is gonna have a bad bad time in the future. We need to seriously increase our IT, electronic , Pharma and other companies which requires lower land. IT has to be decentralised as we can't afford to have a city like Bangalore with roads so small and land already densely packed I meant, there is no need to bash on kerala on a post that the state clearly performs good. This post is not even about kerala. No one said kerala is perfect, but appreciate the good things thats happening too. This is like scolding the kid who just won a race, because he lost an exam last month. Valid. And it's not like our economy is in dire condition as well, we have like the 6th largest GDP per capita. It's only our youth wanting even better life And what is your claim on that? None of the yellow is part of Kerala and even if it had one yellow, it doesn't put Punjab above it. Actually, half of the portion of yellow is in Kerala. From where the Kerala-Tamil Nadu dam passes through. And yes it does put Punjab above because even if we ignore this data, Punjabis lives more than an avg Malayalee Lmao Your region also tops in literacy. Sad that you got left behind. Huh? Carbitarian is fancy term invented by me. :p Also, what I wanted say is that we hardly include salads and fruits in our diet. A population surviving on carbs, carbs and only carbs shouldn't call itself vegetarian. Sorry brother no offense. And my \"beef\" comment was supposed to be a joke. Sorry if it wasn't a good one. I didn't even got offended but ok Did they ask for this? They do, Might be biased, but I have seen many people saying, They don't need hospital, school etc, issues like inflatration, religion are bigger thing for them. Kabka census h? Nai pata hota toh muh band karke bhaita karo Nai pata hota toh muh band karke bhaita karo Jey chomotkar? 🤣 google translate zindabad I liked that. Labourers and not laborers. Brit spelling is a rarity these days. Magic mushrooms? Really? It's fine, at least they tried Cow Belt is called Cow Belt for a reason!"
}