{
    "id": "14wnk7j",
    "title": "Amazon's 2 Factor Authentication : Rant on flawed account security",
    "url": "https://www.reddit.com/r/india/comments/14wnk7j/amazons_2_factor_authentication_rant_on_flawed/",
    "selftext": "This might vary with countries based on the information Amazon takes to signup for a new account. My experience is with India's version where the minimum necessary info Amazon takes is a mobile number for an account to be created & email is optional. Since majority of India's tech relies upon the flawed method of using SMS OTP to login to your account, not even a password, so there's a chance that if the user signed up just using an OTP to verify the mobile number, then India's Amazon might not even ask for a password to be created. You can simply enter the mobile number, enter the SMS OTP and you're in.\n\nMy explanation is with using an account trying the have the best security possible. So an account having mobile number (necessary), email, password (1st Security Wall), TOTP (Google Authenticator etc.) based OTP (2st Security Wall). Below is how I tried reporting the issue to Amazon but they don't seem to accept that being able to break both the security walls just by having access to a single thing is a flaw.\n\n\\--\n\n  \nThe vulnerability allows unauthorized individuals to gain unauthorized access to user accounts by leveraging the linked mobile number as a bypass mechanism for both the account password and 2FA. By following the steps outlined below, an attacker can successfully compromise an account:\n\n1. Open any of Amazon's main international websites, such as [Amazon.in](https://Amazon.in).\n\n2. Navigate to the sign-in page.\n\n3. Enter the mobile number associated with the target account.\n\n4. Click on the \"Forgot Password\" option.\n\n5. Re-enter the mobile number as the recovery option.\n\n6. Enter the OTP (One-Time Password) sent to the provided mobile number.\n\n7. After OTP verification, the system prompts for a new password.\n\n8. Enter and confirm a new password, effectively resetting it for the account.\n\n9. Return to the sign-in page and enter the mobile number and the newly created password.\n\n10. The system then requests the 2FA OTP.\n\n11. Click on the \"Didn't receive the OTP?\" option.\n\n12. The system presents three alternatives: entering the OTP from an authenticator app, receiving an OTP via SMS on the linked mobile number, or receiving an OTP via call on the linked mobile number.\n\n13. Utilize the last two options to obtain the OTP via SMS or call.\n\n14. Amazon sends an OTP to the linked mobile number.\n\n15. Enter the 2FA OTP received on the mobile number, granting successful login bypassing both the newly created password and 2FA.\n\n&#x200B;\n\nImpact:\n\nThis vulnerability compromises the security of Amazon user accounts by allowing unauthorized access to sensitive information, including personal details, purchase history, and saved payment methods. By leveraging a single mode of possession, namely the mobile number, attackers can bypass two crucial layers of authentication. This issue poses a severe risk to user privacy, confidentiality, and financial security.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689071754.0,
    "convurl": "https://external-preview.redd.it/dVhFRkTHsElzvvX70vkLdmkeLKnrPDZKevE3jQAAKhc.jpg?auto=webp&amp;s=4f62d1e5b1e99844c2114c433d95dc5a84393fbd",
    "comments": [
        "So do you have the other persons sim card already?",
        "That's the thing about security. It's all about hypothetically taking the scenario. So if someone has access to my number, they shouldn't be able to go through 2 security walls, only 1.",
        "Amazon is a data company.  They have experts.\n\nAll security has some limits. If you make is very complex then average user will make 10 customer calls. I am sure they made an analysis of true/false hijacks if sim card.\n\nIf you make everyone use only totp/qrcode then people won't back up this token and get frustrated. \n\nAll 2FA is compromise (unless you can connect user accounts to DNA)"
    ],
    "cleaned_text": "amazons factor authentication rant flawed account security might vary countries based information amazon takes signup new account experience indias version minimum necessary info amazon takes mobile number account created email optional since majority indias tech relies upon flawed method using sms otp login account even password theres chance user signed using otp verify mobile number indias amazon might even ask password created simply enter mobile number enter sms otp youre explanation using account trying best security possible account mobile number necessary email password st security wall totp google authenticator etc based otp st security wall tried reporting issue amazon dont seem accept able break security walls access single thing flaw vulnerability allows unauthorized individuals gain unauthorized access user accounts leveraging linked mobile number bypass mechanism account password fa following steps outlined attacker successfully compromise account open amazons main international websites amazoninhttpsamazonin navigate signin page enter mobile number associated target account click forgot password option reenter mobile number recovery option enter otp onetime password sent provided mobile number otp verification system prompts new password enter confirm new password effectively resetting account return signin page enter mobile number newly created password system requests fa otp click didnt receive otp option system presents three alternatives entering otp authenticator app receiving otp via sms linked mobile number receiving otp via call linked mobile number utilize last two options obtain otp via sms call amazon sends otp linked mobile number enter fa otp received mobile number granting successful login bypassing newly created password fa xb impact vulnerability compromises security amazon user accounts allowing unauthorized access sensitive information including personal details purchase history saved payment methods leveraging single mode possession namely mobile number attackers bypass two crucial layers authentication issue poses severe risk user privacy confidentiality financial security ",
    "cleaned_title": "amazons factor authentication rant flawed account security",
    "cleaned_selftext": "might vary countries based information amazon takes signup new account experience indias version minimum necessary info amazon takes mobile number account created email optional since majority indias tech relies upon flawed method using sms otp login account even password theres chance user signed using otp verify mobile number indias amazon might even ask password created simply enter mobile number enter sms otp youre explanation using account trying best security possible account mobile number necessary email password st security wall totp google authenticator etc based otp st security wall tried reporting issue amazon dont seem accept able break security walls access single thing flaw vulnerability allows unauthorized individuals gain unauthorized access user accounts leveraging linked mobile number bypass mechanism account password fa following steps outlined attacker successfully compromise account open amazons main international websites amazoninhttpsamazonin navigate signin page enter mobile number associated target account click forgot password option reenter mobile number recovery option enter otp onetime password sent provided mobile number otp verification system prompts new password enter confirm new password effectively resetting account return signin page enter mobile number newly created password system requests fa otp click didnt receive otp option system presents three alternatives entering otp authenticator app receiving otp via sms linked mobile number receiving otp via call linked mobile number utilize last two options obtain otp via sms call amazon sends otp linked mobile number enter fa otp received mobile number granting successful login bypassing newly created password fa xb impact vulnerability compromises security amazon user accounts allowing unauthorized access sensitive information including personal details purchase history saved payment methods leveraging single mode possession namely mobile number attackers bypass two crucial layers authentication issue poses severe risk user privacy confidentiality financial security",
    "cleaned_comments": "persons sim card already thats thing security hypothetically taking scenario someone access number shouldnt able go security walls amazon data company experts security limits make complex average user make customer calls sure made analysis truefalse hijacks sim card make everyone use totpqrcode people wont back token get frustrated fa compromise unless connect user accounts dna",
    "light_cleaned_title": "Amazon's 2 Factor Authentication : Rant on flawed account security",
    "light_cleaned_selftext": "This might vary with countries based on the information Amazon takes to signup for a new account. My experience is with India's version where the minimum necessary info Amazon takes is a mobile number for an account to be created & email is optional. Since majority of India's tech relies upon the flawed method of using SMS OTP to login to your account, not even a password, so there's a chance that if the user signed up just using an OTP to verify the mobile number, then India's Amazon might not even ask for a password to be created. You can simply enter the mobile number, enter the SMS OTP and you're in. My explanation is with using an account trying the have the best security possible. So an account having mobile number (necessary), email, password (1st Security Wall), TOTP (Google Authenticator etc.) based OTP (2st Security Wall). Below is how I tried reporting the issue to Amazon but they don't seem to accept that being able to break both the security walls just by having access to a single thing is a flaw. \\-- The vulnerability allows unauthorized individuals to gain unauthorized access to user accounts by leveraging the linked mobile number as a bypass mechanism for both the account password and 2FA. By following the steps outlined below, an attacker can successfully compromise an account: 1. Open any of Amazon's main international websites, such as [Amazon.in](https://Amazon.in). 2. Navigate to the sign-in page. 3. Enter the mobile number associated with the target account. 4. Click on the \"Forgot Password\" option. 5. Re-enter the mobile number as the recovery option. 6. Enter the OTP (One-Time Password) sent to the provided mobile number. 7. After OTP verification, the system prompts for a new password. 8. Enter and confirm a new password, effectively resetting it for the account. 9. Return to the sign-in page and enter the mobile number and the newly created password. 10. The system then requests the 2FA OTP. 11. Click on the \"Didn't receive the OTP?\" option. 12. The system presents three alternatives: entering the OTP from an authenticator app, receiving an OTP via SMS on the linked mobile number, or receiving an OTP via call on the linked mobile number. 13. Utilize the last two options to obtain the OTP via SMS or call. 14. Amazon sends an OTP to the linked mobile number. 15. Enter the 2FA OTP received on the mobile number, granting successful login bypassing both the newly created password and 2FA. &#x200B; Impact: This vulnerability compromises the security of Amazon user accounts by allowing unauthorized access to sensitive information, including personal details, purchase history, and saved payment methods. By leveraging a single mode of possession, namely the mobile number, attackers can bypass two crucial layers of authentication. This issue poses a severe risk to user privacy, confidentiality, and financial security.",
    "light_cleaned_comments": "So do you have the other persons sim card already? That's the thing about security. It's all about hypothetically taking the scenario. So if someone has access to my number, they shouldn't be able to go through 2 security walls, only 1. Amazon is a data company. They have experts. All security has some limits. If you make is very complex then average user will make 10 customer calls. I am sure they made an analysis of true/false hijacks if sim card. If you make everyone use only totp/qrcode then people won't back up this token and get frustrated. All 2FA is compromise (unless you can connect user accounts to DNA)"
}