{
    "id": "1bfe7ck",
    "title": "Electoral Bonds: India's Controversial 'Cash for Anonymity' Scheme",
    "url": "https://www.reddit.com/r/india/comments/1bfe7ck/electoral_bonds_indias_controversial_cash_for/",
    "selftext": "In 2017, the Indian government introduced a scheme that has managed to both puzzle and polarize the nation: **Electoral Bonds**. These interest-free bearer instruments allow anonymous donations to political parties, and the latest data from the Election Commission of India (ECI) is raising some eyebrows *(and blood pressures)*.\n\n**The Basics: What Even Are Electoral Bonds?**\n\n* Fancy IOU notes that enable anonymous funding of political parties\n* Purchased from select SBI branches using a designated account\n* Supposedly meant to eliminate use of black money in elections\n\n**The Stated Goal (Cue Skeptical Looks):** *To ensure tax-paid money is used for political funding while keeping donors' identities hush-hush.*\n\n**The Supreme Court's Two Cents:**\n\n* In 2019, the apex court expressed concerns over the lack of transparency\n* Directed parties to spill the beans on bond donors to the ECI\n\n**How India Stacks Up Against Other Democracies:** *While many nations have funding rules like public financing or disclosure requirements, India's anonymous bond system is a unicorn of sorts.*\n\n**Year-Wise Breakdown:**\n\n* **2019**: 439 companies & individuals, 3,154 transactions, **Rs. 17,66,12,80,000**\n* **2020**: 59 companies & individuals, 460 transactions, **Rs. 3,63,96,01,000**\n* **2021**: 381 companies & individuals, 2,647 transactions, **Rs. 15,02,29,27,000**\n* **2022**: 5,314 companies & individuals, 5,314 transactions, **Rs. 37,04,85,76,000**\n* **2023**: 877 companies & individuals, 6,399 transactions, **Rs. 37,04,85,76,000**\n* **2024** *(till Jan)*: 111 companies & individuals, 897 transactions, **Rs. 5,71,80,03,000**\n\n**The Numbers That'll Make Your Head Spin:**\n\n* **Rs. 12,155.51 crore** donated via bonds from 2019 to Jan 2024\n* **BJP** hit the jackpot with **Rs. 6,060.51 crore**\n* TMC, INC, BRS, BJD also among the big winners \n* Just the top 6 donors (Future Gaming, Megha Engineering, Qwik Supply Chain, Vedanta, Haldia, Essel) account for a mind-boggling **30.8%** of the total amount!\n\n**The Curious Case of Individual Donors:**\n\n* Corporations account for most donations, as expected\n* But some individuals also joined the party, with donations as low as Rs. **5,000!**\n\n[Neeraj Gandhi \\(No google results for him\\): 2,50,000](https://preview.redd.it/f3u6rjxh3ioc1.png?width=689&format=png&auto=webp&s=44efa802aeef6052c034b7f7327b0ca78a6f043b)\n\n[Ritesh Agarwal \\(Not OYO\\) a WHOOPING 5,000!!](https://preview.redd.it/z5ykinxh3ioc1.png?width=688&format=png&auto=webp&s=c782e3cb34921852a82eafdc5084dda2c4626fd5)\n\n**The Shadowy Donation Cap of Rs. 1 Crore:** *The reason for this individual limit is a mystery wrapped in an enigma.*\n\n**Pros and Cons: You Decide**\n\n* **Pros:** Legitimizes donations; curbs black money (in theory)\n* **Cons:** Anonymity breeds lack of transparency and enables corporate influence\n\nAs the debate around electoral bonds rages on, it's up to all stakeholders to untangle this web of intrigue and ensure the integrity of India's democratic process. Because, let's be real, keeping the 'cash' and ditching the 'anonymity' would be a game-changer.",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 5,
    "created_utc": 1710510026.0,
    "convurl": "https://b.thumbs.redditmedia.com/ZJU-QXdcd022DQ_OqAnjda_7JVmfHmZC8peq9cNDVrg.jpg",
    "comments": [
        "Had no idea electoral bonds are such a relatively recent concept.",
        "Then there's the Electoral Trust, which is another alternate method for supporting political parties :\n\n1. Electoral bonds are different from Electoral trusts. Though both are channels to fund political parties.   \n  \n2. Bonds are- like promissory notes and the latter is where corporate/individuals donate to a trust and it is subsequently given to the party.   \n  \n3. Data of both are available on EC website but the only thing missing is the link between the donor and party.",
        "I wish India has more transperancy as to which entity paid which political party, on top of that there should be a registry that shows how much taxes anyone pays similar to Norway like system. This would generate more trust into the govt institutions. Right now its so opaque."
    ],
    "cleaned_text": "electoral bonds indias controversial cash anonymity scheme indian government introduced scheme managed puzzle polarize nation electoral bonds interestfree bearer instruments allow anonymous donations political parties latest data election commission india eci raising eyebrows blood pressures basics even electoral bonds fancy iou notes enable anonymous funding political parties purchased select sbi branches using designated account supposedly meant eliminate use black money elections stated goal cue skeptical looks ensure taxpaid money used political funding keeping donors identities hushhush supreme courts two cents apex court expressed concerns lack transparency directed parties spill beans bond donors eci india stacks democracies many nations funding rules like public financing disclosure requirements indias anonymous bond system unicorn sorts yearwise breakdown companies individuals transactions rs companies individuals transactions rs companies individuals transactions rs companies individuals transactions rs companies individuals transactions rs till jan companies individuals transactions rs numbers thatll make head spin rs crore donated via bonds jan bjp hit jackpot rs crore tmc inc brs bjd also among big winners top donors future gaming megha engineering qwik supply chain vedanta haldia essel account mindboggling total amount curious case individual donors corporations account donations expected individuals also joined party donations low rs neeraj gandhi google results httpspreviewredditfurjxhiocpngwidthformatpngautowebpsefaaeefcbfbcaafb ritesh agarwal oyo whooping httpspreviewredditzykinxhiocpngwidthformatpngautowebpscecbaeafdcddacfd shadowy donation cap rs crore reason individual limit mystery wrapped enigma pros cons decide pros legitimizes donations curbs black money theory cons anonymity breeds lack transparency enables corporate influence debate around electoral bonds rages stakeholders untangle web intrigue ensure integrity indias democratic process lets real keeping cash ditching anonymity would gamechanger ",
    "cleaned_title": "electoral bonds indias controversial cash anonymity scheme",
    "cleaned_selftext": "indian government introduced scheme managed puzzle polarize nation electoral bonds interestfree bearer instruments allow anonymous donations political parties latest data election commission india eci raising eyebrows blood pressures basics even electoral bonds fancy iou notes enable anonymous funding political parties purchased select sbi branches using designated account supposedly meant eliminate use black money elections stated goal cue skeptical looks ensure taxpaid money used political funding keeping donors identities hushhush supreme courts two cents apex court expressed concerns lack transparency directed parties spill beans bond donors eci india stacks democracies many nations funding rules like public financing disclosure requirements indias anonymous bond system unicorn sorts yearwise breakdown companies individuals transactions rs companies individuals transactions rs companies individuals transactions rs companies individuals transactions rs companies individuals transactions rs till jan companies individuals transactions rs numbers thatll make head spin rs crore donated via bonds jan bjp hit jackpot rs crore tmc inc brs bjd also among big winners top donors future gaming megha engineering qwik supply chain vedanta haldia essel account mindboggling total amount curious case individual donors corporations account donations expected individuals also joined party donations low rs neeraj gandhi google results httpspreviewredditfurjxhiocpngwidthformatpngautowebpsefaaeefcbfbcaafb ritesh agarwal oyo whooping httpspreviewredditzykinxhiocpngwidthformatpngautowebpscecbaeafdcddacfd shadowy donation cap rs crore reason individual limit mystery wrapped enigma pros cons decide pros legitimizes donations curbs black money theory cons anonymity breeds lack transparency enables corporate influence debate around electoral bonds rages stakeholders untangle web intrigue ensure integrity indias democratic process lets real keeping cash ditching anonymity would gamechanger",
    "cleaned_comments": "idea electoral bonds relatively recent concept theres electoral trust another alternate method supporting political parties electoral bonds different electoral trusts though channels fund political parties bonds like promissory notes latter corporateindividuals donate trust subsequently given party data available ec website thing missing link donor party wish india transperancy entity paid political party top registry shows much taxes anyone pays similar norway like system would generate trust govt institutions right opaque",
    "light_cleaned_title": "Electoral Bonds: India's Controversial 'Cash for Anonymity' Scheme",
    "light_cleaned_selftext": "In 2017, the Indian government introduced a scheme that has managed to both puzzle and polarize the nation: **Electoral Bonds**. These interest-free bearer instruments allow anonymous donations to political parties, and the latest data from the Election Commission of India (ECI) is raising some eyebrows *(and blood pressures)*. **The Basics: What Even Are Electoral Bonds?** * Fancy IOU notes that enable anonymous funding of political parties * Purchased from select SBI branches using a designated account * Supposedly meant to eliminate use of black money in elections **The Stated Goal (Cue Skeptical Looks):** *To ensure tax-paid money is used for political funding while keeping donors' identities hush-hush.* **The Supreme Court's Two Cents:** * In 2019, the apex court expressed concerns over the lack of transparency * Directed parties to spill the beans on bond donors to the ECI **How India Stacks Up Against Other Democracies:** *While many nations have funding rules like public financing or disclosure requirements, India's anonymous bond system is a unicorn of sorts.* **Year-Wise Breakdown:** * **2019**: 439 companies & individuals, 3,154 transactions, **Rs. 17,66,12,80,000** * **2020**: 59 companies & individuals, 460 transactions, **Rs. 3,63,96,01,000** * **2021**: 381 companies & individuals, 2,647 transactions, **Rs. 15,02,29,27,000** * **2022**: 5,314 companies & individuals, 5,314 transactions, **Rs. 37,04,85,76,000** * **2023**: 877 companies & individuals, 6,399 transactions, **Rs. 37,04,85,76,000** * **2024** *(till Jan)*: 111 companies & individuals, 897 transactions, **Rs. 5,71,80,03,000** **The Numbers That'll Make Your Head Spin:** * **Rs. 12,155.51 crore** donated via bonds from 2019 to Jan 2024 * **BJP** hit the jackpot with **Rs. 6,060.51 crore** * TMC, INC, BRS, BJD also among the big winners * Just the top 6 donors (Future Gaming, Megha Engineering, Qwik Supply Chain, Vedanta, Haldia, Essel) account for a mind-boggling **30.8%** of the total amount! **The Curious Case of Individual Donors:** * Corporations account for most donations, as expected * But some individuals also joined the party, with donations as low as Rs. **5,000!** [Neeraj Gandhi \\(No google results for him\\): 2,50,000](https://preview.redd.it/f3u6rjxh3ioc1.png?width=689&format=png&auto=webp&s=44efa802aeef6052c034b7f7327b0ca78a6f043b) [Ritesh Agarwal \\(Not OYO\\) a WHOOPING 5,000!!](https://preview.redd.it/z5ykinxh3ioc1.png?width=688&format=png&auto=webp&s=c782e3cb34921852a82eafdc5084dda2c4626fd5) **The Shadowy Donation Cap of Rs. 1 Crore:** *The reason for this individual limit is a mystery wrapped in an enigma.* **Pros and Cons: You Decide** * **Pros:** Legitimizes donations; curbs black money (in theory) * **Cons:** Anonymity breeds lack of transparency and enables corporate influence As the debate around electoral bonds rages on, it's up to all stakeholders to untangle this web of intrigue and ensure the integrity of India's democratic process. Because, let's be real, keeping the 'cash' and ditching the 'anonymity' would be a game-changer.",
    "light_cleaned_comments": "Had no idea electoral bonds are such a relatively recent concept. Then there's the Electoral Trust, which is another alternate method for supporting political parties : 1. Electoral bonds are different from Electoral trusts. Though both are channels to fund political parties. 2. Bonds are- like promissory notes and the latter is where corporate/individuals donate to a trust and it is subsequently given to the party. 3. Data of both are available on EC website but the only thing missing is the link between the donor and party. I wish India has more transperancy as to which entity paid which political party, on top of that there should be a registry that shows how much taxes anyone pays similar to Norway like system. This would generate more trust into the govt institutions. Right now its so opaque."
}