{
    "id": "1dd8sks",
    "title": "Urgent: Stop Illegal Demolition of My House",
    "url": "https://www.reddit.com/r/india/comments/1dd8sks/urgent_stop_illegal_demolition_of_my_house/",
    "selftext": "TL;DR:\nA corrupt builder, with political backing, is illegally demolishing homes in Sai Nagar Bhandup. Despite ongoing legal battles and activist support, the demolition continues. We need media attention and public support to stop this injustice.\n\nOur homes in Sai Nagar Bhandup (Mumbai) are under threat due to an illegal and politically influenced demolition. A corrupt builder, Atul Shirodkar, supported by MLA Sunil Raut, has initiated this demolition despite not having clear land titles or fulfilling agreements with original owners. Government agencies like SRA and the police are allegedly ignoring the issue due to political pressure. Prominent activist Anjali Damania is fighting against this injustice, but we need more support to stop the demolition and protect our community.\n\n- The builder lacks clear titles and agreements are unfulfilled.\n- Partial demolitions are creating unsafe conditions.\n- Government agencies and the police are allegedly compromised.\n- Anjali Damania is advocating for us, but we need broader support.\n\n\nI am feeling really helpless.\n\nIf possible, Please share this story, involve media, and reach out to prominent figures who can help stop this unlawful demolition. Our homes and community depend on it.\n\nRecent tweets by Anjali Damania with Proof of demolition and forceful eviction. \n\nhttps://x.com/anjali_damania/status/1800221679123337612",
    "flair": "Crime",
    "score": 2,
    "num_comments": 1,
    "created_utc": 1718092945.0,
    "convurl": "https://external-preview.redd.it/ii5UA4yRaYDPIggMlIza-dUsgeP2-wiy3XigwndvPrk.jpg",
    "comments": [
        "Nothing will happen, you rent a JCB and bulldoze builder's house in midnight."
    ],
    "cleaned_text": "urgent stop illegal demolition house tldr corrupt builder political backing illegally demolishing homes sai nagar bhandup despite ongoing legal battles activist support demolition continues need media attention public support stop injustice homes sai nagar bhandup mumbai threat due illegal politically influenced demolition corrupt builder atul shirodkar supported mla sunil raut initiated demolition despite clear land titles fulfilling agreements original owners government agencies like sra police allegedly ignoring issue due political pressure prominent activist anjali damania fighting injustice need support stop demolition protect community builder lacks clear titles agreements unfulfilled partial demolitions creating unsafe conditions government agencies police allegedly compromised anjali damania advocating us need broader support feeling really helpless possible please share story involve media reach prominent figures help stop unlawful demolition homes community depend recent tweets anjali damania proof demolition forceful eviction ",
    "cleaned_title": "urgent stop illegal demolition house",
    "cleaned_selftext": "tldr corrupt builder political backing illegally demolishing homes sai nagar bhandup despite ongoing legal battles activist support demolition continues need media attention public support stop injustice homes sai nagar bhandup mumbai threat due illegal politically influenced demolition corrupt builder atul shirodkar supported mla sunil raut initiated demolition despite clear land titles fulfilling agreements original owners government agencies like sra police allegedly ignoring issue due political pressure prominent activist anjali damania fighting injustice need support stop demolition protect community builder lacks clear titles agreements unfulfilled partial demolitions creating unsafe conditions government agencies police allegedly compromised anjali damania advocating us need broader support feeling really helpless possible please share story involve media reach prominent figures help stop unlawful demolition homes community depend recent tweets anjali damania proof demolition forceful eviction",
    "cleaned_comments": "nothing happen rent jcb bulldoze builders house midnight",
    "light_cleaned_title": "Urgent: Stop Illegal Demolition of My House",
    "light_cleaned_selftext": "TL;DR: A corrupt builder, with political backing, is illegally demolishing homes in Sai Nagar Bhandup. Despite ongoing legal battles and activist support, the demolition continues. We need media attention and public support to stop this injustice. Our homes in Sai Nagar Bhandup (Mumbai) are under threat due to an illegal and politically influenced demolition. A corrupt builder, Atul Shirodkar, supported by MLA Sunil Raut, has initiated this demolition despite not having clear land titles or fulfilling agreements with original owners. Government agencies like SRA and the police are allegedly ignoring the issue due to political pressure. Prominent activist Anjali Damania is fighting against this injustice, but we need more support to stop the demolition and protect our community. - The builder lacks clear titles and agreements are unfulfilled. - Partial demolitions are creating unsafe conditions. - Government agencies and the police are allegedly compromised. - Anjali Damania is advocating for us, but we need broader support. I am feeling really helpless. If possible, Please share this story, involve media, and reach out to prominent figures who can help stop this unlawful demolition. Our homes and community depend on it. Recent tweets by Anjali Damania with Proof of demolition and forceful eviction.",
    "light_cleaned_comments": "Nothing will happen, you rent a JCB and bulldoze builder's house in midnight."
}