{
    "id": "1bus19l",
    "title": "So here's why we should all reflect on the story - Haryana IAS officer vacates 20-year-old stay on land deal, later husband and son ‘buy’ it",
    "url": "https://www.reddit.com/r/india/comments/1bus19l/so_heres_why_we_should_all_reflect_on_the_story/",
    "selftext": "The story was a bit of a shocker - [Haryana IAS officer vacates 20-year-old stay on land deal, later husband and son ‘buy’ it](https://indianexpress.com/article/cities/chandigarh/haryana-ias-vacates-stay-on-land-deal-husband-son-buy-it-9246124/)\n\nHowever, it is not just about a corrupt officer, but rather the system that is rigged against the common man. \n\nAs per the current regulations in various states including Karnataka, the Deputy Commissioner has a ***quasi judicial authority*** over land (revenue) court. The DC and his officials are 'judge, jury and witness' in land-record cases. \n\nThe sad part is they aren't afraid to ignore High Court orders. And it just goes to show how broken the system really is, and the news you read of 'corruption' is just tip of the iceberg!\n\n------\n\n\n#[Mystory (The Hindu) - Bengaluru Urban DC accused of violating HC order over issuance of khata](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece)\n\n# [Meeting with Deputy CM a couple of months ago](https://twitter.com/PetitionIssue/status/1743206876324745233)",
    "flair": "Rant / Vent",
    "score": 93,
    "num_comments": 4,
    "created_utc": 1712149312.0,
    "convurl": "https://external-preview.redd.it/uc9OoQ2DG0XwVtRGjWB9CdefLj2i1cYbnovBLp-XVE4.jpg?auto=webp&s=2cba678c2d37d1cfcd18e29bf3da8f75b7b0bbac",
    "comments": [
        "> My husband made a deal to buy five acres of land for Rs 42.5 lakh. My husband informed the Chief Information Commissioner about it. I also took permission from the government to purchase land in the name of my husband and son. My husband gave an advance installment in December 2023. As per the collector rates, we have paid the stamp duty for a value of Rs 2.25 crore for five acres of land.\n\nStamp duty is four times more than the selling price. That didnt raise a flag.",
        "Yes sadly that's the reality these days.",
        "All the more when one is at the receiving end!",
        "Cash transaction has happened. Very likely."
    ],
    "cleaned_text": "heres reflect story haryana ias officer vacates yearold stay land deal later husband son buy story bit shocker haryana ias officer vacates yearold stay land deal later husband son buy ithttpsindianexpresscomarticlecitieschandigarhharyanaiasvacatesstayonlanddealhusbandsonbuyit however corrupt officer rather system rigged common man per current regulations various states including karnataka deputy commissioner quasi judicial authority land revenue court dc officials judge jury witness landrecord cases sad part arent afraid ignore high court orders goes show broken system really news read corruption tip iceberg mystory hindu bengaluru urban dc accused violating hc order issuance khatahttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece meeting deputy cm couple months agohttpstwittercompetitionissuestatus ",
    "cleaned_title": "heres reflect story haryana ias officer vacates yearold stay land deal later husband son buy",
    "cleaned_selftext": "story bit shocker haryana ias officer vacates yearold stay land deal later husband son buy ithttpsindianexpresscomarticlecitieschandigarhharyanaiasvacatesstayonlanddealhusbandsonbuyit however corrupt officer rather system rigged common man per current regulations various states including karnataka deputy commissioner quasi judicial authority land revenue court dc officials judge jury witness landrecord cases sad part arent afraid ignore high court orders goes show broken system really news read corruption tip iceberg mystory hindu bengaluru urban dc accused violating hc order issuance khatahttpswwwthehinducomnewscitiesbangalorebengaluruurbandcaccusedofviolatinghcorderoverissuanceofkhataarticleece meeting deputy cm couple months agohttpstwittercompetitionissuestatus",
    "cleaned_comments": "husband made deal buy five acres land rs lakh husband informed chief information commissioner also took permission government purchase land name husband son husband gave advance installment december per collector rates paid stamp duty value rs crore five acres land stamp duty four times selling price didnt raise flag yes sadly thats reality days one receiving end cash transaction happened likely",
    "light_cleaned_title": "So here's why we should all reflect on the story - Haryana IAS officer vacates 20-year-old stay on land deal, later husband and son ‘buy’ it",
    "light_cleaned_selftext": "The story was a bit of a shocker - [Haryana IAS officer vacates 20-year-old stay on land deal, later husband and son ‘buy’ it](https://indianexpress.com/article/cities/chandigarh/haryana-ias-vacates-stay-on-land-deal-husband-son-buy-it-9246124/) However, it is not just about a corrupt officer, but rather the system that is rigged against the common man. As per the current regulations in various states including Karnataka, the Deputy Commissioner has a ***quasi judicial authority*** over land (revenue) court. The DC and his officials are 'judge, jury and witness' in land-record cases. The sad part is they aren't afraid to ignore High Court orders. And it just goes to show how broken the system really is, and the news you read of 'corruption' is just tip of the iceberg! ------ #[Mystory (The Hindu) - Bengaluru Urban DC accused of violating HC order over issuance of khata](https://www.thehindu.com/news/cities/bangalore/bengaluru-urban-dc-accused-of-violating-hc-order-over-issuance-of-khata/article66985535.ece) # [Meeting with Deputy CM a couple of months ago](https://twitter.com/PetitionIssue/status/1743206876324745233)",
    "light_cleaned_comments": "> My husband made a deal to buy five acres of land for Rs 42.5 lakh. My husband informed the Chief Information Commissioner about it. I also took permission from the government to purchase land in the name of my husband and son. My husband gave an advance installment in December 2023. As per the collector rates, we have paid the stamp duty for a value of Rs 2.25 crore for five acres of land. Stamp duty is four times more than the selling price. That didnt raise a flag. Yes sadly that's the reality these days. All the more when one is at the receiving end! Cash transaction has happened. Very likely."
}