{
    "id": "xg9066",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/xg9066/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 15,
    "num_comments": 12,
    "created_utc": 1663378211,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watching **Dahan: Raakan ka Rahasya** and **Criminal Justice S3** on Disney Hotstar.",
        "if anything happens, i love you on netflix is really good. Also, the boys season 3, but disappointed with how they end every season kind of resetting everything",
        "I'm on episode 3 of Hot Milf bhabhi devar ko choda , \n\ni know art house movies take symbolism and vague sexual shots to depict and make commentary on the human condition , but right now I'm not getting it at all, it all just looks like a long multi part sequence of two people shagging.",
        "Recently watched sneaky pete on prime enjoyed it. Liked new fantanstic beast moive also.",
        "Really liked that animated short",
        "Watched 'Nna Thaan Case Kodu'\n\nExcellent satire.",
        "Watching Scrubs.",
        "Watching The Bold Type, it's quite inspiring. It is about how 3 women are friends and support each other to go up the corporate ladder. They face all hurdles together and help each other to overcome challenges put forward at their company.",
        "On my second re-watch of Modern Family, hilarious show. Subtle comedy with a lot of good stuff sprinkled all over.\n\nAlso, on the watchlist is the second season of 'Only Murders in the Building'. Plus, the final season of 'What we do in the Shadows'.\n\nAll of the above are available on Disney+ (Hotstar).",
        "It's not on any streaming platform right ?"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "watching dahan raakan ka rahasya criminal justice disney hotstar anything happens love netflix really good also boys season disappointed end every season kind resetting everything im episode hot milf bhabhi devar ko choda know art house movies take symbolism vague sexual shots depict make commentary human condition right im getting looks like long multi part sequence two people shagging recently watched sneaky pete prime enjoyed liked new fantanstic beast moive also really liked animated short watched nna thaan case kodu excellent satire watching scrubs watching bold type quite inspiring women friends support go corporate ladder face hurdles together help overcome challenges put forward company second rewatch modern family hilarious show subtle comedy lot good stuff sprinkled also watchlist second season murders building plus final season shadows available disney hotstar streaming platform right",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Watching **Dahan: Raakan ka Rahasya** and **Criminal Justice S3** on Disney Hotstar. if anything happens, i love you on netflix is really good. Also, the boys season 3, but disappointed with how they end every season kind of resetting everything I'm on episode 3 of Hot Milf bhabhi devar ko choda , i know art house movies take symbolism and vague sexual shots to depict and make commentary on the human condition , but right now I'm not getting it at all, it all just looks like a long multi part sequence of two people shagging. Recently watched sneaky pete on prime enjoyed it. Liked new fantanstic beast moive also. Really liked that animated short Watched 'Nna Thaan Case Kodu' Excellent satire. Watching Scrubs. Watching The Bold Type, it's quite inspiring. It is about how 3 women are friends and support each other to go up the corporate ladder. They face all hurdles together and help each other to overcome challenges put forward at their company. On my second re-watch of Modern Family, hilarious show. Subtle comedy with a lot of good stuff sprinkled all over. Also, on the watchlist is the second season of 'Only Murders in the Building'. Plus, the final season of 'What we do in the Shadows'. All of the above are available on Disney+ (Hotstar). It's not on any streaming platform right ?"
}