{
    "id": "1hq2wqt",
    "title": "How long before Ikea pulls out? Staggering losses this FY24. ",
    "url": "https://i.redd.it/ud7cdowq33ae1.jpeg",
    "selftext": "India's consumption story is a weird one, as companies realise that with massive unemployment, wages flatlining and income inequality, the country's minuscule relatively wealthy population is far too small a market to bother with. \n\nThe income range that is a minimum to consider Ikea products should be households that earn more than 7-8lk annum. I don't believe even 0.5% of the country can match those numbers. ",
    "flair": "Policy/Economy",
    "score": 77,
    "num_comments": 52,
    "created_utc": 1735607353.0,
    "convurl": "https://i.redd.it/ud7cdowq33ae1.jpeg",
    "comments": [
        "IKEA is supposed to be affordable/value for price. Why tf would I buy some obnoxious looking minimalist table for double the local price just because 'IKEA'",
        "Still the Indian market is so unorganised that they will make money. Looses are part of learning for all MNCs",
        "no one will care . if they leave.. \n\nprice+tax = not my type.... \n\nisse accha I'll hire one carpenter, espresso 🕺🕺",
        "IKEA can't beat that neighborhood marwari furniture waala in terms of pricing, quality and even trust to an extent.",
        "Because ikea’s entire business model works only in the west. It works there because cost of labor is more than cost of materials.\n\nFundamental reason ikea is cheap in the west is because it is not assembled. When you assemble it at home, you are doing the job of someone who would have to be paid $25 an hour at some factory. So by assembling it yourself you are that cost. Second important thing is, it’s cheaper to transport a disassembled table compared to an assembled one. It takes a lot less space, so cost of transport is cheaper too. IKEA can fit like 10x more items into a shipping container from China compared to assembled stuff.\n\nIn India, labor is so cheap, the advantage first point gets is almost zero.  \n\nIKEA furniture in the west are considered cheap, entry level. There is literally no furniture store that’s cheaper than ikea.",
        "the quality of thier furniture is shit! Bought a couple of units and both have developed issues in just 2-3 years!",
        "In fact \"Urban company\" has a category Furniture Assembly.",
        "Open a store in Delhi and the losses will be recovered in no time.",
        "So sad for the billion dollar company",
        "Mumbai region itself had three stores and they had shut down one of them.",
        "IKEA is not a status symbol, they should have changed the marketing strategy in india",
        "Very well put, the only reason ikea even has any sales is due to indians having a brand mentality.",
        "Their business model is flawed, they only open a few centers in the south and their online stores are have literally no marketing.   \nWhen was the last time you saw an ad of Ikea or even a flash sale?   \nEveryone knows when Amazon, Flipkart, Myntra, Ajio etc will have a major sales event and there is almost always a flash sale at anytime you visit their page.  \nThey think they are Mercedes, BMW brands who need no advertising?",
        "Good riddence. Nothing was cheap there and quality wise it's bad. Almost feel like the defective ones that they get aboard are shipped here to India to earn from the reject stock as well.",
        "IKEA is budget furniture in the west. If they price it similar to Indian markets, it would’ve become successful in the metros",
        "I have seen plenty of IKEA ads, not sure why you haven’t been getting them.",
        "There are lot of western companies which are supposed to be budget stores, but they aren’t in India and we can’t blame them.",
        "The losses are coming from capex. The depreciation on the balance sheets is the major drags on their P&L.\n\nTheir actual sales volumes are only growing and once they meet their investment targets the losses will start reversing course.",
        " They are competing with an unstructured but very strong hold traditional carpentry businesses. These small carpenters are cheaper and easy to reach out. Besides that, in India, people still believe that furniture has a long shelf life. If something is broken, it should be \"repaired\" rather than \"replaced\". Ikea model is yet to get acceptance as the customer mindset does not align with their product strategy.",
        "Ikea biz model of USA and 1st world where the roads does exist - won’t work in India.\n\nFor instance- for most of the Bangalore folks going to ikea store in Bangalore is a day trip - it’s not the distance but the traffic bcz\n\n\nIkea needs to Innovate per Indian market reality",
        "India is not a place they would want to sell coz we are a very budgeted and old-school country when it comes to furniture IKEA can be a little expensive and what most people do is they click pictures and will get it done by a local contractor in 10yrs down the line due to generational shift sales may get steady",
        ">When was the last time you saw an ad of Ikea or even a flash sale?\n\nFirst time I'm hearing ikea is in India",
        "Ikea has low quality furniture for students in the west. It looks good but falls apart after a year or two. It's not supposed to last.\n\nIndians mostly don't work like that. Even our inexpensive wooden/cane furniture is made to last. I've seen dovetail joints on plywood furniture made in India. I have a dining table set from the late '60's and it still looks great. Perfectly functional except the veneer has faded with time. A cane sofa set has been around for at least 35 years that I can remember and still going strong. Some people even buy second hand furniture if they can't afford good quality new ones, and refurbish it. \n\nThe Ikea model won't work because the equivalent consumer in India would be a student, slum dwellers or lower middle class. All groups that cannot afford Ikea prices. Their prices dictate at least a middle income to upper middle income consumer, who is much more picky and demands better quality.",
        "Yes, but this still begs the question, why does Ikea feel the need to import disassembled furniture from China to India? why can't it make disassembled furniture here and sell it here, to compete with the local market here? I find it difficult to understand why Ikea can't compete against local furniture.",
        "I also see lots of ikea ads, but maybe this is only a Bangalore/Hyderabad thing. I don’t ikea advertises in cities they aren’t present in.",
        "This. Meanwhile their competitors market like crazy. Their target audience is literally not aware that IKEA exists",
        "A 15% loss in the first few years is not staggering by any means. Amazon India, uber India, ola, flipkart, paytm are all unprofitable. \n\nThat's just the business model of growth companies. If you read the article, ikea are setting up a few more stores to reach the scale they want. \n\nYou guys need to stop writing pessimistic tales at every opportunity you get without understanding the nuances. No MNC is ready to leave India. They just keep ploughing profits from their global op to India. That should tell you something.",
        "I have see people take ikea designs and get it done cheaper from local carpenters. Those carpenters then pitch those designs to other people who haven’t visited IKEA. You can’t beat Indian jugaad.",
        "I live main at the north side of India (Delhi, Punjab, Bengal, Assam, NE states) never seen an ikea ad online or offline",
        "It's the locally sourced items rule of the government that is killing them. If they were a US company their government would have put pressure on the Indian government and had the rule removed.",
        "IKEA will fail in India unless it adapts to Indian specific conditions.\n\nThey opened a few stores in the South, refuse to deliver online and most importantly, aren't expanding in T2 and T3 towns. \n\nIndia isn't like western countries where someone would drive 200km in his own pickup truck to acquire the furniture and assemble it themselves.",
        "McDolands is also a budget restaurant  in the west",
        "In the same rhetoric, Amazon and Flipkart started with competing with very strong local/neighborhood grocery stores who also had a free home delivery service and any product found damaged or unsatisfactory could be exchanged immediately, but today the online store have take a massive chunk out of the daily sales of these same store, all because of marketing , pricing and availability.",
        "Exactly. When I bought my first furniture, a cupboard, I bought engineered wood because it was cheaper. During installation I regretted buying it because it was not sturdy. The next time I went to the local carpenter. I get a sense of pride while using it. I made it to last generations. Just like the items my father made with his hard earned money and gave to me.",
        "I bought an ikea bedside small table. And spent 1 hour last night assembling it. Maybe my 1 hour long curses made them go bankrupt! 😬",
        "Why don't they ship to other cities outside their store locations? For example, NCR has huge demand for their stuff but they do not ship. They could tie up with someone if they don't want to themselves. If they are not keen in expanding their market, of course sales would fall.",
        "Also the quality of food in Indian McDonald's is bad compared to European McDonald's.",
        "They dont even deliver outside of their home cities. That's a dead in the water strategy.",
        "Strangely, Indian McD >>>>> US McD",
        "The quality of food in US McDonald's is far worse than India. That's why it's budget. No experience with European McD so can't comment on that",
        "O",
        "They outsource their manufacturing to Asia which makes their products affordable for Western wages. It's not always feasible to reduce the cost further for the asian market.",
        "Realized that IKEA is a luxury brand in India, nope my neighborhood badhai is way better Sir.",
        "I read it a few days back that IKEA model works in the West where labour is expensive so mass manufactured factory furniture is cheaper in comparison. While it's a different story in India, labour is very (very very very) affordable here and getting something made is relatively cheaper.",
        "Local carpenters can create Ikea designs for me for half the cost using thick plywood and veneer. Particle board is used in practically every Ikea product, which will start creaking within 2 years.\nIndian carpenters are underrated for their skill.\n\nI also bought a custom-designed wardrobe from a nearby factory, they used  robust steel gauges on the item.",
        "In terms of quality -\nFurniture: mostly cheap engineered wood. Local shops or even Urbanladder provide better quality.\nIn terms of variety & pricing-\nDecor: they do have those minimalist items, but online availability is a challenge. The ones in Mumbai Bangalore have to literally go on a full day trip which is not doable. \nI did buy some good vases and plant pots which turned out good.\nOrganisers: some of them are cheap cardboard, those which are good are not priced right.\nLighting: overpriced. Local marwari guy selling at half the price. \nCrockery & kitchen utensils: I think these are priced right, I really like their glass & plastic containers along with the plates mugs etc. \n\nBottom line, they need to price those items right.",
        "McD is budget in India too compared to astronomically priced decent cafes and restaurants now.",
        "The timing of IKEA’s loss matches with stricter tax policies. It would be safe to say public is being conservative in spending"
    ],
    "cleaned_text": "long ikea pulls staggering losses fy indias consumption story weird one companies realise massive unemployment wages flatlining income inequality countrys minuscule relatively wealthy population far small market bother income range minimum consider ikea products households earn lk annum dont believe even country match numbers ",
    "cleaned_title": "long ikea pulls staggering losses fy",
    "cleaned_selftext": "indias consumption story weird one companies realise massive unemployment wages flatlining income inequality countrys minuscule relatively wealthy population far small market bother income range minimum consider ikea products households earn lk annum dont believe even country match numbers",
    "cleaned_comments": "ikea supposed affordablevalue price tf would buy obnoxious looking minimalist table double local price ikea still indian market unorganised make money looses part learning mncs one care leave pricetax type isse accha ill hire one carpenter espresso ikea cant beat neighborhood marwari furniture waala terms pricing quality even trust extent ikeas entire business model works west works cost labor cost materials fundamental reason ikea cheap west assembled assemble home job someone would paid hour factory assembling cost second important thing cheaper transport disassembled table compared assembled one takes lot less space cost transport cheaper ikea fit like x items shipping container china compared assembled stuff india labor cheap advantage first point gets almost zero ikea furniture west considered cheap entry level literally furniture store thats cheaper ikea quality thier furniture shit bought couple units developed issues years fact urban company category furniture assembly open store delhi losses recovered time sad billion dollar company mumbai region three stores shut one ikea status symbol changed marketing strategy india well put reason ikea even sales due indians brand mentality business model flawed open centers south online stores literally marketing last time saw ad ikea even flash sale everyone knows amazon flipkart myntra ajio etc major sales event almost always flash sale anytime visit page think mercedes bmw brands need advertising good riddence nothing cheap quality wise bad almost feel like defective ones get aboard shipped india earn reject stock well ikea budget furniture west price similar indian markets wouldve become successful metros seen plenty ikea ads sure havent getting lot western companies supposed budget stores arent india cant blame losses coming capex depreciation balance sheets major drags pl actual sales volumes growing meet investment targets losses start reversing course competing unstructured strong hold traditional carpentry businesses small carpenters cheaper easy reach besides india people still believe furniture long shelf life something broken repaired rather replaced ikea model yet get acceptance customer mindset align product strategy ikea biz model usa st world roads exist wont work india instance bangalore folks going ikea store bangalore day trip distance traffic bcz ikea needs innovate per indian market reality india place would want sell coz budgeted oldschool country comes furniture ikea little expensive people click pictures get done local contractor yrs line due generational shift sales may get steady last time saw ad ikea even flash sale first time im hearing ikea india ikea low quality furniture students west looks good falls apart year two supposed last indians mostly dont work like even inexpensive woodencane furniture made last ive seen dovetail joints plywood furniture made india dining table set late still looks great perfectly functional except veneer faded time cane sofa set around least years remember still going strong people even buy second hand furniture cant afford good quality new ones refurbish ikea model wont work equivalent consumer india would student slum dwellers lower middle class groups afford ikea prices prices dictate least middle income upper middle income consumer much picky demands better quality yes still begs question ikea feel need import disassembled furniture china india cant make disassembled furniture sell compete local market find difficult understand ikea cant compete local furniture also see lots ikea ads maybe bangalorehyderabad thing dont ikea advertises cities arent present meanwhile competitors market like crazy target audience literally aware ikea exists loss first years staggering means amazon india uber india ola flipkart paytm unprofitable thats business model growth companies read article ikea setting stores reach scale want guys need stop writing pessimistic tales every opportunity get without understanding nuances mnc ready leave india keep ploughing profits global op india tell something see people take ikea designs get done cheaper local carpenters carpenters pitch designs people havent visited ikea cant beat indian jugaad live main north side india delhi punjab bengal assam ne states never seen ikea ad online offline locally sourced items rule government killing us company government would put pressure indian government rule removed ikea fail india unless adapts indian specific conditions opened stores south refuse deliver online importantly arent expanding towns india isnt like western countries someone would drive km pickup truck acquire furniture assemble mcdolands also budget restaurant west rhetoric amazon flipkart started competing strong localneighborhood grocery stores also free home delivery service product found damaged unsatisfactory could exchanged immediately today online store take massive chunk daily sales store marketing pricing availability exactly bought first furniture cupboard bought engineered wood cheaper installation regretted buying sturdy next time went local carpenter get sense pride using made last generations like items father made hard earned money gave bought ikea bedside small table spent hour last night assembling maybe hour long curses made go bankrupt dont ship cities outside store locations example ncr huge demand stuff ship could tie someone dont want keen expanding market course sales would fall also quality food indian mcdonalds bad compared european mcdonalds dont even deliver outside home cities thats dead water strategy strangely indian mcd us mcd quality food us mcdonalds far worse india thats budget experience european mcd cant comment outsource manufacturing asia makes products affordable western wages always feasible reduce cost asian market realized ikea luxury brand india nope neighborhood badhai way better sir read days back ikea model works west labour expensive mass manufactured factory furniture cheaper comparison different story india labour affordable getting something made relatively cheaper local carpenters create ikea designs half cost using thick plywood veneer particle board used practically every ikea product start creaking within years indian carpenters underrated skill also bought customdesigned wardrobe nearby factory used robust steel gauges item terms quality furniture mostly cheap engineered wood local shops even urbanladder provide better quality terms variety pricing decor minimalist items online availability challenge ones mumbai bangalore literally go full day trip doable buy good vases plant pots turned good organisers cheap cardboard good priced right lighting overpriced local marwari guy selling half price crockery kitchen utensils think priced right really like glass plastic containers along plates mugs etc bottom line need price items right mcd budget india compared astronomically priced decent cafes restaurants timing ikeas loss matches stricter tax policies would safe say public conservative spending",
    "light_cleaned_title": "How long before Ikea pulls out? Staggering losses this FY24.",
    "light_cleaned_selftext": "India's consumption story is a weird one, as companies realise that with massive unemployment, wages flatlining and income inequality, the country's minuscule relatively wealthy population is far too small a market to bother with. The income range that is a minimum to consider Ikea products should be households that earn more than 7-8lk annum. I don't believe even 0.5% of the country can match those numbers.",
    "light_cleaned_comments": "IKEA is supposed to be affordable/value for price. Why tf would I buy some obnoxious looking minimalist table for double the local price just because 'IKEA' Still the Indian market is so unorganised that they will make money. Looses are part of learning for all MNCs no one will care . if they leave.. price+tax = not my type.... isse accha I'll hire one carpenter, espresso 🕺🕺 IKEA can't beat that neighborhood marwari furniture waala in terms of pricing, quality and even trust to an extent. Because ikea’s entire business model works only in the west. It works there because cost of labor is more than cost of materials. Fundamental reason ikea is cheap in the west is because it is not assembled. When you assemble it at home, you are doing the job of someone who would have to be paid $25 an hour at some factory. So by assembling it yourself you are that cost. Second important thing is, it’s cheaper to transport a disassembled table compared to an assembled one. It takes a lot less space, so cost of transport is cheaper too. IKEA can fit like 10x more items into a shipping container from China compared to assembled stuff. In India, labor is so cheap, the advantage first point gets is almost zero. IKEA furniture in the west are considered cheap, entry level. There is literally no furniture store that’s cheaper than ikea. the quality of thier furniture is shit! Bought a couple of units and both have developed issues in just 2-3 years! In fact \"Urban company\" has a category Furniture Assembly. Open a store in Delhi and the losses will be recovered in no time. So sad for the billion dollar company Mumbai region itself had three stores and they had shut down one of them. IKEA is not a status symbol, they should have changed the marketing strategy in india Very well put, the only reason ikea even has any sales is due to indians having a brand mentality. Their business model is flawed, they only open a few centers in the south and their online stores are have literally no marketing. When was the last time you saw an ad of Ikea or even a flash sale? Everyone knows when Amazon, Flipkart, Myntra, Ajio etc will have a major sales event and there is almost always a flash sale at anytime you visit their page. They think they are Mercedes, BMW brands who need no advertising? Good riddence. Nothing was cheap there and quality wise it's bad. Almost feel like the defective ones that they get aboard are shipped here to India to earn from the reject stock as well. IKEA is budget furniture in the west. If they price it similar to Indian markets, it would’ve become successful in the metros I have seen plenty of IKEA ads, not sure why you haven’t been getting them. There are lot of western companies which are supposed to be budget stores, but they aren’t in India and we can’t blame them. The losses are coming from capex. The depreciation on the balance sheets is the major drags on their P&L. Their actual sales volumes are only growing and once they meet their investment targets the losses will start reversing course. They are competing with an unstructured but very strong hold traditional carpentry businesses. These small carpenters are cheaper and easy to reach out. Besides that, in India, people still believe that furniture has a long shelf life. If something is broken, it should be \"repaired\" rather than \"replaced\". Ikea model is yet to get acceptance as the customer mindset does not align with their product strategy. Ikea biz model of USA and 1st world where the roads does exist - won’t work in India. For instance- for most of the Bangalore folks going to ikea store in Bangalore is a day trip - it’s not the distance but the traffic bcz Ikea needs to Innovate per Indian market reality India is not a place they would want to sell coz we are a very budgeted and old-school country when it comes to furniture IKEA can be a little expensive and what most people do is they click pictures and will get it done by a local contractor in 10yrs down the line due to generational shift sales may get steady >When was the last time you saw an ad of Ikea or even a flash sale? First time I'm hearing ikea is in India Ikea has low quality furniture for students in the west. It looks good but falls apart after a year or two. It's not supposed to last. Indians mostly don't work like that. Even our inexpensive wooden/cane furniture is made to last. I've seen dovetail joints on plywood furniture made in India. I have a dining table set from the late '60's and it still looks great. Perfectly functional except the veneer has faded with time. A cane sofa set has been around for at least 35 years that I can remember and still going strong. Some people even buy second hand furniture if they can't afford good quality new ones, and refurbish it. The Ikea model won't work because the equivalent consumer in India would be a student, slum dwellers or lower middle class. All groups that cannot afford Ikea prices. Their prices dictate at least a middle income to upper middle income consumer, who is much more picky and demands better quality. Yes, but this still begs the question, why does Ikea feel the need to import disassembled furniture from China to India? why can't it make disassembled furniture here and sell it here, to compete with the local market here? I find it difficult to understand why Ikea can't compete against local furniture. I also see lots of ikea ads, but maybe this is only a Bangalore/Hyderabad thing. I don’t ikea advertises in cities they aren’t present in. This. Meanwhile their competitors market like crazy. Their target audience is literally not aware that IKEA exists A 15% loss in the first few years is not staggering by any means. Amazon India, uber India, ola, flipkart, paytm are all unprofitable. That's just the business model of growth companies. If you read the article, ikea are setting up a few more stores to reach the scale they want. You guys need to stop writing pessimistic tales at every opportunity you get without understanding the nuances. No MNC is ready to leave India. They just keep ploughing profits from their global op to India. That should tell you something. I have see people take ikea designs and get it done cheaper from local carpenters. Those carpenters then pitch those designs to other people who haven’t visited IKEA. You can’t beat Indian jugaad. I live main at the north side of India (Delhi, Punjab, Bengal, Assam, NE states) never seen an ikea ad online or offline It's the locally sourced items rule of the government that is killing them. If they were a US company their government would have put pressure on the Indian government and had the rule removed. IKEA will fail in India unless it adapts to Indian specific conditions. They opened a few stores in the South, refuse to deliver online and most importantly, aren't expanding in T2 and T3 towns. India isn't like western countries where someone would drive 200km in his own pickup truck to acquire the furniture and assemble it themselves. McDolands is also a budget restaurant in the west In the same rhetoric, Amazon and Flipkart started with competing with very strong local/neighborhood grocery stores who also had a free home delivery service and any product found damaged or unsatisfactory could be exchanged immediately, but today the online store have take a massive chunk out of the daily sales of these same store, all because of marketing , pricing and availability. Exactly. When I bought my first furniture, a cupboard, I bought engineered wood because it was cheaper. During installation I regretted buying it because it was not sturdy. The next time I went to the local carpenter. I get a sense of pride while using it. I made it to last generations. Just like the items my father made with his hard earned money and gave to me. I bought an ikea bedside small table. And spent 1 hour last night assembling it. Maybe my 1 hour long curses made them go bankrupt! 😬 Why don't they ship to other cities outside their store locations? For example, NCR has huge demand for their stuff but they do not ship. They could tie up with someone if they don't want to themselves. If they are not keen in expanding their market, of course sales would fall. Also the quality of food in Indian McDonald's is bad compared to European McDonald's. They dont even deliver outside of their home cities. That's a dead in the water strategy. Strangely, Indian McD >>>>> US McD The quality of food in US McDonald's is far worse than India. That's why it's budget. No experience with European McD so can't comment on that O They outsource their manufacturing to Asia which makes their products affordable for Western wages. It's not always feasible to reduce the cost further for the asian market. Realized that IKEA is a luxury brand in India, nope my neighborhood badhai is way better Sir. I read it a few days back that IKEA model works in the West where labour is expensive so mass manufactured factory furniture is cheaper in comparison. While it's a different story in India, labour is very (very very very) affordable here and getting something made is relatively cheaper. Local carpenters can create Ikea designs for me for half the cost using thick plywood and veneer. Particle board is used in practically every Ikea product, which will start creaking within 2 years. Indian carpenters are underrated for their skill. I also bought a custom-designed wardrobe from a nearby factory, they used robust steel gauges on the item. In terms of quality - Furniture: mostly cheap engineered wood. Local shops or even Urbanladder provide better quality. In terms of variety & pricing- Decor: they do have those minimalist items, but online availability is a challenge. The ones in Mumbai Bangalore have to literally go on a full day trip which is not doable. I did buy some good vases and plant pots which turned out good. Organisers: some of them are cheap cardboard, those which are good are not priced right. Lighting: overpriced. Local marwari guy selling at half the price. Crockery & kitchen utensils: I think these are priced right, I really like their glass & plastic containers along with the plates mugs etc. Bottom line, they need to price those items right. McD is budget in India too compared to astronomically priced decent cafes and restaurants now. The timing of IKEA’s loss matches with stricter tax policies. It would be safe to say public is being conservative in spending"
}