{
    "id": "1gkuo23",
    "title": "What do you guys feel about this? ",
    "url": "https://i.redd.it/253rgasy29zd1.png",
    "selftext": "It's been so hard to keep up after Covid. Even with raise in income, I couldn't hit my saving goals. The only possible way to get there was cut down on stuff. I read articles like this almost everyday now and it feels like EVERYONE is upset that we're not spending as much anymore. That's what we are to these companies and everyone else with them. Just numbers. \n\nI want to hear others opinion about it. ",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 8,
    "created_utc": 1730885405.0,
    "convurl": "https://i.redd.it/253rgasy29zd1.png",
    "comments": [
        "Bro there has been basically 0 hiring in government sector in last 6 years in railway, PRT teaching and negligible hiring in SSC mainly this is the middle class which consumes FMCG sector in urban areas. IT sector is struggling recently due to recession idk why government is surprised lol",
        "10 items in a basket 🧺 cost more as compared to last year. People are selective, trying out local options and cost cutting even on many things. People stopped services of companies offering high quality options instead the mood of the nation is to save , pay bills and pay emis. No more extra expenses , on top of that traders getting very expensive and margins going low so no more discount even on bulk these days. Govt wants to see in the positive economic numbers so they are not ready reduce any interest on anything. Fringe elements are on the rise and people hesitation for purchases everywhere.",
        "But the middle class will still vote for \"Saffron Vikas\", and becomes more poor in return...  Especially women from middle class house holds for a \"strong\" leader and become more poor in return...  To the entire focking middle class \"We deserve this only\" !!!!!!!!!!!!!",
        "Cuz there no money blud. Economy is stagnant, sales are flat, export orders are low, demand from abroad is soft, interest rate is high.",
        "\"It's been so hard to keep up after Covid.\"\n\nThis is a misconception. Overall growth in Indian economy and consumer spending has been slowing down since 2019 atleast. There have been multiple reports and articles regarding this, if anything covid actually masked that underperformance. What we are realising today has been in the making for quite a long time.",
        "Bro, everything is too costly these days and getting jobs is also becoming more difficult. People claiming there are no such issues are quietly fleeing to Western countries.",
        "I was just talking about myself brother, I'm sure is not the case with everyone."
    ],
    "cleaned_text": "guys feel hard keep covid even raise income couldnt hit saving goals possible way get cut stuff read articles like almost everyday feels like everyone upset spending much anymore thats companies everyone else numbers want hear others opinion ",
    "cleaned_title": "guys feel",
    "cleaned_selftext": "hard keep covid even raise income couldnt hit saving goals possible way get cut stuff read articles like almost everyday feels like everyone upset spending much anymore thats companies everyone else numbers want hear others opinion",
    "cleaned_comments": "bro basically hiring government sector last years railway prt teaching negligible hiring ssc mainly middle class consumes fmcg sector urban areas sector struggling recently due recession idk government surprised lol items basket cost compared last year people selective trying local options cost cutting even many things people stopped services companies offering high quality options instead mood nation save pay bills pay emis extra expenses top traders getting expensive margins going low discount even bulk days govt wants see positive economic numbers ready reduce interest anything fringe elements rise people hesitation purchases everywhere middle class still vote saffron vikas becomes poor return especially women middle class house holds strong leader become poor return entire focking middle class deserve cuz money blud economy stagnant sales flat export orders low demand abroad soft interest rate high hard keep covid misconception overall growth indian economy consumer spending slowing since atleast multiple reports articles regarding anything covid actually masked underperformance realising today making quite long time bro everything costly days getting jobs also becoming difficult people claiming issues quietly fleeing western countries talking brother im sure case everyone",
    "light_cleaned_title": "What do you guys feel about this?",
    "light_cleaned_selftext": "It's been so hard to keep up after Covid. Even with raise in income, I couldn't hit my saving goals. The only possible way to get there was cut down on stuff. I read articles like this almost everyday now and it feels like EVERYONE is upset that we're not spending as much anymore. That's what we are to these companies and everyone else with them. Just numbers. I want to hear others opinion about it.",
    "light_cleaned_comments": "Bro there has been basically 0 hiring in government sector in last 6 years in railway, PRT teaching and negligible hiring in SSC mainly this is the middle class which consumes FMCG sector in urban areas. IT sector is struggling recently due to recession idk why government is surprised lol 10 items in a basket 🧺 cost more as compared to last year. People are selective, trying out local options and cost cutting even on many things. People stopped services of companies offering high quality options instead the mood of the nation is to save , pay bills and pay emis. No more extra expenses , on top of that traders getting very expensive and margins going low so no more discount even on bulk these days. Govt wants to see in the positive economic numbers so they are not ready reduce any interest on anything. Fringe elements are on the rise and people hesitation for purchases everywhere. But the middle class will still vote for \"Saffron Vikas\", and becomes more poor in return... Especially women from middle class house holds for a \"strong\" leader and become more poor in return... To the entire focking middle class \"We deserve this only\" !!!!!!!!!!!!! Cuz there no money blud. Economy is stagnant, sales are flat, export orders are low, demand from abroad is soft, interest rate is high. \"It's been so hard to keep up after Covid.\" This is a misconception. Overall growth in Indian economy and consumer spending has been slowing down since 2019 atleast. There have been multiple reports and articles regarding this, if anything covid actually masked that underperformance. What we are realising today has been in the making for quite a long time. Bro, everything is too costly these days and getting jobs is also becoming more difficult. People claiming there are no such issues are quietly fleeing to Western countries. I was just talking about myself brother, I'm sure is not the case with everyone."
}