{
    "id": "152ykws",
    "title": "135 million people pulled out of poverty",
    "url": "https://www.reddit.com/gallery/152ykws",
    "selftext": "Source:- https://economictimes.indiatimes.com/news/india/proportion-of-poor-dips-to-14-9-135-m-pulled-out-of-poverty/articleshow/101837072.cms",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689687091.0,
    "convurl": "https://i.redd.it/fz9ziz987qcb1.jpg",
    "comments": [
        "Hmmm so this includes the demonetization mess which Modiji himself avoids talking about nd 2 to 3 years of Covid 🤔 ..",
        "Did they adjust the poverty line to the inflation rate? If they didn't that explains it.",
        "Done by Niti Aayog.. don’t question/s",
        "yes they did and also most of the gains happened before 2014.",
        "Bullshit. \n\n80 million people moved into poverty right around the time the pandemic started, more after.  These were published numbers in newspapers & articles over 2021-22.\n\nAlso stated, the highest % of people who moved under BPL since Independence.\n\n2024 is election year & this drama has just started.\n\nWait for Vishwaguru moments one after the other coming up.",
        "Does Niti Aayog do anything besides make fake statistics?",
        "Sources for 80 million? A lot of unsubstantiated stuff is published in newspapers.",
        "Ok I wasn't aware. My bad",
        "Could you quantify that and give references?",
        "mudizi still not allowing NSSO data to be released. Wonder why",
        "Ok.. Which all numbers are false? Can you give me some references?",
        "Poverty line in India is defined as someone making 1300 a month in urban areas and 1000 in rural areas. This hasn't been updated for the last 8 years. \n\nDo you think there was no inflation in the last 8 years? How would you feel if your salary was the same for 8 years?\n\nThe first thing Modi did after coming into power at the centre was dismantle the Planning Commission and introduce this department of disinformation in its place",
        "The Niti Aayog delivers customized statistics as per your requirement. /S",
        "You have not even read the article, they have not assessed poverty on income alone. \nIt mentions multi-dimensional indices to access poverty and not income alone.\n\nThat is what NITI ayog is different from the planning commission. Planning commission relied wholly on stats and were focused on number crunching.\nSo what you have mentioned is a figure from the planning commission.\nNITI ayog is assessing poverty from the perspective of accessibility to basic infrastructure like health, education, housing, banking, etc.\nSo despite low income, through social benefits schemes they are able to access these facilities.",
        "This is during pandemic [India providing free ration to about 80 crore poor people for last 7-8 months: PM Modi...](https://www.newindianexpress.com/nation/2020/oct/16/india-providing-free-ration-to-about-80-crore-poor-people-for-last-7-8-months-pm-modi-2211076.html)",
        "The article is behind a paywall. But at least you admit that Niti Aayog relies on subjective criteria and Planning Commission relied on objectivity.",
        "The comments section is a fucking shitshow lmao",
        "What were you expecting?\n\"Mudi zi bestest PM in whole world! All leaders want autograph!\"?",
        "I was expecting decency, happiness at people being lifted out of poverty.",
        "Most people are barely able to keep up with inflation with basic commodities.",
        "Poverty index pe scrutiny krte hai but Happiness index ko hasi khushi accept kr lete hai🤣🤣🤣",
        "Just a question who declared us vishwaguru. Where did this term come from ?",
        "Lol... Reminds me of the saying... torture the data enough, and it will confess what you want to hear.",
        "People would express happiness if IT WAS TRUE.\n\nThis is like saying people who were burning by throwing them in the ocean and celebrating without seeing if those people even know how to swim or not",
        "Dude all the information you need is clearly mentioned in the image, it is just you refusal to accept reality.\n\nAlso I have mentioned dimensionality so the discussion is not about objectivity, but about aspects which are not captured in statistics."
    ],
    "cleaned_text": "million people pulled poverty source ",
    "cleaned_title": "million people pulled poverty",
    "cleaned_selftext": "source",
    "cleaned_comments": "hmmm includes demonetization mess modiji avoids talking nd years covid adjust poverty line inflation rate didnt explains done niti aayog dont questions yes also gains happened bullshit million people moved poverty right around time pandemic started published numbers newspapers articles also stated highest people moved bpl since independence election year drama started wait vishwaguru moments one coming niti aayog anything besides make fake statistics sources million lot unsubstantiated stuff published newspapers ok wasnt aware bad could quantify give references mudizi still allowing nsso data released wonder ok numbers false give references poverty line india defined someone making month urban areas rural areas hasnt updated last years think inflation last years would feel salary years first thing modi coming power centre dismantle planning commission introduce department disinformation place niti aayog delivers customized statistics per requirement even read article assessed poverty income alone mentions multidimensional indices access poverty income alone niti ayog different planning commission planning commission relied wholly stats focused number crunching mentioned figure planning commission niti ayog assessing poverty perspective accessibility basic infrastructure like health education housing banking etc despite low income social benefits schemes able access facilities pandemic india providing free ration crore poor people last months pm modihttpswwwnewindianexpresscomnationoctindiaprovidingfreerationtoaboutcrorepoorpeopleforlastmonthspmmodihtml article behind paywall least admit niti aayog relies subjective criteria planning commission relied objectivity comments section fucking shitshow lmao expecting mudi zi bestest pm whole world leaders want autograph expecting decency happiness people lifted poverty people barely able keep inflation basic commodities poverty index pe scrutiny krte hai happiness index ko hasi khushi accept kr lete hai question declared us vishwaguru term come lol reminds saying torture data enough confess want hear people would express happiness true like saying people burning throwing ocean celebrating without seeing people even know swim dude information need clearly mentioned image refusal accept reality also mentioned dimensionality discussion objectivity aspects captured statistics",
    "light_cleaned_title": "135 million people pulled out of poverty",
    "light_cleaned_selftext": "Source:-",
    "light_cleaned_comments": "Hmmm so this includes the demonetization mess which Modiji himself avoids talking about nd 2 to 3 years of Covid 🤔 .. Did they adjust the poverty line to the inflation rate? If they didn't that explains it. Done by Niti Aayog.. don’t question/s yes they did and also most of the gains happened before 2014. Bullshit. 80 million people moved into poverty right around the time the pandemic started, more after. These were published numbers in newspapers & articles over 2021-22. Also stated, the highest % of people who moved under BPL since Independence. 2024 is election year & this drama has just started. Wait for Vishwaguru moments one after the other coming up. Does Niti Aayog do anything besides make fake statistics? Sources for 80 million? A lot of unsubstantiated stuff is published in newspapers. Ok I wasn't aware. My bad Could you quantify that and give references? mudizi still not allowing NSSO data to be released. Wonder why Ok.. Which all numbers are false? Can you give me some references? Poverty line in India is defined as someone making 1300 a month in urban areas and 1000 in rural areas. This hasn't been updated for the last 8 years. Do you think there was no inflation in the last 8 years? How would you feel if your salary was the same for 8 years? The first thing Modi did after coming into power at the centre was dismantle the Planning Commission and introduce this department of disinformation in its place The Niti Aayog delivers customized statistics as per your requirement. /S You have not even read the article, they have not assessed poverty on income alone. It mentions multi-dimensional indices to access poverty and not income alone. That is what NITI ayog is different from the planning commission. Planning commission relied wholly on stats and were focused on number crunching. So what you have mentioned is a figure from the planning commission. NITI ayog is assessing poverty from the perspective of accessibility to basic infrastructure like health, education, housing, banking, etc. So despite low income, through social benefits schemes they are able to access these facilities. This is during pandemic [India providing free ration to about 80 crore poor people for last 7-8 months: PM Modi...](https://www.newindianexpress.com/nation/2020/oct/16/india-providing-free-ration-to-about-80-crore-poor-people-for-last-7-8-months-pm-modi-2211076.html) The article is behind a paywall. But at least you admit that Niti Aayog relies on subjective criteria and Planning Commission relied on objectivity. The comments section is a fucking shitshow lmao What were you expecting? \"Mudi zi bestest PM in whole world! All leaders want autograph!\"? I was expecting decency, happiness at people being lifted out of poverty. Most people are barely able to keep up with inflation with basic commodities. Poverty index pe scrutiny krte hai but Happiness index ko hasi khushi accept kr lete hai🤣🤣🤣 Just a question who declared us vishwaguru. Where did this term come from ? Lol... Reminds me of the saying... torture the data enough, and it will confess what you want to hear. People would express happiness if IT WAS TRUE. This is like saying people who were burning by throwing them in the ocean and celebrating without seeing if those people even know how to swim or not Dude all the information you need is clearly mentioned in the image, it is just you refusal to accept reality. Also I have mentioned dimensionality so the discussion is not about objectivity, but about aspects which are not captured in statistics."
}