{
    "id": "f2mvuh",
    "title": "Workplace Surveillance: Your employer could be watching you",
    "url": "https://www.reddit.com/r/india/comments/f2mvuh/workplace_surveillance_your_employer_could_be/",
    "selftext": "### \n\nhttps://preview.redd.it/7mv86kazrfg41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=a8f2d2839802afc223f409a31c337514b1e33c9b\n\n### Tl;dr\n\nIFF has prepared a public brief highlighting the impact of the Personal Data Protection Bill 2019 on workplace surveillance. Technologies like CCTV cameras, location tracking and device monitoring have made it possible for employers to turn workplaces into a panopticon, and such pervasive surveillance undermines the dignity of labour and the ability of workers to unionise. We encourage you to read the brief and participate in the consultation being held by the Joint Parliamentary Committee to ensure existing power imbalances between workers and employers are not exacerbated by the Bill.\n\n### Your boss shouldn't be Big Boss\n\nMuch has been written about the exemptions provided under the Personal Data Protection Bill 2019 for governmental surveillance but there is another form of surveillance which the Bill permits that we should all be worried about. Clause 13 of the Bill exempts employers from seeking consent prior to processing personal data of their employees for recruitment and termination of employment, provision of services and benefits, verification of attendance and performance assessment. With advancement in technology, employers now have the ability to continuously monitor the real time activity of their employees through CCTV cameras, location tracking, device monitoring etc. By allowing employers to track bathroom breaks, lunch breaks and meetings of employees, such technologies pose a threat to the dignity of labour and the ability of workers to unionise. \n\n### Recommendations \n\nIn order to ensure that any workplace surveillance is strictly need based, context specific and minimize intrusion into the personal lives of employees, we recommend that the following changes are made to the Personal Data Protection Bill 2019.\n\n1. The principles of necessity and proportionality should be included under Clause 13, PDP Bill 2019.\n2. A mandatory obligation should be imposed on the employer to consult employees and seek their views prior to processing personal data under Clause 13, PDP Bill 2019.\n3. The Data Protection Authority should be entrusted with the responsibility of issuing a Code of Practice for workplace surveillance under Clause 50, PDP Bill 2019.\n4. The Code of Practice for workplace surveillance issued by the Data Protection Authority should impose a prohibition on monitoring of any unionisation related activity and prescribe penalties for the same.\n5. Trade Union affiliation should be categorised as sensitive personal data under Clause 3(36), PDP Bill 2019.\n\n### Read the public brief and engage with the JPC\n\nFor more information, we encourge you to read our public brief on the impact of the Personal Data Protection Bill 2019 on workplace surveillance. The brief highlights the impact of workplace surveillance on the fundamental right to unionise guaranteed by Article 19(1)(c) and the fundamental right to privacy guaranteed by Articles 14, 19 and 21 of the Constitution. It further explains existing provisions relating to workplace surveillance under the Bill and discusses their pros and cons. Following from the earlier discussion, the brief finally recommends five changes to the Bill to ensure that the existing power imbalances between employers and employees are not exacerbated by pervasive workplace surveillance.\n\nIf you are a trade union or employee association which needs more information about the Personal Data Protection Bill 2019, please feel free to reach out to us at policy@internetfreedom.in. We encourage people to share this brief widely in their circles and participate in the consultation being held by the Joint Parliamentary Committee on the Bill. You can participate in the consultation by sending comments via email to [**jpc-datalaw@sansad.nic.in**](mailto:jpc-datalaw@sansad.nic.in) and [**mrs.mlekhi@sansad.nic.in**](https://saveourprivacy.in/admin/entries/blog/mrs.mlekhi@sansad.nic.in) by 25 February 2020. \n\n### Important Documents:\n\n1. Public Brief on Impact of the Personal Data Protection Bill 2019 on Workplace Surveillance ([**link**](https://drive.google.com/file/d/1qjZfNEZjr9ohtGzMXsulzmgsrKXma-Rf/view?usp=sharing))\n\n### The modern gig economy shouldn't come with 360 degree surveillance of workers. IFF represents all Indians affected by surveillance including workers. Support our mission by [becoming an IFF member today!](https://internetfreedom.in/donate/)",
    "flair": "Policy/Economy",
    "score": 32,
    "num_comments": 0,
    "created_utc": 1581488587,
    "convurl": "https://b.thumbs.redditmedia.com/Gu6s2R5VyCQdi8wANVUtV-OlgejhNkj9iuK9pEq4cac.jpg",
    "comments": [],
    "cleaned_text": "workplace surveillance employer could watching tldr iff prepared public brief highlighting impact personal data protection bill workplace surveillance technologies like cctv cameras location tracking device monitoring made possible employers turn workplaces panopticon pervasive surveillance undermines dignity labour ability workers unionise encourage read brief participate consultation held joint parliamentary committee ensure existing power imbalances workers employers exacerbated bill boss shouldnt big boss much written exemptions provided personal data protection bill governmental surveillance another form surveillance bill permits worried clause bill exempts employers seeking consent prior processing personal data employees recruitment termination employment provision services benefits verification attendance performance assessment advancement technology employers ability continuously monitor real time activity employees cctv cameras location tracking device monitoring etc allowing employers track bathroom breaks lunch breaks meetings employees technologies pose threat dignity labour ability workers unionise recommendations order ensure workplace surveillance strictly need based context specific minimize intrusion personal lives employees recommend following changes made personal data protection bill principles necessity proportionality included clause pdp bill mandatory obligation imposed employer consult employees seek views prior processing personal data clause pdp bill data protection authority entrusted responsibility issuing code practice workplace surveillance clause pdp bill code practice workplace surveillance issued data protection authority impose prohibition monitoring unionisation related activity prescribe penalties trade union affiliation categorised sensitive personal data clause pdp bill read public brief engage jpc information encourge read public brief impact personal data protection bill workplace surveillance brief highlights impact workplace surveillance fundamental right unionise guaranteed article c fundamental right privacy guaranteed articles constitution explains existing provisions relating workplace surveillance bill discusses pros cons following earlier discussion brief finally recommends five changes bill ensure existing power imbalances employers employees exacerbated pervasive workplace surveillance trade union employee association needs information personal data protection bill please feel free reach us policyinternetfreedomin encourage people share brief widely circles participate consultation held joint parliamentary committee bill participate consultation sending comments via email jpcdatalawsansadnicinmailtojpcdatalawsansadnicin mrsmlekhisansadnicinhttpssaveourprivacyinadminentriesblogmrsmlekhisansadnicin february important documents public brief impact personal data protection bill workplace surveillance linkhttpsdrivegooglecomfiledqjzfnezjrohtgzmxsulzmgsrkxmarfviewuspsharing modern gig economy shouldnt come degree surveillance workers iff represents indians affected surveillance including workers support mission becoming iff member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "workplace surveillance employer could watching",
    "cleaned_selftext": "tldr iff prepared public brief highlighting impact personal data protection bill workplace surveillance technologies like cctv cameras location tracking device monitoring made possible employers turn workplaces panopticon pervasive surveillance undermines dignity labour ability workers unionise encourage read brief participate consultation held joint parliamentary committee ensure existing power imbalances workers employers exacerbated bill boss shouldnt big boss much written exemptions provided personal data protection bill governmental surveillance another form surveillance bill permits worried clause bill exempts employers seeking consent prior processing personal data employees recruitment termination employment provision services benefits verification attendance performance assessment advancement technology employers ability continuously monitor real time activity employees cctv cameras location tracking device monitoring etc allowing employers track bathroom breaks lunch breaks meetings employees technologies pose threat dignity labour ability workers unionise recommendations order ensure workplace surveillance strictly need based context specific minimize intrusion personal lives employees recommend following changes made personal data protection bill principles necessity proportionality included clause pdp bill mandatory obligation imposed employer consult employees seek views prior processing personal data clause pdp bill data protection authority entrusted responsibility issuing code practice workplace surveillance clause pdp bill code practice workplace surveillance issued data protection authority impose prohibition monitoring unionisation related activity prescribe penalties trade union affiliation categorised sensitive personal data clause pdp bill read public brief engage jpc information encourge read public brief impact personal data protection bill workplace surveillance brief highlights impact workplace surveillance fundamental right unionise guaranteed article c fundamental right privacy guaranteed articles constitution explains existing provisions relating workplace surveillance bill discusses pros cons following earlier discussion brief finally recommends five changes bill ensure existing power imbalances employers employees exacerbated pervasive workplace surveillance trade union employee association needs information personal data protection bill please feel free reach us policyinternetfreedomin encourage people share brief widely circles participate consultation held joint parliamentary committee bill participate consultation sending comments via email jpcdatalawsansadnicinmailtojpcdatalawsansadnicin mrsmlekhisansadnicinhttpssaveourprivacyinadminentriesblogmrsmlekhisansadnicin february important documents public brief impact personal data protection bill workplace surveillance linkhttpsdrivegooglecomfiledqjzfnezjrohtgzmxsulzmgsrkxmarfviewuspsharing modern gig economy shouldnt come degree surveillance workers iff represents indians affected surveillance including workers support mission becoming iff member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Workplace Surveillance: Your employer could be watching you",
    "light_cleaned_selftext": "### ### Tl;dr IFF has prepared a public brief highlighting the impact of the Personal Data Protection Bill 2019 on workplace surveillance. Technologies like CCTV cameras, location tracking and device monitoring have made it possible for employers to turn workplaces into a panopticon, and such pervasive surveillance undermines the dignity of labour and the ability of workers to unionise. We encourage you to read the brief and participate in the consultation being held by the Joint Parliamentary Committee to ensure existing power imbalances between workers and employers are not exacerbated by the Bill. ### Your boss shouldn't be Big Boss Much has been written about the exemptions provided under the Personal Data Protection Bill 2019 for governmental surveillance but there is another form of surveillance which the Bill permits that we should all be worried about. Clause 13 of the Bill exempts employers from seeking consent prior to processing personal data of their employees for recruitment and termination of employment, provision of services and benefits, verification of attendance and performance assessment. With advancement in technology, employers now have the ability to continuously monitor the real time activity of their employees through CCTV cameras, location tracking, device monitoring etc. By allowing employers to track bathroom breaks, lunch breaks and meetings of employees, such technologies pose a threat to the dignity of labour and the ability of workers to unionise. ### Recommendations In order to ensure that any workplace surveillance is strictly need based, context specific and minimize intrusion into the personal lives of employees, we recommend that the following changes are made to the Personal Data Protection Bill 2019. 1. The principles of necessity and proportionality should be included under Clause 13, PDP Bill 2019. 2. A mandatory obligation should be imposed on the employer to consult employees and seek their views prior to processing personal data under Clause 13, PDP Bill 2019. 3. The Data Protection Authority should be entrusted with the responsibility of issuing a Code of Practice for workplace surveillance under Clause 50, PDP Bill 2019. 4. The Code of Practice for workplace surveillance issued by the Data Protection Authority should impose a prohibition on monitoring of any unionisation related activity and prescribe penalties for the same. 5. Trade Union affiliation should be categorised as sensitive personal data under Clause 3(36), PDP Bill 2019. ### Read the public brief and engage with the JPC For more information, we encourge you to read our public brief on the impact of the Personal Data Protection Bill 2019 on workplace surveillance. The brief highlights the impact of workplace surveillance on the fundamental right to unionise guaranteed by Article 19(1)(c) and the fundamental right to privacy guaranteed by Articles 14, 19 and 21 of the Constitution. It further explains existing provisions relating to workplace surveillance under the Bill and discusses their pros and cons. Following from the earlier discussion, the brief finally recommends five changes to the Bill to ensure that the existing power imbalances between employers and employees are not exacerbated by pervasive workplace surveillance. If you are a trade union or employee association which needs more information about the Personal Data Protection Bill 2019, please feel free to reach out to us at policy@internetfreedom.in. We encourage people to share this brief widely in their circles and participate in the consultation being held by the Joint Parliamentary Committee on the Bill. You can participate in the consultation by sending comments via email to [**jpc-datalaw@sansad.nic.in**](mailto:jpc-datalaw@sansad.nic.in) and [**mrs.mlekhi@sansad.nic.in**](https://saveourprivacy.in/admin/entries/blog/mrs.mlekhi@sansad.nic.in) by 25 February 2020. ### Important Documents: 1. Public Brief on Impact of the Personal Data Protection Bill 2019 on Workplace Surveillance ([**link**](https://drive.google.com/file/d/1qjZfNEZjr9ohtGzMXsulzmgsrKXma-Rf/view?usp=sharing)) ### The modern gig economy shouldn't come with 360 degree surveillance of workers. IFF represents all Indians affected by surveillance including workers. Support our mission by [becoming an IFF member today!](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": ""
}