{
    "id": "142pqzl",
    "title": "Friend brought Indian \"excellent spices\" + cook book to Europe - does anyone know them?",
    "url": "https://www.reddit.com/r/india/comments/142pqzl/friend_brought_indian_excellent_spices_cook_book/",
    "selftext": "Hey Peeps!\n\nI'm recently starting to get into cooking, and Indian cooking particularly (what a challenge it is...) and a friend of mine was in India over December and brought back some spice packages from a market there, including a matching miniature cookbook.\n\nHe gifted me the spice packages and (being used to more mundane stuff) they seem great! Now unfortunately he lost the cook book (it seemed v handy) and all my googling couldn't help me, couldn't even find the spice brand (due to it being local, or simply more generic, I think).\n\nDo any of you know more about this brand, how to use it best or even have the cookbook? I'd love to use it as a guide :)\n\nThanks in advance! \n\n[Pic of one of the spice packages](https://imgur.com/a/jL93ZQY), I have Hot Chili, Super Tea Masala, Chicken Masala and I think Bombay Curry",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 8,
    "created_utc": 1686077530.0,
    "convurl": "https://external-preview.redd.it/jiY_WGxvWP9ajFUBB0aaDO7R_d8iZPYGFSH9yfUZeCg.jpg?auto=webp&v=enabled&s=679a6b5182ea2038f85e61499fb786ab58bd8fa4",
    "comments": [
        "Can you read? Do you see a brand? Do you see the letters T E A, together these letters form Tea = ☕️ which is a drink. Now can you bring all this together for me.\n\nDo I need to explain chicken 🐓?",
        "Hey man, I do know what Tea Masala is used for :)\nI mainly trying to show an example of the brand I have multiple sachets of - idk, maybe Excellent Spices is sold somewhere else as well? \n\nHope you have a nice day!",
        "It's not a commercially produced brand.       \nYour friend seems to have bought them from [this shop](https://www.google.com/maps/place/Shop+No,+Excellent+Spices,+78,+Dr+Dadabhai+Naoroji+Rd,+inside+Crawford+Market,+Dhobi+Talao,+Chhatrapati+Shivaji+Terminus+Area,+Fort,+Mumbai,+Maharashtra+400001/data=!4m2!3m1!1s0x3be7ce26cb9c5beb:0xb508dd892e7248a9?utm_source=mstt_1&entry=gps&lucs=47068615) and they are probably their in-store blends.      \nTheir [website](http://www.excellentfoods.in/shipping-and-returns-policy/) has a few contact options that you can use to get in touch and see if you can get the cookbook somehow.",
        "Hey! I'm sorry if you feel offended at the above guy's comment. He/She/They're just being sarcastic with u cos... \nThings are pretty simple in India. Most of us aren't into branded items & thus, there's no specific way to use a particular product. \nIt's a traditional 'chai masala' aka tea spice so u can go & check on YT: how to make a simple chai/tea. If there are any Indian markets near u, u might also be able to find diff. & better cookbooks. But usually, as an Indian I prefer YT\n\nBtw, I don't know why I felt so self-conscious, so much so that I used all pronouns to refer to the above commenter. As, I said things are way simple in India & no Indian would've gotten mad at me for assuming someone's gender. But I've had first-hand encounters with foreigners who get mad AF. Nowadays, I even avoid foreigners at my office in Bangalore😭\nPls don't get mad at me if I made in mistake. Living life must be confusing in the west...",
        "Thank you so much for finding that, I appreciate it! :) \nI'll be sure to get in touch with them, let's see",
        "Thank you for the kind comment and the explanation regarding the usage! \nHonestly, if someone got mad at you for using the wrong pronouns in a misunderstanding, they're mostly a dick. If you wanna \"stay safe\", I'd recommend using \"they\" in English as that is the correct way to talk about people you don't know the gender of. \nLife isn't confusing in the West, we don't fight each other over things like that all the time ;)\n\nThanks again and have a good time!"
    ],
    "cleaned_text": "friend brought indian excellent spices cook book europe anyone know hey peeps im recently starting get cooking indian cooking particularly challenge friend mine india december brought back spice packages market including matching miniature cookbook gifted spice packages used mundane stuff seem great unfortunately lost cook book seemed v handy googling couldnt help couldnt even find spice brand due local simply generic think know brand use best even cookbook id love use guide thanks advance pic one spice packageshttpsimgurcomajlzqy hot chili super tea masala chicken masala think bombay curry ",
    "cleaned_title": "friend brought indian excellent spices cook book europe anyone know",
    "cleaned_selftext": "hey peeps im recently starting get cooking indian cooking particularly challenge friend mine india december brought back spice packages market including matching miniature cookbook gifted spice packages used mundane stuff seem great unfortunately lost cook book seemed v handy googling couldnt help couldnt even find spice brand due local simply generic think know brand use best even cookbook id love use guide thanks advance pic one spice packageshttpsimgurcomajlzqy hot chili super tea masala chicken masala think bombay curry",
    "cleaned_comments": "read see brand see letters e together letters form tea drink bring together need explain chicken hey man know tea masala used mainly trying show example brand multiple sachets idk maybe excellent spices sold somewhere else well hope nice day commercially produced brand friend seems bought shophttpswwwgooglecommapsplaceshopnoexcellentspicesdrdadabhainaorojirdinsidecrawfordmarketdhobitalaochhatrapatishivajiterminusareafortmumbaimaharashtradatammsxbececbcbebxbddeautmsourcemsttentrygpslucs probably instore blends websitehttpwwwexcellentfoodsinshippingandreturnspolicy contact options use get touch see get cookbook somehow hey im sorry feel offended guys comment heshetheyre sarcastic u cos things pretty simple india us arent branded items thus theres specific way use particular product traditional chai masala aka tea spice u go check yt make simple chaitea indian markets near u u might also able find diff better cookbooks usually indian prefer yt btw dont know felt selfconscious much used pronouns refer commenter said things way simple india indian wouldve gotten mad assuming someones gender ive firsthand encounters foreigners get mad af nowadays even avoid foreigners office bangalore pls dont get mad made mistake living life must confusing west thank much finding appreciate ill sure get touch lets see thank kind comment explanation regarding usage honestly someone got mad using wrong pronouns misunderstanding theyre mostly dick wan na stay safe id recommend using english correct way talk people dont know gender life isnt confusing west dont fight things like time thanks good time",
    "light_cleaned_title": "Friend brought Indian \"excellent spices\" + cook book to Europe - does anyone know them?",
    "light_cleaned_selftext": "Hey Peeps! I'm recently starting to get into cooking, and Indian cooking particularly (what a challenge it is...) and a friend of mine was in India over December and brought back some spice packages from a market there, including a matching miniature cookbook. He gifted me the spice packages and (being used to more mundane stuff) they seem great! Now unfortunately he lost the cook book (it seemed v handy) and all my googling couldn't help me, couldn't even find the spice brand (due to it being local, or simply more generic, I think). Do any of you know more about this brand, how to use it best or even have the cookbook? I'd love to use it as a guide :) Thanks in advance! [Pic of one of the spice packages](https://imgur.com/a/jL93ZQY), I have Hot Chili, Super Tea Masala, Chicken Masala and I think Bombay Curry",
    "light_cleaned_comments": "Can you read? Do you see a brand? Do you see the letters T E A, together these letters form Tea = ☕️ which is a drink. Now can you bring all this together for me. Do I need to explain chicken 🐓? Hey man, I do know what Tea Masala is used for :) I mainly trying to show an example of the brand I have multiple sachets of - idk, maybe Excellent Spices is sold somewhere else as well? Hope you have a nice day! It's not a commercially produced brand. Your friend seems to have bought them from [this shop](https://www.google.com/maps/place/Shop+No,+Excellent+Spices,+78,+Dr+Dadabhai+Naoroji+Rd,+inside+Crawford+Market,+Dhobi+Talao,+Chhatrapati+Shivaji+Terminus+Area,+Fort,+Mumbai,+Maharashtra+400001/data=!4m2!3m1!1s0x3be7ce26cb9c5beb:0xb508dd892e7248a9?utm_source=mstt_1&entry=gps&lucs=47068615) and they are probably their in-store blends. Their [website](http://www.excellentfoods.in/shipping-and-returns-policy/) has a few contact options that you can use to get in touch and see if you can get the cookbook somehow. Hey! I'm sorry if you feel offended at the above guy's comment. He/She/They're just being sarcastic with u cos... Things are pretty simple in India. Most of us aren't into branded items & thus, there's no specific way to use a particular product. It's a traditional 'chai masala' aka tea spice so u can go & check on YT: how to make a simple chai/tea. If there are any Indian markets near u, u might also be able to find diff. & better cookbooks. But usually, as an Indian I prefer YT Btw, I don't know why I felt so self-conscious, so much so that I used all pronouns to refer to the above commenter. As, I said things are way simple in India & no Indian would've gotten mad at me for assuming someone's gender. But I've had first-hand encounters with foreigners who get mad AF. Nowadays, I even avoid foreigners at my office in Bangalore😭 Pls don't get mad at me if I made in mistake. Living life must be confusing in the west... Thank you so much for finding that, I appreciate it! :) I'll be sure to get in touch with them, let's see Thank you for the kind comment and the explanation regarding the usage! Honestly, if someone got mad at you for using the wrong pronouns in a misunderstanding, they're mostly a dick. If you wanna \"stay safe\", I'd recommend using \"they\" in English as that is the correct way to talk about people you don't know the gender of. Life isn't confusing in the West, we don't fight each other over things like that all the time ;) Thanks again and have a good time!"
}