{
    "id": "193frxm",
    "title": "Missing Man from Seattle May Be in India",
    "url": "https://www.reddit.com/r/india/comments/193frxm/missing_man_from_seattle_may_be_in_india/",
    "selftext": "I posted in this case in many subreddits a while ago about Julia Potter, the girl who was kidnapped by her dad, Jason Potter, in November of 2014. You can read the original post down below.\n\nThere has been an update on the case with new information released about Jason Potter. Fox 13 Seattle stated that detectives believe he is going out in public dressed as a woman. \n\nJason Potter could also be in the Himalayas, India, and Nepal. \n\nTo read the article and see a picture of what Jason Potter may look like dressed as a woman, [click here](https://www.fox13seattle.com/news/seattle-police-release-new-age-progression-photo-of-child-abducted-by-biological-father-in-2014).\n\nIf you are living in the Seattle area or happen to know any additional information about Jason Potter or Julia Potter, you can contact Seattle Police Det. Rande Christiansen at (206)615-0066. \n\nYou can also leave an anonymous tip to the Crime Stoppers of Puget Sound and can get a cash reward of up to $1000 by calling 1-800-222-TIPS or by using the P3 Tips app.\n\nLet’s help get Julia home to her mother. \n\nOriginal Post is down below.\n\n______________________________________\nThis case has always stuck out to me, even 10 years later. I was 11 or 12 years old when the show Washington’s Most Wanted did a segment on Julia Potter. She was 6 years old at the time and she was abducted by her father, Jason Potter from her Seattle home. Julia’s mother created a facebook page dedicated to finding her daughter. (Since this community doesn’t allow Facebook links, the name of the page is “Finding abducted Julia Potter, 16 years old WA US”) Jason Potter, according to people who know him, has been known to be a weird guy. He has a nationwide warrant for his arrest and he called his private lawyer to let them know he will be living off grid. He also updated his profile picture to Lionel Richie saying “Hello? Is it me you’re looking for?”. The only known sighting of Jason Potter was when he was seen visiting a nursing home in Olympia WA and a staff member recognized him.\n\nA possible sighting might have been in the North Olympic Peninsula. A woman suspects that the man she saw with a teenager during her time in the North Olympic Peninsula in WA was Jason Potter. She reported it to the federal marshal and felt as if the man she saw was Jason Potter after viewing the Finding Julia facebook page. \n\n Another instance was someone finding a box of letters written by Jason Potter in a box at goodwill. This information was left as a comment in one of the posts that belonged to Julia’s mother on facebook (the comment cannot be found and it is presumed to be deleted: the only information known about the comment is that the letters were described to be strange and they were handed off to police). Ten years later, this case remains unsolved and not much coverage has been shined on it, limiting the amount of people to be informed on it in the PNW and beyond.  It has been said that Jason Potter has ties in Bellingham, Tacoma, and Oregon City, Oregon. \n\nTo those living in the PNW and to those living outside of the PNW: Have you heard of the case? Is there any information you may know about both Jason and Julia Potter so we can give her mother answers?\n\nAdditional Links and info:\n- Julia’s mothers Facebook page features her most recent posts that include AI generated images of what Julia may look like now.\n\n- [Julia’s missingkids.org Poster](https://www.missingkids.org/poster/ncmc/1240281/1) which features age progression images of both Julia and Jason Potter\n\n- [a KOMO news article](https://komonews.com/amp/news/local/seattle-police-looking-for-girl-abducted-7-years-ago-suspect-possibly-seen-in-olympia) relating to Julia’s case\n\n- [An Investigation Discovery article](https://www.investigationdiscovery.com/crimefeed/id-shows/on-tv0/in-pursuit-with-john-walsh/articles/seattle-jason-potter-julia-potter-abducted-daughter) also detailing Julia’s Case",
    "flair": "Crime",
    "score": 50,
    "num_comments": 12,
    "created_utc": 1704912585.0,
    "convurl": "https://external-preview.redd.it/ZDNN97eGVijp6hareUZ51YZHf_jwAOuy42HwNiq135w.jpg?auto=webp&s=f6c87284647b83d63ddc59f709dcfa3e8533d126",
    "comments": [
        "atithi devo bhava",
        "To clarify, he isn’t a missing man, but a Wanted Man.",
        "thank you ♥️",
        "Why do they believe he could be in India?",
        ">Jason Potter could also be in the Himalayas, India, and Nepal. \n\nIs there a lead or intelligent guess or reasonable suspicion to back this information.",
        "looking into it. i’ll update once i have an answer as i too am curious on why they believe he’s there.",
        "I feel like India and Nepal got thrown into this article because why the fuck not. Doesnt make any sense",
        "And The Yeti is also in the Himalayas /s, there are thousands missing people including children here in India itself lets try finding our people first b4 we look for others",
        "I think Hogwarts is the likely location to find them. The muggles can never get to them.",
        "The fuck are these posts of late with posters thinking up random shit related to India? We're enemies with Pakistan because they're fair, and now some creep from Seattle is in India because OP thinks so?",
        "No its not because OP thinks so, its because of Seattle Police. But Im curious why they think hes in India.",
        "He could be in India, Himalayas or Nepal is equivalent to saying he could be California, Sierra Nevada or Arizona. Makes no sense.",
        "Probably came to try Butter Chicken and Naan and stayed for the bidets.",
        "Ok, I guess I missed that - the [Fox-Seattle article](https://www.fox13seattle.com/news/seattle-police-release-new-age-progression-photo-of-child-abducted-by-biological-father-in-2014) has it. That line just stands out as weird from the rest of the article. Gotta say guy looks hot dressed as a woman."
    ],
    "cleaned_text": "missing man seattle may india posted case many subreddits ago julia potter girl kidnapped dad jason potter november read original post update case new information released jason potter fox seattle stated detectives believe going public dressed woman jason potter could also himalayas india nepal read article see picture jason potter may look like dressed woman click herehttpswwwfoxseattlecomnewsseattlepolicereleasenewageprogressionphotoofchildabductedbybiologicalfatherin living seattle area happen know additional information jason potter julia potter contact seattle police det rande christiansen also leave anonymous tip crime stoppers puget sound get cash reward calling tips using p tips app lets help get julia home mother original post case always stuck even years later years old show washingtons wanted segment julia potter years old time abducted father jason potter seattle home julias mother created facebook page dedicated finding daughter since community doesnt allow facebook links name page finding abducted julia potter years old wa us jason potter according people know known weird guy nationwide warrant arrest called private lawyer let know living grid also updated profile picture lionel richie saying hello youre looking known sighting jason potter seen visiting nursing home olympia wa staff member recognized possible sighting might north olympic peninsula woman suspects man saw teenager time north olympic peninsula wa jason potter reported federal marshal felt man saw jason potter viewing finding julia facebook page another instance someone finding box letters written jason potter box goodwill information left comment one posts belonged julias mother facebook comment found presumed deleted information known comment letters described strange handed police ten years later case remains unsolved much coverage shined limiting amount people informed pnw beyond said jason potter ties bellingham tacoma oregon city oregon living pnw living outside pnw heard case information may know jason julia potter give mother answers additional links info julias mothers facebook page features recent posts include ai generated images julia may look like julias missingkidsorg posterhttpswwwmissingkidsorgposterncmc features age progression images julia jason potter komo news articlehttpskomonewscomampnewslocalseattlepolicelookingforgirlabductedyearsagosuspectpossiblyseeninolympia relating julias case investigation discovery articlehttpswwwinvestigationdiscoverycomcrimefeedidshowsontvinpursuitwithjohnwalsharticlesseattlejasonpotterjuliapotterabducteddaughter also detailing julias case ",
    "cleaned_title": "missing man seattle may india",
    "cleaned_selftext": "posted case many subreddits ago julia potter girl kidnapped dad jason potter november read original post update case new information released jason potter fox seattle stated detectives believe going public dressed woman jason potter could also himalayas india nepal read article see picture jason potter may look like dressed woman click herehttpswwwfoxseattlecomnewsseattlepolicereleasenewageprogressionphotoofchildabductedbybiologicalfatherin living seattle area happen know additional information jason potter julia potter contact seattle police det rande christiansen also leave anonymous tip crime stoppers puget sound get cash reward calling tips using p tips app lets help get julia home mother original post case always stuck even years later years old show washingtons wanted segment julia potter years old time abducted father jason potter seattle home julias mother created facebook page dedicated finding daughter since community doesnt allow facebook links name page finding abducted julia potter years old wa us jason potter according people know known weird guy nationwide warrant arrest called private lawyer let know living grid also updated profile picture lionel richie saying hello youre looking known sighting jason potter seen visiting nursing home olympia wa staff member recognized possible sighting might north olympic peninsula woman suspects man saw teenager time north olympic peninsula wa jason potter reported federal marshal felt man saw jason potter viewing finding julia facebook page another instance someone finding box letters written jason potter box goodwill information left comment one posts belonged julias mother facebook comment found presumed deleted information known comment letters described strange handed police ten years later case remains unsolved much coverage shined limiting amount people informed pnw beyond said jason potter ties bellingham tacoma oregon city oregon living pnw living outside pnw heard case information may know jason julia potter give mother answers additional links info julias mothers facebook page features recent posts include ai generated images julia may look like julias missingkidsorg posterhttpswwwmissingkidsorgposterncmc features age progression images julia jason potter komo news articlehttpskomonewscomampnewslocalseattlepolicelookingforgirlabductedyearsagosuspectpossiblyseeninolympia relating julias case investigation discovery articlehttpswwwinvestigationdiscoverycomcrimefeedidshowsontvinpursuitwithjohnwalsharticlesseattlejasonpotterjuliapotterabducteddaughter also detailing julias case",
    "cleaned_comments": "atithi devo bhava clarify isnt missing man wanted man thank believe could india jason potter could also himalayas india nepal lead intelligent guess reasonable suspicion back information looking ill update answer curious believe hes feel like india nepal got thrown article fuck doesnt make sense yeti also himalayas thousands missing people including children india lets try finding people first b look others think hogwarts likely location find muggles never get fuck posts late posters thinking random shit related india enemies pakistan theyre fair creep seattle india op thinks op thinks seattle police im curious think hes india could india himalayas nepal equivalent saying could california sierra nevada arizona makes sense probably came try butter chicken naan stayed bidets ok guess missed foxseattle articlehttpswwwfoxseattlecomnewsseattlepolicereleasenewageprogressionphotoofchildabductedbybiologicalfatherin line stands weird rest article got ta say guy looks hot dressed woman",
    "light_cleaned_title": "Missing Man from Seattle May Be in India",
    "light_cleaned_selftext": "I posted in this case in many subreddits a while ago about Julia Potter, the girl who was kidnapped by her dad, Jason Potter, in November of 2014. You can read the original post down below. There has been an update on the case with new information released about Jason Potter. Fox 13 Seattle stated that detectives believe he is going out in public dressed as a woman. Jason Potter could also be in the Himalayas, India, and Nepal. To read the article and see a picture of what Jason Potter may look like dressed as a woman, [click here](https://www.fox13seattle.com/news/seattle-police-release-new-age-progression-photo-of-child-abducted-by-biological-father-in-2014). If you are living in the Seattle area or happen to know any additional information about Jason Potter or Julia Potter, you can contact Seattle Police Det. Rande Christiansen at (206)615-0066. You can also leave an anonymous tip to the Crime Stoppers of Puget Sound and can get a cash reward of up to $1000 by calling 1-800-222-TIPS or by using the P3 Tips app. Let’s help get Julia home to her mother. Original Post is down below. ______________________________________ This case has always stuck out to me, even 10 years later. I was 11 or 12 years old when the show Washington’s Most Wanted did a segment on Julia Potter. She was 6 years old at the time and she was abducted by her father, Jason Potter from her Seattle home. Julia’s mother created a facebook page dedicated to finding her daughter. (Since this community doesn’t allow Facebook links, the name of the page is “Finding abducted Julia Potter, 16 years old WA US”) Jason Potter, according to people who know him, has been known to be a weird guy. He has a nationwide warrant for his arrest and he called his private lawyer to let them know he will be living off grid. He also updated his profile picture to Lionel Richie saying “Hello? Is it me you’re looking for?”. The only known sighting of Jason Potter was when he was seen visiting a nursing home in Olympia WA and a staff member recognized him. A possible sighting might have been in the North Olympic Peninsula. A woman suspects that the man she saw with a teenager during her time in the North Olympic Peninsula in WA was Jason Potter. She reported it to the federal marshal and felt as if the man she saw was Jason Potter after viewing the Finding Julia facebook page. Another instance was someone finding a box of letters written by Jason Potter in a box at goodwill. This information was left as a comment in one of the posts that belonged to Julia’s mother on facebook (the comment cannot be found and it is presumed to be deleted: the only information known about the comment is that the letters were described to be strange and they were handed off to police). Ten years later, this case remains unsolved and not much coverage has been shined on it, limiting the amount of people to be informed on it in the PNW and beyond. It has been said that Jason Potter has ties in Bellingham, Tacoma, and Oregon City, Oregon. To those living in the PNW and to those living outside of the PNW: Have you heard of the case? Is there any information you may know about both Jason and Julia Potter so we can give her mother answers? Additional Links and info: - Julia’s mothers Facebook page features her most recent posts that include AI generated images of what Julia may look like now. - [Julia’s missingkids.org Poster](https://www.missingkids.org/poster/ncmc/1240281/1) which features age progression images of both Julia and Jason Potter - [a KOMO news article](https://komonews.com/amp/news/local/seattle-police-looking-for-girl-abducted-7-years-ago-suspect-possibly-seen-in-olympia) relating to Julia’s case - [An Investigation Discovery article](https://www.investigationdiscovery.com/crimefeed/id-shows/on-tv0/in-pursuit-with-john-walsh/articles/seattle-jason-potter-julia-potter-abducted-daughter) also detailing Julia’s Case",
    "light_cleaned_comments": "atithi devo bhava To clarify, he isn’t a missing man, but a Wanted Man. thank you ♥️ Why do they believe he could be in India? >Jason Potter could also be in the Himalayas, India, and Nepal. Is there a lead or intelligent guess or reasonable suspicion to back this information. looking into it. i’ll update once i have an answer as i too am curious on why they believe he’s there. I feel like India and Nepal got thrown into this article because why the fuck not. Doesnt make any sense And The Yeti is also in the Himalayas /s, there are thousands missing people including children here in India itself lets try finding our people first b4 we look for others I think Hogwarts is the likely location to find them. The muggles can never get to them. The fuck are these posts of late with posters thinking up random shit related to India? We're enemies with Pakistan because they're fair, and now some creep from Seattle is in India because OP thinks so? No its not because OP thinks so, its because of Seattle Police. But Im curious why they think hes in India. He could be in India, Himalayas or Nepal is equivalent to saying he could be California, Sierra Nevada or Arizona. Makes no sense. Probably came to try Butter Chicken and Naan and stayed for the bidets. Ok, I guess I missed that - the [Fox-Seattle article](https://www.fox13seattle.com/news/seattle-police-release-new-age-progression-photo-of-child-abducted-by-biological-father-in-2014) has it. That line just stands out as weird from the rest of the article. Gotta say guy looks hot dressed as a woman."
}