{
    "id": "12uq3bw",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/12uq3bw/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=26bc0642916d86c8e02a80ae0eb06417f74c209f",
    "flair": "Scheduled",
    "score": 8,
    "num_comments": 19,
    "created_utc": 1682127012.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg",
    "comments": [
        "Which books should I read? Any recommendations?",
        "Reading Not a Penny More Not a Penny Less by Jeffery Archer. It is a fun thriller.",
        "Just read autobiography of S.Chandrasekher by Kameshwar Wali.\n\nIncredibly detailed stuff.   \n\nA bit of Edison/Tesla vibes in the middle, had it not been for egoistic political tension, Chandra's contribution would have happened nearly three decades earlier.    \n\nWhat an amazing guy.",
        "Going to read The Mountain is You",
        "I recently read \"I, Claudius\" by Robert Graves and it was really good. It is a classic of historical fiction.\n\nIt is about the life of Tiberius Claudius Caesar, the fourth Roman emperor. The story is told from the voice of the emperor himself and he takes the story from the early days of the Roman Empire to his birth to his rise to the throne. Through the voice of Claudius (who for most of his life was just a spectator in the grand internal battle for the throne), Graves manages to breathe life into the historical figures and tells the tale of the dirty power politics in the early Roman Empire.\n\nFor some context, Claudius was the grandson of Mark Antony and grandnephew of Octavian.\n\nI am sure you will like it.",
        "Thanks.",
        "Currently reading “In the Shadow of the Banyan” by Vaddey Ratner. \nIt is about Cambodia under the rule of Khmer Rouge. \nI had no idea about Cambodian history. What they went through is brutal it is getting very difficult to read this book",
        "what are the genres that you are interested in",
        "Read the Silent Coup, and I am afraid and disgusted.",
        "Adventure or Gothic fiction or dystopian fiction.",
        "Reading a HBR book on Increasing Productivity and Warren Buffett Way this weekend.\n\nAlso checking out some manga chapters of  Chainsaw man. Completed reading a Batman/Spawn 2022 crossover one shot comic earlier today.",
        "What is the productivity book?",
        "You may want to read \"Dancing in Cambodia, at large in Burma\" by Amitav Ghosh",
        "> dystopian fiction\n\nHave you read the Red Rising series (I think it is called that). Handmaid's Tale. The Windup Girl.",
        "Thanks. I'll check them out.",
        "I’ll check it out, thank you"
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "books read recommendations reading penny penny less jeffery archer fun thriller read autobiography schandrasekher kameshwar wali incredibly detailed stuff bit edisontesla vibes middle egoistic political tension chandras contribution would happened nearly three decades earlier amazing guy going read mountain recently read claudius robert graves really good classic historical fiction life tiberius claudius caesar fourth roman emperor story told voice emperor takes story early days roman empire birth rise throne voice claudius life spectator grand internal battle throne graves manages breathe life historical figures tells tale dirty power politics early roman empire context claudius grandson mark antony grandnephew octavian sure like thanks currently reading shadow banyan vaddey ratner cambodia rule khmer rouge idea cambodian history went brutal getting difficult read book genres interested read silent coup afraid disgusted adventure gothic fiction dystopian fiction reading hbr book increasing productivity warren buffett way weekend also checking manga chapters chainsaw man completed reading batmanspawn crossover one shot comic earlier today productivity book may want read dancing cambodia large burma amitav ghosh dystopian fiction read red rising series think called handmaids tale windup girl thanks ill check ill check thank",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Which books should I read? Any recommendations? Reading Not a Penny More Not a Penny Less by Jeffery Archer. It is a fun thriller. Just read autobiography of S.Chandrasekher by Kameshwar Wali. Incredibly detailed stuff. A bit of Edison/Tesla vibes in the middle, had it not been for egoistic political tension, Chandra's contribution would have happened nearly three decades earlier. What an amazing guy. Going to read The Mountain is You I recently read \"I, Claudius\" by Robert Graves and it was really good. It is a classic of historical fiction. It is about the life of Tiberius Claudius Caesar, the fourth Roman emperor. The story is told from the voice of the emperor himself and he takes the story from the early days of the Roman Empire to his birth to his rise to the throne. Through the voice of Claudius (who for most of his life was just a spectator in the grand internal battle for the throne), Graves manages to breathe life into the historical figures and tells the tale of the dirty power politics in the early Roman Empire. For some context, Claudius was the grandson of Mark Antony and grandnephew of Octavian. I am sure you will like it. Thanks. Currently reading “In the Shadow of the Banyan” by Vaddey Ratner. It is about Cambodia under the rule of Khmer Rouge. I had no idea about Cambodian history. What they went through is brutal it is getting very difficult to read this book what are the genres that you are interested in Read the Silent Coup, and I am afraid and disgusted. Adventure or Gothic fiction or dystopian fiction. Reading a HBR book on Increasing Productivity and Warren Buffett Way this weekend. Also checking out some manga chapters of Chainsaw man. Completed reading a Batman/Spawn 2022 crossover one shot comic earlier today. What is the productivity book? You may want to read \"Dancing in Cambodia, at large in Burma\" by Amitav Ghosh > dystopian fiction Have you read the Red Rising series (I think it is called that). Handmaid's Tale. The Windup Girl. Thanks. I'll check them out. I’ll check it out, thank you"
}