{
    "id": "fuomw7",
    "title": "India's internet shutdown laws must be reformed!",
    "url": "https://www.reddit.com/r/india/comments/fuomw7/indias_internet_shutdown_laws_must_be_reformed/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/zy87u6z1uqq41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=63b456dedb4224dca0f38034a8c4be6011624aaf\n\n### Tl;dr\n\nWe wrote to the Department of Telecommunications and the Ministry of Parliamentary Affairs to ensure reform of India’s internet shutdown laws remains a priority for the government. We have relied on the observations made by the Supreme Court in *Anuradha Bhasin v. Union of India* about gaps in the Telecom Suspension Rules 2017 to urge for review of the Rules based on public consultation and economic impact assessment. \n\n### Background\n\nOn 10 January 2020, the Supreme Court delivered its judgement *in Anuradha Bhasin v. Union of India.* This case related to the constitutionality of the communication shutdown imposed in Jammu and Kashmir on 05 August 2019 and it highlighted deficiencies in India’s internet shutdown framework.  The Court noted that the Telecom Suspension Rules 2017 had several gaps which needed to be addressed by the legislature including the lack of time limitation for shutdown orders. As a temporary stop-gap measure, the Court put in place two ad-hoc procedural safeguards. First, the Court directed that all internet shutdown orders should be published. Second, the Court directed the Review Committee to periodically review internet shutdown orders every seven working days. Unfortunately, even these safeguards have not been complied with uniformly and internet shutdowns have been imposed in cities like Jabalpur without any publication of order.\n\nThe government seems to be aware of the import of the judgement in *Anuradha Bhasin v. Union of India* but no concrete steps have been taken so far for review of the Telecom Suspension Rules 2017. In response to a [**parliamentary question**](https://pqars.nic.in/annex/251/AU600.pdf), the Minister of State for Communications stated in Rajya Sabha on 06 February 2020 that the government will review the Rules and conduct stakeholder consultation in view of the Supreme Court’s observations. To ensure the government follows up with this assurance, we have written to the Department of Telecommunications and the Ministry of Parliamentary Affairs.   \n\n\n### Recommendations for Department of Telecommunications\n\nWe first wrote to the Department of Telecommunications under the Ministry of Communications on 06 February 2020 and highlighted the massive economic losses caused by internet shutdowns in India. In particular, we urged the Department to commence a public consultation to review the Telecom Suspension Rules 2017. We also recommended that an urgent advisory be issued to all States and Union Territories to ensure that all internet shutdowns are ordered in accordance with the guidelines laid down by the Supreme Court in *Anuradha Bhasin v. Union of India.*\n\nNoting that there was lack of any systematic record keeping by the government, we have requested the Department to maintain a repository of all internet shutdown orders and conduct an economic impact to ascertain losses caused by internet shutdowns. We suspect that the losses will be extremely high with the Cellular Operators Association of India estimating that telecom operators lose Rs. 24.5 million per hour in every circle area where there is a shutdown or throttling.   \n\n\n### Recommendations for Ministry of Parliamentary Affairs\n\nWe also wrote to the Ministry of Parliamentary Affairs on 03 April 2020 to ensure implementation of the assurance made by the Minister of State for Communications in Rajya Sabha about review of Telecom Suspension Rules 2017. As per the Government of India (Allocation of Business) Rules, 1961, the Ministry of Parliamentary Affairs is responsible for culling out all assurances made in Parliament, monitoring the status of their fulfilment and laying an implementation before Parliament. Assurances made in Parliament are usually required to be fulfilled within 3 months. However, in this case, the Department of Telecommunications has not taken any steps towards review of the Telecom Suspension Rules 2017 including putting out a call for public consultation. \n\nWe recognize that due to the COVID-19 pandemic, the functioning of government ministries has been affected but this crisis also demonstrates how the internet has become a lifeline for many. Therefore, even if there is an extension of implementation timelines, review of the Telecom Suspension Rules 2017 must remain a priority and the Parliament must be apprised of the status of implementation of the assurance made by the Ministry of Communications.\n\n### Important Documents\n\n1. Representation dated 06.02.2020 sent to MoC and MeitY ([**link**](https://drive.google.com/file/d/1LrTMLJomprMl-QZLcBW8iKmldasGyn8I/view?usp=sharing))\n2. Representation dated 03.04.2020 sent to MoP and ML&amp;J ([**link**](https://drive.google.com/file/d/16vksUsPwk0OH9vvA6LY9PzF4xZBWUBHz/view?usp=sharing))\n\n### We’re in this for the long haul. Support sustained advocacy against internet shutdowns by [becoming an IFF member today.](https://internetfreedom.in/donate/) And don’t forget to [join our Forum](https://forum.internetfreedom.in/) for closer dialogue with the IFF staff and community about technology, society and law!",
    "flair": "Policy/Economy",
    "score": 335,
    "num_comments": 7,
    "created_utc": 1585981003,
    "convurl": "https://a.thumbs.redditmedia.com/-Ryy6qWh5xO62YSApqCLQDpTCcFuXQD1mReWsbhFVI8.jpg",
    "comments": [
        "Hope this brings about some change",
        "someone r/explainlikeimfive what this is about?",
        "Seconding this. Please.",
        "u/InternetFreedomIn\n\nI'll always remember you for your good work.",
        "Thirding this",
        "Fucking this",
        "Thank you, and we will remember your faith in us at times when we face greater challenges."
    ],
    "cleaned_text": "indias internet shutdown laws must reformed ampxb tldr wrote department telecommunications ministry parliamentary affairs ensure reform indias internet shutdown laws remains priority government relied observations made supreme court anuradha bhasin v union india gaps telecom suspension rules urge review rules based public consultation economic impact assessment background january supreme court delivered judgement anuradha bhasin v union india case related constitutionality communication shutdown imposed jammu kashmir august highlighted deficiencies indias internet shutdown framework court noted telecom suspension rules several gaps needed addressed legislature including lack time limitation shutdown orders temporary stopgap measure court put place two adhoc procedural safeguards first court directed internet shutdown orders published second court directed review committee periodically review internet shutdown orders every seven working days unfortunately even safeguards complied uniformly internet shutdowns imposed cities like jabalpur without publication order government seems aware import judgement anuradha bhasin v union india concrete steps taken far review telecom suspension rules response parliamentary questionhttpspqarsnicinannexaupdf minister state communications stated rajya sabha february government review rules conduct stakeholder consultation view supreme courts observations ensure government follows assurance written department telecommunications ministry parliamentary affairs recommendations department telecommunications first wrote department telecommunications ministry communications february highlighted massive economic losses caused internet shutdowns india particular urged department commence public consultation review telecom suspension rules also recommended urgent advisory issued states union territories ensure internet shutdowns ordered accordance guidelines laid supreme court anuradha bhasin v union india noting lack systematic record keeping government requested department maintain repository internet shutdown orders conduct economic impact ascertain losses caused internet shutdowns suspect losses extremely high cellular operators association india estimating telecom operators lose rs million per hour every circle area shutdown throttling recommendations ministry parliamentary affairs also wrote ministry parliamentary affairs april ensure implementation assurance made minister state communications rajya sabha review telecom suspension rules per government india allocation business rules ministry parliamentary affairs responsible culling assurances made parliament monitoring status fulfilment laying implementation parliament assurances made parliament usually required fulfilled within months however case department telecommunications taken steps towards review telecom suspension rules including putting call public consultation recognize due covid pandemic functioning government ministries affected crisis also demonstrates internet become lifeline many therefore even extension implementation timelines review telecom suspension rules must remain priority parliament must apprised status implementation assurance made ministry communications important documents representation dated sent moc meity linkhttpsdrivegooglecomfiledlrtmljomprmlqzlcbwikmldasgyniviewuspsharing representation dated sent mop mlampj linkhttpsdrivegooglecomfiledvksuspwkohvvalypzfxzbwubhzviewuspsharing long haul support sustained advocacy internet shutdowns becoming iff member todayhttpsinternetfreedomindonate dont forget join forumhttpsforuminternetfreedomin closer dialogue iff staff community technology society law ",
    "cleaned_title": "indias internet shutdown laws must reformed",
    "cleaned_selftext": "ampxb tldr wrote department telecommunications ministry parliamentary affairs ensure reform indias internet shutdown laws remains priority government relied observations made supreme court anuradha bhasin v union india gaps telecom suspension rules urge review rules based public consultation economic impact assessment background january supreme court delivered judgement anuradha bhasin v union india case related constitutionality communication shutdown imposed jammu kashmir august highlighted deficiencies indias internet shutdown framework court noted telecom suspension rules several gaps needed addressed legislature including lack time limitation shutdown orders temporary stopgap measure court put place two adhoc procedural safeguards first court directed internet shutdown orders published second court directed review committee periodically review internet shutdown orders every seven working days unfortunately even safeguards complied uniformly internet shutdowns imposed cities like jabalpur without publication order government seems aware import judgement anuradha bhasin v union india concrete steps taken far review telecom suspension rules response parliamentary questionhttpspqarsnicinannexaupdf minister state communications stated rajya sabha february government review rules conduct stakeholder consultation view supreme courts observations ensure government follows assurance written department telecommunications ministry parliamentary affairs recommendations department telecommunications first wrote department telecommunications ministry communications february highlighted massive economic losses caused internet shutdowns india particular urged department commence public consultation review telecom suspension rules also recommended urgent advisory issued states union territories ensure internet shutdowns ordered accordance guidelines laid supreme court anuradha bhasin v union india noting lack systematic record keeping government requested department maintain repository internet shutdown orders conduct economic impact ascertain losses caused internet shutdowns suspect losses extremely high cellular operators association india estimating telecom operators lose rs million per hour every circle area shutdown throttling recommendations ministry parliamentary affairs also wrote ministry parliamentary affairs april ensure implementation assurance made minister state communications rajya sabha review telecom suspension rules per government india allocation business rules ministry parliamentary affairs responsible culling assurances made parliament monitoring status fulfilment laying implementation parliament assurances made parliament usually required fulfilled within months however case department telecommunications taken steps towards review telecom suspension rules including putting call public consultation recognize due covid pandemic functioning government ministries affected crisis also demonstrates internet become lifeline many therefore even extension implementation timelines review telecom suspension rules must remain priority parliament must apprised status implementation assurance made ministry communications important documents representation dated sent moc meity linkhttpsdrivegooglecomfiledlrtmljomprmlqzlcbwikmldasgyniviewuspsharing representation dated sent mop mlampj linkhttpsdrivegooglecomfiledvksuspwkohvvalypzfxzbwubhzviewuspsharing long haul support sustained advocacy internet shutdowns becoming iff member todayhttpsinternetfreedomindonate dont forget join forumhttpsforuminternetfreedomin closer dialogue iff staff community technology society law",
    "cleaned_comments": "hope brings change someone rexplainlikeimfive seconding please uinternetfreedomin ill always remember good work thirding fucking thank remember faith us times face greater challenges",
    "light_cleaned_title": "India's internet shutdown laws must be reformed!",
    "light_cleaned_selftext": "### Tl;dr We wrote to the Department of Telecommunications and the Ministry of Parliamentary Affairs to ensure reform of India’s internet shutdown laws remains a priority for the government. We have relied on the observations made by the Supreme Court in *Anuradha Bhasin v. Union of India* about gaps in the Telecom Suspension Rules 2017 to urge for review of the Rules based on public consultation and economic impact assessment. ### Background On 10 January 2020, the Supreme Court delivered its judgement *in Anuradha Bhasin v. Union of India.* This case related to the constitutionality of the communication shutdown imposed in Jammu and Kashmir on 05 August 2019 and it highlighted deficiencies in India’s internet shutdown framework. The Court noted that the Telecom Suspension Rules 2017 had several gaps which needed to be addressed by the legislature including the lack of time limitation for shutdown orders. As a temporary stop-gap measure, the Court put in place two ad-hoc procedural safeguards. First, the Court directed that all internet shutdown orders should be published. Second, the Court directed the Review Committee to periodically review internet shutdown orders every seven working days. Unfortunately, even these safeguards have not been complied with uniformly and internet shutdowns have been imposed in cities like Jabalpur without any publication of order. The government seems to be aware of the import of the judgement in *Anuradha Bhasin v. Union of India* but no concrete steps have been taken so far for review of the Telecom Suspension Rules 2017. In response to a [**parliamentary question**](https://pqars.nic.in/annex/251/AU600.pdf), the Minister of State for Communications stated in Rajya Sabha on 06 February 2020 that the government will review the Rules and conduct stakeholder consultation in view of the Supreme Court’s observations. To ensure the government follows up with this assurance, we have written to the Department of Telecommunications and the Ministry of Parliamentary Affairs. ### Recommendations for Department of Telecommunications We first wrote to the Department of Telecommunications under the Ministry of Communications on 06 February 2020 and highlighted the massive economic losses caused by internet shutdowns in India. In particular, we urged the Department to commence a public consultation to review the Telecom Suspension Rules 2017. We also recommended that an urgent advisory be issued to all States and Union Territories to ensure that all internet shutdowns are ordered in accordance with the guidelines laid down by the Supreme Court in *Anuradha Bhasin v. Union of India.* Noting that there was lack of any systematic record keeping by the government, we have requested the Department to maintain a repository of all internet shutdown orders and conduct an economic impact to ascertain losses caused by internet shutdowns. We suspect that the losses will be extremely high with the Cellular Operators Association of India estimating that telecom operators lose Rs. 24.5 million per hour in every circle area where there is a shutdown or throttling. ### Recommendations for Ministry of Parliamentary Affairs We also wrote to the Ministry of Parliamentary Affairs on 03 April 2020 to ensure implementation of the assurance made by the Minister of State for Communications in Rajya Sabha about review of Telecom Suspension Rules 2017. As per the Government of India (Allocation of Business) Rules, 1961, the Ministry of Parliamentary Affairs is responsible for culling out all assurances made in Parliament, monitoring the status of their fulfilment and laying an implementation before Parliament. Assurances made in Parliament are usually required to be fulfilled within 3 months. However, in this case, the Department of Telecommunications has not taken any steps towards review of the Telecom Suspension Rules 2017 including putting out a call for public consultation. We recognize that due to the COVID-19 pandemic, the functioning of government ministries has been affected but this crisis also demonstrates how the internet has become a lifeline for many. Therefore, even if there is an extension of implementation timelines, review of the Telecom Suspension Rules 2017 must remain a priority and the Parliament must be apprised of the status of implementation of the assurance made by the Ministry of Communications. ### Important Documents 1. Representation dated 06.02.2020 sent to MoC and MeitY ([**link**](https://drive.google.com/file/d/1LrTMLJomprMl-QZLcBW8iKmldasGyn8I/view?usp=sharing)) 2. Representation dated 03.04.2020 sent to MoP and ML&amp;J ([**link**](https://drive.google.com/file/d/16vksUsPwk0OH9vvA6LY9PzF4xZBWUBHz/view?usp=sharing)) ### We’re in this for the long haul. Support sustained advocacy against internet shutdowns by [becoming an IFF member today.](https://internetfreedom.in/donate/) And don’t forget to [join our Forum](https://forum.internetfreedom.in/) for closer dialogue with the IFF staff and community about technology, society and law!",
    "light_cleaned_comments": "Hope this brings about some change someone r/explainlikeimfive what this is about? Seconding this. Please. u/InternetFreedomIn I'll always remember you for your good work. Thirding this Fucking this Thank you, and we will remember your faith in us at times when we face greater challenges."
}