{
    "id": "1dikwuw",
    "title": "Scam alert - CBI email for pornography",
    "url": "https://www.reddit.com/gallery/1dikwuw",
    "selftext": "Hi. I have received email accusing me of participating in sharing child pornography and various other things. \nI would like to enlighten people on how to be beware of such scams and what are the tell tale signs. I have knowledge of computers and working of government departments as well. \n1. The biggest sign is sheer no of stamps on the document. You will never find these many stamps on an official communication. A common man unknown to the working of agencies, will surely be under pressure to see so many stamps. \n2. Number of departments mentioned on the documents are non sensical - Madhya pradesh cyber cell, BPRD and CBI. These are all Individual agencies and never will you find so many agencies on a single case. \n3. In 2nd image, DELHI'S office of commissioner of police is mentioned. But wait, I got the letter from CBI??\n4. In the last image, we can see the email is sent from. De domain. This itself should be enough to mark it as scam. The reply email is also Gmail one. Govt department mails always end with. Gov or. Nic. \nKindly share and add to this to beware people of these scams. \n",
    "flair": "Crime",
    "score": 1015,
    "num_comments": 219,
    "created_utc": 1718696041.0,
    "convurl": "https://i.redd.it/1fqby3wp9a7d1.jpg",
    "comments": [
        "This is really creative. 10/10 man. \n\nThis is art.",
        "That is the biggest collab of the century",
        "P\\*rn dekhne ke case IB involve ho gyi💀",
        "Why did you get this mail, op? What websites do you visit?",
        "For the last image, they used emojis ffs",
        "Top SECRET 🥹🥹🥲",
        "RAW bhi hai",
        "Simple look at the fucking email ID from which it came, worst jumble of garbage ever",
        "It's not a scam. It's real af. Aur pucho link kaha hai .... \n\n/s",
        "Mera ko toh call aya tha. Paisa demand kr rhe the. Bole AAP boht zada ashleel video dekhte ho",
        "Thats how they made it real of course.",
        "Indians and their scamming habits are beyond anyone's imagination.",
        "Everything was looking fine until i saw top secret 💀",
        "WTH last line mai NATIONAL HIGHWAY kaha se aaya line ke niche",
        "And also it's a top secret document arriving in Gmail unannounced.\n\nAlso they have labs. \n\nLol.",
        "Squard",
        "Kyu dekhte ho itni Porn. /s",
        "I think this almost looks legit. The only things missing on this are faces of Dhoni, Amitabh Bachchan and Modi.",
        "Bhai, I was almost expecting to see CID ka logo and ACP Pradyuman ka naam.",
        "This is quite convincing.. when in doubt.. dont think twice..just visit your area police station.",
        "Bruh sender looks genuine 😃👍🏻 /s",
        "🧑‍⚖️🚨",
        "That’s the real address of Bureau of Police Research and Development. One is in Header, the other is in footer.",
        "Looks legit, those ‘⚖️’ emojis looks very scary in both ends of subject, must be an official court order",
        "#NoFap NoProblem",
        "Trying replying to them to see what happens 😂😂😂",
        "I always wonder, what if the smarter guys start scamming people 🤔\n\nNothing except morals stand before them stopping them from switching sides 🙂",
        "The sender e-mail address appears to be within the network of Deutsche Telekom. I will try to report it when I go back to Germany.",
        "Awww poor guys dont use chatgpt to frame their messages🤡 /s",
        "Not as good as this\n\nhttps://preview.redd.it/wm6ecryqla7d1.png?width=1283&format=png&auto=webp&s=79152ed9ea6df06579fda8e5e1df0625fe0a3333",
        "O bawa",
        "thanks for posting, i received it on friday and I could only identify as scam as email was sent from . De domain. ",
        "Smarter guys don't scam. They make heists",
        "The police will instead arrest you right? Or will they help?",
        "\"quite unfortunate\" a govt authority would never use such a phrase",
        "Lol 😂😂😂, one of my friend also got this in mail.",
        "Wake up babe, new scam just dropped",
        "Nice try op. see you in jail",
        "help",
        "Mere toh papa ko phone aaya thaa ki aapka beta bahot ashleel videos dekhta hai. Good that my father himself is part of law enforcement",
        "Hehe I got the same thing through WhatsApp 😄😄. Except that the cutoff time wasn't 9 pm, it was 8.39 pm. The name was the same devesh Joshi.",
        "The fuck is that font",
        "⚖️⚖️",
        "You should play along and see how far it goes. Do keep us updated.",
        "I wouldn't even be mad if I receive this",
        "Guys why is everyone calling this a scam",
        "Saans leta hun toh is desh mein koi naya scam shuru ho jata hai",
        "Shame there's no FBI and Interpol seal on this.",
        "Never knew the system was so collaborative....mera sbi ka kaam bhi krwa do plej",
        "Can you forward me this email?\n\nI got an email as well claiming to have used ‘Pegasus’ to take control of my device, however I have used the iMazing tool to scan if there’s any (just for double check). Have been given 48hrs, would like to see if I can forward your emails or a screenshot to scare them back… (do advice)",
        "Needs more logos",
        "Bhai, RAW and IB want to raid my IP connection? I must be someone of immense interest!",
        "take a chill pill, ask them to bail you out, they will ask you to call on whatsapp, some police in uniform will talk to you on a video call, the surrounding will resemble a comissioner office. tell him you are some CM's relative and they will cut off.",
        "“cheif electricity officer”",
        "It is from another earth 863",
        "“Worst-of-list”",
        "Top secret 🤡🤣",
        "Reaching you privately with one too many official Attestation. Classic oxymoron.",
        "OP what did you reply? xD",
        "Isn't this old one",
        "Top Secret? Sending thro mail 😂",
        "bro added every seal png he can find on internet LOL",
        "If this is Legit then a large population of Indians watch Child Porn",
        "What's their issue with basic grammar?",
        "Funniest thing is the signature of Tapan Deka! Itne chote naam ka itna bada signature.",
        "Scam karne k liye bhi akal lagti.. bc RAW ko bhi include kardia inlog ne apne threat me 😆",
        "Send them Dick pic.",
        "They are in partnership with Indian Cyber SquaRd. Of course they are legit.",
        "Missing \"atmanirbhar bharat\" tag.",
        "Padhne likhne ki umr mai,",
        "sorry bhai, mujhe kya pata tha CBI bhi saath dekh rahi hogi",
        "Indian Cyber Sqward !!!",
        "saar how many logos you want me to add to make it look authentic?\nyes",
        "Q - How many stamps you need?\nA - yes",
        "Mujhe bhi aaya tha maine to lamba keecha tha, At the end usne call kiya to maine bola tha ki itna paisa le rhe ho sir chhorne ka, pls apni biwi ki nudes bhi dedo",
        "If they see my chrome search history they will traumatized for life lolll 😂",
        "Damn their English is getting better, they're evolving",
        "GTA 5 star criminal",
        "None of the signatures match the name. If the warrant was anything close to authentic, they would probably send the Avengers to arrest you.",
        "Mahasangam",
        "You should respond to them. Please come arrest me. I need free food and bed for the next 6 months.",
        "This was once set as my desktop background somehow when I was down there in the rabbit hole. Funny times 😂",
        "Underrated comment",
        "The only thing missing is an image of the Vishwaguru. NaMo's face features on official government scams and should also feature on less official versions.",
        "So what happens next.. people who get scammed will go to court or just pay online to scammers?",
        "They didn't even try to make the email ID look legit lmao",
        "*proceeds to scam the scammer*",
        "absolutely hilarious, I wonder what would actually happen in that case 😂",
        "\"Certified\" \"Top Secret\"😂😂",
        "It would have been more convincing if they had added a couple of more stamps.",
        "Genuine 💯%",
        "Subject has kanoon ke weighing scales",
        "2024 is actually the year of unexpected collabs",
        "Low effort scam",
        "That's not IB's real seal",
        "Top secret",
        "Atleast they could have organized those emblems neatly",
        "Thanks for posting this OP you are doing great work",
        "🤣🤣🤣",
        "Lucky you",
        "BUT...BUT...Brazzers is free this month, what can I do ?",
        "The Avengers Assembled",
        "Yakuza use/d to do something similar. Deliver porno mags to someone's doorstep. The \"delivery guy\" demands charge, threatens to call \"police\". Either the victim pays to not get shamed or gets the call from \"police\" and gets extorted",
        "Fake avengers assemble to take down fake pdf file",
        "Are you using i phone? If yes that may be the case. But are you that important that govt may be snooping you?",
        "https://preview.redd.it/qubb963rsb7d1.jpeg?width=640&format=pjpg&auto=webp&s=cf5c4b9c9fb7669dfd7fabaa8958725f5dc64ec4",
        "Yes but I thought of sending the certificate to him back because no way am getting by Pegasus.",
        "Some days ago a woman called me that my father has an unpaid loan because of which the bank has filed a case in the Mumbai high court and its hearing is in 1 hour. She wanted to talk to my father. When i didn't comply she threatened that all of us will be jailed.",
        "TOP SECRET",
        "& this is certified, btw.",
        "Yes by every dham agency in india",
        "this sure is  scam, but you are also announing that you are into illegeal shit. these scams buy data from google, and google records everything you are doing online.. incognito is not really incognito.",
        "'Top Secret' 😁",
        "https://preview.redd.it/a2w746pdwb7d1.png?width=1169&format=png&auto=webp&s=c814a7db62424cb7ebcf50e8d69232e01d3e3c69",
        "⚖️",
        "⚖️official legal business ⚖️",
        "So how are they getting money from this",
        "They will say we got evidence and we ran dna analysis on this picture",
        "Once u contact them, they will start asking money to hush the things. Or you get arrested.",
        "Ur going too far. If I was afraid of anything, I would have contacted them. Not putting it here.",
        "Most of the scams work on fear. If u give knee jerk reaction,u will lose. Always take time to think before responding.",
        "Pegasus is only sold to govt. Institutions. Not any random private company. Ur safe unless ur in some deep shit.",
        "Smart guys don't bother with this stuff. When they scam, they make sure the law enforcement, the banks and the government support their scam. So they either open a fraudulent business and make off with bank loans or they open a religious place of worship and keep raking in billions without paying a dime in taxes.\n\nAnd then there are small time fraudsters like the one we see here.",
        "\"benchood\"",
        "A few days ago I got custom scam call. All said and done with the initiator, the fake cop who called again had a face like an emoji. \n\n50 ATM Cards and 2 different type of drugs caught. \n\nLmao.\n\nGuys call 1930 (Cybercell under MHA) and report the scam. This is how we end Jamtara biness.",
        "Not the CERTIFIED stamp 💀",
        "you know its legit when the subject line has emojis in it",
        "Reply to the email\n\n\"I got really turned on by your interest in me and I nutted. Thanks for the bust\"",
        "I know, I know… it’s an empty threat (it also costs millions in dollars) but still they got my iCloud email. So, if they still send an email after not responding to them in their 48hrs then I would like to send this hoping it would lose them their shit. (≧∀≦)",
        "This shit has more signatures than a UN resolution",
        "Cbi doesn't use century gothic either.\n\n\nI find the notion of some rando bureaucrat sitting in CBI watching whether I am seeing porn quite funny though.",
        "it’s scam, officer here",
        "Sawdhan rahe..satark rahe",
        "The thing is if we switch sides we will be so competent that even more competent people will look into it and bust us.\n\nSo yeah there's absolutely nothing stopping anyone but the fear of getting caught.",
        "But doesn't matter if it doesn't have the stamp of PMO and personal signature of panlogical being.",
        "\"Squard\"",
        "That notice document is on cocaine",
        "But they missed the Film Federation. They didn't certify the damn films!",
        "Dawg we got this email word for word making rounds in Pakistan too lmfao",
        "Hahahahahahaha. This is ridiculously fake.",
        "Tu saans lena band karde, iss desh ka bhala ho jayega",
        "*”certified”* \n\nMore like certified bs.",
        "Kr deta but I'm still a virgin so ..........",
        "I think it still needs some more signatures no? Could be fake.",
        "12 year old me would have freaked the fuck out",
        "Ah, I see. Now I feel like I have no purpose on this planet",
        "We need a few more stamps to make this really official. So much white space. /s",
        "Just wondering what if OP replies Teri mkc",
        "Send DP and then resend them this same scam email lol",
        "Then he will give them proof of actually sharing explicit pictures of minors.",
        "Yes, our beloved govt, employees who just want to get work done before lunch took the time to vary font size in different lines of same page, nice work Mr. Devesh",
        "That's not very good scam when even Gmail thinks it's a spam",
        "Maha gathbandhan of agencies 😂🤣",
        "Nahi bhai ministry of defense reh gai",
        "That's why I keep saying like a madman to use VPN for child p*&@...",
        "Wow a mail from the CEO (Chief Electricity Officer) 👨🏽‍💼",
        "Nothing says an email is legit other than an emoji as your first character.",
        "Only Tiger can save you now!",
        "Rhea Chakraborty ko investigate karne ke alwa bhi toh kuch timepass chahiye CBI ko bhai",
        "You missed Research and analysis wing. Lol, as far as I know foreign intelligence agencies doesn't operate in their own country.",
        "Na bhai, insaaf ka tarazu",
        "Not legit..there is no G20 Summit logo",
        "Not legit..there is no G20 Summit logo",
        "Not legit..there is no G20 Summit logo",
        "Notice was sent by national highways..?? And what the hell is police research and development..??🤣",
        "Jab bhi court order aayega to vo email mai nahi ek LETTER mai aayega …..anything else than that is fake",
        "Jo bhi hai looks very stylish",
        "Indian govt not use colour. Waste of pixels.",
        "Juat want to put it out here.\n\n> Now you update your bill by just calling our electricity helpline number.\n\nTill this line, it was taken from BESCOM app(Bangalore electricity provider some full form like that). They have the exact same thing.",
        "Are scam se pehle thora padh toh liya karo scam se pehle CBI is the nodal agency for Interpol aur in partnership with ye Kya hota hain koi sponsorship hain kya Tata IPL in partnership with dream 11 🤣🤣\n\nCourt order sealed envelope mein aata hain with court seal. Sarkari document hain kirane ka list nhi 😂😂",
        "Its been years since I checked email. My work is done on Teams or Whatsapp.",
        "This is a dream collaboration of all 3 letter agencies. Dude who wrote this letter did research about the agencies but forgot to do a spell/grammar check. 🤣",
        "Insaaf ka taraju ⚖️...",
        "Please check your email. What about the career prospect of the scammers.",
        "I failed to mention RAW AND IB.",
        "Lol it has top secret stamp🤣🤣",
        "Only IPL sticker is missing",
        "I'm also pretty sure you will not be notified if you're under suspicion of CP. If they got suspicion, they follow you closely until they catch you and then straight up raid you.",
        "\"Kya scammer banega re tu!\" moment. \n\nTranslation: \"How will you become a good scammer.\"",
        "The Scotland yard coming to arrest OP anytime now.",
        "HAHAHAHHAHAHA!!!...way too many signatures and too many stamps!!! i cant stop laughing!!!!",
        "Thanks for informing about the scam, will be mindful.",
        "*Certified Copy*",
        "Ofcourse it's fake. It lacks modiji's photo",
        "Bhai mail pr aisa reply karo ki tumhe lagg raha ye legit h aur darr gaya h tu. Phir mazee lete h inki ki ye logg kya kya bolte h🤣",
        "I don't think in India they will even do that. They don't have time for real problems. They are busy enough raiding political opponents of the rulers.",
        "Paw patrol logo is missing otherwise would be legit",
        "*Cheif",
        "Reply with a few porn links.",
        "It's marked \"Top secret\" but emailed to an individual who can share it on the internet.",
        "I hope they go to hell for doing such scams, not everyone is so clever like you Op. Thanks so much.",
        "Pls don't sign up for free milfs",
        "If I had the resources, I would love to open a toll free helpline for preventing such frauds.",
        "Bro if it says certified it is certified",
        "Those Gandhi ka chasma looks legit 😅",
        "there is a cybercrine helpline established by the gov of India, but they are already burdened with 1000 of cases. However, I would suggest you tag thr CBI, cyberpolice on X so that they now this level of mockery being done on their name.",
        "This is a \" certified\" \"top secret\" hood classic",
        "Could use grammarly subscription",
        "5 star khao khud jaan jao",
        "Itna hi neet aur net paper leak karne walo pe mehnat kar lete.",
        "All these punks decided to make Mahipalpur a shady place just because of these scams.",
        "And, Prajwal Revanna??",
        "I just received this today. And not personally but this was received by my company. Honestly, we receive a lot of police emails (nature of business of the company) so we thought this is also genuine. We were asked to just respond on the email and then they will send the \"court order\". We responded on the email also.\nBut then a little internet search revealed this scam. The fake email id was the biggest give away. Additionally, they said there is a \"court order\". Firstly there is no order without any case, and court notices etc come from the court, not by police and certainly not on email.\n\nNot gonna lie, we were fooled as we didn't think much about it, but yeah the email was filled with tell tales of a scam.",
        "Nah op trying to gaslight us that this notice ain't real",
        "Seems like some lawyers didn't get any employment and became scamsters",
        "What’s with the CERTIFIED stamp on the first slide? Certified Pdf file?",
        "We got German hosted Indian police before GTA VI",
        "Went to check my spam sec this morning and found this mail, wasn't thinking much because of the domain name which says '.de' which refers to Germany but still deep inside I was still doubting myself n started getting scared a bit like what if it's real, I didn't even open the file given below, so headed here to reddit and searched few keywords n found your post. I feel so relieved now, I'm very much thankful to you. ",
        "I got the same mail, actually after a long time I was checking my mail, and saw 2 in spam, i clicked it, one was some newsletter and then other one was this. \nFor a moment I was like, WTF is this and check the sender's mail, I felt it was fake, did a Google search and i landed here. \nThose scammers fuckers are crossing the line with all these.",
        "Love you reddit",
        "And come to reddit ",
        "Lol that email ID. All govt communications will take place through official email domains, if not by actual police breaking down doors.",
        "When I was looking in the spam folder of my Gmail I saw two mails sent a fortnight back.. content is ditto the same.. Sender was: DECREE FROM COURT. <police.sstt.in.gov67@wve41s31q.hier-im-netz.de>.. There was reply to address: police4.in.gov.cybercrime@gmail.com..  Then I started searching net  with the key words: scam porn cyber police,  I hit this post in reddit.. thanks bro for the info.  I also saw an alert from Home Ministry warning people about this scam.",
        "Got the same today, funny part ye hai sabke case me CBI ka director is different",
        "Also beware of calls from \"detectives\" telling you to pay someone threw zelle or cashapp that's definitely a scam and u need to be aware \n\nStorytime: I was on a dating app and texted a 24F and for about a week or so haven't texted her or anything didn't really mind it only texting to get to know each other then I get a phone call from a \"DETECTIVE\" saying she is 16 and that's CP I need to pay court fees of 1250$ to some gmail threw zelle or other payment methods also to not tell anyone or it will go public and the afficial case will be filed and I will have a warrant.         \nThe funny thing is he isn't from my state it's a whole different state and the money I'm sending to is another state not where the detective is from? Bruh definitely a scam and will contact my attorney to deal with something if it comes to it",
        "I received this to, and i am not even from India"
    ],
    "cleaned_text": "scam alert cbi email pornography hi received email accusing participating sharing child pornography various things would like enlighten people beware scams tell tale signs knowledge computers working government departments well biggest sign sheer stamps document never find many stamps official communication common man unknown working agencies surely pressure see many stamps number departments mentioned documents non sensical madhya pradesh cyber cell bprd cbi individual agencies never find many agencies single case nd image delhis office commissioner police mentioned wait got letter cbi last image see email sent de domain enough mark scam reply email also gmail one govt department mails always end gov nic kindly share add beware people scams ",
    "cleaned_title": "scam alert cbi email pornography",
    "cleaned_selftext": "hi received email accusing participating sharing child pornography various things would like enlighten people beware scams tell tale signs knowledge computers working government departments well biggest sign sheer stamps document never find many stamps official communication common man unknown working agencies surely pressure see many stamps number departments mentioned documents non sensical madhya pradesh cyber cell bprd cbi individual agencies never find many agencies single case nd image delhis office commissioner police mentioned wait got letter cbi last image see email sent de domain enough mark scam reply email also gmail one govt department mails always end gov nic kindly share add beware people scams",
    "cleaned_comments": "really creative man art biggest collab century prn dekhne ke case ib involve ho gyi get mail op websites visit last image used emojis ffs top secret raw bhi hai simple look fucking email id came worst jumble garbage ever scam real af aur pucho link kaha hai mera ko toh call aya tha paisa demand kr rhe bole aap boht zada ashleel video dekhte ho thats made real course indians scamming habits beyond anyones imagination everything looking fine saw top secret wth last line mai national highway kaha se aaya line ke niche also top secret document arriving gmail unannounced also labs lol squard kyu dekhte ho itni porn think almost looks legit things missing faces dhoni amitabh bachchan modi bhai almost expecting see cid ka logo acp pradyuman ka naam quite convincing doubt dont think twicejust visit area police station bruh sender looks genuine thats real address bureau police research development one header footer looks legit emojis looks scary ends subject must official court order nofap noproblem trying replying see happens always wonder smarter guys start scamming people nothing except morals stand stopping switching sides sender email address appears within network deutsche telekom try report go back germany awww poor guys dont use chatgpt frame messages good bawa thanks posting received friday could identify scam email sent de domain smarter guys dont scam make heists police instead arrest right help quite unfortunate govt authority would never use phrase lol one friend also got mail wake babe new scam dropped nice try op see jail help mere toh papa ko phone aaya thaa ki aapka beta bahot ashleel videos dekhta hai good father part law enforcement hehe got thing whatsapp except cutoff time wasnt pm pm name devesh joshi fuck font play along see far goes keep us updated wouldnt even mad receive guys everyone calling scam saans leta hun toh desh mein koi naya scam shuru ho jata hai shame theres fbi interpol seal never knew system collaborativemera sbi ka kaam bhi krwa plej forward email got email well claiming used pegasus take control device however used imazing tool scan theres double check given hrs would like see forward emails screenshot scare back advice needs logos bhai raw ib want raid ip connection must someone immense interest take chill pill ask bail ask call whatsapp police uniform talk video call surrounding resemble comissioner office tell cms relative cut cheif electricity officer another earth worstoflist top secret reaching privately one many official attestation classic oxymoron op reply xd isnt old one top secret sending thro mail bro added every seal png find internet lol legit large population indians watch child porn whats issue basic grammar funniest thing signature tapan deka itne chote naam ka itna bada signature scam karne k liye bhi akal lagti bc raw ko bhi include kardia inlog ne apne threat send dick pic partnership indian cyber squard course legit missing atmanirbhar bharat tag padhne likhne ki umr mai sorry bhai mujhe kya pata tha cbi bhi saath dekh rahi hogi indian cyber sqward saar many logos want add make look authentic yes q many stamps need yes mujhe bhi aaya tha maine lamba keecha tha end usne call kiya maine bola tha ki itna paisa le rhe ho sir chhorne ka pls apni biwi ki nudes bhi dedo see chrome search history traumatized life lolll damn english getting better theyre evolving gta star criminal none signatures match name warrant anything close authentic would probably send avengers arrest mahasangam respond please come arrest need free food bed next months set desktop background somehow rabbit hole funny times underrated comment thing missing image vishwaguru namos face features official government scams also feature less official versions happens next people get scammed go court pay online scammers didnt even try make email id look legit lmao proceeds scam scammer absolutely hilarious wonder would actually happen case certified top secret would convincing added couple stamps genuine subject kanoon ke weighing scales actually year unexpected collabs low effort scam thats ibs real seal top secret atleast could organized emblems neatly thanks posting op great work lucky butbutbrazzers free month avengers assembled yakuza used something similar deliver porno mags someones doorstep delivery guy demands charge threatens call police either victim pays get shamed gets call police gets extorted fake avengers assemble take fake pdf file using phone yes may case important govt may snooping yes thought sending certificate back way getting pegasus days ago woman called father unpaid loan bank filed case mumbai high court hearing hour wanted talk father didnt comply threatened us jailed top secret certified btw yes every dham agency india sure scam also announing illegeal shit scams buy data google google records everything online incognito really incognito top secret official legal business getting money say got evidence ran dna analysis picture u contact start asking money hush things get arrested ur going far afraid anything would contacted putting scams work fear u give knee jerk reactionu lose always take time think responding pegasus sold govt institutions random private company ur safe unless ur deep shit smart guys dont bother stuff scam make sure law enforcement banks government support scam either open fraudulent business make bank loans open religious place worship keep raking billions without paying dime taxes small time fraudsters like one see benchood days ago got custom scam call said done initiator fake cop called face like emoji atm cards different type drugs caught lmao guys call cybercell mha report scam end jamtara biness certified stamp know legit subject line emojis reply email got really turned interest nutted thanks bust know know empty threat also costs millions dollars still got icloud email still send email responding hrs would like send hoping would lose shit shit signatures un resolution cbi doesnt use century gothic either find notion rando bureaucrat sitting cbi watching whether seeing porn quite funny though scam officer sawdhan rahesatark rahe thing switch sides competent even competent people look bust us yeah theres absolutely nothing stopping anyone fear getting caught doesnt matter doesnt stamp pmo personal signature panlogical squard notice document cocaine missed film federation didnt certify damn films dawg got email word word making rounds pakistan lmfao hahahahahahaha ridiculously fake tu saans lena band karde iss desh ka bhala ho jayega certified like certified bs kr deta im still virgin think still needs signatures could fake year old would freaked fuck ah see feel like purpose planet need stamps make really official much white space wondering op replies teri mkc send dp resend scam email lol give proof actually sharing explicit pictures minors yes beloved govt employees want get work done lunch took time vary font size different lines page nice work mr devesh thats good scam even gmail thinks spam maha gathbandhan agencies nahi bhai ministry defense reh gai thats keep saying like madman use vpn child p wow mail ceo chief electricity officer nothing says email legit emoji first character tiger save rhea chakraborty ko investigate karne ke alwa bhi toh kuch timepass chahiye cbi ko bhai missed research analysis wing lol far know foreign intelligence agencies doesnt operate country na bhai insaaf ka tarazu legitthere g summit logo legitthere g summit logo legitthere g summit logo notice sent national highways hell police research development jab bhi court order aayega vo email mai nahi ek letter mai aayega anything else fake jo bhi hai looks stylish indian govt use colour waste pixels juat want put update bill calling electricity helpline number till line taken bescom appbangalore electricity provider full form like exact thing scam se pehle thora padh toh liya karo scam se pehle cbi nodal agency interpol aur partnership ye kya hota hain koi sponsorship hain kya tata ipl partnership dream court order sealed envelope mein aata hain court seal sarkari document hain kirane ka list nhi years since checked email work done teams whatsapp dream collaboration letter agencies dude wrote letter research agencies forgot spellgrammar check insaaf ka taraju please check email career prospect scammers failed mention raw ib lol top secret stamp ipl sticker missing im also pretty sure notified youre suspicion cp got suspicion follow closely catch straight raid kya scammer banega tu moment translation become good scammer scotland yard coming arrest op anytime hahahahhahahaway many signatures many stamps cant stop laughing thanks informing scam mindful certified copy ofcourse fake lacks modijis photo bhai mail pr aisa reply karo ki tumhe lagg raha ye legit h aur darr gaya h tu phir mazee lete h inki ki ye logg kya kya bolte h dont think india even dont time real problems busy enough raiding political opponents rulers paw patrol logo missing otherwise would legit cheif reply porn links marked top secret emailed individual share internet hope go hell scams everyone clever like op thanks much pls dont sign free milfs resources would love open toll free helpline preventing frauds bro says certified certified gandhi ka chasma looks legit cybercrine helpline established gov india already burdened cases however would suggest tag thr cbi cyberpolice x level mockery done name certified top secret hood classic could use grammarly subscription star khao khud jaan jao itna hi neet aur net paper leak karne walo pe mehnat kar lete punks decided make mahipalpur shady place scams prajwal revanna received today personally received company honestly receive lot police emails nature business company thought also genuine asked respond email send court order responded email also little internet search revealed scam fake email id biggest give away additionally said court order firstly order without case court notices etc come court police certainly email gon na lie fooled didnt think much yeah email filled tell tales scam nah op trying gaslight us notice aint real seems like lawyers didnt get employment became scamsters whats certified stamp first slide certified pdf file got german hosted indian police gta vi went check spam sec morning found mail wasnt thinking much domain name says de refers germany still deep inside still doubting n started getting scared bit like real didnt even open file given headed reddit searched keywords n found post feel relieved im much thankful got mail actually long time checking mail saw spam clicked one newsletter one moment like wtf check senders mail felt fake google search landed scammers fuckers crossing line love reddit come reddit lol email id govt communications take place official email domains actual police breaking doors looking spam folder gmail saw two mails sent fortnight back content ditto sender decree court policessttingovwvesqhierimnetzde reply address policeingovcybercrimegmailcom started searching net key words scam porn cyber police hit post reddit thanks bro info also saw alert home ministry warning people scam got today funny part ye hai sabke case cbi ka director different also beware calls detectives telling pay someone threw zelle cashapp thats definitely scam u need aware storytime dating app texted f week havent texted anything didnt really mind texting get know get phone call detective saying thats cp need pay court fees gmail threw zelle payment methods also tell anyone go public afficial case filed warrant funny thing isnt state whole different state money im sending another state detective bruh definitely scam contact attorney deal something comes received even india",
    "light_cleaned_title": "Scam alert - CBI email for pornography",
    "light_cleaned_selftext": "Hi. I have received email accusing me of participating in sharing child pornography and various other things. I would like to enlighten people on how to be beware of such scams and what are the tell tale signs. I have knowledge of computers and working of government departments as well. 1. The biggest sign is sheer no of stamps on the document. You will never find these many stamps on an official communication. A common man unknown to the working of agencies, will surely be under pressure to see so many stamps. 2. Number of departments mentioned on the documents are non sensical - Madhya pradesh cyber cell, BPRD and CBI. These are all Individual agencies and never will you find so many agencies on a single case. 3. In 2nd image, DELHI'S office of commissioner of police is mentioned. But wait, I got the letter from CBI?? 4. In the last image, we can see the email is sent from. De domain. This itself should be enough to mark it as scam. The reply email is also Gmail one. Govt department mails always end with. Gov or. Nic. Kindly share and add to this to beware people of these scams.",
    "light_cleaned_comments": "This is really creative. 10/10 man. This is art. That is the biggest collab of the century P\\*rn dekhne ke case IB involve ho gyi💀 Why did you get this mail, op? What websites do you visit? For the last image, they used emojis ffs Top SECRET 🥹🥹🥲 RAW bhi hai Simple look at the fucking email ID from which it came, worst jumble of garbage ever It's not a scam. It's real af. Aur pucho link kaha hai .... /s Mera ko toh call aya tha. Paisa demand kr rhe the. Bole AAP boht zada ashleel video dekhte ho Thats how they made it real of course. Indians and their scamming habits are beyond anyone's imagination. Everything was looking fine until i saw top secret 💀 WTH last line mai NATIONAL HIGHWAY kaha se aaya line ke niche And also it's a top secret document arriving in Gmail unannounced. Also they have labs. Lol. Squard Kyu dekhte ho itni Porn. /s I think this almost looks legit. The only things missing on this are faces of Dhoni, Amitabh Bachchan and Modi. Bhai, I was almost expecting to see CID ka logo and ACP Pradyuman ka naam. This is quite convincing.. when in doubt.. dont think twice..just visit your area police station. Bruh sender looks genuine 😃👍🏻 /s 🧑‍⚖️🚨 That’s the real address of Bureau of Police Research and Development. One is in Header, the other is in footer. Looks legit, those ‘⚖️’ emojis looks very scary in both ends of subject, must be an official court order #NoFap NoProblem Trying replying to them to see what happens 😂😂😂 I always wonder, what if the smarter guys start scamming people 🤔 Nothing except morals stand before them stopping them from switching sides 🙂 The sender e-mail address appears to be within the network of Deutsche Telekom. I will try to report it when I go back to Germany. Awww poor guys dont use chatgpt to frame their messages🤡 /s Not as good as this O bawa thanks for posting, i received it on friday and I could only identify as scam as email was sent from . De domain. Smarter guys don't scam. They make heists The police will instead arrest you right? Or will they help? \"quite unfortunate\" a govt authority would never use such a phrase Lol 😂😂😂, one of my friend also got this in mail. Wake up babe, new scam just dropped Nice try op. see you in jail help Mere toh papa ko phone aaya thaa ki aapka beta bahot ashleel videos dekhta hai. Good that my father himself is part of law enforcement Hehe I got the same thing through WhatsApp 😄😄. Except that the cutoff time wasn't 9 pm, it was 8.39 pm. The name was the same devesh Joshi. The fuck is that font ⚖️⚖️ You should play along and see how far it goes. Do keep us updated. I wouldn't even be mad if I receive this Guys why is everyone calling this a scam Saans leta hun toh is desh mein koi naya scam shuru ho jata hai Shame there's no FBI and Interpol seal on this. Never knew the system was so collaborative....mera sbi ka kaam bhi krwa do plej Can you forward me this email? I got an email as well claiming to have used ‘Pegasus’ to take control of my device, however I have used the iMazing tool to scan if there’s any (just for double check). Have been given 48hrs, would like to see if I can forward your emails or a screenshot to scare them back… (do advice) Needs more logos Bhai, RAW and IB want to raid my IP connection? I must be someone of immense interest! take a chill pill, ask them to bail you out, they will ask you to call on whatsapp, some police in uniform will talk to you on a video call, the surrounding will resemble a comissioner office. tell him you are some CM's relative and they will cut off. “cheif electricity officer” It is from another earth 863 “Worst-of-list” Top secret 🤡🤣 Reaching you privately with one too many official Attestation. Classic oxymoron. OP what did you reply? xD Isn't this old one Top Secret? Sending thro mail 😂 bro added every seal png he can find on internet LOL If this is Legit then a large population of Indians watch Child Porn What's their issue with basic grammar? Funniest thing is the signature of Tapan Deka! Itne chote naam ka itna bada signature. Scam karne k liye bhi akal lagti.. bc RAW ko bhi include kardia inlog ne apne threat me 😆 Send them Dick pic. They are in partnership with Indian Cyber SquaRd. Of course they are legit. Missing \"atmanirbhar bharat\" tag. Padhne likhne ki umr mai, sorry bhai, mujhe kya pata tha CBI bhi saath dekh rahi hogi Indian Cyber Sqward !!! saar how many logos you want me to add to make it look authentic? yes Q - How many stamps you need? A - yes Mujhe bhi aaya tha maine to lamba keecha tha, At the end usne call kiya to maine bola tha ki itna paisa le rhe ho sir chhorne ka, pls apni biwi ki nudes bhi dedo If they see my chrome search history they will traumatized for life lolll 😂 Damn their English is getting better, they're evolving GTA 5 star criminal None of the signatures match the name. If the warrant was anything close to authentic, they would probably send the Avengers to arrest you. Mahasangam You should respond to them. Please come arrest me. I need free food and bed for the next 6 months. This was once set as my desktop background somehow when I was down there in the rabbit hole. Funny times 😂 Underrated comment The only thing missing is an image of the Vishwaguru. NaMo's face features on official government scams and should also feature on less official versions. So what happens next.. people who get scammed will go to court or just pay online to scammers? They didn't even try to make the email ID look legit lmao *proceeds to scam the scammer* absolutely hilarious, I wonder what would actually happen in that case 😂 \"Certified\" \"Top Secret\"😂😂 It would have been more convincing if they had added a couple of more stamps. Genuine 💯% Subject has kanoon ke weighing scales 2024 is actually the year of unexpected collabs Low effort scam That's not IB's real seal Top secret Atleast they could have organized those emblems neatly Thanks for posting this OP you are doing great work 🤣🤣🤣 Lucky you BUT...BUT...Brazzers is free this month, what can I do ? The Avengers Assembled Yakuza use/d to do something similar. Deliver porno mags to someone's doorstep. The \"delivery guy\" demands charge, threatens to call \"police\". Either the victim pays to not get shamed or gets the call from \"police\" and gets extorted Fake avengers assemble to take down fake pdf file Are you using i phone? If yes that may be the case. But are you that important that govt may be snooping you? Yes but I thought of sending the certificate to him back because no way am getting by Pegasus. Some days ago a woman called me that my father has an unpaid loan because of which the bank has filed a case in the Mumbai high court and its hearing is in 1 hour. She wanted to talk to my father. When i didn't comply she threatened that all of us will be jailed. TOP SECRET & this is certified, btw. Yes by every dham agency in india this sure is scam, but you are also announing that you are into illegeal shit. these scams buy data from google, and google records everything you are doing online.. incognito is not really incognito. 'Top Secret' 😁 ⚖️ ⚖️official legal business ⚖️ So how are they getting money from this They will say we got evidence and we ran dna analysis on this picture Once u contact them, they will start asking money to hush the things. Or you get arrested. Ur going too far. If I was afraid of anything, I would have contacted them. Not putting it here. Most of the scams work on fear. If u give knee jerk reaction,u will lose. Always take time to think before responding. Pegasus is only sold to govt. Institutions. Not any random private company. Ur safe unless ur in some deep shit. Smart guys don't bother with this stuff. When they scam, they make sure the law enforcement, the banks and the government support their scam. So they either open a fraudulent business and make off with bank loans or they open a religious place of worship and keep raking in billions without paying a dime in taxes. And then there are small time fraudsters like the one we see here. \"benchood\" A few days ago I got custom scam call. All said and done with the initiator, the fake cop who called again had a face like an emoji. 50 ATM Cards and 2 different type of drugs caught. Lmao. Guys call 1930 (Cybercell under MHA) and report the scam. This is how we end Jamtara biness. Not the CERTIFIED stamp 💀 you know its legit when the subject line has emojis in it Reply to the email \"I got really turned on by your interest in me and I nutted. Thanks for the bust\" I know, I know… it’s an empty threat (it also costs millions in dollars) but still they got my iCloud email. So, if they still send an email after not responding to them in their 48hrs then I would like to send this hoping it would lose them their shit. (≧∀≦) This shit has more signatures than a UN resolution Cbi doesn't use century gothic either. I find the notion of some rando bureaucrat sitting in CBI watching whether I am seeing porn quite funny though. it’s scam, officer here Sawdhan rahe..satark rahe The thing is if we switch sides we will be so competent that even more competent people will look into it and bust us. So yeah there's absolutely nothing stopping anyone but the fear of getting caught. But doesn't matter if it doesn't have the stamp of PMO and personal signature of panlogical being. \"Squard\" That notice document is on cocaine But they missed the Film Federation. They didn't certify the damn films! Dawg we got this email word for word making rounds in Pakistan too lmfao Hahahahahahaha. This is ridiculously fake. Tu saans lena band karde, iss desh ka bhala ho jayega *”certified”* More like certified bs. Kr deta but I'm still a virgin so .......... I think it still needs some more signatures no? Could be fake. 12 year old me would have freaked the fuck out Ah, I see. Now I feel like I have no purpose on this planet We need a few more stamps to make this really official. So much white space. /s Just wondering what if OP replies Teri mkc Send DP and then resend them this same scam email lol Then he will give them proof of actually sharing explicit pictures of minors. Yes, our beloved govt, employees who just want to get work done before lunch took the time to vary font size in different lines of same page, nice work Mr. Devesh That's not very good scam when even Gmail thinks it's a spam Maha gathbandhan of agencies 😂🤣 Nahi bhai ministry of defense reh gai That's why I keep saying like a madman to use VPN for child p*&@... Wow a mail from the CEO (Chief Electricity Officer) 👨🏽‍💼 Nothing says an email is legit other than an emoji as your first character. Only Tiger can save you now! Rhea Chakraborty ko investigate karne ke alwa bhi toh kuch timepass chahiye CBI ko bhai You missed Research and analysis wing. Lol, as far as I know foreign intelligence agencies doesn't operate in their own country. Na bhai, insaaf ka tarazu Not legit..there is no G20 Summit logo Not legit..there is no G20 Summit logo Not legit..there is no G20 Summit logo Notice was sent by national highways..?? And what the hell is police research and development..??🤣 Jab bhi court order aayega to vo email mai nahi ek LETTER mai aayega …..anything else than that is fake Jo bhi hai looks very stylish Indian govt not use colour. Waste of pixels. Juat want to put it out here. > Now you update your bill by just calling our electricity helpline number. Till this line, it was taken from BESCOM app(Bangalore electricity provider some full form like that). They have the exact same thing. Are scam se pehle thora padh toh liya karo scam se pehle CBI is the nodal agency for Interpol aur in partnership with ye Kya hota hain koi sponsorship hain kya Tata IPL in partnership with dream 11 🤣🤣 Court order sealed envelope mein aata hain with court seal. Sarkari document hain kirane ka list nhi 😂😂 Its been years since I checked email. My work is done on Teams or Whatsapp. This is a dream collaboration of all 3 letter agencies. Dude who wrote this letter did research about the agencies but forgot to do a spell/grammar check. 🤣 Insaaf ka taraju ⚖️... Please check your email. What about the career prospect of the scammers. I failed to mention RAW AND IB. Lol it has top secret stamp🤣🤣 Only IPL sticker is missing I'm also pretty sure you will not be notified if you're under suspicion of CP. If they got suspicion, they follow you closely until they catch you and then straight up raid you. \"Kya scammer banega re tu!\" moment. Translation: \"How will you become a good scammer.\" The Scotland yard coming to arrest OP anytime now. HAHAHAHHAHAHA!!!...way too many signatures and too many stamps!!! i cant stop laughing!!!! Thanks for informing about the scam, will be mindful. *Certified Copy* Ofcourse it's fake. It lacks modiji's photo Bhai mail pr aisa reply karo ki tumhe lagg raha ye legit h aur darr gaya h tu. Phir mazee lete h inki ki ye logg kya kya bolte h🤣 I don't think in India they will even do that. They don't have time for real problems. They are busy enough raiding political opponents of the rulers. Paw patrol logo is missing otherwise would be legit *Cheif Reply with a few porn links. It's marked \"Top secret\" but emailed to an individual who can share it on the internet. I hope they go to hell for doing such scams, not everyone is so clever like you Op. Thanks so much. Pls don't sign up for free milfs If I had the resources, I would love to open a toll free helpline for preventing such frauds. Bro if it says certified it is certified Those Gandhi ka chasma looks legit 😅 there is a cybercrine helpline established by the gov of India, but they are already burdened with 1000 of cases. However, I would suggest you tag thr CBI, cyberpolice on X so that they now this level of mockery being done on their name. This is a \" certified\" \"top secret\" hood classic Could use grammarly subscription 5 star khao khud jaan jao Itna hi neet aur net paper leak karne walo pe mehnat kar lete. All these punks decided to make Mahipalpur a shady place just because of these scams. And, Prajwal Revanna?? I just received this today. And not personally but this was received by my company. Honestly, we receive a lot of police emails (nature of business of the company) so we thought this is also genuine. We were asked to just respond on the email and then they will send the \"court order\". We responded on the email also. But then a little internet search revealed this scam. The fake email id was the biggest give away. Additionally, they said there is a \"court order\". Firstly there is no order without any case, and court notices etc come from the court, not by police and certainly not on email. Not gonna lie, we were fooled as we didn't think much about it, but yeah the email was filled with tell tales of a scam. Nah op trying to gaslight us that this notice ain't real Seems like some lawyers didn't get any employment and became scamsters What’s with the CERTIFIED stamp on the first slide? Certified Pdf file? We got German hosted Indian police before GTA VI Went to check my spam sec this morning and found this mail, wasn't thinking much because of the domain name which says '.de' which refers to Germany but still deep inside I was still doubting myself n started getting scared a bit like what if it's real, I didn't even open the file given below, so headed here to reddit and searched few keywords n found your post. I feel so relieved now, I'm very much thankful to you. I got the same mail, actually after a long time I was checking my mail, and saw 2 in spam, i clicked it, one was some newsletter and then other one was this. For a moment I was like, WTF is this and check the sender's mail, I felt it was fake, did a Google search and i landed here. Those scammers fuckers are crossing the line with all these. Love you reddit And come to reddit Lol that email ID. All govt communications will take place through official email domains, if not by actual police breaking down doors. When I was looking in the spam folder of my Gmail I saw two mails sent a fortnight back.. content is ditto the same.. Sender was: DECREE FROM COURT. <police.sstt.in.gov67@wve41s31q.hier-im-netz.de>.. There was reply to address: police4.in.gov.cybercrime@gmail.com.. Then I started searching net with the key words: scam porn cyber police, I hit this post in reddit.. thanks bro for the info. I also saw an alert from Home Ministry warning people about this scam. Got the same today, funny part ye hai sabke case me CBI ka director is different Also beware of calls from \"detectives\" telling you to pay someone threw zelle or cashapp that's definitely a scam and u need to be aware Storytime: I was on a dating app and texted a 24F and for about a week or so haven't texted her or anything didn't really mind it only texting to get to know each other then I get a phone call from a \"DETECTIVE\" saying she is 16 and that's CP I need to pay court fees of 1250$ to some gmail threw zelle or other payment methods also to not tell anyone or it will go public and the afficial case will be filed and I will have a warrant. The funny thing is he isn't from my state it's a whole different state and the money I'm sending to is another state not where the detective is from? Bruh definitely a scam and will contact my attorney to deal with something if it comes to it I received this to, and i am not even from India"
}