{
    "id": "14nuf0n",
    "title": "Is the double engine of Modi Government so incompetent that a state has been engulfed in violence for nearly two months? How is George Soros able to orchestrate such plots in India? Is Amit Shah stupid?",
    "url": "https://www.reddit.com/r/india/comments/14nuf0n/is_the_double_engine_of_modi_government_so/",
    "selftext": "I saw some comments on social media that Manipur violence has been orchestrated by George Soros and Congress. Couldn't help it. Apparently, George Soros has been orchestrating every little scheme against Modiji. He has become so powerful in India, that even “chanakya” Amit Shah is unable to stop him. First Nehru, now Soros. Why is everyone conspiring against Modiji? This is so unfair.\n\nMust read,\n\n[Manipur displays Narendra Modi’s idea of India](https://caravanmagazine.in/commentary/manipur-violence-narendra-modi-idea-of-india)\n\n[Manipur violence: 9 BJP MLAs write to PM Modi, say people lost trust in state government - India Today](https://www.indiatoday.in/india/story/manipur-violence-bjp-meitei-mlas-narendra-modi-memorandum-people-lost-trust-biren-singh-government-2395774-2023-06-21)\n\n[His house burnt, Union minister admits Manipur government has failed to maintain law and order- The New Indian Express](https://www.newindianexpress.com/nation/northeast/2023/jun/16/his-house-burnt-union-minister-admits-manipur-government-has-failed-to-maintain-law-and-order-2585668.html)\n\n[Manipur | PM Narendra Modi leaves for foreign trip, waiting delegation from Manipur dismayed - Telegraph India](https://www.telegraphindia.com/india/pm-narendra-modi-leaves-for-foreign-trip-waiting-delegation-from-manipur-dismayed/cid/1946511)\n\n['Not Given Enough Time to Speak at Shah's All-Party Meet,' Says Ibobi Singh, Only Manipur Representative](https://thewire.in/rights/okram-ibobi-singh-manipur-amit-shah)\n\n[Three Delegations From Violence-Struck Manipur Have Failed to Meet PM Modi](https://thewire.in/government/manipur-violence-narendra-modi-silence-mlas-teams)\n\n[Narendra Modi | Manipur residents boycott Mann Ki Baat, stomp on transistor sets to protest against PM’s silence - Telegraph India](https://www.telegraphindia.com/north-east/manipur-residents-boycott-mann-ki-baat-stomp-on-transistor-sets-to-protest-against-pms-silence/cid/1946074)\n\n[यह कैसा राष्ट्रवाद है जो राष्ट्र की एकता के प्रति इतना लापरवाह है? - समता मार्ग](https://samtamarg.in/2023/06/28/what-kind-of-nationalism-is-this-that-is-so-careless-about-the-unity-of-the-nation/)\n\n[मणिपुर: दो मंत्रियों के घर जलाए गए | Homes of ministers burnt in Manipur - YouTube](https://www.youtube.com/watch?v=XsAK8TnqFtc)\n\n[मणिपुर: एक महीने से स्थिति बेक़ाबू | Manipur in turmoil for over a month - YouTube](https://www.youtube.com/watch?v=fbdYPNNN4W4)\n\n[\"मणिपुर की सरकार से भरोसा ख़त्म\" | \"Lost faith in Manipur govt\" - YouTube](https://www.youtube.com/watch?v=58jtaZ3Kk5Q)",
    "flair": "Politics",
    "score": 248,
    "num_comments": 40,
    "created_utc": 1688215991.0,
    "convurl": "https://external-preview.redd.it/tOSUwu4Ukupn1RqrFNKK3dUDeriqgNllPv8DYtq1Syc.jpg?auto=webp&s=c2d984a753a3bd194815646d73518db801111300",
    "comments": [
        "Bingo on Amit Shah.. but people who believe in his words and deluded and gullible..",
        "Keep quiet. \n\nWe're all UCC experts now.",
        "Rihanna  was apparently  the mastermind  for the Farmer's  protest under the \"international  conspiracy  theory \" .Amit Shah nd Modiji ain't stupid ,their followers   on the other hand ..they could literally  hold  👽 responsible  for some  other shit tomorrow  nd bhakts would actually  buy that crap ..",
        "It's the Indians that are stupid",
        "Nothing left for our leader to take picture with, or probably remind him of his past crimes from 2002... Maybe the smell of burnt corpses affect his taste buds.",
        "India is a joke and Modi the comedian",
        "No, they are not stupid. They just think the Indian people are the stupid ones.\n\nSoros or Beyonce (& others) are all conspiring against the country - guess who buys into this stupidity? The people.\n\nAlso, note the retweets by the celebrities (film, sports,etc) who continue to spread the word of these jokers.\n\nNot to forget the massive technological infrastructure of the  BJP IT cell, which works 24x7 through Twitter, Whatsapp, YouTube etc to ensure no one is missed.",
        "You know that dialogue from Guru which goes along the lines of Jab log tumhare khilaaf bolne lage samajh lo tarakki kar rage ho, (When people start bad mouthing you, know that you are ahead of the game), samesies.",
        "Time to ban all outside relations /s",
        "is that why people talk against ISIS and Taliban?",
        "I think the meaning of democracy is lost in a so called \"double engine\" strategy. Democracy's true power comes from not who is elected, but from who stands in opposition. It's the opposition's ability to act as the guy who checks every nook and cranny for any faults or shortcomings by the party in power and bringing them to light is invaluble, no matter how good or excellent of a job any government might be doing. No one is perfect, we all need criticism to grow and prosper. Otherwise, if only one party is calling all the shots and no one is there to question them, what's the use of democracy? Why even have sooo many political parties? Just install a monarchy/autocracy. Why even bother printing ballots and wasting money?  \nBut sadly due to weak/non existent/incompetent opposition, no one credible is left to question what the gov does anymore, who are free to peddle bullshit like \"double engine government\" propoganda.  \nI really hope RG grows both as a person and a political figure, for the sake of all of us, everyone including the bhakts, congress supporters, everyone, as Indians.  \nAlso regarding the George soros, I really find it hard to believe such a seemingly omnipotent and powerful org like BJP with all it's might cannot stop all this violence in manipur. It's rather like they WANT it to continue. BJP has found this tactic of scaring people into voting for them and their scare tactics have now become a cancer to the rest of the country.  The only solution is having a strong regional party to support and look after the interests of the locals rather than party officials from somewhere who understand next to nothing about a secluded and foreign place. People need to understand the diversity of India as a country where the spoken language and dialect changes for every 100kms and it cannot possibly be ruled by one and only party. Even the British had a hard time keeping it all together until they finally broke it up and left. We fell into that trap by congress and suffered for a good 60 years without major changes to the leadership, which allowed corruption and stagnation to fester. A strong opposition was missing then too. Infact, their incompetency is what led the BJP to its power i would argue. Let's not let it happen again. You either die a hero or live long enough to see yourself become the villian.",
        "You know it makes you wonder. If so many violent cases are caused by foreign bodies and terror outfits, wtf is Home Ministry doing? Spying on what Rahul Gandhi is eating for lunch? It's your job to stop it dilweed, this is a failure of intelligence (in both the police sense and intellect sense)",
        "Seems like I need to put in the /s , the movie is loosely inspired by papa Ambani, glamorises munafa and and in general business related skulduggery, most of the dialogues are along the lines of what our Majesty has said over the years.",
        "You do know this is a global conspiracy to malign India and destabilise the elections right? Manipur is a plot to draw the PMs attention away from the other important campaigns and electoral matters.",
        "George Soros is not even  in charge of his villainous empire any more. His son took over. Smh",
        "When the clowns 🤡 rule the circus or when the insane patients take over the asylum",
        "Suddenly Raga stands up and yells I AM BATMAN 😂",
        "I mean he ticked of the batman checklist \n\n1. Born in wealth \n2. Lost his dad at an early age \n3. Has a million dollar empire behind him\n4. Tries to be edgy (debatable)\n5. Thinks he can magically solve most of India's social ills (debatable)\n\nMuddyji is basically an incredibly lucky but dumber penguin (Gotham TV series)\n\n1. Born poor\n2. Grew up on the streets \n3. Incredibly charismatic \n4. Rises through the ranks of an underground organization \n5. Joins politics \n6. Wins a high ranking post \n7. Encourages cronyism \n8. Craves to be loved\n9. Craves to be considered an elite",
        "Georgie screwing Modi is the permanent theme for nut job bhakts",
        "Stop generalizing maan.\n\nMy astrologer read the skid marks of the cowdung outside a temple this morning at 5:47am, and realized on good authority that George Soros is Nehru reincarnated.\n\nHow many letters in S O R O S and N E H R U ?\n\nHow many letters in J A W A H A R L A L and G E O R G E ?\n\nDo your research people.",
        "You forgot the /s",
        "r/fuckthes",
        "The biggest joke is that BJP Bhakat is worried about France."
    ],
    "cleaned_text": "double engine modi government incompetent state engulfed violence nearly two months george soros able orchestrate plots india amit shah stupid saw comments social media manipur violence orchestrated george soros congress couldnt help apparently george soros orchestrating every little scheme modiji become powerful india even chanakya amit shah unable stop first nehru soros everyone conspiring modiji unfair must read manipur displays narendra modis idea indiahttpscaravanmagazineincommentarymanipurviolencenarendramodiideaofindia manipur violence bjp mlas write pm modi say people lost trust state government india todayhttpswwwindiatodayinindiastorymanipurviolencebjpmeiteimlasnarendramodimemorandumpeoplelosttrustbirensinghgovernment house burnt union minister admits manipur government failed maintain law order new indian expresshttpswwwnewindianexpresscomnationnortheastjunhishouseburntunionministeradmitsmanipurgovernmenthasfailedtomaintainlawandorderhtml manipur pm narendra modi leaves foreign trip waiting delegation manipur dismayed telegraph indiahttpswwwtelegraphindiacomindiapmnarendramodileavesforforeigntripwaitingdelegationfrommanipurdismayedcid given enough time speak shahs allparty meet says ibobi singh manipur representativehttpsthewireinrightsokramibobisinghmanipuramitshah three delegations violencestruck manipur failed meet pm modihttpsthewireingovernmentmanipurviolencenarendramodisilencemlasteams narendra modi manipur residents boycott mann ki baat stomp transistor sets protest pms silence telegraph indiahttpswwwtelegraphindiacomnortheastmanipurresidentsboycottmannkibaatstompontransistorsetstoprotestagainstpmssilencecid httpssamtamarginwhatkindofnationalismisthisthatissocarelessabouttheunityofthenation homes ministers burnt manipur youtubehttpswwwyoutubecomwatchvxsaktnqftc manipur turmoil month youtubehttpswwwyoutubecomwatchvfbdypnnnw lost faith manipur govt youtubehttpswwwyoutubecomwatchvjtazkkq ",
    "cleaned_title": "double engine modi government incompetent state engulfed violence nearly two months george soros able orchestrate plots india amit shah stupid",
    "cleaned_selftext": "saw comments social media manipur violence orchestrated george soros congress couldnt help apparently george soros orchestrating every little scheme modiji become powerful india even chanakya amit shah unable stop first nehru soros everyone conspiring modiji unfair must read manipur displays narendra modis idea indiahttpscaravanmagazineincommentarymanipurviolencenarendramodiideaofindia manipur violence bjp mlas write pm modi say people lost trust state government india todayhttpswwwindiatodayinindiastorymanipurviolencebjpmeiteimlasnarendramodimemorandumpeoplelosttrustbirensinghgovernment house burnt union minister admits manipur government failed maintain law order new indian expresshttpswwwnewindianexpresscomnationnortheastjunhishouseburntunionministeradmitsmanipurgovernmenthasfailedtomaintainlawandorderhtml manipur pm narendra modi leaves foreign trip waiting delegation manipur dismayed telegraph indiahttpswwwtelegraphindiacomindiapmnarendramodileavesforforeigntripwaitingdelegationfrommanipurdismayedcid given enough time speak shahs allparty meet says ibobi singh manipur representativehttpsthewireinrightsokramibobisinghmanipuramitshah three delegations violencestruck manipur failed meet pm modihttpsthewireingovernmentmanipurviolencenarendramodisilencemlasteams narendra modi manipur residents boycott mann ki baat stomp transistor sets protest pms silence telegraph indiahttpswwwtelegraphindiacomnortheastmanipurresidentsboycottmannkibaatstompontransistorsetstoprotestagainstpmssilencecid httpssamtamarginwhatkindofnationalismisthisthatissocarelessabouttheunityofthenation homes ministers burnt manipur youtubehttpswwwyoutubecomwatchvxsaktnqftc manipur turmoil month youtubehttpswwwyoutubecomwatchvfbdypnnnw lost faith manipur govt youtubehttpswwwyoutubecomwatchvjtazkkq",
    "cleaned_comments": "bingo amit shah people believe words deluded gullible keep quiet ucc experts rihanna apparently mastermind farmers protest international conspiracy theory amit shah nd modiji aint stupid followers hand could literally hold responsible shit tomorrow nd bhakts would actually buy crap indians stupid nothing left leader take picture probably remind past crimes maybe smell burnt corpses affect taste buds india joke modi comedian stupid think indian people stupid ones soros beyonce others conspiring country guess buys stupidity people also note retweets celebrities film sportsetc continue spread word jokers forget massive technological infrastructure bjp cell works x twitter whatsapp youtube etc ensure one missed know dialogue guru goes along lines jab log tumhare khilaaf bolne lage samajh lo tarakki kar rage ho people start bad mouthing know ahead game samesies time ban outside relations people talk isis taliban think meaning democracy lost called double engine strategy democracys true power comes elected stands opposition oppositions ability act guy checks every nook cranny faults shortcomings party power bringing light invaluble matter good excellent job government might one perfect need criticism grow prosper otherwise one party calling shots one question whats use democracy even sooo many political parties install monarchyautocracy even bother printing ballots wasting money sadly due weaknon existentincompetent opposition one credible left question gov anymore free peddle bullshit like double engine government propoganda really hope rg grows person political figure sake us everyone including bhakts congress supporters everyone indians also regarding george soros really find hard believe seemingly omnipotent powerful org like bjp might stop violence manipur rather like want continue bjp found tactic scaring people voting scare tactics become cancer rest country solution strong regional party support look interests locals rather party officials somewhere understand next nothing secluded foreign place people need understand diversity india country spoken language dialect changes every kms possibly ruled one party even british hard time keeping together finally broke left fell trap congress suffered good years without major changes leadership allowed corruption stagnation fester strong opposition missing infact incompetency led bjp power would argue lets let happen either die hero live long enough see become villian know makes wonder many violent cases caused foreign bodies terror outfits wtf home ministry spying rahul gandhi eating lunch job stop dilweed failure intelligence police sense intellect sense seems like need put movie loosely inspired papa ambani glamorises munafa general business related skulduggery dialogues along lines majesty said years know global conspiracy malign india destabilise elections right manipur plot draw pms attention away important campaigns electoral matters george soros even charge villainous empire son took smh clowns rule circus insane patients take asylum suddenly raga stands yells batman mean ticked batman checklist born wealth lost dad early age million dollar empire behind tries edgy debatable thinks magically solve indias social ills debatable muddyji basically incredibly lucky dumber penguin gotham tv series born poor grew streets incredibly charismatic rises ranks underground organization joins politics wins high ranking post encourages cronyism craves loved craves considered elite georgie screwing modi permanent theme nut job bhakts stop generalizing maan astrologer read skid marks cowdung outside temple morning realized good authority george soros nehru reincarnated many letters r n e h r u many letters j w h r l l g e r g e research people forgot rfuckthes biggest joke bjp bhakat worried france",
    "light_cleaned_title": "Is the double engine of Modi Government so incompetent that a state has been engulfed in violence for nearly two months? How is George Soros able to orchestrate such plots in India? Is Amit Shah stupid?",
    "light_cleaned_selftext": "I saw some comments on social media that Manipur violence has been orchestrated by George Soros and Congress. Couldn't help it. Apparently, George Soros has been orchestrating every little scheme against Modiji. He has become so powerful in India, that even “chanakya” Amit Shah is unable to stop him. First Nehru, now Soros. Why is everyone conspiring against Modiji? This is so unfair. Must read, [Manipur displays Narendra Modi’s idea of India](https://caravanmagazine.in/commentary/manipur-violence-narendra-modi-idea-of-india) [Manipur violence: 9 BJP MLAs write to PM Modi, say people lost trust in state government - India Today](https://www.indiatoday.in/india/story/manipur-violence-bjp-meitei-mlas-narendra-modi-memorandum-people-lost-trust-biren-singh-government-2395774-2023-06-21) [His house burnt, Union minister admits Manipur government has failed to maintain law and order- The New Indian Express](https://www.newindianexpress.com/nation/northeast/2023/jun/16/his-house-burnt-union-minister-admits-manipur-government-has-failed-to-maintain-law-and-order-2585668.html) [Manipur | PM Narendra Modi leaves for foreign trip, waiting delegation from Manipur dismayed - Telegraph India](https://www.telegraphindia.com/india/pm-narendra-modi-leaves-for-foreign-trip-waiting-delegation-from-manipur-dismayed/cid/1946511) ['Not Given Enough Time to Speak at Shah's All-Party Meet,' Says Ibobi Singh, Only Manipur Representative](https://thewire.in/rights/okram-ibobi-singh-manipur-amit-shah) [Three Delegations From Violence-Struck Manipur Have Failed to Meet PM Modi](https://thewire.in/government/manipur-violence-narendra-modi-silence-mlas-teams) [Narendra Modi | Manipur residents boycott Mann Ki Baat, stomp on transistor sets to protest against PM’s silence - Telegraph India](https://www.telegraphindia.com/north-east/manipur-residents-boycott-mann-ki-baat-stomp-on-transistor-sets-to-protest-against-pms-silence/cid/1946074) [यह कैसा राष्ट्रवाद है जो राष्ट्र की एकता के प्रति इतना लापरवाह है? - समता मार्ग](https://samtamarg.in/2023/06/28/what-kind-of-nationalism-is-this-that-is-so-careless-about-the-unity-of-the-nation/) [मणिपुर: दो मंत्रियों के घर जलाए गए | Homes of ministers burnt in Manipur - YouTube](https://www.youtube.com/watch?v=XsAK8TnqFtc) [मणिपुर: एक महीने से स्थिति बेक़ाबू | Manipur in turmoil for over a month - YouTube](https://www.youtube.com/watch?v=fbdYPNNN4W4) [\"मणिपुर की सरकार से भरोसा ख़त्म\" | \"Lost faith in Manipur govt\" - YouTube](https://www.youtube.com/watch?v=58jtaZ3Kk5Q)",
    "light_cleaned_comments": "Bingo on Amit Shah.. but people who believe in his words and deluded and gullible.. Keep quiet. We're all UCC experts now. Rihanna was apparently the mastermind for the Farmer's protest under the \"international conspiracy theory \" .Amit Shah nd Modiji ain't stupid ,their followers on the other hand ..they could literally hold 👽 responsible for some other shit tomorrow nd bhakts would actually buy that crap .. It's the Indians that are stupid Nothing left for our leader to take picture with, or probably remind him of his past crimes from 2002... Maybe the smell of burnt corpses affect his taste buds. India is a joke and Modi the comedian No, they are not stupid. They just think the Indian people are the stupid ones. Soros or Beyonce (& others) are all conspiring against the country - guess who buys into this stupidity? The people. Also, note the retweets by the celebrities (film, sports,etc) who continue to spread the word of these jokers. Not to forget the massive technological infrastructure of the BJP IT cell, which works 24x7 through Twitter, Whatsapp, YouTube etc to ensure no one is missed. You know that dialogue from Guru which goes along the lines of Jab log tumhare khilaaf bolne lage samajh lo tarakki kar rage ho, (When people start bad mouthing you, know that you are ahead of the game), samesies. Time to ban all outside relations /s is that why people talk against ISIS and Taliban? I think the meaning of democracy is lost in a so called \"double engine\" strategy. Democracy's true power comes from not who is elected, but from who stands in opposition. It's the opposition's ability to act as the guy who checks every nook and cranny for any faults or shortcomings by the party in power and bringing them to light is invaluble, no matter how good or excellent of a job any government might be doing. No one is perfect, we all need criticism to grow and prosper. Otherwise, if only one party is calling all the shots and no one is there to question them, what's the use of democracy? Why even have sooo many political parties? Just install a monarchy/autocracy. Why even bother printing ballots and wasting money? But sadly due to weak/non existent/incompetent opposition, no one credible is left to question what the gov does anymore, who are free to peddle bullshit like \"double engine government\" propoganda. I really hope RG grows both as a person and a political figure, for the sake of all of us, everyone including the bhakts, congress supporters, everyone, as Indians. Also regarding the George soros, I really find it hard to believe such a seemingly omnipotent and powerful org like BJP with all it's might cannot stop all this violence in manipur. It's rather like they WANT it to continue. BJP has found this tactic of scaring people into voting for them and their scare tactics have now become a cancer to the rest of the country. The only solution is having a strong regional party to support and look after the interests of the locals rather than party officials from somewhere who understand next to nothing about a secluded and foreign place. People need to understand the diversity of India as a country where the spoken language and dialect changes for every 100kms and it cannot possibly be ruled by one and only party. Even the British had a hard time keeping it all together until they finally broke it up and left. We fell into that trap by congress and suffered for a good 60 years without major changes to the leadership, which allowed corruption and stagnation to fester. A strong opposition was missing then too. Infact, their incompetency is what led the BJP to its power i would argue. Let's not let it happen again. You either die a hero or live long enough to see yourself become the villian. You know it makes you wonder. If so many violent cases are caused by foreign bodies and terror outfits, wtf is Home Ministry doing? Spying on what Rahul Gandhi is eating for lunch? It's your job to stop it dilweed, this is a failure of intelligence (in both the police sense and intellect sense) Seems like I need to put in the /s , the movie is loosely inspired by papa Ambani, glamorises munafa and and in general business related skulduggery, most of the dialogues are along the lines of what our Majesty has said over the years. You do know this is a global conspiracy to malign India and destabilise the elections right? Manipur is a plot to draw the PMs attention away from the other important campaigns and electoral matters. George Soros is not even in charge of his villainous empire any more. His son took over. Smh When the clowns 🤡 rule the circus or when the insane patients take over the asylum Suddenly Raga stands up and yells I AM BATMAN 😂 I mean he ticked of the batman checklist 1. Born in wealth 2. Lost his dad at an early age 3. Has a million dollar empire behind him 4. Tries to be edgy (debatable) 5. Thinks he can magically solve most of India's social ills (debatable) Muddyji is basically an incredibly lucky but dumber penguin (Gotham TV series) 1. Born poor 2. Grew up on the streets 3. Incredibly charismatic 4. Rises through the ranks of an underground organization 5. Joins politics 6. Wins a high ranking post 7. Encourages cronyism 8. Craves to be loved 9. Craves to be considered an elite Georgie screwing Modi is the permanent theme for nut job bhakts Stop generalizing maan. My astrologer read the skid marks of the cowdung outside a temple this morning at 5:47am, and realized on good authority that George Soros is Nehru reincarnated. How many letters in S O R O S and N E H R U ? How many letters in J A W A H A R L A L and G E O R G E ? Do your research people. You forgot the /s r/fuckthes The biggest joke is that BJP Bhakat is worried about France."
}