{
    "id": "owsvac",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/owsvac/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games as your entire post, make sure to write a word or two about the games.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**The Gaming Thread is posted every two weeks on Tuesday mornings.**\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 9,
    "num_comments": 15,
    "created_utc": 1627954210,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Hi! Returning AOE 2 player here. Picked up the definitive edition on steam last week. \n\nVery few of my friends play AOE 2 now. So I am looking for people to play the game causally with! \n\nComment or drop me a message if you are interested  :)",
        "Currently playing Pokemmo through android by emulator with my bro. Looks great gives classy feel of Nintendo pixelated graphic and crowded like a Mmo game. There are some downsides to it. As it is MMO, they literally nerfed some Pokemon and removed all legendary except few. Which does effect but you can PvP with your friends and people online create team and join events and Tournaments. So, it's perfectly balanced as all things should be.",
        "Please tell me more about it I love pokemon but i went to the website there isn't much info about what this is.",
        "I am playing pokemon x and will start pooemon y with a no restriction team from mysticumbreon. On emulator.",
        "I've been playing Stronghold Crusaders! Its actually my first time playing an RTS games, usually I play turn based strategy games like Civ V or Endless Legends, but returning to those feel too slow to me now haha. If anybody has any RTS recommendations that aren't too ancient or complicated, I would love to hear them!",
        "You should try age of empires 2. Game was released originally around 2001. Since community was still strong, Microsoft released a HD version of the game in 2012 and a definitive edition in 2019",
        "You can cross travel in all the regions till gen 5 except Johto after getting I don't remember 2 badges. You can PvP with random online player. It has a trading system called GTL where you can buy or sell Pokemon or items. You can breed Perfect Pokemon and sell there. If you want to catch a legendary you need to battle the trainer who owns it and there is one legendary per channel ( Total 6) They reduced that part it might affect the PvP system.  There lot of stuff going in there. They have their subreddit too r/pokemmo\n\nWell the website just has apk of emulator. There are steps to download given there below. Just follow them you need to download Roms for Black 2 white 2 atleast but I suggest download all the roms on your own. And there you go. This might help you. https://youtu.be/TGgCHid9-jE",
        "Quick question is it only for android or pc too?",
        "Quick question 2 qill you be my friend?",
        "Both",
        "Well I won't be much active from next weeks due to my class tests they ain't stopping then. But you can keep my id with you it's PapaPlayer You might find me in Sinnoh region in channel 1.",
        "How is the f1 multiplayer experience in India?",
        "Just finished the main story line on Outriders. I played it in single player mode. The story line was very average. Not really a fan of the game, maybe if I had friends to play it with it might better. I tried the auto matching system in the game but could not find anyone to play with.\n\nOverall I would give it a 3-4/10 in terms of single player gaming.",
        "1. The Lord of the Rings: The Battle for Middle-earth, both 1 and 2 are good and gives a different experience.\n2. Rise of Nations, Age of empire series, Age of mythology\n3. You might also like Roller coaster Tycoon, Zoo tycoon series and City skylines."
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings",
    "cleaned_comments": "hi returning aoe player picked definitive edition steam last week friends play aoe looking people play game causally comment drop message interested currently playing pokemmo android emulator bro looks great gives classy feel nintendo pixelated graphic crowded like mmo game downsides mmo literally nerfed pokemon removed legendary except effect pvp friends people online create team join events tournaments perfectly balanced things please tell love pokemon went website isnt much info playing pokemon x start pooemon restriction team mysticumbreon emulator ive playing stronghold crusaders actually first time playing rts games usually play turn based strategy games like civ v endless legends returning feel slow haha anybody rts recommendations arent ancient complicated would love hear try age empires game released originally around since community still strong microsoft released hd version game definitive edition cross travel regions till gen except johto getting dont remember badges pvp random online player trading system called gtl buy sell pokemon items breed perfect pokemon sell want catch legendary need battle trainer owns one legendary per channel total reduced part might affect pvp system lot stuff going subreddit rpokemmo well website apk emulator steps download given follow need download roms black white atleast suggest download roms go might help quick question android pc quick question qill friend well wont much active next weeks due class tests aint stopping keep id papaplayer might find sinnoh region channel f multiplayer experience india finished main story line outriders played single player mode story line average really fan game maybe friends play might better tried auto matching system game could find anyone play overall would give terms single player gaming lord rings battle middleearth good gives different experience rise nations age empire series age mythology might also like roller coaster tycoon zoo tycoon series city skylines",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games as your entire post, make sure to write a word or two about the games. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **The Gaming Thread is posted every two weeks on Tuesday mornings.**",
    "light_cleaned_comments": "Hi! Returning AOE 2 player here. Picked up the definitive edition on steam last week. Very few of my friends play AOE 2 now. So I am looking for people to play the game causally with! Comment or drop me a message if you are interested :) Currently playing Pokemmo through android by emulator with my bro. Looks great gives classy feel of Nintendo pixelated graphic and crowded like a Mmo game. There are some downsides to it. As it is MMO, they literally nerfed some Pokemon and removed all legendary except few. Which does effect but you can PvP with your friends and people online create team and join events and Tournaments. So, it's perfectly balanced as all things should be. Please tell me more about it I love pokemon but i went to the website there isn't much info about what this is. I am playing pokemon x and will start pooemon y with a no restriction team from mysticumbreon. On emulator. I've been playing Stronghold Crusaders! Its actually my first time playing an RTS games, usually I play turn based strategy games like Civ V or Endless Legends, but returning to those feel too slow to me now haha. If anybody has any RTS recommendations that aren't too ancient or complicated, I would love to hear them! You should try age of empires 2. Game was released originally around 2001. Since community was still strong, Microsoft released a HD version of the game in 2012 and a definitive edition in 2019 You can cross travel in all the regions till gen 5 except Johto after getting I don't remember 2 badges. You can PvP with random online player. It has a trading system called GTL where you can buy or sell Pokemon or items. You can breed Perfect Pokemon and sell there. If you want to catch a legendary you need to battle the trainer who owns it and there is one legendary per channel ( Total 6) They reduced that part it might affect the PvP system. There lot of stuff going in there. They have their subreddit too r/pokemmo Well the website just has apk of emulator. There are steps to download given there below. Just follow them you need to download Roms for Black 2 white 2 atleast but I suggest download all the roms on your own. And there you go. This might help you. Quick question is it only for android or pc too? Quick question 2 qill you be my friend? Both Well I won't be much active from next weeks due to my class tests they ain't stopping then. But you can keep my id with you it's PapaPlayer You might find me in Sinnoh region in channel 1. How is the f1 multiplayer experience in India? Just finished the main story line on Outriders. I played it in single player mode. The story line was very average. Not really a fan of the game, maybe if I had friends to play it with it might better. I tried the auto matching system in the game but could not find anyone to play with. Overall I would give it a 3-4/10 in terms of single player gaming. 1. The Lord of the Rings: The Battle for Middle-earth, both 1 and 2 are good and gives a different experience. 2. Rise of Nations, Age of empire series, Age of mythology 3. You might also like Roller coaster Tycoon, Zoo tycoon series and City skylines."
}