{
    "id": "155gs1g",
    "title": "Where can i find something like this India?",
    "url": "https://i.redd.it/m9iyq0qkt9db1.png",
    "selftext": "Hi folks, Can someone suggest where can i find key chain like this in India.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689924637.0,
    "convurl": "https://i.redd.it/m9iyq0qkt9db1.png",
    "comments": [
        "Esty App",
        "Does it deliver?",
        "Is it reliable i never tried.",
        "Where are you located",
        "Very reliable",
        "Far North India.",
        "I’m not sure if they would ship to India but you can check out the Esty App and ask the seller if they will ship to you",
        "https://www.etsy.com/listing/756365138/",
        "Yes, I have gotten really cute and handmade items from Florida and Uk. But you’ll have to pay the shipping charges.",
        "Is it worth or cheap?",
        "I ordered a handmade dream catcher, slightly on the expensive side but worth every penny. I have searched on many websites here in India, but nothing as full and heavy and good looking for the size that I wanted.\n\nIf you are ordering a small keychain, then it might become unnecessarily expensive.",
        "Yes i am getting this for 1.3 K ig.what is the delivery time",
        "It’ll usually be put on the website. The personalised wooden board took like 5 days to reach from US after ordering. But the personalised dream catcher took a month and a few days. \n\nSo they usually put on the website as to how many days for international orders.",
        "I can make it for you. Contact me if you need one"
    ],
    "cleaned_text": "find something like india hi folks someone suggest find key chain like india ",
    "cleaned_title": "find something like india",
    "cleaned_selftext": "hi folks someone suggest find key chain like india",
    "cleaned_comments": "esty app deliver reliable never tried located reliable far north india im sure would ship india check esty app ask seller ship yes gotten really cute handmade items florida uk youll pay shipping charges worth cheap ordered handmade dream catcher slightly expensive side worth every penny searched many websites india nothing full heavy good looking size wanted ordering small keychain might become unnecessarily expensive yes getting k igwhat delivery time itll usually put website personalised wooden board took like days reach us ordering personalised dream catcher took month days usually put website many days international orders make contact need one",
    "light_cleaned_title": "Where can i find something like this India?",
    "light_cleaned_selftext": "Hi folks, Can someone suggest where can i find key chain like this in India.",
    "light_cleaned_comments": "Esty App Does it deliver? Is it reliable i never tried. Where are you located Very reliable Far North India. I’m not sure if they would ship to India but you can check out the Esty App and ask the seller if they will ship to you Yes, I have gotten really cute and handmade items from Florida and Uk. But you’ll have to pay the shipping charges. Is it worth or cheap? I ordered a handmade dream catcher, slightly on the expensive side but worth every penny. I have searched on many websites here in India, but nothing as full and heavy and good looking for the size that I wanted. If you are ordering a small keychain, then it might become unnecessarily expensive. Yes i am getting this for 1.3 K ig.what is the delivery time It’ll usually be put on the website. The personalised wooden board took like 5 days to reach from US after ordering. But the personalised dream catcher took a month and a few days. So they usually put on the website as to how many days for international orders. I can make it for you. Contact me if you need one"
}