{
    "id": "15wdc23",
    "title": "Personal Finance Survey for Couples",
    "url": "https://docs.google.com/forms/d/e/1FAIpQLSfTzdQ2kJFwlYCP-4tzaWPeXwotp7SELyYiQaHEOp2jKle1NA/viewform",
    "selftext": "Hi, I am Jayteerth Katti. I am a Financial Wellbeing & Lifestyle Coach and the Founder of Coin Chemistry. I am building a community for married couples to help them achieve Financial Independence & Retire Early (FiRe) faster.\n\nI'd like to understand how couples manage their finances and the challenges they face. Please help me out by filling out this ten minutes survey. Your responses are completely anonymous and I assure you that no personal information will be shared. Your input would greatly assist my research and as a token of appreciation, I'll provide you and your spouse with free access to our VIP membership once it's open.\n\nIf this survey isn’t applicable to you or if you’ve already responded, please help me out by sharing this message with your spouse, friends and family for a wider reach.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1692542867.0,
    "convurl": "https://external-preview.redd.it/Qe1mTZLHF3q4FqWJ-sZo9Yq3QjwFoRyItTUTYjlhzuk.jpg?auto=webp&s=64eb1cf28aec01856549f39d95ce769dcc33aec5",
    "comments": [],
    "cleaned_text": "personal finance survey couples hi jayteerth katti financial wellbeing lifestyle coach founder coin chemistry building community married couples help achieve financial independence retire early fire faster id like understand couples manage finances challenges face please help filling ten minutes survey responses completely anonymous assure personal information shared input would greatly assist research token appreciation ill provide spouse free access vip membership open survey isnt applicable youve already responded please help sharing message spouse friends family wider reach ",
    "cleaned_title": "personal finance survey couples",
    "cleaned_selftext": "hi jayteerth katti financial wellbeing lifestyle coach founder coin chemistry building community married couples help achieve financial independence retire early fire faster id like understand couples manage finances challenges face please help filling ten minutes survey responses completely anonymous assure personal information shared input would greatly assist research token appreciation ill provide spouse free access vip membership open survey isnt applicable youve already responded please help sharing message spouse friends family wider reach",
    "cleaned_comments": "",
    "light_cleaned_title": "Personal Finance Survey for Couples",
    "light_cleaned_selftext": "Hi, I am Jayteerth Katti. I am a Financial Wellbeing & Lifestyle Coach and the Founder of Coin Chemistry. I am building a community for married couples to help them achieve Financial Independence & Retire Early (FiRe) faster. I'd like to understand how couples manage their finances and the challenges they face. Please help me out by filling out this ten minutes survey. Your responses are completely anonymous and I assure you that no personal information will be shared. Your input would greatly assist my research and as a token of appreciation, I'll provide you and your spouse with free access to our VIP membership once it's open. If this survey isn’t applicable to you or if you’ve already responded, please help me out by sharing this message with your spouse, friends and family for a wider reach.",
    "light_cleaned_comments": ""
}