{
    "id": "12ag1cr",
    "title": "NCERT removes chapters on Mughals from their textbooks, watch to know more",
    "url": "https://v.redd.it/0n5hgx06cnra1",
    "selftext": "https://twitter.com/IndiaToday/status/1642818912650756102?t=wF9ZdkhUxoZSc_Oho-5Yuw&s=19",
    "flair": "Politics",
    "score": 918,
    "num_comments": 215,
    "created_utc": 1680517623.0,
    "convurl": "https://external-preview.redd.it/JKvpqgkeohf6TdIZqHEHK8mWA40IcNGICYMKtKMF3kU.png?format=pjpg&auto=webp&v=enabled&s=c0e01fbfb834c83bc549eca36595229cfcf350a1",
    "comments": [
        "History was one of my fav subject when I was in school, especially the medieval period. Always thought I need more chapters about rulers.Now they are removing the ones that are already in it, may be the news didn’t cover that they also added or replaced the removed chapters with other rulers of Indian history.",
        "What are they going to replace it with?\n\nJourney of Savarkar from petition to pension?",
        "With that i think Chapter on Razakars and conditions of Hyderabad princely state after independence will be great",
        "&#x200B;\n\n> **2022:** Atal Bihari Vajpayee’s statements against communal violence in Gujarat dropped, chronology of Godhra violence cut out, quotes by Nehru, Ambedkar dropped, history of Naxalite movements cut short... Discussion on history of caste oppression, justifications of caste in Vedas, dangers of communal politics cut short. \n\nThis has been going on for a long time, a proper timeline is given here:\n\n[https://www.outlookindia.com/national/ncert-through-the-years-how-syllabus-changed-along-with-governments-news-204112](https://www.outlookindia.com/national/ncert-through-the-years-how-syllabus-changed-along-with-governments-news-204112)",
        "But why ;they are part of history of this nation ? If you want you can also include the injustice done by them in the syllabus but removing them just doesn't make sense at all",
        "🤣🤣🤣",
        "It is not just history, they have omitted many important topics like diversity, eq. of motions etc\n\nNCERT has truly gone full nuts",
        "Anyway today's policy is similar to Mughals \nThey don't want kids to compare our government with Aurangzeb",
        "Naya Bharat 😟",
        "Savarkar is going to be described as the true father of the nation while the others schemed against the country. Watch our Mahatma Gandhi’s face slowly get replaced on currency notes after next May (if they get re-elected). I’m expecting at least two of [Patel, Savarkar, Hegdewar] to appear on notes while one or two more on coins.",
        "This country is gonna become inhospitable for sane people in the next few years if these descendants of British BootLickers are allowed to remain in power any longer.",
        "Now how are they going to bark about 1000 years of slavery?",
        "Journey of sarvarkar starts from looking at British people's shoes",
        "That's so dumb. CBSE has lost it. The Mughals ruled India for 300 years. You can't just remove them. How will they explain medeaval India now. Do 300 years of Indian history just didn't existed?\n\nWho did Shivaji Maharaj fight if Mughals never existed? Who killed the Sikh gurus if Mughals never existed. Our future kids won't even know that Mughals tyrannical rule was a thing. It's really sad to see.",
        "Never go full Hindutva",
        "Don’t worry, those aren’t being taught either",
        "Yeah, eliminate the Mughals. That's what's really wrong with the history of India. FML, these idiots do make feeling even an ounce of national identity or pride impossible as each day goes on. Without the Mughals, there's no India. Period.\n\nThe north Indian identity is built around the Mughals. There's nothing about the north Indian identity today that hasn't been influenced directly or indirectly by the stability and effluence provided by the Mughal regime, especially in the 16th and 17th centuries. The languages, the cuisine, the architecture, the economic centres, the arts, the costumes etc are all significantly impacted by the Mughal court and its influence on regional courts and cultures through the remarkable unification and centralised integration. No Mughals, no Delhi and Agra as central towns, no Bengal as the pre-eminent pre-industrialised subah that propelled the subcontinent to being the biggest producer and trader in the world economy, no strong centralisation that gave rise to the economic and pan-Indian conditions for linguistic, artistic, culinary and architectural efflorescence, and the colonisation by the Europeans would have been pushed back into the 1600s instead of the 1800s. The Mughals were only the second dynasty in the long 5000 years of the subcontinent to unify and hold more than half of it under a stable and thriving government lasting longer than a lifetime, so if there is an idea of a unified India or a cultural connection between the varied and individual peoples of the subcontinent, then the Mughals played a not insignificant role in it.",
        "Who defeated Ibrahim Lodi and caused the fall of Delhi Sultanate? \"Idk the British probably?\" - 12th standard students.",
        "Tbf by your silly logic only the Dravidians are the true inhabitants of India. The rest of you lot are descendants of invaders.",
        "Phir maharan Pratap fought who, British defeated whom in 1857, wh built lal qila",
        "They should teach history of the state instead of teaching who ruled Pakistan. NCERT books pretty much ignore South and North East India",
        "Oh, the damage is already done. Whether they are in power or not, the decay is going to continue. \n\nI’m sorry to be so pessimistic, but I’ll tell you the reasons for my opinion. Right now, bjp has polarized the country well enough touching key sentiments like religion. Regardless of our liking, people have been hypnotized. If they are voted out of power, people will have a soft spot in their minds. Anti-incumbency will help them regain power in 5+ years. They’ll then continue the work of social destruction. If they come to power next May, the pause won’t be there and their work will continue. Unless people suffer to an extent that they hate any mention of bjp to their core, their divisive work will keep reaping the benefits. So the society itself needs a complete overhaul and rebuild from hubris. Small fixes are just patchwork that can’t hold for long.\n\nAt least for the freedom struggle, there was a common enemy that the people united against. Now, that’s not the case. It’s harder fighting the stupid people than having an ideological fight with bjp. The gullible people are their meat shield and they aren’t insignificant in numbers. We can’t enforce critical thinking until people take a step back and realize that something is off with the current path. People have to initiate the change from within themselves. \n\nIt is possible that my view on the alternate path next year (electing a non-bjp govt) isn’t considering other positives and we may get better results than what I’m fearing. Let’s see what’s in store for us.",
        "Indians will go from dumb to dumber. BJP vote share will increase.",
        "What really happened is less important than fictional story...",
        "Big bang happened in 2014 😂. Mudi ji caused it. Mudi ji is god.",
        "I don't know that with the old syllabus lol. But I'd guess Babur?",
        "They were fighting asuras from pathaal. Be happy they are not teaching ramayan and mahabharat as history for now, but can expect in near future if they win the 2024 election again. 🥴",
        "This is hindu Pakistanisation of India. If you look at Pakistan' s history whatever we are doing now they have done it in the past and has resulted in them being in a pile of shit and one of the most isolated countries in the world. It doesn't take more than a few years to change economic progress to stop its course. And  the worst part is a large portion of our country is so brainwashed and backward that they consider modern enlightenment values bad and want to go back to some mythical  past. If this goes on 30-40 years down the line we will be making podcasts on YouTube and cry about how it all went wrong like our neighbours are doing right now.",
        "Partially correct. Babur paved the way for Mughal Empire by winning Panipat. The final nail in the coffin of Delhi Sultanate was put by Akbar.",
        "First they marginalize history and then share fake history on Whatsapp.",
        "Moodi ji obviously",
        "Be careful ..you might get 2 years sentence of jail 🤣",
        "Well don't take my knowledge for benchmark tho I was never much interested in History/Civics/SST",
        "😑\n\nMatlab ki... bass leni deni karni haaa",
        "Why stop there? Change the name of Ahmedabad to something hindu-ish",
        "Mughals are not just a part of Indian history. Mughals ARE the Indian history.",
        "They even removed topics about Democracy:\n\n> Chapters on 'Democracy and diversity', 'Popular struggles and movement', and 'Challenges to democracy' have been dropped from the Class 10 'Democratic Politics-II' textbook.",
        "In this age of 4g , youtube and others . Really doesn't matter . India has too much diversity to have one view point dominate others",
        "“Every record has been destroyed or falsified, every book rewritten, every picture has been repainted, every statue and street building has been renamed, every date has been altered. And the process is continuing day by day and minute by minute. History has stopped. Nothing exists except an endless present in which the Party is always right.”\n\nGeorge Orwell, 1984",
        "Why do we underestimate our kids. Only way not to make mistakes of the past is to know about the past.",
        "The year is 2028, a class 9 student goes on a school trip around Delhi. After seeing red fort, qutub minar, safdarjung tomb, Humayun's tomb, isa Khan's tomb & lodhi garden tombs he asks who built these monuments, and is immediately sent to jail under UAPA for being an anti-national element.",
        "Our history is so beautiful. Please don’t destroy it.",
        "Wtf? Why Equations of Motions??",
        "Invisible history of rajputs being great warriors",
        "Amdavad is how the locals pronounce it and some people even suggest changing the official spelling to that",
        "I move to Canada last decade, got my parents here, and slowly getting siblings here too.\n\nGood fucking riddance.",
        "The funny thing being Pakistan once more liberal and a darling of the west with a high ppp and gdp numbers than India before liberalization. India moving fast there.",
        "wow, they are ruining youth's education too. fuck, we are truly in the endgame",
        "Only the good guys ever win in History books. \n\nSeems fishy.",
        "Actually majority of people wanted mughal chapter to be removed for long time. Whoever disagree is in minority so we don't have much say in the matter. Most of folks are praising this",
        "I wonder who build the Taj Mahal???",
        "ab equation of motions se unko kya problem hai?",
        "If they have to remove chapters on Mughal Rulers, then its clear indication of hate.\n\nThen probably they should make all those monuments free, why collect any fees? Lodhi garden has like ₹40 for entry, and ₹100 rupee fine if you lose the that RFID coin, foreign traveler pay like ₹300. They earn bucket load on Taj Mahal and then call it Tejmohlay or whatever shit.\n\nYou can say that my rant is unrelated but hey these degenerates cant see their hypocrisy.",
        "Mythology is pretty soon going to be history. Thats coming. Damage of the last decade will take another decade or more to undo.",
        "No one, not even hardcore bhakths think Savarkar is father of nation. That is the title they give to Subhash Chandra Bose. And i agree.",
        "Canada is becoming a bigger shithole than India pal. I give it 10-15 years, before Trudeau and his party will turn Canada to an authoritarian utopian state. Look at all the recent bills passed by the canadian government.\n\nAll i say is good luck.",
        "Ok that was another extreme and this is another one. Both are horrible.\n\nWho defeated the Mughals? Many CBSE students think that was British, when in reality Marathas beat them. So i feel this is over correction from distorted history taught to us.\n\nI dont agree with removing them. But they could have added all the other history they want to teach, and reduced Mughal chapters.",
        "You think Mughals were defeated by British in 1857?",
        "Those who control the present, control the past.",
        "Pakistan?!",
        "I don't understand how they will explain 250+ years of history without the Mughals, whether they hate it or not it's an important part of our history.\n\nAlso, which excuse will they give to demolish mosques to make temples if there were no muslim rulers to demolish the \"previously\" temples.",
        "Maybe, 250 years of rule and leaving behind amazing architecture wasn't enough to be mentioned in history",
        "How are they going to explain Ram mandir?",
        "History doesn't change based on what people wish.",
        "Hey you anti national, it's not Taj Mahal it's Tajo mahalaya and it was built by mudi ze",
        "No no you got me wrong . What I meant was on YouTube and other social media everyone praising this but they don't see the bad effect it will have in future . \n\nBut it's too late now",
        "He meant the indus Valley civilization area.  That modern Pakistan area was common to all the northern Dynasties that we were taught in schools",
        "Taj Mahal's name to be changed.\n\nNow it will be called Modi mandir.",
        "It will still be better than Amrit Kaal Hindustan I guess. Although rn I feel the best country to migrate to will be Australia. Two of my nephews have already settled down here and they seem happy.",
        "Exactly what I feel. I feel if Congress had fought harder in 2019 they might have won back power and this whole restructuring of India's ethos, it's founding principles wouldn't have been trampled so badly. If you look back you would realise BJPee wasn't acting so aggressively during it's first term. It's only when they came back with a bigger majority in 2019 that they became emboldened to aggressively pursue their Agenda. Destruction of J&K, RAM mandir, Triple Talaq... All these were smokescreen to pursue their actual Heist.. That of selling India piece by piece to their Corporate Masters, While the majority including my own near and dear ones were jerking off to the pain of the minorities and other backward groups. Even the Lockdown disaster, Demo, GST hasn't opened the eyes of my fellow citizens. I don't know what will.",
        "100% agree with this. In fact, people have been calling it out since 2018. It just fell on deaf ears. I’m crying out the exact same thing you are saying. What on this planet will wake them up? What’s so irritating is that I see well educated people doing this.\n\nEdit: /s Did we melt our brains with covid vaccines? SMH!",
        "Australia is better than Canada for sure.",
        "Nah.. I have taken all the 3 doses of covaxin and my brain is stil functioning alright.",
        "I should have added /s.",
        "Not needed. I knew you we're being sarcastic.",
        "😅 we can’t be too careful these days as it’s hard to differentiate if someone is sarcastic or being serious. We have been in such a state for a while.",
        "If we remove mughals and brit from history coz govt dont like it then what will left of history lol",
        "It will be fun to see how they describe the origin of the Taj Mahal.\n\n\"During the 16th century, a white marble structure suddenly appeared in Agra. Nobody knows who built it.\"",
        "Off Topic.. Thoda basic finance bhi include kardho.. please.. financially most of us are never ever aware of how to deal with it until reality hits us..",
        "Oh I remember some discussion on this thought it was all a joke. Something about how ancient India had discovered them first. I hope this is not the real reason.",
        "![gif](giphy|3oEjI789af0AVurF60)",
        "Nuts.",
        "Maybe initially, but it's the East India Company that eventually killed the Mughal Empire. their last king (Jafar) in Delhi.",
        "Well, dumbness might be overcompensated by overconfidence.",
        "But how do we remove 1000 years of history?",
        "If they hate mughals so much, why are mughal and british allies aka marwaris loved so much?",
        "marwaris funding British to take over the country replacing ghost rule..",
        "Indus valley was special and had no kings. Moreover they probably migrated south to become Dravidians",
        "You got it wrong man. Marathas completely destroyed the Mughal empire not initially. Marathas had conquered land till afghanistan. British only started to take over because of infighting in Marathas.\n\nThis is what i was talking about, the history was distorted to gain muslim votes.\n\nLet us say it what it is. Now BJP distorted it to gain Hindu votes.\n\nThe politicians have put their claws in our education as well.",
        "New 2024 history textbook: And then Modi ji said \"let there be cows\""
    ],
    "cleaned_text": "ncert removes chapters mughals textbooks watch know  ",
    "cleaned_title": "ncert removes chapters mughals textbooks watch know",
    "cleaned_selftext": "",
    "cleaned_comments": "history one fav subject school especially medieval period always thought need chapters rulersnow removing ones already may news didnt cover also added replaced removed chapters rulers indian history going replace journey savarkar petition pension think chapter razakars conditions hyderabad princely state independence great xb atal bihari vajpayees statements communal violence gujarat dropped chronology godhra violence cut quotes nehru ambedkar dropped history naxalite movements cut short discussion history caste oppression justifications caste vedas dangers communal politics cut short going long time proper timeline given httpswwwoutlookindiacomnationalncertthroughtheyearshowsyllabuschangedalongwithgovernmentsnewshttpswwwoutlookindiacomnationalncertthroughtheyearshowsyllabuschangedalongwithgovernmentsnews part history nation want also include injustice done syllabus removing doesnt make sense history omitted many important topics like diversity eq motions etc ncert truly gone full nuts anyway todays policy similar mughals dont want kids compare government aurangzeb naya bharat savarkar going described true father nation others schemed country watch mahatma gandhis face slowly get replaced currency notes next may get reelected im expecting least two patel savarkar hegdewar appear notes one two coins country gon na become inhospitable sane people next years descendants british bootlickers allowed remain power longer going bark years slavery journey sarvarkar starts looking british peoples shoes thats dumb cbse lost mughals ruled india years cant remove explain medeaval india years indian history didnt existed shivaji maharaj fight mughals never existed killed sikh gurus mughals never existed future kids wont even know mughals tyrannical rule thing really sad see never go full hindutva dont worry arent taught either yeah eliminate mughals thats whats really wrong history india fml idiots make feeling even ounce national identity pride impossible day goes without mughals theres india period north indian identity built around mughals theres nothing north indian identity today hasnt influenced directly indirectly stability effluence provided mughal regime especially th th centuries languages cuisine architecture economic centres arts costumes etc significantly impacted mughal court influence regional courts cultures remarkable unification centralised integration mughals delhi agra central towns bengal preeminent preindustrialised subah propelled subcontinent biggest producer trader world economy strong centralisation gave rise economic panindian conditions linguistic artistic culinary architectural efflorescence colonisation europeans would pushed back instead mughals second dynasty long years subcontinent unify hold half stable thriving government lasting longer lifetime idea unified india cultural connection varied individual peoples subcontinent mughals played insignificant role defeated ibrahim lodi caused fall delhi sultanate idk british probably th standard students tbf silly logic dravidians true inhabitants india rest lot descendants invaders phir maharan pratap fought british defeated wh built lal qila teach history state instead teaching ruled pakistan ncert books pretty much ignore south north east india oh damage already done whether power decay going continue im sorry pessimistic ill tell reasons opinion right bjp polarized country well enough touching key sentiments like religion regardless liking people hypnotized voted power people soft spot minds antiincumbency help regain power years theyll continue work social destruction come power next may pause wont work continue unless people suffer extent hate mention bjp core divisive work keep reaping benefits society needs complete overhaul rebuild hubris small fixes patchwork cant hold long least freedom struggle common enemy people united thats case harder fighting stupid people ideological fight bjp gullible people meat shield arent insignificant numbers cant enforce critical thinking people take step back realize something current path people initiate change within possible view alternate path next year electing nonbjp govt isnt considering positives may get better results im fearing lets see whats store us indians go dumb dumber bjp vote share increase really happened less important fictional story big bang happened mudi ji caused mudi ji god dont know old syllabus lol id guess babur fighting asuras pathaal happy teaching ramayan mahabharat history expect near future win election hindu pakistanisation india look pakistan history whatever done past resulted pile shit one isolated countries world doesnt take years change economic progress stop course worst part large portion country brainwashed backward consider modern enlightenment values bad want go back mythical past goes years line making podcasts youtube cry went wrong like neighbours right partially correct babur paved way mughal empire winning panipat final nail coffin delhi sultanate put akbar first marginalize history share fake history whatsapp moodi ji obviously careful might get years sentence jail well dont take knowledge benchmark tho never much interested historycivicssst matlab ki bass leni deni karni haaa stop change name ahmedabad something hinduish mughals part indian history mughals indian history even removed topics democracy chapters democracy diversity popular struggles movement challenges democracy dropped class democratic politicsii textbook age g youtube others really doesnt matter india much diversity one view point dominate others every record destroyed falsified every book rewritten every picture repainted every statue street building renamed every date altered process continuing day day minute minute history stopped nothing exists except endless present party always right george orwell underestimate kids way make mistakes past know past year class student goes school trip around delhi seeing red fort qutub minar safdarjung tomb humayuns tomb isa khans tomb lodhi garden tombs asks built monuments immediately sent jail uapa antinational element history beautiful please dont destroy wtf equations motions invisible history rajputs great warriors amdavad locals pronounce people even suggest changing official spelling move canada last decade got parents slowly getting siblings good fucking riddance funny thing pakistan liberal darling west high ppp gdp numbers india liberalization india moving fast wow ruining youths education fuck truly endgame good guys ever win history books seems fishy actually majority people wanted mughal chapter removed long time whoever disagree minority dont much say matter folks praising wonder build taj mahal ab equation motions se unko kya problem hai remove chapters mughal rulers clear indication hate probably make monuments free collect fees lodhi garden like entry rupee fine lose rfid coin foreign traveler pay like earn bucket load taj mahal call tejmohlay whatever shit say rant unrelated hey degenerates cant see hypocrisy mythology pretty soon going history thats coming damage last decade take another decade undo one even hardcore bhakths think savarkar father nation title give subhash chandra bose agree canada becoming bigger shithole india pal give years trudeau party turn canada authoritarian utopian state look recent bills passed canadian government say good luck ok another extreme another one horrible defeated mughals many cbse students think british reality marathas beat feel correction distorted history taught us dont agree removing could added history want teach reduced mughal chapters think mughals defeated british control present control past pakistan dont understand explain years history without mughals whether hate important part history also excuse give demolish mosques make temples muslim rulers demolish previously temples maybe years rule leaving behind amazing architecture wasnt enough mentioned history going explain ram mandir history doesnt change based people wish hey anti national taj mahal tajo mahalaya built mudi ze got wrong meant youtube social media everyone praising dont see bad effect future late meant indus valley civilization area modern pakistan area common northern dynasties taught schools taj mahals name changed called modi mandir still better amrit kaal hindustan guess although rn feel best country migrate australia two nephews already settled seem happy exactly feel feel congress fought harder might back power whole restructuring indias ethos founding principles wouldnt trampled badly look back would realise bjpee wasnt acting aggressively first term came back bigger majority became emboldened aggressively pursue agenda destruction jk ram mandir triple talaq smokescreen pursue actual heist selling india piece piece corporate masters majority including near dear ones jerking pain minorities backward groups even lockdown disaster demo gst hasnt opened eyes fellow citizens dont know agree fact people calling since fell deaf ears im crying exact thing saying planet wake whats irritating see well educated people edit melt brains covid vaccines smh australia better canada sure nah taken doses covaxin brain stil functioning alright added needed knew sarcastic cant careful days hard differentiate someone sarcastic serious state remove mughals brit history coz govt dont like left history lol fun see describe origin taj mahal th century white marble structure suddenly appeared agra nobody knows built topic thoda basic finance bhi include kardho please financially us never ever aware deal reality hits us oh remember discussion thought joke something ancient india discovered first hope real reason gifgiphyoejiafavurf nuts maybe initially east india company eventually killed mughal empire last king jafar delhi well dumbness might overcompensated overconfidence remove years history hate mughals much mughal british allies aka marwaris loved much marwaris funding british take country replacing ghost rule indus valley special kings moreover probably migrated south become dravidians got wrong man marathas completely destroyed mughal empire initially marathas conquered land till afghanistan british started take infighting marathas talking history distorted gain muslim votes let us say bjp distorted gain hindu votes politicians put claws education well new history textbook modi ji said let cows",
    "light_cleaned_title": "NCERT removes chapters on Mughals from their textbooks, watch to know more",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "History was one of my fav subject when I was in school, especially the medieval period. Always thought I need more chapters about rulers.Now they are removing the ones that are already in it, may be the news didn’t cover that they also added or replaced the removed chapters with other rulers of Indian history. What are they going to replace it with? Journey of Savarkar from petition to pension? With that i think Chapter on Razakars and conditions of Hyderabad princely state after independence will be great &#x200B; > **2022:** Atal Bihari Vajpayee’s statements against communal violence in Gujarat dropped, chronology of Godhra violence cut out, quotes by Nehru, Ambedkar dropped, history of Naxalite movements cut short... Discussion on history of caste oppression, justifications of caste in Vedas, dangers of communal politics cut short. This has been going on for a long time, a proper timeline is given here: [https://www.outlookindia.com/national/ncert-through-the-years-how-syllabus-changed-along-with-governments-news-204112](https://www.outlookindia.com/national/ncert-through-the-years-how-syllabus-changed-along-with-governments-news-204112) But why ;they are part of history of this nation ? If you want you can also include the injustice done by them in the syllabus but removing them just doesn't make sense at all 🤣🤣🤣 It is not just history, they have omitted many important topics like diversity, eq. of motions etc NCERT has truly gone full nuts Anyway today's policy is similar to Mughals They don't want kids to compare our government with Aurangzeb Naya Bharat 😟 Savarkar is going to be described as the true father of the nation while the others schemed against the country. Watch our Mahatma Gandhi’s face slowly get replaced on currency notes after next May (if they get re-elected). I’m expecting at least two of [Patel, Savarkar, Hegdewar] to appear on notes while one or two more on coins. This country is gonna become inhospitable for sane people in the next few years if these descendants of British BootLickers are allowed to remain in power any longer. Now how are they going to bark about 1000 years of slavery? Journey of sarvarkar starts from looking at British people's shoes That's so dumb. CBSE has lost it. The Mughals ruled India for 300 years. You can't just remove them. How will they explain medeaval India now. Do 300 years of Indian history just didn't existed? Who did Shivaji Maharaj fight if Mughals never existed? Who killed the Sikh gurus if Mughals never existed. Our future kids won't even know that Mughals tyrannical rule was a thing. It's really sad to see. Never go full Hindutva Don’t worry, those aren’t being taught either Yeah, eliminate the Mughals. That's what's really wrong with the history of India. FML, these idiots do make feeling even an ounce of national identity or pride impossible as each day goes on. Without the Mughals, there's no India. Period. The north Indian identity is built around the Mughals. There's nothing about the north Indian identity today that hasn't been influenced directly or indirectly by the stability and effluence provided by the Mughal regime, especially in the 16th and 17th centuries. The languages, the cuisine, the architecture, the economic centres, the arts, the costumes etc are all significantly impacted by the Mughal court and its influence on regional courts and cultures through the remarkable unification and centralised integration. No Mughals, no Delhi and Agra as central towns, no Bengal as the pre-eminent pre-industrialised subah that propelled the subcontinent to being the biggest producer and trader in the world economy, no strong centralisation that gave rise to the economic and pan-Indian conditions for linguistic, artistic, culinary and architectural efflorescence, and the colonisation by the Europeans would have been pushed back into the 1600s instead of the 1800s. The Mughals were only the second dynasty in the long 5000 years of the subcontinent to unify and hold more than half of it under a stable and thriving government lasting longer than a lifetime, so if there is an idea of a unified India or a cultural connection between the varied and individual peoples of the subcontinent, then the Mughals played a not insignificant role in it. Who defeated Ibrahim Lodi and caused the fall of Delhi Sultanate? \"Idk the British probably?\" - 12th standard students. Tbf by your silly logic only the Dravidians are the true inhabitants of India. The rest of you lot are descendants of invaders. Phir maharan Pratap fought who, British defeated whom in 1857, wh built lal qila They should teach history of the state instead of teaching who ruled Pakistan. NCERT books pretty much ignore South and North East India Oh, the damage is already done. Whether they are in power or not, the decay is going to continue. I’m sorry to be so pessimistic, but I’ll tell you the reasons for my opinion. Right now, bjp has polarized the country well enough touching key sentiments like religion. Regardless of our liking, people have been hypnotized. If they are voted out of power, people will have a soft spot in their minds. Anti-incumbency will help them regain power in 5+ years. They’ll then continue the work of social destruction. If they come to power next May, the pause won’t be there and their work will continue. Unless people suffer to an extent that they hate any mention of bjp to their core, their divisive work will keep reaping the benefits. So the society itself needs a complete overhaul and rebuild from hubris. Small fixes are just patchwork that can’t hold for long. At least for the freedom struggle, there was a common enemy that the people united against. Now, that’s not the case. It’s harder fighting the stupid people than having an ideological fight with bjp. The gullible people are their meat shield and they aren’t insignificant in numbers. We can’t enforce critical thinking until people take a step back and realize that something is off with the current path. People have to initiate the change from within themselves. It is possible that my view on the alternate path next year (electing a non-bjp govt) isn’t considering other positives and we may get better results than what I’m fearing. Let’s see what’s in store for us. Indians will go from dumb to dumber. BJP vote share will increase. What really happened is less important than fictional story... Big bang happened in 2014 😂. Mudi ji caused it. Mudi ji is god. I don't know that with the old syllabus lol. But I'd guess Babur? They were fighting asuras from pathaal. Be happy they are not teaching ramayan and mahabharat as history for now, but can expect in near future if they win the 2024 election again. 🥴 This is hindu Pakistanisation of India. If you look at Pakistan' s history whatever we are doing now they have done it in the past and has resulted in them being in a pile of shit and one of the most isolated countries in the world. It doesn't take more than a few years to change economic progress to stop its course. And the worst part is a large portion of our country is so brainwashed and backward that they consider modern enlightenment values bad and want to go back to some mythical past. If this goes on 30-40 years down the line we will be making podcasts on YouTube and cry about how it all went wrong like our neighbours are doing right now. Partially correct. Babur paved the way for Mughal Empire by winning Panipat. The final nail in the coffin of Delhi Sultanate was put by Akbar. First they marginalize history and then share fake history on Whatsapp. Moodi ji obviously Be careful ..you might get 2 years sentence of jail 🤣 Well don't take my knowledge for benchmark tho I was never much interested in History/Civics/SST 😑 Matlab ki... bass leni deni karni haaa Why stop there? Change the name of Ahmedabad to something hindu-ish Mughals are not just a part of Indian history. Mughals ARE the Indian history. They even removed topics about Democracy: > Chapters on 'Democracy and diversity', 'Popular struggles and movement', and 'Challenges to democracy' have been dropped from the Class 10 'Democratic Politics-II' textbook. In this age of 4g , youtube and others . Really doesn't matter . India has too much diversity to have one view point dominate others “Every record has been destroyed or falsified, every book rewritten, every picture has been repainted, every statue and street building has been renamed, every date has been altered. And the process is continuing day by day and minute by minute. History has stopped. Nothing exists except an endless present in which the Party is always right.” George Orwell, 1984 Why do we underestimate our kids. Only way not to make mistakes of the past is to know about the past. The year is 2028, a class 9 student goes on a school trip around Delhi. After seeing red fort, qutub minar, safdarjung tomb, Humayun's tomb, isa Khan's tomb & lodhi garden tombs he asks who built these monuments, and is immediately sent to jail under UAPA for being an anti-national element. Our history is so beautiful. Please don’t destroy it. Wtf? Why Equations of Motions?? Invisible history of rajputs being great warriors Amdavad is how the locals pronounce it and some people even suggest changing the official spelling to that I move to Canada last decade, got my parents here, and slowly getting siblings here too. Good fucking riddance. The funny thing being Pakistan once more liberal and a darling of the west with a high ppp and gdp numbers than India before liberalization. India moving fast there. wow, they are ruining youth's education too. fuck, we are truly in the endgame Only the good guys ever win in History books. Seems fishy. Actually majority of people wanted mughal chapter to be removed for long time. Whoever disagree is in minority so we don't have much say in the matter. Most of folks are praising this I wonder who build the Taj Mahal??? ab equation of motions se unko kya problem hai? If they have to remove chapters on Mughal Rulers, then its clear indication of hate. Then probably they should make all those monuments free, why collect any fees? Lodhi garden has like ₹40 for entry, and ₹100 rupee fine if you lose the that RFID coin, foreign traveler pay like ₹300. They earn bucket load on Taj Mahal and then call it Tejmohlay or whatever shit. You can say that my rant is unrelated but hey these degenerates cant see their hypocrisy. Mythology is pretty soon going to be history. Thats coming. Damage of the last decade will take another decade or more to undo. No one, not even hardcore bhakths think Savarkar is father of nation. That is the title they give to Subhash Chandra Bose. And i agree. Canada is becoming a bigger shithole than India pal. I give it 10-15 years, before Trudeau and his party will turn Canada to an authoritarian utopian state. Look at all the recent bills passed by the canadian government. All i say is good luck. Ok that was another extreme and this is another one. Both are horrible. Who defeated the Mughals? Many CBSE students think that was British, when in reality Marathas beat them. So i feel this is over correction from distorted history taught to us. I dont agree with removing them. But they could have added all the other history they want to teach, and reduced Mughal chapters. You think Mughals were defeated by British in 1857? Those who control the present, control the past. Pakistan?! I don't understand how they will explain 250+ years of history without the Mughals, whether they hate it or not it's an important part of our history. Also, which excuse will they give to demolish mosques to make temples if there were no muslim rulers to demolish the \"previously\" temples. Maybe, 250 years of rule and leaving behind amazing architecture wasn't enough to be mentioned in history How are they going to explain Ram mandir? History doesn't change based on what people wish. Hey you anti national, it's not Taj Mahal it's Tajo mahalaya and it was built by mudi ze No no you got me wrong . What I meant was on YouTube and other social media everyone praising this but they don't see the bad effect it will have in future . But it's too late now He meant the indus Valley civilization area. That modern Pakistan area was common to all the northern Dynasties that we were taught in schools Taj Mahal's name to be changed. Now it will be called Modi mandir. It will still be better than Amrit Kaal Hindustan I guess. Although rn I feel the best country to migrate to will be Australia. Two of my nephews have already settled down here and they seem happy. Exactly what I feel. I feel if Congress had fought harder in 2019 they might have won back power and this whole restructuring of India's ethos, it's founding principles wouldn't have been trampled so badly. If you look back you would realise BJPee wasn't acting so aggressively during it's first term. It's only when they came back with a bigger majority in 2019 that they became emboldened to aggressively pursue their Agenda. Destruction of J&K, RAM mandir, Triple Talaq... All these were smokescreen to pursue their actual Heist.. That of selling India piece by piece to their Corporate Masters, While the majority including my own near and dear ones were jerking off to the pain of the minorities and other backward groups. Even the Lockdown disaster, Demo, GST hasn't opened the eyes of my fellow citizens. I don't know what will. 100% agree with this. In fact, people have been calling it out since 2018. It just fell on deaf ears. I’m crying out the exact same thing you are saying. What on this planet will wake them up? What’s so irritating is that I see well educated people doing this. Edit: /s Did we melt our brains with covid vaccines? SMH! Australia is better than Canada for sure. Nah.. I have taken all the 3 doses of covaxin and my brain is stil functioning alright. I should have added /s. Not needed. I knew you we're being sarcastic. 😅 we can’t be too careful these days as it’s hard to differentiate if someone is sarcastic or being serious. We have been in such a state for a while. If we remove mughals and brit from history coz govt dont like it then what will left of history lol It will be fun to see how they describe the origin of the Taj Mahal. \"During the 16th century, a white marble structure suddenly appeared in Agra. Nobody knows who built it.\" Off Topic.. Thoda basic finance bhi include kardho.. please.. financially most of us are never ever aware of how to deal with it until reality hits us.. Oh I remember some discussion on this thought it was all a joke. Something about how ancient India had discovered them first. I hope this is not the real reason. ![gif](giphy|3oEjI789af0AVurF60) Nuts. Maybe initially, but it's the East India Company that eventually killed the Mughal Empire. their last king (Jafar) in Delhi. Well, dumbness might be overcompensated by overconfidence. But how do we remove 1000 years of history? If they hate mughals so much, why are mughal and british allies aka marwaris loved so much? marwaris funding British to take over the country replacing ghost rule.. Indus valley was special and had no kings. Moreover they probably migrated south to become Dravidians You got it wrong man. Marathas completely destroyed the Mughal empire not initially. Marathas had conquered land till afghanistan. British only started to take over because of infighting in Marathas. This is what i was talking about, the history was distorted to gain muslim votes. Let us say it what it is. Now BJP distorted it to gain Hindu votes. The politicians have put their claws in our education as well. New 2024 history textbook: And then Modi ji said \"let there be cows\""
}