{
    "id": "180ch8m",
    "title": "Interesting interview: how Jinnah's lack of vision and ability to think deep led Pakistan to its current state of confusion, highly recommend",
    "url": "https://www.reddit.com/r/india/comments/180ch8m/interesting_interview_how_jinnahs_lack_of_vision/",
    "selftext": "[Jinnah wasn't a visionary or deep thinker. Which is why Pakistan has 'wallowed in confusion](https://www.youtube.com/watch?v=MS5LfDw3JT4&t=2s)\n\nSome of the points he shares in the interview make a lot of sense and re-emphasizes how India benefitted by having not just Nehru, Gandhi, Patel, Ambedkar but many other able leaders at the start who ensured that we focus on building solid institutions and stay away from religious sectarianism. This also makes a strong case of how *maybe* Nehru leveraged right leaders/experts/govt. officials to make key decisions rather than conclude thigs on his sole worldview.\n\nAlso, over the decades we have had the fortune of leaders who added on to what their predecessors achieved - LB Shastry, Indira, Rajiv, Narsimha Rao, AB Vajpayee, MM Singh and Modi and others have established significant things that take the nation forward. This was possible because of strong institution of democracy that gave these leaders, the right time to set changes in motion; on the other hand in Pakistan apparently no PM has been able to complete his/her term in last 76 years.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1700555912.0,
    "convurl": "https://external-preview.redd.it/erosjZHtcjN3NWkdthwfnheMFLYbun7IflSIPmuKbBw.jpg?auto=webp&s=6d5e60007eb516eb9228974ab8bd702ba9ea9982",
    "comments": [
        "Jinnah never thought of the long term. He proposed to create a new country with 2 parts more than 2500km apart, one part in west(Punjab) and another in East(Bengal) but did not say how they will be administered. He wanted a Islamic nation on the basis of Muslim majority in those regions which is stupid because by that logic, all European countries will be Christian, India will be Hindu, etc."
    ],
    "cleaned_text": "interesting interview jinnahs lack vision ability think deep led pakistan current state confusion highly recommend jinnah wasnt visionary deep thinker pakistan wallowed confusionhttpswwwyoutubecomwatchvmslfdwjtts points shares interview make lot sense reemphasizes india benefitted nehru gandhi patel ambedkar many able leaders start ensured focus building solid institutions stay away religious sectarianism also makes strong case maybe nehru leveraged right leadersexpertsgovt officials make key decisions rather conclude thigs sole worldview also decades fortune leaders added predecessors achieved lb shastry indira rajiv narsimha rao ab vajpayee mm singh modi others established significant things take nation forward possible strong institution democracy gave leaders right time set changes motion hand pakistan apparently pm able complete hisher term last years ",
    "cleaned_title": "interesting interview jinnahs lack vision ability think deep led pakistan current state confusion highly recommend",
    "cleaned_selftext": "jinnah wasnt visionary deep thinker pakistan wallowed confusionhttpswwwyoutubecomwatchvmslfdwjtts points shares interview make lot sense reemphasizes india benefitted nehru gandhi patel ambedkar many able leaders start ensured focus building solid institutions stay away religious sectarianism also makes strong case maybe nehru leveraged right leadersexpertsgovt officials make key decisions rather conclude thigs sole worldview also decades fortune leaders added predecessors achieved lb shastry indira rajiv narsimha rao ab vajpayee mm singh modi others established significant things take nation forward possible strong institution democracy gave leaders right time set changes motion hand pakistan apparently pm able complete hisher term last years",
    "cleaned_comments": "jinnah never thought long term proposed create new country parts km apart one part westpunjab another eastbengal say administered wanted islamic nation basis muslim majority regions stupid logic european countries christian india hindu etc",
    "light_cleaned_title": "Interesting interview: how Jinnah's lack of vision and ability to think deep led Pakistan to its current state of confusion, highly recommend",
    "light_cleaned_selftext": "[Jinnah wasn't a visionary or deep thinker. Which is why Pakistan has 'wallowed in confusion](https://www.youtube.com/watch?v=MS5LfDw3JT4&t=2s) Some of the points he shares in the interview make a lot of sense and re-emphasizes how India benefitted by having not just Nehru, Gandhi, Patel, Ambedkar but many other able leaders at the start who ensured that we focus on building solid institutions and stay away from religious sectarianism. This also makes a strong case of how *maybe* Nehru leveraged right leaders/experts/govt. officials to make key decisions rather than conclude thigs on his sole worldview. Also, over the decades we have had the fortune of leaders who added on to what their predecessors achieved - LB Shastry, Indira, Rajiv, Narsimha Rao, AB Vajpayee, MM Singh and Modi and others have established significant things that take the nation forward. This was possible because of strong institution of democracy that gave these leaders, the right time to set changes in motion; on the other hand in Pakistan apparently no PM has been able to complete his/her term in last 76 years.",
    "light_cleaned_comments": "Jinnah never thought of the long term. He proposed to create a new country with 2 parts more than 2500km apart, one part in west(Punjab) and another in East(Bengal) but did not say how they will be administered. He wanted a Islamic nation on the basis of Muslim majority in those regions which is stupid because by that logic, all European countries will be Christian, India will be Hindu, etc."
}