{
    "id": "173hll8",
    "title": "What exactly is communism in the context of India?",
    "url": "https://www.reddit.com/r/india/comments/173hll8/what_exactly_is_communism_in_the_context_of_india/",
    "selftext": "The recent successful WGA strikes in the US and the railway strikes in the UK really surprised me. I didn't know unions could have so much power in such textbook capitalist countries.   \nIndia too has many states where there is a communist government but you seldom hear about such unions or strikes.\n\nI found that the Global Rights Index has given a rating of 5 (No guarantee of rights) for trade unions in India ([source](https://en.wikipedia.org/wiki/Trade_unions_in_India)) which got me wondering what exactly is the meaning of communism here? Is it not the same as the communism you read about elsewhere like in Cuba? It seems like everyone is extremely polarised about the matter. Pardon my ignorance I am only trying to understand the scenario here and not trying to offend anybody.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696820726.0,
    "convurl": "https://external-preview.redd.it/UoIKK6MCSLgmpS9pdxoECy7GEeWDDoe5FVeU45lEwCY.jpg?auto=webp&s=d5b7d9bf62efba97cae65956745448589d88464d",
    "comments": [
        "These unions are led by some politician or someone will political affiliation in most cases. Indian communist are lapdogs. It started with Soviets pumping money during Indira's time. Their allegiance it to a foreign country, not to India. They're bunch of radical elements disguised as communists.",
        "Just a political party with a fancy brand culture copied from overseas, spearhead by upper caste babus. It was never implemented throughout the subcontinent. \nThere was a reason why Periyar and Ambedkar stayed away from Indian Communist party.",
        "Just Google \"union strike india\" and click on the \"news\" tab. There are strikes called everyday.\n\nBut there are many Unions that are not Communist. They organize and fight for specific things - pay hikes, better health, safety etc. \n\nCommunist would be some group that decides the workers have to run the factory or govt. \n\nThat is an easy story to sell to large groups that are being exploited. But it doesn't work out great in reality, for many reasons. Lack of skill, resources, knowledge, good leaders etc and ofcourse the powers that be, ie exploitative/dominating type of people, don't like handing away their power or diluting it, so they fight to hold on to that power by hook or crook.",
        ">what exactly is the meaning of communism here?\n\nQuestion is what stripe of \"communism\" are you talking about?\n\nIt seems like you are talking about labour rights. Labour rights predate the conception of communism. If you are talking about labour rights, then we are better than few capitalistic nations.\n\n>you seldom hear about such unions or strikes.\n\nIt was common in 1990s and 2000s. In the last decade a strike in Maruti plant in Manesar turned deadly and resulted in the casualties/killing of one or more of management cadre. Strikes rattled the Indian textile industry.  Capitalists found better textile producers in more amenable countries like Bangladesh where the owners could be unperturbed by labour concerns.\n \nAlso, people in India used to lap up the low pay and abysmal work conditions. They were not aware of the cabal of capital holders, nor were they literate enough to understand the social dynamics.\n\nThe present IT/finance/engineering crowd does not face strikes or is not empowered to call for a strike. So such news flow under their radar.",
        "It means communism in India is dead even in Kerala where they are in power.  And thankfully",
        "What do you think a bundh is? There are huge unions and strikes often across India (probably more so in the southern states).",
        "Lmao. There are more strikes in capitalist countries than supposed communist countries. Both china and soviet's banned unions.\n\nImo communist government bundles the power of industry and state. The end result is not dissimilar to corporatism. Separation of powers is in my opinion key for maintaining individual dignity.",
        "The workers in India are exploited to hell and back. But they're good at protesting. The Union sentiments in India are strong.\n\nHowever, though workers' rights are an integral part of communism, that's not all communism is. There is a lot of theory, study, and praxis that goes into understanding and implementing communism. \n\nIf you want to learn about communism in an Indian context, r/IndianLeft might be able to guide you to some good resources. Bhagat Singh's autobiography is also a good starting place.\n\nBut to understand what communism is, start with Marx's Communist manifesto and 'Principles of Communism' by Engels. The manifesto is a pamphlet that will give you some historical context, and the POC is a set of few questions about communism that will clear up any misunderstandings you have.",
        "In the Indian context, Communism never was relevant and never will be relevant. \n\nWe talk about the Naxalites being communists and maoist, but they simply are tribal rebels who were subjected to brutal oppression by the government and decided to rebel. They don't know who Mao is, they don't want communism. They want to live with dignity and respect",
        "I think you will find strikes that actually succeeded in india. I haven't read up on the UK railway strike, but the WGA strike is said to be detrimental for writers, and the demands will make availability of jobs lower.",
        "For any freedom to exist you must have absolute freedom of speech and association. Neither the left or the right in India understands what actually FoS entails. Without FoS we are all eventually just waiting to go oligarchy or Russia route.",
        "Socialism and then communism is a system in which the means of production are owned by the masses. So they get their rightful earnings. In order to actually bring socialism there needs to be class consciousness amongst the masses.\n\nSadly it only exists in the upper class, they know their interests and they will always help out a fellow upper class.\n\nUnfortunately India is divided in many places, class, caste, religion, region etc. There's no unity amongst the poorer sections.\n\nI beleive caste system is the biggest hurdle,  a poor Brahmin has more in common with a poor dalit than a rich Brahmin yet they won't side with their own class. Instead they'll feel superior about made up categories and live a miserable life while also making it bad for others.\n\n\nUnder socialism everyone would get free healthcare, education and housing. That would solve most of the problems in our society. It did for USSR and Cuba. The only problem they face is from external capitalist imperialist nations like USA who always attacks a socialist state. \n\nThey have imposed heavy sanctions on cuba and successfully destroyed the USSR. \n\n\nIn the end of the day, you must realise, our enemies are only the rich exploitative class who won't stop at anything to extract as much value and give back as little as possible.",
        "Recently, electricity workers went on strike despite ESMA being enforced, so I don't see where you are coming from. Other people have already given much better answers than I possibly could on what communism could mean, so I won't touch on that.",
        "Has anything ever been achieved from a bandh? We do a lot of them, but seem to achieve nothing.",
        "Most are useless but some have achieved their purpose. Most of the Bandhs are done by Trade Unions not common people, hence we rarely know.",
        "Lol Maoists do associate themselves with Mao Ze Dong and his principles, it is the Naxalites who you are talking about here.",
        "Periyar was never a communist.",
        "These are questions to which you’ll not get a clear answer from a skewed demographics on platform like Reddit.\n\nEven if India is not a signatory to certain UN instruments, union rights are covered by the Indian constitution(Article 19).\n\nThere are union strikes in India (2021-22 farmers protest?), left is not the only side with trade unions, right wing parties have their own unions.",
        "That's exactly what I said.",
        "Buddy you need to start reading Indian news papers as well. There is always some kind of Bandh or striker that happens. A lot of them are localised. Only few are given national attention. Also Unions in India are divided along party lines, so most of them are like henchmen of the party who just follow what party leaders say.",
        "If you dont hear about strikes in Kerala, then you dont read news enough is all i can say",
        "I would like to correct one minor technicality first. There is nothing inherently communist about strikes or unions. It is just about fighting the corporations so that the workers are afforded a fair compensation and safe working conditions. Obviously communists and socialists largely support unions because it increases labor power and unites the working class, which most of us come under, not to mention it's a just struggle to claw back some of the most basic worker rights.\n\nAs for communism in India, there are many parties that purport to be communist but in many cases they are arms of capital because we live in a capitalist world so their power to actually impact anti-capitalist change is miniscule, no matter what their personal beliefs are. Strikes like the WGA and SAG-AFTRA strikes happen all the time in India, however without any institutional backing from the state or central governments these strikes very rarely result in permanent changes. We would have to contend with the strong anti-communist sentiments within the populace, work towards working class solidarity and promote leaders sympathetic to the cause before we can even hope to achieve any major changes like the strikes in US have.",
        "Unions in India are so much more powerful than in USA or UK. Bandhs are one example of a strike. There's bus drivers strikes, auto driver strikes, bank employee strikes etc too",
        "Unions have been highjacked by right wingers. \nUnion leaders support BJP directly or indirectly.\n\nThere's a mass campaign against communists.\nCommunist party is dead.\n\nStill there are organizations that have integrity but even they don't have diversity. Highjacked by uppercates.\nThey are casteist, sexist, homophobic and still living in 1920s.",
        "By the way, the biggest labour union in i dia is BMS, and aligned to BJP. Second biggest, INTUC is affiliated to congress. Labour unions are not communists necessarily. Europe has some of tbe best unionised workers.",
        "So how do we know? Bandhs in 1980s Mumbai collapsed the textile mills. IT industry can't even see one single union. The number of trade unions is in decline continuously. Indian government passed industrial relations code in 2020 which capped membership of unions and took away collective bargaining power. I dont get why I am being downboted.",
        "Those are political bandhs only. For advertisement only. No real objectives.",
        "No in Bengal until few years ago, transport was the biggest union that had to be placated because their strike could put the entire machinery into a standstill, because transport. Those got less with private players entering the market. To answer OP's question, Democracy is not just a 5yearly excercise to answer a single MCQ question, being able to form protest groups any moment with capability to disrupt government functioning is integral to democracy, that it's not a communist thing. The fact that those level of protest gets delegitimised in this country is a sign of Democracy faltering.",
        "The trade union system in the late Soviet Union consisted of thirty unions organized by the occupational branch. Including about 732,000 locals and 135 million members in 1984, unions encompassed almost all Soviet employees with the exception of some 4 to 5 million kolkhozniks.",
        "Sad to know that. I know one IT employee union which was successful in getting few things.  \nHere - [http://fiteorg.in/](http://fiteorg.in/)  \nThey used to be quite active before, not sure if they are now.",
        "i beg to differ here; the first Naxalites were not adivasis, but rural land workers; convergence of fights came after; Naxalites actually had and still have intensive political formation, amongst other courses (alphabetisation, maths, basic medicine); and the whole base of their fight was that those who work the land should possess the fruits of their work",
        "The vast majority of bandhs in the last 20 years are done to showcase political power.",
        "You don't attacks schools and children if you just want to live with dignity and respect. The original Naxal movement was definitely started to improve lives of the oppressed. But now most of the naxal groups are just terrorists like Hamas.",
        "Take for example recent teacher union agitation in ramlila maidan delhi.",
        "USSR and Cuba solved a lot of problems for their citizens but also ended up being classic totalitarian states which ran on unsustainable economy. Pretty much every analysis blames USSR's demise on their own policies instead of USA's \"imperialism\". Moreover they were as imperialist as the US considering what they did in Hungary, Czechoslovakia and Afghanistan.\n\nScandinavian countries, the UK, South Korea and Japan are much better examples of socialism. These countries built up their economies and then ventured on the socialist path which aligns with Marx's ideas. Unless we have the resources, there's no right reason to be communist or even socialist. It only breeds complacency and corruption which is our current state. The idea should be to distribute 10 million apples among 10 people instead of distributing 10 apples among 10 people.",
        "They are terrorists, but they are not communists"
    ],
    "cleaned_text": "exactly communism context india recent successful wga strikes us railway strikes uk really surprised didnt know unions could much power textbook capitalist countries india many states communist government seldom hear unions strikes found global rights index given rating guarantee rights trade unions india sourcehttpsenwikipediaorgwikitradeunionsinindia got wondering exactly meaning communism communism read elsewhere like cuba seems like everyone extremely polarised matter pardon ignorance trying understand scenario trying offend anybody ",
    "cleaned_title": "exactly communism context india",
    "cleaned_selftext": "recent successful wga strikes us railway strikes uk really surprised didnt know unions could much power textbook capitalist countries india many states communist government seldom hear unions strikes found global rights index given rating guarantee rights trade unions india sourcehttpsenwikipediaorgwikitradeunionsinindia got wondering exactly meaning communism communism read elsewhere like cuba seems like everyone extremely polarised matter pardon ignorance trying understand scenario trying offend anybody",
    "cleaned_comments": "unions led politician someone political affiliation cases indian communist lapdogs started soviets pumping money indiras time allegiance foreign country india theyre bunch radical elements disguised communists political party fancy brand culture copied overseas spearhead upper caste babus never implemented throughout subcontinent reason periyar ambedkar stayed away indian communist party google union strike india click news tab strikes called everyday many unions communist organize fight specific things pay hikes better health safety etc communist would group decides workers run factory govt easy story sell large groups exploited doesnt work great reality many reasons lack skill resources knowledge good leaders etc ofcourse powers ie exploitativedominating type people dont like handing away power diluting fight hold power hook crook exactly meaning communism question stripe communism talking seems like talking labour rights labour rights predate conception communism talking labour rights better capitalistic nations seldom hear unions strikes common last decade strike maruti plant manesar turned deadly resulted casualtieskilling one management cadre strikes rattled indian textile industry capitalists found better textile producers amenable countries like bangladesh owners could unperturbed labour concerns also people india used lap low pay abysmal work conditions aware cabal capital holders literate enough understand social dynamics present itfinanceengineering crowd face strikes empowered call strike news flow radar means communism india dead even kerala power thankfully think bundh huge unions strikes often across india probably southern states lmao strikes capitalist countries supposed communist countries china soviets banned unions imo communist government bundles power industry state end result dissimilar corporatism separation powers opinion key maintaining individual dignity workers india exploited hell back theyre good protesting union sentiments india strong however though workers rights integral part communism thats communism lot theory study praxis goes understanding implementing communism want learn communism indian context rindianleft might able guide good resources bhagat singhs autobiography also good starting place understand communism start marxs communist manifesto principles communism engels manifesto pamphlet give historical context poc set questions communism clear misunderstandings indian context communism never relevant never relevant talk naxalites communists maoist simply tribal rebels subjected brutal oppression government decided rebel dont know mao dont want communism want live dignity respect think find strikes actually succeeded india havent read uk railway strike wga strike said detrimental writers demands make availability jobs lower freedom exist must absolute freedom speech association neither left right india understands actually fos entails without fos eventually waiting go oligarchy russia route socialism communism system means production owned masses get rightful earnings order actually bring socialism needs class consciousness amongst masses sadly exists upper class know interests always help fellow upper class unfortunately india divided many places class caste religion region etc theres unity amongst poorer sections beleive caste system biggest hurdle poor brahmin common poor dalit rich brahmin yet wont side class instead theyll feel superior made categories live miserable life also making bad others socialism everyone would get free healthcare education housing would solve problems society ussr cuba problem face external capitalist imperialist nations like usa always attacks socialist state imposed heavy sanctions cuba successfully destroyed ussr end day must realise enemies rich exploitative class wont stop anything extract much value give back little possible recently electricity workers went strike despite esma enforced dont see coming people already given much better answers possibly could communism could mean wont touch anything ever achieved bandh lot seem achieve nothing useless achieved purpose bandhs done trade unions common people hence rarely know lol maoists associate mao ze dong principles naxalites talking periyar never communist questions youll get clear answer skewed demographics platform like reddit even india signatory certain un instruments union rights covered indian constitutionarticle union strikes india farmers protest left side trade unions right wing parties unions thats exactly said buddy need start reading indian news papers well always kind bandh striker happens lot localised given national attention also unions india divided along party lines like henchmen party follow party leaders say dont hear strikes kerala dont read news enough say would like correct one minor technicality first nothing inherently communist strikes unions fighting corporations workers afforded fair compensation safe working conditions obviously communists socialists largely support unions increases labor power unites working class us come mention struggle claw back basic worker rights communism india many parties purport communist many cases arms capital live capitalist world power actually impact anticapitalist change miniscule matter personal beliefs strikes like wga sagaftra strikes happen time india however without institutional backing state central governments strikes rarely result permanent changes would contend strong anticommunist sentiments within populace work towards working class solidarity promote leaders sympathetic cause even hope achieve major changes like strikes us unions india much powerful usa uk bandhs one example strike theres bus drivers strikes auto driver strikes bank employee strikes etc unions highjacked right wingers union leaders support bjp directly indirectly theres mass campaign communists communist party dead still organizations integrity even dont diversity highjacked uppercates casteist sexist homophobic still living way biggest labour union dia bms aligned bjp second biggest intuc affiliated congress labour unions communists necessarily europe tbe best unionised workers know bandhs mumbai collapsed textile mills industry cant even see one single union number trade unions decline continuously indian government passed industrial relations code capped membership unions took away collective bargaining power dont get downboted political bandhs advertisement real objectives bengal years ago transport biggest union placated strike could put entire machinery standstill transport got less private players entering market answer ops question democracy yearly excercise answer single mcq question able form protest groups moment capability disrupt government functioning integral democracy communist thing fact level protest gets delegitimised country sign democracy faltering trade union system late soviet union consisted thirty unions organized occupational branch including locals million members unions encompassed almost soviet employees exception million kolkhozniks sad know know one employee union successful getting things httpfiteorginhttpfiteorgin used quite active sure beg differ first naxalites adivasis rural land workers convergence fights came naxalites actually still intensive political formation amongst courses alphabetisation maths basic medicine whole base fight work land possess fruits work vast majority bandhs last years done showcase political power dont attacks schools children want live dignity respect original naxal movement definitely started improve lives oppressed naxal groups terrorists like hamas take example recent teacher union agitation ramlila maidan delhi ussr cuba solved lot problems citizens also ended classic totalitarian states ran unsustainable economy pretty much every analysis blames ussrs demise policies instead usas imperialism moreover imperialist us considering hungary czechoslovakia afghanistan scandinavian countries uk south korea japan much better examples socialism countries built economies ventured socialist path aligns marxs ideas unless resources theres right reason communist even socialist breeds complacency corruption current state idea distribute million apples among people instead distributing apples among people terrorists communists",
    "light_cleaned_title": "What exactly is communism in the context of India?",
    "light_cleaned_selftext": "The recent successful WGA strikes in the US and the railway strikes in the UK really surprised me. I didn't know unions could have so much power in such textbook capitalist countries. India too has many states where there is a communist government but you seldom hear about such unions or strikes. I found that the Global Rights Index has given a rating of 5 (No guarantee of rights) for trade unions in India ([source](https://en.wikipedia.org/wiki/Trade_unions_in_India)) which got me wondering what exactly is the meaning of communism here? Is it not the same as the communism you read about elsewhere like in Cuba? It seems like everyone is extremely polarised about the matter. Pardon my ignorance I am only trying to understand the scenario here and not trying to offend anybody.",
    "light_cleaned_comments": "These unions are led by some politician or someone will political affiliation in most cases. Indian communist are lapdogs. It started with Soviets pumping money during Indira's time. Their allegiance it to a foreign country, not to India. They're bunch of radical elements disguised as communists. Just a political party with a fancy brand culture copied from overseas, spearhead by upper caste babus. It was never implemented throughout the subcontinent. There was a reason why Periyar and Ambedkar stayed away from Indian Communist party. Just Google \"union strike india\" and click on the \"news\" tab. There are strikes called everyday. But there are many Unions that are not Communist. They organize and fight for specific things - pay hikes, better health, safety etc. Communist would be some group that decides the workers have to run the factory or govt. That is an easy story to sell to large groups that are being exploited. But it doesn't work out great in reality, for many reasons. Lack of skill, resources, knowledge, good leaders etc and ofcourse the powers that be, ie exploitative/dominating type of people, don't like handing away their power or diluting it, so they fight to hold on to that power by hook or crook. >what exactly is the meaning of communism here? Question is what stripe of \"communism\" are you talking about? It seems like you are talking about labour rights. Labour rights predate the conception of communism. If you are talking about labour rights, then we are better than few capitalistic nations. >you seldom hear about such unions or strikes. It was common in 1990s and 2000s. In the last decade a strike in Maruti plant in Manesar turned deadly and resulted in the casualties/killing of one or more of management cadre. Strikes rattled the Indian textile industry. Capitalists found better textile producers in more amenable countries like Bangladesh where the owners could be unperturbed by labour concerns. Also, people in India used to lap up the low pay and abysmal work conditions. They were not aware of the cabal of capital holders, nor were they literate enough to understand the social dynamics. The present IT/finance/engineering crowd does not face strikes or is not empowered to call for a strike. So such news flow under their radar. It means communism in India is dead even in Kerala where they are in power. And thankfully What do you think a bundh is? There are huge unions and strikes often across India (probably more so in the southern states). Lmao. There are more strikes in capitalist countries than supposed communist countries. Both china and soviet's banned unions. Imo communist government bundles the power of industry and state. The end result is not dissimilar to corporatism. Separation of powers is in my opinion key for maintaining individual dignity. The workers in India are exploited to hell and back. But they're good at protesting. The Union sentiments in India are strong. However, though workers' rights are an integral part of communism, that's not all communism is. There is a lot of theory, study, and praxis that goes into understanding and implementing communism. If you want to learn about communism in an Indian context, r/IndianLeft might be able to guide you to some good resources. Bhagat Singh's autobiography is also a good starting place. But to understand what communism is, start with Marx's Communist manifesto and 'Principles of Communism' by Engels. The manifesto is a pamphlet that will give you some historical context, and the POC is a set of few questions about communism that will clear up any misunderstandings you have. In the Indian context, Communism never was relevant and never will be relevant. We talk about the Naxalites being communists and maoist, but they simply are tribal rebels who were subjected to brutal oppression by the government and decided to rebel. They don't know who Mao is, they don't want communism. They want to live with dignity and respect I think you will find strikes that actually succeeded in india. I haven't read up on the UK railway strike, but the WGA strike is said to be detrimental for writers, and the demands will make availability of jobs lower. For any freedom to exist you must have absolute freedom of speech and association. Neither the left or the right in India understands what actually FoS entails. Without FoS we are all eventually just waiting to go oligarchy or Russia route. Socialism and then communism is a system in which the means of production are owned by the masses. So they get their rightful earnings. In order to actually bring socialism there needs to be class consciousness amongst the masses. Sadly it only exists in the upper class, they know their interests and they will always help out a fellow upper class. Unfortunately India is divided in many places, class, caste, religion, region etc. There's no unity amongst the poorer sections. I beleive caste system is the biggest hurdle, a poor Brahmin has more in common with a poor dalit than a rich Brahmin yet they won't side with their own class. Instead they'll feel superior about made up categories and live a miserable life while also making it bad for others. Under socialism everyone would get free healthcare, education and housing. That would solve most of the problems in our society. It did for USSR and Cuba. The only problem they face is from external capitalist imperialist nations like USA who always attacks a socialist state. They have imposed heavy sanctions on cuba and successfully destroyed the USSR. In the end of the day, you must realise, our enemies are only the rich exploitative class who won't stop at anything to extract as much value and give back as little as possible. Recently, electricity workers went on strike despite ESMA being enforced, so I don't see where you are coming from. Other people have already given much better answers than I possibly could on what communism could mean, so I won't touch on that. Has anything ever been achieved from a bandh? We do a lot of them, but seem to achieve nothing. Most are useless but some have achieved their purpose. Most of the Bandhs are done by Trade Unions not common people, hence we rarely know. Lol Maoists do associate themselves with Mao Ze Dong and his principles, it is the Naxalites who you are talking about here. Periyar was never a communist. These are questions to which you’ll not get a clear answer from a skewed demographics on platform like Reddit. Even if India is not a signatory to certain UN instruments, union rights are covered by the Indian constitution(Article 19). There are union strikes in India (2021-22 farmers protest?), left is not the only side with trade unions, right wing parties have their own unions. That's exactly what I said. Buddy you need to start reading Indian news papers as well. There is always some kind of Bandh or striker that happens. A lot of them are localised. Only few are given national attention. Also Unions in India are divided along party lines, so most of them are like henchmen of the party who just follow what party leaders say. If you dont hear about strikes in Kerala, then you dont read news enough is all i can say I would like to correct one minor technicality first. There is nothing inherently communist about strikes or unions. It is just about fighting the corporations so that the workers are afforded a fair compensation and safe working conditions. Obviously communists and socialists largely support unions because it increases labor power and unites the working class, which most of us come under, not to mention it's a just struggle to claw back some of the most basic worker rights. As for communism in India, there are many parties that purport to be communist but in many cases they are arms of capital because we live in a capitalist world so their power to actually impact anti-capitalist change is miniscule, no matter what their personal beliefs are. Strikes like the WGA and SAG-AFTRA strikes happen all the time in India, however without any institutional backing from the state or central governments these strikes very rarely result in permanent changes. We would have to contend with the strong anti-communist sentiments within the populace, work towards working class solidarity and promote leaders sympathetic to the cause before we can even hope to achieve any major changes like the strikes in US have. Unions in India are so much more powerful than in USA or UK. Bandhs are one example of a strike. There's bus drivers strikes, auto driver strikes, bank employee strikes etc too Unions have been highjacked by right wingers. Union leaders support BJP directly or indirectly. There's a mass campaign against communists. Communist party is dead. Still there are organizations that have integrity but even they don't have diversity. Highjacked by uppercates. They are casteist, sexist, homophobic and still living in 1920s. By the way, the biggest labour union in i dia is BMS, and aligned to BJP. Second biggest, INTUC is affiliated to congress. Labour unions are not communists necessarily. Europe has some of tbe best unionised workers. So how do we know? Bandhs in 1980s Mumbai collapsed the textile mills. IT industry can't even see one single union. The number of trade unions is in decline continuously. Indian government passed industrial relations code in 2020 which capped membership of unions and took away collective bargaining power. I dont get why I am being downboted. Those are political bandhs only. For advertisement only. No real objectives. No in Bengal until few years ago, transport was the biggest union that had to be placated because their strike could put the entire machinery into a standstill, because transport. Those got less with private players entering the market. To answer OP's question, Democracy is not just a 5yearly excercise to answer a single MCQ question, being able to form protest groups any moment with capability to disrupt government functioning is integral to democracy, that it's not a communist thing. The fact that those level of protest gets delegitimised in this country is a sign of Democracy faltering. The trade union system in the late Soviet Union consisted of thirty unions organized by the occupational branch. Including about 732,000 locals and 135 million members in 1984, unions encompassed almost all Soviet employees with the exception of some 4 to 5 million kolkhozniks. Sad to know that. I know one IT employee union which was successful in getting few things. Here - [http://fiteorg.in/](http://fiteorg.in/) They used to be quite active before, not sure if they are now. i beg to differ here; the first Naxalites were not adivasis, but rural land workers; convergence of fights came after; Naxalites actually had and still have intensive political formation, amongst other courses (alphabetisation, maths, basic medicine); and the whole base of their fight was that those who work the land should possess the fruits of their work The vast majority of bandhs in the last 20 years are done to showcase political power. You don't attacks schools and children if you just want to live with dignity and respect. The original Naxal movement was definitely started to improve lives of the oppressed. But now most of the naxal groups are just terrorists like Hamas. Take for example recent teacher union agitation in ramlila maidan delhi. USSR and Cuba solved a lot of problems for their citizens but also ended up being classic totalitarian states which ran on unsustainable economy. Pretty much every analysis blames USSR's demise on their own policies instead of USA's \"imperialism\". Moreover they were as imperialist as the US considering what they did in Hungary, Czechoslovakia and Afghanistan. Scandinavian countries, the UK, South Korea and Japan are much better examples of socialism. These countries built up their economies and then ventured on the socialist path which aligns with Marx's ideas. Unless we have the resources, there's no right reason to be communist or even socialist. It only breeds complacency and corruption which is our current state. The idea should be to distribute 10 million apples among 10 people instead of distributing 10 apples among 10 people. They are terrorists, but they are not communists"
}