{
    "id": "vnw0b3",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/vnw0b3/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 11,
    "num_comments": 11,
    "created_utc": 1656552610,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Any leads on any good content jobs? Not internships, but actually FT or PT mid/senior-level roles.\n\nSkills: 5+ years copywriting/copyediting for B2B and health.\n\nPortfolio: DM\n\nLocation: Remote\n\nContact: Reddit",
        "Looking to work in finance or consulting sector\nSkillset: B.Com degree / previously interned as editor with publishing house \nLocation: Chennai, Bangalore, Hyderabad\nPortfolio: Fresher, no previous work experience\nContact: Reddit!",
        "Need someone with PHP skills to work on a very minor project (like 15-30 minutes of fixing things). Please PM with your fee.",
        "Hi, i am looking for a product manager role preferably in Bangalore. I completed MBA one year ago and i can join immediately. I have worked as a backend software developer before MBA. DM me for more information.",
        "Any leads on intern/job role in Finance? I am in 2nd sem of MBA (Finance and Business Analytics) and our placements have already started. \n\nWilling to work in startups, fin-tech companies as well.\nPassionate about Finance, Equities and Wealth Management.\n\nCurrently an intern at HDFC Bank.\n\nI also have long experiences in Internet Marketing and have had online businesses.\n\nLocation : preferably in the order - Pune, New Mumbai, Nagpur, Bangalore, Hyderabad",
        "Hello\nLooking for a product manager role. I completed MBA this year and have 3 years of exp. as a software developer.",
        "Can some people watch the vidéo plz\n\n\nhttps://m.youtube.com/watch?v=N63bMtnNd8w",
        "1. Podcast sound designer &amp; audio editor (3+ years of experience)\n2. [https://linktr.ee/vardhan1234](https://linktr.ee/vardhan1234) (Portfolio Link)\n3. Mumbai\n4. DM on reddit",
        "What is portfolio?",
        "My company is selling NFTs and we need some people who would be interested in helping us promoting. Their main job would be to DM people on Discord, Twitter, etc to ask for collab and comment on posts on social media with promotional content. This is a paid gig and we're willing to pay 15-20k per person depending on how good they are at what they do. The job mostly requires copy pasting content and data gathering so be prepared to get bored.\n\nThis is a 100% remote job and requires about 4-5 hours/day and a computer with decent internet connection (can't be done via phone). You choose your own hours, we don't really care when or how you do your job as long as the work is being done timely. If interested please contact me at arjit@cyclopsnet.com.\nPlease note that you must have good English skills, basic knowledge of how Twitter, Discord and NFT work and basically know your way around a computer."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "leads good content jobs internships actually ft pt midseniorlevel roles skills years copywritingcopyediting bb health portfolio dm location remote contact reddit looking work finance consulting sector skillset bcom degree previously interned editor publishing house location chennai bangalore hyderabad portfolio fresher previous work experience contact reddit need someone php skills work minor project like minutes fixing things please pm fee hi looking product manager role preferably bangalore completed mba one year ago join immediately worked backend software developer mba dm information leads internjob role finance nd sem mba finance business analytics placements already started willing work startups fintech companies well passionate finance equities wealth management currently intern hdfc bank also long experiences internet marketing online businesses location preferably order pune new mumbai nagpur bangalore hyderabad hello looking product manager role completed mba year years exp software developer people watch vido plz podcast sound designer amp audio editor years experience httpslinktreevardhanhttpslinktreevardhan portfolio link mumbai dm reddit portfolio company selling nfts need people would interested helping us promoting main job would dm people discord twitter etc ask collab comment posts social media promotional content paid gig willing pay k per person depending good job mostly requires copy pasting content data gathering prepared get bored remote job requires hoursday computer decent internet connection cant done via phone choose hours dont really care job long work done timely interested please contact arjitcyclopsnetcom please note must good english skills basic knowledge twitter discord nft work basically know way around computer",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Any leads on any good content jobs? Not internships, but actually FT or PT mid/senior-level roles. Skills: 5+ years copywriting/copyediting for B2B and health. Portfolio: DM Location: Remote Contact: Reddit Looking to work in finance or consulting sector Skillset: B.Com degree / previously interned as editor with publishing house Location: Chennai, Bangalore, Hyderabad Portfolio: Fresher, no previous work experience Contact: Reddit! Need someone with PHP skills to work on a very minor project (like 15-30 minutes of fixing things). Please PM with your fee. Hi, i am looking for a product manager role preferably in Bangalore. I completed MBA one year ago and i can join immediately. I have worked as a backend software developer before MBA. DM me for more information. Any leads on intern/job role in Finance? I am in 2nd sem of MBA (Finance and Business Analytics) and our placements have already started. Willing to work in startups, fin-tech companies as well. Passionate about Finance, Equities and Wealth Management. Currently an intern at HDFC Bank. I also have long experiences in Internet Marketing and have had online businesses. Location : preferably in the order - Pune, New Mumbai, Nagpur, Bangalore, Hyderabad Hello Looking for a product manager role. I completed MBA this year and have 3 years of exp. as a software developer. Can some people watch the vidéo plz 1. Podcast sound designer &amp; audio editor (3+ years of experience) 2. [https://linktr.ee/vardhan1234](https://linktr.ee/vardhan1234) (Portfolio Link) 3. Mumbai 4. DM on reddit What is portfolio? My company is selling NFTs and we need some people who would be interested in helping us promoting. Their main job would be to DM people on Discord, Twitter, etc to ask for collab and comment on posts on social media with promotional content. This is a paid gig and we're willing to pay 15-20k per person depending on how good they are at what they do. The job mostly requires copy pasting content and data gathering so be prepared to get bored. This is a 100% remote job and requires about 4-5 hours/day and a computer with decent internet connection (can't be done via phone). You choose your own hours, we don't really care when or how you do your job as long as the work is being done timely. If interested please contact me at arjit@cyclopsnet.com. Please note that you must have good English skills, basic knowledge of how Twitter, Discord and NFT work and basically know your way around a computer."
}