{
    "id": "ilqaex",
    "title": "Delhi HC directs govt to consider representation regarding National Health Data Management Policy",
    "url": "https://www.reddit.com/r/india/comments/ilqaex/delhi_hc_directs_govt_to_consider_representation/",
    "selftext": "### \n\nhttps://preview.redd.it/bvvylc6fjwk51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=ffadbcc0b054907b6ef4a50bdcd8d77d4f6d7b17\n\n### Tl;dr\n\nToday, i.e. 03 September 2020, the Delhi High Court heard a petition which challenged the public consultation process for the National Digital Health Mission's Health Data Management Policy. The petition raised concerns about the unreasonably short deadline for submission of feedback at the height of the COVID-19 pandemic, and highlighted how the existing process excludes persons with disabilities, non-English speakers and people without internet access. After hearing the petitioner's counsel, the Delhi High Court directed the government to consider the petitioner's representation and noted that inadequate public consultation could be raised as a ground if the Draft Policy was challenged after its notification.\n\n### Background\n\nThe National Digital Health Mission (NDHM) was announced by the Prime Minister on the 74th Independence Day, and it envisages the creation of a National Digital Health Ecosystem with six key features- HealthID, DigiDoctor, Health Facility Registry, Personal Health Records, Telemedicine, and e-Pharmacy. A government press release describes NDHM as: *“Every Indian citizen will get a Health ID which will be a repository of all health-related information, of a person, such as medical tests, previous prescriptions, diagnosis, treatments, all historical health records”* and that *“private stakeholders’ will have an equal opportunity to integrate with these building blocks and create their own products for the market.”* \n\nWithin the first two week of its launch on 15 August 2020, health IDs were created for 55,700 individuals under NDHM. After launching the programme in six Union Territories, the National Health Authority issued a press release on 26 August 2020 announcing the public consultation for the Draft Health Data Management Policy for NDHM and the deadline to submit feedback was 03 September 2020. On 31 August 2020, the deadline was extended by another week till 5:00 PM on 10 September 2020.\n\n### Petition before Delhi High Court\n\nA writ petition was filed by Dr. Satendra Singh, a doctor and noted disability rights activist, before the Delhi High Court earlier this week which challenged the consultation process for the Draft Health Data Management Policy. The petition outlined four major problems with the consultation process which undermined minimum requirements for public participation in democratic decision-making. \n\n1. ***Short 15 day timeline***  \nThe consultation is being conducted in the middle of the COVID-19 pandemic when functioning of individuals and organizations is disrupted and people are finding it difficult to organize, collaborate, hold meetings etc. Analysis of the Draft Policy also requires multidisciplinary expertise in computer science, law, public health and medical ethics. Therefore, people need more time to consult and confer with experts and other stakeholders. In particular, healthcare workers are fully engrossed in management of the COVID-19 pandemic, and it is unreasonable to expect them to analyze and evaluate such a complex policy document within 15 days.  \n\n2. ***Inaccessibility for persons with visual impairments***  \nIn order to participate in the public consultation, an individual is required to fill the form available on NDHM’s website. At present, the form cannot be filled by persons with visual disabilities since the user must fill a CAPTCHA prior to submitting their response. A CAPTCHA cannot be read by screen reading software used by persons with visual disabilities, and in the absence of any alternatives, its use violates rights guaranteed under the Rights of Persons with Disabilities Act, 2016. Persons with disabilities have distinct healthcare related rights and are specifically-impacted stakeholders to NDHM. Therefore, the consultation process must be conducted in a manner that satisfies the government's statutory obligation to provide reasonable accomodation under the Rights of Persons with Disabilities Act, 2016.   \n\n3. ***Online-only mode of engagement***  \nThe consultation process is entirely online even though only 54% of the Indian population has access to the internet. This is contrary to the 2014 Pre-Legislative Consultation Policy, which recognized that every draft for consultation must be published not just on the internet but also by other means.   \n\n4. ***English-only mode of engagement***  \nThe Health Data Management Policy is only available in English and translated versions are not available for any of the 22 official languages recognized under the Eighth Schedule of the Constitution.The lack of translated versions will massively undermine the ability of the public to participate in the consultation process since census data suggests that around 13 crore people in India speak English, which is barely 10% of the country’s total population. \n\n### What happened during the hearing?\n\nThe writ petition filed by Dr. Satendra Singh was listed before a bench of Chief Justice DN Patel and Justice Prateek Jalan of the Delhi High Court. During the hearing, the bench indicated that it could not go into the matter at this stage, especially since there was no statutory obligation to hold public consultation. It should be noted that NDHM and the Draft Policy do not have any basis in legislation, and therefore, a statutory obligation to hold public consultation is not possible.  However, despite this, the Court directed the government to consider the petitioner's representation sent on 29 August 2020 in accordance with existing laws, rules and policies. The Court also noted that the issue of lack of meaningful public consultation could be raised as a ground of challenge if the Draft Policy is challenged on substantive grounds after its notification. \n\nThis blogpost will be updated once the final order of the Delhi High Court is published and to provide updates about follow up actions including further representations and RTIs. IFF provided legal support for this case, and the petitioner was represented in today's hearing by a legal team comprising of Advocates Rajshekhar Rao, Vinayak Mehrotra, Vrinda Bhandari, Devdutta Mukhopadhyay and Sanjana Srikumar.\n\n### Important Documents\n\n1. Writ Petition filed by Dr. Satendra Singh ([link](https://drive.google.com/file/d/1uhbFrOMNd5W12QOaNveU1WlcYP3AqPJH/view?usp=sharing))\n\n[Help us protect individual privacy and ensure access to a safe, open and free internet for all Indians by funding us. You can support us by making a one time donation or becoming a member with us today!](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 9,
    "num_comments": 1,
    "created_utc": 1599125642,
    "convurl": "https://a.thumbs.redditmedia.com/jzK8UBw5sfcVh4w8cv-3Yyzua98ljOBWVQ6v8DMaci4.jpg",
    "comments": [
        "AadhaarCh0ds already got the NDHM contacts, they are now harping same tune like aadhaar scam, **it is voluntary**. I heard, Chaddichandan lost his investment in India Scam Stack, he wants to make up the loss with health scam stack by selling your health data to health insurance companies."
    ],
    "cleaned_text": "delhi hc directs govt consider representation regarding national health data management policy tldr today ie september delhi high court heard petition challenged public consultation process national digital health missions health data management policy petition raised concerns unreasonably short deadline submission feedback height covid pandemic highlighted existing process excludes persons disabilities nonenglish speakers people without internet access hearing petitioners counsel delhi high court directed government consider petitioners representation noted inadequate public consultation could raised ground draft policy challenged notification background national digital health mission ndhm announced prime minister th independence day envisages creation national digital health ecosystem six key features healthid digidoctor health facility registry personal health records telemedicine epharmacy government press release describes ndhm every indian citizen get health id repository healthrelated information person medical tests previous prescriptions diagnosis treatments historical health records private stakeholders equal opportunity integrate building blocks create products market within first two week launch august health ids created individuals ndhm launching programme six union territories national health authority issued press release august announcing public consultation draft health data management policy ndhm deadline submit feedback september august deadline extended another week till pm september petition delhi high court writ petition filed dr satendra singh doctor noted disability rights activist delhi high court earlier week challenged consultation process draft health data management policy petition outlined four major problems consultation process undermined minimum requirements public participation democratic decisionmaking short day timeline consultation conducted middle covid pandemic functioning individuals organizations disrupted people finding difficult organize collaborate hold meetings etc analysis draft policy also requires multidisciplinary expertise computer science law public health medical ethics therefore people need time consult confer experts stakeholders particular healthcare workers fully engrossed management covid pandemic unreasonable expect analyze evaluate complex policy document within days inaccessibility persons visual impairments order participate public consultation individual required fill form available ndhms website present form filled persons visual disabilities since user must fill captcha prior submitting response captcha read screen reading software used persons visual disabilities absence alternatives use violates rights guaranteed rights persons disabilities act persons disabilities distinct healthcare related rights specificallyimpacted stakeholders ndhm therefore consultation process must conducted manner satisfies governments statutory obligation provide reasonable accomodation rights persons disabilities act onlineonly mode engagement consultation process entirely online even though indian population access internet contrary prelegislative consultation policy recognized every draft consultation must published internet also means englishonly mode engagement health data management policy available english translated versions available official languages recognized eighth schedule constitutionthe lack translated versions massively undermine ability public participate consultation process since census data suggests around crore people india speak english barely countrys total population happened hearing writ petition filed dr satendra singh listed bench chief justice dn patel justice prateek jalan delhi high court hearing bench indicated could go matter stage especially since statutory obligation hold public consultation noted ndhm draft policy basis legislation therefore statutory obligation hold public consultation possible however despite court directed government consider petitioners representation sent august accordance existing laws rules policies court also noted issue lack meaningful public consultation could raised ground challenge draft policy challenged substantive grounds notification blogpost updated final order delhi high court published provide updates follow actions including representations rtis iff provided legal support case petitioner represented todays hearing legal team comprising advocates rajshekhar rao vinayak mehrotra vrinda bhandari devdutta mukhopadhyay sanjana srikumar important documents writ petition filed dr satendra singh linkhttpsdrivegooglecomfileduhbfromndwqoanveuwlcypaqpjhviewuspsharing help us protect individual privacy ensure access safe open free internet indians funding us support us making one time donation becoming member us todayhttpsinternetfreedomindonate ",
    "cleaned_title": "delhi hc directs govt consider representation regarding national health data management policy",
    "cleaned_selftext": "tldr today ie september delhi high court heard petition challenged public consultation process national digital health missions health data management policy petition raised concerns unreasonably short deadline submission feedback height covid pandemic highlighted existing process excludes persons disabilities nonenglish speakers people without internet access hearing petitioners counsel delhi high court directed government consider petitioners representation noted inadequate public consultation could raised ground draft policy challenged notification background national digital health mission ndhm announced prime minister th independence day envisages creation national digital health ecosystem six key features healthid digidoctor health facility registry personal health records telemedicine epharmacy government press release describes ndhm every indian citizen get health id repository healthrelated information person medical tests previous prescriptions diagnosis treatments historical health records private stakeholders equal opportunity integrate building blocks create products market within first two week launch august health ids created individuals ndhm launching programme six union territories national health authority issued press release august announcing public consultation draft health data management policy ndhm deadline submit feedback september august deadline extended another week till pm september petition delhi high court writ petition filed dr satendra singh doctor noted disability rights activist delhi high court earlier week challenged consultation process draft health data management policy petition outlined four major problems consultation process undermined minimum requirements public participation democratic decisionmaking short day timeline consultation conducted middle covid pandemic functioning individuals organizations disrupted people finding difficult organize collaborate hold meetings etc analysis draft policy also requires multidisciplinary expertise computer science law public health medical ethics therefore people need time consult confer experts stakeholders particular healthcare workers fully engrossed management covid pandemic unreasonable expect analyze evaluate complex policy document within days inaccessibility persons visual impairments order participate public consultation individual required fill form available ndhms website present form filled persons visual disabilities since user must fill captcha prior submitting response captcha read screen reading software used persons visual disabilities absence alternatives use violates rights guaranteed rights persons disabilities act persons disabilities distinct healthcare related rights specificallyimpacted stakeholders ndhm therefore consultation process must conducted manner satisfies governments statutory obligation provide reasonable accomodation rights persons disabilities act onlineonly mode engagement consultation process entirely online even though indian population access internet contrary prelegislative consultation policy recognized every draft consultation must published internet also means englishonly mode engagement health data management policy available english translated versions available official languages recognized eighth schedule constitutionthe lack translated versions massively undermine ability public participate consultation process since census data suggests around crore people india speak english barely countrys total population happened hearing writ petition filed dr satendra singh listed bench chief justice dn patel justice prateek jalan delhi high court hearing bench indicated could go matter stage especially since statutory obligation hold public consultation noted ndhm draft policy basis legislation therefore statutory obligation hold public consultation possible however despite court directed government consider petitioners representation sent august accordance existing laws rules policies court also noted issue lack meaningful public consultation could raised ground challenge draft policy challenged substantive grounds notification blogpost updated final order delhi high court published provide updates follow actions including representations rtis iff provided legal support case petitioner represented todays hearing legal team comprising advocates rajshekhar rao vinayak mehrotra vrinda bhandari devdutta mukhopadhyay sanjana srikumar important documents writ petition filed dr satendra singh linkhttpsdrivegooglecomfileduhbfromndwqoanveuwlcypaqpjhviewuspsharing help us protect individual privacy ensure access safe open free internet indians funding us support us making one time donation becoming member us todayhttpsinternetfreedomindonate",
    "cleaned_comments": "aadhaarchds already got ndhm contacts harping tune like aadhaar scam voluntary heard chaddichandan lost investment india scam stack wants make loss health scam stack selling health data health insurance companies",
    "light_cleaned_title": "Delhi HC directs govt to consider representation regarding National Health Data Management Policy",
    "light_cleaned_selftext": "### ### Tl;dr Today, i.e. 03 September 2020, the Delhi High Court heard a petition which challenged the public consultation process for the National Digital Health Mission's Health Data Management Policy. The petition raised concerns about the unreasonably short deadline for submission of feedback at the height of the COVID-19 pandemic, and highlighted how the existing process excludes persons with disabilities, non-English speakers and people without internet access. After hearing the petitioner's counsel, the Delhi High Court directed the government to consider the petitioner's representation and noted that inadequate public consultation could be raised as a ground if the Draft Policy was challenged after its notification. ### Background The National Digital Health Mission (NDHM) was announced by the Prime Minister on the 74th Independence Day, and it envisages the creation of a National Digital Health Ecosystem with six key features- HealthID, DigiDoctor, Health Facility Registry, Personal Health Records, Telemedicine, and e-Pharmacy. A government press release describes NDHM as: *“Every Indian citizen will get a Health ID which will be a repository of all health-related information, of a person, such as medical tests, previous prescriptions, diagnosis, treatments, all historical health records”* and that *“private stakeholders’ will have an equal opportunity to integrate with these building blocks and create their own products for the market.”* Within the first two week of its launch on 15 August 2020, health IDs were created for 55,700 individuals under NDHM. After launching the programme in six Union Territories, the National Health Authority issued a press release on 26 August 2020 announcing the public consultation for the Draft Health Data Management Policy for NDHM and the deadline to submit feedback was 03 September 2020. On 31 August 2020, the deadline was extended by another week till 5:00 PM on 10 September 2020. ### Petition before Delhi High Court A writ petition was filed by Dr. Satendra Singh, a doctor and noted disability rights activist, before the Delhi High Court earlier this week which challenged the consultation process for the Draft Health Data Management Policy. The petition outlined four major problems with the consultation process which undermined minimum requirements for public participation in democratic decision-making. 1. ***Short 15 day timeline*** The consultation is being conducted in the middle of the COVID-19 pandemic when functioning of individuals and organizations is disrupted and people are finding it difficult to organize, collaborate, hold meetings etc. Analysis of the Draft Policy also requires multidisciplinary expertise in computer science, law, public health and medical ethics. Therefore, people need more time to consult and confer with experts and other stakeholders. In particular, healthcare workers are fully engrossed in management of the COVID-19 pandemic, and it is unreasonable to expect them to analyze and evaluate such a complex policy document within 15 days. 2. ***Inaccessibility for persons with visual impairments*** In order to participate in the public consultation, an individual is required to fill the form available on NDHM’s website. At present, the form cannot be filled by persons with visual disabilities since the user must fill a CAPTCHA prior to submitting their response. A CAPTCHA cannot be read by screen reading software used by persons with visual disabilities, and in the absence of any alternatives, its use violates rights guaranteed under the Rights of Persons with Disabilities Act, 2016. Persons with disabilities have distinct healthcare related rights and are specifically-impacted stakeholders to NDHM. Therefore, the consultation process must be conducted in a manner that satisfies the government's statutory obligation to provide reasonable accomodation under the Rights of Persons with Disabilities Act, 2016. 3. ***Online-only mode of engagement*** The consultation process is entirely online even though only 54% of the Indian population has access to the internet. This is contrary to the 2014 Pre-Legislative Consultation Policy, which recognized that every draft for consultation must be published not just on the internet but also by other means. 4. ***English-only mode of engagement*** The Health Data Management Policy is only available in English and translated versions are not available for any of the 22 official languages recognized under the Eighth Schedule of the Constitution.The lack of translated versions will massively undermine the ability of the public to participate in the consultation process since census data suggests that around 13 crore people in India speak English, which is barely 10% of the country’s total population. ### What happened during the hearing? The writ petition filed by Dr. Satendra Singh was listed before a bench of Chief Justice DN Patel and Justice Prateek Jalan of the Delhi High Court. During the hearing, the bench indicated that it could not go into the matter at this stage, especially since there was no statutory obligation to hold public consultation. It should be noted that NDHM and the Draft Policy do not have any basis in legislation, and therefore, a statutory obligation to hold public consultation is not possible. However, despite this, the Court directed the government to consider the petitioner's representation sent on 29 August 2020 in accordance with existing laws, rules and policies. The Court also noted that the issue of lack of meaningful public consultation could be raised as a ground of challenge if the Draft Policy is challenged on substantive grounds after its notification. This blogpost will be updated once the final order of the Delhi High Court is published and to provide updates about follow up actions including further representations and RTIs. IFF provided legal support for this case, and the petitioner was represented in today's hearing by a legal team comprising of Advocates Rajshekhar Rao, Vinayak Mehrotra, Vrinda Bhandari, Devdutta Mukhopadhyay and Sanjana Srikumar. ### Important Documents 1. Writ Petition filed by Dr. Satendra Singh ([link](https://drive.google.com/file/d/1uhbFrOMNd5W12QOaNveU1WlcYP3AqPJH/view?usp=sharing)) [Help us protect individual privacy and ensure access to a safe, open and free internet for all Indians by funding us. You can support us by making a one time donation or becoming a member with us today!](https://internetfreedom.in/donate)",
    "light_cleaned_comments": "AadhaarCh0ds already got the NDHM contacts, they are now harping same tune like aadhaar scam, **it is voluntary**. I heard, Chaddichandan lost his investment in India Scam Stack, he wants to make up the loss with health scam stack by selling your health data to health insurance companies."
}