{
    "id": "1axd2fk",
    "title": "KreditBee Fraud - My KYC Altered in Central Database",
    "url": "https://www.reddit.com/r/india/comments/1axd2fk/kreditbee_fraud_my_kyc_altered_in_central_database/",
    "selftext": "I live in New Delhi. Last month my address and phone number was changed/updated on my Axis Bank credit card account and I stopped receiving OTPs. The details were changed with some Bangalore addresses. \n\nI was surprised and tried calling but as usual, pathetic call support. Was not able to connect. Somehow I managed to rectify the phone number and the address using Aadhar authentication on Axis Bank Mobile App via Services and Support section. \n\nYesterday, I received an email from Central Know Your Customer CKYC that my KYC information has been updated by KreditBee. When I opened the attachment, I saw that the PDF contained \n\n1. A Different persons photo \n2. Different Current Address (some Bangalore Address)\n3. Different Permanent Address\n4. A Different Phone Number.\n\nThese are not my details so I am sharing them. Please not that this doc says that the Officially Valid Document Submitted for proof of Identity and address is Aadhar!\n\nhttps://preview.redd.it/duoinn5ue6kc1.png?width=963&format=png&auto=webp&s=b9f2060a9f5ddced50d53592ebde68570a31d379\n\nAs Per KreditBee, they have transferred some 8000 rupees to Axis Bank Account of this scammer. \n\nThis means the same person has a savings account with Axis bank! I do not have any bank account witH Axis only Credit card and a Meal (Prepaid) Card given by my organization. But I doubt there is some connection between the Axis Bank and Kredit bee. Check Addresses!\n\nTL;DR:  Someone has taken a loan from KreditBee and my KYC data has been altered without my authorization or consent. My current address, Photograph, and Phone number are changed in my CKYC database. The loan amount which is a mere 8000 was transferred by Kreditbee to Axis Banks Savings account as mentioned by Kreditbee on call. l. l. \n\nhttps://preview.redd.it/zthvakx7f6kc1.jpg?width=739&format=pjpg&auto=webp&s=9365859cbc35da378b05ee43052cb6d37ba99ff7\n\nTL;DR:  Someone has taken a loan from KreditBee and my KYC data has been altered without my authorisation or consent. Current address, Photograph, and Phone number are changed in my CKYC database. The loan amount which is mere 8000 was transferred by Kreditbee to Axis Banks Savings account as mentioned by Kreditbee on call. \n\n&#x200B;",
    "flair": "Crime",
    "score": 10,
    "num_comments": 1,
    "created_utc": 1708625050.0,
    "convurl": "https://b.thumbs.redditmedia.com/Rz76Yyt8Tzu3eM7WgyutC7T7SFYC1u32R4xQKJQb1YY.jpg",
    "comments": [
        "Kreditbee is a big time scam. I keep getting calls for unpaid loans from somebody who gave my reference. God knows what these idiots are upto",
        "Issue resolved. They removed details from Cibil. It’s Axis Bank’s turn now",
        "Which mail ID did you get that mail from?",
        "Ckyc@ckycindia.in",
        "ckyc@ckycindia.in",
        "Update: Axis Bank has some of the worst and incompetent staff. Small banks and even SBI has rectified their mistake but these morons just keep sending me we need 3 more days every three working days from last 20 days! Reporting to RBI Ombudsman (Lokpal) now"
    ],
    "cleaned_text": "kreditbee fraud kyc altered central database live new delhi last month address phone number changedupdated axis bank credit card account stopped receiving otps details changed bangalore addresses surprised tried calling usual pathetic call support able connect somehow managed rectify phone number address using aadhar authentication axis bank mobile app via services support section yesterday received email central know customer ckyc kyc information updated kreditbee opened attachment saw pdf contained different persons photo different current address bangalore address different permanent address different phone number details sharing please doc says officially valid document submitted proof identity address aadhar per kreditbee transferred rupees axis bank account scammer means person savings account axis bank bank account axis credit card meal prepaid card given organization doubt connection axis bank kredit bee check addresses tldr someone taken loan kreditbee kyc data altered without authorization consent current address photograph phone number changed ckyc database loan amount mere transferred kreditbee axis banks savings account mentioned kreditbee call l l tldr someone taken loan kreditbee kyc data altered without authorisation consent current address photograph phone number changed ckyc database loan amount mere transferred kreditbee axis banks savings account mentioned kreditbee call xb ",
    "cleaned_title": "kreditbee fraud kyc altered central database",
    "cleaned_selftext": "live new delhi last month address phone number changedupdated axis bank credit card account stopped receiving otps details changed bangalore addresses surprised tried calling usual pathetic call support able connect somehow managed rectify phone number address using aadhar authentication axis bank mobile app via services support section yesterday received email central know customer ckyc kyc information updated kreditbee opened attachment saw pdf contained different persons photo different current address bangalore address different permanent address different phone number details sharing please doc says officially valid document submitted proof identity address aadhar per kreditbee transferred rupees axis bank account scammer means person savings account axis bank bank account axis credit card meal prepaid card given organization doubt connection axis bank kredit bee check addresses tldr someone taken loan kreditbee kyc data altered without authorization consent current address photograph phone number changed ckyc database loan amount mere transferred kreditbee axis banks savings account mentioned kreditbee call l l tldr someone taken loan kreditbee kyc data altered without authorisation consent current address photograph phone number changed ckyc database loan amount mere transferred kreditbee axis banks savings account mentioned kreditbee call xb",
    "cleaned_comments": "kreditbee big time scam keep getting calls unpaid loans somebody gave reference god knows idiots upto issue resolved removed details cibil axis banks turn mail id get mail ckycckycindiain ckycckycindiain update axis bank worst incompetent staff small banks even sbi rectified mistake morons keep sending need days every three working days last days reporting rbi ombudsman lokpal",
    "light_cleaned_title": "KreditBee Fraud - My KYC Altered in Central Database",
    "light_cleaned_selftext": "I live in New Delhi. Last month my address and phone number was changed/updated on my Axis Bank credit card account and I stopped receiving OTPs. The details were changed with some Bangalore addresses. I was surprised and tried calling but as usual, pathetic call support. Was not able to connect. Somehow I managed to rectify the phone number and the address using Aadhar authentication on Axis Bank Mobile App via Services and Support section. Yesterday, I received an email from Central Know Your Customer CKYC that my KYC information has been updated by KreditBee. When I opened the attachment, I saw that the PDF contained 1. A Different persons photo 2. Different Current Address (some Bangalore Address) 3. Different Permanent Address 4. A Different Phone Number. These are not my details so I am sharing them. Please not that this doc says that the Officially Valid Document Submitted for proof of Identity and address is Aadhar! As Per KreditBee, they have transferred some 8000 rupees to Axis Bank Account of this scammer. This means the same person has a savings account with Axis bank! I do not have any bank account witH Axis only Credit card and a Meal (Prepaid) Card given by my organization. But I doubt there is some connection between the Axis Bank and Kredit bee. Check Addresses! TL;DR: Someone has taken a loan from KreditBee and my KYC data has been altered without my authorization or consent. My current address, Photograph, and Phone number are changed in my CKYC database. The loan amount which is a mere 8000 was transferred by Kreditbee to Axis Banks Savings account as mentioned by Kreditbee on call. l. l. TL;DR: Someone has taken a loan from KreditBee and my KYC data has been altered without my authorisation or consent. Current address, Photograph, and Phone number are changed in my CKYC database. The loan amount which is mere 8000 was transferred by Kreditbee to Axis Banks Savings account as mentioned by Kreditbee on call. &#x200B;",
    "light_cleaned_comments": "Kreditbee is a big time scam. I keep getting calls for unpaid loans from somebody who gave my reference. God knows what these idiots are upto Issue resolved. They removed details from Cibil. It’s Axis Bank’s turn now Which mail ID did you get that mail from? Ckyc@ckycindia.in ckyc@ckycindia.in Update: Axis Bank has some of the worst and incompetent staff. Small banks and even SBI has rectified their mistake but these morons just keep sending me we need 3 more days every three working days from last 20 days! Reporting to RBI Ombudsman (Lokpal) now"
}