{
    "id": "1b36ch5",
    "title": "Delhi High Court Issues Notice On Plea Challenging Centre's Notification Imposing Conditions On Married Women For Using Maiden Surname",
    "url": "https://www.livelaw.in/amp/high-court/delhi-high-court/delhi-high-court-notice-plea-centre-notification-obtaining-maiden-surname-discrimination-against-women-250840",
    "selftext": "Does this mean married woman can't retain her maiden surnam",
    "flair": "Law & Courts",
    "score": 5,
    "num_comments": 1,
    "created_utc": 1709228670.0,
    "convurl": "https://external-preview.redd.it/3aME_G0O_VkQ874KjUTkLhHd3NodfRu8oOmbahAp1UM.jpg?auto=webp&s=60c67e321045ffc841304ec419994cc4a1b8ad55",
    "comments": [
        "> The notification, issued by Union Ministry of Housing and Urban Affairs, states that if a married woman wishes to obtain a maiden surname, she will have to submit a copy of decree of divorce or a NOC from her husband, that he has no objection if she uses maiden surname.\n\nIts almost as if someone comes up with laws and policies of the top of their head and any debate on the pros and cons are actively discouraged and we end up with half baked policies like these. If anyone spent even ten minutes thinking about this they would understand that this is a stupid requirement."
    ],
    "cleaned_text": "delhi high court issues notice plea challenging centres notification imposing conditions married women using maiden surname mean married woman cant retain maiden surnam ",
    "cleaned_title": "delhi high court issues notice plea challenging centres notification imposing conditions married women using maiden surname",
    "cleaned_selftext": "mean married woman cant retain maiden surnam",
    "cleaned_comments": "notification issued union ministry housing urban affairs states married woman wishes obtain maiden surname submit copy decree divorce noc husband objection uses maiden surname almost someone comes laws policies top head debate pros cons actively discouraged end half baked policies like anyone spent even ten minutes thinking would understand stupid requirement",
    "light_cleaned_title": "Delhi High Court Issues Notice On Plea Challenging Centre's Notification Imposing Conditions On Married Women For Using Maiden Surname",
    "light_cleaned_selftext": "Does this mean married woman can't retain her maiden surnam",
    "light_cleaned_comments": "> The notification, issued by Union Ministry of Housing and Urban Affairs, states that if a married woman wishes to obtain a maiden surname, she will have to submit a copy of decree of divorce or a NOC from her husband, that he has no objection if she uses maiden surname. Its almost as if someone comes up with laws and policies of the top of their head and any debate on the pros and cons are actively discouraged and we end up with half baked policies like these. If anyone spent even ten minutes thinking about this they would understand that this is a stupid requirement."
}