{
    "id": "13f2i18",
    "title": "Team of 'The Kerala Story' to attend BJP rally in Telangana",
    "url": "https://www.siasat.com/team-of-the-kerala-story-to-attend-bjp-rally-in-telangana-2587223/",
    "selftext": "State BJP chief Bandi Sanjay Kumar officially announced the news while wishing the main lead of the film Adah Sharma on her birthday on Twitter.",
    "flair": "Politics",
    "score": 209,
    "num_comments": 34,
    "created_utc": 1683844637.0,
    "convurl": "https://external-preview.redd.it/CUOtBJSkESNogbA6BM_rGvbdyjN3yXlToRq27NIruwM.jpg?auto=webp&v=enabled&s=c83538cb807f9c46e7fb9cdafbb28b7d143983d1",
    "comments": [
        "Politician doing anything to get by.",
        "Slandering one state of India .ie. slandering India itself to get votes in other states. Guess who the actual anti-nationals are.",
        "Of course",
        "every body should watch dhruv rathee's video after watching this movie. Nobody is against movie but against propganda and attempts to defame a state.",
        "Merchants of hate",
        "The name is the biggest propaganda. Now if I just search Kerala,a few links to this \"film\" pops up. This name is a deliberate attempt to misinformation.\n\nThere is only one Kerala story, study well, get a good job, try to lead a good life and be a good person.",
        "> after watching this movie\n\nThey mostly watch Republic TV and listen to monkey baat. Dhruv is alien to them.",
        "Yeah, watched it after seeing it get recommended in another thread. Great research in that video",
        "\nIt is my fervent wish that a cinematic masterpiece capturing the harrowing events of the Gujarat riots be produced by the Kerala film industry. Such a film would not require any embellishment or fictitious elements, unlike the propaganda films produced by these sanghi a##holes. The actual events of the Gujarat riots are so spine-chilling in nature that they need no dramatization.",
        "It will be quickly banned. They even censored the movie Bheed heavily to not show the government in bad light or the atrocious hate campaigns targeting muslims during covid. But ofcourse hating a minority community to gain votes is fair game.",
        "Nooooo it's not a propaganda movie /s",
        "Tbh adah ahah is pretty ........\n\n\nI am such a loser :(",
        "Divide and rule baby",
        "Of course they would. It's no shocker where the Gujarati producer got the money from to produce this movie.",
        "Kerala to bas jhaki hai, Telangana, Tamil baki hai",
        "There was a movie called ‘Parzania’ which wasnt screened in Gujrat due to Bajrang Dal"
    ],
    "cleaned_text": "team kerala story attend bjp rally telangana state bjp chief bandi sanjay kumar officially announced news wishing main lead film adah sharma birthday twitter ",
    "cleaned_title": "team kerala story attend bjp rally telangana",
    "cleaned_selftext": "state bjp chief bandi sanjay kumar officially announced news wishing main lead film adah sharma birthday twitter",
    "cleaned_comments": "politician anything get slandering one state india ie slandering india get votes states guess actual antinationals course every body watch dhruv rathees video watching movie nobody movie propganda attempts defame state merchants hate name biggest propaganda search keralaa links film pops name deliberate attempt misinformation one kerala story study well get good job try lead good life good person watching movie mostly watch republic tv listen monkey baat dhruv alien yeah watched seeing get recommended another thread great research video fervent wish cinematic masterpiece capturing harrowing events gujarat riots produced kerala film industry film would require embellishment fictitious elements unlike propaganda films produced sanghi aholes actual events gujarat riots spinechilling nature need dramatization quickly banned even censored movie bheed heavily show government bad light atrocious hate campaigns targeting muslims covid ofcourse hating minority community gain votes fair game nooooo propaganda movie tbh adah ahah pretty loser divide rule baby course would shocker gujarati producer got money produce movie kerala bas jhaki hai telangana tamil baki hai movie called parzania wasnt screened gujrat due bajrang dal",
    "light_cleaned_title": "Team of 'The Kerala Story' to attend BJP rally in Telangana",
    "light_cleaned_selftext": "State BJP chief Bandi Sanjay Kumar officially announced the news while wishing the main lead of the film Adah Sharma on her birthday on Twitter.",
    "light_cleaned_comments": "Politician doing anything to get by. Slandering one state of India .ie. slandering India itself to get votes in other states. Guess who the actual anti-nationals are. Of course every body should watch dhruv rathee's video after watching this movie. Nobody is against movie but against propganda and attempts to defame a state. Merchants of hate The name is the biggest propaganda. Now if I just search Kerala,a few links to this \"film\" pops up. This name is a deliberate attempt to misinformation. There is only one Kerala story, study well, get a good job, try to lead a good life and be a good person. > after watching this movie They mostly watch Republic TV and listen to monkey baat. Dhruv is alien to them. Yeah, watched it after seeing it get recommended in another thread. Great research in that video It is my fervent wish that a cinematic masterpiece capturing the harrowing events of the Gujarat riots be produced by the Kerala film industry. Such a film would not require any embellishment or fictitious elements, unlike the propaganda films produced by these sanghi a##holes. The actual events of the Gujarat riots are so spine-chilling in nature that they need no dramatization. It will be quickly banned. They even censored the movie Bheed heavily to not show the government in bad light or the atrocious hate campaigns targeting muslims during covid. But ofcourse hating a minority community to gain votes is fair game. Nooooo it's not a propaganda movie /s Tbh adah ahah is pretty ........ I am such a loser :( Divide and rule baby Of course they would. It's no shocker where the Gujarati producer got the money from to produce this movie. Kerala to bas jhaki hai, Telangana, Tamil baki hai There was a movie called ‘Parzania’ which wasnt screened in Gujrat due to Bajrang Dal"
}