{
    "id": "1al6htx",
    "title": "Shouldn't we do something about this?",
    "url": "https://www.reddit.com/r/india/comments/1al6htx/shouldnt_we_do_something_about_this/",
    "selftext": "I was young when internet become available in India mainly as dial-up connection using phone line, and since then I have enthusiastically followed it, using almost every new thing coming my way from email, relay chats, messengers, to orkut, facebook, whatsapp, telegram etc.,\n\nBut in last few years I started to realize dangers lurking in internet esp., way social media is promoted and used. My first eye opener was netflix documentary [social dilemna](https://www.imdb.com/title/tt11464826/?ref_=nv_sr_srsg_0_tt_7_nm_1_q_social%2520dilem) . After that I stopped using facebook tried to stay away from google as much as possible.\n\nWith time more and more confirmations of what I feared kept coming. Another eye opener was [facebook files](https://www.wsj.com/articles/the-facebook-files-11631713039?mod=article_inline) published in wall street journal. This was based on many leaked internal documents from facebook.\n\nNow recently US senate judiciary committee called CEOs of big social media companies, as they are planning for new laws and considering removing protection to social media platforms against court cases for material posted there. I am sharing some video links of this proceeding, which is must watch for every parent and social media user in my view. \n\n[https://www.youtube.com/watch?v=UZ4Xw9RoQxM](https://www.youtube.com/watch?v=UZ4Xw9RoQxM)\n\n[https://www.youtube.com/watch?v=md1SORSmQGg](https://www.youtube.com/watch?v=md1SORSmQGg)\n\n[https://www.youtube.com/watch?v=FNaMjWCBdDU](https://www.youtube.com/watch?v=FNaMjWCBdDU)\n\nKindly share what you think of all this and what shall be done by us users and what government should do to safeguard our kids and other users.",
    "flair": "Rant / Vent",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1707322264.0,
    "convurl": "https://external-preview.redd.it/bs5ItnQFc5phWM1dkxTKarvcXX4KnoiFMABKoaDuC1I.jpg?auto=webp&s=2b2758b6921f3fa83f2b94f456b713fa02bc5734",
    "comments": [
        "My usage of Instagram went from 3 hrs per week to 10 minutes after watching this. I avoid Google whenever possible by using duckduckgo for searches and started using brave browser. Now I'm trying to cut down on reddit, which I'm failing miserably."
    ],
    "cleaned_text": "shouldnt something young internet become available india mainly dialup connection using phone line since enthusiastically followed using almost every new thing coming way email relay chats messengers orkut facebook whatsapp telegram etc last years started realize dangers lurking internet esp way social media promoted used first eye opener netflix documentary social dilemnahttpswwwimdbcomtitlettrefnvsrsrsgttnmqsocialdilem stopped using facebook tried stay away google much possible time confirmations feared kept coming another eye opener facebook fileshttpswwwwsjcomarticlesthefacebookfilesmodarticleinline published wall street journal based many leaked internal documents facebook recently us senate judiciary committee called ceos big social media companies planning new laws considering removing protection social media platforms court cases material posted sharing video links proceeding must watch every parent social media user view httpswwwyoutubecomwatchvuzxwroqxmhttpswwwyoutubecomwatchvuzxwroqxm httpswwwyoutubecomwatchvmdsorsmqgghttpswwwyoutubecomwatchvmdsorsmqgg httpswwwyoutubecomwatchvfnamjwcbdduhttpswwwyoutubecomwatchvfnamjwcbddu kindly share think shall done us users government safeguard kids users ",
    "cleaned_title": "shouldnt something",
    "cleaned_selftext": "young internet become available india mainly dialup connection using phone line since enthusiastically followed using almost every new thing coming way email relay chats messengers orkut facebook whatsapp telegram etc last years started realize dangers lurking internet esp way social media promoted used first eye opener netflix documentary social dilemnahttpswwwimdbcomtitlettrefnvsrsrsgttnmqsocialdilem stopped using facebook tried stay away google much possible time confirmations feared kept coming another eye opener facebook fileshttpswwwwsjcomarticlesthefacebookfilesmodarticleinline published wall street journal based many leaked internal documents facebook recently us senate judiciary committee called ceos big social media companies planning new laws considering removing protection social media platforms court cases material posted sharing video links proceeding must watch every parent social media user view httpswwwyoutubecomwatchvuzxwroqxmhttpswwwyoutubecomwatchvuzxwroqxm httpswwwyoutubecomwatchvmdsorsmqgghttpswwwyoutubecomwatchvmdsorsmqgg httpswwwyoutubecomwatchvfnamjwcbdduhttpswwwyoutubecomwatchvfnamjwcbddu kindly share think shall done us users government safeguard kids users",
    "cleaned_comments": "usage instagram went hrs per week minutes watching avoid google whenever possible using duckduckgo searches started using brave browser im trying cut reddit im failing miserably",
    "light_cleaned_title": "Shouldn't we do something about this?",
    "light_cleaned_selftext": "I was young when internet become available in India mainly as dial-up connection using phone line, and since then I have enthusiastically followed it, using almost every new thing coming my way from email, relay chats, messengers, to orkut, facebook, whatsapp, telegram etc., But in last few years I started to realize dangers lurking in internet esp., way social media is promoted and used. My first eye opener was netflix documentary [social dilemna](https://www.imdb.com/title/tt11464826/?ref_=nv_sr_srsg_0_tt_7_nm_1_q_social%2520dilem) . After that I stopped using facebook tried to stay away from google as much as possible. With time more and more confirmations of what I feared kept coming. Another eye opener was [facebook files](https://www.wsj.com/articles/the-facebook-files-11631713039?mod=article_inline) published in wall street journal. This was based on many leaked internal documents from facebook. Now recently US senate judiciary committee called CEOs of big social media companies, as they are planning for new laws and considering removing protection to social media platforms against court cases for material posted there. I am sharing some video links of this proceeding, which is must watch for every parent and social media user in my view. [https://www.youtube.com/watch?v=UZ4Xw9RoQxM](https://www.youtube.com/watch?v=UZ4Xw9RoQxM) [https://www.youtube.com/watch?v=md1SORSmQGg](https://www.youtube.com/watch?v=md1SORSmQGg) [https://www.youtube.com/watch?v=FNaMjWCBdDU](https://www.youtube.com/watch?v=FNaMjWCBdDU) Kindly share what you think of all this and what shall be done by us users and what government should do to safeguard our kids and other users.",
    "light_cleaned_comments": "My usage of Instagram went from 3 hrs per week to 10 minutes after watching this. I avoid Google whenever possible by using duckduckgo for searches and started using brave browser. Now I'm trying to cut down on reddit, which I'm failing miserably."
}