{
    "id": "1cxwqdf",
    "title": "Why is Navi Mumbai airport not complete yet?",
    "url": "https://www.reddit.com/r/india/comments/1cxwqdf/why_is_navi_mumbai_airport_not_complete_yet/",
    "selftext": "How is Adani as a contractor not blacklisted from bidding yet? \n\nHe has not completed the navi Mumbai airport and as far as I know he received a 12770 crore underwriting on it almost 2 years ago?\n\nWhat has been done since then? There was a goal of getting 1 plane out by 2023. How is this project \nstill pending in 2024?\n\nTalk is talk, actually finishing the work of contracts you get is a whole different thing. If I hear Adani win one more contract I'm gonna lose my mind.\n\n\nhttps://www.thehindu.com/business/Industry/sbi-underwrites-the-entire-debt-of-12770-crore-of-adanis-navi-mumbai-airport/article65271859.ece",
    "flair": "Rant / Vent",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1716372718,
    "convurl": "https://external-preview.redd.it/5wwNfZljiwhgcdU9_FA5yQJORSxWouN130cHhpX_isQ.jpg?auto=webp&s=8bb9c235e09c7abf4d7663e40361017ef18c2b7e",
    "comments": [
        "either politics around who'll take the credit, or money"
    ],
    "cleaned_text": "navi mumbai airport complete yet adani contractor blacklisted bidding yet completed navi mumbai airport far know received crore underwriting almost years ago done since goal getting plane project still pending talk talk actually finishing work contracts get whole different thing hear adani win one contract im gon na lose mind ",
    "cleaned_title": "navi mumbai airport complete yet",
    "cleaned_selftext": "adani contractor blacklisted bidding yet completed navi mumbai airport far know received crore underwriting almost years ago done since goal getting plane project still pending talk talk actually finishing work contracts get whole different thing hear adani win one contract im gon na lose mind",
    "cleaned_comments": "either politics around wholl take credit money",
    "light_cleaned_title": "Why is Navi Mumbai airport not complete yet?",
    "light_cleaned_selftext": "How is Adani as a contractor not blacklisted from bidding yet? He has not completed the navi Mumbai airport and as far as I know he received a 12770 crore underwriting on it almost 2 years ago? What has been done since then? There was a goal of getting 1 plane out by 2023. How is this project still pending in 2024? Talk is talk, actually finishing the work of contracts you get is a whole different thing. If I hear Adani win one more contract I'm gonna lose my mind.",
    "light_cleaned_comments": "either politics around who'll take the credit, or money"
}