{
    "id": "185yf51",
    "title": "Flipkart service center return policy scam 2023",
    "url": "https://www.reddit.com/gallery/185yf51",
    "selftext": "Dear users\n\nBe careful with #flipkart service center return policy scam. With this policy Flipkart delivering damaged products( September 30 I have ordered Onida washing machine it was delivered on 2nd October 2023 technician was visited on 3Rd October and he said it was defective. At that time I have connected with Flipkart team said its understand service center return policy connect with service center here\n1) invoice is generated with Flipkart \n2) amount paid to Flipkart \n3) item defective delivered through Flipkart\nIf problem occurs we have to connect with service center is there any logic even legal notice also not responding. In india Flipkart managing law as well Flipkart don't have respect on Indian law as well",
    "flair": "Law & Courts",
    "score": 2,
    "num_comments": 3,
    "created_utc": 1701184718.0,
    "convurl": "https://i.redd.it/nu2gljkkv33c1.jpg",
    "comments": [
        "please don't doxx yourself",
        "Remove personal information"
    ],
    "cleaned_text": "flipkart service center return policy scam dear users careful flipkart service center return policy scam policy flipkart delivering damaged products september ordered onida washing machine delivered nd october technician visited rd october said defective time connected flipkart team said understand service center return policy connect service center invoice generated flipkart amount paid flipkart item defective delivered flipkart problem occurs connect service center logic even legal notice also responding india flipkart managing law well flipkart dont respect indian law well ",
    "cleaned_title": "flipkart service center return policy scam",
    "cleaned_selftext": "dear users careful flipkart service center return policy scam policy flipkart delivering damaged products september ordered onida washing machine delivered nd october technician visited rd october said defective time connected flipkart team said understand service center return policy connect service center invoice generated flipkart amount paid flipkart item defective delivered flipkart problem occurs connect service center logic even legal notice also responding india flipkart managing law well flipkart dont respect indian law well",
    "cleaned_comments": "please dont doxx remove personal information",
    "light_cleaned_title": "Flipkart service center return policy scam 2023",
    "light_cleaned_selftext": "Dear users Be careful with #flipkart service center return policy scam. With this policy Flipkart delivering damaged products( September 30 I have ordered Onida washing machine it was delivered on 2nd October 2023 technician was visited on 3Rd October and he said it was defective. At that time I have connected with Flipkart team said its understand service center return policy connect with service center here 1) invoice is generated with Flipkart 2) amount paid to Flipkart 3) item defective delivered through Flipkart If problem occurs we have to connect with service center is there any logic even legal notice also not responding. In india Flipkart managing law as well Flipkart don't have respect on Indian law as well",
    "light_cleaned_comments": "please don't doxx yourself Remove personal information"
}