{
    "id": "157m114",
    "title": "Does the Forest Bill that is being tabled by the Govt have anything to do with the unrest in the North East?",
    "url": "https://frontline.thehindu.com/the-nation/forest-bill-and-monoculture-threaten-indigenous-rights-in-north-east-india/article66879929.ece/amp/",
    "selftext": "The new bill allows the Govt to take over 70-90% of the tribal land in the North East states. This bill was introduced in March ‘23, followed by the HC granting ST status to Meities. Which led to protests and then to riots. In the hills, the way the Kukis are being driven out, to clear the hills is too systematic. And hence it connects back to the Forest bill. Eventually benefitting the same capitalists that will plunge that land for its reserves. This will be such a huge blow not only to the tribals and the bio diversity there, but also contribute further to the climate crisis. Why isn’t the independent and international media picking up this story?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1690136408.0,
    "convurl": "https://external-preview.redd.it/wqa_VuA1iFg10ns5g3rM9PF6B6QTuEHAkZzGqWTOyG4.jpg?auto=webp&s=3a215a0249611b285559518703f2461073b12510",
    "comments": [],
    "cleaned_text": "forest bill tabled govt anything unrest north east new bill allows govt take tribal land north east states bill introduced march followed hc granting st status meities led protests riots hills way kukis driven clear hills systematic hence connects back forest bill eventually benefitting capitalists plunge land reserves huge blow tribals bio diversity also contribute climate crisis isnt independent international media picking story ",
    "cleaned_title": "forest bill tabled govt anything unrest north east",
    "cleaned_selftext": "new bill allows govt take tribal land north east states bill introduced march followed hc granting st status meities led protests riots hills way kukis driven clear hills systematic hence connects back forest bill eventually benefitting capitalists plunge land reserves huge blow tribals bio diversity also contribute climate crisis isnt independent international media picking story",
    "cleaned_comments": "",
    "light_cleaned_title": "Does the Forest Bill that is being tabled by the Govt have anything to do with the unrest in the North East?",
    "light_cleaned_selftext": "The new bill allows the Govt to take over 70-90% of the tribal land in the North East states. This bill was introduced in March ‘23, followed by the HC granting ST status to Meities. Which led to protests and then to riots. In the hills, the way the Kukis are being driven out, to clear the hills is too systematic. And hence it connects back to the Forest bill. Eventually benefitting the same capitalists that will plunge that land for its reserves. This will be such a huge blow not only to the tribals and the bio diversity there, but also contribute further to the climate crisis. Why isn’t the independent and international media picking up this story?",
    "light_cleaned_comments": ""
}