{
    "id": "l4haki",
    "title": "Protect Trans Rights Now! Portal Leakages Must Be Addressed.",
    "url": "https://www.reddit.com/r/india/comments/l4haki/protect_trans_rights_now_portal_leakages_must_be/",
    "selftext": "https://preview.redd.it/rzikacqrnfd61.png?width=1600&amp;format=png&amp;auto=webp&amp;s=c383716cfe2d9818b4085d26e4e69d086775ce85\n\n## Tl;dr\n\nLast year, we had received a complaint that the National Portal for Transgender Persons contained several vulnerabilities that could be exploited to access the sensitive personal data contained within the portal. While some of these issues were addressed, certain concerns about the security of the portal still remain.\n\n## The purpose of the portal\n\nOn the 25th of November 2020, The Social Justice and Empowerment Ministry launched a national portal for transgender persons to apply for certificates and identity cards. Through the portal – [**transgender.dosje.gov.in**](http://transgender.dosje.gov.in/) – transgender persons could apply for certificates and identity cards digitally without having to visit any government office and could also monitor the status of their application through the portal itself.\n\n## Security issues emerge\n\nLast year, we were CC'd on an email to the NIC, informing them about certain vulnerabilities in the portal’s architecture. The table below contains a list of the issues and their status.\n\nDescription of IssueStatusSensitive data can be accessed by changing URLAddressed, but could still potentially be accessedAll hitherto submitted forms can be accessed by changing URLAddressed, reverse engineering the hash function to gain access once againUnsecure website, does not have HTTPS or SSL certificateStill presentLack of security controls for registrationStill present\n\nThus, while some of these issues have been addressed, certain vulnerabilities persist:\n\n* **SSL vulnerabilities:** The portal is not SSL secured which means that all data in the website is not secured and the data can be accessed by hackers. SSL certificate helps to encrypt the data while passing it between web servers and websites. In general sense, the data is locked and can only be unlocked by the intended recipient so that all the sensitive information may be protected. Hence, this is absolutely necessary for a portal that handles information that can be categorised as extremely sensitive in nature. As the portal does not use SSL, there is high possibilities of leakage of personal data of the users of the portal. This makes the portal not secure for handling any information that is of a sensitive nature. This information can be misused and be used for identity theft or even for targeting the already vulnerable transgender individuals.\n* **Lack of security controls:** It is very easy to register onto the site by using a fake email id and phone number, and there isn’t any verification done (such as an email verification) to check whether candidates registered are actually legitimate or not. And so, any individual with the help of fake email IDs and phone numbers can create an account in the portal. By creating an account, one can learn the database architecture of the portal and analyse the weaknesses and vulnerabilities, and attack them, thereby enabling them to access data that is available on the portal. If registration continues to happen so easily without strict verification, the personal and sensitive data of all the users registered to the portal are at all times vulnerable to attacks from hackers. Rather than forcing any linking of government IDs in the sign-up process we recommend an inclusionary registration process that is designed in consultation with cyber security professionals.\n\n## Urgent need for privacy\n\nThe judgement of the Supreme Court in *National Legal Services Authority v. Union of India* granted transgender persons legal recognition as the ‘third gender’, and thus affirmed their fundamental rights as guaranteed under the constitution of India. Additionally, the Supreme Court’s judgement in *Justice K. S. Puttaswamy (Retd.) vs Union Of India And Ors.* affirmed the Right to Privacy as fundamental. Given the constitutional recognition of transgender persons, the *Puttaswamy Judgement*, when read along with Articles 14 (Equality before law), 19 (Protection of certain rights regarding freedom of speech), and 21 (Protection of life and personal liberty), thus implies a strong privacy doctrine for the information of transgender individuals as a constitutional obligation, and so the deprivation of the same due to leakages effectvively amounts to a deprivation of fundamental rights.\n\nFurthermore, given prevalent societal mores and norms, the safety of the data of transgender persons is paramount. Much has already been written about [**gender and surveillance**](https://genderingsurveillance.internetdemocracy.in/theory/), with transgender people facing extremely high levels of both digital and physical threats. These threats, together with deeply ingrained biases and misbeliefs, have already lead to both [**focused surveillance**](https://scroll.in/article/963693/indias-surveillance-technology-is-policing-the-data-and-bodies-of-its-most-vulnerable-citizens) and physical injury ([**or even death**](https://www.youthkiawaaz.com/2020/02/violence-against-transgender-persons-the-truth-we-dont-want-to-talk-about-but-we-must/)).\n\n## Recommendations\n\n1. If the issues listed above are not immediately dealt with and resolved, it could lead to data theft which could further lead to financial fraud and identity theft for the users of the portal. Furthermore, applying for certificates through the portal may be a less taxing experience than doing so by physically going to a government office, and so the importance of this portal is clear. Thus, we request swift redressal of the above enlisted issues.\n2. Cyber security is a complex process that requires dynamic activities to neutralise emerging threats. To ensure that such issues do not reoccur with the portal, a technical audit of the portal must be conducted. The National Informatics Centre has 33 Empanelled Information Security Auditing Organisations, many of which have conducted significant audits for government agencies such as the NIC, NPCI, and the SBI. Such organisations are technically capable of being tasked with auditing the portal.\n\nIf you are unable to discern any other fragilities in the portal's security architecture, please do let us know.\n\n*This representation was drafted with the help of* [***Rohan Mathew***](https://internetfreedom.in/p/707556e3-a187-4433-a86d-a7dc1d9f1a20/rohanmath3w21@gmail.com)*, a legal and policy intern at IFF.*\n\n## Important Documents\n\n1. IFF's Representation to the NIC regarding vulnerabilities in the National Portal for Transgender Persons ([**link**](https://drive.google.com/file/d/1UBub9xvQgtsLhhLqABiIfyfy7R1v5uO1/view))",
    "flair": "Policy/Economy",
    "score": 77,
    "num_comments": 0,
    "created_utc": 1611554044,
    "convurl": "https://b.thumbs.redditmedia.com/fGN_BBT3S-lP8-YNuXLnBZ8yKlCvooG62xJ_jqicKYk.jpg",
    "comments": [],
    "cleaned_text": "protect trans rights portal leakages must addressed tldr last year received complaint national portal transgender persons contained several vulnerabilities could exploited access sensitive personal data contained within portal issues addressed certain concerns security portal still remain purpose portal th november social justice empowerment ministry launched national portal transgender persons apply certificates identity cards portal transgenderdosjegovinhttptransgenderdosjegovin transgender persons could apply certificates identity cards digitally without visit government office could also monitor status application portal security issues emerge last year ccd email nic informing certain vulnerabilities portals architecture table contains list issues status description issuestatussensitive data accessed changing urladdressed could still potentially accessedall hitherto submitted forms accessed changing urladdressed reverse engineering hash function gain access againunsecure website ssl certificatestill presentlack security controls registrationstill present thus issues addressed certain vulnerabilities persist ssl vulnerabilities portal ssl secured means data website secured data accessed hackers ssl certificate helps encrypt data passing web servers websites general sense data locked unlocked intended recipient sensitive information may protected hence absolutely necessary portal handles information categorised extremely sensitive nature portal use ssl high possibilities leakage personal data users portal makes portal secure handling information sensitive nature information misused used identity theft even targeting already vulnerable transgender individuals lack security controls easy register onto site using fake email id phone number isnt verification done email verification check whether candidates registered actually legitimate individual help fake email ids phone numbers create account portal creating account one learn database architecture portal analyse weaknesses vulnerabilities attack thereby enabling access data available portal registration continues happen easily without strict verification personal sensitive data users registered portal times vulnerable attacks hackers rather forcing linking government ids signup process recommend inclusionary registration process designed consultation cyber security professionals urgent need privacy judgement supreme court national legal services authority v union india granted transgender persons legal recognition third gender thus affirmed fundamental rights guaranteed constitution india additionally supreme courts judgement justice k puttaswamy retd vs union india ors affirmed right privacy fundamental given constitutional recognition transgender persons puttaswamy judgement read along articles equality law protection certain rights regarding freedom speech protection life personal liberty thus implies strong privacy doctrine information transgender individuals constitutional obligation deprivation due leakages effectvively amounts deprivation fundamental rights furthermore given prevalent societal mores norms safety data transgender persons paramount much already written gender surveillancehttpsgenderingsurveillanceinternetdemocracyintheory transgender people facing extremely high levels digital physical threats threats together deeply ingrained biases misbeliefs already lead focused surveillancehttpsscrollinarticleindiassurveillancetechnologyispolicingthedataandbodiesofitsmostvulnerablecitizens physical injury even deathhttpswwwyouthkiawaazcomviolenceagainsttransgenderpersonsthetruthwedontwanttotalkaboutbutwemust recommendations issues listed immediately dealt resolved could lead data theft could lead financial fraud identity theft users portal furthermore applying certificates portal may less taxing experience physically going government office importance portal clear thus request swift redressal enlisted issues cyber security complex process requires dynamic activities neutralise emerging threats ensure issues reoccur portal technical audit portal must conducted national informatics centre empanelled information security auditing organisations many conducted significant audits government agencies nic npci sbi organisations technically capable tasked auditing portal unable discern fragilities portals security architecture please let us know representation drafted help rohan mathewhttpsinternetfreedominpeaadadcdfarohanmathwgmailcom legal policy intern iff important documents iffs representation nic regarding vulnerabilities national portal transgender persons linkhttpsdrivegooglecomfiledububxvqgtslhhlqabiifyfyrvuoview ",
    "cleaned_title": "protect trans rights portal leakages must addressed",
    "cleaned_selftext": "tldr last year received complaint national portal transgender persons contained several vulnerabilities could exploited access sensitive personal data contained within portal issues addressed certain concerns security portal still remain purpose portal th november social justice empowerment ministry launched national portal transgender persons apply certificates identity cards portal transgenderdosjegovinhttptransgenderdosjegovin transgender persons could apply certificates identity cards digitally without visit government office could also monitor status application portal security issues emerge last year ccd email nic informing certain vulnerabilities portals architecture table contains list issues status description issuestatussensitive data accessed changing urladdressed could still potentially accessedall hitherto submitted forms accessed changing urladdressed reverse engineering hash function gain access againunsecure website ssl certificatestill presentlack security controls registrationstill present thus issues addressed certain vulnerabilities persist ssl vulnerabilities portal ssl secured means data website secured data accessed hackers ssl certificate helps encrypt data passing web servers websites general sense data locked unlocked intended recipient sensitive information may protected hence absolutely necessary portal handles information categorised extremely sensitive nature portal use ssl high possibilities leakage personal data users portal makes portal secure handling information sensitive nature information misused used identity theft even targeting already vulnerable transgender individuals lack security controls easy register onto site using fake email id phone number isnt verification done email verification check whether candidates registered actually legitimate individual help fake email ids phone numbers create account portal creating account one learn database architecture portal analyse weaknesses vulnerabilities attack thereby enabling access data available portal registration continues happen easily without strict verification personal sensitive data users registered portal times vulnerable attacks hackers rather forcing linking government ids signup process recommend inclusionary registration process designed consultation cyber security professionals urgent need privacy judgement supreme court national legal services authority v union india granted transgender persons legal recognition third gender thus affirmed fundamental rights guaranteed constitution india additionally supreme courts judgement justice k puttaswamy retd vs union india ors affirmed right privacy fundamental given constitutional recognition transgender persons puttaswamy judgement read along articles equality law protection certain rights regarding freedom speech protection life personal liberty thus implies strong privacy doctrine information transgender individuals constitutional obligation deprivation due leakages effectvively amounts deprivation fundamental rights furthermore given prevalent societal mores norms safety data transgender persons paramount much already written gender surveillancehttpsgenderingsurveillanceinternetdemocracyintheory transgender people facing extremely high levels digital physical threats threats together deeply ingrained biases misbeliefs already lead focused surveillancehttpsscrollinarticleindiassurveillancetechnologyispolicingthedataandbodiesofitsmostvulnerablecitizens physical injury even deathhttpswwwyouthkiawaazcomviolenceagainsttransgenderpersonsthetruthwedontwanttotalkaboutbutwemust recommendations issues listed immediately dealt resolved could lead data theft could lead financial fraud identity theft users portal furthermore applying certificates portal may less taxing experience physically going government office importance portal clear thus request swift redressal enlisted issues cyber security complex process requires dynamic activities neutralise emerging threats ensure issues reoccur portal technical audit portal must conducted national informatics centre empanelled information security auditing organisations many conducted significant audits government agencies nic npci sbi organisations technically capable tasked auditing portal unable discern fragilities portals security architecture please let us know representation drafted help rohan mathewhttpsinternetfreedominpeaadadcdfarohanmathwgmailcom legal policy intern iff important documents iffs representation nic regarding vulnerabilities national portal transgender persons linkhttpsdrivegooglecomfiledububxvqgtslhhlqabiifyfyrvuoview",
    "cleaned_comments": "",
    "light_cleaned_title": "Protect Trans Rights Now! Portal Leakages Must Be Addressed.",
    "light_cleaned_selftext": "## Tl;dr Last year, we had received a complaint that the National Portal for Transgender Persons contained several vulnerabilities that could be exploited to access the sensitive personal data contained within the portal. While some of these issues were addressed, certain concerns about the security of the portal still remain. ## The purpose of the portal On the 25th of November 2020, The Social Justice and Empowerment Ministry launched a national portal for transgender persons to apply for certificates and identity cards. Through the portal – [**transgender.dosje.gov.in**](http://transgender.dosje.gov.in/) – transgender persons could apply for certificates and identity cards digitally without having to visit any government office and could also monitor the status of their application through the portal itself. ## Security issues emerge Last year, we were CC'd on an email to the NIC, informing them about certain vulnerabilities in the portal’s architecture. The table below contains a list of the issues and their status. Description of IssueStatusSensitive data can be accessed by changing URLAddressed, but could still potentially be accessedAll hitherto submitted forms can be accessed by changing URLAddressed, reverse engineering the hash function to gain access once againUnsecure website, does not have HTTPS or SSL certificateStill presentLack of security controls for registrationStill present Thus, while some of these issues have been addressed, certain vulnerabilities persist: * **SSL vulnerabilities:** The portal is not SSL secured which means that all data in the website is not secured and the data can be accessed by hackers. SSL certificate helps to encrypt the data while passing it between web servers and websites. In general sense, the data is locked and can only be unlocked by the intended recipient so that all the sensitive information may be protected. Hence, this is absolutely necessary for a portal that handles information that can be categorised as extremely sensitive in nature. As the portal does not use SSL, there is high possibilities of leakage of personal data of the users of the portal. This makes the portal not secure for handling any information that is of a sensitive nature. This information can be misused and be used for identity theft or even for targeting the already vulnerable transgender individuals. * **Lack of security controls:** It is very easy to register onto the site by using a fake email id and phone number, and there isn’t any verification done (such as an email verification) to check whether candidates registered are actually legitimate or not. And so, any individual with the help of fake email IDs and phone numbers can create an account in the portal. By creating an account, one can learn the database architecture of the portal and analyse the weaknesses and vulnerabilities, and attack them, thereby enabling them to access data that is available on the portal. If registration continues to happen so easily without strict verification, the personal and sensitive data of all the users registered to the portal are at all times vulnerable to attacks from hackers. Rather than forcing any linking of government IDs in the sign-up process we recommend an inclusionary registration process that is designed in consultation with cyber security professionals. ## Urgent need for privacy The judgement of the Supreme Court in *National Legal Services Authority v. Union of India* granted transgender persons legal recognition as the ‘third gender’, and thus affirmed their fundamental rights as guaranteed under the constitution of India. Additionally, the Supreme Court’s judgement in *Justice K. S. Puttaswamy (Retd.) vs Union Of India And Ors.* affirmed the Right to Privacy as fundamental. Given the constitutional recognition of transgender persons, the *Puttaswamy Judgement*, when read along with Articles 14 (Equality before law), 19 (Protection of certain rights regarding freedom of speech), and 21 (Protection of life and personal liberty), thus implies a strong privacy doctrine for the information of transgender individuals as a constitutional obligation, and so the deprivation of the same due to leakages effectvively amounts to a deprivation of fundamental rights. Furthermore, given prevalent societal mores and norms, the safety of the data of transgender persons is paramount. Much has already been written about [**gender and surveillance**](https://genderingsurveillance.internetdemocracy.in/theory/), with transgender people facing extremely high levels of both digital and physical threats. These threats, together with deeply ingrained biases and misbeliefs, have already lead to both [**focused surveillance**](https://scroll.in/article/963693/indias-surveillance-technology-is-policing-the-data-and-bodies-of-its-most-vulnerable-citizens) and physical injury ([**or even death**](https://www.youthkiawaaz.com/2020/02/violence-against-transgender-persons-the-truth-we-dont-want-to-talk-about-but-we-must/)). ## Recommendations 1. If the issues listed above are not immediately dealt with and resolved, it could lead to data theft which could further lead to financial fraud and identity theft for the users of the portal. Furthermore, applying for certificates through the portal may be a less taxing experience than doing so by physically going to a government office, and so the importance of this portal is clear. Thus, we request swift redressal of the above enlisted issues. 2. Cyber security is a complex process that requires dynamic activities to neutralise emerging threats. To ensure that such issues do not reoccur with the portal, a technical audit of the portal must be conducted. The National Informatics Centre has 33 Empanelled Information Security Auditing Organisations, many of which have conducted significant audits for government agencies such as the NIC, NPCI, and the SBI. Such organisations are technically capable of being tasked with auditing the portal. If you are unable to discern any other fragilities in the portal's security architecture, please do let us know. *This representation was drafted with the help of* [***Rohan Mathew***](https://internetfreedom.in/p/707556e3-a187-4433-a86d-a7dc1d9f1a20/rohanmath3w21@gmail.com)*, a legal and policy intern at IFF.* ## Important Documents 1. IFF's Representation to the NIC regarding vulnerabilities in the National Portal for Transgender Persons ([**link**](https://drive.google.com/file/d/1UBub9xvQgtsLhhLqABiIfyfy7R1v5uO1/view))",
    "light_cleaned_comments": ""
}