{
    "id": "11a7qrq",
    "title": "Could you help me translate my Indian Grandmothers newspaper clipping?",
    "url": "https://www.reddit.com/r/india/comments/11a7qrq/could_you_help_me_translate_my_indian/",
    "selftext": "Hi folks,\n\nWould anyone be able to translate this newspaper article about my grandmother? I am English but my Dad was half Indian and he grew up in Calcutta. His mum {Dhanlaxmi} was a Maths professor and his dad was an Art Director / Architect who did many exhibitions out in India where he served as a Royal Engineer.\n\n&amp;#x200B;\n\nMany thanks for any help :}\n\nWill\n\nhttps://preview.redd.it/0ege3o8mzzja1.jpg?width=1536&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0d9755a95fa454586ecbe571f77258764dd79b03",
    "flair": "AskIndia",
    "score": 14,
    "num_comments": 13,
    "created_utc": 1677183916,
    "convurl": "https://b.thumbs.redditmedia.com/SkMCR-kD44N1A8h-72uiC8mODBBMnXL50IzYHVTGP6o.jpg",
    "comments": [
        "You'd have better luck in r/sweden. That article is in Swedish.",
        "Oh wow thank you Andy. No idea why that would be from Sweden. Thanks for your help. :}",
        "You can post on /r/translator",
        "thanks very much Goose. :}",
        "its near my home they have oldest oil refinery",
        "use google lens, you'll get a crude but understandable translation",
        "Oh man. I too want to be called a “Royal Engineer “. Sounds great.",
        "It looks roughly like Swedish.",
        "Indian educator admires Karolinska\n\nSad that my money is not enough anymore, says the Indian teacher, Miss Dahnlaxmi Mehta, in a conversation with Stockholms-Tidningen. I have been in Stockholm for a little over a week, but I would have liked to study the position of women here in more detail, above all the working conditions of the teachers. Now I have to travel to England on Saturday and from there home. In Karolinch, the hospital impress upon me the most among the public facilities I have visited. Healthcare is extremely solid in Sweden. When one considers that in India we have an one qualified nurse in a population of 65,000, you understand what a huge social handicap we have to recover from in the West.\n\nI have visited many other countries in Europe and it has been an experience to see how Sweden clearly stands above the others socially. But it's terribly expensive here, more expensive than elsewhere, still I would like to stay here a lot, says Miss Mehta smiling.",
        "thank you so much SarimK. Very much appreciated. It's interesting she talks so much about standards of Healthcare. Her son / my dad ended up being an Orthopedic Surgeon. Many Thanks for the translation :}",
        "Use Google lens op. It reads text and tranlates instantly.",
        "He did the exhibit at the Indian Industries fair which may have been at the refiniery. I have all the photography from it."
    ],
    "cleaned_text": "could help translate indian grandmothers newspaper clipping hi folks would anyone able translate newspaper article grandmother english dad half indian grew calcutta mum dhanlaxmi maths professor dad art director architect many exhibitions india served royal engineer ampxb many thanks help ",
    "cleaned_title": "could help translate indian grandmothers newspaper clipping",
    "cleaned_selftext": "hi folks would anyone able translate newspaper article grandmother english dad half indian grew calcutta mum dhanlaxmi maths professor dad art director architect many exhibitions india served royal engineer ampxb many thanks help",
    "cleaned_comments": "youd better luck rsweden article swedish oh wow thank andy idea would sweden thanks help post rtranslator thanks much goose near home oldest oil refinery use google lens youll get crude understandable translation oh man want called royal engineer sounds great looks roughly like swedish indian educator admires karolinska sad money enough anymore says indian teacher miss dahnlaxmi mehta conversation stockholmstidningen stockholm little week would liked study position women detail working conditions teachers travel england saturday home karolinch hospital impress upon among public facilities visited healthcare extremely solid sweden one considers india one qualified nurse population understand huge social handicap recover west visited many countries europe experience see sweden clearly stands others socially terribly expensive expensive elsewhere still would like stay lot says miss mehta smiling thank much sarimk much appreciated interesting talks much standards healthcare son dad ended orthopedic surgeon many thanks translation use google lens op reads text tranlates instantly exhibit indian industries fair may refiniery photography",
    "light_cleaned_title": "Could you help me translate my Indian Grandmothers newspaper clipping?",
    "light_cleaned_selftext": "Hi folks, Would anyone be able to translate this newspaper article about my grandmother? I am English but my Dad was half Indian and he grew up in Calcutta. His mum {Dhanlaxmi} was a Maths professor and his dad was an Art Director / Architect who did many exhibitions out in India where he served as a Royal Engineer.  Many thanks for any help :} Will",
    "light_cleaned_comments": "You'd have better luck in r/sweden. That article is in Swedish. Oh wow thank you Andy. No idea why that would be from Sweden. Thanks for your help. :} You can post on /r/translator thanks very much Goose. :} its near my home they have oldest oil refinery use google lens, you'll get a crude but understandable translation Oh man. I too want to be called a “Royal Engineer “. Sounds great. It looks roughly like Swedish. Indian educator admires Karolinska Sad that my money is not enough anymore, says the Indian teacher, Miss Dahnlaxmi Mehta, in a conversation with Stockholms-Tidningen. I have been in Stockholm for a little over a week, but I would have liked to study the position of women here in more detail, above all the working conditions of the teachers. Now I have to travel to England on Saturday and from there home. In Karolinch, the hospital impress upon me the most among the public facilities I have visited. Healthcare is extremely solid in Sweden. When one considers that in India we have an one qualified nurse in a population of 65,000, you understand what a huge social handicap we have to recover from in the West. I have visited many other countries in Europe and it has been an experience to see how Sweden clearly stands above the others socially. But it's terribly expensive here, more expensive than elsewhere, still I would like to stay here a lot, says Miss Mehta smiling. thank you so much SarimK. Very much appreciated. It's interesting she talks so much about standards of Healthcare. Her son / my dad ended up being an Orthopedic Surgeon. Many Thanks for the translation :} Use Google lens op. It reads text and tranlates instantly. He did the exhibit at the Indian Industries fair which may have been at the refiniery. I have all the photography from it."
}