{
    "id": "12o4t30",
    "title": "Can something be done about India's discriminatory visa policy against people of Pakistani descent?",
    "url": "https://www.reddit.com/r/india/comments/12o4t30/can_something_be_done_about_indias_discriminatory/",
    "selftext": "An unfair visa policy which violates human rights laws has been in place in India since 2008. Here's a Guardian article detailing it.\n\nhttps://www.theguardian.com/commentisfree/libertycentral/2010/sep/02/india-visa-policy-pakistani-orgin\n\nI would like to discuss how we can go about changing this? It's detrimental to South Asian harmony outside India and Pakistan as in places like the UK Indians / Pakistanis get along like brothers, and would love to travel back to their homelands with each other.\n\nWould be nice to discuss this thank you.",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 60,
    "created_utc": 1681642847.0,
    "convurl": "https://external-preview.redd.it/zR7IdO7ZNvFEFYAc7tcmyRqwZgYA9W2lTh0yTV80pXs.jpg?auto=webp&amp;s=3993e14de2c7902520ae07b0f68cde0ef6a2f898",
    "comments": [
        "There is a reason for it, don't even think this is a topic for discussion",
        "No, it's not the same as treating pakistani citizens differently. This is illegal under international law. A person born in the US with a US citizenship to with one Pakistani grandparent is enough to be treated entirely differently to any other US citizen... That's just racist",
        "Thanks to Bin Laden, airport security has been a nightmare for the past 22 years. Thanks to David Headley, visas for Pakistani descendants will be a nightmare for a very long time. Security trumps laws every time.",
        "The bin Laden example isn't Discriminatory it applies to everyone. This is still a violation of international law is my point. As I said you could have 1 pakistani grandparent and have never visited the country ever in your life and your India visa process will be different to other people of the same citizenship as you. Read that article I linked. \n\nImagine if the visa policy for a foreign country was based on where your parents are born... It's ridiculous tbh",
        "Some people breeze through airport security, and others take much longer with increased scrutiny. Pakistani descendant face similar increased scrutiny for Indian visa.",
        "This is my point... It's discriminating against people based on their ancestors, that's the definition of racism written into law. I'm not saying whether or not it's justified, I'm questioning as to the legal basis of it. I don't think the Indian Constitution allows state level discrimination based on someone's ancestry.",
        "> This is illegal under international law\n\nHow is this illegal under international law? Which law does it break?",
        "Have you read the article I linked for context in the original post? Also beyond that article I linked there's also this:\n\nhttps://www.equalrightstrust.org/news/indian-visa-policy-discriminates-grounds-race\n\nIt violates international law treaties that India is a part of. There is no other country that comes to mind that treats visa applications differently from people based on where their parents are born.",
        "First of all, what you linked in the original post was not an article. It was an opinion piece. And that too does not point specifically to which \"international law\" is broken by India's policy. Same with this linked piece.\n\nHave we seen a legal challenge to India's policy anywhere? Have we seen a court ruling deeming it illegal? Otherwise it's all bluster. \n\n> There is no other country that comes to mind that treats visa applications differently from people based on where their parents are born.\n\nHere's one for the US:\n\nhttps://travel.state.gov/content/travel/en/us-visas/visa-information-resources/global-visa-wait-times.html",
        "Yes the US visa wait times and policy applies to ENTIRE citizenships. All Indian citizens are treated the same as each other. Indias policy treats Americans differently based on where that Americans parents are born! Do you not see the difference here?",
        "Not really. Not when 99% of the people in the world have the same citizenship as their place of birth. Only the most hyper-privileged people can assume this to be an issue.",
        "Who says I'm Pakistani? I'm just saying the policy violates human rights as it's discriminatory based on heritage. Countries are allowed to treat different citizenships differently as is the norm, but treating people within a certain citizenship differently based on their parents place of birth is not okay.",
        "This is not a valid counterargument to what I just asserted. No where in the US policy does it say a certain group of people from WITHIN a certain nationality will be treated differently. Indias policy of scrutinizing Visa applications is fair and just for security reasons, but what's not reasonable is treating 2 Americans differently if one is completely white and one has 1 Pakistani grandparent. There's also the issue these days of people who are mixed both Pakistani and Indian heritage, they can't get a visa to India to visit their own family easy.",
        ">  a certain group of people from WITHIN a certain nationality will be treated differently.\n\nOk then, what about Lebanon and Syria, which will not allow you to travel if you've ever been to Israel? \n\nAnd honestly, the entire system of visa depends on who you want to allow in and who you don't. This is a stupid argument.",
        "Again that Israel rule applies to EVERYONE It's not selective based on where people's parents were born. The India policy CLEARLY states it's based on 1 grandparent being Pakistani. \n\nYes the entire system is based on who you want in or not. Which is why India has an insanely strict policy on Pakistani citizens, this is fair because it applies to ALL Pakistani citizens. What's not fair is that I have a friend who has 1 Pakistani grandparent and is 3 quarters white American and can't get a normal tourist visa to India like any other American just cause of one grandparents origin. Again please find me a visa policy for any other country that makes your parents or grandparents \"origin\" a matter of importance. It's usually just citizenship based.",
        "> What's not fair is that I have a friend who has 1 Pakistani grandparent and is 3 quarters white American and can't get a normal tourist visa to India like any other American just cause of one grandparents origin.\n\nWhy is it not fair? Who decides what's fair and what's not?",
        "Cause it's racism... Treating 2 people of the same Citizenship differently based on their race by definition is racism.",
        "It's not race it's ethnicity.",
        "Yea racism means race / ethnic discrimination. Race is a subset of ethnicity. So yes it is racism",
        "Visa policies are ultimately the purview of individual countries, and it can be difficult to influence them from outside.",
        "Just visit southall or wembley and you are practically in India",
        "Of course not debating that. Just saying the policy is racist and needs to be changed as it's stupid treating Americans different based on what their ethnic background is.",
        "Looool. That's funny but surely you get my point?",
        "I just wouldn't want to visit where i am not welcomed.",
        "They have discovered other ways to enter the country.",
        "Doesn't answer to my concern. \n\nIn fact Karan Thapar wrote an article on this exact issue last month.\n\nhttps://www.hindustantimes.com/opinion/a-liberal-visa-regime-for-pakistani-visitors-to-india-101679143156802.html",
        "UMM no, I don't even need to give an explanation.",
        "No",
        "its good policy.",
        "Racism in law is a good policy?",
        "the purpose is to ensure our safety, so yes good policy if pakistan was not a terrorist country or had good relations with India then why would such policy exist.",
        "I clearly said the policy is just when it comes to Pakistani citizens. But penalizing an American citizen who has 1 Pakistani grandparent is racial discrimination. Do you not see the nuance in what I'm saying?",
        "ok",
        "Na bhai dhanyavaad, hum jaise hai waise he Rehne de nai chaiye us paar ka koi bahut dosti nibha li ab bhugat rahe hai",
        "Well there’s an off chance that those people could come here and start bombing places so… u knw.",
        "That doesn't justify racial discrimination within the same nationality... As I said doing this to just Pakistani citizens is fair, but treating different Americans differently based on their parents is called racism. \n\nImagine if the USA enacted a separate visa process for Indians with Bengali speaking parents Vs Indians with Punjabi speaking parents cause they think Punjabis are more likely to bomb places due to khalistan separatism? The Indian government would cause an outrage if that happened",
        "Not really analogous. The alleged discrimination, you are pointing to, is against people of a particular nation and not of a particular state.",
        "Do you want another terror attack? If the answer is no then the current policy should be maintained.",
        "So you're saying people like Sadiq Khan (mayor of London of Pakistani descent) and his family should go through a totally different visa process to visit India than any other British person?",
        "Remember David headly? Mumbai terror attack? That's a pretty good reason.",
        "I'm not talking about Pakistani citizens. I'm talking about American citizens.",
        "Khaliatanis terrorists hijacked planes in the 80s,\n\nhttps://en.m.wikipedia.org/wiki/Air_India_Flight_182\n\nThe culprits were British Indians and Canadian Indians. So would you be ok with a more tough visa process for Canadian and British Sikhs visiting India too?",
        "Canadian sikh with khalistani links get double checked incase you didn't know. As well as british sikh that have links with them.\n\nIf links with khalistan are there many don't even get visa.\n\nWith the number of terrorist attacks that has happened it's only natural.",
        "Please show me an Indian Embassy website where it says the visa policy is different for anyone who's a Canadian Sikh? \n\nAlso assuming what you said is true, it requires a link to khalistan groups, similarly Pakistan is an entire country, the rule would make sense if the person was affiliated to a terror group in Pakistan but the law as it currently states is for ALL people with any Pakistani grandparent. You could be 3 quarters Indian and be 1 quarter Pakistani and be discriminated against by this rule.",
        "Yes. Infact for politicians even intelligence agencies might look into it before giving a visa. Just because they don't say it doesn't mean it doesn't happen behind the scenes.",
        "Of course, but it doesn't explicitly say it. Discrimination is clear when it's EXPLICIT. There is no mention anywhere on any Indian Embassy website the process being more stringent for Sikhs, whereas it does say it for anyone with a Pakistani grandparent.\n\nMy issue is that it's explicitly mentioned which is racist. Also rejecting visas if nothing bad is found out about an applicant just cause they're of Pakistani heritage again is racist. You can't just reject people based on their race alone.",
        "As I said intelligence agencies go through them. Why do you think they never get visas? And the reason for pakistan is that ANY pakistani might be a terrorist. And pakistan state has an obsession with using terrorists against India. Simple as that.\n\nHow will anyone know if someone is a terrorist? Pakistan will not catch but support them. Other countries won't bother catching them because their target is India. Thus the net needs to be tighter.\n\nThe process is only a first filter to make it easier to catch bad guys. And the collateral is worth it.",
        "By that logic ANY Sikh can be a terrorist? And stop mentioning Pakistan the country, read my original post.\nThere are millions of people of Pakistani heritage in this world that give 0 crap about Pakistan and just want to visit India for business purposes or tourism or whatever. \n\nRejecting visas just based on someone's heritage is racism. Just admit it's racist.",
        "Race? Dude they are the same race. Maybe not me since I am east Asian origin person. But you and majority Indians are same race.\n\nThe reason is to actively discourage pakistani terrorists from using the cover of numbers of normal visitors to get through. An acceptable collateral.",
        "Exactly. Your numbers are higher. Thus the automatic filter first. Sikhs are smaller in number and khalistani Sikhs even smaller. Manageable. If the numbers of khalistani were higher I can assure you they will get the same treatment.",
        "Can you please look up the definition racial discrimination? It covers ethnicity, race, religion and nationality. Don't be pedantic you know exactly what I meant.",
        "My numbers? Who says I'm a Pakistani. Automatically filtering based on race / ethnicity / religion is discrimination. \n\nIndia is a part of this UN treaty\n\nhttps://en.m.wikipedia.org/wiki/International_Convention_on_the_Elimination_of_All_Forms_of_Racial_Discrimination\n\nRead how it's defined. This falls under violation of that treaty.",
        "How is it not discriminatory though? I think OPs point mentions this but its people of pakistani heritage too.\n\nI don't see how it can't be discriminatory. Trying to justify it or not is another matter but its certainly discriminatory",
        "Racial. Pakistani is not a race. It's a nationality. David Hedley wasn't a pakistani either. \n\nThe very fact that someone has close links with pakistan makes them a security threat for India. Simple as that. Better safe than sorry.",
        "Then moreso a reason to not change it."
    ],
    "cleaned_text": "something done indias discriminatory visa policy people pakistani descent unfair visa policy violates human rights laws place india since heres guardian article detailing would like discuss go changing detrimental south asian harmony outside india pakistan places like uk indians pakistanis get along like brothers would love travel back homelands would nice discuss thank ",
    "cleaned_title": "something done indias discriminatory visa policy people pakistani descent",
    "cleaned_selftext": "unfair visa policy violates human rights laws place india since heres guardian article detailing would like discuss go changing detrimental south asian harmony outside india pakistan places like uk indians pakistanis get along like brothers would love travel back homelands would nice discuss thank",
    "cleaned_comments": "reason dont even think topic discussion treating pakistani citizens differently illegal international law person born us us citizenship one pakistani grandparent enough treated entirely differently us citizen thats racist thanks bin laden airport security nightmare past years thanks david headley visas pakistani descendants nightmare long time security trumps laws every time bin laden example isnt discriminatory applies everyone still violation international law point said could pakistani grandparent never visited country ever life india visa process different people citizenship read article linked imagine visa policy foreign country based parents born ridiculous tbh people breeze airport security others take much longer increased scrutiny pakistani descendant face similar increased scrutiny indian visa point discriminating people based ancestors thats definition racism written law im saying whether justified im questioning legal basis dont think indian constitution allows state level discrimination based someones ancestry illegal international law illegal international law law break read article linked context original post also beyond article linked theres also violates international law treaties india part country comes mind treats visa applications differently people based parents born first linked original post article opinion piece point specifically international law broken indias policy linked piece seen legal challenge indias policy anywhere seen court ruling deeming illegal otherwise bluster country comes mind treats visa applications differently people based parents born heres one us yes us visa wait times policy applies entire citizenships indian citizens treated indias policy treats americans differently based americans parents born see difference really people world citizenship place birth hyperprivileged people assume issue says im pakistani im saying policy violates human rights discriminatory based heritage countries allowed treat different citizenships differently norm treating people within certain citizenship differently based parents place birth okay valid counterargument asserted us policy say certain group people within certain nationality treated differently indias policy scrutinizing visa applications fair security reasons whats reasonable treating americans differently one completely white one pakistani grandparent theres also issue days people mixed pakistani indian heritage cant get visa india visit family easy certain group people within certain nationality treated differently ok lebanon syria allow travel youve ever israel honestly entire system visa depends want allow dont stupid argument israel rule applies everyone selective based peoples parents born india policy clearly states based grandparent pakistani yes entire system based want india insanely strict policy pakistani citizens fair applies pakistani citizens whats fair friend pakistani grandparent quarters white american cant get normal tourist visa india like american cause one grandparents origin please find visa policy country makes parents grandparents origin matter importance usually citizenship based whats fair friend pakistani grandparent quarters white american cant get normal tourist visa india like american cause one grandparents origin fair decides whats fair whats cause racism treating people citizenship differently based race definition racism race ethnicity yea racism means race ethnic discrimination race subset ethnicity yes racism visa policies ultimately purview individual countries difficult influence outside visit southall wembley practically india course debating saying policy racist needs changed stupid treating americans different based ethnic background looool thats funny surely get point wouldnt want visit welcomed discovered ways enter country doesnt answer concern fact karan thapar wrote article exact issue last month umm dont even need give explanation good policy racism law good policy purpose ensure safety yes good policy pakistan terrorist country good relations india would policy exist clearly said policy comes pakistani citizens penalizing american citizen pakistani grandparent racial discrimination see nuance im saying ok na bhai dhanyavaad hum jaise hai waise rehne de nai chaiye us paar ka koi bahut dosti nibha li ab bhugat rahe hai well theres chance people could come start bombing places u knw doesnt justify racial discrimination within nationality said pakistani citizens fair treating different americans differently based parents called racism imagine usa enacted separate visa process indians bengali speaking parents vs indians punjabi speaking parents cause think punjabis likely bomb places due khalistan separatism indian government would cause outrage happened really analogous alleged discrimination pointing people particular nation particular state want another terror attack answer current policy maintained youre saying people like sadiq khan mayor london pakistani descent family go totally different visa process visit india british person remember david headly mumbai terror attack thats pretty good reason im talking pakistani citizens im talking american citizens khaliatanis terrorists hijacked planes culprits british indians canadian indians would ok tough visa process canadian british sikhs visiting india canadian sikh khalistani links get double checked incase didnt know well british sikh links links khalistan many dont even get visa number terrorist attacks happened natural please show indian embassy website says visa policy different anyone whos canadian sikh also assuming said true requires link khalistan groups similarly pakistan entire country rule would make sense person affiliated terror group pakistan law currently states people pakistani grandparent could quarters indian quarter pakistani discriminated rule yes infact politicians even intelligence agencies might look giving visa dont say doesnt mean doesnt happen behind scenes course doesnt explicitly say discrimination clear explicit mention anywhere indian embassy website process stringent sikhs whereas say anyone pakistani grandparent issue explicitly mentioned racist also rejecting visas nothing bad found applicant cause theyre pakistani heritage racist cant reject people based race alone said intelligence agencies go think never get visas reason pakistan pakistani might terrorist pakistan state obsession using terrorists india simple anyone know someone terrorist pakistan catch support countries wont bother catching target india thus net needs tighter process first filter make easier catch bad guys collateral worth logic sikh terrorist stop mentioning pakistan country read original post millions people pakistani heritage world give crap pakistan want visit india business purposes tourism whatever rejecting visas based someones heritage racism admit racist race dude race maybe since east asian origin person majority indians race reason actively discourage pakistani terrorists using cover numbers normal visitors get acceptable collateral exactly numbers higher thus automatic filter first sikhs smaller number khalistani sikhs even smaller manageable numbers khalistani higher assure get treatment please look definition racial discrimination covers ethnicity race religion nationality dont pedantic know exactly meant numbers says im pakistani automatically filtering based race ethnicity religion discrimination india part un treaty read defined falls violation treaty discriminatory though think ops point mentions people pakistani heritage dont see cant discriminatory trying justify another matter certainly discriminatory racial pakistani race nationality david hedley wasnt pakistani either fact someone close links pakistan makes security threat india simple better safe sorry moreso reason change",
    "light_cleaned_title": "Can something be done about India's discriminatory visa policy against people of Pakistani descent?",
    "light_cleaned_selftext": "An unfair visa policy which violates human rights laws has been in place in India since 2008. Here's a Guardian article detailing it. I would like to discuss how we can go about changing this? It's detrimental to South Asian harmony outside India and Pakistan as in places like the UK Indians / Pakistanis get along like brothers, and would love to travel back to their homelands with each other. Would be nice to discuss this thank you.",
    "light_cleaned_comments": "There is a reason for it, don't even think this is a topic for discussion No, it's not the same as treating pakistani citizens differently. This is illegal under international law. A person born in the US with a US citizenship to with one Pakistani grandparent is enough to be treated entirely differently to any other US citizen... That's just racist Thanks to Bin Laden, airport security has been a nightmare for the past 22 years. Thanks to David Headley, visas for Pakistani descendants will be a nightmare for a very long time. Security trumps laws every time. The bin Laden example isn't Discriminatory it applies to everyone. This is still a violation of international law is my point. As I said you could have 1 pakistani grandparent and have never visited the country ever in your life and your India visa process will be different to other people of the same citizenship as you. Read that article I linked. Imagine if the visa policy for a foreign country was based on where your parents are born... It's ridiculous tbh Some people breeze through airport security, and others take much longer with increased scrutiny. Pakistani descendant face similar increased scrutiny for Indian visa. This is my point... It's discriminating against people based on their ancestors, that's the definition of racism written into law. I'm not saying whether or not it's justified, I'm questioning as to the legal basis of it. I don't think the Indian Constitution allows state level discrimination based on someone's ancestry. > This is illegal under international law How is this illegal under international law? Which law does it break? Have you read the article I linked for context in the original post? Also beyond that article I linked there's also this: It violates international law treaties that India is a part of. There is no other country that comes to mind that treats visa applications differently from people based on where their parents are born. First of all, what you linked in the original post was not an article. It was an opinion piece. And that too does not point specifically to which \"international law\" is broken by India's policy. Same with this linked piece. Have we seen a legal challenge to India's policy anywhere? Have we seen a court ruling deeming it illegal? Otherwise it's all bluster. > There is no other country that comes to mind that treats visa applications differently from people based on where their parents are born. Here's one for the US: Yes the US visa wait times and policy applies to ENTIRE citizenships. All Indian citizens are treated the same as each other. Indias policy treats Americans differently based on where that Americans parents are born! Do you not see the difference here? Not really. Not when 99% of the people in the world have the same citizenship as their place of birth. Only the most hyper-privileged people can assume this to be an issue. Who says I'm Pakistani? I'm just saying the policy violates human rights as it's discriminatory based on heritage. Countries are allowed to treat different citizenships differently as is the norm, but treating people within a certain citizenship differently based on their parents place of birth is not okay. This is not a valid counterargument to what I just asserted. No where in the US policy does it say a certain group of people from WITHIN a certain nationality will be treated differently. Indias policy of scrutinizing Visa applications is fair and just for security reasons, but what's not reasonable is treating 2 Americans differently if one is completely white and one has 1 Pakistani grandparent. There's also the issue these days of people who are mixed both Pakistani and Indian heritage, they can't get a visa to India to visit their own family easy. > a certain group of people from WITHIN a certain nationality will be treated differently. Ok then, what about Lebanon and Syria, which will not allow you to travel if you've ever been to Israel? And honestly, the entire system of visa depends on who you want to allow in and who you don't. This is a stupid argument. Again that Israel rule applies to EVERYONE It's not selective based on where people's parents were born. The India policy CLEARLY states it's based on 1 grandparent being Pakistani. Yes the entire system is based on who you want in or not. Which is why India has an insanely strict policy on Pakistani citizens, this is fair because it applies to ALL Pakistani citizens. What's not fair is that I have a friend who has 1 Pakistani grandparent and is 3 quarters white American and can't get a normal tourist visa to India like any other American just cause of one grandparents origin. Again please find me a visa policy for any other country that makes your parents or grandparents \"origin\" a matter of importance. It's usually just citizenship based. > What's not fair is that I have a friend who has 1 Pakistani grandparent and is 3 quarters white American and can't get a normal tourist visa to India like any other American just cause of one grandparents origin. Why is it not fair? Who decides what's fair and what's not? Cause it's racism... Treating 2 people of the same Citizenship differently based on their race by definition is racism. It's not race it's ethnicity. Yea racism means race / ethnic discrimination. Race is a subset of ethnicity. So yes it is racism Visa policies are ultimately the purview of individual countries, and it can be difficult to influence them from outside. Just visit southall or wembley and you are practically in India Of course not debating that. Just saying the policy is racist and needs to be changed as it's stupid treating Americans different based on what their ethnic background is. Looool. That's funny but surely you get my point? I just wouldn't want to visit where i am not welcomed. They have discovered other ways to enter the country. Doesn't answer to my concern. In fact Karan Thapar wrote an article on this exact issue last month. UMM no, I don't even need to give an explanation. No its good policy. Racism in law is a good policy? the purpose is to ensure our safety, so yes good policy if pakistan was not a terrorist country or had good relations with India then why would such policy exist. I clearly said the policy is just when it comes to Pakistani citizens. But penalizing an American citizen who has 1 Pakistani grandparent is racial discrimination. Do you not see the nuance in what I'm saying? ok Na bhai dhanyavaad, hum jaise hai waise he Rehne de nai chaiye us paar ka koi bahut dosti nibha li ab bhugat rahe hai Well there’s an off chance that those people could come here and start bombing places so… u knw. That doesn't justify racial discrimination within the same nationality... As I said doing this to just Pakistani citizens is fair, but treating different Americans differently based on their parents is called racism. Imagine if the USA enacted a separate visa process for Indians with Bengali speaking parents Vs Indians with Punjabi speaking parents cause they think Punjabis are more likely to bomb places due to khalistan separatism? The Indian government would cause an outrage if that happened Not really analogous. The alleged discrimination, you are pointing to, is against people of a particular nation and not of a particular state. Do you want another terror attack? If the answer is no then the current policy should be maintained. So you're saying people like Sadiq Khan (mayor of London of Pakistani descent) and his family should go through a totally different visa process to visit India than any other British person? Remember David headly? Mumbai terror attack? That's a pretty good reason. I'm not talking about Pakistani citizens. I'm talking about American citizens. Khaliatanis terrorists hijacked planes in the 80s, The culprits were British Indians and Canadian Indians. So would you be ok with a more tough visa process for Canadian and British Sikhs visiting India too? Canadian sikh with khalistani links get double checked incase you didn't know. As well as british sikh that have links with them. If links with khalistan are there many don't even get visa. With the number of terrorist attacks that has happened it's only natural. Please show me an Indian Embassy website where it says the visa policy is different for anyone who's a Canadian Sikh? Also assuming what you said is true, it requires a link to khalistan groups, similarly Pakistan is an entire country, the rule would make sense if the person was affiliated to a terror group in Pakistan but the law as it currently states is for ALL people with any Pakistani grandparent. You could be 3 quarters Indian and be 1 quarter Pakistani and be discriminated against by this rule. Yes. Infact for politicians even intelligence agencies might look into it before giving a visa. Just because they don't say it doesn't mean it doesn't happen behind the scenes. Of course, but it doesn't explicitly say it. Discrimination is clear when it's EXPLICIT. There is no mention anywhere on any Indian Embassy website the process being more stringent for Sikhs, whereas it does say it for anyone with a Pakistani grandparent. My issue is that it's explicitly mentioned which is racist. Also rejecting visas if nothing bad is found out about an applicant just cause they're of Pakistani heritage again is racist. You can't just reject people based on their race alone. As I said intelligence agencies go through them. Why do you think they never get visas? And the reason for pakistan is that ANY pakistani might be a terrorist. And pakistan state has an obsession with using terrorists against India. Simple as that. How will anyone know if someone is a terrorist? Pakistan will not catch but support them. Other countries won't bother catching them because their target is India. Thus the net needs to be tighter. The process is only a first filter to make it easier to catch bad guys. And the collateral is worth it. By that logic ANY Sikh can be a terrorist? And stop mentioning Pakistan the country, read my original post. There are millions of people of Pakistani heritage in this world that give 0 crap about Pakistan and just want to visit India for business purposes or tourism or whatever. Rejecting visas just based on someone's heritage is racism. Just admit it's racist. Race? Dude they are the same race. Maybe not me since I am east Asian origin person. But you and majority Indians are same race. The reason is to actively discourage pakistani terrorists from using the cover of numbers of normal visitors to get through. An acceptable collateral. Exactly. Your numbers are higher. Thus the automatic filter first. Sikhs are smaller in number and khalistani Sikhs even smaller. Manageable. If the numbers of khalistani were higher I can assure you they will get the same treatment. Can you please look up the definition racial discrimination? It covers ethnicity, race, religion and nationality. Don't be pedantic you know exactly what I meant. My numbers? Who says I'm a Pakistani. Automatically filtering based on race / ethnicity / religion is discrimination. India is a part of this UN treaty Read how it's defined. This falls under violation of that treaty. How is it not discriminatory though? I think OPs point mentions this but its people of pakistani heritage too. I don't see how it can't be discriminatory. Trying to justify it or not is another matter but its certainly discriminatory Racial. Pakistani is not a race. It's a nationality. David Hedley wasn't a pakistani either. The very fact that someone has close links with pakistan makes them a security threat for India. Simple as that. Better safe than sorry. Then moreso a reason to not change it."
}