{
    "id": "159srrt",
    "title": "If tomatoes are expensive, don't eat, grow them at home: UP minister Pratibha Shukla",
    "url": "https://m.economictimes.com/news/india/if-tomatoes-are-expensive-dont-eat-grow-them-at-home-up-minister-pratibha-shukla/articleshow/102058666.cms",
    "selftext": "Usual Line from Finance Minister , now other ministers have caught on!",
    "flair": "Policy/Economy",
    "score": 135,
    "num_comments": 23,
    "created_utc": 1690337979.0,
    "convurl": "https://external-preview.redd.it/4lLpzwIjTY-oLB66hjqLexaZ4jG_y8pOmgrzA0GQgCI.jpg?auto=webp&s=a92949b29df82c41d2fd606d97b514919fe4608f",
    "comments": [
        "If money is expensive don't do job. Grow a money tree at home",
        "Useless ministers should stay at home, grow tomatoes.",
        "If petrol is expensive, don't buy it. Dig an oil well in your home.",
        "Women of the people, everyone definitely not a \"let them eat cake\" moment",
        "My friend agreed to this and started growing weed in his house. Now he is in jail. Don't listen to this.",
        "If gas is expensive , dont buy gas . Use wood or coal to cook at home.",
        "Inflation is high and Taxes are too much let’s deposit taxes to our own account.",
        "If people aren't paying tax, don't ask. lol",
        "This is no surprise as bjp minister talking like this they all are uneducated people",
        "If majority of people are facing the same problem, is it not their responsibility to fix?",
        "The irony is let them eat cake wasnt a real statement but this is",
        "If your leader is an ass, find a new one among yourselves.",
        "If mla is expensive make your 2yr old son MLA",
        "Education doesn’t matter, they just really hate people or hearing about their issues.",
        "Just to be clear, a new leader or a new ass?",
        "Good one. Well. Depends on what you are looking for.",
        "\"Let them eat cake\"",
        "it's not about education. they know IT CELL will justify everything they say and shift focus on Pakistan or generally some other communities",
        "Pink tomato",
        "Petition for ministers to become farmers for us poor people who can't afford tomatoes",
        "Quite a genuine advice! \nWhy dependent on RBI to print money, Just print it yourself",
        "Are people really seeing this? If even for once people vote by their senses then these dumb people would not be able to control our lives. Please vote for the candidate and not the party in your area so that these dickheads and clueless individuals aren't elected as ministers.",
        "I'm pretty sure she has never ever heard of Mary Antoinette and what happened to her.",
        "A real ass would be better than all of them combined.",
        "This government is nothing if not encouraging of self-sufficiency /s",
        "If a significant proportion of the population especially the tax paying ones did become self-sufficient in terms of food, this country will burn.",
        "Kal bolenge cylinder mehnga ho gya hai, chole khaake cylinder par baith jaayen... 🙃🙃",
        "If girls are getting raped, don't birth a girl. - BJP ministers",
        "If I see this type of look on someone, I'm gonna run away",
        "So if things are tight at home due to inflation can we stop paying tax?\n\nDon’t seem to be getting much for the taxes we pay. Maybe we can use them to buy petrol and tomatoes only",
        "If your homeless just  buy a  home 😮‍💨🤌",
        "\nA modern version of the legend - when Marie-Antoinette was told that the people had no bread to eat, she callously remarked, “Let them eat cake!”",
        "MA apologised to the executioner when she tripped climbing up to the guillotine.\n\nAll in all a much more polite person than the BJP ministers we have today.",
        "**Lack Of Self Awareness**",
        "Money nhi he printer laga do Ghar pe",
        "Who is this bappi lahiri",
        "If justice is expensive, switch to vigilantism.",
        "😂nice",
        "High prices of medicine… don’t take medicine or just open your own lab",
        "High price of gas cylinder… don’t cook or just find gas under your 2nd floor house",
        "High taxes… no problem, don’t pay taxes or just start collecting your own hafta… oops government employees do it already one way or the other",
        "r/shitbjpsays",
        "If food is expensive, don't eat, eat mud or die !",
        "What you see: a complete idiot.\n\nWhat ViswaGuru sees: a future FM",
        "Common sense has become the rarest commodity in  politics these days",
        "idk much but I think this is what our beloved pm meant by aatmanirbhar bharat",
        "If air is toxic, don't breathe, just kill yourself",
        "assholes in a nutshell.",
        "We can send missions to Mars and moon but can't mentained the price of vegitable, 🧘",
        "Let them eat cake",
        "The political version of Marie Antoinette?",
        "Good thing no one's  complaining about expensive clothes",
        "Women like her perpetuate the bimbo stereotype. Where are the intelligent women? Oh yes, they're growing tomatoes at home.",
        "Epic",
        "Le me suddenly ordering *printer*",
        "I dont get it,  tomatoes are not essential for indian cuisines  like  onion/green chillies/ turmeric etc. It's  just another off season vegetable. Why the uproar? Genuine curiosity from a Bangladeshi...",
        "If this is true add one more thing. If you can't do anything as a politician resign from the office. No need for clowns like this UP gawar.",
        "You're overestimating Indians. France has a culture of fighting their oppressors - violently. BJP was formed from a band of British boot lickers. Their followers are keeping the tradition well and alive to this day.",
        "Taxes are expensive, don't pay. Save it at home.",
        "They are absolutely well aware, blaming people for the misfortunes created by shit policies and the whole be atmanirbhar grow your own lemons bit is straight out of their PR play book. Accepting that there’s an inflation issue will be equal to criticising the gormint, can’t have that this close to elections, can we?",
        "https://media.tenor.com/19t4-68p4WMAAAAM/marie-antoinette.gif",
        "I agree, my donkey is so much better than these people.",
        "If you can't solve problem Regine",
        "I just can't handle the utter incompetence of the government and its officers and the excuses.  Except a few, there is nobody nearly competent to run this country.",
        "You get what you voted for",
        "How do I grow petrol at home 🤔",
        "Real \"let them eat cake\" energy coming off.",
        "India runs on indirect tax. Which applies on everyone equally.",
        "Are these so-called *RepresentativesOfPeople* gone out of senses. We used to see similar statements from the finance portfolio like 'I do not eat onions etc.' And looks like the infection is spreading across the board.",
        "They aren't seeing this, because they busy watching reels.",
        "definitely not her ass :-/",
        "Ma'am spine and ethics are very expensive too. And the difference is you can't even grow them.",
        "If you’re in mumbai, you can just sprinkle some tomato seeds on the clothes drying inside your living room (because of course you can’t afford a balcony) and hope they sprout into plants",
        "Order plotter",
        "How about you stop eating you fat cuntbag Pratibha. Go blow yogi and suck on his tomatoes and brinjal",
        "Tomatoes are essential. In dals, sambars, rasams, curries. It's a staple.",
        "Ah. Ok",
        "man, i wish i could give this kinda answer at my job review."
    ],
    "cleaned_text": "tomatoes expensive dont eat grow home minister pratibha shukla usual line finance minister ministers caught ",
    "cleaned_title": "tomatoes expensive dont eat grow home minister pratibha shukla",
    "cleaned_selftext": "usual line finance minister ministers caught",
    "cleaned_comments": "money expensive dont job grow money tree home useless ministers stay home grow tomatoes petrol expensive dont buy dig oil well home women people everyone definitely let eat cake moment friend agreed started growing weed house jail dont listen gas expensive dont buy gas use wood coal cook home inflation high taxes much lets deposit taxes account people arent paying tax dont ask lol surprise bjp minister talking like uneducated people majority people facing problem responsibility fix irony let eat cake wasnt real statement leader ass find new one among mla expensive make yr old son mla education doesnt matter really hate people hearing issues clear new leader new ass good one well depends looking let eat cake education know cell justify everything say shift focus pakistan generally communities pink tomato petition ministers become farmers us poor people cant afford tomatoes quite genuine advice dependent rbi print money print people really seeing even people vote senses dumb people would able control lives please vote candidate party area dickheads clueless individuals arent elected ministers im pretty sure never ever heard mary antoinette happened real ass would better combined government nothing encouraging selfsufficiency significant proportion population especially tax paying ones become selfsufficient terms food country burn kal bolenge cylinder mehnga ho gya hai chole khaake cylinder par baith jaayen girls getting raped dont birth girl bjp ministers see type look someone im gon na run away things tight home due inflation stop paying tax dont seem getting much taxes pay maybe use buy petrol tomatoes homeless buy home modern version legend marieantoinette told people bread eat callously remarked let eat cake apologised executioner tripped climbing guillotine much polite person bjp ministers today lack self awareness money nhi printer laga ghar pe bappi lahiri justice expensive switch vigilantism nice high prices medicine dont take medicine open lab high price gas cylinder dont cook find gas nd floor house high taxes problem dont pay taxes start collecting hafta oops government employees already one way rshitbjpsays food expensive dont eat eat mud die see complete idiot viswaguru sees future fm common sense become rarest commodity politics days idk much think beloved pm meant aatmanirbhar bharat air toxic dont breathe kill assholes nutshell send missions mars moon cant mentained price vegitable let eat cake political version marie antoinette good thing ones complaining expensive clothes women like perpetuate bimbo stereotype intelligent women oh yes theyre growing tomatoes home epic le suddenly ordering printer dont get tomatoes essential indian cuisines like oniongreen chillies turmeric etc another season vegetable uproar genuine curiosity bangladeshi true add one thing cant anything politician resign office need clowns like gawar youre overestimating indians france culture fighting oppressors violently bjp formed band british boot lickers followers keeping tradition well alive day taxes expensive dont pay save home absolutely well aware blaming people misfortunes created shit policies whole atmanirbhar grow lemons bit straight pr play book accepting theres inflation issue equal criticising gormint cant close elections agree donkey much better people cant solve problem regine cant handle utter incompetence government officers excuses except nobody nearly competent run country get voted grow petrol home real let eat cake energy coming india runs indirect tax applies everyone equally socalled representativesofpeople gone senses used see similar statements finance portfolio like eat onions etc looks like infection spreading across board arent seeing busy watching reels definitely ass maam spine ethics expensive difference cant even grow youre mumbai sprinkle tomato seeds clothes drying inside living room course cant afford balcony hope sprout plants order plotter stop eating fat cuntbag pratibha go blow yogi suck tomatoes brinjal tomatoes essential dals sambars rasams curries staple ah ok man wish could give kinda answer job review",
    "light_cleaned_title": "If tomatoes are expensive, don't eat, grow them at home: UP minister Pratibha Shukla",
    "light_cleaned_selftext": "Usual Line from Finance Minister , now other ministers have caught on!",
    "light_cleaned_comments": "If money is expensive don't do job. Grow a money tree at home Useless ministers should stay at home, grow tomatoes. If petrol is expensive, don't buy it. Dig an oil well in your home. Women of the people, everyone definitely not a \"let them eat cake\" moment My friend agreed to this and started growing weed in his house. Now he is in jail. Don't listen to this. If gas is expensive , dont buy gas . Use wood or coal to cook at home. Inflation is high and Taxes are too much let’s deposit taxes to our own account. If people aren't paying tax, don't ask. lol This is no surprise as bjp minister talking like this they all are uneducated people If majority of people are facing the same problem, is it not their responsibility to fix? The irony is let them eat cake wasnt a real statement but this is If your leader is an ass, find a new one among yourselves. If mla is expensive make your 2yr old son MLA Education doesn’t matter, they just really hate people or hearing about their issues. Just to be clear, a new leader or a new ass? Good one. Well. Depends on what you are looking for. \"Let them eat cake\" it's not about education. they know IT CELL will justify everything they say and shift focus on Pakistan or generally some other communities Pink tomato Petition for ministers to become farmers for us poor people who can't afford tomatoes Quite a genuine advice! Why dependent on RBI to print money, Just print it yourself Are people really seeing this? If even for once people vote by their senses then these dumb people would not be able to control our lives. Please vote for the candidate and not the party in your area so that these dickheads and clueless individuals aren't elected as ministers. I'm pretty sure she has never ever heard of Mary Antoinette and what happened to her. A real ass would be better than all of them combined. This government is nothing if not encouraging of self-sufficiency /s If a significant proportion of the population especially the tax paying ones did become self-sufficient in terms of food, this country will burn. Kal bolenge cylinder mehnga ho gya hai, chole khaake cylinder par baith jaayen... 🙃🙃 If girls are getting raped, don't birth a girl. - BJP ministers If I see this type of look on someone, I'm gonna run away So if things are tight at home due to inflation can we stop paying tax? Don’t seem to be getting much for the taxes we pay. Maybe we can use them to buy petrol and tomatoes only If your homeless just buy a home 😮‍💨🤌 A modern version of the legend - when Marie-Antoinette was told that the people had no bread to eat, she callously remarked, “Let them eat cake!” MA apologised to the executioner when she tripped climbing up to the guillotine. All in all a much more polite person than the BJP ministers we have today. **Lack Of Self Awareness** Money nhi he printer laga do Ghar pe Who is this bappi lahiri If justice is expensive, switch to vigilantism. 😂nice High prices of medicine… don’t take medicine or just open your own lab High price of gas cylinder… don’t cook or just find gas under your 2nd floor house High taxes… no problem, don’t pay taxes or just start collecting your own hafta… oops government employees do it already one way or the other r/shitbjpsays If food is expensive, don't eat, eat mud or die ! What you see: a complete idiot. What ViswaGuru sees: a future FM Common sense has become the rarest commodity in politics these days idk much but I think this is what our beloved pm meant by aatmanirbhar bharat If air is toxic, don't breathe, just kill yourself assholes in a nutshell. We can send missions to Mars and moon but can't mentained the price of vegitable, 🧘 Let them eat cake The political version of Marie Antoinette? Good thing no one's complaining about expensive clothes Women like her perpetuate the bimbo stereotype. Where are the intelligent women? Oh yes, they're growing tomatoes at home. Epic Le me suddenly ordering *printer* I dont get it, tomatoes are not essential for indian cuisines like onion/green chillies/ turmeric etc. It's just another off season vegetable. Why the uproar? Genuine curiosity from a Bangladeshi... If this is true add one more thing. If you can't do anything as a politician resign from the office. No need for clowns like this UP gawar. You're overestimating Indians. France has a culture of fighting their oppressors - violently. BJP was formed from a band of British boot lickers. Their followers are keeping the tradition well and alive to this day. Taxes are expensive, don't pay. Save it at home. They are absolutely well aware, blaming people for the misfortunes created by shit policies and the whole be atmanirbhar grow your own lemons bit is straight out of their PR play book. Accepting that there’s an inflation issue will be equal to criticising the gormint, can’t have that this close to elections, can we? I agree, my donkey is so much better than these people. If you can't solve problem Regine I just can't handle the utter incompetence of the government and its officers and the excuses. Except a few, there is nobody nearly competent to run this country. You get what you voted for How do I grow petrol at home 🤔 Real \"let them eat cake\" energy coming off. India runs on indirect tax. Which applies on everyone equally. Are these so-called *RepresentativesOfPeople* gone out of senses. We used to see similar statements from the finance portfolio like 'I do not eat onions etc.' And looks like the infection is spreading across the board. They aren't seeing this, because they busy watching reels. definitely not her ass :-/ Ma'am spine and ethics are very expensive too. And the difference is you can't even grow them. If you’re in mumbai, you can just sprinkle some tomato seeds on the clothes drying inside your living room (because of course you can’t afford a balcony) and hope they sprout into plants Order plotter How about you stop eating you fat cuntbag Pratibha. Go blow yogi and suck on his tomatoes and brinjal Tomatoes are essential. In dals, sambars, rasams, curries. It's a staple. Ah. Ok man, i wish i could give this kinda answer at my job review."
}