{
    "id": "1687ftd",
    "title": "ICC World Cup Ticket Booking scam by BookMyShow and BCCI (More Information in Caption).",
    "url": "https://www.reddit.com/gallery/1687ftd",
    "selftext": "Okay, it's going to be a bit long, but bear with me. \n\nMe and my 2 friends were looking forward to book 6 tickets for IND vs SA match that will happen on Nov 5. Now we were logged in by 5:30 PM IST as we mistook the time of booking as 6:00 PM IST. Anyways, we were logged in for all the time till 8:00 PM IST.\n\nAt 8 PM, the button showed \"Sold Out\" and we were dumbstruck, then after 3-4 minutes, it was back to \"Book Now\", I clicked first, my other friends were a bit late, hence due to that, I got a Queue time of 11 minutes, my friend two other friends 15 mins and 19 mins respectively, that too because of a difference of few seconds.\n\nAnyways, after 7 minutes, (IMAGE #2) booking screen appeared, but alas, everything was already booked, I refreshed the pages and then saw that there were 2-3 stands available, selected that, then tried to book, but then asked to retry, I retried every stand, but got none, and was thrown out and then (IMAGE #1) wait for 2 hours screen came. Same with my friends, after a minute or two, they went through the same experience as me, so did many people on twitter (many of them screen recorded everything as they faced same thing yesterday (1st August)). \n\nI mean isn't this an open scam? There are 68,000 seats in Eden Garden, if everyone is buying 2 tickets, so it should be 32,000 people. Now in 7 minutes, its impossible for 32,000 people to cut all the tickets, and say, legit people actually booked tickets, how (on Twitter) after 20-25 minutes, people had the same empty stands that we got , which were by the way full for us. Then after that, everyone was given IMAGE #1 screen and they made us wait till 9:15 before declaring that all tickets are sold out.\n\nNow,\n#1: How all the tickets were sold out in 7 minutes, and if it did, why they continued the Queue for 1.25 hours?\n#2: Many people went in after 2-3 minutes of waiting in Queue (Twitter) and they got the same empty stands that I got, so did someone who joined after 20 minutes, is that a default image?\n#3: Same thing happened to another stadium (Bengaluru) today with people finding specific stands empty throughout the booking process. Same thing happened yesterday too with booking in Chennai.\n#4: Who is responsible for the whole process? I saw posts in twitter where many \"agencies\" from outside India are posting \"India Tour\" with free tickets of match.\n#5: Why is ICC allowing this without any interference? No one is holding anyone accountable.\n#6: No anti-bot measure taken by BookMyShow. Website has no Security check, no Captcha, no nothing, I literally opened HyperBeam and started a virtual session and was able to get in the Queue, which means that any bot in the world can get and auto book tickets. Why there's no safeguard against this? Is this because so that in the case of a court case, they can say the liability is on bots, not us.\n#7: Does this happen in your country? What is your normal experience? Also, did you successfully booked your tickets.\n\nPS: In the \"Premium MasterCard only\" sale on 24 August, same stands were available for sale (same story I faced that day, everything booked after waiting 20 mins in the Queue).",
    "flair": "Crime",
    "score": 4,
    "num_comments": 4,
    "created_utc": 1693673458,
    "convurl": "https://i.redd.it/8mvzv25qgvlb1.jpg",
    "comments": [
        "I was a huge cricket fan till the 2000-2010s when BCCI was not controlling every form of cricket. Knew every player. Pasted scorecards on my door. Eagerly waited for any cricket match. Now I don't even watch cricket on TV especially Indian cricket. Everyone is our there praising doing team india.. king kohli all day all night... commentators are sold out. Icc is sold out to bcci. No reason to watch cricket anymore. Watch out field hockey is also going the same way. India is doing a monopoly there too as the money and sponsors are here.",
        "Exactly, I have tried with 5 different devices all login and ready before 30 mins. Still couldn't get any tickets.\n\nWhat's the point of announcing tickets on these platform?"
    ],
    "cleaned_text": "icc world cup ticket booking scam bookmyshow bcci information caption okay going bit long bear friends looking forward book tickets ind vs sa match happen nov logged pm ist mistook time booking pm ist anyways logged time till pm ist pm button showed sold dumbstruck minutes back book clicked first friends bit late hence due got queue time minutes friend two friends mins mins respectively difference seconds anyways minutes image booking screen appeared alas everything already booked refreshed pages saw stands available selected tried book asked retry retried every stand got none thrown image wait hours screen came friends minute two went experience many people twitter many screen recorded everything faced thing yesterday st august mean isnt open scam seats eden garden everyone buying tickets people minutes impossible people cut tickets say legit people actually booked tickets twitter minutes people empty stands got way full us everyone given image screen made us wait till declaring tickets sold tickets sold minutes continued queue hours many people went minutes waiting queue twitter got empty stands got someone joined minutes default image thing happened another stadium bengaluru today people finding specific stands empty throughout booking process thing happened yesterday booking chennai responsible whole process saw posts twitter many agencies outside india posting india tour free tickets match icc allowing without interference one holding anyone accountable antibot measure taken bookmyshow website security check captcha nothing literally opened hyperbeam started virtual session able get queue means bot world get auto book tickets theres safeguard case court case say liability bots us happen country normal experience also successfully booked tickets ps premium mastercard sale august stands available sale story faced day everything booked waiting mins queue ",
    "cleaned_title": "icc world cup ticket booking scam bookmyshow bcci information caption",
    "cleaned_selftext": "okay going bit long bear friends looking forward book tickets ind vs sa match happen nov logged pm ist mistook time booking pm ist anyways logged time till pm ist pm button showed sold dumbstruck minutes back book clicked first friends bit late hence due got queue time minutes friend two friends mins mins respectively difference seconds anyways minutes image booking screen appeared alas everything already booked refreshed pages saw stands available selected tried book asked retry retried every stand got none thrown image wait hours screen came friends minute two went experience many people twitter many screen recorded everything faced thing yesterday st august mean isnt open scam seats eden garden everyone buying tickets people minutes impossible people cut tickets say legit people actually booked tickets twitter minutes people empty stands got way full us everyone given image screen made us wait till declaring tickets sold tickets sold minutes continued queue hours many people went minutes waiting queue twitter got empty stands got someone joined minutes default image thing happened another stadium bengaluru today people finding specific stands empty throughout booking process thing happened yesterday booking chennai responsible whole process saw posts twitter many agencies outside india posting india tour free tickets match icc allowing without interference one holding anyone accountable antibot measure taken bookmyshow website security check captcha nothing literally opened hyperbeam started virtual session able get queue means bot world get auto book tickets theres safeguard case court case say liability bots us happen country normal experience also successfully booked tickets ps premium mastercard sale august stands available sale story faced day everything booked waiting mins queue",
    "cleaned_comments": "huge cricket fan till bcci controlling every form cricket knew every player pasted scorecards door eagerly waited cricket match dont even watch cricket tv especially indian cricket everyone praising team india king kohli day night commentators sold icc sold bcci reason watch cricket anymore watch field hockey also going way india monopoly money sponsors exactly tried different devices login ready mins still couldnt get tickets whats point announcing tickets platform",
    "light_cleaned_title": "ICC World Cup Ticket Booking scam by BookMyShow and BCCI (More Information in Caption).",
    "light_cleaned_selftext": "Okay, it's going to be a bit long, but bear with me. Me and my 2 friends were looking forward to book 6 tickets for IND vs SA match that will happen on Nov 5. Now we were logged in by 5:30 PM IST as we mistook the time of booking as 6:00 PM IST. Anyways, we were logged in for all the time till 8:00 PM IST. At 8 PM, the button showed \"Sold Out\" and we were dumbstruck, then after 3-4 minutes, it was back to \"Book Now\", I clicked first, my other friends were a bit late, hence due to that, I got a Queue time of 11 minutes, my friend two other friends 15 mins and 19 mins respectively, that too because of a difference of few seconds. Anyways, after 7 minutes, (IMAGE #2) booking screen appeared, but alas, everything was already booked, I refreshed the pages and then saw that there were 2-3 stands available, selected that, then tried to book, but then asked to retry, I retried every stand, but got none, and was thrown out and then (IMAGE #1) wait for 2 hours screen came. Same with my friends, after a minute or two, they went through the same experience as me, so did many people on twitter (many of them screen recorded everything as they faced same thing yesterday (1st August)). I mean isn't this an open scam? There are 68,000 seats in Eden Garden, if everyone is buying 2 tickets, so it should be 32,000 people. Now in 7 minutes, its impossible for 32,000 people to cut all the tickets, and say, legit people actually booked tickets, how (on Twitter) after 20-25 minutes, people had the same empty stands that we got , which were by the way full for us. Then after that, everyone was given IMAGE #1 screen and they made us wait till 9:15 before declaring that all tickets are sold out. Now, #1: How all the tickets were sold out in 7 minutes, and if it did, why they continued the Queue for 1.25 hours? #2: Many people went in after 2-3 minutes of waiting in Queue (Twitter) and they got the same empty stands that I got, so did someone who joined after 20 minutes, is that a default image? #3: Same thing happened to another stadium (Bengaluru) today with people finding specific stands empty throughout the booking process. Same thing happened yesterday too with booking in Chennai. #4: Who is responsible for the whole process? I saw posts in twitter where many \"agencies\" from outside India are posting \"India Tour\" with free tickets of match. #5: Why is ICC allowing this without any interference? No one is holding anyone accountable. #6: No anti-bot measure taken by BookMyShow. Website has no Security check, no Captcha, no nothing, I literally opened HyperBeam and started a virtual session and was able to get in the Queue, which means that any bot in the world can get and auto book tickets. Why there's no safeguard against this? Is this because so that in the case of a court case, they can say the liability is on bots, not us. #7: Does this happen in your country? What is your normal experience? Also, did you successfully booked your tickets. PS: In the \"Premium MasterCard only\" sale on 24 August, same stands were available for sale (same story I faced that day, everything booked after waiting 20 mins in the Queue).",
    "light_cleaned_comments": "I was a huge cricket fan till the 2000-2010s when BCCI was not controlling every form of cricket. Knew every player. Pasted scorecards on my door. Eagerly waited for any cricket match. Now I don't even watch cricket on TV especially Indian cricket. Everyone is our there praising doing team india.. king kohli all day all night... commentators are sold out. Icc is sold out to bcci. No reason to watch cricket anymore. Watch out field hockey is also going the same way. India is doing a monopoly there too as the money and sponsors are here. Exactly, I have tried with 5 different devices all login and ready before 30 mins. Still couldn't get any tickets. What's the point of announcing tickets on these platform?"
}