{
    "id": "169q8yt",
    "title": "G20 Summit 2023 LIVE Updates: Metro services at Supreme Court station to be affected, all others to remain operational",
    "url": "https://www.reddit.com/r/india/comments/169q8yt/g20_summit_2023_live_updates_metro_services_at/",
    "selftext": "China's foreign ministry confirmed that President Xi Jinping will not attend the G20 Summit in Delhi. Instead, Premier of the State Council Li Qiang will attend the 18th G20 Summit. Special arrangements have been made across the national capital in the wake of the G20 Summit.  \n\n\nClick here to know more 👇  \n[https://www.cnbctv18.com/india/g20-summit-2023-in-delhi-live-updates-police-traffic-list-of-metro-stations-closed-road-railway-routes-joe-biden-xi-jinping-russia-narendra-modi-17707921.htm](https://www.cnbctv18.com/india/g20-summit-2023-in-delhi-live-updates-police-traffic-list-of-metro-stations-closed-road-railway-routes-joe-biden-xi-jinping-russia-narendra-modi-17707921.htm)",
    "flair": "Politics",
    "score": 2,
    "num_comments": 1,
    "created_utc": 1693829157.0,
    "convurl": "https://external-preview.redd.it/_cEXuQM8Yw2tKB5WQEBl9ZHk9jlCETrT6v5K_rtNeP8.jpg?auto=webp&s=de4928123d5657f43deadb0e50ca580078aa887c",
    "comments": [],
    "cleaned_text": "g summit live updates metro services supreme court station affected others remain operational chinas foreign ministry confirmed president xi jinping attend g summit delhi instead premier state council li qiang attend th g summit special arrangements made across national capital wake g summit click know httpswwwcnbctvcomindiagsummitindelhiliveupdatespolicetrafficlistofmetrostationsclosedroadrailwayroutesjoebidenxijinpingrussianarendramodihtmhttpswwwcnbctvcomindiagsummitindelhiliveupdatespolicetrafficlistofmetrostationsclosedroadrailwayroutesjoebidenxijinpingrussianarendramodihtm ",
    "cleaned_title": "g summit live updates metro services supreme court station affected others remain operational",
    "cleaned_selftext": "chinas foreign ministry confirmed president xi jinping attend g summit delhi instead premier state council li qiang attend th g summit special arrangements made across national capital wake g summit click know httpswwwcnbctvcomindiagsummitindelhiliveupdatespolicetrafficlistofmetrostationsclosedroadrailwayroutesjoebidenxijinpingrussianarendramodihtmhttpswwwcnbctvcomindiagsummitindelhiliveupdatespolicetrafficlistofmetrostationsclosedroadrailwayroutesjoebidenxijinpingrussianarendramodihtm",
    "cleaned_comments": "",
    "light_cleaned_title": "G20 Summit 2023 LIVE Updates: Metro services at Supreme Court station to be affected, all others to remain operational",
    "light_cleaned_selftext": "China's foreign ministry confirmed that President Xi Jinping will not attend the G20 Summit in Delhi. Instead, Premier of the State Council Li Qiang will attend the 18th G20 Summit. Special arrangements have been made across the national capital in the wake of the G20 Summit. Click here to know more 👇 [https://www.cnbctv18.com/india/g20-summit-2023-in-delhi-live-updates-police-traffic-list-of-metro-stations-closed-road-railway-routes-joe-biden-xi-jinping-russia-narendra-modi-17707921.htm](https://www.cnbctv18.com/india/g20-summit-2023-in-delhi-live-updates-police-traffic-list-of-metro-stations-closed-road-railway-routes-joe-biden-xi-jinping-russia-narendra-modi-17707921.htm)",
    "light_cleaned_comments": ""
}