{
    "id": "1flyjms",
    "title": "When did Indians start hating each other this much?",
    "url": "https://i.redd.it/zvkba5hak4qd1.jpeg",
    "selftext": "I know social media is already a very toxic place but these comments make me think how low people can go just to hurt other people's feeling?\nThe news was about Animal fat mixed in Tirupati's Prasad. \nBut this 1st guy decided, let's mock and hurt feelings of 1 community altogether even though it doesn't benefit him or his community in anyway. Why did he decide to just spew this venom? Where is the root cause?\n2nd guy went one step further and directly wished for death of children and how much he would love to see children dying. \nI am sure if any children would actually die infront of him than he wouldn't feel happy. But just for the sake of hurting 1st person's felling, he stoop so low and wished for death of hundreds of children. How did people become so mindless and toxic that they stopped thinking what they are actually saying?\n\nIt's really sad to see our country going through this and social media has only given people more option to say these things openly without being judged or punched in the face.",
    "flair": "Rant / Vent",
    "score": 9,
    "num_comments": 16,
    "created_utc": 1726908063.0,
    "convurl": "https://i.redd.it/zvkba5hak4qd1.jpeg",
    "comments": [
        "Modiji net wapas mehenga karwa do please 🙏",
        "Modi hai to mumkin hai /s",
        "They are literally 13 year old kids...",
        "I mean, we have been slaughtering each other for centuries now. For e.g., partition was quite a bloody affair.",
        "Jio ka revolution 😜",
        "When people have freedom and money they are not so mean. When you are poor and feel powerless, you naturally become more cruel and mean.\n\nEarly 2000s were golden time for India. All the economic reforms and foreign investment injected a crap ton of money into Indian economy. 2 and half decades later, all of that money is slowly sucked up by the rich. Everyone is starting to get miserable and taking it out on each other. Hindus vs Muslims. North Indians vs South Indians. Mainland India vs East Indians. \n\nThis shit is slowly starting to happen in America too. There is a noticeable difference in people's attitude since Inflation started raising.",
        "Since Voldemort.... 2014 independence day.",
        "Palpatine? The emperor?",
        "everyone has a victim complex and hates others",
        "sala net free hone har koi 2 kodi ka banda samjhta hai uski kuchh importace hai duniya me \n\nits not indians vs indians \n\nit is indian vs humidity.......",
        "Sorry but i think you are just ignorant if you thought that hindu vs muslims hate started recently. It was always here throughout the history, its just now becoming too obvious because of internet. Everyone who says specific person is responsible for this hate towards these two religion currently are just dumb or doing propaganda for politics🙄",
        "I mean, I know the social fabric is really bad right now, but you're looking at the 2000s with rose-tinted lenses. They were no golden period for India. Literacy rate was around 50%, female infanticide was at its peak, gender ratio at birth was the lowest it has ever been, bomb blasts were common, and so were communal riots.\n\nWe _feel_ more miserable now simply because we're getting exposed to the lowest common denominator on the internet. We used to be just more sheltered back then, if you weren't a bigot, most likely no one in your close circles was.\n\nThe internet has made it so that you can chance upon even your rickshawalla's politcal leanings. Something you wouldn't have cared about earlier.",
        "Imagine living with so much of hate.. iske baad bhi neend aa jaati h toh yaa toh insaaniyat bachi ni h ya thi ni kyuki usko maarna itna aasan toh ho ni skta.. dank joke h toh bht khrb h"
    ],
    "cleaned_text": "indians start hating much know social media already toxic place comments make think low people go hurt peoples feeling news animal fat mixed tirupatis prasad st guy decided lets mock hurt feelings community altogether even though doesnt benefit community anyway decide spew venom root cause nd guy went one step directly wished death children much would love see children dying sure children would actually die infront wouldnt feel happy sake hurting st persons felling stoop low wished death hundreds children people become mindless toxic stopped thinking actually saying really sad see country going social media given people option say things openly without judged punched face ",
    "cleaned_title": "indians start hating much",
    "cleaned_selftext": "know social media already toxic place comments make think low people go hurt peoples feeling news animal fat mixed tirupatis prasad st guy decided lets mock hurt feelings community altogether even though doesnt benefit community anyway decide spew venom root cause nd guy went one step directly wished death children much would love see children dying sure children would actually die infront wouldnt feel happy sake hurting st persons felling stoop low wished death hundreds children people become mindless toxic stopped thinking actually saying really sad see country going social media given people option say things openly without judged punched face",
    "cleaned_comments": "modiji net wapas mehenga karwa please modi hai mumkin hai literally year old kids mean slaughtering centuries eg partition quite bloody affair jio ka revolution people freedom money mean poor feel powerless naturally become cruel mean early golden time india economic reforms foreign investment injected crap ton money indian economy half decades later money slowly sucked rich everyone starting get miserable taking hindus vs muslims north indians vs south indians mainland india vs east indians shit slowly starting happen america noticeable difference peoples attitude since inflation started raising since voldemort independence day palpatine emperor everyone victim complex hates others sala net free hone har koi kodi ka banda samjhta hai uski kuchh importace hai duniya indians vs indians indian vs humidity sorry think ignorant thought hindu vs muslims hate started recently always throughout history becoming obvious internet everyone says specific person responsible hate towards two religion currently dumb propaganda politics mean know social fabric really bad right youre looking rosetinted lenses golden period india literacy rate around female infanticide peak gender ratio birth lowest ever bomb blasts common communal riots feel miserable simply getting exposed lowest common denominator internet used sheltered back werent bigot likely one close circles internet made chance upon even rickshawallas politcal leanings something wouldnt cared earlier imagine living much hate iske baad bhi neend aa jaati h toh yaa toh insaaniyat bachi ni h ya thi ni kyuki usko maarna itna aasan toh ho ni skta dank joke h toh bht khrb h",
    "light_cleaned_title": "When did Indians start hating each other this much?",
    "light_cleaned_selftext": "I know social media is already a very toxic place but these comments make me think how low people can go just to hurt other people's feeling? The news was about Animal fat mixed in Tirupati's Prasad. But this 1st guy decided, let's mock and hurt feelings of 1 community altogether even though it doesn't benefit him or his community in anyway. Why did he decide to just spew this venom? Where is the root cause? 2nd guy went one step further and directly wished for death of children and how much he would love to see children dying. I am sure if any children would actually die infront of him than he wouldn't feel happy. But just for the sake of hurting 1st person's felling, he stoop so low and wished for death of hundreds of children. How did people become so mindless and toxic that they stopped thinking what they are actually saying? It's really sad to see our country going through this and social media has only given people more option to say these things openly without being judged or punched in the face.",
    "light_cleaned_comments": "Modiji net wapas mehenga karwa do please 🙏 Modi hai to mumkin hai /s They are literally 13 year old kids... I mean, we have been slaughtering each other for centuries now. For e.g., partition was quite a bloody affair. Jio ka revolution 😜 When people have freedom and money they are not so mean. When you are poor and feel powerless, you naturally become more cruel and mean. Early 2000s were golden time for India. All the economic reforms and foreign investment injected a crap ton of money into Indian economy. 2 and half decades later, all of that money is slowly sucked up by the rich. Everyone is starting to get miserable and taking it out on each other. Hindus vs Muslims. North Indians vs South Indians. Mainland India vs East Indians. This shit is slowly starting to happen in America too. There is a noticeable difference in people's attitude since Inflation started raising. Since Voldemort.... 2014 independence day. Palpatine? The emperor? everyone has a victim complex and hates others sala net free hone har koi 2 kodi ka banda samjhta hai uski kuchh importace hai duniya me its not indians vs indians it is indian vs humidity....... Sorry but i think you are just ignorant if you thought that hindu vs muslims hate started recently. It was always here throughout the history, its just now becoming too obvious because of internet. Everyone who says specific person is responsible for this hate towards these two religion currently are just dumb or doing propaganda for politics🙄 I mean, I know the social fabric is really bad right now, but you're looking at the 2000s with rose-tinted lenses. They were no golden period for India. Literacy rate was around 50%, female infanticide was at its peak, gender ratio at birth was the lowest it has ever been, bomb blasts were common, and so were communal riots. We _feel_ more miserable now simply because we're getting exposed to the lowest common denominator on the internet. We used to be just more sheltered back then, if you weren't a bigot, most likely no one in your close circles was. The internet has made it so that you can chance upon even your rickshawalla's politcal leanings. Something you wouldn't have cared about earlier. Imagine living with so much of hate.. iske baad bhi neend aa jaati h toh yaa toh insaaniyat bachi ni h ya thi ni kyuki usko maarna itna aasan toh ho ni skta.. dank joke h toh bht khrb h"
}