{
    "id": "15jncyl",
    "title": "Question about bathroom commode",
    "url": "https://www.reddit.com/r/india/comments/15jncyl/question_about_bathroom_commode/",
    "selftext": "Constructing a house and Commodes have to be installed. I liked rectangular commode but I don't know if it will be comfortable for sitting, mainly for my parents. The shape will be like this : [https://imgur.com/a/AnaawCH](https://imgur.com/a/AnaawCH). Those who had this rectangular shaped commode, Is it comfortable or should I go for regular oval or round shaped one ? ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691321449.0,
    "convurl": "https://external-preview.redd.it/wS2_aXHA1jLN6745PPEeO1zQiUMF3oHmhG7GSN8qa_0.jpg?auto=webp&s=1d5ee148c01bc09bd89a6548e5c338dc6eb68d70",
    "comments": [
        "OP, I used to work in this industry. Square WCs are no problem. Go ahead. Dm me more for details if needed",
        "In my experience, all the shapes are fine. We have an oval one and square one at home.",
        "Square isn't uncomfortable right ?",
        "Not uncomfortable for me. Comfort for me is more on the WC size (length) rather than shape. \n\nI personally prefer the oval one at home, mainly because it is larger and not because of the shape. But have used larger square/rectangular ones in the past without issues.",
        "More than the shape, focus on the size to allow legs to stretch properly.\n\nAnd length. Especially length.\n\nI hate the modern tiny ones where your you know what just lies on the front part of the commode."
    ],
    "cleaned_text": "question bathroom commode constructing house commodes installed liked rectangular commode dont know comfortable sitting mainly parents shape like httpsimgurcomaanaawchhttpsimgurcomaanaawch rectangular shaped commode comfortable go regular oval round shaped one ",
    "cleaned_title": "question bathroom commode",
    "cleaned_selftext": "constructing house commodes installed liked rectangular commode dont know comfortable sitting mainly parents shape like httpsimgurcomaanaawchhttpsimgurcomaanaawch rectangular shaped commode comfortable go regular oval round shaped one",
    "cleaned_comments": "op used work industry square wcs problem go ahead dm details needed experience shapes fine oval one square one home square isnt uncomfortable right uncomfortable comfort wc size length rather shape personally prefer oval one home mainly larger shape used larger squarerectangular ones past without issues shape focus size allow legs stretch properly length especially length hate modern tiny ones know lies front part commode",
    "light_cleaned_title": "Question about bathroom commode",
    "light_cleaned_selftext": "Constructing a house and Commodes have to be installed. I liked rectangular commode but I don't know if it will be comfortable for sitting, mainly for my parents. The shape will be like this : [https://imgur.com/a/AnaawCH](https://imgur.com/a/AnaawCH). Those who had this rectangular shaped commode, Is it comfortable or should I go for regular oval or round shaped one ?",
    "light_cleaned_comments": "OP, I used to work in this industry. Square WCs are no problem. Go ahead. Dm me more for details if needed In my experience, all the shapes are fine. We have an oval one and square one at home. Square isn't uncomfortable right ? Not uncomfortable for me. Comfort for me is more on the WC size (length) rather than shape. I personally prefer the oval one at home, mainly because it is larger and not because of the shape. But have used larger square/rectangular ones in the past without issues. More than the shape, focus on the size to allow legs to stretch properly. And length. Especially length. I hate the modern tiny ones where your you know what just lies on the front part of the commode."
}