{
    "id": "15cn8jg",
    "title": "Netflix Househokds started in India! This sucks",
    "url": "https://i.redd.it/z9rc1lkhaveb1.png",
    "selftext": "What do I press?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690620425.0,
    "convurl": "https://i.redd.it/z9rc1lkhaveb1.png",
    "comments": [
        "Got the same today. Aint subscribing.",
        "We have 1 netflix account with 4 profiles and these are used by only 4 of us. Will such arrangements be discontinued? Because mine is still working.",
        "Are you using same IP? Same router/same/house? If not then it will charge extra",
        "No. We are in different countries lol",
        "cant really blame them. if you think this in a business point of view, its fair.",
        "What countries are you in?\n\nIs one of the countries allowing sharing (Netflix)",
        "Sweden, UAE, India, India.\n\nNot sure if Sweden and UAE allow sharing.",
        "STREMIO",
        "https://preview.redd.it/qb79h8p1oveb1.jpeg?width=679&format=pjpg&auto=webp&s=010ce1fdef96c2ae804ba0167c530df84ddba7ff",
        "my case is a bit weird. two floors. two different internet connections. same family. same account. haven't gotten the message yet but i have been wondering since the original announcement what to do. extending wired network is going to be too much work and wireless would provide horrible speeds. stupidity all around.",
        "So weird, how does Netflix expect the 4 screens to be in the same wifi network!",
        "UAE has started limiting shared accounts. Those with DU started first, Etisalat soon.",
        "I have no idea since I'm in India. Thanks for the info.",
        "Same here! Each floor has a router."
    ],
    "cleaned_text": "netflix househokds started india sucks press ",
    "cleaned_title": "netflix househokds started india sucks",
    "cleaned_selftext": "press",
    "cleaned_comments": "got today aint subscribing netflix account profiles used us arrangements discontinued mine still working using ip routersamehouse charge extra different countries lol cant really blame think business point view fair countries one countries allowing sharing netflix sweden uae india india sure sweden uae allow sharing stremio case bit weird two floors two different internet connections family account havent gotten message yet wondering since original announcement extending wired network going much work wireless would provide horrible speeds stupidity around weird netflix expect screens wifi network uae started limiting shared accounts du started first etisalat soon idea since im india thanks info floor router",
    "light_cleaned_title": "Netflix Househokds started in India! This sucks",
    "light_cleaned_selftext": "What do I press?",
    "light_cleaned_comments": "Got the same today. Aint subscribing. We have 1 netflix account with 4 profiles and these are used by only 4 of us. Will such arrangements be discontinued? Because mine is still working. Are you using same IP? Same router/same/house? If not then it will charge extra No. We are in different countries lol cant really blame them. if you think this in a business point of view, its fair. What countries are you in? Is one of the countries allowing sharing (Netflix) Sweden, UAE, India, India. Not sure if Sweden and UAE allow sharing. STREMIO my case is a bit weird. two floors. two different internet connections. same family. same account. haven't gotten the message yet but i have been wondering since the original announcement what to do. extending wired network is going to be too much work and wireless would provide horrible speeds. stupidity all around. So weird, how does Netflix expect the 4 screens to be in the same wifi network! UAE has started limiting shared accounts. Those with DU started first, Etisalat soon. I have no idea since I'm in India. Thanks for the info. Same here! Each floor has a router."
}