{
    "id": "1dkyjx8",
    "title": "Almost got scammed.",
    "url": "https://i.redd.it/s1t6m0pnrv7d1.png",
    "selftext": "The Guy said ''pehchana kon?\". I'm not good at talking to people at the phone, I am not really good at recognising voices over phone and many of my friends calls me like this but it was a first that he asked about money transfer.\n\nHe said his bank isn't taking online payment and need my help to by recieving 15k and pay 10k to someone else than meet him to give him 5k cash.\n\nI knew at that point that this isn't who I thought he was so decided to play along. Guy sent me a Money Credited msg from his own no. not from the bank. Than gave another no. to whome I had pay 10k to.\n\nHe was like \"yeah, iss number pr bhej do\" (none of us friends uses 'aap' 'kr do' ect, we're respectful and disrespectful at the same time with eachother). I said yeah I'll and acted paniced that I didn't recieved the money (had 50rs in acc), he paniced more than I did and than cut the call.\n\nI didn't get scammed but it was close given my specefic personal circumstances?\nWhatever, I don't have a call recording but I do wanna report it online if you know how can I do that pls let me know and be aware and safe.",
    "flair": "Crime",
    "score": 22,
    "num_comments": 3,
    "created_utc": 1718956321.0,
    "convurl": "https://i.redd.it/s1t6m0pnrv7d1.png",
    "comments": [
        "Funny how the account number is all XXXXXXXXX since the scammer only has your phone number but not the last 4 digits of your Account Number.",
        "You should have sent the same message for debit from your phone number. 😆",
        "Lmao yes🤣"
    ],
    "cleaned_text": "almost got scammed guy said pehchana kon im good talking people phone really good recognising voices phone many friends calls like first asked money transfer said bank isnt taking online payment need help recieving k pay k someone else meet give k cash knew point isnt thought decided play along guy sent money credited msg bank gave another whome pay k like yeah iss number pr bhej none us friends uses aap kr ect respectful disrespectful time eachother said yeah ill acted paniced didnt recieved money rs acc paniced cut call didnt get scammed close given specefic personal circumstances whatever dont call recording wan na report online know pls let know aware safe ",
    "cleaned_title": "almost got scammed",
    "cleaned_selftext": "guy said pehchana kon im good talking people phone really good recognising voices phone many friends calls like first asked money transfer said bank isnt taking online payment need help recieving k pay k someone else meet give k cash knew point isnt thought decided play along guy sent money credited msg bank gave another whome pay k like yeah iss number pr bhej none us friends uses aap kr ect respectful disrespectful time eachother said yeah ill acted paniced didnt recieved money rs acc paniced cut call didnt get scammed close given specefic personal circumstances whatever dont call recording wan na report online know pls let know aware safe",
    "cleaned_comments": "funny account number xxxxxxxxx since scammer phone number last digits account number sent message debit phone number lmao yes",
    "light_cleaned_title": "Almost got scammed.",
    "light_cleaned_selftext": "The Guy said ''pehchana kon?\". I'm not good at talking to people at the phone, I am not really good at recognising voices over phone and many of my friends calls me like this but it was a first that he asked about money transfer. He said his bank isn't taking online payment and need my help to by recieving 15k and pay 10k to someone else than meet him to give him 5k cash. I knew at that point that this isn't who I thought he was so decided to play along. Guy sent me a Money Credited msg from his own no. not from the bank. Than gave another no. to whome I had pay 10k to. He was like \"yeah, iss number pr bhej do\" (none of us friends uses 'aap' 'kr do' ect, we're respectful and disrespectful at the same time with eachother). I said yeah I'll and acted paniced that I didn't recieved the money (had 50rs in acc), he paniced more than I did and than cut the call. I didn't get scammed but it was close given my specefic personal circumstances? Whatever, I don't have a call recording but I do wanna report it online if you know how can I do that pls let me know and be aware and safe.",
    "light_cleaned_comments": "Funny how the account number is all XXXXXXXXX since the scammer only has your phone number but not the last 4 digits of your Account Number. You should have sent the same message for debit from your phone number. 😆 Lmao yes🤣"
}