{
    "id": "k91akz",
    "title": "Comments on the Draft Social Security Rules to safeguard worker's rights #SaveOurPrivacy",
    "url": "https://www.reddit.com/r/india/comments/k91akz/comments_on_the_draft_social_security_rules_to/",
    "selftext": "https://preview.redd.it/2b03sbg0nx361.png?width=1600&amp;format=png&amp;auto=webp&amp;s=1fa2bb925e62c4d28b3ad6c95b3f1db86fd38931\n\n## Tl;dr\n\nThe Draft Code on Social Security (Central) Rules 2020, following the Code on Social Security, 2020, makes Aadhaar based registration mandatory for receving benefits. This may contradict a Supreme Court judgement that allowed mandating Aadhaar linkage only in the case of  a service or benefit provided at the cost of the Consolidated Fund of India. A Standing Committee report on the Code on Social Security had already asked the Ministry of Labour to harmonise the provisions of the Code with the Supreme Court's judgement. Additionally, existing criticisms of Aadhaar based authentication for welfare delivery systems remain unaddressed. Lastly, databases containing the data of workers must have adequate security safeguards.\n\n## What do the Draft Rules say?\n\nArticle 142 of the Code on Social Security, 2020 states that employees or unorganised workers must, to register as beneficiaries for social security benefits or avail other social security services, \"establish his identity or, as the case may be, the identity of his family members or dependants through Aadhaar number\". In line with this, the Draft Code on Social Security (Central) Rules, 2020 specify Aadhaar linkage for the receipt of payments or other benefits under the Code. The table below details the instances where a worker may be asked to provide their Aadhar.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pd9s0w14nx361.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0a614b444093f0da962ed090ea5dbaa206d62640\n\n## What does the Puttaswamy Judgement specify?\n\nIn *Justice K. S. Puttaswamy (Retd.) and Anr. vs Union Of India And Ors*, the Supreme Court, while upholding the constitutionality of Aadhaar, affirmed the Right to Privacy and noted that Aadhaar can constitutionally be linked only for benefits funded by the Consolidated Fund of India.\n\nGiven that social security benefits such as insurance, provident fund contributions and gratuity accrue at the cost of the employer, mandating Aadhaar for the receipt of the same may contravene the judgement. The Employees' Provident Fund Organisation has even passed an order removing penalties for employees who had not completed Aadhar based registration.\n\nFurther, the Parliamentary Standing Committee on Labour has also flagged this in its report on the Code on Social Security, 2019 where it notes the budgetary outlay from the consolidated fund of india is not clearly earmarked. The Committee asked the Ministry to reconsider mandatory Aadhaar linkage in light of the Supreme Court judgement, pointing out that Aadhaar may be mandated only for benefits provided from the Consolidated Fund of India.\n\n## Existing state of Aadhaar based verification\n\nAadhaar based verification may present an additional hurdle to accessing benefits for social security, as this system has already been criticised in other contexts. Technology failures plague the authentication system, and have already led to serious issues of exclusion from welfare benefits. The CEO of UIDAI had noted  that in 2018 authentication failure for government services was as high as 12%. Furthermore, as of March 3rd, 2020, only 60% of the total allocated grains per month have been distributed on the basis of biometric verification of Aadhaar.\n\nThe efficacy of Aadhaar based registration for schemes has been studied in various contexts. [**One study in Jharkhand**](https://econweb.ucsd.edu/~kamurali/papers/Working%20Papers/ABBA%20(NBER%20WP%2026744).pdf) found that Aadhaar based authentication “either did not reduce errors of inclusion or leakage or did so at the cost of increased exclusion error”. Another [**study for Aadhaar based verification in PDS shops**](https://journals.sagepub.com/doi/10.1177/0973703017748384) found that the system is “rife with technical issues such as incomplete seeding of cardholder information, biometric failure and administrative gaps such as inadequate failure reporting and back-up systems”.\n\nLastly, a[ **study sampling Aadhaar based authentication in diverse settings**](https://www.epw.in/journal/2017/50/special-articles/impact-aadhaar-welfare-programmes.html) such as PDS distribution, NREGA work, LPG subsidies, midday meals, and the National Social Assistance Programme found that \"Available evidence does not substantiate any signifi cant gains from Aadhaar-integration in welfare programmes. On the contrary, it has inflicted considerable pain. Apart from (supposedly) one-time costs of enrolment and Aadhaar-seeding, people are now faced with higher transaction costs on a monthly basis (in pensions and the PDS for instance), and in a significant minority of cases, also face exclusion and denial. Even when it works, people suffer from considerable indignities\".\n\nThus, considering the Supreme Court judgement as well as the negative externalities of using Aadhaar based verification, we recommend that Aadhaar linkage not be mandated for the receipt of social security benefits. Instead, a social security card may be provided to workers to help with registration and service delivery. Furthermore, verification through Aadhaar should be made truly consensual, and verification should be allowed through multiple government IDs such\n\n## Databasing of Workers\n\nDatabases such as the Shram Suvidha portal help employers with labour law compliance. The Draft Rules mention the use of the Shram Suvidha portal (or any other portal that may be specified) for registering workers as beneficiaries. While such a database does indeed both help facilitate compliance and allow the government to monitor labour law implementation, provisions must be made to ensure that the data of workers is secured, especially since registration may involve the provision of personal data. Such data may also be used by employers for workers surveillance. Given that a comprehensive legislation regarding data protection, such as the Personal Data Protection Bill, 2020 or the Personal Data and Information Privacy Code 2020, is yet to be passed, we recommend that a provision be included that specifies that that adequate measures must be taken, as provided by the relevant authority, by both public and private compliance portals and employee databases to ensure the security of data.\n\n### Important Documents\n\n1. Code on Social Security, 2020 ([**link**](https://labour.gov.in/sites/default/files/SS_Code_Gazette.pdf))\n2. Draft Code on Social Security (Central) Rules, 2020 ([**link**](https://labour.gov.in/sites/default/files/DRAFTCOSSRULES2020NOV.pdf))\n3. IFF's comments on the Draft Rules (&lt;add link&gt;)\n4. Standing Committee on Labour, Ninth Report: The Code on Social Security ([**link**](http://164.100.47.193/lsscommittee/Labour/17_Labour_9.pdf))\n5. *The Personal Data Protection Bill, 2019* as introduced by the Minister for Electronics and Information Technology, Mr. Ravi Shankar Prasad ([**link**](https://www.prsindia.org/sites/default/files/bill_files/Personal%20Data%20Protection%20Bill%2C%202019.pdf))\n6. *The* *Personal Data and Information Privacy Code Bill, 2019* as introduced as a private members bill by Mr. D. Ravikumar, Member of Parliament ([**link**](https://drive.google.com/file/d/1DReq96e-FLsSoKUvK94_-VCtu2Y1PE97/view))",
    "flair": "Policy/Economy",
    "score": 23,
    "num_comments": 2,
    "created_utc": 1607419931,
    "convurl": "https://b.thumbs.redditmedia.com/Z3W_vq07OIvoNSh5hkVL-WpP9mHshlK7lakU6Pipy1c.jpg",
    "comments": [
        "&gt;  One study in Jharkhand.pdf)\n\nGood overview.\nThere's a typo in your link. It should be https://econweb.ucsd.edu/~kamurali/papers/Working%20Papers/ABBA%20(NBER%20WP%2026744).pdf",
        "Thank you for the correction!"
    ],
    "cleaned_text": "comments draft social security rules safeguard workers rights saveourprivacy tldr draft code social security central rules following code social security makes aadhaar based registration mandatory receving benefits may contradict supreme court judgement allowed mandating aadhaar linkage case service benefit provided cost consolidated fund india standing committee report code social security already asked ministry labour harmonise provisions code supreme courts judgement additionally existing criticisms aadhaar based authentication welfare delivery systems remain unaddressed lastly databases containing data workers must adequate security safeguards draft rules say article code social security states employees unorganised workers must register beneficiaries social security benefits avail social security services establish identity case may identity family members dependants aadhaar number line draft code social security central rules specify aadhaar linkage receipt payments benefits code table details instances worker may asked provide aadhar ampxb puttaswamy judgement specify justice k puttaswamy retd anr vs union india ors supreme court upholding constitutionality aadhaar affirmed right privacy noted aadhaar constitutionally linked benefits funded consolidated fund india given social security benefits insurance provident fund contributions gratuity accrue cost employer mandating aadhaar receipt may contravene judgement employees provident fund organisation even passed order removing penalties employees completed aadhar based registration parliamentary standing committee labour also flagged report code social security notes budgetary outlay consolidated fund india clearly earmarked committee asked ministry reconsider mandatory aadhaar linkage light supreme court judgement pointing aadhaar may mandated benefits provided consolidated fund india existing state aadhaar based verification aadhaar based verification may present additional hurdle accessing benefits social security system already criticised contexts technology failures plague authentication system already led serious issues exclusion welfare benefits ceo uidai noted authentication failure government services high furthermore march rd total allocated grains per month distributed basis biometric verification aadhaar efficacy aadhaar based registration schemes studied various contexts one study jharkhandhttpseconwebucsdedukamuralipapersworkingpapersabbanberwppdf found aadhaar based authentication either reduce errors inclusion leakage cost increased exclusion error another study aadhaar based verification pds shopshttpsjournalssagepubcomdoi found system rife technical issues incomplete seeding cardholder information biometric failure administrative gaps inadequate failure reporting backup systems lastly study sampling aadhaar based authentication diverse settingshttpswwwepwinjournalspecialarticlesimpactaadhaarwelfareprogrammeshtml pds distribution nrega work lpg subsidies midday meals national social assistance programme found available evidence substantiate signifi cant gains aadhaarintegration welfare programmes contrary inflicted considerable pain apart supposedly onetime costs enrolment aadhaarseeding people faced higher transaction costs monthly basis pensions pds instance significant minority cases also face exclusion denial even works people suffer considerable indignities thus considering supreme court judgement well negative externalities using aadhaar based verification recommend aadhaar linkage mandated receipt social security benefits instead social security card may provided workers help registration service delivery furthermore verification aadhaar made truly consensual verification allowed multiple government ids databasing workers databases shram suvidha portal help employers labour law compliance draft rules mention use shram suvidha portal portal may specified registering workers beneficiaries database indeed help facilitate compliance allow government monitor labour law implementation provisions must made ensure data workers secured especially since registration may involve provision personal data data may also used employers workers surveillance given comprehensive legislation regarding data protection personal data protection bill personal data information privacy code yet passed recommend provision included specifies adequate measures must taken provided relevant authority public private compliance portals employee databases ensure security data important documents code social security linkhttpslabourgovinsitesdefaultfilessscodegazettepdf draft code social security central rules linkhttpslabourgovinsitesdefaultfilesdraftcossrulesnovpdf iffs comments draft rules ltadd linkgt standing committee labour ninth report code social security linkhttplsscommitteelabourlabourpdf personal data protection bill introduced minister electronics information technology mr ravi shankar prasad linkhttpswwwprsindiaorgsitesdefaultfilesbillfilespersonaldataprotectionbillcpdf personal data information privacy code bill introduced private members bill mr ravikumar member parliament linkhttpsdrivegooglecomfileddreqeflssokuvkvctuypeview ",
    "cleaned_title": "comments draft social security rules safeguard workers rights saveourprivacy",
    "cleaned_selftext": "tldr draft code social security central rules following code social security makes aadhaar based registration mandatory receving benefits may contradict supreme court judgement allowed mandating aadhaar linkage case service benefit provided cost consolidated fund india standing committee report code social security already asked ministry labour harmonise provisions code supreme courts judgement additionally existing criticisms aadhaar based authentication welfare delivery systems remain unaddressed lastly databases containing data workers must adequate security safeguards draft rules say article code social security states employees unorganised workers must register beneficiaries social security benefits avail social security services establish identity case may identity family members dependants aadhaar number line draft code social security central rules specify aadhaar linkage receipt payments benefits code table details instances worker may asked provide aadhar ampxb puttaswamy judgement specify justice k puttaswamy retd anr vs union india ors supreme court upholding constitutionality aadhaar affirmed right privacy noted aadhaar constitutionally linked benefits funded consolidated fund india given social security benefits insurance provident fund contributions gratuity accrue cost employer mandating aadhaar receipt may contravene judgement employees provident fund organisation even passed order removing penalties employees completed aadhar based registration parliamentary standing committee labour also flagged report code social security notes budgetary outlay consolidated fund india clearly earmarked committee asked ministry reconsider mandatory aadhaar linkage light supreme court judgement pointing aadhaar may mandated benefits provided consolidated fund india existing state aadhaar based verification aadhaar based verification may present additional hurdle accessing benefits social security system already criticised contexts technology failures plague authentication system already led serious issues exclusion welfare benefits ceo uidai noted authentication failure government services high furthermore march rd total allocated grains per month distributed basis biometric verification aadhaar efficacy aadhaar based registration schemes studied various contexts one study jharkhandhttpseconwebucsdedukamuralipapersworkingpapersabbanberwppdf found aadhaar based authentication either reduce errors inclusion leakage cost increased exclusion error another study aadhaar based verification pds shopshttpsjournalssagepubcomdoi found system rife technical issues incomplete seeding cardholder information biometric failure administrative gaps inadequate failure reporting backup systems lastly study sampling aadhaar based authentication diverse settingshttpswwwepwinjournalspecialarticlesimpactaadhaarwelfareprogrammeshtml pds distribution nrega work lpg subsidies midday meals national social assistance programme found available evidence substantiate signifi cant gains aadhaarintegration welfare programmes contrary inflicted considerable pain apart supposedly onetime costs enrolment aadhaarseeding people faced higher transaction costs monthly basis pensions pds instance significant minority cases also face exclusion denial even works people suffer considerable indignities thus considering supreme court judgement well negative externalities using aadhaar based verification recommend aadhaar linkage mandated receipt social security benefits instead social security card may provided workers help registration service delivery furthermore verification aadhaar made truly consensual verification allowed multiple government ids databasing workers databases shram suvidha portal help employers labour law compliance draft rules mention use shram suvidha portal portal may specified registering workers beneficiaries database indeed help facilitate compliance allow government monitor labour law implementation provisions must made ensure data workers secured especially since registration may involve provision personal data data may also used employers workers surveillance given comprehensive legislation regarding data protection personal data protection bill personal data information privacy code yet passed recommend provision included specifies adequate measures must taken provided relevant authority public private compliance portals employee databases ensure security data important documents code social security linkhttpslabourgovinsitesdefaultfilessscodegazettepdf draft code social security central rules linkhttpslabourgovinsitesdefaultfilesdraftcossrulesnovpdf iffs comments draft rules ltadd linkgt standing committee labour ninth report code social security linkhttplsscommitteelabourlabourpdf personal data protection bill introduced minister electronics information technology mr ravi shankar prasad linkhttpswwwprsindiaorgsitesdefaultfilesbillfilespersonaldataprotectionbillcpdf personal data information privacy code bill introduced private members bill mr ravikumar member parliament linkhttpsdrivegooglecomfileddreqeflssokuvkvctuypeview",
    "cleaned_comments": "gt one study jharkhandpdf good overview theres typo link thank correction",
    "light_cleaned_title": "Comments on the Draft Social Security Rules to safeguard worker's rights #SaveOurPrivacy",
    "light_cleaned_selftext": "## Tl;dr The Draft Code on Social Security (Central) Rules 2020, following the Code on Social Security, 2020, makes Aadhaar based registration mandatory for receving benefits. This may contradict a Supreme Court judgement that allowed mandating Aadhaar linkage only in the case of a service or benefit provided at the cost of the Consolidated Fund of India. A Standing Committee report on the Code on Social Security had already asked the Ministry of Labour to harmonise the provisions of the Code with the Supreme Court's judgement. Additionally, existing criticisms of Aadhaar based authentication for welfare delivery systems remain unaddressed. Lastly, databases containing the data of workers must have adequate security safeguards. ## What do the Draft Rules say? Article 142 of the Code on Social Security, 2020 states that employees or unorganised workers must, to register as beneficiaries for social security benefits or avail other social security services, \"establish his identity or, as the case may be, the identity of his family members or dependants through Aadhaar number\". In line with this, the Draft Code on Social Security (Central) Rules, 2020 specify Aadhaar linkage for the receipt of payments or other benefits under the Code. The table below details the instances where a worker may be asked to provide their Aadhar.  ## What does the Puttaswamy Judgement specify? In *Justice K. S. Puttaswamy (Retd.) and Anr. vs Union Of India And Ors*, the Supreme Court, while upholding the constitutionality of Aadhaar, affirmed the Right to Privacy and noted that Aadhaar can constitutionally be linked only for benefits funded by the Consolidated Fund of India. Given that social security benefits such as insurance, provident fund contributions and gratuity accrue at the cost of the employer, mandating Aadhaar for the receipt of the same may contravene the judgement. The Employees' Provident Fund Organisation has even passed an order removing penalties for employees who had not completed Aadhar based registration. Further, the Parliamentary Standing Committee on Labour has also flagged this in its report on the Code on Social Security, 2019 where it notes the budgetary outlay from the consolidated fund of india is not clearly earmarked. The Committee asked the Ministry to reconsider mandatory Aadhaar linkage in light of the Supreme Court judgement, pointing out that Aadhaar may be mandated only for benefits provided from the Consolidated Fund of India. ## Existing state of Aadhaar based verification Aadhaar based verification may present an additional hurdle to accessing benefits for social security, as this system has already been criticised in other contexts. Technology failures plague the authentication system, and have already led to serious issues of exclusion from welfare benefits. The CEO of UIDAI had noted that in 2018 authentication failure for government services was as high as 12%. Furthermore, as of March 3rd, 2020, only 60% of the total allocated grains per month have been distributed on the basis of biometric verification of Aadhaar. The efficacy of Aadhaar based registration for schemes has been studied in various contexts. [**One study in Jharkhand**](https://econweb.ucsd.edu/~kamurali/papers/Working%20Papers/ABBA%20(NBER%20WP%2026744).pdf) found that Aadhaar based authentication “either did not reduce errors of inclusion or leakage or did so at the cost of increased exclusion error”. Another [**study for Aadhaar based verification in PDS shops**](https://journals.sagepub.com/doi/10.1177/0973703017748384) found that the system is “rife with technical issues such as incomplete seeding of cardholder information, biometric failure and administrative gaps such as inadequate failure reporting and back-up systems”. Lastly, a[ **study sampling Aadhaar based authentication in diverse settings**](https://www.epw.in/journal/2017/50/special-articles/impact-aadhaar-welfare-programmes.html) such as PDS distribution, NREGA work, LPG subsidies, midday meals, and the National Social Assistance Programme found that \"Available evidence does not substantiate any signifi cant gains from Aadhaar-integration in welfare programmes. On the contrary, it has inflicted considerable pain. Apart from (supposedly) one-time costs of enrolment and Aadhaar-seeding, people are now faced with higher transaction costs on a monthly basis (in pensions and the PDS for instance), and in a significant minority of cases, also face exclusion and denial. Even when it works, people suffer from considerable indignities\". Thus, considering the Supreme Court judgement as well as the negative externalities of using Aadhaar based verification, we recommend that Aadhaar linkage not be mandated for the receipt of social security benefits. Instead, a social security card may be provided to workers to help with registration and service delivery. Furthermore, verification through Aadhaar should be made truly consensual, and verification should be allowed through multiple government IDs such ## Databasing of Workers Databases such as the Shram Suvidha portal help employers with labour law compliance. The Draft Rules mention the use of the Shram Suvidha portal (or any other portal that may be specified) for registering workers as beneficiaries. While such a database does indeed both help facilitate compliance and allow the government to monitor labour law implementation, provisions must be made to ensure that the data of workers is secured, especially since registration may involve the provision of personal data. Such data may also be used by employers for workers surveillance. Given that a comprehensive legislation regarding data protection, such as the Personal Data Protection Bill, 2020 or the Personal Data and Information Privacy Code 2020, is yet to be passed, we recommend that a provision be included that specifies that that adequate measures must be taken, as provided by the relevant authority, by both public and private compliance portals and employee databases to ensure the security of data. ### Important Documents 1. Code on Social Security, 2020 ([**link**](https://labour.gov.in/sites/default/files/SS_Code_Gazette.pdf)) 2. Draft Code on Social Security (Central) Rules, 2020 ([**link**](https://labour.gov.in/sites/default/files/DRAFTCOSSRULES2020NOV.pdf)) 3. IFF's comments on the Draft Rules (&lt;add link&gt;) 4. Standing Committee on Labour, Ninth Report: The Code on Social Security ([**link**](http://164.100.47.193/lsscommittee/Labour/17_Labour_9.pdf)) 5. *The Personal Data Protection Bill, 2019* as introduced by the Minister for Electronics and Information Technology, Mr. Ravi Shankar Prasad ([**link**](https://www.prsindia.org/sites/default/files/bill_files/Personal%20Data%20Protection%20Bill%2C%202019.pdf)) 6. *The* *Personal Data and Information Privacy Code Bill, 2019* as introduced as a private members bill by Mr. D. Ravikumar, Member of Parliament ([**link**](https://drive.google.com/file/d/1DReq96e-FLsSoKUvK94_-VCtu2Y1PE97/view))",
    "light_cleaned_comments": "&gt; One study in Jharkhand.pdf) Good overview. There's a typo in your link. It should be Thank you for the correction!"
}