{
    "id": "18hl79u",
    "title": "Uttarpradesh govt revokes ban on evening coaching for girls",
    "url": "https://www.reddit.com/r/india/comments/18hl79u/uttarpradesh_govt_revokes_ban_on_evening_coaching/",
    "selftext": "https://www.hindustantimes.com/cities/noida-news/up-govt-revokes-ban-on-late-evening-classes-for-girls-at-coaching-centres-101702402797366.html",
    "flair": "Policy/Economy",
    "score": 73,
    "num_comments": 8,
    "created_utc": 1702486333.0,
    "convurl": "https://external-preview.redd.it/AxaN1CdtgNNLyM7lqiNeqKcpIqdF8yUTI8h0nwc3Yo0.jpg?auto=webp&s=6d2b84b6c30a32b66896baf4a3face1954064375",
    "comments": [
        "Huge win for the activists who called out this law and got it revoked.",
        "Who put the ban in the first place? Taliban?",
        "Their ideological brethren!",
        "By confining girls to their homes, Uttar Pradesh cannot ensure their safety. Such a ban was unnecessary and unjustified.",
        "They going to take credit for this by saying that Fantaji made UP safe again so lifted the ban.",
        "Fantaji!!!\nI cannot unsee this. This is gold!"
    ],
    "cleaned_text": "uttarpradesh govt revokes ban evening coaching girls  ",
    "cleaned_title": "uttarpradesh govt revokes ban evening coaching girls",
    "cleaned_selftext": "",
    "cleaned_comments": "huge win activists called law got revoked put ban first place taliban ideological brethren confining girls homes uttar pradesh ensure safety ban unnecessary unjustified going take credit saying fantaji made safe lifted ban fantaji unsee gold",
    "light_cleaned_title": "Uttarpradesh govt revokes ban on evening coaching for girls",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Huge win for the activists who called out this law and got it revoked. Who put the ban in the first place? Taliban? Their ideological brethren! By confining girls to their homes, Uttar Pradesh cannot ensure their safety. Such a ban was unnecessary and unjustified. They going to take credit for this by saying that Fantaji made UP safe again so lifted the ban. Fantaji!!! I cannot unsee this. This is gold!"
}