{
    "id": "16809cb",
    "title": "Male kitten on the verge of being homeless in Pune (Up for adoption)",
    "url": "https://www.reddit.com/gallery/16809cb",
    "selftext": "\nA male kitten of 2 months is about to be homeless in Pune.\nIt was being taken care of by 2 college students but they cant afford it or have time for it.\nIt was found alone, shivering and crying for his mother in the rain.\nHe does not know how to survive on his own as he is too young.\nThis is a very urgent appeal to anyone who’s in Mumbai/Pune to foster/adopt him.\nHe’s a very playful and friendly with humans.\nPlease consider to adopt him and help out students in need who will be forced to leave him out in the streets soon.\nCat can be brought to anyone staying in Pune/Mumbai.\nPlease contact 7043782899 on whatsapp for more details and enquiries.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693654735.0,
    "convurl": "https://i.redd.it/zueugs92xtlb1.jpg",
    "comments": [
        "No, OP - please do not abandon the kitten on the street. Its survival instincts will probably not be sharp enough anymore if it has been raised by you until now. \n\nIf you cannot shelter the kitten until you find a foster home for it, give it up to an animal rescue organisation. There are plenty of these in Mumbai and Pune.",
        "Shelters normally do not take healthy cats. Please spread the word around to help us with leads",
        "I wish, I could have taken this one in myself.\n\nI hope, you find a nice home for him.",
        "threatening title..passive aggressive",
        "Just look at how contentedly the kitten is sleeping... It is impossible to not love them, especially if you have raised them since that young an age. So, I kinda understand OP's passive aggressive threat. I think, they only want the best for this kitten. And I so-o-o hope that someone steps up and welcomes the kitten into their family...",
        "for college students its hard to afford 100-150 rupees of food and then litter daily apart from taking care of it. The title was meant to grab attention since people skim over such posts, we meant no harm",
        "Try contacting animal rights NGOs  in Pune and Mumbai and ask them to post about the adoption appeal on their pages( Try Feline Foundation, Yoda Mumbai) \n\nPlease don’t abandon the kitten till you guys find a home(I hope that it happens soon) for it,OP-it’s too small to survive on its own",
        "Is the cat available?"
    ],
    "cleaned_text": "male kitten verge homeless pune adoption male kitten months homeless pune taken care college students cant afford time found alone shivering crying mother rain know survive young urgent appeal anyone whos mumbaipune fosteradopt hes playful friendly humans please consider adopt help students need forced leave streets soon cat brought anyone staying punemumbai please contact whatsapp details enquiries ",
    "cleaned_title": "male kitten verge homeless pune adoption",
    "cleaned_selftext": "male kitten months homeless pune taken care college students cant afford time found alone shivering crying mother rain know survive young urgent appeal anyone whos mumbaipune fosteradopt hes playful friendly humans please consider adopt help students need forced leave streets soon cat brought anyone staying punemumbai please contact whatsapp details enquiries",
    "cleaned_comments": "op please abandon kitten street survival instincts probably sharp enough anymore raised shelter kitten find foster home give animal rescue organisation plenty mumbai pune shelters normally take healthy cats please spread word around help us leads wish could taken one hope find nice home threatening titlepassive aggressive look contentedly kitten sleeping impossible love especially raised since young age kinda understand ops passive aggressive threat think want best kitten sooo hope someone steps welcomes kitten family college students hard afford rupees food litter daily apart taking care title meant grab attention since people skim posts meant harm try contacting animal rights ngos pune mumbai ask post adoption appeal pages try feline foundation yoda mumbai please dont abandon kitten till guys find homei hope happens soon itopits small survive cat available",
    "light_cleaned_title": "Male kitten on the verge of being homeless in Pune (Up for adoption)",
    "light_cleaned_selftext": "A male kitten of 2 months is about to be homeless in Pune. It was being taken care of by 2 college students but they cant afford it or have time for it. It was found alone, shivering and crying for his mother in the rain. He does not know how to survive on his own as he is too young. This is a very urgent appeal to anyone who’s in Mumbai/Pune to foster/adopt him. He’s a very playful and friendly with humans. Please consider to adopt him and help out students in need who will be forced to leave him out in the streets soon. Cat can be brought to anyone staying in Pune/Mumbai. Please contact 7043782899 on whatsapp for more details and enquiries.",
    "light_cleaned_comments": "No, OP - please do not abandon the kitten on the street. Its survival instincts will probably not be sharp enough anymore if it has been raised by you until now. If you cannot shelter the kitten until you find a foster home for it, give it up to an animal rescue organisation. There are plenty of these in Mumbai and Pune. Shelters normally do not take healthy cats. Please spread the word around to help us with leads I wish, I could have taken this one in myself. I hope, you find a nice home for him. threatening title..passive aggressive Just look at how contentedly the kitten is sleeping... It is impossible to not love them, especially if you have raised them since that young an age. So, I kinda understand OP's passive aggressive threat. I think, they only want the best for this kitten. And I so-o-o hope that someone steps up and welcomes the kitten into their family... for college students its hard to afford 100-150 rupees of food and then litter daily apart from taking care of it. The title was meant to grab attention since people skim over such posts, we meant no harm Try contacting animal rights NGOs in Pune and Mumbai and ask them to post about the adoption appeal on their pages( Try Feline Foundation, Yoda Mumbai) Please don’t abandon the kitten till you guys find a home(I hope that it happens soon) for it,OP-it’s too small to survive on its own Is the cat available?"
}