{
    "id": "u8bxhu",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/u8bxhu/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 23,
    "num_comments": 14,
    "created_utc": 1650504609,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "I am in my final year of BCOM, about to graduate in a month. I am from Mumbai. I have  no work experience aside from a volunteering gig where I also did some basic social media work for them. I am financially not required to do this, but is it better to take up any sales job that comes my way (sales is not an interest of mine) or do multiple internships and certificate courses for a year and then apply for PG?",
        "Skillset - Graphic Designing, Logo designs, Posters, Business Cards, T-shirt designs, getting into Ui/Ux as well\n\nPortfolio - Instagram @PrimeLogoZ / Behance - [PrimeLogoZ](https://www.behance.net/PrimeLogoZ)\n\nLocation : India\n\nContact - primedesigns3905@gmail.com / Instagram DMs, its easier : )",
        "My company is hiring for tech positions\n\n&gt;  Name of the company\n \nMorgan Stanley\n\n&gt;  Location\n\nMumbai and Bangalore\n\n&gt; Requirements\n\n2+ years of experience\n\nSDE(Java/.NET/Python/UI) or QA SDET position\n&gt; Preferred way of contacting you\n\nDM me email and your resume.",
        "Hiring for data scientists and data engineers with 1 to 3 years of experience . US based telecom product company, Bangalore location, Hybrid. Good DS work, close to 0 software integration or reporting/dashboarding.\n\nInterested candidates, please DM.",
        "Is there any company allowing 100% remote work for cloud or data engineer or devops or SRE skills ? I want to work from home in Punjab",
        "Hi, \n\nI'm seeking help on companies &amp; salaries involved in the 3d Art/Gaming/Vfx field &amp; have created a related thread at - [https://www.reddit.com/r/india/comments/u8eglt/career\\_please\\_help\\_an\\_aspiring\\_3d\\_artist\\_with/](https://www.reddit.com/r/india/comments/u8eglt/career_please_help_an_aspiring_3d_artist_with/)\n\nPosting it here as well with the hope that someone can give a few pointers.\n\nThanks for your time.",
        "I want to work in the education sector but I'm not interested in teaching. Do you guys have any suggestions for me? I've a B. Com degree but not really interested in the financial sector. I'm thinking of doing a distance masters course in a humanities subject.",
        "I am looking for a job in Bangalore, preferably product management. I have worked as a software developer for 2 years and finished my MBA last year from a tier 1 institute.",
        "Which instute for MBA?",
        "Let's give this a shot. My company is hiring front end devs, both at an SE level and SSE level.\n\nCompany name: Soroco\n\nRequirements:  \n   SE: 1-4 YOE in web front-end, with experience with a framework (angular ideal, react/vue/svelte acceptable).  \n   SSE: 4-8 YOE in the same stuff as above. Angular experience heavily favoured.  \n\nLocation: company is in bangalore but we've been remote this entire time and I don't think RTA is going to happen. \n\n\nPM me your resume or any questions you have. I don't use reddit chat (is that still a thing?).",
        "\\[hiring / contract / remote OK\\]\n\nSeeking Tamil speakers/writers to write stories for Tamil learners. Initial focus is on spoken Tamil as used in Chennai.\n\nRequirements:\n\n\\- native Tamil speaking/writing proficiency.  \n\\- Able to write stories in a specific simplied style that learners can understand. I will provide some details on this style. Otherwise, you choose what to write about.  \n\\- Basic understanding of English.\n\n I'm based in the US. Please send inquiries to me by PM.",
        "Qualification LLM. Corporate and commercial law \n\nExperience -1.5 year, expertise in privacy and Intellectual Property laws. \n\nLooking for freelance work or a job as legal associate  paralegal or legal research in civil and corporate law \n\nPreferred location- Hyderabad\nPlease DM",
        "You can look into:\n\n1 . Instructional Design [https://en.wikipedia.org/wiki/Instructional_design]\n\n2 . Counselling (Careers/Personal/Motivational/Adolescent)\n\n3 . Specialize in an area and then move to a Subject Matter Expert rolw - create curriculums, course design, administering courses etc",
        "Thank you"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "final year bcom graduate month mumbai work experience aside volunteering gig also basic social media work financially required better take sales job comes way sales interest mine multiple internships certificate courses year apply pg skillset graphic designing logo designs posters business cards tshirt designs getting uiux well portfolio instagram primelogoz behance primelogozhttpswwwbehancenetprimelogoz location india contact primedesignsgmailcom instagram dms easier company hiring tech positions gt name company morgan stanley gt location mumbai bangalore gt requirements years experience sdejavanetpythonui qa sdet position gt preferred way contacting dm email resume hiring data scientists data engineers years experience us based telecom product company bangalore location hybrid good ds work close software integration reportingdashboarding interested candidates please dm company allowing remote work cloud data engineer devops sre skills want work home punjab hi im seeking help companies amp salaries involved artgamingvfx field amp created related thread httpswwwredditcomrindiacommentsuegltcareerpleasehelpanaspiringdartistwithhttpswwwredditcomrindiacommentsuegltcareerpleasehelpanaspiringdartistwith posting well hope someone give pointers thanks time want work education sector im interested teaching guys suggestions ive b com degree really interested financial sector im thinking distance masters course humanities subject looking job bangalore preferably product management worked software developer years finished mba last year tier institute instute mba lets give shot company hiring front end devs se level sse level company name soroco requirements se yoe web frontend experience framework angular ideal reactvuesvelte acceptable sse yoe stuff angular experience heavily favoured location company bangalore weve remote entire time dont think rta going happen pm resume questions dont use reddit chat still thing hiring contract remote ok seeking tamil speakerswriters write stories tamil learners initial focus spoken tamil used chennai requirements native tamil speakingwriting proficiency able write stories specific simplied style learners understand provide details style otherwise choose write basic understanding english im based us please send inquiries pm qualification llm corporate commercial law experience year expertise privacy intellectual property laws looking freelance work job legal associate paralegal legal research civil corporate law preferred location hyderabad please dm look instructional design httpsenwikipediaorgwikiinstructionaldesign counselling careerspersonalmotivationaladolescent specialize area move subject matter expert rolw create curriculums course design administering courses etc thank",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "I am in my final year of BCOM, about to graduate in a month. I am from Mumbai. I have no work experience aside from a volunteering gig where I also did some basic social media work for them. I am financially not required to do this, but is it better to take up any sales job that comes my way (sales is not an interest of mine) or do multiple internships and certificate courses for a year and then apply for PG? Skillset - Graphic Designing, Logo designs, Posters, Business Cards, T-shirt designs, getting into Ui/Ux as well Portfolio - Instagram @PrimeLogoZ / Behance - [PrimeLogoZ](https://www.behance.net/PrimeLogoZ) Location : India Contact - primedesigns3905@gmail.com / Instagram DMs, its easier : ) My company is hiring for tech positions &gt; Name of the company Morgan Stanley &gt; Location Mumbai and Bangalore &gt; Requirements 2+ years of experience SDE(Java/.NET/Python/UI) or QA SDET position &gt; Preferred way of contacting you DM me email and your resume. Hiring for data scientists and data engineers with 1 to 3 years of experience . US based telecom product company, Bangalore location, Hybrid. Good DS work, close to 0 software integration or reporting/dashboarding. Interested candidates, please DM. Is there any company allowing 100% remote work for cloud or data engineer or devops or SRE skills ? I want to work from home in Punjab Hi, I'm seeking help on companies &amp; salaries involved in the 3d Art/Gaming/Vfx field &amp; have created a related thread at - [https://www.reddit.com/r/india/comments/u8eglt/career\\_please\\_help\\_an\\_aspiring\\_3d\\_artist\\_with/](https://www.reddit.com/r/india/comments/u8eglt/career_please_help_an_aspiring_3d_artist_with/) Posting it here as well with the hope that someone can give a few pointers. Thanks for your time. I want to work in the education sector but I'm not interested in teaching. Do you guys have any suggestions for me? I've a B. Com degree but not really interested in the financial sector. I'm thinking of doing a distance masters course in a humanities subject. I am looking for a job in Bangalore, preferably product management. I have worked as a software developer for 2 years and finished my MBA last year from a tier 1 institute. Which instute for MBA? Let's give this a shot. My company is hiring front end devs, both at an SE level and SSE level. Company name: Soroco Requirements: SE: 1-4 YOE in web front-end, with experience with a framework (angular ideal, react/vue/svelte acceptable). SSE: 4-8 YOE in the same stuff as above. Angular experience heavily favoured. Location: company is in bangalore but we've been remote this entire time and I don't think RTA is going to happen. PM me your resume or any questions you have. I don't use reddit chat (is that still a thing?). \\[hiring / contract / remote OK\\] Seeking Tamil speakers/writers to write stories for Tamil learners. Initial focus is on spoken Tamil as used in Chennai. Requirements: \\- native Tamil speaking/writing proficiency. \\- Able to write stories in a specific simplied style that learners can understand. I will provide some details on this style. Otherwise, you choose what to write about. \\- Basic understanding of English. I'm based in the US. Please send inquiries to me by PM. Qualification LLM. Corporate and commercial law Experience -1.5 year, expertise in privacy and Intellectual Property laws. Looking for freelance work or a job as legal associate paralegal or legal research in civil and corporate law Preferred location- Hyderabad Please DM You can look into: 1 . Instructional Design [https://en.wikipedia.org/wiki/Instructional_design] 2 . Counselling (Careers/Personal/Motivational/Adolescent) 3 . Specialize in an area and then move to a Subject Matter Expert rolw - create curriculums, course design, administering courses etc Thank you"
}