{
    "id": "15jja4f",
    "title": "I wonder how Gujratis feel about this",
    "url": "https://i.redd.it/lh72tsq5zfgb1.png",
    "selftext": "South Indians have made it very clear through decades they are against it.... Being a Bengali, all I can say although we have been always open about learning Hindi but these actions are now polarising and would turn us very anti Hindi.... Tbh I feel majority of non Hindi speakers carry that sentiment.\n\nHowever, I would like to know the honest opinion of Gujaratis, since these type of agenda comes from their very own. Are they open to the idea that their own language being treated like this and maybe if it continues will meet the same fate as Bhojpuri, Maithali, Awadhi etc ?\n\nWhat's the general sentiment of people of Gujarat about this ?\n\nP.S. : Keep the discussions civil. No derogatory comments .",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691306700.0,
    "convurl": "https://i.redd.it/lh72tsq5zfgb1.png",
    "comments": [
        "Link - https://www.thehindu.com/news/national/hindi-is-not-in-competition-with-local-languages-amit-shah/article67158847.ece",
        "Link https://www.thehindu.com/news/national/hindi-is-not-in-competition-with-local-languages-amit-shah/article67158847.ece",
        "> ~~Hindi~~ English must be finally accepted without opposition\n\nThat's what I feel.",
        "Fuck Hindi. English is the way to go.",
        "The man himself can't speak good Hindi.",
        "All shenanigans to get vote bank for next election because they know they have already lost the southern states and have to rely heavily on Bihar and UP which explains the move.",
        "It's fine with English to be honest and your own regional language but if someone does not know both people should just not become toxic and help each other. I have seen the toxic part in South India not personally but on internet like cursing Hindi speakers just because they speak Hindi is a thing I don't understand at all.",
        "Bro once pronounced Jaan as Gaand",
        "Bengalis have had no reason to stand against Hindi until recently. Most Bengalis can somewhat communicate in Hindi.\n\nOutright imposition is the reason why it faces criticism.",
        "I feel like we need to make a North Indian language(combing all North Indian) languages and South Indian language(combining all South Indian languages). I know this will be tough but making Hindi national language makes everyone else lose their culture and gives Hindi people an advantage. Making English our official language is just shameful. Don’t know why we support English. Colonizer language please get out of your colonial mindset. Making English national language also sets back poorer people because they have less access to education basically making a new caste system where English speakers are at top. If we have 2 national languages one Dravidian and one Indo aryan it will be much easier.",
        "True just replacing Hindi xenophobia for your own South Indian xenophobia. There is still no india people are still loyal to their region.",
        "We Gujaratis are really happy about hindi becoming compulsory everywhere... And wanted to be... Cuz by that our language is not at all threatened/extinct cuz we can always use Gujarati in homes, etc but idk the obsession of South indians with their languages, even they are ready to accept English (a foreign language) but not our own hindi language... I think they are real fools... Who don't know importance of hindi...",
        "Agreed. I feel like people should know english and the regional language. Idk kannada tho which causes probs but at the very least all the auto wallas or anyone else I meet know a lil bit of hindi and english so I can communicate.",
        "Treated like what? Language is there to communicate, no? So as long as there are Gujarati speaking people, Gujarati will be the language, no? It is very similar to Hindi, similar words, similar pronunciations, similar grammar structure. So almost all Gujaratis can switch to Hindi very easily. Perhaps, that is why we don't care if Govt pushes Hindi?\n\nNever ever have me or my family or friends ever given this a thought. Such a \"concern\" is ... non-existent\n\nAlso, as long as I remember, I always communicated with my North Indian origin friends in Hindi! So did the others.\n\n\nWhen I was a student in US, my roommates were two Assamese and 1 Marathi guy. Our group has this combination. We spoke in Hindi.\n\nThen later shifted to house with a Tamilian, Kannadiga and a Telugu guy. And we all spoke in English!! Until the Telugu guy switched to Hindi out of the blue.",
        "But it will be when you find all signboards in hindi and schools teaching hindi instead of gujarati. Even your kids will ask why they are learning gujarati",
        "This is a terrible take. Languages represent the culture of a place. Which is why us southies hate hindi imposition. It's like northies saying that our culture,  language and our existence is inferior to them and we should become like them. Which is similar to what the colonizers you hate so much did. We can't get rid of English due to its usage in science and stuff. So a better idea is to have everyone learn English as a 2nd language for inter state communication and use local language for intra state communication. Everyone has to learn 5 subjects during compulsory education so making 2 of them languages won't hurt anyone. \n\nNo south Indian would agree to ditch their local language in favor of some new  mixed dravidian language even if you somehow create one. And even if you do, what would you do about the tribal languages? We are too diverse to enforce one language on everyone(read Hindi) and English is anyways needed for everyone so why not have local language and English?",
        "Bro Small languages are going to die out anyways it’s fucking inevitable. Look at all countries that are developed. They had many languages England(had Cornish, Gaelic, and Welsh) but they settled on English. Germany (Prussian, Gaulic, etc) you get my point. I’m not Hindi either but I think eventually one language becomes the lingua France it might be English Tamil or Hindu but one will eventually.",
        "After delimitation, an average joe from UP say Raju, 10th fail, jobless and does regular stints for Bajrang dal during Valentines day would go on to elect intellectually drained leaders for India as a whole. South Indian electorate would be non significant, issues of UP and Bihar would be issues of India for national elections .",
        "Vyakaran ke kch shabad likh kr btao be tab Jane tumhari hindi",
        "If you live in a place for a very long time then I think you should be able to understand a little bit or learn a little bit like I have been living in Bengal since my childhood so I can understand Bengali pretty much",
        "This stubbornness and resistance to change is exactly why India will never develop. Enjoy poverty, civil war(maybe), and inequality in general as this country doesn’t care about development. Only cares about dick measuring contest between regions and languages.",
        "Indian states are like European Union countries minus the development. They still have their own cultural identities. Now if tomorrow, the European Union commission says the official language of all the countries in the EU has to be French, there will be protests from both the citizens and their respective governments. Fortunately, the EU has 24 official languages in reality. Coming back to India, how will the states with languages sharing so little with Devnagri script even come around accepting the Hindi imposition law?",
        "Idk if this would change anything but for what it's worth, Lee Kuan yew the person who was probably one of the greatest visionary in recent history(took Singapore from nothing with no resources or industry to what it is today in one generation )said India has a unfulfilled destiny of greatness rivaling that of china and usa cuz India is not one nation but association of many nations within. There is nothing uniting the country. No singular sentiment or language or culture. If only we could put aside \"strength in diversity\" aside for a moment and think about it, he explained it so clearly in few words. I am no bjp/congress or any party slave but when bjp was in majority I for once in my lifetime saw nation heading in single direction and making a name in international stage. Congress on the other hand believes in divide and rule. They wanna rule at all cost. N.a.t.i.o.n they built are people they hated till recently and 90% of them promote a certain class caste religion hence the division.",
        "You're right. As a fellow Bengali, I see the essence of our language lost by communicating often with outsiders in their language. Instead it would have helped us if we made English our 2nd language. If we were close to South India then Hindi speakers won't be sticking here too much to enforce their language upon us. Joy Bangla.",
        "Ban all languages return to ooga booga times ⛳️⛳️",
        "That's not mispronounced, martey jab poore India ki G#@d to Jaan Kaisa niklega mu se...",
        "Already lost , when where they even wining anything I'm south ? And after next lokshab UP , Bihar seat are going to increase in lok shaba . So I don't think national party will hassle for south that much now. They know regional party is strong there . And south Indian love there own eco chamber.",
        ">Don’t know why we support English. Colonizer language please get out of your colonial mindset.  \n\nMaybe you should also stop living in a house because the Brits live in houses. English connects the world. It is much older than the British Empire. Nothing inherently colonial about it\n\n>Making English national language also sets back poorer people because they have less access to education \n\nSame for any other language",
        "As someone fluent in both Bengali and Hindi I can't stand this forced imposition.",
        "Yes, much better atleast it's a language which is foreign to everyone not only some regions.",
        ">So as long as there are Gujarati speaking people, Gujarati will be the language, no? It is very similar to Hindi, similar words, similar pronunciations, similar grammar structure. So almost all Gujaratis can switch to Hindi very easily\n\nThat isn't saving Marathi",
        "English is a combination of the native pre Roman languages and the Norman language this is why English has words like pig and pork 2 words with the same meanings. Maybe we could do that here. “Also the Brit’s live in houses this is a straw man argument. It makes no sense.",
        "The worst part here is that India is a bigger form of EU. The population is double and the diversity is insane. They are clubbed together as a country but most states are equivalent to an average country.",
        "*Not your own hindi language. Hindi has nothing to do with us. It is as foreign as french or German.",
        "जनता with consent देती है इनको, इनका कुछ नहीं जनता की गलती।",
        "Gujarati and Hindi are very different from South Indian languages. And besides Hindi speaking states, it is a foreign language to the other states of India so shouldn't be imposed on them.",
        "That’s not true, South India is loyal to India. Just not to Hindi.",
        "Me to I’m Marathi and I have no loyalty to Hindi. I’m just saying that having xenophobia against Hindi isn’t going to fix anything. It’s only going to make the Hindi people even more mad.",
        "Congratulations! If Gujaratis have widely accepted Hindi everywhere except for your houses, you can rest assured that Gujarati will be the first language to be eradicated from the list of languages in our country.",
        "Im a tamilian. I was against hindi. I recently got to learn hindi and Man the opportunities i missed because i didn't learn a language. The entertainment i missed. They were a lot. \n\nI would love my fellow tamilians to learn it. They dont need to forget our mother tongue. Just to have an edge in the workplace/ watch a nice hindi movie in hindi language for once. \n\nThe struggles we have to endure when there is a much higher paying job, but you dont know the language to qualify. Its heart breaking. \n\nTamil Nadu is a bubble. It's like a whole nation altogether.",
        "Gujaratis don't care about their language. They want to do business and make money. They will speak in Tamil in TN and speak in Hindi to northies.",
        "Is English not making you lose the essence of your local language?",
        "> Maybe we could do that here \n\nOr maybe the government should just stay out of people's lives and let people speak whatever language they want to speak\n\n>Also the Brit’s live in houses this is a straw man argument.\n\nHow is it? That we should stop speaking a language because the Brits speak it literally was your whole argument\n\nReinforced concrete houses originated in the UK too",
        "Oh yeah I can obv understand kannada enough to say a few words and communicate lil bit but when it becomes complex sentences I can't do that that's where I need help. and I'm appreciating the people here cuz they do know a lil bit of english and hindi",
        "Pg and pork have two very different meanings just like hen, rooster and chicken. The small languages will die out if one language is imposed on everyone. So it is the people who become natural ambassadors to protect their mother tongue. It is understandable if people from Hindi dominant states don’t understand this but they shouldn’t be forcing the native speakers to kill their language. \n\nIndia is in fact like the European Union where different language speaking regions have come together but we are stronger than then as we are one country.",
        "It's spoken everywhere and has become a common way to contact anybody in the world. Also it serves as necessary evil for all jobs and businesses so why not. Keeping aside us for briefly, even the Irish have no problems learning in English provided their own population does not have problems in speaking Gaelic language.",
        "Election shenanigans",
        "No offence, but you seem to be the kind of person who would pimp your wife to just fit in with the rest of the pimps and prostitutes.\n\nYou can anyway have sex with her inside your house, no problem whatsoever.\n\nOnce again, no offence my friend",
        "I would ask the question why it is ok for Hindi speakers to have xenophobia against other language speakers but not the other way around? Every language users have right to decide what they want to speak. Languages that succumb to Hindi will die out faster than languages that don’t.",
        "Likewise.",
        "The only stubborn people are the ones that still live in their colonial past, don't realize that their language is not the best, and they can't force it on non speakers that is most northies",
        "If I apply your logic:\n\nHindi is spoken everywhere in the country and has become a common way to contact almost anybody in the country. Also it serves as necessary evil for all jobs and businesses so why not. Even the Punjabis have no problems learning in Hindi provided their own population does not have problems in speaking Hindi language. Infact most of the Hindi movies have Punjabi songs in them.\n\nAdmit that this bubble of hatred towards Hindi is Bigotry. We have no problem in learning language of an oppressor that colonised our land for 200 years but we have a problem with a dominant language. Suddenly our culture is in danger. I am against imposition but this Hate will take us nowhere. I am from UP and know how to read and write in Bengali. I learned it as 3rd language subject in school. Should I call it as imposition? No, I wont.",
        "You can learn the language you want as a choice but forcing it because you're unwilling to do it is wrong. Tadipar said Hindi should be the national language as well as spoken by everyone. Why is that? BJP govt has malicious intentions in language imposition it's clear.\n\nAs for your biased example you clearly chose the Hindi speaking belt because Punjabis have been influenced by Hindi language for a long time.",
        "No it's not like that... I think u misjudged my opinion bro... Let it be ... Np",
        "No problem dude, I feel bad for the harsh comment I wrote\n\nLet me delete it",
        "Pig,pork. Beef,cow are the same. Hen is a female chicken. A rooster is a male chicken. Chicken is gender neutral.",
        "I never said it’s ok. Hindi people having xenophobia who other languages isn’t ok either it bad both ways."
    ],
    "cleaned_text": "wonder gujratis feel south indians made clear decades bengali say although always open learning hindi actions polarising would turn us anti hindi tbh feel majority non hindi speakers carry sentiment however would like know honest opinion gujaratis since type agenda comes open idea language treated like maybe continues meet fate bhojpuri maithali awadhi etc whats general sentiment people gujarat ps keep discussions civil derogatory comments ",
    "cleaned_title": "wonder gujratis feel",
    "cleaned_selftext": "south indians made clear decades bengali say although always open learning hindi actions polarising would turn us anti hindi tbh feel majority non hindi speakers carry sentiment however would like know honest opinion gujaratis since type agenda comes open idea language treated like maybe continues meet fate bhojpuri maithali awadhi etc whats general sentiment people gujarat ps keep discussions civil derogatory comments",
    "cleaned_comments": "link link hindi english must finally accepted without opposition thats feel fuck hindi english way go man cant speak good hindi shenanigans get vote bank next election know already lost southern states rely heavily bihar explains move fine english honest regional language someone know people become toxic help seen toxic part south india personally internet like cursing hindi speakers speak hindi thing dont understand bro pronounced jaan gaand bengalis reason stand hindi recently bengalis somewhat communicate hindi outright imposition reason faces criticism feel like need make north indian languagecombing north indian languages south indian languagecombining south indian languages know tough making hindi national language makes everyone else lose culture gives hindi people advantage making english official language shameful dont know support english colonizer language please get colonial mindset making english national language also sets back poorer people less access education basically making new caste system english speakers top national languages one dravidian one indo aryan much easier true replacing hindi xenophobia south indian xenophobia still india people still loyal region gujaratis really happy hindi becoming compulsory everywhere wanted cuz language threatenedextinct cuz always use gujarati homes etc idk obsession south indians languages even ready accept english foreign language hindi language think real fools dont know importance hindi agreed feel like people know english regional language idk kannada tho causes probs least auto wallas anyone else meet know lil bit hindi english communicate treated like language communicate long gujarati speaking people gujarati language similar hindi similar words similar pronunciations similar grammar structure almost gujaratis switch hindi easily perhaps dont care govt pushes hindi never ever family friends ever given thought concern nonexistent also long remember always communicated north indian origin friends hindi others student us roommates two assamese marathi guy group combination spoke hindi later shifted house tamilian kannadiga telugu guy spoke english telugu guy switched hindi blue find signboards hindi schools teaching hindi instead gujarati even kids ask learning gujarati terrible take languages represent culture place us southies hate hindi imposition like northies saying culture language existence inferior become like similar colonizers hate much cant get rid english due usage science stuff better idea everyone learn english nd language inter state communication use local language intra state communication everyone learn subjects compulsory education making languages wont hurt anyone south indian would agree ditch local language favor new mixed dravidian language even somehow create one even would tribal languages diverse enforce one language everyoneread hindi english anyways needed everyone local language english bro small languages going die anyways fucking inevitable look countries developed many languages englandhad cornish gaelic welsh settled english germany prussian gaulic etc get point im hindi either think eventually one language becomes lingua france might english tamil hindu one eventually delimitation average joe say raju th fail jobless regular stints bajrang dal valentines day would go elect intellectually drained leaders india whole south indian electorate would non significant issues bihar would issues india national elections vyakaran ke kch shabad likh kr btao tab jane tumhari hindi live place long time think able understand little bit learn little bit like living bengal since childhood understand bengali pretty much stubbornness resistance change exactly india never develop enjoy poverty civil warmaybe inequality general country doesnt care development cares dick measuring contest regions languages indian states like european union countries minus development still cultural identities tomorrow european union commission says official language countries eu french protests citizens respective governments fortunately eu official languages reality coming back india states languages sharing little devnagri script even come around accepting hindi imposition law idk would change anything worth lee kuan yew person probably one greatest visionary recent historytook singapore nothing resources industry today one generation said india unfulfilled destiny greatness rivaling china usa cuz india one nation association many nations within nothing uniting country singular sentiment language culture could put aside strength diversity aside moment think explained clearly words bjpcongress party slave bjp majority lifetime saw nation heading single direction making name international stage congress hand believes divide rule wan na rule cost nation built people hated till recently promote certain class caste religion hence division youre right fellow bengali see essence language lost communicating often outsiders language instead would helped us made english nd language close south india hindi speakers wont sticking much enforce language upon us joy bangla ban languages return ooga booga times thats mispronounced martey jab poore india ki gd jaan kaisa niklega mu se already lost even wining anything im south next lokshab bihar seat going increase lok shaba dont think national party hassle south much know regional party strong south indian love eco chamber dont know support english colonizer language please get colonial mindset maybe also stop living house brits live houses english connects world much older british empire nothing inherently colonial making english national language also sets back poorer people less access education language someone fluent bengali hindi cant stand forced imposition yes much better atleast language foreign everyone regions long gujarati speaking people gujarati language similar hindi similar words similar pronunciations similar grammar structure almost gujaratis switch hindi easily isnt saving marathi english combination native pre roman languages norman language english words like pig pork words meanings maybe could also brits live houses straw man argument makes sense worst part india bigger form eu population double diversity insane clubbed together country states equivalent average country hindi language hindi nothing us foreign french german consent gujarati hindi different south indian languages besides hindi speaking states foreign language states india shouldnt imposed thats true south india loyal india hindi im marathi loyalty hindi im saying xenophobia hindi isnt going fix anything going make hindi people even mad congratulations gujaratis widely accepted hindi everywhere except houses rest assured gujarati first language eradicated list languages country im tamilian hindi recently got learn hindi man opportunities missed didnt learn language entertainment missed lot would love fellow tamilians learn dont need forget mother tongue edge workplace watch nice hindi movie hindi language struggles endure much higher paying job dont know language qualify heart breaking tamil nadu bubble like whole nation altogether gujaratis dont care language want business make money speak tamil tn speak hindi northies english making lose essence local language maybe could maybe government stay peoples lives let people speak whatever language want speak also brits live houses straw man argument stop speaking language brits speak literally whole argument reinforced concrete houses originated uk oh yeah obv understand kannada enough say words communicate lil bit becomes complex sentences cant thats need help im appreciating people cuz know lil bit english hindi pg pork two different meanings like hen rooster chicken small languages die one language imposed everyone people become natural ambassadors protect mother tongue understandable people hindi dominant states dont understand shouldnt forcing native speakers kill language india fact like european union different language speaking regions come together stronger one country spoken everywhere become common way contact anybody world also serves necessary evil jobs businesses keeping aside us briefly even irish problems learning english provided population problems speaking gaelic language election shenanigans offence seem kind person would pimp wife fit rest pimps prostitutes anyway sex inside house problem whatsoever offence friend would ask question ok hindi speakers xenophobia language speakers way around every language users right decide want speak languages succumb hindi die faster languages dont likewise stubborn people ones still live colonial past dont realize language best cant force non speakers northies apply logic hindi spoken everywhere country become common way contact almost anybody country also serves necessary evil jobs businesses even punjabis problems learning hindi provided population problems speaking hindi language infact hindi movies punjabi songs admit bubble hatred towards hindi bigotry problem learning language oppressor colonised land years problem dominant language suddenly culture danger imposition hate take us nowhere know read write bengali learned rd language subject school call imposition wont learn language want choice forcing youre unwilling wrong tadipar said hindi national language well spoken everyone bjp govt malicious intentions language imposition clear biased example clearly chose hindi speaking belt punjabis influenced hindi language long time like think u misjudged opinion bro let np problem dude feel bad harsh comment wrote let delete pigpork beefcow hen female chicken rooster male chicken chicken gender neutral never said ok hindi people xenophobia languages isnt ok either bad ways",
    "light_cleaned_title": "I wonder how Gujratis feel about this",
    "light_cleaned_selftext": "South Indians have made it very clear through decades they are against it.... Being a Bengali, all I can say although we have been always open about learning Hindi but these actions are now polarising and would turn us very anti Hindi.... Tbh I feel majority of non Hindi speakers carry that sentiment. However, I would like to know the honest opinion of Gujaratis, since these type of agenda comes from their very own. Are they open to the idea that their own language being treated like this and maybe if it continues will meet the same fate as Bhojpuri, Maithali, Awadhi etc ? What's the general sentiment of people of Gujarat about this ? P.S. : Keep the discussions civil. No derogatory comments .",
    "light_cleaned_comments": "Link - Link > ~~Hindi~~ English must be finally accepted without opposition That's what I feel. Fuck Hindi. English is the way to go. The man himself can't speak good Hindi. All shenanigans to get vote bank for next election because they know they have already lost the southern states and have to rely heavily on Bihar and UP which explains the move. It's fine with English to be honest and your own regional language but if someone does not know both people should just not become toxic and help each other. I have seen the toxic part in South India not personally but on internet like cursing Hindi speakers just because they speak Hindi is a thing I don't understand at all. Bro once pronounced Jaan as Gaand Bengalis have had no reason to stand against Hindi until recently. Most Bengalis can somewhat communicate in Hindi. Outright imposition is the reason why it faces criticism. I feel like we need to make a North Indian language(combing all North Indian) languages and South Indian language(combining all South Indian languages). I know this will be tough but making Hindi national language makes everyone else lose their culture and gives Hindi people an advantage. Making English our official language is just shameful. Don’t know why we support English. Colonizer language please get out of your colonial mindset. Making English national language also sets back poorer people because they have less access to education basically making a new caste system where English speakers are at top. If we have 2 national languages one Dravidian and one Indo aryan it will be much easier. True just replacing Hindi xenophobia for your own South Indian xenophobia. There is still no india people are still loyal to their region. We Gujaratis are really happy about hindi becoming compulsory everywhere... And wanted to be... Cuz by that our language is not at all threatened/extinct cuz we can always use Gujarati in homes, etc but idk the obsession of South indians with their languages, even they are ready to accept English (a foreign language) but not our own hindi language... I think they are real fools... Who don't know importance of hindi... Agreed. I feel like people should know english and the regional language. Idk kannada tho which causes probs but at the very least all the auto wallas or anyone else I meet know a lil bit of hindi and english so I can communicate. Treated like what? Language is there to communicate, no? So as long as there are Gujarati speaking people, Gujarati will be the language, no? It is very similar to Hindi, similar words, similar pronunciations, similar grammar structure. So almost all Gujaratis can switch to Hindi very easily. Perhaps, that is why we don't care if Govt pushes Hindi? Never ever have me or my family or friends ever given this a thought. Such a \"concern\" is ... non-existent Also, as long as I remember, I always communicated with my North Indian origin friends in Hindi! So did the others. When I was a student in US, my roommates were two Assamese and 1 Marathi guy. Our group has this combination. We spoke in Hindi. Then later shifted to house with a Tamilian, Kannadiga and a Telugu guy. And we all spoke in English!! Until the Telugu guy switched to Hindi out of the blue. But it will be when you find all signboards in hindi and schools teaching hindi instead of gujarati. Even your kids will ask why they are learning gujarati This is a terrible take. Languages represent the culture of a place. Which is why us southies hate hindi imposition. It's like northies saying that our culture, language and our existence is inferior to them and we should become like them. Which is similar to what the colonizers you hate so much did. We can't get rid of English due to its usage in science and stuff. So a better idea is to have everyone learn English as a 2nd language for inter state communication and use local language for intra state communication. Everyone has to learn 5 subjects during compulsory education so making 2 of them languages won't hurt anyone. No south Indian would agree to ditch their local language in favor of some new mixed dravidian language even if you somehow create one. And even if you do, what would you do about the tribal languages? We are too diverse to enforce one language on everyone(read Hindi) and English is anyways needed for everyone so why not have local language and English? Bro Small languages are going to die out anyways it’s fucking inevitable. Look at all countries that are developed. They had many languages England(had Cornish, Gaelic, and Welsh) but they settled on English. Germany (Prussian, Gaulic, etc) you get my point. I’m not Hindi either but I think eventually one language becomes the lingua France it might be English Tamil or Hindu but one will eventually. After delimitation, an average joe from UP say Raju, 10th fail, jobless and does regular stints for Bajrang dal during Valentines day would go on to elect intellectually drained leaders for India as a whole. South Indian electorate would be non significant, issues of UP and Bihar would be issues of India for national elections . Vyakaran ke kch shabad likh kr btao be tab Jane tumhari hindi If you live in a place for a very long time then I think you should be able to understand a little bit or learn a little bit like I have been living in Bengal since my childhood so I can understand Bengali pretty much This stubbornness and resistance to change is exactly why India will never develop. Enjoy poverty, civil war(maybe), and inequality in general as this country doesn’t care about development. Only cares about dick measuring contest between regions and languages. Indian states are like European Union countries minus the development. They still have their own cultural identities. Now if tomorrow, the European Union commission says the official language of all the countries in the EU has to be French, there will be protests from both the citizens and their respective governments. Fortunately, the EU has 24 official languages in reality. Coming back to India, how will the states with languages sharing so little with Devnagri script even come around accepting the Hindi imposition law? Idk if this would change anything but for what it's worth, Lee Kuan yew the person who was probably one of the greatest visionary in recent history(took Singapore from nothing with no resources or industry to what it is today in one generation )said India has a unfulfilled destiny of greatness rivaling that of china and usa cuz India is not one nation but association of many nations within. There is nothing uniting the country. No singular sentiment or language or culture. If only we could put aside \"strength in diversity\" aside for a moment and think about it, he explained it so clearly in few words. I am no bjp/congress or any party slave but when bjp was in majority I for once in my lifetime saw nation heading in single direction and making a name in international stage. Congress on the other hand believes in divide and rule. They wanna rule at all cost. N.a.t.i.o.n they built are people they hated till recently and 90% of them promote a certain class caste religion hence the division. You're right. As a fellow Bengali, I see the essence of our language lost by communicating often with outsiders in their language. Instead it would have helped us if we made English our 2nd language. If we were close to South India then Hindi speakers won't be sticking here too much to enforce their language upon us. Joy Bangla. Ban all languages return to ooga booga times ⛳️⛳️ That's not mispronounced, martey jab poore India ki G#@d to Jaan Kaisa niklega mu se... Already lost , when where they even wining anything I'm south ? And after next lokshab UP , Bihar seat are going to increase in lok shaba . So I don't think national party will hassle for south that much now. They know regional party is strong there . And south Indian love there own eco chamber. >Don’t know why we support English. Colonizer language please get out of your colonial mindset. Maybe you should also stop living in a house because the Brits live in houses. English connects the world. It is much older than the British Empire. Nothing inherently colonial about it >Making English national language also sets back poorer people because they have less access to education Same for any other language As someone fluent in both Bengali and Hindi I can't stand this forced imposition. Yes, much better atleast it's a language which is foreign to everyone not only some regions. >So as long as there are Gujarati speaking people, Gujarati will be the language, no? It is very similar to Hindi, similar words, similar pronunciations, similar grammar structure. So almost all Gujaratis can switch to Hindi very easily That isn't saving Marathi English is a combination of the native pre Roman languages and the Norman language this is why English has words like pig and pork 2 words with the same meanings. Maybe we could do that here. “Also the Brit’s live in houses this is a straw man argument. It makes no sense. The worst part here is that India is a bigger form of EU. The population is double and the diversity is insane. They are clubbed together as a country but most states are equivalent to an average country. *Not your own hindi language. Hindi has nothing to do with us. It is as foreign as french or German. जनता with consent देती है इनको, इनका कुछ नहीं जनता की गलती। Gujarati and Hindi are very different from South Indian languages. And besides Hindi speaking states, it is a foreign language to the other states of India so shouldn't be imposed on them. That’s not true, South India is loyal to India. Just not to Hindi. Me to I’m Marathi and I have no loyalty to Hindi. I’m just saying that having xenophobia against Hindi isn’t going to fix anything. It’s only going to make the Hindi people even more mad. Congratulations! If Gujaratis have widely accepted Hindi everywhere except for your houses, you can rest assured that Gujarati will be the first language to be eradicated from the list of languages in our country. Im a tamilian. I was against hindi. I recently got to learn hindi and Man the opportunities i missed because i didn't learn a language. The entertainment i missed. They were a lot. I would love my fellow tamilians to learn it. They dont need to forget our mother tongue. Just to have an edge in the workplace/ watch a nice hindi movie in hindi language for once. The struggles we have to endure when there is a much higher paying job, but you dont know the language to qualify. Its heart breaking. Tamil Nadu is a bubble. It's like a whole nation altogether. Gujaratis don't care about their language. They want to do business and make money. They will speak in Tamil in TN and speak in Hindi to northies. Is English not making you lose the essence of your local language? > Maybe we could do that here Or maybe the government should just stay out of people's lives and let people speak whatever language they want to speak >Also the Brit’s live in houses this is a straw man argument. How is it? That we should stop speaking a language because the Brits speak it literally was your whole argument Reinforced concrete houses originated in the UK too Oh yeah I can obv understand kannada enough to say a few words and communicate lil bit but when it becomes complex sentences I can't do that that's where I need help. and I'm appreciating the people here cuz they do know a lil bit of english and hindi Pg and pork have two very different meanings just like hen, rooster and chicken. The small languages will die out if one language is imposed on everyone. So it is the people who become natural ambassadors to protect their mother tongue. It is understandable if people from Hindi dominant states don’t understand this but they shouldn’t be forcing the native speakers to kill their language. India is in fact like the European Union where different language speaking regions have come together but we are stronger than then as we are one country. It's spoken everywhere and has become a common way to contact anybody in the world. Also it serves as necessary evil for all jobs and businesses so why not. Keeping aside us for briefly, even the Irish have no problems learning in English provided their own population does not have problems in speaking Gaelic language. Election shenanigans No offence, but you seem to be the kind of person who would pimp your wife to just fit in with the rest of the pimps and prostitutes. You can anyway have sex with her inside your house, no problem whatsoever. Once again, no offence my friend I would ask the question why it is ok for Hindi speakers to have xenophobia against other language speakers but not the other way around? Every language users have right to decide what they want to speak. Languages that succumb to Hindi will die out faster than languages that don’t. Likewise. The only stubborn people are the ones that still live in their colonial past, don't realize that their language is not the best, and they can't force it on non speakers that is most northies If I apply your logic: Hindi is spoken everywhere in the country and has become a common way to contact almost anybody in the country. Also it serves as necessary evil for all jobs and businesses so why not. Even the Punjabis have no problems learning in Hindi provided their own population does not have problems in speaking Hindi language. Infact most of the Hindi movies have Punjabi songs in them. Admit that this bubble of hatred towards Hindi is Bigotry. We have no problem in learning language of an oppressor that colonised our land for 200 years but we have a problem with a dominant language. Suddenly our culture is in danger. I am against imposition but this Hate will take us nowhere. I am from UP and know how to read and write in Bengali. I learned it as 3rd language subject in school. Should I call it as imposition? No, I wont. You can learn the language you want as a choice but forcing it because you're unwilling to do it is wrong. Tadipar said Hindi should be the national language as well as spoken by everyone. Why is that? BJP govt has malicious intentions in language imposition it's clear. As for your biased example you clearly chose the Hindi speaking belt because Punjabis have been influenced by Hindi language for a long time. No it's not like that... I think u misjudged my opinion bro... Let it be ... Np No problem dude, I feel bad for the harsh comment I wrote Let me delete it Pig,pork. Beef,cow are the same. Hen is a female chicken. A rooster is a male chicken. Chicken is gender neutral. I never said it’s ok. Hindi people having xenophobia who other languages isn’t ok either it bad both ways."
}