{
    "id": "1e89plj",
    "title": "Karnataka introduces welfare bill for cine workers, cess of up to 2% on movie tickets for welfare fund",
    "url": "https://indianexpress.com/article/cities/bangalore/karnataka-introduces-welfare-bill-movie-tickets-welfare-fund-9465735/",
    "selftext": "The Karnataka Labour Department introduced a bill in the state legislature to set up a welfare board for film artists and cultural activists.",
    "flair": "Policy/Economy",
    "score": 10,
    "num_comments": 0,
    "created_utc": 1721521272.0,
    "convurl": "https://external-preview.redd.it/jsNJPt6ZDbxPORYahgu6Jj3XZNIUyOT1DMPgL3ppw5w.jpg?auto=webp&s=3e0facab454a34a8014293bd7d92d3b8944f4e33",
    "comments": [
        "> The Karnataka Labour Department introduced a bill in the state legislature to set up a welfare board for film artists and cultural activists.\n\n> One of the two main provisions in the Bill is to constitute a Karnataka Cine and Cultural Activists’ Welfare Board for registration of cinema workers, to create welfare schemes, and to address grievances.\n\n> The second key provision is to establish a fund called “The Karnataka Cine and Cultural Activists Social Security and Welfare Fund” through the collection of a cess, contributions from film personalities, and grants from the state.\n\nAs much as I hate freebies I don't hate this tbh. The artists are very much underpaid and undervalued and this is a welcoming step by the Karnataka government. This kind of empowering welfarism I can get behind. I also won't have a problem with paying extra cess knowing that it's going towards the welfare of artists."
    ],
    "cleaned_text": "karnataka introduces welfare bill cine workers cess movie tickets welfare fund karnataka labour department introduced bill state legislature set welfare board film artists cultural activists ",
    "cleaned_title": "karnataka introduces welfare bill cine workers cess movie tickets welfare fund",
    "cleaned_selftext": "karnataka labour department introduced bill state legislature set welfare board film artists cultural activists",
    "cleaned_comments": "karnataka labour department introduced bill state legislature set welfare board film artists cultural activists one two main provisions bill constitute karnataka cine cultural activists welfare board registration cinema workers create welfare schemes address grievances second key provision establish fund called karnataka cine cultural activists social security welfare fund collection cess contributions film personalities grants state much hate freebies dont hate tbh artists much underpaid undervalued welcoming step karnataka government kind empowering welfarism get behind also wont problem paying extra cess knowing going towards welfare artists",
    "light_cleaned_title": "Karnataka introduces welfare bill for cine workers, cess of up to 2% on movie tickets for welfare fund",
    "light_cleaned_selftext": "The Karnataka Labour Department introduced a bill in the state legislature to set up a welfare board for film artists and cultural activists.",
    "light_cleaned_comments": "> The Karnataka Labour Department introduced a bill in the state legislature to set up a welfare board for film artists and cultural activists. > One of the two main provisions in the Bill is to constitute a Karnataka Cine and Cultural Activists’ Welfare Board for registration of cinema workers, to create welfare schemes, and to address grievances. > The second key provision is to establish a fund called “The Karnataka Cine and Cultural Activists Social Security and Welfare Fund” through the collection of a cess, contributions from film personalities, and grants from the state. As much as I hate freebies I don't hate this tbh. The artists are very much underpaid and undervalued and this is a welcoming step by the Karnataka government. This kind of empowering welfarism I can get behind. I also won't have a problem with paying extra cess knowing that it's going towards the welfare of artists."
}