{
    "id": "1ertznf",
    "title": "2024 Budget and Digital Rights: A Tech-onomic Survey | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1ertznf/2024_budget_and_digital_rights_a_techonomic/",
    "selftext": "https://preview.redd.it/77ct8117jkid1.jpg?width=1600&format=pjpg&auto=webp&s=3743be2ed1289ca020b214071f642c952b3c7ee6\n\n# tl;dr\n\nThe latest Economic Survey attempts to encapsulate the state of the Indian economy over the past year, but for the most part echoes the praise for DPIs and techno-solutionism that has become commonplace for Indian leaders and government departments to push for in recent years. In this post, we look at what the survey has to say about DPIs generally, India’s AI mission, AgriStack and tech in agriculture, and lastly, IFF’s top contender for most opaque and lawless policy initiative, the APAAR ID.\n\n# Important documents\n\n1. The 2023-24 Economic Survey dated June 2024. ([~Link~](https://www.indiabudget.gov.in/economicsurvey/doc/echapter.pdf?ref=static.internetfreedom.in))\n2. IFF’s Feedback/Response on the Interim Report ‘Leveraging DPI for Safe and Inclusive Societies’ dated June 30, 2024. ([~Link~](https://drive.google.com/file/d/1h9-FBmAOGhsRgZwg733lfDIpAggAczQm/view?usp=drive_link&ref=static.internetfreedom.in))\n3. IFF’s posts on AgriStack. ([~Link~](https://internetfreedom.in/tag/agristack/?ref=static.internetfreedom.in#:~:text=The%20AgriStack%3A%20A%20Primer%20%23SaveOurPrivacy,public%20conversation%20about%20this%20issue.))\n4. IFF’s post on APAAR ID. ([~Link~](https://internetfreedom.in/tag/aadhaar/?ref=static.internetfreedom.in))\n\n# Background \n\nAnnual economic surveys summarise key policy interventions and economic growth of the country for the past year. The [~2023-24 Economic Survey~](https://www.indiabudget.gov.in/economicsurvey/doc/echapter.pdf?ref=static.internetfreedom.in) (“**survey**”), sprawling over 500 pages, is a similar attempt but also predominantly [~highlights~](https://www.business-standard.com/economy/news/economic-survey-dpi-brings-down-kyc-costs-to-rs-6-from-about-rs-1-000-124072201118_1.html?ref=static.internetfreedom.in) India’s move towards a fintech nation and an increased adoption of technology in the financial sector. This post will break down and analyse the survey from a digital rights perspective, covering what the survey had to say about DPIs, AI, technology in the welfare sector, digital inclusion, APAAR ID, and some miscellaneous themes.\n\n# How the survey views key digital rights issues\n\n# On digital public infrastructure\n\nThe survey points to an increasing reliance on digital public infrastructure (“**DPI**”) and identifies it as a stepping stone for India’s economic growth. It states that Aadhaar has “drastically reduced” operational costs for user authentication and the likes of e-KYC, Aadhaar-enabled Payment System, UPI, Bharat QR, DigiLocker, e-sign, Account Aggregator, Open Network for Digital Commerce can be leveraged by players to “ensure optimum outcomes”. The survey notes that adoption of DPIs has “*brought transparency, scale operation and timely delivery of financial services to the public.*” \n\nA fundamental issue with DPI, which we explored at length in our [~submissions~](https://drive.google.com/file/d/1h9-FBmAOGhsRgZwg733lfDIpAggAczQm/view?usp=drive_link&ref=static.internetfreedom.in) to the UNDP Working Group on DPI Safeguards, is the lack of transparency and accountability in its governance frameworks and operations. DPI, the way India interprets it, is built on public-private partnerships or provisioning models, and is deployed in the public sector to reach a maximum possible population cover. By keeping private partners, government instrumentalities can evade accountability and transparency requirements that do not similarly extend to the private sector. By keeping government partners, private entities may be able to benefit from exemptions reserved for government instrumentalities under various Indian laws, such as certain provisions of the Digital Personal Data Protection Act, 2023 (“**DPDPA**”). \n\nFor instance, Digi Yatra has been operationalised through a private company created for this purpose, Digi Yatra Foundation. Despite it being a government-backed initiative and identified as a DPI, citizens do not have comprehensive channels to seek grievance redress, nor can they seek transparency on the system under the Right to Information Act, 2005 as the Foundation is a private entity. Read more about our concerns with the governance framework [~here~](https://internetfreedom.in/tag/digiyatra/?ref=static.internetfreedom.in). Given the scale of the project and the sensitive nature of data DPI projects collect from Indian citizens, such non-transparency and poor governance framework is a glaring cause for concern and a [~tangible risk~](https://www.ineteconomics.org/perspectives/blog/the-business-of-government?ref=static.internetfreedom.in) which has not been addressed in the survey.\n\nThere is no anchoring law, policy, or act of Parliament governing such vast public systems or providing baseline safeguards—like grievance redress mechanisms—for most DPIs operational in India today. There is little publicly available critical and human rights analysis on the infrastructure, and the success or efficacy of such mixed models in provisioning state functions is yet to be convincingly demonstrated in the Indian academic space. This [~gap in knowledge~](https://www.business-standard.com/article/beyond-business/why-ppp-projects-fail-118042000018_1.html?ref=static.internetfreedom.in), juxtaposed with a strong push and rapid deployment of the mixed systems in India, is worrisome and needs to be assessed in detail.\n\n# On the IndiaAI mission\n\nThe survey outlines several government initiatives on artificial intelligence (“**AI**”)—Future Skills Prime, YUVAi, and Responsible AI for Youth 2022—all comprising the IndiaAI Mission, for which a budget of ₹10,300 crore has been provided this year. Despite a sizable budget allotment, the survey is interestingly right in pointing out the adverse effects of thrusting AI solutions in a society. \n\nFirst, the survey heavily refers to AI as “an energy guzzler”, stating that even as developed nations favour carbon tax regimes to fight climate change, their adoption and reliance on AI is “*ramping up energy demand like never before*.” The survey painstakingly explains how damaging AI can prove to be for the climate, calling it an ‘ultimate irony’ how as “*developed nations obsess over prospective emissions from the developing world, the widespread adoption of artificial intelligence is going to result in the demand for power to expand to levels not seen in decades*.” Calling AI a “warped priority” of advanced economies, it states that AI adoption can come at the cost of economic growth for developing nations. Even AI data centres, the survey notes, are ramping up energy demand. But most amusingly—it offers this critical analysis without applying it to the Indian scenario. India is ramping up its [~AI mission~](https://indiaai.gov.in/?ref=static.internetfreedom.in)—setting up data centres (centres of excellence), integrating AI in governance and welfare mechanisms, and incentivising public and private players to participate. India’s drive to emerge as a global leader in AI is carefully [~orchestrated~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2030512&ref=static.internetfreedom.in) and widely [~documented~](https://www.pmindia.gov.in/en/news_updates/cabinet-approves-ambitious-indiaai-mission-to-strengthen-the-ai-innovation-ecosystem/?ref=static.internetfreedom.in). Yet, not much criticism can be seen about adverse effects of AI on a rapidly deteriorating climate. The survey also calls accelerated AI adoption “*the biggest disruption for the future of work*” and notes that India would “*not remain immune to this transformation*.” The ultimate irony, indeed!\n\n# Digitalising agriculture\n\nThe survey places heavy focus on DPI integration and technology use in the agricultural sector. The ‘Digital Agriculture Mission 2021–2025’ aims to modernise agriculture through advanced technologies like AI, remote sensing, drones, etc. Further, per the Budget Announcement for 2023-24, the DPI plan spans information services for crop planning and health, improved access to farm inputs, credit, and insurance, help for crop estimation, market intelligence, and support for growth of agri-tech industry and start-ups. ‘\n\nAgriStack is a prominent DPI with three foundational registries (databases): Farmers’ Registry/Database, Geo-referenced village maps and the Crop Sown Registry/ Database, along with several Support Registries/Databases (read our AgriStack primer [~here~](https://internetfreedom.in/joint-letter-to-the-agriculture-minister/?ref=static.internetfreedom.in)). The 3 foundational Registries and DPI interventions in agriculture also encompasses data collection, including but not limited to personal details, profile of land held, production details, and financial details. All through this digitalisation attempt, farmers have been left out of the policymaking process. When news emerged about the Agristack, farmers were not consulted. The composition of the Task Force for the development of the DPIs also reflect the lack of farmer representation. Read our joint statement on the matter [~here~](https://internetfreedom.in/joint-letter-to-the-agriculture-minister/?ref=static.internetfreedom.in). \n\nA [~number of issues~](https://internetfreedom.in/privacy-of-the-people-agristack-and-farmer-issues/?ref=static.internetfreedom.in) have continued to plague this domain. At the outset, consultation papers for policy implementation, if any, have been in English and full of jargon. Interventions like these [~require~](https://internetfreedom.in/iff-response-to-the-idea-paper-on-agristack/?ref=static.internetfreedom.in) long term study and constant engagement through vernacular modes and implementation frameworks to assist better understanding emerging from farmers groups across the country. Farms generate a huge amount of data in their daily operations, and so are fertile ground for [~exploitation~](https://theconversation.com/farms-create-lots-of-data-but-farmers-dont-control-where-it-ends-up-and-who-can-use-it-115228?ref=static.internetfreedom.in) by agritech and fintech firms. There is notable lack of farmer consent in the system, especially one that heavily relies on data and platformisation of routine agricultural processes. Despite the fact that the DPDPA mandates consent in processing personal data, farmers have not been informed or even involved in the conversation so far. MoUs signed by the Ministry of Agriculture with giant tech platforms and companies [~without due transparency~](https://internetfreedom.in/algorithms-in-mous-and-data-for-profit-4-new-mous-signed-between-the-ministry-of-agriculture-and-private-corporations-including-jio-and-cisco/?ref=static.internetfreedom.in) exacerbate these concerns. The list of concerns with tech interventions in agriculture is currently long, but the survey does not address any. As the industry and ministry stakeholders continue to push for the AgriStack and other DPIs in agriculture, we worry that farmer welfare, data privacy, and autonomy, will be increasingly undermined. Read IFF’s [~analyses of AgriStack~](https://internetfreedom.in/tag/agristack/?ref=static.internetfreedom.in) for more.\n\n# On APAAR ID\n\nThe survey calls the National Credit Framework (“**NCrF**”), announced under National Education Policy 2020 “*the bulwark of the regulatory architecture underpinning life-long learning*.” Hailed as a prime DPI, the Automated Permanent Academic Account Registry (“**APAAR**”) ID is a part of NCrF being said to “bolster the regulatory architecture”. APAAR aims to issue unique IDs to students based on their Aadhaar number. An APAAR ID is a life-long longitudinal record of a student’s educational scores, achievements and related statistics, and is deemed voluntary. The survey states that with the data consent layer built into these DPIs, students can leverage this architecture for employment gains. However, there are a few flaws with this argument.\n\nFirst off, we wonder how APAAR will “bolster the regulatory architecture” when it itself is [~not tethered~](https://internetfreedom.in/student-id-zero-law-or-policy/?ref=static.internetfreedom.in) to a law, policy or implementation document. In our attempts to find the policy implementation plan, we filed an [~RTI request~](https://drive.google.com/file/d/1QGwHZbxb9A7tO_-s2i6zwOC7cNPgfzua/view?usp=sharing&ref=static.internetfreedom.in) with the Ministry of Education seeking a specific document titled “Schooling: Access and Quality”  which had supposedly been presented by the Minister of Education at the National Conference of Chief Secretaries held in New Delhi on December 28-29, 2023. This simple RTI has been [~transferred 26 times~](https://internetfreedom.in/quarterly-transparency-report-2024-q2/?ref=static.internetfreedom.in) (!!!) between various departments within the Ministry in the past four months since it was filed. Just one document….\n\nAdditionally, contrary to what the survey believes, the APAAR framework is not adequately rooted in consent. As a scheme that is ‘voluntary’ on paper, it seems to be following in the footsteps of its grandparent, the mysterious Aadhaar, in actually being ‘mandatory’ in practice. To start with, the Ministry of Education had [~urged~](https://drive.google.com/file/d/1FjzfW8kzGpSficDtdlIdWNil0FckpAQg/view?usp=sharing&ref=static.internetfreedom.in) states to tell schools that they must adopt the APAAR framework and suggested they hold “special PTMs” to get parents to sign off to this. So, APAAR ID is voluntary on paper but pretty mandatory for schools to follow. Then, [~educationists believe~](https://www.freepressjournal.in/education/apaar-id-unique-student-identification-raises-concerns-about-data-safety?ref=static.internetfreedom.in) that, much like Aadhaar verification, schools will be forced to ensure the participation of all stude\n\nnts and parents. [~Teachers also think~](https://thewire.in/education/maharashtra-directs-schools-to-get-parental-consent-for-student-unique-ids?ref=static.internetfreedom.in) APAAR will eventually be thrust on them as an administrative overhead. \n\nEven if it becomes mandatory for schools, APAAR is, again at least on paper, optional for students (and parents, whose consent is paramount to enrol them). Consent being taken from parents does not seem to be free or informed, but rather a mere formality. Some parents have [~pointed out~](https://www.hindustantimes.com/cities/mumbai-news/parents-concerned-as-apaar-id-consent-form-requires-students-personal-information-101697656934269.html?ref=static.internetfreedom.in) that there is no option to deny consent on the Aadhaar consent form handed to them as part of the APAAR enrollment. To make matters worse, this is also harshly juxtaposed by the reality that millions of rural, nomadic, destitute, or marginalised students do not have access to education or are [~thrown out of schools~](https://www.deccanherald.com/india/children-without-aadhaar-shut-out-of-school-1131133.html?ref=static.internetfreedom.in) for not possessing an Aadhaar card. By making rural schools implement an Aadhaar-based student ID, there is a risk of vast exclusion. At present, much like its foundational Aadhaar, the APAAR framework holds a \\*voluntary on paper, mandatory in practice\\* status which will only get more pervasive in the coming years as the Ministry [~guns for~](https://www.livemint.com/education/news/what-is-apaar-id-how-is-it-different-from-aadhaar-11705255162936.html?ref=static.internetfreedom.in) 100% implementation by 2026-27. Read about our ongoing efforts to gather comprehensive information about the APAAR ID [~here~](https://internetfreedom.in/student-id-zero-law-or-policy/?ref=static.internetfreedom.in). \n\nUnder such circumstances, the survey’s tall claims and praise for APAAR ID seems hollow and incomplete without a deep impact analysis of how (terribly) it is actually panning out to be.\n\n[Donate Now](https://static.internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1723614737.0,
    "convurl": "https://b.thumbs.redditmedia.com/LmzSczMV_3o8qGJhO_p2q_er0liPUZzBiJ_KmBgXoJE.jpg",
    "comments": [],
    "cleaned_text": "budget digital rights techonomic survey internet freedom foundation tldr latest economic survey attempts encapsulate state indian economy past year part echoes praise dpis technosolutionism become commonplace indian leaders government departments push recent years post look survey say dpis generally indias ai mission agristack tech agriculture lastly iffs top contender opaque lawless policy initiative apaar id important documents economic survey dated june linkhttpswwwindiabudgetgovineconomicsurveydocechapterpdfrefstaticinternetfreedomin iffs feedbackresponse interim report leveraging dpi safe inclusive societies dated june linkhttpsdrivegooglecomfiledhfbmaoghsrgzwglfdipaggaczqmviewuspdrivelinkrefstaticinternetfreedomin iffs posts agristack linkhttpsinternetfreedomintagagristackrefstaticinternetfreedomintexttheagristackaaprimersaveourprivacypublicconversationaboutthisissue iffs post apaar id linkhttpsinternetfreedomintagaadhaarrefstaticinternetfreedomin background annual economic surveys summarise key policy interventions economic growth country past year economic surveyhttpswwwindiabudgetgovineconomicsurveydocechapterpdfrefstaticinternetfreedomin survey sprawling pages similar attempt also predominantly highlightshttpswwwbusinessstandardcomeconomynewseconomicsurveydpibringsdownkyccoststorsfromaboutrshtmlrefstaticinternetfreedomin indias move towards fintech nation increased adoption technology financial sector post break analyse survey digital rights perspective covering survey say dpis ai technology welfare sector digital inclusion apaar id miscellaneous themes survey views key digital rights issues digital public infrastructure survey points increasing reliance digital public infrastructure dpi identifies stepping stone indias economic growth states aadhaar drastically reduced operational costs user authentication likes ekyc aadhaarenabled payment system upi bharat qr digilocker esign account aggregator open network digital commerce leveraged players ensure optimum outcomes survey notes adoption dpis brought transparency scale operation timely delivery financial services public fundamental issue dpi explored length submissionshttpsdrivegooglecomfiledhfbmaoghsrgzwglfdipaggaczqmviewuspdrivelinkrefstaticinternetfreedomin undp working group dpi safeguards lack transparency accountability governance frameworks operations dpi way india interprets built publicprivate partnerships provisioning models deployed public sector reach maximum possible population cover keeping private partners government instrumentalities evade accountability transparency requirements similarly extend private sector keeping government partners private entities may able benefit exemptions reserved government instrumentalities various indian laws certain provisions digital personal data protection act dpdpa instance digi yatra operationalised private company created purpose digi yatra foundation despite governmentbacked initiative identified dpi citizens comprehensive channels seek grievance redress seek transparency system right information act foundation private entity read concerns governance framework herehttpsinternetfreedomintagdigiyatrarefstaticinternetfreedomin given scale project sensitive nature data dpi projects collect indian citizens nontransparency poor governance framework glaring cause concern tangible riskhttpswwwineteconomicsorgperspectivesblogthebusinessofgovernmentrefstaticinternetfreedomin addressed survey anchoring law policy act parliament governing vast public systems providing baseline safeguardslike grievance redress mechanismsfor dpis operational india today little publicly available critical human rights analysis infrastructure success efficacy mixed models provisioning state functions yet convincingly demonstrated indian academic space gap knowledgehttpswwwbusinessstandardcomarticlebeyondbusinesswhypppprojectsfailhtmlrefstaticinternetfreedomin juxtaposed strong push rapid deployment mixed systems india worrisome needs assessed detail indiaai mission survey outlines several government initiatives artificial intelligence aifuture skills prime yuvai responsible ai youth comprising indiaai mission budget crore provided year despite sizable budget allotment survey interestingly right pointing adverse effects thrusting ai solutions society first survey heavily refers ai energy guzzler stating even developed nations favour carbon tax regimes fight climate change adoption reliance ai ramping energy demand like never survey painstakingly explains damaging ai prove climate calling ultimate irony developed nations obsess prospective emissions developing world widespread adoption artificial intelligence going result demand power expand levels seen decades calling ai warped priority advanced economies states ai adoption come cost economic growth developing nations even ai data centres survey notes ramping energy demand amusinglyit offers critical analysis without applying indian scenario india ramping ai missionhttpsindiaaigovinrefstaticinternetfreedominsetting data centres centres excellence integrating ai governance welfare mechanisms incentivising public private players participate indias drive emerge global leader ai carefully orchestratedhttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin widely documentedhttpswwwpmindiagovinennewsupdatescabinetapprovesambitiousindiaaimissiontostrengthentheaiinnovationecosystemrefstaticinternetfreedomin yet much criticism seen adverse effects ai rapidly deteriorating climate survey also calls accelerated ai adoption biggest disruption future work notes india would remain immune transformation ultimate irony indeed digitalising agriculture survey places heavy focus dpi integration technology use agricultural sector digital agriculture mission aims modernise agriculture advanced technologies like ai remote sensing drones etc per budget announcement dpi plan spans information services crop planning health improved access farm inputs credit insurance help crop estimation market intelligence support growth agritech industry startups agristack prominent dpi three foundational registries databases farmers registrydatabase georeferenced village maps crop sown registry database along several support registriesdatabases read agristack primer herehttpsinternetfreedominjointlettertotheagricultureministerrefstaticinternetfreedomin foundational registries dpi interventions agriculture also encompasses data collection including limited personal details profile land held production details financial details digitalisation attempt farmers left policymaking process news emerged agristack farmers consulted composition task force development dpis also reflect lack farmer representation read joint statement matter herehttpsinternetfreedominjointlettertotheagricultureministerrefstaticinternetfreedomin number issueshttpsinternetfreedominprivacyofthepeopleagristackandfarmerissuesrefstaticinternetfreedomin continued plague domain outset consultation papers policy implementation english full jargon interventions like requirehttpsinternetfreedominiffresponsetotheideapaperonagristackrefstaticinternetfreedomin long term study constant engagement vernacular modes implementation frameworks assist better understanding emerging farmers groups across country farms generate huge amount data daily operations fertile ground exploitationhttpstheconversationcomfarmscreatelotsofdatabutfarmersdontcontrolwhereitendsupandwhocanuseitrefstaticinternetfreedomin agritech fintech firms notable lack farmer consent system especially one heavily relies data platformisation routine agricultural processes despite fact dpdpa mandates consent processing personal data farmers informed even involved conversation far mous signed ministry agriculture giant tech platforms companies without due transparencyhttpsinternetfreedominalgorithmsinmousanddataforprofitnewmoussignedbetweentheministryofagricultureandprivatecorporationsincludingjioandciscorefstaticinternetfreedomin exacerbate concerns list concerns tech interventions agriculture currently long survey address industry ministry stakeholders continue push agristack dpis agriculture worry farmer welfare data privacy autonomy increasingly undermined read iffs analyses agristackhttpsinternetfreedomintagagristackrefstaticinternetfreedomin apaar id survey calls national credit framework ncrf announced national education policy bulwark regulatory architecture underpinning lifelong learning hailed prime dpi automated permanent academic account registry apaar id part ncrf said bolster regulatory architecture apaar aims issue unique ids students based aadhaar number apaar id lifelong longitudinal record students educational scores achievements related statistics deemed voluntary survey states data consent layer built dpis students leverage architecture employment gains however flaws argument first wonder apaar bolster regulatory architecture tetheredhttpsinternetfreedominstudentidzerolaworpolicyrefstaticinternetfreedomin law policy implementation document attempts find policy implementation plan filed rti requesthttpsdrivegooglecomfiledqgwhzbxbatosizwoccnpgfzuaviewuspsharingrefstaticinternetfreedomin ministry education seeking specific document titled schooling access quality supposedly presented minister education national conference chief secretaries held new delhi december simple rti transferred timeshttpsinternetfreedominquarterlytransparencyreportqrefstaticinternetfreedomin various departments within ministry past four months since filed one document additionally contrary survey believes apaar framework adequately rooted consent scheme voluntary paper seems following footsteps grandparent mysterious aadhaar actually mandatory practice start ministry education urgedhttpsdrivegooglecomfiledfjzfwkzgpsficdtdlidwnilfckpaqgviewuspsharingrefstaticinternetfreedomin states tell schools must adopt apaar framework suggested hold special ptms get parents sign apaar id voluntary paper pretty mandatory schools follow educationists believehttpswwwfreepressjournalineducationapaariduniquestudentidentificationraisesconcernsaboutdatasafetyrefstaticinternetfreedomin much like aadhaar verification schools forced ensure participation stude nts parents teachers also thinkhttpsthewireineducationmaharashtradirectsschoolstogetparentalconsentforstudentuniqueidsrefstaticinternetfreedomin apaar eventually thrust administrative overhead even becomes mandatory schools apaar least paper optional students parents whose consent paramount enrol consent taken parents seem free informed rather mere formality parents pointed outhttpswwwhindustantimescomcitiesmumbainewsparentsconcernedasapaaridconsentformrequiresstudentspersonalinformationhtmlrefstaticinternetfreedomin option deny consent aadhaar consent form handed part apaar enrollment make matters worse also harshly juxtaposed reality millions rural nomadic destitute marginalised students access education thrown schoolshttpswwwdeccanheraldcomindiachildrenwithoutaadhaarshutoutofschoolhtmlrefstaticinternetfreedomin possessing aadhaar card making rural schools implement aadhaarbased student id risk vast exclusion present much like foundational aadhaar apaar framework holds voluntary paper mandatory practice status get pervasive coming years ministry guns forhttpswwwlivemintcomeducationnewswhatisapaaridhowisitdifferentfromaadhaarhtmlrefstaticinternetfreedomin implementation read ongoing efforts gather comprehensive information apaar id herehttpsinternetfreedominstudentidzerolaworpolicyrefstaticinternetfreedomin circumstances surveys tall claims praise apaar id seems hollow incomplete without deep impact analysis terribly actually panning donate nowhttpsstaticinternetfreedomindonate ",
    "cleaned_title": "budget digital rights techonomic survey internet freedom foundation",
    "cleaned_selftext": "tldr latest economic survey attempts encapsulate state indian economy past year part echoes praise dpis technosolutionism become commonplace indian leaders government departments push recent years post look survey say dpis generally indias ai mission agristack tech agriculture lastly iffs top contender opaque lawless policy initiative apaar id important documents economic survey dated june linkhttpswwwindiabudgetgovineconomicsurveydocechapterpdfrefstaticinternetfreedomin iffs feedbackresponse interim report leveraging dpi safe inclusive societies dated june linkhttpsdrivegooglecomfiledhfbmaoghsrgzwglfdipaggaczqmviewuspdrivelinkrefstaticinternetfreedomin iffs posts agristack linkhttpsinternetfreedomintagagristackrefstaticinternetfreedomintexttheagristackaaprimersaveourprivacypublicconversationaboutthisissue iffs post apaar id linkhttpsinternetfreedomintagaadhaarrefstaticinternetfreedomin background annual economic surveys summarise key policy interventions economic growth country past year economic surveyhttpswwwindiabudgetgovineconomicsurveydocechapterpdfrefstaticinternetfreedomin survey sprawling pages similar attempt also predominantly highlightshttpswwwbusinessstandardcomeconomynewseconomicsurveydpibringsdownkyccoststorsfromaboutrshtmlrefstaticinternetfreedomin indias move towards fintech nation increased adoption technology financial sector post break analyse survey digital rights perspective covering survey say dpis ai technology welfare sector digital inclusion apaar id miscellaneous themes survey views key digital rights issues digital public infrastructure survey points increasing reliance digital public infrastructure dpi identifies stepping stone indias economic growth states aadhaar drastically reduced operational costs user authentication likes ekyc aadhaarenabled payment system upi bharat qr digilocker esign account aggregator open network digital commerce leveraged players ensure optimum outcomes survey notes adoption dpis brought transparency scale operation timely delivery financial services public fundamental issue dpi explored length submissionshttpsdrivegooglecomfiledhfbmaoghsrgzwglfdipaggaczqmviewuspdrivelinkrefstaticinternetfreedomin undp working group dpi safeguards lack transparency accountability governance frameworks operations dpi way india interprets built publicprivate partnerships provisioning models deployed public sector reach maximum possible population cover keeping private partners government instrumentalities evade accountability transparency requirements similarly extend private sector keeping government partners private entities may able benefit exemptions reserved government instrumentalities various indian laws certain provisions digital personal data protection act dpdpa instance digi yatra operationalised private company created purpose digi yatra foundation despite governmentbacked initiative identified dpi citizens comprehensive channels seek grievance redress seek transparency system right information act foundation private entity read concerns governance framework herehttpsinternetfreedomintagdigiyatrarefstaticinternetfreedomin given scale project sensitive nature data dpi projects collect indian citizens nontransparency poor governance framework glaring cause concern tangible riskhttpswwwineteconomicsorgperspectivesblogthebusinessofgovernmentrefstaticinternetfreedomin addressed survey anchoring law policy act parliament governing vast public systems providing baseline safeguardslike grievance redress mechanismsfor dpis operational india today little publicly available critical human rights analysis infrastructure success efficacy mixed models provisioning state functions yet convincingly demonstrated indian academic space gap knowledgehttpswwwbusinessstandardcomarticlebeyondbusinesswhypppprojectsfailhtmlrefstaticinternetfreedomin juxtaposed strong push rapid deployment mixed systems india worrisome needs assessed detail indiaai mission survey outlines several government initiatives artificial intelligence aifuture skills prime yuvai responsible ai youth comprising indiaai mission budget crore provided year despite sizable budget allotment survey interestingly right pointing adverse effects thrusting ai solutions society first survey heavily refers ai energy guzzler stating even developed nations favour carbon tax regimes fight climate change adoption reliance ai ramping energy demand like never survey painstakingly explains damaging ai prove climate calling ultimate irony developed nations obsess prospective emissions developing world widespread adoption artificial intelligence going result demand power expand levels seen decades calling ai warped priority advanced economies states ai adoption come cost economic growth developing nations even ai data centres survey notes ramping energy demand amusinglyit offers critical analysis without applying indian scenario india ramping ai missionhttpsindiaaigovinrefstaticinternetfreedominsetting data centres centres excellence integrating ai governance welfare mechanisms incentivising public private players participate indias drive emerge global leader ai carefully orchestratedhttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin widely documentedhttpswwwpmindiagovinennewsupdatescabinetapprovesambitiousindiaaimissiontostrengthentheaiinnovationecosystemrefstaticinternetfreedomin yet much criticism seen adverse effects ai rapidly deteriorating climate survey also calls accelerated ai adoption biggest disruption future work notes india would remain immune transformation ultimate irony indeed digitalising agriculture survey places heavy focus dpi integration technology use agricultural sector digital agriculture mission aims modernise agriculture advanced technologies like ai remote sensing drones etc per budget announcement dpi plan spans information services crop planning health improved access farm inputs credit insurance help crop estimation market intelligence support growth agritech industry startups agristack prominent dpi three foundational registries databases farmers registrydatabase georeferenced village maps crop sown registry database along several support registriesdatabases read agristack primer herehttpsinternetfreedominjointlettertotheagricultureministerrefstaticinternetfreedomin foundational registries dpi interventions agriculture also encompasses data collection including limited personal details profile land held production details financial details digitalisation attempt farmers left policymaking process news emerged agristack farmers consulted composition task force development dpis also reflect lack farmer representation read joint statement matter herehttpsinternetfreedominjointlettertotheagricultureministerrefstaticinternetfreedomin number issueshttpsinternetfreedominprivacyofthepeopleagristackandfarmerissuesrefstaticinternetfreedomin continued plague domain outset consultation papers policy implementation english full jargon interventions like requirehttpsinternetfreedominiffresponsetotheideapaperonagristackrefstaticinternetfreedomin long term study constant engagement vernacular modes implementation frameworks assist better understanding emerging farmers groups across country farms generate huge amount data daily operations fertile ground exploitationhttpstheconversationcomfarmscreatelotsofdatabutfarmersdontcontrolwhereitendsupandwhocanuseitrefstaticinternetfreedomin agritech fintech firms notable lack farmer consent system especially one heavily relies data platformisation routine agricultural processes despite fact dpdpa mandates consent processing personal data farmers informed even involved conversation far mous signed ministry agriculture giant tech platforms companies without due transparencyhttpsinternetfreedominalgorithmsinmousanddataforprofitnewmoussignedbetweentheministryofagricultureandprivatecorporationsincludingjioandciscorefstaticinternetfreedomin exacerbate concerns list concerns tech interventions agriculture currently long survey address industry ministry stakeholders continue push agristack dpis agriculture worry farmer welfare data privacy autonomy increasingly undermined read iffs analyses agristackhttpsinternetfreedomintagagristackrefstaticinternetfreedomin apaar id survey calls national credit framework ncrf announced national education policy bulwark regulatory architecture underpinning lifelong learning hailed prime dpi automated permanent academic account registry apaar id part ncrf said bolster regulatory architecture apaar aims issue unique ids students based aadhaar number apaar id lifelong longitudinal record students educational scores achievements related statistics deemed voluntary survey states data consent layer built dpis students leverage architecture employment gains however flaws argument first wonder apaar bolster regulatory architecture tetheredhttpsinternetfreedominstudentidzerolaworpolicyrefstaticinternetfreedomin law policy implementation document attempts find policy implementation plan filed rti requesthttpsdrivegooglecomfiledqgwhzbxbatosizwoccnpgfzuaviewuspsharingrefstaticinternetfreedomin ministry education seeking specific document titled schooling access quality supposedly presented minister education national conference chief secretaries held new delhi december simple rti transferred timeshttpsinternetfreedominquarterlytransparencyreportqrefstaticinternetfreedomin various departments within ministry past four months since filed one document additionally contrary survey believes apaar framework adequately rooted consent scheme voluntary paper seems following footsteps grandparent mysterious aadhaar actually mandatory practice start ministry education urgedhttpsdrivegooglecomfiledfjzfwkzgpsficdtdlidwnilfckpaqgviewuspsharingrefstaticinternetfreedomin states tell schools must adopt apaar framework suggested hold special ptms get parents sign apaar id voluntary paper pretty mandatory schools follow educationists believehttpswwwfreepressjournalineducationapaariduniquestudentidentificationraisesconcernsaboutdatasafetyrefstaticinternetfreedomin much like aadhaar verification schools forced ensure participation stude nts parents teachers also thinkhttpsthewireineducationmaharashtradirectsschoolstogetparentalconsentforstudentuniqueidsrefstaticinternetfreedomin apaar eventually thrust administrative overhead even becomes mandatory schools apaar least paper optional students parents whose consent paramount enrol consent taken parents seem free informed rather mere formality parents pointed outhttpswwwhindustantimescomcitiesmumbainewsparentsconcernedasapaaridconsentformrequiresstudentspersonalinformationhtmlrefstaticinternetfreedomin option deny consent aadhaar consent form handed part apaar enrollment make matters worse also harshly juxtaposed reality millions rural nomadic destitute marginalised students access education thrown schoolshttpswwwdeccanheraldcomindiachildrenwithoutaadhaarshutoutofschoolhtmlrefstaticinternetfreedomin possessing aadhaar card making rural schools implement aadhaarbased student id risk vast exclusion present much like foundational aadhaar apaar framework holds voluntary paper mandatory practice status get pervasive coming years ministry guns forhttpswwwlivemintcomeducationnewswhatisapaaridhowisitdifferentfromaadhaarhtmlrefstaticinternetfreedomin implementation read ongoing efforts gather comprehensive information apaar id herehttpsinternetfreedominstudentidzerolaworpolicyrefstaticinternetfreedomin circumstances surveys tall claims praise apaar id seems hollow incomplete without deep impact analysis terribly actually panning donate nowhttpsstaticinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "2024 Budget and Digital Rights: A Tech-onomic Survey | Internet Freedom Foundation",
    "light_cleaned_selftext": "# tl;dr The latest Economic Survey attempts to encapsulate the state of the Indian economy over the past year, but for the most part echoes the praise for DPIs and techno-solutionism that has become commonplace for Indian leaders and government departments to push for in recent years. In this post, we look at what the survey has to say about DPIs generally, India’s AI mission, AgriStack and tech in agriculture, and lastly, IFF’s top contender for most opaque and lawless policy initiative, the APAAR ID. # Important documents 1. The 2023-24 Economic Survey dated June 2024. ([~Link~](https://www.indiabudget.gov.in/economicsurvey/doc/echapter.pdf?ref=static.internetfreedom.in)) 2. IFF’s Feedback/Response on the Interim Report ‘Leveraging DPI for Safe and Inclusive Societies’ dated June 30, 2024. ([~Link~](https://drive.google.com/file/d/1h9-FBmAOGhsRgZwg733lfDIpAggAczQm/view?usp=drive_link&ref=static.internetfreedom.in)) 3. IFF’s posts on AgriStack. ([~Link~](https://internetfreedom.in/tag/agristack/?ref=static.internetfreedom.in#:~:text=The%20AgriStack%3A%20A%20Primer%20%23SaveOurPrivacy,public%20conversation%20about%20this%20issue.)) 4. IFF’s post on APAAR ID. ([~Link~](https://internetfreedom.in/tag/aadhaar/?ref=static.internetfreedom.in)) # Background Annual economic surveys summarise key policy interventions and economic growth of the country for the past year. The [~2023-24 Economic Survey~](https://www.indiabudget.gov.in/economicsurvey/doc/echapter.pdf?ref=static.internetfreedom.in) (“**survey**”), sprawling over 500 pages, is a similar attempt but also predominantly [~highlights~](https://www.business-standard.com/economy/news/economic-survey-dpi-brings-down-kyc-costs-to-rs-6-from-about-rs-1-000-124072201118_1.html?ref=static.internetfreedom.in) India’s move towards a fintech nation and an increased adoption of technology in the financial sector. This post will break down and analyse the survey from a digital rights perspective, covering what the survey had to say about DPIs, AI, technology in the welfare sector, digital inclusion, APAAR ID, and some miscellaneous themes. # How the survey views key digital rights issues # On digital public infrastructure The survey points to an increasing reliance on digital public infrastructure (“**DPI**”) and identifies it as a stepping stone for India’s economic growth. It states that Aadhaar has “drastically reduced” operational costs for user authentication and the likes of e-KYC, Aadhaar-enabled Payment System, UPI, Bharat QR, DigiLocker, e-sign, Account Aggregator, Open Network for Digital Commerce can be leveraged by players to “ensure optimum outcomes”. The survey notes that adoption of DPIs has “*brought transparency, scale operation and timely delivery of financial services to the public.*” A fundamental issue with DPI, which we explored at length in our [~submissions~](https://drive.google.com/file/d/1h9-FBmAOGhsRgZwg733lfDIpAggAczQm/view?usp=drive_link&ref=static.internetfreedom.in) to the UNDP Working Group on DPI Safeguards, is the lack of transparency and accountability in its governance frameworks and operations. DPI, the way India interprets it, is built on public-private partnerships or provisioning models, and is deployed in the public sector to reach a maximum possible population cover. By keeping private partners, government instrumentalities can evade accountability and transparency requirements that do not similarly extend to the private sector. By keeping government partners, private entities may be able to benefit from exemptions reserved for government instrumentalities under various Indian laws, such as certain provisions of the Digital Personal Data Protection Act, 2023 (“**DPDPA**”). For instance, Digi Yatra has been operationalised through a private company created for this purpose, Digi Yatra Foundation. Despite it being a government-backed initiative and identified as a DPI, citizens do not have comprehensive channels to seek grievance redress, nor can they seek transparency on the system under the Right to Information Act, 2005 as the Foundation is a private entity. Read more about our concerns with the governance framework [~here~](https://internetfreedom.in/tag/digiyatra/?ref=static.internetfreedom.in). Given the scale of the project and the sensitive nature of data DPI projects collect from Indian citizens, such non-transparency and poor governance framework is a glaring cause for concern and a [~tangible risk~](https://www.ineteconomics.org/perspectives/blog/the-business-of-government?ref=static.internetfreedom.in) which has not been addressed in the survey. There is no anchoring law, policy, or act of Parliament governing such vast public systems or providing baseline safeguards—like grievance redress mechanisms—for most DPIs operational in India today. There is little publicly available critical and human rights analysis on the infrastructure, and the success or efficacy of such mixed models in provisioning state functions is yet to be convincingly demonstrated in the Indian academic space. This [~gap in knowledge~](https://www.business-standard.com/article/beyond-business/why-ppp-projects-fail-118042000018_1.html?ref=static.internetfreedom.in), juxtaposed with a strong push and rapid deployment of the mixed systems in India, is worrisome and needs to be assessed in detail. # On the IndiaAI mission The survey outlines several government initiatives on artificial intelligence (“**AI**”)—Future Skills Prime, YUVAi, and Responsible AI for Youth 2022—all comprising the IndiaAI Mission, for which a budget of ₹10,300 crore has been provided this year. Despite a sizable budget allotment, the survey is interestingly right in pointing out the adverse effects of thrusting AI solutions in a society. First, the survey heavily refers to AI as “an energy guzzler”, stating that even as developed nations favour carbon tax regimes to fight climate change, their adoption and reliance on AI is “*ramping up energy demand like never before*.” The survey painstakingly explains how damaging AI can prove to be for the climate, calling it an ‘ultimate irony’ how as “*developed nations obsess over prospective emissions from the developing world, the widespread adoption of artificial intelligence is going to result in the demand for power to expand to levels not seen in decades*.” Calling AI a “warped priority” of advanced economies, it states that AI adoption can come at the cost of economic growth for developing nations. Even AI data centres, the survey notes, are ramping up energy demand. But most amusingly—it offers this critical analysis without applying it to the Indian scenario. India is ramping up its [~AI mission~](https://indiaai.gov.in/?ref=static.internetfreedom.in)—setting up data centres (centres of excellence), integrating AI in governance and welfare mechanisms, and incentivising public and private players to participate. India’s drive to emerge as a global leader in AI is carefully [~orchestrated~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2030512&ref=static.internetfreedom.in) and widely [~documented~](https://www.pmindia.gov.in/en/news_updates/cabinet-approves-ambitious-indiaai-mission-to-strengthen-the-ai-innovation-ecosystem/?ref=static.internetfreedom.in). Yet, not much criticism can be seen about adverse effects of AI on a rapidly deteriorating climate. The survey also calls accelerated AI adoption “*the biggest disruption for the future of work*” and notes that India would “*not remain immune to this transformation*.” The ultimate irony, indeed! # Digitalising agriculture The survey places heavy focus on DPI integration and technology use in the agricultural sector. The ‘Digital Agriculture Mission 2021–2025’ aims to modernise agriculture through advanced technologies like AI, remote sensing, drones, etc. Further, per the Budget Announcement for 2023-24, the DPI plan spans information services for crop planning and health, improved access to farm inputs, credit, and insurance, help for crop estimation, market intelligence, and support for growth of agri-tech industry and start-ups. ‘ AgriStack is a prominent DPI with three foundational registries (databases): Farmers’ Registry/Database, Geo-referenced village maps and the Crop Sown Registry/ Database, along with several Support Registries/Databases (read our AgriStack primer [~here~](https://internetfreedom.in/joint-letter-to-the-agriculture-minister/?ref=static.internetfreedom.in)). The 3 foundational Registries and DPI interventions in agriculture also encompasses data collection, including but not limited to personal details, profile of land held, production details, and financial details. All through this digitalisation attempt, farmers have been left out of the policymaking process. When news emerged about the Agristack, farmers were not consulted. The composition of the Task Force for the development of the DPIs also reflect the lack of farmer representation. Read our joint statement on the matter [~here~](https://internetfreedom.in/joint-letter-to-the-agriculture-minister/?ref=static.internetfreedom.in). A [~number of issues~](https://internetfreedom.in/privacy-of-the-people-agristack-and-farmer-issues/?ref=static.internetfreedom.in) have continued to plague this domain. At the outset, consultation papers for policy implementation, if any, have been in English and full of jargon. Interventions like these [~require~](https://internetfreedom.in/iff-response-to-the-idea-paper-on-agristack/?ref=static.internetfreedom.in) long term study and constant engagement through vernacular modes and implementation frameworks to assist better understanding emerging from farmers groups across the country. Farms generate a huge amount of data in their daily operations, and so are fertile ground for [~exploitation~](https://theconversation.com/farms-create-lots-of-data-but-farmers-dont-control-where-it-ends-up-and-who-can-use-it-115228?ref=static.internetfreedom.in) by agritech and fintech firms. There is notable lack of farmer consent in the system, especially one that heavily relies on data and platformisation of routine agricultural processes. Despite the fact that the DPDPA mandates consent in processing personal data, farmers have not been informed or even involved in the conversation so far. MoUs signed by the Ministry of Agriculture with giant tech platforms and companies [~without due transparency~](https://internetfreedom.in/algorithms-in-mous-and-data-for-profit-4-new-mous-signed-between-the-ministry-of-agriculture-and-private-corporations-including-jio-and-cisco/?ref=static.internetfreedom.in) exacerbate these concerns. The list of concerns with tech interventions in agriculture is currently long, but the survey does not address any. As the industry and ministry stakeholders continue to push for the AgriStack and other DPIs in agriculture, we worry that farmer welfare, data privacy, and autonomy, will be increasingly undermined. Read IFF’s [~analyses of AgriStack~](https://internetfreedom.in/tag/agristack/?ref=static.internetfreedom.in) for more. # On APAAR ID The survey calls the National Credit Framework (“**NCrF**”), announced under National Education Policy 2020 “*the bulwark of the regulatory architecture underpinning life-long learning*.” Hailed as a prime DPI, the Automated Permanent Academic Account Registry (“**APAAR**”) ID is a part of NCrF being said to “bolster the regulatory architecture”. APAAR aims to issue unique IDs to students based on their Aadhaar number. An APAAR ID is a life-long longitudinal record of a student’s educational scores, achievements and related statistics, and is deemed voluntary. The survey states that with the data consent layer built into these DPIs, students can leverage this architecture for employment gains. However, there are a few flaws with this argument. First off, we wonder how APAAR will “bolster the regulatory architecture” when it itself is [~not tethered~](https://internetfreedom.in/student-id-zero-law-or-policy/?ref=static.internetfreedom.in) to a law, policy or implementation document. In our attempts to find the policy implementation plan, we filed an [~RTI request~](https://drive.google.com/file/d/1QGwHZbxb9A7tO_-s2i6zwOC7cNPgfzua/view?usp=sharing&ref=static.internetfreedom.in) with the Ministry of Education seeking a specific document titled “Schooling: Access and Quality” which had supposedly been presented by the Minister of Education at the National Conference of Chief Secretaries held in New Delhi on December 28-29, 2023. This simple RTI has been [~transferred 26 times~](https://internetfreedom.in/quarterly-transparency-report-2024-q2/?ref=static.internetfreedom.in) (!!!) between various departments within the Ministry in the past four months since it was filed. Just one document…. Additionally, contrary to what the survey believes, the APAAR framework is not adequately rooted in consent. As a scheme that is ‘voluntary’ on paper, it seems to be following in the footsteps of its grandparent, the mysterious Aadhaar, in actually being ‘mandatory’ in practice. To start with, the Ministry of Education had [~urged~](https://drive.google.com/file/d/1FjzfW8kzGpSficDtdlIdWNil0FckpAQg/view?usp=sharing&ref=static.internetfreedom.in) states to tell schools that they must adopt the APAAR framework and suggested they hold “special PTMs” to get parents to sign off to this. So, APAAR ID is voluntary on paper but pretty mandatory for schools to follow. Then, [~educationists believe~](https://www.freepressjournal.in/education/apaar-id-unique-student-identification-raises-concerns-about-data-safety?ref=static.internetfreedom.in) that, much like Aadhaar verification, schools will be forced to ensure the participation of all stude nts and parents. [~Teachers also think~](https://thewire.in/education/maharashtra-directs-schools-to-get-parental-consent-for-student-unique-ids?ref=static.internetfreedom.in) APAAR will eventually be thrust on them as an administrative overhead. Even if it becomes mandatory for schools, APAAR is, again at least on paper, optional for students (and parents, whose consent is paramount to enrol them). Consent being taken from parents does not seem to be free or informed, but rather a mere formality. Some parents have [~pointed out~](https://www.hindustantimes.com/cities/mumbai-news/parents-concerned-as-apaar-id-consent-form-requires-students-personal-information-101697656934269.html?ref=static.internetfreedom.in) that there is no option to deny consent on the Aadhaar consent form handed to them as part of the APAAR enrollment. To make matters worse, this is also harshly juxtaposed by the reality that millions of rural, nomadic, destitute, or marginalised students do not have access to education or are [~thrown out of schools~](https://www.deccanherald.com/india/children-without-aadhaar-shut-out-of-school-1131133.html?ref=static.internetfreedom.in) for not possessing an Aadhaar card. By making rural schools implement an Aadhaar-based student ID, there is a risk of vast exclusion. At present, much like its foundational Aadhaar, the APAAR framework holds a \\*voluntary on paper, mandatory in practice\\* status which will only get more pervasive in the coming years as the Ministry [~guns for~](https://www.livemint.com/education/news/what-is-apaar-id-how-is-it-different-from-aadhaar-11705255162936.html?ref=static.internetfreedom.in) 100% implementation by 2026-27. Read about our ongoing efforts to gather comprehensive information about the APAAR ID [~here~](https://internetfreedom.in/student-id-zero-law-or-policy/?ref=static.internetfreedom.in). Under such circumstances, the survey’s tall claims and praise for APAAR ID seems hollow and incomplete without a deep impact analysis of how (terribly) it is actually panning out to be. [Donate Now](https://static.internetfreedom.in/donate)",
    "light_cleaned_comments": ""
}