{
    "id": "16i0o5x",
    "title": "How/where to buy weed, for tourists in India? Are there any Indian cities/areas where weed is legal?",
    "url": "https://www.reddit.com/r/india/comments/16i0o5x/howwhere_to_buy_weed_for_tourists_in_india_are/",
    "selftext": "Advice needed, for American tourists visiting India. As you know, weed is legal in some parts of the US. So, many Americans are used to smoking weed several times a day.\n\n[https://en.wikipedia.org/wiki/Cannabis\\_in\\_India](https://en.wikipedia.org/wiki/Cannabis_in_India)\n\nBut. Based on the above wiki page,\n\n*\"Indian government is strict with the Cannabis policy. According to Section 20 of the NDPS Act,* ***holding a small quantity of weed can land you in jail for rigorous imprisonment of up to six months or a fine of Rs.*** ***10,000 or both***\\*.\"\\*\n\nIs this really enforced?\n\n[https://www.lostwithpurpose.com/weed-india/#where](https://www.lostwithpurpose.com/weed-india/#where)\n\nThen there's this article.",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 4,
    "created_utc": 1694643357.0,
    "convurl": "https://external-preview.redd.it/6EQcYL5HPzy2x8yOCXKpm07rcw_Kafc5nlezO3QKnVM.jpg?auto=webp&s=01a5024f61133105d0c8b34ba18736473a61562b",
    "comments": [
        "Yes, it's enforced, but severity of enforcement depends on city. You can smoke it in private space, but don't even try in public spaces, you don't know what kind of cop you come across. You will be travelling in car, so not much an issue, as they don't check for weed in cars, from what I know.\n\nSince it's banned, it would be hard to find seller on your own, especially a decent/good quality one.\n\nYour best bet is to have some local connect or your travel agency provides you.",
        "Orrissa.",
        "Yes its legal in Varanasi",
        "In Bhubaneswar you can find many shops on google maps. Government bhang shops.. marijuana (ganja) available point. Yes. Its ganja. The dried flower."
    ],
    "cleaned_text": "howwhere buy weed tourists india indian citiesareas weed legal advice needed american tourists visiting india know weed legal parts us many americans used smoking weed several times day httpsenwikipediaorgwikicannabisinindiahttpsenwikipediaorgwikicannabisinindia based wiki page indian government strict cannabis policy according section ndps act holding small quantity weed land jail rigorous imprisonment six months fine rs really enforced httpswwwlostwithpurposecomweedindiawherehttpswwwlostwithpurposecomweedindiawhere theres article ",
    "cleaned_title": "howwhere buy weed tourists india indian citiesareas weed legal",
    "cleaned_selftext": "advice needed american tourists visiting india know weed legal parts us many americans used smoking weed several times day httpsenwikipediaorgwikicannabisinindiahttpsenwikipediaorgwikicannabisinindia based wiki page indian government strict cannabis policy according section ndps act holding small quantity weed land jail rigorous imprisonment six months fine rs really enforced httpswwwlostwithpurposecomweedindiawherehttpswwwlostwithpurposecomweedindiawhere theres article",
    "cleaned_comments": "yes enforced severity enforcement depends city smoke private space dont even try public spaces dont know kind cop come across travelling car much issue dont check weed cars know since banned would hard find seller especially decentgood quality one best bet local connect travel agency provides orrissa yes legal varanasi bhubaneswar find many shops google maps government bhang shops marijuana ganja available point yes ganja dried flower",
    "light_cleaned_title": "How/where to buy weed, for tourists in India? Are there any Indian cities/areas where weed is legal?",
    "light_cleaned_selftext": "Advice needed, for American tourists visiting India. As you know, weed is legal in some parts of the US. So, many Americans are used to smoking weed several times a day. [https://en.wikipedia.org/wiki/Cannabis\\_in\\_India](https://en.wikipedia.org/wiki/Cannabis_in_India) But. Based on the above wiki page, *\"Indian government is strict with the Cannabis policy. According to Section 20 of the NDPS Act,* ***holding a small quantity of weed can land you in jail for rigorous imprisonment of up to six months or a fine of Rs.*** ***10,000 or both***\\*.\"\\* Is this really enforced? [https://www.lostwithpurpose.com/weed-india/#where](https://www.lostwithpurpose.com/weed-india/#where) Then there's this article.",
    "light_cleaned_comments": "Yes, it's enforced, but severity of enforcement depends on city. You can smoke it in private space, but don't even try in public spaces, you don't know what kind of cop you come across. You will be travelling in car, so not much an issue, as they don't check for weed in cars, from what I know. Since it's banned, it would be hard to find seller on your own, especially a decent/good quality one. Your best bet is to have some local connect or your travel agency provides you. Orrissa. Yes its legal in Varanasi In Bhubaneswar you can find many shops on google maps. Government bhang shops.. marijuana (ganja) available point. Yes. Its ganja. The dried flower."
}