{
    "id": "1blc0gw",
    "title": "BJ Party masterstroke: Firm Building Uttarakhand Tunnel That Collapsed Donated Rs 55 Crore To BJP Through Electoral Bonds",
    "url": "https://www.ndtv.com/india-news/electoral-bonds-electoral-bonds-data-firm-building-uttarakhand-tunnel-that-collapsed-donated-rs-55-crore-to-bjp-through-electoral-bonds-5291065/amp/1",
    "selftext": "\n\nHyderabad-based Navayuga Engineering Company Ltd (NEC), which is constructing the Silkyara-Barkot tunnel in Uttarakhand, a portion of which collapsed last year, purchased Rs 55 crore worth of electoral bonds and donated the entire amount to the BJP, as per data released by the Election Commission.\n",
    "flair": "Crime",
    "score": 77,
    "num_comments": 5,
    "created_utc": 1711146244.0,
    "convurl": "https://external-preview.redd.it/k004xd1X_dpFhFsBwDotFFrckxYX080dn3alto0EpMw.jpg?auto=webp&s=cbf09b1b5af1a7315415c2856508c7fa78b3d71e",
    "comments": [
        "This government just keeps on delivering. pain, suffering and death that is.",
        "And they get all the votes and support too so guess they are delivering their end of the deal",
        "Why am I not surprised?",
        "Just to reiterate that there were _twenty one_ collapses on the same tunnel. And construction is proceeding with no interruption. [Link](https://www.thehindu.com/news/national/silkyara-tunnel-construction-to-restart-as-soon-as-the-debris-is-cleared-nhidcl/article67591660.ece)\n\nNavayuga also was involved in another accident:  \n\n[20 killed in girder machine collapse on Samruddhi Expressway in Thane](https://www.thehindu.com/news/cities/mumbai/construction-workers-dead-in-thane-after-girder-falls-on-samruddhi-expressway/article67144813.ece)  \n\nIf it were not for the EB purchase, the firm would have been blacklisted and their directors would have been in prison by now.",
        "These people were responsible for a few flyovers in Mangalore, which took 10+ years to complete. So much corruption"
    ],
    "cleaned_text": "bj party masterstroke firm building uttarakhand tunnel collapsed donated rs crore bjp electoral bonds hyderabadbased navayuga engineering company ltd nec constructing silkyarabarkot tunnel uttarakhand portion collapsed last year purchased rs crore worth electoral bonds donated entire amount bjp per data released election commission ",
    "cleaned_title": "bj party masterstroke firm building uttarakhand tunnel collapsed donated rs crore bjp electoral bonds",
    "cleaned_selftext": "hyderabadbased navayuga engineering company ltd nec constructing silkyarabarkot tunnel uttarakhand portion collapsed last year purchased rs crore worth electoral bonds donated entire amount bjp per data released election commission",
    "cleaned_comments": "government keeps delivering pain suffering death get votes support guess delivering end deal surprised reiterate twenty one collapses tunnel construction proceeding interruption linkhttpswwwthehinducomnewsnationalsilkyaratunnelconstructiontorestartassoonasthedebrisisclearednhidclarticleece navayuga also involved another accident killed girder machine collapse samruddhi expressway thanehttpswwwthehinducomnewscitiesmumbaiconstructionworkersdeadinthaneaftergirderfallsonsamruddhiexpresswayarticleece eb purchase firm would blacklisted directors would prison people responsible flyovers mangalore took years complete much corruption",
    "light_cleaned_title": "BJ Party masterstroke: Firm Building Uttarakhand Tunnel That Collapsed Donated Rs 55 Crore To BJP Through Electoral Bonds",
    "light_cleaned_selftext": "Hyderabad-based Navayuga Engineering Company Ltd (NEC), which is constructing the Silkyara-Barkot tunnel in Uttarakhand, a portion of which collapsed last year, purchased Rs 55 crore worth of electoral bonds and donated the entire amount to the BJP, as per data released by the Election Commission.",
    "light_cleaned_comments": "This government just keeps on delivering. pain, suffering and death that is. And they get all the votes and support too so guess they are delivering their end of the deal Why am I not surprised? Just to reiterate that there were _twenty one_ collapses on the same tunnel. And construction is proceeding with no interruption. [Link](https://www.thehindu.com/news/national/silkyara-tunnel-construction-to-restart-as-soon-as-the-debris-is-cleared-nhidcl/article67591660.ece) Navayuga also was involved in another accident: [20 killed in girder machine collapse on Samruddhi Expressway in Thane](https://www.thehindu.com/news/cities/mumbai/construction-workers-dead-in-thane-after-girder-falls-on-samruddhi-expressway/article67144813.ece) If it were not for the EB purchase, the firm would have been blacklisted and their directors would have been in prison by now. These people were responsible for a few flyovers in Mangalore, which took 10+ years to complete. So much corruption"
}