{
    "id": "15swube",
    "title": "Why arranged marriage is a thing in india?",
    "url": "https://www.reddit.com/r/india/comments/15swube/why_arranged_marriage_is_a_thing_in_india/",
    "selftext": "Possibly I will be be downvoted but why arranged marriage is a thing in india? \n\nI might challenge the social norms and put salt on the wound but doesn't that mean the people who pursue arranged marriage instead of love marriage lack charm and personality to pursue love marriage? And they lack the spine to challenge society and it's tradition and follow blindly what the society says and the parents do for them?\n\nI know Most of the men and women are been sexually repressed and talking about sex is considered as taboo and hell, even most rural parts of India doesn't even know about sexual education \n\nhttps://timesofindia.indiatimes.com/readersblog/xpresblogs/lack-of-sex-ed-45433/\n\nhttps://www.nytimes.com/1983/04/22/world/sexual-repression-in-the-land-of-the-kama-sutra.html#:~:text=Girls%20and%20young%20women%20are,and%20her%20family%20is%20disgraced.\n\nhttps://timesofindia.indiatimes.com/readersblog/dhruvslexicon/sex-education-still-a-taboo-in-india-2-23171/\n\nUnlike the western countries, where talking about sex doesn't matter much, but why India is backward in terms with it? It is because of religion and politics?  Why people can't find partner of their own?\n\nI mean yeah , everyone wants a bollywood filmy type marriage. But let's face the reality, half of the people can't even afford it except for the crazy rich. What parents do is that they find a girl to shackle up their life with a man they don't even know and they're expected to fall in love. I mean, what the fuck?\nAlso I think love and marriage is not always required in life, someone can be happy being single as well. It's not always doom and gloom, just change the perspective of  how you see life.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692208220.0,
    "convurl": "https://external-preview.redd.it/dmCbZGuUb6XxGth8fWKDFRcVZUFAeVC-zbJh81tCuVo.jpg?auto=webp&amp;s=16b87fc997e61788d034de17e354623b838c0f63",
    "comments": [
        "Because people can’t just meet other people. There is no social life or going out culture in India. The little that happens is because of schools and colleges, which became co-ed only a few decades ago.",
        "You know segregation?? Don't you. I know few of my male colleagues who have never talked to women,  women who have never talked to men. Whenever I ask few of them(women) some questions (related to some query), all they do is just nod their head. Not a word spoken. How can you expect that everyone here can find themselves a deserving partner.",
        "If you've ever been on a dating app, you'll instantly understand why arranged marriage is a thing in this country, especially for a guy.",
        "I know the reality of dating apps, also they're pretty toxic tbh",
        "Tujhe arranged marriage me bhi sabne reject kar diya kya dhakkan",
        "coz u can get cut into pieces, raped or blackmailed  while meeting a random stranger on dating apps",
        "Question - why is the other way considered \"forward\" and this way is \"backward\"? What is the scientific basis behind that classification?",
        "Main reasons:\n\n* society is structured around the community in India rather than individuals\n* caste endogamy (one of the biggest drivers of arranged marriage)\n\nMost people on this sub are in the upper echelons of society who have relative freedom and choice in the process, so they don't view it too negatively. For the vast majority of the country, especially in rural areas, AM is a social evil and the women have no say and are often married as young adults by their family.",
        "You aren’t downvoted for the question however all the garbage being spewed in rest of the post is quite “backward”.",
        "Probably because kids are raised to fear & respect elders, traditions, customs, culture, etc. \n\nIndependent thinking is rarely taught & respected.\n\n\"Family is the most important thing in the world\" is the bullshit shoved into our brains since childhood.\n\nThe moment you think differently, people immediately label it \"This is not foreign, this is India\" & call you Anti-Indian.\n\nThey think IDEAS/THOUGHTS/PHILOSOPHY or HUMANITY has human-made geographical boundaries.\n\nEveryone bleeds red, feels pain & happiness.",
        "I guess freedom of choice.\nI married through an arranged marriage. So, I am not against it if it is done the right way.\nI have seen numerous parents who emotionally blackmail their kids to give up on relationships to marry an unknown person of their choice. I have seen numerous arranged marriages where the prospective partners are not given time to even talk alone. That's gambling not marriage.",
        "I don't think it's that. It's more like freedom of choice without the consequences is what everyone means when they talk about this stuff. It's just that I never get why that is be default programs without any research or argument.",
        "Still beats me that people have faith in absolute strangers about the lives of their sons and daughters, and are totally against someone brought in by the same sons or daughters. 🤷‍♂️",
        "Shaadi.com is our tinder",
        "I don't think even in western countries where such marriages don't exist want to stay single for the rest of their lives just because they couldn't find a partner.",
        "Just pajeet things"
    ],
    "cleaned_text": "arranged marriage thing india possibly downvoted arranged marriage thing india might challenge social norms put salt wound doesnt mean people pursue arranged marriage instead love marriage lack charm personality pursue love marriage lack spine challenge society tradition follow blindly society says parents know men women sexually repressed talking sex considered taboo hell even rural parts india doesnt even know sexual education unlike western countries talking sex doesnt matter much india backward terms religion politics people cant find partner mean yeah everyone wants bollywood filmy type marriage lets face reality half people cant even afford except crazy rich parents find girl shackle life man dont even know theyre expected fall love mean fuck also think love marriage always required life someone happy single well always doom gloom change perspective see life ",
    "cleaned_title": "arranged marriage thing india",
    "cleaned_selftext": "possibly downvoted arranged marriage thing india might challenge social norms put salt wound doesnt mean people pursue arranged marriage instead love marriage lack charm personality pursue love marriage lack spine challenge society tradition follow blindly society says parents know men women sexually repressed talking sex considered taboo hell even rural parts india doesnt even know sexual education unlike western countries talking sex doesnt matter much india backward terms religion politics people cant find partner mean yeah everyone wants bollywood filmy type marriage lets face reality half people cant even afford except crazy rich parents find girl shackle life man dont even know theyre expected fall love mean fuck also think love marriage always required life someone happy single well always doom gloom change perspective see life",
    "cleaned_comments": "people cant meet people social life going culture india little happens schools colleges became coed decades ago know segregation dont know male colleagues never talked women women never talked men whenever ask themwomen questions related query nod head word spoken expect everyone find deserving partner youve ever dating app youll instantly understand arranged marriage thing country especially guy know reality dating apps also theyre pretty toxic tbh tujhe arranged marriage bhi sabne reject kar diya kya dhakkan coz u get cut pieces raped blackmailed meeting random stranger dating apps question way considered forward way backward scientific basis behind classification main reasons society structured around community india rather individuals caste endogamy one biggest drivers arranged marriage people sub upper echelons society relative freedom choice process dont view negatively vast majority country especially rural areas social evil women say often married young adults family arent downvoted question however garbage spewed rest post quite backward probably kids raised fear respect elders traditions customs culture etc independent thinking rarely taught respected family important thing world bullshit shoved brains since childhood moment think differently people immediately label foreign india call antiindian think ideasthoughtsphilosophy humanity humanmade geographical boundaries everyone bleeds red feels pain happiness guess freedom choice married arranged marriage done right way seen numerous parents emotionally blackmail kids give relationships marry unknown person choice seen numerous arranged marriages prospective partners given time even talk alone thats gambling marriage dont think like freedom choice without consequences everyone means talk stuff never get default programs without research argument still beats people faith absolute strangers lives sons daughters totally someone brought sons daughters shaadicom tinder dont think even western countries marriages dont exist want stay single rest lives couldnt find partner pajeet things",
    "light_cleaned_title": "Why arranged marriage is a thing in india?",
    "light_cleaned_selftext": "Possibly I will be be downvoted but why arranged marriage is a thing in india? I might challenge the social norms and put salt on the wound but doesn't that mean the people who pursue arranged marriage instead of love marriage lack charm and personality to pursue love marriage? And they lack the spine to challenge society and it's tradition and follow blindly what the society says and the parents do for them? I know Most of the men and women are been sexually repressed and talking about sex is considered as taboo and hell, even most rural parts of India doesn't even know about sexual education Unlike the western countries, where talking about sex doesn't matter much, but why India is backward in terms with it? It is because of religion and politics? Why people can't find partner of their own? I mean yeah , everyone wants a bollywood filmy type marriage. But let's face the reality, half of the people can't even afford it except for the crazy rich. What parents do is that they find a girl to shackle up their life with a man they don't even know and they're expected to fall in love. I mean, what the fuck? Also I think love and marriage is not always required in life, someone can be happy being single as well. It's not always doom and gloom, just change the perspective of how you see life.",
    "light_cleaned_comments": "Because people can’t just meet other people. There is no social life or going out culture in India. The little that happens is because of schools and colleges, which became co-ed only a few decades ago. You know segregation?? Don't you. I know few of my male colleagues who have never talked to women, women who have never talked to men. Whenever I ask few of them(women) some questions (related to some query), all they do is just nod their head. Not a word spoken. How can you expect that everyone here can find themselves a deserving partner. If you've ever been on a dating app, you'll instantly understand why arranged marriage is a thing in this country, especially for a guy. I know the reality of dating apps, also they're pretty toxic tbh Tujhe arranged marriage me bhi sabne reject kar diya kya dhakkan coz u can get cut into pieces, raped or blackmailed while meeting a random stranger on dating apps Question - why is the other way considered \"forward\" and this way is \"backward\"? What is the scientific basis behind that classification? Main reasons: * society is structured around the community in India rather than individuals * caste endogamy (one of the biggest drivers of arranged marriage) Most people on this sub are in the upper echelons of society who have relative freedom and choice in the process, so they don't view it too negatively. For the vast majority of the country, especially in rural areas, AM is a social evil and the women have no say and are often married as young adults by their family. You aren’t downvoted for the question however all the garbage being spewed in rest of the post is quite “backward”. Probably because kids are raised to fear & respect elders, traditions, customs, culture, etc. Independent thinking is rarely taught & respected. \"Family is the most important thing in the world\" is the bullshit shoved into our brains since childhood. The moment you think differently, people immediately label it \"This is not foreign, this is India\" & call you Anti-Indian. They think IDEAS/THOUGHTS/PHILOSOPHY or HUMANITY has human-made geographical boundaries. Everyone bleeds red, feels pain & happiness. I guess freedom of choice. I married through an arranged marriage. So, I am not against it if it is done the right way. I have seen numerous parents who emotionally blackmail their kids to give up on relationships to marry an unknown person of their choice. I have seen numerous arranged marriages where the prospective partners are not given time to even talk alone. That's gambling not marriage. I don't think it's that. It's more like freedom of choice without the consequences is what everyone means when they talk about this stuff. It's just that I never get why that is be default programs without any research or argument. Still beats me that people have faith in absolute strangers about the lives of their sons and daughters, and are totally against someone brought in by the same sons or daughters. 🤷‍♂️ Shaadi.com is our tinder I don't think even in western countries where such marriages don't exist want to stay single for the rest of their lives just because they couldn't find a partner. Just pajeet things"
}