{
    "id": "1hhtd53",
    "title": "I visited villages of India and this is the situation ",
    "url": "https://www.reddit.com/gallery/1hhtd53",
    "selftext": "\n\nI have been serving in Sagroli Village of Maharashtra for sometime now. Today, I had a chance to visit the houses of the Orphaned, Single Parented and Under Privileged Students in the neighbouring villages who live in our hostels. It was an extremely humbling and eye-opening experience. I also found out that there are hundreds of more students living like this, unable to study and need our help. This is what we need to contribute to when we have the privilege living under a cemented roof. The real India out there is extremely deprived and distressed.\nI am extremely determined about making a difference in the lives of their next generation, please help me in this endeavour by contributing whatever you can. The real India needs you!\n\nLink to donate: https://www.unitedwaymumbai.org/fundraiser/23875",
    "flair": "Rant / Vent",
    "score": 5340,
    "num_comments": 431,
    "created_utc": 1734616413.0,
    "convurl": "https://i.redd.it/tte29f449t7e1.jpg",
    "comments": [
        "Ref your previous post - Can we directly try sending help to the school? Like books or equipment that they can use?",
        "Yeah, you can definitely do that as well! There’s an amazon wish list for the things we require, I’ll share it here: https://www.amazon.in/hz/wishlist/ls/1BHW9KWWMUX7T?ref_=wl_share",
        "\\> The real India out there is extremely deprived and distressed\n\nBtw, if you did not know, the Indian govt. considers these people above poverty and counts them in the 400 million people lifted out of poverty in the last decade. This is the success story we are supposed to be proud of. If this is not extreme poverty, and this is what lifting people out of poverty looks like, then we've got a problem that will be prevalent till eternity.",
        "amazing work 🧡",
        "Majority of India has lived, is living and will continue to live like this but don't worry we'll soon be 5 trillion economy",
        "Exactly friend, exactly. Government has completely ignored this region and giving lollipops in the name of upliftment. If you can and want to help them, please do consider donating. Now only civil society can make a difference. https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you!! Please do donate whatever you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly!! Please do help us help them. Do contribute whatever you can, they really need it: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Then only thing I can see and wonder where is my fking GST TAX is going .... But they seem to have a peaceful life ... But let them get proper food shelter and medical service",
        "That’s exactly what we want. Many of them do not get food three times a day. Please help us help them! https://www.unitedwaymumbai.org/fundraiser/23875",
        "Sanskriti Samvardhan Mandal (SSM) is a small but deeply impactful NGO working in one of the most challenging regions of India—the drought-prone Marathwada area in Nanded district, Maharashtra. In a place where poverty and drought have left countless families in distress, SSM has taken on the monumental task of bringing hope and change to those who need it most—particularly vulnerable children.\n\nAt the heart of SSM’s mission is Anand Balgram, a home for orphaned children whose lives have been shaped by the harsh realities of this region. These children have lost more than just their families—they have lost their sense of safety and security. Anand Balgram offers them a new beginning. It’s more than just a shelter; it’s a place where they receive nutritious meals, a nurturing environment for their education, and the emotional support they need to heal. Here, children are given the opportunity to dream again, to grow, and to become confident individuals who can face the world on equal footing with others.\n\nSSM also recognizes that the future of this region lies in education, which is why it works tirelessly to ensure that even children from the most financially and socially disadvantaged rural communities have access to quality learning. Visitors to the NGO’s schools have often remarked that the standard of education rivals some of the best institutions in the country. SSM believes that where a child comes from should never limit their potential, and every child, no matter their background, deserves a fair chance at a better future.\n\nBeyond supporting children, SSM also focuses on empowering rural youth and women through skill development and vocational training. In communities where opportunities are scarce, SSM helps individuals gain the skills they need to break free from the cycle of poverty and build independent, sustainable livelihoods. The organization’s work is grounded in the belief that real development happens when people are empowered to shape their own destinies.\n\nFor over four decades, SSM has been quietly transforming lives in some of the most neglected parts of rural India. Whether it’s providing a safe haven for orphaned children or opening doors to education and employment for the rural poor, SSM’s work is driven by a simple yet powerful belief: that with the right support, everyone has the potential to rise above their circumstances.\n\nBy supporting SSM, you are not just giving aid; you are investing in the lives and futures of children, youth, and women who will one day be the strength of their communities and our country.",
        "Donated. And props to you for going to the ground and doing your part, not all of us are that determined in life. You've got a gift you don't know.\n\nI want to keep you motivated but let me still speak the reality - the civil society cannot uplift millions of people out of poverty; that is why democracies need government; that is why we pay taxes; that is why governments are structured to do this job; else you can go deep into the roots and ask yourself, why do we even governments and civil servants; shouldn't military rule be enough?",
        "Sanskriti Samvardhan Mandal (SSM) is a small but deeply impactful NGO working in one of the most challenging regions of India—the drought-prone Marathwada area in Nanded district, Maharashtra. In a place where poverty and drought have left countless families in distress, SSM has taken on the monumental task of bringing hope and change to those who need it most—particularly vulnerable children.\n\nAt the heart of SSM’s mission is Anand Balgram, a home for orphaned children whose lives have been shaped by the harsh realities of this region. These children have lost more than just their families—they have lost their sense of safety and security. Anand Balgram offers them a new beginning. It’s more than just a shelter; it’s a place where they receive nutritious meals, a nurturing environment for their education, and the emotional support they need to heal. Here, children are given the opportunity to dream again, to grow, and to become confident individuals who can face the world on equal footing with others.\n\nSSM also recognizes that the future of this region lies in education, which is why it works tirelessly to ensure that even children from the most financially and socially disadvantaged rural communities have access to quality learning. Visitors to the NGO’s schools have often remarked that the standard of education rivals some of the best institutions in the country. SSM believes that where a child comes from should never limit their potential, and every child, no matter their background, deserves a fair chance at a better future.\n\nBeyond supporting children, SSM also focuses on empowering rural youth and women through skill development and vocational training. In communities where opportunities are scarce, SSM helps individuals gain the skills they need to break free from the cycle of poverty and build independent, sustainable livelihoods. The organization’s work is grounded in the belief that real development happens when people are empowered to shape their own destinies.\n\nFor over four decades, SSM has been quietly transforming lives in some of the most neglected parts of rural India. Whether it’s providing a safe haven for orphaned children or opening doors to education and employment for the rural poor, SSM’s work is driven by a simple yet powerful belief: that with the right support, everyone has the potential to rise above their circumstances.\n\nBy supporting SSM, you are not just giving aid; you are investing in the lives and futures of children, youth, and women who will one day be the strength of their communities and our country.\n\nPlease help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly, I know exactly what you are saying. It’s the saddest reality of our country. I said so because government has completely ignored this region. If not them then who? And how do we?",
        "respect to you, your doing god's work",
        "Thank you so much friend. Please do donate whatever little you can! https://www.unitedwaymumbai.org/fundraiser/23875",
        "Yes they could probably use some help but pretty sure they have a happier life than someone slogging in corporate under a fancy roof, laying on top of plushy mattress.",
        "We have extremely terrifying requirements for what is considered \"liveable\" or \"above poverty\". Rs. 1200 a person in urban area is considered \"above\" the poverty line. It makes me wonder how detached from reality our policy makers are. Can you imagine living on 1200 in a small city like Amritsar in punjab, let alone a city like Pune or Mumbai?\n\nThese people you posted? They are not even poor according to our govt standards. We present this image to the world that our country lifted millions of people out of poverty when in reality they are living on basically nothing. \n\nTo put it in perspective:\n\nA gas cylinder costs between 800-900.\n\n2kg ghee is 1300rs.\n\n1 kg apples is 250ish.\n\nFreaking Rajma cost above 100rs/kg.\n\nThese people are not living, they are surviving.",
        "It is 6 degrees here and they have no door, that’s how the uncle in the second picture sleeps. Do you really think they are happy? He lost his wife and daughter due to maternal mortality. It’s sickening.",
        "Exactly!!",
        "Please do donate whatever little you can. Do it for them and their future. Even Rs 50 counts! Please do: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Most NGOs are fraud. Whoever has worked in NGO Sector knows the truth.",
        "And yet our country's beggest problem is \"What is there below that masjid ....\" \\\\s",
        "I never said they do not need help logistically.",
        "I have worked in NGO sector and no NGOs are not fraud, especially the ones working from villages.",
        "1200 per what? Month?",
        "Maybe not in terms of finances, but they look extremely stress free from their lives.\nWhile we live in constant fear of uncertainty and competition. \nTheir is much more laid back and relaxed.\n\nBut yes, financially their condition could be improved.",
        "That's one really self centred and delusional take.",
        "It is 6 degrees here and they have no door, that’s how the uncle in the second picture sleeps. Do you really think they are happy? He lost his wife and daughter due to maternal mortality. It’s terrible for them.",
        "Which states?",
        "Yup. About 1200-1250 a month is national average for Urban India. I think for rural, its about 1000 or 1100 a month.",
        "I grew up like this. When i visit my hometown there still about 80-90% families still living like this.",
        "This is how look like 60 percent of India\n\nAlmost all reddit users are financially rich they never accept this India\n\nIndian government failed to provide basic right like water, food,..\n\nMajority of indian citys villages forests polluted with untreated pharma waste including river bodies\n\nMany states ground water is dried\n\nIndia produce too much food still facing hungry starvation because of miss management and also wasted huge food on daily basis same for vegetables fruits",
        "the villages in Maharashtra,odisha and madhya pradesh make you question what year you live in. the government put so much efforts into north indian villages they forgot about these places, im pretty sure right now as we speak a child died due to water contamination (cholera mostly) in a village. mortality is so common in these places people have gotten used to it.",
        "  \nPeople who’ve grown up in cities often see India through an urban lens...like streets, slums, and tourist spots, which is just a small part of the country. The real heart of India lies in its villages, where most people live with a different perspective on life. You can ask for donations, but portraying \"real India\" as only deprived and distressed is a misleading narrative designed to evoke sympathy and prompt people to send money. Often, these narratives are crafted to raise funds for organizations or to gain likes and comments, but they ignore the fuller, richer picture of rural life.\n\nMany villagers aren’t materialistic or in a rush to move to cities. They are deeply connected to their roots, living a life centered around community, simplicity, and tradition. While they may not have much in material wealth, their understanding of family, happiness, and fulfillment often runs deeper.\n\nTo truly grasp the essence of India, spend time in a village. Conversations with locals, learning about their views on life, work, and progress, can be eye-opening. It’s a world largely untouched by the relentless drive for urbanization and material growth that dominates the cities. To compare India to countries like the US or France based solely on poverty misses the greater complexity.\n\nVisiting a village is one thing, but immersing yourself in village life shifts your perspective. Many people there are not chasing \"modern\" ideals or dreaming of city life...they define progress and success in their way, one that’s not tied to material accumulation.\n\nYou don’t need to travel to villages just to capture images of poverty. The harshest conditions can be found in cities too.",
        "Unbelievable\n\nIn Hyderabad to just get a bus pass for a month is around 1200",
        "They are not stress free life, nobody choose such life\n\nThey just accept and living with this conditions",
        "Never ask barber if you need a haircut.",
        "This isn't a North-south issue. I don't know about tamilnadu or kerala. But much of rural Andhra, Telangana is EXACTLY like this. Extremely dilapidated conditions all across.",
        "I hate to be the opposite voice and admit that if I don't see something doesn't mean it doesn't exist.\n\nBut in my village which is on the way to becoming a small town, most of the people who used to live in huts or worse have gotten a concrete house and is nearly open defection free (I know this because it used to be impossible to walk in my fields without almost stomping on shit every 5 sec)\n\nI cannot make claims about their income because I don't know that personally.",
        ">Many villagers aren’t materialistic or in a rush to move to cities.\n\nIt is not materialistic to have a properly insulated and heated home when it's six degrees outside. It's not materialistic to be able to cook without killing your lungs. It's not materialistic to be able to afford food that doesn't make your children suffer from malnutrition. These are the basic necessities of life, don't try to trivialise the situation of these people. The poor in developed countries (not the US) have all these things, despite their financial situation.",
        "Villages in India >>> Cities of India",
        "This is the reflection of so called Amrit Kal, Vishwa Guru, 5 trillion economy, blah blah blah......",
        "im not framing it as a north south issue, i dont know much about south villages... never been there. but what i do know is north villages like the one from which i originate, went from electricity for 4 hours in 2 days to 18-20 hours of electricity daily which is the case now. the government scheme of cylinders also came there but not as we go down.",
        "Not much different from how construction and other daily wage workers live in cities.",
        "Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "It is 6 degrees here and they have no door, that’s how the uncle in the second picture sleeps. Do you really think they are happy? He lost his wife and daughter due to maternal mortality. It’s terrible for them.",
        "Maharashtra.",
        "How many kids do they have? \n\nCan they read or write?\n\nHow much money did they spend on education Vs marriage Vs rituals?\n\nWhat do they prioritize more, education or religion?\n\nDo they have a backward mentality? Like caste caste caste...\n\nIt's not like they're not little responsible for their condition.",
        "If anything you take from this post, Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Every where there is problems 😭",
        "In all the houses I visited, they have 2 children at most. Even though they earn extremely less all their children have been put into schools including girls.",
        "Meanwhile my middle - upper class parents and family only talk about the GDP and how things are improving, never any talk about the struggles many still go through. I’m living in the U.S. and they always try to convince me that India has become way better to live in the 5 years since I left.",
        "Why they are not considered poor?",
        "You are doing a great job OP! Where exactly is Sangroli ?",
        "It’s a village that comes under Nanded district of Maharashtra.",
        "Look at the threshold used - [https://www.newindianexpress.com/web-only/2024/Feb/29/has-extreme-poverty-vanished-in-india-and-is-it-time-for-the-poverty-line-to-be-redrawn](https://www.newindianexpress.com/web-only/2024/Feb/29/has-extreme-poverty-vanished-in-india-and-is-it-time-for-the-poverty-line-to-be-redrawn)\n\n>Currently, we use the Tendulkar poverty threshold, where a person living on a monthly expenditure of Rs 1,000 per month or Rs 33 or less per day in cities, and Rs 816 per month or Rs 27 or less per day in villages is considered poor.\n\nI am sure these people earn more than Rs. 27 per day, do you think that is enough for a proper house?",
        "Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "thank you, appreciate the work towards this, donated!",
        "Exactly! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Tax nai dena ur normal kaam karna hai tension free life life mast life na kapda na gas na light sab bachat aur sukoon ki zindagi they mast",
        "It's even worse in my area.",
        "According to many redditors here, any govt support to them is a waste and against the interest of bjparty, or  like they prefer to say , the nation. They don’t want these people to get any “freebies”.",
        "Exactly. Please do help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "I want to know which places are these...?",
        "Hipparga, Shevara and Shimpala villages in Nanded district of Maharashtra.",
        "Great initiative. Keep it up.",
        "Thank you for your work. Donated my part",
        "Ache din",
        "Every country was poor at some point. But they worked their way out of it.\n\nWe didnt. Because our people kept voting for the worst outcome. They still do. \n\nYou're doing great work. But I personally can't have sympathy for our people.",
        "Exactly! Please do help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "They are in rural area",
        "This is the India I came from. This is the India I miss, sometimes.",
        "You do not have the choice to be happy unless your basic needs for living are satisfied , which in this case are not.",
        "It might be the case there.\n\nBut rural india in general has a very anti -progressive culture and mindset.\n\nThey spend lakhs (no matter how poor) in marriages.\nAnd all they do is caste-caste-caste-religion-religion-religion 🤡\n\nThey don't spend nearly the same in education.\nNo government can fix this issue immediately, not congress, not the BJP, no one.\n\nNeed some educational revolution, and need to put a big chunk of GDP on improving educational Infrastructure (that's where i wanna see my tax money go)\n\n\n\nIn short:- centuries of poverty can't be fixed immediately and culture is more responsible than the government.\nThe government is ineffective though.",
        "the result of jumping straight to service sector and ignoring manufacturing. \n\nIndia missed the boat, we could still bring a change unless we are ready for large scale reforms. but the cowards in center are scared of getting Delhi surrounded by the landlord class pretending to be working class.",
        "Is there a way to just scan QR code and donate ?",
        "Hi Akash, this is to ensure that the money that is coming is white and for you to get tax rebate. But if you wish you can directly donate to riyajoshi2.rj@oksbi and I will ensure all the money that comes through goes through the proper channel.",
        "It’d probably make more sense to fight for an institutional change, than donating money to some random charity however trustworthy they may seem. We need a fundamental change in this country, in the minds of the people, money will come and go, but the mindset of the corrupt politicians would never change unless the common populace forces them too.",
        "Hey!! They are breathing the air, isn't that enough leverage they have according to filthy rich & politicians.",
        "https://preview.redd.it/co3tyqpjqt7e1.jpeg?width=1170&format=pjpg&auto=webp&s=0d2d5d273c03f73381d03d921e7c54658c13465d",
        "Thanks for the explanation 🙏",
        "People who live in their rich utopian bubble won't even believe that this is also India.",
        "Disagree. Industries are struggling for labour, job paying 15 k a month . One needs to step out of their comfort zone, so many manual jobs are available",
        ":)) sad.\nDo help if you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Keep trying that, one vote at a time. One protest at a time.",
        "Both things can be true, however. India has a lot of problems. But things have also improved for a lot of people. We need to make sure they continue improving, and not just for some, but for all.",
        "Exactly!! :))",
        "Do help if you can friend: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Do help them get three meals, let’s try to provide what we can to this India: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly! Do help whatever you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "https://preview.redd.it/a5hq8290st7e1.png?width=1080&format=pjpg&auto=webp&s=07fd2d732ac9c64d01237ade010051e4cd65d966\n\nOther community posts, same pictures but different title...",
        "It does not reflect all the villages in india. \n\n( i grew up in a village in kerala)",
        "I wish better times for these people but it's quite possible they are happier, healthier even than us corporate slaves making loads of money. I know people absolutely miserable for 50 hrs a week but can't quit.",
        "This is the answer for why we still have this situation even after 80 years of independence\n\n[https://www.youtube.com/watch?v=-mdtUsMVRjA](https://www.youtube.com/watch?v=-mdtUsMVRjA)\n\nI know many here would not like this view of mine, but in most parts of india, rural, small cities, we still have the view of upper class benefit, lower class remain lower. Look at how our finance minister also taxes us. Its all part of the same thought. I will not get into the nitty gritty of things but as long as we have this view towards our people  (low or high, rich or poor), we as a country will not get rid of this even in another 80 years.",
        "I titled this the same but r/india removed it by stating it’s a clickbait title. Hence I had to change.",
        "It’s Ofcourse me posting. We need help, they need help. Help if you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Do help the people in the village of Maharashtra. https://www.unitedwaymumbai.org/fundraiser/23875",
        "Okay...",
        "Thank you for hoping friend. Please do help whatever little you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "If it was stress free, more people would give up their worldly pleasures & live like this.",
        "Thanks for sharing this friend. Please do contribute whatever you can in helping them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "i have always wanted to live like this, i have never enjoyed suburbs",
        "You are romanticising villages too much. Even villagers don't like living in villages - about 1/3rd of India lives in cities, massively up from older data. This is because of migration to cities.",
        "Hey OP, great work :)  \n  \nI prefer not to donate through organizations, as I believe directly giving money won't solve the root problem. Instead, I’m happy to support a child in their education, potentially covering all expenses till 10th/12th class.\n\nHaving lifted my own family out of tough circumstances, thanks to the best education I was fortunate to receive, I understand its value.\n\nIf you know a child who genuinely wants to study but have financial constraints, please connect me. My sister and I would love to support them, not just financially but also with mentorship. We genuinely believe that even a little guidance from us could potentially change someone’s life :)",
        "Looking at these photos it looks exactly like Bangladesh. I would be honoured to donate to this NGO. Also the photos are really good.",
        "PM Awaas Yojna ka paisa khaa gaye? \n\nIn my village almost every one has an RCC house thanks to Indira Awaas & PM (Modi) Awaas Yojna",
        "NORTH Indian",
        "\n\n\n\"No exaggeration, but there are also some perks to village life:\n\n- Good air quality and less pollution\n- A more social environment\n- Lower inflation (it's really like that)\n- Fitness - I've noticed that people in villages tend to be fitter than those in my city\n\nHowever, there are also some drawbacks:\n\n- Transportation limitations\n- The position of females (although I think males have it worse in this country)\n- Limited educational opportunities\"\n\n\nI know experience can vary mine is from a village form rajasthan",
        "Please do donate whatever you can friend: https://www.unitedwaymumbai.org/fundraiser/23875\nGod bless you!",
        "Thanks",
        "Whatever you can say about India the opposite is also true",
        "Bhai kaun se garib jaaon main chali gayi aap.",
        "I have a friend in Tamil nadu who is living in similar kinda home. He is holding 6acre land there. Just don't know why he is living like that. Nothing related to it. Just my mind stucked on it now when i see this post.",
        "Uh huh is this your personal bank account?",
        "They are poor and the government is corrupt and does not have its priorities right",
        "Village of any growing economy on earth is like this. Those who are educated there or hardworking can grow out of it. \nI am not blaming any government UPA or NDA. \nI believe India has done tremendous work in economic growth considering that they started from nothing in 1947. \nIt is easy to take random rural undeveloped photos and blame it on government by comparing it to Europe. \n\nWhere we were and where we are now is the right comparison. In terms of countries to compare, BRICS, South East Asian countries and immediate neighbours would be the right comparison",
        "I use this one to only collect funds, my personal bank account is different. \nI’d always suggest to donate through the link as it will ensure the money is white and you get tax rebate: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly! Please help whatever you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Jaha jaane ki zarurat hai. Jaha lakhon mei log hai.",
        "Try visiting Western UP villages also. You’ll see prosperity.",
        "Try helping one step at a time: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Though I'm not happy about being born in India, I'm grateful for at least being born into an urban family",
        "You can also get help from Wipro, Hcl and Piramal’s Corporate Social Responsibility Fund",
        "Yes. It’s like this everywhere",
        "my god.",
        "You know what I used to be scared of in my life. I might die without changing any of this since the system behind is so powerful and untouchable enough for a common man to even think about.\n\nI’m just 26, entering this area of world learning and growing. Seniors here, Help me with this - who is responsible for their well being and liveability - Their village? State govt? Central govt? Society? God?  Or they themselves?",
        "I saw the critieria from another comment.",
        "Hi, tried it. They also don’t prefer such remote locations.",
        "What is SSM?",
        "It’s never black and white. It’s the combination of all these factors mate.",
        "Do help in changing bit by bit if you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "SSM is an NGO working in Sagroli Village, Nanded district Maharashtra.",
        "Know more about it here: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Do help if you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Yes! Do try to help them though: https://www.unitedwaymumbai.org/fundraiser/23875",
        "The villages in Punjab and J&K are far better than this. Even 2 decades back they were better than how this looks currently. This is not true for whole of India.",
        "Do try to help in whatever extent you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you so much!!",
        "This part known as Marathwada is completely ignored.",
        "Exactly!! Do help in whatever capacity you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you so much friend, god bless you!",
        "Yes that’s exactly what this fundraising is about. https://www.unitedwaymumbai.org/fundraiser/23875\nBut I can personally connect you to a child definitely. There are SO MANY OF THEM.",
        "I think the ultimate weapon the non-rich have is the choice not to procreate....if there are no poor left to exploit then there are no rich people ....\nHowever the society conditions all of us to think this isn't really a choice and many aren't even aware... children are unfortunately treated as property, across all economic strata...maybe more so on the lower end....\nThe suffering is mostly by the child who will most likely perpetuate the cycle \n\nRest, we can help one starfish at a time",
        "Yes we are trying to help the next generation. https://www.unitedwaymumbai.org/fundraiser/23875",
        "This really puts things into perspective, and also shows how detached we are from our own country and society. Donated for the cause with whatever I could and I hope they get some relief from these dire situations. Thank you for bringing this to light OP. Kudos!",
        "Did they have proper washrooms?",
        "This isn’t the majority case.",
        "Oh\nI am glad my local leaders are good.\nI can just pray for them 🙏",
        "No",
        "Spent childhood in worse house than this, and now villages are getting better over time.",
        "Isn't population also an issue ? We would also soon be 5 billion if we keep reproducing at this rate",
        "I wrote an article on why India will improve 4 years ago. It’s been a downfall since then.",
        "few people don't there are villages in India where electricity doesn't have electricity",
        "True. Villages in my state are nothing like this. This feels like a different country.",
        "can i teach them for free?im from kerala and a med student .. do i wanna go there? or online? or can i teach them  during my vacation?",
        "You can definitely teach them during your vacations. Internet is a problem here.",
        "Although there are villages that are so better compared to these . But the govt surely need to look at the conditions of these villages as well",
        "They look happy",
        "Thank you for the response",
        "At least man they are happy breathing in 40-50 aqi meanwhile me being a chain smoker without smoking. They eat good unlike me eating fruits and vegetables full of pesticides and insecticides.",
        "It doesnt look terrible, simple but the people look fairly healthy? Do they have jobs, futures? This is what matters more than the material condition they live in.",
        "Suddenly feeling grateful for everything I have.",
        "When india will provide free education?? Despite we know how Ambedkar has made a huge difference, current gov keep ignoring the reality and insulting who made the constitution",
        "Please do help them in whatever capacity you can:https://www.unitedwaymumbai.org/fundraiser/23875",
        "That means India people wants to remain humble and rooted to earth.. Come to my city I'll show you how millionaires still roam on Splender Plus and not in any braded cars. Come to Bengaluru buddy I'll show you at least 10 people who in Innova to get the free ration provided by govt and they own BPL card even after being karodpatis",
        "https://preview.redd.it/6fot3ec1fu7e1.jpeg?width=1080&format=pjpg&auto=webp&s=697914a93daeccfa61f714f395492472b6b92163\n\nGod bless you & everyone.",
        "A lot of work is needed to be done by us.",
        "Atleast they're happy man!!! Don't ruin it",
        "I understand, but I have my reasons for not contributing in fundraising campaigns. Thanks, and feel free to DM me anytime!",
        "blah blah blah, you are educated, i ask you what is your solution.",
        "As an American who has visited Mumbai and wants to learn more, Rs 27 is the equivalent of 32 US cents. That is less than 1/3 of a US dollar. How on earth can that NOT be considered poor? I enjoyed my visit, but I want to learn more about the population in general. The disparities between wealth and poverty in Mumbai were shocking for me. And I genuinely want to understand more of the politics and the reasons for these disparities. As I am disabled, I don't know how much I can help. But I can help raise awareness, and help those around me appreciate what we have. I wish peace to all.",
        "Donated via UPI",
        "i'm not arguing here just want to add that poverty isn't just how much money people make but considers various factors. Like, are they eating enough calories, do they have a roof over their heads, access to education, jobs, etc. You're right though that rs27 is appallingly little.",
        "The sad reality is deliberately overlooked by the politicians and the mainstream media in exchange for religious propaganda and dreams an akhand Bharat.",
        "I agree with you. But much of that is determined by income. There are also factors like medical care. In Navi Mumbai, it seemed like there were engineering schools on every other block. Small hospitals were plentiful. But that doesn't help if the person cannot access these amenities due to income. I understand that some charities help. I'm not sure how much the government helps because I do not have a firm grasp of the politics of India. There is so, so much potential in India. India produces some of the best doctors, scientists, and engineers in the world. But that doesn't help the common person who has nowhere safe to sleep during monsoons.",
        "panjab villages are nothing like this",
        "Damn the situation is a lot better than what I expected",
        "Exactly! Please do help in whatever capacity you can! https://www.unitedwaymumbai.org/fundraiser/23875",
        "Please do help in whatever capacity you can! https://www.unitedwaymumbai.org/fundraiser/23875",
        "God bless you friend!",
        "Not commenting about there financial situation, but they may have better happiness index than people in the cities or even people of USA or other so called developed countries.",
        "Genuine Question:\nWhen will we become a developed Nation ?\nHow can we achieve this ?\nWhy aren't we able to achieve this ?",
        "Why do you miss it, I suppose it's not the hardship but something else?",
        "India will never improve under a ultra-religious party, like BJP, only few people can become rich that's it.",
        "80 percent india is like this",
        "Please do help them in whatever capacity you can! https://www.unitedwaymumbai.org/fundraiser/23875",
        "this is what the tax payers pay money for. so thst govt can uplift these people \n\nbut they ghanta give a shit. as a taxpayer, you pay 30% of your salary and then have to pay huge living expenses for a metro city.",
        "You’ll know the best! Do help in uplifting others too: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly!! Do help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "That’s true. We need to start from somewhere. Do help us help them!",
        "Sure. I’ll let you know the exact requirements and DM you tomorrow. There are small things like there are girls who need money for school bag etc.",
        "Thank you so much, god bless you!",
        "These villages are from Maharashtra.",
        "They literally have nothing to eat. That’s why we need help to help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you so much friend, god bless you!",
        "Cfbr",
        "Dunno where the taxes go …  actually we know",
        "True. Do help us provide education to them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you friend, god bless you!",
        "That’s why we need help to help such people. Do contribute whatever little you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you friend, do contribute whatever little you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly! :)) Do help us help then though: https://www.unitedwaymumbai.org/fundraiser/23875",
        "It’s terrible. Do help us help them though, you’ll get the tax rebate as well: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Feels a bit cherry-picked, to consider this the entire village. I totally believe you, but i hope you understand my view.",
        "As a matter of fact, this is not extreme poverty as present in India. Things are, too often, worse than this.",
        "The real India",
        "I have specifically mentioned in the post to which houses I went. But there was one village where there were only tin houses except for one. It was pretty bad. Do help in whatever capacity you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "About to comment these",
        "they're more happy ththan 70% of us here",
        "Do help us help them in whatever capacity you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Do help us help them in whatever capacity you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "If you come across any patients requiring medical help, do let me know. Will surely arrange for their treatment in my hospital absolutely free of cost.",
        "Their definition of happiness is not the same as ours.",
        "They keep their home and surroundings so clean.",
        "what is the definition of happiness",
        "There are all kinds of people with different preferences. Many from cities are moving to smaller towns and villages for a quieter, better quality of life. Agriculture, for instance, is something you just can't do in a city. So, saying nobody likes village life is overly simplistic. It's about personal choice and opportunity.  \nIf you think Indian villagers are extremely deprived and distressed, and nobody wants to live there, it's your perspective. I have shared mine.",
        "Happiness is subjective. Your socioeconomic status plays a major role in what you perceive as happiness. \nFor the oppressed and destitute, getting two meals a day could bring happiness. But it clearly doesn’t mean that they deserve just that.",
        "That’s what a developing country means. It will keep on developing because development is needed not for the people but for the leaders we elect.",
        "Womp womp womp.",
        "You could release Swadesh today and would feel contemporary. The only difference would be mobile phone and internet.",
        "You do realise that we’ve lifted millions out of poverty right?",
        "I just teared up looking at the images and reading the caption. It hurts how bad the situations are while we go on our lives worrying about our wants. It hurts how many stories and families go unnoticed and it pains me to understand that our country still is at this level. Kudos to you, maam, for such good work! I’d suggest cross posting to other subreddits too. (Someone please help where else can this be posted).",
        "That's what I'm saying these are the people who the government claims to have lifted out of \"poverty\"",
        "‘Government claims’. Its a UN report. \n\nhttps://www.thehindu.com/news/international/india-registers-remarkable-reduction-in-poverty-with-415-million-people-coming-out-of-it-in-15-years-united-nations/article67066698.ece/amp/\n\nYou have such amnesia that you’re willing to overlook anything and everything good. Bless your heart, mate. Because that’s quite a miserable way to live life",
        "Was that an actual toilet seat they made? Used to just poop in a toilet hole in the ground. At least it was like that visit family in New Delhi in 2002.",
        "I'm not saying that poverty has not been reduced but that thr government has manipulated the definition of poverty to show a bigger number than what actually is",
        "I don't believe few selected shots are right metrics for the huge ass country. Although I do empathize with the poor people. Shouldn't we look at number of roads, hospitals, schools, electrification, toilets across the country. Did you ask them what prevents them from getting better jobs?",
        "Tax lago sab par. /s",
        "Upvoting and commenting for better reach",
        "I think downvoters have issue fathoming deep messages in a conversation. Good luck lol",
        "So why didn’t Congress lift them out of poverty before 2014?",
        "Just 60%?",
        "India is better for the rich not for the poor.",
        "https://preview.redd.it/w0hfwvq9mv7e1.jpeg?width=1080&format=pjpg&auto=webp&s=8e85e55c7421a5bb696644b6cb0425e042750fb6\n\nI thought we were already a vishwaguru.",
        "beautiful pictures",
        ">make more sense to fight for an institutional change, than donating money to some random charity \n\nIt's not binary, you can do both at the same time. These people probably need more help and our attention, right now.",
        "It’s straight up the good guy Indian village in Temple of Doom",
        "Have you tried writing an article about how India is going down the gutter? It might improve things in 4 years. You never know ¯\\\\_(ツ)_/¯",
        "Even 3 trillion economy still doesn't help that people live like this and that India has so many third world problems.",
        "A lot less trash than I expected , this must be one of the nicest parts of India",
        "80 percent of India is village to be honest. Who wants a fuckin Mangal yaan or bullet train when you know 90 percent of the India is Below poverty line.",
        "My comment might be opposite of what others are saying because I have seen my fathers village (in UP) develop in last 15 years like crazy. My childhood memories are very similar to OP's photo but now when I go there (we go there once every year for some puja), I see proper concrete houses, sanitary facilities, etc. I would say development has been slow but not something that we can just negate entirely.",
        "Riya mam,I see you are not posting more in your WhatsApp channel?why's that,please do post more.",
        "Marketing for charity lol, 90% will go to salary anyway. Plus i don't belive in free money.",
        "are they farmers ?",
        "I always thought that claim of Modi's was a lie. Glad to know I was right. No way a thief and conman like him would do something like that.",
        "[https://x.com/deedydas/status/1869647888273531260](https://x.com/deedydas/status/1869647888273531260)\n\nI love India, but we cannot live in denial about this anymore :(",
        "A million mutinies happen every day while the GDP gallops away. Thank you for posting about the other (real) India.",
        "But we are famous in foreign countries now, all the people say that.",
        "You don't have to write anything new, just read V S Naipauls India a wounded civilization, it sums everything up.",
        "Ladki bahin yojna ke paison ke liye ye log hi vote dete hain",
        "Great work! Also keep posting the results on how the donations are changing or have changed lives. They will convince people and will help collect fund. ",
        "You should have also posted the local MLA's house.",
        "You should visit the houses of village Pradhans",
        "They should stop giving birth to children when they can't afford to provide for themselves.",
        "I have always said this as an example for anyone who says India needs to be like china in gdp we need to compete with western and European countries but these guys need to understand that if I dian kept progressing forward only the top 10 percent even being generous will progress the rest will be left back and it is the bitter truth that even our fucking presidents that we had since freedom don't understand like bro we need to make the whole country to be on equal footing then we can dream of competing with others India is so unbalanced like it's crazy . I have so much to say about this butt uughhh everyone is close minded desh bhakt what can I do and when is say stuff like this they call be deshdrohi and foreigner glazer like bro wth 😭😭🙏😭🙏????",
        "The state of villages is different in different places. In few you will find air conditioners and generators and all sorts of facilities and in some you will find lack of basic facilities as well.",
        "what do the people do to make a living? Until ans unless people don't start getting some useful skill/money making ability govt won't do anything they will make jobs they will make companies invest in the country, open manufacturing units in the country but what to do when people dont have skill, they have money to eat ghutka and dont have the same money to buy a phone through which they can learn things, even if they get one they'll be using that for scrolling reels",
        "Grew up in a shanty house like this :) most nonprofits didnt really help. But that was 20years ago.Thanks for doing this.",
        "Can’t we somehow enable them to farm bitcoin and start earning? This could be a societal game changer.",
        "from tamilnadu, I am orginally from a village myself, current leaders are spineless, but thanks to our past leaders, villages here seem to be much better than other states",
        "I spent my early career cleaning a village. I have the same values as you. Happy to connect in person to make a difference together. Pls DM if comfortable :)",
        "Number 1 rising economy, keep away with these fake pictures. We are number 1, ek dum no.1!!!!",
        "This is where our tax money goes. On paper.",
        "Harsh book.",
        "Ok compare with immediate neighbour China. They were a shithole with famines in the 1960. Where are they now? 🤣",
        "Op do you work for an ngo?",
        "This is good if you compare to the north eastern hilly tribal areas where you don't even have access to water supply they have to take water from small rivers .",
        "Agree. But the country itself had inhumane laws that allowed such progress. \n\nEvery time someone comes with this argument I ask them if they have elder siblings or if their parents have elder siblings. Because if they were in China, they or their parents would not be born. That’s priceless thing to give up. \n\nMe and my best friend cousin used to have this strong debate with some Chinese startup promoters in Bangalore HSR LAYOUT. My cuz was dating one of them and that’s how I met. She and all her Chinese friends would always speak big about China and development and at the same time they would also appreciate and envy the bonding between me and my cuz and his own brothers and some other cousins in our family. \n\nThey are so bloody enslaved that they don’t even know what it’s to have your own siblings and first cousins. Is that what you call development?",
        "Swades",
        "if u visit villages of bihar u r gonna cry , they live sub saharan life",
        "That’s not necessarily true actually, I have Chinese friends who have big families. The one child policy existed but you could work around it by basically giving birth to children in another province. In any case, that’s old news. Also I don’t see how having a lot of cousins is “development”? It’s just increasing the population and reducing resources for everyone.\n\nChina today is an awesome place miles ahead of any Indian city. Chinese people have a far greater civic sense, you don’t see them littering the streets like developed Indians. Rule of law is obeyed. I would say it’s well developed.",
        "There are millions like this. Many places in India where people live in very deplorable conditions. \n\nI thought everyone knew about that. People are still in their own bubble...",
        "Hi, yes. Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly!! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "That’s really good friend. If you can in whatever capacity please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Yes but this is where the help is needed the most. Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "I totally get it friend really. If you can, please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Absolutely!!",
        "Exactly!! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "He is jobless while his wife and sister goes to the field to work as farm labourers.",
        "Exactly friend! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "I feel people are not responding to it. Thanks for the feedback. I will post more. Do help if you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "1 pic is so peaceful",
        "Exactly friend. Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Will do. Keep up the good work! Education is everything. \n\nPS, Had sent some to the teacher you'd posted about. Also shared it with my friends. Any updates on that case?",
        "Exactly!! Please help us help them friend: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Heheh. Please help us help them friend: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thank you friend but also please help in whatever capacity you can: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Yes, there were lack of toilets. Please do help us help them friend: https://www.unitedwaymumbai.org/fundraiser/23875",
        "I don’t agree that generally they have big families. Even I met a dozen of them in Melbourne and London. Most are single child families and very rarely they may have big fams. \n\nYeah ofcourse most countries outside India have better civic sense. \n\nChinese economy obviously one of the best in the world. Great development. Authoritarian but strong and visionary leadership. Yeah I appreciate all that. \n\nBut having a lot of cousins or siblings is not for economic reasons. It’s very basic human right and one of the most beautiful reasons of being Homo sapiens and not a foking animal. I feel sorry if you don’t have any. \nIf any government is stopping a whole country from even getting to know basic human needs and emotions it’s pretty much a jail like North Korea. SLAVERY.\n\nI have multiple times brutally criticised UPA and NDA governments and my state governments for their shit online and offline. I do that and I don’t even worry about shit. If I am being intensely censored and jailed or fined for that, I call it slavery. \n\nMaybe for you, money and economic development at any cost is the only thing that matters. I prefer freedom. Sorry. My choice.",
        "Thank you so much friend. God really bless you! We need more people like you.",
        "Heartwrenching condition but who is going to tell the bling supporters what should people deserve. Many generations will continue to live like but I am just hoping that they be more happy and content with their lifes.",
        "They are not. They don’t have jobs, there is maternal mortality. There is drought, there is lack of water. Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly!! Let’s help people one step at a time. Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "They certainly don’t have restrictions on family now. Overpopulation is nothing amazing about homosapiens. Rabbits have been known to achieve it easily, is it not?\n\nBut saying “freedom to talk shit about government” is superior to economic development is laughable. The savage has all the freedom to yell all he wants, don’t see too many queuing up to become one. If you tell me that I can’t make derogatory statements about some politician in exchange for a comfortable, wealthy and happy life, I’d take that in a heartbeat.",
        "They are still struggling to find a bone marrow donor and have not reached the amount they need. The wife is still admitted in the hospital. It’s a really sad situation.",
        "Thank you so much friend for sharing across. God bless you really!",
        "Let’s help people one step at a time: https://www.unitedwaymumbai.org/fundraiser/23875",
        "It might as well be true, but even this huge number doesn't seem to have made a difference because of our population.",
        "Who are we kidding? all these NGOs are an exercise in monetization of someone's suffering.",
        "It’s just not cricket",
        "Don't worry they're are the so called \"upper castes\" they've not faced any oppression in the past....",
        "Lol you trying help their children\nThey have money to buy liquor but not for their own children superb\n\nFirstly tumne dhunds kya kitna waha property hoga open space wo log ka\n\nBina tax gas light property tax deke mast reh rahe hai sukoon se they choose to live like this tax free and fast life free do not consider them as poor aur tum ghumne gayi ho help maang ke tum khud paisa bator rahe ho kya wo log ke naam pe ,\n\nwo log ka kokootpalan hoga mast \n\nPune jao bail gotha gadha pe zindagi chalta hai \n\nAur itna hi help ka zor chadha hai jake waha ka local nagarsevak aur mla ko contact karo paisa fund maango \n\nYaha kya karne aayi ho rona gana karne\n\nJaha dekho waha metro walo ko aisa photo dikha ke lootne sympathy lene beth jate hai",
        "Everyone in utopia would remain silent on government if they have wealthy comfortable life just like that. \nThe way you talk is like 100% of the population in China is “wealthy and comfortable “. Lol. 😅😅😅\n90% of them have living conditions like shown in pictures above. Add to their misery they have barbarian laws. \n\nI don’t where you got brains but ‘freedom’ is the most important thing that matters and any economic achievement suppressing any citizen freedom is laughable. \n\nWhy don’t you go to China and read their life on reddit and praise their govt policies and development. You can’t because it is banned it China. \n\nJust adding incase you don’t know- There is no country or institution or a recognised person who have ever appreciated Chinese model of development or called it an ideal model.",
        "No most of them actually belong to the reserved categories.",
        "😑",
        "Hmm, that is unfortunate. Hope and pray that they find a healthy donor and the funds required. Bless you too ❤️",
        "You don’t have to go to a village to see this. There are people living right next to us in these living standards. But we choose to ignore and post to help here",
        "2 pic with sky both are edited using app which changes the sky with single click of button.\nDon’t edit when not required just a suggestion",
        "The majority of this country is still living in the Fucking Stone Age, super power my ass.",
        "Donated!",
        "The people in China are wealthier than Indians. The country and infrastructure is 50x superior. They are competing with the USA, that’s how far ahead they are. Your “freedom” has not got you anywhere. \n\nFurthermore you don’t understand “freedom”. There is no such thing as absolute freedom. There is always a tradeoff between individual freedom and social norms. In India you are not free to have gay marriages for example. You don’t have freedom to criticise religious figures. If you write a book criticising lord Ram it will be banned and you could be killed. I can do that in China without any consequences. These are all relative things. Think before parroting statements.\n\nWho has not appreciated the Chinese model? It’s only ignorant people like you that say so. Here is the world bank, are you smarter than them? https://www.worldbank.org/en/news/press-release/2022/04/01/lifting-800-million-people-out-of-poverty-new-report-looks-at-lessons-from-china-s-experience",
        "Lol stop your assumptions friend. It is as original as it gets.\n\nhttps://preview.redd.it/na6h46zany7e1.jpeg?width=1170&format=pjpg&auto=webp&s=d735821c68ef986557dcba922f38a802fc0e3f44",
        "Yes you are right .",
        "It's always been like this \n\nI visited my mother's sister village in 2012 and visited this august, nothing has changed, the walls, roads, street light, nothing has changed or improved no matter which government is ruling the state.",
        "Hawk Tuah",
        "Exactly mate! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly!!! The book. Also, please help us help them in whatever capacity you all can. Please do: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Now I’m pretty sure that you are some GenZ kid who has just Internet knowledge and has no freaking idea how the world works. \nFirstly don’t put China and Freedom in the same bracket. Secondly I said they have millions of people living in poverty like in India and did not disregard their millionaires. Thirdly nobody gives a shit about same sex marriage and stuff when you don’t have basic human freedoms \n\nFourthly, I don’t care about World Bank or UN report. I said nobody in the world except ignorants like you considers China ethical or morale.",
        "The difference between rich and poor is wider than 10-15 years ago. If we can’t uplift the living standards of the poor, what sort of development are we talking about. If you listen to current FM speeches, it’s clear that she doesn’t bother much about the poor people. There are good frameworks or policies for the poor and deprived. All she talks about the 3 trillion economy and corporate world.",
        "Changing the definition of poverty doesn't make poor people less poor ",
        "Others come under middle class. ",
        "/s isn't needed ",
        "Current government has failed terribly in controlling inflation in last 10 years. On top of it they are putting taxes burden on to the people. They can’t control the export-import deficit. Our rupees has touched the peak yesterday. 85 ripples for a dollar ! Bura haal se haal ho rha h har din!",
        "Would love too. Unfortunately currently not in a position really. But someday, I'll do my bit.",
        "OP went to the remotest village and to the poorest. My village is very remote in Saran District of Bihar and looks a lot more developed than this. Almost 24 hours electricity, pitch road, govt built washroom in every house",
        "I am from one such village where poverty is almost similar with some improvement but the village population has almost gone down to 1/2 with mostly old age people. So situation is not exactly what the post is hinting!",
        "lol okay world bank is wrong, only you know the true extent of poverty in China 🤣Did you get it from “free” WhatsApp? \n\nHere’s another question - in India women don’t have the freedom to work/go out at night without worrying about getting abused, but they have that freedom in China 🤣",
        "Yet they are probably happier than you and the most of the people commenting here. They are not alienated from themselves, their family, and their surroundings due to the numbness and illusions induced by mindless consumerism. They are nearer to Nature.",
        "You went for poverty porn. Even slum dweller sin India live better than this.",
        "I am in the same boat. I grew up in Aurangabad and very familiar with Marathwada region. I don’t like to contribute to charities because of my personal reasons, but if there is someone who wants to genuinely study and looking for a mentor, I am happy to help.",
        "Nope. Things have only improved for few. But for the rest it is either the same or backward.",
        "Hi OP,\n\nDonated and did my part!\nDo let me know if there is any way to physically contribute to this cause, maybe by volunteering or something. \nWould love to help🙏🏻",
        "This is new modified India. Gay C RAM",
        "You can also check Pradhan Mantri Awas Yojana- Rural.",
        "This exists in the cities of India too",
        "I was literally looking for such a platform to donate directly to the needy since 2 days ago. Amazing how the Universe works.",
        "The thing is we usually associate cruelty only with extreme things like killings but in reality its much more than that, our government, politicians, judiciary system, civil service workers are part of the cruelty bcz they are not doing the work which they are fking suppose to do, i hope they get their fair share in afterlife.",
        "This has been India and continues to be the focus of today’s politicians. Every government at some level has focused on the poorest as they are big in numbers and support political victories.  \n\nNot to sideline the focus of this thread and your work but the people forgotten over the last 2 decades are actually to middle class. A middle class that has worked tireless to make the rich richer and themselves just about better. We are seeing people in their 30s and 40s burnt out, frustrated because they spent so much of their youth working hard and still have no hope of a good future in sight.  \n\nThe government has failed to provide any development for the middle class. They have seen meagre increase in wages, no improvement in infrastructure quality, no policies on family welfare, no financial security, no environmental policies. \n\nToday average 30 year old struggles to fend for themselves, still hunts for a  sub 10lakh car, struggles to think about having children, breathes polluted air and a very poor quality of life than what they deserve.",
        "Do you know how much electricity and initial cost required to farm bitcoin? Its not like farming vegetable.",
        "Money in this now may add trouble to you.  This will come without PAN.  Govt can consider as money laundering NGO.   Your website is better, it has PAN as mandatory entry",
        "What did you expect?",
        "And to think this is a relatively wealthier state like Maharashtra. Imagine how entrenched poverty must be in states like Assam, Bihar, or UP.",
        "That's how it is, everyone living in their bubble , segregated on basis of class,religion,caste.",
        "The government is providing free ration to 80 crore Indians, so you can imagine the level of poverty we have in India.",
        "Tf how you getting 2kg ghee for 1300 ,people in my town are charging 1k for a kg of  ghee",
        "Sure I’ll remove this.",
        "Exactly!! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly!! Let’s help one step at a time. Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Exactly friend! Please help us help them at the least: https://www.unitedwaymumbai.org/fundraiser/23875",
        "That’s really awesome. You can also get in touch with me any time for updates! Please do help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "The least we can do is help them. Please contribute: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Sure most definitely!! God bless you. You can stay in touch with me.",
        "They do not have families, most of them died due to droughts, maternal mortality.",
        "Exactly my friend! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Sure will do",
        "But I am sure it will be developed by 2025. Or 2025.5",
        "I was talking about Amul or Verka ghee, lol.",
        "If you add up all the bribes collected, and all the black money, it may already be a 5 or more trillion economy.",
        "Lol :)) Please do help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Yes that guy in donation post is a fraud. By now you may be blocked by him. Just ask him how much money is collected and he will not answer",
        "Ye sahi hai click pics earn money",
        "Exactly!!",
        "Exactly my friend! Please help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "Thanks for supporting and having a multi dimensional perspective. We need more people like you!",
        "Exactly my friend but we can start from somewhere. Please do help us help them: https://www.unitedwaymumbai.org/fundraiser/23875",
        "The thought itself is enough!",
        "Yes that guy in donation post is a fraud. By now you may be blocked by him. Just ask him how much money is collected and he will not answer\n\nsee her when others doubted earlier\n\nhe told\n\n\n\n\"Majority of the donations come only from milaap but I can share you the bank statement and all upi transactions. Most of the people don't donate on upi as they only prefer the donation drive link. I can send you the bank statement and screenshots.\"\n\nBut then he forgot about that\n\nMany reposrts are unsigned and some reports looks like some other perosn ahs written on doctors notepad and not a doctor\n\nalso its easy to buy medical record",
        "Maybe if they didn't have like 20 kids each that they can't afford like would be better...",
        "Pretty more of us, even me, am commenting from such household setting. ",
        "They might look happy and innocent but these kind of places are home of many victims who died by suicide because these villagers would shame thrm to the core \nI said what I said",
        "Just wanna know some info before donating:\n\n\n\n1. Did you get permission from these people to post their photos/use them as an example of how sad poverty is? I don't really love this move. I've worked in many villages and I admire how hard people work and it looks like they have clean homes!\n\n\n\n2. What is your organization's relationship to United Way? I didn't know they functioned in India. I have worked for them abroad.\n\n\n3. From the link you sent, I gathered that the donations are going to building an orphanage and running some private schools. Is that correct? How is that helping people eat or live under a cemented roof (other than orphans, I suppose?)",
        "Thats a beautiful sunset.",
        "Then we complain why Hollywood shows india poor.",
        "Ever heard of the village name \"Madhapur\". It is considered as the richest village in Asia.",
        "These GenZ kids. Nobody told that world bank is wrong. I said nobody appreciates their ethics in development because it is against normal human standards which any prudent guy would understand except you. What are you man? High school. If you have finished drinking the milk, go talk to your dad about this he will explain.",
        "Biggest ~~democracy~~ mockery.",
        "Me: \"Living in the same exact conditions, watching my tribesman slowly but steadily improve lives, yet many remaining under poverty, not able to afford a proper school, basic health facilities, basic life style (although life style has different version there,) \"...\n\nThis is life.  aaaah!! \n\nRandom person on reddit: India is poor LMAO. \n\nPaisa ki sunaa kehi chaadi ki jaethila ki.",
        "Remember these pictures, this is the India before the revolution. \n\n\nAfter the revolution fascists shall claim that the revolutionaries ruined the beautiful culture of India and what not, like they do in China. ",
        "Well Vir Das was right, We all come from \"Two Indias\"",
        "No.",
        "I hate how reddir privileged class keeps crying about how bad they have it because they don't have their own 2 crore home or they are middle class becuase they only earn 15lpa.  \nI always get downvoted because ofcourse, people reading too are the privileged class.   \nIf Internet and English were distributed equally, the current redditors and even Instagram/Youtube folks would be insulted daily for their sob story",
        "in india rich become more rich middle class become lower middle class and poor become more poor 🥺what type of development is this",
        "Correction. We're working our way out of it. Whilst there are cases like this, there are also cases of villages getting their first electricity, toilet, first guy from a family to goto college and get a decent job.",
        "Yeah that's where I differ. \n\nimo, the fact that villages are still getting their first electricity, toilet etc after 70 years, while dozens of other nations rebuilt themselves after wars, communism and what not and are now generations ahead - that's a sign that we have a cultural defect.",
        "Plz don’t generalize from one visit to one particular mohalla in a one village…..",
        "Now, Bakendra & Co. will say you are working on Soros' behalf.",
        "Can I paint the last photo? Digital ofc, is that allowed? I don't plan to sell it but it might be posted on my socials",
        "This home just seems unaware about PMAY.",
        "Fair Wages for All ✊🏻",
        "You got distressed by looking at this! Visit little north to the villages of UP,  Bihar, CG,Jharkhand and orissal. You will have a heart attack.",
        "Real Vishwaguru vibes. \n\nhopefully they get a bullet train soon.\n\nJokes apart, Amazing work OP!",
        "Buy full fat milk and get ghee for free.",
        "Ahh why ??",
        "Will do!",
        "Wtf are these stats correct source ??",
        "How is this possible?",
        "Because it's the truth ",
        "Ohh now i get it",
        "just wanna tell that they're still leaving a luxury life according to the village life i have seen",
        "This looks like how my Thai GF's parents live in NE Thailand. She would give them all the money she made in Bangkok and her father would still bad-mouth her. She stopped. This is how the majority of the world lives.",
        "it looks more like a slum than a village.",
        "I wonder which phone you used here. The photos are great",
        "What is “ethics in development”? Are UN and world bank “nobody”? Do you think the average person in China is not living per normal human standards? If so you should talk to your brother’s girlfriend and save her 🤣. As I pointed out, most Chinese are living at a higher life standard than Indians - they are richer, have better law and order, better infrastructure, better education etc. \n\nThe only counter that you have to say is that “But they don’t have freedom to criticise their government Saar”. Giving up that that one freedom is nothing compared to the benefits they have got. \n\nIn India you have the freedom to throw litter in the streets and you got dirty streets as a result. You have the freedom to say anything in public and you got idiots saying nonsense most of the time in public. The point of society is to give up individual freedoms in exchange for social benefit. If you give up your freedom to litter you’ll get clean streets, that’s how the world works.",
        "Believe me, these people are somewhat better off, many Indians don't even have this. A fibre cot and clean drinking water itself a privilege in our country.",
        "It will be a 5 trillion economy for sure, but reservation, poverty and corruption will never end",
        "Mene toh IT ko charity kardi ab mujhe kyu dikha rhe ho",
        "These pictures should be all the more a case for growth and development but nah, we want everyone to remain poor so that we can continue our poverterian lectures",
        "Love the optimism man but this thread and post will attract only those with a certain bent of mind - poverty is India’s birthright and we have to keep reminding ourselves of poverty. Never solve for it because that would make the problem go away.",
        "Beautiful❤",
        "Not every house in the village.\n\nNot everything is like this in the village.",
        "How?",
        "What work do you do in the villages as you said you are serving? How can we contribute",
        "The condition of rural hospitals and phcs is dire",
        "You know now how good the government’s propaganda is through its online and offline content that they so easily pass of the underdeveloped part of the country.",
        "I think the average Indian village might be a bit better off than that pic... \n\nI think the very poor of India is 30% or so...",
        "About 30% of India is rich or lower end of comfortable. \n\nThere's lots of poverty in India but not everyone is poor - it is advancing. It has huge population so it will take time...\n\nThe average Indian is poor but not dirt poor.",
        "Yes... do any Indians actually like being Indian?",
        "Bro these are legit stats. We even studied them in 7th, 8th std in social science. At that time the amount was less than ₹1000 pm.",
        "If you’re financially privileged, *don’t* donate to feel satisfaction, warm your heartstrings or get blessings. Do your research and donate to actually make people’s lives better. Regardless of how it makes you feel. \n\nNot talking about this org specifically, but there’s a consistent well-documented tendency for orphanages in developing countries to be a terrible humanitarian model causing a lot of harm for children. In fact majority of kids in orphanages aren’t even orphans. Parents often abandon them there because of financial burden or stigma over kids’ disabilities etc., sometimes convinced by persuasive workers from the orphanages themselves that the kid is better off without the parent.\n\nThere are plenty of better and more cost-effective alternatives to orphanages; they just don’t pull at your heartstrings enough, and they require someone to actually do something other than throw money. At best orphanages are inefficient. At worst they deliberately maintain themselves in unnecessarily pitiful state, neglecting/exploiting kids in order to attract donors.  \n\nhttps://www.npr.org/sections/goatsandsoda/2020/01/13/779528039/why-theres-a-global-campaign-to-stop-volunteers-from-visiting-orphanages\n\nhttps://www.hopeandhomes.org/blog/orphanage-volunteering/\n\nhttps://amp.theguardian.com/news/2018/sep/13/the-business-of-voluntourism-do-western-do-gooders-actually-do-harm\n\nhttps://inhope.org/EN/articles/beyond-good-intentions-the-risks-of-orphanage-tourism\n\n“In Cambodia, 40 years after the Khmer Rouge genocide, the number of orphanages has been growing, according to the UN. The reason is demand – but not from abandoned children. Instead, it comes from a huge rise in Australian tourists willing to pay to work in them.”",
        "What percentage of donations go to the United Way?",
        "These people are the real Indians. Wish they were given a better standard of life. They are so hardworking and hopeful",
        "You're doing excellent work, OP! The post definitely made me introspect. Kudos to you!",
        "The average Indian family is poor but not dirt poor. I think the average Indian family might be a bit more comfortable than the pic you showed...\n\nprobs about 30% is very poor.\n\n  \nalso. poor does not mean unhappy.",
        "The median Indian family is indeed dirt poor.",
        "What a beautiful family though.",
        "Even the poor can’t ride a bus.  That’s the mark of real poverty. Let them walk.  Or eat cake.",
        "*north India",
        "Hi! Just a quick question! Does it have to be from Amazon? I found the same but cheaper alternatives on firstcry.com! If other website alternatives work, I'd like to buy some things for the kids as well :)\n\nPs. We often order from firstcry for the little ones in our family, so there's never an issue with quality or order!",
        "How do foreigners donate?",
        "There used to be 4-5 poor families that lived in vicinity in mud houses(On govt property ). Now each one of them has a brick house. You cannot even tell they were once poor. A guy literally have a wifi in its home which he uses to run smart tv and a 2nd hand car. They have grown.",
        "Donating money doesn’t help. We need good education that should penetrate into remotest part of India. All the so called business man are selfish and money minded, they are mostly targeting urban areas. Everyone wants to build 10 mins delivery app in metro and nobody cares about rural parts. Also most of the business class people are cunning and selfish. They are the ones who switch cities and counties for better quality life . The rural people loves their place though the quality of life is bad.",
        "This is what type of work that i want to do once i graduate. Cheers to you and Thank you for your kind work.",
        "So that means the taxes we paid weren’t being used for the betterment of the underprivileged 😳",
        "Per month seriously?? Why is per month?",
        "Indian relatives are absolutely full of themselves and in denial - due to the caste and oppression systems. Why would they care about others when they got people at their fingertips ready to service their evey need? It's stereotypical sheltered rich people behaviour, completely delusional.",
        "At this point I think the actions of the people are more of a problem. It’s 2024 and we still have people who shun menstruating women. We have massive problems with domestic abuse, alcoholism, casteism, religious discrimination and suicide.  We have people who literally murder their own children for marrying the wrong person or being the wrong gender.\nI did some work in a village in Madhya Pradesh, and the  Dalit population there were not allowed to use the community well, and were forced to walk kilometers to a dirty river to get their water. \nWe built them a well of their own.  That is definitely helpful, but also shouldn’t be necessary, we need to change the mindset of these communities.  We need to focus first on education, not just of children, of everyone.  And not government propaganda, proper education. \nThere’s not enough money anywhere to fix all of these problems, but if we start with the people themselves, it will be easier for the rest to follow.",
        "A country like India can easily solve all these problems by democracy. But the people in the last 75 years couldn't understand how to make democracy work for them. Even today they have no clue. Felt demands are never met, and no one knows why? Let's see if Prashant Kishore succeeds.",
        "More than 70 crore people earn just around 100 rupees a day & that is the core of our country. Those who have not crossed the borders of their locality  & see the world through their mobile phones dont understand the reality of how pathetic & difficult the life is for most of our countrymen",
        "The last picture melts my heart. Melts my heart to water. 🥹😣",
        "no it isn't, the median Indian family isn't going hungry or without shelter",
        "Sorry if this is a personal question but how did you get out of such poverty?\nKudos though...",
        "And the poor of this country have taken upon themselves the responsibility of saving Hindus and Hindu culture. That's the reason why the poor will remain poor in this country. The more religious a population is, the poorer it gets. They have an unproductive reason to cling on to and put the responsibility of improving their lives on imaginary beings. India is fighting a religious war of Imaginary deities currently. Until we don't wake up from this dream state we are not going anywhere. The poor will remain poor.",
        "For me it was education. I attended tier 1 grad and post grad.",
        "That's why they are village boss",
        "Someone please educate them as to that they can end the generational poverty. Don't have kids and pass on the poverty and let the kids live through the same sufferings and misery they did.",
        "80+ crore people living on govt ration.",
        "Yeah, 65% of India is like this.",
        "Question to you - How would you show us that you’ve actually used all the money donated for the welfare of the poor folks?",
        "60% of the budget is dedicated to these people through various schemes",
        "sus",
        "Me as a very rich member of the Windsor house in London, if I visit your home, I could feel something similar OP, no offense though. The point is, they might not have seen much opulence away from a once in a year movie they go to. They could be happy and contented in this human experience they have. As long as they aren’t introduced to certain complications we think are important as part of being human, they would probably live a happy life. So yes they are having some deprivation, but they are having a life.",
        "I grew up from this in bihar",
        "Sabka sath sabka vikas\nAshe din aye gaye\nEk hai to safe hai\nWah modi ji wah",
        "Yet we are fine with the current socio-political conditions of India. In fact, we glorify it because the other side is \"too scary\" or straight up \"incorrect\". Educate, Agitate, Organize.",
        "I miss the warmth of my people.",
        "Not gullible enough to do charity.",
        "Poor not even contemplate buying Ghee, Apples, Rajama\n\nThose who grew up poor, knows - these are considered luxury",
        "Bilkul mere gao Ke ghr jaisa h.",
        "Do you like Delhi with all the pollution in the air.deceit,scams,lies,adulteration,wife swapping,garbage heaps,high decibel sounds hitting your ear drums? \nI accept our villages have been always neglected by our politicians but our villages are still preferred for the above reasons.",
        "Congratulations! Now you know how ~60% of india still lives today.",
        "I recently visited my village in Uttarakhand & its the complete opposite of this, water is 24/7 available & almost free of cost, electricity didn't go out even once the entire 2 weeks I was there & every house has a toilet.  \nMy grandparents were also complaining about how no one does farming anymore since the central government provides free monthly ration.\n\nI do not wish to think that my village is the norm but I don't think extremely impoverished villages are the norms either, Its probably a bell curve like all things.   \n  \nProps to OP for working & advocating for the betterment of the latter.",
        "    -@×-@@-÷×@×-×@33#\n\nhttps://preview.redd.it/rw1vbwpsp88e1.jpeg?width=1080&format=pjpg&auto=webp&s=2918101c5639eb7e2f4c3dbe1cf010f8d8bee1fb",
        " X z,wa2aezsezj\n\n>situationǰuhhhhh \njhJi\nHǰ\nǰj8ju8j8jj8ijuijúu8i8⁸8888i8888 I 88⁸888⁸88i8888888⁸88⁸88 I 88888⁸888 I 8i8i I 888888888i I 88 I o u888u888",
        "Just blame it on Bangladesh and move on",
        "Kerala villages are mostly very different. A few of the North Eastern states are also different.",
        "You realize the western attitude towards sex is only like 10-20% of the world right? You think the middle east and africa permit that?",
        "Better than Hazardous gurgao. I my village still have houses like these and people live longers.",
        "Don't you dare say anything about Modi ji, or someone might just drive a truck full of fellow chhapris with speakers and play Hindutva-Pop Top 10 @ max volume in front of a nearby mosque all while dancing ugly.🤣",
        "Hard work you put in. 👍",
        "I grew up like this , and my grandparents still like to live in the same.. it's not a situation, it's how they are",
        "Thank you for this as an NRI this breaks my heart. The rich to poor ratio is skewed",
        "I am growing up in this but a little better.",
        "This guys buys stuff from ac supermarkets (going by his choice of food items and prices mentioned) and blabbers on reddit about poverty. Also, our national income is around 10 usd per day (800-850 rs approx). That is definitely low but better than what it was a decade back. I definitely see lot less beggars, most of my people who i knew use to stay in muds house have a pakka house. Can it be better? Definitely. But to say no progress has been made is a total lie and propaganda",
        "ghar ki yd aagyi",
        "Selective ho didi aap. Sirf woh post Kia hai jo apke agenda ko fullfill kare",
        "Genuine question. No hate No Sarcasm. \n\nIs India really progressing?",
        "Wait the villagers in this picture didn’t get the benefits of Ujjwala Yojna (providing gas cylinders)?",
        "That goes for any place",
        "OP is this new for you?? This has been the norm for decades.. All the developement works are done in the cities and the rural areas are left to fend for themselves..   \n.  \nI will give another clue.. Visit the government schools in the cities and then the government schools in the rural areas.. Your eyes will open further to a new kind of knowledge.",
        "Oh boy oh boy. First off, you are right, I buy stuff from AC supermarkets because I am not in India anymore. \n\nSecond, when I was in India, I bought stuff from rehri markets because I would rather help them than Reliance superstores. \n\nThird, I did not pull that number out of my ass. That is the national average set by the government, you should check it. And thinking average Indian income is 10USD is laughable. It's a skewed matrix. Do you honestly mean to tell me that family of 4 in the pictures have an income of 1 lakh a month? \n\nFourth, I don't really give a sh*t about any govt or their propaganda. I do give a sh*t about people who are suffering because people like you are too blind to see what is happening.\n\nFifth, those \"things\" you mentioned, those are basic necessities in my community. I grew up in Punjab. Ghee is an everyday product for us. So of course I gave the examples I am familiar with. Are you honestly telling me a gas cylinder and rajma is not daily necessity but a luxury?",
        "Superb photos. Pardon my ignorance, what are we looking at in #10?",
        "I grew up in a similar environment, attending a government school and starting my career right after completing secondary education. Poverty taught me the art of resource management, scarcity instilled in me an appreciation for value, and economic hardship inspired me to embrace a minimalist lifestyle. Today, I hold a leadership role in a multinational company, traveling across the country. Yet, I often find that the people I meet seem happier than many of us who have more.",
        "There are many people live like this, our grandfather growed from this probably ( seeing our old small mud house)",
        "https://preview.redd.it/3xdycz53md8e1.png?width=1080&format=pjpg&auto=webp&s=999f80554113bfc82e50619c2ba40b6818942837\n\nMonth per capital expenditure data from Wikipedia. Govt can draw the poverty line wherever we want but this is the raw data.\n\nTop 5 percent spending more than bottom 40 percent.\n\nEven top 5 percentile for rural India is around 10k, and 20k for urban india.With all the talk about inequality, even the top 5 percent are not all that rich. We have a small pie shared unequally. We need to simultaneously grow the pie and distribute it well and do it before we turn old which is in about 1 generation.",
        "where's the data from lol ?",
        "Bro no way you didn’t expect this",
        "AQI less than fifty at least",
        "This is not about the one house in bihar every other house looks like this",
        "What did you do for them?",
        "Villages have not improved, cities are dying, then where is all the money going?",
        "Business Standard \"129 mn Indians living in extreme poverty in 2024: World Bank report\" \n\nWSJ \"New poverty formula proves test for India\".\n\nThere are other reports. You wanna know the funniest part? The govt claims they have reduced poverty, but refuses to provide any data or conduct any survey or even revise the poverty line. It's just their claim. \"Hey look, we are not poor anymore.\" All the data available is from third parties. \n\nGuess the Govt is too busy in religious debates to actually do any surveys. I don't think they have even done a census.",
        "people living on 1500 a month? where is that data from?",
        "and how are people living on 1000 rs per month per person in india? where and why?",
        "I wanna know how life was for the old lady (4th pic). Their perception of life must be so different.",
        "Clearly the millions of bike sales are fake and the cars on choked roads are all driven by the few billionaires who've been seizing all the wealth being created. We are all dirt poor with tin shades for roofs and total of 2 walls in our homes, since all these houses in rapidly expanding cities are empty as fuck. Schools are empty and internet user base is 2% coz the majority can't spend even Rs 200 per month on connectivity.\n\nEither that or India's majority population has definitely come out of poverty and you are just being absurdly pessimistic out of need to shit on efforts of those who create opportunities and those who seize them and improve their lives.",
        "This !",
        "Things are relatively better in southern states like Tamil Nadu. I think social upliftment is necessary catalyst for economic upliftment. You need to make them believe that they deserve better living standards and demand more than what they are handed out. They need to demand opportunities for upward mobility.",
        "#AcheDin 😉",
        "This should be the signature line of Ministry of Tourism.",
        "I'm in a village like this, in Rajasthan. Yes, the situation is like this but thankfully we've got it better than most other places. We've got water supply, people got cows and goats. We're blessed.",
        "people in India deserve this",
        "This is going to be Canada in a few years !!!!",
        "Isliye hi well fare system chahiye",
        "I’ve seen worse, in other parts of the nation! \nSad but Real!",
        "Insane wealth disparity in India",
        "This is Alarming",
        "If you'd like to engage further consider contributing to the cause or discussing how to implement sustainable widespread solutions for such pressing problems It’s a good reminder that individual actions and collective responsibility can complement each other in addressing these deep rooted issues",
        "This is what socialism(and colonialism) does to a country.",
        "Minimum wage is 100 a day so any family with 2 earners makes 5000 a month. Negative provides 200 days of work a year which itself is 20000 a year or about 1500 a month even if there is no other income. Where are you finding these people living on 1200 a month?",
        "Atleast they don’t have to pay taxes like we do",
        "Never try to learn about India by reading stuff written by the diaspora. They are stuck in a time warp. Their idea of India is from when they left. E.g the Indians who came to US in 70s are a lot more conservative than those who came in the 90s and they in turn are more conservative then the youth in India today.",
        "It is a well researched work of Journalism. Try Baksheesh and Brahman a book by Joseph Campbell about his travels in India in 1954–1955. It is even older and not from the \"diaspora\"",
        "3 trillion economy is just 2000 dollars a year for 1.5 billion people and that's if it was distributed evenly. You won't see an end to poverty before 10k usd per capita gdp which means 15 trillion economy at least even if population grows no further",
        "India has changed a lot in 70 years. Might as well read Shakespeare today to try and understand Brexit. I have worked in Europe and US in 3, 6 year stints with couple of years back in India between each stint and everytime I come back I feel it's a totally different country. India is changing too fast to try and understand it from some post colonial navel gazing treatise. No amount of research looking in from the outside will tell you what India is.You have to live it to ken the gestalt of Indian society.",
        "My father came out of such poverty. \nHis luxury in college(govt engineering college) were shoes, and a  gulab jamun(sweet), when his uncle came to visit. \n\nHis father could never afford to visit him throughout college.",
        "You calling OP a liar? You don't see the reality around you? You can choose to not agree and move on.",
        "I mean even in cities these type of houses are common in slums and some other areas",
        "Not much difference than how people used to live a few hundred or a thousand years ago.",
        "Not only in village",
        "1200 rupees?",
        "Let’s take it one by one. \n\nWhy do you buy from ac supermarkets? No mom and pop stores (aka rehri) in your country? You should make an effort to find out! Why give your money to corporate blood suckers like Reliance🙂 (or whatever derivatives you have in that country). \n\nSecondly you may not have pulled the numbers from your Ass but they are total shit! The number i quoted was from world bank (that too 2017). https://en.m.wikipedia.org/wiki/Income_in_India\nNew studies say income levels have increased and getting better than pre-COVID era. https://timesofindia.indiatimes.com/india/incomes-up-since-covid-but-poorest-20-still-below-fy16-level-study/amp_articleshow/107124541.cms\nChina has not been able to fully come out of the COVID shock and we have recovered better. Whom should we credit this for? As i said earlier, we have to do much better. Point is not to say we are good but that your data is WRONG either by mistake or by malice. \n\nYou are totally into propaganda or totally out of sync with India or reality. Either you watch only anti-India western news outlet or kangressi media or protestors with black flags outside Indian embassies.\n\nAnd lastly, you may not care about Indian government since it doesn’t concern you anymore. But to us Indians it does, cause we have to live and die in this country and government which does well will be supported by people like us who do not plan to run away like you.\n\nSo enjoy wherever you are and keep your BS to your friends circle, if you post publicly people like us will show you the facts!!😗",
        "Awww did I hurt your little brain with my comment so you had to go for personal attacks?\n\nNone of your comments really make any sense except for the part where you address the facts with links. I can acknowledge that much.\n\nI think that is the problem. You fail to have any civilized discussion without personal attacks because you know you can't prove your argument at all.",
        "https://4fund.com/kt6gu2\n\nHello guys, \n\nMy dog has a tumor that needs to be removed by a very specialist and they are extremly expensive. \nI woke up to puddles of blood all over my room. \nUnfortunately, we cannot cover the cost of the surgery on our own, but we refuse to give up hope!\n\nAny contribution, no matter how small, is a huge help and gives us hope during this difficult time.\nAny donation, big or small, can make a difference. Together we can show her that she is not alone in this difficult time.\n\nWe are deeply grateful for your kindness and support.❤️"
    ],
    "cleaned_text": "visited villages india situation serving sagroli village maharashtra sometime today chance visit houses orphaned single parented privileged students neighbouring villages live hostels extremely humbling eyeopening experience also found hundreds students living like unable study need help need contribute privilege living cemented roof real india extremely deprived distressed extremely determined making difference lives next generation please help endeavour contributing whatever real india needs link donate ",
    "cleaned_title": "visited villages india situation",
    "cleaned_selftext": "serving sagroli village maharashtra sometime today chance visit houses orphaned single parented privileged students neighbouring villages live hostels extremely humbling eyeopening experience also found hundreds students living like unable study need help need contribute privilege living cemented roof real india extremely deprived distressed extremely determined making difference lives next generation please help endeavour contributing whatever real india needs link donate",
    "cleaned_comments": "ref previous post directly try sending help school like books equipment use yeah definitely well theres amazon wish list things require ill share real india extremely deprived distressed btw know indian govt considers people poverty counts million people lifted poverty last decade success story supposed proud extreme poverty lifting people poverty looks like weve got problem prevalent till eternity amazing work majority india lived living continue live like dont worry well soon trillion economy exactly friend exactly government completely ignored region giving lollipops name upliftment want help please consider donating civil society make difference thank please donate whatever exactly please help us help contribute whatever really need thing see wonder fking gst tax going seem peaceful life let get proper food shelter medical service thats exactly want many get food three times day please help us help sanskriti samvardhan mandal ssm small deeply impactful ngo working one challenging regions indiathe droughtprone marathwada area nanded district maharashtra place poverty drought left countless families distress ssm taken monumental task bringing hope change need mostparticularly vulnerable children heart ssms mission anand balgram home orphaned children whose lives shaped harsh realities region children lost familiesthey lost sense safety security anand balgram offers new beginning shelter place receive nutritious meals nurturing environment education emotional support need heal children given opportunity dream grow become confident individuals face world equal footing others ssm also recognizes future region lies education works tirelessly ensure even children financially socially disadvantaged rural communities access quality learning visitors ngos schools often remarked standard education rivals best institutions country ssm believes child comes never limit potential every child matter background deserves fair chance better future beyond supporting children ssm also focuses empowering rural youth women skill development vocational training communities opportunities scarce ssm helps individuals gain skills need break free cycle poverty build independent sustainable livelihoods organizations work grounded belief real development happens people empowered shape destinies four decades ssm quietly transforming lives neglected parts rural india whether providing safe orphaned children opening doors education employment rural poor ssms work driven simple yet powerful belief right support everyone potential rise circumstances supporting ssm giving aid investing lives futures children youth women one day strength communities country donated props going ground part us determined life youve got gift dont know want keep motivated let still speak reality civil society uplift millions people poverty democracies need government pay taxes governments structured job else go deep roots ask even governments civil servants shouldnt military rule enough sanskriti samvardhan mandal ssm small deeply impactful ngo working one challenging regions indiathe droughtprone marathwada area nanded district maharashtra place poverty drought left countless families distress ssm taken monumental task bringing hope change need mostparticularly vulnerable children heart ssms mission anand balgram home orphaned children whose lives shaped harsh realities region children lost familiesthey lost sense safety security anand balgram offers new beginning shelter place receive nutritious meals nurturing environment education emotional support need heal children given opportunity dream grow become confident individuals face world equal footing others ssm also recognizes future region lies education works tirelessly ensure even children financially socially disadvantaged rural communities access quality learning visitors ngos schools often remarked standard education rivals best institutions country ssm believes child comes never limit potential every child matter background deserves fair chance better future beyond supporting children ssm also focuses empowering rural youth women skill development vocational training communities opportunities scarce ssm helps individuals gain skills need break free cycle poverty build independent sustainable livelihoods organizations work grounded belief real development happens people empowered shape destinies four decades ssm quietly transforming lives neglected parts rural india whether providing safe orphaned children opening doors education employment rural poor ssms work driven simple yet powerful belief right support everyone potential rise circumstances supporting ssm giving aid investing lives futures children youth women one day strength communities country please help us help exactly know exactly saying saddest reality country said government completely ignored region respect gods work thank much friend please donate whatever little yes could probably use help pretty sure happier life someone slogging corporate fancy roof laying top plushy mattress extremely terrifying requirements considered liveable poverty rs person urban area considered poverty line makes wonder detached reality policy makers imagine living small city like amritsar punjab let alone city like pune mumbai people posted even poor according govt standards present image world country lifted millions people poverty reality living basically nothing put perspective gas cylinder costs kg ghee rs kg apples ish freaking rajma cost rskg people living surviving degrees door thats uncle second picture sleeps really think happy lost wife daughter due maternal mortality sickening exactly please donate whatever little future even rs counts please ngos fraud whoever worked ngo sector knows truth yet countrys beggest problem masjid never said need help logistically worked ngo sector ngos fraud especially ones working villages per month maybe terms finances look extremely stress free lives live constant fear uncertainty competition much laid back relaxed yes financially condition could improved thats one really self centred delusional take degrees door thats uncle second picture sleeps really think happy lost wife daughter due maternal mortality terrible states yup month national average urban india think rural month grew like visit hometown still families still living like look like percent india almost reddit users financially rich never accept india indian government failed provide basic right like water food majority indian citys villages forests polluted untreated pharma waste including river bodies many states ground water dried india produce much food still facing hungry starvation miss management also wasted huge food daily basis vegetables fruits villages maharashtraodisha madhya pradesh make question year live government put much efforts north indian villages forgot places im pretty sure right speak child died due water contamination cholera mostly village mortality common places people gotten used people whove grown cities often see india urban lenslike streets slums tourist spots small part country real heart india lies villages people live different perspective life ask donations portraying real india deprived distressed misleading narrative designed evoke sympathy prompt people send money often narratives crafted raise funds organizations gain likes comments ignore fuller richer picture rural life many villagers arent materialistic rush move cities deeply connected roots living life centered around community simplicity tradition may much material wealth understanding family happiness fulfillment often runs deeper truly grasp essence india spend time village conversations locals learning views life work progress eyeopening world largely untouched relentless drive urbanization material growth dominates cities compare india countries like us france based solely poverty misses greater complexity visiting village one thing immersing village life shifts perspective many people chasing modern ideals dreaming city lifethey define progress success way one thats tied material accumulation dont need travel villages capture images poverty harshest conditions found cities unbelievable hyderabad get bus pass month around stress free life nobody choose life accept living conditions never ask barber need haircut isnt northsouth issue dont know tamilnadu kerala much rural andhra telangana exactly like extremely dilapidated conditions across hate opposite voice admit dont see something doesnt mean doesnt exist village way becoming small town people used live huts worse gotten concrete house nearly open defection free know used impossible walk fields without almost stomping shit every sec make claims income dont know personally many villagers arent materialistic rush move cities materialistic properly insulated heated home six degrees outside materialistic able cook without killing lungs materialistic able afford food doesnt make children suffer malnutrition basic necessities life dont try trivialise situation people poor developed countries us things despite financial situation villages india cities india reflection called amrit kal vishwa guru trillion economy blah blah blah im framing north south issue dont know much south villages never know north villages like one originate went electricity hours days hours electricity daily case government scheme cylinders also came go much different construction daily wage workers live cities please help us help degrees door thats uncle second picture sleeps really think happy lost wife daughter due maternal mortality terrible maharashtra many kids read write much money spend education vs marriage vs rituals prioritize education religion backward mentality like caste caste caste like theyre little responsible condition anything take post please help us help every problems houses visited children even though earn extremely less children put schools including girls meanwhile middle upper class parents family talk gdp things improving never talk struggles many still go im living us always try convince india become way better live years since left considered poor great job op exactly sangroli village comes nanded district maharashtra look threshold used httpswwwnewindianexpresscomwebonlyfebhasextremepovertyvanishedinindiaandisittimeforthepovertylinetoberedrawnhttpswwwnewindianexpresscomwebonlyfebhasextremepovertyvanishedinindiaandisittimeforthepovertylinetoberedrawn currently use tendulkar poverty threshold person living monthly expenditure rs per month rs less per day cities rs per month rs less per day villages considered poor sure people earn rs per day think enough proper house please help us help thank appreciate work towards donated exactly please help us help tax nai dena ur normal kaam karna hai tension free life life mast life na kapda na gas na light sab bachat aur sukoon ki zindagi mast even worse area according many redditors govt support waste interest bjparty like prefer say nation dont want people get freebies exactly please help us help want know places hipparga shevara shimpala villages nanded district maharashtra great initiative keep thank work donated part ache din every country poor point worked way didnt people kept voting worst outcome still youre great work personally cant sympathy people exactly please help us help rural area india came india miss sometimes choice happy unless basic needs living satisfied case might case rural india general anti progressive culture mindset spend lakhs matter poor marriages castecastecastereligionreligionreligion dont spend nearly education government fix issue immediately congress bjp one need educational revolution need put big chunk gdp improving educational infrastructure thats wan na see tax money go short centuries poverty cant fixed immediately culture responsible government government ineffective though result jumping straight service sector ignoring manufacturing india missed boat could still bring change unless ready large scale reforms cowards center scared getting delhi surrounded landlord class pretending working class way scan qr code donate hi akash ensure money coming white get tax rebate wish directly donate riyajoshirjoksbi ensure money comes goes proper channel itd probably make sense fight institutional change donating money random charity however trustworthy may seem need fundamental change country minds people money come go mindset corrupt politicians would never change unless common populace forces hey breathing air isnt enough leverage according filthy rich politicians thanks explanation people live rich utopian bubble wont even believe also india disagree industries struggling labour job paying k month one needs step comfort zone many manual jobs available sad help keep trying one vote time one protest time things true however india lot problems things also improved lot people need make sure continue improving exactly help friend help get three meals lets try provide india exactly help whatever community posts pictures different title reflect villages india grew village kerala wish better times people quite possible happier healthier even us corporate slaves making loads money know people absolutely miserable hrs week cant quit answer still situation even years independence httpswwwyoutubecomwatchvmdtusmvrjahttpswwwyoutubecomwatchvmdtusmvrja know many would like view mine parts india rural small cities still view upper class benefit lower class remain lower look finance minister also taxes us part thought get nitty gritty things long view towards people low high rich poor country get rid even another years titled rindia removed stating clickbait title hence change ofcourse posting need help need help help help people village maharashtra okay thank hoping friend please help whatever little stress free people would give worldly pleasures live like thanks sharing friend please contribute whatever helping always wanted live like never enjoyed suburbs romanticising villages much even villagers dont like living villages rd india lives cities massively older data migration cities hey op great work prefer donate organizations believe directly giving money wont solve root problem instead im happy support child education potentially covering expenses till thth class lifted family tough circumstances thanks best education fortunate receive understand value know child genuinely wants study financial constraints please connect sister would love support financially also mentorship genuinely believe even little guidance us could potentially change someones life looking photos looks exactly like bangladesh would honoured donate ngo also photos really good pm awaas yojna ka paisa khaa gaye village almost every one rcc house thanks indira awaas pm modi awaas yojna north indian exaggeration also perks village life good air quality less pollution social environment lower inflation really like fitness ive noticed people villages tend fitter city however also drawbacks transportation limitations position females although think males worse country limited educational opportunities know experience vary mine village form rajasthan please donate whatever friend god bless thanks whatever say india opposite also true bhai kaun se garib jaaon main chali gayi aap friend tamil nadu living similar kinda home holding acre land dont know living like nothing related mind stucked see post uh huh personal bank account poor government corrupt priorities right village growing economy earth like educated hardworking grow blaming government upa nda believe india done tremendous work economic growth considering started nothing easy take random rural undeveloped photos blame government comparing europe right comparison terms countries compare brics south east asian countries immediate neighbours would right comparison use one collect funds personal bank account different id always suggest donate link ensure money white get tax rebate exactly please help whatever jaha jaane ki zarurat hai jaha lakhon mei log hai try visiting western villages also youll see prosperity try helping one step time though im happy born india im grateful least born urban family also get help wipro hcl piramals corporate social responsibility fund yes like everywhere god know used scared life might die without changing since system behind powerful untouchable enough common man even think im entering area world learning growing seniors help responsible well liveability village state govt central govt society god saw critieria another comment hi tried also dont prefer remote locations ssm never black white combination factors mate help changing bit bit ssm ngo working sagroli village nanded district maharashtra know help yes try help though villages punjab jk far better even decades back better looks currently true whole india try help whatever extent thank much part known marathwada completely ignored exactly help whatever capacity thank much friend god bless yes thats exactly fundraising personally connect child definitely many think ultimate weapon nonrich choice procreateif poor left exploit rich people however society conditions us think isnt really choice many arent even aware children unfortunately treated property across economic stratamaybe lower end suffering mostly child likely perpetuate cycle rest help one starfish time yes trying help next generation really puts things perspective also shows detached country society donated cause whatever could hope get relief dire situations thank bringing light op kudos proper washrooms isnt majority case oh glad local leaders good pray spent childhood worse house villages getting better time isnt population also issue would also soon billion keep reproducing rate wrote article india improve years ago downfall since people dont villages india electricity doesnt electricity true villages state nothing like feels like different country teach freeim kerala med student wan na go online teach vacation definitely teach vacations internet problem although villages better compared govt surely need look conditions villages well look happy thank response least man happy breathing aqi meanwhile chain smoker without smoking eat good unlike eating fruits vegetables full pesticides insecticides doesnt look terrible simple people look fairly healthy jobs futures matters material condition live suddenly feeling grateful everything india provide free education despite know ambedkar made huge difference current gov keep ignoring reality insulting made constitution please help whatever capacity canhttpswwwunitedwaymumbaiorgfundraiser means india people wants remain humble rooted earth come city ill show millionaires still roam splender plus braded cars come bengaluru buddy ill show least people innova get free ration provided govt bpl card even karodpatis god bless everyone lot work needed done us atleast theyre happy man dont ruin understand reasons contributing fundraising campaigns thanks feel free dm anytime blah blah blah educated ask solution american visited mumbai wants learn rs equivalent us cents less us dollar earth considered poor enjoyed visit want learn population general disparities wealth poverty mumbai shocking genuinely want understand politics reasons disparities disabled dont know much help help raise awareness help around appreciate wish peace donated via upi im arguing want add poverty isnt much money people make considers various factors like eating enough calories roof heads access education jobs etc youre right though rs appallingly little sad reality deliberately overlooked politicians mainstream media exchange religious propaganda dreams akhand bharat agree much determined income also factors like medical care navi mumbai seemed like engineering schools every block small hospitals plentiful doesnt help person access amenities due income understand charities help im sure much government helps firm grasp politics india much potential india india produces best doctors scientists engineers world doesnt help common person nowhere safe sleep monsoons panjab villages nothing like damn situation lot better expected exactly please help whatever capacity please help whatever capacity god bless friend commenting financial situation may better happiness index people cities even people usa called developed countries genuine question become developed nation achieve arent able achieve miss suppose hardship something else india never improve ultrareligious party like bjp people become rich thats percent india like please help whatever capacity tax payers pay money thst govt uplift people ghanta give shit taxpayer pay salary pay huge living expenses metro city youll know best help uplifting others exactly help us help thats true need start somewhere help us help sure ill let know exact requirements dm tomorrow small things like girls need money school bag etc thank much god bless villages maharashtra literally nothing eat thats need help help thank much friend god bless cfbr dunno taxes go actually know true help us provide education thank friend god bless thats need help help people contribute whatever little thank friend contribute whatever little exactly help us help though terrible help us help though youll get tax rebate well feels bit cherrypicked consider entire village totally believe hope understand view matter fact extreme poverty present india things often worse real india specifically mentioned post houses went one village tin houses except one pretty bad help whatever capacity comment theyre happy ththan us help us help whatever capacity help us help whatever capacity come across patients requiring medical help let know surely arrange treatment hospital absolutely free cost definition happiness keep home surroundings clean definition happiness kinds people different preferences many cities moving smaller towns villages quieter better quality life agriculture instance something cant city saying nobody likes village life overly simplistic personal choice opportunity think indian villagers extremely deprived distressed nobody wants live perspective shared mine happiness subjective socioeconomic status plays major role perceive happiness oppressed destitute getting two meals day could bring happiness clearly doesnt mean deserve thats developing country means keep developing development needed people leaders elect womp womp womp could release swadesh today would feel contemporary difference would mobile phone internet realise weve lifted millions poverty right teared looking images reading caption hurts bad situations go lives worrying wants hurts many stories families go unnoticed pains understand country still level kudos maam good work id suggest cross posting subreddits someone please help else posted thats im saying people government claims lifted poverty government claims un report amnesia youre willing overlook anything everything good bless heart mate thats quite miserable way live life actual toilet seat made used poop toilet hole ground least like visit family new delhi im saying poverty reduced thr government manipulated definition poverty show bigger number actually dont believe selected shots right metrics huge ass country although empathize poor people shouldnt look number roads hospitals schools electrification toilets across country ask prevents getting better jobs tax lago sab par upvoting commenting better reach think downvoters issue fathoming deep messages conversation good luck lol didnt congress lift poverty india better rich poor thought already vishwaguru beautiful pictures make sense fight institutional change donating money random charity binary time people probably need help attention right straight good guy indian village temple doom tried writing article india going gutter might improve things years never know even trillion economy still doesnt help people live like india many third world problems lot less trash expected must one nicest parts india percent india village honest wants fuckin mangal yaan bullet train know percent india poverty line comment might opposite others saying seen fathers village develop last years like crazy childhood memories similar ops photo go go every year puja see proper concrete houses sanitary facilities etc would say development slow something negate entirely riya mami see posting whatsapp channelwhys thatplease post marketing charity lol go salary anyway plus dont belive free money farmers always thought claim modis lie glad know right way thief conman like would something like httpsxcomdeedydasstatushttpsxcomdeedydasstatus love india live denial anymore million mutinies happen every day gdp gallops away thank posting real india famous foreign countries people say dont write anything new read v naipauls india wounded civilization sums everything ladki bahin yojna ke paison ke liye ye log hi vote dete hain great work also keep posting results donations changing changed lives convince people help collect fund also posted local mlas house visit houses village pradhans stop giving birth children cant afford provide always said example anyone says india needs like china gdp need compete western european countries guys need understand dian kept progressing forward top percent even generous progress rest left back bitter truth even fucking presidents since freedom dont understand like bro need make whole country equal footing dream competing others india unbalanced like crazy much say butt uughhh everyone close minded desh bhakt say stuff like call deshdrohi foreigner glazer like bro wth state villages different different places find air conditioners generators sorts facilities find lack basic facilities well people make living ans unless people dont start getting useful skillmoney making ability govt wont anything make jobs make companies invest country open manufacturing units country people dont skill money eat ghutka dont money buy phone learn things even get one theyll using scrolling reels grew shanty house like nonprofits didnt really help years agothanks cant somehow enable farm bitcoin start earning could societal game changer tamilnadu orginally village current leaders spineless thanks past leaders villages seem much better states spent early career cleaning village values happy connect person make difference together pls dm comfortable number rising economy keep away fake pictures number ek dum tax money goes paper harsh book ok compare immediate neighbour china shithole famines op work ngo good compare north eastern hilly tribal areas dont even access water supply take water small rivers agree country inhumane laws allowed progress every time someone comes argument ask elder siblings parents elder siblings china parents would born thats priceless thing give best friend cousin used strong debate chinese startup promoters bangalore hsr layout cuz dating one thats met chinese friends would always speak big china development time would also appreciate envy bonding cuz brothers cousins family bloody enslaved dont even know siblings first cousins call development swades u visit villages bihar u r gon na cry live sub saharan life thats necessarily true actually chinese friends big families one child policy existed could work around basically giving birth children another province case thats old news also dont see lot cousins development increasing population reducing resources everyone china today awesome place miles ahead indian city chinese people far greater civic sense dont see littering streets like developed indians rule law obeyed would say well developed millions like many places india people live deplorable conditions thought everyone knew people still bubble hi yes please help us help exactly please help us help thats really good friend whatever capacity please help us help yes help needed please help us help totally get friend really please help us help absolutely exactly please help us help jobless wife sister goes field work farm labourers exactly friend please help us help feel people responding thanks feedback post help pic peaceful exactly friend please help us help keep good work education everything ps sent teacher youd posted also shared friends updates case exactly please help us help friend heheh please help us help friend thank friend also please help whatever capacity yes lack toilets please help us help friend dont agree generally big families even met dozen melbourne london single child families rarely may big fams yeah ofcourse countries outside india better civic sense chinese economy obviously one best world great development authoritarian strong visionary leadership yeah appreciate lot cousins siblings economic reasons basic human right one beautiful reasons homo sapiens foking animal feel sorry dont government stopping whole country even getting know basic human needs emotions pretty much jail like north korea slavery multiple times brutally criticised upa nda governments state governments shit online offline dont even worry shit intensely censored jailed fined call slavery maybe money economic development cost thing matters prefer freedom sorry choice thank much friend god really bless need people like heartwrenching condition going tell bling supporters people deserve many generations continue live like hoping happy content lifes dont jobs maternal mortality drought lack water please help us help exactly lets help people one step time please help us help certainly dont restrictions family overpopulation nothing amazing homosapiens rabbits known achieve easily saying freedom talk shit government superior economic development laughable savage freedom yell wants dont see many queuing become one tell cant make derogatory statements politician exchange comfortable wealthy happy life id take heartbeat still struggling find bone marrow donor reached amount need wife still admitted hospital really sad situation thank much friend sharing across god bless really lets help people one step time might well true even huge number doesnt seem made difference population kidding ngos exercise monetization someones suffering cricket dont worry theyre called upper castes theyve faced oppression past lol trying help children money buy liquor children superb firstly tumne dhunds kya kitna waha property hoga open space wo log ka bina tax gas light property tax deke mast reh rahe hai sukoon se choose live like tax free fast life free consider poor aur tum ghumne gayi ho help maang ke tum khud paisa bator rahe ho kya wo log ke naam pe wo log ka kokootpalan hoga mast pune jao bail gotha gadha pe zindagi chalta hai aur itna hi help ka zor chadha hai jake waha ka local nagarsevak aur mla ko contact karo paisa fund maango yaha kya karne aayi ho rona gana karne jaha dekho waha metro walo ko aisa photo dikha ke lootne sympathy lene beth jate hai everyone utopia would remain silent government wealthy comfortable life like way talk like population china wealthy comfortable lol living conditions like shown pictures add misery barbarian laws dont got brains freedom important thing matters economic achievement suppressing citizen freedom laughable dont go china read life reddit praise govt policies development cant banned china adding incase dont know country institution recognised person ever appreciated chinese model development called ideal model actually belong reserved categories hmm unfortunate hope pray find healthy donor funds required bless dont go village see people living right next us living standards choose ignore post help pic sky edited using app changes sky single click button dont edit required suggestion majority country still living fucking stone age super power ass donated people china wealthier indians country infrastructure x superior competing usa thats far ahead freedom got anywhere furthermore dont understand freedom thing absolute freedom always tradeoff individual freedom social norms india free gay marriages example dont freedom criticise religious figures write book criticising lord ram banned could killed china without consequences relative things think parroting statements appreciated chinese model ignorant people like say world bank smarter lol stop assumptions friend original gets yes right always like visited mothers sister village visited august nothing changed walls roads street light nothing changed improved matter government ruling state hawk tuah exactly mate please help us help exactly book also please help us help whatever capacity please im pretty sure genz kid internet knowledge freaking idea world works firstly dont put china freedom bracket secondly said millions people living poverty like india disregard millionaires thirdly nobody gives shit sex marriage stuff dont basic human freedoms fourthly dont care world bank un report said nobody world except ignorants like considers china ethical morale difference rich poor wider years ago cant uplift living standards poor sort development talking listen current fm speeches clear doesnt bother much poor people good frameworks policies poor deprived talks trillion economy corporate world changing definition poverty doesnt make poor people less poor others come middle class isnt needed current government failed terribly controlling inflation last years top putting taxes burden people cant control exportimport deficit rupees touched peak yesterday ripples dollar bura haal se haal ho rha h har din would love unfortunately currently position really someday ill bit op went remotest village poorest village remote saran district bihar looks lot developed almost hours electricity pitch road govt built washroom every house one village poverty almost similar improvement village population almost gone mostly old age people situation exactly post hinting lol okay world bank wrong know true extent poverty china get free whatsapp heres another question india women dont freedom workgo night without worrying getting abused freedom china yet probably happier people commenting alienated family surroundings due numbness illusions induced mindless consumerism nearer nature went poverty porn even slum dweller sin india live better boat grew aurangabad familiar marathwada region dont like contribute charities personal reasons someone wants genuinely study looking mentor happy help nope things improved rest either backward hi op donated part let know way physically contribute cause maybe volunteering something would love help new modified india gay c ram also check pradhan mantri awas yojana rural exists cities india literally looking platform donate directly needy since days ago amazing universe works thing usually associate cruelty extreme things like killings reality much government politicians judiciary system civil service workers part cruelty bcz work fking suppose hope get fair share afterlife india continues focus todays politicians every government level focused poorest big numbers support political victories sideline focus thread work people forgotten last decades actually middle class middle class worked tireless make rich richer better seeing people burnt frustrated spent much youth working hard still hope good future sight government failed provide development middle class seen meagre increase wages improvement infrastructure quality policies family welfare financial security environmental policies today average year old struggles fend still hunts sub lakh car struggles think children breathes polluted air poor quality life deserve know much electricity initial cost required farm bitcoin like farming vegetable money may add trouble come without pan govt consider money laundering ngo website better pan mandatory entry expect think relatively wealthier state like maharashtra imagine entrenched poverty must states like assam bihar thats everyone living bubble segregated basis classreligioncaste government providing free ration crore indians imagine level poverty india tf getting kg ghee people town charging k kg ghee sure ill remove exactly please help us help exactly lets help one step time please help us help exactly friend please help us help least thats really awesome also get touch time updates please help us help least help please contribute sure definitely god bless stay touch families died due droughts maternal mortality exactly friend please help us help sure sure developed talking amul verka ghee lol add bribes collected black money may already trillion economy lol please help us help yes guy donation post fraud may blocked ask much money collected answer ye sahi hai click pics earn money exactly exactly friend please help us help thanks supporting multi dimensional perspective need people like exactly friend start somewhere please help us help thought enough yes guy donation post fraud may blocked ask much money collected answer see others doubted earlier told majority donations come milaap share bank statement upi transactions people dont donate upi prefer donation drive link send bank statement screenshots forgot many reposrts unsigned reports looks like perosn ahs written doctors notepad doctor also easy buy medical record maybe didnt like kids cant afford like would better pretty us even commenting household setting might look happy innocent kind places home many victims died suicide villagers would shame thrm core said said wan na know info donating get permission people post photosuse example sad poverty dont really love move ive worked many villages admire hard people work looks like clean homes organizations relationship united way didnt know functioned india worked abroad link sent gathered donations going building orphanage running private schools correct helping people eat live cemented roof orphans suppose thats beautiful sunset complain hollywood shows india poor ever heard village name madhapur considered richest village asia genz kids nobody told world bank wrong said nobody appreciates ethics development normal human standards prudent guy would understand except man high school finished drinking milk go talk dad explain biggest democracy mockery living exact conditions watching tribesman slowly steadily improve lives yet many remaining poverty able afford proper school basic health facilities basic life style although life style different version life aaaah random person reddit india poor lmao paisa ki sunaa kehi chaadi ki jaethila ki remember pictures india revolution revolution fascists shall claim revolutionaries ruined beautiful culture india like china well vir das right come two indias hate reddir privileged class keeps crying bad dont crore home middle class becuase earn lpa always get downvoted ofcourse people reading privileged class internet english distributed equally current redditors even instagramyoutube folks would insulted daily sob story india rich become rich middle class become lower middle class poor become poor type development correction working way whilst cases like also cases villages getting first electricity toilet first guy family goto college get decent job yeah thats differ imo fact villages still getting first electricity toilet etc years dozens nations rebuilt wars communism generations ahead thats sign cultural defect plz dont generalize one visit one particular mohalla one village bakendra co say working soros behalf paint last photo digital ofc allowed dont plan sell might posted socials home seems unaware pmay fair wages got distressed looking visit little north villages bihar cgjharkhand orissal heart attack real vishwaguru vibes hopefully get bullet train soon jokes apart amazing work op buy full fat milk get ghee free ahh wtf stats correct source possible truth ohh get wan na tell theyre still leaving luxury life according village life seen looks like thai gfs parents live ne thailand would give money made bangkok father would still badmouth stopped majority world lives looks like slum village wonder phone used photos great ethics development un world bank nobody think average person china living per normal human standards talk brothers girlfriend save pointed chinese living higher life standard indians richer better law order better infrastructure better education etc counter say dont freedom criticise government saar giving one freedom nothing compared benefits got india freedom throw litter streets got dirty streets result freedom say anything public got idiots saying nonsense time public point society give individual freedoms exchange social benefit give freedom litter youll get clean streets thats world works believe people somewhat better many indians dont even fibre cot clean drinking water privilege country trillion economy sure reservation poverty corruption never end mene toh ko charity kardi ab mujhe kyu dikha rhe ho pictures case growth development nah want everyone remain poor continue poverterian lectures love optimism man thread post attract certain bent mind poverty indias birthright keep reminding poverty never solve would make problem go away beautiful every house village everything like village work villages said serving contribute condition rural hospitals phcs dire know good governments propaganda online offline content easily pass underdeveloped part country think average indian village might bit better pic think poor india india rich lower end comfortable theres lots poverty india everyone poor advancing huge population take time average indian poor dirt poor yes indians actually like indian bro legit stats even studied th th std social science time amount less pm youre financially privileged dont donate feel satisfaction warm heartstrings get blessings research donate actually make peoples lives better regardless makes feel talking org specifically theres consistent welldocumented tendency orphanages developing countries terrible humanitarian model causing lot harm children fact majority kids orphanages arent even orphans parents often abandon financial burden stigma kids disabilities etc sometimes convinced persuasive workers orphanages kid better without parent plenty better costeffective alternatives orphanages dont pull heartstrings enough require someone actually something throw money best orphanages inefficient worst deliberately maintain unnecessarily pitiful state neglectingexploiting kids order attract donors cambodia years khmer rouge genocide number orphanages growing according un reason demand abandoned children instead comes huge rise australian tourists willing pay work percentage donations go united way people real indians wish given better standard life hardworking hopeful youre excellent work op post definitely made introspect kudos average indian family poor dirt poor think average indian family might bit comfortable pic showed probs poor also poor mean unhappy median indian family indeed dirt poor beautiful family though even poor cant ride bus thats mark real poverty let walk eat cake north india hi quick question amazon found cheaper alternatives firstcrycom website alternatives work id like buy things kids well ps often order firstcry little ones family theres never issue quality order foreigners donate used poor families lived vicinity mud houseson govt property one brick house even tell poor guy literally wifi home uses run smart tv nd hand car grown donating money doesnt help need good education penetrate remotest part india called business man selfish money minded mostly targeting urban areas everyone wants build mins delivery app metro nobody cares rural parts also business class people cunning selfish ones switch cities counties better quality life rural people loves place though quality life bad type work want graduate cheers thank kind work means taxes paid werent used betterment underprivileged per month seriously per month indian relatives absolutely full denial due caste oppression systems would care others got people fingertips ready service evey need stereotypical sheltered rich people behaviour completely delusional point think actions people problem still people shun menstruating women massive problems domestic abuse alcoholism casteism religious discrimination suicide people literally murder children marrying wrong person wrong gender work village madhya pradesh dalit population allowed use community well forced walk kilometers dirty river get water built well definitely helpful also shouldnt necessary need change mindset communities need focus first education children everyone government propaganda proper education theres enough money anywhere fix problems start people easier rest follow country like india easily solve problems democracy people last years couldnt understand make democracy work even today clue felt demands never met one knows lets see prashant kishore succeeds crore people earn around rupees day core country crossed borders locality see world mobile phones dont understand reality pathetic difficult life countrymen last picture melts heart melts heart water isnt median indian family isnt going hungry without shelter sorry personal question get poverty kudos though poor country taken upon responsibility saving hindus hindu culture thats reason poor remain poor country religious population poorer gets unproductive reason cling put responsibility improving lives imaginary beings india fighting religious war imaginary deities currently dont wake dream state going anywhere poor remain poor education attended tier grad post grad thats village boss someone please educate end generational poverty dont kids pass poverty let kids live sufferings misery crore people living govt ration yeah india like question would show us youve actually used money donated welfare poor folks budget dedicated people various schemes sus rich member windsor house london visit home could feel something similar op offense though point might seen much opulence away year movie go could happy contented human experience long arent introduced certain complications think important part human would probably live happy life yes deprivation life grew bihar sabka sath sabka vikas ashe din aye gaye ek hai safe hai wah modi ji wah yet fine current sociopolitical conditions india fact glorify side scary straight incorrect educate agitate organize miss warmth people gullible enough charity poor even contemplate buying ghee apples rajama grew poor knows considered luxury bilkul mere gao ke ghr jaisa h like delhi pollution airdeceitscamsliesadulterationwife swappinggarbage heapshigh decibel sounds hitting ear drums accept villages always neglected politicians villages still preferred reasons congratulations know india still lives today recently visited village uttarakhand complete opposite water available almost free cost electricity didnt go even entire weeks every house toilet grandparents also complaining one farming anymore since central government provides free monthly ration wish think village norm dont think extremely impoverished villages norms either probably bell curve like things props op working advocating betterment latter x zwaaezsezj situationuhhhhh jhji h jjujjjijuijuii ii uu blame bangladesh move kerala villages mostly different north eastern states also different realize western attitude towards sex like world right think middle east africa permit better hazardous gurgao village still houses like people live longers dont dare say anything modi ji someone might drive truck full fellow chhapris speakers play hindutvapop top max volume front nearby mosque dancing ugly hard work put grew like grandparents still like live situation thank nri breaks heart rich poor ratio skewed growing little better guys buys stuff ac supermarkets going choice food items prices mentioned blabbers reddit poverty also national income around usd per day rs approx definitely low better decade back definitely see lot less beggars people knew use stay muds house pakka house better definitely say progress made total lie propaganda ghar ki yd aagyi selective ho didi aap sirf woh post kia hai jo apke agenda ko fullfill kare genuine question hate sarcasm india really progressing wait villagers picture didnt get benefits ujjwala yojna providing gas cylinders goes place op new norm decades developement works done cities rural areas left fend give another clue visit government schools cities government schools rural areas eyes open new kind knowledge oh boy oh boy first right buy stuff ac supermarkets india anymore second india bought stuff rehri markets would rather help reliance superstores third pull number ass national average set government check thinking average indian income usd laughable skewed matrix honestly mean tell family pictures income lakh month fourth dont really give sht govt propaganda give sht people suffering people like blind see happening fifth things mentioned basic necessities community grew punjab ghee everyday product us course gave examples familiar honestly telling gas cylinder rajma daily necessity luxury superb photos pardon ignorance looking grew similar environment attending government school starting career right completing secondary education poverty taught art resource management scarcity instilled appreciation value economic hardship inspired embrace minimalist lifestyle today hold leadership role multinational company traveling across country yet often find people meet seem happier many us many people live like grandfather growed probably seeing old small mud house month per capital expenditure data wikipedia govt draw poverty line wherever want raw data top percent spending bottom percent even top percentile rural india around k k urban indiawith talk inequality even top percent rich small pie shared unequally need simultaneously grow pie distribute well turn old generation wheres data lol bro way didnt expect aqi less fifty least one house bihar every house looks like villages improved cities dying money going business standard mn indians living extreme poverty world bank report wsj new poverty formula proves test india reports wan na know funniest part govt claims reduced poverty refuses provide data conduct survey even revise poverty line claim hey look poor anymore data available third parties guess govt busy religious debates actually surveys dont think even done census people living month data people living rs per month per person india wan na know life old lady th pic perception life must different clearly millions bike sales fake cars choked roads driven billionaires whove seizing wealth created dirt poor tin shades roofs total walls homes since houses rapidly expanding cities empty fuck schools empty internet user base coz majority cant spend even rs per month connectivity either indias majority population definitely come poverty absurdly pessimistic need shit efforts create opportunities seize improve lives things relatively better southern states like tamil nadu think social upliftment necessary catalyst economic upliftment need make believe deserve better living standards demand handed need demand opportunities upward mobility achedin signature line ministry tourism im village like rajasthan yes situation like thankfully weve got better places weve got water supply people got cows goats blessed people india deserve going canada years isliye hi well fare system chahiye ive seen worse parts nation sad real insane wealth disparity india alarming youd like engage consider contributing cause discussing implement sustainable widespread solutions pressing problems good reminder individual actions collective responsibility complement addressing deep rooted issues socialismand colonialism country minimum wage day family earners makes month negative provides days work year year month even income finding people living month atleast dont pay taxes like never try learn india reading stuff written diaspora stuck time warp idea india left eg indians came us lot conservative came turn conservative youth india today well researched work journalism try baksheesh brahman book joseph campbell travels india even older diaspora trillion economy dollars year billion people thats distributed evenly wont see end poverty k usd per capita gdp means trillion economy least even population grows india changed lot years might well read shakespeare today try understand brexit worked europe us year stints couple years back india stint everytime come back feel totally different country india changing fast try understand post colonial navel gazing treatise amount research looking outside tell india isyou live ken gestalt indian society father came poverty luxury collegegovt engineering college shoes gulab jamunsweet uncle came visit father could never afford visit throughout college calling op liar dont see reality around choose agree move mean even cities type houses common slums areas much difference people used live hundred thousand years ago village rupees lets take one one buy ac supermarkets mom pop stores aka rehri country make effort find give money corporate blood suckers like reliance whatever derivatives country secondly may pulled numbers ass total shit number quoted world bank new studies say income levels increased getting better precovid era china able fully come covid shock recovered better credit said earlier much better point say good data wrong either mistake malice totally propaganda totally sync india reality either watch antiindia western news outlet kangressi media protestors black flags outside indian embassies lastly may care indian government since doesnt concern anymore us indians cause live die country government well supported people like us plan run away like enjoy wherever keep bs friends circle post publicly people like us show facts awww hurt little brain comment go personal attacks none comments really make sense except part address facts links acknowledge much think problem fail civilized discussion without personal attacks know cant prove argument hello guys dog tumor needs removed specialist extremly expensive woke puddles blood room unfortunately cover cost surgery refuse give hope contribution matter small huge help gives us hope difficult time donation big small make difference together show alone difficult time deeply grateful kindness support",
    "light_cleaned_title": "I visited villages of India and this is the situation",
    "light_cleaned_selftext": "I have been serving in Sagroli Village of Maharashtra for sometime now. Today, I had a chance to visit the houses of the Orphaned, Single Parented and Under Privileged Students in the neighbouring villages who live in our hostels. It was an extremely humbling and eye-opening experience. I also found out that there are hundreds of more students living like this, unable to study and need our help. This is what we need to contribute to when we have the privilege living under a cemented roof. The real India out there is extremely deprived and distressed. I am extremely determined about making a difference in the lives of their next generation, please help me in this endeavour by contributing whatever you can. The real India needs you! Link to donate:",
    "light_cleaned_comments": "Ref your previous post - Can we directly try sending help to the school? Like books or equipment that they can use? Yeah, you can definitely do that as well! There’s an amazon wish list for the things we require, I’ll share it here: \\> The real India out there is extremely deprived and distressed Btw, if you did not know, the Indian govt. considers these people above poverty and counts them in the 400 million people lifted out of poverty in the last decade. This is the success story we are supposed to be proud of. If this is not extreme poverty, and this is what lifting people out of poverty looks like, then we've got a problem that will be prevalent till eternity. amazing work 🧡 Majority of India has lived, is living and will continue to live like this but don't worry we'll soon be 5 trillion economy Exactly friend, exactly. Government has completely ignored this region and giving lollipops in the name of upliftment. If you can and want to help them, please do consider donating. Now only civil society can make a difference. Thank you!! Please do donate whatever you can: Exactly!! Please do help us help them. Do contribute whatever you can, they really need it: Then only thing I can see and wonder where is my fking GST TAX is going .... But they seem to have a peaceful life ... But let them get proper food shelter and medical service That’s exactly what we want. Many of them do not get food three times a day. Please help us help them! Sanskriti Samvardhan Mandal (SSM) is a small but deeply impactful NGO working in one of the most challenging regions of India—the drought-prone Marathwada area in Nanded district, Maharashtra. In a place where poverty and drought have left countless families in distress, SSM has taken on the monumental task of bringing hope and change to those who need it most—particularly vulnerable children. At the heart of SSM’s mission is Anand Balgram, a home for orphaned children whose lives have been shaped by the harsh realities of this region. These children have lost more than just their families—they have lost their sense of safety and security. Anand Balgram offers them a new beginning. It’s more than just a shelter; it’s a place where they receive nutritious meals, a nurturing environment for their education, and the emotional support they need to heal. Here, children are given the opportunity to dream again, to grow, and to become confident individuals who can face the world on equal footing with others. SSM also recognizes that the future of this region lies in education, which is why it works tirelessly to ensure that even children from the most financially and socially disadvantaged rural communities have access to quality learning. Visitors to the NGO’s schools have often remarked that the standard of education rivals some of the best institutions in the country. SSM believes that where a child comes from should never limit their potential, and every child, no matter their background, deserves a fair chance at a better future. Beyond supporting children, SSM also focuses on empowering rural youth and women through skill development and vocational training. In communities where opportunities are scarce, SSM helps individuals gain the skills they need to break free from the cycle of poverty and build independent, sustainable livelihoods. The organization’s work is grounded in the belief that real development happens when people are empowered to shape their own destinies. For over four decades, SSM has been quietly transforming lives in some of the most neglected parts of rural India. Whether it’s providing a safe haven for orphaned children or opening doors to education and employment for the rural poor, SSM’s work is driven by a simple yet powerful belief: that with the right support, everyone has the potential to rise above their circumstances. By supporting SSM, you are not just giving aid; you are investing in the lives and futures of children, youth, and women who will one day be the strength of their communities and our country. Donated. And props to you for going to the ground and doing your part, not all of us are that determined in life. You've got a gift you don't know. I want to keep you motivated but let me still speak the reality - the civil society cannot uplift millions of people out of poverty; that is why democracies need government; that is why we pay taxes; that is why governments are structured to do this job; else you can go deep into the roots and ask yourself, why do we even governments and civil servants; shouldn't military rule be enough? Sanskriti Samvardhan Mandal (SSM) is a small but deeply impactful NGO working in one of the most challenging regions of India—the drought-prone Marathwada area in Nanded district, Maharashtra. In a place where poverty and drought have left countless families in distress, SSM has taken on the monumental task of bringing hope and change to those who need it most—particularly vulnerable children. At the heart of SSM’s mission is Anand Balgram, a home for orphaned children whose lives have been shaped by the harsh realities of this region. These children have lost more than just their families—they have lost their sense of safety and security. Anand Balgram offers them a new beginning. It’s more than just a shelter; it’s a place where they receive nutritious meals, a nurturing environment for their education, and the emotional support they need to heal. Here, children are given the opportunity to dream again, to grow, and to become confident individuals who can face the world on equal footing with others. SSM also recognizes that the future of this region lies in education, which is why it works tirelessly to ensure that even children from the most financially and socially disadvantaged rural communities have access to quality learning. Visitors to the NGO’s schools have often remarked that the standard of education rivals some of the best institutions in the country. SSM believes that where a child comes from should never limit their potential, and every child, no matter their background, deserves a fair chance at a better future. Beyond supporting children, SSM also focuses on empowering rural youth and women through skill development and vocational training. In communities where opportunities are scarce, SSM helps individuals gain the skills they need to break free from the cycle of poverty and build independent, sustainable livelihoods. The organization’s work is grounded in the belief that real development happens when people are empowered to shape their own destinies. For over four decades, SSM has been quietly transforming lives in some of the most neglected parts of rural India. Whether it’s providing a safe haven for orphaned children or opening doors to education and employment for the rural poor, SSM’s work is driven by a simple yet powerful belief: that with the right support, everyone has the potential to rise above their circumstances. By supporting SSM, you are not just giving aid; you are investing in the lives and futures of children, youth, and women who will one day be the strength of their communities and our country. Please help us help them: Exactly, I know exactly what you are saying. It’s the saddest reality of our country. I said so because government has completely ignored this region. If not them then who? And how do we? respect to you, your doing god's work Thank you so much friend. Please do donate whatever little you can! Yes they could probably use some help but pretty sure they have a happier life than someone slogging in corporate under a fancy roof, laying on top of plushy mattress. We have extremely terrifying requirements for what is considered \"liveable\" or \"above poverty\". Rs. 1200 a person in urban area is considered \"above\" the poverty line. It makes me wonder how detached from reality our policy makers are. Can you imagine living on 1200 in a small city like Amritsar in punjab, let alone a city like Pune or Mumbai? These people you posted? They are not even poor according to our govt standards. We present this image to the world that our country lifted millions of people out of poverty when in reality they are living on basically nothing. To put it in perspective: A gas cylinder costs between 800-900. 2kg ghee is 1300rs. 1 kg apples is 250ish. Freaking Rajma cost above 100rs/kg. These people are not living, they are surviving. It is 6 degrees here and they have no door, that’s how the uncle in the second picture sleeps. Do you really think they are happy? He lost his wife and daughter due to maternal mortality. It’s sickening. Exactly!! Please do donate whatever little you can. Do it for them and their future. Even Rs 50 counts! Please do: Most NGOs are fraud. Whoever has worked in NGO Sector knows the truth. And yet our country's beggest problem is \"What is there below that masjid ....\" \\\\s I never said they do not need help logistically. I have worked in NGO sector and no NGOs are not fraud, especially the ones working from villages. 1200 per what? Month? Maybe not in terms of finances, but they look extremely stress free from their lives. While we live in constant fear of uncertainty and competition. Their is much more laid back and relaxed. But yes, financially their condition could be improved. That's one really self centred and delusional take. It is 6 degrees here and they have no door, that’s how the uncle in the second picture sleeps. Do you really think they are happy? He lost his wife and daughter due to maternal mortality. It’s terrible for them. Which states? Yup. About 1200-1250 a month is national average for Urban India. I think for rural, its about 1000 or 1100 a month. I grew up like this. When i visit my hometown there still about 80-90% families still living like this. This is how look like 60 percent of India Almost all reddit users are financially rich they never accept this India Indian government failed to provide basic right like water, food,.. Majority of indian citys villages forests polluted with untreated pharma waste including river bodies Many states ground water is dried India produce too much food still facing hungry starvation because of miss management and also wasted huge food on daily basis same for vegetables fruits the villages in Maharashtra,odisha and madhya pradesh make you question what year you live in. the government put so much efforts into north indian villages they forgot about these places, im pretty sure right now as we speak a child died due to water contamination (cholera mostly) in a village. mortality is so common in these places people have gotten used to it. People who’ve grown up in cities often see India through an urban lens...like streets, slums, and tourist spots, which is just a small part of the country. The real heart of India lies in its villages, where most people live with a different perspective on life. You can ask for donations, but portraying \"real India\" as only deprived and distressed is a misleading narrative designed to evoke sympathy and prompt people to send money. Often, these narratives are crafted to raise funds for organizations or to gain likes and comments, but they ignore the fuller, richer picture of rural life. Many villagers aren’t materialistic or in a rush to move to cities. They are deeply connected to their roots, living a life centered around community, simplicity, and tradition. While they may not have much in material wealth, their understanding of family, happiness, and fulfillment often runs deeper. To truly grasp the essence of India, spend time in a village. Conversations with locals, learning about their views on life, work, and progress, can be eye-opening. It’s a world largely untouched by the relentless drive for urbanization and material growth that dominates the cities. To compare India to countries like the US or France based solely on poverty misses the greater complexity. Visiting a village is one thing, but immersing yourself in village life shifts your perspective. Many people there are not chasing \"modern\" ideals or dreaming of city life...they define progress and success in their way, one that’s not tied to material accumulation. You don’t need to travel to villages just to capture images of poverty. The harshest conditions can be found in cities too. Unbelievable In Hyderabad to just get a bus pass for a month is around 1200 They are not stress free life, nobody choose such life They just accept and living with this conditions Never ask barber if you need a haircut. This isn't a North-south issue. I don't know about tamilnadu or kerala. But much of rural Andhra, Telangana is EXACTLY like this. Extremely dilapidated conditions all across. I hate to be the opposite voice and admit that if I don't see something doesn't mean it doesn't exist. But in my village which is on the way to becoming a small town, most of the people who used to live in huts or worse have gotten a concrete house and is nearly open defection free (I know this because it used to be impossible to walk in my fields without almost stomping on shit every 5 sec) I cannot make claims about their income because I don't know that personally. >Many villagers aren’t materialistic or in a rush to move to cities. It is not materialistic to have a properly insulated and heated home when it's six degrees outside. It's not materialistic to be able to cook without killing your lungs. It's not materialistic to be able to afford food that doesn't make your children suffer from malnutrition. These are the basic necessities of life, don't try to trivialise the situation of these people. The poor in developed countries (not the US) have all these things, despite their financial situation. Villages in India >>> Cities of India This is the reflection of so called Amrit Kal, Vishwa Guru, 5 trillion economy, blah blah blah...... im not framing it as a north south issue, i dont know much about south villages... never been there. but what i do know is north villages like the one from which i originate, went from electricity for 4 hours in 2 days to 18-20 hours of electricity daily which is the case now. the government scheme of cylinders also came there but not as we go down. Not much different from how construction and other daily wage workers live in cities. Please help us help them: It is 6 degrees here and they have no door, that’s how the uncle in the second picture sleeps. Do you really think they are happy? He lost his wife and daughter due to maternal mortality. It’s terrible for them. Maharashtra. How many kids do they have? Can they read or write? How much money did they spend on education Vs marriage Vs rituals? What do they prioritize more, education or religion? Do they have a backward mentality? Like caste caste caste... It's not like they're not little responsible for their condition. If anything you take from this post, Please help us help them: Every where there is problems 😭 In all the houses I visited, they have 2 children at most. Even though they earn extremely less all their children have been put into schools including girls. Meanwhile my middle - upper class parents and family only talk about the GDP and how things are improving, never any talk about the struggles many still go through. I’m living in the U.S. and they always try to convince me that India has become way better to live in the 5 years since I left. Why they are not considered poor? You are doing a great job OP! Where exactly is Sangroli ? It’s a village that comes under Nanded district of Maharashtra. Look at the threshold used - [https://www.newindianexpress.com/web-only/2024/Feb/29/has-extreme-poverty-vanished-in-india-and-is-it-time-for-the-poverty-line-to-be-redrawn](https://www.newindianexpress.com/web-only/2024/Feb/29/has-extreme-poverty-vanished-in-india-and-is-it-time-for-the-poverty-line-to-be-redrawn) >Currently, we use the Tendulkar poverty threshold, where a person living on a monthly expenditure of Rs 1,000 per month or Rs 33 or less per day in cities, and Rs 816 per month or Rs 27 or less per day in villages is considered poor. I am sure these people earn more than Rs. 27 per day, do you think that is enough for a proper house? Please help us help them: thank you, appreciate the work towards this, donated! Exactly! Please help us help them: Tax nai dena ur normal kaam karna hai tension free life life mast life na kapda na gas na light sab bachat aur sukoon ki zindagi they mast It's even worse in my area. According to many redditors here, any govt support to them is a waste and against the interest of bjparty, or like they prefer to say , the nation. They don’t want these people to get any “freebies”. Exactly. Please do help us help them: I want to know which places are these...? Hipparga, Shevara and Shimpala villages in Nanded district of Maharashtra. Great initiative. Keep it up. Thank you for your work. Donated my part Ache din Every country was poor at some point. But they worked their way out of it. We didnt. Because our people kept voting for the worst outcome. They still do. You're doing great work. But I personally can't have sympathy for our people. Exactly! Please do help us help them: They are in rural area This is the India I came from. This is the India I miss, sometimes. You do not have the choice to be happy unless your basic needs for living are satisfied , which in this case are not. It might be the case there. But rural india in general has a very anti -progressive culture and mindset. They spend lakhs (no matter how poor) in marriages. And all they do is caste-caste-caste-religion-religion-religion 🤡 They don't spend nearly the same in education. No government can fix this issue immediately, not congress, not the BJP, no one. Need some educational revolution, and need to put a big chunk of GDP on improving educational Infrastructure (that's where i wanna see my tax money go) In short:- centuries of poverty can't be fixed immediately and culture is more responsible than the government. The government is ineffective though. the result of jumping straight to service sector and ignoring manufacturing. India missed the boat, we could still bring a change unless we are ready for large scale reforms. but the cowards in center are scared of getting Delhi surrounded by the landlord class pretending to be working class. Is there a way to just scan QR code and donate ? Hi Akash, this is to ensure that the money that is coming is white and for you to get tax rebate. But if you wish you can directly donate to riyajoshi2.rj@oksbi and I will ensure all the money that comes through goes through the proper channel. It’d probably make more sense to fight for an institutional change, than donating money to some random charity however trustworthy they may seem. We need a fundamental change in this country, in the minds of the people, money will come and go, but the mindset of the corrupt politicians would never change unless the common populace forces them too. Hey!! They are breathing the air, isn't that enough leverage they have according to filthy rich & politicians. Thanks for the explanation 🙏 People who live in their rich utopian bubble won't even believe that this is also India. Disagree. Industries are struggling for labour, job paying 15 k a month . One needs to step out of their comfort zone, so many manual jobs are available :)) sad. Do help if you can: Keep trying that, one vote at a time. One protest at a time. Both things can be true, however. India has a lot of problems. But things have also improved for a lot of people. We need to make sure they continue improving, and not just for some, but for all. Exactly!! :)) Do help if you can friend: Do help them get three meals, let’s try to provide what we can to this India: Exactly! Do help whatever you can: Other community posts, same pictures but different title... It does not reflect all the villages in india. ( i grew up in a village in kerala) I wish better times for these people but it's quite possible they are happier, healthier even than us corporate slaves making loads of money. I know people absolutely miserable for 50 hrs a week but can't quit. This is the answer for why we still have this situation even after 80 years of independence [https://www.youtube.com/watch?v=-mdtUsMVRjA](https://www.youtube.com/watch?v=-mdtUsMVRjA) I know many here would not like this view of mine, but in most parts of india, rural, small cities, we still have the view of upper class benefit, lower class remain lower. Look at how our finance minister also taxes us. Its all part of the same thought. I will not get into the nitty gritty of things but as long as we have this view towards our people (low or high, rich or poor), we as a country will not get rid of this even in another 80 years. I titled this the same but r/india removed it by stating it’s a clickbait title. Hence I had to change. It’s Ofcourse me posting. We need help, they need help. Help if you can: Do help the people in the village of Maharashtra. Okay... Thank you for hoping friend. Please do help whatever little you can: If it was stress free, more people would give up their worldly pleasures & live like this. Thanks for sharing this friend. Please do contribute whatever you can in helping them: i have always wanted to live like this, i have never enjoyed suburbs You are romanticising villages too much. Even villagers don't like living in villages - about 1/3rd of India lives in cities, massively up from older data. This is because of migration to cities. Hey OP, great work :) I prefer not to donate through organizations, as I believe directly giving money won't solve the root problem. Instead, I’m happy to support a child in their education, potentially covering all expenses till 10th/12th class. Having lifted my own family out of tough circumstances, thanks to the best education I was fortunate to receive, I understand its value. If you know a child who genuinely wants to study but have financial constraints, please connect me. My sister and I would love to support them, not just financially but also with mentorship. We genuinely believe that even a little guidance from us could potentially change someone’s life :) Looking at these photos it looks exactly like Bangladesh. I would be honoured to donate to this NGO. Also the photos are really good. PM Awaas Yojna ka paisa khaa gaye? In my village almost every one has an RCC house thanks to Indira Awaas & PM (Modi) Awaas Yojna NORTH Indian \"No exaggeration, but there are also some perks to village life: - Good air quality and less pollution - A more social environment - Lower inflation (it's really like that) - Fitness - I've noticed that people in villages tend to be fitter than those in my city However, there are also some drawbacks: - Transportation limitations - The position of females (although I think males have it worse in this country) - Limited educational opportunities\" I know experience can vary mine is from a village form rajasthan Please do donate whatever you can friend: God bless you! Thanks Whatever you can say about India the opposite is also true Bhai kaun se garib jaaon main chali gayi aap. I have a friend in Tamil nadu who is living in similar kinda home. He is holding 6acre land there. Just don't know why he is living like that. Nothing related to it. Just my mind stucked on it now when i see this post. Uh huh is this your personal bank account? They are poor and the government is corrupt and does not have its priorities right Village of any growing economy on earth is like this. Those who are educated there or hardworking can grow out of it. I am not blaming any government UPA or NDA. I believe India has done tremendous work in economic growth considering that they started from nothing in 1947. It is easy to take random rural undeveloped photos and blame it on government by comparing it to Europe. Where we were and where we are now is the right comparison. In terms of countries to compare, BRICS, South East Asian countries and immediate neighbours would be the right comparison I use this one to only collect funds, my personal bank account is different. I’d always suggest to donate through the link as it will ensure the money is white and you get tax rebate: Exactly! Please help whatever you can: Jaha jaane ki zarurat hai. Jaha lakhon mei log hai. Try visiting Western UP villages also. You’ll see prosperity. Try helping one step at a time: Though I'm not happy about being born in India, I'm grateful for at least being born into an urban family You can also get help from Wipro, Hcl and Piramal’s Corporate Social Responsibility Fund Yes. It’s like this everywhere my god. You know what I used to be scared of in my life. I might die without changing any of this since the system behind is so powerful and untouchable enough for a common man to even think about. I’m just 26, entering this area of world learning and growing. Seniors here, Help me with this - who is responsible for their well being and liveability - Their village? State govt? Central govt? Society? God? Or they themselves? I saw the critieria from another comment. Hi, tried it. They also don’t prefer such remote locations. What is SSM? It’s never black and white. It’s the combination of all these factors mate. Do help in changing bit by bit if you can: SSM is an NGO working in Sagroli Village, Nanded district Maharashtra. Know more about it here: Do help if you can: Yes! Do try to help them though: The villages in Punjab and J&K are far better than this. Even 2 decades back they were better than how this looks currently. This is not true for whole of India. Do try to help in whatever extent you can: Thank you so much!! This part known as Marathwada is completely ignored. Exactly!! Do help in whatever capacity you can: Thank you so much friend, god bless you! Yes that’s exactly what this fundraising is about. But I can personally connect you to a child definitely. There are SO MANY OF THEM. I think the ultimate weapon the non-rich have is the choice not to procreate....if there are no poor left to exploit then there are no rich people .... However the society conditions all of us to think this isn't really a choice and many aren't even aware... children are unfortunately treated as property, across all economic strata...maybe more so on the lower end.... The suffering is mostly by the child who will most likely perpetuate the cycle Rest, we can help one starfish at a time Yes we are trying to help the next generation. This really puts things into perspective, and also shows how detached we are from our own country and society. Donated for the cause with whatever I could and I hope they get some relief from these dire situations. Thank you for bringing this to light OP. Kudos! Did they have proper washrooms? This isn’t the majority case. Oh I am glad my local leaders are good. I can just pray for them 🙏 No Spent childhood in worse house than this, and now villages are getting better over time. Isn't population also an issue ? We would also soon be 5 billion if we keep reproducing at this rate I wrote an article on why India will improve 4 years ago. It’s been a downfall since then. few people don't there are villages in India where electricity doesn't have electricity True. Villages in my state are nothing like this. This feels like a different country. can i teach them for free?im from kerala and a med student .. do i wanna go there? or online? or can i teach them during my vacation? You can definitely teach them during your vacations. Internet is a problem here. Although there are villages that are so better compared to these . But the govt surely need to look at the conditions of these villages as well They look happy Thank you for the response At least man they are happy breathing in 40-50 aqi meanwhile me being a chain smoker without smoking. They eat good unlike me eating fruits and vegetables full of pesticides and insecticides. It doesnt look terrible, simple but the people look fairly healthy? Do they have jobs, futures? This is what matters more than the material condition they live in. Suddenly feeling grateful for everything I have. When india will provide free education?? Despite we know how Ambedkar has made a huge difference, current gov keep ignoring the reality and insulting who made the constitution Please do help them in whatever capacity you can:https://www.unitedwaymumbai.org/fundraiser/23875 That means India people wants to remain humble and rooted to earth.. Come to my city I'll show you how millionaires still roam on Splender Plus and not in any braded cars. Come to Bengaluru buddy I'll show you at least 10 people who in Innova to get the free ration provided by govt and they own BPL card even after being karodpatis God bless you & everyone. A lot of work is needed to be done by us. Atleast they're happy man!!! Don't ruin it I understand, but I have my reasons for not contributing in fundraising campaigns. Thanks, and feel free to DM me anytime! blah blah blah, you are educated, i ask you what is your solution. As an American who has visited Mumbai and wants to learn more, Rs 27 is the equivalent of 32 US cents. That is less than 1/3 of a US dollar. How on earth can that NOT be considered poor? I enjoyed my visit, but I want to learn more about the population in general. The disparities between wealth and poverty in Mumbai were shocking for me. And I genuinely want to understand more of the politics and the reasons for these disparities. As I am disabled, I don't know how much I can help. But I can help raise awareness, and help those around me appreciate what we have. I wish peace to all. Donated via UPI i'm not arguing here just want to add that poverty isn't just how much money people make but considers various factors. Like, are they eating enough calories, do they have a roof over their heads, access to education, jobs, etc. You're right though that rs27 is appallingly little. The sad reality is deliberately overlooked by the politicians and the mainstream media in exchange for religious propaganda and dreams an akhand Bharat. I agree with you. But much of that is determined by income. There are also factors like medical care. In Navi Mumbai, it seemed like there were engineering schools on every other block. Small hospitals were plentiful. But that doesn't help if the person cannot access these amenities due to income. I understand that some charities help. I'm not sure how much the government helps because I do not have a firm grasp of the politics of India. There is so, so much potential in India. India produces some of the best doctors, scientists, and engineers in the world. But that doesn't help the common person who has nowhere safe to sleep during monsoons. panjab villages are nothing like this Damn the situation is a lot better than what I expected Exactly! Please do help in whatever capacity you can! Please do help in whatever capacity you can! God bless you friend! Not commenting about there financial situation, but they may have better happiness index than people in the cities or even people of USA or other so called developed countries. Genuine Question: When will we become a developed Nation ? How can we achieve this ? Why aren't we able to achieve this ? Why do you miss it, I suppose it's not the hardship but something else? India will never improve under a ultra-religious party, like BJP, only few people can become rich that's it. 80 percent india is like this Please do help them in whatever capacity you can! this is what the tax payers pay money for. so thst govt can uplift these people but they ghanta give a shit. as a taxpayer, you pay 30% of your salary and then have to pay huge living expenses for a metro city. You’ll know the best! Do help in uplifting others too: Exactly!! Do help us help them: That’s true. We need to start from somewhere. Do help us help them! Sure. I’ll let you know the exact requirements and DM you tomorrow. There are small things like there are girls who need money for school bag etc. Thank you so much, god bless you! These villages are from Maharashtra. They literally have nothing to eat. That’s why we need help to help them: Thank you so much friend, god bless you! Cfbr Dunno where the taxes go … actually we know True. Do help us provide education to them: Thank you friend, god bless you! That’s why we need help to help such people. Do contribute whatever little you can: Thank you friend, do contribute whatever little you can: Exactly! :)) Do help us help then though: It’s terrible. Do help us help them though, you’ll get the tax rebate as well: Feels a bit cherry-picked, to consider this the entire village. I totally believe you, but i hope you understand my view. As a matter of fact, this is not extreme poverty as present in India. Things are, too often, worse than this. The real India I have specifically mentioned in the post to which houses I went. But there was one village where there were only tin houses except for one. It was pretty bad. Do help in whatever capacity you can: About to comment these they're more happy ththan 70% of us here Do help us help them in whatever capacity you can: Do help us help them in whatever capacity you can: If you come across any patients requiring medical help, do let me know. Will surely arrange for their treatment in my hospital absolutely free of cost. Their definition of happiness is not the same as ours. They keep their home and surroundings so clean. what is the definition of happiness There are all kinds of people with different preferences. Many from cities are moving to smaller towns and villages for a quieter, better quality of life. Agriculture, for instance, is something you just can't do in a city. So, saying nobody likes village life is overly simplistic. It's about personal choice and opportunity. If you think Indian villagers are extremely deprived and distressed, and nobody wants to live there, it's your perspective. I have shared mine. Happiness is subjective. Your socioeconomic status plays a major role in what you perceive as happiness. For the oppressed and destitute, getting two meals a day could bring happiness. But it clearly doesn’t mean that they deserve just that. That’s what a developing country means. It will keep on developing because development is needed not for the people but for the leaders we elect. Womp womp womp. You could release Swadesh today and would feel contemporary. The only difference would be mobile phone and internet. You do realise that we’ve lifted millions out of poverty right? I just teared up looking at the images and reading the caption. It hurts how bad the situations are while we go on our lives worrying about our wants. It hurts how many stories and families go unnoticed and it pains me to understand that our country still is at this level. Kudos to you, maam, for such good work! I’d suggest cross posting to other subreddits too. (Someone please help where else can this be posted). That's what I'm saying these are the people who the government claims to have lifted out of \"poverty\" ‘Government claims’. Its a UN report. You have such amnesia that you’re willing to overlook anything and everything good. Bless your heart, mate. Because that’s quite a miserable way to live life Was that an actual toilet seat they made? Used to just poop in a toilet hole in the ground. At least it was like that visit family in New Delhi in 2002. I'm not saying that poverty has not been reduced but that thr government has manipulated the definition of poverty to show a bigger number than what actually is I don't believe few selected shots are right metrics for the huge ass country. Although I do empathize with the poor people. Shouldn't we look at number of roads, hospitals, schools, electrification, toilets across the country. Did you ask them what prevents them from getting better jobs? Tax lago sab par. /s Upvoting and commenting for better reach I think downvoters have issue fathoming deep messages in a conversation. Good luck lol So why didn’t Congress lift them out of poverty before 2014? Just 60%? India is better for the rich not for the poor. I thought we were already a vishwaguru. beautiful pictures >make more sense to fight for an institutional change, than donating money to some random charity It's not binary, you can do both at the same time. These people probably need more help and our attention, right now. It’s straight up the good guy Indian village in Temple of Doom Have you tried writing an article about how India is going down the gutter? It might improve things in 4 years. You never know ¯\\\\_(ツ)_/¯ Even 3 trillion economy still doesn't help that people live like this and that India has so many third world problems. A lot less trash than I expected , this must be one of the nicest parts of India 80 percent of India is village to be honest. Who wants a fuckin Mangal yaan or bullet train when you know 90 percent of the India is Below poverty line. My comment might be opposite of what others are saying because I have seen my fathers village (in UP) develop in last 15 years like crazy. My childhood memories are very similar to OP's photo but now when I go there (we go there once every year for some puja), I see proper concrete houses, sanitary facilities, etc. I would say development has been slow but not something that we can just negate entirely. Riya mam,I see you are not posting more in your WhatsApp channel?why's that,please do post more. Marketing for charity lol, 90% will go to salary anyway. Plus i don't belive in free money. are they farmers ? I always thought that claim of Modi's was a lie. Glad to know I was right. No way a thief and conman like him would do something like that. [https://x.com/deedydas/status/1869647888273531260](https://x.com/deedydas/status/1869647888273531260) I love India, but we cannot live in denial about this anymore :( A million mutinies happen every day while the GDP gallops away. Thank you for posting about the other (real) India. But we are famous in foreign countries now, all the people say that. You don't have to write anything new, just read V S Naipauls India a wounded civilization, it sums everything up. Ladki bahin yojna ke paison ke liye ye log hi vote dete hain Great work! Also keep posting the results on how the donations are changing or have changed lives. They will convince people and will help collect fund. You should have also posted the local MLA's house. You should visit the houses of village Pradhans They should stop giving birth to children when they can't afford to provide for themselves. I have always said this as an example for anyone who says India needs to be like china in gdp we need to compete with western and European countries but these guys need to understand that if I dian kept progressing forward only the top 10 percent even being generous will progress the rest will be left back and it is the bitter truth that even our fucking presidents that we had since freedom don't understand like bro we need to make the whole country to be on equal footing then we can dream of competing with others India is so unbalanced like it's crazy . I have so much to say about this butt uughhh everyone is close minded desh bhakt what can I do and when is say stuff like this they call be deshdrohi and foreigner glazer like bro wth 😭😭🙏😭🙏???? The state of villages is different in different places. In few you will find air conditioners and generators and all sorts of facilities and in some you will find lack of basic facilities as well. what do the people do to make a living? Until ans unless people don't start getting some useful skill/money making ability govt won't do anything they will make jobs they will make companies invest in the country, open manufacturing units in the country but what to do when people dont have skill, they have money to eat ghutka and dont have the same money to buy a phone through which they can learn things, even if they get one they'll be using that for scrolling reels Grew up in a shanty house like this :) most nonprofits didnt really help. But that was 20years ago.Thanks for doing this. Can’t we somehow enable them to farm bitcoin and start earning? This could be a societal game changer. from tamilnadu, I am orginally from a village myself, current leaders are spineless, but thanks to our past leaders, villages here seem to be much better than other states I spent my early career cleaning a village. I have the same values as you. Happy to connect in person to make a difference together. Pls DM if comfortable :) Number 1 rising economy, keep away with these fake pictures. We are number 1, ek dum no.1!!!! This is where our tax money goes. On paper. Harsh book. Ok compare with immediate neighbour China. They were a shithole with famines in the 1960. Where are they now? 🤣 Op do you work for an ngo? This is good if you compare to the north eastern hilly tribal areas where you don't even have access to water supply they have to take water from small rivers . Agree. But the country itself had inhumane laws that allowed such progress. Every time someone comes with this argument I ask them if they have elder siblings or if their parents have elder siblings. Because if they were in China, they or their parents would not be born. That’s priceless thing to give up. Me and my best friend cousin used to have this strong debate with some Chinese startup promoters in Bangalore HSR LAYOUT. My cuz was dating one of them and that’s how I met. She and all her Chinese friends would always speak big about China and development and at the same time they would also appreciate and envy the bonding between me and my cuz and his own brothers and some other cousins in our family. They are so bloody enslaved that they don’t even know what it’s to have your own siblings and first cousins. Is that what you call development? Swades if u visit villages of bihar u r gonna cry , they live sub saharan life That’s not necessarily true actually, I have Chinese friends who have big families. The one child policy existed but you could work around it by basically giving birth to children in another province. In any case, that’s old news. Also I don’t see how having a lot of cousins is “development”? It’s just increasing the population and reducing resources for everyone. China today is an awesome place miles ahead of any Indian city. Chinese people have a far greater civic sense, you don’t see them littering the streets like developed Indians. Rule of law is obeyed. I would say it’s well developed. There are millions like this. Many places in India where people live in very deplorable conditions. I thought everyone knew about that. People are still in their own bubble... Hi, yes. Please help us help them: Exactly!! Please help us help them: That’s really good friend. If you can in whatever capacity please help us help them: Yes but this is where the help is needed the most. Please help us help them: I totally get it friend really. If you can, please help us help them: Absolutely!! Exactly!! Please help us help them: He is jobless while his wife and sister goes to the field to work as farm labourers. Exactly friend! Please help us help them: I feel people are not responding to it. Thanks for the feedback. I will post more. Do help if you can: 1 pic is so peaceful Exactly friend. Please help us help them: Will do. Keep up the good work! Education is everything. PS, Had sent some to the teacher you'd posted about. Also shared it with my friends. Any updates on that case? Exactly!! Please help us help them friend: Heheh. Please help us help them friend: Thank you friend but also please help in whatever capacity you can: Yes, there were lack of toilets. Please do help us help them friend: I don’t agree that generally they have big families. Even I met a dozen of them in Melbourne and London. Most are single child families and very rarely they may have big fams. Yeah ofcourse most countries outside India have better civic sense. Chinese economy obviously one of the best in the world. Great development. Authoritarian but strong and visionary leadership. Yeah I appreciate all that. But having a lot of cousins or siblings is not for economic reasons. It’s very basic human right and one of the most beautiful reasons of being Homo sapiens and not a foking animal. I feel sorry if you don’t have any. If any government is stopping a whole country from even getting to know basic human needs and emotions it’s pretty much a jail like North Korea. SLAVERY. I have multiple times brutally criticised UPA and NDA governments and my state governments for their shit online and offline. I do that and I don’t even worry about shit. If I am being intensely censored and jailed or fined for that, I call it slavery. Maybe for you, money and economic development at any cost is the only thing that matters. I prefer freedom. Sorry. My choice. Thank you so much friend. God really bless you! We need more people like you. Heartwrenching condition but who is going to tell the bling supporters what should people deserve. Many generations will continue to live like but I am just hoping that they be more happy and content with their lifes. They are not. They don’t have jobs, there is maternal mortality. There is drought, there is lack of water. Please help us help them: Exactly!! Let’s help people one step at a time. Please help us help them: They certainly don’t have restrictions on family now. Overpopulation is nothing amazing about homosapiens. Rabbits have been known to achieve it easily, is it not? But saying “freedom to talk shit about government” is superior to economic development is laughable. The savage has all the freedom to yell all he wants, don’t see too many queuing up to become one. If you tell me that I can’t make derogatory statements about some politician in exchange for a comfortable, wealthy and happy life, I’d take that in a heartbeat. They are still struggling to find a bone marrow donor and have not reached the amount they need. The wife is still admitted in the hospital. It’s a really sad situation. Thank you so much friend for sharing across. God bless you really! Let’s help people one step at a time: It might as well be true, but even this huge number doesn't seem to have made a difference because of our population. Who are we kidding? all these NGOs are an exercise in monetization of someone's suffering. It’s just not cricket Don't worry they're are the so called \"upper castes\" they've not faced any oppression in the past.... Lol you trying help their children They have money to buy liquor but not for their own children superb Firstly tumne dhunds kya kitna waha property hoga open space wo log ka Bina tax gas light property tax deke mast reh rahe hai sukoon se they choose to live like this tax free and fast life free do not consider them as poor aur tum ghumne gayi ho help maang ke tum khud paisa bator rahe ho kya wo log ke naam pe , wo log ka kokootpalan hoga mast Pune jao bail gotha gadha pe zindagi chalta hai Aur itna hi help ka zor chadha hai jake waha ka local nagarsevak aur mla ko contact karo paisa fund maango Yaha kya karne aayi ho rona gana karne Jaha dekho waha metro walo ko aisa photo dikha ke lootne sympathy lene beth jate hai Everyone in utopia would remain silent on government if they have wealthy comfortable life just like that. The way you talk is like 100% of the population in China is “wealthy and comfortable “. Lol. 😅😅😅 90% of them have living conditions like shown in pictures above. Add to their misery they have barbarian laws. I don’t where you got brains but ‘freedom’ is the most important thing that matters and any economic achievement suppressing any citizen freedom is laughable. Why don’t you go to China and read their life on reddit and praise their govt policies and development. You can’t because it is banned it China. Just adding incase you don’t know- There is no country or institution or a recognised person who have ever appreciated Chinese model of development or called it an ideal model. No most of them actually belong to the reserved categories. 😑 Hmm, that is unfortunate. Hope and pray that they find a healthy donor and the funds required. Bless you too ❤️ You don’t have to go to a village to see this. There are people living right next to us in these living standards. But we choose to ignore and post to help here 2 pic with sky both are edited using app which changes the sky with single click of button. Don’t edit when not required just a suggestion The majority of this country is still living in the Fucking Stone Age, super power my ass. Donated! The people in China are wealthier than Indians. The country and infrastructure is 50x superior. They are competing with the USA, that’s how far ahead they are. Your “freedom” has not got you anywhere. Furthermore you don’t understand “freedom”. There is no such thing as absolute freedom. There is always a tradeoff between individual freedom and social norms. In India you are not free to have gay marriages for example. You don’t have freedom to criticise religious figures. If you write a book criticising lord Ram it will be banned and you could be killed. I can do that in China without any consequences. These are all relative things. Think before parroting statements. Who has not appreciated the Chinese model? It’s only ignorant people like you that say so. Here is the world bank, are you smarter than them? Lol stop your assumptions friend. It is as original as it gets. Yes you are right . It's always been like this I visited my mother's sister village in 2012 and visited this august, nothing has changed, the walls, roads, street light, nothing has changed or improved no matter which government is ruling the state. Hawk Tuah Exactly mate! Please help us help them: Exactly!!! The book. Also, please help us help them in whatever capacity you all can. Please do: Now I’m pretty sure that you are some GenZ kid who has just Internet knowledge and has no freaking idea how the world works. Firstly don’t put China and Freedom in the same bracket. Secondly I said they have millions of people living in poverty like in India and did not disregard their millionaires. Thirdly nobody gives a shit about same sex marriage and stuff when you don’t have basic human freedoms Fourthly, I don’t care about World Bank or UN report. I said nobody in the world except ignorants like you considers China ethical or morale. The difference between rich and poor is wider than 10-15 years ago. If we can’t uplift the living standards of the poor, what sort of development are we talking about. If you listen to current FM speeches, it’s clear that she doesn’t bother much about the poor people. There are good frameworks or policies for the poor and deprived. All she talks about the 3 trillion economy and corporate world. Changing the definition of poverty doesn't make poor people less poor Others come under middle class. /s isn't needed Current government has failed terribly in controlling inflation in last 10 years. On top of it they are putting taxes burden on to the people. They can’t control the export-import deficit. Our rupees has touched the peak yesterday. 85 ripples for a dollar ! Bura haal se haal ho rha h har din! Would love too. Unfortunately currently not in a position really. But someday, I'll do my bit. OP went to the remotest village and to the poorest. My village is very remote in Saran District of Bihar and looks a lot more developed than this. Almost 24 hours electricity, pitch road, govt built washroom in every house I am from one such village where poverty is almost similar with some improvement but the village population has almost gone down to 1/2 with mostly old age people. So situation is not exactly what the post is hinting! lol okay world bank is wrong, only you know the true extent of poverty in China 🤣Did you get it from “free” WhatsApp? Here’s another question - in India women don’t have the freedom to work/go out at night without worrying about getting abused, but they have that freedom in China 🤣 Yet they are probably happier than you and the most of the people commenting here. They are not alienated from themselves, their family, and their surroundings due to the numbness and illusions induced by mindless consumerism. They are nearer to Nature. You went for poverty porn. Even slum dweller sin India live better than this. I am in the same boat. I grew up in Aurangabad and very familiar with Marathwada region. I don’t like to contribute to charities because of my personal reasons, but if there is someone who wants to genuinely study and looking for a mentor, I am happy to help. Nope. Things have only improved for few. But for the rest it is either the same or backward. Hi OP, Donated and did my part! Do let me know if there is any way to physically contribute to this cause, maybe by volunteering or something. Would love to help🙏🏻 This is new modified India. Gay C RAM You can also check Pradhan Mantri Awas Yojana- Rural. This exists in the cities of India too I was literally looking for such a platform to donate directly to the needy since 2 days ago. Amazing how the Universe works. The thing is we usually associate cruelty only with extreme things like killings but in reality its much more than that, our government, politicians, judiciary system, civil service workers are part of the cruelty bcz they are not doing the work which they are fking suppose to do, i hope they get their fair share in afterlife. This has been India and continues to be the focus of today’s politicians. Every government at some level has focused on the poorest as they are big in numbers and support political victories. Not to sideline the focus of this thread and your work but the people forgotten over the last 2 decades are actually to middle class. A middle class that has worked tireless to make the rich richer and themselves just about better. We are seeing people in their 30s and 40s burnt out, frustrated because they spent so much of their youth working hard and still have no hope of a good future in sight. The government has failed to provide any development for the middle class. They have seen meagre increase in wages, no improvement in infrastructure quality, no policies on family welfare, no financial security, no environmental policies. Today average 30 year old struggles to fend for themselves, still hunts for a sub 10lakh car, struggles to think about having children, breathes polluted air and a very poor quality of life than what they deserve. Do you know how much electricity and initial cost required to farm bitcoin? Its not like farming vegetable. Money in this now may add trouble to you. This will come without PAN. Govt can consider as money laundering NGO. Your website is better, it has PAN as mandatory entry What did you expect? And to think this is a relatively wealthier state like Maharashtra. Imagine how entrenched poverty must be in states like Assam, Bihar, or UP. That's how it is, everyone living in their bubble , segregated on basis of class,religion,caste. The government is providing free ration to 80 crore Indians, so you can imagine the level of poverty we have in India. Tf how you getting 2kg ghee for 1300 ,people in my town are charging 1k for a kg of ghee Sure I’ll remove this. Exactly!! Please help us help them: Exactly!! Let’s help one step at a time. Please help us help them: Exactly friend! Please help us help them at the least: That’s really awesome. You can also get in touch with me any time for updates! Please do help us help them: The least we can do is help them. Please contribute: Sure most definitely!! God bless you. You can stay in touch with me. They do not have families, most of them died due to droughts, maternal mortality. Exactly my friend! Please help us help them: Sure will do But I am sure it will be developed by 2025. Or 2025.5 I was talking about Amul or Verka ghee, lol. If you add up all the bribes collected, and all the black money, it may already be a 5 or more trillion economy. Lol :)) Please do help us help them: Yes that guy in donation post is a fraud. By now you may be blocked by him. Just ask him how much money is collected and he will not answer Ye sahi hai click pics earn money Exactly!! Exactly my friend! Please help us help them: Thanks for supporting and having a multi dimensional perspective. We need more people like you! Exactly my friend but we can start from somewhere. Please do help us help them: The thought itself is enough! Yes that guy in donation post is a fraud. By now you may be blocked by him. Just ask him how much money is collected and he will not answer see her when others doubted earlier he told \"Majority of the donations come only from milaap but I can share you the bank statement and all upi transactions. Most of the people don't donate on upi as they only prefer the donation drive link. I can send you the bank statement and screenshots.\" But then he forgot about that Many reposrts are unsigned and some reports looks like some other perosn ahs written on doctors notepad and not a doctor also its easy to buy medical record Maybe if they didn't have like 20 kids each that they can't afford like would be better... Pretty more of us, even me, am commenting from such household setting. They might look happy and innocent but these kind of places are home of many victims who died by suicide because these villagers would shame thrm to the core I said what I said Just wanna know some info before donating: 1. Did you get permission from these people to post their photos/use them as an example of how sad poverty is? I don't really love this move. I've worked in many villages and I admire how hard people work and it looks like they have clean homes! 2. What is your organization's relationship to United Way? I didn't know they functioned in India. I have worked for them abroad. 3. From the link you sent, I gathered that the donations are going to building an orphanage and running some private schools. Is that correct? How is that helping people eat or live under a cemented roof (other than orphans, I suppose?) Thats a beautiful sunset. Then we complain why Hollywood shows india poor. Ever heard of the village name \"Madhapur\". It is considered as the richest village in Asia. These GenZ kids. Nobody told that world bank is wrong. I said nobody appreciates their ethics in development because it is against normal human standards which any prudent guy would understand except you. What are you man? High school. If you have finished drinking the milk, go talk to your dad about this he will explain. Biggest ~~democracy~~ mockery. Me: \"Living in the same exact conditions, watching my tribesman slowly but steadily improve lives, yet many remaining under poverty, not able to afford a proper school, basic health facilities, basic life style (although life style has different version there,) \"... This is life. aaaah!! Random person on reddit: India is poor LMAO. Paisa ki sunaa kehi chaadi ki jaethila ki. Remember these pictures, this is the India before the revolution. After the revolution fascists shall claim that the revolutionaries ruined the beautiful culture of India and what not, like they do in China. Well Vir Das was right, We all come from \"Two Indias\" No. I hate how reddir privileged class keeps crying about how bad they have it because they don't have their own 2 crore home or they are middle class becuase they only earn 15lpa. I always get downvoted because ofcourse, people reading too are the privileged class. If Internet and English were distributed equally, the current redditors and even Instagram/Youtube folks would be insulted daily for their sob story in india rich become more rich middle class become lower middle class and poor become more poor 🥺what type of development is this Correction. We're working our way out of it. Whilst there are cases like this, there are also cases of villages getting their first electricity, toilet, first guy from a family to goto college and get a decent job. Yeah that's where I differ. imo, the fact that villages are still getting their first electricity, toilet etc after 70 years, while dozens of other nations rebuilt themselves after wars, communism and what not and are now generations ahead - that's a sign that we have a cultural defect. Plz don’t generalize from one visit to one particular mohalla in a one village….. Now, Bakendra & Co. will say you are working on Soros' behalf. Can I paint the last photo? Digital ofc, is that allowed? I don't plan to sell it but it might be posted on my socials This home just seems unaware about PMAY. Fair Wages for All ✊🏻 You got distressed by looking at this! Visit little north to the villages of UP, Bihar, CG,Jharkhand and orissal. You will have a heart attack. Real Vishwaguru vibes. hopefully they get a bullet train soon. Jokes apart, Amazing work OP! Buy full fat milk and get ghee for free. Ahh why ?? Will do! Wtf are these stats correct source ?? How is this possible? Because it's the truth Ohh now i get it just wanna tell that they're still leaving a luxury life according to the village life i have seen This looks like how my Thai GF's parents live in NE Thailand. She would give them all the money she made in Bangkok and her father would still bad-mouth her. She stopped. This is how the majority of the world lives. it looks more like a slum than a village. I wonder which phone you used here. The photos are great What is “ethics in development”? Are UN and world bank “nobody”? Do you think the average person in China is not living per normal human standards? If so you should talk to your brother’s girlfriend and save her 🤣. As I pointed out, most Chinese are living at a higher life standard than Indians - they are richer, have better law and order, better infrastructure, better education etc. The only counter that you have to say is that “But they don’t have freedom to criticise their government Saar”. Giving up that that one freedom is nothing compared to the benefits they have got. In India you have the freedom to throw litter in the streets and you got dirty streets as a result. You have the freedom to say anything in public and you got idiots saying nonsense most of the time in public. The point of society is to give up individual freedoms in exchange for social benefit. If you give up your freedom to litter you’ll get clean streets, that’s how the world works. Believe me, these people are somewhat better off, many Indians don't even have this. A fibre cot and clean drinking water itself a privilege in our country. It will be a 5 trillion economy for sure, but reservation, poverty and corruption will never end Mene toh IT ko charity kardi ab mujhe kyu dikha rhe ho These pictures should be all the more a case for growth and development but nah, we want everyone to remain poor so that we can continue our poverterian lectures Love the optimism man but this thread and post will attract only those with a certain bent of mind - poverty is India’s birthright and we have to keep reminding ourselves of poverty. Never solve for it because that would make the problem go away. Beautiful❤ Not every house in the village. Not everything is like this in the village. How? What work do you do in the villages as you said you are serving? How can we contribute The condition of rural hospitals and phcs is dire You know now how good the government’s propaganda is through its online and offline content that they so easily pass of the underdeveloped part of the country. I think the average Indian village might be a bit better off than that pic... I think the very poor of India is 30% or so... About 30% of India is rich or lower end of comfortable. There's lots of poverty in India but not everyone is poor - it is advancing. It has huge population so it will take time... The average Indian is poor but not dirt poor. Yes... do any Indians actually like being Indian? Bro these are legit stats. We even studied them in 7th, 8th std in social science. At that time the amount was less than ₹1000 pm. If you’re financially privileged, *don’t* donate to feel satisfaction, warm your heartstrings or get blessings. Do your research and donate to actually make people’s lives better. Regardless of how it makes you feel. Not talking about this org specifically, but there’s a consistent well-documented tendency for orphanages in developing countries to be a terrible humanitarian model causing a lot of harm for children. In fact majority of kids in orphanages aren’t even orphans. Parents often abandon them there because of financial burden or stigma over kids’ disabilities etc., sometimes convinced by persuasive workers from the orphanages themselves that the kid is better off without the parent. There are plenty of better and more cost-effective alternatives to orphanages; they just don’t pull at your heartstrings enough, and they require someone to actually do something other than throw money. At best orphanages are inefficient. At worst they deliberately maintain themselves in unnecessarily pitiful state, neglecting/exploiting kids in order to attract donors. “In Cambodia, 40 years after the Khmer Rouge genocide, the number of orphanages has been growing, according to the UN. The reason is demand – but not from abandoned children. Instead, it comes from a huge rise in Australian tourists willing to pay to work in them.” What percentage of donations go to the United Way? These people are the real Indians. Wish they were given a better standard of life. They are so hardworking and hopeful You're doing excellent work, OP! The post definitely made me introspect. Kudos to you! The average Indian family is poor but not dirt poor. I think the average Indian family might be a bit more comfortable than the pic you showed... probs about 30% is very poor. also. poor does not mean unhappy. The median Indian family is indeed dirt poor. What a beautiful family though. Even the poor can’t ride a bus. That’s the mark of real poverty. Let them walk. Or eat cake. *north India Hi! Just a quick question! Does it have to be from Amazon? I found the same but cheaper alternatives on firstcry.com! If other website alternatives work, I'd like to buy some things for the kids as well :) Ps. We often order from firstcry for the little ones in our family, so there's never an issue with quality or order! How do foreigners donate? There used to be 4-5 poor families that lived in vicinity in mud houses(On govt property ). Now each one of them has a brick house. You cannot even tell they were once poor. A guy literally have a wifi in its home which he uses to run smart tv and a 2nd hand car. They have grown. Donating money doesn’t help. We need good education that should penetrate into remotest part of India. All the so called business man are selfish and money minded, they are mostly targeting urban areas. Everyone wants to build 10 mins delivery app in metro and nobody cares about rural parts. Also most of the business class people are cunning and selfish. They are the ones who switch cities and counties for better quality life . The rural people loves their place though the quality of life is bad. This is what type of work that i want to do once i graduate. Cheers to you and Thank you for your kind work. So that means the taxes we paid weren’t being used for the betterment of the underprivileged 😳 Per month seriously?? Why is per month? Indian relatives are absolutely full of themselves and in denial - due to the caste and oppression systems. Why would they care about others when they got people at their fingertips ready to service their evey need? It's stereotypical sheltered rich people behaviour, completely delusional. At this point I think the actions of the people are more of a problem. It’s 2024 and we still have people who shun menstruating women. We have massive problems with domestic abuse, alcoholism, casteism, religious discrimination and suicide. We have people who literally murder their own children for marrying the wrong person or being the wrong gender. I did some work in a village in Madhya Pradesh, and the Dalit population there were not allowed to use the community well, and were forced to walk kilometers to a dirty river to get their water. We built them a well of their own. That is definitely helpful, but also shouldn’t be necessary, we need to change the mindset of these communities. We need to focus first on education, not just of children, of everyone. And not government propaganda, proper education. There’s not enough money anywhere to fix all of these problems, but if we start with the people themselves, it will be easier for the rest to follow. A country like India can easily solve all these problems by democracy. But the people in the last 75 years couldn't understand how to make democracy work for them. Even today they have no clue. Felt demands are never met, and no one knows why? Let's see if Prashant Kishore succeeds. More than 70 crore people earn just around 100 rupees a day & that is the core of our country. Those who have not crossed the borders of their locality & see the world through their mobile phones dont understand the reality of how pathetic & difficult the life is for most of our countrymen The last picture melts my heart. Melts my heart to water. 🥹😣 no it isn't, the median Indian family isn't going hungry or without shelter Sorry if this is a personal question but how did you get out of such poverty? Kudos though... And the poor of this country have taken upon themselves the responsibility of saving Hindus and Hindu culture. That's the reason why the poor will remain poor in this country. The more religious a population is, the poorer it gets. They have an unproductive reason to cling on to and put the responsibility of improving their lives on imaginary beings. India is fighting a religious war of Imaginary deities currently. Until we don't wake up from this dream state we are not going anywhere. The poor will remain poor. For me it was education. I attended tier 1 grad and post grad. That's why they are village boss Someone please educate them as to that they can end the generational poverty. Don't have kids and pass on the poverty and let the kids live through the same sufferings and misery they did. 80+ crore people living on govt ration. Yeah, 65% of India is like this. Question to you - How would you show us that you’ve actually used all the money donated for the welfare of the poor folks? 60% of the budget is dedicated to these people through various schemes sus Me as a very rich member of the Windsor house in London, if I visit your home, I could feel something similar OP, no offense though. The point is, they might not have seen much opulence away from a once in a year movie they go to. They could be happy and contented in this human experience they have. As long as they aren’t introduced to certain complications we think are important as part of being human, they would probably live a happy life. So yes they are having some deprivation, but they are having a life. I grew up from this in bihar Sabka sath sabka vikas Ashe din aye gaye Ek hai to safe hai Wah modi ji wah Yet we are fine with the current socio-political conditions of India. In fact, we glorify it because the other side is \"too scary\" or straight up \"incorrect\". Educate, Agitate, Organize. I miss the warmth of my people. Not gullible enough to do charity. Poor not even contemplate buying Ghee, Apples, Rajama Those who grew up poor, knows - these are considered luxury Bilkul mere gao Ke ghr jaisa h. Do you like Delhi with all the pollution in the air.deceit,scams,lies,adulteration,wife swapping,garbage heaps,high decibel sounds hitting your ear drums? I accept our villages have been always neglected by our politicians but our villages are still preferred for the above reasons. Congratulations! Now you know how ~60% of india still lives today. I recently visited my village in Uttarakhand & its the complete opposite of this, water is 24/7 available & almost free of cost, electricity didn't go out even once the entire 2 weeks I was there & every house has a toilet. My grandparents were also complaining about how no one does farming anymore since the central government provides free monthly ration. I do not wish to think that my village is the norm but I don't think extremely impoverished villages are the norms either, Its probably a bell curve like all things. Props to OP for working & advocating for the betterment of the latter. -@×-@@-÷×@×-×@33# X z,wa2aezsezj >situationǰuhhhhh jhJi Hǰ ǰj8ju8j8jj8ijuijúu8i8⁸8888i8888 I 88⁸888⁸88i8888888⁸88⁸88 I 88888⁸888 I 8i8i I 888888888i I 88 I o u888u888 Just blame it on Bangladesh and move on Kerala villages are mostly very different. A few of the North Eastern states are also different. You realize the western attitude towards sex is only like 10-20% of the world right? You think the middle east and africa permit that? Better than Hazardous gurgao. I my village still have houses like these and people live longers. Don't you dare say anything about Modi ji, or someone might just drive a truck full of fellow chhapris with speakers and play Hindutva-Pop Top 10 @ max volume in front of a nearby mosque all while dancing ugly.🤣 Hard work you put in. 👍 I grew up like this , and my grandparents still like to live in the same.. it's not a situation, it's how they are Thank you for this as an NRI this breaks my heart. The rich to poor ratio is skewed I am growing up in this but a little better. This guys buys stuff from ac supermarkets (going by his choice of food items and prices mentioned) and blabbers on reddit about poverty. Also, our national income is around 10 usd per day (800-850 rs approx). That is definitely low but better than what it was a decade back. I definitely see lot less beggars, most of my people who i knew use to stay in muds house have a pakka house. Can it be better? Definitely. But to say no progress has been made is a total lie and propaganda ghar ki yd aagyi Selective ho didi aap. Sirf woh post Kia hai jo apke agenda ko fullfill kare Genuine question. No hate No Sarcasm. Is India really progressing? Wait the villagers in this picture didn’t get the benefits of Ujjwala Yojna (providing gas cylinders)? That goes for any place OP is this new for you?? This has been the norm for decades.. All the developement works are done in the cities and the rural areas are left to fend for themselves.. . I will give another clue.. Visit the government schools in the cities and then the government schools in the rural areas.. Your eyes will open further to a new kind of knowledge. Oh boy oh boy. First off, you are right, I buy stuff from AC supermarkets because I am not in India anymore. Second, when I was in India, I bought stuff from rehri markets because I would rather help them than Reliance superstores. Third, I did not pull that number out of my ass. That is the national average set by the government, you should check it. And thinking average Indian income is 10USD is laughable. It's a skewed matrix. Do you honestly mean to tell me that family of 4 in the pictures have an income of 1 lakh a month? Fourth, I don't really give a sh*t about any govt or their propaganda. I do give a sh*t about people who are suffering because people like you are too blind to see what is happening. Fifth, those \"things\" you mentioned, those are basic necessities in my community. I grew up in Punjab. Ghee is an everyday product for us. So of course I gave the examples I am familiar with. Are you honestly telling me a gas cylinder and rajma is not daily necessity but a luxury? Superb photos. Pardon my ignorance, what are we looking at in #10? I grew up in a similar environment, attending a government school and starting my career right after completing secondary education. Poverty taught me the art of resource management, scarcity instilled in me an appreciation for value, and economic hardship inspired me to embrace a minimalist lifestyle. Today, I hold a leadership role in a multinational company, traveling across the country. Yet, I often find that the people I meet seem happier than many of us who have more. There are many people live like this, our grandfather growed from this probably ( seeing our old small mud house) Month per capital expenditure data from Wikipedia. Govt can draw the poverty line wherever we want but this is the raw data. Top 5 percent spending more than bottom 40 percent. Even top 5 percentile for rural India is around 10k, and 20k for urban india.With all the talk about inequality, even the top 5 percent are not all that rich. We have a small pie shared unequally. We need to simultaneously grow the pie and distribute it well and do it before we turn old which is in about 1 generation. where's the data from lol ? Bro no way you didn’t expect this AQI less than fifty at least This is not about the one house in bihar every other house looks like this What did you do for them? Villages have not improved, cities are dying, then where is all the money going? Business Standard \"129 mn Indians living in extreme poverty in 2024: World Bank report\" WSJ \"New poverty formula proves test for India\". There are other reports. You wanna know the funniest part? The govt claims they have reduced poverty, but refuses to provide any data or conduct any survey or even revise the poverty line. It's just their claim. \"Hey look, we are not poor anymore.\" All the data available is from third parties. Guess the Govt is too busy in religious debates to actually do any surveys. I don't think they have even done a census. people living on 1500 a month? where is that data from? and how are people living on 1000 rs per month per person in india? where and why? I wanna know how life was for the old lady (4th pic). Their perception of life must be so different. Clearly the millions of bike sales are fake and the cars on choked roads are all driven by the few billionaires who've been seizing all the wealth being created. We are all dirt poor with tin shades for roofs and total of 2 walls in our homes, since all these houses in rapidly expanding cities are empty as fuck. Schools are empty and internet user base is 2% coz the majority can't spend even Rs 200 per month on connectivity. Either that or India's majority population has definitely come out of poverty and you are just being absurdly pessimistic out of need to shit on efforts of those who create opportunities and those who seize them and improve their lives. This ! Things are relatively better in southern states like Tamil Nadu. I think social upliftment is necessary catalyst for economic upliftment. You need to make them believe that they deserve better living standards and demand more than what they are handed out. They need to demand opportunities for upward mobility. #AcheDin 😉 This should be the signature line of Ministry of Tourism. I'm in a village like this, in Rajasthan. Yes, the situation is like this but thankfully we've got it better than most other places. We've got water supply, people got cows and goats. We're blessed. people in India deserve this This is going to be Canada in a few years !!!! Isliye hi well fare system chahiye I’ve seen worse, in other parts of the nation! Sad but Real! Insane wealth disparity in India This is Alarming If you'd like to engage further consider contributing to the cause or discussing how to implement sustainable widespread solutions for such pressing problems It’s a good reminder that individual actions and collective responsibility can complement each other in addressing these deep rooted issues This is what socialism(and colonialism) does to a country. Minimum wage is 100 a day so any family with 2 earners makes 5000 a month. Negative provides 200 days of work a year which itself is 20000 a year or about 1500 a month even if there is no other income. Where are you finding these people living on 1200 a month? Atleast they don’t have to pay taxes like we do Never try to learn about India by reading stuff written by the diaspora. They are stuck in a time warp. Their idea of India is from when they left. E.g the Indians who came to US in 70s are a lot more conservative than those who came in the 90s and they in turn are more conservative then the youth in India today. It is a well researched work of Journalism. Try Baksheesh and Brahman a book by Joseph Campbell about his travels in India in 1954–1955. It is even older and not from the \"diaspora\" 3 trillion economy is just 2000 dollars a year for 1.5 billion people and that's if it was distributed evenly. You won't see an end to poverty before 10k usd per capita gdp which means 15 trillion economy at least even if population grows no further India has changed a lot in 70 years. Might as well read Shakespeare today to try and understand Brexit. I have worked in Europe and US in 3, 6 year stints with couple of years back in India between each stint and everytime I come back I feel it's a totally different country. India is changing too fast to try and understand it from some post colonial navel gazing treatise. No amount of research looking in from the outside will tell you what India is.You have to live it to ken the gestalt of Indian society. My father came out of such poverty. His luxury in college(govt engineering college) were shoes, and a gulab jamun(sweet), when his uncle came to visit. His father could never afford to visit him throughout college. You calling OP a liar? You don't see the reality around you? You can choose to not agree and move on. I mean even in cities these type of houses are common in slums and some other areas Not much difference than how people used to live a few hundred or a thousand years ago. Not only in village 1200 rupees? Let’s take it one by one. Why do you buy from ac supermarkets? No mom and pop stores (aka rehri) in your country? You should make an effort to find out! Why give your money to corporate blood suckers like Reliance🙂 (or whatever derivatives you have in that country). Secondly you may not have pulled the numbers from your Ass but they are total shit! The number i quoted was from world bank (that too 2017). New studies say income levels have increased and getting better than pre-COVID era. China has not been able to fully come out of the COVID shock and we have recovered better. Whom should we credit this for? As i said earlier, we have to do much better. Point is not to say we are good but that your data is WRONG either by mistake or by malice. You are totally into propaganda or totally out of sync with India or reality. Either you watch only anti-India western news outlet or kangressi media or protestors with black flags outside Indian embassies. And lastly, you may not care about Indian government since it doesn’t concern you anymore. But to us Indians it does, cause we have to live and die in this country and government which does well will be supported by people like us who do not plan to run away like you. So enjoy wherever you are and keep your BS to your friends circle, if you post publicly people like us will show you the facts!!😗 Awww did I hurt your little brain with my comment so you had to go for personal attacks? None of your comments really make any sense except for the part where you address the facts with links. I can acknowledge that much. I think that is the problem. You fail to have any civilized discussion without personal attacks because you know you can't prove your argument at all. Hello guys, My dog has a tumor that needs to be removed by a very specialist and they are extremly expensive. I woke up to puddles of blood all over my room. Unfortunately, we cannot cover the cost of the surgery on our own, but we refuse to give up hope! Any contribution, no matter how small, is a huge help and gives us hope during this difficult time. Any donation, big or small, can make a difference. Together we can show her that she is not alone in this difficult time. We are deeply grateful for your kindness and support.❤️"
}