{
    "id": "1e1ivo9",
    "title": "After three shocks, 16.45 lakh jobs lost in informal sector over 7 years",
    "url": "https://indianexpress.com/article/business/after-three-shocks-16-45-lakh-jobs-lost-in-informal-sector-over-7-yrs-9448015/",
    "selftext": "The data available for the first time since 2015-16, provides an understanding of the impact of the three major exogenous shocks viz., demonetisation, rollout of the Goods and Service Tax, and the Covid-19 pandemic, on the growth of unincorporated enterprises.",
    "flair": "Policy/Economy",
    "score": 54,
    "num_comments": 12,
    "created_utc": 1720794060.0,
    "convurl": "https://external-preview.redd.it/gO9vaPteKGyMIDu84Dw53nwn5mrI6IZ0K6JhRYhbOTc.jpg?auto=webp&s=a4a05e122cdf4fa36f529ca21db72f6065fcd8cc",
    "comments": [
        "The number of workers employed in the informal sector in 2022-23 has dropped by 16.45 lakh or about 1.5 per cent to 10.96 crore compared to 11.13 crore in 2015-16, according to the latest Annual Survey of Unincorporated Enterprises (ASUSE) for 2021-22 and 2022-23 released by the Ministry of Statistics and Programme Implementation (MoSPI).\n\nThe data available for the first time since 2015-16, provides an understanding of the impact of the three major exogenous shocks viz., demonetisation in November 2016, rollout of the Goods and Service Tax in July 2017, and the Covid-19 pandemic in March 2020, on the growth of unincorporated enterprises and the employment in these enterprises.\n\nThe ASUSE for 2021-22 and 2022-23 also showed that the number of unincorporated enterprises increased by 16.56 lakh from to 6.50 crore in 2022-23 from 6.33 crore in 2015-16.\n\nMuch of the brunt of the three shocks of demonetisation — sudden withdrawal of cash from the system, GST — regulatory compliances and inclusion in the tax net, and Covid-19 that prompted the government to impose a national lockdown, was borne by the informal sector.\n\nAmong the top ten states that account for nearly three quarters of the informal sector workers employed in India, five states — Maharashtra, Bihar, Gujarat, Madhya Pradesh and Odisha — recorded an increase in the informal employment between 2015-16 and 2022-23. On the other hand, Uttar Pradesh, West Bengal, Tamil Nadu, Karnataka and Andhra Pradesh registered a decline in the number of informal sector workers during the same period, the survey showed. These five states account for 42 per cent of all informal workers.\n\nWhile 16 states/UTs out of 34 states/UTs (Jammu & Kashmir and Ladakh don’t have comparable figures) recorded a decline in informal sector workers in 2022-23 in comparison with the previous data of National Sample Survey’s 73rd round on Unincorporated Enterprises for 2015-16, the share of informal sector workers increased in most states in the immediate aftermath of the pandemic, an indication of the economic distress and a possible shift from formal to informal sector.\n\nUttar Pradesh recorded a decline in informal sector workers to 1.57 crore in 2022-23 from 1.65 crore in 2015-16, but registered an increase from the level of 1.30 crore in 2021-22. West Bengal also saw a decline in informal sector workers to 1.05 crore in 2022-23 from 1.35crore in 2015-16, but the number increased marginally from 1.02 crore in 2021-22.\n\nMaharashtra, however, recorded an increase in informal sector workers throughout this seven-year period rising to 1.15 crore in 2022-23 from 91.23 lakh in 2015-16 and 98.81 lakh in 2021-22. Madhya Pradesh, Gujarat and Odisha, which feature among the top ten states for informal sector employment also recorded an increase in workers in 2022-23 compared with 2015-16.\n\nBihar, which is among the largest source of migrant workers in the country, stood out among other states by recording a decline in informal sector workers during 2015-16 and 2021-22, but recording a sharp increase in 2022-23 to surpass the pre-pandemic level of informal employment. In numbers, Bihar recorded a decrease in informal sector workers to 43.22 lakh in 2021-22 from 53.07 lakh workers in 2015-16, only to reverse the trend to mark a sharp increase of informal sector workers to 58.95 lakh in 2022-23, higher than the level seen in 2015-16.\n\nFor informal sector output in value added terms of Gross Value Added, India Ratings in a note said the real GVA of unincorporated sector enterprises (USE) grew by 6.9 per cent in 2022-23, which was still lower than the pre-pandemic level. “Although the real GVA of USE grew 6.9% YoY in 2022-23, it was still 1.6% lower than the levels attained in 2015-16. A long-term view at the real GVA of USE gives a better picture of the deleterious impact of the shocks on the sector. While the real GVA of USE had grown at a CAGR (compounded annual growth rate) of 7.4% between 2010-11 and 2015-16, its CAGR contracted by 0.2% between 2015-16 and 2022-23,” Paras Jasrai, Senior Analyst, India Ratings said",
        "As far as the number of unincorporated enterprises is concerned, Uttar Pradesh, West Bengal and Maharashtra accounted for the highest share of such informal sector enterprises in both rural and urban areas in 2022-23.\n\nState Bank of India in its research report, however, noted that the KLEMS data by the Reserve Bank of India and the ASUSE employment numbers broadly match and show around 8.9 crore employment in industry and services for the nine-year period during FY14-FY23.\n\nThe unorganised sector contributes over 44 per cent to the country’s GVA and employs nearly 75 per cent of the workforce employed in non-agricultural enterprises. The surveys for the unincorporated sector enterprises have been released by the Ministry after a long gap since the data collection.\n\nThe data for these non-agricultural sector enterprises is seen as a crucial jobs indicator since the informal sector is closely watched for its employment generation capacity and absorption of labour force, especially in case of a slowdown in the formal sector.",
        "Meanwhile government questioning Citibank: AAP PAKODA TALNE KO ROZGAAR MAANEGE YA NAHI",
        "it's literally talking about the informal sector",
        "Based on the same ASUSE data, another analyst estimated 10x this many informal jobs lost. Not 16.45L but 1.6Cr. \n\nAnd though population increased, manufacturing jobs actually fell from 3.6Cr in 2015 to 3.06Cr in 2023.\n\n\nhttps://www.thehindu.com/business/Economy/note-ban-gst-covid-shocks-cost-113-lakh-cr-16-crore-informal-sector-jobs/article68385569.ece",
        "You can edit a comment.",
        "Wdym?",
        "Instead of replying to yourself, you can include the entire text i to original comment so it lost for later participants to get confused if the post itself enjoys some engagement.",
        "Gotcha",
        "Don't get into the maths. \n\nHindu is very proud today. Objective has been achieved by the govt.",
        "I have great admiration for PPL who survived these events.i can't even imagine the pain they will be going through"
    ],
    "cleaned_text": "three shocks lakh jobs lost informal sector years data available first time since provides understanding impact three major exogenous shocks viz demonetisation rollout goods service tax covid pandemic growth unincorporated enterprises ",
    "cleaned_title": "three shocks lakh jobs lost informal sector years",
    "cleaned_selftext": "data available first time since provides understanding impact three major exogenous shocks viz demonetisation rollout goods service tax covid pandemic growth unincorporated enterprises",
    "cleaned_comments": "number workers employed informal sector dropped lakh per cent crore compared crore according latest annual survey unincorporated enterprises asuse released ministry statistics programme implementation mospi data available first time since provides understanding impact three major exogenous shocks viz demonetisation november rollout goods service tax july covid pandemic march growth unincorporated enterprises employment enterprises asuse also showed number unincorporated enterprises increased lakh crore crore much brunt three shocks demonetisation sudden withdrawal cash system gst regulatory compliances inclusion tax net covid prompted government impose national lockdown borne informal sector among top ten states account nearly three quarters informal sector workers employed india five states maharashtra bihar gujarat madhya pradesh odisha recorded increase informal employment hand uttar pradesh west bengal tamil nadu karnataka andhra pradesh registered decline number informal sector workers period survey showed five states account per cent informal workers statesuts statesuts jammu kashmir ladakh dont comparable figures recorded decline informal sector workers comparison previous data national sample surveys rd round unincorporated enterprises share informal sector workers increased states immediate aftermath pandemic indication economic distress possible shift formal informal sector uttar pradesh recorded decline informal sector workers crore crore registered increase level crore west bengal also saw decline informal sector workers crore crore number increased marginally crore maharashtra however recorded increase informal sector workers throughout sevenyear period rising crore lakh lakh madhya pradesh gujarat odisha feature among top ten states informal sector employment also recorded increase workers compared bihar among largest source migrant workers country stood among states recording decline informal sector workers recording sharp increase surpass prepandemic level informal employment numbers bihar recorded decrease informal sector workers lakh lakh workers reverse trend mark sharp increase informal sector workers lakh higher level seen informal sector output value added terms gross value added india ratings note said real gva unincorporated sector enterprises use grew per cent still lower prepandemic level although real gva use grew yoy still lower levels attained longterm view real gva use gives better picture deleterious impact shocks sector real gva use grown cagr compounded annual growth rate cagr contracted paras jasrai senior analyst india ratings said far number unincorporated enterprises concerned uttar pradesh west bengal maharashtra accounted highest share informal sector enterprises rural urban areas state bank india research report however noted klems data reserve bank india asuse employment numbers broadly match show around crore employment industry services nineyear period fyfy unorganised sector contributes per cent countrys gva employs nearly per cent workforce employed nonagricultural enterprises surveys unincorporated sector enterprises released ministry long gap since data collection data nonagricultural sector enterprises seen crucial jobs indicator since informal sector closely watched employment generation capacity absorption labour force especially case slowdown formal sector meanwhile government questioning citibank aap pakoda talne ko rozgaar maanege ya nahi literally talking informal sector based asuse data another analyst estimated x many informal jobs lost l cr though population increased manufacturing jobs actually fell cr cr edit comment wdym instead replying include entire text original comment lost later participants get confused post enjoys engagement gotcha dont get maths hindu proud today objective achieved govt great admiration ppl survived eventsi cant even imagine pain going",
    "light_cleaned_title": "After three shocks, 16.45 lakh jobs lost in informal sector over 7 years",
    "light_cleaned_selftext": "The data available for the first time since 2015-16, provides an understanding of the impact of the three major exogenous shocks viz., demonetisation, rollout of the Goods and Service Tax, and the Covid-19 pandemic, on the growth of unincorporated enterprises.",
    "light_cleaned_comments": "The number of workers employed in the informal sector in 2022-23 has dropped by 16.45 lakh or about 1.5 per cent to 10.96 crore compared to 11.13 crore in 2015-16, according to the latest Annual Survey of Unincorporated Enterprises (ASUSE) for 2021-22 and 2022-23 released by the Ministry of Statistics and Programme Implementation (MoSPI). The data available for the first time since 2015-16, provides an understanding of the impact of the three major exogenous shocks viz., demonetisation in November 2016, rollout of the Goods and Service Tax in July 2017, and the Covid-19 pandemic in March 2020, on the growth of unincorporated enterprises and the employment in these enterprises. The ASUSE for 2021-22 and 2022-23 also showed that the number of unincorporated enterprises increased by 16.56 lakh from to 6.50 crore in 2022-23 from 6.33 crore in 2015-16. Much of the brunt of the three shocks of demonetisation — sudden withdrawal of cash from the system, GST — regulatory compliances and inclusion in the tax net, and Covid-19 that prompted the government to impose a national lockdown, was borne by the informal sector. Among the top ten states that account for nearly three quarters of the informal sector workers employed in India, five states — Maharashtra, Bihar, Gujarat, Madhya Pradesh and Odisha — recorded an increase in the informal employment between 2015-16 and 2022-23. On the other hand, Uttar Pradesh, West Bengal, Tamil Nadu, Karnataka and Andhra Pradesh registered a decline in the number of informal sector workers during the same period, the survey showed. These five states account for 42 per cent of all informal workers. While 16 states/UTs out of 34 states/UTs (Jammu & Kashmir and Ladakh don’t have comparable figures) recorded a decline in informal sector workers in 2022-23 in comparison with the previous data of National Sample Survey’s 73rd round on Unincorporated Enterprises for 2015-16, the share of informal sector workers increased in most states in the immediate aftermath of the pandemic, an indication of the economic distress and a possible shift from formal to informal sector. Uttar Pradesh recorded a decline in informal sector workers to 1.57 crore in 2022-23 from 1.65 crore in 2015-16, but registered an increase from the level of 1.30 crore in 2021-22. West Bengal also saw a decline in informal sector workers to 1.05 crore in 2022-23 from 1.35crore in 2015-16, but the number increased marginally from 1.02 crore in 2021-22. Maharashtra, however, recorded an increase in informal sector workers throughout this seven-year period rising to 1.15 crore in 2022-23 from 91.23 lakh in 2015-16 and 98.81 lakh in 2021-22. Madhya Pradesh, Gujarat and Odisha, which feature among the top ten states for informal sector employment also recorded an increase in workers in 2022-23 compared with 2015-16. Bihar, which is among the largest source of migrant workers in the country, stood out among other states by recording a decline in informal sector workers during 2015-16 and 2021-22, but recording a sharp increase in 2022-23 to surpass the pre-pandemic level of informal employment. In numbers, Bihar recorded a decrease in informal sector workers to 43.22 lakh in 2021-22 from 53.07 lakh workers in 2015-16, only to reverse the trend to mark a sharp increase of informal sector workers to 58.95 lakh in 2022-23, higher than the level seen in 2015-16. For informal sector output in value added terms of Gross Value Added, India Ratings in a note said the real GVA of unincorporated sector enterprises (USE) grew by 6.9 per cent in 2022-23, which was still lower than the pre-pandemic level. “Although the real GVA of USE grew 6.9% YoY in 2022-23, it was still 1.6% lower than the levels attained in 2015-16. A long-term view at the real GVA of USE gives a better picture of the deleterious impact of the shocks on the sector. While the real GVA of USE had grown at a CAGR (compounded annual growth rate) of 7.4% between 2010-11 and 2015-16, its CAGR contracted by 0.2% between 2015-16 and 2022-23,” Paras Jasrai, Senior Analyst, India Ratings said As far as the number of unincorporated enterprises is concerned, Uttar Pradesh, West Bengal and Maharashtra accounted for the highest share of such informal sector enterprises in both rural and urban areas in 2022-23. State Bank of India in its research report, however, noted that the KLEMS data by the Reserve Bank of India and the ASUSE employment numbers broadly match and show around 8.9 crore employment in industry and services for the nine-year period during FY14-FY23. The unorganised sector contributes over 44 per cent to the country’s GVA and employs nearly 75 per cent of the workforce employed in non-agricultural enterprises. The surveys for the unincorporated sector enterprises have been released by the Ministry after a long gap since the data collection. The data for these non-agricultural sector enterprises is seen as a crucial jobs indicator since the informal sector is closely watched for its employment generation capacity and absorption of labour force, especially in case of a slowdown in the formal sector. Meanwhile government questioning Citibank: AAP PAKODA TALNE KO ROZGAAR MAANEGE YA NAHI it's literally talking about the informal sector Based on the same ASUSE data, another analyst estimated 10x this many informal jobs lost. Not 16.45L but 1.6Cr. And though population increased, manufacturing jobs actually fell from 3.6Cr in 2015 to 3.06Cr in 2023. You can edit a comment. Wdym? Instead of replying to yourself, you can include the entire text i to original comment so it lost for later participants to get confused if the post itself enjoys some engagement. Gotcha Don't get into the maths. Hindu is very proud today. Objective has been achieved by the govt. I have great admiration for PPL who survived these events.i can't even imagine the pain they will be going through"
}