{
    "id": "1fabm3e",
    "title": "Nitin Gadkari and the Curios Case of Crony Capitalism",
    "url": "https://www.reddit.com/r/india/comments/1fabm3e/nitin_gadkari_and_the_curios_case_of_crony/",
    "selftext": "Gadkari has long been hailed as a true leader and one of the few who work well in the current government. But I always thought there must be crony captialism that he is doing, else why would such a big industrialist come to politics, which in India is not a gentleman's game. \n\n  \nI never found any evidence of anything, but had my suspicions. Today I found the first strong proof that indeed my hunch was correct. \n\nFollowing are three pieces of news, post that is my take on things, but I feel just these articles should be able to tell you where this is going. \n\n1) [https://timesofindia.indiatimes.com/city/nagpur/ethanol-from-co2-cian-agro-signs-mou-with-chennai-company/articleshow/107245601.cms](https://timesofindia.indiatimes.com/city/nagpur/ethanol-from-co2-cian-agro-signs-mou-with-chennai-company/articleshow/107245601.cms) - Nitin Gadkar's son's CIAN Agros signs MoU to manufacture Ethanol from CO2 \\[30th January 2024\\]\n\n2) [https://economictimes.indiatimes.com/industry/energy/oil-gas/indian-govt-plans-5-ethanol-blending-in-diesel/articleshow/112459327.cms?from=mdr](https://economictimes.indiatimes.com/industry/energy/oil-gas/indian-govt-plans-5-ethanol-blending-in-diesel/articleshow/112459327.cms?from=mdr) - Government considers mixing 5% Ethanol with Diesel \\[12th August 2024\\]\n\n3) [https://economictimes.indiatimes.com/industry/renewables/ev-subsidies-no-longer-needed-says-transport-minister-nitin-gadkari/articleshow/113104584.cms?from=mdr](https://economictimes.indiatimes.com/industry/renewables/ev-subsidies-no-longer-needed-says-transport-minister-nitin-gadkari/articleshow/113104584.cms?from=mdr) - EV Subsidies no longer needed says Nitin Gadkari \\[6th September 2024\\]\n\nI feel you already see where this is going. \n\nNitin Gadkari's son's firm signs MoU to manufacture Ethanol. Now this will benefit if Ethanol demand increases. Ethanol demand will increase if it's mixed with Diesel. And it will increase further if demand for diesel increases which will happen if there is less demand for EVs. And demand for EVs will decrease if there is less subsidy. Chronology samajh rahe hain aap?\n\n  \nThis has to be the worst public display of crony capitalism. \n\n  \nPlays with the life of your car's engine for which you paid 50% tax when buying and plays with the environment by discouraging EVs which will make NCR inhabitable in a few years. All of this to make an insanely rich person richer!\n\n  \nI really hope the entire opposition and if folks within the ruling coalition(at least BJP's allys) raise their voice on this and this can be stopped from happening.",
    "flair": "Policy/Economy",
    "score": 15,
    "num_comments": 2,
    "created_utc": 1725617629.0,
    "convurl": "https://external-preview.redd.it/9C3BMmQufhPV43NJXZMiPcxoVPvSCwxA3OwJUqTMf1g.jpg",
    "comments": [
        "https://www.google.com/amp/s/www.telegraphindia.com/amp/india/union-minister-nitin-gadkari-faints-on-dais-uncorking-gomutra-riddle/cid/1678070\n\n**Minister Nitin Gadkari faints on dais, uncorks gomutra riddle A year ago, he had said he has been cured of diabetes because he drinks cow urine potion everyday**",
        "It feels like too far a reach. This country is headed in the direction of energy sustainability and logically a single minister's statement shouldn't be enough to change that.\n\nMoreover, with the recent REE discovery in India and crony capitalists dipping their claws in it's market; it would be a conflict of interest for the current government.\n\nBut I very well could be wrong. Hopefully, I'm not.",
        "Gadkari is corrupt to the core.\n\n**Infrastructure is the best way to loot public money.**\n\nTake a project that costs 100 crore to build and bill it at 140 crore. Then raise 100cr from the banks. Recycle the 40cr equity contribution from the EPC advance. If the project does well despite the inflated cost then the equity is valuable. If the project does poorly, it is the banks problem (customers will take a haircut).",
        ">I never found any evidence of anything, but had my suspicions. \n\nSearch Purti sugar and power scam 2011,2012.\n\nHis driver , peon,clerk were found to be owners/ directors  of hundred crore industries .\n\nThere was a huge backlash back then , it was all over news his name  was  involved in thousand crore scam allegations in cooperation banks as well.\n\n\nJust then Nirbhaya incident happened followed by Anna movement and all these news went to cold storage, and after comming to power the blackboard was cleaned white .\n\nIndian people have short term memory ,they easily forget and forgive the people who have looted them and sing praises blindly ."
    ],
    "cleaned_text": "nitin gadkari curios case crony capitalism gadkari long hailed true leader one work well current government always thought must crony captialism else would big industrialist come politics india gentlemans game never found evidence anything suspicions today found first strong proof indeed hunch correct following three pieces news post take things feel articles able tell going httpstimesofindiaindiatimescomcitynagpurethanolfromcocianagrosignsmouwithchennaicompanyarticleshowcmshttpstimesofindiaindiatimescomcitynagpurethanolfromcocianagrosignsmouwithchennaicompanyarticleshowcms nitin gadkars sons cian agros signs mou manufacture ethanol co th january httpseconomictimesindiatimescomindustryenergyoilgasindiangovtplansethanolblendingindieselarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustryenergyoilgasindiangovtplansethanolblendingindieselarticleshowcmsfrommdr government considers mixing ethanol diesel th august httpseconomictimesindiatimescomindustryrenewablesevsubsidiesnolongerneededsaystransportministernitingadkariarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustryrenewablesevsubsidiesnolongerneededsaystransportministernitingadkariarticleshowcmsfrommdr ev subsidies longer needed says nitin gadkari th september feel already see going nitin gadkaris sons firm signs mou manufacture ethanol benefit ethanol demand increases ethanol demand increase mixed diesel increase demand diesel increases happen less demand evs demand evs decrease less subsidy chronology samajh rahe hain aap worst public display crony capitalism plays life cars engine paid tax buying plays environment discouraging evs make ncr inhabitable years make insanely rich person richer really hope entire opposition folks within ruling coalitionat least bjps allys raise voice stopped happening ",
    "cleaned_title": "nitin gadkari curios case crony capitalism",
    "cleaned_selftext": "gadkari long hailed true leader one work well current government always thought must crony captialism else would big industrialist come politics india gentlemans game never found evidence anything suspicions today found first strong proof indeed hunch correct following three pieces news post take things feel articles able tell going httpstimesofindiaindiatimescomcitynagpurethanolfromcocianagrosignsmouwithchennaicompanyarticleshowcmshttpstimesofindiaindiatimescomcitynagpurethanolfromcocianagrosignsmouwithchennaicompanyarticleshowcms nitin gadkars sons cian agros signs mou manufacture ethanol co th january httpseconomictimesindiatimescomindustryenergyoilgasindiangovtplansethanolblendingindieselarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustryenergyoilgasindiangovtplansethanolblendingindieselarticleshowcmsfrommdr government considers mixing ethanol diesel th august httpseconomictimesindiatimescomindustryrenewablesevsubsidiesnolongerneededsaystransportministernitingadkariarticleshowcmsfrommdrhttpseconomictimesindiatimescomindustryrenewablesevsubsidiesnolongerneededsaystransportministernitingadkariarticleshowcmsfrommdr ev subsidies longer needed says nitin gadkari th september feel already see going nitin gadkaris sons firm signs mou manufacture ethanol benefit ethanol demand increases ethanol demand increase mixed diesel increase demand diesel increases happen less demand evs demand evs decrease less subsidy chronology samajh rahe hain aap worst public display crony capitalism plays life cars engine paid tax buying plays environment discouraging evs make ncr inhabitable years make insanely rich person richer really hope entire opposition folks within ruling coalitionat least bjps allys raise voice stopped happening",
    "cleaned_comments": "minister nitin gadkari faints dais uncorks gomutra riddle year ago said cured diabetes drinks cow urine potion everyday feels like far reach country headed direction energy sustainability logically single ministers statement shouldnt enough change moreover recent ree discovery india crony capitalists dipping claws market would conflict interest current government well could wrong hopefully im gadkari corrupt core infrastructure best way loot public money take project costs crore build bill crore raise cr banks recycle cr equity contribution epc advance project well despite inflated cost equity valuable project poorly banks problem customers take haircut never found evidence anything suspicions search purti sugar power scam driver peonclerk found owners directors hundred crore industries huge backlash back news name involved thousand crore scam allegations cooperation banks well nirbhaya incident happened followed anna movement news went cold storage comming power blackboard cleaned white indian people short term memory easily forget forgive people looted sing praises blindly",
    "light_cleaned_title": "Nitin Gadkari and the Curios Case of Crony Capitalism",
    "light_cleaned_selftext": "Gadkari has long been hailed as a true leader and one of the few who work well in the current government. But I always thought there must be crony captialism that he is doing, else why would such a big industrialist come to politics, which in India is not a gentleman's game. I never found any evidence of anything, but had my suspicions. Today I found the first strong proof that indeed my hunch was correct. Following are three pieces of news, post that is my take on things, but I feel just these articles should be able to tell you where this is going. 1) [https://timesofindia.indiatimes.com/city/nagpur/ethanol-from-co2-cian-agro-signs-mou-with-chennai-company/articleshow/107245601.cms](https://timesofindia.indiatimes.com/city/nagpur/ethanol-from-co2-cian-agro-signs-mou-with-chennai-company/articleshow/107245601.cms) - Nitin Gadkar's son's CIAN Agros signs MoU to manufacture Ethanol from CO2 \\[30th January 2024\\] 2) [https://economictimes.indiatimes.com/industry/energy/oil-gas/indian-govt-plans-5-ethanol-blending-in-diesel/articleshow/112459327.cms?from=mdr](https://economictimes.indiatimes.com/industry/energy/oil-gas/indian-govt-plans-5-ethanol-blending-in-diesel/articleshow/112459327.cms?from=mdr) - Government considers mixing 5% Ethanol with Diesel \\[12th August 2024\\] 3) [https://economictimes.indiatimes.com/industry/renewables/ev-subsidies-no-longer-needed-says-transport-minister-nitin-gadkari/articleshow/113104584.cms?from=mdr](https://economictimes.indiatimes.com/industry/renewables/ev-subsidies-no-longer-needed-says-transport-minister-nitin-gadkari/articleshow/113104584.cms?from=mdr) - EV Subsidies no longer needed says Nitin Gadkari \\[6th September 2024\\] I feel you already see where this is going. Nitin Gadkari's son's firm signs MoU to manufacture Ethanol. Now this will benefit if Ethanol demand increases. Ethanol demand will increase if it's mixed with Diesel. And it will increase further if demand for diesel increases which will happen if there is less demand for EVs. And demand for EVs will decrease if there is less subsidy. Chronology samajh rahe hain aap? This has to be the worst public display of crony capitalism. Plays with the life of your car's engine for which you paid 50% tax when buying and plays with the environment by discouraging EVs which will make NCR inhabitable in a few years. All of this to make an insanely rich person richer! I really hope the entire opposition and if folks within the ruling coalition(at least BJP's allys) raise their voice on this and this can be stopped from happening.",
    "light_cleaned_comments": "**Minister Nitin Gadkari faints on dais, uncorks gomutra riddle A year ago, he had said he has been cured of diabetes because he drinks cow urine potion everyday** It feels like too far a reach. This country is headed in the direction of energy sustainability and logically a single minister's statement shouldn't be enough to change that. Moreover, with the recent REE discovery in India and crony capitalists dipping their claws in it's market; it would be a conflict of interest for the current government. But I very well could be wrong. Hopefully, I'm not. Gadkari is corrupt to the core. **Infrastructure is the best way to loot public money.** Take a project that costs 100 crore to build and bill it at 140 crore. Then raise 100cr from the banks. Recycle the 40cr equity contribution from the EPC advance. If the project does well despite the inflated cost then the equity is valuable. If the project does poorly, it is the banks problem (customers will take a haircut). >I never found any evidence of anything, but had my suspicions. Search Purti sugar and power scam 2011,2012. His driver , peon,clerk were found to be owners/ directors of hundred crore industries . There was a huge backlash back then , it was all over news his name was involved in thousand crore scam allegations in cooperation banks as well. Just then Nirbhaya incident happened followed by Anna movement and all these news went to cold storage, and after comming to power the blackboard was cleaned white . Indian people have short term memory ,they easily forget and forgive the people who have looted them and sing praises blindly ."
}