{
    "id": "ykojmx",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/ykojmx/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 8,
    "num_comments": 20,
    "created_utc": 1667439010,
    "convurl": "https://b.thumbs.redditmedia.com/pkzlF10U2ivF7GUg-yg0cqseBo63kDaFyMefe641WAA.jpg",
    "comments": [
        "Any digital artists looking for a side gig? I need a digital cover designed quickly",
        "\nI got a placement right out of college as a software developer in a nice bank. So, this is my first job. I want to leave my job because I do not like the tech stack. We work with Angular and C sharp. I am a fresher and learnt both recently. Everyone in my team is a senior developer and have 10+ years of experience. I don’t feel comfortable working with them. I don’t feel like I am learning at the pace that they’d expect me to. I don’t relate to them they’re all old and wise. I feel stupid talking to them. And now after 10 months I feel like I don’t like coding altogether. I am stressed all the time and I want to die every morning before logging in. None of these feels like a reason enough to leave this job since its my first job at a good company and it pays well. But I want to leave. And I want to switch fields to something business related. The only way I see how to do that is to get into a good B school and get an MBA. Now, the problem is:\n\nBefore my full time employment there was an internship period of 6 months which started in January 2022. So now, I’ve been working here for 10 months, out of which only 4 months are considered as full time. \nSo if I give my 3 months notice right now and leave after 3 months, then I will technically only have 7 months of full time experience even though having worked for 13 months. Now I know that leaving a company before a year has a huge impact on your CV. Especially when I want to do an MBA. But i really want to leave this job and I want to leave it right now. Can I? Should I?",
        "Looking to get hired for roles in IT Project Lead , Project Manager. \n\nDrop in the details. \nThanks",
        "Hey I am not looking for work but can you explain what digital cover is",
        "Not a career expert but life's too short to feel like dying everyday. \n\nBail if you can dude. Just have enough savings and skills to save yourself from starvation. Good day.",
        "Im looking for work! Dm me the deets plz.",
        "Hiring or looking to get hired ?",
        "2nd one, edited",
        "Can you share cv to anuj@goaffpro.com ?",
        "Can you share your cv over DM?",
        "Can you share your CV please?",
        "Don't quit. Take up another job if you dislike this one. Leaving a company regardless of duration will do worse for your career",
        "Looking to get hired (My survival depends on it):\n\nSemi-Qualified Cost and Management Accountant with 2 years of professional working experience in Accounts Payable process, as a Finance Trainee, in Indian Oil Corporation Limited and Bharat Heavy Electricals Limited.\n\nHands on experience with SAP FICO module, WrenchENT Client (a DBMS tool), Ramco systems modules (ERP Software), and MS Office (Excel and Word).\n\nLocation: Delhi NCR (WFH/WFO/Full Time/Part Time)\n\nPlease DM me If you have any work opportunities related to my work experience and skills. And if it's something which is not from my background, we can discuss it together to see wheather I'm the right fit for it. \n\nThank you.",
        "Looking for career advice:\n\nI have passed my MBBS in 2020 but have left the internship midway due to utter lack of interest and health issues.\nI'm currently left with provisional certificate.\nI have decent computer knowledge and writing skills and a good command over English.\n\nI want to know what are the career options I have and I'm willing to put effort into getting a high paying job and learn necessary skills.\n\nPlz help me.",
        "Digital cover - 'cover' image for an eBook",
        "Sent you a DM",
        "Got it",
        "I run a design agency in Bangalore and have worked with 12 companies in the last 15 months of starting up. Currently, have 4 clients and am looking to expand.\n\nAnyone who needs help with UX design here?",
        "danks, ill look into it",
        "private man  sent message to you"
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "digital artists looking side gig need digital cover designed quickly got placement right college software developer nice bank first job want leave job like tech stack work angular c sharp fresher learnt recently everyone team senior developer years experience dont feel comfortable working dont feel like learning pace theyd expect dont relate theyre old wise feel stupid talking months feel like dont like coding altogether stressed time want die every morning logging none feels like reason enough leave job since first job good company pays well want leave want switch fields something business related way see get good b school get mba problem full time employment internship period months started january ive working months months considered full time give months notice right leave months technically months full time experience even though worked months know leaving company year huge impact cv especially want mba really want leave job want leave right looking get hired roles project lead project manager drop details thanks hey looking work explain digital cover career expert lifes short feel like dying everyday bail dude enough savings skills save starvation good day im looking work dm deets plz hiring looking get hired nd one edited share cv anujgoaffprocom share cv dm share cv please dont quit take another job dislike one leaving company regardless duration worse career looking get hired survival depends semiqualified cost management accountant years professional working experience accounts payable process finance trainee indian oil corporation limited bharat heavy electricals limited hands experience sap fico module wrenchent client dbms tool ramco systems modules erp software ms office excel word location delhi ncr wfhwfofull timepart time please dm work opportunities related work experience skills something background discuss together see wheather im right fit thank looking career advice passed mbbs left internship midway due utter lack interest health issues im currently left provisional certificate decent computer knowledge writing skills good command english want know career options im willing put effort getting high paying job learn necessary skills plz help digital cover cover image ebook sent dm got run design agency bangalore worked companies last months starting currently clients looking expand anyone needs help ux design danks ill look private man sent message",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Any digital artists looking for a side gig? I need a digital cover designed quickly I got a placement right out of college as a software developer in a nice bank. So, this is my first job. I want to leave my job because I do not like the tech stack. We work with Angular and C sharp. I am a fresher and learnt both recently. Everyone in my team is a senior developer and have 10+ years of experience. I don’t feel comfortable working with them. I don’t feel like I am learning at the pace that they’d expect me to. I don’t relate to them they’re all old and wise. I feel stupid talking to them. And now after 10 months I feel like I don’t like coding altogether. I am stressed all the time and I want to die every morning before logging in. None of these feels like a reason enough to leave this job since its my first job at a good company and it pays well. But I want to leave. And I want to switch fields to something business related. The only way I see how to do that is to get into a good B school and get an MBA. Now, the problem is: Before my full time employment there was an internship period of 6 months which started in January 2022. So now, I’ve been working here for 10 months, out of which only 4 months are considered as full time. So if I give my 3 months notice right now and leave after 3 months, then I will technically only have 7 months of full time experience even though having worked for 13 months. Now I know that leaving a company before a year has a huge impact on your CV. Especially when I want to do an MBA. But i really want to leave this job and I want to leave it right now. Can I? Should I? Looking to get hired for roles in IT Project Lead , Project Manager. Drop in the details. Thanks Hey I am not looking for work but can you explain what digital cover is Not a career expert but life's too short to feel like dying everyday. Bail if you can dude. Just have enough savings and skills to save yourself from starvation. Good day. Im looking for work! Dm me the deets plz. Hiring or looking to get hired ? 2nd one, edited Can you share cv to anuj@goaffpro.com ? Can you share your cv over DM? Can you share your CV please? Don't quit. Take up another job if you dislike this one. Leaving a company regardless of duration will do worse for your career Looking to get hired (My survival depends on it): Semi-Qualified Cost and Management Accountant with 2 years of professional working experience in Accounts Payable process, as a Finance Trainee, in Indian Oil Corporation Limited and Bharat Heavy Electricals Limited. Hands on experience with SAP FICO module, WrenchENT Client (a DBMS tool), Ramco systems modules (ERP Software), and MS Office (Excel and Word). Location: Delhi NCR (WFH/WFO/Full Time/Part Time) Please DM me If you have any work opportunities related to my work experience and skills. And if it's something which is not from my background, we can discuss it together to see wheather I'm the right fit for it. Thank you. Looking for career advice: I have passed my MBBS in 2020 but have left the internship midway due to utter lack of interest and health issues. I'm currently left with provisional certificate. I have decent computer knowledge and writing skills and a good command over English. I want to know what are the career options I have and I'm willing to put effort into getting a high paying job and learn necessary skills. Plz help me. Digital cover - 'cover' image for an eBook Sent you a DM Got it I run a design agency in Bangalore and have worked with 12 companies in the last 15 months of starting up. Currently, have 4 clients and am looking to expand. Anyone who needs help with UX design here? danks, ill look into it private man sent message to you"
}