{
    "id": "1av68m3",
    "title": "Waqf Act,1995: A Tool given to Waqf Boards to snatch the property of Hindus ?",
    "url": "https://timesofindia.indiatimes.com/blogs/myview/waqf-act1995-a-tool-given-to-waqf-boards-to-snatch-the-property-of-hindus/",
    "selftext": "Waqf Act was first passed by Parliament in 1954. Subsequently it was repealed and a new Waqf Act was passed in 1995 which gave more powers to Waqf Boards. In 2013, this Act was further amended to give unlimited powers to Waqf Boards to snatch anyone’s property, which even could not be challenged in any court of law. In March 2014, just before the commencement of Lok Sabha Elections, the Congress gifted 123 prime properties in Delhi to Delhi Waqf Board by using this law. Due to this black law, thousands of acres of land of Hindus have been snatched away in the country so far. Recently Tamil Nadu waqf Board has declared 6 Villages of Tamil Nadu, including a 1500 years old Hindu Temple as Waqf property.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1708395703.0,
    "convurl": "https://external-preview.redd.it/LztFMG55bW4Nj2SA4JmRXqnkAeg6ZpQP99B1bHBjOso.jpg?auto=webp&s=27c7cc1235d945e247a7b9d05340b75ce00d482d",
    "comments": [
        "You are posting a lot of fake news and propaganda about the Waqf act today. This topic is systematically used by the Hindutva groups to malign Muslims. This is not some benign discussion on a flawed law - which it indeed is.\n\nThere is a need for accurate articles written by those who understand how Waqf works in theory and practice. We need to see the typical situations and understand the problems. Articles like this by Hindutva/BJP activists do not fall in that category.\n\nIt is not true that the Waqf board can baselessly claim any property, and it is not true that their ruling cannot be challenged in a regular court. A Waqf claim is based on ownership or historical documents, as with any property dispute. A Waqf tribunal is not the local mullahs, but a proper civil court including a judge and a civil servant. And the order of that tribunal can be challenged in court, as with any judicial order.\n\nSo few people understand this topic that one can find more propaganda pieces like this than informative articles. The Waqf act will surely be struck down, but on the basis of such propaganda and fearmongering."
    ],
    "cleaned_text": "waqf act tool given waqf boards snatch property hindus waqf act first passed parliament subsequently repealed new waqf act passed gave powers waqf boards act amended give unlimited powers waqf boards snatch anyones property even could challenged court law march commencement lok sabha elections congress gifted prime properties delhi delhi waqf board using law due black law thousands acres land hindus snatched away country far recently tamil nadu waqf board declared villages tamil nadu including years old hindu temple waqf property ",
    "cleaned_title": "waqf act tool given waqf boards snatch property hindus",
    "cleaned_selftext": "waqf act first passed parliament subsequently repealed new waqf act passed gave powers waqf boards act amended give unlimited powers waqf boards snatch anyones property even could challenged court law march commencement lok sabha elections congress gifted prime properties delhi delhi waqf board using law due black law thousands acres land hindus snatched away country far recently tamil nadu waqf board declared villages tamil nadu including years old hindu temple waqf property",
    "cleaned_comments": "posting lot fake news propaganda waqf act today topic systematically used hindutva groups malign muslims benign discussion flawed law indeed need accurate articles written understand waqf works theory practice need see typical situations understand problems articles like hindutvabjp activists fall category true waqf board baselessly claim property true ruling challenged regular court waqf claim based ownership historical documents property dispute waqf tribunal local mullahs proper civil court including judge civil servant order tribunal challenged court judicial order people understand topic one find propaganda pieces like informative articles waqf act surely struck basis propaganda fearmongering",
    "light_cleaned_title": "Waqf Act,1995: A Tool given to Waqf Boards to snatch the property of Hindus ?",
    "light_cleaned_selftext": "Waqf Act was first passed by Parliament in 1954. Subsequently it was repealed and a new Waqf Act was passed in 1995 which gave more powers to Waqf Boards. In 2013, this Act was further amended to give unlimited powers to Waqf Boards to snatch anyone’s property, which even could not be challenged in any court of law. In March 2014, just before the commencement of Lok Sabha Elections, the Congress gifted 123 prime properties in Delhi to Delhi Waqf Board by using this law. Due to this black law, thousands of acres of land of Hindus have been snatched away in the country so far. Recently Tamil Nadu waqf Board has declared 6 Villages of Tamil Nadu, including a 1500 years old Hindu Temple as Waqf property.",
    "light_cleaned_comments": "You are posting a lot of fake news and propaganda about the Waqf act today. This topic is systematically used by the Hindutva groups to malign Muslims. This is not some benign discussion on a flawed law - which it indeed is. There is a need for accurate articles written by those who understand how Waqf works in theory and practice. We need to see the typical situations and understand the problems. Articles like this by Hindutva/BJP activists do not fall in that category. It is not true that the Waqf board can baselessly claim any property, and it is not true that their ruling cannot be challenged in a regular court. A Waqf claim is based on ownership or historical documents, as with any property dispute. A Waqf tribunal is not the local mullahs, but a proper civil court including a judge and a civil servant. And the order of that tribunal can be challenged in court, as with any judicial order. So few people understand this topic that one can find more propaganda pieces like this than informative articles. The Waqf act will surely be struck down, but on the basis of such propaganda and fearmongering."
}