{
    "id": "1dnixms",
    "title": "Passport police verification bribery, widespread issue ",
    "url": "https://www.reddit.com/r/india/comments/1dnixms/passport_police_verification_bribery_widespread/",
    "selftext": "\nThe issue of corruption during police verification for passports remains a significant concern across India. Colloquially known as \"kharcha pani,\" this practice involves police officers soliciting bribes ranging from ₹200 to ₹5,000. Alarmingly, these requests are often made openly, even at police stations.\n\nIn the era of Digital India, the current verification process appears increasingly obsolete and serves more as a source of harassment than a necessary security measure. For citizens encountering such demands, here are some recommended steps:\n\n1. Firmly refuse to pay or feign misunderstanding.\n2. Remember that applications cannot be rejected without valid reasons, and police must report to the passport office within 21 days.\n3. Consider filing a Right to Information (RTI) request for clarification on rejection reasons.\n4. Email the police commissioner to report the incident.\n5. Record all calls and conversations as evidence, where legally permissible.\n\nIt's crucial to note that refusing to pay will not jeopardize your passport application. By standing firm, you contribute to dismantling this corrupt practice.\n\nSome news articles have highlighted this ongoing issue:\n\n\nhttps://www.deccanherald.com/india/karnataka/bengaluru/passport-verification-bengaluru-constable-suspended-for-taking-bribe-1239718.html\n\nhttps://timesofindia.indiatimes.com/city/mumbai/2-cops-take-6000-bribe-for-passport-verification-held/articleshow/108861976.cms\n\nhttps://timesofindia.indiatimes.com/city/nagpur/bribes-are-the-rule-for-passport-verification-alleges-travel-agent/articleshow/103879369.cms\n\nhttps://timesofindia.indiatimes.com/city/lucknow/cbi-registers-fir-against-five-accused-including-passport-office-officials-on-allegations-of-taking-bribes/amp_articleshow/108437468.cms\n\nhttps://www.thehindu.com/news/cities/bangalore/police-verification-a-big-source-of-corruption-study/article8520334.ece/amp/\n\n- Deccan Herald reported on a Bengaluru constable's suspension for taking bribes during passport verification.\n- Times of India covered arrests of police officers in Mumbai for accepting bribes in the verification process.\n- Similar reports have emerged from Nagpur and Lucknow, indicating the widespread nature of this problem.\n- A study reported by The Hindu identified police verification as a major source of corruption in the passport issuance process.\n\nan old blog from IAS @over2shailaja which also provide a perspective on this over2shailaja.wordpress.com/tag/passport/\n\nFor more news and to report incidents, citizens can visit ipaidabribe.com.\n\nIt is imperative that we collectively work towards eradicating this corrupt practice. By refusing to participate and reporting incidents, we can push for a more transparent and efficient passport verification system that aligns with India's digital progress. ",
    "flair": "Law & Courts",
    "score": 114,
    "num_comments": 51,
    "created_utc": 1719249504.0,
    "convurl": "https://external-preview.redd.it/JfXtp-_8Nxxmd5O2IKj7-t2ZPgFrpavp18gMzxYZ_wo.jpg?auto=webp&s=2bd66e7b14c4ecd757204a5ed81f75a3a9a5d0c9",
    "comments": [
        "One way they ask for bribes is by demanding all kinds of documents, including absurd ones like the parents' birth certificate. In this case, they are clearly aiming for a huge bribe. \n\nThe police have considerable power in their hands. They can delay the verification for months - which happens anyway in some periods - or they can report that the individual was not found to be living at the listed address. Disputing this is difficult. The passport office will sooner believe the police report than your complaint. Recording the conversation can be helpful, but the government needs to do something.",
        "I believe the Indian government can bypass this issue by hiring a 3rd party agency for a background check.",
        "Clearly the government has to fix this system, except the pv, rest of precess is very straight forward.\n\nAbout the documents, file an RTI or send an email to passport office cc police commissioner asking for if these documents are needed for passport pv. Someone said it worked for them and he was cleared.",
        "They surely can, this issue has been here since ages, and if I'm not wrong passport office does pay police for it as when you go to the passport seva website you'll see it charger 500 rs for police verification, if you want it individually.\n\nSo the cost is already covered in the total fee.\nBetter give it to 3rd party.\n\nCriminals clearly has some loopholes, many have multiple passport.\nThis process solely exist for harrasment of citizens",
        "I know someone who was asked to pay 5k. The officer asked for all sorts of certificates untill he found a reason to ask money. Right from their Birth, to father's death.\n\nThey had a mismatch of one alphabet in their 10th certificate and Aadhar (all other certificates except 10th had same spelling). They didn't have time to process the certificate name change and gave it.",
        "Isn't police verification in passport stands for only address verification, as other documents are already processed by passport office, even I had surname missing in one document and the passport office pointed it out, I explained on site and the application was approved.",
        "I am a divorcee during my police verification the police guy tried to use that to get more money from me. He asked me to call my ex-wife and only if she says we don’t have any pending legal disputes. I am on good terms with my ex-wife so I called his bluff and made him speak to her. After that he kept saying divorce issues are complicated and they can’t do the PV so easily.",
        "Unfortunately he couldn't say \"NO\" to an inspecting officer knowing he can make or break it",
        "They lower their respect with each passing day.\n\nIt's their job to check for legal pending issues and not forcing someone like this.",
        "I refused to pay and the police have a negative remark on me and then I received a show cause notice from the passport office and I had to pay a fine of 5000 to get my passport.",
        "Yes, I too went through this for my previous passport.      \nA negative remark by the police for some stupid made-up reason would have you doing circuits of the passport office for months (where it's difficult to get appointments) and managing the red tape there. And even after this is sorted out, you'd have to spend time explaining at the airport during every exit-immigration check until you get a new passport after a fresh police verification.",
        "Easily said than done.Unless you really have lot of time on your hands and do'nt really really require a passport(Have no out of country travel plans),Police can use vague rules/requirements and make you run around for ever,. Despite being born in India having to pay a bribe to prove that you are a citizen of India shows the extent of corruption in the Indian system...",
        "Me and my dad filed for our passports and my pcc in these past 3 months. For the passport’s verification he tried everything to get bribe but he couldn’t but during my pcc he knew that I had an urgency (to file for my visa appointment) and asked for proof of birth even though I had birth certificate and PAN available.\n\nHe asked my dad to come out and then shamelessly asked for “Tumhare bete ka aashirwad ke liye”. We knew what he wanted and folded because we wanted to move on. \n\nThis MF had the audacity to lecture me on how my father is doing so much sacrifice for me and I should not let him down while I was handing him 1K INR.",
        "I paid 1500 in year 2015",
        "Yes my friend was extra cautious and didn't pay the bribe and ensured all documents were in order but got a passport rejection saying that he is not an Indian national? \nThis is the state of police in India. After paying high income taxes this is what happens for 1000 rupees.",
        "Bullshit. Have renewed and got 4 new passports in last 5 years, haven’t paid a rupee.",
        "Ignorance is bliss. Maybe only tier 3, 2 cities have this issue",
        "One must be so shameless to say that to you just after taking bribe, because I would even not sleep for days if I keep 1₹ of someone which wasn't meant for me.",
        "I have seen the same happen for 200 rs as well.",
        "My dad was asked to pay Rs 500",
        "The Govt clearly need to change this system, it's a major source of curruption",
        "Well maybe something will happen https://www.etvbharat.com/hi/!bharat/mea-working-to-cut-police-verification-time-for-passport-says-external-affairs-minister-s-jaishankar-hin24062403350\n\n\nThe news doesn't say what changes exactly though",
        "Yes, I'll ask him to file an RTI. Thank you for this info",
        "My wife refused to pay and now she got a show cause notice because they did not approve her verification.",
        "I think I've been lucky, last 2 passport renewals (one in my hometown and one in Pune), didn't have to pay a bribe.\n\nThe recent one in Pune, they asked for everyone single document under the sun which I carried after having a bad experience renewing my passport before the process became digital. \n\nThough I didn't carry my birth certificate because I didn't think it was relevant. Cop asked about it because I was born outside India (but still Indian citizen from birth). Insisted it was required for processing. I said ok I'll go home and come in 10-15 mins then he said never mind. \n\nNext year I need to renew my passport again because of permanent address change, hopefully no issues there.",
        "Say no. People pay bribes way too easily",
        "You can celebrate honest police officers on ipaidabribe.com -> I met an honest officer",
        "Is it recent? If yes, file an RTI asking for exact reason and the situation. Then report it to police commissioner, cc district collector office",
        "Some would now ask for 5k or even 10k.\nBribeflation I guess",
        "That's true, but it's because we think police holds a lot of power which it does sometimes. So always keep your recordings, proofs ready.\nSomeone said he went straight to police desk to lodge bribe complaint in same station and he was cleared.\n\nOf course nothing should be wrong on our side for this to work",
        "I recently got my passport renewed under tatkaal. PV happened on day 3 because I got a police call at Day 2 but I was not home. No bribe requested, just simple questions around how long have I stayed here etc. The speed post guy however wanted me to award him for which I said no.",
        "That's good to hear. We need more people like them.",
        "I handle RTI requests , so I am qualified to comment on this. RTI will only give you recorded information. Eg, if passport was denied and the reason mentioned on the file is - insufficient documentary proof\".\n, you will get just that in the RTI. \n\nNo amount of clarification will get you anything more than that. If you ask for an explanation on this, the RTI reply will be, \"this is not a recorded information hence, the request for information cannot be complied\". \n\nSo, yes, RTI is a great tool, but it will not work always.",
        "I don't think he was honest, I just had all my bases covered. And I spoke in Marathi so that was also a strong point for me.",
        "Makes sense, just curious, can it be expanded to say which document exactly if we have provided all documents. \n\nFor others who said it worked\nThe way it works is maybe by making police know that the person knows things and laws. So they would try not to mess for some rs.",
        "Exactly. Some of many reasons I am leaving this country. It’s not for me",
        "Instead of asking the name of the document, you can ask for a scanned copy of the file (you yourself have to file the RTI else it will get denied on the grounds of privacy of citizen). If the name of the document is not mentioned in the note made by the officer, again standard reply of \"this is not a recorded information\"",
        "Thanks, what would you suggest to do in case, a policeman rejected pv because of no bribery.",
        "You can complain to Vigilance, drop a CPGRAMS, complain to the Station Incharge. Actually, there are a lot of options. But also be prepared for the pushback.",
        "Yup, people don't realize that the solution is not so simple, you've to somehow verify residency while not corrupting the police with too much power. I think people who fixate on passport verification have never seen other far more sinister forms of corruption in play.  passport verification just stands out as a very visible form of corruption to them and very frankly it's benign.\n\nA more serious corruption problem which requires carefully balancing stakeholder interests and navigating people's conscience: \n\nTender award bids - how do you ensure there's free competition in the tender awards while not disincetivising the tender bidders.",
        "Yup, it's not a problem you can solve overnight by just not paying the bribe. (that can be part of a braoder, solution where a large group of people start shaming the police and protesting but i don't see much incentive to make it happen)",
        "Why RTI works is that the cop is now aware that you know the process and can make his life hell. Where he might be pulled up for questioning. And he decides to let go.",
        "So your sample size to call bullshit is 1.",
        "No. Based on what I see around me, people are just looking for an opportunity to bribe for “convenience”.",
        "Are you from Maharashtra? If yes, then parent's birth certificate is not corruption - it's a rule. This is a result of soft NRC - basically you need to prove your parents were born in India. The same rules as NRC, basically.",
        "That seems to be true. Here is [the order](https://mumbaipolice.gov.in/files/passport/passport.pdf) dated 2022, saying that those born after 1987 need to show that at least one of their parents is an Indian citizen (via their birth certificate or passport.)\n\nThis doesn't make any sense to me. We go through the trouble of submitting a dozen documents at the time of passport application, and we fix all discrepancies at that time. The police should not be starting a new round of *document* verification. Besides, very few of the older generation or rural-born have a birth certificate.\n\nThe requirements for passport should be mentioned upfront, on the passport seva website. This requirement is not there. No one knows this rule. Everyone I know got their passports some years ago without having to do any such thing.",
        "Yeah, it makes zero sense. It's not corruption but stupidity. \n\nHonestly, thank God CAA+NRC was not implemented. Imagine the situation - most older gen don't have birth certificates like you said, it would have been utter hell. \n\nNot even getting into the fact that Aadhar is not accepted as proof of nationality nor is it a proof of residence.",
        "I can assure you nothing of that sort will happen. Also, it all depends on what is mentioned on the file.",
        "Trust me, it works. I have used RTIs with multiple govt departments to get my job done.",
        "I was asked for bribe in the name of the fee shamelessly by police man sitting in the police station ,he was confidently told me there are no cameras in the station so I can proceed paying the do called fee for this\n\nIt disgust me just looking at this guy",
        "A very rare case indeed"
    ],
    "cleaned_text": "passport police verification bribery widespread issue issue corruption police verification passports remains significant concern across india colloquially known kharcha pani practice involves police officers soliciting bribes ranging alarmingly requests often made openly even police stations era digital india current verification process appears increasingly obsolete serves source harassment necessary security measure citizens encountering demands recommended steps firmly refuse pay feign misunderstanding remember applications rejected without valid reasons police must report passport office within days consider filing right information rti request clarification rejection reasons email police commissioner report incident record calls conversations evidence legally permissible crucial note refusing pay jeopardize passport application standing firm contribute dismantling corrupt practice news articles highlighted ongoing issue deccan herald reported bengaluru constables suspension taking bribes passport verification times india covered arrests police officers mumbai accepting bribes verification process similar reports emerged nagpur lucknow indicating widespread nature problem study reported hindu identified police verification major source corruption passport issuance process old blog ias overshailaja also provide perspective overshailajawordpresscomtagpassport news report incidents citizens visit ipaidabribecom imperative collectively work towards eradicating corrupt practice refusing participate reporting incidents push transparent efficient passport verification system aligns indias digital progress ",
    "cleaned_title": "passport police verification bribery widespread issue",
    "cleaned_selftext": "issue corruption police verification passports remains significant concern across india colloquially known kharcha pani practice involves police officers soliciting bribes ranging alarmingly requests often made openly even police stations era digital india current verification process appears increasingly obsolete serves source harassment necessary security measure citizens encountering demands recommended steps firmly refuse pay feign misunderstanding remember applications rejected without valid reasons police must report passport office within days consider filing right information rti request clarification rejection reasons email police commissioner report incident record calls conversations evidence legally permissible crucial note refusing pay jeopardize passport application standing firm contribute dismantling corrupt practice news articles highlighted ongoing issue deccan herald reported bengaluru constables suspension taking bribes passport verification times india covered arrests police officers mumbai accepting bribes verification process similar reports emerged nagpur lucknow indicating widespread nature problem study reported hindu identified police verification major source corruption passport issuance process old blog ias overshailaja also provide perspective overshailajawordpresscomtagpassport news report incidents citizens visit ipaidabribecom imperative collectively work towards eradicating corrupt practice refusing participate reporting incidents push transparent efficient passport verification system aligns indias digital progress",
    "cleaned_comments": "one way ask bribes demanding kinds documents including absurd ones like parents birth certificate case clearly aiming huge bribe police considerable power hands delay verification months happens anyway periods report individual found living listed address disputing difficult passport office sooner believe police report complaint recording conversation helpful government needs something believe indian government bypass issue hiring rd party agency background check clearly government fix system except pv rest precess straight forward documents file rti send email passport office cc police commissioner asking documents needed passport pv someone said worked cleared surely issue since ages im wrong passport office pay police go passport seva website youll see charger rs police verification want individually cost already covered total fee better give rd party criminals clearly loopholes many multiple passport process solely exist harrasment citizens know someone asked pay k officer asked sorts certificates untill found reason ask money right birth fathers death mismatch one alphabet th certificate aadhar certificates except th spelling didnt time process certificate name change gave isnt police verification passport stands address verification documents already processed passport office even surname missing one document passport office pointed explained site application approved divorcee police verification police guy tried use get money asked call exwife says dont pending legal disputes good terms exwife called bluff made speak kept saying divorce issues complicated cant pv easily unfortunately couldnt say inspecting officer knowing make break lower respect passing day job check legal pending issues forcing someone like refused pay police negative remark received show cause notice passport office pay fine get passport yes went previous passport negative remark police stupid madeup reason would circuits passport office months difficult get appointments managing red tape even sorted youd spend time explaining airport every exitimmigration check get new passport fresh police verification easily said doneunless really lot time hands dont really really require passporthave country travel planspolice use vague rulesrequirements make run around ever despite born india pay bribe prove citizen india shows extent corruption indian system dad filed passports pcc past months passports verification tried everything get bribe couldnt pcc knew urgency file visa appointment asked proof birth even though birth certificate pan available asked dad come shamelessly asked tumhare bete ka aashirwad ke liye knew wanted folded wanted move mf audacity lecture father much sacrifice let handing k inr paid year yes friend extra cautious didnt pay bribe ensured documents order got passport rejection saying indian national state police india paying high income taxes happens rupees bullshit renewed got new passports last years havent paid rupee ignorance bliss maybe tier cities issue one must shameless say taking bribe would even sleep days keep someone wasnt meant seen happen rs well dad asked pay rs govt clearly need change system major source curruption well maybe something happen news doesnt say changes exactly though yes ill ask file rti thank info wife refused pay got show cause notice approve verification think ive lucky last passport renewals one hometown one pune didnt pay bribe recent one pune asked everyone single document sun carried bad experience renewing passport process became digital though didnt carry birth certificate didnt think relevant cop asked born outside india still indian citizen birth insisted required processing said ok ill go home come mins said never mind next year need renew passport permanent address change hopefully issues say people pay bribes way easily celebrate honest police officers ipaidabribecom met honest officer recent yes file rti asking exact reason situation report police commissioner cc district collector office would ask k even k bribeflation guess thats true think police holds lot power sometimes always keep recordings proofs ready someone said went straight police desk lodge bribe complaint station cleared course nothing wrong side work recently got passport renewed tatkaal pv happened day got police call day home bribe requested simple questions around long stayed etc speed post guy however wanted award said thats good hear need people like handle rti requests qualified comment rti give recorded information eg passport denied reason mentioned file insufficient documentary proof get rti amount clarification get anything ask explanation rti reply recorded information hence request information complied yes rti great tool work always dont think honest bases covered spoke marathi also strong point makes sense curious expanded say document exactly provided documents others said worked way works maybe making police know person knows things laws would try mess rs exactly many reasons leaving country instead asking name document ask scanned copy file file rti else get denied grounds privacy citizen name document mentioned note made officer standard reply recorded information thanks would suggest case policeman rejected pv bribery complain vigilance drop cpgrams complain station incharge actually lot options also prepared pushback yup people dont realize solution simple youve somehow verify residency corrupting police much power think people fixate passport verification never seen far sinister forms corruption play passport verification stands visible form corruption frankly benign serious corruption problem requires carefully balancing stakeholder interests navigating peoples conscience tender award bids ensure theres free competition tender awards disincetivising tender bidders yup problem solve overnight paying bribe part braoder solution large group people start shaming police protesting dont see much incentive make happen rti works cop aware know process make life hell might pulled questioning decides let go sample size call bullshit based see around people looking opportunity bribe convenience maharashtra yes parents birth certificate corruption rule result soft nrc basically need prove parents born india rules nrc basically seems true orderhttpsmumbaipolicegovinfilespassportpassportpdf dated saying born need show least one parents indian citizen via birth certificate passport doesnt make sense go trouble submitting dozen documents time passport application fix discrepancies time police starting new round document verification besides older generation ruralborn birth certificate requirements passport mentioned upfront passport seva website requirement one knows rule everyone know got passports years ago without thing yeah makes zero sense corruption stupidity honestly thank god caanrc implemented imagine situation older gen dont birth certificates like said would utter hell even getting fact aadhar accepted proof nationality proof residence assure nothing sort happen also depends mentioned file trust works used rtis multiple govt departments get job done asked bribe name fee shamelessly police man sitting police station confidently told cameras station proceed paying called fee disgust looking guy rare case indeed",
    "light_cleaned_title": "Passport police verification bribery, widespread issue",
    "light_cleaned_selftext": "The issue of corruption during police verification for passports remains a significant concern across India. Colloquially known as \"kharcha pani,\" this practice involves police officers soliciting bribes ranging from ₹200 to ₹5,000. Alarmingly, these requests are often made openly, even at police stations. In the era of Digital India, the current verification process appears increasingly obsolete and serves more as a source of harassment than a necessary security measure. For citizens encountering such demands, here are some recommended steps: 1. Firmly refuse to pay or feign misunderstanding. 2. Remember that applications cannot be rejected without valid reasons, and police must report to the passport office within 21 days. 3. Consider filing a Right to Information (RTI) request for clarification on rejection reasons. 4. Email the police commissioner to report the incident. 5. Record all calls and conversations as evidence, where legally permissible. It's crucial to note that refusing to pay will not jeopardize your passport application. By standing firm, you contribute to dismantling this corrupt practice. Some news articles have highlighted this ongoing issue: - Deccan Herald reported on a Bengaluru constable's suspension for taking bribes during passport verification. - Times of India covered arrests of police officers in Mumbai for accepting bribes in the verification process. - Similar reports have emerged from Nagpur and Lucknow, indicating the widespread nature of this problem. - A study reported by The Hindu identified police verification as a major source of corruption in the passport issuance process. an old blog from IAS @over2shailaja which also provide a perspective on this over2shailaja.wordpress.com/tag/passport/ For more news and to report incidents, citizens can visit ipaidabribe.com. It is imperative that we collectively work towards eradicating this corrupt practice. By refusing to participate and reporting incidents, we can push for a more transparent and efficient passport verification system that aligns with India's digital progress.",
    "light_cleaned_comments": "One way they ask for bribes is by demanding all kinds of documents, including absurd ones like the parents' birth certificate. In this case, they are clearly aiming for a huge bribe. The police have considerable power in their hands. They can delay the verification for months - which happens anyway in some periods - or they can report that the individual was not found to be living at the listed address. Disputing this is difficult. The passport office will sooner believe the police report than your complaint. Recording the conversation can be helpful, but the government needs to do something. I believe the Indian government can bypass this issue by hiring a 3rd party agency for a background check. Clearly the government has to fix this system, except the pv, rest of precess is very straight forward. About the documents, file an RTI or send an email to passport office cc police commissioner asking for if these documents are needed for passport pv. Someone said it worked for them and he was cleared. They surely can, this issue has been here since ages, and if I'm not wrong passport office does pay police for it as when you go to the passport seva website you'll see it charger 500 rs for police verification, if you want it individually. So the cost is already covered in the total fee. Better give it to 3rd party. Criminals clearly has some loopholes, many have multiple passport. This process solely exist for harrasment of citizens I know someone who was asked to pay 5k. The officer asked for all sorts of certificates untill he found a reason to ask money. Right from their Birth, to father's death. They had a mismatch of one alphabet in their 10th certificate and Aadhar (all other certificates except 10th had same spelling). They didn't have time to process the certificate name change and gave it. Isn't police verification in passport stands for only address verification, as other documents are already processed by passport office, even I had surname missing in one document and the passport office pointed it out, I explained on site and the application was approved. I am a divorcee during my police verification the police guy tried to use that to get more money from me. He asked me to call my ex-wife and only if she says we don’t have any pending legal disputes. I am on good terms with my ex-wife so I called his bluff and made him speak to her. After that he kept saying divorce issues are complicated and they can’t do the PV so easily. Unfortunately he couldn't say \"NO\" to an inspecting officer knowing he can make or break it They lower their respect with each passing day. It's their job to check for legal pending issues and not forcing someone like this. I refused to pay and the police have a negative remark on me and then I received a show cause notice from the passport office and I had to pay a fine of 5000 to get my passport. Yes, I too went through this for my previous passport. A negative remark by the police for some stupid made-up reason would have you doing circuits of the passport office for months (where it's difficult to get appointments) and managing the red tape there. And even after this is sorted out, you'd have to spend time explaining at the airport during every exit-immigration check until you get a new passport after a fresh police verification. Easily said than done.Unless you really have lot of time on your hands and do'nt really really require a passport(Have no out of country travel plans),Police can use vague rules/requirements and make you run around for ever,. Despite being born in India having to pay a bribe to prove that you are a citizen of India shows the extent of corruption in the Indian system... Me and my dad filed for our passports and my pcc in these past 3 months. For the passport’s verification he tried everything to get bribe but he couldn’t but during my pcc he knew that I had an urgency (to file for my visa appointment) and asked for proof of birth even though I had birth certificate and PAN available. He asked my dad to come out and then shamelessly asked for “Tumhare bete ka aashirwad ke liye”. We knew what he wanted and folded because we wanted to move on. This MF had the audacity to lecture me on how my father is doing so much sacrifice for me and I should not let him down while I was handing him 1K INR. I paid 1500 in year 2015 Yes my friend was extra cautious and didn't pay the bribe and ensured all documents were in order but got a passport rejection saying that he is not an Indian national? This is the state of police in India. After paying high income taxes this is what happens for 1000 rupees. Bullshit. Have renewed and got 4 new passports in last 5 years, haven’t paid a rupee. Ignorance is bliss. Maybe only tier 3, 2 cities have this issue One must be so shameless to say that to you just after taking bribe, because I would even not sleep for days if I keep 1₹ of someone which wasn't meant for me. I have seen the same happen for 200 rs as well. My dad was asked to pay Rs 500 The Govt clearly need to change this system, it's a major source of curruption Well maybe something will happen The news doesn't say what changes exactly though Yes, I'll ask him to file an RTI. Thank you for this info My wife refused to pay and now she got a show cause notice because they did not approve her verification. I think I've been lucky, last 2 passport renewals (one in my hometown and one in Pune), didn't have to pay a bribe. The recent one in Pune, they asked for everyone single document under the sun which I carried after having a bad experience renewing my passport before the process became digital. Though I didn't carry my birth certificate because I didn't think it was relevant. Cop asked about it because I was born outside India (but still Indian citizen from birth). Insisted it was required for processing. I said ok I'll go home and come in 10-15 mins then he said never mind. Next year I need to renew my passport again because of permanent address change, hopefully no issues there. Say no. People pay bribes way too easily You can celebrate honest police officers on ipaidabribe.com -> I met an honest officer Is it recent? If yes, file an RTI asking for exact reason and the situation. Then report it to police commissioner, cc district collector office Some would now ask for 5k or even 10k. Bribeflation I guess That's true, but it's because we think police holds a lot of power which it does sometimes. So always keep your recordings, proofs ready. Someone said he went straight to police desk to lodge bribe complaint in same station and he was cleared. Of course nothing should be wrong on our side for this to work I recently got my passport renewed under tatkaal. PV happened on day 3 because I got a police call at Day 2 but I was not home. No bribe requested, just simple questions around how long have I stayed here etc. The speed post guy however wanted me to award him for which I said no. That's good to hear. We need more people like them. I handle RTI requests , so I am qualified to comment on this. RTI will only give you recorded information. Eg, if passport was denied and the reason mentioned on the file is - insufficient documentary proof\". , you will get just that in the RTI. No amount of clarification will get you anything more than that. If you ask for an explanation on this, the RTI reply will be, \"this is not a recorded information hence, the request for information cannot be complied\". So, yes, RTI is a great tool, but it will not work always. I don't think he was honest, I just had all my bases covered. And I spoke in Marathi so that was also a strong point for me. Makes sense, just curious, can it be expanded to say which document exactly if we have provided all documents. For others who said it worked The way it works is maybe by making police know that the person knows things and laws. So they would try not to mess for some rs. Exactly. Some of many reasons I am leaving this country. It’s not for me Instead of asking the name of the document, you can ask for a scanned copy of the file (you yourself have to file the RTI else it will get denied on the grounds of privacy of citizen). If the name of the document is not mentioned in the note made by the officer, again standard reply of \"this is not a recorded information\" Thanks, what would you suggest to do in case, a policeman rejected pv because of no bribery. You can complain to Vigilance, drop a CPGRAMS, complain to the Station Incharge. Actually, there are a lot of options. But also be prepared for the pushback. Yup, people don't realize that the solution is not so simple, you've to somehow verify residency while not corrupting the police with too much power. I think people who fixate on passport verification have never seen other far more sinister forms of corruption in play. passport verification just stands out as a very visible form of corruption to them and very frankly it's benign. A more serious corruption problem which requires carefully balancing stakeholder interests and navigating people's conscience: Tender award bids - how do you ensure there's free competition in the tender awards while not disincetivising the tender bidders. Yup, it's not a problem you can solve overnight by just not paying the bribe. (that can be part of a braoder, solution where a large group of people start shaming the police and protesting but i don't see much incentive to make it happen) Why RTI works is that the cop is now aware that you know the process and can make his life hell. Where he might be pulled up for questioning. And he decides to let go. So your sample size to call bullshit is 1. No. Based on what I see around me, people are just looking for an opportunity to bribe for “convenience”. Are you from Maharashtra? If yes, then parent's birth certificate is not corruption - it's a rule. This is a result of soft NRC - basically you need to prove your parents were born in India. The same rules as NRC, basically. That seems to be true. Here is [the order](https://mumbaipolice.gov.in/files/passport/passport.pdf) dated 2022, saying that those born after 1987 need to show that at least one of their parents is an Indian citizen (via their birth certificate or passport.) This doesn't make any sense to me. We go through the trouble of submitting a dozen documents at the time of passport application, and we fix all discrepancies at that time. The police should not be starting a new round of *document* verification. Besides, very few of the older generation or rural-born have a birth certificate. The requirements for passport should be mentioned upfront, on the passport seva website. This requirement is not there. No one knows this rule. Everyone I know got their passports some years ago without having to do any such thing. Yeah, it makes zero sense. It's not corruption but stupidity. Honestly, thank God CAA+NRC was not implemented. Imagine the situation - most older gen don't have birth certificates like you said, it would have been utter hell. Not even getting into the fact that Aadhar is not accepted as proof of nationality nor is it a proof of residence. I can assure you nothing of that sort will happen. Also, it all depends on what is mentioned on the file. Trust me, it works. I have used RTIs with multiple govt departments to get my job done. I was asked for bribe in the name of the fee shamelessly by police man sitting in the police station ,he was confidently told me there are no cameras in the station so I can proceed paying the do called fee for this It disgust me just looking at this guy A very rare case indeed"
}