{
    "id": "18j76mm",
    "title": "REPORT Indian Scammers",
    "url": "https://youtu.be/8r_7bx_wrw8?si=F2hlxC0RS1mdrdIW",
    "selftext": "This woman, Rupinder Kaur along with her boyfriend are racist, shitty telescammers, who were busted, red handed by an American YouTuber who exposes such people - Scam Sandwich\nIf anyone has experience in cyber crime and how to bring these people to actual justice for stealing money from unsuspecting victims, kindly do whatever you can to make a small difference, so these unrelenting criminals have a modicum of fear whenever they try these stunts on the daily.\nCuz of such bastards our brethren have long been stereotyped as Customer support scammers, when we all know only a small minority of bottom of the barrel scum are involved with this.\n\nJust bringing this to everyone’s notice, and hope such people get what they deserve, sooner or later.",
    "flair": "Crime",
    "score": 92,
    "num_comments": 11,
    "created_utc": 1702666063.0,
    "convurl": "https://external-preview.redd.it/rT1vR9n-BoxQjH3aweWliJUf7pL8Ivd3s3WDcXYcj4k.jpg?auto=webp&s=fd7b00444bbeba8f833c4f95776589518bb6d6fb",
    "comments": [
        "Loved it.",
        "Exposing scums one at a time; lovely !!",
        "Fuck these scammers!",
        "God bless this guy. More power to him!",
        "Indian Scammers already have scammed American Retirees of $10B. Ever since these expose, and FBI has opened office in India.  \n\nIndians should now be worried and scamming the only skill they posses, they are now turning attention to Indians.\n\nIndians have nowhere to go, as the system of politicians, govt, police all support them. If any Indian did this, the channel would have been brought down by govt.",
        "Modi government goes berserk when any agency posts negative news about India about tarnishing the country's name. But these scammers are untouched.",
        "I don't know but this video seems scripted. :/",
        "Jail them",
        "Never ever sympathize a scammer \n\nEven if they are begging you to stop posting it on internet\n\nThey’ll continue to scam other people \n\nThey are worst menace to our society."
    ],
    "cleaned_text": "report indian scammers woman rupinder kaur along boyfriend racist shitty telescammers busted red handed american youtuber exposes people scam sandwich anyone experience cyber crime bring people actual justice stealing money unsuspecting victims kindly whatever make small difference unrelenting criminals modicum fear whenever try stunts daily cuz bastards brethren long stereotyped customer support scammers know small minority bottom barrel scum involved bringing everyones notice hope people get deserve sooner later ",
    "cleaned_title": "report indian scammers",
    "cleaned_selftext": "woman rupinder kaur along boyfriend racist shitty telescammers busted red handed american youtuber exposes people scam sandwich anyone experience cyber crime bring people actual justice stealing money unsuspecting victims kindly whatever make small difference unrelenting criminals modicum fear whenever try stunts daily cuz bastards brethren long stereotyped customer support scammers know small minority bottom barrel scum involved bringing everyones notice hope people get deserve sooner later",
    "cleaned_comments": "loved exposing scums one time lovely fuck scammers god bless guy power indian scammers already scammed american retirees b ever since expose fbi opened office india indians worried scamming skill posses turning attention indians indians nowhere go system politicians govt police support indian channel would brought govt modi government goes berserk agency posts negative news india tarnishing countrys name scammers untouched dont know video seems scripted jail never ever sympathize scammer even begging stop posting internet theyll continue scam people worst menace society",
    "light_cleaned_title": "REPORT Indian Scammers",
    "light_cleaned_selftext": "This woman, Rupinder Kaur along with her boyfriend are racist, shitty telescammers, who were busted, red handed by an American YouTuber who exposes such people - Scam Sandwich If anyone has experience in cyber crime and how to bring these people to actual justice for stealing money from unsuspecting victims, kindly do whatever you can to make a small difference, so these unrelenting criminals have a modicum of fear whenever they try these stunts on the daily. Cuz of such bastards our brethren have long been stereotyped as Customer support scammers, when we all know only a small minority of bottom of the barrel scum are involved with this. Just bringing this to everyone’s notice, and hope such people get what they deserve, sooner or later.",
    "light_cleaned_comments": "Loved it. Exposing scums one at a time; lovely !! Fuck these scammers! God bless this guy. More power to him! Indian Scammers already have scammed American Retirees of $10B. Ever since these expose, and FBI has opened office in India. Indians should now be worried and scamming the only skill they posses, they are now turning attention to Indians. Indians have nowhere to go, as the system of politicians, govt, police all support them. If any Indian did this, the channel would have been brought down by govt. Modi government goes berserk when any agency posts negative news about India about tarnishing the country's name. But these scammers are untouched. I don't know but this video seems scripted. :/ Jail them Never ever sympathize a scammer Even if they are begging you to stop posting it on internet They’ll continue to scam other people They are worst menace to our society."
}