{
    "id": "1dvp2y9",
    "title": "Asbestos India's silent killer documentary by al jazeera ",
    "url": "https://v.redd.it/esln4efljmad1",
    "selftext": "Source Al-Jazeera on Instagram ",
    "flair": "Crime",
    "score": 414,
    "num_comments": 20,
    "created_utc": 1720152188.0,
    "convurl": "https://external-preview.redd.it/ZmZicXhrM2xqbWFkMSl3RP3eYTNyODu_Laog0SE2nVPFBHqXD1iUZo3aljFp.png?format=pjpg&auto=webp&s=d8ba9e56854fc8a49f4012b1f4a396c6fa54dcae",
    "comments": [
        "Human life is not important for the Indian Government, so this is basically a non-issue",
        "The school I went to for a couple of years literally had old asbestos roofs(that wavy tin style). Sometimes they'd break and were replaced with more asbestos roof sheets. \n\nDidn't think about them for years till I started looking to buying a house here in the US(bought January) and realized how big of a deal having asbestos in your dwelling is, especially old asbestos. \n\nTold my wife about it(school roof) and she got concerned enough to ask if we should go to the doctor. I told her, coming from India, Asbestos should be the least of our worry about what could be inside my body.",
        "I lost my father to one of these manufacturing plants in Faridabad (NCR). in his youth he used to work in this cement shed manufacturing plant, where they openly used asbestos, and without any safety equipment. I am talking about the 80s and 90s. \n\nHe never smoked a cig, nor touched alcohol. He was fit even at 60. But when he was 61, he was diagonsed with Mesothelioma, a type of lung cancer. It was 4th stage. I Travelled from one specialist to anotherbut none could help. \n\nMy mother and me havent gotten over this untimely loss. HOPE THIS NEVER HAPPENS TO ANYONE",
        "So sad man 😔 I'm sorry for that",
        "You should let your primary doctor know.or consult a pulmonologist . You may be eligible for lung cancer screening, even if not a smoker.",
        "But politicians ask for votes on the basis of religion",
        "I've been Chest/lung x rayed a couple of times here in the US. I don't think those couple of years of Asbestos did anything because the classroom itself was quite open and airy. \n\nBut I'll keep it in mind and talk to my Primary(also Indian) next I see him.",
        "Why indian news houses stopped reporting like this there are many such social issues which are not politically related and could be very awakening for us Indians. Sad to see this state of our media.",
        "bhakts will say its al jazeera propoganda to shame india",
        "I guess anywhere only few humans life matters.",
        "There's still asbestos roofs on most houses in a village i recently visited, stayed in a house like that too lol",
        "Asbestos should be Illegal to do anything with ",
        "All Dump sites should be cleaned",
        "*people give votes on the basis of religion or caste or the local bahuballi. Can't expect change from the politicians",
        "This is first time I am hearing that That thin wavy sheets can cause Cancer LOL",
        "Unless you're rich then it matters them alot",
        "True🥲🥲",
        "Ye to true, hai par inhone kabhi positive news bataya bhi kaha hai",
        "Who cares? humko to GDP badhana hai /s"
    ],
    "cleaned_text": "asbestos indias silent killer documentary al jazeera source aljazeera instagram ",
    "cleaned_title": "asbestos indias silent killer documentary al jazeera",
    "cleaned_selftext": "source aljazeera instagram",
    "cleaned_comments": "human life important indian government basically nonissue school went couple years literally old asbestos roofsthat wavy tin style sometimes theyd break replaced asbestos roof sheets didnt think years till started looking buying house usbought january realized big deal asbestos dwelling especially old asbestos told wife itschool roof got concerned enough ask go doctor told coming india asbestos least worry could inside body lost father one manufacturing plants faridabad ncr youth used work cement shed manufacturing plant openly used asbestos without safety equipment talking never smoked cig touched alcohol fit even diagonsed mesothelioma type lung cancer th stage travelled one specialist anotherbut none could help mother havent gotten untimely loss hope never happens anyone sad man im sorry let primary doctor knowor consult pulmonologist may eligible lung cancer screening even smoker politicians ask votes basis religion ive chestlung x rayed couple times us dont think couple years asbestos anything classroom quite open airy ill keep mind talk primaryalso indian next see indian news houses stopped reporting like many social issues politically related could awakening us indians sad see state media bhakts say al jazeera propoganda shame india guess anywhere humans life matters theres still asbestos roofs houses village recently visited stayed house like lol asbestos illegal anything dump sites cleaned people give votes basis religion caste local bahuballi cant expect change politicians first time hearing thin wavy sheets cause cancer lol unless youre rich matters alot true ye true hai par inhone kabhi positive news bataya bhi kaha hai cares humko gdp badhana hai",
    "light_cleaned_title": "Asbestos India's silent killer documentary by al jazeera",
    "light_cleaned_selftext": "Source Al-Jazeera on Instagram",
    "light_cleaned_comments": "Human life is not important for the Indian Government, so this is basically a non-issue The school I went to for a couple of years literally had old asbestos roofs(that wavy tin style). Sometimes they'd break and were replaced with more asbestos roof sheets. Didn't think about them for years till I started looking to buying a house here in the US(bought January) and realized how big of a deal having asbestos in your dwelling is, especially old asbestos. Told my wife about it(school roof) and she got concerned enough to ask if we should go to the doctor. I told her, coming from India, Asbestos should be the least of our worry about what could be inside my body. I lost my father to one of these manufacturing plants in Faridabad (NCR). in his youth he used to work in this cement shed manufacturing plant, where they openly used asbestos, and without any safety equipment. I am talking about the 80s and 90s. He never smoked a cig, nor touched alcohol. He was fit even at 60. But when he was 61, he was diagonsed with Mesothelioma, a type of lung cancer. It was 4th stage. I Travelled from one specialist to anotherbut none could help. My mother and me havent gotten over this untimely loss. HOPE THIS NEVER HAPPENS TO ANYONE So sad man 😔 I'm sorry for that You should let your primary doctor know.or consult a pulmonologist . You may be eligible for lung cancer screening, even if not a smoker. But politicians ask for votes on the basis of religion I've been Chest/lung x rayed a couple of times here in the US. I don't think those couple of years of Asbestos did anything because the classroom itself was quite open and airy. But I'll keep it in mind and talk to my Primary(also Indian) next I see him. Why indian news houses stopped reporting like this there are many such social issues which are not politically related and could be very awakening for us Indians. Sad to see this state of our media. bhakts will say its al jazeera propoganda to shame india I guess anywhere only few humans life matters. There's still asbestos roofs on most houses in a village i recently visited, stayed in a house like that too lol Asbestos should be Illegal to do anything with All Dump sites should be cleaned *people give votes on the basis of religion or caste or the local bahuballi. Can't expect change from the politicians This is first time I am hearing that That thin wavy sheets can cause Cancer LOL Unless you're rich then it matters them alot True🥲🥲 Ye to true, hai par inhone kabhi positive news bataya bhi kaha hai Who cares? humko to GDP badhana hai /s"
}