{
    "id": "fk2hh4",
    "title": "Illegal use of Facial Recognition for Voter Verification in Telangana",
    "url": "https://www.reddit.com/r/india/comments/fk2hh4/illegal_use_of_facial_recognition_for_voter/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/rn5p5l0oe7n41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=5b8f0bccd08fac6e713b5f184c1a3ff8621a2a53\n\n**Tl;dr**\n\nIFF filed RTI requests with the Telangana State Election Commission (TSEC) and Telangana State Technology Services (TSTS) pursuant to the use of Facial Recognition Technology (FRT) for voter verification in the urban local body elections in Kompally on 22.1.2020. We have received multiple replies from both authorities detailing their use of the technology. In this blogpost, we  summarize those replies and highlight problems which arise as a result. Such projects are emblematic of the need for a three year moratorium on the use of FRT in India during which comprehensive public consultation should be undertaken.  \n\n\n\\#ProjectPanoptic #facialrecognition  \n\n\n**Background**\n\nOn 18.1.2020, TSEC released a [**circular**](https://tsec.gov.in/pdf/ULBS_MPLTS/circulars/2020/Cir_No_111_TSEC-ULBs_2020_dated_18.01.2020_1401.pdf) which stated that they would run a pilot project during the urban body elections in Kompally. In this project, 10 pollings stations will use facial recognition technology to verify/authenticate the identity of voters in a bid to counter voter impersonation. According to the circular, this technology was developed and supplied t by TSTS. Alerted about possible constitutional risks, IFF filed multiple RTIs on January 24, 2020 and February 05, 2020, respectively.  Both RTIs were filed with the state election commission and TSTS to learn more about the specifics of the project, the legal basis for the project, details on expenditure by the state, and safeguards to protect people’s constitutional rights if any.  \n\n\n**Questions asked**\n\nOn 24.1.2020 our RTI request sought details on the following facets:\n\n1. The legislation under which the authorities are using facial recognition technology;\n2. Whether there was  a standard operating procedure for the pilot project;\n3. Details regarding the results of the pilot projects by TSTS including error rate and bugs reported; and\n4. The total expenditure by the state on the pilot project.  \n\n\nOn 5.2.2020, IFF filed additional RTI requests with TSEC and TSTS in which we asked for the project report and questioned the accuracy of the technology. We also asked whether any future use of the technology was planned.   \n\n\n**Replies received**\n\nWe have received multiple replies from both these authorities.    \n\n\n1. In a reply dated 18.2.2020, TSEC states that it is authorised by Article 243-ZA of the Constitution of India to use FRT. Article 243 ZA of the Constitution states that the State Election Commission is in charge of all matters related to the conduct of elections to Municipalities. This, however, is not a sufficient basis for FRT use for voter verification. Such FRT projects are being implemented in India in a legal vacuum. This violates the decision in Puttaswamy vs UOI which states that certain standards have to be met in order to justify intrusion by the State into the right to privacy. These standards are\n\n        a) legality (existence of a law)\n\n        b) legitimate goal/state aim\n\n        c) proportionality between the objects and the means adopted to achieve     them, and\n\n       d) procedural guarantees to check against the abuse of State interference.\n\n2.    They also sent a copy of the letter which details the Standard Operating   Procedure of the project.  According to the SOP, TSTS sent its officials to the selected polling stations in Kompally to assist in implementing the pilot project. Identification and authentication was carried out through a mobile app which contained the technology. TSTS ensured that all data will be deleted once the statistics are collected for the pooling process and will not be used for any other purpose.  \n\n\n3.   The total expenditure incurred was Rs. 10,200 per polling station. The pilot project was carried out in 10 polling stations. Thus, the total expenditure is Rs. 1,02,000, i.e., one lakh and two thousand rupees.   \n\n\n4.   In a reply dated 27.02.2020, the TSEC says that no decision has been taken about the future use of FRT. Also included was a letter from TSTS dated 4.2.2020 which provides the result of the project including the accuracy rates of the FRT. The average accuracy rate was 78%. A 78% accuracy rate is not satisfactory. This is because exclusion as a result of non-verification would lead to a loss of rights. In this case, the right to vote. \n\n5.   It was also stated in the letter that low results in some polling stations were due to bad lighting and network issues. It was also stated that all the data including the photos were deleted from the servers.\n\n6.   In a reply dated 11.3.2020, the TSTS provided information about their previous use of FRT for authentication of **pensioners**. The accuracy rate was 94% and no bugs were reported.\n\n**IFF’s recommendation**\n\nThe use of such experimental facial recognition systems in Telangana is illegal. It is further proof that without strong privacy protections, such systems are likely lead to the erosion of people’s rights. IFF has called for a **3 year moratorium** on such use by central and state governments.  In the meantime, we suggest a comprehensive public consultation on the use of such technologies informed by international debate on the topic, which can balance technological advancement with people’s civil liberties.  \n\n\n**Important Documents**  \n\n\n1. Scan copy of RTI replies received from TSEC and TSTS on pilot project conducted in Kompally ([**Link**](https://drive.google.com/file/d/1jq0WHJnUlu2YZCjqNJaxgGdl2_O3yZDo/view))\n2. Scan copy of RTI reply received from TSEC and TSTS on project conducted for verification of pensioners ([**Link**](https://drive.google.com/file/d/1_pb8lEqf8gdq2LTisYBPovq-pCvDKDZB/view))\n3. Introduction to Facial Recognition Projects in India ([**link**](https://internetfreedom.in/facial-recognition-in-india-part-i/))\n4. Problems with Facial Recognition Technology Operating in a Legal Vacuum ([**link**](https://internetfreedom.in/problems-with-facial-recognition-systems-operating-in-a-legal-vacuum/))\n5. Lessons from the International Debate on Facial Recognition ([**link**](https://internetfreedom.in/lessons-from-the-international-debate-on-facial-recognition/))  \n\n\n*(This post has been authored by Anushka Jain, a legal fellow at IFF, and reviewed by IFF staffer, Sidharth)*\n\n**Want to stop the Government from creating a panopticon? Kick start the conversation with our community on IFF’s new forum at** [**forum.internetfreedom.in**](https://forum.internetfreedom.in/)**.** \n\n**Help IFF #saveourprivacy by** [**becoming a member today**](https://internetfreedom.in/donate/)**!**",
    "flair": "Policy/Economy",
    "score": 90,
    "num_comments": 0,
    "created_utc": 1584438243,
    "convurl": "https://b.thumbs.redditmedia.com/Lx9x3yd1OY4shMdf6LKHdn1wOUQWKzW6i7MxRDNpdFI.jpg",
    "comments": [],
    "cleaned_text": "illegal use facial recognition voter verification telangana ampxb tldr iff filed rti requests telangana state election commission tsec telangana state technology services tsts pursuant use facial recognition technology frt voter verification urban local body elections kompally received multiple replies authorities detailing use technology blogpost summarize replies highlight problems arise result projects emblematic need three year moratorium use frt india comprehensive public consultation undertaken projectpanoptic facialrecognition background tsec released circularhttpstsecgovinpdfulbsmpltscircularscirnotseculbsdatedpdf stated would run pilot project urban body elections kompally project pollings stations use facial recognition technology verifyauthenticate identity voters bid counter voter impersonation according circular technology developed supplied tsts alerted possible constitutional risks iff filed multiple rtis january february respectively rtis filed state election commission tsts learn specifics project legal basis project details expenditure state safeguards protect peoples constitutional rights questions asked rti request sought details following facets legislation authorities using facial recognition technology whether standard operating procedure pilot project details regarding results pilot projects tsts including error rate bugs reported total expenditure state pilot project iff filed additional rti requests tsec tsts asked project report questioned accuracy technology also asked whether future use technology planned replies received received multiple replies authorities reply dated tsec states authorised article za constitution india use frt article za constitution states state election commission charge matters related conduct elections municipalities however sufficient basis frt use voter verification frt projects implemented india legal vacuum violates decision puttaswamy vs uoi states certain standards met order justify intrusion state right privacy standards legality existence law b legitimate goalstate aim c proportionality objects means adopted achieve procedural guarantees check abuse state interference also sent copy letter details standard operating procedure project according sop tsts sent officials selected polling stations kompally assist implementing pilot project identification authentication carried mobile app contained technology tsts ensured data deleted statistics collected pooling process used purpose total expenditure incurred rs per polling station pilot project carried polling stations thus total expenditure rs ie one lakh two thousand rupees reply dated tsec says decision taken future use frt also included letter tsts dated provides result project including accuracy rates frt average accuracy rate accuracy rate satisfactory exclusion result nonverification would lead loss rights case right vote also stated letter low results polling stations due bad lighting network issues also stated data including photos deleted servers reply dated tsts provided information previous use frt authentication pensioners accuracy rate bugs reported iffs recommendation use experimental facial recognition systems telangana illegal proof without strong privacy protections systems likely lead erosion peoples rights iff called year moratorium use central state governments meantime suggest comprehensive public consultation use technologies informed international debate topic balance technological advancement peoples civil liberties important documents scan copy rti replies received tsec tsts pilot project conducted kompally linkhttpsdrivegooglecomfiledjqwhjnuluyzcjqnjaxggdloyzdoview scan copy rti reply received tsec tsts project conducted verification pensioners linkhttpsdrivegooglecomfiledpbleqfgdqltisybpovqpcvdkdzbview introduction facial recognition projects india linkhttpsinternetfreedominfacialrecognitioninindiaparti problems facial recognition technology operating legal vacuum linkhttpsinternetfreedominproblemswithfacialrecognitionsystemsoperatinginalegalvacuum lessons international debate facial recognition linkhttpsinternetfreedominlessonsfromtheinternationaldebateonfacialrecognition post authored anushka jain legal fellow iff reviewed iff staffer sidharth want stop government creating panopticon kick start conversation community iffs new forum foruminternetfreedominhttpsforuminternetfreedomin help iff saveourprivacy becoming member todayhttpsinternetfreedomindonate ",
    "cleaned_title": "illegal use facial recognition voter verification telangana",
    "cleaned_selftext": "ampxb tldr iff filed rti requests telangana state election commission tsec telangana state technology services tsts pursuant use facial recognition technology frt voter verification urban local body elections kompally received multiple replies authorities detailing use technology blogpost summarize replies highlight problems arise result projects emblematic need three year moratorium use frt india comprehensive public consultation undertaken projectpanoptic facialrecognition background tsec released circularhttpstsecgovinpdfulbsmpltscircularscirnotseculbsdatedpdf stated would run pilot project urban body elections kompally project pollings stations use facial recognition technology verifyauthenticate identity voters bid counter voter impersonation according circular technology developed supplied tsts alerted possible constitutional risks iff filed multiple rtis january february respectively rtis filed state election commission tsts learn specifics project legal basis project details expenditure state safeguards protect peoples constitutional rights questions asked rti request sought details following facets legislation authorities using facial recognition technology whether standard operating procedure pilot project details regarding results pilot projects tsts including error rate bugs reported total expenditure state pilot project iff filed additional rti requests tsec tsts asked project report questioned accuracy technology also asked whether future use technology planned replies received received multiple replies authorities reply dated tsec states authorised article za constitution india use frt article za constitution states state election commission charge matters related conduct elections municipalities however sufficient basis frt use voter verification frt projects implemented india legal vacuum violates decision puttaswamy vs uoi states certain standards met order justify intrusion state right privacy standards legality existence law b legitimate goalstate aim c proportionality objects means adopted achieve procedural guarantees check abuse state interference also sent copy letter details standard operating procedure project according sop tsts sent officials selected polling stations kompally assist implementing pilot project identification authentication carried mobile app contained technology tsts ensured data deleted statistics collected pooling process used purpose total expenditure incurred rs per polling station pilot project carried polling stations thus total expenditure rs ie one lakh two thousand rupees reply dated tsec says decision taken future use frt also included letter tsts dated provides result project including accuracy rates frt average accuracy rate accuracy rate satisfactory exclusion result nonverification would lead loss rights case right vote also stated letter low results polling stations due bad lighting network issues also stated data including photos deleted servers reply dated tsts provided information previous use frt authentication pensioners accuracy rate bugs reported iffs recommendation use experimental facial recognition systems telangana illegal proof without strong privacy protections systems likely lead erosion peoples rights iff called year moratorium use central state governments meantime suggest comprehensive public consultation use technologies informed international debate topic balance technological advancement peoples civil liberties important documents scan copy rti replies received tsec tsts pilot project conducted kompally linkhttpsdrivegooglecomfiledjqwhjnuluyzcjqnjaxggdloyzdoview scan copy rti reply received tsec tsts project conducted verification pensioners linkhttpsdrivegooglecomfiledpbleqfgdqltisybpovqpcvdkdzbview introduction facial recognition projects india linkhttpsinternetfreedominfacialrecognitioninindiaparti problems facial recognition technology operating legal vacuum linkhttpsinternetfreedominproblemswithfacialrecognitionsystemsoperatinginalegalvacuum lessons international debate facial recognition linkhttpsinternetfreedominlessonsfromtheinternationaldebateonfacialrecognition post authored anushka jain legal fellow iff reviewed iff staffer sidharth want stop government creating panopticon kick start conversation community iffs new forum foruminternetfreedominhttpsforuminternetfreedomin help iff saveourprivacy becoming member todayhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Illegal use of Facial Recognition for Voter Verification in Telangana",
    "light_cleaned_selftext": "**Tl;dr** IFF filed RTI requests with the Telangana State Election Commission (TSEC) and Telangana State Technology Services (TSTS) pursuant to the use of Facial Recognition Technology (FRT) for voter verification in the urban local body elections in Kompally on 22.1.2020. We have received multiple replies from both authorities detailing their use of the technology. In this blogpost, we summarize those replies and highlight problems which arise as a result. Such projects are emblematic of the need for a three year moratorium on the use of FRT in India during which comprehensive public consultation should be undertaken. \\#ProjectPanoptic #facialrecognition **Background** On 18.1.2020, TSEC released a [**circular**](https://tsec.gov.in/pdf/ULBS_MPLTS/circulars/2020/Cir_No_111_TSEC-ULBs_2020_dated_18.01.2020_1401.pdf) which stated that they would run a pilot project during the urban body elections in Kompally. In this project, 10 pollings stations will use facial recognition technology to verify/authenticate the identity of voters in a bid to counter voter impersonation. According to the circular, this technology was developed and supplied t by TSTS. Alerted about possible constitutional risks, IFF filed multiple RTIs on January 24, 2020 and February 05, 2020, respectively. Both RTIs were filed with the state election commission and TSTS to learn more about the specifics of the project, the legal basis for the project, details on expenditure by the state, and safeguards to protect people’s constitutional rights if any. **Questions asked** On 24.1.2020 our RTI request sought details on the following facets: 1. The legislation under which the authorities are using facial recognition technology; 2. Whether there was a standard operating procedure for the pilot project; 3. Details regarding the results of the pilot projects by TSTS including error rate and bugs reported; and 4. The total expenditure by the state on the pilot project. On 5.2.2020, IFF filed additional RTI requests with TSEC and TSTS in which we asked for the project report and questioned the accuracy of the technology. We also asked whether any future use of the technology was planned. **Replies received** We have received multiple replies from both these authorities. 1. In a reply dated 18.2.2020, TSEC states that it is authorised by Article 243-ZA of the Constitution of India to use FRT. Article 243 ZA of the Constitution states that the State Election Commission is in charge of all matters related to the conduct of elections to Municipalities. This, however, is not a sufficient basis for FRT use for voter verification. Such FRT projects are being implemented in India in a legal vacuum. This violates the decision in Puttaswamy vs UOI which states that certain standards have to be met in order to justify intrusion by the State into the right to privacy. These standards are a) legality (existence of a law) b) legitimate goal/state aim c) proportionality between the objects and the means adopted to achieve them, and d) procedural guarantees to check against the abuse of State interference. 2. They also sent a copy of the letter which details the Standard Operating Procedure of the project. According to the SOP, TSTS sent its officials to the selected polling stations in Kompally to assist in implementing the pilot project. Identification and authentication was carried out through a mobile app which contained the technology. TSTS ensured that all data will be deleted once the statistics are collected for the pooling process and will not be used for any other purpose. 3. The total expenditure incurred was Rs. 10,200 per polling station. The pilot project was carried out in 10 polling stations. Thus, the total expenditure is Rs. 1,02,000, i.e., one lakh and two thousand rupees. 4. In a reply dated 27.02.2020, the TSEC says that no decision has been taken about the future use of FRT. Also included was a letter from TSTS dated 4.2.2020 which provides the result of the project including the accuracy rates of the FRT. The average accuracy rate was 78%. A 78% accuracy rate is not satisfactory. This is because exclusion as a result of non-verification would lead to a loss of rights. In this case, the right to vote. 5. It was also stated in the letter that low results in some polling stations were due to bad lighting and network issues. It was also stated that all the data including the photos were deleted from the servers. 6. In a reply dated 11.3.2020, the TSTS provided information about their previous use of FRT for authentication of **pensioners**. The accuracy rate was 94% and no bugs were reported. **IFF’s recommendation** The use of such experimental facial recognition systems in Telangana is illegal. It is further proof that without strong privacy protections, such systems are likely lead to the erosion of people’s rights. IFF has called for a **3 year moratorium** on such use by central and state governments. In the meantime, we suggest a comprehensive public consultation on the use of such technologies informed by international debate on the topic, which can balance technological advancement with people’s civil liberties. **Important Documents** 1. Scan copy of RTI replies received from TSEC and TSTS on pilot project conducted in Kompally ([**Link**](https://drive.google.com/file/d/1jq0WHJnUlu2YZCjqNJaxgGdl2_O3yZDo/view)) 2. Scan copy of RTI reply received from TSEC and TSTS on project conducted for verification of pensioners ([**Link**](https://drive.google.com/file/d/1_pb8lEqf8gdq2LTisYBPovq-pCvDKDZB/view)) 3. Introduction to Facial Recognition Projects in India ([**link**](https://internetfreedom.in/facial-recognition-in-india-part-i/)) 4. Problems with Facial Recognition Technology Operating in a Legal Vacuum ([**link**](https://internetfreedom.in/problems-with-facial-recognition-systems-operating-in-a-legal-vacuum/)) 5. Lessons from the International Debate on Facial Recognition ([**link**](https://internetfreedom.in/lessons-from-the-international-debate-on-facial-recognition/)) *(This post has been authored by Anushka Jain, a legal fellow at IFF, and reviewed by IFF staffer, Sidharth)* **Want to stop the Government from creating a panopticon? Kick start the conversation with our community on IFF’s new forum at** [**forum.internetfreedom.in**](https://forum.internetfreedom.in/)**.** **Help IFF #saveourprivacy by** [**becoming a member today**](https://internetfreedom.in/donate/)**!**",
    "light_cleaned_comments": ""
}