{
    "id": "15l67oy",
    "title": "Manipur Lokayukta Finds IAS Officer Guilty of Syphoning Off Money in Case The Wire Had Exposed",
    "url": "https://m.thewire.in/article/government/manipur-lokayukta-finds-ias-officer-guilty-of-siphoning-off-money-in-case-the-wire-had-exposed/amp",
    "selftext": "The state Lokayukta has found that the then Tamenglong district deputy commissioner Armstrong Pame IAS along with others syphoned off money. Pame had shot to fame in 2012 when he raised Rs 40 lakh via Facebook to build a 100-km road in Tamenglong.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 20,
    "created_utc": 1691465234.0,
    "convurl": "https://external-preview.redd.it/h-wb-TYADj7DTc1vJmNchIKpz8Z7xp3yqW0OdQ2QI0o.jpg?auto=webp&s=e42ecfc23236e8592c1c1802e964f0dd2bfeb359",
    "comments": [
        "IAS officers.. such a sorry state of affairs.",
        "Yet another civil servant pilfering the public.",
        "Isn’t he the IAS officer who said he used to stay and study in a 1 room house with 2-3 others because he was so poor?\n\nI’m told by his tribal people that he now owns a 20 bedroom bungalow in his home town, Tamenglong and his family members also owns bungalows in Tamenglong and in Imphal too!!\n\nWe now know where he’s getting the money from!! Just tip of the iceberg.",
        "IAS= I Also Scam \n\nEntire IAS cadre should be disbanded. Let people rise from lower levels of BDO and tahsildars to higher levels like DM collector Commissioners. These 25-30yr guys with little to no experience in Public administration getting too much power are useless. They just use their power to get rich.",
        "Looks like the whole bureaucracy and government is exploiting Manipur",
        "IAS/IPS are one the most corrupt bunch of people in this country",
        "Sir I want to work for the Society 🤡",
        "Agreed. Also, people who come from lower levels have connections with the people and can get work done.\n\nBut the reason why this is not done is because the local mlas are scared that this would make the bdos very powerful.",
        "Interviewer: Why do you want to join the civil services?\n\nCandidate: I want to work for the betterment of poor Indians.",
        "Idk. I have heard of honest IAS too. Young people are more idealistic than some 50yo who has been through enough shit to decide money is everything.",
        "20 bedroom bungalow. Damn… I should have tried UPSC too. It’s sad that his earlier interviews were all sob stories about how poor he was!!",
        "Interesting idea though but not sure how it can be implemented.\n\nI heard Modi govt is trying to rob in senior CEOs etc too but not sure how that would be any better!",
        "Poor Indians: LOL",
        "Tell me about it. Rs 36 crores siphoned off by 1 single IAS officer who portrays himself to be a saint in social media and local newspapers!!\n\nThis same IAS officer was interviewed by the likes of Amitabh Bachchan! Crazy.",
        "Senior experienced professionals from private field will replace babus in joint secretary and above posts. Usually secretaries handle ministries like fisheries,defence,finance,education etc etc. So someone who has spend his career in education sector or finance sector will have indepth knowledge than an IAS in same position. \n\nAbout my idea. \nUsually Block development officers,Tahsildars etc are posts given to state PCS officers. These officers retire as Collectors. Meanwhile IAS officers directly get recruited as Assistant collectors. So a person who has seen ground reality and knows people problem as BDO will handle situation better than an IAS with 0 experience.",
        "Candidate (whispering to himself): the poor Indian being me.",
        "They need that return on investment",
        "Sadly, that’s how every one of these officers become minus a handful.",
        "Very poor Indian indeed!!",
        "No one likes a goody 2 shoes, especially if you make us look bad."
    ],
    "cleaned_text": "manipur lokayukta finds ias officer guilty syphoning money case wire exposed state lokayukta found tamenglong district deputy commissioner armstrong pame ias along others syphoned money pame shot fame raised rs lakh via facebook build km road tamenglong ",
    "cleaned_title": "manipur lokayukta finds ias officer guilty syphoning money case wire exposed",
    "cleaned_selftext": "state lokayukta found tamenglong district deputy commissioner armstrong pame ias along others syphoned money pame shot fame raised rs lakh via facebook build km road tamenglong",
    "cleaned_comments": "ias officers sorry state affairs yet another civil servant pilfering public isnt ias officer said used stay study room house others poor im told tribal people owns bedroom bungalow home town tamenglong family members also owns bungalows tamenglong imphal know hes getting money tip iceberg ias also scam entire ias cadre disbanded let people rise lower levels bdo tahsildars higher levels like dm collector commissioners yr guys little experience public administration getting much power useless use power get rich looks like whole bureaucracy government exploiting manipur iasips one corrupt bunch people country sir want work society agreed also people come lower levels connections people get work done reason done local mlas scared would make bdos powerful interviewer want join civil services candidate want work betterment poor indians idk heard honest ias young people idealistic yo enough shit decide money everything bedroom bungalow damn tried upsc sad earlier interviews sob stories poor interesting idea though sure implemented heard modi govt trying rob senior ceos etc sure would better poor indians lol tell rs crores siphoned single ias officer portrays saint social media local newspapers ias officer interviewed likes amitabh bachchan crazy senior experienced professionals private field replace babus joint secretary posts usually secretaries handle ministries like fisheriesdefencefinanceeducation etc etc someone spend career education sector finance sector indepth knowledge ias position idea usually block development officerstahsildars etc posts given state pcs officers officers retire collectors meanwhile ias officers directly get recruited assistant collectors person seen ground reality knows people problem bdo handle situation better ias experience candidate whispering poor indian need return investment sadly thats every one officers become minus handful poor indian indeed one likes goody shoes especially make us look bad",
    "light_cleaned_title": "Manipur Lokayukta Finds IAS Officer Guilty of Syphoning Off Money in Case The Wire Had Exposed",
    "light_cleaned_selftext": "The state Lokayukta has found that the then Tamenglong district deputy commissioner Armstrong Pame IAS along with others syphoned off money. Pame had shot to fame in 2012 when he raised Rs 40 lakh via Facebook to build a 100-km road in Tamenglong.",
    "light_cleaned_comments": "IAS officers.. such a sorry state of affairs. Yet another civil servant pilfering the public. Isn’t he the IAS officer who said he used to stay and study in a 1 room house with 2-3 others because he was so poor? I’m told by his tribal people that he now owns a 20 bedroom bungalow in his home town, Tamenglong and his family members also owns bungalows in Tamenglong and in Imphal too!! We now know where he’s getting the money from!! Just tip of the iceberg. IAS= I Also Scam Entire IAS cadre should be disbanded. Let people rise from lower levels of BDO and tahsildars to higher levels like DM collector Commissioners. These 25-30yr guys with little to no experience in Public administration getting too much power are useless. They just use their power to get rich. Looks like the whole bureaucracy and government is exploiting Manipur IAS/IPS are one the most corrupt bunch of people in this country Sir I want to work for the Society 🤡 Agreed. Also, people who come from lower levels have connections with the people and can get work done. But the reason why this is not done is because the local mlas are scared that this would make the bdos very powerful. Interviewer: Why do you want to join the civil services? Candidate: I want to work for the betterment of poor Indians. Idk. I have heard of honest IAS too. Young people are more idealistic than some 50yo who has been through enough shit to decide money is everything. 20 bedroom bungalow. Damn… I should have tried UPSC too. It’s sad that his earlier interviews were all sob stories about how poor he was!! Interesting idea though but not sure how it can be implemented. I heard Modi govt is trying to rob in senior CEOs etc too but not sure how that would be any better! Poor Indians: LOL Tell me about it. Rs 36 crores siphoned off by 1 single IAS officer who portrays himself to be a saint in social media and local newspapers!! This same IAS officer was interviewed by the likes of Amitabh Bachchan! Crazy. Senior experienced professionals from private field will replace babus in joint secretary and above posts. Usually secretaries handle ministries like fisheries,defence,finance,education etc etc. So someone who has spend his career in education sector or finance sector will have indepth knowledge than an IAS in same position. About my idea. Usually Block development officers,Tahsildars etc are posts given to state PCS officers. These officers retire as Collectors. Meanwhile IAS officers directly get recruited as Assistant collectors. So a person who has seen ground reality and knows people problem as BDO will handle situation better than an IAS with 0 experience. Candidate (whispering to himself): the poor Indian being me. They need that return on investment Sadly, that’s how every one of these officers become minus a handful. Very poor Indian indeed!! No one likes a goody 2 shoes, especially if you make us look bad."
}