{
    "id": "16735z4",
    "title": "Flipkart sent me a used Mobile phone with defects and is refusing to replace it.",
    "url": "https://www.reddit.com/r/india/comments/16735z4/flipkart_sent_me_a_used_mobile_phone_with_defects/",
    "selftext": "My dad purchased a Samsung Galaxy S22 Ultra from Flipkart, which got delivered (open-box delivery) on 29-Aug-2023. It was damaged (power button not working). The delivery agent only made sure the phone was there in the packaging and left. Almost immediately, we noticed the power button wasn't working. I spoke to Flipkart. They said they can't replace it because it was an open-box delivery. I took it to a Samsung service center, and they informed me that the product was activated more than a month before I purchased it (17-July). Samsung further informed me that they couldn't do anything about it because it was outside their 14-day replacement window.\nFlipkart sent me a used product with multiple defects. I am unable to request a return because of open box delivery. What are my options here? I tried tweeting it by creating a new X (Twitter) account just for this, but the tweet barely has any engagements.\nI also have an image from the Samsung service center showing date of activation was more than a month ago.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693563349.0,
    "convurl": "https://external-preview.redd.it/lDsXUyy37Lg0zp6JsldyU-JimEtIjfjb2L8rvTk1Soc.jpg",
    "comments": [
        "In an open box delivery,  can't we switch on the phone and check? Curious 🤔",
        "Can you please link the tweet in the post so we could like it and bring it up.",
        "Write another tweet with your date and info of purchase from Flipkart, and this activation picture that has been sent to you by Samsung and shame Flipkart for the discrepancy and for sending you a used product.",
        "was the box sealed?",
        "You made a mistake buying it from flip",
        "Why do people still buy from Flipkart?",
        "They are taking risk but everyone likes discounts",
        "Are the discounts really that much better than Amazon's?",
        "Depend on few handsets and credit card. It's keep changing",
        "I'd like to know too. What tests can a user perform on a new device to check its authenticity before sharing the OTP?",
        "I would rather pay more than order from Flipkart.",
        "This is why I would never touch Flipkart with a 10-foot pole. Haven't bought anything from Flipkart in ages and I'll never do again. Amazon is clearly better. Had a terrible experience the last time that I did. Bought a Bose Soundbar 600 from there since it was a bit cheaper than Amazon (got it for 35k iirc) and mfs sent a defective product. Had to make endless calls to them to no avail and had to listen to the shittiest excuses a customer care rep could make.    \n\n\nWhat eventually worked for me was, I called them up for the umpteenth time and instead of pleading to please return/replace it, I threatened that if Flipkart does not give a solution to this, I'll have to approach the Consumer Court (I was actually serious about it). They replaced the defective unit with a new one within 2 days. The soundbar still works like a charm, 3 years on.   \n\n\nTry this OP, this might work. Goodluck, hope you get the phone replaced.",
        "Some delivery people are just too busy. They just open the box and check if the product is there, click a pic and then give it to us and they are gone. \nThere are rarely any delivery boys who actually warns us and wait for us to check everything.",
        "Never buy from Flipkart. Lots of scamming going on apparently",
        "Welp this is it not buying phone from Flipkart, way too many post makes me scared to purchase mobile online. Will definitely go for offline store now.",
        "You don't give OTP to the delivery until you check the product.",
        "Primarily check for physical damage. Can't really check for working for most things (like computer parts etc). Only give otp if you are convinced the product is what you ordered",
        "So couple of months ago when I was planning to buy a phone for my mum, I did look at flipkart. But the whole OBD process seemed ridiculous as it would have stressed out my mum.\n\nLooking at the policy of OBD:\n> Open Box Delivery Terms and Conditions for Open Box Delivery\n> The Open Box Delivery is a service offered by the delivery partner of Flipkart Internet Private Limited wherein the product packaging (primary as well as secondary) is physically opened in front of the customer at the time of delivery. This facility enables the customers to verify/inspect the product before accepting for delivery. In the case of product missing, wrong product received, damage, or an accessory missing, the customer can reject the product at the doorstep, and a refund will be initiated.\n> Please note: in such cases, customers need to place the fresh order. Replacement flow is not available at this moment.\n> \n> This option for OBD is available on select products, at select locations and to select customers only.\n> \n> At the Checkout order Summary page the customer will know whether for any of their chosen product items, OBD is available or not.\n> \n> The OBD is available both for Cash on Delivery (COD)and Prepaid orders. If the customer opts for COD, then card of delivery and digital payments like UPI, etc will not be available at the doorstep and Contactless payment flow will also not be available for OBD orders in the current version of the program.\n> \n> After Placing Order, the customer will receive the OTP when the product is out for delivery. Customers will receive OTP in SMS as well as they can see this in their order details page.\n> \n> At the time of delivery, the customer or the recipient of the product needs to share the last four-digit number of delivery phone number or primary account phone number with the Delivery executive to initiate the OBD process. If the customer opted for COD, then they need to do the payment first and then OBD process will be initiated by the delivery executive\n> \n> The Customer will then inspect the ordered product in presence of the delivery executive, if the received order is the same as what they ordered for and if the product is in good condition and not damaged.\n> \n> Post the verification, customers shall be required to share the OTP with the delivery executive to acknowledge the confirmation that he/she has inspected the product before getting it delivered.\n> \n> In the event if the ordered product is not intact, damaged or it is the wrong product. The product must be handed over to the delivery executive which shall be returned, and the refund will be initiated immediately. In case of Cash on delivery, cash will be refunded immediately by the delivery executive. In the case of prepaid, the money will be credited within two business days.\n> \n> In the event the product is damaged, the customer should decline the shipment.\n> \n\nAll this seemed a way for flipkart to either perpetrate scam (or let the sellers do it) or completely pass any risk towards customer by making the process too stressful.\n\nIn the end, I purchased the phone via Amazon which seems to have better customer care service and using tools like fakespot, reviewmeta, I can make a marginally better call if I should order a particular product from a particular seller.",
        "Open box delivery means you can check the phone in front of the delivery person and not accept in case of any defects or if it's a dicey product.",
        "These (expensive product - say above ₹25,000) deliveries should be done in a similar manner as TVs are delivered. \n\nFor most TVs, the TV is delivered in the packaging and the user/buyer is not allowed to unbox the TV himself. An installation guy is sent via the company to unbox and install the TV. In case of any issue, it becomes easier to replace the TV.",
        "Isn't that a pressure tactic to not let the buyer inspect the product properly? The delivery agents are supposed to provide the service and hence are supposed to wait until the buyer properly inspects the product and is ready to share the OTP.",
        "My cousin bought a google pixel 6A from Flipkart in December 2022. He invited the delivery guy inside and asked him to sit for OBD. Then he proceeded to tie his German shepherd at the main gate and told him to guard. Then he proceeded with OBD and made sure that the delivery guy couldn’t leave until he had opened the phone, set it up fully and downloaded a diagnostic tool to check the functioning of the phone. And only after this did he give the OTP.\n\nNever seen a guy sweat so much in the winter but at least my cousin wasn’t scammed into a used or dysfunctional phone.",
        "Are you sure the seller from which you bought the phone is genuine seller.",
        "Who was the seller? Did you check the seller before purchasing, new 3rd party sellers are doing scams.",
        "Avoid flipkart",
        "Always use credit card for big purchases. And always dispute the transaction if something goes wrong. \n\nFor best disputes resolution, Amex is 👑",
        "Never order anything from Flopkart. They scammed me for a small juicer order back in 2016 or so. Since then its been on my shitlist. Meanwhile I have ordered thousands of items from Amazon including TV, fridge, laptops etc without any issues\n\nEven though, Amazon too is becoming scammy these days by not having easy returns anymore. But its still much better than Flopkart",
        "Address your concern to : grievance.officer@flipkart.com\n\nIf the Flipkart Grievance Officer refuses to assist then raise a complaint on National Consumer Helpline.\n\nAlso, if you paid through credit/debit card (or) net banking, then you can raise a dispute (chargeback) through your bank.",
        "There is no such easy dispute process in India, AFAIK. Even if you dispute an actual order like this, it goes through bank verification and both parties have to justify to the bank. Flipkart will claim they sent the product, user received it and the bank can side with them as the transaction is considered legitimate. Ive seen disputes that werent successful even though the customer had a legitimate grievance \n\nIf its an unauthorized charge on your card, then yes you can dispute it and this is handled differently, it goes through RBI fraud system and of course the seller wont be able to verify the transaction\n\nIn USA there is a different dispute process for all transactions.",
        "I remember how flipkart was the one that opened up the indian customers to buy online. We started by ordering books.",
        "Another day, another day story about Flipkart. People will never learn.",
        "Follow @_Indian_page_ for indian content. It's the first page for people of india. Jai hind 🇮🇳",
        "IIRC, the bill is supposed to have IMEI mentioned. Does that match with your device? \n\nIf so, there is the proof that flipkart cheated you, considering that Samsung confirmed the device was activated a month before. Either threaten them or actually go to police with that info.",
        "I’ve had 2 disputes settled by Amex. 1 dispute to Nike for damaged product & 1 dispute to Amazon for sending me a refurbished phone. I explained my situation to the card provider with proof, got my money back in 15 days. \n\nI’ve had 1 dispute settled by Kotak Mahindra. Disputed a transaction I made on Amazon, they delivered a Chinese product in place of an Apple Watch. Again, I had all on video and proof. \n\nGot my money back in 30 days. \n\nIt’s your hard earned money, you should fight for it till the end.",
        "Looks like Flipkart had already replied to the tweet?",
        "I wanted to buy nothing phone 2 but just because its only available I scrapped it and bought a oneplus 11r from amazon. Flipkart has worst customer support l.",
        "Call consumer helpline and state your issues\n\nMost probably flipkart will sove the issue but if they dont then approach consumer court",
        "Why do you guys still order from Flipkart? I am just surprised how so many people are getting scammed every other day.",
        "huh? don't give OTP unless you checked the product thoroughly. i understand couriers are busy but for high cost purchase , its better to be safe than sorry \n\nmy dad bought a phone and it arrived and delivery guy was like , opened box , showed phone and was like OTP OTP. my dad was about to give him when i asked the guy to switch on the phone. he gave a look , hurriedly switched on the phone and it didn't turn on 🤡 he said saar keep charging and it'll turn on. i said nope, take it back",
        "The popup box that appears right before payment mentions there won't be any returns once OTP given. That dumb shit has removed whatever goodwill I have had for flipkart. It should be illegal to deny returns when not even 1-2hours is enough to confirm a product is working correctly or not. I just browse FK and if I see OBD I instantly close the site and look for other sources. FK could give me 99% discount on something and I still wouldn't buy it through OBD",
        "> All this seemed like a way for flipkart to either perpetrate scam (or let the sellers do it) or completely pass any risk towards customer by making the process too stressful.\n\nWell, for all  marketplace wants is to pass on the risk from seller to buyer. They are mostly for delivery. The expectation is bad seller will be caught in deliveries only. At the end, flipkart and every  other marketplace wants to be profitable, so they want to reduce their risk. Amazon can run for years on loses in India because AWS exists which will always keep it profitable. Walmart on the other hand, wants to sell Flipkart shares as soon as possible and that requires good financial statements.",
        "True but amazon did it for the world",
        "Wasn't the box sealed? If it wasn't sealed why give OTP?",
        "Did amazon and Nile ban/restrict your account afterwards?",
        "Never order anything from Flipkart. The risk of being the next horror story isn't worth any discount.",
        "At this point if you order expensive electronics from flipkart you have to assume this will happen.\n\nThey just don't care Enough at the QC and their customer care is pretty much bots and humans a bit worse than bots.",
        "I mean if only they just used a little bit of thier brain to you know just check the product before giving otp.",
        "Nah mate you just have to check the product carefully before giving the otp. It's just that most people hurriedly give otp sometimes without even turning on the device.",
        "just stop buying shit from Flipkart. Its as simple as that",
        "Full sapot for avar Indian companies saar",
        "Never buy again from Flipkart.",
        "Taking notes",
        "I have fucking deleted the app. They are shady as fuck ! I ordered a laptop that I needed to put to work urgently. It came with a dead battery. It will work only on constant power supply. The replacement came with the EXACT same issue. And no, it WASN'T the same one. Because the exchange happened along with the new delivery. I did scream my lungs out on the customer care but that was just because of the delay in my work. Thankfully didn't have to worry about the refund. They readily did it.",
        "TBH your cousin sounds like an asshole. Harassing a delivery guy who is just trying to get his ends meet to feel superior, elite and clever.",
        "Bhai consumer court jaa samsung se written mee leke \n\nBss phir kya gand lele unki \n\nAfter some time they will agree to replace but harrasment tension bla bla dalke unse \n\nMobile exchange+compensation +lawyer and cout fees",
        "file a complaint in the consumer forum and file a case in consumer court",
        "Where there are scam happening left right and center it is better to be cautious. German shepherd on gate seems a little extra but asking the guy to open and setup the phone is literally written in the delivery instructions for OBD.",
        "People still buy from Flipkart?",
        "Flipkart for s22 ultra big mistake\nOpenbox delivery but you shared otp without checking everything .If he didn't allow you to inspect then dont share it end of story . insanely big mistake.\n\nThere is atleast 100+ posts every week about someone getting fked over by flipkart , 1000s of consumer complaints . \nMay be make a thread for this instead . \nFLIPKART IS A SCAM EXCEPT IN THIS SCAM YOU GO TO THE SCAMMER WILLINGLY. \n\nAnyways retweeting it so you get some support.",
        "I dont understand why people buy expensive products through online shopping (especially from flipkart). Buying a phone is an important process because you would use that device for years. Why would anyone risk buying an expensive item online. With all these recent posts about flipkart being unreliable, why dont they just go and buy the phone physically?",
        "Buying something from flipkart is crazy low iq move",
        "Never use Flipkart.",
        "Who buys from Flipkart? It’s 2023 FFS!",
        "Was the phone box sealed? If no then why didn't you tell the delivery guy, if it was sealed then it's not a used phone just a defective one",
        "That's why i prefer offline purchase even if they cost more online shopping became headache even delivery boys never delivered on my adress i have to go in their shop",
        "It's owned by Walmart.",
        "I ordered some hybrid seeds from Flipkart, bc sabja  ka packet bheja unhone",
        "The thing is that Flipkart delivery guys don’t wait if you ask nicely, and due to OBD Flipkart shifts the entire blame on the customer if the device is faulty. It’s not like he was rude or harassing, he just made sure that OBD was completed properly. As you can probably see in the comments of this Post, the delivery guys literally just open the box to a point where the product is visible, take a photo and leave because most people have already given the OTP. \n\nNobody wants to do these kinds of things, but if the platform’s actions and policies are scam friendly why shouldn’t the buyer ensure that his purchase is secure and safe.\n\nHe doesn’t do this sort of thing to Amazon delivery guys or even Flipkart when order value is low and there’s no OBD because then all you need is a video of the product being unboxed from the sealed package and your proof is solid. I feel OBD delivery agents are trained to do things so quickly and and in such a manner that the customer isn’t able to say anything by the time they’ve opened the package and taken the photo.",
        "ah shit here we go again",
        "Huh very true about Amazon. They have not yet picked up 2 of my orders citing return verification failed for multiple attempts.",
        "Even if they do, you can make a new account.",
        "what was the final  price that made you buy it from flipkart",
        "I had plans for buying a new phone in BBD sale but I guess I'll just buy it from offline stores now",
        "Gotta implement today",
        "> He doesn’t do this sort of thing to Amazon delivery guys\n\nI personally know many people exactly like your cousin. For them, delivery guys, waiters, and maids are not human. They feel proud of harassing and abusing these 'non-human' service workers.",
        "For costly purchases it is entirely Flipkart being the dick to shirk off any responsibility using OBD. Why should consumer only get to spend minimal time to check. It is even worse when people are working from home and in a call and this urgency to check needs to happen with the delivery. The delivery executive may not deserve it but it's Flipkart who caused this whole thing. Flipkart should bear the brunt anyways if slower deliveries become the norm from this",
        "Samsung flagship devices tbf are entirely filled with scams within the first month of release, on both Flipkart and Amazon. The devices are all imported, refurbished or stolen with scratches and bugs described by OP. Idk why i see this mostly with Samsung. Buying from Samsung store is better not exactly foolproof either.",
        "Flipkart doesn't even let you set delivery dates like amazon. They'll randomly come late or early and then your meetinga and other responsibilities will prevent you from checking thoroughly",
        "So you suppose it would be better if Flipkart sent delivery guys that are specially trained to reduce the exchange value of the products, and further pressure customers into giving OTP without fulfilling the actual OBD. \n\nJust so you know, there is a big verandah between the main gate and where the living room is. I was there, my cousin politely invited the guy inside to sit in the living room. Offered tea and biscuits and politely completed the OBD. \n\nThe delivery people get nervous because they know the scams that Flipkart and sellers are perpetrating, sometimes even the delivery guys scam the customers by not completing returns. No one is being disrespectful but it’s normal to safeguard yourself before thinking of others. \n\nI know you think you are trying to respect everyone but you’ll understand once you are scammed. We’ve had these scams occur in front of us so we know how painstaking it is to try and get a refund and even then it seldom works.",
        "I dont understand how do people continue to by electronics from Flipkart.",
        "Nah mate you can definitely set delivery date times. I have done it twice myself. However the option appears after the product has vein shipped.",
        "Some may not have actually experienced anything as such themselves.\n\nFor Eg: I have already ordered 2 phones and 3 laptops from Flipkart so far and I never faced such issues. And the laptop that I bought was only available on Flipkart at that time. And although I have faced problems for an earphone once, but it was replaced quickly",
        "There is an online Government grievance portal.\nRecord all calls,Click the pics and video of damaged mobile email to them and email to escalation team. Then after collecting all evidence complain on the portal.\nI got my blazer from flipkar back after they maked my replacement as delivered without delivering it after I complained on the portal.",
        "The whole open box delivery is a tactic used by Flipkart to push the onus onto the customer instead of them for delivering a defective product. \n\nProducts, especially electronics can have lot of issues which won’t be apparent to the user within the few minutes they spend with the device. Many issues will only be found in the next 24-48 hours of usage. \n\nAlmost all brick and mortar stores and other portals allow replacement or refund for such products. But with Flipkart the moment you share the otp they wash the product from their hands and now it’s between you and the company and will have to run to the customer care store because you weren’t unable to find a defect in few minutes. \n\nIf a customer receives a product with defect, they should be able to return it within few days, it’s especially more important for online portals. Not offering a minimum return date is anti consumerism.",
        "Seeing this late. They do have the option but they don't stick to  it at  all. I have had more FK deliveries be delivered earlier than what I set and I had to resort to taking leave from office just to receive and check the delivery."
    ],
    "cleaned_text": "flipkart sent used mobile phone defects refusing replace dad purchased samsung galaxy ultra flipkart got delivered openbox delivery aug damaged power button working delivery agent made sure phone packaging left almost immediately noticed power button wasnt working spoke flipkart said cant replace openbox delivery took samsung service center informed product activated month purchased july samsung informed couldnt anything outside day replacement window flipkart sent used product multiple defects unable request return open box delivery options tried tweeting creating new x twitter account tweet barely engagements also image samsung service center showing date activation month ago ",
    "cleaned_title": "flipkart sent used mobile phone defects refusing replace",
    "cleaned_selftext": "dad purchased samsung galaxy ultra flipkart got delivered openbox delivery aug damaged power button working delivery agent made sure phone packaging left almost immediately noticed power button wasnt working spoke flipkart said cant replace openbox delivery took samsung service center informed product activated month purchased july samsung informed couldnt anything outside day replacement window flipkart sent used product multiple defects unable request return open box delivery options tried tweeting creating new x twitter account tweet barely engagements also image samsung service center showing date activation month ago",
    "cleaned_comments": "open box delivery cant switch phone check curious please link tweet post could like bring write another tweet date info purchase flipkart activation picture sent samsung shame flipkart discrepancy sending used product box sealed made mistake buying flip people still buy flipkart taking risk everyone likes discounts discounts really much better amazons depend handsets credit card keep changing id like know tests user perform new device check authenticity sharing otp would rather pay order flipkart would never touch flipkart foot pole havent bought anything flipkart ages ill never amazon clearly better terrible experience last time bought bose soundbar since bit cheaper amazon got k iirc mfs sent defective product make endless calls avail listen shittiest excuses customer care rep could make eventually worked called umpteenth time instead pleading please returnreplace threatened flipkart give solution ill approach consumer court actually serious replaced defective unit new one within days soundbar still works like charm years try op might work goodluck hope get phone replaced delivery people busy open box check product click pic give us gone rarely delivery boys actually warns us wait us check everything never buy flipkart lots scamming going apparently welp buying phone flipkart way many post makes scared purchase mobile online definitely go offline store dont give otp delivery check product primarily check physical damage cant really check working things like computer parts etc give otp convinced product ordered couple months ago planning buy phone mum look flipkart whole obd process seemed ridiculous would stressed mum looking policy obd open box delivery terms conditions open box delivery open box delivery service offered delivery partner flipkart internet private limited wherein product packaging primary well secondary physically opened front customer time delivery facility enables customers verifyinspect product accepting delivery case product missing wrong product received damage accessory missing customer reject product doorstep refund initiated please note cases customers need place fresh order replacement flow available moment option obd available select products select locations select customers checkout order summary page customer know whether chosen product items obd available obd available cash delivery codand prepaid orders customer opts cod card delivery digital payments like upi etc available doorstep contactless payment flow also available obd orders current version program placing order customer receive otp product delivery customers receive otp sms well see order details page time delivery customer recipient product needs share last fourdigit number delivery phone number primary account phone number delivery executive initiate obd process customer opted cod need payment first obd process initiated delivery executive customer inspect ordered product presence delivery executive received order ordered product good condition damaged post verification customers shall required share otp delivery executive acknowledge confirmation heshe inspected product getting delivered event ordered product intact damaged wrong product product must handed delivery executive shall returned refund initiated immediately case cash delivery cash refunded immediately delivery executive case prepaid money credited within two business days event product damaged customer decline shipment seemed way flipkart either perpetrate scam let sellers completely pass risk towards customer making process stressful end purchased phone via amazon seems better customer care service using tools like fakespot reviewmeta make marginally better call order particular product particular seller open box delivery means check phone front delivery person accept case defects dicey product expensive product say deliveries done similar manner tvs delivered tvs tv delivered packaging userbuyer allowed unbox tv installation guy sent via company unbox install tv case issue becomes easier replace tv isnt pressure tactic let buyer inspect product properly delivery agents supposed provide service hence supposed wait buyer properly inspects product ready share otp cousin bought google pixel flipkart december invited delivery guy inside asked sit obd proceeded tie german shepherd main gate told guard proceeded obd made sure delivery guy couldnt leave opened phone set fully downloaded diagnostic tool check functioning phone give otp never seen guy sweat much winter least cousin wasnt scammed used dysfunctional phone sure seller bought phone genuine seller seller check seller purchasing new rd party sellers scams avoid flipkart always use credit card big purchases always dispute transaction something goes wrong best disputes resolution amex never order anything flopkart scammed small juicer order back since shitlist meanwhile ordered thousands items amazon including tv fridge laptops etc without issues even though amazon becoming scammy days easy returns anymore still much better flopkart address concern grievanceofficerflipkartcom flipkart grievance officer refuses assist raise complaint national consumer helpline also paid creditdebit card net banking raise dispute chargeback bank easy dispute process india afaik even dispute actual order like goes bank verification parties justify bank flipkart claim sent product user received bank side transaction considered legitimate ive seen disputes werent successful even though customer legitimate grievance unauthorized charge card yes dispute handled differently goes rbi fraud system course seller wont able verify transaction usa different dispute process transactions remember flipkart one opened indian customers buy online started ordering books another day another day story flipkart people never learn follow indianpage indian content first page people india jai hind iirc bill supposed imei mentioned match device proof flipkart cheated considering samsung confirmed device activated month either threaten actually go police info ive disputes settled amex dispute nike damaged product dispute amazon sending refurbished phone explained situation card provider proof got money back days ive dispute settled kotak mahindra disputed transaction made amazon delivered chinese product place apple watch video proof got money back days hard earned money fight till end looks like flipkart already replied tweet wanted buy nothing phone available scrapped bought oneplus r amazon flipkart worst customer support l call consumer helpline state issues probably flipkart sove issue dont approach consumer court guys still order flipkart surprised many people getting scammed every day huh dont give otp unless checked product thoroughly understand couriers busy high cost purchase better safe sorry dad bought phone arrived delivery guy like opened box showed phone like otp otp dad give asked guy switch phone gave look hurriedly switched phone didnt turn said saar keep charging itll turn said nope take back popup box appears right payment mentions wont returns otp given dumb shit removed whatever goodwill flipkart illegal deny returns even hours enough confirm product working correctly browse fk see obd instantly close site look sources fk could give discount something still wouldnt buy obd seemed like way flipkart either perpetrate scam let sellers completely pass risk towards customer making process stressful well marketplace wants pass risk seller buyer mostly delivery expectation bad seller caught deliveries end flipkart every marketplace wants profitable want reduce risk amazon run years loses india aws exists always keep profitable walmart hand wants sell flipkart shares soon possible requires good financial statements true amazon world wasnt box sealed wasnt sealed give otp amazon nile banrestrict account afterwards never order anything flipkart risk next horror story isnt worth discount point order expensive electronics flipkart assume happen dont care enough qc customer care pretty much bots humans bit worse bots mean used little bit thier brain know check product giving otp nah mate check product carefully giving otp people hurriedly give otp sometimes without even turning device stop buying shit flipkart simple full sapot avar indian companies saar never buy flipkart taking notes fucking deleted app shady fuck ordered laptop needed put work urgently came dead battery work constant power supply replacement came exact issue wasnt one exchange happened along new delivery scream lungs customer care delay work thankfully didnt worry refund readily tbh cousin sounds like asshole harassing delivery guy trying get ends meet feel superior elite clever bhai consumer court jaa samsung se written mee leke bss phir kya gand lele unki time agree replace harrasment tension bla bla dalke unse mobile exchangecompensation lawyer cout fees file complaint consumer forum file case consumer court scam happening left right center better cautious german shepherd gate seems little extra asking guy open setup phone literally written delivery instructions obd people still buy flipkart flipkart ultra big mistake openbox delivery shared otp without checking everything didnt allow inspect dont share end story insanely big mistake atleast posts every week someone getting fked flipkart consumer complaints may make thread instead flipkart scam except scam go scammer willingly anyways retweeting get support dont understand people buy expensive products online shopping especially flipkart buying phone important process would use device years would anyone risk buying expensive item online recent posts flipkart unreliable dont go buy phone physically buying something flipkart crazy low iq move never use flipkart buys flipkart ffs phone box sealed didnt tell delivery guy sealed used phone defective one thats prefer offline purchase even cost online shopping became headache even delivery boys never delivered adress go shop owned walmart ordered hybrid seeds flipkart bc sabja ka packet bheja unhone thing flipkart delivery guys dont wait ask nicely due obd flipkart shifts entire blame customer device faulty like rude harassing made sure obd completed properly probably see comments post delivery guys literally open box point product visible take photo leave people already given otp nobody wants kinds things platforms actions policies scam friendly shouldnt buyer ensure purchase secure safe doesnt sort thing amazon delivery guys even flipkart order value low theres obd need video product unboxed sealed package proof solid feel obd delivery agents trained things quickly manner customer isnt able say anything time theyve opened package taken photo ah shit go huh true amazon yet picked orders citing return verification failed multiple attempts even make new account final price made buy flipkart plans buying new phone bbd sale guess ill buy offline stores got ta implement today doesnt sort thing amazon delivery guys personally know many people exactly like cousin delivery guys waiters maids human feel proud harassing abusing nonhuman service workers costly purchases entirely flipkart dick shirk responsibility using obd consumer get spend minimal time check even worse people working home call urgency check needs happen delivery delivery executive may deserve flipkart caused whole thing flipkart bear brunt anyways slower deliveries become norm samsung flagship devices tbf entirely filled scams within first month release flipkart amazon devices imported refurbished stolen scratches bugs described op idk see mostly samsung buying samsung store better exactly foolproof either flipkart doesnt even let set delivery dates like amazon theyll randomly come late early meetinga responsibilities prevent checking thoroughly suppose would better flipkart sent delivery guys specially trained reduce exchange value products pressure customers giving otp without fulfilling actual obd know big verandah main gate living room cousin politely invited guy inside sit living room offered tea biscuits politely completed obd delivery people get nervous know scams flipkart sellers perpetrating sometimes even delivery guys scam customers completing returns one disrespectful normal safeguard thinking others know think trying respect everyone youll understand scammed weve scams occur front us know painstaking try get refund even seldom works dont understand people continue electronics flipkart nah mate definitely set delivery date times done twice however option appears product vein shipped may actually experienced anything eg already ordered phones laptops flipkart far never faced issues laptop bought available flipkart time although faced problems earphone replaced quickly online government grievance portal record callsclick pics video damaged mobile email email escalation team collecting evidence complain portal got blazer flipkar back maked replacement delivered without delivering complained portal whole open box delivery tactic used flipkart push onus onto customer instead delivering defective product products especially electronics lot issues wont apparent user within minutes spend device many issues found next hours usage almost brick mortar stores portals allow replacement refund products flipkart moment share otp wash product hands company run customer care store werent unable find defect minutes customer receives product defect able return within days especially important online portals offering minimum return date anti consumerism seeing late option dont stick fk deliveries delivered earlier set resort taking leave office receive check delivery",
    "light_cleaned_title": "Flipkart sent me a used Mobile phone with defects and is refusing to replace it.",
    "light_cleaned_selftext": "My dad purchased a Samsung Galaxy S22 Ultra from Flipkart, which got delivered (open-box delivery) on 29-Aug-2023. It was damaged (power button not working). The delivery agent only made sure the phone was there in the packaging and left. Almost immediately, we noticed the power button wasn't working. I spoke to Flipkart. They said they can't replace it because it was an open-box delivery. I took it to a Samsung service center, and they informed me that the product was activated more than a month before I purchased it (17-July). Samsung further informed me that they couldn't do anything about it because it was outside their 14-day replacement window. Flipkart sent me a used product with multiple defects. I am unable to request a return because of open box delivery. What are my options here? I tried tweeting it by creating a new X (Twitter) account just for this, but the tweet barely has any engagements. I also have an image from the Samsung service center showing date of activation was more than a month ago.",
    "light_cleaned_comments": "In an open box delivery, can't we switch on the phone and check? Curious 🤔 Can you please link the tweet in the post so we could like it and bring it up. Write another tweet with your date and info of purchase from Flipkart, and this activation picture that has been sent to you by Samsung and shame Flipkart for the discrepancy and for sending you a used product. was the box sealed? You made a mistake buying it from flip Why do people still buy from Flipkart? They are taking risk but everyone likes discounts Are the discounts really that much better than Amazon's? Depend on few handsets and credit card. It's keep changing I'd like to know too. What tests can a user perform on a new device to check its authenticity before sharing the OTP? I would rather pay more than order from Flipkart. This is why I would never touch Flipkart with a 10-foot pole. Haven't bought anything from Flipkart in ages and I'll never do again. Amazon is clearly better. Had a terrible experience the last time that I did. Bought a Bose Soundbar 600 from there since it was a bit cheaper than Amazon (got it for 35k iirc) and mfs sent a defective product. Had to make endless calls to them to no avail and had to listen to the shittiest excuses a customer care rep could make. What eventually worked for me was, I called them up for the umpteenth time and instead of pleading to please return/replace it, I threatened that if Flipkart does not give a solution to this, I'll have to approach the Consumer Court (I was actually serious about it). They replaced the defective unit with a new one within 2 days. The soundbar still works like a charm, 3 years on. Try this OP, this might work. Goodluck, hope you get the phone replaced. Some delivery people are just too busy. They just open the box and check if the product is there, click a pic and then give it to us and they are gone. There are rarely any delivery boys who actually warns us and wait for us to check everything. Never buy from Flipkart. Lots of scamming going on apparently Welp this is it not buying phone from Flipkart, way too many post makes me scared to purchase mobile online. Will definitely go for offline store now. You don't give OTP to the delivery until you check the product. Primarily check for physical damage. Can't really check for working for most things (like computer parts etc). Only give otp if you are convinced the product is what you ordered So couple of months ago when I was planning to buy a phone for my mum, I did look at flipkart. But the whole OBD process seemed ridiculous as it would have stressed out my mum. Looking at the policy of OBD: > Open Box Delivery Terms and Conditions for Open Box Delivery > The Open Box Delivery is a service offered by the delivery partner of Flipkart Internet Private Limited wherein the product packaging (primary as well as secondary) is physically opened in front of the customer at the time of delivery. This facility enables the customers to verify/inspect the product before accepting for delivery. In the case of product missing, wrong product received, damage, or an accessory missing, the customer can reject the product at the doorstep, and a refund will be initiated. > Please note: in such cases, customers need to place the fresh order. Replacement flow is not available at this moment. > > This option for OBD is available on select products, at select locations and to select customers only. > > At the Checkout order Summary page the customer will know whether for any of their chosen product items, OBD is available or not. > > The OBD is available both for Cash on Delivery (COD)and Prepaid orders. If the customer opts for COD, then card of delivery and digital payments like UPI, etc will not be available at the doorstep and Contactless payment flow will also not be available for OBD orders in the current version of the program. > > After Placing Order, the customer will receive the OTP when the product is out for delivery. Customers will receive OTP in SMS as well as they can see this in their order details page. > > At the time of delivery, the customer or the recipient of the product needs to share the last four-digit number of delivery phone number or primary account phone number with the Delivery executive to initiate the OBD process. If the customer opted for COD, then they need to do the payment first and then OBD process will be initiated by the delivery executive > > The Customer will then inspect the ordered product in presence of the delivery executive, if the received order is the same as what they ordered for and if the product is in good condition and not damaged. > > Post the verification, customers shall be required to share the OTP with the delivery executive to acknowledge the confirmation that he/she has inspected the product before getting it delivered. > > In the event if the ordered product is not intact, damaged or it is the wrong product. The product must be handed over to the delivery executive which shall be returned, and the refund will be initiated immediately. In case of Cash on delivery, cash will be refunded immediately by the delivery executive. In the case of prepaid, the money will be credited within two business days. > > In the event the product is damaged, the customer should decline the shipment. > All this seemed a way for flipkart to either perpetrate scam (or let the sellers do it) or completely pass any risk towards customer by making the process too stressful. In the end, I purchased the phone via Amazon which seems to have better customer care service and using tools like fakespot, reviewmeta, I can make a marginally better call if I should order a particular product from a particular seller. Open box delivery means you can check the phone in front of the delivery person and not accept in case of any defects or if it's a dicey product. These (expensive product - say above ₹25,000) deliveries should be done in a similar manner as TVs are delivered. For most TVs, the TV is delivered in the packaging and the user/buyer is not allowed to unbox the TV himself. An installation guy is sent via the company to unbox and install the TV. In case of any issue, it becomes easier to replace the TV. Isn't that a pressure tactic to not let the buyer inspect the product properly? The delivery agents are supposed to provide the service and hence are supposed to wait until the buyer properly inspects the product and is ready to share the OTP. My cousin bought a google pixel 6A from Flipkart in December 2022. He invited the delivery guy inside and asked him to sit for OBD. Then he proceeded to tie his German shepherd at the main gate and told him to guard. Then he proceeded with OBD and made sure that the delivery guy couldn’t leave until he had opened the phone, set it up fully and downloaded a diagnostic tool to check the functioning of the phone. And only after this did he give the OTP. Never seen a guy sweat so much in the winter but at least my cousin wasn’t scammed into a used or dysfunctional phone. Are you sure the seller from which you bought the phone is genuine seller. Who was the seller? Did you check the seller before purchasing, new 3rd party sellers are doing scams. Avoid flipkart Always use credit card for big purchases. And always dispute the transaction if something goes wrong. For best disputes resolution, Amex is 👑 Never order anything from Flopkart. They scammed me for a small juicer order back in 2016 or so. Since then its been on my shitlist. Meanwhile I have ordered thousands of items from Amazon including TV, fridge, laptops etc without any issues Even though, Amazon too is becoming scammy these days by not having easy returns anymore. But its still much better than Flopkart Address your concern to : grievance.officer@flipkart.com If the Flipkart Grievance Officer refuses to assist then raise a complaint on National Consumer Helpline. Also, if you paid through credit/debit card (or) net banking, then you can raise a dispute (chargeback) through your bank. There is no such easy dispute process in India, AFAIK. Even if you dispute an actual order like this, it goes through bank verification and both parties have to justify to the bank. Flipkart will claim they sent the product, user received it and the bank can side with them as the transaction is considered legitimate. Ive seen disputes that werent successful even though the customer had a legitimate grievance If its an unauthorized charge on your card, then yes you can dispute it and this is handled differently, it goes through RBI fraud system and of course the seller wont be able to verify the transaction In USA there is a different dispute process for all transactions. I remember how flipkart was the one that opened up the indian customers to buy online. We started by ordering books. Another day, another day story about Flipkart. People will never learn. Follow @_Indian_page_ for indian content. It's the first page for people of india. Jai hind 🇮🇳 IIRC, the bill is supposed to have IMEI mentioned. Does that match with your device? If so, there is the proof that flipkart cheated you, considering that Samsung confirmed the device was activated a month before. Either threaten them or actually go to police with that info. I’ve had 2 disputes settled by Amex. 1 dispute to Nike for damaged product & 1 dispute to Amazon for sending me a refurbished phone. I explained my situation to the card provider with proof, got my money back in 15 days. I’ve had 1 dispute settled by Kotak Mahindra. Disputed a transaction I made on Amazon, they delivered a Chinese product in place of an Apple Watch. Again, I had all on video and proof. Got my money back in 30 days. It’s your hard earned money, you should fight for it till the end. Looks like Flipkart had already replied to the tweet? I wanted to buy nothing phone 2 but just because its only available I scrapped it and bought a oneplus 11r from amazon. Flipkart has worst customer support l. Call consumer helpline and state your issues Most probably flipkart will sove the issue but if they dont then approach consumer court Why do you guys still order from Flipkart? I am just surprised how so many people are getting scammed every other day. huh? don't give OTP unless you checked the product thoroughly. i understand couriers are busy but for high cost purchase , its better to be safe than sorry my dad bought a phone and it arrived and delivery guy was like , opened box , showed phone and was like OTP OTP. my dad was about to give him when i asked the guy to switch on the phone. he gave a look , hurriedly switched on the phone and it didn't turn on 🤡 he said saar keep charging and it'll turn on. i said nope, take it back The popup box that appears right before payment mentions there won't be any returns once OTP given. That dumb shit has removed whatever goodwill I have had for flipkart. It should be illegal to deny returns when not even 1-2hours is enough to confirm a product is working correctly or not. I just browse FK and if I see OBD I instantly close the site and look for other sources. FK could give me 99% discount on something and I still wouldn't buy it through OBD > All this seemed like a way for flipkart to either perpetrate scam (or let the sellers do it) or completely pass any risk towards customer by making the process too stressful. Well, for all marketplace wants is to pass on the risk from seller to buyer. They are mostly for delivery. The expectation is bad seller will be caught in deliveries only. At the end, flipkart and every other marketplace wants to be profitable, so they want to reduce their risk. Amazon can run for years on loses in India because AWS exists which will always keep it profitable. Walmart on the other hand, wants to sell Flipkart shares as soon as possible and that requires good financial statements. True but amazon did it for the world Wasn't the box sealed? If it wasn't sealed why give OTP? Did amazon and Nile ban/restrict your account afterwards? Never order anything from Flipkart. The risk of being the next horror story isn't worth any discount. At this point if you order expensive electronics from flipkart you have to assume this will happen. They just don't care Enough at the QC and their customer care is pretty much bots and humans a bit worse than bots. I mean if only they just used a little bit of thier brain to you know just check the product before giving otp. Nah mate you just have to check the product carefully before giving the otp. It's just that most people hurriedly give otp sometimes without even turning on the device. just stop buying shit from Flipkart. Its as simple as that Full sapot for avar Indian companies saar Never buy again from Flipkart. Taking notes I have fucking deleted the app. They are shady as fuck ! I ordered a laptop that I needed to put to work urgently. It came with a dead battery. It will work only on constant power supply. The replacement came with the EXACT same issue. And no, it WASN'T the same one. Because the exchange happened along with the new delivery. I did scream my lungs out on the customer care but that was just because of the delay in my work. Thankfully didn't have to worry about the refund. They readily did it. TBH your cousin sounds like an asshole. Harassing a delivery guy who is just trying to get his ends meet to feel superior, elite and clever. Bhai consumer court jaa samsung se written mee leke Bss phir kya gand lele unki After some time they will agree to replace but harrasment tension bla bla dalke unse Mobile exchange+compensation +lawyer and cout fees file a complaint in the consumer forum and file a case in consumer court Where there are scam happening left right and center it is better to be cautious. German shepherd on gate seems a little extra but asking the guy to open and setup the phone is literally written in the delivery instructions for OBD. People still buy from Flipkart? Flipkart for s22 ultra big mistake Openbox delivery but you shared otp without checking everything .If he didn't allow you to inspect then dont share it end of story . insanely big mistake. There is atleast 100+ posts every week about someone getting fked over by flipkart , 1000s of consumer complaints . May be make a thread for this instead . FLIPKART IS A SCAM EXCEPT IN THIS SCAM YOU GO TO THE SCAMMER WILLINGLY. Anyways retweeting it so you get some support. I dont understand why people buy expensive products through online shopping (especially from flipkart). Buying a phone is an important process because you would use that device for years. Why would anyone risk buying an expensive item online. With all these recent posts about flipkart being unreliable, why dont they just go and buy the phone physically? Buying something from flipkart is crazy low iq move Never use Flipkart. Who buys from Flipkart? It’s 2023 FFS! Was the phone box sealed? If no then why didn't you tell the delivery guy, if it was sealed then it's not a used phone just a defective one That's why i prefer offline purchase even if they cost more online shopping became headache even delivery boys never delivered on my adress i have to go in their shop It's owned by Walmart. I ordered some hybrid seeds from Flipkart, bc sabja ka packet bheja unhone The thing is that Flipkart delivery guys don’t wait if you ask nicely, and due to OBD Flipkart shifts the entire blame on the customer if the device is faulty. It’s not like he was rude or harassing, he just made sure that OBD was completed properly. As you can probably see in the comments of this Post, the delivery guys literally just open the box to a point where the product is visible, take a photo and leave because most people have already given the OTP. Nobody wants to do these kinds of things, but if the platform’s actions and policies are scam friendly why shouldn’t the buyer ensure that his purchase is secure and safe. He doesn’t do this sort of thing to Amazon delivery guys or even Flipkart when order value is low and there’s no OBD because then all you need is a video of the product being unboxed from the sealed package and your proof is solid. I feel OBD delivery agents are trained to do things so quickly and and in such a manner that the customer isn’t able to say anything by the time they’ve opened the package and taken the photo. ah shit here we go again Huh very true about Amazon. They have not yet picked up 2 of my orders citing return verification failed for multiple attempts. Even if they do, you can make a new account. what was the final price that made you buy it from flipkart I had plans for buying a new phone in BBD sale but I guess I'll just buy it from offline stores now Gotta implement today > He doesn’t do this sort of thing to Amazon delivery guys I personally know many people exactly like your cousin. For them, delivery guys, waiters, and maids are not human. They feel proud of harassing and abusing these 'non-human' service workers. For costly purchases it is entirely Flipkart being the dick to shirk off any responsibility using OBD. Why should consumer only get to spend minimal time to check. It is even worse when people are working from home and in a call and this urgency to check needs to happen with the delivery. The delivery executive may not deserve it but it's Flipkart who caused this whole thing. Flipkart should bear the brunt anyways if slower deliveries become the norm from this Samsung flagship devices tbf are entirely filled with scams within the first month of release, on both Flipkart and Amazon. The devices are all imported, refurbished or stolen with scratches and bugs described by OP. Idk why i see this mostly with Samsung. Buying from Samsung store is better not exactly foolproof either. Flipkart doesn't even let you set delivery dates like amazon. They'll randomly come late or early and then your meetinga and other responsibilities will prevent you from checking thoroughly So you suppose it would be better if Flipkart sent delivery guys that are specially trained to reduce the exchange value of the products, and further pressure customers into giving OTP without fulfilling the actual OBD. Just so you know, there is a big verandah between the main gate and where the living room is. I was there, my cousin politely invited the guy inside to sit in the living room. Offered tea and biscuits and politely completed the OBD. The delivery people get nervous because they know the scams that Flipkart and sellers are perpetrating, sometimes even the delivery guys scam the customers by not completing returns. No one is being disrespectful but it’s normal to safeguard yourself before thinking of others. I know you think you are trying to respect everyone but you’ll understand once you are scammed. We’ve had these scams occur in front of us so we know how painstaking it is to try and get a refund and even then it seldom works. I dont understand how do people continue to by electronics from Flipkart. Nah mate you can definitely set delivery date times. I have done it twice myself. However the option appears after the product has vein shipped. Some may not have actually experienced anything as such themselves. For Eg: I have already ordered 2 phones and 3 laptops from Flipkart so far and I never faced such issues. And the laptop that I bought was only available on Flipkart at that time. And although I have faced problems for an earphone once, but it was replaced quickly There is an online Government grievance portal. Record all calls,Click the pics and video of damaged mobile email to them and email to escalation team. Then after collecting all evidence complain on the portal. I got my blazer from flipkar back after they maked my replacement as delivered without delivering it after I complained on the portal. The whole open box delivery is a tactic used by Flipkart to push the onus onto the customer instead of them for delivering a defective product. Products, especially electronics can have lot of issues which won’t be apparent to the user within the few minutes they spend with the device. Many issues will only be found in the next 24-48 hours of usage. Almost all brick and mortar stores and other portals allow replacement or refund for such products. But with Flipkart the moment you share the otp they wash the product from their hands and now it’s between you and the company and will have to run to the customer care store because you weren’t unable to find a defect in few minutes. If a customer receives a product with defect, they should be able to return it within few days, it’s especially more important for online portals. Not offering a minimum return date is anti consumerism. Seeing this late. They do have the option but they don't stick to it at all. I have had more FK deliveries be delivered earlier than what I set and I had to resort to taking leave from office just to receive and check the delivery."
}