{
    "id": "1ftmdj9",
    "title": "Flipkart is a scam, sham of a service ",
    "url": "https://www.reddit.com/gallery/1ftmdj9",
    "selftext": "Ordered those book from flipkart, the cover is for the book i wanted but the book inside is completely different, it is also a photocopy of a used book. It took me 2 calls to explain this issue to them the first representative said that return cannot be processed as the book “looks the same”. Second representative one finally understood the issue and filed a return with the claim that the cover of the one i received is red and the cover on the website is black. This was on 26Sep since then i receive daily messages that pickup will be completed today but no-one contacted me for any pickup, calling the number they provide in the message about pickup connects to someone who claim they don’t work for ekart or flipkart, I have raised this issue three times with them and still no resolution. Today I received a message saying pickup was cancelled by customers request, after talking to the representative AGAIN they now have asked me to wait till 3 Oct. Honestly suggest everyone to stay away from this POS scam of a website",
    "flair": "Rant / Vent",
    "score": 47,
    "num_comments": 12,
    "created_utc": 1727784163.0,
    "convurl": "https://i.redd.it/be71q8xdx4sd1.jpg",
    "comments": [
        "r/IndiaTech",
        "Who was the seller? \n\nSee, it really depends on the 'representative' that you get, if they are understanding the issue or not. You would need to escalate it as fraud product. Regarding the pickup person, it really depends on the city, some people just put in fake credentials when getting hired . Also, flipkart doesn't always use ekart now. You should name and shame seller honestly, it helps people far more than just shaming flipkart.",
        "At least only a book and not something major. Or you didn't have to fight with their delivery goons...\n\nr/FuckFlipkart",
        "Lemme guess…propulsion systems design class?\n(Sucks that this happened tho, PDFs have been my saviour)",
        "It is understandable that you have met a seller who ran out of books, but he is just one individual out of many sellers on Flipkart. \n\nI have ordered PS5, Xiaomi tv, and other items from Flipkart and they were all good, so it's better to blame the seller than complete Flipkart. \n\nSecond part is the issue with their pickup team or logistic team which again depends on things like phone picked up on right time, or the overall load with the pickup guy.",
        "As a seller of Shitkart/Shitazon I would like u to know that this is the fault of the seller not Flipkart itself.",
        "r/fuckFlipkart",
        "Yes the book being wrong is seller issue, no resolution on return and shitty return and louse customer service is flipkarts fault",
        "Buy from Amazon. They return without questions.",
        "Yes lesson learned"
    ],
    "cleaned_text": "flipkart scam sham service ordered book flipkart cover book wanted book inside completely different also photocopy used book took calls explain issue first representative said return processed book looks second representative one finally understood issue filed return claim cover one received red cover website black sep since receive daily messages pickup completed today noone contacted pickup calling number provide message pickup connects someone claim dont work ekart flipkart raised issue three times still resolution today received message saying pickup cancelled customers request talking representative asked wait till oct honestly suggest everyone stay away pos scam website ",
    "cleaned_title": "flipkart scam sham service",
    "cleaned_selftext": "ordered book flipkart cover book wanted book inside completely different also photocopy used book took calls explain issue first representative said return processed book looks second representative one finally understood issue filed return claim cover one received red cover website black sep since receive daily messages pickup completed today noone contacted pickup calling number provide message pickup connects someone claim dont work ekart flipkart raised issue three times still resolution today received message saying pickup cancelled customers request talking representative asked wait till oct honestly suggest everyone stay away pos scam website",
    "cleaned_comments": "rindiatech seller see really depends representative get understanding issue would need escalate fraud product regarding pickup person really depends city people put fake credentials getting hired also flipkart doesnt always use ekart name shame seller honestly helps people far shaming flipkart least book something major didnt fight delivery goons rfuckflipkart lem guesspropulsion systems design class sucks happened tho pdfs saviour understandable met seller ran books one individual many sellers flipkart ordered ps xiaomi tv items flipkart good better blame seller complete flipkart second part issue pickup team logistic team depends things like phone picked right time overall load pickup guy seller shitkartshitazon would like u know fault seller flipkart rfuckflipkart yes book wrong seller issue resolution return shitty return louse customer service flipkarts fault buy amazon return without questions yes lesson learned",
    "light_cleaned_title": "Flipkart is a scam, sham of a service",
    "light_cleaned_selftext": "Ordered those book from flipkart, the cover is for the book i wanted but the book inside is completely different, it is also a photocopy of a used book. It took me 2 calls to explain this issue to them the first representative said that return cannot be processed as the book “looks the same”. Second representative one finally understood the issue and filed a return with the claim that the cover of the one i received is red and the cover on the website is black. This was on 26Sep since then i receive daily messages that pickup will be completed today but no-one contacted me for any pickup, calling the number they provide in the message about pickup connects to someone who claim they don’t work for ekart or flipkart, I have raised this issue three times with them and still no resolution. Today I received a message saying pickup was cancelled by customers request, after talking to the representative AGAIN they now have asked me to wait till 3 Oct. Honestly suggest everyone to stay away from this POS scam of a website",
    "light_cleaned_comments": "r/IndiaTech Who was the seller? See, it really depends on the 'representative' that you get, if they are understanding the issue or not. You would need to escalate it as fraud product. Regarding the pickup person, it really depends on the city, some people just put in fake credentials when getting hired . Also, flipkart doesn't always use ekart now. You should name and shame seller honestly, it helps people far more than just shaming flipkart. At least only a book and not something major. Or you didn't have to fight with their delivery goons... r/FuckFlipkart Lemme guess…propulsion systems design class? (Sucks that this happened tho, PDFs have been my saviour) It is understandable that you have met a seller who ran out of books, but he is just one individual out of many sellers on Flipkart. I have ordered PS5, Xiaomi tv, and other items from Flipkart and they were all good, so it's better to blame the seller than complete Flipkart. Second part is the issue with their pickup team or logistic team which again depends on things like phone picked up on right time, or the overall load with the pickup guy. As a seller of Shitkart/Shitazon I would like u to know that this is the fault of the seller not Flipkart itself. r/fuckFlipkart Yes the book being wrong is seller issue, no resolution on return and shitty return and louse customer service is flipkarts fault Buy from Amazon. They return without questions. Yes lesson learned"
}