{
    "id": "161qbdh",
    "title": "The OTP scam - How people are getting scammed",
    "url": "https://www.reddit.com/r/india/comments/161qbdh/the_otp_scam_how_people_are_getting_scammed/",
    "selftext": "[https://www.youtube.com/watch?v=BSM6-gET8Vo&ab\\_channel=NDTV](https://www.youtube.com/watch?v=BSM6-gET8Vo&ab_channel=NDTV)\n\nThis NDTV video shows how people are getting scammed on daily basis and what tricks these scammers deploy to loot us. \n\nI would urge all of us to watch this video and share it so that it can increase the awareness. No matter how much alert, vigilant or educated you are, while in fear you could become weak very easily and give in to these scammers. \n\nIn 2014, I was *nearly* scammed when I was trying to search for another job. I am myself someone who is quite alert about these things but how convincing these guys could be is commendable. \n\nPlease be alert, don't act over smart in thinking that it cannot happen to you!",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693041556.0,
    "convurl": "https://external-preview.redd.it/-FGjwy-278u3rIFYwq3f3pOF545e1ta3bapBf_6g_nU.jpg?auto=webp&s=fc3920e7819f107d0af489654c723b07e54f3d83",
    "comments": [
        "yup security is pretty poor in this country nothin much can be done",
        "\"Nuh se New York\" we know what you did there, AdaniTV."
    ],
    "cleaned_text": "otp scam people getting scammed httpswwwyoutubecomwatchvbsmgetvoabchannelndtvhttpswwwyoutubecomwatchvbsmgetvoabchannelndtv ndtv video shows people getting scammed daily basis tricks scammers deploy loot us would urge us watch video share increase awareness matter much alert vigilant educated fear could become weak easily give scammers nearly scammed trying search another job someone quite alert things convincing guys could commendable please alert dont act smart thinking happen ",
    "cleaned_title": "otp scam people getting scammed",
    "cleaned_selftext": "httpswwwyoutubecomwatchvbsmgetvoabchannelndtvhttpswwwyoutubecomwatchvbsmgetvoabchannelndtv ndtv video shows people getting scammed daily basis tricks scammers deploy loot us would urge us watch video share increase awareness matter much alert vigilant educated fear could become weak easily give scammers nearly scammed trying search another job someone quite alert things convincing guys could commendable please alert dont act smart thinking happen",
    "cleaned_comments": "yup security pretty poor country nothin much done nuh se new york know adanitv",
    "light_cleaned_title": "The OTP scam - How people are getting scammed",
    "light_cleaned_selftext": "[https://www.youtube.com/watch?v=BSM6-gET8Vo&ab\\_channel=NDTV](https://www.youtube.com/watch?v=BSM6-gET8Vo&ab_channel=NDTV) This NDTV video shows how people are getting scammed on daily basis and what tricks these scammers deploy to loot us. I would urge all of us to watch this video and share it so that it can increase the awareness. No matter how much alert, vigilant or educated you are, while in fear you could become weak very easily and give in to these scammers. In 2014, I was *nearly* scammed when I was trying to search for another job. I am myself someone who is quite alert about these things but how convincing these guys could be is commendable. Please be alert, don't act over smart in thinking that it cannot happen to you!",
    "light_cleaned_comments": "yup security is pretty poor in this country nothin much can be done \"Nuh se New York\" we know what you did there, AdaniTV."
}