{
    "id": "1bvny4o",
    "title": "Interesting take on food delivery apps in the US. ",
    "url": "https://youtu.be/aFsfJYWpqII?si=97l2W5wBfCKlvc3v",
    "selftext": "Just like the US,\nRestaurants jack up prices on the apps to compensate for the enormous cuts that the apps take.\nThe delivery agents from Swiggy, Zomato, and the rest are independent agents working gigs for the company and don't recieve insurance or a steady pay, work through harsh weather conditions to make ends meet.\n\nNow, John Oliver ends the segment by saying tip the workers, I disagree. I despise tipping culture and don't want to propogate the idea in India. However, I do tip only when the service has been exceptional. \n\nAll that being said, there's a lot that has to change in this industry. I think I'm going to go to a restaurant and order take away if I can, I'm aware the promise of convenience has now become a crutch.\nWhat are your thoughts?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1712239403.0,
    "convurl": "https://external-preview.redd.it/lz9gBEZfBf7GeT07Evib2zlCYJNcURAPsIlfpvxLvwU.jpg?auto=webp&s=40d69396e0a3001dd9470dc13d7f02cc2e0fbab9",
    "comments": [],
    "cleaned_text": "interesting take food delivery apps us like us restaurants jack prices apps compensate enormous cuts apps take delivery agents swiggy zomato rest independent agents working gigs company dont recieve insurance steady pay work harsh weather conditions make ends meet john oliver ends segment saying tip workers disagree despise tipping culture dont want propogate idea india however tip service exceptional said theres lot change industry think im going go restaurant order take away im aware promise convenience become crutch thoughts ",
    "cleaned_title": "interesting take food delivery apps us",
    "cleaned_selftext": "like us restaurants jack prices apps compensate enormous cuts apps take delivery agents swiggy zomato rest independent agents working gigs company dont recieve insurance steady pay work harsh weather conditions make ends meet john oliver ends segment saying tip workers disagree despise tipping culture dont want propogate idea india however tip service exceptional said theres lot change industry think im going go restaurant order take away im aware promise convenience become crutch thoughts",
    "cleaned_comments": "",
    "light_cleaned_title": "Interesting take on food delivery apps in the US.",
    "light_cleaned_selftext": "Just like the US, Restaurants jack up prices on the apps to compensate for the enormous cuts that the apps take. The delivery agents from Swiggy, Zomato, and the rest are independent agents working gigs for the company and don't recieve insurance or a steady pay, work through harsh weather conditions to make ends meet. Now, John Oliver ends the segment by saying tip the workers, I disagree. I despise tipping culture and don't want to propogate the idea in India. However, I do tip only when the service has been exceptional. All that being said, there's a lot that has to change in this industry. I think I'm going to go to a restaurant and order take away if I can, I'm aware the promise of convenience has now become a crutch. What are your thoughts?",
    "light_cleaned_comments": ""
}