{
    "id": "181z4t3",
    "title": "Shh. No Jokes. | Frontline Cover Page, Dec ‘23 Edition",
    "url": "https://i.redd.it/x25b0bd8132c1.jpg",
    "selftext": "Cover Story: https://frontline.thehindu.com/society/intolerance-outrage-leaving-indian-stand-up-comics-with-less-to-laugh-about/article67511887.ece",
    "flair": "Politics",
    "score": 110,
    "num_comments": 8,
    "created_utc": 1700738664.0,
    "convurl": "https://i.redd.it/x25b0bd8132c1.jpg",
    "comments": [
        "Can you post the article in Today's the Hindu about links between animal cruelty and child cruelty.",
        "Just did.",
        "Harley Quin",
        "Aunty-national. It's Harshita Rani.",
        "Our politicians and their chhapri chamchas are thin-skinned idiots.",
        "When I attended Manthan Samvad 2023 few months back, towards the end (when a congress leader was debunking the viral photos) few people stood up blaming the organizers that they only invited anti BJP speakers!\n\nAlso, Saral Sampat's satire was amazing and hilarious!\n\nhttps://www.youtube.com/watch?v=cIO5jQcrcZQ",
        "Sadly the thin skin idiots are backed by the state machinery where they can lock away people for months on flimsy charges followed by years of harassment. Most comedians are just normal people who take a cue and shut up. And large majority is okay with it because BJP serves their purpose. Sad state of affairs."
    ],
    "cleaned_text": "shh jokes frontline cover page dec edition cover story ",
    "cleaned_title": "shh jokes frontline cover page dec edition",
    "cleaned_selftext": "cover story",
    "cleaned_comments": "post article todays hindu links animal cruelty child cruelty harley quin auntynational harshita rani politicians chhapri chamchas thinskinned idiots attended manthan samvad months back towards end congress leader debunking viral photos people stood blaming organizers invited anti bjp speakers also saral sampats satire amazing hilarious sadly thin skin idiots backed state machinery lock away people months flimsy charges followed years harassment comedians normal people take cue shut large majority okay bjp serves purpose sad state affairs",
    "light_cleaned_title": "Shh. No Jokes. | Frontline Cover Page, Dec ‘23 Edition",
    "light_cleaned_selftext": "Cover Story:",
    "light_cleaned_comments": "Can you post the article in Today's the Hindu about links between animal cruelty and child cruelty. Just did. Harley Quin Aunty-national. It's Harshita Rani. Our politicians and their chhapri chamchas are thin-skinned idiots. When I attended Manthan Samvad 2023 few months back, towards the end (when a congress leader was debunking the viral photos) few people stood up blaming the organizers that they only invited anti BJP speakers! Also, Saral Sampat's satire was amazing and hilarious! Sadly the thin skin idiots are backed by the state machinery where they can lock away people for months on flimsy charges followed by years of harassment. Most comedians are just normal people who take a cue and shut up. And large majority is okay with it because BJP serves their purpose. Sad state of affairs."
}