{
    "id": "129ff18",
    "title": "SBI deducted ₹36,000 for premature closure of FD with principal 20 lac @ 5.6% .",
    "url": "https://www.reddit.com/r/india/comments/129ff18/sbi_deducted_36000_for_premature_closure_of_fd/",
    "selftext": "**r/IndiaInvestments didn’t allow my post citing account age or low karma, but I really need your help through this problem. Please help !**\n My Father got an **«FD of ₹20 lacs @5.6% 1-year tenure»** done in March2021 post-retirement and renewed it, but had to close it prematurely in Jan2023. He was receiving the interest of ₹8361 on FD as monthly payout after deducting 10%TDS (₹9290 - ₹929 = ₹8361). Note that, FD interest was his only income post retirement and he wasn’t filing ITR as the income wasn’t tax eligible. For premature closure, bank deducted ₹36,000 from his savings account. \nTHERE ARE THREE ISSUES HERE WHICH I DON’T FULLY UNDERSTAND -\n1)  He should’ve filled Form 15G/H (?) to avoid TDS, but since he didn’t, what can be done to claim all the TDS he has paid till date?\n\n2)  Acc. to the stated roi, that was 5.6% ,he should’ve received ₹9333 as interest monthly, as opposed to ₹9290 which means roi of 5.574 This makes a difference of ₹520 in an year. \n\n3)  SBI deducted ₹36,000 as penalty for prematurity from his savings account. I don’t get how bank did the calculation. If I understand correctly, the penalty is to decrease roi by 1% i.e, = 4.6% for the period SBI paid interest for. So, interest at 4.6% from March2022 till Jan2023 (10 months) is ₹76,666 and at 5.6% for 10 months is ₹93,333 . So, the penalty amount should be ₹16,667 (₹93,333 - ₹76,666). \n\nFellow Redditors, this is what I understand so far and need your input and guidance on if and where I am wrong. If I have left any detail out, please ask.\n\nNote : 1) There’s also a system issue that SBI has mentioned in a letter whose pic I have attached. I haven’t visited SBI yet on these issues, will go on Monday.\n            2) Attaching a few pics for reference. \n\nhttps://ibb.co/wKHq8rn\n\nhttps://ibb.co/6nJxmW0\n\nhttps://ibb.co/9hhXDrW\n\nhttps://ibb.co/Jq2N9R0\n\n            3) Will keep y’all updated on any developments.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 9,
    "created_utc": 1680425487.0,
    "convurl": "https://external-preview.redd.it/ZTcE127hZ8kxVGhM-YATCnkHwoMCr0RUvuwwv514iTw.jpg?auto=webp&v=enabled&s=adbce51e8ced9a683320ba24ad6e517ea4ddd7f6",
    "comments": [
        "1. He can file ITR for refund.",
        "Can he file ITR even if his sole income from FD is less than 5 Lpa ? Also, can he get back all TDS deductions done till date?",
        "Yes he can file ITR. AFAIK only the TDS for the last fiscal year can be refunded.",
        "ITR is Income Tax ‘Return’ for a reason. It is so that you can get any excess amount deducted. Banks cut TDS depending on the general terms because they don’t know your total yearly income. And that is where ITR comes in. He can file that he has only earned 8361*12 every year, which is less than 5 lacs and hence all his TDS should be ‘returned’. But I am not sure if it is possible to file backdated ITRs. You maybe have to check that.",
        "Ok will look into it.",
        "Thanks, will look into it.",
        "Bank paid monthly interest on the basis that your FD will be open for the whole period. So the interest rate for the tenure that you closed it will apply which you don't know. So please enquire at SBI. ITR should be filed irrespective of whether you are paying any tax or not. You can claim refund for last FY when you file ITR.",
        "I can help you with calculation. DM me. Firstly, I believe banks calculate interest quarterly and not monthly on FDs afaik. Second, on premature withdrawal, your interest is not just 1% less, but even lesser. For example, if you kept FD only for 6 months and original mature period was 2 years. The rate of interest will be the one on 6 months FD at that time and then 1% more deduction as penalty."
    ],
    "cleaned_text": "sbi deducted premature closure fd principal lac rindiainvestments didnt allow post citing account age low karma really need help problem please help father got fd lacs year tenure done march postretirement renewed close prematurely jan receiving interest fd monthly payout deducting tds note fd interest income post retirement wasnt filing itr income wasnt tax eligible premature closure bank deducted savings account three issues dont fully understand shouldve filled form gh avoid tds since didnt done claim tds paid till date acc stated roi shouldve received interest monthly opposed means roi makes difference year sbi deducted penalty prematurity savings account dont get bank calculation understand correctly penalty decrease roi ie period sbi paid interest interest march till jan months months penalty amount fellow redditors understand far need input guidance wrong left detail please ask note theres also system issue sbi mentioned letter whose pic attached havent visited sbi yet issues go monday attaching pics reference keep yall updated developments ",
    "cleaned_title": "sbi deducted premature closure fd principal lac",
    "cleaned_selftext": "rindiainvestments didnt allow post citing account age low karma really need help problem please help father got fd lacs year tenure done march postretirement renewed close prematurely jan receiving interest fd monthly payout deducting tds note fd interest income post retirement wasnt filing itr income wasnt tax eligible premature closure bank deducted savings account three issues dont fully understand shouldve filled form gh avoid tds since didnt done claim tds paid till date acc stated roi shouldve received interest monthly opposed means roi makes difference year sbi deducted penalty prematurity savings account dont get bank calculation understand correctly penalty decrease roi ie period sbi paid interest interest march till jan months months penalty amount fellow redditors understand far need input guidance wrong left detail please ask note theres also system issue sbi mentioned letter whose pic attached havent visited sbi yet issues go monday attaching pics reference keep yall updated developments",
    "cleaned_comments": "file itr refund file itr even sole income fd less lpa also get back tds deductions done till date yes file itr afaik tds last fiscal year refunded itr income tax return reason get excess amount deducted banks cut tds depending general terms dont know total yearly income itr comes file earned every year less lacs hence tds returned sure possible file backdated itrs maybe check ok look thanks look bank paid monthly interest basis fd open whole period interest rate tenure closed apply dont know please enquire sbi itr filed irrespective whether paying tax claim refund last fy file itr help calculation dm firstly believe banks calculate interest quarterly monthly fds afaik second premature withdrawal interest less even lesser example kept fd months original mature period years rate interest one months fd time deduction penalty",
    "light_cleaned_title": "SBI deducted ₹36,000 for premature closure of FD with principal 20 lac @ 5.6% .",
    "light_cleaned_selftext": "**r/IndiaInvestments didn’t allow my post citing account age or low karma, but I really need your help through this problem. Please help !** My Father got an **«FD of ₹20 lacs @5.6% 1-year tenure»** done in March2021 post-retirement and renewed it, but had to close it prematurely in Jan2023. He was receiving the interest of ₹8361 on FD as monthly payout after deducting 10%TDS (₹9290 - ₹929 = ₹8361). Note that, FD interest was his only income post retirement and he wasn’t filing ITR as the income wasn’t tax eligible. For premature closure, bank deducted ₹36,000 from his savings account. THERE ARE THREE ISSUES HERE WHICH I DON’T FULLY UNDERSTAND - 1) He should’ve filled Form 15G/H (?) to avoid TDS, but since he didn’t, what can be done to claim all the TDS he has paid till date? 2) Acc. to the stated roi, that was 5.6% ,he should’ve received ₹9333 as interest monthly, as opposed to ₹9290 which means roi of 5.574 This makes a difference of ₹520 in an year. 3) SBI deducted ₹36,000 as penalty for prematurity from his savings account. I don’t get how bank did the calculation. If I understand correctly, the penalty is to decrease roi by 1% i.e, = 4.6% for the period SBI paid interest for. So, interest at 4.6% from March2022 till Jan2023 (10 months) is ₹76,666 and at 5.6% for 10 months is ₹93,333 . So, the penalty amount should be ₹16,667 (₹93,333 - ₹76,666). Fellow Redditors, this is what I understand so far and need your input and guidance on if and where I am wrong. If I have left any detail out, please ask. Note : 1) There’s also a system issue that SBI has mentioned in a letter whose pic I have attached. I haven’t visited SBI yet on these issues, will go on Monday. 2) Attaching a few pics for reference. 3) Will keep y’all updated on any developments.",
    "light_cleaned_comments": "1. He can file ITR for refund. Can he file ITR even if his sole income from FD is less than 5 Lpa ? Also, can he get back all TDS deductions done till date? Yes he can file ITR. AFAIK only the TDS for the last fiscal year can be refunded. ITR is Income Tax ‘Return’ for a reason. It is so that you can get any excess amount deducted. Banks cut TDS depending on the general terms because they don’t know your total yearly income. And that is where ITR comes in. He can file that he has only earned 8361*12 every year, which is less than 5 lacs and hence all his TDS should be ‘returned’. But I am not sure if it is possible to file backdated ITRs. You maybe have to check that. Ok will look into it. Thanks, will look into it. Bank paid monthly interest on the basis that your FD will be open for the whole period. So the interest rate for the tenure that you closed it will apply which you don't know. So please enquire at SBI. ITR should be filed irrespective of whether you are paying any tax or not. You can claim refund for last FY when you file ITR. I can help you with calculation. DM me. Firstly, I believe banks calculate interest quarterly and not monthly on FDs afaik. Second, on premature withdrawal, your interest is not just 1% less, but even lesser. For example, if you kept FD only for 6 months and original mature period was 2 years. The rate of interest will be the one on 6 months FD at that time and then 1% more deduction as penalty."
}