{
    "id": "13vjvph",
    "title": "The indelible imprint of the Fifth Estate, in Karnataka",
    "url": "https://www.thehindu.com/opinion/lead/the-indelible-imprint-of-the-fifth-estate-in-karnataka/article66908909.ece",
    "selftext": "While political parties fought bitter battles in Karnataka in the run-up to the Assembly election, civil society in the State, without any alliance or imbibing any particular political hue, made an indelible mark in the history of elections in India. Civil society, with 102 associations or organisations, came together and fought against the strategies of the political parties. They struggled for around six months before the elections under the umbrella “Eddelu Karnataka (Wake-up, Karnataka)”, and the result is there for the nation to see.\n\nThey did not argue with the public, or campaign against any party, but just asked the people to wake up. They listened to the people intensely. They put forth the real issues confronting them. They fought against the powerful politics of bigotry orchestrated by communal forces that were stoking the issues around the hijab, azaan, and ‘love jihad’ to name a few. Their intervention opened new vistas for positive politics, secularism and peace. They did not talk about “Operation Kamala”, i.e. the dubious defection drama practised by one major party, followed by judicial interventions that involve a legal interplay of words and bizarre interpretations in court halls with a selective use of constitutional means to whitewash criminal acts. Indeed, political manipulation has become everyday play. One such political party, the Janata Dal (Secular), failed in a big way in the elections. The people of Karnataka rejected it. Dishonest game players were defeated.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1685433081.0,
    "convurl": "https://external-preview.redd.it/qZUu4i1oudsmmTtLqbqF_ZFVyyeD90k-9L5XdSPuKNU.jpg?auto=webp&v=enabled&s=8091d99b348b1919b5a60bc4f72315c20d53f835",
    "comments": [
        "Hmm no one has mentioned them in msm",
        "Yeah still awareness is an essential tool against people who deceive others to get votes.",
        "Worked in South India may not scale to other locations",
        "Maybe, maybe not. Even if it does work we have no organisation like that up the north"
    ],
    "cleaned_text": "indelible imprint fifth estate karnataka political parties fought bitter battles karnataka runup assembly election civil society state without alliance imbibing particular political hue made indelible mark history elections india civil society associations organisations came together fought strategies political parties struggled around six months elections umbrella eddelu karnataka wakeup karnataka result nation see argue public campaign party asked people wake listened people intensely put forth real issues confronting fought powerful politics bigotry orchestrated communal forces stoking issues around hijab azaan love jihad name intervention opened new vistas positive politics secularism peace talk operation kamala ie dubious defection drama practised one major party followed judicial interventions involve legal interplay words bizarre interpretations court halls selective use constitutional means whitewash criminal acts indeed political manipulation become everyday play one political party janata dal secular failed big way elections people karnataka rejected dishonest game players defeated ",
    "cleaned_title": "indelible imprint fifth estate karnataka",
    "cleaned_selftext": "political parties fought bitter battles karnataka runup assembly election civil society state without alliance imbibing particular political hue made indelible mark history elections india civil society associations organisations came together fought strategies political parties struggled around six months elections umbrella eddelu karnataka wakeup karnataka result nation see argue public campaign party asked people wake listened people intensely put forth real issues confronting fought powerful politics bigotry orchestrated communal forces stoking issues around hijab azaan love jihad name intervention opened new vistas positive politics secularism peace talk operation kamala ie dubious defection drama practised one major party followed judicial interventions involve legal interplay words bizarre interpretations court halls selective use constitutional means whitewash criminal acts indeed political manipulation become everyday play one political party janata dal secular failed big way elections people karnataka rejected dishonest game players defeated",
    "cleaned_comments": "hmm one mentioned msm yeah still awareness essential tool people deceive others get votes worked south india may scale locations maybe maybe even work organisation like north",
    "light_cleaned_title": "The indelible imprint of the Fifth Estate, in Karnataka",
    "light_cleaned_selftext": "While political parties fought bitter battles in Karnataka in the run-up to the Assembly election, civil society in the State, without any alliance or imbibing any particular political hue, made an indelible mark in the history of elections in India. Civil society, with 102 associations or organisations, came together and fought against the strategies of the political parties. They struggled for around six months before the elections under the umbrella “Eddelu Karnataka (Wake-up, Karnataka)”, and the result is there for the nation to see. They did not argue with the public, or campaign against any party, but just asked the people to wake up. They listened to the people intensely. They put forth the real issues confronting them. They fought against the powerful politics of bigotry orchestrated by communal forces that were stoking the issues around the hijab, azaan, and ‘love jihad’ to name a few. Their intervention opened new vistas for positive politics, secularism and peace. They did not talk about “Operation Kamala”, i.e. the dubious defection drama practised by one major party, followed by judicial interventions that involve a legal interplay of words and bizarre interpretations in court halls with a selective use of constitutional means to whitewash criminal acts. Indeed, political manipulation has become everyday play. One such political party, the Janata Dal (Secular), failed in a big way in the elections. The people of Karnataka rejected it. Dishonest game players were defeated.",
    "light_cleaned_comments": "Hmm no one has mentioned them in msm Yeah still awareness is an essential tool against people who deceive others to get votes. Worked in South India may not scale to other locations Maybe, maybe not. Even if it does work we have no organisation like that up the north"
}