{
    "id": "14oia4d",
    "title": "‘Not against UCC, but don’t support how BJP is trying to implement it’: BSP chief Mayawati",
    "url": "https://indianexpress.com/article/india/bsp-mayawati-uniform-civil-code-bjp-govt-8697023/",
    "selftext": "\"It is not right to politicise this issue and forcefully implement UCC in the country,\" Mayawati said.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 16,
    "created_utc": 1688283775.0,
    "convurl": "https://external-preview.redd.it/yAdBzIhHWAJX2U7-REcX-iYYbadmVu1bxlIFohS4Xp0.jpg?auto=webp&v=enabled&s=45fa5aaa3a406295c5194f7c8c38e8d0a8500b2a",
    "comments": [
        "I think many people in India think this way",
        "Behen, aap kahaan thi itne saal?",
        "That's what any sane liberal would say. The idea of UCC is good but worried about how BJP would implement it.",
        "They will make it as much botched up and controversial as possible. Then get votes out of that shitshow. It's not a bug, it's the feature of this government. In every single law they pass.",
        "I am of the opinion that implementing the UCC is an exercise in futility in a country as big and diverse as India, and a party like BJP implementing it with their Muslim hatred would be a complete disaster. It would take insane amounts of effort and money to implement, and many groups would be pissed off nonetheless! In a country where even the dialect changes every 40-50 kms, where there are over 25000 castes with each having their own unique culture, a country where there are 122 major languages and over 1500 other languages, where there are 100s of religions, with huge differences even within the different sects of one religion, 29 states within which each district has tons of different cultures; uniformity would be a huge disaster. Even European countries have scrapped the idea of a UCC, and their population is very less in number and also less diverse than India.",
        "Genuine question - how exactly is BJP trying to implement it? Is there a working paper published by them that I can read?",
        "It isn't out yet. But it's very obvious that they are looking to use it to appease the majority by showcasing it as anti minority. Lots of questions are out there, will they remove provisions like HUF, what about tribal ones, will it even touch queer rights, will it have hindu undertones like some other secular laws. \n\nUK is expected to release their version first, let's wait for that"
    ],
    "cleaned_text": "ucc dont support bjp trying implement bsp chief mayawati right politicise issue forcefully implement ucc country mayawati said ",
    "cleaned_title": "ucc dont support bjp trying implement bsp chief mayawati",
    "cleaned_selftext": "right politicise issue forcefully implement ucc country mayawati said",
    "cleaned_comments": "think many people india think way behen aap kahaan thi itne saal thats sane liberal would say idea ucc good worried bjp would implement make much botched controversial possible get votes shitshow bug feature government every single law pass opinion implementing ucc exercise futility country big diverse india party like bjp implementing muslim hatred would complete disaster would take insane amounts effort money implement many groups would pissed nonetheless country even dialect changes every kms castes unique culture country major languages languages religions huge differences even within different sects one religion states within district tons different cultures uniformity would huge disaster even european countries scrapped idea ucc population less number also less diverse india genuine question exactly bjp trying implement working paper published read isnt yet obvious looking use appease majority showcasing anti minority lots questions remove provisions like huf tribal ones even touch queer rights hindu undertones like secular laws uk expected release version first lets wait",
    "light_cleaned_title": "‘Not against UCC, but don’t support how BJP is trying to implement it’: BSP chief Mayawati",
    "light_cleaned_selftext": "\"It is not right to politicise this issue and forcefully implement UCC in the country,\" Mayawati said.",
    "light_cleaned_comments": "I think many people in India think this way Behen, aap kahaan thi itne saal? That's what any sane liberal would say. The idea of UCC is good but worried about how BJP would implement it. They will make it as much botched up and controversial as possible. Then get votes out of that shitshow. It's not a bug, it's the feature of this government. In every single law they pass. I am of the opinion that implementing the UCC is an exercise in futility in a country as big and diverse as India, and a party like BJP implementing it with their Muslim hatred would be a complete disaster. It would take insane amounts of effort and money to implement, and many groups would be pissed off nonetheless! In a country where even the dialect changes every 40-50 kms, where there are over 25000 castes with each having their own unique culture, a country where there are 122 major languages and over 1500 other languages, where there are 100s of religions, with huge differences even within the different sects of one religion, 29 states within which each district has tons of different cultures; uniformity would be a huge disaster. Even European countries have scrapped the idea of a UCC, and their population is very less in number and also less diverse than India. Genuine question - how exactly is BJP trying to implement it? Is there a working paper published by them that I can read? It isn't out yet. But it's very obvious that they are looking to use it to appease the majority by showcasing it as anti minority. Lots of questions are out there, will they remove provisions like HUF, what about tribal ones, will it even touch queer rights, will it have hindu undertones like some other secular laws. UK is expected to release their version first, let's wait for that"
}