{
    "id": "16ujqw4",
    "title": "Parineeti and Raghav's Big 'I Do' - A Political Powerplay Party You Won't Believe . SEE VIDEO . YOUR THOUGHTS?",
    "url": "https://www.reddit.com/r/india/comments/16ujqw4/parineeti_and_raghavs_big_i_do_a_political/",
    "selftext": " Is it love, politics, or just one wild ride?   A union where political prowess meets party prowess, and where Parineeti and Raghav's journey into marriage promises to be a whirlwind. where Parineeti and Raghav embark on a journey into wedded bliss that's anything but ordinary. But hold on to your hats because Raghav might just be taking 'political power couple' to a whole new level . \n\nLINK OF WHAT I'M TALKING ABOUT : [https://youtu.be/a7lg\\_DiBlfQ](https://youtu.be/a7lg_DiBlfQ)  \n\n\n&#x200B;",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695916591.0,
    "convurl": "https://external-preview.redd.it/LfBJ91DcJO9zyogmKN3mpL9DQK7rAamEqzwy-xhc02E.jpg?auto=webp&s=e04031f29f70d0ef86b28eab5b8a3b02a1e5c7ee",
    "comments": [],
    "cleaned_text": "parineeti raghavs big political powerplay party wont believe see video thoughts love politics one wild ride union political prowess meets party prowess parineeti raghavs journey marriage promises whirlwind parineeti raghav embark journey wedded bliss thats anything ordinary hold hats raghav might taking political power couple whole new level link im talking httpsyoutubealgdiblfqhttpsyoutubealgdiblfq xb ",
    "cleaned_title": "parineeti raghavs big political powerplay party wont believe see video thoughts",
    "cleaned_selftext": "love politics one wild ride union political prowess meets party prowess parineeti raghavs journey marriage promises whirlwind parineeti raghav embark journey wedded bliss thats anything ordinary hold hats raghav might taking political power couple whole new level link im talking httpsyoutubealgdiblfqhttpsyoutubealgdiblfq xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Parineeti and Raghav's Big 'I Do' - A Political Powerplay Party You Won't Believe . SEE VIDEO . YOUR THOUGHTS?",
    "light_cleaned_selftext": "Is it love, politics, or just one wild ride? A union where political prowess meets party prowess, and where Parineeti and Raghav's journey into marriage promises to be a whirlwind. where Parineeti and Raghav embark on a journey into wedded bliss that's anything but ordinary. But hold on to your hats because Raghav might just be taking 'political power couple' to a whole new level . LINK OF WHAT I'M TALKING ABOUT : [https://youtu.be/a7lg\\_DiBlfQ](https://youtu.be/a7lg_DiBlfQ) &#x200B;",
    "light_cleaned_comments": ""
}