{
    "id": "ozk0nn",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/ozk0nn/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 29,
    "num_comments": 52,
    "created_utc": 1628299819,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watching \"The Middleman\" by Satyajit Ray. If anyone wants to watch it, it's available on Youtube with English subtitles.\n[Here's the link to movie.](https://www.youtube.com/watch?v=QEMA1upF0rw)",
        "Currently watching Psych for the first time. What a fun show! \n\nAny suggestions similar to this when I'll eventually be done? \n\nFinished Sons if Anarchy last month and is left a hole. Tried Handmaid's Tale, stuck with it for 3 seasons, not my thing.",
        "Call my agent | Netflix (French comedy-drama series). At first you think there is nothing new except a bunch of people’s work life and drama around that, but it holds your interest for all four seasons.\n\nTehran | Apple TV + | spy - Thriller | This is another Israeli thriller that grabbed my attention after Fauda (Netflix). Both series are good in trying to be as real as possible. Surprisingly neither shows the other side completely bad the way most American or India content would do. This one in particularly about Iran-Israel. Fauda is about Israeli- Palestinian conflict.",
        "Watched The Talented Mr. Ripley on Netflix. And old psychological thriller worth a watch. \nAlso watched the Mauritaruan and The Courier, both good movies.",
        "The Long Goodbye \n\nReally Enjoyed watching this movie, so much so that I'm gonna start reading the Philip Marlowe series from next month.",
        "got myself a 55 inch TV, so I am rewatching Our Planet on netflix. almost every single frame of the show is stunning enough to be kept as a wallpaper",
        "'I have heard it both ways.' \nScrubs may be, if you like Psych.",
        "Watched yeonmi park podcast with joe rogan. If you want to feel good about yourself watch it. It is about life of normal people in north korea.",
        "There was a South Indian series recently on liv with a murder storyline. I just watched some ads and want to see the movie/serial. Can someone help me figure out the name? It was launched this/last month",
        "I have just discovered kdrama and HOLY SHIT!!!!!!!! I did not know what I was missing. I love cheesy romcoms and kdramas are full of it. (Not every kdrama is romantic, but there are a lot of them). Also now my expectations from relationships have soared so high that I am pretty sure, I'll die single. So far I've watched My Love from the Star, Legend of the Blue Sea, It is Okay to Not be Okay, The King: Eternal Monarch and Hi School Love On. \n\nWould strongly recommend watching It's Okay to Not be Okay to everyone because it is amazing, the characters are very well written, the supporting cast is awesome, it is sweet and funny, emotional and dark, really a mixed bag.",
        "Started watching the white lotus , interested to see how they make it more engaging. Watched till the second episode.",
        "The Red Line is a great podcast. They discuss various geopolitical issues with a range of experts on the topic. I just watched an episode on the Tigray situation in Ethiopia. The first part (there were three parts to the episode) was fantastic",
        "November Story?",
        "Thanks, subbed",
        "Which TV you got?",
        "https://www.amazon.in/Mi-138-8-Inches-Ultra-Android/dp/B081Z1RQLV\n\nnot the best but good enough for me",
        "I'm watching Cosmos : Possible Worlds",
        "Need some good podcast recommendations on \n\n1. Cricket \n\n2. Mysteries and conspiracies",
        "My friend gave me free Netflix now I need recommendations. Help.",
        "For those of you who haven't seen Spielberg's debut film Duel, do it. \n\nWatched it again today.",
        "i love this film bro.happy to find someone who thinks so too",
        "It's arguably the best action thriller I've ever seen.",
        "Dark",
        "Halfway through Person of Interest S2. I loved the \"Number of the Week\" episodes in S1 but struggling to get through those type of episodes in S2.",
        "Ozark, You, Sex Education, Black Mirror,",
        "share your review. I've seen the show and mostly I loved it, but I felt let down in 2 of the episodes. overall it is quite underrated.",
        "You might like Love revolution on viki tv.",
        "Try BoJack Horseman as well. Insanely good show.",
        "Red Web is a good podcast on Internet mysteries, cryptids, unsolved mysteries and some true-crime as well. New episodes come out every Monday.\n\nDarknet Diaries is another great podcast that you should try out. It deals with the info-sec side of things a bit more, but you can feel the amount of work and research that's gone into making each episode. A couple of episodes have interviews with some *really* interesting characters. Episodes come out on alternate Tuesdays.",
        "If youbare seeing ads currently..then most likely thittham irandu with Aishwarya Rajesh as cop..murder thriller",
        "Themks 😚",
        "This show saved my relationship with my best friend and also saved me from going into full on depression. \n\nWill be forever thankful to bojack",
        "On 2 try out last podcast on the left. They're funny and cover a pretty diverse set of topics.",
        "For 1, you could try Cow Corner Cricket Cast. It's on YouTube. The podcast does have it's set of presentation problems but they speak a lot of sense.",
        "yes this is it..thanks",
        "Just finished mindhunter...what a great show...will there be 3rd season?",
        "I'm glad you liked that show. It gave me chills and a feeling of watching it again and again. Well, we all are waiting for the third season, I heard that the producer/some personnel gave the actors an open contract/freed them from contract. So I guess it's a bad news but we don't actually know.",
        "&gt;every single frame of the show is stunning enough to be kept as a wallpaper\n\nAbso-freakin-lutely",
        "Start watching anime people",
        "I loved how bizarre it gets at times. Feels just the right amount of chaotic.",
        "Any suggestions for good Political thrillers?",
        "Homeland! It was so edge of the seat stuff that my anxiety filled self stopped watching after season 3\n\nHouse of cards first few seasons are also insanely good. Then Kevin Spacey decided to play with children irl, and series lost its spark after he got cut from the show",
        "Mi TV is good bro, i've also got one, but a smaller one.",
        "Yeah tbh I went with mitv because it was the cheapest option",
        "Oh I've actually watched both of them, I'm a big political thriller fan that's why but thank you for recommending!",
        "Yeah bro..all the dialogues are neat...also actors playing the convicts did a really great job.All the interview scenes kept me hooked to the screen.I really wish they release one more season.",
        "Watch Kuruthi on Prime :\nhttps://app.primevideo.com/detail?gti=amzn1.dv.gti.10799f8c-8128-4887-b574-7d04d20aed9a&amp;ref_=atv_dp_share_mv&amp;r=web",
        "I watch it on Netflix."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "watching middleman satyajit ray anyone wants watch available youtube english subtitles heres link moviehttpswwwyoutubecomwatchvqemaupfrw currently watching psych first time fun show suggestions similar ill eventually done finished sons anarchy last month left hole tried handmaids tale stuck seasons thing call agent netflix french comedydrama series first think nothing new except bunch peoples work life drama around holds interest four seasons tehran apple tv spy thriller another israeli thriller grabbed attention fauda netflix series good trying real possible surprisingly neither shows side completely bad way american india content would one particularly iranisrael fauda israeli palestinian conflict watched talented mr ripley netflix old psychological thriller worth watch also watched mauritaruan courier good movies long goodbye really enjoyed watching movie much im gon na start reading philip marlowe series next month got inch tv rewatching planet netflix almost every single frame show stunning enough kept wallpaper heard ways scrubs may like psych watched yeonmi park podcast joe rogan want feel good watch life normal people north korea south indian series recently liv murder storyline watched ads want see movieserial someone help figure name launched thislast month discovered kdrama holy shit know missing love cheesy romcoms kdramas full every kdrama romantic lot also expectations relationships soared high pretty sure ill die single far ive watched love star legend blue sea okay okay king eternal monarch hi school love would strongly recommend watching okay okay everyone amazing characters well written supporting cast awesome sweet funny emotional dark really mixed bag started watching white lotus interested see make engaging watched till second episode red line great podcast discuss various geopolitical issues range experts topic watched episode tigray situation ethiopia first part three parts episode fantastic november story thanks subbed tv got best good enough im watching cosmos possible worlds need good podcast recommendations cricket mysteries conspiracies friend gave free netflix need recommendations help havent seen spielbergs debut film duel watched today love film brohappy find someone thinks arguably best action thriller ive ever seen dark halfway person interest loved number week episodes struggling get type episodes ozark sex education black mirror share review ive seen show mostly loved felt let episodes overall quite underrated might like love revolution viki tv try bojack horseman well insanely good show red web good podcast internet mysteries cryptids unsolved mysteries truecrime well new episodes come every monday darknet diaries another great podcast try deals infosec side things bit feel amount work research thats gone making episode couple episodes interviews really interesting characters episodes come alternate tuesdays youbare seeing ads currentlythen likely thittham irandu aishwarya rajesh copmurder thriller themks show saved relationship best friend also saved going full depression forever thankful bojack try last podcast left theyre funny cover pretty diverse set topics could try cow corner cricket cast youtube podcast set presentation problems speak lot sense yes itthanks finished mindhunterwhat great showwill rd season im glad liked show gave chills feeling watching well waiting third season heard producersome personnel gave actors open contractfreed contract guess bad news dont actually know gtevery single frame show stunning enough kept wallpaper absofreakinlutely start watching anime people loved bizarre gets times feels right amount chaotic suggestions good political thrillers homeland edge seat stuff anxiety filled self stopped watching season house cards first seasons also insanely good kevin spacey decided play children irl series lost spark got cut show mi tv good bro ive also got one smaller one yeah tbh went mitv cheapest option oh ive actually watched im big political thriller fan thats thank recommending yeah broall dialogues neatalso actors playing convicts really great joball interview scenes kept hooked screeni really wish release one season watch kuruthi prime watch netflix",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Watching \"The Middleman\" by Satyajit Ray. If anyone wants to watch it, it's available on Youtube with English subtitles. [Here's the link to movie.](https://www.youtube.com/watch?v=QEMA1upF0rw) Currently watching Psych for the first time. What a fun show! Any suggestions similar to this when I'll eventually be done? Finished Sons if Anarchy last month and is left a hole. Tried Handmaid's Tale, stuck with it for 3 seasons, not my thing. Call my agent | Netflix (French comedy-drama series). At first you think there is nothing new except a bunch of people’s work life and drama around that, but it holds your interest for all four seasons. Tehran | Apple TV + | spy - Thriller | This is another Israeli thriller that grabbed my attention after Fauda (Netflix). Both series are good in trying to be as real as possible. Surprisingly neither shows the other side completely bad the way most American or India content would do. This one in particularly about Iran-Israel. Fauda is about Israeli- Palestinian conflict. Watched The Talented Mr. Ripley on Netflix. And old psychological thriller worth a watch. Also watched the Mauritaruan and The Courier, both good movies. The Long Goodbye Really Enjoyed watching this movie, so much so that I'm gonna start reading the Philip Marlowe series from next month. got myself a 55 inch TV, so I am rewatching Our Planet on netflix. almost every single frame of the show is stunning enough to be kept as a wallpaper 'I have heard it both ways.' Scrubs may be, if you like Psych. Watched yeonmi park podcast with joe rogan. If you want to feel good about yourself watch it. It is about life of normal people in north korea. There was a South Indian series recently on liv with a murder storyline. I just watched some ads and want to see the movie/serial. Can someone help me figure out the name? It was launched this/last month I have just discovered kdrama and HOLY SHIT!!!!!!!! I did not know what I was missing. I love cheesy romcoms and kdramas are full of it. (Not every kdrama is romantic, but there are a lot of them). Also now my expectations from relationships have soared so high that I am pretty sure, I'll die single. So far I've watched My Love from the Star, Legend of the Blue Sea, It is Okay to Not be Okay, The King: Eternal Monarch and Hi School Love On. Would strongly recommend watching It's Okay to Not be Okay to everyone because it is amazing, the characters are very well written, the supporting cast is awesome, it is sweet and funny, emotional and dark, really a mixed bag. Started watching the white lotus , interested to see how they make it more engaging. Watched till the second episode. The Red Line is a great podcast. They discuss various geopolitical issues with a range of experts on the topic. I just watched an episode on the Tigray situation in Ethiopia. The first part (there were three parts to the episode) was fantastic November Story? Thanks, subbed Which TV you got? not the best but good enough for me I'm watching Cosmos : Possible Worlds Need some good podcast recommendations on 1. Cricket 2. Mysteries and conspiracies My friend gave me free Netflix now I need recommendations. Help. For those of you who haven't seen Spielberg's debut film Duel, do it. Watched it again today. i love this film bro.happy to find someone who thinks so too It's arguably the best action thriller I've ever seen. Dark Halfway through Person of Interest S2. I loved the \"Number of the Week\" episodes in S1 but struggling to get through those type of episodes in S2. Ozark, You, Sex Education, Black Mirror, share your review. I've seen the show and mostly I loved it, but I felt let down in 2 of the episodes. overall it is quite underrated. You might like Love revolution on viki tv. Try BoJack Horseman as well. Insanely good show. Red Web is a good podcast on Internet mysteries, cryptids, unsolved mysteries and some true-crime as well. New episodes come out every Monday. Darknet Diaries is another great podcast that you should try out. It deals with the info-sec side of things a bit more, but you can feel the amount of work and research that's gone into making each episode. A couple of episodes have interviews with some *really* interesting characters. Episodes come out on alternate Tuesdays. If youbare seeing ads currently..then most likely thittham irandu with Aishwarya Rajesh as cop..murder thriller Themks 😚 This show saved my relationship with my best friend and also saved me from going into full on depression. Will be forever thankful to bojack On 2 try out last podcast on the left. They're funny and cover a pretty diverse set of topics. For 1, you could try Cow Corner Cricket Cast. It's on YouTube. The podcast does have it's set of presentation problems but they speak a lot of sense. yes this is it..thanks Just finished mindhunter...what a great show...will there be 3rd season? I'm glad you liked that show. It gave me chills and a feeling of watching it again and again. Well, we all are waiting for the third season, I heard that the producer/some personnel gave the actors an open contract/freed them from contract. So I guess it's a bad news but we don't actually know. &gt;every single frame of the show is stunning enough to be kept as a wallpaper Abso-freakin-lutely Start watching anime people I loved how bizarre it gets at times. Feels just the right amount of chaotic. Any suggestions for good Political thrillers? Homeland! It was so edge of the seat stuff that my anxiety filled self stopped watching after season 3 House of cards first few seasons are also insanely good. Then Kevin Spacey decided to play with children irl, and series lost its spark after he got cut from the show Mi TV is good bro, i've also got one, but a smaller one. Yeah tbh I went with mitv because it was the cheapest option Oh I've actually watched both of them, I'm a big political thriller fan that's why but thank you for recommending! Yeah bro..all the dialogues are neat...also actors playing the convicts did a really great job.All the interview scenes kept me hooked to the screen.I really wish they release one more season. Watch Kuruthi on Prime : I watch it on Netflix."
}