{
    "id": "160sgxw",
    "title": "Need help of special educators to fill a questionnaire",
    "url": "https://www.reddit.com/r/india/comments/160sgxw/need_help_of_special_educators_to_fill_a/",
    "selftext": "Hi guys, my friend is doing research on disability and education and need some responses for her questionnaire regarding it.  \nIf any of you are special educators for intellectual disability, can you take a few minutes to answer a few questions?   \nYour help is greatly appreciated,[here's the link for the questionnaire](https://docs.google.com/forms/d/e/1FAIpQLSeptx6jMArasQZYUXsb1pW96YAezQ_y4n2pU2OTlkK3Veuhmw/viewform?usp=sf_link)`h`\n\n&#x200B;\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692949647.0,
    "convurl": "https://external-preview.redd.it/8ISKmC-AgwNe-xNpzz4ZA8yI-RdN26yYALC5mWvHvcc.jpg",
    "comments": [],
    "cleaned_text": "need help special educators fill questionnaire hi guys friend research disability education need responses questionnaire regarding special educators intellectual disability take minutes answer questions help greatly appreciatedheres link questionnairehttpsdocsgooglecomformsdefaipqlseptxjmarasqzyuxsbpwyaezqynpuotlkkveuhmwviewformuspsflinkh xb xb ",
    "cleaned_title": "need help special educators fill questionnaire",
    "cleaned_selftext": "hi guys friend research disability education need responses questionnaire regarding special educators intellectual disability take minutes answer questions help greatly appreciatedheres link questionnairehttpsdocsgooglecomformsdefaipqlseptxjmarasqzyuxsbpwyaezqynpuotlkkveuhmwviewformuspsflinkh xb xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Need help of special educators to fill a questionnaire",
    "light_cleaned_selftext": "Hi guys, my friend is doing research on disability and education and need some responses for her questionnaire regarding it. If any of you are special educators for intellectual disability, can you take a few minutes to answer a few questions? Your help is greatly appreciated,[here's the link for the questionnaire](https://docs.google.com/forms/d/e/1FAIpQLSeptx6jMArasQZYUXsb1pW96YAezQ_y4n2pU2OTlkK3Veuhmw/viewform?usp=sf_link)`h` &#x200B; &#x200B;",
    "light_cleaned_comments": ""
}