{
    "id": "13fg489",
    "title": "Queries regarding Kedarnath yatra",
    "url": "https://www.reddit.com/r/india/comments/13fg489/queries_regarding_kedarnath_yatra/",
    "selftext": "Hi guys, I need few suggestions/advices/opinions about my kedarnath yatra in june 2023 around below mentioned points.\n\n1. Is it mandatory to register on state tourism website even if I plan to visit just kedarnath and not the char dhams? What if someone doesn't or in case the registration is closed then what are the alternatives( as currently the registration is  closed due to adverse weather).\n\n2. While I am pretty fit guy with no underlying medical issues and have trekked in Himalayas before( max 14k feet) and  I am also aware of basic procedure and precautions but should I be extra cautious about something. I have come across  many news reports that around 300 people had died in char dham Yatra last year mostly due to health issues.\n\n\nhttps://www.google.com/amp/s/m.timesofindia.com/city/dehradun/311-char-dham-pilgrims-dead-in-2022-80-due-to-medical-reasons/amp_articleshow/94820817.cms\n\n3. Any one who has travelled this month or planning to do so and wants to share his/her experience is cordially welcome.",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 4,
    "created_utc": 1683884058.0,
    "convurl": "https://external-preview.redd.it/BTENsKQiSwHbpU2WeN36MTn8IlDnCarTennrl7-Y40o.jpg?auto=webp&v=enabled&s=f3249f149ca2793559d4a250e6ba3edcd641c565",
    "comments": [
        "I just came back from kedarnath 2 days ago, so feel free to ask anything.\n\nNow to answer your query:\n1. Yes yatra registration is mandatory even if you are travelling to just kedarnath. If you can’t register online there are counters in sonprayag where you can register offline.\n2. Yes the trek is a bit difficult not just because of terrain but also due to sudden change of weather within snap of a finger. So just be prepared for it. But if you are conditioned to treks that might not be a problem for you.\nFor the death toll there are plenty of people who don’t listen to cues of there body and try to challenge the mountains, which is never advised no matter now conditioned or healthy you are.",
        "I really appreciate your detailed reply.",
        "I am planning to visit kedarnath on 25th June 2023\n1. Yes the registration is Mandatoy as I have confirmed from my friends who had visited last month\n2. Also the trek difficulty is moderate but due to the crowd time to reach at top may be more so should plan accordingly\n\nLet me know if you are traveling on the same day"
    ],
    "cleaned_text": "queries regarding kedarnath yatra hi guys need suggestionsadvicesopinions kedarnath yatra june around mentioned points mandatory register state tourism website even plan visit kedarnath char dhams someone doesnt case registration closed alternatives currently registration closed due adverse weather pretty fit guy underlying medical issues trekked himalayas max k feet also aware basic procedure precautions extra cautious something come across many news reports around people died char dham yatra last year mostly due health issues one travelled month planning wants share hisher experience cordially welcome ",
    "cleaned_title": "queries regarding kedarnath yatra",
    "cleaned_selftext": "hi guys need suggestionsadvicesopinions kedarnath yatra june around mentioned points mandatory register state tourism website even plan visit kedarnath char dhams someone doesnt case registration closed alternatives currently registration closed due adverse weather pretty fit guy underlying medical issues trekked himalayas max k feet also aware basic procedure precautions extra cautious something come across many news reports around people died char dham yatra last year mostly due health issues one travelled month planning wants share hisher experience cordially welcome",
    "cleaned_comments": "came back kedarnath days ago feel free ask anything answer query yes yatra registration mandatory even travelling kedarnath cant register online counters sonprayag register offline yes trek bit difficult terrain also due sudden change weather within snap finger prepared conditioned treks might problem death toll plenty people dont listen cues body try challenge mountains never advised matter conditioned healthy really appreciate detailed reply planning visit kedarnath th june yes registration mandatoy confirmed friends visited last month also trek difficulty moderate due crowd time reach top may plan accordingly let know traveling day",
    "light_cleaned_title": "Queries regarding Kedarnath yatra",
    "light_cleaned_selftext": "Hi guys, I need few suggestions/advices/opinions about my kedarnath yatra in june 2023 around below mentioned points. 1. Is it mandatory to register on state tourism website even if I plan to visit just kedarnath and not the char dhams? What if someone doesn't or in case the registration is closed then what are the alternatives( as currently the registration is closed due to adverse weather). 2. While I am pretty fit guy with no underlying medical issues and have trekked in Himalayas before( max 14k feet) and I am also aware of basic procedure and precautions but should I be extra cautious about something. I have come across many news reports that around 300 people had died in char dham Yatra last year mostly due to health issues. 3. Any one who has travelled this month or planning to do so and wants to share his/her experience is cordially welcome.",
    "light_cleaned_comments": "I just came back from kedarnath 2 days ago, so feel free to ask anything. Now to answer your query: 1. Yes yatra registration is mandatory even if you are travelling to just kedarnath. If you can’t register online there are counters in sonprayag where you can register offline. 2. Yes the trek is a bit difficult not just because of terrain but also due to sudden change of weather within snap of a finger. So just be prepared for it. But if you are conditioned to treks that might not be a problem for you. For the death toll there are plenty of people who don’t listen to cues of there body and try to challenge the mountains, which is never advised no matter now conditioned or healthy you are. I really appreciate your detailed reply. I am planning to visit kedarnath on 25th June 2023 1. Yes the registration is Mandatoy as I have confirmed from my friends who had visited last month 2. Also the trek difficulty is moderate but due to the crowd time to reach at top may be more so should plan accordingly Let me know if you are traveling on the same day"
}