{
    "id": "12t0vrk",
    "title": "Plant lovers - what plants can I get for a North West facing window? (Pics attached for reference)",
    "url": "https://www.reddit.com/gallery/12t0vrk",
    "selftext": "What plants can I get? How would I arrange them? E.g. besides the window, or on the floor where they get max sunlight, or some climber plants around the curtain rod?\nThe windows get bright light during the afternoons, but it's of course not as bright in the mornings\nThis is in Mumbai, if that helps",
    "flair": "AskIndia",
    "score": 9,
    "num_comments": 13,
    "created_utc": 1682001404.0,
    "convurl": "https://i.redd.it/xt09f0r6w1va1.jpg",
    "comments": [
        "Image taken on Poco X2, in Mumbai. Unaware of exact dimensions",
        "Do you have pets? Some common houseplants can be incredibly toxic to cats and dogs.",
        "Get rubber plant. Put in on floor. It will get really tall and will look nice. \n\nGet dumbcane. It gets tall and easy to maintain. \n\nYou can do an array of tall plants or put few tall plants in corner on both side and in between add various indoor plants.",
        "Nope no pets. Any suggestions?",
        "Money plan, snake plant, dumbcane as zzviews recommended, aloe Vera, aglaonema, spider plant, croton, areca palm, caladium, to name a few are the hardest to kill for a beginner and not expensive considering you will also have to buy pots, stands and everything else. Rubber can be a bit iffy, do get one if you want to but I won’t recommend it to someone starting out.  You can also practically propagate those endlessly, so if you have family and friends around ask them for cutting. Else get them from a local nursery, the online rates are highway robbery.\n\nAs for decor, take a look at what those plants look like and plan accordingly. Greenery looks pretty no matter where to place them.",
        "If you want flowers Peace lily or Kalanchoe.",
        "Thanks a bunch. Will look into all those mentioned plants !",
        "Didn't consider flower plants, until now. Thanks for the suggestion !",
        "Yo, thanks. Tall plants should look dope near the window",
        "OP I must say that the photo looks quite calming and congratulations on the new house",
        "Haha thanks. Rent ka hi hai.",
        "Koi nahi bhai enjoy!"
    ],
    "cleaned_text": "plant lovers plants get north west facing window pics attached reference plants get would arrange eg besides window floor get max sunlight climber plants around curtain rod windows get bright light afternoons course bright mornings mumbai helps ",
    "cleaned_title": "plant lovers plants get north west facing window pics attached reference",
    "cleaned_selftext": "plants get would arrange eg besides window floor get max sunlight climber plants around curtain rod windows get bright light afternoons course bright mornings mumbai helps",
    "cleaned_comments": "image taken poco x mumbai unaware exact dimensions pets common houseplants incredibly toxic cats dogs get rubber plant put floor get really tall look nice get dumbcane gets tall easy maintain array tall plants put tall plants corner side add various indoor plants nope pets suggestions money plan snake plant dumbcane zzviews recommended aloe vera aglaonema spider plant croton areca palm caladium name hardest kill beginner expensive considering also buy pots stands everything else rubber bit iffy get one want wont recommend someone starting also practically propagate endlessly family friends around ask cutting else get local nursery online rates highway robbery decor take look plants look like plan accordingly greenery looks pretty matter place want flowers peace lily kalanchoe thanks bunch look mentioned plants didnt consider flower plants thanks suggestion yo thanks tall plants look dope near window op must say photo looks quite calming congratulations new house haha thanks rent ka hi hai koi nahi bhai enjoy",
    "light_cleaned_title": "Plant lovers - what plants can I get for a North West facing window? (Pics attached for reference)",
    "light_cleaned_selftext": "What plants can I get? How would I arrange them? E.g. besides the window, or on the floor where they get max sunlight, or some climber plants around the curtain rod? The windows get bright light during the afternoons, but it's of course not as bright in the mornings This is in Mumbai, if that helps",
    "light_cleaned_comments": "Image taken on Poco X2, in Mumbai. Unaware of exact dimensions Do you have pets? Some common houseplants can be incredibly toxic to cats and dogs. Get rubber plant. Put in on floor. It will get really tall and will look nice. Get dumbcane. It gets tall and easy to maintain. You can do an array of tall plants or put few tall plants in corner on both side and in between add various indoor plants. Nope no pets. Any suggestions? Money plan, snake plant, dumbcane as zzviews recommended, aloe Vera, aglaonema, spider plant, croton, areca palm, caladium, to name a few are the hardest to kill for a beginner and not expensive considering you will also have to buy pots, stands and everything else. Rubber can be a bit iffy, do get one if you want to but I won’t recommend it to someone starting out. You can also practically propagate those endlessly, so if you have family and friends around ask them for cutting. Else get them from a local nursery, the online rates are highway robbery. As for decor, take a look at what those plants look like and plan accordingly. Greenery looks pretty no matter where to place them. If you want flowers Peace lily or Kalanchoe. Thanks a bunch. Will look into all those mentioned plants ! Didn't consider flower plants, until now. Thanks for the suggestion ! Yo, thanks. Tall plants should look dope near the window OP I must say that the photo looks quite calming and congratulations on the new house Haha thanks. Rent ka hi hai. Koi nahi bhai enjoy!"
}