{
    "id": "14wjhbo",
    "title": "Our roads system is the biggest failure in the world. We can build new projects and spend Billions but it’s sickening to see Auto/ bus/ Bolero/scooty Pick up trucks break every possible rule and put innocent people in danger every day.",
    "url": "https://www.reddit.com/r/india/comments/14wjhbo/our_roads_system_is_the_biggest_failure_in_the/",
    "selftext": "Recently there was a School bus which was driving fast on a freaking highway and it collided into a car which was driving on the correct side \n\nDid the car driver commit any mistake? They were minding their own business and were driving on the correct side of the road \n\nThe bus drivers/ Bolero pick up truck drivers/ Auto drivers and some Scooty/ bike drivers abuse the roads so hard that it becomes a pain to drive. \n\nPune, Mumbai, Chennai, Banglore, Delhi, etc I’ve driven in many cities and the situation just keeps getting worse\n\nWhy is RTO office one of the. Most corrupt offices in India? I had applied everything online as per the protocol and had gone to the RTO. They made me wait and kept postponing my process and finally one agent came to me and told that the officer will keep rejecting unless and until the papers go through him. \n\nHe asked me to give him some cash and Voila!! The officer signed the papers. \n\nEven when it came to driving test, I drove the car properly, took U turns, drove in reverse and went through all the gears as advised. \n\nThe guys before me literally almost crashed the car but they all got license approved after they paid bribes. \n\nWe seriously need to do something to get rid of the mediocrity in this country\n\n https://m.timesofindia.com/videos/toi-original/cctv-at-least-5-killed-in-horrific-school-bus-suv-collision-on-delhi-meerut-expressway/amp_videoshow/101655898.cms",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689058282.0,
    "convurl": "https://external-preview.redd.it/XOiEZ4bTbU0cPLssVoAShpOR36PMotkQZYw1Wg4jCa8.jpg?auto=webp&s=4c3bfa9bc72d3429d0763084ff157c682b98afbe",
    "comments": [
        "So your problem is with the people and not the road system?",
        "Road system is Just one piece of the puzzle..",
        "None of the problems mentioned by op are caused by the road system? He mentioned corruption and speeding and they are both human issues, not the roads. He could've added a point about the actual roads if he was blaming them",
        "We were once driving on the highway to Jaipur. A bolero was coming right at us from the opposite direction. The driver had the audacity to curse us for blocking his path. He felt so entitled to drive on the wrong side of the road. \n\nPS: My driving instructor told me that if you drive as per the rules, you are making a mistake. No one follows the rules here, and if you try to do that, you will confuse everyone.",
        "The PS is gold",
        "Vehicle dependency and non-walkable cities, and less public transit. Personal vehicles are inefficient about 6 to 10 times worse than a bus. With a population like India, you can make the entire Country Asphalt road and it still won't be enough.",
        "It's not only road system even railways are also corrupted.",
        "The problem is the people, and I am not sorry if saying this hurts anyone.\n\nThere is only so much policing you can do, eventually people have to be the ones following the rules.\n\nI have seen idiots jumping Red lights even where there are CCTVs installed, and challans are mailed to your house.(in Chandigarh).\n\nI have seen these morons drive on the wrong side for half a kilometer, to save 200meters of extra travel distance.\n\nI have also seen truck drivers getting beat up and arrested for negligent driving, because the driver of the car coming from the wrong side was injured after he hit the truck.\n\nThere are nincompoops driving at 40kmph on the middle of a highway where max allowed speed is 100. Really asshole? \n\nThen there is the overspeeding zig-zagging assclown, who acts like you owe it to him to give way. \n\nThen there are lane jumping idiots on a single lane road during a traffic jam, only to block the oncoming traffic.\n\nThe loud horns, fake VIP lights & sirens, the list never ends. \n\nDon't even get me started on the bikers. If you're in a car, you'll be at fault if anything happens to the biker even if it were due to their own actions. \n\nWhy are you with your family, including a small kid, on a bike, with everyone without a helmet?! \n\nAnd you expect me to look out for your safety? \n\nThe reality is that even after following the law on the road, you can end up in jail. The application of law is inversely proportional to the size of the vehicle, and the crowd you can muster at the scene of accident. #thishappensonlyinIndia\n\nEveryday venturing out on the road is testing the limits of sanity.",
        "My shoes got ruined few days back because of water filled pothole so u got ur answer",
        "the person with the costlier vehicle is always considered wrong in road accidents. Had it been the car driver driving on the wrong side and kill the bus driver, people would have lynched the car owner and cried about how the bus driver had a billion kids to feed and 69 wives to ~~abuse~~ support. Idiots on whatsapp would have cried about how rich people people are destroying the nation while themselves sitting on their asses collecting pensions.",
        "I had an accident in 2022 which caused damage of over 5L all because a truck was trying to overtake from a blind cut. \n\nMy car is still not the same.",
        "Sad reality",
        "The best solution i can think of is to have some kind of incentive program with monetary benefits for reporting offenders, let's say if the fine was 500 you get 50 for reporting it.\n\nWe have so many people who not nothing better to do 😄 they will make thousands everyday & everyone will be worried that they may get reported for any violation",
        "The first and foremost problem is the population of India.",
        "> Why is RTO office one of the. Most corrupt offices in India? I had applied everything online as per the protocol and had gone to the RTO. They made me wait and kept postponing my process and finally one agent came to me and told that the officer will keep rejecting unless and until the papers go through him. \n\nI took driving test 3 times by applying by myself. Failed 3 times. Paid the agent outside 4k and I got my license 3 months later. Did not even take any tests. \n\nSome enlightened people look down on those who pay the bribe to get things done, but they don't understand that we lack a choice in that matter. Without a license I'd have to wait for someone to drop me off or take auto/cab. If caught by police I'd have to pay a bribe to them too. \n\nOnce I got stopped by traffic police and I did not have my license with me. He wanted 500 but I only had 40/- with me. He patted me down, checked my pockets and took that 40/- and let me go. That incident was the reason I paid an agent to get me a license. \n\nAuto drivers are the worst. In Andhra bus drivers are mostly from APSRTC and drive sedately. It is autos with their lights mounted up high which cause accidents on roads. Just yesterday one auto was parked on my street with it's lights on. It had a dozen lights mounted above windshield and I couldn't see anything. When I asked him to turn off the lights as I was trying to go out, he got out of auto and got aggressive. Luckily lot of people around me were my neighbors and they supported me. He did not switch off the light but left. \n\nPolice don't fine the autos which mount powerful lights dangerously and install strobe lights on back. They don't even fine the chapris who mount strobe lights everywhere. \n\nWhen a teenager crashed into my cousins car we got the scooty number and complained  to police. That teenager left quickly leaving us with a broken bumper and fig light. His parents came to station and everyone started blaming us including the police. We were painted as the bad guys for going to police for a child. The father of teenager had the audacity to say \"scratches are normal for car. It is meant to take you from place to place. car is working so what is the problem?\". \n\n&#x200B;\n\nGovernment doesn't care. People don't care. Everything's gone shite.",
        "I will tell you a simple thing: India is doomed...the powerful backings of groups and communities who favour the govt officials and vice versa. This cycle will not end at any stage, not in this era. Bribes and corruption, this entire system is bound to fall..my take is that India will not become a superpower and new uprisings will happen(riots and clashes more and more like Odisha)",
        "Every single time this type of discussion happens, there is always one person that blames the roads. Yes the roads are bad but a majority of accidents happen because the person driving the vehicle is at fault.",
        "Not the roads but maybe the traffic regulations. Most of the things you talk about are to do how we are using what we have. And I agree with you. I live in Noida and it has been receiving a major road overhaul, great bridges, underpasses, interchanges but the traffic continues to stop at red lights for the left slip lane, erickshaws/auto cramming the slip or the stop lanes, people overtaking from everything but the first lane.",
        "Yep this is a rule I learned myself few months into driving on roads.",
        "I can see retired society unkills salivating at this idea",
        "Can’t teach common sense to idiots like these. \n\nHow can anyone prevent these things from happening? \n\nShould the bus driver get a death sentence for killing 6 innocent people just because of his negligence?",
        "Leave India",
        "While driving, it becomes quite apparent that many individuals lack fundamental civic awareness. It appears that the responsibility to ensure the safety of others is not perceived as their own duty but rather as something that rests solely on other drivers.",
        "Indian roads are truly a circus. I recently got my own bike and now I have sudden intrusive thoughts about crashing because of how unpredictable all the traffic is",
        "Quality of Indian drivers is shocking. One reason is it’s so easy to bribe and get DL, that too DL comes with validity of 20 years!\n\nIn the US you barely get DL validity for 3-4 years and then you need to renew and they’ll check your ability to drive each time. This is required to maintain standard driver quality imo. \n\nThis is not even considering attitudes of drivers towards pedestrians lol",
        "death is the only solution to all these problems :(",
        "well then there will be nothing but offenses and mostly fake ones wasting the time of the police",
        "COVID did not kill enough of us",
        "or... just leave this country",
        "LMFAOOOO 💀🙏",
        "I was learning to drive In a semi rural area. The road wasn’t too broad. There was a bike coming from the opposite side. I tried making some space for the bike by moving to the side. My driving instructor immediately turned the steering to bring the car back to the middle of the road and spewed this golden wisdom angrily “The road belongs to you. Never give space. Let the other vehicle do it.”",
        "WTF are u talking about\n\nWe are the vishwa guru with 5 trillion tonne economy\n\n✌️",
        "The times that I have been in near death situations on my bike are astonishing",
        "It's interesting how similar the OP is presenting India to russia the moment one leaves Moscow and St. Petersburg.",
        "Car drivers of all types are not better. I routinely find them jumping signals some even thing they are autos; driving on the wrong side for shortest route or for overtaking others stuck in traffic and then they have the audacity to not even go back, just jam traffic till the traffic moves so they can insert themselves in. It is no longer the uneducated or undereducated driving jeeps either. \n\nTier 2 cities are worse even. Everyone jumps signal as if they are prime minister or driving ambulance. A truck driver tried to overtake using ambulance as the front man yesterday driving on the wrong side. It isn't even hard to install cameras on traffic signals if they can't stop them or fine them just make every signal roundabout. Why punish rule followers with multi minute signals.",
        "Drain the swamp",
        "my dad who was never admitted in hospital had met with accident and broke his hip as someone was using high beam light and a pothole on the road. Got surgery at the age of 70 but couldn't recover from it and passed away. It was painful to see for someone mistake my father paid the price. There are 100's of such events happening which doesn't gets reported. \n\nBlame roads? Blame driver with high beam? Blame RTO? Not sure whom to blame here.",
        "My favorite are two wheelers who enter main roads without stopping to watch out for traffic already on the road. \n\nThey give zero shits and it's your responsibility to save their lives. If you by chance hit them with a four wheeler then everyone will blame the guy in the car because Indians don't see past class / their own perceptions.",
        "There's this thing called civic duty as well. You could have the best roads in the world but if you don't know how to use it then it's useless.",
        "Living in Amrit kaal",
        "What happened in odisha ?",
        "Why r u blaming the roads 😂",
        "> The problem is the people, and I am not sorry if saying this hurts anyone.\n\nI completely disagree. Problem is the infrastructure. If people follow traffic 'laws' to their full extent then nothing will ever get done with the current infra. \n\nAn extreme example: It's practically impossible to 'legally' cross a street in most cities since the zebra crossing never gets painted. \n\nIt's like Broken Windows Theory but for Broken Roads.",
        "Indians are dumb as fuck. I was walking on the footpath next to a busy road and a guy came rushing from behind on his bike on the footpath. The signal was red and this  clown did not want to wait. He even had the gall to honk at me and ask me to move.",
        "Indians strongly believe in random freedom of movement on the roads /S",
        "So true. I’m back to India from the USA for a month long vacation, and after getting used to driving over there, I simply couldn’t drive my manual transmission car here. Road discipline has gone down the drain. I can list tens of wrong doings I witness every day. Had to book an automatic transmission car for the month to drive with a bit of a free mind.",
        "If you drive in India, you’ll realize common sense is not that common. Your slow lane is on the far left and you overtake on the right for gods sake. I have never seen anyone do that. Most of the drivers overtake from the left and drive/ sit in the right lane forever without merging into the left lane.",
        "The ease of getting driving license without knowing anything about proper road manners and no test on an actual road is the cause. India's traffic and road are probably never improving. Not in a 100 years.",
        "My father told me once that assume everyone who is driving on indian roadster are idiots and your safety on the road is only your responsibility",
        "I remember one time, first time I visited India, we were looking for a hotel in Delhi and asked a policeman for directions. I was speechless when he told us to drive on the opposing side to get to the hotel. \n\nAfter I spent a couple more days driving around India, I understood. \n\nI think the problem is a combination of infrastructure and overpopulation. You'll notice the craziness most in the high density cities. Outside of cities people drive relatively normally. \n\nThe thing is, it doesn't matter what time of day it is, or what direction you are going in, in India, there is ALWAYS someone else going in that direction, and every other direction. Traffic is like a continually flowing fluid. \n\nIn many other countries there will be a regular natural break in traffic, to allow you to make a right turn across lanes(for example). But if you try to just wait for a break in traffic in Indian cities, you'll be waiting all day. This forces you (and everyone else) to force your way into the intersection because you have no other option. \n\nMaybe traffic lights would help but I'm not even sure if that would work in the busiest places.",
        "I'm sick and tired of people driving wrongway. I make sure teach a lesson to each and every individual that threatens my life by doing so, on a daily basis. I make sure I school them right. These stupid uncle's sometimes just keep yelling thinking it's gonna make some sense if they shout it out loud. Useless people. Nobody should be given a licence without a comprehensive test. God knows how many people are killed by negligence of some moronic drivers. All these truck drivers also drive drunk. No action is being taken.",
        "How is this a failure of the system and not a failure of all of us individuals??",
        "And can we do something about the wildlife?! Stray dogs, cows, bulls basically anything that moves is always on the road. And they move in herds! This lead to a lot of deaths in my town. \n\nAnd I sincerely apologise if I offended Hinduism, I didn't mean to and I understand they are sacred to you, but I myself almost crashed into one when it suddenly showed up around the corner of a street.",
        "DL is only valid for 5 years nowadays",
        "Fake ones would be penalised?",
        "Lack of civic sense ?  Why are we surprised?",
        "Bro couldn't even pass the DL test",
        "Roads arent the failure, people themselves are!",
        "Sameer, you're breaking the CAAAARRR!!",
        "Here in Germany you need to be certified in giving CPR even before you are eligible to give driving test.",
        "The Most annoying problem I had with Indian roads is that no matter which city i am driving in is that most people always have their vehicle in fucking high beam. Why do this? are they not educated about high beam or low beam in driving schools? \n\nThis problem might seem like a small annoyance but it does lead to accidents and deaths. You can get your entire vision blocked by a single car on an already narrow road in middle of a city, Fucking city, High beams are meant for highways on the outskirts not cities with ample of light.",
        "Exactly! This freakshow that goes on on our roads everyday has been perfectly evocated by you! Two things most Indians don’t have respect for is public property and secondly, a concern for other people’s safety. Sad to see so many lives being lost everyday in this banana country.",
        "You understood it better than most people.\n\n\"But if you try to just wait for a break in traffic in Indian cities, you'll be waiting all day. This forces you (and everyone else) to force your way into the intersection because you have no other option\"\n\nThis is exactly what happens. A simple residential area lane in India can have as much traffic a busy city road in Europe.",
        "It's pretty sad, I really hope the ministry of transport forces the RTO to implement safe driving rules",
        "Self - Accountability, Education , Awareness & Automated enforcement like China has done. Manually policing a country of this size will only result in corruption.",
        "That bribery depends on state",
        "I had an accident in night in a freaking National Highway because there were no lights and all of a sudden the road became sandy, which made it hard to slow down. Before I could stop, I saw a heap of mud as tall as a car in front of me. I knew I would not be able to stop in time and a jump was the only way so I stood on my bike and braced for the landing. The landing was not perfect because my front tyre slipped on the peak and my bike leaned right. My right knee and elbow took impact from the ground and because of my crash guards, saddle stay and me standing up, my knee barely escaped the 200kg bike's fall on it. I got up and saw that I landed on an almost constructed part of a small bridge with a canal underneath it. The part was not connected to the road on any side and had I been a little slower, I would have landed in the gap between the road and the bridge. \n\nAfter a hefty bill of 30k and my bike sitting at the service centre for 2 months I spent another 2 months in regaining the confidence.\nSo I repeat the words of Oggy F, \"Ride safe, it's a freaking jungle out there.\"",
        "Renewal is an easy process. Skills are not reevaluated. Only people who got their DL suspended will have an issue, which typically happens in case of drunk driving, hurting someone in a work zone, accumulating points beyond the state limit etc.,",
        "Simple, make all the tests automatic with every possible rule, blind spot, turning, indicator, road signs and several others.",
        "Culture seems to be very pathetic and toxic... How can a country even work with so much bribery and lethal stupidity?",
        "Completely disagree ?\n\nGuess you have never gotten stuck in traffic in NCR areas (or sometimes in New Delhi) where drivers won’t have any qualms driving on the opposite side of road just to circumvent the situation. \n\nNow knowing fully well, we have average to good traffic infra in NCR - who do you think is to be blamed here?",
        "They failed me intentionally. I studied for written test(it's computerized now) and practised the maneuvers. \nI had paid for driving classes and practised for over 1 year before attempting to apply for driving licence.",
        "During renewal, how do they check your ability to drive?\nAfaik there are bo driving tests for renewal, and older people who don’t know how to drive, easily get their renewals.\nThe only thing is maybe, eye tests and such",
        "14hrs damn , still no \\[ Removed by Reddit. \\]",
        "As long as we are proud of being jugadu, and of breaking rules regardless of apparent benefit, this will not change.",
        "OP is right about people not following the rules except how he forgot car drivers in there. As if car drivers are the only poor souls driving properly, while everyone is 'abusing the roads'.\n\nMost of the time cars (and others too) wont even stop before footpath during redlight. Car drivers are the quickest to get angry and awful with everyone else bc they're better than others in their mind.\n\nOfc it's basically how we're all raised. Rules and laws aren't essentially important and they can be twisted and followed acc to your own convenience.",
        "Lo aj hi new me aa gaya.. an accident on Delhi Meerut Highway because the bus was driving on the opposite road.",
        "Traffic in India is like motor vehicles being driven by apes.  The RTOs are a fuckin joke. Too many people die too young for absolutely no reason. It's like an epidemic. \nI almost went bankrupt learning to drive and had to prepare for the driving exams ( theory and practicals) no less than board exams in India. Btw this is in Germany. The whole DL thing takes almost a year to accomplish.  Parents throw parties when their children get their DL.",
        "Footpaths are so underrated in India. In the rest of the civilized world they are a necessity and taken for granted."
    ],
    "cleaned_text": "roads system biggest failure world build new projects spend billions sickening see auto bus boleroscooty pick trucks break every possible rule put innocent people danger every day recently school bus driving fast freaking highway collided car driving correct side car driver commit mistake minding business driving correct side road bus drivers bolero pick truck drivers auto drivers scooty bike drivers abuse roads hard becomes pain drive pune mumbai chennai banglore delhi etc ive driven many cities situation keeps getting worse rto office one corrupt offices india applied everything online per protocol gone rto made wait kept postponing process finally one agent came told officer keep rejecting unless papers go asked give cash voila officer signed papers even came driving test drove car properly took u turns drove reverse went gears advised guys literally almost crashed car got license approved paid bribes seriously need something get rid mediocrity country ",
    "cleaned_title": "roads system biggest failure world build new projects spend billions sickening see auto bus boleroscooty pick trucks break every possible rule put innocent people danger every day",
    "cleaned_selftext": "recently school bus driving fast freaking highway collided car driving correct side car driver commit mistake minding business driving correct side road bus drivers bolero pick truck drivers auto drivers scooty bike drivers abuse roads hard becomes pain drive pune mumbai chennai banglore delhi etc ive driven many cities situation keeps getting worse rto office one corrupt offices india applied everything online per protocol gone rto made wait kept postponing process finally one agent came told officer keep rejecting unless papers go asked give cash voila officer signed papers even came driving test drove car properly took u turns drove reverse went gears advised guys literally almost crashed car got license approved paid bribes seriously need something get rid mediocrity country",
    "cleaned_comments": "problem people road system road system one piece puzzle none problems mentioned op caused road system mentioned corruption speeding human issues roads couldve added point actual roads blaming driving highway jaipur bolero coming right us opposite direction driver audacity curse us blocking path felt entitled drive wrong side road ps driving instructor told drive per rules making mistake one follows rules try confuse everyone ps gold vehicle dependency nonwalkable cities less public transit personal vehicles inefficient times worse bus population like india make entire country asphalt road still wont enough road system even railways also corrupted problem people sorry saying hurts anyone much policing eventually people ones following rules seen idiots jumping red lights even cctvs installed challans mailed housein chandigarh seen morons drive wrong side half kilometer save meters extra travel distance also seen truck drivers getting beat arrested negligent driving driver car coming wrong side injured hit truck nincompoops driving kmph middle highway max allowed speed really asshole overspeeding zigzagging assclown acts like owe give way lane jumping idiots single lane road traffic jam block oncoming traffic loud horns fake vip lights sirens list never ends dont even get started bikers youre car youll fault anything happens biker even due actions family including small kid bike everyone without helmet expect look safety reality even following law road end jail application law inversely proportional size vehicle crowd muster scene accident thishappensonlyinindia everyday venturing road testing limits sanity shoes got ruined days back water filled pothole u got ur answer person costlier vehicle always considered wrong road accidents car driver driving wrong side kill bus driver people would lynched car owner cried bus driver billion kids feed wives abuse support idiots whatsapp would cried rich people people destroying nation sitting asses collecting pensions accident caused damage l truck trying overtake blind cut car still sad reality best solution think kind incentive program monetary benefits reporting offenders lets say fine get reporting many people nothing better make thousands everyday everyone worried may get reported violation first foremost problem population india rto office one corrupt offices india applied everything online per protocol gone rto made wait kept postponing process finally one agent came told officer keep rejecting unless papers go took driving test times applying failed times paid agent outside k got license months later even take tests enlightened people look pay bribe get things done dont understand lack choice matter without license id wait someone drop take autocab caught police id pay bribe got stopped traffic police license wanted patted checked pockets took let go incident reason paid agent get license auto drivers worst andhra bus drivers mostly apsrtc drive sedately autos lights mounted high cause accidents roads yesterday one auto parked street lights dozen lights mounted windshield couldnt see anything asked turn lights trying go got auto got aggressive luckily lot people around neighbors supported switch light left police dont fine autos mount powerful lights dangerously install strobe lights back dont even fine chapris mount strobe lights everywhere teenager crashed cousins car got scooty number complained police teenager left quickly leaving us broken bumper fig light parents came station everyone started blaming us including police painted bad guys going police child father teenager audacity say scratches normal car meant take place place car working problem xb government doesnt care people dont care everythings gone shite tell simple thing india doomedthe powerful backings groups communities favour govt officials vice versa cycle end stage era bribes corruption entire system bound fallmy take india become superpower new uprisings happenriots clashes like odisha every single time type discussion happens always one person blames roads yes roads bad majority accidents happen person driving vehicle fault roads maybe traffic regulations things talk using agree live noida receiving major road overhaul great bridges underpasses interchanges traffic continues stop red lights left slip lane erickshawsauto cramming slip stop lanes people overtaking everything first lane yep rule learned months driving roads see retired society unkills salivating idea cant teach common sense idiots like anyone prevent things happening bus driver get death sentence killing innocent people negligence leave india driving becomes quite apparent many individuals lack fundamental civic awareness appears responsibility ensure safety others perceived duty rather something rests solely drivers indian roads truly circus recently got bike sudden intrusive thoughts crashing unpredictable traffic quality indian drivers shocking one reason easy bribe get dl dl comes validity years us barely get dl validity years need renew theyll check ability drive time required maintain standard driver quality imo even considering attitudes drivers towards pedestrians lol death solution problems well nothing offenses mostly fake ones wasting time police covid kill enough us leave country lmfaoooo learning drive semi rural area road wasnt broad bike coming opposite side tried making space bike moving side driving instructor immediately turned steering bring car back middle road spewed golden wisdom angrily road belongs never give space let vehicle wtf u talking vishwa guru trillion tonne economy times near death situations bike astonishing interesting similar op presenting india russia moment one leaves moscow st petersburg car drivers types better routinely find jumping signals even thing autos driving wrong side shortest route overtaking others stuck traffic audacity even go back jam traffic till traffic moves insert longer uneducated undereducated driving jeeps either tier cities worse even everyone jumps signal prime minister driving ambulance truck driver tried overtake using ambulance front man yesterday driving wrong side isnt even hard install cameras traffic signals cant stop fine make every signal roundabout punish rule followers multi minute signals drain swamp dad never admitted hospital met accident broke hip someone using high beam light pothole road got surgery age couldnt recover passed away painful see someone mistake father paid price events happening doesnt gets reported blame roads blame driver high beam blame rto sure blame favorite two wheelers enter main roads without stopping watch traffic already road give zero shits responsibility save lives chance hit four wheeler everyone blame guy car indians dont see past class perceptions theres thing called civic duty well could best roads world dont know use useless living amrit kaal happened odisha r u blaming roads problem people sorry saying hurts anyone completely disagree problem infrastructure people follow traffic laws full extent nothing ever get done current infra extreme example practically impossible legally cross street cities since zebra crossing never gets painted like broken windows theory broken roads indians dumb fuck walking footpath next busy road guy came rushing behind bike footpath signal red clown want wait even gall honk ask move indians strongly believe random freedom movement roads true im back india usa month long vacation getting used driving simply couldnt drive manual transmission car road discipline gone drain list tens wrong doings witness every day book automatic transmission car month drive bit free mind drive india youll realize common sense common slow lane far left overtake right gods sake never seen anyone drivers overtake left drive sit right lane forever without merging left lane ease getting driving license without knowing anything proper road manners test actual road cause indias traffic road probably never improving years father told assume everyone driving indian roadster idiots safety road responsibility remember one time first time visited india looking hotel delhi asked policeman directions speechless told us drive opposing side get hotel spent couple days driving around india understood think problem combination infrastructure overpopulation youll notice craziness high density cities outside cities people drive relatively normally thing doesnt matter time day direction going india always someone else going direction every direction traffic like continually flowing fluid many countries regular natural break traffic allow make right turn across lanesfor example try wait break traffic indian cities youll waiting day forces everyone else force way intersection option maybe traffic lights would help im even sure would work busiest places im sick tired people driving wrongway make sure teach lesson every individual threatens life daily basis make sure school right stupid uncles sometimes keep yelling thinking gon na make sense shout loud useless people nobody given licence without comprehensive test god knows many people killed negligence moronic drivers truck drivers also drive drunk action taken failure system failure us individuals something wildlife stray dogs cows bulls basically anything moves always road move herds lead lot deaths town sincerely apologise offended hinduism didnt mean understand sacred almost crashed one suddenly showed around corner street dl valid years nowadays fake ones would penalised lack civic sense surprised bro couldnt even pass dl test roads arent failure people sameer youre breaking caaaarrr germany need certified giving cpr even eligible give driving test annoying problem indian roads matter city driving people always vehicle fucking high beam educated high beam low beam driving schools problem might seem like small annoyance lead accidents deaths get entire vision blocked single car already narrow road middle city fucking city high beams meant highways outskirts cities ample light exactly freakshow goes roads everyday perfectly evocated two things indians dont respect public property secondly concern peoples safety sad see many lives lost everyday banana country understood better people try wait break traffic indian cities youll waiting day forces everyone else force way intersection option exactly happens simple residential area lane india much traffic busy city road europe pretty sad really hope ministry transport forces rto implement safe driving rules self accountability education awareness automated enforcement like china done manually policing country size result corruption bribery depends state accident night freaking national highway lights sudden road became sandy made hard slow could stop saw heap mud tall car front knew would able stop time jump way stood bike braced landing landing perfect front tyre slipped peak bike leaned right right knee elbow took impact ground crash guards saddle stay standing knee barely escaped kg bikes fall got saw landed almost constructed part small bridge canal underneath part connected road side little slower would landed gap road bridge hefty bill k bike sitting service centre months spent another months regaining confidence repeat words oggy f ride safe freaking jungle renewal easy process skills reevaluated people got dl suspended issue typically happens case drunk driving hurting someone work zone accumulating points beyond state limit etc simple make tests automatic every possible rule blind spot turning indicator road signs several others culture seems pathetic toxic country even work much bribery lethal stupidity completely disagree guess never gotten stuck traffic ncr areas sometimes new delhi drivers wont qualms driving opposite side road circumvent situation knowing fully well average good traffic infra ncr think blamed failed intentionally studied written testits computerized practised maneuvers paid driving classes practised year attempting apply driving licence renewal check ability drive afaik bo driving tests renewal older people dont know drive easily get renewals thing maybe eye tests hrs damn still removed reddit long proud jugadu breaking rules regardless apparent benefit change op right people following rules except forgot car drivers car drivers poor souls driving properly everyone abusing roads time cars others wont even stop footpath redlight car drivers quickest get angry awful everyone else bc theyre better others mind ofc basically raised rules laws arent essentially important twisted followed acc convenience lo aj hi new aa gaya accident delhi meerut highway bus driving opposite road traffic india like motor vehicles driven apes rtos fuckin joke many people die young absolutely reason like epidemic almost went bankrupt learning drive prepare driving exams theory practicals less board exams india btw germany whole dl thing takes almost year accomplish parents throw parties children get dl footpaths underrated india rest civilized world necessity taken granted",
    "light_cleaned_title": "Our roads system is the biggest failure in the world. We can build new projects and spend Billions but it’s sickening to see Auto/ bus/ Bolero/scooty Pick up trucks break every possible rule and put innocent people in danger every day.",
    "light_cleaned_selftext": "Recently there was a School bus which was driving fast on a freaking highway and it collided into a car which was driving on the correct side Did the car driver commit any mistake? They were minding their own business and were driving on the correct side of the road The bus drivers/ Bolero pick up truck drivers/ Auto drivers and some Scooty/ bike drivers abuse the roads so hard that it becomes a pain to drive. Pune, Mumbai, Chennai, Banglore, Delhi, etc I’ve driven in many cities and the situation just keeps getting worse Why is RTO office one of the. Most corrupt offices in India? I had applied everything online as per the protocol and had gone to the RTO. They made me wait and kept postponing my process and finally one agent came to me and told that the officer will keep rejecting unless and until the papers go through him. He asked me to give him some cash and Voila!! The officer signed the papers. Even when it came to driving test, I drove the car properly, took U turns, drove in reverse and went through all the gears as advised. The guys before me literally almost crashed the car but they all got license approved after they paid bribes. We seriously need to do something to get rid of the mediocrity in this country",
    "light_cleaned_comments": "So your problem is with the people and not the road system? Road system is Just one piece of the puzzle.. None of the problems mentioned by op are caused by the road system? He mentioned corruption and speeding and they are both human issues, not the roads. He could've added a point about the actual roads if he was blaming them We were once driving on the highway to Jaipur. A bolero was coming right at us from the opposite direction. The driver had the audacity to curse us for blocking his path. He felt so entitled to drive on the wrong side of the road. PS: My driving instructor told me that if you drive as per the rules, you are making a mistake. No one follows the rules here, and if you try to do that, you will confuse everyone. The PS is gold Vehicle dependency and non-walkable cities, and less public transit. Personal vehicles are inefficient about 6 to 10 times worse than a bus. With a population like India, you can make the entire Country Asphalt road and it still won't be enough. It's not only road system even railways are also corrupted. The problem is the people, and I am not sorry if saying this hurts anyone. There is only so much policing you can do, eventually people have to be the ones following the rules. I have seen idiots jumping Red lights even where there are CCTVs installed, and challans are mailed to your house.(in Chandigarh). I have seen these morons drive on the wrong side for half a kilometer, to save 200meters of extra travel distance. I have also seen truck drivers getting beat up and arrested for negligent driving, because the driver of the car coming from the wrong side was injured after he hit the truck. There are nincompoops driving at 40kmph on the middle of a highway where max allowed speed is 100. Really asshole? Then there is the overspeeding zig-zagging assclown, who acts like you owe it to him to give way. Then there are lane jumping idiots on a single lane road during a traffic jam, only to block the oncoming traffic. The loud horns, fake VIP lights & sirens, the list never ends. Don't even get me started on the bikers. If you're in a car, you'll be at fault if anything happens to the biker even if it were due to their own actions. Why are you with your family, including a small kid, on a bike, with everyone without a helmet?! And you expect me to look out for your safety? The reality is that even after following the law on the road, you can end up in jail. The application of law is inversely proportional to the size of the vehicle, and the crowd you can muster at the scene of accident. #thishappensonlyinIndia Everyday venturing out on the road is testing the limits of sanity. My shoes got ruined few days back because of water filled pothole so u got ur answer the person with the costlier vehicle is always considered wrong in road accidents. Had it been the car driver driving on the wrong side and kill the bus driver, people would have lynched the car owner and cried about how the bus driver had a billion kids to feed and 69 wives to ~~abuse~~ support. Idiots on whatsapp would have cried about how rich people people are destroying the nation while themselves sitting on their asses collecting pensions. I had an accident in 2022 which caused damage of over 5L all because a truck was trying to overtake from a blind cut. My car is still not the same. Sad reality The best solution i can think of is to have some kind of incentive program with monetary benefits for reporting offenders, let's say if the fine was 500 you get 50 for reporting it. We have so many people who not nothing better to do 😄 they will make thousands everyday & everyone will be worried that they may get reported for any violation The first and foremost problem is the population of India. > Why is RTO office one of the. Most corrupt offices in India? I had applied everything online as per the protocol and had gone to the RTO. They made me wait and kept postponing my process and finally one agent came to me and told that the officer will keep rejecting unless and until the papers go through him. I took driving test 3 times by applying by myself. Failed 3 times. Paid the agent outside 4k and I got my license 3 months later. Did not even take any tests. Some enlightened people look down on those who pay the bribe to get things done, but they don't understand that we lack a choice in that matter. Without a license I'd have to wait for someone to drop me off or take auto/cab. If caught by police I'd have to pay a bribe to them too. Once I got stopped by traffic police and I did not have my license with me. He wanted 500 but I only had 40/- with me. He patted me down, checked my pockets and took that 40/- and let me go. That incident was the reason I paid an agent to get me a license. Auto drivers are the worst. In Andhra bus drivers are mostly from APSRTC and drive sedately. It is autos with their lights mounted up high which cause accidents on roads. Just yesterday one auto was parked on my street with it's lights on. It had a dozen lights mounted above windshield and I couldn't see anything. When I asked him to turn off the lights as I was trying to go out, he got out of auto and got aggressive. Luckily lot of people around me were my neighbors and they supported me. He did not switch off the light but left. Police don't fine the autos which mount powerful lights dangerously and install strobe lights on back. They don't even fine the chapris who mount strobe lights everywhere. When a teenager crashed into my cousins car we got the scooty number and complained to police. That teenager left quickly leaving us with a broken bumper and fig light. His parents came to station and everyone started blaming us including the police. We were painted as the bad guys for going to police for a child. The father of teenager had the audacity to say \"scratches are normal for car. It is meant to take you from place to place. car is working so what is the problem?\". &#x200B; Government doesn't care. People don't care. Everything's gone shite. I will tell you a simple thing: India is doomed...the powerful backings of groups and communities who favour the govt officials and vice versa. This cycle will not end at any stage, not in this era. Bribes and corruption, this entire system is bound to fall..my take is that India will not become a superpower and new uprisings will happen(riots and clashes more and more like Odisha) Every single time this type of discussion happens, there is always one person that blames the roads. Yes the roads are bad but a majority of accidents happen because the person driving the vehicle is at fault. Not the roads but maybe the traffic regulations. Most of the things you talk about are to do how we are using what we have. And I agree with you. I live in Noida and it has been receiving a major road overhaul, great bridges, underpasses, interchanges but the traffic continues to stop at red lights for the left slip lane, erickshaws/auto cramming the slip or the stop lanes, people overtaking from everything but the first lane. Yep this is a rule I learned myself few months into driving on roads. I can see retired society unkills salivating at this idea Can’t teach common sense to idiots like these. How can anyone prevent these things from happening? Should the bus driver get a death sentence for killing 6 innocent people just because of his negligence? Leave India While driving, it becomes quite apparent that many individuals lack fundamental civic awareness. It appears that the responsibility to ensure the safety of others is not perceived as their own duty but rather as something that rests solely on other drivers. Indian roads are truly a circus. I recently got my own bike and now I have sudden intrusive thoughts about crashing because of how unpredictable all the traffic is Quality of Indian drivers is shocking. One reason is it’s so easy to bribe and get DL, that too DL comes with validity of 20 years! In the US you barely get DL validity for 3-4 years and then you need to renew and they’ll check your ability to drive each time. This is required to maintain standard driver quality imo. This is not even considering attitudes of drivers towards pedestrians lol death is the only solution to all these problems :( well then there will be nothing but offenses and mostly fake ones wasting the time of the police COVID did not kill enough of us or... just leave this country LMFAOOOO 💀🙏 I was learning to drive In a semi rural area. The road wasn’t too broad. There was a bike coming from the opposite side. I tried making some space for the bike by moving to the side. My driving instructor immediately turned the steering to bring the car back to the middle of the road and spewed this golden wisdom angrily “The road belongs to you. Never give space. Let the other vehicle do it.” WTF are u talking about We are the vishwa guru with 5 trillion tonne economy ✌️ The times that I have been in near death situations on my bike are astonishing It's interesting how similar the OP is presenting India to russia the moment one leaves Moscow and St. Petersburg. Car drivers of all types are not better. I routinely find them jumping signals some even thing they are autos; driving on the wrong side for shortest route or for overtaking others stuck in traffic and then they have the audacity to not even go back, just jam traffic till the traffic moves so they can insert themselves in. It is no longer the uneducated or undereducated driving jeeps either. Tier 2 cities are worse even. Everyone jumps signal as if they are prime minister or driving ambulance. A truck driver tried to overtake using ambulance as the front man yesterday driving on the wrong side. It isn't even hard to install cameras on traffic signals if they can't stop them or fine them just make every signal roundabout. Why punish rule followers with multi minute signals. Drain the swamp my dad who was never admitted in hospital had met with accident and broke his hip as someone was using high beam light and a pothole on the road. Got surgery at the age of 70 but couldn't recover from it and passed away. It was painful to see for someone mistake my father paid the price. There are 100's of such events happening which doesn't gets reported. Blame roads? Blame driver with high beam? Blame RTO? Not sure whom to blame here. My favorite are two wheelers who enter main roads without stopping to watch out for traffic already on the road. They give zero shits and it's your responsibility to save their lives. If you by chance hit them with a four wheeler then everyone will blame the guy in the car because Indians don't see past class / their own perceptions. There's this thing called civic duty as well. You could have the best roads in the world but if you don't know how to use it then it's useless. Living in Amrit kaal What happened in odisha ? Why r u blaming the roads 😂 > The problem is the people, and I am not sorry if saying this hurts anyone. I completely disagree. Problem is the infrastructure. If people follow traffic 'laws' to their full extent then nothing will ever get done with the current infra. An extreme example: It's practically impossible to 'legally' cross a street in most cities since the zebra crossing never gets painted. It's like Broken Windows Theory but for Broken Roads. Indians are dumb as fuck. I was walking on the footpath next to a busy road and a guy came rushing from behind on his bike on the footpath. The signal was red and this clown did not want to wait. He even had the gall to honk at me and ask me to move. Indians strongly believe in random freedom of movement on the roads /S So true. I’m back to India from the USA for a month long vacation, and after getting used to driving over there, I simply couldn’t drive my manual transmission car here. Road discipline has gone down the drain. I can list tens of wrong doings I witness every day. Had to book an automatic transmission car for the month to drive with a bit of a free mind. If you drive in India, you’ll realize common sense is not that common. Your slow lane is on the far left and you overtake on the right for gods sake. I have never seen anyone do that. Most of the drivers overtake from the left and drive/ sit in the right lane forever without merging into the left lane. The ease of getting driving license without knowing anything about proper road manners and no test on an actual road is the cause. India's traffic and road are probably never improving. Not in a 100 years. My father told me once that assume everyone who is driving on indian roadster are idiots and your safety on the road is only your responsibility I remember one time, first time I visited India, we were looking for a hotel in Delhi and asked a policeman for directions. I was speechless when he told us to drive on the opposing side to get to the hotel. After I spent a couple more days driving around India, I understood. I think the problem is a combination of infrastructure and overpopulation. You'll notice the craziness most in the high density cities. Outside of cities people drive relatively normally. The thing is, it doesn't matter what time of day it is, or what direction you are going in, in India, there is ALWAYS someone else going in that direction, and every other direction. Traffic is like a continually flowing fluid. In many other countries there will be a regular natural break in traffic, to allow you to make a right turn across lanes(for example). But if you try to just wait for a break in traffic in Indian cities, you'll be waiting all day. This forces you (and everyone else) to force your way into the intersection because you have no other option. Maybe traffic lights would help but I'm not even sure if that would work in the busiest places. I'm sick and tired of people driving wrongway. I make sure teach a lesson to each and every individual that threatens my life by doing so, on a daily basis. I make sure I school them right. These stupid uncle's sometimes just keep yelling thinking it's gonna make some sense if they shout it out loud. Useless people. Nobody should be given a licence without a comprehensive test. God knows how many people are killed by negligence of some moronic drivers. All these truck drivers also drive drunk. No action is being taken. How is this a failure of the system and not a failure of all of us individuals?? And can we do something about the wildlife?! Stray dogs, cows, bulls basically anything that moves is always on the road. And they move in herds! This lead to a lot of deaths in my town. And I sincerely apologise if I offended Hinduism, I didn't mean to and I understand they are sacred to you, but I myself almost crashed into one when it suddenly showed up around the corner of a street. DL is only valid for 5 years nowadays Fake ones would be penalised? Lack of civic sense ? Why are we surprised? Bro couldn't even pass the DL test Roads arent the failure, people themselves are! Sameer, you're breaking the CAAAARRR!! Here in Germany you need to be certified in giving CPR even before you are eligible to give driving test. The Most annoying problem I had with Indian roads is that no matter which city i am driving in is that most people always have their vehicle in fucking high beam. Why do this? are they not educated about high beam or low beam in driving schools? This problem might seem like a small annoyance but it does lead to accidents and deaths. You can get your entire vision blocked by a single car on an already narrow road in middle of a city, Fucking city, High beams are meant for highways on the outskirts not cities with ample of light. Exactly! This freakshow that goes on on our roads everyday has been perfectly evocated by you! Two things most Indians don’t have respect for is public property and secondly, a concern for other people’s safety. Sad to see so many lives being lost everyday in this banana country. You understood it better than most people. \"But if you try to just wait for a break in traffic in Indian cities, you'll be waiting all day. This forces you (and everyone else) to force your way into the intersection because you have no other option\" This is exactly what happens. A simple residential area lane in India can have as much traffic a busy city road in Europe. It's pretty sad, I really hope the ministry of transport forces the RTO to implement safe driving rules Self - Accountability, Education , Awareness & Automated enforcement like China has done. Manually policing a country of this size will only result in corruption. That bribery depends on state I had an accident in night in a freaking National Highway because there were no lights and all of a sudden the road became sandy, which made it hard to slow down. Before I could stop, I saw a heap of mud as tall as a car in front of me. I knew I would not be able to stop in time and a jump was the only way so I stood on my bike and braced for the landing. The landing was not perfect because my front tyre slipped on the peak and my bike leaned right. My right knee and elbow took impact from the ground and because of my crash guards, saddle stay and me standing up, my knee barely escaped the 200kg bike's fall on it. I got up and saw that I landed on an almost constructed part of a small bridge with a canal underneath it. The part was not connected to the road on any side and had I been a little slower, I would have landed in the gap between the road and the bridge. After a hefty bill of 30k and my bike sitting at the service centre for 2 months I spent another 2 months in regaining the confidence. So I repeat the words of Oggy F, \"Ride safe, it's a freaking jungle out there.\" Renewal is an easy process. Skills are not reevaluated. Only people who got their DL suspended will have an issue, which typically happens in case of drunk driving, hurting someone in a work zone, accumulating points beyond the state limit etc., Simple, make all the tests automatic with every possible rule, blind spot, turning, indicator, road signs and several others. Culture seems to be very pathetic and toxic... How can a country even work with so much bribery and lethal stupidity? Completely disagree ? Guess you have never gotten stuck in traffic in NCR areas (or sometimes in New Delhi) where drivers won’t have any qualms driving on the opposite side of road just to circumvent the situation. Now knowing fully well, we have average to good traffic infra in NCR - who do you think is to be blamed here? They failed me intentionally. I studied for written test(it's computerized now) and practised the maneuvers. I had paid for driving classes and practised for over 1 year before attempting to apply for driving licence. During renewal, how do they check your ability to drive? Afaik there are bo driving tests for renewal, and older people who don’t know how to drive, easily get their renewals. The only thing is maybe, eye tests and such 14hrs damn , still no \\[ Removed by Reddit. \\] As long as we are proud of being jugadu, and of breaking rules regardless of apparent benefit, this will not change. OP is right about people not following the rules except how he forgot car drivers in there. As if car drivers are the only poor souls driving properly, while everyone is 'abusing the roads'. Most of the time cars (and others too) wont even stop before footpath during redlight. Car drivers are the quickest to get angry and awful with everyone else bc they're better than others in their mind. Ofc it's basically how we're all raised. Rules and laws aren't essentially important and they can be twisted and followed acc to your own convenience. Lo aj hi new me aa gaya.. an accident on Delhi Meerut Highway because the bus was driving on the opposite road. Traffic in India is like motor vehicles being driven by apes. The RTOs are a fuckin joke. Too many people die too young for absolutely no reason. It's like an epidemic. I almost went bankrupt learning to drive and had to prepare for the driving exams ( theory and practicals) no less than board exams in India. Btw this is in Germany. The whole DL thing takes almost a year to accomplish. Parents throw parties when their children get their DL. Footpaths are so underrated in India. In the rest of the civilized world they are a necessity and taken for granted."
}