{
    "id": "173ju69",
    "title": "Guys i wrote a small book, 30 pages, small enough to complete in a day, it's available on amazon. Please leave a review.",
    "url": "https://www.reddit.com/gallery/173ju69",
    "selftext": "Wrote this low effort book in a day, independently published, Available on amazon, Paperback is currently not available but you  can buy the ebooks, paperback will be available by next month till then i will publish a better written a well researched book, the goal with this book was to be fast and factual. I kind of thought that 30 pages, 10 small chapters should be enough to engage people, specifically those who don't have enough time to read longer books. \nPlease read it and leave a review. Thanks. :)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696828532.0,
    "convurl": "https://i.redd.it/90qos2nd24tb1.jpg",
    "comments": [
        "Why should anyone read your low effort book. Also who are you? So why should anyone read anything written by you on this subject?"
    ],
    "cleaned_text": "guys wrote small book pages small enough complete day available amazon please leave review wrote low effort book day independently published available amazon paperback currently available buy ebooks paperback available next month till publish better written well researched book goal book fast factual kind thought pages small chapters enough engage people specifically dont enough time read longer books please read leave review thanks ",
    "cleaned_title": "guys wrote small book pages small enough complete day available amazon please leave review",
    "cleaned_selftext": "wrote low effort book day independently published available amazon paperback currently available buy ebooks paperback available next month till publish better written well researched book goal book fast factual kind thought pages small chapters enough engage people specifically dont enough time read longer books please read leave review thanks",
    "cleaned_comments": "anyone read low effort book also anyone read anything written subject",
    "light_cleaned_title": "Guys i wrote a small book, 30 pages, small enough to complete in a day, it's available on amazon. Please leave a review.",
    "light_cleaned_selftext": "Wrote this low effort book in a day, independently published, Available on amazon, Paperback is currently not available but you can buy the ebooks, paperback will be available by next month till then i will publish a better written a well researched book, the goal with this book was to be fast and factual. I kind of thought that 30 pages, 10 small chapters should be enough to engage people, specifically those who don't have enough time to read longer books. Please read it and leave a review. Thanks. :)",
    "light_cleaned_comments": "Why should anyone read your low effort book. Also who are you? So why should anyone read anything written by you on this subject?"
}