{
    "id": "16kppcp",
    "title": "Ex-CECs set to tell PM: In Bill, restore status of EC to that of SC judge, not Cabinet Secretary",
    "url": "https://indianexpress.com/article/india/ex-cecs-set-to-tell-pm-in-bill-restore-status-of-ec-to-that-of-sc-judge-not-cabinet-secretary-8943187/",
    "selftext": "Critics say downgrade ties EC hands, but official says precedence order unchanged",
    "flair": "Politics",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1694919232.0,
    "convurl": "https://external-preview.redd.it/730XdqTgVyBqKNvKEdLwqoieboEpz_3Bc02G1VpVP7I.jpg?auto=webp&s=e86b150c923edc22367b6ce7f21d2ff4a04d24c8",
    "comments": [
        ">In what would be an unprecedented intervention, a group of former Chief Election Commissioners (CECs) are considering writing to Prime Minister Narendra Modi to express their concerns......\n\n>The communication, now in its “final stages” and signed by at least three former CECs, is expected to raise concerns about a clause in the Chief Election Commissioner and Other Election Commissioners (Appointment, Conditions of Service and Term of Office) Bill, 2023 that proposes to align the salary, allowance, and service conditions of the CEC and the two Election Commissioners with those of a Cabinet Secretary —  currently, these are equivalent to those of a Supreme Court Judge.\n\n>The former poll panel chiefs view this as a “downgrade” that is “undesirable” and a threat to the independence and authority of the commissioners. They are expected to advise the Government against implementing this change.",
        "It's not a bug, it's a feature sirs",
        "Why would he listen to them?\n\nStill it's worth going on the record as doing it anyways.",
        "Not like all this matters. LoP is a rank higher than Cabinet secretary, yet Kharge wasn't invited to President's dinner but all the cabinet secretaries were",
        "Not like all this matters. LoP (#7) is a rank higher than Cabinet secretary (#11) yet Kharge wasn't invited to President's dinner. Secretaries in the Union Govt (#23) are even lower rank, even they were invited",
        "> A government official, on the other hand, has countered these concerns, asserting that such apprehensions are misplaced because the “Table of Precedence” will not undergo any amendments and the CEC will continue to enjoy the same rank or status as a Supreme Court Judge within this table.   \n\nThen why make the unnecessary change?",
        "Anti-national + soros funded stamp coming in 3,2,1.."
    ],
    "cleaned_text": "excecs set tell pm bill restore status ec sc judge cabinet secretary critics say downgrade ties ec hands official says precedence order unchanged ",
    "cleaned_title": "excecs set tell pm bill restore status ec sc judge cabinet secretary",
    "cleaned_selftext": "critics say downgrade ties ec hands official says precedence order unchanged",
    "cleaned_comments": "would unprecedented intervention group former chief election commissioners cecs considering writing prime minister narendra modi express concerns communication final stages signed least three former cecs expected raise concerns clause chief election commissioner election commissioners appointment conditions service term office bill proposes align salary allowance service conditions cec two election commissioners cabinet secretary currently equivalent supreme court judge former poll panel chiefs view downgrade undesirable threat independence authority commissioners expected advise government implementing change bug feature sirs would listen still worth going record anyways like matters lop rank higher cabinet secretary yet kharge wasnt invited presidents dinner cabinet secretaries like matters lop rank higher cabinet secretary yet kharge wasnt invited presidents dinner secretaries union govt even lower rank even invited government official hand countered concerns asserting apprehensions misplaced table precedence undergo amendments cec continue enjoy rank status supreme court judge within table make unnecessary change antinational soros funded stamp coming",
    "light_cleaned_title": "Ex-CECs set to tell PM: In Bill, restore status of EC to that of SC judge, not Cabinet Secretary",
    "light_cleaned_selftext": "Critics say downgrade ties EC hands, but official says precedence order unchanged",
    "light_cleaned_comments": ">In what would be an unprecedented intervention, a group of former Chief Election Commissioners (CECs) are considering writing to Prime Minister Narendra Modi to express their concerns...... >The communication, now in its “final stages” and signed by at least three former CECs, is expected to raise concerns about a clause in the Chief Election Commissioner and Other Election Commissioners (Appointment, Conditions of Service and Term of Office) Bill, 2023 that proposes to align the salary, allowance, and service conditions of the CEC and the two Election Commissioners with those of a Cabinet Secretary — currently, these are equivalent to those of a Supreme Court Judge. >The former poll panel chiefs view this as a “downgrade” that is “undesirable” and a threat to the independence and authority of the commissioners. They are expected to advise the Government against implementing this change. It's not a bug, it's a feature sirs Why would he listen to them? Still it's worth going on the record as doing it anyways. Not like all this matters. LoP is a rank higher than Cabinet secretary, yet Kharge wasn't invited to President's dinner but all the cabinet secretaries were Not like all this matters. LoP (#7) is a rank higher than Cabinet secretary (#11) yet Kharge wasn't invited to President's dinner. Secretaries in the Union Govt (#23) are even lower rank, even they were invited > A government official, on the other hand, has countered these concerns, asserting that such apprehensions are misplaced because the “Table of Precedence” will not undergo any amendments and the CEC will continue to enjoy the same rank or status as a Supreme Court Judge within this table. Then why make the unnecessary change? Anti-national + soros funded stamp coming in 3,2,1.."
}