{
    "id": "13ir315",
    "title": "Bi-Weekly Music Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/13ir315/biweekly_music_discussion_thread/",
    "selftext": "What is r/India listening to? Share and discuss songs, playlists, artists, or anything music-related here!\n\nIf you're a musician yourself, please share your work so we can all hear what up-and-coming musicians are doing these days.\n\nDon't just mention stuff, link it! Links that are official and provided by the artists themselves are preferred.\n\n**Music Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Music+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/06d0xwq1x8n61.png?width=1487&format=png&auto=webp&v=enabled&s=c66e9dcd0a8a95af64278007680175e959e0098c",
    "flair": "Scheduled",
    "score": 0,
    "num_comments": 9,
    "created_utc": 1684200610.0,
    "convurl": "https://a.thumbs.redditmedia.com/E5ByWFrXZvGobINAGUfSALpA8YJN7sRcIH1HwOLuav0.jpg",
    "comments": [
        "https://www.youtube.com/watch?v=hP-6iVUyt8E  \n\nhttps://www.youtube.com/watch?v=dgxzWj-HiPw  \n\nhttps://www.youtube.com/watch?v=At6_yckUklU  \n\nhttps://www.youtube.com/watch?v=Lj5BbfGBJ6U",
        "**We Are The Lazy Generation - The F'Ups**",
        "Why is every 3rd song played on music channels a Punjabi song?\n\nNo hate or anything. But I like them once in a while but not every 3rd song.",
        "Rooh by aswekeepsearching",
        "Talking in Your Sleep- The Romantics",
        "I have been listening to Keh Do Na by an Indie Band called Swastik The Band: [https://www.youtube.com/watch?v=c85wHpox4ms](https://www.youtube.com/watch?v=c85wHpox4ms)",
        "Slow Loud and Banging by Hanumankind"
    ],
    "cleaned_text": "biweekly music discussion thread rindia listening share discuss songs playlists artists anything musicrelated youre musician please share work hear upandcoming musicians days dont mention stuff link links official provided artists preferred music thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklymusicdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly music discussion thread",
    "cleaned_selftext": "rindia listening share discuss songs playlists artists anything musicrelated youre musician please share work hear upandcoming musicians days dont mention stuff link links official provided artists preferred music thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklymusicdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "lazy generation fups every rd song played music channels punjabi song hate anything like every rd song rooh aswekeepsearching talking sleep romantics listening keh na indie band called swastik band httpswwwyoutubecomwatchvcwhpoxmshttpswwwyoutubecomwatchvcwhpoxms slow loud banging hanumankind",
    "light_cleaned_title": "Bi-Weekly Music Discussion Thread",
    "light_cleaned_selftext": "What is r/India listening to? Share and discuss songs, playlists, artists, or anything music-related here! If you're a musician yourself, please share your work so we can all hear what up-and-coming musicians are doing these days. Don't just mention stuff, link it! Links that are official and provided by the artists themselves are preferred. **Music Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Music+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "**We Are The Lazy Generation - The F'Ups** Why is every 3rd song played on music channels a Punjabi song? No hate or anything. But I like them once in a while but not every 3rd song. Rooh by aswekeepsearching Talking in Your Sleep- The Romantics I have been listening to Keh Do Na by an Indie Band called Swastik The Band: [https://www.youtube.com/watch?v=c85wHpox4ms](https://www.youtube.com/watch?v=c85wHpox4ms) Slow Loud and Banging by Hanumankind"
}