{
    "id": "1h463v0",
    "title": "Got harassed by a guy on chat",
    "url": "https://www.reddit.com/gallery/1h463v0",
    "selftext": "TW: sexual abuse\n",
    "flair": "Rant / Vent",
    "score": 15,
    "num_comments": 11,
    "created_utc": 1733068053.0,
    "convurl": "https://i.redd.it/03ulesm3d94e1.png",
    "comments": [
        "Why would u send ur face in a pic ?",
        "And also that too a reddit stranger ? While doing Nsfw stuff , damn brother",
        "Oh god. Just block these idiots.",
        "Report him ,straight away , maybe he is just trying to intimidate you by saying things like he is from the same school or smthng",
        "Report them buddy we will lend you a hand",
        "Thats average chat a group of guys do",
        "Anonymity really brings out the true nature of people. Sadly a lot of people aren't what they seem like on the surface.",
        "What happens by reporting? May be get his account banned and he creates a new one and again starts targeting the vulnerable",
        "straight up report",
        "See in that case everybody has to report him, these guys keep doing this , because they have the luxury of anonymity",
        "Well atleast they don't be able to msg you further",
        "He is bastard"
    ],
    "cleaned_text": "got harassed guy chat tw sexual abuse ",
    "cleaned_title": "got harassed guy chat",
    "cleaned_selftext": "tw sexual abuse",
    "cleaned_comments": "would u send ur face pic also reddit stranger nsfw stuff damn brother oh god block idiots report straight away maybe trying intimidate saying things like school smthng report buddy lend hand thats average chat group guys anonymity really brings true nature people sadly lot people arent seem like surface happens reporting may get account banned creates new one starts targeting vulnerable straight report see case everybody report guys keep luxury anonymity well atleast dont able msg bastard",
    "light_cleaned_title": "Got harassed by a guy on chat",
    "light_cleaned_selftext": "TW: sexual abuse",
    "light_cleaned_comments": "Why would u send ur face in a pic ? And also that too a reddit stranger ? While doing Nsfw stuff , damn brother Oh god. Just block these idiots. Report him ,straight away , maybe he is just trying to intimidate you by saying things like he is from the same school or smthng Report them buddy we will lend you a hand Thats average chat a group of guys do Anonymity really brings out the true nature of people. Sadly a lot of people aren't what they seem like on the surface. What happens by reporting? May be get his account banned and he creates a new one and again starts targeting the vulnerable straight up report See in that case everybody has to report him, these guys keep doing this , because they have the luxury of anonymity Well atleast they don't be able to msg you further He is bastard"
}