{
    "id": "1ei3rep",
    "title": "Creamy layer sub-classification for SC/ST reservations?",
    "url": "https://i.redd.it/g4l91d22b7gd1.jpeg",
    "selftext": "> *“Putting the children of the parents from the Scheduled Castes and Scheduled Tribes who on account of benefit of reservation have reached a high position and ceased to be socially, economically and educationally backward and the children of parents doing manual work in the villages in the same category would defeat the constitutional mandate,”* said Justice Gavai.\n\nMore details: https://theprint.in/judiciary/should-give-way-to-deserving-needy-sc-asks-for-creamy-layer-to-be-excluded-from-sc-st-reservation/2204036/\n\n**Thoughts?**",
    "flair": "Law & Courts",
    "score": 13,
    "num_comments": 2,
    "created_utc": 1722582798.0,
    "convurl": "https://i.redd.it/g4l91d22b7gd1.jpeg",
    "comments": [
        "I think it is fair, keep the benefits for people who are yet to reap the benefits of reservation.",
        "Though I believe it is not easy to do, and maybe not for a country facing many issues like India. But a western style social security system would be beneficial if implemented rightly. It could help get rid of many issues and also issues with the freebies dispersion to everyone (As the unprivileged and backwards would already be taken care of for most of their needs.). Then again, not many systems are implemented correctly here. Just a thought."
    ],
    "cleaned_text": "creamy layer subclassification scst reservations putting children parents scheduled castes scheduled tribes account benefit reservation reached high position ceased socially economically educationally backward children parents manual work villages category would defeat constitutional mandate said justice gavai details thoughts ",
    "cleaned_title": "creamy layer subclassification scst reservations",
    "cleaned_selftext": "putting children parents scheduled castes scheduled tribes account benefit reservation reached high position ceased socially economically educationally backward children parents manual work villages category would defeat constitutional mandate said justice gavai details thoughts",
    "cleaned_comments": "think fair keep benefits people yet reap benefits reservation though believe easy maybe country facing many issues like india western style social security system would beneficial implemented rightly could help get rid many issues also issues freebies dispersion everyone unprivileged backwards would already taken care needs many systems implemented correctly thought",
    "light_cleaned_title": "Creamy layer sub-classification for SC/ST reservations?",
    "light_cleaned_selftext": "> *“Putting the children of the parents from the Scheduled Castes and Scheduled Tribes who on account of benefit of reservation have reached a high position and ceased to be socially, economically and educationally backward and the children of parents doing manual work in the villages in the same category would defeat the constitutional mandate,”* said Justice Gavai. More details: **Thoughts?**",
    "light_cleaned_comments": "I think it is fair, keep the benefits for people who are yet to reap the benefits of reservation. Though I believe it is not easy to do, and maybe not for a country facing many issues like India. But a western style social security system would be beneficial if implemented rightly. It could help get rid of many issues and also issues with the freebies dispersion to everyone (As the unprivileged and backwards would already be taken care of for most of their needs.). Then again, not many systems are implemented correctly here. Just a thought."
}