{
    "id": "10vz18b",
    "title": "Christian cemetery I visited in Shimla",
    "url": "https://www.reddit.com/gallery/10vz18b",
    "selftext": "Has anyone got an explanation ? Is it just because it’s so old  ?",
    "flair": "AskIndia",
    "score": 65,
    "num_comments": 27,
    "created_utc": 1675767362,
    "convurl": "https://i.redd.it/1hr5uek3zqga1.jpg",
    "comments": [
        "No one there to maintain?",
        "I took these photos myself",
        "Maybe that’s it",
        "Genuinely surprised. Two seem to be of military officers. Lack of maintenance from the looks of it.",
        "Hopefully it really is a maintenance issue because breaking crosses of Christian graves has [become a thing now](https://www.freepressjournal.in/mumbai/mumbai-over-dozen-crosses-vandalised-at-mahims-st-micheals-church-community-members-condemn-vandalisation)",
        "Any chance at least some of it was vandalism as it’s a British Christian cemetery ? If yes , I’d have some sympathy, being Irish .",
        "Same case in a lot of other places in HP. I’ve seen teenagers literally breaking a wooden cross with their legs in another cemetery in HP and deriving pleasure out of their acts. \n\nWhat is even more concerning is the fact that local adults encouraged these kids and were laughing out loud while the kids wreck havoc!! Disgusting.",
        "Couple of reasons -\n\n1. Lack of maintenance due to lack of funds or resources such as no surviving relatives.\n2. Intentional damage by miscreants\n3. Damage done by cattle / animals.\n4. Structural breakdown due to age/weather/exposure to the elements.",
        "This place is used by local youth to get drunk at night. \n\nAlso, many of the Anglo-Indians and other foreigners who stayed behind in the Shimla Hills became Hindus like Satyananda Stokes etc. So no one must have looked after them.",
        "So now we gotta maintain the graves of our oppressors too?",
        "Modiji aap yahaa bhi pahunch gaye?",
        "Wtf for real?",
        "Pure class.\n\n\n\nEdit: folks, I am indirectly being sarcastic here.",
        "Fucking bastards won't even let the dead be in peace",
        "Tbh that's looks like a act of vandalism",
        "It’s the new normal.",
        "isn't this St John in the wilderness. Diocese are responsible to care of the church and its yard. Government funds are allocated for this.",
        "they ARE(were) Indians. they are most probably the graves of converted Indians who didn't oppress anyone lmao.",
        "So Lt. Col. Spencer Cargill was a converted Indian?",
        "Well tbh I've seen this happen a lot and uk on Christmas some teenagers bought wooden cross and destroyed it in front of churches",
        "Wow remind me of a wave of German kids throwing stones on Jews and getting encourage by local adults too. It is not like there isn't any co relation anything",
        "my bad didn't see that.",
        "Yknow around 5 years ago I used to think these Nazi comparisons were exaggerations but as the years go by and I gain more exposure to the northern part of the nation, I start seeing more similarities.",
        "It starts gradually using the existence of already a neutral or negative opinion of public towards a specific section of group and spread it like a wildfire. Nazi were once a Socialist party who run in a democratic elections and I pray India don't go that far in the direction. there was already a huge distrust from both religious groups in India dating back from Riots and usage of violence in Northern India. You know many Hindus believe BJP is needed to balance that out. 'To show place to Muslims,so they live in fear and don't commit act of violent crimes.' but this is slowly turn to a general hatred for innocent people.",
        "Hey, local resident here. Most of these cemeteries don't have anyone looking after them. There are only two functional ones and the others have been neglected by the authorities making it a good isolated place for underage drinking hence the empty bottles. The people don't break it to disrespect the culture of any religion as Christianity is very much prevelant in shimla.\nThis condition is because of natural factors like the rough weather of shimla, lack of maintenance and drunks kids doing what drunk kids do. Happens in Shamshan ghats too.",
        "Shhh don't tell the truth. Let them label Shimlites as Nazis."
    ],
    "cleaned_text": "christian cemetery visited shimla anyone got explanation old ",
    "cleaned_title": "christian cemetery visited shimla",
    "cleaned_selftext": "anyone got explanation old",
    "cleaned_comments": "one maintain took photos maybe thats genuinely surprised two seem military officers lack maintenance looks hopefully really maintenance issue breaking crosses christian graves become thing nowhttpswwwfreepressjournalinmumbaimumbaioverdozencrossesvandalisedatmahimsstmichealschurchcommunitymemberscondemnvandalisation chance least vandalism british christian cemetery yes id sympathy irish case lot places hp ive seen teenagers literally breaking wooden cross legs another cemetery hp deriving pleasure acts even concerning fact local adults encouraged kids laughing loud kids wreck havoc disgusting couple reasons lack maintenance due lack funds resources surviving relatives intentional damage miscreants damage done cattle animals structural breakdown due ageweatherexposure elements place used local youth get drunk night also many angloindians foreigners stayed behind shimla hills became hindus like satyananda stokes etc one must looked got ta maintain graves oppressors modiji aap yahaa bhi pahunch gaye wtf real pure class edit folks indirectly sarcastic fucking bastards wont even let dead peace tbh thats looks like act vandalism new normal isnt st john wilderness diocese responsible care church yard government funds allocated arewere indians probably graves converted indians didnt oppress anyone lmao lt col spencer cargill converted indian well tbh ive seen happen lot uk christmas teenagers bought wooden cross destroyed front churches wow remind wave german kids throwing stones jews getting encourage local adults like isnt co relation anything bad didnt see yknow around years ago used think nazi comparisons exaggerations years go gain exposure northern part nation start seeing similarities starts gradually using existence already neutral negative opinion public towards specific section group spread like wildfire nazi socialist party run democratic elections pray india dont go far direction already huge distrust religious groups india dating back riots usage violence northern india know many hindus believe bjp needed balance show place muslimsso live fear dont commit act violent crimes slowly turn general hatred innocent people hey local resident cemeteries dont anyone looking two functional ones others neglected authorities making good isolated place underage drinking hence empty bottles people dont break disrespect culture religion christianity much prevelant shimla condition natural factors like rough weather shimla lack maintenance drunks kids drunk kids happens shamshan ghats shhh dont tell truth let label shimlites nazis",
    "light_cleaned_title": "Christian cemetery I visited in Shimla",
    "light_cleaned_selftext": "Has anyone got an explanation ? Is it just because it’s so old ?",
    "light_cleaned_comments": "No one there to maintain? I took these photos myself Maybe that’s it Genuinely surprised. Two seem to be of military officers. Lack of maintenance from the looks of it. Hopefully it really is a maintenance issue because breaking crosses of Christian graves has [become a thing now](https://www.freepressjournal.in/mumbai/mumbai-over-dozen-crosses-vandalised-at-mahims-st-micheals-church-community-members-condemn-vandalisation) Any chance at least some of it was vandalism as it’s a British Christian cemetery ? If yes , I’d have some sympathy, being Irish . Same case in a lot of other places in HP. I’ve seen teenagers literally breaking a wooden cross with their legs in another cemetery in HP and deriving pleasure out of their acts. What is even more concerning is the fact that local adults encouraged these kids and were laughing out loud while the kids wreck havoc!! Disgusting. Couple of reasons - 1. Lack of maintenance due to lack of funds or resources such as no surviving relatives. 2. Intentional damage by miscreants 3. Damage done by cattle / animals. 4. Structural breakdown due to age/weather/exposure to the elements. This place is used by local youth to get drunk at night. Also, many of the Anglo-Indians and other foreigners who stayed behind in the Shimla Hills became Hindus like Satyananda Stokes etc. So no one must have looked after them. So now we gotta maintain the graves of our oppressors too? Modiji aap yahaa bhi pahunch gaye? Wtf for real? Pure class. Edit: folks, I am indirectly being sarcastic here. Fucking bastards won't even let the dead be in peace Tbh that's looks like a act of vandalism It’s the new normal. isn't this St John in the wilderness. Diocese are responsible to care of the church and its yard. Government funds are allocated for this. they ARE(were) Indians. they are most probably the graves of converted Indians who didn't oppress anyone lmao. So Lt. Col. Spencer Cargill was a converted Indian? Well tbh I've seen this happen a lot and uk on Christmas some teenagers bought wooden cross and destroyed it in front of churches Wow remind me of a wave of German kids throwing stones on Jews and getting encourage by local adults too. It is not like there isn't any co relation anything my bad didn't see that. Yknow around 5 years ago I used to think these Nazi comparisons were exaggerations but as the years go by and I gain more exposure to the northern part of the nation, I start seeing more similarities. It starts gradually using the existence of already a neutral or negative opinion of public towards a specific section of group and spread it like a wildfire. Nazi were once a Socialist party who run in a democratic elections and I pray India don't go that far in the direction. there was already a huge distrust from both religious groups in India dating back from Riots and usage of violence in Northern India. You know many Hindus believe BJP is needed to balance that out. 'To show place to Muslims,so they live in fear and don't commit act of violent crimes.' but this is slowly turn to a general hatred for innocent people. Hey, local resident here. Most of these cemeteries don't have anyone looking after them. There are only two functional ones and the others have been neglected by the authorities making it a good isolated place for underage drinking hence the empty bottles. The people don't break it to disrespect the culture of any religion as Christianity is very much prevelant in shimla. This condition is because of natural factors like the rough weather of shimla, lack of maintenance and drunks kids doing what drunk kids do. Happens in Shamshan ghats too. Shhh don't tell the truth. Let them label Shimlites as Nazis."
}