{
    "id": "q9239r",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/q9239r/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 17,
    "num_comments": 41,
    "created_utc": 1634347815,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "The office, squid games, ozark, wayne",
        "Watched Ragini MMS 1 recently for the first time and was intrigued by the character of Panditji who is somewhat revealed at the end as the person responsible for sending Rajkumar Rao to the cursed house. In exchange for making a sex tape with Ragini Panditji offered a 5 films deal to RR who apparently is a struggling actor in the movie. I have some questions related to this reveal:\n\nIs it possible that there are actual blackmail rings in bollywood operated by people like Panditji? Panditji said that it's no joke to change the destiny of a person, did he mean that to change the destiny of a struggling actor like RR in the film industry they need to compromise themselves on camera, or in a way sell their soul to the devil? Could it be that there were no ghosts but Ragini killed RR because Panditji actually wanted a snuff movie and had instructed Ragini to brutally murder RR on camera and blame it on ghosts? Because I'm sure that the real Ragini incident on which the movie was supposedly based did not have any actual ghosts murdering people on camera. So, did Panditji have a deal with Ragini to double cross RR and make him a sacrificial goat so to speak?",
        "**TV series**\n\n* [The Veep](https://youtu.be/I2HoCG_iyhU)\n\n**Movies**\n\n* [The Balkan Line](https://youtu.be/_zvpI4AvMao) (Russian movie about NATO bombings of Yugoslavia - On Amazon Prime)\n\n**Podcasts**\n\n* [Global Dispatches : How China Makes Foriegn Policy](https://podcasts.google.com/feed/aHR0cHM6Ly91bmRpc3BhdGNoLmxpYnN5bi5jb20vcnNz/episode/NDM0NmY5MWYtZDQyYy00NDY3LWE3ZGItZGVlODgzNGFjNjgz?ep=14)\n\n**Documentaries**\n\n* [Mexico's deadly Coca-Cola addiction. ](https://youtu.be/hqnUohxXV0I)",
        "Would Highly recommend only murders in the building available on Hotstar it's got the right amount of mystery and quite funny as well ..",
        "Succession season 3 coming next week. An amazing show, great time to binge watch the first two seasons if you haven't done so already.",
        "Wilty ( Would I Lie To You) \n\nHilarious show, banter between Lee Mack and David Mitchell is epic\n\nThese two are one of my favourite moments from this show. Enjoy\n\nhttps://youtu.be/B94q7gUu75k\n\nhttps://youtu.be/sr7Ue9K3zN4",
        "Has anyone watched this German series called [The Billion Dollar Code](https://youtu.be/iDvPvqImb-4)? I never knew that German's were the first to invent an algorithm for Google Earth in 1994.",
        "Fullmetal Alchemist",
        "Sardar Udham.",
        "**The Disaster Artist**\n\nVery entertaining movie re-telling the sequence of events that led to the making of the so-bad-it's-good, now cult-classic film 'The Room'. James Franco stars in the lead and plays it to perfection. The entire cast is perfectly cast and have delivered great, natural performances, and the character of Tommy Wiseau is so bizarre and unrealistic, you won't believe he is an actual person. Was hooked from start to finish.\n\n**Formula 1: Drive to Survive** (S1 only)\n\nA docuseries following every yearly season of the F1 championship from 2018 onwards (every season of the show corresponds to a new F1 season, S1 is 2018, S2 is 2019 and so on). Very cinematically shot with only the most adrenaline-fuelled moments of races handpicked to be showcased in the overall, entertaining narrative. \n\nWhile I appreciated the backstories of each racer, what really drew me in was the accessible explanations of what F1 is all about and what the racers and their teams actually do. It made watching F1 more entertaining than the bland shots of cars zooming by that I remember from watching the occasional race on television. Really made me appreciate how blindingly fast these guys drive. I'm looking forward to binging the next seasons.",
        "Im doing it right now. 5 episodes in. Such an amazing show.",
        "You might not think of Fukushima or Chernobyl when you think of sunflowers, but they naturally decontaminate soil. They can soak up hazardous materials such as uranium, lead, and even arsenic! So next time you have a natural disaster … Sunflowers are the answer!",
        "It's a bot lol",
        "Many. It's pretty easy to create one.",
        "House of secrets - the Burari deaths.\n\nMind fucked.",
        "A podcast on Sophie zhang, a Facebook whistleblower from 2020. She talks about fake engagement campaigns in India and other countries. \n\n[ A Facebook Whistleblower, Your Undivided Attention ](https://www.humanetech.com/podcast/episode-37-a-facebook-whistleblower)\n\nA couple of articles on the same story, \n\n[How Facebook let fake engagement distort global politics: a whistleblower's account ](https://www.theguardian.com/technology/2021/apr/12/facebook-fake-engagement-whistleblower-sophie-zhang)\n\n[“I Have Blood on My Hands”: A Whistleblower Says Facebook Ignored Global Political Manipulation](https://www.buzzfeednews.com/article/craigsilverman/facebook-ignore-political-manipulation-whistleblower-memo)",
        "Except for a few rare series like Scam 1992 or, in my personal opinion, Family Man, most Indian series have been disappointments.",
        "Love this show.My second favourite panel show after QI. I finished all the seasons during lockdown. My favourite moments , James Mcaster's cabbage kid , and Lee's French nanny !",
        "I watched these movies\n\n**Layer Cake** : Matthew Vaughn British Crime Comedy. Its pretty good but the movies that he made after were gold. (Snatch,Lock Stock and 2 Smoking Barrels) 7/10\n\n**Django** - Starring Franco Nero. I have seen Fistful of Dollars and it was pretty much the same like that. Off to watch their inspiration now. (Yojimbo) 9/10\n\n\n\n**Django Unchained** - Quentin Tarantino's Unchained is a modern classic. Cant say anything bad about it. Loved it 10/10\n\n**Free Guy** - Very fun and Wholesome 9/10\n\n**Vivo** - also fun and wholesome 8.5/10\n\nI tried watching Waynes World but its sooooo dated. I left midway",
        "Watched Netflix's The Mind Explained",
        "Ted Lasso is great",
        "It's not exactly scary. But it certainly is pretty creepy just thinking about how it was going on for 11 years and no one had a wind of it. Even in the documentary one of the people being interviewed, not sure who she was exactly but she put it right. She said that even if you point out the lack of mental health and well say that the cause was mass psychosis it kind of explains everything and explains nothing at all because of how bizzare it was. To me aside from the members following every word of lalit, the creepier thing was the setting. Comparing the hanged people to the banyan tree and then how they were placed somewhat symmetrically, faces and eyes covered, children wrapped with cables to prevent them from resisting, yeesh. Demons aren't real but if they were, this would exactly be the work of one",
        "Sardar Udham. Unexpectedly good.",
        "If anything, the show has taken great care in not showing disturbing visuals.\n\nIt's just the idea of something like this happening that fucks up your mind. Like it might have been happening for 11 years in your neighbourhood and you have no idea.\n\nNormality is just an illusion.",
        "Going through this list, one week at a time : https://en.wikipedia.org/wiki/AFI%27s\\_100\\_Years...100\\_Movies",
        "Copenhagen: a movie based on a conversation between physicists Werner Heisenberg (played by Daniel Craig) and Niels Bohr in 1941.",
        "The Trip - recently released. Amazing one-time watch movie.\n\nAnd Dune! already waiting for part 2. I hope it comes fast enough.",
        "I have ran out of good movies/shows to watch. And as a person who watches too many movies it's depressing. Every new movie releasing only in cinema isn't helping either. This weekend watched Cop Shop not the best but it's entertaining till the end. Ending could have been better though.",
        "I m searching for an ad ft Malliswari ve song!\n\nI remember the first catchy song I noticed through this ad. \nIt was a punky ad featuring a man with curly long hair dancing on the same song with mask on…and surprising everyone around him.. ad was probably of any telecom service in Early 2000’s (I feel it’s an idea ad) can someone share the link of that ad?",
        "That's impossible. There's just so much good cinema out there.",
        "Only Murders in the Building on Hotstar Disney+.Really liked this series, last episodes drops tomorrow",
        "Taskmaster is my current guilty pleasure. Watch it everyday Friday in the morning! If you like UK panel TV show guests, you probably will like Taskmaster. Bonus: New episodes are made available on YouTube every week!",
        "I love Taskmaster, QI (more Stephen Fry, less Sandy Toksvig, but both hosts are good in their own right) and WILTY! Favourite guest: Bill Bailey, can't get enough of that guy's humour. \n\nLiked an episode or two of 8 out of 10 cats, but never caught on with me. Similar feeling for Only Connect.",
        "Watched Caliphate on netflix , didn't hide behind political correctness . Very well made . ISIS from inside , not a hidden gem a such , imdb &gt;8",
        "'Paatal Lok' has been the best Indian show so far. Wish it got more appreciation than it did at the time of its release. The show, and particularly the character arc of Hathiram Chaudhary has great re-watch value.",
        "Bill is hilarious . But on QI my Favourite guest is Aisling Bea . To be fair  I probably like all of the guests bar a couple because I can't understand their accent properly . Try \"8 Out of 10 cats does countdown\" , it is better than 8 out of 10 cats ."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "office squid games ozark wayne watched ragini mms recently first time intrigued character panditji somewhat revealed end person responsible sending rajkumar rao cursed house exchange making sex tape ragini panditji offered films deal rr apparently struggling actor movie questions related reveal possible actual blackmail rings bollywood operated people like panditji panditji said joke change destiny person mean change destiny struggling actor like rr film industry need compromise camera way sell soul devil could ghosts ragini killed rr panditji actually wanted snuff movie instructed ragini brutally murder rr camera blame ghosts im sure real ragini incident movie supposedly based actual ghosts murdering people camera panditji deal ragini double cross rr make sacrificial goat speak tv series veephttpsyoutubeihocgiyhu movies balkan linehttpsyoutubezvpiavmao russian movie nato bombings yugoslavia amazon prime podcasts global dispatches china makes foriegn policyhttpspodcastsgooglecomfeedahrchmlybmrpcbhdgnolmxpynnbijbvcnnzepisodendmnmymwytzdqyyyndylwezgitzgvlodgzngfjnjgzep documentaries mexicos deadly cocacola addiction httpsyoutubehqnuohxxvi would highly recommend murders building available hotstar got right amount mystery quite funny well succession season coming next week amazing show great time binge watch first two seasons havent done already wilty would lie hilarious show banter lee mack david mitchell epic two one favourite moments show enjoy anyone watched german series called billion dollar codehttpsyoutubeidvpvqimb never knew germans first invent algorithm google earth fullmetal alchemist sardar udham disaster artist entertaining movie retelling sequence events led making sobaditsgood cultclassic film room james franco stars lead plays perfection entire cast perfectly cast delivered great natural performances character tommy wiseau bizarre unrealistic wont believe actual person hooked start finish formula drive survive docuseries following every yearly season f championship onwards every season show corresponds new f season cinematically shot adrenalinefuelled moments races handpicked showcased overall entertaining narrative appreciated backstories racer really drew accessible explanations f racers teams actually made watching f entertaining bland shots cars zooming remember watching occasional race television really made appreciate blindingly fast guys drive im looking forward binging next seasons im right episodes amazing show might think fukushima chernobyl think sunflowers naturally decontaminate soil soak hazardous materials uranium lead even arsenic next time natural disaster sunflowers answer bot lol many pretty easy create one house secrets burari deaths mind fucked podcast sophie zhang facebook whistleblower talks fake engagement campaigns india countries facebook whistleblower undivided attention httpswwwhumanetechcompodcastepisodeafacebookwhistleblower couple articles story facebook let fake engagement distort global politics whistleblowers account httpswwwtheguardiancomtechnologyaprfacebookfakeengagementwhistleblowersophiezhang blood hands whistleblower says facebook ignored global political manipulationhttpswwwbuzzfeednewscomarticlecraigsilvermanfacebookignorepoliticalmanipulationwhistleblowermemo except rare series like scam personal opinion family man indian series disappointments love showmy second favourite panel show qi finished seasons lockdown favourite moments james mcasters cabbage kid lees french nanny watched movies layer cake matthew vaughn british crime comedy pretty good movies made gold snatchlock stock smoking barrels django starring franco nero seen fistful dollars pretty much like watch inspiration yojimbo django unchained quentin tarantinos unchained modern classic cant say anything bad loved free guy fun wholesome vivo also fun wholesome tried watching waynes world sooooo dated left midway watched netflixs mind explained ted lasso great exactly scary certainly pretty creepy thinking going years one wind even documentary one people interviewed sure exactly put right said even point lack mental health well say cause mass psychosis kind explains everything explains nothing bizzare aside members following every word lalit creepier thing setting comparing hanged people banyan tree placed somewhat symmetrically faces eyes covered children wrapped cables prevent resisting yeesh demons arent real would exactly work one sardar udham unexpectedly good anything show taken great care showing disturbing visuals idea something like happening fucks mind like might happening years neighbourhood idea normality illusion going list one week time copenhagen movie based conversation physicists werner heisenberg played daniel craig niels bohr trip recently released amazing onetime watch movie dune already waiting part hope comes fast enough ran good moviesshows watch person watches many movies depressing every new movie releasing cinema isnt helping either weekend watched cop shop best entertaining till end ending could better though searching ad ft malliswari song remember first catchy song noticed ad punky ad featuring man curly long hair dancing song mask onand surprising everyone around ad probably telecom service early feel idea ad someone share link ad thats impossible theres much good cinema murders building hotstar disneyreally liked series last episodes drops tomorrow taskmaster current guilty pleasure watch everyday friday morning like uk panel tv show guests probably like taskmaster bonus new episodes made available youtube every week love taskmaster qi stephen fry less sandy toksvig hosts good right wilty favourite guest bill bailey cant get enough guys humour liked episode two cats never caught similar feeling connect watched caliphate netflix didnt hide behind political correctness well made isis inside hidden gem imdb gt paatal lok best indian show far wish got appreciation time release show particularly character arc hathiram chaudhary great rewatch value bill hilarious qi favourite guest aisling bea fair probably like guests bar couple cant understand accent properly try cats countdown better cats",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "The office, squid games, ozark, wayne Watched Ragini MMS 1 recently for the first time and was intrigued by the character of Panditji who is somewhat revealed at the end as the person responsible for sending Rajkumar Rao to the cursed house. In exchange for making a sex tape with Ragini Panditji offered a 5 films deal to RR who apparently is a struggling actor in the movie. I have some questions related to this reveal: Is it possible that there are actual blackmail rings in bollywood operated by people like Panditji? Panditji said that it's no joke to change the destiny of a person, did he mean that to change the destiny of a struggling actor like RR in the film industry they need to compromise themselves on camera, or in a way sell their soul to the devil? Could it be that there were no ghosts but Ragini killed RR because Panditji actually wanted a snuff movie and had instructed Ragini to brutally murder RR on camera and blame it on ghosts? Because I'm sure that the real Ragini incident on which the movie was supposedly based did not have any actual ghosts murdering people on camera. So, did Panditji have a deal with Ragini to double cross RR and make him a sacrificial goat so to speak? **TV series** * [The Veep](https://youtu.be/I2HoCG_iyhU) **Movies** * [The Balkan Line](https://youtu.be/_zvpI4AvMao) (Russian movie about NATO bombings of Yugoslavia - On Amazon Prime) **Podcasts** * [Global Dispatches : How China Makes Foriegn Policy](https://podcasts.google.com/feed/aHR0cHM6Ly91bmRpc3BhdGNoLmxpYnN5bi5jb20vcnNz/episode/NDM0NmY5MWYtZDQyYy00NDY3LWE3ZGItZGVlODgzNGFjNjgz?ep=14) **Documentaries** * [Mexico's deadly Coca-Cola addiction. ](https://youtu.be/hqnUohxXV0I) Would Highly recommend only murders in the building available on Hotstar it's got the right amount of mystery and quite funny as well .. Succession season 3 coming next week. An amazing show, great time to binge watch the first two seasons if you haven't done so already. Wilty ( Would I Lie To You) Hilarious show, banter between Lee Mack and David Mitchell is epic These two are one of my favourite moments from this show. Enjoy Has anyone watched this German series called [The Billion Dollar Code](https://youtu.be/iDvPvqImb-4)? I never knew that German's were the first to invent an algorithm for Google Earth in 1994. Fullmetal Alchemist Sardar Udham. **The Disaster Artist** Very entertaining movie re-telling the sequence of events that led to the making of the so-bad-it's-good, now cult-classic film 'The Room'. James Franco stars in the lead and plays it to perfection. The entire cast is perfectly cast and have delivered great, natural performances, and the character of Tommy Wiseau is so bizarre and unrealistic, you won't believe he is an actual person. Was hooked from start to finish. **Formula 1: Drive to Survive** (S1 only) A docuseries following every yearly season of the F1 championship from 2018 onwards (every season of the show corresponds to a new F1 season, S1 is 2018, S2 is 2019 and so on). Very cinematically shot with only the most adrenaline-fuelled moments of races handpicked to be showcased in the overall, entertaining narrative. While I appreciated the backstories of each racer, what really drew me in was the accessible explanations of what F1 is all about and what the racers and their teams actually do. It made watching F1 more entertaining than the bland shots of cars zooming by that I remember from watching the occasional race on television. Really made me appreciate how blindingly fast these guys drive. I'm looking forward to binging the next seasons. Im doing it right now. 5 episodes in. Such an amazing show. You might not think of Fukushima or Chernobyl when you think of sunflowers, but they naturally decontaminate soil. They can soak up hazardous materials such as uranium, lead, and even arsenic! So next time you have a natural disaster … Sunflowers are the answer! It's a bot lol Many. It's pretty easy to create one. House of secrets - the Burari deaths. Mind fucked. A podcast on Sophie zhang, a Facebook whistleblower from 2020. She talks about fake engagement campaigns in India and other countries. [ A Facebook Whistleblower, Your Undivided Attention ](https://www.humanetech.com/podcast/episode-37-a-facebook-whistleblower) A couple of articles on the same story, [How Facebook let fake engagement distort global politics: a whistleblower's account ](https://www.theguardian.com/technology/2021/apr/12/facebook-fake-engagement-whistleblower-sophie-zhang) [“I Have Blood on My Hands”: A Whistleblower Says Facebook Ignored Global Political Manipulation](https://www.buzzfeednews.com/article/craigsilverman/facebook-ignore-political-manipulation-whistleblower-memo) Except for a few rare series like Scam 1992 or, in my personal opinion, Family Man, most Indian series have been disappointments. Love this show.My second favourite panel show after QI. I finished all the seasons during lockdown. My favourite moments , James Mcaster's cabbage kid , and Lee's French nanny ! I watched these movies **Layer Cake** : Matthew Vaughn British Crime Comedy. Its pretty good but the movies that he made after were gold. (Snatch,Lock Stock and 2 Smoking Barrels) 7/10 **Django** - Starring Franco Nero. I have seen Fistful of Dollars and it was pretty much the same like that. Off to watch their inspiration now. (Yojimbo) 9/10 **Django Unchained** - Quentin Tarantino's Unchained is a modern classic. Cant say anything bad about it. Loved it 10/10 **Free Guy** - Very fun and Wholesome 9/10 **Vivo** - also fun and wholesome 8.5/10 I tried watching Waynes World but its sooooo dated. I left midway Watched Netflix's The Mind Explained Ted Lasso is great It's not exactly scary. But it certainly is pretty creepy just thinking about how it was going on for 11 years and no one had a wind of it. Even in the documentary one of the people being interviewed, not sure who she was exactly but she put it right. She said that even if you point out the lack of mental health and well say that the cause was mass psychosis it kind of explains everything and explains nothing at all because of how bizzare it was. To me aside from the members following every word of lalit, the creepier thing was the setting. Comparing the hanged people to the banyan tree and then how they were placed somewhat symmetrically, faces and eyes covered, children wrapped with cables to prevent them from resisting, yeesh. Demons aren't real but if they were, this would exactly be the work of one Sardar Udham. Unexpectedly good. If anything, the show has taken great care in not showing disturbing visuals. It's just the idea of something like this happening that fucks up your mind. Like it might have been happening for 11 years in your neighbourhood and you have no idea. Normality is just an illusion. Going through this list, one week at a time : Copenhagen: a movie based on a conversation between physicists Werner Heisenberg (played by Daniel Craig) and Niels Bohr in 1941. The Trip - recently released. Amazing one-time watch movie. And Dune! already waiting for part 2. I hope it comes fast enough. I have ran out of good movies/shows to watch. And as a person who watches too many movies it's depressing. Every new movie releasing only in cinema isn't helping either. This weekend watched Cop Shop not the best but it's entertaining till the end. Ending could have been better though. I m searching for an ad ft Malliswari ve song! I remember the first catchy song I noticed through this ad. It was a punky ad featuring a man with curly long hair dancing on the same song with mask on…and surprising everyone around him.. ad was probably of any telecom service in Early 2000’s (I feel it’s an idea ad) can someone share the link of that ad? That's impossible. There's just so much good cinema out there. Only Murders in the Building on Hotstar Disney+.Really liked this series, last episodes drops tomorrow Taskmaster is my current guilty pleasure. Watch it everyday Friday in the morning! If you like UK panel TV show guests, you probably will like Taskmaster. Bonus: New episodes are made available on YouTube every week! I love Taskmaster, QI (more Stephen Fry, less Sandy Toksvig, but both hosts are good in their own right) and WILTY! Favourite guest: Bill Bailey, can't get enough of that guy's humour. Liked an episode or two of 8 out of 10 cats, but never caught on with me. Similar feeling for Only Connect. Watched Caliphate on netflix , didn't hide behind political correctness . Very well made . ISIS from inside , not a hidden gem a such , imdb &gt;8 'Paatal Lok' has been the best Indian show so far. Wish it got more appreciation than it did at the time of its release. The show, and particularly the character arc of Hathiram Chaudhary has great re-watch value. Bill is hilarious . But on QI my Favourite guest is Aisling Bea . To be fair I probably like all of the guests bar a couple because I can't understand their accent properly . Try \"8 Out of 10 cats does countdown\" , it is better than 8 out of 10 cats ."
}