{
    "id": "16bcf18",
    "title": "India to Bharat LIVE Updates: Jaishankar says connotation of 'Bharat' reflected in Constitution",
    "url": "https://www.reddit.com/r/india/comments/16bcf18/india_to_bharat_live_updates_jaishankar_says/",
    "selftext": "Invitations for a G20 dinner has triggered a political slugfest ahead of the key G20 Summit and Parliament special session. What's the controversy? As per sources, invitations was sent in the name of 'President of Bharat' instead of the customary 'President of India. As the information came to light, the Opposition alleged that the Modi government is planning to drop India and stay with just Bharat as the country's name. Meanwhile, speculations are rife that the government may also bring a resolution in Parliament to \"rename\" India as 'Bharat'.  \nFollow LIVE Updates here👇  \n[https://www.cnbctv18.com/india/india-to-bharat-live-updates-pm-modi-govt-proposal-to-change-country-name-in-parliament-17721891.htm](https://www.cnbctv18.com/india/india-to-bharat-live-updates-pm-modi-govt-proposal-to-change-country-name-in-parliament-17721891.htm)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693980775.0,
    "convurl": "https://external-preview.redd.it/9CSUHrYy_DHKMGEXTkGZrDgHtri8-RRvs9uM21cMrTc.jpg?auto=webp&s=fb16f60aac04e4cb1db1287b1dfb925dd0091c9c",
    "comments": [],
    "cleaned_text": "india bharat live updates jaishankar says connotation bharat reflected constitution invitations g dinner triggered political slugfest ahead key g summit parliament special session whats controversy per sources invitations sent name president bharat instead customary president india information came light opposition alleged modi government planning drop india stay bharat countrys name meanwhile speculations rife government may also bring resolution parliament rename india bharat follow live updates httpswwwcnbctvcomindiaindiatobharatliveupdatespmmodigovtproposaltochangecountrynameinparliamenthtmhttpswwwcnbctvcomindiaindiatobharatliveupdatespmmodigovtproposaltochangecountrynameinparliamenthtm ",
    "cleaned_title": "india bharat live updates jaishankar says connotation bharat reflected constitution",
    "cleaned_selftext": "invitations g dinner triggered political slugfest ahead key g summit parliament special session whats controversy per sources invitations sent name president bharat instead customary president india information came light opposition alleged modi government planning drop india stay bharat countrys name meanwhile speculations rife government may also bring resolution parliament rename india bharat follow live updates httpswwwcnbctvcomindiaindiatobharatliveupdatespmmodigovtproposaltochangecountrynameinparliamenthtmhttpswwwcnbctvcomindiaindiatobharatliveupdatespmmodigovtproposaltochangecountrynameinparliamenthtm",
    "cleaned_comments": "",
    "light_cleaned_title": "India to Bharat LIVE Updates: Jaishankar says connotation of 'Bharat' reflected in Constitution",
    "light_cleaned_selftext": "Invitations for a G20 dinner has triggered a political slugfest ahead of the key G20 Summit and Parliament special session. What's the controversy? As per sources, invitations was sent in the name of 'President of Bharat' instead of the customary 'President of India. As the information came to light, the Opposition alleged that the Modi government is planning to drop India and stay with just Bharat as the country's name. Meanwhile, speculations are rife that the government may also bring a resolution in Parliament to \"rename\" India as 'Bharat'. Follow LIVE Updates here👇 [https://www.cnbctv18.com/india/india-to-bharat-live-updates-pm-modi-govt-proposal-to-change-country-name-in-parliament-17721891.htm](https://www.cnbctv18.com/india/india-to-bharat-live-updates-pm-modi-govt-proposal-to-change-country-name-in-parliament-17721891.htm)",
    "light_cleaned_comments": ""
}