{
    "id": "nut22u",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/nut22u/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games as your entire post, make sure to write a word or two about the games.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**The Gaming Thread is posted every two weeks on Tuesday mornings.**\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 22,
    "num_comments": 55,
    "created_utc": 1623115811,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Pro Evo Soccer 2017 ( with mods for 2021/22 season)",
        "Frostpunk is free on Epic this week. Can't recommend it enough for strategy/building players. Well polished and great story. I bought the whole pack last year and well worth it. One of the best games I have played ever.\n\nDota is having the Animajor tournament. Great production and casting. I don't play anymore but Dota pro matches are a treat to watch even as a newbie. \n\nWarhammer underworlds online is free to own on steam right now. Not a fan of this genre but I love warhammer stuff.",
        "Playing Days Gone.\n\nDunno why, but playing a zombie apocalypse game during lockdown seemed oddly fitting to me.",
        "im making the fictional champions league stadium for cities skylines https://i.postimg.cc/ssCw5B6T/Untitled.png\n\nr/soccer mods allowed me to post it there as OC content",
        "Playing Call of Duty Mobile. I need active clan.",
        "Started playing Life is strange. Currently finished ep 2. It's really a nice game",
        "Blazing through Metro Redux. Atmosphere's quite neat though some aspects of the game are enough to make you uninstall.",
        "Kingpin Life of Crime..people are missing some great stuff from the early 2000s because of myopic focus on latest AAA titles :)",
        "They are established sites thought the reviews in the Indian gaming sub is more focused on them price scalping or not allowing some cancellations. It’s always better to buy local in your city and they can be cheaper than online prices. Good luck !",
        "Playing Yakuza 0 :D",
        "Looking for driving games that can be played using keyboard/mouse. For nostalgic reasons i tried playing a newer NFS game and found out that without the steering wheel setup it is close to not playable.",
        "Suggest a game to make friends online?",
        "I would suggest Monster hunter world. This is a game where hunters can co op to fight monsters and there are 16 player lobbies. I have made so many great friends in this game over like 2 years.",
        "It’s a really underrated game. Clearing zombie hordes is extremely fun :)",
        "Currently playing :\n\nHellblade: Senua's Sacrifice\nRed Dead Redemption 2",
        "Newegg.",
        "These are all Legit. Get SSD from onlyssd, it's owned by primeabgb\n\nYou might also join indiangaming sub",
        "Witcher 3 and RDR2 second playthrough",
        "Instead of spending around 7k for HDD add 1k and get 1TB SSD",
        "I played entirety of Driver San Francisco and it was a blast. Drifting can be hard though",
        "Playing mafia 2 , a damn masterpiece it is.",
        "I never played GTA 3 . So I booted up.\n\nIt seems clunky but feels better than Vice City and San Andreas in terms of dull aesthetic.GTA 4 carries it over with the dull vibes. Apart from aesthetic its horrible. You cant hit cars with baseball bat. How will I wreck things now ? You have no bikes or helicopters or good planes.",
        "Any suggestion for a good adventure game for the ps4?\n\nApart from Unchartered",
        "Have finished Ghost of Tsushima, Spiderman, Spiderman:MilesMorales, GTA5, Unchartered, NFS HEAT, Journey, Raji, Avengers 🤮 need some more ps4 games.\nI enjoy action/adventure with strong story line",
        "Play The Last of Us!",
        "Did u try total war?",
        "Sekiro? DARK Souls? Bloodborne? Demon Souls? Witcher 3? Hmmm... Assassins Creed Valhalla? Horizon Zero Dawn? Resident Evil 2-8? Hmmm.... Metal Gear Solid 5? That sounds like plenty to start with.",
        "Horizon Zero Dawn? I have another answer with more options",
        "Just checked the game on steam and priced almost at 3000 inr.\n\nWay too costly for me",
        "God of War",
        "Spiderman is great. It is cheap also now",
        "I played house party, summer time saga, now playing breeders of the nephylim",
        "playing some cuphead, Metroid Prime and F-zero GX",
        "Red Dead Redemption 2! If you liked tsushima you'll love RDR2 as well",
        "NEET Aspirant simulator (2021)",
        "Try elder scrolls online, it doesn't have Asia server but it has good enough base from india. You can be part of guild events, can't do GTA online level things but it's pretty good if you're into mmorpg's.",
        "Check out euro truck simulator you might like it. It's a drive and chill game.",
        "Try Dota 2 .",
        "Any one here playing fortnite like me? This season has aliens and things",
        "It is one of the best games i've played. Highly recommend it!",
        "Rec room",
        "Indians Sims would be great idea where you have the illusion of choice but your decisions are somewhat predetermined by the conditions set by the environment you grow up in",
        "pick it up on sale. the game is more than worth it ... it has like 200 + hrs of great content.",
        "Dota 2 is for people to make enemies.\n*continues to lose matches with 200mmr*",
        "Same here.",
        "Great game for lockdown.",
        "Half Life: Alyx",
        "...",
        "Warframe (you need a decent pc though)",
        "Not a fan of the micro-strategy genre tbh. I prefer macro strategies like Paradox games, Warhammer dawn of war etc.",
        "Ohh"
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games playing played going play mobile board games included game looking forward developer show us wares please dont list names games entire post make sure write word two games check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings",
    "cleaned_comments": "pro evo soccer mods season frostpunk free epic week cant recommend enough strategybuilding players well polished great story bought whole pack last year well worth one best games played ever dota animajor tournament great production casting dont play anymore dota pro matches treat watch even newbie warhammer underworlds online free steam right fan genre love warhammer stuff playing days gone dunno playing zombie apocalypse game lockdown seemed oddly fitting im making fictional champions league stadium cities skylines rsoccer mods allowed post oc content playing call duty mobile need active clan started playing life strange currently finished ep really nice game blazing metro redux atmospheres quite neat though aspects game enough make uninstall kingpin life crimepeople missing great stuff early myopic focus latest aaa titles established sites thought reviews indian gaming sub focused price scalping allowing cancellations always better buy local city cheaper online prices good luck playing yakuza looking driving games played using keyboardmouse nostalgic reasons tried playing newer nfs game found without steering wheel setup close playable suggest game make friends online would suggest monster hunter world game hunters co op fight monsters player lobbies made many great friends game like years really underrated game clearing zombie hordes extremely fun currently playing hellblade senuas sacrifice red dead redemption newegg legit get ssd onlyssd owned primeabgb might also join indiangaming sub witcher rdr second playthrough instead spending around k hdd add k get tb ssd played entirety driver san francisco blast drifting hard though playing mafia damn masterpiece never played gta booted seems clunky feels better vice city san andreas terms dull aestheticgta carries dull vibes apart aesthetic horrible cant hit cars baseball bat wreck things bikes helicopters good planes suggestion good adventure game ps apart unchartered finished ghost tsushima spiderman spidermanmilesmorales gta unchartered nfs heat journey raji avengers need ps games enjoy actionadventure strong story line play last us u try total war sekiro dark souls bloodborne demon souls witcher hmmm assassins creed valhalla horizon zero dawn resident evil hmmm metal gear solid sounds like plenty start horizon zero dawn another answer options checked game steam priced almost inr way costly god war spiderman great cheap also played house party summer time saga playing breeders nephylim playing cuphead metroid prime fzero gx red dead redemption liked tsushima youll love rdr well neet aspirant simulator try elder scrolls online doesnt asia server good enough base india part guild events cant gta online level things pretty good youre mmorpgs check euro truck simulator might like drive chill game try dota one playing fortnite like season aliens things one best games ive played highly recommend rec room indians sims would great idea illusion choice decisions somewhat predetermined conditions set environment grow pick sale game worth like hrs great content dota people make enemies continues lose matches mmr great game lockdown half life alyx warframe need decent pc though fan microstrategy genre tbh prefer macro strategies like paradox games warhammer dawn war etc ohh",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games we're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games as your entire post, make sure to write a word or two about the games. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **The Gaming Thread is posted every two weeks on Tuesday mornings.**",
    "light_cleaned_comments": "Pro Evo Soccer 2017 ( with mods for 2021/22 season) Frostpunk is free on Epic this week. Can't recommend it enough for strategy/building players. Well polished and great story. I bought the whole pack last year and well worth it. One of the best games I have played ever. Dota is having the Animajor tournament. Great production and casting. I don't play anymore but Dota pro matches are a treat to watch even as a newbie. Warhammer underworlds online is free to own on steam right now. Not a fan of this genre but I love warhammer stuff. Playing Days Gone. Dunno why, but playing a zombie apocalypse game during lockdown seemed oddly fitting to me. im making the fictional champions league stadium for cities skylines r/soccer mods allowed me to post it there as OC content Playing Call of Duty Mobile. I need active clan. Started playing Life is strange. Currently finished ep 2. It's really a nice game Blazing through Metro Redux. Atmosphere's quite neat though some aspects of the game are enough to make you uninstall. Kingpin Life of Crime..people are missing some great stuff from the early 2000s because of myopic focus on latest AAA titles :) They are established sites thought the reviews in the Indian gaming sub is more focused on them price scalping or not allowing some cancellations. It’s always better to buy local in your city and they can be cheaper than online prices. Good luck ! Playing Yakuza 0 :D Looking for driving games that can be played using keyboard/mouse. For nostalgic reasons i tried playing a newer NFS game and found out that without the steering wheel setup it is close to not playable. Suggest a game to make friends online? I would suggest Monster hunter world. This is a game where hunters can co op to fight monsters and there are 16 player lobbies. I have made so many great friends in this game over like 2 years. It’s a really underrated game. Clearing zombie hordes is extremely fun :) Currently playing : Hellblade: Senua's Sacrifice Red Dead Redemption 2 Newegg. These are all Legit. Get SSD from onlyssd, it's owned by primeabgb You might also join indiangaming sub Witcher 3 and RDR2 second playthrough Instead of spending around 7k for HDD add 1k and get 1TB SSD I played entirety of Driver San Francisco and it was a blast. Drifting can be hard though Playing mafia 2 , a damn masterpiece it is. I never played GTA 3 . So I booted up. It seems clunky but feels better than Vice City and San Andreas in terms of dull aesthetic.GTA 4 carries it over with the dull vibes. Apart from aesthetic its horrible. You cant hit cars with baseball bat. How will I wreck things now ? You have no bikes or helicopters or good planes. Any suggestion for a good adventure game for the ps4? Apart from Unchartered Have finished Ghost of Tsushima, Spiderman, Spiderman:MilesMorales, GTA5, Unchartered, NFS HEAT, Journey, Raji, Avengers 🤮 need some more ps4 games. I enjoy action/adventure with strong story line Play The Last of Us! Did u try total war? Sekiro? DARK Souls? Bloodborne? Demon Souls? Witcher 3? Hmmm... Assassins Creed Valhalla? Horizon Zero Dawn? Resident Evil 2-8? Hmmm.... Metal Gear Solid 5? That sounds like plenty to start with. Horizon Zero Dawn? I have another answer with more options Just checked the game on steam and priced almost at 3000 inr. Way too costly for me God of War Spiderman is great. It is cheap also now I played house party, summer time saga, now playing breeders of the nephylim playing some cuphead, Metroid Prime and F-zero GX Red Dead Redemption 2! If you liked tsushima you'll love RDR2 as well NEET Aspirant simulator (2021) Try elder scrolls online, it doesn't have Asia server but it has good enough base from india. You can be part of guild events, can't do GTA online level things but it's pretty good if you're into mmorpg's. Check out euro truck simulator you might like it. It's a drive and chill game. Try Dota 2 . Any one here playing fortnite like me? This season has aliens and things It is one of the best games i've played. Highly recommend it! Rec room Indians Sims would be great idea where you have the illusion of choice but your decisions are somewhat predetermined by the conditions set by the environment you grow up in pick it up on sale. the game is more than worth it ... it has like 200 + hrs of great content. Dota 2 is for people to make enemies. *continues to lose matches with 200mmr* Same here. Great game for lockdown. Half Life: Alyx ... Warframe (you need a decent pc though) Not a fan of the micro-strategy genre tbh. I prefer macro strategies like Paradox games, Warhammer dawn of war etc. Ohh"
}