{
    "id": "154oat3",
    "title": "Very serious matter. Posting here for maximum reach",
    "url": "https://www.reddit.com/gallery/154oat3",
    "selftext": "TW suicide\n\n\nI just came across this and it has completely shaken me to the core. Please post this elsewhere for maximum reach.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689852484.0,
    "convurl": "https://i.redd.it/8fbwbyi0v3db1.jpg",
    "comments": [
        "Commenting for visibility",
        "I have always heard positive reviews about PES University. Guess what it's only in the papers and YouTube videos. In reality it's just another private institution (school/college) filled with sadistic bastards, but what they did is literally a crime. They mentally harassed a student to a such low point that he committed suicide!? \n\nThe student and his family deserves instant justice!!\n\nPES University should be boycotted until the student gets justice and the staff is suspended!!\n\nI suggest you to post this on r/bangalore also. There are some social workers who might notice this. They who would be a huge help for that student's family!\n\nMay his soul rest in peace. 🕊️🙏",
        "Commenting for visibility",
        "Thanks a lot, I'll post it there yes",
        "All the engg colleges in bangalore have extremely corrupt administration. Its given when parent university VTU itself is corrupt to the core. Management quota is legitimised and a massive ring. It is an accepted practice to always send every semester paper for re-evaluation because initial marks will always be low, and one has to spend several thousands for that every semester. There was a VC I recall who had faked his class 10 pass certificate and yet was heading such an important post in the state.",
        "CFR",
        "It's not only Bangalore. The whole country is run by such corrupt organizations. Unfortunately, us common people can't do much about it."
    ],
    "cleaned_text": "serious matter posting maximum reach tw suicide came across completely shaken core please post elsewhere maximum reach ",
    "cleaned_title": "serious matter posting maximum reach",
    "cleaned_selftext": "tw suicide came across completely shaken core please post elsewhere maximum reach",
    "cleaned_comments": "commenting visibility always heard positive reviews pes university guess papers youtube videos reality another private institution schoolcollege filled sadistic bastards literally crime mentally harassed student low point committed suicide student family deserves instant justice pes university boycotted student gets justice staff suspended suggest post rbangalore also social workers might notice would huge help students family may soul rest peace commenting visibility thanks lot ill post yes engg colleges bangalore extremely corrupt administration given parent university vtu corrupt core management quota legitimised massive ring accepted practice always send every semester paper reevaluation initial marks always low one spend several thousands every semester vc recall faked class pass certificate yet heading important post state cfr bangalore whole country run corrupt organizations unfortunately us common people cant much",
    "light_cleaned_title": "Very serious matter. Posting here for maximum reach",
    "light_cleaned_selftext": "TW suicide I just came across this and it has completely shaken me to the core. Please post this elsewhere for maximum reach.",
    "light_cleaned_comments": "Commenting for visibility I have always heard positive reviews about PES University. Guess what it's only in the papers and YouTube videos. In reality it's just another private institution (school/college) filled with sadistic bastards, but what they did is literally a crime. They mentally harassed a student to a such low point that he committed suicide!? The student and his family deserves instant justice!! PES University should be boycotted until the student gets justice and the staff is suspended!! I suggest you to post this on r/bangalore also. There are some social workers who might notice this. They who would be a huge help for that student's family! May his soul rest in peace. 🕊️🙏 Commenting for visibility Thanks a lot, I'll post it there yes All the engg colleges in bangalore have extremely corrupt administration. Its given when parent university VTU itself is corrupt to the core. Management quota is legitimised and a massive ring. It is an accepted practice to always send every semester paper for re-evaluation because initial marks will always be low, and one has to spend several thousands for that every semester. There was a VC I recall who had faked his class 10 pass certificate and yet was heading such an important post in the state. CFR It's not only Bangalore. The whole country is run by such corrupt organizations. Unfortunately, us common people can't do much about it."
}