{
    "id": "miyjf2",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/miyjf2/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 39,
    "num_comments": 123,
    "created_utc": 1617413421,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Are theatres in your area open?",
        "Any Twin Peaks fans here?",
        "Nope.",
        "Any suggestions for tv show? I need something like curb or Seinfeld \n\nHave already watched arrested development",
        "Watched The Great Indian Kitchen. Fantastic movie. No one can make movies like Malayalam industry. Hard hitting realistic. Great take on patriarchal society, women treated as second class citizens.",
        "Watch Uncommon Sense with Saloni Gaur( Sony LIV/ YouTube) for a satirical take on the issues being faced in India",
        "You could watch its always sunny in philadelphia.  Community is a goood shout too. \n\nCurb/seinfeld are as good as comedy gets. Havent seen anything which could top those shows. \n\n\nIf you are into british comedies, i would suggest peep show/ the it crowd.",
        "Will check it out",
        "Watched always Sunny, it crowd, community\nWill check out peer show",
        "Not exactly a comedy, but entourage is a good watch as well in case you havent seen it.",
        "Beautiful Anonymous is a podcast hosted by this chill guy, who has 1 hour phone conversations with anonymous people that confess things about their lives and they can have either really wholesome or really tragic endings. The stories can get really weird/funny and they’re nice to listen to when grocery shopping or going on a walk. I’ve had to keep myself from laughing in public and sometimes the stories stop you in your tracks.\n\nThe one I listened to recently was about a woman who grew up with parents who are psychic and how that affected her childhood...Thank god I don’t have psychic parents.",
        "Love entourage, It's a very chill show .",
        "Where is it available?",
        "Any recommendations on series with light 20-min comedies?\n\nWatched The Office and re-run of Seinfeld lately. Stressing on 20 mins as it is a good enough break during the work day.",
        "Barry - dark comedy",
        "Check out the Canadian tv series \"Schitt's Creek\". One of the best light comedies I have watched.",
        "Anyone watch Angie Tribeca on Prime Video? I think it's funny. Gives me the feels of Monty Python.",
        "Schitt's Creek is a great show. Be sure to check it out.",
        "Thanks - have heard a lot about it. Will try it out.",
        "Will do! Thanks!\n\nI read that the first couple of seasons aren't as good. The later ones are awesome and won the Emmys. What was your experience like?",
        "Thanks - will explore them.",
        "That 70's show, Entourage, After life",
        "Honestly i like all the seasons pretty much but ya the last couple of seasons is when the show really shines. I had a lot of fun watching it.",
        "Recently watched the movie \"Run\" by Aneesh Chaganty.  It was a really good film imo but nothing compared to his previous film \"Searching\". Do check out these two movies. I advise watching \"Run\" first and then watch \"Searching\".  You will then understand what a masterpiece \"Searching\" is.\nThis man showed how to create great movies even with low budgets.",
        "Brooklyn Nine Nine",
        "Here’s the link for it. If you scroll down you can see there’s a Full Episode List and it shows you all the stories to choose from. Enjoy!\n\nhttps://www.earwolf.com/show/beautiful-anonymous/",
        "Rona hai weekend pe to\n1. Incendies.\n2. 12 years a slave",
        "Finished the last episode of Resident alien yesterday and it was a great new show.Also watched the new episode of Falcon and the winter soldier.Would also recommend watching 'What we do in the Shadows'  if you wanna watch comedy.",
        "Have you watched what we do in the shadows? It's become my new favorite comedy show.",
        "Where can i watch Seinfeld ?",
        "It's on prime - will have to use VPN.",
        "Couldn't agree more about the Malayalam cinema part. I lost all hopes for our movie industry with the garbage that bollywood was putting out. After watching 'jalikattu' and 'ee.maa.yau' , my faith was restored.",
        "I've been watching 'The Boys' it's great, one of the most interesting series I've watched in a while. \nAlso, I watched Mean Streets yesterday decent movie if anyone wants to check it out.",
        "Saw Mcmafia ( based on some jurno book ) and CB Strike ( based on JK Rowling novel)  . Both were quite awesome.\n\nLine of Duty is another awesome miniseries . Season 6 going on as of now . First 2 episodes were quite good .",
        "Just subscribed, will listen. Thanks for a unique suggestion.",
        "Veep. You can watch it on Hotstar.",
        "Ted Lasso..",
        "Just watched G vs K , in Cinepolis , hardly 15 people were there",
        "Mcmafia was interesting but, still waiting for second season.",
        "watch, Amend: The Fight for America  on netflix , powerful docu series , the stark reality of how India is in fact going in reverse will hit hard.\n\nhttps://www.imdb.com/title/tt13973320/\n\n and oh yeah Line of duty of netflix is awesome it's a wonder that i missed this gem for years.",
        "Watch Flower of Evil on Netflix. One of the best thriller,suspense k-drama.",
        "Irul (Malayalam) was a decent fresh thriller, gorgeously looking too.",
        "New sci-fi recommendation- Made for Love",
        "#restorethesnyderverse\n\nloved the snyder cut. especially flight 2.0 and flash's scene are cbm legends for me",
        "boys s2 was a letdown",
        "Try community, it's by Dan Harmon (co creator of Rick and Morty although nothing like it)",
        "No, south movies have the worst pacing but yeah great cinematography.",
        "Thanks for the heads up",
        "It was meh...",
        "Yeah they don't have realistic touch.",
        "They somehow integrated women empowerment in that too...",
        "Lol it was the most fun I had from a CBM since infinity war.",
        "Community, silicon valley",
        "Didn't understand everything but it was okay. It is a heavy watch tbh.",
        "1. The namesake (Irrfan Khan)\n2. It's a beautiful life. (Short movie by an Oscar winner)\n3. Stand by me. \nAll three of them are really terrific watch",
        "I guess since joker has set such a high bar, I'll be disappointed with all these heavy VFX movies...",
        "* Fleabag\n* Derry Girls\n* Santa Clarita Diet",
        "If you like documentaries check out:\n\nMaking a Dictator (Removed from Hotstar)\n\n[10 years with Hayao Miyazaki](https://www3.nhk.or.jp/nhkworld/en/ondemand/program/video/10yearshayaomiyazaki/). You can watch it for free on this site, the official site btw. A look at the iconic director's working style and creative process.",
        "It isn't. I liked s2 more.",
        "Which platform is this on?",
        "The first season is a bit slow and the show takes some time to find its legs. Post that its amazing. Very heartfelt and surprisingly entertaining.",
        "Does anybody know how can I access old sitcoms like Frasier, Taxi, etc. I would not want to use torrent if possible",
        "Watching\n-Falcon and The Winter Soldier\n-godzilla vs kong\n-anime movies like(your name, weathering with you, the silent voice), underrated guys you should try these",
        "Nah man s02 was great, always decide for yourself if a show is good or not cause everyone has their own tastes",
        "Apple TV+",
        "Which streaming service has these animes ?",
        "9anime.to  or any 9anime sites... You will find all anime tv series and movies there in good quality",
        "Thanks..",
        "For the anime fans \"My Hero Academia\" is back with Season 5.",
        "Where did you watch it?",
        "Available on Amazon prime and Neestream",
        "Godzilla vs Kong was lot of fun. Then i saw Wonder Woman 84. That was NOT much fun.",
        "That's weird, s2 was great",
        "Thanks for the link!",
        "After Attack on Titan season 4 part-I , I couldn't resist and read rest of the manga chapters. Isayama 🙏",
        "Torrent",
        "Schitt's Creek",
        "The Inbetweeners if you like/wanna try British Comedies",
        "Croupier - Clive Owen plays a croupier who repeats that he doesn't gamble but makes questionable decisions in real life throughout the film. Good film. 3.5/5\n\nNomadland - It is a film about the Nomad culture in USA. It has many people playing themselves in the film. Frances Mcdormand is brilliant and the supporting cast do a really good job despite being non-actors. An extremely heartfelt experience of a film 4/5.\n\nThe Kid Detective - Enjoyable thriller comedy. It is pretty funny in bits. The lead, Adam Brody, does a very convincing job. 3.5/5\n\nThe Pledge - Jack Nicholson plays a cop investigating a case on his own after retirement. It also seems to be about loneliness and family. Decent film 3.5/5\n\nNocturnal Animals - I definitely will recommend this film. This is one of the films that really made sense to me in all its symbolism. Great performances by Jake Gyllenhall and Amy Adams. 4/5\n\nThe Father - This film hit me really hard, on a personal level because of my experience with patients of dementia and Alzheimers. Anthony Hopkins does a fantastic job in this film. 4.5/5.",
        "Parks and Recreation.",
        "&gt;Stand by me\n\nWIll check this out. I suspect I saw this film as a kid but don't remember it well.",
        "I watched this video on YT and thought of sharing it here.[https://youtu.be/j5v8D-alAKE](https://youtu.be/j5v8D-alAKE)  \n This video is about stuff: light bulbs, printers, phones and why they aren't better.",
        "There's no such thing as South movies. There are 4 major south Indian languages",
        "Tell that after watching Kumbalangi Nights, Jallikattu, Ee Ma Yau, and other malayalam films",
        "surprised nobody's talking bout mr robot - fans upvote!\none of the best shows ive watched.",
        "wdym? how do you think you're gonna find it if you don't use piracy?",
        "Yeah, definitely recommended to all the technology freak",
        "&gt; Nocturnal Animals\n\nNetflix or prime?",
        "Netflix",
        "It's wonderful. It striked me as something pure amidst all BS going on. The ending really ties the movie together.",
        "Is the last season worth it?? I'm really in a depression phase and don't wanna see anything too much dark.",
        "Nocturnal animals is my favourite movie. I have watched it so many times. It doesn't paints all artists as fake and hits really hard.",
        "I haven't watched the rest of the movies In your list. Thanks for the recommendation. You seem like a really genuine guy. Are you a doctor??",
        "I'm waiting for all seasons to finish. Utna padhne ki himmat nhi hai... Also waiting for one punch man season 3.",
        "Telegram maybe but you'll have to search a lot.",
        "Ab zindagi mein aur darkness nhi chahiye. Science ka koi na koi bright side to hona chahiye future mein.\nArrival dekhne mein kafi maja aaya tha. Hope is a good thing.",
        "Youtube spoilers were all over bhai. Raha nahi gaya padh liya. But is really amazing. Last chapter will be coming this week.\nYa same waiting for one punch man S3.",
        "I couldn't get myself to watch them. The pace seems slightly high in South indian movies. But maybe they take some time to grow over you. Also I'm north indian so they are less relatable to me. Idk.",
        "I've downloaded incendies. Denis Villeneuve par poora bharosa hai.",
        "Podcast: Algorithm. The episode with Rationalist Narendra Nayak in which he discussed about receiving death threats and losing friends like Gauri Lankesh and Narendra Dabholkar to murders.\n\n[Algorithm Podcast- Narendra Nayak](https://youtu.be/5HZ-NUWsxtg)",
        "if anything, it will make you stronger bro. try to understand the message behind it tho.",
        "Our children's future is doomed bro. Welcome to the party!",
        "What does pace is slightly high mean? Not all movies are the same. \n\nAnd which movie did you even try to watch? It's okay if you don't watch them. Just don't generalize 4 different industries which are different from each other and call them they don't have realistic touch when you haven't even watched them.",
        "I can't get over just how good The Office is.",
        "&gt; Altered Carbon (Season 1 was good, Season 2 could have been better but didn't disappoint)\n\nBoth seasons start out very strong and toward the end of 2 I just couldn't take all the action etc. Would give anything for a slower-paced sci-fi /fantasy.",
        "Is it about planned obsolescence? Sounds like it.",
        "Nocturnal Animals tells a story in the most powerful way we can all understand, as a story. It's a meta story. A story of a guy telling his life story as an analogy through his novel. The ending of the movie is fucking brilliant and the soundtrack is outstanding! Beautiful cinematography and great acting too.",
        "I watched The Pledge long ago. The ending is depressing though. 🤦‍♂️",
        "It is sad but the whole film tied well together for me.",
        "Thank you for the compliment. No, I am not a doctor. I have had Alzheimers and Dementia in my family.",
        "Yeah. It builds up to what looks like a cop vs villain showdown then it becomes something else. It takes the audience by surprise though and connects the opening scene to that ending. It all does make sense at the end.",
        "Is Stand By Me the film where the kids pool their pocket money and pay a hooker to show them her bare breasts? And then they have cigarette after that. I remember this scene from a film but cannot place it. It was years ago that I saw this scene and I was very young then.",
        "Jerry also has this desperate need to prove himself (to perhaps himself only) right.\n\nHe finds a loving woman and child when he clearly is lonely and in need for love. But that is not what he can appreciate or want. Perhaps that is why his previous marriages failed.\n\nAlthough he loves the little girl, he kind of uses her as a bait. And even though it is not proven for sure that there indeed was a bogeyman, Jerry's quest for the bogeyman is very real. It consumes him. He obviously goes crazy in that quest.\n\nJust rambling.",
        "I'm sorry I don't remember the nuances from the movie since I watched it over a decade ago. But I do remember that he uses the girl as bait and her mom asks him to fuck off. Also the serial killer who is never revealed definitely dies on the way to the location. His car burns up or something like that if I can remember it correctly. There's definitely a killer on the loose but his death brings out the glaring lack of human collection in the cops life. Ramble on my friend. That's an interesting movie. Such movies are rare. Subversion of audience's expectations!",
        "Yeah there are definite strong hints at a character who could probably be the killer and dies in an auto accident. And our protagonist is much too fixated on finding him. Drives him crazy. Makes me think what should one focus more on life.\n\nIncidentally, Sean Penn's another film Into the Wild is also about a quest of a man to live off nature, independently. Although very different films some similarities in the main character. No?",
        "Into the Wild, I watched many times. I love that movie. It's based on a real person who died of starvation alone in the wild, Chris McCandless. It's a rational look at how traveling is great and how it can also come with its own drawbacks if you're not prepared for it.",
        "Mccandless finds several loving and caring people throughout his journey. Some give him a job and others want to make him a part of their family. Although he is seeking something else.",
        "Yup.",
        "Yeah. Watched the whole thing. Planned obsolescence was taught in MBA. It broke my heart. They talk about profits but just think about the materials being wasted. That's so fucked up. Some people lose their lives to collect and gather various materials for say the iPhone and they ensure that the phone doesn't last long. That's messed up."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "theatres area open twin peaks fans nope suggestions tv show need something like curb seinfeld already watched arrested development watched great indian kitchen fantastic movie one make movies like malayalam industry hard hitting realistic great take patriarchal society women treated second class citizens watch uncommon sense saloni gaur sony liv youtube satirical take issues faced india could watch always sunny philadelphia community goood shout curbseinfeld good comedy gets havent seen anything could top shows british comedies would suggest peep show crowd check watched always sunny crowd community check peer show exactly comedy entourage good watch well case havent seen beautiful anonymous podcast hosted chill guy hour phone conversations anonymous people confess things lives either really wholesome really tragic endings stories get really weirdfunny theyre nice listen grocery shopping going walk ive keep laughing public sometimes stories stop tracks one listened recently woman grew parents psychic affected childhoodthank god dont psychic parents love entourage chill show available recommendations series light min comedies watched office rerun seinfeld lately stressing mins good enough break work day barry dark comedy check canadian tv series schitts creek one best light comedies watched anyone watch angie tribeca prime video think funny gives feels monty python schitts creek great show sure check thanks heard lot try thanks read first couple seasons arent good later ones awesome emmys experience like thanks explore show entourage life honestly like seasons pretty much ya last couple seasons show really shines lot fun watching recently watched movie run aneesh chaganty really good film imo nothing compared previous film searching check two movies advise watching run first watch searching understand masterpiece searching man showed create great movies even low budgets brooklyn nine nine heres link scroll see theres full episode list shows stories choose enjoy rona hai weekend pe incendies years slave finished last episode resident alien yesterday great new showalso watched new episode falcon winter soldierwould also recommend watching shadows wan na watch comedy watched shadows become new favorite comedy show watch seinfeld prime use vpn couldnt agree malayalam cinema part lost hopes movie industry garbage bollywood putting watching jalikattu eemaayau faith restored ive watching boys great one interesting series ive watched also watched mean streets yesterday decent movie anyone wants check saw mcmafia based jurno book cb strike based jk rowling novel quite awesome line duty another awesome miniseries season going first episodes quite good subscribed listen thanks unique suggestion veep watch hotstar ted lasso watched g vs k cinepolis hardly people mcmafia interesting still waiting second season watch amend fight america netflix powerful docu series stark reality india fact going reverse hit hard oh yeah line duty netflix awesome wonder missed gem years watch flower evil netflix one best thrillersuspense kdrama irul malayalam decent fresh thriller gorgeously looking new scifi recommendation made love restorethesnyderverse loved snyder cut especially flight flashs scene cbm legends boys letdown try community dan harmon co creator rick morty although nothing like south movies worst pacing yeah great cinematography thanks heads meh yeah dont realistic touch somehow integrated women empowerment lol fun cbm since infinity war community silicon valley didnt understand everything okay heavy watch tbh namesake irrfan khan beautiful life short movie oscar winner stand three really terrific watch guess since joker set high bar ill disappointed heavy vfx movies fleabag derry girls santa clarita diet like documentaries check making dictator removed hotstar years hayao miyazakihttpswwwnhkorjpnhkworldenondemandprogramvideoyearshayaomiyazaki watch free site official site btw look iconic directors working style creative process isnt liked platform first season bit slow show takes time find legs post amazing heartfelt surprisingly entertaining anybody know access old sitcoms like frasier taxi etc would want use torrent possible watching falcon winter soldier godzilla vs kong anime movies likeyour name weathering silent voice underrated guys try nah man great always decide show good cause everyone tastes apple tv streaming service animes animeto anime sites find anime tv series movies good quality thanks anime fans hero academia back season watch available amazon prime neestream godzilla vs kong lot fun saw wonder woman much fun thats weird great thanks link attack titan season parti couldnt resist read rest manga chapters isayama torrent schitts creek inbetweeners likewanna try british comedies croupier clive owen plays croupier repeats doesnt gamble makes questionable decisions real life throughout film good film nomadland film nomad culture usa many people playing film frances mcdormand brilliant supporting cast really good job despite nonactors extremely heartfelt experience film kid detective enjoyable thriller comedy pretty funny bits lead adam brody convincing job pledge jack nicholson plays cop investigating case retirement also seems loneliness family decent film nocturnal animals definitely recommend film one films really made sense symbolism great performances jake gyllenhall amy adams father film hit really hard personal level experience patients dementia alzheimers anthony hopkins fantastic job film parks recreation gtstand check suspect saw film kid dont remember well watched video yt thought sharing herehttpsyoutubejvdalakehttpsyoutubejvdalake video stuff light bulbs printers phones arent better theres thing south movies major south indian languages tell watching kumbalangi nights jallikattu ee yau malayalam films surprised nobodys talking bout mr robot fans upvote one best shows ive watched wdym think youre gon na find dont use piracy yeah definitely recommended technology freak gt nocturnal animals netflix prime netflix wonderful striked something pure amidst bs going ending really ties movie together last season worth im really depression phase dont wan na see anything much dark nocturnal animals favourite movie watched many times doesnt paints artists fake hits really hard havent watched rest movies list thanks recommendation seem like really genuine guy doctor im waiting seasons finish utna padhne ki himmat nhi hai also waiting one punch man season telegram maybe youll search lot ab zindagi mein aur darkness nhi chahiye science ka koi na koi bright side hona chahiye future mein arrival dekhne mein kafi maja aaya tha hope good thing youtube spoilers bhai raha nahi gaya padh liya really amazing last chapter coming week ya waiting one punch man couldnt get watch pace seems slightly high south indian movies maybe take time grow also im north indian less relatable idk ive downloaded incendies denis villeneuve par poora bharosa hai podcast algorithm episode rationalist narendra nayak discussed receiving death threats losing friends like gauri lankesh narendra dabholkar murders algorithm podcast narendra nayakhttpsyoutubehznuwsxtg anything make stronger bro try understand message behind tho childrens future doomed bro welcome party pace slightly high mean movies movie even try watch okay dont watch dont generalize different industries different call dont realistic touch havent even watched cant get good office gt altered carbon season good season could better didnt disappoint seasons start strong toward end couldnt take action etc would give anything slowerpaced scifi fantasy planned obsolescence sounds like nocturnal animals tells story powerful way understand story meta story story guy telling life story analogy novel ending movie fucking brilliant soundtrack outstanding beautiful cinematography great acting watched pledge long ago ending depressing though sad whole film tied well together thank compliment doctor alzheimers dementia family yeah builds looks like cop vs villain showdown becomes something else takes audience surprise though connects opening scene ending make sense end stand film kids pool pocket money pay hooker show bare breasts cigarette remember scene film place years ago saw scene young jerry also desperate need prove perhaps right finds loving woman child clearly lonely need love appreciate want perhaps previous marriages failed although loves little girl kind uses bait even though proven sure indeed bogeyman jerrys quest bogeyman real consumes obviously goes crazy quest rambling im sorry dont remember nuances movie since watched decade ago remember uses girl bait mom asks fuck also serial killer never revealed definitely dies way location car burns something like remember correctly theres definitely killer loose death brings glaring lack human collection cops life ramble friend thats interesting movie movies rare subversion audiences expectations yeah definite strong hints character could probably killer dies auto accident protagonist much fixated finding drives crazy makes think one focus life incidentally sean penns another film wild also quest man live nature independently although different films similarities main character wild watched many times love movie based real person died starvation alone wild chris mccandless rational look traveling great also come drawbacks youre prepared mccandless finds several loving caring people throughout journey give job others want make part family although seeking something else yup yeah watched whole thing planned obsolescence taught mba broke heart talk profits think materials wasted thats fucked people lose lives collect gather various materials say iphone ensure phone doesnt last long thats messed",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Are theatres in your area open? Any Twin Peaks fans here? Nope. Any suggestions for tv show? I need something like curb or Seinfeld Have already watched arrested development Watched The Great Indian Kitchen. Fantastic movie. No one can make movies like Malayalam industry. Hard hitting realistic. Great take on patriarchal society, women treated as second class citizens. Watch Uncommon Sense with Saloni Gaur( Sony LIV/ YouTube) for a satirical take on the issues being faced in India You could watch its always sunny in philadelphia. Community is a goood shout too. Curb/seinfeld are as good as comedy gets. Havent seen anything which could top those shows. If you are into british comedies, i would suggest peep show/ the it crowd. Will check it out Watched always Sunny, it crowd, community Will check out peer show Not exactly a comedy, but entourage is a good watch as well in case you havent seen it. Beautiful Anonymous is a podcast hosted by this chill guy, who has 1 hour phone conversations with anonymous people that confess things about their lives and they can have either really wholesome or really tragic endings. The stories can get really weird/funny and they’re nice to listen to when grocery shopping or going on a walk. I’ve had to keep myself from laughing in public and sometimes the stories stop you in your tracks. The one I listened to recently was about a woman who grew up with parents who are psychic and how that affected her childhood...Thank god I don’t have psychic parents. Love entourage, It's a very chill show . Where is it available? Any recommendations on series with light 20-min comedies? Watched The Office and re-run of Seinfeld lately. Stressing on 20 mins as it is a good enough break during the work day. Barry - dark comedy Check out the Canadian tv series \"Schitt's Creek\". One of the best light comedies I have watched. Anyone watch Angie Tribeca on Prime Video? I think it's funny. Gives me the feels of Monty Python. Schitt's Creek is a great show. Be sure to check it out. Thanks - have heard a lot about it. Will try it out. Will do! Thanks! I read that the first couple of seasons aren't as good. The later ones are awesome and won the Emmys. What was your experience like? Thanks - will explore them. That 70's show, Entourage, After life Honestly i like all the seasons pretty much but ya the last couple of seasons is when the show really shines. I had a lot of fun watching it. Recently watched the movie \"Run\" by Aneesh Chaganty. It was a really good film imo but nothing compared to his previous film \"Searching\". Do check out these two movies. I advise watching \"Run\" first and then watch \"Searching\". You will then understand what a masterpiece \"Searching\" is. This man showed how to create great movies even with low budgets. Brooklyn Nine Nine Here’s the link for it. If you scroll down you can see there’s a Full Episode List and it shows you all the stories to choose from. Enjoy! Rona hai weekend pe to 1. Incendies. 2. 12 years a slave Finished the last episode of Resident alien yesterday and it was a great new show.Also watched the new episode of Falcon and the winter soldier.Would also recommend watching 'What we do in the Shadows' if you wanna watch comedy. Have you watched what we do in the shadows? It's become my new favorite comedy show. Where can i watch Seinfeld ? It's on prime - will have to use VPN. Couldn't agree more about the Malayalam cinema part. I lost all hopes for our movie industry with the garbage that bollywood was putting out. After watching 'jalikattu' and 'ee.maa.yau' , my faith was restored. I've been watching 'The Boys' it's great, one of the most interesting series I've watched in a while. Also, I watched Mean Streets yesterday decent movie if anyone wants to check it out. Saw Mcmafia ( based on some jurno book ) and CB Strike ( based on JK Rowling novel) . Both were quite awesome. Line of Duty is another awesome miniseries . Season 6 going on as of now . First 2 episodes were quite good . Just subscribed, will listen. Thanks for a unique suggestion. Veep. You can watch it on Hotstar. Ted Lasso.. Just watched G vs K , in Cinepolis , hardly 15 people were there Mcmafia was interesting but, still waiting for second season. watch, Amend: The Fight for America on netflix , powerful docu series , the stark reality of how India is in fact going in reverse will hit hard. and oh yeah Line of duty of netflix is awesome it's a wonder that i missed this gem for years. Watch Flower of Evil on Netflix. One of the best thriller,suspense k-drama. Irul (Malayalam) was a decent fresh thriller, gorgeously looking too. New sci-fi recommendation- Made for Love #restorethesnyderverse loved the snyder cut. especially flight 2.0 and flash's scene are cbm legends for me boys s2 was a letdown Try community, it's by Dan Harmon (co creator of Rick and Morty although nothing like it) No, south movies have the worst pacing but yeah great cinematography. Thanks for the heads up It was meh... Yeah they don't have realistic touch. They somehow integrated women empowerment in that too... Lol it was the most fun I had from a CBM since infinity war. Community, silicon valley Didn't understand everything but it was okay. It is a heavy watch tbh. 1. The namesake (Irrfan Khan) 2. It's a beautiful life. (Short movie by an Oscar winner) 3. Stand by me. All three of them are really terrific watch I guess since joker has set such a high bar, I'll be disappointed with all these heavy VFX movies... * Fleabag * Derry Girls * Santa Clarita Diet If you like documentaries check out: Making a Dictator (Removed from Hotstar) [10 years with Hayao Miyazaki](https://www3.nhk.or.jp/nhkworld/en/ondemand/program/video/10yearshayaomiyazaki/). You can watch it for free on this site, the official site btw. A look at the iconic director's working style and creative process. It isn't. I liked s2 more. Which platform is this on? The first season is a bit slow and the show takes some time to find its legs. Post that its amazing. Very heartfelt and surprisingly entertaining. Does anybody know how can I access old sitcoms like Frasier, Taxi, etc. I would not want to use torrent if possible Watching -Falcon and The Winter Soldier -godzilla vs kong -anime movies like(your name, weathering with you, the silent voice), underrated guys you should try these Nah man s02 was great, always decide for yourself if a show is good or not cause everyone has their own tastes Apple TV+ Which streaming service has these animes ? 9anime.to or any 9anime sites... You will find all anime tv series and movies there in good quality Thanks.. For the anime fans \"My Hero Academia\" is back with Season 5. Where did you watch it? Available on Amazon prime and Neestream Godzilla vs Kong was lot of fun. Then i saw Wonder Woman 84. That was NOT much fun. That's weird, s2 was great Thanks for the link! After Attack on Titan season 4 part-I , I couldn't resist and read rest of the manga chapters. Isayama 🙏 Torrent Schitt's Creek The Inbetweeners if you like/wanna try British Comedies Croupier - Clive Owen plays a croupier who repeats that he doesn't gamble but makes questionable decisions in real life throughout the film. Good film. 3.5/5 Nomadland - It is a film about the Nomad culture in USA. It has many people playing themselves in the film. Frances Mcdormand is brilliant and the supporting cast do a really good job despite being non-actors. An extremely heartfelt experience of a film 4/5. The Kid Detective - Enjoyable thriller comedy. It is pretty funny in bits. The lead, Adam Brody, does a very convincing job. 3.5/5 The Pledge - Jack Nicholson plays a cop investigating a case on his own after retirement. It also seems to be about loneliness and family. Decent film 3.5/5 Nocturnal Animals - I definitely will recommend this film. This is one of the films that really made sense to me in all its symbolism. Great performances by Jake Gyllenhall and Amy Adams. 4/5 The Father - This film hit me really hard, on a personal level because of my experience with patients of dementia and Alzheimers. Anthony Hopkins does a fantastic job in this film. 4.5/5. Parks and Recreation. &gt;Stand by me WIll check this out. I suspect I saw this film as a kid but don't remember it well. I watched this video on YT and thought of sharing it here.[https://youtu.be/j5v8D-alAKE](https://youtu.be/j5v8D-alAKE) This video is about stuff: light bulbs, printers, phones and why they aren't better. There's no such thing as South movies. There are 4 major south Indian languages Tell that after watching Kumbalangi Nights, Jallikattu, Ee Ma Yau, and other malayalam films surprised nobody's talking bout mr robot - fans upvote! one of the best shows ive watched. wdym? how do you think you're gonna find it if you don't use piracy? Yeah, definitely recommended to all the technology freak &gt; Nocturnal Animals Netflix or prime? Netflix It's wonderful. It striked me as something pure amidst all BS going on. The ending really ties the movie together. Is the last season worth it?? I'm really in a depression phase and don't wanna see anything too much dark. Nocturnal animals is my favourite movie. I have watched it so many times. It doesn't paints all artists as fake and hits really hard. I haven't watched the rest of the movies In your list. Thanks for the recommendation. You seem like a really genuine guy. Are you a doctor?? I'm waiting for all seasons to finish. Utna padhne ki himmat nhi hai... Also waiting for one punch man season 3. Telegram maybe but you'll have to search a lot. Ab zindagi mein aur darkness nhi chahiye. Science ka koi na koi bright side to hona chahiye future mein. Arrival dekhne mein kafi maja aaya tha. Hope is a good thing. Youtube spoilers were all over bhai. Raha nahi gaya padh liya. But is really amazing. Last chapter will be coming this week. Ya same waiting for one punch man S3. I couldn't get myself to watch them. The pace seems slightly high in South indian movies. But maybe they take some time to grow over you. Also I'm north indian so they are less relatable to me. Idk. I've downloaded incendies. Denis Villeneuve par poora bharosa hai. Podcast: Algorithm. The episode with Rationalist Narendra Nayak in which he discussed about receiving death threats and losing friends like Gauri Lankesh and Narendra Dabholkar to murders. [Algorithm Podcast- Narendra Nayak](https://youtu.be/5HZ-NUWsxtg) if anything, it will make you stronger bro. try to understand the message behind it tho. Our children's future is doomed bro. Welcome to the party! What does pace is slightly high mean? Not all movies are the same. And which movie did you even try to watch? It's okay if you don't watch them. Just don't generalize 4 different industries which are different from each other and call them they don't have realistic touch when you haven't even watched them. I can't get over just how good The Office is. &gt; Altered Carbon (Season 1 was good, Season 2 could have been better but didn't disappoint) Both seasons start out very strong and toward the end of 2 I just couldn't take all the action etc. Would give anything for a slower-paced sci-fi /fantasy. Is it about planned obsolescence? Sounds like it. Nocturnal Animals tells a story in the most powerful way we can all understand, as a story. It's a meta story. A story of a guy telling his life story as an analogy through his novel. The ending of the movie is fucking brilliant and the soundtrack is outstanding! Beautiful cinematography and great acting too. I watched The Pledge long ago. The ending is depressing though. 🤦‍♂️ It is sad but the whole film tied well together for me. Thank you for the compliment. No, I am not a doctor. I have had Alzheimers and Dementia in my family. Yeah. It builds up to what looks like a cop vs villain showdown then it becomes something else. It takes the audience by surprise though and connects the opening scene to that ending. It all does make sense at the end. Is Stand By Me the film where the kids pool their pocket money and pay a hooker to show them her bare breasts? And then they have cigarette after that. I remember this scene from a film but cannot place it. It was years ago that I saw this scene and I was very young then. Jerry also has this desperate need to prove himself (to perhaps himself only) right. He finds a loving woman and child when he clearly is lonely and in need for love. But that is not what he can appreciate or want. Perhaps that is why his previous marriages failed. Although he loves the little girl, he kind of uses her as a bait. And even though it is not proven for sure that there indeed was a bogeyman, Jerry's quest for the bogeyman is very real. It consumes him. He obviously goes crazy in that quest. Just rambling. I'm sorry I don't remember the nuances from the movie since I watched it over a decade ago. But I do remember that he uses the girl as bait and her mom asks him to fuck off. Also the serial killer who is never revealed definitely dies on the way to the location. His car burns up or something like that if I can remember it correctly. There's definitely a killer on the loose but his death brings out the glaring lack of human collection in the cops life. Ramble on my friend. That's an interesting movie. Such movies are rare. Subversion of audience's expectations! Yeah there are definite strong hints at a character who could probably be the killer and dies in an auto accident. And our protagonist is much too fixated on finding him. Drives him crazy. Makes me think what should one focus more on life. Incidentally, Sean Penn's another film Into the Wild is also about a quest of a man to live off nature, independently. Although very different films some similarities in the main character. No? Into the Wild, I watched many times. I love that movie. It's based on a real person who died of starvation alone in the wild, Chris McCandless. It's a rational look at how traveling is great and how it can also come with its own drawbacks if you're not prepared for it. Mccandless finds several loving and caring people throughout his journey. Some give him a job and others want to make him a part of their family. Although he is seeking something else. Yup. Yeah. Watched the whole thing. Planned obsolescence was taught in MBA. It broke my heart. They talk about profits but just think about the materials being wasted. That's so fucked up. Some people lose their lives to collect and gather various materials for say the iPhone and they ensure that the phone doesn't last long. That's messed up."
}