{
    "id": "134kiyi",
    "title": "Higher Pension Scheme Option by EPFO",
    "url": "https://www.reddit.com/r/india/comments/134kiyi/higher_pension_scheme_option_by_epfo/",
    "selftext": "Dear Member's,  \n\n\nI need some guidance on the [Higher Pension Scheme](https://cleartax.in/s/higher-pension-scheme-epfo) from the **EPFO.** My dad was working in a private sector until he passed away in 2016. My mom is now receiving the pension due to the demise of my father. I got to know about this Higher Pension option only yesterday and I see that the last date to apply for the same is **May 3rd 2023.**   \n\n\nThough I am not clear as there are two options on the [EPFO](https://unifiedportal-mem.epfindia.gov.in/memberinterface/) site \n\n[EPFO Option for Higher Pension](https://preview.redd.it/zhrc5uamk7xa1.png?width=495&format=png&auto=webp&v=enabled&s=08f449b70f56d3004fdc529f0914c765bb869d77)\n\nNow, from my initial research, I got to know that the \n\n\\- First option is for people who have retired after 2014 need to select this option  \n\\- Second option is for people who have retired before 2014  \n\n\nSo, as my father had passed away after 2014 and was in service when he passed away, I presume that I need to go with option 1 \"*Pension on Higher Salary: Exercise of Joint Option*\".   \nNow when I click the option, it asks for **UAN** and **Aadhaar Linked Mobile Number,** my mother was not able to find the UAN number from the forms she has with her and the Aadhaar mobile my father was using is not in use now.   \n\n\n1. So is this higher pension scheme applicable for us to apply and if not could you please explain why ?\n2. How can I advise my mom on the next steps to find the UAN and the issue with the Mobile number that was linked with Aadhaar which is now not in use? \n\nLooking forward to your kind support as this would really help my mother with the finance.\n\n[Form](https://preview.redd.it/lmjf5cyil7xa1.png?width=721&format=png&auto=webp&v=enabled&s=cbe911958cac743bd8384d2857b8da82bcff0144)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1682942456.0,
    "convurl": "https://b.thumbs.redditmedia.com/5sScARkPDvP2GHoWPlo1zTyz6p9EAb-9AYL5R1Ez40k.jpg",
    "comments": [
        "The scheme is for people who have not yet retired yet. It increases the contribution to EPS and decreases from EPF so you get higher pension but lower lumpsum from EPF.\n\nI don't think it is going to be applicable for you here"
    ],
    "cleaned_text": "higher pension scheme option epfo dear members need guidance higher pension schemehttpscleartaxinshigherpensionschemeepfo epfo dad working private sector passed away mom receiving pension due demise father got know higher pension option yesterday see last date apply may rd though clear two options epfohttpsunifiedportalmemepfindiagovinmemberinterface site epfo option higher pensionhttpspreviewredditzhrcuamkxapngwidthformatpngautowebpvenabledsfbfdfdcfcbbd initial research got know first option people retired need select option second option people retired father passed away service passed away presume need go option pension higher salary exercise joint option click option asks uan aadhaar linked mobile number mother able find uan number forms aadhaar mobile father using use higher pension scheme applicable us apply could please explain advise mom next steps find uan issue mobile number linked aadhaar use looking forward kind support would really help mother finance formhttpspreviewredditlmjfcyilxapngwidthformatpngautowebpvenabledscbecacbddbdabcff ",
    "cleaned_title": "higher pension scheme option epfo",
    "cleaned_selftext": "dear members need guidance higher pension schemehttpscleartaxinshigherpensionschemeepfo epfo dad working private sector passed away mom receiving pension due demise father got know higher pension option yesterday see last date apply may rd though clear two options epfohttpsunifiedportalmemepfindiagovinmemberinterface site epfo option higher pensionhttpspreviewredditzhrcuamkxapngwidthformatpngautowebpvenabledsfbfdfdcfcbbd initial research got know first option people retired need select option second option people retired father passed away service passed away presume need go option pension higher salary exercise joint option click option asks uan aadhaar linked mobile number mother able find uan number forms aadhaar mobile father using use higher pension scheme applicable us apply could please explain advise mom next steps find uan issue mobile number linked aadhaar use looking forward kind support would really help mother finance formhttpspreviewredditlmjfcyilxapngwidthformatpngautowebpvenabledscbecacbddbdabcff",
    "cleaned_comments": "scheme people yet retired yet increases contribution eps decreases epf get higher pension lower lumpsum epf dont think going applicable",
    "light_cleaned_title": "Higher Pension Scheme Option by EPFO",
    "light_cleaned_selftext": "Dear Member's, I need some guidance on the [Higher Pension Scheme](https://cleartax.in/s/higher-pension-scheme-epfo) from the **EPFO.** My dad was working in a private sector until he passed away in 2016. My mom is now receiving the pension due to the demise of my father. I got to know about this Higher Pension option only yesterday and I see that the last date to apply for the same is **May 3rd 2023.** Though I am not clear as there are two options on the [EPFO](https://unifiedportal-mem.epfindia.gov.in/memberinterface/) site [EPFO Option for Higher Pension](https://preview.redd.it/zhrc5uamk7xa1.png?width=495&format=png&auto=webp&v=enabled&s=08f449b70f56d3004fdc529f0914c765bb869d77) Now, from my initial research, I got to know that the \\- First option is for people who have retired after 2014 need to select this option \\- Second option is for people who have retired before 2014 So, as my father had passed away after 2014 and was in service when he passed away, I presume that I need to go with option 1 \"*Pension on Higher Salary: Exercise of Joint Option*\". Now when I click the option, it asks for **UAN** and **Aadhaar Linked Mobile Number,** my mother was not able to find the UAN number from the forms she has with her and the Aadhaar mobile my father was using is not in use now. 1. So is this higher pension scheme applicable for us to apply and if not could you please explain why ? 2. How can I advise my mom on the next steps to find the UAN and the issue with the Mobile number that was linked with Aadhaar which is now not in use? Looking forward to your kind support as this would really help my mother with the finance. [Form](https://preview.redd.it/lmjf5cyil7xa1.png?width=721&format=png&auto=webp&v=enabled&s=cbe911958cac743bd8384d2857b8da82bcff0144)",
    "light_cleaned_comments": "The scheme is for people who have not yet retired yet. It increases the contribution to EPS and decreases from EPF so you get higher pension but lower lumpsum from EPF. I don't think it is going to be applicable for you here"
}