{
    "id": "155f23d",
    "title": "Manipur violence: House of man who allegedly paraded women naked set on fire",
    "url": "https://indianexpress.com/article/north-east-india/manipur/manipur-video-house-of-accused-set-on-fire-by-village-women-8851843/",
    "selftext": "[deleted]",
    "flair": "Politics",
    "score": 1,
    "num_comments": 108,
    "created_utc": 1689919132.0,
    "convurl": "https://external-preview.redd.it/hOuGY-zM5qPIzRDDpu6qhLvOZ4Hav6RYa9pET_kchHM.jpg?auto=webp&s=1cfc6e6448bb84e05e2ada1e5ac1b3c83e45ca68",
    "comments": [
        "> On learning about Herodas’ arrest, the women folk of Petchi village converged and headed to the house of the accused after a brief discussion amongst themselves. The group of women started vandalising the house of the accused and set it on fire.\n\n> “Be it Meitei or other communities, as a woman, outraging a woman’s dignity is not acceptable. We cannot allow such a person to be in our society. It’s a shame to the entire Meitei community,” said a Meira Paibi leader. Meira Paibis or “women torch bearers” are a senior women-led activist group with no rigid hierarchy, structure, or overt political leanings.",
        "An eye for an eye makes the whole world blind.",
        "Gyan na chode.",
        "It isn't exactly an eye for an eye. Eye for an eye would be stripping him and make him walk naked and then assault him sexually. This guy didn't get hurt physically or mentally. Besides pretty sure he will have someone idiot to defend and give protection for him",
        "It's a figurative. Eye represents violence. Violence was followed up by violence and it's a circle.",
        "Yeah I understood... I was about to add that I can understand your POV.. But common people indulge in such activities and weaponise themselves when the gov which pledged to have the interests of the citizens 1st and foremost fails in their duty.",
        "What were these so called women torch doing when the act took place, were their bulbs fused back then???? Are you telling me that they had no clue these two fuckin months? They are doing this to save their own face, it's  called scapegoat tactic, you sacrifice one of yours to indicate that it's not the group's  fault.",
        "Gaali khaane hai tho sidha bolo na yar",
        "The arson was done by the women of his own community, at least from what I can tell.",
        "de do bro. tuhara khaya piya pachna chahiye.",
        "Government definitely failed and the CM should resign.",
        "yes but atrocities by family and near ones are still atrocities. That house was probably not just his house.",
        "Same to you",
        "That's true, originally the women of that community encouraged such things. What they are doing now is saving faces and their own skin.",
        "Didn't the same women group also block the Army earlier from peacekeeping?",
        "Technically, it would only make the criminals blind.",
        "Yes they did, and you should call them out for their hypocrisy  to self save themseves and be rid of any wrongdoing.  They birthed these mofos that paraded these girls, it's  their teachings, burning a house now only indicates your need to be purified by false justice.",
        "My point is that it's not an eye for an eye, if it's your own community attacking you for your crimes against the other community.",
        "That should soothe the public conscience and now they'll go about living their lives.",
        "Mobocracy meets mobocrazy. We can not hail this as someone doing the right thing.\n\nThe right thing to do is to capture ALL (and not just 3-4) in the mob who raped the two women. All of these men should face maximum punishment as actual rapists and be never able to live a single day free.\n\nThis is the time to make an example but within the bounds of the law. No mercy",
        "Yeah, the same group of women who encouraged and justified these actions now trying to save face after being exposed.",
        "Well yes, but not exactly.\n\nWe do have reports of Meitei women encouraging sexual violence. But these are from a particular group that one article said \"had no political leanings\".",
        "Seat mil jayegi ise....iykyk",
        "That's why we need police to do their job. It's anarchy that leads to mob violence and vigilantism, both of which push us more into anarchy.",
        "More violence won't solve ethnic violence. And why is this guy being singled out? Weren't there hundreds of men? Are they free to roam around?",
        "Just scapegoat tactics",
        "Even after all the video proof, I am pretty sure no one will be held accountable.",
        "What do you mean by \"man\"... There were at least 20 or 25 of them",
        "I have friends and known people  from Manipur, Meiteis and Nagas. While I heard one side of the story from the Meiteis, my known Naga people who were in Imphal and few neibouring areas during this time told about how the Meiteis were the instigators and how they had open help from the local police force to purpetrate all kind of violence on Kuki houses and people. They said they were scared of the Meira Paibis esp as those women were ruthless and even the Army and Paramilitary forces could not do anything esp as AFSPA is withdrawn in the valley areas. Most Naga people just sat quietly at home hoping that the Meiteis would not target them next. Incidentally, the Meiteis did end up killing a Naga woman whose head is still not found till today.\n\nhttps://indianexpress.com/article/india/disturbing-naga-womans-killing-puts-tense-manipur-on-the-edge-8847286/\n\nThis is why with all due respect to my Meiteis friends, I tend to take their version with a pinch of salt. Yes, there was violence done by both sides, but from what I heard, it was the Meiteis who started it while the Kukis retaliated here and there. This seems to support why it was the Kukis who were asking for help and President's rule from the very begining of this conflict.",
        "I'm surprised you are speaking so delicately. I was under the impression all this time that this was a Meiti led aggression. They are the dominant group in terms of land, power and influence. I thought this entire situation started because they were making excessive demands.",
        "That's why we need police to do their job. It's anarchy that leads to mob violence and vigilantism, both of which push us more into anarchy.",
        "What were these women doing for the past two months ? \n\nI support neither side but no matter who started the war it doesn’t justify rape / molestation of a woman",
        "I tend to speak delicately as I try to avoid conflicts. 🙂\n\nThe Meiteis are totally dominant in power and influence. They lack land which is what they have been trying to acquire. The so-called 90% tribal land that the Meiteis keep talking about has only about 40% inhabitable space, with poor infrastructure and lack of health options. Mostly all state development has been concentrated in Imphal area, a simple drive out of Imphal into any of  the hill areas will show the stark difference in road infrastructure and other facilities. Coming back to the 90% tribal land point. A large part of that tribal land has been declared as Forest land by the Govt which means no one can settle or develop there.",
        "This is just making one person a scapegoat when they were dozens of people in the video. Are you gonna tell me the whole village were unaware of what happened for the last two months until the video surfaced online? They didn't care, now they just want to save face.",
        "Maybe, they are a different group of women, but are they different in their views? I would be willing to accept that when they show their willingness to burn down the homes of everyone who participated and not the single scapegoat they put worth after it went viral on social media.",
        "Standard bjp solution: fail to deliver justice for a long time, and then when cornered, make things worse with vigilante justice.",
        "is that yeh dil music? i need to stop being so worked up about pointless things",
        "Not just saving face. But saving their husbands and sons. It was done by a mob not by a single person. They are just doing stuff that might help government save face and if government they can get away without arresting anyone else then husbands and sons of these won't go to jail.",
        "They are burning house of one to try to keep their kids and husbands who were part of the mob out of jail. Nothing else.",
        "This is not them trying to do right thing. Right thing would have been to do it before news went viral. This is just an attempt to sacrifice few to allow government to get out of punishing all the other people who were part of the mob.",
        "Yeah but if you blame it all on just one guy then rest won't need to go to jail, right ? I mean their husbands and sons were probably in that mob and clear the guy arrested was controlling everyone else.",
        "Unless they were trying to stop the violence before the news went viral they absolutely do have a leaning.",
        "No, they won't. They'll continue targeting kukis.",
        "Read this before supporting their side \n\nhttps://www.thequint.com/opinion/from-guardians-to-perpetrators-of-violence-role-of-the-meira-paibis-in-manipur#read-more\n\nIt's a cover up.",
        "https://www.thequint.com/opinion/from-guardians-to-perpetrators-of-violence-role-of-the-meira-paibis-in-manipur#read-more",
        "Exactly.",
        "What about the police who handed the women over to the mob? The police in India are criminals too.",
        "We have truly entered the era of jungle raj.",
        "Yeah, this seems to be the same group. First the incited rapes, protected rapists from the army, then pretending that they are innocent.",
        "This Anarchy itself is a consequence of the silence and the inability of the govt to do anything to mediate the situation. This lawlessness prevails after people have lost both, faith and fear of the Law.",
        "I believe a factor in this Arson is the fact that the women of this man’s community might be fearing retribution from the other community, so it’s better they clean house themselves rather than risking a tit for tat!",
        "Ha aur karo bulldozer mob justice",
        "LOUDER PLEASE\n\nEverybody needs to be punished, not just a handful.",
        "Waiting for bulldozzer /s.",
        "\"allegedly\"?????",
        "One man doth not equal a mob. So while I understand their rage, I share it, arresting one man for that crime is an insult to our collective intelligence.",
        "Shameful.",
        "Which side am I supporting ? I have written that I support neither side \n\nBut nothing absolutely nothing justifies what was down to these women \n\nNothing at all",
        "Property destruction of ones family is not justice. Sad state of affairs in our country.",
        "This makes sense that's why people won't understand or will ignore it",
        "Once the violence \"subsides\" for the Press, the accused's family will probably get a posh house for his efforts. The now empty plot will have a apartment buiilding with flats rented out and the accused will be secured for life.",
        "How we have one of the largest army and central police forces in the world and still not have them deployed there to prevent incidents in the first place will tell you how it is state sponsored.",
        "Simply put - Emerging Signs of a 🍌 republic.",
        "What about the rest of them..why aren't they arrested yet?",
        "In year 2045, he will be given a sentence of 10 years.",
        "Oh their torches were burning bright this entire time.\n\nhttps://indianexpress.com/article/political-pulse/manipur-conflict-meira-paibis-meitei-guardians-taking-on-security-forces-8689708/"
    ],
    "cleaned_text": "manipur violence house man allegedly paraded women naked set fire deleted ",
    "cleaned_title": "manipur violence house man allegedly paraded women naked set fire",
    "cleaned_selftext": "deleted",
    "cleaned_comments": "learning herodas arrest women folk petchi village converged headed house accused brief discussion amongst group women started vandalising house accused set fire meitei communities woman outraging womans dignity acceptable allow person society shame entire meitei community said meira paibi leader meira paibis women torch bearers senior womenled activist group rigid hierarchy structure overt political leanings eye eye makes whole world blind gyan na chode isnt exactly eye eye eye eye would stripping make walk naked assault sexually guy didnt get hurt physically mentally besides pretty sure someone idiot defend give protection figurative eye represents violence violence followed violence circle yeah understood add understand pov common people indulge activities weaponise gov pledged interests citizens st foremost fails duty called women torch act took place bulbs fused back telling clue two fuckin months save face called scapegoat tactic sacrifice one indicate groups fault gaali khaane hai tho sidha bolo na yar arson done women community least tell de bro tuhara khaya piya pachna chahiye government definitely failed cm resign yes atrocities family near ones still atrocities house probably house thats true originally women community encouraged things saving faces skin didnt women group also block army earlier peacekeeping technically would make criminals blind yes call hypocrisy self save themseves rid wrongdoing birthed mofos paraded girls teachings burning house indicates need purified false justice point eye eye community attacking crimes community soothe public conscience theyll go living lives mobocracy meets mobocrazy hail someone right thing right thing capture mob raped two women men face maximum punishment actual rapists never able live single day free time make example within bounds law mercy yeah group women encouraged justified actions trying save face exposed well yes exactly reports meitei women encouraging sexual violence particular group one article said political leanings seat mil jayegi iseiykyk thats need police job anarchy leads mob violence vigilantism push us anarchy violence wont solve ethnic violence guy singled werent hundreds men free roam around scapegoat tactics even video proof pretty sure one held accountable mean man least friends known people manipur meiteis nagas heard one side story meiteis known naga people imphal neibouring areas time told meiteis instigators open help local police force purpetrate kind violence kuki houses people said scared meira paibis esp women ruthless even army paramilitary forces could anything esp afspa withdrawn valley areas naga people sat quietly home hoping meiteis would target next incidentally meiteis end killing naga woman whose head still found till today due respect meiteis friends tend take version pinch salt yes violence done sides heard meiteis started kukis retaliated seems support kukis asking help presidents rule begining conflict im surprised speaking delicately impression time meiti led aggression dominant group terms land power influence thought entire situation started making excessive demands thats need police job anarchy leads mob violence vigilantism push us anarchy women past two months support neither side matter started war doesnt justify rape molestation woman tend speak delicately try avoid conflicts meiteis totally dominant power influence lack land trying acquire socalled tribal land meiteis keep talking inhabitable space poor infrastructure lack health options mostly state development concentrated imphal area simple drive imphal hill areas show stark difference road infrastructure facilities coming back tribal land point large part tribal land declared forest land govt means one settle develop making one person scapegoat dozens people video gon na tell whole village unaware happened last two months video surfaced online didnt care want save face maybe different group women different views would willing accept show willingness burn homes everyone participated single scapegoat put worth went viral social media standard bjp solution fail deliver justice long time cornered make things worse vigilante justice yeh dil music need stop worked pointless things saving face saving husbands sons done mob single person stuff might help government save face government get away without arresting anyone else husbands sons wont go jail burning house one try keep kids husbands part mob jail nothing else trying right thing right thing would news went viral attempt sacrifice allow government get punishing people part mob yeah blame one guy rest wont need go jail right mean husbands sons probably mob clear guy arrested controlling everyone else unless trying stop violence news went viral absolutely leaning wont theyll continue targeting kukis read supporting side cover exactly police handed women mob police india criminals truly entered era jungle raj yeah seems group first incited rapes protected rapists army pretending innocent anarchy consequence silence inability govt anything mediate situation lawlessness prevails people lost faith fear law believe factor arson fact women mans community might fearing retribution community better clean house rather risking tit tat ha aur karo bulldozer mob justice louder please everybody needs punished handful waiting bulldozzer allegedly one man doth equal mob understand rage share arresting one man crime insult collective intelligence shameful side supporting written support neither side nothing absolutely nothing justifies women nothing property destruction ones family justice sad state affairs country makes sense thats people wont understand ignore violence subsides press accuseds family probably get posh house efforts empty plot apartment buiilding flats rented accused secured life one largest army central police forces world still deployed prevent incidents first place tell state sponsored simply put emerging signs republic rest themwhy arent arrested yet year given sentence years oh torches burning bright entire time",
    "light_cleaned_title": "Manipur violence: House of man who allegedly paraded women naked set on fire",
    "light_cleaned_selftext": "[deleted]",
    "light_cleaned_comments": "> On learning about Herodas’ arrest, the women folk of Petchi village converged and headed to the house of the accused after a brief discussion amongst themselves. The group of women started vandalising the house of the accused and set it on fire. > “Be it Meitei or other communities, as a woman, outraging a woman’s dignity is not acceptable. We cannot allow such a person to be in our society. It’s a shame to the entire Meitei community,” said a Meira Paibi leader. Meira Paibis or “women torch bearers” are a senior women-led activist group with no rigid hierarchy, structure, or overt political leanings. An eye for an eye makes the whole world blind. Gyan na chode. It isn't exactly an eye for an eye. Eye for an eye would be stripping him and make him walk naked and then assault him sexually. This guy didn't get hurt physically or mentally. Besides pretty sure he will have someone idiot to defend and give protection for him It's a figurative. Eye represents violence. Violence was followed up by violence and it's a circle. Yeah I understood... I was about to add that I can understand your POV.. But common people indulge in such activities and weaponise themselves when the gov which pledged to have the interests of the citizens 1st and foremost fails in their duty. What were these so called women torch doing when the act took place, were their bulbs fused back then???? Are you telling me that they had no clue these two fuckin months? They are doing this to save their own face, it's called scapegoat tactic, you sacrifice one of yours to indicate that it's not the group's fault. Gaali khaane hai tho sidha bolo na yar The arson was done by the women of his own community, at least from what I can tell. de do bro. tuhara khaya piya pachna chahiye. Government definitely failed and the CM should resign. yes but atrocities by family and near ones are still atrocities. That house was probably not just his house. Same to you That's true, originally the women of that community encouraged such things. What they are doing now is saving faces and their own skin. Didn't the same women group also block the Army earlier from peacekeeping? Technically, it would only make the criminals blind. Yes they did, and you should call them out for their hypocrisy to self save themseves and be rid of any wrongdoing. They birthed these mofos that paraded these girls, it's their teachings, burning a house now only indicates your need to be purified by false justice. My point is that it's not an eye for an eye, if it's your own community attacking you for your crimes against the other community. That should soothe the public conscience and now they'll go about living their lives. Mobocracy meets mobocrazy. We can not hail this as someone doing the right thing. The right thing to do is to capture ALL (and not just 3-4) in the mob who raped the two women. All of these men should face maximum punishment as actual rapists and be never able to live a single day free. This is the time to make an example but within the bounds of the law. No mercy Yeah, the same group of women who encouraged and justified these actions now trying to save face after being exposed. Well yes, but not exactly. We do have reports of Meitei women encouraging sexual violence. But these are from a particular group that one article said \"had no political leanings\". Seat mil jayegi ise....iykyk That's why we need police to do their job. It's anarchy that leads to mob violence and vigilantism, both of which push us more into anarchy. More violence won't solve ethnic violence. And why is this guy being singled out? Weren't there hundreds of men? Are they free to roam around? Just scapegoat tactics Even after all the video proof, I am pretty sure no one will be held accountable. What do you mean by \"man\"... There were at least 20 or 25 of them I have friends and known people from Manipur, Meiteis and Nagas. While I heard one side of the story from the Meiteis, my known Naga people who were in Imphal and few neibouring areas during this time told about how the Meiteis were the instigators and how they had open help from the local police force to purpetrate all kind of violence on Kuki houses and people. They said they were scared of the Meira Paibis esp as those women were ruthless and even the Army and Paramilitary forces could not do anything esp as AFSPA is withdrawn in the valley areas. Most Naga people just sat quietly at home hoping that the Meiteis would not target them next. Incidentally, the Meiteis did end up killing a Naga woman whose head is still not found till today. This is why with all due respect to my Meiteis friends, I tend to take their version with a pinch of salt. Yes, there was violence done by both sides, but from what I heard, it was the Meiteis who started it while the Kukis retaliated here and there. This seems to support why it was the Kukis who were asking for help and President's rule from the very begining of this conflict. I'm surprised you are speaking so delicately. I was under the impression all this time that this was a Meiti led aggression. They are the dominant group in terms of land, power and influence. I thought this entire situation started because they were making excessive demands. That's why we need police to do their job. It's anarchy that leads to mob violence and vigilantism, both of which push us more into anarchy. What were these women doing for the past two months ? I support neither side but no matter who started the war it doesn’t justify rape / molestation of a woman I tend to speak delicately as I try to avoid conflicts. 🙂 The Meiteis are totally dominant in power and influence. They lack land which is what they have been trying to acquire. The so-called 90% tribal land that the Meiteis keep talking about has only about 40% inhabitable space, with poor infrastructure and lack of health options. Mostly all state development has been concentrated in Imphal area, a simple drive out of Imphal into any of the hill areas will show the stark difference in road infrastructure and other facilities. Coming back to the 90% tribal land point. A large part of that tribal land has been declared as Forest land by the Govt which means no one can settle or develop there. This is just making one person a scapegoat when they were dozens of people in the video. Are you gonna tell me the whole village were unaware of what happened for the last two months until the video surfaced online? They didn't care, now they just want to save face. Maybe, they are a different group of women, but are they different in their views? I would be willing to accept that when they show their willingness to burn down the homes of everyone who participated and not the single scapegoat they put worth after it went viral on social media. Standard bjp solution: fail to deliver justice for a long time, and then when cornered, make things worse with vigilante justice. is that yeh dil music? i need to stop being so worked up about pointless things Not just saving face. But saving their husbands and sons. It was done by a mob not by a single person. They are just doing stuff that might help government save face and if government they can get away without arresting anyone else then husbands and sons of these won't go to jail. They are burning house of one to try to keep their kids and husbands who were part of the mob out of jail. Nothing else. This is not them trying to do right thing. Right thing would have been to do it before news went viral. This is just an attempt to sacrifice few to allow government to get out of punishing all the other people who were part of the mob. Yeah but if you blame it all on just one guy then rest won't need to go to jail, right ? I mean their husbands and sons were probably in that mob and clear the guy arrested was controlling everyone else. Unless they were trying to stop the violence before the news went viral they absolutely do have a leaning. No, they won't. They'll continue targeting kukis. Read this before supporting their side It's a cover up. Exactly. What about the police who handed the women over to the mob? The police in India are criminals too. We have truly entered the era of jungle raj. Yeah, this seems to be the same group. First the incited rapes, protected rapists from the army, then pretending that they are innocent. This Anarchy itself is a consequence of the silence and the inability of the govt to do anything to mediate the situation. This lawlessness prevails after people have lost both, faith and fear of the Law. I believe a factor in this Arson is the fact that the women of this man’s community might be fearing retribution from the other community, so it’s better they clean house themselves rather than risking a tit for tat! Ha aur karo bulldozer mob justice LOUDER PLEASE Everybody needs to be punished, not just a handful. Waiting for bulldozzer /s. \"allegedly\"????? One man doth not equal a mob. So while I understand their rage, I share it, arresting one man for that crime is an insult to our collective intelligence. Shameful. Which side am I supporting ? I have written that I support neither side But nothing absolutely nothing justifies what was down to these women Nothing at all Property destruction of ones family is not justice. Sad state of affairs in our country. This makes sense that's why people won't understand or will ignore it Once the violence \"subsides\" for the Press, the accused's family will probably get a posh house for his efforts. The now empty plot will have a apartment buiilding with flats rented out and the accused will be secured for life. How we have one of the largest army and central police forces in the world and still not have them deployed there to prevent incidents in the first place will tell you how it is state sponsored. Simply put - Emerging Signs of a 🍌 republic. What about the rest of them..why aren't they arrested yet? In year 2045, he will be given a sentence of 10 years. Oh their torches were burning bright this entire time."
}