{
    "id": "1fptqgf",
    "title": "Diljit Dosanjh's 'Punjab '95' faces new hurdles: CBFC demands nearly 120 cuts and name change",
    "url": "https://www.mid-day.com/entertainment/bollywood-news/article/diljit-dosanjh-punjab-95-cbfc-demands-120-cuts-name-change-23399290",
    "selftext": "Sources say CBFC chief Joshi has handed out nearly 120 changes to Punjab ’95, from its original 85 cuts; recommended alterations for activist Khalra’s biopic include renaming the protagonist and film",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 1,
    "created_utc": 1727349540.0,
    "convurl": "https://external-preview.redd.it/AmUv3R_4Q5IKGSklxXEPtf_ItzlXXY3qrm2IyVJ14kw.jpg?auto=webp&s=a1afc5c09c645901c2fa16e14c87d97629c952ce",
    "comments": [
        "###[Earlier CBFC wanted 85 cuts](https://www.bollywoodhungama.com/news/bollywood/cbfc-asks-85-cuts-diljit-dosanjh-starrer-punjab-95-based-life-jaswant-singh-khalra-release-remains-uncertain-report/)\n\n>Censor board also asked the makers to rename the protagonist from Jaswant Singh Khalra to Sutlej.\n\n>Censor board also have been asked to remove the reference of 1995, the year Jaswant Singh Khalra disappeared, in the title.\n\n\nTo know more about Khalra’s work you can watch this 30-minute film that contains interviews with Khalra’s family, as well as archival footage of Khalra when he was investigating secret cremations and disappearances in Punjab.\n\n>[The Last Killing](https://youtu.be/bKmxqqhlPD0?si=8ps9Q1yYZ2YBY90Y)\n\n>An original, award-winning documentary that chronicles Punjab Police whistleblower Satwant Singh Manak’s fight for justice for the families of ten victims of unlawful killings.\n\nYou can also see the documented and mapped extrajudicial killings in Panjab by \n\n>[Ensaaf](https://ensaaf.org/#trigger-modal-4401), a nonprofit organization working to end impunity and achieve justice for crimes against humanity in India, with a special focus on Punjab.\n\nThey have mapped the killings, you can see interactive data and profiling of [5300+ victims](https://data.ensaaf.org/).\n\nIn data collection, Ensaaf excluded cases of:\n\n* Genuine encounters;\n\n* Victims killed by militants;\n\n* Disappearances with no appearance of state action;\n\n* Families who expressed hesitation or fear of retribution; and\n\n* Families who expressed fear over the withdrawal of government benefits.\n\nContext of the Abuses:\n\n>For three decades, the architects of crimes against humanity in Punjab have escaped accountability and justice. While families have searched for their disappeared loved ones and lived with lies and partial-truths, the government of India has rewarded and promoted the perpetrators. We believe that survivors of gross human rights violations cannot live as free and respected citizens of a country until impunity ends.\n\n>During the 1980s and 1990s, India’s security forces engaged in widespread and systematic human rights violations in the state of Punjab, as part of counterinsurgency operations aimed at crushing a violent self-determination movement. Special counterinsurgency laws, and a system of rewards and incentives for security forces, led to an increase in enforced disappearances and extrajudicial executions of civilians and militants alike. By the end of the “Decade of Disappearances” in 1995, security forces had disappeared or extrajudicially executed thousands of Sikhs. To conceal their crimes, security forces killed human rights defenders such as Jaswant Singh Khalra and Sukhwinder Singh Bhatti, as well as destroyed their victims’ bodies through mass cremations or by dumping them in rivers. \n\n>Hundreds of perpetrators remain unaccountable. Further, the architects of these crimes remain in positions of power, and have traveled to other regions of India to advise on counterinsurgency operations. As demonstrated in Ensaaf’s joint report with Human Rights Watch, Protecting the Killers: A Policy of Impunity in Punjab, India (Oct. 2007), India’s institutions have failed to acknowledge the systematic and widespread nature of the abuses, and accordingly have not provided truth, justice, and reparations to the victims and survivors.\n\n>Prior to this project by Ensaaf, no government institution or civil society organization had documented the full-scale of enforced disappearances or extrajudicial executions during the Punjab counterinsurgency.\n\n>In the full-scale data collection phase, Ensaaf used the official 2001 census of Punjab, India, with census codes for each village, town, or city, to identify over 12,000 villages and urban areas. Field researchers approached each village and identified victim families by canvasing the village, relying on several consistently present sources of information in each village: past and current village heads (Sarpanch), past and present village council members, the births and deaths registrar (Chownkidar), and groups of village elders (Bazurg) that typically gather in public sitting areas. After all of these referral sources were consulted and consensus was reached on the identity of the victim families present in the village, Ensaaf field researchers then interviewed the identified families using both a standardized survey instrument built as a database, plus a free text form, allowing them to collect both quantitative and qualitative data on each incident. Field researchers further solicited information on other affected families in the village from those they interviewed, acting as yet another corroborating referral source. \n\n>Ensaaf subjected each case to data consistency checks, and further clarified details with families over the phone or through subsequent visits. Because over two decades had passed, and evidence had been withheld or destroyed by security forces, families shared their experiences to the best of their abilities. Often, on subsequent returns, Ensaaf found that the original respondents had deceased because of the age of elderly parents. We also identified villages that did not exist on the Indian census.\n\nAlso recently, CBI told High Court that [extra judicial killings (custodial & encounters) of 6733 victims](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) is not feasible, even we know the number is way higher.\n\nRecently in one conviction on march 30, 2024 - Former Punjab Police SP sentenced to 10 years in jail in a 32-year-old case \n\n>[But accused SP Ashok Kumar died during the trial](https://www.tribuneindia.com/news/punjab/former-punjab-police-sp-sentenced-to-10-years-in-jail-in-a-32-year-old-case-605674)"
    ],
    "cleaned_text": "diljit dosanjhs punjab faces new hurdles cbfc demands nearly cuts name change sources say cbfc chief joshi handed nearly changes punjab original cuts recommended alterations activist khalras biopic include renaming protagonist film ",
    "cleaned_title": "diljit dosanjhs punjab faces new hurdles cbfc demands nearly cuts name change",
    "cleaned_selftext": "sources say cbfc chief joshi handed nearly changes punjab original cuts recommended alterations activist khalras biopic include renaming protagonist film",
    "cleaned_comments": "earlier cbfc wanted cutshttpswwwbollywoodhungamacomnewsbollywoodcbfcaskscutsdiljitdosanjhstarrerpunjabbasedlifejaswantsinghkhalrareleaseremainsuncertainreport censor board also asked makers rename protagonist jaswant singh khalra sutlej censor board also asked remove reference year jaswant singh khalra disappeared title know khalras work watch minute film contains interviews khalras family well archival footage khalra investigating secret cremations disappearances punjab last killinghttpsyoutubebkmxqqhlpdsipsqyyzybyy original awardwinning documentary chronicles punjab police whistleblower satwant singh manaks fight justice families ten victims unlawful killings also see documented mapped extrajudicial killings panjab ensaafhttpsensaaforgtriggermodal nonprofit organization working end impunity achieve justice crimes humanity india special focus punjab mapped killings see interactive data profiling victimshttpsdataensaaforg data collection ensaaf excluded cases genuine encounters victims killed militants disappearances appearance state action families expressed hesitation fear retribution families expressed fear withdrawal government benefits context abuses three decades architects crimes humanity punjab escaped accountability justice families searched disappeared loved ones lived lies partialtruths government india rewarded promoted perpetrators believe survivors gross human rights violations live free respected citizens country impunity ends indias security forces engaged widespread systematic human rights violations state punjab part counterinsurgency operations aimed crushing violent selfdetermination movement special counterinsurgency laws system rewards incentives security forces led increase enforced disappearances extrajudicial executions civilians militants alike end decade disappearances security forces disappeared extrajudicially executed thousands sikhs conceal crimes security forces killed human rights defenders jaswant singh khalra sukhwinder singh bhatti well destroyed victims bodies mass cremations dumping rivers hundreds perpetrators remain unaccountable architects crimes remain positions power traveled regions india advise counterinsurgency operations demonstrated ensaafs joint report human rights watch protecting killers policy impunity punjab india oct indias institutions failed acknowledge systematic widespread nature abuses accordingly provided truth justice reparations victims survivors prior project ensaaf government institution civil society organization documented fullscale enforced disappearances extrajudicial executions punjab counterinsurgency fullscale data collection phase ensaaf used official census punjab india census codes village town city identify villages urban areas field researchers approached village identified victim families canvasing village relying several consistently present sources information village past current village heads sarpanch past present village council members births deaths registrar chownkidar groups village elders bazurg typically gather public sitting areas referral sources consulted consensus reached identity victim families present village ensaaf field researchers interviewed identified families using standardized survey instrument built database plus free text form allowing collect quantitative qualitative data incident field researchers solicited information affected families village interviewed acting yet another corroborating referral source ensaaf subjected case data consistency checks clarified details families phone subsequent visits two decades passed evidence withheld destroyed security forces families shared experiences best abilities often subsequent returns ensaaf found original respondents deceased age elderly parents also identified villages exist indian census also recently cbi told high court extra judicial killings custodial encounters victimshttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible feasible even know number way higher recently one conviction march former punjab police sp sentenced years jail yearold case accused sp ashok kumar died trialhttpswwwtribuneindiacomnewspunjabformerpunjabpolicespsentencedtoyearsinjailinayearoldcase",
    "light_cleaned_title": "Diljit Dosanjh's 'Punjab '95' faces new hurdles: CBFC demands nearly 120 cuts and name change",
    "light_cleaned_selftext": "Sources say CBFC chief Joshi has handed out nearly 120 changes to Punjab ’95, from its original 85 cuts; recommended alterations for activist Khalra’s biopic include renaming the protagonist and film",
    "light_cleaned_comments": "###[Earlier CBFC wanted 85 cuts](https://www.bollywoodhungama.com/news/bollywood/cbfc-asks-85-cuts-diljit-dosanjh-starrer-punjab-95-based-life-jaswant-singh-khalra-release-remains-uncertain-report/) >Censor board also asked the makers to rename the protagonist from Jaswant Singh Khalra to Sutlej. >Censor board also have been asked to remove the reference of 1995, the year Jaswant Singh Khalra disappeared, in the title. To know more about Khalra’s work you can watch this 30-minute film that contains interviews with Khalra’s family, as well as archival footage of Khalra when he was investigating secret cremations and disappearances in Punjab. >[The Last Killing](https://youtu.be/bKmxqqhlPD0?si=8ps9Q1yYZ2YBY90Y) >An original, award-winning documentary that chronicles Punjab Police whistleblower Satwant Singh Manak’s fight for justice for the families of ten victims of unlawful killings. You can also see the documented and mapped extrajudicial killings in Panjab by >[Ensaaf](https://ensaaf.org/#trigger-modal-4401), a nonprofit organization working to end impunity and achieve justice for crimes against humanity in India, with a special focus on Punjab. They have mapped the killings, you can see interactive data and profiling of [5300+ victims](https://data.ensaaf.org/). In data collection, Ensaaf excluded cases of: * Genuine encounters; * Victims killed by militants; * Disappearances with no appearance of state action; * Families who expressed hesitation or fear of retribution; and * Families who expressed fear over the withdrawal of government benefits. Context of the Abuses: >For three decades, the architects of crimes against humanity in Punjab have escaped accountability and justice. While families have searched for their disappeared loved ones and lived with lies and partial-truths, the government of India has rewarded and promoted the perpetrators. We believe that survivors of gross human rights violations cannot live as free and respected citizens of a country until impunity ends. >During the 1980s and 1990s, India’s security forces engaged in widespread and systematic human rights violations in the state of Punjab, as part of counterinsurgency operations aimed at crushing a violent self-determination movement. Special counterinsurgency laws, and a system of rewards and incentives for security forces, led to an increase in enforced disappearances and extrajudicial executions of civilians and militants alike. By the end of the “Decade of Disappearances” in 1995, security forces had disappeared or extrajudicially executed thousands of Sikhs. To conceal their crimes, security forces killed human rights defenders such as Jaswant Singh Khalra and Sukhwinder Singh Bhatti, as well as destroyed their victims’ bodies through mass cremations or by dumping them in rivers. >Hundreds of perpetrators remain unaccountable. Further, the architects of these crimes remain in positions of power, and have traveled to other regions of India to advise on counterinsurgency operations. As demonstrated in Ensaaf’s joint report with Human Rights Watch, Protecting the Killers: A Policy of Impunity in Punjab, India (Oct. 2007), India’s institutions have failed to acknowledge the systematic and widespread nature of the abuses, and accordingly have not provided truth, justice, and reparations to the victims and survivors. >Prior to this project by Ensaaf, no government institution or civil society organization had documented the full-scale of enforced disappearances or extrajudicial executions during the Punjab counterinsurgency. >In the full-scale data collection phase, Ensaaf used the official 2001 census of Punjab, India, with census codes for each village, town, or city, to identify over 12,000 villages and urban areas. Field researchers approached each village and identified victim families by canvasing the village, relying on several consistently present sources of information in each village: past and current village heads (Sarpanch), past and present village council members, the births and deaths registrar (Chownkidar), and groups of village elders (Bazurg) that typically gather in public sitting areas. After all of these referral sources were consulted and consensus was reached on the identity of the victim families present in the village, Ensaaf field researchers then interviewed the identified families using both a standardized survey instrument built as a database, plus a free text form, allowing them to collect both quantitative and qualitative data on each incident. Field researchers further solicited information on other affected families in the village from those they interviewed, acting as yet another corroborating referral source. >Ensaaf subjected each case to data consistency checks, and further clarified details with families over the phone or through subsequent visits. Because over two decades had passed, and evidence had been withheld or destroyed by security forces, families shared their experiences to the best of their abilities. Often, on subsequent returns, Ensaaf found that the original respondents had deceased because of the age of elderly parents. We also identified villages that did not exist on the Indian census. Also recently, CBI told High Court that [extra judicial killings (custodial & encounters) of 6733 victims](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) is not feasible, even we know the number is way higher. Recently in one conviction on march 30, 2024 - Former Punjab Police SP sentenced to 10 years in jail in a 32-year-old case >[But accused SP Ashok Kumar died during the trial](https://www.tribuneindia.com/news/punjab/former-punjab-police-sp-sentenced-to-10-years-in-jail-in-a-32-year-old-case-605674)"
}