{
    "id": "m6cc5d",
    "title": "Is this Acche Din (1/2) ???",
    "url": "https://www.reddit.com/r/india/comments/m6cc5d/is_this_acche_din_12/",
    "selftext": "This info-graphic was shared on one of the family groups. And I had a long discussion on why it was misleading. Reiterating the points here - (I hope it's useful)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/d44obn0jxen61.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=9a4008b7471969b8ebbcf3ad305d9eb40ee0a4a2\n\n**The first point on LPG gas rates**:\n\nOn a monthly basis International oil prices and USDINR rates decide the price of LPG (unlike petrol&amp; diesel where the price fluctuates daily and is more volatile) In 2013 the price of a barrel of oil was hovering around $97, so the price of LPG was high. The Modi government has been blessed with depressed international oil prices for most of its first term, except durin a short period in Nov 2018, when the price of LPG had crossed 1000 rs.\n\nIf you compare the LPG prices with today's closing price of crude $65-$68. The Indian consumer is still paying a very high price.\n\n&amp;#x200B;\n\n**Loan Rates (home, car, education &amp; personal)**:\n\nThis is because of the \"free-money\" policy being followed by all the major central banks. Some of the yield curves when adjusted for inflation are giving a negative yield! Both savings rate &amp; lending rates are low. But in 2021 - banks have become risk averse.\n\n**Sensex &amp; indices: (EDIT)**\n\nThis is a result of the low-yields/ negative-yields. Money flows to higher yielding/ risky assets. There is also a structural change, where large amount of savings are being fueled via SIPs to open mutual funds. As per their mandates MF have to buy stocks, which keeps the party going! There is also a minor issue of the Sensex &amp; Nifty periodically rotating out their rooster of stocks. Once a stock falls below a particular threshold its removed and a new stock is added. This gives it a survivorship bias. Since *only* good performing companies are in the sensex/nifty list  \n\n&amp;#x200B;\n\n**Fuel Bonds:**\n\nThis is related to the first point. UPA Government had issued oil bonds to protect consumers from the high international fuel prices ( Remember the fue prices were around $100+ during those days, while a consumer in India(Delhi) was paying Rs.58/- per liter of petrol)\n\nThe UPA government had issued 1.4 lakh crore of oil bonds between 2005 -2010. Post that they wee discontinued and India adopted a de-regulation mechanism. Petrol in June 2010 and Disel in Oct 2014. No bonds were issued by the NDA government. Until Sept 2018 only 3500 cr of these bonds had matured.\n\n&amp;#x200B;\n\n**FDI numbers**:\n\nAny number should always be seen with relation to the whole. So stand-alone FDI numbers doesn't mean anything. They should be seen as a (net) % age of the total GDP. In 2019 net FDI inflows were 1.46% of GDP. The highest was in 2018 when it was 3.62% of GDP.\n\n&amp;#x200B;\n\n(to be continued....)",
    "flair": "Policy/Economy",
    "score": 23,
    "num_comments": 0,
    "created_utc": 1615910418,
    "convurl": "https://b.thumbs.redditmedia.com/MxlKlWdfqCfixn1a8tkLNSBnriXU0sNKaDV6EXMfTeI.jpg",
    "comments": [],
    "cleaned_text": "acche din infographic shared one family groups long discussion misleading reiterating points hope useful ampxb first point lpg gas rates monthly basis international oil prices usdinr rates decide price lpg unlike petrolamp diesel price fluctuates daily volatile price barrel oil hovering around price lpg high modi government blessed depressed international oil prices first term except durin short period nov price lpg crossed rs compare lpg prices todays closing price crude indian consumer still paying high price ampxb loan rates home car education amp personal freemoney policy followed major central banks yield curves adjusted inflation giving negative yield savings rate amp lending rates low banks become risk averse sensex amp indices edit result lowyields negativeyields money flows higher yielding risky assets also structural change large amount savings fueled via sips open mutual funds per mandates mf buy stocks keeps party going also minor issue sensex amp nifty periodically rotating rooster stocks stock falls particular threshold removed new stock added gives survivorship bias since good performing companies sensexnifty list ampxb fuel bonds related first point upa government issued oil bonds protect consumers high international fuel prices remember fue prices around days consumer indiadelhi paying rs per liter petrol upa government issued lakh crore oil bonds post wee discontinued india adopted deregulation mechanism petrol june disel oct bonds issued nda government sept cr bonds matured ampxb fdi numbers number always seen relation whole standalone fdi numbers doesnt mean anything seen net age total gdp net fdi inflows gdp highest gdp ampxb continued ",
    "cleaned_title": "acche din",
    "cleaned_selftext": "infographic shared one family groups long discussion misleading reiterating points hope useful ampxb first point lpg gas rates monthly basis international oil prices usdinr rates decide price lpg unlike petrolamp diesel price fluctuates daily volatile price barrel oil hovering around price lpg high modi government blessed depressed international oil prices first term except durin short period nov price lpg crossed rs compare lpg prices todays closing price crude indian consumer still paying high price ampxb loan rates home car education amp personal freemoney policy followed major central banks yield curves adjusted inflation giving negative yield savings rate amp lending rates low banks become risk averse sensex amp indices edit result lowyields negativeyields money flows higher yielding risky assets also structural change large amount savings fueled via sips open mutual funds per mandates mf buy stocks keeps party going also minor issue sensex amp nifty periodically rotating rooster stocks stock falls particular threshold removed new stock added gives survivorship bias since good performing companies sensexnifty list ampxb fuel bonds related first point upa government issued oil bonds protect consumers high international fuel prices remember fue prices around days consumer indiadelhi paying rs per liter petrol upa government issued lakh crore oil bonds post wee discontinued india adopted deregulation mechanism petrol june disel oct bonds issued nda government sept cr bonds matured ampxb fdi numbers number always seen relation whole standalone fdi numbers doesnt mean anything seen net age total gdp net fdi inflows gdp highest gdp ampxb continued",
    "cleaned_comments": "",
    "light_cleaned_title": "Is this Acche Din (1/2) ???",
    "light_cleaned_selftext": "This info-graphic was shared on one of the family groups. And I had a long discussion on why it was misleading. Reiterating the points here - (I hope it's useful)  **The first point on LPG gas rates**: On a monthly basis International oil prices and USDINR rates decide the price of LPG (unlike petrol&amp; diesel where the price fluctuates daily and is more volatile) In 2013 the price of a barrel of oil was hovering around $97, so the price of LPG was high. The Modi government has been blessed with depressed international oil prices for most of its first term, except durin a short period in Nov 2018, when the price of LPG had crossed 1000 rs. If you compare the LPG prices with today's closing price of crude $65-$68. The Indian consumer is still paying a very high price.  **Loan Rates (home, car, education &amp; personal)**: This is because of the \"free-money\" policy being followed by all the major central banks. Some of the yield curves when adjusted for inflation are giving a negative yield! Both savings rate &amp; lending rates are low. But in 2021 - banks have become risk averse. **Sensex &amp; indices: (EDIT)** This is a result of the low-yields/ negative-yields. Money flows to higher yielding/ risky assets. There is also a structural change, where large amount of savings are being fueled via SIPs to open mutual funds. As per their mandates MF have to buy stocks, which keeps the party going! There is also a minor issue of the Sensex &amp; Nifty periodically rotating out their rooster of stocks. Once a stock falls below a particular threshold its removed and a new stock is added. This gives it a survivorship bias. Since *only* good performing companies are in the sensex/nifty list  **Fuel Bonds:** This is related to the first point. UPA Government had issued oil bonds to protect consumers from the high international fuel prices ( Remember the fue prices were around $100+ during those days, while a consumer in India(Delhi) was paying Rs.58/- per liter of petrol) The UPA government had issued 1.4 lakh crore of oil bonds between 2005 -2010. Post that they wee discontinued and India adopted a de-regulation mechanism. Petrol in June 2010 and Disel in Oct 2014. No bonds were issued by the NDA government. Until Sept 2018 only 3500 cr of these bonds had matured.  **FDI numbers**: Any number should always be seen with relation to the whole. So stand-alone FDI numbers doesn't mean anything. They should be seen as a (net) % age of the total GDP. In 2019 net FDI inflows were 1.46% of GDP. The highest was in 2018 when it was 3.62% of GDP.  (to be continued....)",
    "light_cleaned_comments": ""
}