{
    "id": "13xp6oy",
    "title": "Does anyone have an insider's view on why so many medical colleges are being de-recognised?",
    "url": "https://www.reddit.com/r/india/comments/13xp6oy/does_anyone_have_an_insiders_view_on_why_so_many/",
    "selftext": "[https://www.theweek.in/news/health/2023/05/31/as-150-medical-colleges-are-set-to-lose-nmc-recognition-is-a-crisis-looming-in-health-sector.html](https://www.theweek.in/news/health/2023/05/31/as-150-medical-colleges-are-set-to-lose-nmc-recognition-is-a-crisis-looming-in-health-sector.html)  \n\n\nI initially thought it was great that colleges were being hauled up for flouting rules. About time. But on a closer look, it seems like the cited reasons include inadequate CCTV cameras and lack of Aadhar-based biometric attendance systems. While I'm a complete layperson, it seems very odd that these things are important enough to warrant de-recognition.   \n\n\nDo any of you know what's really going on, here?",
    "flair": "Policy/Economy",
    "score": 7,
    "num_comments": 5,
    "created_utc": 1685643808.0,
    "convurl": "https://external-preview.redd.it/UHhwLIDAG8Gt6SvQS6P0ggs-Ej9c0aKG0cRZcWVxtk8.jpg?auto=webp&v=enabled&s=464dd824534c9b3cfa6e5213988ad1561fb0a10d",
    "comments": [
        "OP,\n\nFor the most part it's just these colleges make huge revenue thru donation, management seats etc. \n\nWhen the colleges then have the money to spend it on the same infrastructure you listed out and more but they don't because the Management is busy Lining their pockets with the same money. I am sure you get the GIST of it all now don't you OP. \n\nIt's happened to few of the Med Schools in my district - people got arrested, management people got fired and even a complete overhaul for the management as well.",
        ">\"However, what happened is that all medical colleges do not have adequate number of faculties which is required according to the NMC rules. So, the education in the medical faculty is getting hampered.”\n\nLack of faculty may have been the primary reason."
    ],
    "cleaned_text": "anyone insiders view many medical colleges derecognised httpswwwtheweekinnewshealthasmedicalcollegesaresettolosenmcrecognitionisacrisisloominginhealthsectorhtmlhttpswwwtheweekinnewshealthasmedicalcollegesaresettolosenmcrecognitionisacrisisloominginhealthsectorhtml initially thought great colleges hauled flouting rules time closer look seems like cited reasons include inadequate cctv cameras lack aadharbased biometric attendance systems im complete layperson seems odd things important enough warrant derecognition know whats really going ",
    "cleaned_title": "anyone insiders view many medical colleges derecognised",
    "cleaned_selftext": "httpswwwtheweekinnewshealthasmedicalcollegesaresettolosenmcrecognitionisacrisisloominginhealthsectorhtmlhttpswwwtheweekinnewshealthasmedicalcollegesaresettolosenmcrecognitionisacrisisloominginhealthsectorhtml initially thought great colleges hauled flouting rules time closer look seems like cited reasons include inadequate cctv cameras lack aadharbased biometric attendance systems im complete layperson seems odd things important enough warrant derecognition know whats really going",
    "cleaned_comments": "op part colleges make huge revenue thru donation management seats etc colleges money spend infrastructure listed dont management busy lining pockets money sure get gist dont op happened med schools district people got arrested management people got fired even complete overhaul management well however happened medical colleges adequate number faculties required according nmc rules education medical faculty getting hampered lack faculty may primary reason",
    "light_cleaned_title": "Does anyone have an insider's view on why so many medical colleges are being de-recognised?",
    "light_cleaned_selftext": "[https://www.theweek.in/news/health/2023/05/31/as-150-medical-colleges-are-set-to-lose-nmc-recognition-is-a-crisis-looming-in-health-sector.html](https://www.theweek.in/news/health/2023/05/31/as-150-medical-colleges-are-set-to-lose-nmc-recognition-is-a-crisis-looming-in-health-sector.html) I initially thought it was great that colleges were being hauled up for flouting rules. About time. But on a closer look, it seems like the cited reasons include inadequate CCTV cameras and lack of Aadhar-based biometric attendance systems. While I'm a complete layperson, it seems very odd that these things are important enough to warrant de-recognition. Do any of you know what's really going on, here?",
    "light_cleaned_comments": "OP, For the most part it's just these colleges make huge revenue thru donation, management seats etc. When the colleges then have the money to spend it on the same infrastructure you listed out and more but they don't because the Management is busy Lining their pockets with the same money. I am sure you get the GIST of it all now don't you OP. It's happened to few of the Med Schools in my district - people got arrested, management people got fired and even a complete overhaul for the management as well. >\"However, what happened is that all medical colleges do not have adequate number of faculties which is required according to the NMC rules. So, the education in the medical faculty is getting hampered.” Lack of faculty may have been the primary reason."
}