{
    "id": "14hrvgj",
    "title": "Monu Manesar, suspect in Junaid Nasir lynching, posts video of beating man, while kin of victims still in jail",
    "url": "https://maktoobmedia.com/latest-news/monu-manesar-suspect-in-junaid-nasir-lynching-posts-video-of-beating-man-while-kin-of-victims-still-in-jail/",
    "selftext": "[Monu Manesar](https://maktoobmedia.com/tag/monu-manesar/), a local Bajrang Dal leader and one of the prime suspect in the murder case of two Muslim men, Junaid and Nasir in Haryana’s Bhiwani is once again seen engaging in violent activities and posted the video of beating a man on Instagram.\n\nManesar is a suspect in the deaths of Junaid and Nasir, whose charred bodies were found in a car on February 16 after they were allegedly abducted by self-proclaimed cow vigilantes from Rajasthan’s Bharatpur district.\n\nOn Thursday, in a [video](https://www.instagram.com/reel/CtyAKSDpL5r/) surfaced on Manesar’s Instagram page, he along with other men can be seen beating a man who they accused of involving in ‘illegal cow-smuggling’. In a background of a video, one man can be heard saying, “This fight has become personal now and so the enmity should go on until both sides are completely killed.”\n\nThe police has filed a chargesheet against three persons, Rinku Saini, Monu Rana alias Narendra Kumar and Gogi – in connection with the case, after 4 months of the incident, keeping the investigation pending since February.\n\nManesar on the other side is said to be absconding, but in an interview given to The Indian Express last week, he said, he was not on a run but was on a pilgrimage in Uttar Pradesh, Haryana, and Rajasthan.\n\n“I had not gone anywhere and was visiting temples across different states. Why would I hide from the police when I’ve not done anything?” Manesar said, adding that he had not got a notice from the police in Rajasthan or Haryana.\n\n“If they call me for questioning, I will cooperate,” IE quoted him as saying.\n\nIt is noteworthy, on 29 May, that Rajasthan Police arrested [Hafiz Jabir](https://maktoobmedia.com/latest-news/junaid-nasir-lynching-rajasthan-govt-sends-family-member-to-jail-govt-aid-yet-to-be-granted/), a family member of the duo deceased who has been actively demanding justice for the families left behind Junaid and Nasir. More than a dozen family members including 9 men and 4 women have also been booked by the Police under several sections.",
    "flair": "Crime",
    "score": 22,
    "num_comments": 4,
    "created_utc": 1687609848.0,
    "convurl": "https://external-preview.redd.it/Sxdf7dq0oNFTS87YQ-6h7BlJ5yYCBQdVFmSC4hlmV_0.jpg?auto=webp&v=enabled&s=c79cef7e58f52491e4420df9e9710f0be8687f9f",
    "comments": [
        "Based.",
        "https://preview.redd.it/ikqe6y8rwy7b1.jpeg?width=1089&format=pjpg&auto=webp&v=enabled&s=0ee30d80128be0ad8950e041b4e99973d60f1175",
        "&#x200B;\n\nhttps://preview.redd.it/vyapjlgtxy7b1.jpeg?width=453&format=pjpg&auto=webp&v=enabled&s=d1e4717fc999bf44b98f273d9cb73756d4dfda68",
        "He must've been a tanatani drummer.",
        "He was a chusalamaan."
    ],
    "cleaned_text": "monu manesar suspect junaid nasir lynching posts video beating man kin victims still jail monu manesarhttpsmaktoobmediacomtagmonumanesar local bajrang dal leader one prime suspect murder case two muslim men junaid nasir haryanas bhiwani seen engaging violent activities posted video beating man instagram manesar suspect deaths junaid nasir whose charred bodies found car february allegedly abducted selfproclaimed cow vigilantes rajasthans bharatpur district thursday videohttpswwwinstagramcomreelctyaksdplr surfaced manesars instagram page along men seen beating man accused involving illegal cowsmuggling background video one man heard saying fight become personal enmity go sides completely killed police filed chargesheet three persons rinku saini monu rana alias narendra kumar gogi connection case months incident keeping investigation pending since february manesar side said absconding interview given indian express last week said run pilgrimage uttar pradesh haryana rajasthan gone anywhere visiting temples across different states would hide police ive done anything manesar said adding got notice police rajasthan haryana call questioning cooperate ie quoted saying noteworthy may rajasthan police arrested hafiz jabirhttpsmaktoobmediacomlatestnewsjunaidnasirlynchingrajasthangovtsendsfamilymembertojailgovtaidyettobegranted family member duo deceased actively demanding justice families left behind junaid nasir dozen family members including men women also booked police several sections ",
    "cleaned_title": "monu manesar suspect junaid nasir lynching posts video beating man kin victims still jail",
    "cleaned_selftext": "monu manesarhttpsmaktoobmediacomtagmonumanesar local bajrang dal leader one prime suspect murder case two muslim men junaid nasir haryanas bhiwani seen engaging violent activities posted video beating man instagram manesar suspect deaths junaid nasir whose charred bodies found car february allegedly abducted selfproclaimed cow vigilantes rajasthans bharatpur district thursday videohttpswwwinstagramcomreelctyaksdplr surfaced manesars instagram page along men seen beating man accused involving illegal cowsmuggling background video one man heard saying fight become personal enmity go sides completely killed police filed chargesheet three persons rinku saini monu rana alias narendra kumar gogi connection case months incident keeping investigation pending since february manesar side said absconding interview given indian express last week said run pilgrimage uttar pradesh haryana rajasthan gone anywhere visiting temples across different states would hide police ive done anything manesar said adding got notice police rajasthan haryana call questioning cooperate ie quoted saying noteworthy may rajasthan police arrested hafiz jabirhttpsmaktoobmediacomlatestnewsjunaidnasirlynchingrajasthangovtsendsfamilymembertojailgovtaidyettobegranted family member duo deceased actively demanding justice families left behind junaid nasir dozen family members including men women also booked police several sections",
    "cleaned_comments": "based xb mustve tanatani drummer chusalamaan",
    "light_cleaned_title": "Monu Manesar, suspect in Junaid Nasir lynching, posts video of beating man, while kin of victims still in jail",
    "light_cleaned_selftext": "[Monu Manesar](https://maktoobmedia.com/tag/monu-manesar/), a local Bajrang Dal leader and one of the prime suspect in the murder case of two Muslim men, Junaid and Nasir in Haryana’s Bhiwani is once again seen engaging in violent activities and posted the video of beating a man on Instagram. Manesar is a suspect in the deaths of Junaid and Nasir, whose charred bodies were found in a car on February 16 after they were allegedly abducted by self-proclaimed cow vigilantes from Rajasthan’s Bharatpur district. On Thursday, in a [video](https://www.instagram.com/reel/CtyAKSDpL5r/) surfaced on Manesar’s Instagram page, he along with other men can be seen beating a man who they accused of involving in ‘illegal cow-smuggling’. In a background of a video, one man can be heard saying, “This fight has become personal now and so the enmity should go on until both sides are completely killed.” The police has filed a chargesheet against three persons, Rinku Saini, Monu Rana alias Narendra Kumar and Gogi – in connection with the case, after 4 months of the incident, keeping the investigation pending since February. Manesar on the other side is said to be absconding, but in an interview given to The Indian Express last week, he said, he was not on a run but was on a pilgrimage in Uttar Pradesh, Haryana, and Rajasthan. “I had not gone anywhere and was visiting temples across different states. Why would I hide from the police when I’ve not done anything?” Manesar said, adding that he had not got a notice from the police in Rajasthan or Haryana. “If they call me for questioning, I will cooperate,” IE quoted him as saying. It is noteworthy, on 29 May, that Rajasthan Police arrested [Hafiz Jabir](https://maktoobmedia.com/latest-news/junaid-nasir-lynching-rajasthan-govt-sends-family-member-to-jail-govt-aid-yet-to-be-granted/), a family member of the duo deceased who has been actively demanding justice for the families left behind Junaid and Nasir. More than a dozen family members including 9 men and 4 women have also been booked by the Police under several sections.",
    "light_cleaned_comments": "Based. &#x200B; He must've been a tanatani drummer. He was a chusalamaan."
}