{
    "id": "186m9vt",
    "title": "Moneyview spamming",
    "url": "https://www.reddit.com/gallery/186m9vt",
    "selftext": "Spam calls are normal, happens all the time. But these guys have suddenly started calling 4-5 times a day instead of usual 1 time. I wrote them an email to stop spamming on my phone and this is their reply: register with us and then we will stop spamming. Never signed up or even visited their app or website. \nWhat options do I have?",
    "flair": "Law & Courts",
    "score": 26,
    "num_comments": 8,
    "created_utc": 1701253342.0,
    "convurl": "https://i.redd.it/p8vdzromj93c1.jpg",
    "comments": [
        "Congratulations! You just have them one more e-mail ID to spam.",
        "And now you have their number. Play dirty, and spam them with whatever solutions you find.\n\nRegards\n\nTeam Reddit",
        "Bitch I ain't sharing my email with you",
        "Bruh just start abusing them whenever they call you. Use the most foul expletives and insults u know"
    ],
    "cleaned_text": "moneyview spamming spam calls normal happens time guys suddenly started calling times day instead usual time wrote email stop spamming phone reply register us stop spamming never signed even visited app website options ",
    "cleaned_title": "moneyview spamming",
    "cleaned_selftext": "spam calls normal happens time guys suddenly started calling times day instead usual time wrote email stop spamming phone reply register us stop spamming never signed even visited app website options",
    "cleaned_comments": "congratulations one email id spam number play dirty spam whatever solutions find regards team reddit bitch aint sharing email bruh start abusing whenever call use foul expletives insults u know",
    "light_cleaned_title": "Moneyview spamming",
    "light_cleaned_selftext": "Spam calls are normal, happens all the time. But these guys have suddenly started calling 4-5 times a day instead of usual 1 time. I wrote them an email to stop spamming on my phone and this is their reply: register with us and then we will stop spamming. Never signed up or even visited their app or website. What options do I have?",
    "light_cleaned_comments": "Congratulations! You just have them one more e-mail ID to spam. And now you have their number. Play dirty, and spam them with whatever solutions you find. Regards Team Reddit Bitch I ain't sharing my email with you Bruh just start abusing them whenever they call you. Use the most foul expletives and insults u know"
}