{
    "id": "1418zyh",
    "title": "Do we really need Vande Bharat with current performance of our railway system?",
    "url": "https://www.reddit.com/r/india/comments/1418zyh/do_we_really_need_vande_bharat_with_current/",
    "selftext": "Why bother creating a super fast train if it can not run to its full potential in current tracks and why not investing those amounts in making the existing railway services faster and safer?\n\nAfter the latest accident in Odisha and also other accidents I am asking myself why invest so much amount on something that is not fully functional yet not investing into something that is in dire need of improvements, Our current existing rail network?  \n\n\n&#x200B;\n\nhttps://preview.redd.it/3c6ieoof764b1.jpg?width=976&format=pjpg&auto=webp&v=enabled&s=8807a5b77536f23533fbfeffac1ccde5a4d99855\n\nhttps://preview.redd.it/qbgq70pf764b1.jpg?width=1200&format=pjpg&auto=webp&v=enabled&s=5ac92fa89ecfe64160f713ae3dff91fbb53f98b6",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 52,
    "created_utc": 1685958200.0,
    "convurl": "https://a.thumbs.redditmedia.com/wbFUXdG9mKPcmftJMJavmMAOz9lbjK5kzsMeAJ0upO8.jpg",
    "comments": [
        "What's the use of cars unless we can't stop road accidents. Let's focus on road safety and walk everywhere until then. Think about cars only when we get accidents free roads.",
        "Well my argument was that why not make better roads with less potholes than to buy Ferrari.",
        "I would say advancement and upgradation of  Indian railway both are of an hour, so it should be done parallelly.",
        "I also support advancement but if this type of accidents can be avoided with already available technology why not upgrade first. \nAnd vande Bharat express looks like a publicity stunt where rajdhani regularly pulls a speed of 120 kmph with existing technology.",
        "Without commenting on the nauseating publicity surrounding every VB, a few facts :-\n\n1. One VB(Bhopal) and the Gatimaan are the fastest trains in India reaching a peak speed of 160 kmph between Tuglakabad and a place called Billoch pura , which is a couple of stations before Agra. \n\n2. Most of the other VBs are capped at 130, a few at 110 or even lower in sections.\n\n3. Trains on the LHB platform (cream and red livery) can be run with the same speeds as the VB provided they have adequate power. \n\n4. VB shell is based on the LHB platform.\n\n5. The locomotives we have are cleared for 160 (WAP5), 130 (WAP7,WAP4), diesel locos at 110 generally. These are passenger locos.\n\n6. Goods locos hauling passenger trains are restricted to less than 110.\n\n7. Electrification has meant that locos are in short supply .\n\n8. Distributed traction helps quicker acceleration and deceleration.\n\n9. Once VB starts running with a speed, others will also follow so overall speeds will improve.\n\n10. All signalling and track improvement carried out for the VB also help other trains.\n\n11. VB is good but not god's gift to mankind. It's a good trainset taking into account our specific needs.\n\n12. Replacing a conventional train with a VB would free up locos. \n\n13. It's the latest fetish of the current dispensation. Mamta had her Duronto, Lalu his Garib Rath etc. The last two are in the doldrums today. \n\n14. Once the novelty wears off, we can actually examine stuff without hyperbole.",
        "I fully support your level of research on the matter though I think it doesn't give an answer to my actual question. Why buy vande bharat when we have rail accidents regularly happening in India. \nMy home is just behind railway track and I always hear announcement about something breaking down and the services might be stopped for few hours.\nAlso might add that with vande Bharat running at 160 what will happen if accidents like these happen?",
        "As per your argument why not make poverty free India before thinking about space travel. What is the use of ISRO when so many people living under poverty line.\n\nBoth are required. Both are important. You cannot should not hold one for other.",
        "I am talking about same field and you are diversifying it into multiple fields completely ignoring the actual comment.   \nWhy make Vande Bharat when our current technology is failing miserably time to time. If you want to talk about poverty talk about govt initiative on that field only.",
        "Yes, we do need improvement and new trains. Vande Bharat are great trains. But as per few reports rail ministry neglected safety. A good government's job is to balance out everything, there's a Hindi saying \"apne pair chaadar se bahaar na paroso\". These guys are making fancy upgrades but not improving infra at the same time.",
        "At last a comment that I fully support.   \nI was not talking about the technical problems of vande bharat I was talking about the negligence surrounding it.",
        ">The last two are in the doldrums today. \n\nStill they are almost booked fully for each service, unlike the Vande Bharat on Nagpur Bilaspur route which runs as Tejas express now because the response was not breaking even.",
        "Guess you meant pasaaro",
        "Iss tucch praani ko aise apradh ke liye maaf kar dijiye.",
        "Alright let's talk Railways.\nThere are people who likes to move fast from one place to another. Who are ready to pay a premium on that. IR has improved it's service quite a lot since last 10 years and accidents have been reduced significantly. Should IR wait till there is absolutely no accidents which might take another 100 years. Should IR wait till then before introducing VB. Accidents happens everywhere be it US CHAINA or JAPAN.",
        "Mai toh keval aapki sahayta kar raha tha manyavar",
        "It's not what India needs but what India deserves atleast after 75 years of independence..... But still it's no excuse to ignore or legacy trains,, but hey whose gonna question our government when all ministers avoid press conferences",
        "Couldn't find reliable data right now about rail accident charts but lets talk about people wanted to move fast.   \nVande Bharat ticket from kolkata to Jalpaiguri : 1565 Rs (7 hours 30 minutes)  \nFlight on the same route : 3244 rs (Time : 1 hour)   \nif you are that person who wants to save time you should and will opt for flight in most of the cases. Only Japan have managed to make a dent in flight usage with their bullet train.   \nI can afford a flight ticket from kolkata to bengaluru. Now tell me after seeing these horrible accidents should I take train which with vande bharat running at its highest speed will take more than 12 Hours and in flight it takes only 2hrs and 30minutes.",
        "Vande Bharat is a great example what india is capable of and the accidents are showing the world what india is right now.",
        "No we need faster bullock carts.",
        "btw missed one thing  \nThe track where the accident happened was used by Vande Bharat also so improvement of the tracks and signalling system must be a hoax",
        "There are other trains which has potential as vande bharat like jan shatabdi trains. These trains are really in a beat up condition now. Railway can spend money on retrofitting these trains with modern facilities which will be more helpful to people.",
        ">Why bother creating a super fast train if it can not run to its full potential in current tracks and why not investing those amounts in making the existing railway services faster and safer?\n\nBecause of showmanship and dikhava.",
        "You are right but you have to take account not everyone lives near an airport. Who lives in BHP or BWN VB is the best choice for that.",
        "The nagpur bilaspur has a 8 coach vb. The Tejas was a temporary arrangement .\n\nNo new Durontos or Garib Raths are being introduced. Existing Durontos are losing priority. That's what I mean when I say it's in the doldrums. \n\nThis VB along with the Amb-Andura & Solapur (excluding Mumbai Pune) are ill  thought of.",
        "yup...more I hear these things more I think about how bad these type of govt is.   \nLike china showing off its capable fighters which is just a copy of F - 35 and F - 22",
        "There was earlier ICF coaches and accidents used to happen then.\nThe Railways decided to change the ICF with a better coaches called LHB coaches, now this LHB coaches could go much faster compared to the old ICF coaches (as they are light and made of diff. material). Also the sideways movement is less compared the ICF ones which overall meant stability to the train (better mechanical links and suspension systems). Still accidents happen.\n\nIf railways didn't upgrade then there was a high possibility that we could have witnessed more and more accidents.\nBut the no of accidents annually keep coming down cos the railways prioritized safety and inorder to keep up with priorities they need to upgrade which they did.\n\nIndia has the largest railway network and they are doing a good job reducing the accident year or year, and yea deadly accident like this happen and there'll be a question raised on safety standards and need of better trains or not and that is absolutely justified. \n\n\n1) Do we need to increase safety standards - there's always room for safety improvements and it needs constant improvement cos problems don't come with a set pattern.. they are dynamic and therefore safety standards needs constant monitoring, improvement and upgradation. Doesn't matter if you have old steam engines or modern train.\n\n\n2) Do we need VB-  yes definitely, if it's cutting down travel time and has the scope to cut down that time further more then why not?\n10 years down the line if I'm able to go from one place to another with a significant reduction in time compared to now then why not? \nThe current tracks can take 200kmph trains .but can the traffic allow the trains to reach 200 considering the engines and coaches are capable of pulling off 200 with the current conditions of traffic, signalling and halt points? \nsurely all of them need upgradation and when that happens phase by phase ( that's the only way it can happen) then will you wait for the bullet trains to fall from sky??\n\nI think a balanced and sane approach is required rather then raging on everything  based on the intensity of emotions at that particular point of time.\nWe need improvement in both. Safety and Modern trains.",
        "I support you on this thing. But running at a speed of 130 where rajdhani pulling speeds above 100 will not make much difference for short distances. And on average the trains will never run on a speed of 130 also",
        "introducing new trains with same track on the name of priority is also not a great approach for faster travel.   \nIf every new train comes with higher priority previous trains will be of lower priority and left out for people who can not afford or couldn't get a ticket.",
        "Tell me one thing.   \nDo you think it was due to safety issues on the train or is it the safety issue of poorly maintained track it was running on? As per the primary report it was due to the track.\n\nAll of our trains are capable of running at a speed of 100 + how much of the time it can reach that speed.   \nwhat is the average speed of Vande Bharat Express running in the track which are crowded with other trains?   \nIndian railways are doing a great job making the rail roads safer but why there is always something breaking down now and then.   \nWhy run Vande Bharat if Rajdhani can not reach its destination on time?",
        "Bhai safety system upgrade ke samne photo achi nahi ayegi. Isliye we need vande bharat for photos",
        "First part, do India need VB?? India need Vande Bharat trains too, you can't discourage your child to study Physics if he scored 90 in Physics but 9 in Chemistry, rather you should encourage to achieve 90 in Chemistry(just an example). However, I do think Vande Bharat used as political tool rather than the transport revolution.\nIn consideration of performance, before anything now, all locos should be fitted with 'Kavach' systems, utilise funds from Vande Bharat if there is crunch of funds. Developement can wait for sometime(not abandon) but safety can't.",
        "Great too see this question and I have read a few responses so felt like stepping in. Any loss of life in trains is not acceptable and my heart goes out to the family and loved ones of the victims. Railways is a system that serves passengers and so, every part of that system must work with others to give the best experience. Yes, we can return to older trains, but then we will have slower trains, resulting in  fewer passengers in a route, resulting in higher prices per passenger. I am raising this because the television interview by by an engineer on television was far more detailed than earlier television interviews. I think, the kind of possible signalling issue that lead to Orissa accident, had occurred in the UK, when the signalling system in that accident, was being upgraded. So, we have to think about the improvement after upgrades. Railways have to improve quality control as this accident has raised many questions that must be answered.",
        "People said the same thing with Rajdhani. It was introduced when the state of the railways lines was much worse than it is now. In fact, routes are still upgraded TODAY to run Rajdhanis. \n\nI support putting the VB into hiatus if we take Rajdhanis and Tejas off the tracks too, along with all the other more fancy trains. Agreed? We can all travel in trains that are filled to the brim and smell and shit and piss 24/7. It's what the tax payer deserves. And then maybe 100 years from now when we finish, we can run the VBs when the rest of the world is running solar powered super mega hyperloops that run at 0.5x the speed of light or some shit. And then we'll complain that we are not like China, and that our engineers can't build the same things like China.",
        ">As per the primary report it was due to the track.\n\nThe report hasn't come out yet from official investigation so let's say for now it was due to the track.\n\nThe solution for this issue is a regular maintenance of tracks..but that's alone not be enough... you need to keep on improving the condition of tracks along with maintenance and this cycle never ends.. One thing goes wrong which leads to another and it's like a perfect storm and you'd sadly have to face with these unfortunate events.\nNo one likes them..but when it happens it happens and you could not stop.\n\nAll you could do currently is just reduce the possibility of these mishaps to happen on a regular intervals. talking the possibility of accident to near zero is possible not absolute zero, no such thing exist in a real world.\nreducing the possibility of mishap occurance and that happens only through improvement. and IR is actually doing that and need to do better always exist.\n\n\n>why there is always something breaking down now and then.\n\nCos that's how things happen... you have to be okay with the fact that things can go wrong and move forward. Or you could live in a non productive fantasy world where nothing bad or good is happening and in your own dreams that one perfect day will come.\n\nWe are very tiny creatures and lot of things that were in our control can quickly go out of control..you never know. that's the reality.\n\n\n>Why run Vande Bharat if Rajdhani can not reach its destination on time?\nTraffic, signalling, delays due to technical issues, delays due to human made errors, there could be many many reasons.\n\nThen the question of why run them arises I guess?? \nYou run them because they are upgraded version and have the potential to make rail travel faster and smooth.. there lies a possibility to make them even much better than what they are today.\nSo why not run them to understand issues better and try and simultaneously solve them instead of making them and storing them.",
        "Your thought process is still not understandable by me. Like you want new trains that are faster which can not run fast. You are quoting govt and yet not using double quotes.   \nYou are saying that we need superfast trains when existing trains can't run fast and derailing regularly.   \nExisting trains can not run in time and everyday some new trains are introduced with higher priority so the old trains have stop and wait on sides to let these fancy trains pass.   \nWhy not make all the trains capable of running at a moderate speed than making trains that can run on high speeds but does not run with its full capability ?   \nIts like creating a formula 1 when your roads are only capable of running alto 800 in its 60% speed.",
        "Yes. Quality control should be top notch like in aircraft. An aircraft have multiple support system if one system fails by any means whereas it is only carrying mere 150 passengers.   \nWhereas trains are carrying much more passenger and yet this type of accidents occur regularly.",
        "I like your answer.. well it clears some things but there are few things I beg to differ.\nIncreasing budget on kabach like systems.\nAdding autonomous vehicles for checking lines. \nThe budget could be allocated to this type of research. \nCould be much better in my knowledge.",
        "What we need is a start over. Giant crane that picks the crap which is everything and recycle it. IPL, railways,govt, kejriwla, BJP, all the rivers, roads...just freaking pick up crane and dump them.",
        "I appreciate your spontaneous knowledge about the subject. You are an avid railfan, arent you? \n\n\nWell in your own words, these 2 trains are reminiscent of Mamata and Lalu, it's no surprise to not see a new face upgrading them any further. Anyways, everyone used to hate the Side Middle Berths of G.R. trains, I hope the new LHB rakes don't have it. \n\n\nI don't know where Amb Andura is, so can't really comment on that.\n\n\nYes let's just say beyond Pune not many people would wanna pay 8× - 9× the price and 2× the price for the same distance if compared with normal non AC class seats and AC class seats respectively. I have seen many travel ticketless or board the reserved coaches with general tickets on this route.",
        "It is fast train but for rich people. Can't they do something for poor people. It's very hard to travel in sleeper and General coach.",
        "Yes",
        "But Vande Bharat is no faster than existing trains (lhb coaches) on the current tracks. So how is it faster?",
        "I think it's not about the train itself but about the authority. Getting good trains is fine and more speed means faster travel more communication but it's the control system which hasn't changed since the British times. That needs to be upgraded as well along with trains.",
        "Vande Bharat is no faster (in top speed) than the lhb shatabdi coaches hauled by WAP5 engines. Both are capable of speeds upto 200km/hr but restricted to 130km/hr in majority of routes except one section where both run at 160km/hr.\n\nSo this is a myth that Vande Bharat trains are faster than the current fastest trains. Only thing they are faster at is acceleration.",
        "You don't need vande Bharat for that. Our existing trains can and do run just ss fast as VB trains.",
        "2.Existing trains (lhb shatabdi coaches hauled by WAP5} can run just as fast VB. Both are capable of 200km/hr but restricted to 160km/hr in one section and 130km/hr or less everywhere else. VB trains do have faster acceleration so they can cut down time may be couple of mins per hour, something irrelevant given the lack of punctuality of our trains.",
        ">Both are capable of 200km/hr but restricted to 160km/hr in one section and 130km/hr or less everywhere else\n\n\nFrom what I've read regarding the Indian trains...\nVB is tested for 180 kmph but operates more or less at 130 kmph.\nShatabdi is capable of a max speed of 160 and operates under 130kmph max.\nI agree that VB doesn't have any significant advantage in SPEED but I don't know based on what factors exactly is the speed of VB limited.\nMaybe 130kmph is the maximum operation speed on current railway conditions.",
        "Same is true for lhb coaches. Capable of upto 200km/hr and tested upto 180km/hr. Max operating speed is 160km/hr on part of Delhi-Agra section, 130km/hr otherwise. More or less the same as VB trains. \n\nWAP5 loco has the potential of upto 225km/hr and tested upto 184km/hr.\n\nBasically VB trains (train 18) does not have any benefit in terms of speed. Train 20 will have a speed advantage, so that is one benefit of train 18 that it is a testing/proving ground for train 20.",
        "Why not both? We can have separate budgets for them since both of them are important.",
        "Without adequate budget that is difficult. Parallel streams of work = higher costs.\n\nIn reality, railways cuts corners. And despite what they say, they cut corners on safety. Of course they’ll be out on tv channels telling you otherwise.\n\nAs an example, [expenditure on maintenance has fallen](https://www.ndtv.com/india-news/odisha-train-accident-live-audit-report-from-last-year-flagged-serious-concerns-on-rail-safety-4093016) — this is from last year’s CAG report.\n\n> severe shortfalls in inspections, failure to submit or accept inquiry reports after accidents, not utilising a dedicated railway fund on priority tasks, declining trend in funding track renewal\n\nAnd this is after the fact that in FY 2017-2021, Railways had almost 700 derailments. *This is almost one derailment every 2 days.* Again, CAG figures.\n\nYes, in an ideal world you would have everything. But in the real world, you have money constraints and have to make hard budgetary choices.",
        "Railways is upgrading the tracks to run the trains at 160 which is 20 lesser than the design speed. Remember that improvements in railways is incremental and not giant leaps.",
        "Yes. The Odisha tragedy was caused by the negligence of humans and not due the system failing by itself. The maintenance folks carried out an incorrect procedure which resulted in the accident. Vande bharat is a step in the right direction. The train is far more sophisticated than anything else in the railways, significantly faster and much more efficient. Public reception has been positive eventually all shatabdi and rajdhani rakes will become Vande bharat rakes. While it isn’t a TGV or Shinkansen, we should be proud of the achievements of ICF in designing a great train.",
        "It only adds one more  option for rich people apart from flight",
        "Railway is the only option for poor/middle class family , I don't see any need for railway to focus on rich people as they already have other options like their own Car or flight",
        "Nonsense. All hypothetical!",
        "Clean the superfast trains superfast. Make the train turnaround time fast too. That's the urgency.  Not just Vande Bharat, in all trains \"Swachhata hi sewa\" तत्परता से आवश्यक है! https://timesofindia.indiatimes.com/city/hubballi/vb-train-cleaned-in-record-14-minutes/articleshow/104097420.cms?from=mdr",
        "Does we have signaling before independence  I doubt it."
    ],
    "cleaned_text": "really need vande bharat current performance railway system bother creating super fast train run full potential current tracks investing amounts making existing railway services faster safer latest accident odisha also accidents asking invest much amount something fully functional yet investing something dire need improvements current existing rail network xb ",
    "cleaned_title": "really need vande bharat current performance railway system",
    "cleaned_selftext": "bother creating super fast train run full potential current tracks investing amounts making existing railway services faster safer latest accident odisha also accidents asking invest much amount something fully functional yet investing something dire need improvements current existing rail network xb",
    "cleaned_comments": "whats use cars unless cant stop road accidents lets focus road safety walk everywhere think cars get accidents free roads well argument make better roads less potholes buy ferrari would say advancement upgradation indian railway hour done parallelly also support advancement type accidents avoided already available technology upgrade first vande bharat express looks like publicity stunt rajdhani regularly pulls speed kmph existing technology without commenting nauseating publicity surrounding every vb facts one vbbhopal gatimaan fastest trains india reaching peak speed kmph tuglakabad place called billoch pura couple stations agra vbs capped even lower sections trains lhb platform cream red livery run speeds vb provided adequate power vb shell based lhb platform locomotives cleared wap wapwap diesel locos generally passenger locos goods locos hauling passenger trains restricted less electrification meant locos short supply distributed traction helps quicker acceleration deceleration vb starts running speed others also follow overall speeds improve signalling track improvement carried vb also help trains vb good gods gift mankind good trainset taking account specific needs replacing conventional train vb would free locos latest fetish current dispensation mamta duronto lalu garib rath etc last two doldrums today novelty wears actually examine stuff without hyperbole fully support level research matter though think doesnt give answer actual question buy vande bharat rail accidents regularly happening india home behind railway track always hear announcement something breaking services might stopped hours also might add vande bharat running happen accidents like happen per argument make poverty free india thinking space travel use isro many people living poverty line required important hold one talking field diversifying multiple fields completely ignoring actual comment make vande bharat current technology failing miserably time time want talk poverty talk govt initiative field yes need improvement new trains vande bharat great trains per reports rail ministry neglected safety good governments job balance everything theres hindi saying apne pair chaadar se bahaar na paroso guys making fancy upgrades improving infra time last comment fully support talking technical problems vande bharat talking negligence surrounding last two doldrums today still almost booked fully service unlike vande bharat nagpur bilaspur route runs tejas express response breaking even guess meant pasaaro iss tucch praani ko aise apradh ke liye maaf kar dijiye alright lets talk railways people likes move fast one place another ready pay premium ir improved service quite lot since last years accidents reduced significantly ir wait till absolutely accidents might take another years ir wait till introducing vb accidents happens everywhere us chaina japan mai toh keval aapki sahayta kar raha tha manyavar india needs india deserves atleast years independence still excuse ignore legacy trains hey whose gon na question government ministers avoid press conferences couldnt find reliable data right rail accident charts lets talk people wanted move fast vande bharat ticket kolkata jalpaiguri rs hours minutes flight route rs time hour person wants save time opt flight cases japan managed make dent flight usage bullet train afford flight ticket kolkata bengaluru tell seeing horrible accidents take train vande bharat running highest speed take hours flight takes hrs minutes vande bharat great example india capable accidents showing world india right need faster bullock carts btw missed one thing track accident happened used vande bharat also improvement tracks signalling system must hoax trains potential vande bharat like jan shatabdi trains trains really beat condition railway spend money retrofitting trains modern facilities helpful people bother creating super fast train run full potential current tracks investing amounts making existing railway services faster safer showmanship dikhava right take account everyone lives near airport lives bhp bwn vb best choice nagpur bilaspur coach vb tejas temporary arrangement new durontos garib raths introduced existing durontos losing priority thats mean say doldrums vb along ambandura solapur excluding mumbai pune ill thought yupmore hear things think bad type govt like china showing capable fighters copy f f earlier icf coaches accidents used happen railways decided change icf better coaches called lhb coaches lhb coaches could go much faster compared old icf coaches light made diff material also sideways movement less compared icf ones overall meant stability train better mechanical links suspension systems still accidents happen railways didnt upgrade high possibility could witnessed accidents accidents annually keep coming cos railways prioritized safety inorder keep priorities need upgrade india largest railway network good job reducing accident year year yea deadly accident like happen therell question raised safety standards need better trains absolutely justified need increase safety standards theres always room safety improvements needs constant improvement cos problems dont come set pattern dynamic therefore safety standards needs constant monitoring improvement upgradation doesnt matter old steam engines modern train need vb yes definitely cutting travel time scope cut time years line im able go one place another significant reduction time compared current tracks take kmph trains traffic allow trains reach considering engines coaches capable pulling current conditions traffic signalling halt points surely need upgradation happens phase phase thats way happen wait bullet trains fall sky think balanced sane approach required rather raging everything based intensity emotions particular point time need improvement safety modern trains support thing running speed rajdhani pulling speeds make much difference short distances average trains never run speed also introducing new trains track name priority also great approach faster travel every new train comes higher priority previous trains lower priority left people afford couldnt get ticket tell one thing think due safety issues train safety issue poorly maintained track running per primary report due track trains capable running speed much time reach speed average speed vande bharat express running track crowded trains indian railways great job making rail roads safer always something breaking run vande bharat rajdhani reach destination time bhai safety system upgrade ke samne photo achi nahi ayegi isliye need vande bharat photos first part india need vb india need vande bharat trains cant discourage child study physics scored physics chemistry rather encourage achieve chemistryjust example however think vande bharat used political tool rather transport revolution consideration performance anything locos fitted kavach systems utilise funds vande bharat crunch funds developement wait sometimenot abandon safety cant great see question read responses felt like stepping loss life trains acceptable heart goes family loved ones victims railways system serves passengers every part system must work others give best experience yes return older trains slower trains resulting fewer passengers route resulting higher prices per passenger raising television interview engineer television far detailed earlier television interviews think kind possible signalling issue lead orissa accident occurred uk signalling system accident upgraded think improvement upgrades railways improve quality control accident raised many questions must answered people said thing rajdhani introduced state railways lines much worse fact routes still upgraded today run rajdhanis support putting vb hiatus take rajdhanis tejas tracks along fancy trains agreed travel trains filled brim smell shit piss tax payer deserves maybe years finish run vbs rest world running solar powered super mega hyperloops run x speed light shit well complain like china engineers cant build things like china per primary report due track report hasnt come yet official investigation lets say due track solution issue regular maintenance tracksbut thats alone enough need keep improving condition tracks along maintenance cycle never ends one thing goes wrong leads another like perfect storm youd sadly face unfortunate events one likes thembut happens happens could stop could currently reduce possibility mishaps happen regular intervals talking possibility accident near zero possible absolute zero thing exist real world reducing possibility mishap occurance happens improvement ir actually need better always exist always something breaking cos thats things happen okay fact things go wrong move forward could live non productive fantasy world nothing bad good happening dreams one perfect day come tiny creatures lot things control quickly go controlyou never know thats reality run vande bharat rajdhani reach destination time traffic signalling delays due technical issues delays due human made errors could many many reasons question run arises guess run upgraded version potential make rail travel faster smooth lies possibility make even much better today run understand issues better try simultaneously solve instead making storing thought process still understandable like want new trains faster run fast quoting govt yet using double quotes saying need superfast trains existing trains cant run fast derailing regularly existing trains run time everyday new trains introduced higher priority old trains stop wait sides let fancy trains pass make trains capable running moderate speed making trains run high speeds run full capability like creating formula roads capable running alto speed yes quality control top notch like aircraft aircraft multiple support system one system fails means whereas carrying mere passengers whereas trains carrying much passenger yet type accidents occur regularly like answer well clears things things beg differ increasing budget kabach like systems adding autonomous vehicles checking lines budget could allocated type research could much better knowledge need start giant crane picks crap everything recycle ipl railwaysgovt kejriwla bjp rivers roadsjust freaking pick crane dump appreciate spontaneous knowledge subject avid railfan arent well words trains reminiscent mamata lalu surprise see new face upgrading anyways everyone used hate side middle berths gr trains hope new lhb rakes dont dont know amb andura cant really comment yes lets say beyond pune many people would wan na pay price price distance compared normal non ac class seats ac class seats respectively seen many travel ticketless board reserved coaches general tickets route fast train rich people cant something poor people hard travel sleeper general coach yes vande bharat faster existing trains lhb coaches current tracks faster think train authority getting good trains fine speed means faster travel communication control system hasnt changed since british times needs upgraded well along trains vande bharat faster top speed lhb shatabdi coaches hauled wap engines capable speeds upto kmhr restricted kmhr majority routes except one section run kmhr myth vande bharat trains faster current fastest trains thing faster acceleration dont need vande bharat existing trains run ss fast vb trains existing trains lhb shatabdi coaches hauled wap run fast vb capable kmhr restricted kmhr one section kmhr less everywhere else vb trains faster acceleration cut time may couple mins per hour something irrelevant given lack punctuality trains capable kmhr restricted kmhr one section kmhr less everywhere else ive read regarding indian trains vb tested kmph operates less kmph shatabdi capable max speed operates kmph max agree vb doesnt significant advantage speed dont know based factors exactly speed vb limited maybe kmph maximum operation speed current railway conditions true lhb coaches capable upto kmhr tested upto kmhr max operating speed kmhr part delhiagra section kmhr otherwise less vb trains wap loco potential upto kmhr tested upto kmhr basically vb trains train benefit terms speed train speed advantage one benefit train testingproving ground train separate budgets since important without adequate budget difficult parallel streams work higher costs reality railways cuts corners despite say cut corners safety course theyll tv channels telling otherwise example expenditure maintenance fallenhttpswwwndtvcomindianewsodishatrainaccidentliveauditreportfromlastyearflaggedseriousconcernsonrailsafety last years cag report severe shortfalls inspections failure submit accept inquiry reports accidents utilising dedicated railway fund priority tasks declining trend funding track renewal fact fy railways almost derailments almost one derailment every days cag figures yes ideal world would everything real world money constraints make hard budgetary choices railways upgrading tracks run trains lesser design speed remember improvements railways incremental giant leaps yes odisha tragedy caused negligence humans due system failing maintenance folks carried incorrect procedure resulted accident vande bharat step right direction train far sophisticated anything else railways significantly faster much efficient public reception positive eventually shatabdi rajdhani rakes become vande bharat rakes isnt tgv shinkansen proud achievements icf designing great train adds one option rich people apart flight railway option poormiddle class family dont see need railway focus rich people already options like car flight nonsense hypothetical clean superfast trains superfast make train turnaround time fast thats urgency vande bharat trains swachhata hi sewa signaling independence doubt",
    "light_cleaned_title": "Do we really need Vande Bharat with current performance of our railway system?",
    "light_cleaned_selftext": "Why bother creating a super fast train if it can not run to its full potential in current tracks and why not investing those amounts in making the existing railway services faster and safer? After the latest accident in Odisha and also other accidents I am asking myself why invest so much amount on something that is not fully functional yet not investing into something that is in dire need of improvements, Our current existing rail network? &#x200B;",
    "light_cleaned_comments": "What's the use of cars unless we can't stop road accidents. Let's focus on road safety and walk everywhere until then. Think about cars only when we get accidents free roads. Well my argument was that why not make better roads with less potholes than to buy Ferrari. I would say advancement and upgradation of Indian railway both are of an hour, so it should be done parallelly. I also support advancement but if this type of accidents can be avoided with already available technology why not upgrade first. And vande Bharat express looks like a publicity stunt where rajdhani regularly pulls a speed of 120 kmph with existing technology. Without commenting on the nauseating publicity surrounding every VB, a few facts :- 1. One VB(Bhopal) and the Gatimaan are the fastest trains in India reaching a peak speed of 160 kmph between Tuglakabad and a place called Billoch pura , which is a couple of stations before Agra. 2. Most of the other VBs are capped at 130, a few at 110 or even lower in sections. 3. Trains on the LHB platform (cream and red livery) can be run with the same speeds as the VB provided they have adequate power. 4. VB shell is based on the LHB platform. 5. The locomotives we have are cleared for 160 (WAP5), 130 (WAP7,WAP4), diesel locos at 110 generally. These are passenger locos. 6. Goods locos hauling passenger trains are restricted to less than 110. 7. Electrification has meant that locos are in short supply . 8. Distributed traction helps quicker acceleration and deceleration. 9. Once VB starts running with a speed, others will also follow so overall speeds will improve. 10. All signalling and track improvement carried out for the VB also help other trains. 11. VB is good but not god's gift to mankind. It's a good trainset taking into account our specific needs. 12. Replacing a conventional train with a VB would free up locos. 13. It's the latest fetish of the current dispensation. Mamta had her Duronto, Lalu his Garib Rath etc. The last two are in the doldrums today. 14. Once the novelty wears off, we can actually examine stuff without hyperbole. I fully support your level of research on the matter though I think it doesn't give an answer to my actual question. Why buy vande bharat when we have rail accidents regularly happening in India. My home is just behind railway track and I always hear announcement about something breaking down and the services might be stopped for few hours. Also might add that with vande Bharat running at 160 what will happen if accidents like these happen? As per your argument why not make poverty free India before thinking about space travel. What is the use of ISRO when so many people living under poverty line. Both are required. Both are important. You cannot should not hold one for other. I am talking about same field and you are diversifying it into multiple fields completely ignoring the actual comment. Why make Vande Bharat when our current technology is failing miserably time to time. If you want to talk about poverty talk about govt initiative on that field only. Yes, we do need improvement and new trains. Vande Bharat are great trains. But as per few reports rail ministry neglected safety. A good government's job is to balance out everything, there's a Hindi saying \"apne pair chaadar se bahaar na paroso\". These guys are making fancy upgrades but not improving infra at the same time. At last a comment that I fully support. I was not talking about the technical problems of vande bharat I was talking about the negligence surrounding it. >The last two are in the doldrums today. Still they are almost booked fully for each service, unlike the Vande Bharat on Nagpur Bilaspur route which runs as Tejas express now because the response was not breaking even. Guess you meant pasaaro Iss tucch praani ko aise apradh ke liye maaf kar dijiye. Alright let's talk Railways. There are people who likes to move fast from one place to another. Who are ready to pay a premium on that. IR has improved it's service quite a lot since last 10 years and accidents have been reduced significantly. Should IR wait till there is absolutely no accidents which might take another 100 years. Should IR wait till then before introducing VB. Accidents happens everywhere be it US CHAINA or JAPAN. Mai toh keval aapki sahayta kar raha tha manyavar It's not what India needs but what India deserves atleast after 75 years of independence..... But still it's no excuse to ignore or legacy trains,, but hey whose gonna question our government when all ministers avoid press conferences Couldn't find reliable data right now about rail accident charts but lets talk about people wanted to move fast. Vande Bharat ticket from kolkata to Jalpaiguri : 1565 Rs (7 hours 30 minutes) Flight on the same route : 3244 rs (Time : 1 hour) if you are that person who wants to save time you should and will opt for flight in most of the cases. Only Japan have managed to make a dent in flight usage with their bullet train. I can afford a flight ticket from kolkata to bengaluru. Now tell me after seeing these horrible accidents should I take train which with vande bharat running at its highest speed will take more than 12 Hours and in flight it takes only 2hrs and 30minutes. Vande Bharat is a great example what india is capable of and the accidents are showing the world what india is right now. No we need faster bullock carts. btw missed one thing The track where the accident happened was used by Vande Bharat also so improvement of the tracks and signalling system must be a hoax There are other trains which has potential as vande bharat like jan shatabdi trains. These trains are really in a beat up condition now. Railway can spend money on retrofitting these trains with modern facilities which will be more helpful to people. >Why bother creating a super fast train if it can not run to its full potential in current tracks and why not investing those amounts in making the existing railway services faster and safer? Because of showmanship and dikhava. You are right but you have to take account not everyone lives near an airport. Who lives in BHP or BWN VB is the best choice for that. The nagpur bilaspur has a 8 coach vb. The Tejas was a temporary arrangement . No new Durontos or Garib Raths are being introduced. Existing Durontos are losing priority. That's what I mean when I say it's in the doldrums. This VB along with the Amb-Andura & Solapur (excluding Mumbai Pune) are ill thought of. yup...more I hear these things more I think about how bad these type of govt is. Like china showing off its capable fighters which is just a copy of F - 35 and F - 22 There was earlier ICF coaches and accidents used to happen then. The Railways decided to change the ICF with a better coaches called LHB coaches, now this LHB coaches could go much faster compared to the old ICF coaches (as they are light and made of diff. material). Also the sideways movement is less compared the ICF ones which overall meant stability to the train (better mechanical links and suspension systems). Still accidents happen. If railways didn't upgrade then there was a high possibility that we could have witnessed more and more accidents. But the no of accidents annually keep coming down cos the railways prioritized safety and inorder to keep up with priorities they need to upgrade which they did. India has the largest railway network and they are doing a good job reducing the accident year or year, and yea deadly accident like this happen and there'll be a question raised on safety standards and need of better trains or not and that is absolutely justified. 1) Do we need to increase safety standards - there's always room for safety improvements and it needs constant improvement cos problems don't come with a set pattern.. they are dynamic and therefore safety standards needs constant monitoring, improvement and upgradation. Doesn't matter if you have old steam engines or modern train. 2) Do we need VB- yes definitely, if it's cutting down travel time and has the scope to cut down that time further more then why not? 10 years down the line if I'm able to go from one place to another with a significant reduction in time compared to now then why not? The current tracks can take 200kmph trains .but can the traffic allow the trains to reach 200 considering the engines and coaches are capable of pulling off 200 with the current conditions of traffic, signalling and halt points? surely all of them need upgradation and when that happens phase by phase ( that's the only way it can happen) then will you wait for the bullet trains to fall from sky?? I think a balanced and sane approach is required rather then raging on everything based on the intensity of emotions at that particular point of time. We need improvement in both. Safety and Modern trains. I support you on this thing. But running at a speed of 130 where rajdhani pulling speeds above 100 will not make much difference for short distances. And on average the trains will never run on a speed of 130 also introducing new trains with same track on the name of priority is also not a great approach for faster travel. If every new train comes with higher priority previous trains will be of lower priority and left out for people who can not afford or couldn't get a ticket. Tell me one thing. Do you think it was due to safety issues on the train or is it the safety issue of poorly maintained track it was running on? As per the primary report it was due to the track. All of our trains are capable of running at a speed of 100 + how much of the time it can reach that speed. what is the average speed of Vande Bharat Express running in the track which are crowded with other trains? Indian railways are doing a great job making the rail roads safer but why there is always something breaking down now and then. Why run Vande Bharat if Rajdhani can not reach its destination on time? Bhai safety system upgrade ke samne photo achi nahi ayegi. Isliye we need vande bharat for photos First part, do India need VB?? India need Vande Bharat trains too, you can't discourage your child to study Physics if he scored 90 in Physics but 9 in Chemistry, rather you should encourage to achieve 90 in Chemistry(just an example). However, I do think Vande Bharat used as political tool rather than the transport revolution. In consideration of performance, before anything now, all locos should be fitted with 'Kavach' systems, utilise funds from Vande Bharat if there is crunch of funds. Developement can wait for sometime(not abandon) but safety can't. Great too see this question and I have read a few responses so felt like stepping in. Any loss of life in trains is not acceptable and my heart goes out to the family and loved ones of the victims. Railways is a system that serves passengers and so, every part of that system must work with others to give the best experience. Yes, we can return to older trains, but then we will have slower trains, resulting in fewer passengers in a route, resulting in higher prices per passenger. I am raising this because the television interview by by an engineer on television was far more detailed than earlier television interviews. I think, the kind of possible signalling issue that lead to Orissa accident, had occurred in the UK, when the signalling system in that accident, was being upgraded. So, we have to think about the improvement after upgrades. Railways have to improve quality control as this accident has raised many questions that must be answered. People said the same thing with Rajdhani. It was introduced when the state of the railways lines was much worse than it is now. In fact, routes are still upgraded TODAY to run Rajdhanis. I support putting the VB into hiatus if we take Rajdhanis and Tejas off the tracks too, along with all the other more fancy trains. Agreed? We can all travel in trains that are filled to the brim and smell and shit and piss 24/7. It's what the tax payer deserves. And then maybe 100 years from now when we finish, we can run the VBs when the rest of the world is running solar powered super mega hyperloops that run at 0.5x the speed of light or some shit. And then we'll complain that we are not like China, and that our engineers can't build the same things like China. >As per the primary report it was due to the track. The report hasn't come out yet from official investigation so let's say for now it was due to the track. The solution for this issue is a regular maintenance of tracks..but that's alone not be enough... you need to keep on improving the condition of tracks along with maintenance and this cycle never ends.. One thing goes wrong which leads to another and it's like a perfect storm and you'd sadly have to face with these unfortunate events. No one likes them..but when it happens it happens and you could not stop. All you could do currently is just reduce the possibility of these mishaps to happen on a regular intervals. talking the possibility of accident to near zero is possible not absolute zero, no such thing exist in a real world. reducing the possibility of mishap occurance and that happens only through improvement. and IR is actually doing that and need to do better always exist. >why there is always something breaking down now and then. Cos that's how things happen... you have to be okay with the fact that things can go wrong and move forward. Or you could live in a non productive fantasy world where nothing bad or good is happening and in your own dreams that one perfect day will come. We are very tiny creatures and lot of things that were in our control can quickly go out of control..you never know. that's the reality. >Why run Vande Bharat if Rajdhani can not reach its destination on time? Traffic, signalling, delays due to technical issues, delays due to human made errors, there could be many many reasons. Then the question of why run them arises I guess?? You run them because they are upgraded version and have the potential to make rail travel faster and smooth.. there lies a possibility to make them even much better than what they are today. So why not run them to understand issues better and try and simultaneously solve them instead of making them and storing them. Your thought process is still not understandable by me. Like you want new trains that are faster which can not run fast. You are quoting govt and yet not using double quotes. You are saying that we need superfast trains when existing trains can't run fast and derailing regularly. Existing trains can not run in time and everyday some new trains are introduced with higher priority so the old trains have stop and wait on sides to let these fancy trains pass. Why not make all the trains capable of running at a moderate speed than making trains that can run on high speeds but does not run with its full capability ? Its like creating a formula 1 when your roads are only capable of running alto 800 in its 60% speed. Yes. Quality control should be top notch like in aircraft. An aircraft have multiple support system if one system fails by any means whereas it is only carrying mere 150 passengers. Whereas trains are carrying much more passenger and yet this type of accidents occur regularly. I like your answer.. well it clears some things but there are few things I beg to differ. Increasing budget on kabach like systems. Adding autonomous vehicles for checking lines. The budget could be allocated to this type of research. Could be much better in my knowledge. What we need is a start over. Giant crane that picks the crap which is everything and recycle it. IPL, railways,govt, kejriwla, BJP, all the rivers, roads...just freaking pick up crane and dump them. I appreciate your spontaneous knowledge about the subject. You are an avid railfan, arent you? Well in your own words, these 2 trains are reminiscent of Mamata and Lalu, it's no surprise to not see a new face upgrading them any further. Anyways, everyone used to hate the Side Middle Berths of G.R. trains, I hope the new LHB rakes don't have it. I don't know where Amb Andura is, so can't really comment on that. Yes let's just say beyond Pune not many people would wanna pay 8× - 9× the price and 2× the price for the same distance if compared with normal non AC class seats and AC class seats respectively. I have seen many travel ticketless or board the reserved coaches with general tickets on this route. It is fast train but for rich people. Can't they do something for poor people. It's very hard to travel in sleeper and General coach. Yes But Vande Bharat is no faster than existing trains (lhb coaches) on the current tracks. So how is it faster? I think it's not about the train itself but about the authority. Getting good trains is fine and more speed means faster travel more communication but it's the control system which hasn't changed since the British times. That needs to be upgraded as well along with trains. Vande Bharat is no faster (in top speed) than the lhb shatabdi coaches hauled by WAP5 engines. Both are capable of speeds upto 200km/hr but restricted to 130km/hr in majority of routes except one section where both run at 160km/hr. So this is a myth that Vande Bharat trains are faster than the current fastest trains. Only thing they are faster at is acceleration. You don't need vande Bharat for that. Our existing trains can and do run just ss fast as VB trains. 2.Existing trains (lhb shatabdi coaches hauled by WAP5} can run just as fast VB. Both are capable of 200km/hr but restricted to 160km/hr in one section and 130km/hr or less everywhere else. VB trains do have faster acceleration so they can cut down time may be couple of mins per hour, something irrelevant given the lack of punctuality of our trains. >Both are capable of 200km/hr but restricted to 160km/hr in one section and 130km/hr or less everywhere else From what I've read regarding the Indian trains... VB is tested for 180 kmph but operates more or less at 130 kmph. Shatabdi is capable of a max speed of 160 and operates under 130kmph max. I agree that VB doesn't have any significant advantage in SPEED but I don't know based on what factors exactly is the speed of VB limited. Maybe 130kmph is the maximum operation speed on current railway conditions. Same is true for lhb coaches. Capable of upto 200km/hr and tested upto 180km/hr. Max operating speed is 160km/hr on part of Delhi-Agra section, 130km/hr otherwise. More or less the same as VB trains. WAP5 loco has the potential of upto 225km/hr and tested upto 184km/hr. Basically VB trains (train 18) does not have any benefit in terms of speed. Train 20 will have a speed advantage, so that is one benefit of train 18 that it is a testing/proving ground for train 20. Why not both? We can have separate budgets for them since both of them are important. Without adequate budget that is difficult. Parallel streams of work = higher costs. In reality, railways cuts corners. And despite what they say, they cut corners on safety. Of course they’ll be out on tv channels telling you otherwise. As an example, [expenditure on maintenance has fallen](https://www.ndtv.com/india-news/odisha-train-accident-live-audit-report-from-last-year-flagged-serious-concerns-on-rail-safety-4093016) — this is from last year’s CAG report. > severe shortfalls in inspections, failure to submit or accept inquiry reports after accidents, not utilising a dedicated railway fund on priority tasks, declining trend in funding track renewal And this is after the fact that in FY 2017-2021, Railways had almost 700 derailments. *This is almost one derailment every 2 days.* Again, CAG figures. Yes, in an ideal world you would have everything. But in the real world, you have money constraints and have to make hard budgetary choices. Railways is upgrading the tracks to run the trains at 160 which is 20 lesser than the design speed. Remember that improvements in railways is incremental and not giant leaps. Yes. The Odisha tragedy was caused by the negligence of humans and not due the system failing by itself. The maintenance folks carried out an incorrect procedure which resulted in the accident. Vande bharat is a step in the right direction. The train is far more sophisticated than anything else in the railways, significantly faster and much more efficient. Public reception has been positive eventually all shatabdi and rajdhani rakes will become Vande bharat rakes. While it isn’t a TGV or Shinkansen, we should be proud of the achievements of ICF in designing a great train. It only adds one more option for rich people apart from flight Railway is the only option for poor/middle class family , I don't see any need for railway to focus on rich people as they already have other options like their own Car or flight Nonsense. All hypothetical! Clean the superfast trains superfast. Make the train turnaround time fast too. That's the urgency. Not just Vande Bharat, in all trains \"Swachhata hi sewa\" तत्परता से आवश्यक है! Does we have signaling before independence I doubt it."
}