{
    "id": "1aipxdr",
    "title": "These guys trying to scam me",
    "url": "https://www.reddit.com/gallery/1aipxdr",
    "selftext": "I got this group from my college group and they both asked for a 1000 rupees initial registration fee and another 2000 rupees. \nThe second person who called was a newbie I believe cause other people were helping him with the call after he was telling me to pay and pay again and again. I was signing up for an internship program.",
    "flair": "Crime",
    "score": 4,
    "num_comments": 9,
    "created_utc": 1707059284.0,
    "convurl": "https://i.redd.it/8lywhc0o3lgc1.jpg",
    "comments": [
        "The funny thing is that both of them had a scripted way of talking with me lol",
        "Employment details\n\nEmployee 1\n\nDid they put some details honestly???",
        "Got a similar message in my college group. I simply ignored the messaged. But, my friends paid for the initial 1,000/- which comes under their “registration” and they asked my friends to pay an additional 2,000/- for internship\n\nSo, my friends did the payment. They gave the required training needed for the internship. The classes were held online, boring lectures, all the lectures were pre-recorded and are useless. They gave assignments that are not useful to the course. Finally after surviving for the whole 2-3 months they would give a certificate for “Training” and not Internship. I repeat “Certificate of completing Training“ instead of an internship certificate.\n\nI would suggest you to ignore these messages and do tell your friends the same. You can try landing better opportunities at startups instead of scams like these.",
        "Yeah I joined the group thinking of joining some internships or workshops. One of my friend is also in it I guess I should warn him about this but there are like 100 participants in the group and many of them may also get caught in this scam and waste their money and their time. \nWe have a semester break coming and I wanted to find some internships to join.",
        "This AICTE portal is filled with 90% of these scammers. They will take fee to give us internship and students pay because they womt be promoted to the next year without an internship.",
        "You can always find internships at startups which pay you money (stipend) for working for them. It makes no sense in paying money to join an internship. Many students fall for these scams and in return receive a training certificate that’s of no use. I would suggest going to linkedin, update your profile and search for relevant startups that suite your profile, you will hopefully come across their hiring page, apply for it.",
        "Do please report these scammers' phone numbers and SMS headers on an app like Phishbowl. Others can check and save themselves 1000's of their money. You can also check their database when in doubt. The best part is that its a free app."
    ],
    "cleaned_text": "guys trying scam got group college group asked rupees initial registration fee another rupees second person called newbie believe cause people helping call telling pay pay signing internship program ",
    "cleaned_title": "guys trying scam",
    "cleaned_selftext": "got group college group asked rupees initial registration fee another rupees second person called newbie believe cause people helping call telling pay pay signing internship program",
    "cleaned_comments": "funny thing scripted way talking lol employment details employee put details honestly got similar message college group simply ignored messaged friends paid initial comes registration asked friends pay additional internship friends payment gave required training needed internship classes held online boring lectures lectures prerecorded useless gave assignments useful course finally surviving whole months would give certificate training internship repeat certificate completing training instead internship certificate would suggest ignore messages tell friends try landing better opportunities startups instead scams like yeah joined group thinking joining internships workshops one friend also guess warn like participants group many may also get caught scam waste money time semester break coming wanted find internships join aicte portal filled scammers take fee give us internship students pay womt promoted next year without internship always find internships startups pay money stipend working makes sense paying money join internship many students fall scams return receive training certificate thats use would suggest going linkedin update profile search relevant startups suite profile hopefully come across hiring page apply please report scammers phone numbers sms headers app like phishbowl others check save money also check database doubt best part free app",
    "light_cleaned_title": "These guys trying to scam me",
    "light_cleaned_selftext": "I got this group from my college group and they both asked for a 1000 rupees initial registration fee and another 2000 rupees. The second person who called was a newbie I believe cause other people were helping him with the call after he was telling me to pay and pay again and again. I was signing up for an internship program.",
    "light_cleaned_comments": "The funny thing is that both of them had a scripted way of talking with me lol Employment details Employee 1 Did they put some details honestly??? Got a similar message in my college group. I simply ignored the messaged. But, my friends paid for the initial 1,000/- which comes under their “registration” and they asked my friends to pay an additional 2,000/- for internship So, my friends did the payment. They gave the required training needed for the internship. The classes were held online, boring lectures, all the lectures were pre-recorded and are useless. They gave assignments that are not useful to the course. Finally after surviving for the whole 2-3 months they would give a certificate for “Training” and not Internship. I repeat “Certificate of completing Training“ instead of an internship certificate. I would suggest you to ignore these messages and do tell your friends the same. You can try landing better opportunities at startups instead of scams like these. Yeah I joined the group thinking of joining some internships or workshops. One of my friend is also in it I guess I should warn him about this but there are like 100 participants in the group and many of them may also get caught in this scam and waste their money and their time. We have a semester break coming and I wanted to find some internships to join. This AICTE portal is filled with 90% of these scammers. They will take fee to give us internship and students pay because they womt be promoted to the next year without an internship. You can always find internships at startups which pay you money (stipend) for working for them. It makes no sense in paying money to join an internship. Many students fall for these scams and in return receive a training certificate that’s of no use. I would suggest going to linkedin, update your profile and search for relevant startups that suite your profile, you will hopefully come across their hiring page, apply for it. Do please report these scammers' phone numbers and SMS headers on an app like Phishbowl. Others can check and save themselves 1000's of their money. You can also check their database when in doubt. The best part is that its a free app."
}