{
    "id": "142b7ds",
    "title": "Expose your terrible bosses and organizations - a follow up to the HDFC video. A place to vent and share your story.",
    "url": "https://www.reddit.com/r/india/comments/142b7ds/expose_your_terrible_bosses_and_organizations_a/",
    "selftext": "https://www.livemint.com/companies/news/hdfc-bank-suspends-top-official-after-video-of-him-abusing-colleagues-during-online-meet-went-viral-watch-11685969562262.html\n\nThis video has gone viral. I'm sure that this isn't breaking news for seasoned salespeople in this country. I personally have gone through something like this since the start of my sales career some 7 years ago. And I've always been in B2B sales which is considered more respectable generally. \n\nSo it is time to name and shame our current and previous organizations that allow for this kind of behaviour. \n\nI'll go first:\n\nNo surprises here - Reliance Jio Infocomm Limited\n\nAbsolutely terrible work culture. 6 days a week to start with. Bosses are terrible from top to bottom. You are treated like a number not a person. HR is non existent. During my tenure at Jio, I heard from HR only once, during my training days. \n\nThe shouting that you see in the HDFC video - that was daily life for me. My manager used to threaten us with salary holds and PIPs and terminations daily. I had to start keeping track of the PIP threats. He was averaging 5/6 per day. \n\nAs for the shouting - he had rage issues. He shouted at our B2B clients. I mean then why would he hold back on his team. \n\nIf there is anyone looking to join Reliance Jio - do yourself a favour, don't.",
    "flair": "Rant / Vent",
    "score": 770,
    "num_comments": 125,
    "created_utc": 1686046462.0,
    "convurl": "https://external-preview.redd.it/NM3D2EW7M08FKNqtF8a7jUYcvdXRDMZlVakmvP7rIo4.jpg?auto=webp&v=enabled&s=0e6921cf3c782c179aafa2d11a85c813e9781070",
    "comments": [
        ">If there is anyone looking to join Reliance Jio - do yourself a favour, don't.\n\n++++\n\nOr if you are a CA, join and get a crazy good package and use that to join elsewhere. \n\nCan vouch for what OP says about shouting, it happened even during the pandemic, it is pathetic.\n\nOn that note, there have been some RIL employees who legit died at work or while being on call with their team/boss. The pressure is insane and they try to jugaad for a looooong time rather than say buying new tech.",
        ">RIL employees who legit died at work or while being on call with their team/boss.\n\nWhat? Is there a case filed?",
        "No, but that did lead to some bosses asking people not to attend work calls when they are out of the office.  \n\n\nI know 2 such cases, but those were before the pandemic. One was at RCP itself.  \n\n\nThe yelling and gaali galoch is super common though. This relative of mine has lots of stories like op mentioned. Some people in the upper management have a very foul mouth and they use really very bad words, sometimes even in front of other employees.",
        "Yea it's a top down thing. My manager used to get shouted at like that by his manager. His manager also got shouted at the same way. All the way to the top. The only difference is the frequency. \n\nFor us it was multiple times daily. For some its weekly. For some monthly. But its the same.\n\nThats why I feel all those \"Great Places To Work\" awards are a sham - every place I've worked at has had those awards 😂😂😂😂",
        "Why was the case not filed? People legit lost their lives. Better to resign and lose a job than this.",
        "In such cases, the spouse is given some job position to sort of make up for the loss. So, the family doesn't bother filing any complaints.\n\nBut the employees know though, they know and many will go out of their way to comfort people who get yelled at.",
        "What about rude behaviour by employees?",
        "I had a friend who joined tcs(bcom grad). 9-5 working hours. Had to punch out at 5 but still have to remain in office till 7pm. No overtime payment. Applying for leave, u won't get any of ur choice. U can take the leave on days we provide. While the managers used to come late by 10 and left at 5, all while taking 1-2 days leave every 7-8 working days. She left after 6 months.",
        "Why would anybody want to work for an employer who was responsible for their death? This is just disturbing.",
        "SAh was see s but stdg sa sa sa sa sazszx\"'ccrssddxgaasscssassssysssf zes s s dddd sa a CD CD CD zz*asszczs",
        "What are CAs paid there?",
        "Meow?",
        "It is, but many times the man is the sole breadwinner in the family. There's this family friend I know who had 6 dependents - wife+kids+parents (2)+uncle & aunt\n\nHe looks after all of them",
        "11-15LPA",
        "These toxic companies took advantage of their situation. Litigation could only cause more pain with no guarantee of winning as these companies would be able to hire the topmost lawyers.\n\nCan only name and shame but even media is not too bothered now-a-days.",
        "That is very true, sadly.\n\nNaming and shaming won't help and companies are very strict with employees' offline & digital presence now. Especially after the Janhavi Gadkar case.",
        "Funny thing here is HDFC acting as if they did not know any of these were happening and being all righteous.  \nInternally they must be like phew only one video got out! \nOther banks - phew it was not one of ours!",
        "But in case of a company like Tcs, your work culture largely depends on your project and your manager. Their HR policies are pretty robust so as soon as any case reaches the HR it gets resolved in a pretty just way. I have worked there for a few yrs and luckily had the chillest boss. Plus we would get paid OT allowances and comp offs even for a couple of hours of over time. I had earned so many comp offs that by the time I left TCS I had 50+ earned leaves and I could encash them all.",
        "Vehicle Dealership especially Trucks are another hell holes.",
        "ICICI is way worse.",
        "adidas India Marketing Private Ltd.! \n\nLet's delve into the cesspool of toxic boss culture and their questionable hiring practices. I mean, seriously, who in their right mind thinks it's a good idea to hire people from higher positions and place them in lower positions? Talk about demoralizing and squashing any hopes of internal promotions!\n\nAnd let's not forget about their amazing decision-making during the COVID-19 pandemic. While the rest of the world was struggling, they thought it would be a brilliant idea to extend the working week from five days to six! Oh, because revenue and staff were limited, right? Well, guess what? The backend team was still working five days a week. Way to prioritize and create a divide among your employees!!\n\nNow, let's talk about the fantastic response they had when you dared to voice your concerns. Did they take it as constructive feedback? Nope! Instead, they canceled your transfer and promotion, and to add insult to injury, they blacklisted you for any future transfers in any region! How's that for valuing employee opinions and fostering a supportive work environment?\n\nBut wait, there's more! When your team had the audacity to complain about the superboss in confidentiality, what did adidas India do? They retaliated and put the blame squarely on your shoulders! And what was the end result? They fired the Assistant Manager! Oh, how sweet of them, playing the role of the sweet-talking, overly caring snakes in the grass.\n\nAnd let's not forget their incredible commitment to diversity and inclusion. Instead of hiring the most qualified and experienced candidates, they blindly hire female staff to increase the women's percentage. Who cares about competence and expertise, right? It's all about the numbers and appearances, regardless of the impact it has on the overall team dynamics and productivity.\n\nSo there you have it, folks! adidas India Marketing Private Ltd., where toxic boss culture, questionable hiring practices, retaliation, and prioritizing numbers over talent are the name of the game.\n\nTL;DR: adidas India Marketing Private Ltd. has a toxic boss culture, questionable hiring practices, and retaliates against employees who voice concerns. They extended the working week during COVID-19, canceled promotions, blacklisted transfers, and fired my Assistant Manager. They also prioritize hiring relatively inexperienced women over experienced male candidates. Not a great place to work!",
        "I know I am going to get downvoted for sharing the reality here but still, \n\nIs this really the first time the majority of people are becoming aware of these situations ? Situations like these are very common in all types of sales and Service related jobs. If you have a family member or a relative who works in a sales job, ask them regarding this and you will get to know a lot of such situations which are never brought to light. \n\nThe best that can be is done by the employee is to ask for change of manager ? Why - Because if that one screaming manager can bring results and profits to the XYZ company or Bank, that way works and company benefits. So again the bank won't fire them until they start beating someone.\n\nLike think through once, why would a random number from XYZ bank call you asking if you want to take loans or credit cards or debit cards or sell you insurance every week or month ? These so-called callers mostly have a job where they are paid on the number of people they call in a day and if they don't meet that target, these callers will also be scolded by their managers. Some of them will be scammers as well, some we as people are careful off and sometimes people get scammed.\n\nSimilarly, You will also see many people in Malls or Electronic shops telling you to share contact numbers with them. Why are they asking this ? Because their managers have told them to take and note done numbers of people they talk to. These managers might also be screaming at them. Reports are made everyday, on field jobs have to send Checklist whether they have succeeded in completing the minimum quota of talking to people.\n\nI agree 80% of Managers are great and very helpful but you will also find others like the one in the videos. Even a good manager might scream at a person due to some frustration or other things. It is obviously wrong and mentally hurtful.",
        "I am surprised that people are surprised by this",
        "Gosh that's bad - i have a feeling that given enough time, we'll end up naming all companies that operate in India, in this thread.",
        "Mahindra",
        "I was just doing a small stint at Reeliance Insurance. They used to target poor families by hosting a drawing competition in poor schools and letting the parents know that their kid has won an award. \nSo the poor gullible parents used to come to the reliance office and they would be pitched a term Insurance product. \nThe speech would be like if you die today, who’s gonna support your family etc etc. used to scare these poor families. \n\nFelt it was such a scam, taking advantage of poor families. Quit within a month.",
        "They pay a lot. So if you switch, other companies are not able to match the salary. Hence retention rate is high. But also ruin your credibility in the market especially mine by sharing terrible feedback making it difficult for me to find a job.",
        "No one is surprised. But this is the first time it's out in the open like this. We need to keep up the momentum and share incidents like this regularly. We need to collect evidence and put it in the public sphere. Thats the only way we will ever get any resolution. We cannot depend on our HR. We have to take matters into our own hands for our sake and for the future generations. Otherwise this bullshit will continue.",
        "We need a r/bossfreakout",
        "Thats really bad man :/\n\nHope you get into something better.",
        "Try and join hotels. You'll be glad you're stuck in corporates. Especially if you're a chef",
        "Looks like maharashtra. In north india there is no work culture, there is bauji culture. HR is bauji's lapdog. Bauji doesnt do shit and just keeps tab on who is coming and foing out of the odc. Also, everything else at that company is absolutely shit in north.",
        "I had a friend who worked for IHCL for 6 months. That guy stood unmoved like a rock while his mother was undergoing cancer treatment but he couldn't withstand the hotel industry.",
        "Yes. And more people need to be aware of the exploitation done in hotels. Working 17-18 hours a day. No breaks. No offs. Cuts, burns and bruises. Pay like peanuts.\n\nThe positive is that it makes you tough. Battle hardened. \n\nWish the media/industry changes for the good.",
        "I worked in Tech Mahindra as a System Admin and I had a boss who was the Project Manager. I had joined the work when the Covid outbreak happened and even during the course of Covid in 2020, I had to go to office as soon as May cause business should not be affected even by 1%.\n\nIt was a nightmare working for this guy who did not understand there was a covid going on. He was toxic af to even the team managers. Had to endure for a year cause no one else was hiring at that time and I did not want to lose my current job. \n\nThankfully got into a good company now that treats me well. Even during my fuckups(more than once, recent one had cost the company like 2 lakh rupees), we would try to figure out a solution and see what it had happened instead of blaming and screaming at each other.",
        "Luckily i have some good paying skills so im doing well for myself. But yes its been terrible. Thanks mate.",
        "I agree. My brother left the prestigious Taj Mumbai because of how the supervisors treated him. He’s doing well now. So you need something terrible to value the good.",
        "An organization named Impact Guru. Just head over to their Glassdoor to learn more.",
        "I've worked in IT only. I have worked under several managers over the years. Some are very good and helping. Majority of them go neutral. and ofcourse bad apples will be there. Mostly it's the managers who technically suck act as a-holes. Because they cant understand what a developer is saying and they have to show their power somehow.",
        "Well in hotels we say Taj is one of the better brands where they atleast treat better. There are brands where the work is brutal. Can't name, unfortunately. \n\nAlthough, I'd reckon hotels do build character. Toughness. And teach you much more than what a book or a fancy school can.",
        "Anybody from the hotel industry?\n\nYes khud ka dukh sabko hi bada lagta hai...\n\nBut hotel industry might look really glamorous from the outside, you get to hang out with the celebrities, if you are on a good position,you get to try all the cuisines at the organization's expense n blah blah.\n\nHowever is is less discussed but hotel industry too is really toxic..\n\nCan  someone please can share their first hand experience..",
        "I used to work as a pvt. teacher giving 6 classes daily for peanuts. My boss told me i wasn't good enough for job, fired me after 3 months. I am currently working in govt. Organization on contract.",
        "Curious what pressure gets put on a chef? To make dishes faster?",
        "That's the least of things that bother us.",
        "A friend of mine used to work for ICICI as an RM. He was paid peanuts like 25k pm after doing an MBA from a good institute. Secondly he used to have daily morning calls with the RBH for ULIP commits. They were asked to use any trick in the book to sell ULIPs. They had access to every customers entire history (in fact I even made a post about this years ago) and they were asked to use this info to sell ULIP or prepaid (brokerage)\n\nThere was an extreme incident where a female RM was asked by the manager to go sleep with the client to get the sale. She recorded it and reported it and the manager was fired. \n\nThere were multiple incidents where if an RM hadn't met his commit, the manager would call him up at 7pm and ask them to travel to a branch on the other side of the city. Like say if they were in Navi Mumbai, they'd be asked to go to South Bombay and call the manager from there. Once they'd call the manager from there - the manager would ask them to go home. This was a daily tactic apparently. \n\nOther than this there were three commit calls that happened every day which were basically abuse. \n\nMy friend quit within one year and joined a consulting firm where the hours were much longer but no one ever treated him like a slave again.\n\nhttps://www.np.reddit.com/r/india/comments/59coxb/ashow_comfortable_are_you_knowing_that_many_bank/",
        "Accenture is as bad as it gets. I was expected to know everything, be on call for almost 10 hrs each day, then do lot of work. Taking a leave was a nightmare. Plus our manager shouted on us on daily basis. Luckily, I was able to switch within a year.",
        "Jio is indeed very horrible. I also had a soul crushing experience there. Manager was harassing me and not letting me leave the team either. The whole thing then imploded into an intense shouting contest.",
        "I get you mate. My brother worked for Taj. He told us that he was slapped and verbally abused by his supervisor. Though he told this to us much later. Otherwise I myself would have broken his supervisor’s bone. Makes me mad.",
        "That is what my Dad refers to as Lalaism or Lala culture. \n\nThese are establishments with no potential for growth and the owners/ bosses are narrow minded people who just stick to the rules. They are afraid of criticism and cannot expand their horizons.\n\nThey are afraid of questions and will create issues out of thin air.\n\nReminds me of someone in Delhi! Oh yeah that’s our PM also!",
        "I’m guessing, for IT it’s quite good as compared to non-IT people.\nReading all the comments makes me appreciate my manager and work life balance🥲",
        "Which group of Accenture and which location?",
        "Which group of Accenture and which location?",
        "paging /u/icicibank. what is this behaviour?!  \n\n\n\n\n\n^/s",
        "What’s this Bauji man?",
        "What’s Bauji man",
        "I was in Atci, working as Cloud migration architect at bangalore",
        "Strange because everyone talks of how HR is all powerful",
        "SBI. I was working in a Branch Office which was difficult in all aspects. Improper internet connectivity, location and size of the branch, even the road to reach the branch. This manager was so asshole that he would give every work to me and not delegate the work to another clerk, which could have reduced the stress overall. I would have to stay late and leave the branch late;  driving back to the village where I lived was so tough, I was almost questioning my own existence. The branch also had no 2nd and 4th Sat and Sunday off, which fucked a lot in my life, personally and professionally. I learnt from some other clerk that he was working in another organisation (where my father worked for more than 3 decades before retiring in 2016), and there the job made him have suicidal tendencies. I could feel the behaviour seeping into my work as well. I soon realised that even if I work hard to promotion, nothing would made me get out of here. So I resigned, took a break, prepared for another exam and cleared it. Moving out of Lunchtime is probably the best decision I took in my life till present.",
        "SBI. I was working in a Branch Office which was difficult in all aspects. Improper internet connectivity, location and size of the branch, even the road to reach the branch. This manager was so asshole that he would give every work to me and not delegate the work to another clerk, which could have reduced the stress overall. I would have to stay late and leave the branch late;  driving back to the village where I lived was so tough, I was almost questioning my own existence. The branch also had no 2nd and 4th Sat and Sunday off, which fucked a lot in my life, personally and professionally. I learnt from some other clerk that he was working in another organisation (where my father worked for more than 3 decades before retiring in 2016), and there the job made him have suicidal tendencies. I could feel the behaviour seeping into my work as well. I soon realised that even if I work hard to promotion, nothing would made me get out of here. So I resigned, took a break, prepared for another exam and cleared it. Moving out of Lunchtime is probably the best decision I took in my life till present.",
        "SBI. I was working in a Branch Office which was difficult in all aspects. Improper internet connectivity, location and size of the branch, even the road to reach the branch. This manager was so asshole that he would give every work to me and not delegate the work to another clerk, which could have reduced the stress overall. I would have to stay late and leave the branch late;  driving back to the village where I lived was so tough, I was almost questioning my own existence. The branch also had no 2nd and 4th Sat and Sunday off, which fucked a lot in my life, personally and professionally. I learnt from some other clerk that he was working in another organisation (where my father worked for more than 3 decades before retiring in 2016), and there the job made him have suicidal tendencies. I could feel the behaviour seeping into my work as well. I soon realised that even if I work hard to promotion, nothing would made me get out of here. So I resigned, took a break, prepared for another exam and cleared it. Moving out of Lunchtime is probably the best decision I took in my life till present.",
        "You posted the comment thrice by mistake",
        "I'll try to keep it short...you are paid for 9-12 hours shift but you are working for 16-17 hours on a stretch 'normally'\n\nAnd yes there is nothing called as overtime in hotel industry.\n\nI used to stay in Thane, and worked at a 5 star at CSMT.\n\nThere were days when I worked for so long...hardly 2 hours to my next day shift...so there was no point in going back home.\n\n Hotel guys can relate... everyone has an extra pair of undergarments and towel etc in the locker..just in case..\n\n\nAnd payment is literally peanuts",
        "My opinion there are good managers. There are bad managers in every company to some extent.",
        "Build character ? Toughness ? \n\nI think we need to get rid of this thought process for a JOB ! A job should be where you work, and get paid your fair share and beyond your work hours your job can fuck right off. We are humans, not bloody coal waiting to be turned into a diamond.",
        "I agree. In my past two jobs, I joined under angels. Then something happened and they were allotted new roles. And I was put under literal demons. That has happened to me twice now. I absolutely hate it.",
        "Oh man where to begin about hotels in India. I did HM from Agra and worked for 2 years in a business hotel.in Bangalore. The hotel industry in India is Blue Collar AF. The starting pay is 12K and shifts are crazy. A lot of staff is older and who have been working at the same hotel and same position for decades and have a chip on their shoulders. That whole \"Aaj ke launde hame sikhange\". They forcefully take tips away from newbies and interns. Managers fucking eat in the restuarants themselves or would have banquet food but give the lower staff 15 minutes to go and have their meal ( which more often than not is shit). You may think chefs would get to make gourmet meals and shit but that's far from the reality, most of the times you're stuck peeling onion, carrot and doing basic mise en place and constantly face abuses from superiors. I remember this one intern who was in banquet service with me hadn't gotten a leave in 15 days and had gotten blisters on his feet. He just couldn't take it and said to hell with this and went home limping. The worst part is there is no fixed shift timings as well, you will do a morning shift on Monday which is like 7-5 and afternoon shift on Tuesday which is 2-11 and then do night shift on Wednesday. Fucks up your sleeping pattern completely. I could go on and on but the hotel industry in India needs serious reforms.",
        "My boss asks for help during his booty call . I wish i can expose it to his wife someday.",
        "Coding ninjas employees locked their employees up in the office",
        "😭",
        "I really liked how this video got viral. We all have such horrible people in our organisation and the top management ignore their behaviour because they are holding big position / important for the company from the aspects of money/profitability. Like the top boss of our plant is infamous for his verbal violence but at the same time he is able to bring down conversion cost per kg miraculously. Master of getting things done with minimal manpower. So obviously top management ignoring his abusive angry behaviour.",
        "This women % thing is happening in my company too. So I can relate. A male coworker had to do so much more, listens to verbal abuse, no words of praise, sacrifice the leaves. I am not against gender equality but management seriously need to look at it once more. I heard that they are doing this because of some benefits government will provide if you have certain amount of female staff. Don't know the reality.",
        "It hurts the gender dynamics. In adidas itself. After i was fired. An SLT member visited India and pointed out the lack of a lady cluster manager. The company went nuts and promoted a store manager who hadn’t completed 18 month(company policy was no promotion before 18 months) my male former colleagues and friends were informed of the opening, naturally they applied to receive a mock interview just to show that interviews were done and this woman was selected. Same happened with me they chose someone who didn’t have the experience and was at a lower designation than me. According to many sources I was the best choice internally and many who had applied for the position gave up after hearing that i had applied too. However they went with that lady. Who apparently took 6 months to learn the job. And she was trained by my colleagues and friends.",
        "Same to same things are happening in my organisation. We don't have any complaints whatsoever working under /with a competent female candidates but just for the sake of gender diversity these management guys are recruiting incompetent female staff that's something not justified.",
        "These Indian companies are run by frauds in Armani Suit. From execs to senior managers all are toxic because they lack creativity and imagination let alone any skills or tact. \n\nAnand Mahindra's insurance/loan company employees third party collection agent aka thugs who were recently in news because they ran a tractor on a farmer who couldn't repay his loan and killed him. All this bloody Anand Mahindra did was to on to Twitter and wrote how sorry he feels. And I'm pretty sure he sheepishly felt proud that it was only one such case. The rest are still profitable and in progress.\n\nThis needs to change. No wonder why some of us run to foreign countries for better opportunities and  skill recognition.",
        "Somebody tweet this to that Mahindra unkil.",
        "maybe he just hated his mother /jk",
        "Parasitic lowlives of planet earth",
        "Mf looks like a pig and screams like one too.",
        "Just think for a minute, my take would be completely different, what's the point of achieving such targets? For me, it is like exploiting the resources for things we have no demands for!\n\nThese managers will achieve their targets, they will get promotions and incentives. Company's market valuation will go up. After 30-40 years of service, what these slaves will get? Ghanta! Look at their mental and physical health, it's ruining day by day! \n\nWhat is the point of running the economy so fast when you have super smart govts who spends entire budgets on PR or on other things??\n\nThis chu manager doesn't know when we might get over due to his anger issue, sale ne pakka term insurance le rakha hoga!",
        "In 2014, I had faced this kind of abuse, where I was hired just out of college as a Graduate engineer Trainee in one of India's largest CV manufacturer. Little did I know as I was only 21. But this triggered me on a path to leave India for future career from that day. If you are young, just remember any guy shouting has no rights to treat you as a scumbag and it reflects only the company culture where at a position where he is because of the rotten leadership and toxic culture of bootlicking.",
        "Worked at HDFC Life for short time, At start of each month Manager(ACH) used to force us not to self login for attendance until we sold at least one policy every month. This was known to the top brass of the company and was recommended by them using the phrase \"Don't let them rest, make them uncomfortable\". In simple and plain words was a hell hole.",
        "There was literally a study posted about European colleges favouring female students more than male students gradings. It has started stunring the male students learning performance and making them drop out or fall behind!!!\n\nShit is insane. Boys are being punished for their gender.",
        "Wrong. The point is there are good CEOs and shit CEOs. \n\nThe shit ones reach targets shittingly. \n\nThe good ones are taken advantage of and never grow",
        "!Remind me 2 days",
        "I will be messaging you in 2 days on [**2023-06-08 21:24:24 UTC**](http://www.wolframalpha.com/input/?i=2023-06-08%2021:24:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/142b7ds/expose_your_terrible_bosses_and_organizations_a/jn68t8x/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F142b7ds%2Fexpose_your_terrible_bosses_and_organizations_a%2Fjn68t8x%2F%5D%0A%0ARemindMe%21%202023-06-08%2021%3A24%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20142b7ds)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        ">They are afraid of criticism and cannot expand their horizons.\n\n>They are afraid of questions and will create issues out of thin air.\n\nThe PM isnt afraid of criticism, he just doesn't like answering questions. And questions to the face aren't criticisms, news articles and OPEds are. PM isn't exactly controlling the press lol. You can either control the press or evade it, not both at same time.\n\nAlso, issues out of thin air? Somehow this feels like a weird criticism. He does make a mountain of a mole hill, sure. But Thin air?",
        "There is no such thing as \"fair share\" for pay. You will be paid your market value for your labour. Universal basic income is also not exactly fair share pay. It's a completely different logic of fair pay for survival in society. Again, no such thing as fair share of pay. \n\n>We are humans,\n\nJobs are also careers. Your logic applies only when you will  be in same job for your whole life. Nobody wants that without UBI which actually grows according to inflation, which it never does. Since we are in a country which is really really far away from UBI system, you have no choice if you want to build a career out of the job.",
        "Blameless culture is so important. It fosters an office culture with much less politics.",
        "I'm in Canada and there's a group of us that play cricket. A lot of people who play with me are people who are over 30. And a lot of them made really good money in india(2-3L) per month but the reason they left is because of work culture. Over here unless you work for desis, people don't even call you when you're done with work or during the weekend.",
        "My friend worked at Oberoi group as the front desk and eventually guest manager for about 4 years. He's told me horror stories about it.\n\nOnce he was arrested for asking a noisy, drunk guest who was creating a ruckus after his prostitute left to be quiet. Guy was an MLA and called the cops on him!",
        "Morals are for the poor or the powerless.",
        "That is cheap way to sell term insurance",
        "Because all companies have one or two bad apples. Everyone knows them and remembers being bruised by their behavior.  No one will remember the  good ones who treated their team with respect and compassion.",
        "I remember a while back someone had posted a video of their manager at Byjus insulting them, insulting their family, in ways I wouldnt treat a stranger let alone a colleague.\n\nByju's took the very considerate path of.... DMCA takedown of every place that video was ever posted on the net.\n\nI dont think it exists anywhere now despite being all over the net for a week.\n\nEDIT: Reddit post which was taken down by DMCA\n* https://www.reddit.com/r/india/comments/gdszm3/byjus_manager_abuses_bda_in_worst_manner_possible/",
        "TBH that's the reason people should buy term insurance. And it's not exactly expensive like regular insurance",
        "I'm just joining the corporate world, honestly while watching such videos I always feel ki these guys getting scolded are adults who need to show some self respect and stand up against this toxicity.\n\n I'd like some explanation on this. Apart from salary threats, what makes them feel that it's easier to stay quiet and let it affect their mental health day after day?",
        "Government IT contract- manager would bark like a dog at new hires.\n\nWith most jobs like this, daily wage, gig or contract office jobs should not be devalued. Expecting you to be locked into toxic arrangements for years is simply wanting locked up slaves.",
        "Societal pressure for big name office jobs, family unreasonably burdening you etc.",
        "Insurance companies are big leeches that keep blood even if they become fat.",
        "It's addiction for hoarding resources by the 1%.",
        "This is horrible and needs a giant strike.",
        "Plot of The Apartment",
        "Congrats, what do you do now ?",
        "Chefs working in toxic environments is a universal thing. Not restricted to India. \n\nThat said, I can imagine how an Indian work environment would just make things much worse.",
        "Chief street mugger",
        "You'll be locked in our Chernobyl branch",
        "This takes the cake.",
        "Every brand I guess. and truck owners and truck drivers are another type toxic jerks. Everyday is stress and struggle.",
        "If they complain, they'll be the ones who will be fired. They'll be the ones who won't get experience letters. The manager will sully their names in the market. They will have to explain their sudden departure to the next company. \n\n\nAnd most people have liabilities - cos of the liabilities they are unable to quit.",
        "When Jio launched I was a part of a pan india project with them \n\nMy colleagues used to travel long distances from suburban towns to the city where coming and going back to home took almost 6 hours daily \n\nOne day a guy while working fell asleep in his chair \n\nThere was a guy jitender mahapatra who was big shot in reliance literally went to the guy kicked his chair and started screaming at him as if he had done a big immense crime \n\nThe guy rose folded his hands and left the office never saw him again \n\nDon't know why but felt happiness in my heart for the actions of the day \n\nA silent effective slap on the management",
        "This is a Xerox copy of multiple experiences in my career.",
        "The good ones are always remembered. That is not true. Any time I've joined under a great manager, I've been told that by everyone on the floor.",
        ">ACH\n\nWere you in the Agency channel?",
        "Most comments here range from IBFC to insurances, I've had my luck and life tested working for our in-house twitter giveaway legend who uses his surname on cars, when covid stuck, we were not even given any WFH, from very next day we were asked to report to work or be fired. Ofcourse higher-ups knew this and never set foot in office till late 2022 !. Add to this global semiconductor shortage and excruciating long work hours. \n\nI remember having to stay hungry without any food for whole day because all shops were closed and workplace had no arrangement for lunch either.\n\nAfter working for 3.5yrs and getting COVID+ TWICE !, we were simply given PIP because they wanted to reduce workforce. Yearly hikes were an amazing 2-4% because of business slowdown (while execs kept raising stock prices). Neither you could switch because Auto sector is not that well paid.\n\nJust writing this makes my blood boil. I hope you know why your \"*surname MUV800\"* cars are cheap, because they were paid by us engineers who worked all though covid and never got paid for our efforts anyway.",
        "Glad someone pointed out the shit going on in public sector banks these days... Our previous generation enjoyed this job as job for life but after Modi, government's every xyz scheme is routed through banks which means chaos, redtapism, bootlicking, stress, long hours, zero personal life in the name of sarkari Naukri... People nowadays don't respect bankers and even the hardworking staff bears the brunt of the prejudice. I had a GM literally say that those who do not have babies yet should refrain for next two years(his tenure) on the day he joined and this who have babies should find creche services coz everybody should forget that they have a family for next 2 years... He till date is the most hated boss I've come across, people worked 9-9 every day with no appreciation, would publicly slam people by saying free ki salary lene me sharam nahi aati, once he was at some conference where he would hand over the award for good performance and then say it loud you don't deserve this free ki salary le rahe ho sharam karo... I worked for IT/BPO and was lured into this in the name of sarkari but God knows I feel like resigning every morning, changing job is also not an option coz I don't have the calibre for today's competition for any other govt job",
        "Can someone share exp in Biocon? I have family who worked there in 2013-2015 ran away because of abusive bosses. Now in 2023 a guy in my PG is upset about getting berated everyday by his boss there. \n\nFrom what he tells me because it's a big brand people suffer the abuse for sometime so they get the name on their resume. Has nothing changed?",
        "Yea lets gooo .. expose all of these mfs",
        "This is actually shocking for me as a 22 year old starting his career. A few years ago I was on track to do my engineering and MBA and whatnot but decided against it because I was always passionate about photography and cinematography. I did my degree in it and today I work as a freelancer so my earnings can vary between 25-50k depending on how many projects I can get. Sometimes I see my friends working in Microsoft or Google right out of college or moving to the states to work and I do think if I made the right choice of getting into working in the entertainment industry and honestly, I think I've made the right choice for myself. \nIf y'all have any views, I'll love to get some perspective on this.",
        "ESIC",
        "Yes in Agency channel.",
        "This is the real reason bosses want people to work from office",
        "Help needed to share audio clip from HDFC VP who also abused employees.. i don't know how to do it i have the clip and his details",
        "Can anyone translate what he was saying in the video?",
        "Hoo boy! You trigerred PTSD in me about this topic. Where do I start? Let's go with the bad ones first:\n\nYours truly - IT consultant and general busy body who can talk multiple languages and weasel myself into talking to both low level as well as management folks. Worked on a lot of sarkaari IT projects.\n\nNIC/C-DAC and other state owned IT - crap pay for engineers, abusive managers, crap culture, ass kissing, bootlicking, nepotism, corruption, technology stuck 10-20 years behind. You will be surprised at the budgets these companies get and the payscales for management, and it is astounding any big project gets done at all. Hire some talented UI/UX designers you lazy, incompetent fuckers!\n\nIOB/SBI/Canara and all the chota PSB banks - the worst of the lot. fail to adapt to modern consumer needs and IT infra running on creaking old HW and software. The only gig where I actually wanted to climb into the old ancient HW and stick my neck into the huge ass fans and kill myself. 16 hour work days, abuse, psychological manipulation, psychopathic managers, overworked staff. Fixed cost projects spell DOOM! One manager actually physically assaulted an employee for typing in a wrong command that fucked up the network config. They keep posting non-native people to branches where most of the staff and customers do not speak the same language. I feel sorry for the Infys, TCS, HCLs and other services companies that have to work on these projects - it has failure written on them even before the project starts.\n\nThe good ones:\n\nYou may be surprised, or may be I just got lucky with these - YMMV:\n\nBEL Bangalore - chill as fuck 9-5 job, but 6 day work week. culture still stuck in the 1980s, but most of the old unkills have been forced to retire. No pressure to deliver anything, and they work on big complex products and projects. Ass kissing exists, but by and large they leave the employees alone. There are lot of women in leadership positions, maybe that;s why the culture is like this. Hire more women in management!\n\nISRO -  No suprise here. Culture used to be even better, but culture trickles down from the top. Mostly solid engineers in the top, and it tells. Surprisingly sophisticated for a sarkari company, but APJ and Seshan left a legacy of excellence and getting the job done.",
        "Post it on YouTube and then post the YouTube link here.",
        "Few years back, Agency was a dying channel - high costs and low revenue. There were rumors that top management was thinking of shutting down Agency permanently and getting rid of everyone. The Agency leadership was desperate on hold onto their careers and that's when such culture became widespread.\n\nFunnily, Agency has recovered recently and is doing well. A big reason for that was the new agency head, who cut down on the sales pressure and focused more on agent recruitment. Getting good quality agents turned out to be the key to becoming profitable.",
        "Hey,man. I shot you a DM, could you please check that?",
        " I am here to share my recent work experience in an edtech company, which unfortunately turned out to be quite disheartening and challenging. I believe it is important to express my thoughts and feelings in order to process and reflect upon the negative aspects of my time there.\n\nOne of the primary issues I encountered was the exceptionally long hours I was expected to work. The demands of the job often extended far beyond the typical 9-to-5 schedule, leaving me with little personal time or opportunities for rest and rejuvenation. This imbalance between work and personal life took a toll on my well-being and overall job satisfaction.\n\nMoreover, I had the misfortune of working under a manager who fostered a toxic work environment. Their constant shouting and aggressive demeanor created an atmosphere filled with tension and anxiety. The relentless pressure to achieve sales targets, coupled with the manager's unreasonable expectations, made it challenging to thrive in such an environment. It became increasingly difficult to maintain a positive mindset and motivation to excel when faced with such excessive stress.\n\nUnfortunately, the negative impact of these circumstances extended beyond my professional life, affecting my overall mental and emotional well-being. The constant barrage of pressure and hostility took a toll on my confidence and self-esteem, leaving me feeling devalued and demotivated. I left for good and thats been the best decision of my life.",
        "If any company requires a GPTW certification, it means they weren't able to achieve it naturally. Hence have to prove that they are good.",
        "As a Manager my self, i would love to share this thread to my team as sometimes these idiots try to walk all over me and I have to show them their place. I wish I had a manager like myself when I started off.. uff",
        "My manager lost a 100 headcount project. In this market, you think he would be fired. But no, he was rewarded with a promotion & 20% increment.\n\nMeanwhile, I worked hard in the same project and got funding for 5 more heads. I got a grand total increment of 3% coz that's the \"HR policy\".",
        "Only when organising Anktakshri on weekends.",
        "HR does not play any significant role as far as I know. I worked only 13 months, so my experience is limited. One of the worst job I ever did. I loose my shit when I had an urgent work and I told my manager in advance that I will log out at 8 pm to visit a doctor. He shouted at me when at 7:55 I reminded him that I will log out. I had already worked 9 hours that day, so it was not like I was logging early. I resigned in same month later.",
        "Hyundai dealership same story.",
        "During one of my old jobs, my grandpa had died very unexpectedly. I told my boss that I would be gone Friday-Sunday for the funeral, since he lived in a different state. Sunday comes by, and it's clear by all the traffic and such that we wouldn't make it home until 10 AM at the earliest, since we drove. I texted my boss to tell him that I wouldn't make it until 10 AM on Monday instead of 7 AM on Monday. This somehow offended him as he sent a long angry text telling me that I had only requested Friday through Sunday off and how selfish and lazy I was for not telling him before that I would need Monday off. But he also made sure to mention that he wouldn't have given me Monday off anyway because several people had already gotten Monday off and he needed me in. I had to explain that it is physically impossible for me to get there on time. He told me to hurry up and come in anyway. I was very new to the workforce so I did. But because I couldn't sleep on the whole drive home I got very sick and passed out during work. He then fired me for not being \"professional\" enough or whatever. And this is quite strange to me because this was at a Mormon warehouse, the same people who claim to be the friendliest kind of people. \\[I would know, I grew up surrounded by Mormons\\]"
    ],
    "cleaned_text": "expose terrible bosses organizations follow hdfc video place vent share story video gone viral im sure isnt breaking news seasoned salespeople country personally gone something like since start sales career years ago ive always bb sales considered respectable generally time name shame current previous organizations allow kind behaviour ill go first surprises reliance jio infocomm limited absolutely terrible work culture days week start bosses terrible top bottom treated like number person hr non existent tenure jio heard hr training days shouting see hdfc video daily life manager used threaten us salary holds pips terminations daily start keeping track pip threats averaging per day shouting rage issues shouted bb clients mean would hold back team anyone looking join reliance jio favour dont ",
    "cleaned_title": "expose terrible bosses organizations follow hdfc video place vent share story",
    "cleaned_selftext": "video gone viral im sure isnt breaking news seasoned salespeople country personally gone something like since start sales career years ago ive always bb sales considered respectable generally time name shame current previous organizations allow kind behaviour ill go first surprises reliance jio infocomm limited absolutely terrible work culture days week start bosses terrible top bottom treated like number person hr non existent tenure jio heard hr training days shouting see hdfc video daily life manager used threaten us salary holds pips terminations daily start keeping track pip threats averaging per day shouting rage issues shouted bb clients mean would hold back team anyone looking join reliance jio favour dont",
    "cleaned_comments": "anyone looking join reliance jio favour dont ca join get crazy good package use join elsewhere vouch op says shouting happened even pandemic pathetic note ril employees legit died work call teamboss pressure insane try jugaad looooong time rather say buying new tech ril employees legit died work call teamboss case filed lead bosses asking people attend work calls office know cases pandemic one rcp yelling gaali galoch super common though relative mine lots stories like op mentioned people upper management foul mouth use really bad words sometimes even front employees yea top thing manager used get shouted like manager manager also got shouted way way top difference frequency us multiple times daily weekly monthly thats feel great places work awards sham every place ive worked awards case filed people legit lost lives better resign lose job cases spouse given job position sort make loss family doesnt bother filing complaints employees know though know many go way comfort people get yelled rude behaviour employees friend joined tcsbcom grad working hours punch still remain office till pm overtime payment applying leave u wont get ur choice u take leave days provide managers used come late left taking days leave every working days left months would anybody want work employer responsible death disturbing sah see stdg sa sa sa sa sazszxccrssddxgaasscssassssysssf zes dddd sa cd cd cd zzasszczs cas paid meow many times man sole breadwinner family theres family friend know dependents wifekidsparents uncle aunt looks lpa toxic companies took advantage situation litigation could cause pain guarantee winning companies would able hire topmost lawyers name shame even media bothered nowadays true sadly naming shaming wont help companies strict employees offline digital presence especially janhavi gadkar case funny thing hdfc acting know happening righteous internally must like phew one video got banks phew one case company like tcs work culture largely depends project manager hr policies pretty robust soon case reaches hr gets resolved pretty way worked yrs luckily chillest boss plus would get paid ot allowances comp offs even couple hours time earned many comp offs time left tcs earned leaves could encash vehicle dealership especially trucks another hell holes icici way worse adidas india marketing private ltd lets delve cesspool toxic boss culture questionable hiring practices mean seriously right mind thinks good idea hire people higher positions place lower positions talk demoralizing squashing hopes internal promotions lets forget amazing decisionmaking covid pandemic rest world struggling thought would brilliant idea extend working week five days six oh revenue staff limited right well guess backend team still working five days week way prioritize create divide among employees lets talk fantastic response dared voice concerns take constructive feedback nope instead canceled transfer promotion add insult injury blacklisted future transfers region hows valuing employee opinions fostering supportive work environment wait theres team audacity complain superboss confidentiality adidas india retaliated put blame squarely shoulders end result fired assistant manager oh sweet playing role sweettalking overly caring snakes grass lets forget incredible commitment diversity inclusion instead hiring qualified experienced candidates blindly hire female staff increase womens percentage cares competence expertise right numbers appearances regardless impact overall team dynamics productivity folks adidas india marketing private ltd toxic boss culture questionable hiring practices retaliation prioritizing numbers talent name game tldr adidas india marketing private ltd toxic boss culture questionable hiring practices retaliates employees voice concerns extended working week covid canceled promotions blacklisted transfers fired assistant manager also prioritize hiring relatively inexperienced women experienced male candidates great place work know going get downvoted sharing reality still really first time majority people becoming aware situations situations like common types sales service related jobs family member relative works sales job ask regarding get know lot situations never brought light best done employee ask change manager one screaming manager bring results profits xyz company bank way works company benefits bank wont fire start beating someone like think would random number xyz bank call asking want take loans credit cards debit cards sell insurance every week month socalled callers mostly job paid number people call day dont meet target callers also scolded managers scammers well people careful sometimes people get scammed similarly also see many people malls electronic shops telling share contact numbers asking managers told take note done numbers people talk managers might also screaming reports made everyday field jobs send checklist whether succeeded completing minimum quota talking people agree managers great helpful also find others like one videos even good manager might scream person due frustration things obviously wrong mentally hurtful surprised people surprised gosh thats bad feeling given enough time well end naming companies operate india thread mahindra small stint reeliance insurance used target poor families hosting drawing competition poor schools letting parents know kid award poor gullible parents used come reliance office would pitched term insurance product speech would like die today whos gon na support family etc etc used scare poor families felt scam taking advantage poor families quit within month pay lot switch companies able match salary hence retention rate high also ruin credibility market especially mine sharing terrible feedback making difficult find job one surprised first time open like need keep momentum share incidents like regularly need collect evidence put public sphere thats way ever get resolution depend hr take matters hands sake future generations otherwise bullshit continue need rbossfreakout thats really bad man hope get something better try join hotels youll glad youre stuck corporates especially youre chef looks like maharashtra north india work culture bauji culture hr baujis lapdog bauji doesnt shit keeps tab coming foing odc also everything else company absolutely shit north friend worked ihcl months guy stood unmoved like rock mother undergoing cancer treatment couldnt withstand hotel industry yes people need aware exploitation done hotels working hours day breaks offs cuts burns bruises pay like peanuts positive makes tough battle hardened wish mediaindustry changes good worked tech mahindra system admin boss project manager joined work covid outbreak happened even course covid go office soon may cause business affected even nightmare working guy understand covid going toxic af even team managers endure year cause one else hiring time want lose current job thankfully got good company treats well even fuckupsmore recent one cost company like lakh rupees would try figure solution see happened instead blaming screaming luckily good paying skills im well yes terrible thanks mate agree brother left prestigious taj mumbai supervisors treated hes well need something terrible value good organization named impact guru head glassdoor learn ive worked worked several managers years good helping majority go neutral ofcourse bad apples mostly managers technically suck act aholes cant understand developer saying show power somehow well hotels say taj one better brands atleast treat better brands work brutal cant name unfortunately although id reckon hotels build character toughness teach much book fancy school anybody hotel industry yes khud ka dukh sabko hi bada lagta hai hotel industry might look really glamorous outside get hang celebrities good positionyou get try cuisines organizations expense n blah blah however less discussed hotel industry really toxic someone please share first hand experience used work pvt teacher giving classes daily peanuts boss told wasnt good enough job fired months currently working govt organization contract curious pressure gets put chef make dishes faster thats least things bother us friend mine used work icici rm paid peanuts like k pm mba good institute secondly used daily morning calls rbh ulip commits asked use trick book sell ulips access every customers entire history fact even made post years ago asked use info sell ulip prepaid brokerage extreme incident female rm asked manager go sleep client get sale recorded reported manager fired multiple incidents rm hadnt met commit manager would call pm ask travel branch side city like say navi mumbai theyd asked go south bombay call manager theyd call manager manager would ask go home daily tactic apparently three commit calls happened every day basically abuse friend quit within one year joined consulting firm hours much longer one ever treated like slave accenture bad gets expected know everything call almost hrs day lot work taking leave nightmare plus manager shouted us daily basis luckily able switch within year jio indeed horrible also soul crushing experience manager harassing letting leave team either whole thing imploded intense shouting contest get mate brother worked taj told us slapped verbally abused supervisor though told us much later otherwise would broken supervisors bone makes mad dad refers lalaism lala culture establishments potential growth owners bosses narrow minded people stick rules afraid criticism expand horizons afraid questions create issues thin air reminds someone delhi oh yeah thats pm also im guessing quite good compared nonit people reading comments makes appreciate manager work life balance group accenture location group accenture location paging uicicibank behaviour whats bauji man whats bauji man atci working cloud migration architect bangalore strange everyone talks hr powerful sbi working branch office difficult aspects improper internet connectivity location size branch even road reach branch manager asshole would give every work delegate work another clerk could reduced stress overall would stay late leave branch late driving back village lived tough almost questioning existence branch also nd th sat sunday fucked lot life personally professionally learnt clerk working another organisation father worked decades retiring job made suicidal tendencies could feel behaviour seeping work well soon realised even work hard promotion nothing would made get resigned took break prepared another exam cleared moving lunchtime probably best decision took life till present sbi working branch office difficult aspects improper internet connectivity location size branch even road reach branch manager asshole would give every work delegate work another clerk could reduced stress overall would stay late leave branch late driving back village lived tough almost questioning existence branch also nd th sat sunday fucked lot life personally professionally learnt clerk working another organisation father worked decades retiring job made suicidal tendencies could feel behaviour seeping work well soon realised even work hard promotion nothing would made get resigned took break prepared another exam cleared moving lunchtime probably best decision took life till present sbi working branch office difficult aspects improper internet connectivity location size branch even road reach branch manager asshole would give every work delegate work another clerk could reduced stress overall would stay late leave branch late driving back village lived tough almost questioning existence branch also nd th sat sunday fucked lot life personally professionally learnt clerk working another organisation father worked decades retiring job made suicidal tendencies could feel behaviour seeping work well soon realised even work hard promotion nothing would made get resigned took break prepared another exam cleared moving lunchtime probably best decision took life till present posted comment thrice mistake ill try keep shortyou paid hours shift working hours stretch normally yes nothing called overtime hotel industry used stay thane worked star csmt days worked longhardly hours next day shiftso point going back home hotel guys relate everyone extra pair undergarments towel etc lockerjust case payment literally peanuts opinion good managers bad managers every company extent build character toughness think need get rid thought process job job work get paid fair share beyond work hours job fuck right humans bloody coal waiting turned diamond agree past two jobs joined angels something happened allotted new roles put literal demons happened twice absolutely hate oh man begin hotels india hm agra worked years business hotelin bangalore hotel industry india blue collar af starting pay k shifts crazy lot staff older working hotel position decades chip shoulders whole aaj ke launde hame sikhange forcefully take tips away newbies interns managers fucking eat restuarants would banquet food give lower staff minutes go meal often shit may think chefs would get make gourmet meals shit thats far reality times youre stuck peeling onion carrot basic mise en place constantly face abuses superiors remember one intern banquet service hadnt gotten leave days gotten blisters feet couldnt take said hell went home limping worst part fixed shift timings well morning shift monday like afternoon shift tuesday night shift wednesday fucks sleeping pattern completely could go hotel industry india needs serious reforms boss asks help booty call wish expose wife someday coding ninjas employees locked employees office really liked video got viral horrible people organisation top management ignore behaviour holding big position important company aspects moneyprofitability like top boss plant infamous verbal violence time able bring conversion cost per kg miraculously master getting things done minimal manpower obviously top management ignoring abusive angry behaviour women thing happening company relate male coworker much listens verbal abuse words praise sacrifice leaves gender equality management seriously need look heard benefits government provide certain amount female staff dont know reality hurts gender dynamics adidas fired slt member visited india pointed lack lady cluster manager company went nuts promoted store manager hadnt completed monthcompany policy promotion months male former colleagues friends informed opening naturally applied receive mock interview show interviews done woman selected happened chose someone didnt experience lower designation according many sources best choice internally many applied position gave hearing applied however went lady apparently took months learn job trained colleagues friends things happening organisation dont complaints whatsoever working competent female candidates sake gender diversity management guys recruiting incompetent female staff thats something justified indian companies run frauds armani suit execs senior managers toxic lack creativity imagination let alone skills tact anand mahindras insuranceloan company employees third party collection agent aka thugs recently news ran tractor farmer couldnt repay loan killed bloody anand mahindra twitter wrote sorry feels im pretty sure sheepishly felt proud one case rest still profitable progress needs change wonder us run foreign countries better opportunities skill recognition somebody tweet mahindra unkil maybe hated mother jk parasitic lowlives planet earth mf looks like pig screams like one think minute take would completely different whats point achieving targets like exploiting resources things demands managers achieve targets get promotions incentives companys market valuation go years service slaves get ghanta look mental physical health ruining day day point running economy fast super smart govts spends entire budgets pr things chu manager doesnt know might get due anger issue sale ne pakka term insurance le rakha hoga faced kind abuse hired college graduate engineer trainee one indias largest cv manufacturer little know triggered path leave india future career day young remember guy shouting rights treat scumbag reflects company culture position rotten leadership toxic culture bootlicking worked hdfc life short time start month managerach used force us self login attendance sold least one policy every month known top brass company recommended using phrase dont let rest make uncomfortable simple plain words hell hole literally study posted european colleges favouring female students male students gradings started stunring male students learning performance making drop fall behind shit insane boys punished gender wrong point good ceos shit ceos shit ones reach targets shittingly good ones taken advantage never grow remind days messaging days utchttpwwwwolframalphacominputiutctolocaltime remind linkhttpswwwredditcomrindiacommentsbdsexposeyourterriblebossesandorganizationsajntxcontext click linkhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessagebhttpsaffwwwredditcomfrfindiafcommentsfbdsfexposeyourterriblebossesandorganizationsafjntxfdaaremindmeaautc send pm also reminded reduce spam parent commenter delete message hide othershttpswwwredditcommessagecomposetoremindmebotsubjectdeletecommentmessagedeletebds infohttpswwwredditcomrremindmebotcommentsebkoremindmebotinfovcustomhttpswwwredditcommessagecomposetoremindmebotsubjectremindermessageblinkormessageinsidesquarebracketsdaaremindmetimeperiodhereyour remindershttpswwwredditcommessagecomposetoremindmebotsubjectlistofremindersmessagemyremindersfeedbackhttpswwwredditcommessagecomposetowatchfulsubjectremindmebotfeedback afraid criticism expand horizons afraid questions create issues thin air pm isnt afraid criticism doesnt like answering questions questions face arent criticisms news articles opeds pm isnt exactly controlling press lol either control press evade time also issues thin air somehow feels like weird criticism make mountain mole hill sure thin air thing fair share pay paid market value labour universal basic income also exactly fair share pay completely different logic fair pay survival society thing fair share pay humans jobs also careers logic applies job whole life nobody wants without ubi actually grows according inflation never since country really really far away ubi system choice want build career job blameless culture important fosters office culture much less politics im canada theres group us play cricket lot people play people lot made really good money indial per month reason left work culture unless work desis people dont even call youre done work weekend friend worked oberoi group front desk eventually guest manager years hes told horror stories arrested asking noisy drunk guest creating ruckus prostitute left quiet guy mla called cops morals poor powerless cheap way sell term insurance companies one two bad apples everyone knows remembers bruised behavior one remember good ones treated team respect compassion remember back someone posted video manager byjus insulting insulting family ways wouldnt treat stranger let alone colleague byjus took considerate path dmca takedown every place video ever posted net dont think exists anywhere despite net week edit reddit post taken dmca tbh thats reason people buy term insurance exactly expensive like regular insurance im joining corporate world honestly watching videos always feel ki guys getting scolded adults need show self respect stand toxicity id like explanation apart salary threats makes feel easier stay quiet let affect mental health day day government contract manager would bark like dog new hires jobs like daily wage gig contract office jobs devalued expecting locked toxic arrangements years simply wanting locked slaves societal pressure big name office jobs family unreasonably burdening etc insurance companies big leeches keep blood even become fat addiction hoarding resources horrible needs giant strike plot apartment congrats chefs working toxic environments universal thing restricted india said imagine indian work environment would make things much worse chief street mugger youll locked chernobyl branch takes cake every brand guess truck owners truck drivers another type toxic jerks everyday stress struggle complain theyll ones fired theyll ones wont get experience letters manager sully names market explain sudden departure next company people liabilities cos liabilities unable quit jio launched part pan india project colleagues used travel long distances suburban towns city coming going back home took almost hours daily one day guy working fell asleep chair guy jitender mahapatra big shot reliance literally went guy kicked chair started screaming done big immense crime guy rose folded hands left office never saw dont know felt happiness heart actions day silent effective slap management xerox copy multiple experiences career good ones always remembered true time ive joined great manager ive told everyone floor ach agency channel comments range ibfc insurances ive luck life tested working inhouse twitter giveaway legend uses surname cars covid stuck even given wfh next day asked report work fired ofcourse higherups knew never set foot office till late add global semiconductor shortage excruciating long work hours remember stay hungry without food whole day shops closed workplace arrangement lunch either working yrs getting covid twice simply given pip wanted reduce workforce yearly hikes amazing business slowdown execs kept raising stock prices neither could switch auto sector well paid writing makes blood boil hope know surname muv cars cheap paid us engineers worked though covid never got paid efforts anyway glad someone pointed shit going public sector banks days previous generation enjoyed job job life modi governments every xyz scheme routed banks means chaos redtapism bootlicking stress long hours zero personal life name sarkari naukri people nowadays dont respect bankers even hardworking staff bears brunt prejudice gm literally say babies yet refrain next two yearshis tenure day joined babies find creche services coz everybody forget family next years till date hated boss ive come across people worked every day appreciation would publicly slam people saying free ki salary lene sharam nahi aati conference would hand award good performance say loud dont deserve free ki salary le rahe ho sharam karo worked itbpo lured name sarkari god knows feel like resigning every morning changing job also option coz dont calibre todays competition govt job someone share exp biocon family worked ran away abusive bosses guy pg upset getting berated everyday boss tells big brand people suffer abuse sometime get name resume nothing changed yea lets gooo expose mfs actually shocking year old starting career years ago track engineering mba whatnot decided always passionate photography cinematography degree today work freelancer earnings vary k depending many projects get sometimes see friends working microsoft google right college moving states work think made right choice getting working entertainment industry honestly think ive made right choice yall views ill love get perspective esic yes agency channel real reason bosses want people work office help needed share audio clip hdfc vp also abused employees dont know clip details anyone translate saying video hoo boy trigerred ptsd topic start lets go bad ones first truly consultant general busy body talk multiple languages weasel talking low level well management folks worked lot sarkaari projects niccdac state owned crap pay engineers abusive managers crap culture ass kissing bootlicking nepotism corruption technology stuck years behind surprised budgets companies get payscales management astounding big project gets done hire talented uiux designers lazy incompetent fuckers iobsbicanara chota psb banks worst lot fail adapt modern consumer needs infra running creaking old hw software gig actually wanted climb old ancient hw stick neck huge ass fans kill hour work days abuse psychological manipulation psychopathic managers overworked staff fixed cost projects spell doom one manager actually physically assaulted employee typing wrong command fucked network config keep posting nonnative people branches staff customers speak language feel sorry infys tcs hcls services companies work projects failure written even project starts good ones may surprised may got lucky ymmv bel bangalore chill fuck job day work week culture still stuck old unkills forced retire pressure deliver anything work big complex products projects ass kissing exists large leave employees alone lot women leadership positions maybe thats culture like hire women management isro suprise culture used even better culture trickles top mostly solid engineers top tells surprisingly sophisticated sarkari company apj seshan left legacy excellence getting job done post youtube post youtube link years back agency dying channel high costs low revenue rumors top management thinking shutting agency permanently getting rid everyone agency leadership desperate hold onto careers thats culture became widespread funnily agency recovered recently well big reason new agency head cut sales pressure focused agent recruitment getting good quality agents turned key becoming profitable heyman shot dm could please check share recent work experience edtech company unfortunately turned quite disheartening challenging believe important express thoughts feelings order process reflect upon negative aspects time one primary issues encountered exceptionally long hours expected work demands job often extended far beyond typical schedule leaving little personal time opportunities rest rejuvenation imbalance work personal life took toll wellbeing overall job satisfaction moreover misfortune working manager fostered toxic work environment constant shouting aggressive demeanor created atmosphere filled tension anxiety relentless pressure achieve sales targets coupled managers unreasonable expectations made challenging thrive environment became increasingly difficult maintain positive mindset motivation excel faced excessive stress unfortunately negative impact circumstances extended beyond professional life affecting overall mental emotional wellbeing constant barrage pressure hostility took toll confidence selfesteem leaving feeling devalued demotivated left good thats best decision life company requires gptw certification means werent able achieve naturally hence prove good manager self would love share thread team sometimes idiots try walk show place wish manager like started uff manager lost headcount project market think would fired rewarded promotion increment meanwhile worked hard project got funding heads got grand total increment coz thats hr policy organising anktakshri weekends hr play significant role far know worked months experience limited one worst job ever loose shit urgent work told manager advance log pm visit doctor shouted reminded log already worked hours day like logging early resigned month later hyundai dealership story one old jobs grandpa died unexpectedly told boss would gone fridaysunday funeral since lived different state sunday comes clear traffic wouldnt make home earliest since drove texted boss tell wouldnt make monday instead monday somehow offended sent long angry text telling requested friday sunday selfish lazy telling would need monday also made sure mention wouldnt given monday anyway several people already gotten monday needed explain physically impossible get time told hurry come anyway new workforce couldnt sleep whole drive home got sick passed work fired professional enough whatever quite strange mormon warehouse people claim friendliest kind people would know grew surrounded mormons",
    "light_cleaned_title": "Expose your terrible bosses and organizations - a follow up to the HDFC video. A place to vent and share your story.",
    "light_cleaned_selftext": "This video has gone viral. I'm sure that this isn't breaking news for seasoned salespeople in this country. I personally have gone through something like this since the start of my sales career some 7 years ago. And I've always been in B2B sales which is considered more respectable generally. So it is time to name and shame our current and previous organizations that allow for this kind of behaviour. I'll go first: No surprises here - Reliance Jio Infocomm Limited Absolutely terrible work culture. 6 days a week to start with. Bosses are terrible from top to bottom. You are treated like a number not a person. HR is non existent. During my tenure at Jio, I heard from HR only once, during my training days. The shouting that you see in the HDFC video - that was daily life for me. My manager used to threaten us with salary holds and PIPs and terminations daily. I had to start keeping track of the PIP threats. He was averaging 5/6 per day. As for the shouting - he had rage issues. He shouted at our B2B clients. I mean then why would he hold back on his team. If there is anyone looking to join Reliance Jio - do yourself a favour, don't.",
    "light_cleaned_comments": ">If there is anyone looking to join Reliance Jio - do yourself a favour, don't. ++++ Or if you are a CA, join and get a crazy good package and use that to join elsewhere. Can vouch for what OP says about shouting, it happened even during the pandemic, it is pathetic. On that note, there have been some RIL employees who legit died at work or while being on call with their team/boss. The pressure is insane and they try to jugaad for a looooong time rather than say buying new tech. >RIL employees who legit died at work or while being on call with their team/boss. What? Is there a case filed? No, but that did lead to some bosses asking people not to attend work calls when they are out of the office. I know 2 such cases, but those were before the pandemic. One was at RCP itself. The yelling and gaali galoch is super common though. This relative of mine has lots of stories like op mentioned. Some people in the upper management have a very foul mouth and they use really very bad words, sometimes even in front of other employees. Yea it's a top down thing. My manager used to get shouted at like that by his manager. His manager also got shouted at the same way. All the way to the top. The only difference is the frequency. For us it was multiple times daily. For some its weekly. For some monthly. But its the same. Thats why I feel all those \"Great Places To Work\" awards are a sham - every place I've worked at has had those awards 😂😂😂😂 Why was the case not filed? People legit lost their lives. Better to resign and lose a job than this. In such cases, the spouse is given some job position to sort of make up for the loss. So, the family doesn't bother filing any complaints. But the employees know though, they know and many will go out of their way to comfort people who get yelled at. What about rude behaviour by employees? I had a friend who joined tcs(bcom grad). 9-5 working hours. Had to punch out at 5 but still have to remain in office till 7pm. No overtime payment. Applying for leave, u won't get any of ur choice. U can take the leave on days we provide. While the managers used to come late by 10 and left at 5, all while taking 1-2 days leave every 7-8 working days. She left after 6 months. Why would anybody want to work for an employer who was responsible for their death? This is just disturbing. SAh was see s but stdg sa sa sa sa sazszx\"'ccrssddxgaasscssassssysssf zes s s dddd sa a CD CD CD zz*asszczs What are CAs paid there? Meow? It is, but many times the man is the sole breadwinner in the family. There's this family friend I know who had 6 dependents - wife+kids+parents (2)+uncle & aunt He looks after all of them 11-15LPA These toxic companies took advantage of their situation. Litigation could only cause more pain with no guarantee of winning as these companies would be able to hire the topmost lawyers. Can only name and shame but even media is not too bothered now-a-days. That is very true, sadly. Naming and shaming won't help and companies are very strict with employees' offline & digital presence now. Especially after the Janhavi Gadkar case. Funny thing here is HDFC acting as if they did not know any of these were happening and being all righteous. Internally they must be like phew only one video got out! Other banks - phew it was not one of ours! But in case of a company like Tcs, your work culture largely depends on your project and your manager. Their HR policies are pretty robust so as soon as any case reaches the HR it gets resolved in a pretty just way. I have worked there for a few yrs and luckily had the chillest boss. Plus we would get paid OT allowances and comp offs even for a couple of hours of over time. I had earned so many comp offs that by the time I left TCS I had 50+ earned leaves and I could encash them all. Vehicle Dealership especially Trucks are another hell holes. ICICI is way worse. adidas India Marketing Private Ltd.! Let's delve into the cesspool of toxic boss culture and their questionable hiring practices. I mean, seriously, who in their right mind thinks it's a good idea to hire people from higher positions and place them in lower positions? Talk about demoralizing and squashing any hopes of internal promotions! And let's not forget about their amazing decision-making during the COVID-19 pandemic. While the rest of the world was struggling, they thought it would be a brilliant idea to extend the working week from five days to six! Oh, because revenue and staff were limited, right? Well, guess what? The backend team was still working five days a week. Way to prioritize and create a divide among your employees!! Now, let's talk about the fantastic response they had when you dared to voice your concerns. Did they take it as constructive feedback? Nope! Instead, they canceled your transfer and promotion, and to add insult to injury, they blacklisted you for any future transfers in any region! How's that for valuing employee opinions and fostering a supportive work environment? But wait, there's more! When your team had the audacity to complain about the superboss in confidentiality, what did adidas India do? They retaliated and put the blame squarely on your shoulders! And what was the end result? They fired the Assistant Manager! Oh, how sweet of them, playing the role of the sweet-talking, overly caring snakes in the grass. And let's not forget their incredible commitment to diversity and inclusion. Instead of hiring the most qualified and experienced candidates, they blindly hire female staff to increase the women's percentage. Who cares about competence and expertise, right? It's all about the numbers and appearances, regardless of the impact it has on the overall team dynamics and productivity. So there you have it, folks! adidas India Marketing Private Ltd., where toxic boss culture, questionable hiring practices, retaliation, and prioritizing numbers over talent are the name of the game. TL;DR: adidas India Marketing Private Ltd. has a toxic boss culture, questionable hiring practices, and retaliates against employees who voice concerns. They extended the working week during COVID-19, canceled promotions, blacklisted transfers, and fired my Assistant Manager. They also prioritize hiring relatively inexperienced women over experienced male candidates. Not a great place to work! I know I am going to get downvoted for sharing the reality here but still, Is this really the first time the majority of people are becoming aware of these situations ? Situations like these are very common in all types of sales and Service related jobs. If you have a family member or a relative who works in a sales job, ask them regarding this and you will get to know a lot of such situations which are never brought to light. The best that can be is done by the employee is to ask for change of manager ? Why - Because if that one screaming manager can bring results and profits to the XYZ company or Bank, that way works and company benefits. So again the bank won't fire them until they start beating someone. Like think through once, why would a random number from XYZ bank call you asking if you want to take loans or credit cards or debit cards or sell you insurance every week or month ? These so-called callers mostly have a job where they are paid on the number of people they call in a day and if they don't meet that target, these callers will also be scolded by their managers. Some of them will be scammers as well, some we as people are careful off and sometimes people get scammed. Similarly, You will also see many people in Malls or Electronic shops telling you to share contact numbers with them. Why are they asking this ? Because their managers have told them to take and note done numbers of people they talk to. These managers might also be screaming at them. Reports are made everyday, on field jobs have to send Checklist whether they have succeeded in completing the minimum quota of talking to people. I agree 80% of Managers are great and very helpful but you will also find others like the one in the videos. Even a good manager might scream at a person due to some frustration or other things. It is obviously wrong and mentally hurtful. I am surprised that people are surprised by this Gosh that's bad - i have a feeling that given enough time, we'll end up naming all companies that operate in India, in this thread. Mahindra I was just doing a small stint at Reeliance Insurance. They used to target poor families by hosting a drawing competition in poor schools and letting the parents know that their kid has won an award. So the poor gullible parents used to come to the reliance office and they would be pitched a term Insurance product. The speech would be like if you die today, who’s gonna support your family etc etc. used to scare these poor families. Felt it was such a scam, taking advantage of poor families. Quit within a month. They pay a lot. So if you switch, other companies are not able to match the salary. Hence retention rate is high. But also ruin your credibility in the market especially mine by sharing terrible feedback making it difficult for me to find a job. No one is surprised. But this is the first time it's out in the open like this. We need to keep up the momentum and share incidents like this regularly. We need to collect evidence and put it in the public sphere. Thats the only way we will ever get any resolution. We cannot depend on our HR. We have to take matters into our own hands for our sake and for the future generations. Otherwise this bullshit will continue. We need a r/bossfreakout Thats really bad man :/ Hope you get into something better. Try and join hotels. You'll be glad you're stuck in corporates. Especially if you're a chef Looks like maharashtra. In north india there is no work culture, there is bauji culture. HR is bauji's lapdog. Bauji doesnt do shit and just keeps tab on who is coming and foing out of the odc. Also, everything else at that company is absolutely shit in north. I had a friend who worked for IHCL for 6 months. That guy stood unmoved like a rock while his mother was undergoing cancer treatment but he couldn't withstand the hotel industry. Yes. And more people need to be aware of the exploitation done in hotels. Working 17-18 hours a day. No breaks. No offs. Cuts, burns and bruises. Pay like peanuts. The positive is that it makes you tough. Battle hardened. Wish the media/industry changes for the good. I worked in Tech Mahindra as a System Admin and I had a boss who was the Project Manager. I had joined the work when the Covid outbreak happened and even during the course of Covid in 2020, I had to go to office as soon as May cause business should not be affected even by 1%. It was a nightmare working for this guy who did not understand there was a covid going on. He was toxic af to even the team managers. Had to endure for a year cause no one else was hiring at that time and I did not want to lose my current job. Thankfully got into a good company now that treats me well. Even during my fuckups(more than once, recent one had cost the company like 2 lakh rupees), we would try to figure out a solution and see what it had happened instead of blaming and screaming at each other. Luckily i have some good paying skills so im doing well for myself. But yes its been terrible. Thanks mate. I agree. My brother left the prestigious Taj Mumbai because of how the supervisors treated him. He’s doing well now. So you need something terrible to value the good. An organization named Impact Guru. Just head over to their Glassdoor to learn more. I've worked in IT only. I have worked under several managers over the years. Some are very good and helping. Majority of them go neutral. and ofcourse bad apples will be there. Mostly it's the managers who technically suck act as a-holes. Because they cant understand what a developer is saying and they have to show their power somehow. Well in hotels we say Taj is one of the better brands where they atleast treat better. There are brands where the work is brutal. Can't name, unfortunately. Although, I'd reckon hotels do build character. Toughness. And teach you much more than what a book or a fancy school can. Anybody from the hotel industry? Yes khud ka dukh sabko hi bada lagta hai... But hotel industry might look really glamorous from the outside, you get to hang out with the celebrities, if you are on a good position,you get to try all the cuisines at the organization's expense n blah blah. However is is less discussed but hotel industry too is really toxic.. Can someone please can share their first hand experience.. I used to work as a pvt. teacher giving 6 classes daily for peanuts. My boss told me i wasn't good enough for job, fired me after 3 months. I am currently working in govt. Organization on contract. Curious what pressure gets put on a chef? To make dishes faster? That's the least of things that bother us. A friend of mine used to work for ICICI as an RM. He was paid peanuts like 25k pm after doing an MBA from a good institute. Secondly he used to have daily morning calls with the RBH for ULIP commits. They were asked to use any trick in the book to sell ULIPs. They had access to every customers entire history (in fact I even made a post about this years ago) and they were asked to use this info to sell ULIP or prepaid (brokerage) There was an extreme incident where a female RM was asked by the manager to go sleep with the client to get the sale. She recorded it and reported it and the manager was fired. There were multiple incidents where if an RM hadn't met his commit, the manager would call him up at 7pm and ask them to travel to a branch on the other side of the city. Like say if they were in Navi Mumbai, they'd be asked to go to South Bombay and call the manager from there. Once they'd call the manager from there - the manager would ask them to go home. This was a daily tactic apparently. Other than this there were three commit calls that happened every day which were basically abuse. My friend quit within one year and joined a consulting firm where the hours were much longer but no one ever treated him like a slave again. Accenture is as bad as it gets. I was expected to know everything, be on call for almost 10 hrs each day, then do lot of work. Taking a leave was a nightmare. Plus our manager shouted on us on daily basis. Luckily, I was able to switch within a year. Jio is indeed very horrible. I also had a soul crushing experience there. Manager was harassing me and not letting me leave the team either. The whole thing then imploded into an intense shouting contest. I get you mate. My brother worked for Taj. He told us that he was slapped and verbally abused by his supervisor. Though he told this to us much later. Otherwise I myself would have broken his supervisor’s bone. Makes me mad. That is what my Dad refers to as Lalaism or Lala culture. These are establishments with no potential for growth and the owners/ bosses are narrow minded people who just stick to the rules. They are afraid of criticism and cannot expand their horizons. They are afraid of questions and will create issues out of thin air. Reminds me of someone in Delhi! Oh yeah that’s our PM also! I’m guessing, for IT it’s quite good as compared to non-IT people. Reading all the comments makes me appreciate my manager and work life balance🥲 Which group of Accenture and which location? Which group of Accenture and which location? paging /u/icicibank. what is this behaviour?! ^/s What’s this Bauji man? What’s Bauji man I was in Atci, working as Cloud migration architect at bangalore Strange because everyone talks of how HR is all powerful SBI. I was working in a Branch Office which was difficult in all aspects. Improper internet connectivity, location and size of the branch, even the road to reach the branch. This manager was so asshole that he would give every work to me and not delegate the work to another clerk, which could have reduced the stress overall. I would have to stay late and leave the branch late; driving back to the village where I lived was so tough, I was almost questioning my own existence. The branch also had no 2nd and 4th Sat and Sunday off, which fucked a lot in my life, personally and professionally. I learnt from some other clerk that he was working in another organisation (where my father worked for more than 3 decades before retiring in 2016), and there the job made him have suicidal tendencies. I could feel the behaviour seeping into my work as well. I soon realised that even if I work hard to promotion, nothing would made me get out of here. So I resigned, took a break, prepared for another exam and cleared it. Moving out of Lunchtime is probably the best decision I took in my life till present. SBI. I was working in a Branch Office which was difficult in all aspects. Improper internet connectivity, location and size of the branch, even the road to reach the branch. This manager was so asshole that he would give every work to me and not delegate the work to another clerk, which could have reduced the stress overall. I would have to stay late and leave the branch late; driving back to the village where I lived was so tough, I was almost questioning my own existence. The branch also had no 2nd and 4th Sat and Sunday off, which fucked a lot in my life, personally and professionally. I learnt from some other clerk that he was working in another organisation (where my father worked for more than 3 decades before retiring in 2016), and there the job made him have suicidal tendencies. I could feel the behaviour seeping into my work as well. I soon realised that even if I work hard to promotion, nothing would made me get out of here. So I resigned, took a break, prepared for another exam and cleared it. Moving out of Lunchtime is probably the best decision I took in my life till present. SBI. I was working in a Branch Office which was difficult in all aspects. Improper internet connectivity, location and size of the branch, even the road to reach the branch. This manager was so asshole that he would give every work to me and not delegate the work to another clerk, which could have reduced the stress overall. I would have to stay late and leave the branch late; driving back to the village where I lived was so tough, I was almost questioning my own existence. The branch also had no 2nd and 4th Sat and Sunday off, which fucked a lot in my life, personally and professionally. I learnt from some other clerk that he was working in another organisation (where my father worked for more than 3 decades before retiring in 2016), and there the job made him have suicidal tendencies. I could feel the behaviour seeping into my work as well. I soon realised that even if I work hard to promotion, nothing would made me get out of here. So I resigned, took a break, prepared for another exam and cleared it. Moving out of Lunchtime is probably the best decision I took in my life till present. You posted the comment thrice by mistake I'll try to keep it short...you are paid for 9-12 hours shift but you are working for 16-17 hours on a stretch 'normally' And yes there is nothing called as overtime in hotel industry. I used to stay in Thane, and worked at a 5 star at CSMT. There were days when I worked for so long...hardly 2 hours to my next day shift...so there was no point in going back home. Hotel guys can relate... everyone has an extra pair of undergarments and towel etc in the locker..just in case.. And payment is literally peanuts My opinion there are good managers. There are bad managers in every company to some extent. Build character ? Toughness ? I think we need to get rid of this thought process for a JOB ! A job should be where you work, and get paid your fair share and beyond your work hours your job can fuck right off. We are humans, not bloody coal waiting to be turned into a diamond. I agree. In my past two jobs, I joined under angels. Then something happened and they were allotted new roles. And I was put under literal demons. That has happened to me twice now. I absolutely hate it. Oh man where to begin about hotels in India. I did HM from Agra and worked for 2 years in a business hotel.in Bangalore. The hotel industry in India is Blue Collar AF. The starting pay is 12K and shifts are crazy. A lot of staff is older and who have been working at the same hotel and same position for decades and have a chip on their shoulders. That whole \"Aaj ke launde hame sikhange\". They forcefully take tips away from newbies and interns. Managers fucking eat in the restuarants themselves or would have banquet food but give the lower staff 15 minutes to go and have their meal ( which more often than not is shit). You may think chefs would get to make gourmet meals and shit but that's far from the reality, most of the times you're stuck peeling onion, carrot and doing basic mise en place and constantly face abuses from superiors. I remember this one intern who was in banquet service with me hadn't gotten a leave in 15 days and had gotten blisters on his feet. He just couldn't take it and said to hell with this and went home limping. The worst part is there is no fixed shift timings as well, you will do a morning shift on Monday which is like 7-5 and afternoon shift on Tuesday which is 2-11 and then do night shift on Wednesday. Fucks up your sleeping pattern completely. I could go on and on but the hotel industry in India needs serious reforms. My boss asks for help during his booty call . I wish i can expose it to his wife someday. Coding ninjas employees locked their employees up in the office 😭 I really liked how this video got viral. We all have such horrible people in our organisation and the top management ignore their behaviour because they are holding big position / important for the company from the aspects of money/profitability. Like the top boss of our plant is infamous for his verbal violence but at the same time he is able to bring down conversion cost per kg miraculously. Master of getting things done with minimal manpower. So obviously top management ignoring his abusive angry behaviour. This women % thing is happening in my company too. So I can relate. A male coworker had to do so much more, listens to verbal abuse, no words of praise, sacrifice the leaves. I am not against gender equality but management seriously need to look at it once more. I heard that they are doing this because of some benefits government will provide if you have certain amount of female staff. Don't know the reality. It hurts the gender dynamics. In adidas itself. After i was fired. An SLT member visited India and pointed out the lack of a lady cluster manager. The company went nuts and promoted a store manager who hadn’t completed 18 month(company policy was no promotion before 18 months) my male former colleagues and friends were informed of the opening, naturally they applied to receive a mock interview just to show that interviews were done and this woman was selected. Same happened with me they chose someone who didn’t have the experience and was at a lower designation than me. According to many sources I was the best choice internally and many who had applied for the position gave up after hearing that i had applied too. However they went with that lady. Who apparently took 6 months to learn the job. And she was trained by my colleagues and friends. Same to same things are happening in my organisation. We don't have any complaints whatsoever working under /with a competent female candidates but just for the sake of gender diversity these management guys are recruiting incompetent female staff that's something not justified. These Indian companies are run by frauds in Armani Suit. From execs to senior managers all are toxic because they lack creativity and imagination let alone any skills or tact. Anand Mahindra's insurance/loan company employees third party collection agent aka thugs who were recently in news because they ran a tractor on a farmer who couldn't repay his loan and killed him. All this bloody Anand Mahindra did was to on to Twitter and wrote how sorry he feels. And I'm pretty sure he sheepishly felt proud that it was only one such case. The rest are still profitable and in progress. This needs to change. No wonder why some of us run to foreign countries for better opportunities and skill recognition. Somebody tweet this to that Mahindra unkil. maybe he just hated his mother /jk Parasitic lowlives of planet earth Mf looks like a pig and screams like one too. Just think for a minute, my take would be completely different, what's the point of achieving such targets? For me, it is like exploiting the resources for things we have no demands for! These managers will achieve their targets, they will get promotions and incentives. Company's market valuation will go up. After 30-40 years of service, what these slaves will get? Ghanta! Look at their mental and physical health, it's ruining day by day! What is the point of running the economy so fast when you have super smart govts who spends entire budgets on PR or on other things?? This chu manager doesn't know when we might get over due to his anger issue, sale ne pakka term insurance le rakha hoga! In 2014, I had faced this kind of abuse, where I was hired just out of college as a Graduate engineer Trainee in one of India's largest CV manufacturer. Little did I know as I was only 21. But this triggered me on a path to leave India for future career from that day. If you are young, just remember any guy shouting has no rights to treat you as a scumbag and it reflects only the company culture where at a position where he is because of the rotten leadership and toxic culture of bootlicking. Worked at HDFC Life for short time, At start of each month Manager(ACH) used to force us not to self login for attendance until we sold at least one policy every month. This was known to the top brass of the company and was recommended by them using the phrase \"Don't let them rest, make them uncomfortable\". In simple and plain words was a hell hole. There was literally a study posted about European colleges favouring female students more than male students gradings. It has started stunring the male students learning performance and making them drop out or fall behind!!! Shit is insane. Boys are being punished for their gender. Wrong. The point is there are good CEOs and shit CEOs. The shit ones reach targets shittingly. The good ones are taken advantage of and never grow !Remind me 2 days I will be messaging you in 2 days on [**2023-06-08 21:24:24 UTC**](http://www.wolframalpha.com/input/?i=2023-06-08%2021:24:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/india/comments/142b7ds/expose_your_terrible_bosses_and_organizations_a/jn68t8x/?context=3) [**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F142b7ds%2Fexpose_your_terrible_bosses_and_organizations_a%2Fjn68t8x%2F%5D%0A%0ARemindMe%21%202023-06-08%2021%3A24%3A24%20UTC) to send a PM to also be reminded and to reduce spam. ^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20142b7ds) ***** |[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)| |-|-|-|-| >They are afraid of criticism and cannot expand their horizons. >They are afraid of questions and will create issues out of thin air. The PM isnt afraid of criticism, he just doesn't like answering questions. And questions to the face aren't criticisms, news articles and OPEds are. PM isn't exactly controlling the press lol. You can either control the press or evade it, not both at same time. Also, issues out of thin air? Somehow this feels like a weird criticism. He does make a mountain of a mole hill, sure. But Thin air? There is no such thing as \"fair share\" for pay. You will be paid your market value for your labour. Universal basic income is also not exactly fair share pay. It's a completely different logic of fair pay for survival in society. Again, no such thing as fair share of pay. >We are humans, Jobs are also careers. Your logic applies only when you will be in same job for your whole life. Nobody wants that without UBI which actually grows according to inflation, which it never does. Since we are in a country which is really really far away from UBI system, you have no choice if you want to build a career out of the job. Blameless culture is so important. It fosters an office culture with much less politics. I'm in Canada and there's a group of us that play cricket. A lot of people who play with me are people who are over 30. And a lot of them made really good money in india(2-3L) per month but the reason they left is because of work culture. Over here unless you work for desis, people don't even call you when you're done with work or during the weekend. My friend worked at Oberoi group as the front desk and eventually guest manager for about 4 years. He's told me horror stories about it. Once he was arrested for asking a noisy, drunk guest who was creating a ruckus after his prostitute left to be quiet. Guy was an MLA and called the cops on him! Morals are for the poor or the powerless. That is cheap way to sell term insurance Because all companies have one or two bad apples. Everyone knows them and remembers being bruised by their behavior. No one will remember the good ones who treated their team with respect and compassion. I remember a while back someone had posted a video of their manager at Byjus insulting them, insulting their family, in ways I wouldnt treat a stranger let alone a colleague. Byju's took the very considerate path of.... DMCA takedown of every place that video was ever posted on the net. I dont think it exists anywhere now despite being all over the net for a week. EDIT: Reddit post which was taken down by DMCA * TBH that's the reason people should buy term insurance. And it's not exactly expensive like regular insurance I'm just joining the corporate world, honestly while watching such videos I always feel ki these guys getting scolded are adults who need to show some self respect and stand up against this toxicity. I'd like some explanation on this. Apart from salary threats, what makes them feel that it's easier to stay quiet and let it affect their mental health day after day? Government IT contract- manager would bark like a dog at new hires. With most jobs like this, daily wage, gig or contract office jobs should not be devalued. Expecting you to be locked into toxic arrangements for years is simply wanting locked up slaves. Societal pressure for big name office jobs, family unreasonably burdening you etc. Insurance companies are big leeches that keep blood even if they become fat. It's addiction for hoarding resources by the 1%. This is horrible and needs a giant strike. Plot of The Apartment Congrats, what do you do now ? Chefs working in toxic environments is a universal thing. Not restricted to India. That said, I can imagine how an Indian work environment would just make things much worse. Chief street mugger You'll be locked in our Chernobyl branch This takes the cake. Every brand I guess. and truck owners and truck drivers are another type toxic jerks. Everyday is stress and struggle. If they complain, they'll be the ones who will be fired. They'll be the ones who won't get experience letters. The manager will sully their names in the market. They will have to explain their sudden departure to the next company. And most people have liabilities - cos of the liabilities they are unable to quit. When Jio launched I was a part of a pan india project with them My colleagues used to travel long distances from suburban towns to the city where coming and going back to home took almost 6 hours daily One day a guy while working fell asleep in his chair There was a guy jitender mahapatra who was big shot in reliance literally went to the guy kicked his chair and started screaming at him as if he had done a big immense crime The guy rose folded his hands and left the office never saw him again Don't know why but felt happiness in my heart for the actions of the day A silent effective slap on the management This is a Xerox copy of multiple experiences in my career. The good ones are always remembered. That is not true. Any time I've joined under a great manager, I've been told that by everyone on the floor. >ACH Were you in the Agency channel? Most comments here range from IBFC to insurances, I've had my luck and life tested working for our in-house twitter giveaway legend who uses his surname on cars, when covid stuck, we were not even given any WFH, from very next day we were asked to report to work or be fired. Ofcourse higher-ups knew this and never set foot in office till late 2022 !. Add to this global semiconductor shortage and excruciating long work hours. I remember having to stay hungry without any food for whole day because all shops were closed and workplace had no arrangement for lunch either. After working for 3.5yrs and getting COVID+ TWICE !, we were simply given PIP because they wanted to reduce workforce. Yearly hikes were an amazing 2-4% because of business slowdown (while execs kept raising stock prices). Neither you could switch because Auto sector is not that well paid. Just writing this makes my blood boil. I hope you know why your \"*surname MUV800\"* cars are cheap, because they were paid by us engineers who worked all though covid and never got paid for our efforts anyway. Glad someone pointed out the shit going on in public sector banks these days... Our previous generation enjoyed this job as job for life but after Modi, government's every xyz scheme is routed through banks which means chaos, redtapism, bootlicking, stress, long hours, zero personal life in the name of sarkari Naukri... People nowadays don't respect bankers and even the hardworking staff bears the brunt of the prejudice. I had a GM literally say that those who do not have babies yet should refrain for next two years(his tenure) on the day he joined and this who have babies should find creche services coz everybody should forget that they have a family for next 2 years... He till date is the most hated boss I've come across, people worked 9-9 every day with no appreciation, would publicly slam people by saying free ki salary lene me sharam nahi aati, once he was at some conference where he would hand over the award for good performance and then say it loud you don't deserve this free ki salary le rahe ho sharam karo... I worked for IT/BPO and was lured into this in the name of sarkari but God knows I feel like resigning every morning, changing job is also not an option coz I don't have the calibre for today's competition for any other govt job Can someone share exp in Biocon? I have family who worked there in 2013-2015 ran away because of abusive bosses. Now in 2023 a guy in my PG is upset about getting berated everyday by his boss there. From what he tells me because it's a big brand people suffer the abuse for sometime so they get the name on their resume. Has nothing changed? Yea lets gooo .. expose all of these mfs This is actually shocking for me as a 22 year old starting his career. A few years ago I was on track to do my engineering and MBA and whatnot but decided against it because I was always passionate about photography and cinematography. I did my degree in it and today I work as a freelancer so my earnings can vary between 25-50k depending on how many projects I can get. Sometimes I see my friends working in Microsoft or Google right out of college or moving to the states to work and I do think if I made the right choice of getting into working in the entertainment industry and honestly, I think I've made the right choice for myself. If y'all have any views, I'll love to get some perspective on this. ESIC Yes in Agency channel. This is the real reason bosses want people to work from office Help needed to share audio clip from HDFC VP who also abused employees.. i don't know how to do it i have the clip and his details Can anyone translate what he was saying in the video? Hoo boy! You trigerred PTSD in me about this topic. Where do I start? Let's go with the bad ones first: Yours truly - IT consultant and general busy body who can talk multiple languages and weasel myself into talking to both low level as well as management folks. Worked on a lot of sarkaari IT projects. NIC/C-DAC and other state owned IT - crap pay for engineers, abusive managers, crap culture, ass kissing, bootlicking, nepotism, corruption, technology stuck 10-20 years behind. You will be surprised at the budgets these companies get and the payscales for management, and it is astounding any big project gets done at all. Hire some talented UI/UX designers you lazy, incompetent fuckers! IOB/SBI/Canara and all the chota PSB banks - the worst of the lot. fail to adapt to modern consumer needs and IT infra running on creaking old HW and software. The only gig where I actually wanted to climb into the old ancient HW and stick my neck into the huge ass fans and kill myself. 16 hour work days, abuse, psychological manipulation, psychopathic managers, overworked staff. Fixed cost projects spell DOOM! One manager actually physically assaulted an employee for typing in a wrong command that fucked up the network config. They keep posting non-native people to branches where most of the staff and customers do not speak the same language. I feel sorry for the Infys, TCS, HCLs and other services companies that have to work on these projects - it has failure written on them even before the project starts. The good ones: You may be surprised, or may be I just got lucky with these - YMMV: BEL Bangalore - chill as fuck 9-5 job, but 6 day work week. culture still stuck in the 1980s, but most of the old unkills have been forced to retire. No pressure to deliver anything, and they work on big complex products and projects. Ass kissing exists, but by and large they leave the employees alone. There are lot of women in leadership positions, maybe that;s why the culture is like this. Hire more women in management! ISRO - No suprise here. Culture used to be even better, but culture trickles down from the top. Mostly solid engineers in the top, and it tells. Surprisingly sophisticated for a sarkari company, but APJ and Seshan left a legacy of excellence and getting the job done. Post it on YouTube and then post the YouTube link here. Few years back, Agency was a dying channel - high costs and low revenue. There were rumors that top management was thinking of shutting down Agency permanently and getting rid of everyone. The Agency leadership was desperate on hold onto their careers and that's when such culture became widespread. Funnily, Agency has recovered recently and is doing well. A big reason for that was the new agency head, who cut down on the sales pressure and focused more on agent recruitment. Getting good quality agents turned out to be the key to becoming profitable. Hey,man. I shot you a DM, could you please check that? I am here to share my recent work experience in an edtech company, which unfortunately turned out to be quite disheartening and challenging. I believe it is important to express my thoughts and feelings in order to process and reflect upon the negative aspects of my time there. One of the primary issues I encountered was the exceptionally long hours I was expected to work. The demands of the job often extended far beyond the typical 9-to-5 schedule, leaving me with little personal time or opportunities for rest and rejuvenation. This imbalance between work and personal life took a toll on my well-being and overall job satisfaction. Moreover, I had the misfortune of working under a manager who fostered a toxic work environment. Their constant shouting and aggressive demeanor created an atmosphere filled with tension and anxiety. The relentless pressure to achieve sales targets, coupled with the manager's unreasonable expectations, made it challenging to thrive in such an environment. It became increasingly difficult to maintain a positive mindset and motivation to excel when faced with such excessive stress. Unfortunately, the negative impact of these circumstances extended beyond my professional life, affecting my overall mental and emotional well-being. The constant barrage of pressure and hostility took a toll on my confidence and self-esteem, leaving me feeling devalued and demotivated. I left for good and thats been the best decision of my life. If any company requires a GPTW certification, it means they weren't able to achieve it naturally. Hence have to prove that they are good. As a Manager my self, i would love to share this thread to my team as sometimes these idiots try to walk all over me and I have to show them their place. I wish I had a manager like myself when I started off.. uff My manager lost a 100 headcount project. In this market, you think he would be fired. But no, he was rewarded with a promotion & 20% increment. Meanwhile, I worked hard in the same project and got funding for 5 more heads. I got a grand total increment of 3% coz that's the \"HR policy\". Only when organising Anktakshri on weekends. HR does not play any significant role as far as I know. I worked only 13 months, so my experience is limited. One of the worst job I ever did. I loose my shit when I had an urgent work and I told my manager in advance that I will log out at 8 pm to visit a doctor. He shouted at me when at 7:55 I reminded him that I will log out. I had already worked 9 hours that day, so it was not like I was logging early. I resigned in same month later. Hyundai dealership same story. During one of my old jobs, my grandpa had died very unexpectedly. I told my boss that I would be gone Friday-Sunday for the funeral, since he lived in a different state. Sunday comes by, and it's clear by all the traffic and such that we wouldn't make it home until 10 AM at the earliest, since we drove. I texted my boss to tell him that I wouldn't make it until 10 AM on Monday instead of 7 AM on Monday. This somehow offended him as he sent a long angry text telling me that I had only requested Friday through Sunday off and how selfish and lazy I was for not telling him before that I would need Monday off. But he also made sure to mention that he wouldn't have given me Monday off anyway because several people had already gotten Monday off and he needed me in. I had to explain that it is physically impossible for me to get there on time. He told me to hurry up and come in anyway. I was very new to the workforce so I did. But because I couldn't sleep on the whole drive home I got very sick and passed out during work. He then fired me for not being \"professional\" enough or whatever. And this is quite strange to me because this was at a Mormon warehouse, the same people who claim to be the friendliest kind of people. \\[I would know, I grew up surrounded by Mormons\\]"
}