{
    "id": "18msxpg",
    "title": "Vice President Jagdeep Dhankhar and Lok Sabha Speaker Om Birla must be shamed for their role in suspension of democracy.",
    "url": "https://www.reddit.com/r/india/comments/18msxpg/vice_president_jagdeep_dhankhar_and_lok_sabha/",
    "selftext": "The suspension of 142 MPs is a dark episode in the history of parliamentary democracy in India. The Modi government's attack against the legislature is part of its agenda to capture all pillars of the democracy and suspend the Constitution itself. Vice President Jagdeep Dhankhar and Lok Sabha Speaker Om Birla are part of a criminal conspiracy of the fascist takeover of the Indian republic.\n\nThe President issuing a statement over a small gimmick, but maintaining silence over countless attacks on the republic — including the bulldozing of important bills without discussion, abuse of MP Danish Ali, the disqualification of Rahul Gandhi, and now the suspension of 142 MPs —  is appalling.\n\nHistory will remember the attack on Indian democracy by the Modi government and the conspiracy carried out by people holding constitutional posts.\n\nThis assault on our democracy, hard won after a long struggle and countless sacrifices, must be vigorously resisted. Jagdeep Dhankhar and Om Birla must be shamed for their role in suspension of democracy.\n\n[141 सांसद सस्पेंड, बचेगा क्या अगर विपक्ष न होगा - YouTube](https://www.youtube.com/watch?v=8elxzUjj0PU)",
    "flair": "Politics",
    "score": 5,
    "num_comments": 1,
    "created_utc": 1703073442.0,
    "convurl": "https://external-preview.redd.it/HboA1W_5hQ_Ucpj8iRk4h0AEB_K6FDCp5yRvrr8i6WI.jpg?auto=webp&s=34945f0a2d5e3482bffe41fb650f4f88160eba46",
    "comments": [],
    "cleaned_text": "vice president jagdeep dhankhar lok sabha speaker om birla must shamed role suspension democracy suspension mps dark episode history parliamentary democracy india modi governments attack legislature part agenda capture pillars democracy suspend constitution vice president jagdeep dhankhar lok sabha speaker om birla part criminal conspiracy fascist takeover indian republic president issuing statement small gimmick maintaining silence countless attacks republic including bulldozing important bills without discussion abuse mp danish ali disqualification rahul gandhi suspension mps appalling history remember attack indian democracy modi government conspiracy carried people holding constitutional posts assault democracy hard long struggle countless sacrifices must vigorously resisted jagdeep dhankhar om birla must shamed role suspension democracy youtubehttpswwwyoutubecomwatchvelxzujjpu ",
    "cleaned_title": "vice president jagdeep dhankhar lok sabha speaker om birla must shamed role suspension democracy",
    "cleaned_selftext": "suspension mps dark episode history parliamentary democracy india modi governments attack legislature part agenda capture pillars democracy suspend constitution vice president jagdeep dhankhar lok sabha speaker om birla part criminal conspiracy fascist takeover indian republic president issuing statement small gimmick maintaining silence countless attacks republic including bulldozing important bills without discussion abuse mp danish ali disqualification rahul gandhi suspension mps appalling history remember attack indian democracy modi government conspiracy carried people holding constitutional posts assault democracy hard long struggle countless sacrifices must vigorously resisted jagdeep dhankhar om birla must shamed role suspension democracy youtubehttpswwwyoutubecomwatchvelxzujjpu",
    "cleaned_comments": "",
    "light_cleaned_title": "Vice President Jagdeep Dhankhar and Lok Sabha Speaker Om Birla must be shamed for their role in suspension of democracy.",
    "light_cleaned_selftext": "The suspension of 142 MPs is a dark episode in the history of parliamentary democracy in India. The Modi government's attack against the legislature is part of its agenda to capture all pillars of the democracy and suspend the Constitution itself. Vice President Jagdeep Dhankhar and Lok Sabha Speaker Om Birla are part of a criminal conspiracy of the fascist takeover of the Indian republic. The President issuing a statement over a small gimmick, but maintaining silence over countless attacks on the republic — including the bulldozing of important bills without discussion, abuse of MP Danish Ali, the disqualification of Rahul Gandhi, and now the suspension of 142 MPs — is appalling. History will remember the attack on Indian democracy by the Modi government and the conspiracy carried out by people holding constitutional posts. This assault on our democracy, hard won after a long struggle and countless sacrifices, must be vigorously resisted. Jagdeep Dhankhar and Om Birla must be shamed for their role in suspension of democracy. [141 सांसद सस्पेंड, बचेगा क्या अगर विपक्ष न होगा - YouTube](https://www.youtube.com/watch?v=8elxzUjj0PU)",
    "light_cleaned_comments": ""
}