{
    "id": "16ptfjc",
    "title": "Marathi channel that aired Kirit Somaiya’s video goes blank after I&B notice",
    "url": "https://www.hindustantimes.com/cities/mumbai-news/marathi-channel-that-aired-kirit-somaiya-s-video-goes-blank-after-i-b-notice-101695413249851-amp.html",
    "selftext": "The Ministry of I&B has ordered the closure of a Marathi news channel for 72 hours after it aired a video showing a compromising situation involving Somaiya.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1695438403.0,
    "convurl": "https://external-preview.redd.it/OvkWBc2_ecG67MGuS_cCE21WSnrwJ02Iz8yz8YnYPt8.jpg?auto=webp&s=3e555532770dceeb511c2df6c164480cb0df3936",
    "comments": [
        ">Confirming the development, Lokshahi’s editor-in-chief Kamlesh Sutar said, “We received a notice from the ministry about the Kirit Somaiya story we had carried. We have also received an instruction to shut down our channel for the next 72 hours.”\n\n>When contacted, Somaiya said the video was a new type of political blackmail with the help of a television channel. “This has stopped now. I got justice.”\n\n>State Congress’s general secretary Sachin Sawant said this order shows democracy is in danger. “India ranks 161 in the press freedom index and very soon we will drop to the bottom of the list.’’\n\n>Vinod Jagdale, president of the TV Journalists’ Association, called the action unjust. “The incident requires to be investigated. This is not good for the future of TV journalism.”\n\n >The Mantralaya and Council Hall Reporters’ Association condemned the order and said this is a ploy to throttle the expression of free speech.",
        "I didn't know we had an I&B ministry",
        "> When contacted, Somaiya said the video was a new type of political blackmail with the help of a television channel. “This has stopped now. I got justice.”    \n\nHe is not denying the charges. Hence what action was taken against the perpetrator?"
    ],
    "cleaned_text": "marathi channel aired kirit somaiyas video goes blank ib notice ministry ib ordered closure marathi news channel hours aired video showing compromising situation involving somaiya ",
    "cleaned_title": "marathi channel aired kirit somaiyas video goes blank ib notice",
    "cleaned_selftext": "ministry ib ordered closure marathi news channel hours aired video showing compromising situation involving somaiya",
    "cleaned_comments": "confirming development lokshahis editorinchief kamlesh sutar said received notice ministry kirit somaiya story carried also received instruction shut channel next hours contacted somaiya said video new type political blackmail help television channel stopped got justice state congresss general secretary sachin sawant said order shows democracy danger india ranks press freedom index soon drop bottom list vinod jagdale president tv journalists association called action unjust incident requires investigated good future tv journalism mantralaya council hall reporters association condemned order said ploy throttle expression free speech didnt know ib ministry contacted somaiya said video new type political blackmail help television channel stopped got justice denying charges hence action taken perpetrator",
    "light_cleaned_title": "Marathi channel that aired Kirit Somaiya’s video goes blank after I&B notice",
    "light_cleaned_selftext": "The Ministry of I&B has ordered the closure of a Marathi news channel for 72 hours after it aired a video showing a compromising situation involving Somaiya.",
    "light_cleaned_comments": ">Confirming the development, Lokshahi’s editor-in-chief Kamlesh Sutar said, “We received a notice from the ministry about the Kirit Somaiya story we had carried. We have also received an instruction to shut down our channel for the next 72 hours.” >When contacted, Somaiya said the video was a new type of political blackmail with the help of a television channel. “This has stopped now. I got justice.” >State Congress’s general secretary Sachin Sawant said this order shows democracy is in danger. “India ranks 161 in the press freedom index and very soon we will drop to the bottom of the list.’’ >Vinod Jagdale, president of the TV Journalists’ Association, called the action unjust. “The incident requires to be investigated. This is not good for the future of TV journalism.” >The Mantralaya and Council Hall Reporters’ Association condemned the order and said this is a ploy to throttle the expression of free speech. I didn't know we had an I&B ministry > When contacted, Somaiya said the video was a new type of political blackmail with the help of a television channel. “This has stopped now. I got justice.” He is not denying the charges. Hence what action was taken against the perpetrator?"
}