{
    "id": "10qv034",
    "title": "I love their tunes, but how do I find bhajan babas on youtube?",
    "url": "https://www.reddit.com/r/india/comments/10qv034/i_love_their_tunes_but_how_do_i_find_bhajan_babas/",
    "selftext": "So, many times in India at melas and so on I saw these type of babas around.  I don’t understand many of their words at all, but I love the tunes.  Searching on youtube I only find Sai Baba &amp; etc others that I DON’T want to find lol.  Please can anybody tell me how to find bhajan baba music?   Tia, an Aussie.\n\nhttps://preview.redd.it/py8h1shgzkfa1.jpg?width=1300&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b6b7342e7d489ff8c7c89d5a46c5c77937d939b5",
    "flair": "AskIndia",
    "score": 0,
    "num_comments": 2,
    "created_utc": 1675258901,
    "convurl": "https://b.thumbs.redditmedia.com/WhQ64_wUXRSc8dArU0J0vJsyaBQ2I5iGBPrfSGZMsuo.jpg",
    "comments": [
        "I searched for \"santo ke bhajan kirtan\" and got some similar results. You can try doing the same."
    ],
    "cleaned_text": "love tunes find bhajan babas youtube many times india melas saw type babas around dont understand many words love tunes searching youtube find sai baba amp etc others dont want find lol please anybody tell find bhajan baba music tia aussie ",
    "cleaned_title": "love tunes find bhajan babas youtube",
    "cleaned_selftext": "many times india melas saw type babas around dont understand many words love tunes searching youtube find sai baba amp etc others dont want find lol please anybody tell find bhajan baba music tia aussie",
    "cleaned_comments": "searched santo ke bhajan kirtan got similar results try",
    "light_cleaned_title": "I love their tunes, but how do I find bhajan babas on youtube?",
    "light_cleaned_selftext": "So, many times in India at melas and so on I saw these type of babas around. I don’t understand many of their words at all, but I love the tunes. Searching on youtube I only find Sai Baba &amp; etc others that I DON’T want to find lol. Please can anybody tell me how to find bhajan baba music? Tia, an Aussie.",
    "light_cleaned_comments": "I searched for \"santo ke bhajan kirtan\" and got some similar results. You can try doing the same."
}