{
    "id": "18v3mhl",
    "title": "Semiconductor overview in India 2023",
    "url": "https://www.reddit.com/r/india/comments/18v3mhl/semiconductor_overview_in_india_2023/",
    "selftext": "1. Micron Tech beings construction of $2.75 billion chip packaging plant in Gujarat.\n2. Foxconn submits application for setting up semiconductor fabrication unit in India and had expressed interest earlier to set up 4-5 fabs in India\n3. Foxconn is also in talks with Taiwan's chip-making giant Taiwan Semiconductor  Manufacturing Co (TSMC) and Japan's TMH Group for a joint venture and  technology partnership to start semiconductor fab\n4. AMD unveiled a huge campus in Bengaluru, focused on the design and development of semiconductor technology.\n5. Israel's Tower semiconductor has submitted a second bid to enter India with a Fabrication unit for 65nm and 45nm after Intel had earlier failed to buy it\n6. Kaynes semicon has announced a investment of 2,850 crore in a facility in Hyderabad for OSAT.\n7. Tata to invest Rs 200 crore to set up semiconductor unit in Karnataka\n8. HCL inching close to chip unit in Karnataka, investment estimated at $400 million\n\nAs of the end of October 2023, the government has received a total of 45 applications  under its INR 760 billion semiconductor and display manufacturing  scheme. These applications cover five requests for the establishment of  semiconductor fabs, two for display fabs, nine for the setup of compound  and ATMP facilities, and 29 for the design-linked incentive scheme. \\[9\\]\n\nSources: [\\[1\\]](https://www.hindustantimes.com/business/micron-begins-construction-of-2-75-billion-semiconductor-plant-in-gujarat-101695478422567.html) [\\[2a\\]](https://www.businesstoday.in/technology/news/story/apple-iphone-maker-foxconn-submits-application-for-setting-up-semiconductor-fabrication-unit-in-india-410416-2023-12-21) [\\[2b\\]](https://timesofindia.indiatimes.com/business/india-business/foxconn-looking-to-set-up-4-5-semiconductor-fabrication-lines-in-india/articleshow/101684279.cms?from=mdr) [\\[3\\]](https://www.business-standard.com/companies/news/foxconn-in-talks-with-tsmc-tmh-group-to-make-chips-in-india-report-123071400154_1.html) [\\[4\\]](https://www.businesstoday.in/technology/news/story/amd-to-invest-400-million-in-india-to-set-up-largest-design-center-in-bengaluru-391646-2023-07-28) [\\[5\\]](https://m.economictimes.com/tech/technology/israels-chipmaker-tower-resubmits-proposal-to-set-up-65-nm-40-nm-chip-fab/amp_articleshow/106254844.cms) [\\[6\\]](https://www.thehindu.com/news/cities/Hyderabad/kaynes-tech-chooses-telangana-for-2800-crore-semiconductor-oast-facility/article67389308.ece) [\\[7\\]](http://timesofindia.indiatimes.com/articleshow/103723629.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst) [\\[8\\]](https://economictimes.indiatimes.com/tech/technology/hcl-inching-close-to-chip-unit-in-karnataka-investment-estimated-at-400-million/articleshow/105602078.cms) [\\[9\\]](https://www.entrepreneur.com/en-in/technology/the-semiconductor-fomo/466368)",
    "flair": "Policy/Economy",
    "score": 14,
    "num_comments": 8,
    "created_utc": 1704012491.0,
    "convurl": "https://external-preview.redd.it/Ygc0GFIo_05ptxU2q56N60fA5SRfLRhvf7GB19Mlq7I.jpg?auto=webp&s=1b50d54dabc7f3f1800c63bec57475b94561e9f8",
    "comments": [
        "You are forgetting lower end AI chips that will be used in efficient manufacturing, robotics and all sorts of things.\n\n[https://kinara.ai/products/kinara-ara-2/](https://kinara.ai/products/kinara-ara-2/)\n\nThis is one of them. Another one is MDS. There are like so many startups which are doing it, it will revolutionize robotics after a few years and precision engineering will improve quite a lot in India. India has to increase incentives for private investment and formulate laws around proprietary tech, because of the lackluster legal ecosystem companies are registering themselves abroad instead of the nation.",
        "The chip is manufactured by [TSMC’s 28nm](https://www.google.ae/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwj4qLmKtrqDAxUn7gIHHSBZBgIQFnoECBQQAQ&url=https%3A%2F%2Fwww.eenewseurope.com%2Fen%2Fchip-industry-veteran-segers-joins-edge-ai-firm-kinara%2F&usg=AOvVaw2GBnk-VYaC8BJQBkPdIQlk&opi=89978449) which is not in india",
        "So? It's designed in India. Half of the things you have mentioned are design houses anyway. And both Foxconn deals were cancelled",
        "Nope, I only made 1 point for design because they were investing $400 million towards it . Point 3 had no updates and point 2 still stands. The previous foxconn-Vedanta bid was cancelled, this is the second bid without it\n\nI can also add that point that they designed AI chips though",
        "Happy new year btw",
        "Yeah a semiconductor plant means anything from displays, SSDs, DRAMs, ICs to MPs & MCs etc. I literally work in the robotics field, we design certain systems that uses these things. \n\nThey designed 16 nm MPs that can run ML and AI workloads effectively for lower cost uses like security cameras, IoT etc, that is where a lot of money is, small things but they need to make a whole ecosystem to go along with it that would require scaling up which they likely won't be able to do in india for now lets see.\n\nI am not confused, actual chip production will be select few, most high end ones that are coming will be design houses rest will manufacture older tech like you mentioned 65nm.\n\nBut this is how you enter the market, the pay in the industry outside of a select few jobs isn't as good and its a tough industry to go into as a result hard to attract top talent. Actually in house design and manufacturing will take at least a decade now it will mostly be testing and assembly. If India has rare earth minerals then they should mine those too to add more value to the market.\n\nOh its new year already there, Happy New Year.",
        "Happy new year!"
    ],
    "cleaned_text": "semiconductor overview india micron tech beings construction billion chip packaging plant gujarat foxconn submits application setting semiconductor fabrication unit india expressed interest earlier set fabs india foxconn also talks taiwans chipmaking giant taiwan semiconductor manufacturing co tsmc japans tmh group joint venture technology partnership start semiconductor fab amd unveiled huge campus bengaluru focused design development semiconductor technology israels tower semiconductor submitted second bid enter india fabrication unit nm nm intel earlier failed buy kaynes semicon announced investment crore facility hyderabad osat tata invest rs crore set semiconductor unit karnataka hcl inching close chip unit karnataka investment estimated million end october government received total applications inr billion semiconductor display manufacturing scheme applications cover five requests establishment semiconductor fabs two display fabs nine setup compound atmp facilities designlinked incentive scheme sources httpswwwhindustantimescombusinessmicronbeginsconstructionofbillionsemiconductorplantingujarathtml ahttpswwwbusinesstodayintechnologynewsstoryappleiphonemakerfoxconnsubmitsapplicationforsettingupsemiconductorfabricationunitinindia bhttpstimesofindiaindiatimescombusinessindiabusinessfoxconnlookingtosetupsemiconductorfabricationlinesinindiaarticleshowcmsfrommdr httpswwwbusinessstandardcomcompaniesnewsfoxconnintalkswithtsmctmhgrouptomakechipsinindiareporthtml httpswwwbusinesstodayintechnologynewsstoryamdtoinvestmillioninindiatosetuplargestdesigncenterinbengaluru httpsmeconomictimescomtechtechnologyisraelschipmakertowerresubmitsproposaltosetupnmnmchipfabamparticleshowcms httpswwwthehinducomnewscitieshyderabadkaynestechchoosestelanganaforcroresemiconductoroastfacilityarticleece httptimesofindiaindiatimescomarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppst httpseconomictimesindiatimescomtechtechnologyhclinchingclosetochipunitinkarnatakainvestmentestimatedatmillionarticleshowcms httpswwwentrepreneurcomenintechnologythesemiconductorfomo ",
    "cleaned_title": "semiconductor overview india",
    "cleaned_selftext": "micron tech beings construction billion chip packaging plant gujarat foxconn submits application setting semiconductor fabrication unit india expressed interest earlier set fabs india foxconn also talks taiwans chipmaking giant taiwan semiconductor manufacturing co tsmc japans tmh group joint venture technology partnership start semiconductor fab amd unveiled huge campus bengaluru focused design development semiconductor technology israels tower semiconductor submitted second bid enter india fabrication unit nm nm intel earlier failed buy kaynes semicon announced investment crore facility hyderabad osat tata invest rs crore set semiconductor unit karnataka hcl inching close chip unit karnataka investment estimated million end october government received total applications inr billion semiconductor display manufacturing scheme applications cover five requests establishment semiconductor fabs two display fabs nine setup compound atmp facilities designlinked incentive scheme sources httpswwwhindustantimescombusinessmicronbeginsconstructionofbillionsemiconductorplantingujarathtml ahttpswwwbusinesstodayintechnologynewsstoryappleiphonemakerfoxconnsubmitsapplicationforsettingupsemiconductorfabricationunitinindia bhttpstimesofindiaindiatimescombusinessindiabusinessfoxconnlookingtosetupsemiconductorfabricationlinesinindiaarticleshowcmsfrommdr httpswwwbusinessstandardcomcompaniesnewsfoxconnintalkswithtsmctmhgrouptomakechipsinindiareporthtml httpswwwbusinesstodayintechnologynewsstoryamdtoinvestmillioninindiatosetuplargestdesigncenterinbengaluru httpsmeconomictimescomtechtechnologyisraelschipmakertowerresubmitsproposaltosetupnmnmchipfabamparticleshowcms httpswwwthehinducomnewscitieshyderabadkaynestechchoosestelanganaforcroresemiconductoroastfacilityarticleece httptimesofindiaindiatimescomarticleshowcmsutmsourcecontentofinterestutmmediumtextutmcampaigncppst httpseconomictimesindiatimescomtechtechnologyhclinchingclosetochipunitinkarnatakainvestmentestimatedatmillionarticleshowcms httpswwwentrepreneurcomenintechnologythesemiconductorfomo",
    "cleaned_comments": "forgetting lower end ai chips used efficient manufacturing robotics sorts things httpskinaraaiproductskinaraarahttpskinaraaiproductskinaraara one another one mds like many startups revolutionize robotics years precision engineering improve quite lot india india increase incentives private investment formulate laws around proprietary tech lackluster legal ecosystem companies registering abroad instead nation chip manufactured tsmcs nmhttpswwwgoogleaeurlsatrctjqesrcssourcewebcdvedahukewjqlmktrqdaxungihhsbzbgiqfnoecbqqaqurlhttpsaffwwweenewseuropecomfenfchipindustryveteransegersjoinsedgeaifirmkinarafusgaovvawgbnkvyacbjqbkpdiqlkopi india designed india half things mentioned design houses anyway foxconn deals cancelled nope made point design investing million towards point updates point still stands previous foxconnvedanta bid cancelled second bid without also add point designed ai chips though happy new year btw yeah semiconductor plant means anything displays ssds drams ics mps mcs etc literally work robotics field design certain systems uses things designed nm mps run ml ai workloads effectively lower cost uses like security cameras iot etc lot money small things need make whole ecosystem go along would require scaling likely wont able india lets see confused actual chip production select high end ones coming design houses rest manufacture older tech like mentioned nm enter market pay industry outside select jobs isnt good tough industry go result hard attract top talent actually house design manufacturing take least decade mostly testing assembly india rare earth minerals mine add value market oh new year already happy new year happy new year",
    "light_cleaned_title": "Semiconductor overview in India 2023",
    "light_cleaned_selftext": "1. Micron Tech beings construction of $2.75 billion chip packaging plant in Gujarat. 2. Foxconn submits application for setting up semiconductor fabrication unit in India and had expressed interest earlier to set up 4-5 fabs in India 3. Foxconn is also in talks with Taiwan's chip-making giant Taiwan Semiconductor Manufacturing Co (TSMC) and Japan's TMH Group for a joint venture and technology partnership to start semiconductor fab 4. AMD unveiled a huge campus in Bengaluru, focused on the design and development of semiconductor technology. 5. Israel's Tower semiconductor has submitted a second bid to enter India with a Fabrication unit for 65nm and 45nm after Intel had earlier failed to buy it 6. Kaynes semicon has announced a investment of 2,850 crore in a facility in Hyderabad for OSAT. 7. Tata to invest Rs 200 crore to set up semiconductor unit in Karnataka 8. HCL inching close to chip unit in Karnataka, investment estimated at $400 million As of the end of October 2023, the government has received a total of 45 applications under its INR 760 billion semiconductor and display manufacturing scheme. These applications cover five requests for the establishment of semiconductor fabs, two for display fabs, nine for the setup of compound and ATMP facilities, and 29 for the design-linked incentive scheme. \\[9\\] Sources: [\\[1\\]](https://www.hindustantimes.com/business/micron-begins-construction-of-2-75-billion-semiconductor-plant-in-gujarat-101695478422567.html) [\\[2a\\]](https://www.businesstoday.in/technology/news/story/apple-iphone-maker-foxconn-submits-application-for-setting-up-semiconductor-fabrication-unit-in-india-410416-2023-12-21) [\\[2b\\]](https://timesofindia.indiatimes.com/business/india-business/foxconn-looking-to-set-up-4-5-semiconductor-fabrication-lines-in-india/articleshow/101684279.cms?from=mdr) [\\[3\\]](https://www.business-standard.com/companies/news/foxconn-in-talks-with-tsmc-tmh-group-to-make-chips-in-india-report-123071400154_1.html) [\\[4\\]](https://www.businesstoday.in/technology/news/story/amd-to-invest-400-million-in-india-to-set-up-largest-design-center-in-bengaluru-391646-2023-07-28) [\\[5\\]](https://m.economictimes.com/tech/technology/israels-chipmaker-tower-resubmits-proposal-to-set-up-65-nm-40-nm-chip-fab/amp_articleshow/106254844.cms) [\\[6\\]](https://www.thehindu.com/news/cities/Hyderabad/kaynes-tech-chooses-telangana-for-2800-crore-semiconductor-oast-facility/article67389308.ece) [\\[7\\]](http://timesofindia.indiatimes.com/articleshow/103723629.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst) [\\[8\\]](https://economictimes.indiatimes.com/tech/technology/hcl-inching-close-to-chip-unit-in-karnataka-investment-estimated-at-400-million/articleshow/105602078.cms) [\\[9\\]](https://www.entrepreneur.com/en-in/technology/the-semiconductor-fomo/466368)",
    "light_cleaned_comments": "You are forgetting lower end AI chips that will be used in efficient manufacturing, robotics and all sorts of things. [https://kinara.ai/products/kinara-ara-2/](https://kinara.ai/products/kinara-ara-2/) This is one of them. Another one is MDS. There are like so many startups which are doing it, it will revolutionize robotics after a few years and precision engineering will improve quite a lot in India. India has to increase incentives for private investment and formulate laws around proprietary tech, because of the lackluster legal ecosystem companies are registering themselves abroad instead of the nation. The chip is manufactured by [TSMC’s 28nm](https://www.google.ae/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwj4qLmKtrqDAxUn7gIHHSBZBgIQFnoECBQQAQ&url=https%3A%2F%2Fwww.eenewseurope.com%2Fen%2Fchip-industry-veteran-segers-joins-edge-ai-firm-kinara%2F&usg=AOvVaw2GBnk-VYaC8BJQBkPdIQlk&opi=89978449) which is not in india So? It's designed in India. Half of the things you have mentioned are design houses anyway. And both Foxconn deals were cancelled Nope, I only made 1 point for design because they were investing $400 million towards it . Point 3 had no updates and point 2 still stands. The previous foxconn-Vedanta bid was cancelled, this is the second bid without it I can also add that point that they designed AI chips though Happy new year btw Yeah a semiconductor plant means anything from displays, SSDs, DRAMs, ICs to MPs & MCs etc. I literally work in the robotics field, we design certain systems that uses these things. They designed 16 nm MPs that can run ML and AI workloads effectively for lower cost uses like security cameras, IoT etc, that is where a lot of money is, small things but they need to make a whole ecosystem to go along with it that would require scaling up which they likely won't be able to do in india for now lets see. I am not confused, actual chip production will be select few, most high end ones that are coming will be design houses rest will manufacture older tech like you mentioned 65nm. But this is how you enter the market, the pay in the industry outside of a select few jobs isn't as good and its a tough industry to go into as a result hard to attract top talent. Actually in house design and manufacturing will take at least a decade now it will mostly be testing and assembly. If India has rare earth minerals then they should mine those too to add more value to the market. Oh its new year already there, Happy New Year. Happy new year!"
}