{
    "id": "12ul2cv",
    "title": "India’s democratic backsliding",
    "url": "https://www.ft.com/content/6c98e1aa-85da-4738-b889-fc4d76d1d0bc",
    "selftext": "Decline of political freedoms under Narendra Modi is tragic for the country and the world",
    "flair": "Politics",
    "score": 78,
    "num_comments": 17,
    "created_utc": 1682116508.0,
    "convurl": "https://external-preview.redd.it/AU3RMFVvUl9heJCJb4pXdXNOgTnS9SqzhXP0Q3ohwMQ.jpg?auto=webp&v=enabled&s=d6d4cc1551a3f57d2bcd08d54bd4308f04498334",
    "comments": [
        "Paywall, so pasting article below:\n\nIndia will soon officially be the world’s most populous country. Its claim to be the largest democracy, however, is wearing thin. On Thursday a court in Gujarat, the home state of Prime Minister Narendra Modi, rejected an appeal by India’s most prominent opposition politician, Rahul Gandhi, seeking a stay on a dubious defamation conviction that prompted parliament to eject him from his seat. He could face a two-year jail sentence and disqualification from next year’s election. Gandhi’s legal troubles are one of the most extreme examples of widespread democratic decline in Modi’s India. That is bad news not only for its 1.4bn people, but also for the world.\n\nWith democratic values under pressure globally and economic fragmentation afoot, India’s vibrant, tech-savvy population and rapidly growing economy are precious assets. A robust, inclusive and truly democratic India that might serve as a counterweight to China and as a global role model matters for everyone. But it is ever clearer that Modi’s Bharatiya Janata party is ready to use all tools at its disposal to bend India’s democratic institutions to its own ends.\n\nSince the BJP defeated Gandhi’s Indian National Congress party in 2014 on a Hindu nationalist platform, Modi’s backers have stifled free expression across media, civil society, and politics, and have stoked inter-religious tensions with India’s Muslim minority. Fear of speaking out against Modi is common in public life. Freedom House, a US NGO, has downgraded the country from “free” in 2021 to “partly free” now while the Sweden-based V-Dem Institute considers India an “electoral autocracy”, alongside the likes of Russia and Turkey.\n\nJournalists deemed critical of the BJP frequently experience online harassment and sometimes legal repercussions. The government exerts enormous influence on media outlets through its ties with owners, and editors are pressured to toe the government line. Foreign media are not immune. In February tax inspectors raided the BBC, shortly after the broadcaster aired a documentary critical of Modi. Academics, think-tanks and foreign non-profit groups are under pressure too. Just this week authorities carried out new searches at Oxfam India over alleged foreign funding violations.\n\nThe undermining of political opponents also goes beyond the Congress party. A senior figure in the Aam Aadmi party, India’s second-biggest opposition party, is in detention over alleged excise fraud and its leader and Delhi’s chief minister Arvind Kejriwal was also questioned on Sunday.\n\nWith the crackdown on dissent, India is damaging its own prospects. The country needs robust and open public debate to help it address challenges that are holding it back from reaching its full potential. These include chronic unemployment, high illiteracy, and crony capitalism. A recent investigation by US short selling group Hindenburg Research into companies owned by Gautam Adani, a tycoon with ties to Modi, has also raised important questions.\n\nThe west sees India as a democratic and economic counterweight to China. But disillusionment with Xi Jinping has prompted western leaders to turn a lamentably blind eye to Modi’s actions. On a visit last week US commerce secretary Gina Raimondo gushed that “he is the most popular world leader for a reason”. Businesses and investors see opportunities in India for growth and diversification away from China. But the weakening rule of law will make them think twice.\n\nIndia’s democracy has never been perfect, but it has achieved impressive results. It has supported the country’s rise to the fifth-largest economy in the world and cultivated a burgeoning middle class. For India’s sake, western leaders need to be more outspoken in condemning the Indian government’s attacks on civil society and free speech. If Modi fails to reverse course, his vision of India as a superpower will remain only a fantasy.",
        "Thanks for posting the article!\n\nJust sad to see the country I grew up in in hands of these goons! \n\nFuck Modi and Shah and fuck those who support them!",
        "no not at all",
        "Thanks To ‘the most honest man who works 18 hours a day and also has used every technology before they invented’.",
        "More people need to wake up to this. People who blindly support ALL actions by any one party are very shortsighted. Each action has to be objectively analysed against one's own moral beliefs. \n\nBut we have no shortage of people who will support EVERY action of one party while condemning EVERY action of the opposition. How is that healthy? That kind of blind support is what led us to this imbalance of power. Supporters of Modi can rejoice today. But some day, their own kids will realize how unconditional support towards an unchecked power made things worse in the long run.",
        "We're a dictatorship now"
    ],
    "cleaned_text": "indias democratic backsliding decline political freedoms narendra modi tragic country world ",
    "cleaned_title": "indias democratic backsliding",
    "cleaned_selftext": "decline political freedoms narendra modi tragic country world",
    "cleaned_comments": "paywall pasting article india soon officially worlds populous country claim largest democracy however wearing thin thursday court gujarat home state prime minister narendra modi rejected appeal indias prominent opposition politician rahul gandhi seeking stay dubious defamation conviction prompted parliament eject seat could face twoyear jail sentence disqualification next years election gandhis legal troubles one extreme examples widespread democratic decline modis india bad news bn people also world democratic values pressure globally economic fragmentation afoot indias vibrant techsavvy population rapidly growing economy precious assets robust inclusive truly democratic india might serve counterweight china global role model matters everyone ever clearer modis bharatiya janata party ready use tools disposal bend indias democratic institutions ends since bjp defeated gandhis indian national congress party hindu nationalist platform modis backers stifled free expression across media civil society politics stoked interreligious tensions indias muslim minority fear speaking modi common public life freedom house us ngo downgraded country free partly free swedenbased vdem institute considers india electoral autocracy alongside likes russia turkey journalists deemed critical bjp frequently experience online harassment sometimes legal repercussions government exerts enormous influence media outlets ties owners editors pressured toe government line foreign media immune february tax inspectors raided bbc shortly broadcaster aired documentary critical modi academics thinktanks foreign nonprofit groups pressure week authorities carried new searches oxfam india alleged foreign funding violations undermining political opponents also goes beyond congress party senior figure aam aadmi party indias secondbiggest opposition party detention alleged excise fraud leader delhis chief minister arvind kejriwal also questioned sunday crackdown dissent india damaging prospects country needs robust open public debate help address challenges holding back reaching full potential include chronic unemployment high illiteracy crony capitalism recent investigation us short selling group hindenburg research companies owned gautam adani tycoon ties modi also raised important questions west sees india democratic economic counterweight china disillusionment xi jinping prompted western leaders turn lamentably blind eye modis actions visit last week us commerce secretary gina raimondo gushed popular world leader reason businesses investors see opportunities india growth diversification away china weakening rule law make think twice indias democracy never perfect achieved impressive results supported countrys rise fifthlargest economy world cultivated burgeoning middle class indias sake western leaders need outspoken condemning indian governments attacks civil society free speech modi fails reverse course vision india superpower remain fantasy thanks posting article sad see country grew hands goons fuck modi shah fuck support thanks honest man works hours day also used every technology invented people need wake people blindly support actions one party shortsighted action objectively analysed ones moral beliefs shortage people support every action one party condemning every action opposition healthy kind blind support led us imbalance power supporters modi rejoice today day kids realize unconditional support towards unchecked power made things worse long run dictatorship",
    "light_cleaned_title": "India’s democratic backsliding",
    "light_cleaned_selftext": "Decline of political freedoms under Narendra Modi is tragic for the country and the world",
    "light_cleaned_comments": "Paywall, so pasting article below: India will soon officially be the world’s most populous country. Its claim to be the largest democracy, however, is wearing thin. On Thursday a court in Gujarat, the home state of Prime Minister Narendra Modi, rejected an appeal by India’s most prominent opposition politician, Rahul Gandhi, seeking a stay on a dubious defamation conviction that prompted parliament to eject him from his seat. He could face a two-year jail sentence and disqualification from next year’s election. Gandhi’s legal troubles are one of the most extreme examples of widespread democratic decline in Modi’s India. That is bad news not only for its 1.4bn people, but also for the world. With democratic values under pressure globally and economic fragmentation afoot, India’s vibrant, tech-savvy population and rapidly growing economy are precious assets. A robust, inclusive and truly democratic India that might serve as a counterweight to China and as a global role model matters for everyone. But it is ever clearer that Modi’s Bharatiya Janata party is ready to use all tools at its disposal to bend India’s democratic institutions to its own ends. Since the BJP defeated Gandhi’s Indian National Congress party in 2014 on a Hindu nationalist platform, Modi’s backers have stifled free expression across media, civil society, and politics, and have stoked inter-religious tensions with India’s Muslim minority. Fear of speaking out against Modi is common in public life. Freedom House, a US NGO, has downgraded the country from “free” in 2021 to “partly free” now while the Sweden-based V-Dem Institute considers India an “electoral autocracy”, alongside the likes of Russia and Turkey. Journalists deemed critical of the BJP frequently experience online harassment and sometimes legal repercussions. The government exerts enormous influence on media outlets through its ties with owners, and editors are pressured to toe the government line. Foreign media are not immune. In February tax inspectors raided the BBC, shortly after the broadcaster aired a documentary critical of Modi. Academics, think-tanks and foreign non-profit groups are under pressure too. Just this week authorities carried out new searches at Oxfam India over alleged foreign funding violations. The undermining of political opponents also goes beyond the Congress party. A senior figure in the Aam Aadmi party, India’s second-biggest opposition party, is in detention over alleged excise fraud and its leader and Delhi’s chief minister Arvind Kejriwal was also questioned on Sunday. With the crackdown on dissent, India is damaging its own prospects. The country needs robust and open public debate to help it address challenges that are holding it back from reaching its full potential. These include chronic unemployment, high illiteracy, and crony capitalism. A recent investigation by US short selling group Hindenburg Research into companies owned by Gautam Adani, a tycoon with ties to Modi, has also raised important questions. The west sees India as a democratic and economic counterweight to China. But disillusionment with Xi Jinping has prompted western leaders to turn a lamentably blind eye to Modi’s actions. On a visit last week US commerce secretary Gina Raimondo gushed that “he is the most popular world leader for a reason”. Businesses and investors see opportunities in India for growth and diversification away from China. But the weakening rule of law will make them think twice. India’s democracy has never been perfect, but it has achieved impressive results. It has supported the country’s rise to the fifth-largest economy in the world and cultivated a burgeoning middle class. For India’s sake, western leaders need to be more outspoken in condemning the Indian government’s attacks on civil society and free speech. If Modi fails to reverse course, his vision of India as a superpower will remain only a fantasy. Thanks for posting the article! Just sad to see the country I grew up in in hands of these goons! Fuck Modi and Shah and fuck those who support them! no not at all Thanks To ‘the most honest man who works 18 hours a day and also has used every technology before they invented’. More people need to wake up to this. People who blindly support ALL actions by any one party are very shortsighted. Each action has to be objectively analysed against one's own moral beliefs. But we have no shortage of people who will support EVERY action of one party while condemning EVERY action of the opposition. How is that healthy? That kind of blind support is what led us to this imbalance of power. Supporters of Modi can rejoice today. But some day, their own kids will realize how unconditional support towards an unchecked power made things worse in the long run. We're a dictatorship now"
}