{
    "id": "thkgl2",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/thkgl2/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 16,
    "num_comments": 10,
    "created_utc": 1647653401,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Watched the Turning Red and Encanto back-to-back. Amazing movies!",
        "Jalsa, slow moving character study. 2/5.\nTurning Red was good, but don’t expect a Pixar gem. 3/5",
        "In the last week, I watched -\n\nMovies - Blue Jasmine, Nightmare Alley, Don't Look Up &amp; The Devil wears Prada.\n\nHighly recommend all of them. Especially Don't Look Up &amp;, Nightmare Alley.  They were so good!\n\n&amp;#x200B;\n\nTV series - Parks &amp; Recreation\n\nIf you want to cope with something or want an escape.\n\n&amp;#x200B;\n\nEdit - \n\nPodcast -[Mark Zukerberg on Lex Fridman.](https://www.youtube.com/watch?v=5zOHSysMmH0) \n\nI know It's a bit late to post this &amp; many folks may have watched this already, but if you have not, then please give it a go.",
        "So, I watched the Kashmir files today. Here is my take on the film.\r  \n\r  \n1. The movie consists of mainly two part.(non-linear) What happened in Kashmir with pandits around 1990. and recent times. The 1990 part is engaging and used as an tool to spread the propaganda in the other part. (That is what a propaganda movies do. Show some truth and mix it with what they really want to show to you. )\r  \n\r  \n2. Acting is good by all the cast.\r  \n\r  \n3. Cinematography is ok. Not too good but also not too bad.\r  \n\r  \n4. Dialogues are tweaked towards filmmakers goal. e.g. they use the word 'youth leader' for indicating Rajiv Gandhi as prime minister but refrain to say anything about the PM or government of that time. Ignorant viewers lead to guess Rajiv Gandhi was PM that time.\r  \n\r  \n5. Used dialogues like \"Current government supports Kashmiri pandits\". \" Azadi is song of our enemies. Whoever singing azadi is our enemy.\" \"We (kashmiri pandits or hindus) are now 2% of kashmir population we used to be 100% before THEY came.\"\r  \n\r  \n6. It is repeated so many times that it was genocide and not exodus so that every viewer will remember it.\r  \n\r  \n7. They have shown only killings of Kashmiri pandits and not a single one from any other religion. Although they have shown events of 19th Jan 1990 with dates but not a single word about \"Gawkadal massacre\" happened on 21st Jan 1990 .\r  \n\r  \n8. Tried to shown Kashmiri muslims were on terrorist's side and one should not trust muslims even if they are neighbors or friends.\r  \n\r  \n9. Said some things about our current leader to but sadly I don't remember enough to paraphrase.\r  \n\r  \n10. Shown removal of 370 was main demand of kashmiri pandits and solution of their problem.\r  \n\r  \n11. The climax is just usual rightwing drama of \"we were this and that\" in the past before Muslims came. In short, Kashmir is India's part (not because of accession but) because hindus were living there before muslims came.\r  \n\r  \nFinally, yes, the movie is impactful. Average viewer who does not care to or does not want to analyze things will surely be guided (or misguided?? ) by the movie.",
        "++\nI had We don't talk about Bruno and Surface pressure on repeat but turning red is an entirely different emotion!",
        "&gt;I had We don't talk about Bruno and Surface pressure on repeat\n\nEXACTLY SAME!! Absolutely loved those two songs(?). Everything about that was just fantastic!",
        "Watched Juvenile Justice on Netflix. Really enjoyed it .",
        "I have seen Tashkent files, and the editing was bit jarring there and even direction wasn't that smooth. \n\nIs that the case with Kashmir files also ??",
        "The fact that this movie is fucking tax free is just shameless admittance of it being a govt funded right wing propaganda film. My retired father who has been brainwashed by news outlets for the past 10 years would love to see this",
        "not that much. But editing could have been better."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "watched turning red encanto backtoback amazing movies jalsa slow moving character study turning red good dont expect pixar gem last week watched movies blue jasmine nightmare alley dont look amp devil wears prada highly recommend especially dont look amp nightmare alley good ampxb tv series parks amp recreation want cope something want escape ampxb edit podcast mark zukerberg lex fridmanhttpswwwyoutubecomwatchvzohsysmmh know bit late post amp many folks may watched already please give go watched kashmir files today take film movie consists mainly two partnonlinear happened kashmir pandits around recent times part engaging used tool spread propaganda part propaganda movies show truth mix really want show acting good cast cinematography ok good also bad dialogues tweaked towards filmmakers goal eg use word youth leader indicating rajiv gandhi prime minister refrain say anything pm government time ignorant viewers lead guess rajiv gandhi pm time used dialogues like current government supports kashmiri pandits azadi song enemies whoever singing azadi enemy kashmiri pandits hindus kashmir population used came repeated many times genocide exodus every viewer remember shown killings kashmiri pandits single one religion although shown events th jan dates single word gawkadal massacre happened st jan tried shown kashmiri muslims terrorists side one trust muslims even neighbors friends said things current leader sadly dont remember enough paraphrase shown removal main demand kashmiri pandits solution problem climax usual rightwing drama past muslims came short kashmir indias part accession hindus living muslims came finally yes movie impactful average viewer care want analyze things surely guided misguided movie dont talk bruno surface pressure repeat turning red entirely different emotion gti dont talk bruno surface pressure repeat exactly absolutely loved two songs everything fantastic watched juvenile justice netflix really enjoyed seen tashkent files editing bit jarring even direction wasnt smooth case kashmir files also fact movie fucking tax free shameless admittance govt funded right wing propaganda film retired father brainwashed news outlets past years would love see much editing could better",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Watched the Turning Red and Encanto back-to-back. Amazing movies! Jalsa, slow moving character study. 2/5. Turning Red was good, but don’t expect a Pixar gem. 3/5 In the last week, I watched - Movies - Blue Jasmine, Nightmare Alley, Don't Look Up &amp; The Devil wears Prada. Highly recommend all of them. Especially Don't Look Up &amp;, Nightmare Alley. They were so good!  TV series - Parks &amp; Recreation If you want to cope with something or want an escape.  Edit - Podcast -[Mark Zukerberg on Lex Fridman.](https://www.youtube.com/watch?v=5zOHSysMmH0) I know It's a bit late to post this &amp; many folks may have watched this already, but if you have not, then please give it a go. So, I watched the Kashmir files today. Here is my take on the film. 1. The movie consists of mainly two part.(non-linear) What happened in Kashmir with pandits around 1990. and recent times. The 1990 part is engaging and used as an tool to spread the propaganda in the other part. (That is what a propaganda movies do. Show some truth and mix it with what they really want to show to you. ) 2. Acting is good by all the cast. 3. Cinematography is ok. Not too good but also not too bad. 4. Dialogues are tweaked towards filmmakers goal. e.g. they use the word 'youth leader' for indicating Rajiv Gandhi as prime minister but refrain to say anything about the PM or government of that time. Ignorant viewers lead to guess Rajiv Gandhi was PM that time. 5. Used dialogues like \"Current government supports Kashmiri pandits\". \" Azadi is song of our enemies. Whoever singing azadi is our enemy.\" \"We (kashmiri pandits or hindus) are now 2% of kashmir population we used to be 100% before THEY came.\" 6. It is repeated so many times that it was genocide and not exodus so that every viewer will remember it. 7. They have shown only killings of Kashmiri pandits and not a single one from any other religion. Although they have shown events of 19th Jan 1990 with dates but not a single word about \"Gawkadal massacre\" happened on 21st Jan 1990 . 8. Tried to shown Kashmiri muslims were on terrorist's side and one should not trust muslims even if they are neighbors or friends. 9. Said some things about our current leader to but sadly I don't remember enough to paraphrase. 10. Shown removal of 370 was main demand of kashmiri pandits and solution of their problem. 11. The climax is just usual rightwing drama of \"we were this and that\" in the past before Muslims came. In short, Kashmir is India's part (not because of accession but) because hindus were living there before muslims came. Finally, yes, the movie is impactful. Average viewer who does not care to or does not want to analyze things will surely be guided (or misguided?? ) by the movie. ++ I had We don't talk about Bruno and Surface pressure on repeat but turning red is an entirely different emotion! &gt;I had We don't talk about Bruno and Surface pressure on repeat EXACTLY SAME!! Absolutely loved those two songs(?). Everything about that was just fantastic! Watched Juvenile Justice on Netflix. Really enjoyed it . I have seen Tashkent files, and the editing was bit jarring there and even direction wasn't that smooth. Is that the case with Kashmir files also ?? The fact that this movie is fucking tax free is just shameless admittance of it being a govt funded right wing propaganda film. My retired father who has been brainwashed by news outlets for the past 10 years would love to see this not that much. But editing could have been better."
}