{
    "id": "13j0mbq",
    "title": "Controversial 'The Kerala Story' banner near the Kollur Mookambika Temple; Addressing Malayali devotees",
    "url": "https://i.redd.it/hjqks3cii70b1.jpg",
    "selftext": "https://m.varthabharati.in/article/2023_05_16/377554",
    "flair": "Politics",
    "score": 1219,
    "num_comments": 174,
    "created_utc": 1684230676.0,
    "convurl": "https://i.redd.it/hjqks3cii70b1.jpg",
    "comments": [
        "https://m.varthabharati.in/article/2023_05_16/377554",
        "######Mookambika Temple is in Kollur, Udupi district, Karnataka. \n\n>Keralites have this intrinsic, invincible connection with the goddess from ancient days. The temple authorities, the hoteliers and the locals will vouch for this as around 60 percent of the devotees who throng the temple throughout the year are from the neighbouring state.\n\n[Malayalees and goddess Mookambika: The invincible link](https://www.google.com/amp/s/theprint.in/india/malayalees-and-goddess-mookambika-the-invincible-link/1159209/%3famp)",
        "Wow",
        "Xenophobia at it's finest",
        "Utterly shameless fellows! Still you'll have right wingers losing breath when it's called a propaganda film.",
        "Mallu sanghis have come out of their closet. It’s not always that they get a chance to wear their brown chaddis and spread bigotry",
        "Ma => North indians not kannadigas posting this",
        "Disgraceful!!! \n\nIf the strength of your faith is dependent on the success of a movie, then you don't really have faith.",
        "It's Udupi, more radical and hindutvadi than many north indians",
        "This temple is in Kollur Karnataka and the banners are put up by the local Hindu Jagarana Vedike outfit made of Kannadigas, apparently at the temple entrance and around its premises.\n\nI'd say the most interesting thing here is not so much about Mallus but what it reveals about Kannadiga Hindus. Neither the temple authorities nor other Hindus there seem offended by this logic that says the only way to be a devout Hindu is through fear of Muslims, not through anything positive or spiritual about Hinduism itself.",
        "Please file a police complaint about spreading enmity",
        "Is there no law against this?",
        "Myre matram",
        "If I am in Congress I will place banners about joblessness and  lack of opportunities in higher education. The temple attracts parents of such folks.",
        "Keep propaganda films away from religious bodies.  Temples and religion are powerful self-sustainable bodies.",
        "~~State~~ Religion sponsored propaganda movie.",
        "Oh i thought this was in kerala…sorry about that",
        "State sponsored propaganda, wonder if this is what Hitler's Germany looked like",
        "It's apparently not too different? You could look how propaganda worked under Hitler's Germany. You'll immediately see the scary parallels.",
        "Hear me out. If u have watched inglorious basterds, u know what I mean. Replace that soldier/actor with Akshay Kumar. Perfectly fits in",
        "Apparently not! It requires a movie to reinstate faith in people.",
        "Mookambika khush hua!\n\n\n\nEdit: I'm sorry. I know it's insensitive. Par achha wordplay tha.",
        "Movie is art form , people will forget such movies in couple of years. e.g. nobody likes Rang de basanti now days... It's trendy thing.",
        "It did.",
        "Imagine having the awareness of a toddler.",
        "That's because the Sangh organizations like RSS, ABVP etc. were literally inspired by and modeled after similar fanatical groups that followed Hitler. The same goes for their playbook as well. Gujarat Pogrom and the more recent Delhi Pogrom follow the same pattern as the Kristallnacht.",
        "Temples are about belief and movies are about society. Society should not change your belief system.",
        "If you want your generations to stay away from BS, Watch \"The GUJARAT Story\"",
        "I’d think Ma Mookambika can make arrangements herself.",
        "On point.",
        "Who could be his lover/killer?",
        "Very sus that's it's written Ma Mookambika, and not Amme Mookambike",
        "I think even their uniform is inspired by the ones worn by the regular workers of the Nazi party and the Italian National Fascist Party.",
        "They would have liked it if it was Akshay Kumar playing Aamir Khan's character.",
        "True. also, only true patriot can truly understand last scene of RDB.",
        "80 se upar IQ na hoga aapka",
        "It's in Udupi district , one of the few districts which BJP swept completely in recent Karnataka elections.",
        "The irony",
        "Coastal Karnataka is the worst",
        "We will know that when the theatre of some propaganda premiere blows up.",
        "But kristallnacht was more of a purge of one faction of the nazi party, as the himmler sect of the party won the popularity contest.",
        "Teri family chali gayi kya usme?",
        "Shows how much  Karanataka has degraded over the years. Truly the UP of the South.",
        "Now start working for investigation agency you are good at it",
        "The very fact that you said nothing to the person who made word play with a hindu god but you have problems when i do the same with Alah, says a lot about your IQ. \nRhi baat meri IQ ki? It's definitely more than a madarsa chap.",
        "All in all. This move has made it two both of the eyes of a bull.\n\n1. Propoganda\n2. Sweet big money",
        "Man, this is the height of disrespect towards your own gods & Goddesses. And, we all know who can do this among the current parties. Anyway, whoever did this I don't understand how you can be considered of that faith?",
        "I was the one who made wordplay on the name of the hindu God and I make fun of all Gods and their prophets/godmen including your dear Allah.\n\nI belong to the shakta sect, a worphipper of Kali. \n\nAgain, IQ.",
        "https://en.m.wikipedia.org/wiki/Kristallnacht\n\n> Kristallnacht or the Night of Broken Glass, also called the November pogrom(s) was a pogrom against Jews carried out by the Nazi Party's Sturmabteilung (SA) paramilitary and Schutzstaffel (SS) paramilitary forces along with some participation from the Hitler Youth and German civilians throughout Nazi Germany on 9–10 November 1938. The German authorities looked on without intervening. The name Kristallnacht (literally 'Crystal Night') comes from the shards of broken glass that littered the streets after the windows of Jewish-owned stores, buildings and synagogues were smashed.",
        "My bad, I got confused with this https://en.m.wikipedia.org/wiki/Night_of_the_Long_Knives",
        "Has anyone seen the movie. Is it any good?",
        "Don’t give them ideas man",
        "Hindutva has reduced hindus to just hating muslims. I don’t even remember the last time someone talked about hindu values anywhere. Any movie related to religion ends into boycotts and controversy, any jokes on religion will send one to jail, any attempt to remind people of their own values will get you declared as anti-national. \n\nAnd they think someone else is eroding their culture.  🤣🤣🤣",
        "![gif](giphy|LQov3wazaKZK0lvUad|downsized)"
    ],
    "cleaned_text": "controversial kerala story banner near kollur mookambika temple addressing malayali devotees  ",
    "cleaned_title": "controversial kerala story banner near kollur mookambika temple addressing malayali devotees",
    "cleaned_selftext": "",
    "cleaned_comments": "mookambika temple kollur udupi district karnataka keralites intrinsic invincible connection goddess ancient days temple authorities hoteliers locals vouch around percent devotees throng temple throughout year neighbouring state malayalees goddess mookambika invincible linkhttpswwwgooglecomampstheprintinindiamalayaleesandgoddessmookambikatheinvinciblelinkfamp wow xenophobia finest utterly shameless fellows still youll right wingers losing breath called propaganda film mallu sanghis come closet always get chance wear brown chaddis spread bigotry north indians kannadigas posting disgraceful strength faith dependent success movie dont really faith udupi radical hindutvadi many north indians temple kollur karnataka banners put local hindu jagarana vedike outfit made kannadigas apparently temple entrance around premises id say interesting thing much mallus reveals kannadiga hindus neither temple authorities hindus seem offended logic says way devout hindu fear muslims anything positive spiritual hinduism please file police complaint spreading enmity law myre matram congress place banners joblessness lack opportunities higher education temple attracts parents folks keep propaganda films away religious bodies temples religion powerful selfsustainable bodies state religion sponsored propaganda movie oh thought keralasorry state sponsored propaganda wonder hitlers germany looked like apparently different could look propaganda worked hitlers germany youll immediately see scary parallels hear u watched inglorious basterds u know mean replace soldieractor akshay kumar perfectly fits apparently requires movie reinstate faith people mookambika khush hua edit im sorry know insensitive par achha wordplay tha movie art form people forget movies couple years eg nobody likes rang de basanti days trendy thing imagine awareness toddler thats sangh organizations like rss abvp etc literally inspired modeled similar fanatical groups followed hitler goes playbook well gujarat pogrom recent delhi pogrom follow pattern kristallnacht temples belief movies society society change belief system want generations stay away bs watch gujarat story id think mookambika make arrangements point could loverkiller sus thats written mookambika amme mookambike think even uniform inspired ones worn regular workers nazi party italian national fascist party would liked akshay kumar playing aamir khans character true also true patriot truly understand last scene rdb se upar iq na hoga aapka udupi district one districts bjp swept completely recent karnataka elections irony coastal karnataka worst know theatre propaganda premiere blows kristallnacht purge one faction nazi party himmler sect party popularity contest teri family chali gayi kya usme shows much karanataka degraded years truly south start working investigation agency good fact said nothing person made word play hindu god problems alah says lot iq rhi baat meri iq ki definitely madarsa chap move made two eyes bull propoganda sweet big money man height disrespect towards gods goddesses know among current parties anyway whoever dont understand considered faith one made wordplay name hindu god make fun gods prophetsgodmen including dear allah belong shakta sect worphipper kali iq kristallnacht night broken glass also called november pogroms pogrom jews carried nazi partys sturmabteilung sa paramilitary schutzstaffel ss paramilitary forces along participation hitler youth german civilians throughout nazi germany november german authorities looked without intervening name kristallnacht literally crystal night comes shards broken glass littered streets windows jewishowned stores buildings synagogues smashed bad got confused anyone seen movie good dont give ideas man hindutva reduced hindus hating muslims dont even remember last time someone talked hindu values anywhere movie related religion ends boycotts controversy jokes religion send one jail attempt remind people values get declared antinational think someone else eroding culture gifgiphylqovwazakzklvuaddownsized",
    "light_cleaned_title": "Controversial 'The Kerala Story' banner near the Kollur Mookambika Temple; Addressing Malayali devotees",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "######Mookambika Temple is in Kollur, Udupi district, Karnataka. >Keralites have this intrinsic, invincible connection with the goddess from ancient days. The temple authorities, the hoteliers and the locals will vouch for this as around 60 percent of the devotees who throng the temple throughout the year are from the neighbouring state. [Malayalees and goddess Mookambika: The invincible link](https://www.google.com/amp/s/theprint.in/india/malayalees-and-goddess-mookambika-the-invincible-link/1159209/%3famp) Wow Xenophobia at it's finest Utterly shameless fellows! Still you'll have right wingers losing breath when it's called a propaganda film. Mallu sanghis have come out of their closet. It’s not always that they get a chance to wear their brown chaddis and spread bigotry Ma => North indians not kannadigas posting this Disgraceful!!! If the strength of your faith is dependent on the success of a movie, then you don't really have faith. It's Udupi, more radical and hindutvadi than many north indians This temple is in Kollur Karnataka and the banners are put up by the local Hindu Jagarana Vedike outfit made of Kannadigas, apparently at the temple entrance and around its premises. I'd say the most interesting thing here is not so much about Mallus but what it reveals about Kannadiga Hindus. Neither the temple authorities nor other Hindus there seem offended by this logic that says the only way to be a devout Hindu is through fear of Muslims, not through anything positive or spiritual about Hinduism itself. Please file a police complaint about spreading enmity Is there no law against this? Myre matram If I am in Congress I will place banners about joblessness and lack of opportunities in higher education. The temple attracts parents of such folks. Keep propaganda films away from religious bodies. Temples and religion are powerful self-sustainable bodies. ~~State~~ Religion sponsored propaganda movie. Oh i thought this was in kerala…sorry about that State sponsored propaganda, wonder if this is what Hitler's Germany looked like It's apparently not too different? You could look how propaganda worked under Hitler's Germany. You'll immediately see the scary parallels. Hear me out. If u have watched inglorious basterds, u know what I mean. Replace that soldier/actor with Akshay Kumar. Perfectly fits in Apparently not! It requires a movie to reinstate faith in people. Mookambika khush hua! Edit: I'm sorry. I know it's insensitive. Par achha wordplay tha. Movie is art form , people will forget such movies in couple of years. e.g. nobody likes Rang de basanti now days... It's trendy thing. It did. Imagine having the awareness of a toddler. That's because the Sangh organizations like RSS, ABVP etc. were literally inspired by and modeled after similar fanatical groups that followed Hitler. The same goes for their playbook as well. Gujarat Pogrom and the more recent Delhi Pogrom follow the same pattern as the Kristallnacht. Temples are about belief and movies are about society. Society should not change your belief system. If you want your generations to stay away from BS, Watch \"The GUJARAT Story\" I’d think Ma Mookambika can make arrangements herself. On point. Who could be his lover/killer? Very sus that's it's written Ma Mookambika, and not Amme Mookambike I think even their uniform is inspired by the ones worn by the regular workers of the Nazi party and the Italian National Fascist Party. They would have liked it if it was Akshay Kumar playing Aamir Khan's character. True. also, only true patriot can truly understand last scene of RDB. 80 se upar IQ na hoga aapka It's in Udupi district , one of the few districts which BJP swept completely in recent Karnataka elections. The irony Coastal Karnataka is the worst We will know that when the theatre of some propaganda premiere blows up. But kristallnacht was more of a purge of one faction of the nazi party, as the himmler sect of the party won the popularity contest. Teri family chali gayi kya usme? Shows how much Karanataka has degraded over the years. Truly the UP of the South. Now start working for investigation agency you are good at it The very fact that you said nothing to the person who made word play with a hindu god but you have problems when i do the same with Alah, says a lot about your IQ. Rhi baat meri IQ ki? It's definitely more than a madarsa chap. All in all. This move has made it two both of the eyes of a bull. 1. Propoganda 2. Sweet big money Man, this is the height of disrespect towards your own gods & Goddesses. And, we all know who can do this among the current parties. Anyway, whoever did this I don't understand how you can be considered of that faith? I was the one who made wordplay on the name of the hindu God and I make fun of all Gods and their prophets/godmen including your dear Allah. I belong to the shakta sect, a worphipper of Kali. Again, IQ. > Kristallnacht or the Night of Broken Glass, also called the November pogrom(s) was a pogrom against Jews carried out by the Nazi Party's Sturmabteilung (SA) paramilitary and Schutzstaffel (SS) paramilitary forces along with some participation from the Hitler Youth and German civilians throughout Nazi Germany on 9–10 November 1938. The German authorities looked on without intervening. The name Kristallnacht (literally 'Crystal Night') comes from the shards of broken glass that littered the streets after the windows of Jewish-owned stores, buildings and synagogues were smashed. My bad, I got confused with this Has anyone seen the movie. Is it any good? Don’t give them ideas man Hindutva has reduced hindus to just hating muslims. I don’t even remember the last time someone talked about hindu values anywhere. Any movie related to religion ends into boycotts and controversy, any jokes on religion will send one to jail, any attempt to remind people of their own values will get you declared as anti-national. And they think someone else is eroding their culture. 🤣🤣🤣 ![gif](giphy|LQov3wazaKZK0lvUad|downsized)"
}