{
    "id": "nnck50",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/nnck50/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**The Movies and Shows Thread is posted every two weeks on Saturday mornings.**\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 26,
    "num_comments": 57,
    "created_utc": 1622251816,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Mare Of Eastown. Mystery + Drama miniseries by HBO. Kate Winslet plays a police officer trying to solve a murder while battling with her personal trauma. Super thrilling and engaging right from the first episode. Everyone acts superbly well. Finale (7th episode) airs this Sunday.",
        "None of the new stuff intrigues me anymore, been around 8 months since I watched an Indian film.\n\nCheck out Lex Fridman's podcasts.",
        "November story is a decent watch however they could have done a better job with dubbing.",
        "Cukur and Who killed captain alex",
        "Animal Farm \n\nhttps://www.youtube.com/watch?v=XXkicQRl6vg",
        "The Imposter",
        "Trapped on Netflix is good",
        "I watched the documentary [The Balkans in Flames](https://docuwiki.net/index.php?title=The_Balkans_in_Flames) about Yugoslavia's disintegration into Slovenia, Croatia, Bosnia-Herzgovina, Serbia, Albania after Tito's death in 1980. I didn't have much knowledge of this except for whatever I saw in the hollywood movie *The Peacemakers,* starring George Clooney.",
        "If I get the time, I'm thinking of watching Family Man S1 on prime the one starring Manoj Bajpai",
        "Might watch \"Operation Java\"",
        "Caliphate. Fast paced no BS Swedish series.",
        "“Becoming You”  on Apple TV was a great watch",
        "Please suggest some Sci-fi shows/movies with MAJOR focus on getting the scientific accuracy right. I'm not talking about movies like Armageddon, but like Gravity, or Interstellar, Expanse, Martian.. the like.",
        "[Primer](https://letterboxd.com/film/primer/) directed by Shane Carruth, [Predestination](https://letterboxd.com/film/predestination/), [Ex Machina](https://letterboxd.com/film/ex-machina-2014/), [Arrival](https://letterboxd.com/film/arrival-2016/), [Annihilation](https://letterboxd.com/film/annihilation/)",
        "Might watch 'Radhe' and actively try not to lose the few brain cells I have left.",
        "Check out the SNL sketch called ‘Murder Durder’ after. Hilarious take on MoE",
        "Apple TV+ has some really good shows. So far i have watched - Ted Lasso, The Morning Show, For All Mankind, Defending Jacob and Servant and they all have been really really good (especially Ted Lasso, For All Mankind and The Morning Show)",
        "For All Mankind",
        "Trying to watch *the wire*. About six episodes in. Don't see how this is better than *breaking bad*. Maybe I should give it a few more episodes.",
        "Check out 'The Expanse' on Amazon Prime",
        "ZeroZeroZero is a top notch crime drama",
        "The Wire starts slow. But has the most brilliant and realistic representation of American drug trade/police/politics. It is not a show about high octane thriller like Breaking Bad. I find it to be much more engaging than BB tbh.",
        "Watch annihilation and ex-machina.",
        "It's my favorite show of all time but it's not entertaining in the conventional sense (atleast early on). You really have to give it your complete attention. There's so much symbolism portrayed through scenes or dialogues which otherwise might not seem that important. A good example is the scene where the guys are pushing the desk stuck across the doorway, but unknowingly doing so in opposite directions - it's essentially a commentary on the war of drugs. You need to notice stuff like this to fully appreciate The Wire. I have rewatched it 3 times now and every single time I notice something new. \n\nIf you wanna watch something more along the lines of Breaking Bad, watch The Sopranos. It's just as symbolically richly as The Wire, but more conventionally entertaining.",
        "Planning to watch 'The Disciple' today.",
        "This was good. Thanks!",
        "I love slow cinema (tarkovsky, Tsai ming liang). But the disciple is just a slow movie with minimal poetry. Still miles ahead for indian standards.",
        "Need some good recommendations for conspiracy theories and mystery podcasts.\n\n&gt;!Kisi ne George Soros bola toh gand faad dunga!&lt;",
        "Watched Invincible enjoyed it very much.",
        "It's awesome. I finished the series few days ago. I am reading comic now.",
        "Watched *Shirkers* on Netflix. Enjoyed it a lot.",
        "Any recommendations for self improvement or related to it?",
        "Black Mirror on Netflix is amazing.",
        "watched 'the last hour' Amazon prime. Enjoyed lot. A series with new concept. Must watch",
        "Watch *Gattaca (1997)*. It's been hailed as one of the most accurate sci-fi movies of all time. CRISPR solidified its status.",
        "Europa Report.   \n\n\nAvailable for free on YouTube. Thank me later.",
        "Where do I download the comic from?",
        "Watched Wolfwalkers, it's a great watch if you appreciate animated movies.",
        "Watched Schitt's Creek. Nice, feel-good series.\nThanks r/india for recommending it in previous threads.",
        "I mostly get obsessed over Physics and logic in general.\n\nThe Expanse is &lt;3. Similar shows that I've read highly praised on reddit are Battlestar Galactica, Stargate and Firefly. \n\nThe show Travellers has a pretty good story and it's sci-fi element is mostly convincing.\n\nI've heard Mr. Robot gets most of it's hacking techniques and terminal commands right.\n\nWill edit this comment if I remember something in future.",
        "I agree with the rest of your comment but Battlestar Galactica is absolutely NOT scientifically accurate at all. I think I watched till season 2(I _will_ get back to it someday), and don't get me wrong, I do love the show and the characters are very interesting, but you can clearly see that getting the Science right was not a priority for them. \n\nAgree with Expanse though. I've read all the books and watched the show at least 3 times. Haven't found a sci-fi that comes close to that, yet.",
        "Hahaha. 😂😂",
        "Hang in there it gets better. But don't go ahead expecting that it's better than Anny other show.\n\nIt's really really good show, watch it first and then make comparisons. It's not like if it's not better than breaking bad it's not worth watching.\n\nI personally try not to go into watching media with expectations,  because whenever I have done that it has ruined the watching experience.",
        "The innocente on Netflix is amazing",
        "Even I watched. It is nice.",
        "I finished love Death + Robots and was blown away how good it was, sci fi and weird shit ? this is your go to thing.\n\nVery high quality animation and i wonder why it is not more famous.",
        "Blind Chance(1981) by Krzysztof Kieślowski\nand \nBlow up(1966) by Michelangelo Antonioni",
        "Silent Running (1972)\n\nAniara (2018): More like drama\n\nPlanetes(Anime)",
        "Excellent show",
        "Any other similar hidden gems??",
        "Trapped is excellent. If you like it, you can watch others in the same genre (Nordic Noir) -- the Valhalla Murders, Deadwind, Bordertown - all on Netflix. Also Fargo the TV show is quite good",
        "Trackers is also good. South African crime/thriller show. It's on Hotstar.",
        "[check this out](https://youtu.be/DnPmg0R1M04)",
        "thank you for the extended list",
        "\"Banshee\" is great, watch on hotstar",
        "[This site is a great.](https://readcomiconline.li)\n\nI read the comics online."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings",
    "cleaned_comments": "mare eastown mystery drama miniseries hbo kate winslet plays police officer trying solve murder battling personal trauma super thrilling engaging right first episode everyone acts superbly well finale th episode airs sunday none new stuff intrigues anymore around months since watched indian film check lex fridmans podcasts november story decent watch however could done better job dubbing cukur killed captain alex animal farm imposter trapped netflix good watched documentary balkans flameshttpsdocuwikinetindexphptitlethebalkansinflames yugoslavias disintegration slovenia croatia bosniaherzgovina serbia albania titos death didnt much knowledge except whatever saw hollywood movie peacemakers starring george clooney get time im thinking watching family man prime one starring manoj bajpai might watch operation java caliphate fast paced bs swedish series becoming apple tv great watch please suggest scifi showsmovies major focus getting scientific accuracy right im talking movies like armageddon like gravity interstellar expanse martian like primerhttpsletterboxdcomfilmprimer directed shane carruth predestinationhttpsletterboxdcomfilmpredestination ex machinahttpsletterboxdcomfilmexmachina arrivalhttpsletterboxdcomfilmarrival annihilationhttpsletterboxdcomfilmannihilation might watch radhe actively try lose brain cells left check snl sketch called murder durder hilarious take moe apple tv really good shows far watched ted lasso morning show mankind defending jacob servant really really good especially ted lasso mankind morning show mankind trying watch wire six episodes dont see better breaking bad maybe give episodes check expanse amazon prime zerozerozero top notch crime drama wire starts slow brilliant realistic representation american drug tradepolicepolitics show high octane thriller like breaking bad find much engaging bb tbh watch annihilation exmachina favorite show time entertaining conventional sense atleast early really give complete attention theres much symbolism portrayed scenes dialogues otherwise might seem important good example scene guys pushing desk stuck across doorway unknowingly opposite directions essentially commentary war drugs need notice stuff like fully appreciate wire rewatched times every single time notice something new wan na watch something along lines breaking bad watch sopranos symbolically richly wire conventionally entertaining planning watch disciple today good thanks love slow cinema tarkovsky tsai ming liang disciple slow movie minimal poetry still miles ahead indian standards need good recommendations conspiracy theories mystery podcasts gtkisi ne george soros bola toh gand faad dungalt watched invincible enjoyed much awesome finished series days ago reading comic watched shirkers netflix enjoyed lot recommendations self improvement related black mirror netflix amazing watched last hour amazon prime enjoyed lot series new concept must watch watch gattaca hailed one accurate scifi movies time crispr solidified status europa report available free youtube thank later download comic watched wolfwalkers great watch appreciate animated movies watched schitts creek nice feelgood series thanks rindia recommending previous threads mostly get obsessed physics logic general expanse lt similar shows ive read highly praised reddit battlestar galactica stargate firefly show travellers pretty good story scifi element mostly convincing ive heard mr robot gets hacking techniques terminal commands right edit comment remember something future agree rest comment battlestar galactica absolutely scientifically accurate think watched till season get back someday dont get wrong love show characters interesting clearly see getting science right priority agree expanse though ive read books watched show least times havent found scifi comes close yet hahaha hang gets better dont go ahead expecting better anny show really really good show watch first make comparisons like better breaking bad worth watching personally try go watching media expectations whenever done ruined watching experience innocente netflix amazing even watched nice finished love death robots blown away good sci fi weird shit go thing high quality animation wonder famous blind chance krzysztof kielowski blow michelangelo antonioni silent running aniara like drama planetesanime excellent show similar hidden gems trapped excellent like watch others genre nordic noir valhalla murders deadwind bordertown netflix also fargo tv show quite good trackers also good south african crimethriller show hotstar check outhttpsyoutubednpmgrm thank extended list banshee great watch hotstar site greathttpsreadcomiconlineli read comics online",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **The Movies and Shows Thread is posted every two weeks on Saturday mornings.**",
    "light_cleaned_comments": "Mare Of Eastown. Mystery + Drama miniseries by HBO. Kate Winslet plays a police officer trying to solve a murder while battling with her personal trauma. Super thrilling and engaging right from the first episode. Everyone acts superbly well. Finale (7th episode) airs this Sunday. None of the new stuff intrigues me anymore, been around 8 months since I watched an Indian film. Check out Lex Fridman's podcasts. November story is a decent watch however they could have done a better job with dubbing. Cukur and Who killed captain alex Animal Farm The Imposter Trapped on Netflix is good I watched the documentary [The Balkans in Flames](https://docuwiki.net/index.php?title=The_Balkans_in_Flames) about Yugoslavia's disintegration into Slovenia, Croatia, Bosnia-Herzgovina, Serbia, Albania after Tito's death in 1980. I didn't have much knowledge of this except for whatever I saw in the hollywood movie *The Peacemakers,* starring George Clooney. If I get the time, I'm thinking of watching Family Man S1 on prime the one starring Manoj Bajpai Might watch \"Operation Java\" Caliphate. Fast paced no BS Swedish series. “Becoming You” on Apple TV was a great watch Please suggest some Sci-fi shows/movies with MAJOR focus on getting the scientific accuracy right. I'm not talking about movies like Armageddon, but like Gravity, or Interstellar, Expanse, Martian.. the like. [Primer](https://letterboxd.com/film/primer/) directed by Shane Carruth, [Predestination](https://letterboxd.com/film/predestination/), [Ex Machina](https://letterboxd.com/film/ex-machina-2014/), [Arrival](https://letterboxd.com/film/arrival-2016/), [Annihilation](https://letterboxd.com/film/annihilation/) Might watch 'Radhe' and actively try not to lose the few brain cells I have left. Check out the SNL sketch called ‘Murder Durder’ after. Hilarious take on MoE Apple TV+ has some really good shows. So far i have watched - Ted Lasso, The Morning Show, For All Mankind, Defending Jacob and Servant and they all have been really really good (especially Ted Lasso, For All Mankind and The Morning Show) For All Mankind Trying to watch *the wire*. About six episodes in. Don't see how this is better than *breaking bad*. Maybe I should give it a few more episodes. Check out 'The Expanse' on Amazon Prime ZeroZeroZero is a top notch crime drama The Wire starts slow. But has the most brilliant and realistic representation of American drug trade/police/politics. It is not a show about high octane thriller like Breaking Bad. I find it to be much more engaging than BB tbh. Watch annihilation and ex-machina. It's my favorite show of all time but it's not entertaining in the conventional sense (atleast early on). You really have to give it your complete attention. There's so much symbolism portrayed through scenes or dialogues which otherwise might not seem that important. A good example is the scene where the guys are pushing the desk stuck across the doorway, but unknowingly doing so in opposite directions - it's essentially a commentary on the war of drugs. You need to notice stuff like this to fully appreciate The Wire. I have rewatched it 3 times now and every single time I notice something new. If you wanna watch something more along the lines of Breaking Bad, watch The Sopranos. It's just as symbolically richly as The Wire, but more conventionally entertaining. Planning to watch 'The Disciple' today. This was good. Thanks! I love slow cinema (tarkovsky, Tsai ming liang). But the disciple is just a slow movie with minimal poetry. Still miles ahead for indian standards. Need some good recommendations for conspiracy theories and mystery podcasts. &gt;!Kisi ne George Soros bola toh gand faad dunga!&lt; Watched Invincible enjoyed it very much. It's awesome. I finished the series few days ago. I am reading comic now. Watched *Shirkers* on Netflix. Enjoyed it a lot. Any recommendations for self improvement or related to it? Black Mirror on Netflix is amazing. watched 'the last hour' Amazon prime. Enjoyed lot. A series with new concept. Must watch Watch *Gattaca (1997)*. It's been hailed as one of the most accurate sci-fi movies of all time. CRISPR solidified its status. Europa Report. Available for free on YouTube. Thank me later. Where do I download the comic from? Watched Wolfwalkers, it's a great watch if you appreciate animated movies. Watched Schitt's Creek. Nice, feel-good series. Thanks r/india for recommending it in previous threads. I mostly get obsessed over Physics and logic in general. The Expanse is &lt;3. Similar shows that I've read highly praised on reddit are Battlestar Galactica, Stargate and Firefly. The show Travellers has a pretty good story and it's sci-fi element is mostly convincing. I've heard Mr. Robot gets most of it's hacking techniques and terminal commands right. Will edit this comment if I remember something in future. I agree with the rest of your comment but Battlestar Galactica is absolutely NOT scientifically accurate at all. I think I watched till season 2(I _will_ get back to it someday), and don't get me wrong, I do love the show and the characters are very interesting, but you can clearly see that getting the Science right was not a priority for them. Agree with Expanse though. I've read all the books and watched the show at least 3 times. Haven't found a sci-fi that comes close to that, yet. Hahaha. 😂😂 Hang in there it gets better. But don't go ahead expecting that it's better than Anny other show. It's really really good show, watch it first and then make comparisons. It's not like if it's not better than breaking bad it's not worth watching. I personally try not to go into watching media with expectations, because whenever I have done that it has ruined the watching experience. The innocente on Netflix is amazing Even I watched. It is nice. I finished love Death + Robots and was blown away how good it was, sci fi and weird shit ? this is your go to thing. Very high quality animation and i wonder why it is not more famous. Blind Chance(1981) by Krzysztof Kieślowski and Blow up(1966) by Michelangelo Antonioni Silent Running (1972) Aniara (2018): More like drama Planetes(Anime) Excellent show Any other similar hidden gems?? Trapped is excellent. If you like it, you can watch others in the same genre (Nordic Noir) -- the Valhalla Murders, Deadwind, Bordertown - all on Netflix. Also Fargo the TV show is quite good Trackers is also good. South African crime/thriller show. It's on Hotstar. [check this out](https://youtu.be/DnPmg0R1M04) thank you for the extended list \"Banshee\" is great, watch on hotstar [This site is a great.](https://readcomiconline.li) I read the comics online."
}