{
    "id": "1cli71m",
    "title": "Stay clear of Lenskart fraud!",
    "url": "https://twitter.com/amaychandravan1/status/1787459687186616510?t=5nTQrgAH8otQaxU4eJQnlQ&s=19",
    "selftext": "This is the X thread that details my issue. \nI had placed an order for my Lenskart Lens and spectacles recently. But the home agent scammed with me by placing an order through his device and saying that the order will be delivered in 3 days. But it still hasn't been delivered and the customer service is absconding. I wasted my 5.7k but I advise you all to never buy from Lenskart again.",
    "flair": "Rant / Vent",
    "score": 16,
    "num_comments": 7,
    "created_utc": 1714999677.0,
    "convurl": "https://external-preview.redd.it/5GPq-hE2A_rtVYo9LeVu1nYb9vXocO-v3hdv2RMUxLY.jpg?auto=webp&s=fb165ae68efde9c2029106f1614bb39237f44dcf",
    "comments": [
        "Can we not raise a complaint about that home agent or whatever he was",
        "I did try to raise a complaint, but the customer service is not responding. They cut my call after 15-20 seconds.",
        "That's totally unacceptable, did you try correct customer care number",
        "Yes, I chatted with the customer service on the app, they called me and then they cut the call :)",
        "Try r/LegalAdviceIndia or maybe tag [Broseph]",
        "Sure"
    ],
    "cleaned_text": "stay clear lenskart fraud x thread details issue placed order lenskart lens spectacles recently home agent scammed placing order device saying order delivered days still hasnt delivered customer service absconding wasted k advise never buy lenskart ",
    "cleaned_title": "stay clear lenskart fraud",
    "cleaned_selftext": "x thread details issue placed order lenskart lens spectacles recently home agent scammed placing order device saying order delivered days still hasnt delivered customer service absconding wasted k advise never buy lenskart",
    "cleaned_comments": "raise complaint home agent whatever try raise complaint customer service responding cut call seconds thats totally unacceptable try correct customer care number yes chatted customer service app called cut call try rlegaladviceindia maybe tag broseph sure",
    "light_cleaned_title": "Stay clear of Lenskart fraud!",
    "light_cleaned_selftext": "This is the X thread that details my issue. I had placed an order for my Lenskart Lens and spectacles recently. But the home agent scammed with me by placing an order through his device and saying that the order will be delivered in 3 days. But it still hasn't been delivered and the customer service is absconding. I wasted my 5.7k but I advise you all to never buy from Lenskart again.",
    "light_cleaned_comments": "Can we not raise a complaint about that home agent or whatever he was I did try to raise a complaint, but the customer service is not responding. They cut my call after 15-20 seconds. That's totally unacceptable, did you try correct customer care number Yes, I chatted with the customer service on the app, they called me and then they cut the call :) Try r/LegalAdviceIndia or maybe tag [Broseph] Sure"
}