{
    "id": "12o3gtq",
    "title": "Does anyone have any experience with home gym equipment from cult.fit?",
    "url": "https://www.reddit.com/r/india/comments/12o3gtq/does_anyone_have_any_experience_with_home_gym/",
    "selftext": "Looking to buy an exercise bike or an elliptical for my parents to use at home. Has anyone used equipment sold by cult.fit? How has your experience been? Looking at these models:\n\nBike: [https://cultsport.com/fk4000-13-2lbs-flywheel-with-free-installation-spinner-exercise-bike/product/4164](https://cultsport.com/fk4000-13-2lbs-flywheel-with-free-installation-spinner-exercise-bike/product/4164)\n\nElliptical: [https://cultsport.com/smartcross-b1-bluetooth-enabled-elliptical-cross-trainer/product/4261](https://cultsport.com/smartcross-b1-bluetooth-enabled-elliptical-cross-trainer/product/4261)\n\nOr if you have any recommendations for equipment from other brands then that would be helpful too.",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 5,
    "created_utc": 1681639391.0,
    "convurl": "https://external-preview.redd.it/jO93rZeYJf2Tgjt25dsiGNkQjUJ95l11QIKf98eqwmk.jpg?auto=webp&v=enabled&s=fe7bbdd86850edfd4c0b4bc01e278ca61185eca0",
    "comments": [
        " Hey there, have you bought it? What has been your experience so far?",
        "No, I did not buy it. Joined gym instead",
        "Let me know if you have any queries. I have personal experience with their equipment",
        "I am looking for an exercise bike from them. Do you have any suggestions? Something around 10-15k preferably",
        "Dont buy it.  I bought and it broke in afew days and instead of replacing they sent a repairman after months. Still could not fix it.",
        "yes I want to know more about their workouts and how the gyms are"
    ],
    "cleaned_text": "anyone experience home gym equipment cultfit looking buy exercise bike elliptical parents use home anyone used equipment sold cultfit experience looking models bike httpscultsportcomfklbsflywheelwithfreeinstallationspinnerexercisebikeproducthttpscultsportcomfklbsflywheelwithfreeinstallationspinnerexercisebikeproduct elliptical httpscultsportcomsmartcrossbbluetoothenabledellipticalcrosstrainerproducthttpscultsportcomsmartcrossbbluetoothenabledellipticalcrosstrainerproduct recommendations equipment brands would helpful ",
    "cleaned_title": "anyone experience home gym equipment cultfit",
    "cleaned_selftext": "looking buy exercise bike elliptical parents use home anyone used equipment sold cultfit experience looking models bike httpscultsportcomfklbsflywheelwithfreeinstallationspinnerexercisebikeproducthttpscultsportcomfklbsflywheelwithfreeinstallationspinnerexercisebikeproduct elliptical httpscultsportcomsmartcrossbbluetoothenabledellipticalcrosstrainerproducthttpscultsportcomsmartcrossbbluetoothenabledellipticalcrosstrainerproduct recommendations equipment brands would helpful",
    "cleaned_comments": "hey bought experience far buy joined gym instead let know queries personal experience equipment looking exercise bike suggestions something around k preferably dont buy bought broke afew days instead replacing sent repairman months still could fix yes want know workouts gyms",
    "light_cleaned_title": "Does anyone have any experience with home gym equipment from cult.fit?",
    "light_cleaned_selftext": "Looking to buy an exercise bike or an elliptical for my parents to use at home. Has anyone used equipment sold by cult.fit? How has your experience been? Looking at these models: Bike: [https://cultsport.com/fk4000-13-2lbs-flywheel-with-free-installation-spinner-exercise-bike/product/4164](https://cultsport.com/fk4000-13-2lbs-flywheel-with-free-installation-spinner-exercise-bike/product/4164) Elliptical: [https://cultsport.com/smartcross-b1-bluetooth-enabled-elliptical-cross-trainer/product/4261](https://cultsport.com/smartcross-b1-bluetooth-enabled-elliptical-cross-trainer/product/4261) Or if you have any recommendations for equipment from other brands then that would be helpful too.",
    "light_cleaned_comments": "Hey there, have you bought it? What has been your experience so far? No, I did not buy it. Joined gym instead Let me know if you have any queries. I have personal experience with their equipment I am looking for an exercise bike from them. Do you have any suggestions? Something around 10-15k preferably Dont buy it. I bought and it broke in afew days and instead of replacing they sent a repairman after months. Still could not fix it. yes I want to know more about their workouts and how the gyms are"
}