{
    "id": "ueakah",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/ueakah/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, eating places, pictures, experiences etc.\n\n**Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 6,
    "num_comments": 8,
    "created_utc": 1651195808,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "How do I make cheese at home? Not paneer!",
        "Maggi me peanut butter, soya sauce aur vinegar daalo with sauteed garlic, green chilli and garlic. Does not taste as bad as it sounds",
        "* Get the best khari money can buy.\n\n* dip in honey.\n\n* roll in crushed salted pistachios\n\n\nand you have quick baklava",
        "You can't. Cheese is prepared by treating milk with rennin enzyme.",
        "Where can I buy this enzyme in India?",
        "I don't think it's available in retail market. It's industrially prepared.",
        "/r/cheesemaking /r/cheesemonger",
        "Asked my Bengali maid to make khichdi as wife had upset tummy. She put heeng in it. Is that a thing in Bengali-style khichdi? Or in all khichdi? It’s never made like that in our home."
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "make cheese home paneer maggi peanut butter soya sauce aur vinegar daalo sauteed garlic green chilli garlic taste bad sounds get best khari money buy dip honey roll crushed salted pistachios quick baklava cant cheese prepared treating milk rennin enzyme buy enzyme india dont think available retail market industrially prepared rcheesemaking rcheesemonger asked bengali maid make khichdi wife upset tummy put heeng thing bengalistyle khichdi khichdi never made like home",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, eating places, pictures, experiences etc. **Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "How do I make cheese at home? Not paneer! Maggi me peanut butter, soya sauce aur vinegar daalo with sauteed garlic, green chilli and garlic. Does not taste as bad as it sounds * Get the best khari money can buy. * dip in honey. * roll in crushed salted pistachios and you have quick baklava You can't. Cheese is prepared by treating milk with rennin enzyme. Where can I buy this enzyme in India? I don't think it's available in retail market. It's industrially prepared. /r/cheesemaking /r/cheesemonger Asked my Bengali maid to make khichdi as wife had upset tummy. She put heeng in it. Is that a thing in Bengali-style khichdi? Or in all khichdi? It’s never made like that in our home."
}