{
    "id": "15j4sdg",
    "title": "What does the guy say in the beginning?",
    "url": "https://www.reddit.com/r/india/comments/15j4sdg/what_does_the_guy_say_in_the_beginning/",
    "selftext": "So my brother and I have kind of been obsessed with this video in the past couple of years: https://www.youtube.com/watch?v=kGiKg502anI\n\nThe guy seems to be saying some kind of prayer at the beginning, then he addresses the crowd and they all shout something back. What exactly is he saying?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691264775.0,
    "convurl": "https://external-preview.redd.it/hen_BdRgg2WLBhDjvw3IEqAlh4wrfGFAHaX6zyw2o54.jpg?auto=webp&s=9790510b616288bd9ea76ac0e0be148884b29f3e",
    "comments": [
        "He says in Kannada: \"Don't clap for me. Claps are only for politicians. To give me energy, whistle!\"\n\nSomeone then whistles. And the crowd shouts \"Say victory to mother India\" in Hindi (it's a popular slogan to show enthusiasm here).",
        "Yes! Thank you, sir."
    ],
    "cleaned_text": "guy say beginning brother kind obsessed video past couple years guy seems saying kind prayer beginning addresses crowd shout something back exactly saying ",
    "cleaned_title": "guy say beginning",
    "cleaned_selftext": "brother kind obsessed video past couple years guy seems saying kind prayer beginning addresses crowd shout something back exactly saying",
    "cleaned_comments": "says kannada dont clap claps politicians give energy whistle someone whistles crowd shouts say victory mother india hindi popular slogan show enthusiasm yes thank sir",
    "light_cleaned_title": "What does the guy say in the beginning?",
    "light_cleaned_selftext": "So my brother and I have kind of been obsessed with this video in the past couple of years: The guy seems to be saying some kind of prayer at the beginning, then he addresses the crowd and they all shout something back. What exactly is he saying?",
    "light_cleaned_comments": "He says in Kannada: \"Don't clap for me. Claps are only for politicians. To give me energy, whistle!\" Someone then whistles. And the crowd shouts \"Say victory to mother India\" in Hindi (it's a popular slogan to show enthusiasm here). Yes! Thank you, sir."
}