{
    "id": "14gl5z5",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/14gl5z5/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, eating places, pictures, experiences etc.\n\n**Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=7b05ed23b7e6dff392ae637a98524e812dfb4791",
    "flair": "Scheduled",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1687483809.0,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        " \n\nPalak Paneer Recipe: Ingredients:\n\n* 200 grams paneer (cottage cheese), cut into cubes\n* 500 grams spinach leaves, washed and blanched\n* 1 tablespoon oil or ghee (clarified butter)\n* 1 teaspoon cumin seeds\n* 1 medium onion, finely chopped\n* 2 teaspoons ginger-garlic paste\n* 2 green chilies, finely chopped (adjust according to spice preference)\n* 1 teaspoon turmeric powder\n* 1 teaspoon coriander powder\n* 1/2 teaspoon garam masala\n* Salt to taste\n* 1/4 cup heavy cream (optional, for added richness)\n\nInstructions:\n\n1. Blanch the spinach leaves: Boil water in a large pot, add the spinach leaves, and blanch for about 2 minutes. Drain and immediately transfer the spinach to a bowl of ice water. This helps retain the bright green color. Drain again and blend the blanched spinach to a smooth puree. Set aside.\n2. In a pan, heat oil or ghee over medium heat. Add cumin seeds and let them splutter.\n3. Add the finely chopped onion and sauté until golden brown.\n4. Add ginger-garlic paste and green chilies. Sauté for a minute until the raw smell disappears.\n5. Add turmeric powder, coriander powder, and garam masala. Mix well and cook for a minute.\n6. Pour in the spinach puree and mix well. Cook for 5-7 minutes, stirring occasionally.\n7. Add salt to taste and mix well. Adjust the consistency of the gravy by adding water if needed.\n8. Gently add the paneer cubes to the spinach gravy. Cook for 2-3 minutes, allowing the flavors to blend.\n9. Optional: Stir in the heavy cream for added richness. Cook for another minute.\n10. Serve hot with naan, roti, or rice."
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadrestrictsronsortnewtall",
    "cleaned_comments": "palak paneer recipe ingredients grams paneer cottage cheese cut cubes grams spinach leaves washed blanched tablespoon oil ghee clarified butter teaspoon cumin seeds medium onion finely chopped teaspoons gingergarlic paste green chilies finely chopped adjust according spice preference teaspoon turmeric powder teaspoon coriander powder teaspoon garam masala salt taste cup heavy cream optional added richness instructions blanch spinach leaves boil water large pot add spinach leaves blanch minutes drain immediately transfer spinach bowl ice water helps retain bright green color drain blend blanched spinach smooth puree set aside pan heat oil ghee medium heat add cumin seeds let splutter add finely chopped onion saut golden brown add gingergarlic paste green chilies saut minute raw smell disappears add turmeric powder coriander powder garam masala mix well cook minute pour spinach puree mix well cook minutes stirring occasionally add salt taste mix well adjust consistency gravy adding water needed gently add paneer cubes spinach gravy cook minutes allowing flavors blend optional stir heavy cream added richness cook another minute serve hot naan roti rice",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, eating places, pictures, experiences etc. **Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Palak Paneer Recipe: Ingredients: * 200 grams paneer (cottage cheese), cut into cubes * 500 grams spinach leaves, washed and blanched * 1 tablespoon oil or ghee (clarified butter) * 1 teaspoon cumin seeds * 1 medium onion, finely chopped * 2 teaspoons ginger-garlic paste * 2 green chilies, finely chopped (adjust according to spice preference) * 1 teaspoon turmeric powder * 1 teaspoon coriander powder * 1/2 teaspoon garam masala * Salt to taste * 1/4 cup heavy cream (optional, for added richness) Instructions: 1. Blanch the spinach leaves: Boil water in a large pot, add the spinach leaves, and blanch for about 2 minutes. Drain and immediately transfer the spinach to a bowl of ice water. This helps retain the bright green color. Drain again and blend the blanched spinach to a smooth puree. Set aside. 2. In a pan, heat oil or ghee over medium heat. Add cumin seeds and let them splutter. 3. Add the finely chopped onion and sauté until golden brown. 4. Add ginger-garlic paste and green chilies. Sauté for a minute until the raw smell disappears. 5. Add turmeric powder, coriander powder, and garam masala. Mix well and cook for a minute. 6. Pour in the spinach puree and mix well. Cook for 5-7 minutes, stirring occasionally. 7. Add salt to taste and mix well. Adjust the consistency of the gravy by adding water if needed. 8. Gently add the paneer cubes to the spinach gravy. Cook for 2-3 minutes, allowing the flavors to blend. 9. Optional: Stir in the heavy cream for added richness. Cook for another minute. 10. Serve hot with naan, roti, or rice."
}