{
    "id": "12r4y9d",
    "title": "Neither Media nor people do any research.",
    "url": "https://www.reddit.com/r/india/comments/12r4y9d/neither_media_nor_people_do_any_research/",
    "selftext": "You can disagree with rights/policies, but it pisses me off that it is brushed off as western idea.\n\nTwitter has been trending because CJI DY Chandrachud said Indian law provides for self-identification of Gender. News outlets, including the legal news outlets like Bar and Bench, LiveLaw, quoted him without stating that it is Indian Law as established by 2014 judgement by two different judges, 2019 Act and 2020 Rule.\n\nIn 2014  Ministry of Social Justice and Empowerment published a report by Expert Committee. Relying on that report, Justice KS Radhakrishnan & AK Sikri passed a judgement in the [NLSA v. Union of India](https://en.wikipedia.org/wiki/National_Legal_Services_Authority_v._Union_of_India) case in 2014. The verdict recognized the right to  the right to self-identification of their gender as male, female or third gender.\n\nFollowing this, Parliament passed [Transgender Persons (Protection of Rights) Act of 2019](https://en.wikipedia.org/wiki/Transgender_Persons_(Protection_of_Rights)_Act,_2019). The Act initially dilute the right to self-identify gender. But that was changed by the [2020 Rule](https://indianexpress.com/article/explained/gender-self-identification-law-india-7383108/), allowing self-identification of Gender.\n\nYet, the majority thinks we are \"importing\" Western/American ideology. Well, India did it in 2014. Even today, the US doesn't have the right to self-identify nationally. LGBT people have been demanding for the right in US, but they don't have it. Council of Europe just passed a non-binding resolution in 2015. Why do you assume we are coping the West? Why do you assume a CJI who studied in US can only think about it? Both the Judges in NLSA cases were Indian students.\n\nHistorically too, we have treated our Transgender citizens better than US. So, why do people simply assume it's an US idea? Why is that LGBT movement in India has been through the lense of US/West? If at all you want to comment on LGBT issues, why don't you see Indian history? Why are you relying on Western commenters?\n\nAIDS Bhedbhav Virodhi Andolan published a manifesto in 1991, \"Less Than Gay: A Citizens' Report on the Status of Homosexuality in India\", calling for marriage equality. IN 1991!! Netherlands was the first country to do so in 2001. US was the 16th country to do so, in 2015. Yes, I know court filings cite US ruling, it's because our Article 14 includes the US Equal Protection Clause. And, US recognized marriage equality because they found prohibition to be violation of BOTH Equal Protection Clause and another clause. Countries that follow common law system cite each other all the time. Botswana cited our [Navtej Singh Johar v. Union of India](https://en.wikipedia.org/wiki/Navtej_Singh_Johar_v._Union_of_India) in their judgement, if I am correct.\n\nBTW, Navtej Singh Johar v. Union of India was in 2018, but our first attempt was in 1994. This was before Lawrence v. Texas (2003), the US equivalent of  Navtej Singh Johar v. Union of India. So, if you oppose find a better argument, don't belittle as people who are copying Americans and Europeans.",
    "flair": "Rant / Vent",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1681853036.0,
    "convurl": "https://external-preview.redd.it/kqNcNLdrKv-kvh4YxATLoHG26S_0RiEY-s2ZfXKK9hc.jpg?auto=webp&v=enabled&s=9a8d894a2a74e6a45187db0814aa024f66e20465",
    "comments": [],
    "cleaned_text": "neither media people research disagree rightspolicies pisses brushed western idea twitter trending cji dy chandrachud said indian law provides selfidentification gender news outlets including legal news outlets like bar bench livelaw quoted without stating indian law established judgement two different judges act rule ministry social justice empowerment published report expert committee relying report justice ks radhakrishnan ak sikri passed judgement nlsa v union indiahttpsenwikipediaorgwikinationallegalservicesauthorityvunionofindia case verdict recognized right right selfidentification gender male female third gender following parliament passed transgender persons protection rights act httpsenwikipediaorgwikitransgenderpersonsprotectionofrightsact act initially dilute right selfidentify gender changed rulehttpsindianexpresscomarticleexplainedgenderselfidentificationlawindia allowing selfidentification gender yet majority thinks importing westernamerican ideology well india even today us doesnt right selfidentify nationally lgbt people demanding right us dont council europe passed nonbinding resolution assume coping west assume cji studied us think judges nlsa cases indian students historically treated transgender citizens better us people simply assume us idea lgbt movement india lense uswest want comment lgbt issues dont see indian history relying western commenters aids bhedbhav virodhi andolan published manifesto less gay citizens report status homosexuality india calling marriage equality netherlands first country us th country yes know court filings cite us ruling article includes us equal protection clause us recognized marriage equality found prohibition violation equal protection clause another clause countries follow common law system cite time botswana cited navtej singh johar v union indiahttpsenwikipediaorgwikinavtejsinghjoharvunionofindia judgement correct btw navtej singh johar v union india first attempt lawrence v texas us equivalent navtej singh johar v union india oppose find better argument dont belittle people copying americans europeans ",
    "cleaned_title": "neither media people research",
    "cleaned_selftext": "disagree rightspolicies pisses brushed western idea twitter trending cji dy chandrachud said indian law provides selfidentification gender news outlets including legal news outlets like bar bench livelaw quoted without stating indian law established judgement two different judges act rule ministry social justice empowerment published report expert committee relying report justice ks radhakrishnan ak sikri passed judgement nlsa v union indiahttpsenwikipediaorgwikinationallegalservicesauthorityvunionofindia case verdict recognized right right selfidentification gender male female third gender following parliament passed transgender persons protection rights act httpsenwikipediaorgwikitransgenderpersonsprotectionofrightsact act initially dilute right selfidentify gender changed rulehttpsindianexpresscomarticleexplainedgenderselfidentificationlawindia allowing selfidentification gender yet majority thinks importing westernamerican ideology well india even today us doesnt right selfidentify nationally lgbt people demanding right us dont council europe passed nonbinding resolution assume coping west assume cji studied us think judges nlsa cases indian students historically treated transgender citizens better us people simply assume us idea lgbt movement india lense uswest want comment lgbt issues dont see indian history relying western commenters aids bhedbhav virodhi andolan published manifesto less gay citizens report status homosexuality india calling marriage equality netherlands first country us th country yes know court filings cite us ruling article includes us equal protection clause us recognized marriage equality found prohibition violation equal protection clause another clause countries follow common law system cite time botswana cited navtej singh johar v union indiahttpsenwikipediaorgwikinavtejsinghjoharvunionofindia judgement correct btw navtej singh johar v union india first attempt lawrence v texas us equivalent navtej singh johar v union india oppose find better argument dont belittle people copying americans europeans",
    "cleaned_comments": "",
    "light_cleaned_title": "Neither Media nor people do any research.",
    "light_cleaned_selftext": "You can disagree with rights/policies, but it pisses me off that it is brushed off as western idea. Twitter has been trending because CJI DY Chandrachud said Indian law provides for self-identification of Gender. News outlets, including the legal news outlets like Bar and Bench, LiveLaw, quoted him without stating that it is Indian Law as established by 2014 judgement by two different judges, 2019 Act and 2020 Rule. In 2014 Ministry of Social Justice and Empowerment published a report by Expert Committee. Relying on that report, Justice KS Radhakrishnan & AK Sikri passed a judgement in the [NLSA v. Union of India](https://en.wikipedia.org/wiki/National_Legal_Services_Authority_v._Union_of_India) case in 2014. The verdict recognized the right to the right to self-identification of their gender as male, female or third gender. Following this, Parliament passed [Transgender Persons (Protection of Rights) Act of 2019](https://en.wikipedia.org/wiki/Transgender_Persons_(Protection_of_Rights)_Act,_2019). The Act initially dilute the right to self-identify gender. But that was changed by the [2020 Rule](https://indianexpress.com/article/explained/gender-self-identification-law-india-7383108/), allowing self-identification of Gender. Yet, the majority thinks we are \"importing\" Western/American ideology. Well, India did it in 2014. Even today, the US doesn't have the right to self-identify nationally. LGBT people have been demanding for the right in US, but they don't have it. Council of Europe just passed a non-binding resolution in 2015. Why do you assume we are coping the West? Why do you assume a CJI who studied in US can only think about it? Both the Judges in NLSA cases were Indian students. Historically too, we have treated our Transgender citizens better than US. So, why do people simply assume it's an US idea? Why is that LGBT movement in India has been through the lense of US/West? If at all you want to comment on LGBT issues, why don't you see Indian history? Why are you relying on Western commenters? AIDS Bhedbhav Virodhi Andolan published a manifesto in 1991, \"Less Than Gay: A Citizens' Report on the Status of Homosexuality in India\", calling for marriage equality. IN 1991!! Netherlands was the first country to do so in 2001. US was the 16th country to do so, in 2015. Yes, I know court filings cite US ruling, it's because our Article 14 includes the US Equal Protection Clause. And, US recognized marriage equality because they found prohibition to be violation of BOTH Equal Protection Clause and another clause. Countries that follow common law system cite each other all the time. Botswana cited our [Navtej Singh Johar v. Union of India](https://en.wikipedia.org/wiki/Navtej_Singh_Johar_v._Union_of_India) in their judgement, if I am correct. BTW, Navtej Singh Johar v. Union of India was in 2018, but our first attempt was in 1994. This was before Lawrence v. Texas (2003), the US equivalent of Navtej Singh Johar v. Union of India. So, if you oppose find a better argument, don't belittle as people who are copying Americans and Europeans.",
    "light_cleaned_comments": ""
}