{
    "id": "ems1xf",
    "title": "SC's Kashmir communication shutdown judgement is just the beginning of a long uphill campaign",
    "url": "https://www.reddit.com/r/india/comments/ems1xf/scs_kashmir_communication_shutdown_judgement_is/",
    "selftext": "### \n\nhttps://preview.redd.it/lcjc09nyty941.png?width=1024&amp;format=png&amp;auto=webp&amp;s=c7bfac74255543362909c85e52395ca415cf835d\n\n### Tl;dr\n\nThe Supreme Court's judgement in *Anuradha Bhasin v. Union* of India is a step in the right direction but fails to provide immediate relief to Kashmiris who have already suffered immense hardship due to the 158 day communication shutdown. However, the judgement does provide strong legal footing to challenge the continued communication shutdown in Kashmir and arbitrary use of the Telecom Suspension Rules all over India. Most importantly, the judgement is only the first step and it will require continuous monitoring and follow up action to ensure the government complies with the progressive principles and procedural safeguards laid down by the Supreme Court. \n\n### The Good\n\n* **Endorsement of the proportionality standard**   \nDrawing on past domestic and foreign jurisprudence, the Court has endorsed the proportionality standard to be the appropriate standard of review for communication shutdown orders. The judgement summarizes the proportionality test to require pursuit of a legitimate aim, exploration of suitable alternatives and adoption of the least restrictive measure. The nature of the restriction and its territorial and temporal scope will be relevant factors to determine whether it is proportionate to the aim sought to be achieved.  \n\n* **Reading procedural safeguards into the Telecom Suspension Rules**  \nThe Court has read three procedural safeguards into the Telecom Suspension Rules to bring greater transparency and accountability in the telecom shutdown process. First, all telecom suspension orders must be made publicly available to make the Rules compliant with principles of natural justice. Second, orders must specify a time limit and they cannot suspend internet services indefinitely. Third, the Review Committee constituted under the Rules must review the orders every seven working days to determine their necessity. The Court has noted that the Telecom Suspension Rules have certain gaps but instead of striking them down as unconstitutional, the Court has read these procedural safeguards into the Rules to prevent arbitrary use of the Rules.  \n\n* **Internet is a medium to exercise fundamental rights but not a fundamental right itself**   \nThe judgement states that expressing one’s views or conducting one’s business through the internet are protected under Articles 19(1)(a) and 19(1)(g) of the Constitution respectively. This means that online speech or online business activities can be restricted only on grounds recognized under Articles 19(2) and 19(6). This is relevant because the grounds under Article 19(6) are broader than Article 19(2) and includes reasonable restrictions imposed in “public interest.” Therefore, online speech will enjoy greater protection than online business activities.   \n\n* **War on terror is not an excuse to ride roughshod over free speech**   \nThe Court has recognized that even when the state is fighting the threat of terrorism, it can prohibit speech only if it is likely to lead to imminent violence.  \n\n* **Government cannot refuse to supply orders citing logistical inconvenience**   \nThe Court has held that the government must make all orders issued under S.144, Cr.P.C. and Telecom Suspension Rules available to petitioners. However, the government may refuse disclosure of orders if there is a *“specific ground of privilege”* or *“countervailing public interest.”* In these circumstances, the Court will have to determine whether the reasons cited by the government outweigh the petitioner’s right to receive copies of orders restricting fundamental rights. In the context of Kashmir, the Court has specifically held that the government’s claim that it was too difficult to produce multiple orders being issued and withdrawn on a day to day basis is not a valid reason to refuse disclosure of orders.   \n\n* **Government cannot cite lack of technical ability as an excuse**  \nThe judgement categorically rejects the State’s claim that it needs to shut down the internet in its entirety because it does not have technical means to block access to specific websites and applications.  \n\n* **Source of power to impose** **telecom suspensions has** **changed after 2017**  \nAfter making note of the Gujarat High Court decision in *Gaurav Sureshbhai Vyas v. State of Gujarat* which allowed internet shutdowns to be imposed under S.144, Cr.P.C., the Supreme Court has stated that the position of law has changed after notification of the Telecom Suspension Rules in 2017. This could be reasonably construed as an implicit finding that telecom suspension orders can no longer be issued under S.144, Cr.P.C.  \n\n\n### The Bad\n\n* **No direction for restoration of communication services in Kashmir**   \nThe Court has not declared the 158 day communication shutdown as unconstitutional or directed the government to restore all telecom services in Kashmir. As on date, internet services and voice calls on prepaid numbers continue to remain suspended in Kashmir. The judgement states that it could not determine the constitutionality of the communication shutdown because the State had not produced all orders. The State's refusal to produce orders citing logistical inference was clearly held to be untenable but despite this, the Court has allowed the State to get away with frustrating the fundamental right to judicial review by unjustifiably witholding orders.   \n\n* **Only prospective review by the executive, no retrospective review by the judiciary**  \nThe Court has laid down abstract guiding principles and left it to the executive to decide the necessity and proportionality of continuing the communication shutdown and movement restrictions in Kashmir. This means that there will be no determination of the constitutionality of the communication shutdown and movement restrictions from 5 August 2019 to 10 January 2020 by the judiciary. Even the executive is only required to prospectively review its imposition of restrictions on telecom services, and there is no obligation on the executive to review its actions between 5 August 2019 to 10 January 2020. The Court’s refusal to retrospectively review the 158 day long communication shutdown has left Kashmiris who have already suffered psychological distress and financial losses running into thousands of crores without any relief or remedy.  \n\n* **Reasonable restriction can also mean complete prohibition**   \nThe Court has held that reasonable restrictions under Article 19(2) can extend to complete prohibition of speech in certain circumstances. This counterintuitive holding sets a problematic precedent and it could undermine future legal challenges to the Telecom Suspension Rules on the ground of internet shutdowns being inherently indiscriminate and overbroad in nature.   \n\n* **Misapplication of the doctrine of chilling effect**  \nIn this case, there was direct interference with journalistic activities because journalists belonging to Kashmir Times could not contact their sources and editors and their movement was being arbitrarily blocked by paramilitary forces. All these specific facts were pleaded by the petitioner in her writ petition and additional affidavit. Despite these facts being on record, the Court has mischaracterized this type of direct impingement on press freedom as a complaint of indirect chilling effect on the press’s functioning. The direct and inevitable consequence of disabling telecom services and physically stopping journalists from entering certain areas is violation of press freedom and it cannot be characterized solely as a chilling effect.\n\n### IFF's Statement\n\nThe judgement in *Anuradha Bhasin v. Union of India* provides a sound legal basis to challenge future communication shutdowns but it does little to address the harm already caused to Kashmiris in the last 158 days. The Court has rejected several extreme arguments made by the government regarding secrecy of orders and national security, and the principles and safeguards laid down in this case are the first step in reforming the telecom suspension process in India.  This judgement is a call to action in a lot of ways and it marks the beginning of a long uphill campaign. There needs to be dogded follow up action to ensure it is implemented by the government in its true spirit in Kashmir and other states.   \n\n\nTo this end, IFF will be taking the following steps in the coming weeks:\n\n1. Write to the government urging it to review the functioning of the Telecom Suspension Rules and conduct a public consultation since the Supreme Court has also noted that the Rules have gaps and need amendment.\n2. File regular RTIs to check if telecom suspension orders are being proactively published and periodically reviewed in accordance with the Supreme Court's directions.\n3. Work with local petitioners if the government fails to review the orders for Kashmir within one week and support them in moving to courts to seek compliance with the Supreme Court's directions.  \n\n\n### Important Documents\n\n1. Copy of SC judgement in Anuradha Bhasin v. UoI ([**link**](https://main.sci.gov.in/supremecourt/2019/28817/28817_2019_2_1501_19350_Judgement_10-Jan-2020.pdf))\n\n### IFF is in this for the long haul. Consider helping us take follow up action to translate the abstract principles laid down by the SC into a concrete reality by [becoming an IFF member](https://internetfreedom.in/donate/) today!",
    "flair": "Policy/Economy",
    "score": 44,
    "num_comments": 6,
    "created_utc": 1578668359,
    "convurl": "https://b.thumbs.redditmedia.com/QbhNzwtW-U5lUpt81VGznvFk62meL660WSC7zKceq-c.jpg",
    "comments": [
        "Thank you for the detailed write-up. Do you think it will also be applicable to 144 being applied as a fashion statement in all the states these days?",
        "Great job guys!",
        "What is to come if no action is taken against the abuse of power.\n\nOtherwise, tips on sexual wellbeing in the Sunday newspaper has more value than the court's pronouncement.",
        "Thank you, in this case we served as counsels for two journalist welfare groups. All this is possible due to the support and love we get from folks like you. We will fight and win together!",
        "Well, to phrase it less vividly :P \n\nYes, it all depends on subsequent and follow up action :)",
        "The judgement by natural inference suggests that Section 144 orders cannot be used for internet shutdowns."
    ],
    "cleaned_text": "scs kashmir communication shutdown judgement beginning long uphill campaign tldr supreme courts judgement anuradha bhasin v union india step right direction fails provide immediate relief kashmiris already suffered immense hardship due day communication shutdown however judgement provide strong legal footing challenge continued communication shutdown kashmir arbitrary use telecom suspension rules india importantly judgement first step require continuous monitoring follow action ensure government complies progressive principles procedural safeguards laid supreme court good endorsement proportionality standard drawing past domestic foreign jurisprudence court endorsed proportionality standard appropriate standard review communication shutdown orders judgement summarizes proportionality test require pursuit legitimate aim exploration suitable alternatives adoption least restrictive measure nature restriction territorial temporal scope relevant factors determine whether proportionate aim sought achieved reading procedural safeguards telecom suspension rules court read three procedural safeguards telecom suspension rules bring greater transparency accountability telecom shutdown process first telecom suspension orders must made publicly available make rules compliant principles natural justice second orders must specify time limit suspend internet services indefinitely third review committee constituted rules must review orders every seven working days determine necessity court noted telecom suspension rules certain gaps instead striking unconstitutional court read procedural safeguards rules prevent arbitrary use rules internet medium exercise fundamental rights fundamental right judgement states expressing ones views conducting ones business internet protected articles g constitution respectively means online speech online business activities restricted grounds recognized articles relevant grounds article broader article includes reasonable restrictions imposed public interest therefore online speech enjoy greater protection online business activities war terror excuse ride roughshod free speech court recognized even state fighting threat terrorism prohibit speech likely lead imminent violence government refuse supply orders citing logistical inconvenience court held government must make orders issued crpc telecom suspension rules available petitioners however government may refuse disclosure orders specific ground privilege countervailing public interest circumstances court determine whether reasons cited government outweigh petitioners right receive copies orders restricting fundamental rights context kashmir court specifically held governments claim difficult produce multiple orders issued withdrawn day day basis valid reason refuse disclosure orders government cite lack technical ability excuse judgement categorically rejects states claim needs shut internet entirety technical means block access specific websites applications source power impose telecom suspensions changed making note gujarat high court decision gaurav sureshbhai vyas v state gujarat allowed internet shutdowns imposed crpc supreme court stated position law changed notification telecom suspension rules could reasonably construed implicit finding telecom suspension orders longer issued crpc bad direction restoration communication services kashmir court declared day communication shutdown unconstitutional directed government restore telecom services kashmir date internet services voice calls prepaid numbers continue remain suspended kashmir judgement states could determine constitutionality communication shutdown state produced orders states refusal produce orders citing logistical inference clearly held untenable despite court allowed state get away frustrating fundamental right judicial review unjustifiably witholding orders prospective review executive retrospective review judiciary court laid abstract guiding principles left executive decide necessity proportionality continuing communication shutdown movement restrictions kashmir means determination constitutionality communication shutdown movement restrictions august january judiciary even executive required prospectively review imposition restrictions telecom services obligation executive review actions august january courts refusal retrospectively review day long communication shutdown left kashmiris already suffered psychological distress financial losses running thousands crores without relief remedy reasonable restriction also mean complete prohibition court held reasonable restrictions article extend complete prohibition speech certain circumstances counterintuitive holding sets problematic precedent could undermine future legal challenges telecom suspension rules ground internet shutdowns inherently indiscriminate overbroad nature misapplication doctrine chilling effect case direct interference journalistic activities journalists belonging kashmir times could contact sources editors movement arbitrarily blocked paramilitary forces specific facts pleaded petitioner writ petition additional affidavit despite facts record court mischaracterized type direct impingement press freedom complaint indirect chilling effect presss functioning direct inevitable consequence disabling telecom services physically stopping journalists entering certain areas violation press freedom characterized solely chilling effect iffs statement judgement anuradha bhasin v union india provides sound legal basis challenge future communication shutdowns little address harm already caused kashmiris last days court rejected several extreme arguments made government regarding secrecy orders national security principles safeguards laid case first step reforming telecom suspension process india judgement call action lot ways marks beginning long uphill campaign needs dogded follow action ensure implemented government true spirit kashmir states end iff taking following steps coming weeks write government urging review functioning telecom suspension rules conduct public consultation since supreme court also noted rules gaps need amendment file regular rtis check telecom suspension orders proactively published periodically reviewed accordance supreme courts directions work local petitioners government fails review orders kashmir within one week support moving courts seek compliance supreme courts directions important documents copy sc judgement anuradha bhasin v uoi linkhttpsmainscigovinsupremecourtjudgementjanpdf iff long haul consider helping us take follow action translate abstract principles laid sc concrete reality becoming iff memberhttpsinternetfreedomindonate today ",
    "cleaned_title": "scs kashmir communication shutdown judgement beginning long uphill campaign",
    "cleaned_selftext": "tldr supreme courts judgement anuradha bhasin v union india step right direction fails provide immediate relief kashmiris already suffered immense hardship due day communication shutdown however judgement provide strong legal footing challenge continued communication shutdown kashmir arbitrary use telecom suspension rules india importantly judgement first step require continuous monitoring follow action ensure government complies progressive principles procedural safeguards laid supreme court good endorsement proportionality standard drawing past domestic foreign jurisprudence court endorsed proportionality standard appropriate standard review communication shutdown orders judgement summarizes proportionality test require pursuit legitimate aim exploration suitable alternatives adoption least restrictive measure nature restriction territorial temporal scope relevant factors determine whether proportionate aim sought achieved reading procedural safeguards telecom suspension rules court read three procedural safeguards telecom suspension rules bring greater transparency accountability telecom shutdown process first telecom suspension orders must made publicly available make rules compliant principles natural justice second orders must specify time limit suspend internet services indefinitely third review committee constituted rules must review orders every seven working days determine necessity court noted telecom suspension rules certain gaps instead striking unconstitutional court read procedural safeguards rules prevent arbitrary use rules internet medium exercise fundamental rights fundamental right judgement states expressing ones views conducting ones business internet protected articles g constitution respectively means online speech online business activities restricted grounds recognized articles relevant grounds article broader article includes reasonable restrictions imposed public interest therefore online speech enjoy greater protection online business activities war terror excuse ride roughshod free speech court recognized even state fighting threat terrorism prohibit speech likely lead imminent violence government refuse supply orders citing logistical inconvenience court held government must make orders issued crpc telecom suspension rules available petitioners however government may refuse disclosure orders specific ground privilege countervailing public interest circumstances court determine whether reasons cited government outweigh petitioners right receive copies orders restricting fundamental rights context kashmir court specifically held governments claim difficult produce multiple orders issued withdrawn day day basis valid reason refuse disclosure orders government cite lack technical ability excuse judgement categorically rejects states claim needs shut internet entirety technical means block access specific websites applications source power impose telecom suspensions changed making note gujarat high court decision gaurav sureshbhai vyas v state gujarat allowed internet shutdowns imposed crpc supreme court stated position law changed notification telecom suspension rules could reasonably construed implicit finding telecom suspension orders longer issued crpc bad direction restoration communication services kashmir court declared day communication shutdown unconstitutional directed government restore telecom services kashmir date internet services voice calls prepaid numbers continue remain suspended kashmir judgement states could determine constitutionality communication shutdown state produced orders states refusal produce orders citing logistical inference clearly held untenable despite court allowed state get away frustrating fundamental right judicial review unjustifiably witholding orders prospective review executive retrospective review judiciary court laid abstract guiding principles left executive decide necessity proportionality continuing communication shutdown movement restrictions kashmir means determination constitutionality communication shutdown movement restrictions august january judiciary even executive required prospectively review imposition restrictions telecom services obligation executive review actions august january courts refusal retrospectively review day long communication shutdown left kashmiris already suffered psychological distress financial losses running thousands crores without relief remedy reasonable restriction also mean complete prohibition court held reasonable restrictions article extend complete prohibition speech certain circumstances counterintuitive holding sets problematic precedent could undermine future legal challenges telecom suspension rules ground internet shutdowns inherently indiscriminate overbroad nature misapplication doctrine chilling effect case direct interference journalistic activities journalists belonging kashmir times could contact sources editors movement arbitrarily blocked paramilitary forces specific facts pleaded petitioner writ petition additional affidavit despite facts record court mischaracterized type direct impingement press freedom complaint indirect chilling effect presss functioning direct inevitable consequence disabling telecom services physically stopping journalists entering certain areas violation press freedom characterized solely chilling effect iffs statement judgement anuradha bhasin v union india provides sound legal basis challenge future communication shutdowns little address harm already caused kashmiris last days court rejected several extreme arguments made government regarding secrecy orders national security principles safeguards laid case first step reforming telecom suspension process india judgement call action lot ways marks beginning long uphill campaign needs dogded follow action ensure implemented government true spirit kashmir states end iff taking following steps coming weeks write government urging review functioning telecom suspension rules conduct public consultation since supreme court also noted rules gaps need amendment file regular rtis check telecom suspension orders proactively published periodically reviewed accordance supreme courts directions work local petitioners government fails review orders kashmir within one week support moving courts seek compliance supreme courts directions important documents copy sc judgement anuradha bhasin v uoi linkhttpsmainscigovinsupremecourtjudgementjanpdf iff long haul consider helping us take follow action translate abstract principles laid sc concrete reality becoming iff memberhttpsinternetfreedomindonate today",
    "cleaned_comments": "thank detailed writeup think also applicable applied fashion statement states days great job guys come action taken abuse power otherwise tips sexual wellbeing sunday newspaper value courts pronouncement thank case served counsels two journalist welfare groups possible due support love get folks like fight win together well phrase less vividly p yes depends subsequent follow action judgement natural inference suggests section orders used internet shutdowns",
    "light_cleaned_title": "SC's Kashmir communication shutdown judgement is just the beginning of a long uphill campaign",
    "light_cleaned_selftext": "### ### Tl;dr The Supreme Court's judgement in *Anuradha Bhasin v. Union* of India is a step in the right direction but fails to provide immediate relief to Kashmiris who have already suffered immense hardship due to the 158 day communication shutdown. However, the judgement does provide strong legal footing to challenge the continued communication shutdown in Kashmir and arbitrary use of the Telecom Suspension Rules all over India. Most importantly, the judgement is only the first step and it will require continuous monitoring and follow up action to ensure the government complies with the progressive principles and procedural safeguards laid down by the Supreme Court. ### The Good * **Endorsement of the proportionality standard** Drawing on past domestic and foreign jurisprudence, the Court has endorsed the proportionality standard to be the appropriate standard of review for communication shutdown orders. The judgement summarizes the proportionality test to require pursuit of a legitimate aim, exploration of suitable alternatives and adoption of the least restrictive measure. The nature of the restriction and its territorial and temporal scope will be relevant factors to determine whether it is proportionate to the aim sought to be achieved. * **Reading procedural safeguards into the Telecom Suspension Rules** The Court has read three procedural safeguards into the Telecom Suspension Rules to bring greater transparency and accountability in the telecom shutdown process. First, all telecom suspension orders must be made publicly available to make the Rules compliant with principles of natural justice. Second, orders must specify a time limit and they cannot suspend internet services indefinitely. Third, the Review Committee constituted under the Rules must review the orders every seven working days to determine their necessity. The Court has noted that the Telecom Suspension Rules have certain gaps but instead of striking them down as unconstitutional, the Court has read these procedural safeguards into the Rules to prevent arbitrary use of the Rules. * **Internet is a medium to exercise fundamental rights but not a fundamental right itself** The judgement states that expressing one’s views or conducting one’s business through the internet are protected under Articles 19(1)(a) and 19(1)(g) of the Constitution respectively. This means that online speech or online business activities can be restricted only on grounds recognized under Articles 19(2) and 19(6). This is relevant because the grounds under Article 19(6) are broader than Article 19(2) and includes reasonable restrictions imposed in “public interest.” Therefore, online speech will enjoy greater protection than online business activities. * **War on terror is not an excuse to ride roughshod over free speech** The Court has recognized that even when the state is fighting the threat of terrorism, it can prohibit speech only if it is likely to lead to imminent violence. * **Government cannot refuse to supply orders citing logistical inconvenience** The Court has held that the government must make all orders issued under S.144, Cr.P.C. and Telecom Suspension Rules available to petitioners. However, the government may refuse disclosure of orders if there is a *“specific ground of privilege”* or *“countervailing public interest.”* In these circumstances, the Court will have to determine whether the reasons cited by the government outweigh the petitioner’s right to receive copies of orders restricting fundamental rights. In the context of Kashmir, the Court has specifically held that the government’s claim that it was too difficult to produce multiple orders being issued and withdrawn on a day to day basis is not a valid reason to refuse disclosure of orders. * **Government cannot cite lack of technical ability as an excuse** The judgement categorically rejects the State’s claim that it needs to shut down the internet in its entirety because it does not have technical means to block access to specific websites and applications. * **Source of power to impose** **telecom suspensions has** **changed after 2017** After making note of the Gujarat High Court decision in *Gaurav Sureshbhai Vyas v. State of Gujarat* which allowed internet shutdowns to be imposed under S.144, Cr.P.C., the Supreme Court has stated that the position of law has changed after notification of the Telecom Suspension Rules in 2017. This could be reasonably construed as an implicit finding that telecom suspension orders can no longer be issued under S.144, Cr.P.C. ### The Bad * **No direction for restoration of communication services in Kashmir** The Court has not declared the 158 day communication shutdown as unconstitutional or directed the government to restore all telecom services in Kashmir. As on date, internet services and voice calls on prepaid numbers continue to remain suspended in Kashmir. The judgement states that it could not determine the constitutionality of the communication shutdown because the State had not produced all orders. The State's refusal to produce orders citing logistical inference was clearly held to be untenable but despite this, the Court has allowed the State to get away with frustrating the fundamental right to judicial review by unjustifiably witholding orders. * **Only prospective review by the executive, no retrospective review by the judiciary** The Court has laid down abstract guiding principles and left it to the executive to decide the necessity and proportionality of continuing the communication shutdown and movement restrictions in Kashmir. This means that there will be no determination of the constitutionality of the communication shutdown and movement restrictions from 5 August 2019 to 10 January 2020 by the judiciary. Even the executive is only required to prospectively review its imposition of restrictions on telecom services, and there is no obligation on the executive to review its actions between 5 August 2019 to 10 January 2020. The Court’s refusal to retrospectively review the 158 day long communication shutdown has left Kashmiris who have already suffered psychological distress and financial losses running into thousands of crores without any relief or remedy. * **Reasonable restriction can also mean complete prohibition** The Court has held that reasonable restrictions under Article 19(2) can extend to complete prohibition of speech in certain circumstances. This counterintuitive holding sets a problematic precedent and it could undermine future legal challenges to the Telecom Suspension Rules on the ground of internet shutdowns being inherently indiscriminate and overbroad in nature. * **Misapplication of the doctrine of chilling effect** In this case, there was direct interference with journalistic activities because journalists belonging to Kashmir Times could not contact their sources and editors and their movement was being arbitrarily blocked by paramilitary forces. All these specific facts were pleaded by the petitioner in her writ petition and additional affidavit. Despite these facts being on record, the Court has mischaracterized this type of direct impingement on press freedom as a complaint of indirect chilling effect on the press’s functioning. The direct and inevitable consequence of disabling telecom services and physically stopping journalists from entering certain areas is violation of press freedom and it cannot be characterized solely as a chilling effect. ### IFF's Statement The judgement in *Anuradha Bhasin v. Union of India* provides a sound legal basis to challenge future communication shutdowns but it does little to address the harm already caused to Kashmiris in the last 158 days. The Court has rejected several extreme arguments made by the government regarding secrecy of orders and national security, and the principles and safeguards laid down in this case are the first step in reforming the telecom suspension process in India. This judgement is a call to action in a lot of ways and it marks the beginning of a long uphill campaign. There needs to be dogded follow up action to ensure it is implemented by the government in its true spirit in Kashmir and other states. To this end, IFF will be taking the following steps in the coming weeks: 1. Write to the government urging it to review the functioning of the Telecom Suspension Rules and conduct a public consultation since the Supreme Court has also noted that the Rules have gaps and need amendment. 2. File regular RTIs to check if telecom suspension orders are being proactively published and periodically reviewed in accordance with the Supreme Court's directions. 3. Work with local petitioners if the government fails to review the orders for Kashmir within one week and support them in moving to courts to seek compliance with the Supreme Court's directions. ### Important Documents 1. Copy of SC judgement in Anuradha Bhasin v. UoI ([**link**](https://main.sci.gov.in/supremecourt/2019/28817/28817_2019_2_1501_19350_Judgement_10-Jan-2020.pdf)) ### IFF is in this for the long haul. Consider helping us take follow up action to translate the abstract principles laid down by the SC into a concrete reality by [becoming an IFF member](https://internetfreedom.in/donate/) today!",
    "light_cleaned_comments": "Thank you for the detailed write-up. Do you think it will also be applicable to 144 being applied as a fashion statement in all the states these days? Great job guys! What is to come if no action is taken against the abuse of power. Otherwise, tips on sexual wellbeing in the Sunday newspaper has more value than the court's pronouncement. Thank you, in this case we served as counsels for two journalist welfare groups. All this is possible due to the support and love we get from folks like you. We will fight and win together! Well, to phrase it less vividly :P Yes, it all depends on subsequent and follow up action :) The judgement by natural inference suggests that Section 144 orders cannot be used for internet shutdowns."
}