{
    "id": "14e1vtj",
    "title": "Yup. AIRTEL 5G Plus.",
    "url": "https://www.reddit.com/gallery/14e1vtj",
    "selftext": "Isn't this downright scam? The speed dropped as it does even without unlimited 5G. And they dare say sharing of data not allowed lol. Airtel is just straight up scum. Atleast JIO doesn't throw false advertising to this extent.",
    "flair": "Rant / Vent",
    "score": 12,
    "num_comments": 12,
    "created_utc": 1687238598.0,
    "convurl": "https://i.redd.it/6rziwldly37b1.jpg",
    "comments": [
        "I get 250 to 400 mbps in airtel 5g. My friend with jio gets 100 mbps.",
        "doesn't his plan allow hotspot sharing.",
        "Don't know. Don't care. I am concerned about myself. I get good speed in airtel 5g. Only concern is data caps which may come in future.",
        "Same with wifi my friend have jio fiber he has some complaints every month while i have airtel xtream and i only had problems 3 times in 1.5 year",
        "It doesn’t seem to affect me I think. I have grabbed content using unlimited 5g on my laptop with hotspot. I’ll try again and see ig",
        "This happens with Jio 5G as well. The moment I turn my phone as a hotspot, it goes back to 4g/4g+\n\nDidn't this was a thing. Turns out it is!",
        "Airtel fiber 0 complaints 15 years.",
        "Weird. I get 500 Mbps here in Kerala.",
        "It's not happening with me, \n\nMaybe try changing your phone, because my old phone was used to behave like this, in that case it was when I used turn on bluetooth.",
        "https://preview.redd.it/cg4bqqqhf47b1.jpeg?width=1080&format=pjpg&auto=webp&v=enabled&s=3025ce33117a29b0b6e3db121f58beb93061eb90\n\nNever had a problem with jio 5g, right now also I'm sharing data through hotspot.",
        "Nice.",
        "wtf? Airtel fiber is not even 15 years old?",
        "They upgraded my copper line to fiber."
    ],
    "cleaned_text": "yup airtel g plus isnt downright scam speed dropped even without unlimited g dare say sharing data allowed lol airtel straight scum atleast jio doesnt throw false advertising extent ",
    "cleaned_title": "yup airtel g plus",
    "cleaned_selftext": "isnt downright scam speed dropped even without unlimited g dare say sharing data allowed lol airtel straight scum atleast jio doesnt throw false advertising extent",
    "cleaned_comments": "get mbps airtel g friend jio gets mbps doesnt plan allow hotspot sharing dont know dont care concerned get good speed airtel g concern data caps may come future wifi friend jio fiber complaints every month airtel xtream problems times year doesnt seem affect think grabbed content using unlimited g laptop hotspot ill try see ig happens jio g well moment turn phone hotspot goes back gg didnt thing turns airtel fiber complaints years weird get mbps kerala happening maybe try changing phone old phone used behave like case used turn bluetooth never problem jio g right also im sharing data hotspot nice wtf airtel fiber even years old upgraded copper line fiber",
    "light_cleaned_title": "Yup. AIRTEL 5G Plus.",
    "light_cleaned_selftext": "Isn't this downright scam? The speed dropped as it does even without unlimited 5G. And they dare say sharing of data not allowed lol. Airtel is just straight up scum. Atleast JIO doesn't throw false advertising to this extent.",
    "light_cleaned_comments": "I get 250 to 400 mbps in airtel 5g. My friend with jio gets 100 mbps. doesn't his plan allow hotspot sharing. Don't know. Don't care. I am concerned about myself. I get good speed in airtel 5g. Only concern is data caps which may come in future. Same with wifi my friend have jio fiber he has some complaints every month while i have airtel xtream and i only had problems 3 times in 1.5 year It doesn’t seem to affect me I think. I have grabbed content using unlimited 5g on my laptop with hotspot. I’ll try again and see ig This happens with Jio 5G as well. The moment I turn my phone as a hotspot, it goes back to 4g/4g+ Didn't this was a thing. Turns out it is! Airtel fiber 0 complaints 15 years. Weird. I get 500 Mbps here in Kerala. It's not happening with me, Maybe try changing your phone, because my old phone was used to behave like this, in that case it was when I used turn on bluetooth. Never had a problem with jio 5g, right now also I'm sharing data through hotspot. Nice. wtf? Airtel fiber is not even 15 years old? They upgraded my copper line to fiber."
}