{
    "id": "n1jd25",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/n1jd25/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, and if you tried out something new, you can also share pictures!\n\n**The Food Thread is posted every two weeks on Friday mornings.**\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 17,
    "num_comments": 10,
    "created_utc": 1619746214,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Hello to you nice folks,\n\nक्या आप भी अच्छे व्यंजन खाना पसंद करते हैं लेकिन ऐसा करते समय वजन नहीं बढ़ाना चाहते हैं?\n\nफिर मैं आपके लिए बहुत कम कैलोरी सामग्री के साथ एक शानदार भोजन लाया हूँ\n\nDiet coke Brownies :\n\n125-150 ml Diet coke or any zero Diet soda that is sweet\n\n30 Grams of Cocoa powder\n\n20 Grams Flour (Ata or Maida, whatever you wish)\n\nBaking powder and salt (I add 8-10 sugarfree natura pellets, the sucrolose one, not the aspartame one,  i like it a bit more sweeter but that is optional)\n\n&amp;#x200B;\n\nMix that shit in a blender for properly mixing it, set the oven to max and bake that stuff like any regular cake or bread.\n\n&amp;#x200B;\n\nCalories? only 190 calories for a huge ass cake sized chocolate Brownie. Actually tastes very very very good",
        "Ok fellas, I am gonna try my hand at cooking biryani this eid. Any basmati rice brand you recommend and any recipe?",
        "Last week I followed the Ranveer Brar's biryani recipe and it came out to be really good. Also it is very easy to make, just make sure you don't overcook the rice, it cooks very fast. I used the India gate dubar basmati rice.",
        "I don't have any recipe but this biryani masala I ordered from Amazon is really good! Link:\nhttps://www.amazon.in/dp/B00ZQZY9GK/ref=cm_sw_r_cp_apa_glt_fabc_8ABVAKCMZHCKC1JK3D2J?_encoding=UTF8&amp;psc=1",
        "हमको ये शंदर भंजन न मांगता भीडू",
        "hag diya prahu aapne",
        "Ok. Gonna give this a try. Have you just tried the Lucknowi one or also the Hyderabadi one? I wish it was possible to get one of each.",
        "Yeah I have tried both. Both are good but I personally prefer Lucknowi. Hyderabadi was bit more salty.",
        "Watched the video, gathering all the ingredients might be a bit of problem but lets try. And I didn't know people add that milk mixture to biryani.",
        "Noted. Will try both. Thanks!"
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes tried something new also share pictures food thread posted every two weeks friday mornings",
    "cleaned_comments": "hello nice folks diet coke brownies ml diet coke zero diet soda sweet grams cocoa powder grams flour ata maida whatever wish baking powder salt add sugarfree natura pellets sucrolose one aspartame one like bit sweeter optional ampxb mix shit blender properly mixing set oven max bake stuff like regular cake bread ampxb calories calories huge ass cake sized chocolate brownie actually tastes good ok fellas gon na try hand cooking biryani eid basmati rice brand recommend recipe last week followed ranveer brars biryani recipe came really good also easy make make sure dont overcook rice cooks fast used india gate dubar basmati rice dont recipe biryani masala ordered amazon really good link hag diya prahu aapne ok gon na give try tried lucknowi one also hyderabadi one wish possible get one yeah tried good personally prefer lucknowi hyderabadi bit salty watched video gathering ingredients might bit problem lets try didnt know people add milk mixture biryani noted try thanks",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India! Tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, and if you tried out something new, you can also share pictures! **The Food Thread is posted every two weeks on Friday mornings.**",
    "light_cleaned_comments": "Hello to you nice folks, क्या आप भी अच्छे व्यंजन खाना पसंद करते हैं लेकिन ऐसा करते समय वजन नहीं बढ़ाना चाहते हैं? फिर मैं आपके लिए बहुत कम कैलोरी सामग्री के साथ एक शानदार भोजन लाया हूँ Diet coke Brownies : 125-150 ml Diet coke or any zero Diet soda that is sweet 30 Grams of Cocoa powder 20 Grams Flour (Ata or Maida, whatever you wish) Baking powder and salt (I add 8-10 sugarfree natura pellets, the sucrolose one, not the aspartame one, i like it a bit more sweeter but that is optional)  Mix that shit in a blender for properly mixing it, set the oven to max and bake that stuff like any regular cake or bread.  Calories? only 190 calories for a huge ass cake sized chocolate Brownie. Actually tastes very very very good Ok fellas, I am gonna try my hand at cooking biryani this eid. Any basmati rice brand you recommend and any recipe? Last week I followed the Ranveer Brar's biryani recipe and it came out to be really good. Also it is very easy to make, just make sure you don't overcook the rice, it cooks very fast. I used the India gate dubar basmati rice. I don't have any recipe but this biryani masala I ordered from Amazon is really good! Link: हमको ये शंदर भंजन न मांगता भीडू hag diya prahu aapne Ok. Gonna give this a try. Have you just tried the Lucknowi one or also the Hyderabadi one? I wish it was possible to get one of each. Yeah I have tried both. Both are good but I personally prefer Lucknowi. Hyderabadi was bit more salty. Watched the video, gathering all the ingredients might be a bit of problem but lets try. And I didn't know people add that milk mixture to biryani. Noted. Will try both. Thanks!"
}