{
    "id": "13vtcxk",
    "title": "Excise policy scam: Delhi High Court denies bail to AAP's Manish Sisodia in CBI case",
    "url": "https://www.barandbench.com/news/litigation/excise-policy-scam-delhi-high-court-denies-bail-aap-manish-sisodia-cbi-case",
    "selftext": "\"The allegations are very serious in nature. The accused was a public servant... We have not examined the excise policy nor the power of the government. However, the applicant being a powerful person, there is the possibility of him influencing the witnesses,\" the Court said.\n\nI saw other articles regarding the same, media specifically omitted this line. \n\nMy question when is the bail decision being just taken based on influence - How can court say we have not reviewed the file or even power of the Government?\n\nWhat justice system are we living in? On one side a Rape Accused is not sent to Jail, on the other hand court for a case with no proof yet as of now, doesn't even have time to review files related to granting bail to a person. \n\nI feel Delhi Courts are just equivalent to Gujarat Courts? A totally biased point of view of the ruling party. \n\nOther article I checked:\n\nhttps://www.livemint.com/news/india/excise-policy-scam-delhi-high-court-denies-bail-to-aap-leader-manish-sisodia-11685424452094.html",
    "flair": "Politics",
    "score": 32,
    "num_comments": 4,
    "created_utc": 1685460533.0,
    "convurl": "https://external-preview.redd.it/snWU6EUX_Nar0KN1l8yYtafJ4wKu0dKUIvVzA45n4Fg.jpg?auto=webp&v=enabled&s=35c61839c96a5cd25de66f8f0cb2609add9c7ee8",
    "comments": [
        "Another is issue is one can't openly speak about a judge or decision by a judge especially if it is related to BJP.\n\nThe media can play this by creating a pressure on Judiciary but they are playing the game of hide the truth, spread the lies. \n\nThe same happened with Bilkis Bano, the same is happening with Wrestlers Protest and the same is happening with Manipur. \n\nAll parties are afraid to go to District or High Courts of specific state -\n\nIt seems that joining BJP will be one of the points when presenting the case to a Judge as it will mean that you have the privilege to be listened else you will be malled down until you yourself give up.",
        "BJP has weaponized Judiciary and pretty much all of Indian institutions",
        "The hon. judge took 20 days to pronounce the bail judgement. Says he has not read the merits of the case and is denying bail because Sisodiya is an influential person."
    ],
    "cleaned_text": "excise policy scam delhi high court denies bail aaps manish sisodia cbi case allegations serious nature accused public servant examined excise policy power government however applicant powerful person possibility influencing witnesses court said saw articles regarding media specifically omitted line question bail decision taken based influence court say reviewed file even power government justice system living one side rape accused sent jail hand court case proof yet doesnt even time review files related granting bail person feel delhi courts equivalent gujarat courts totally biased point view ruling party article checked ",
    "cleaned_title": "excise policy scam delhi high court denies bail aaps manish sisodia cbi case",
    "cleaned_selftext": "allegations serious nature accused public servant examined excise policy power government however applicant powerful person possibility influencing witnesses court said saw articles regarding media specifically omitted line question bail decision taken based influence court say reviewed file even power government justice system living one side rape accused sent jail hand court case proof yet doesnt even time review files related granting bail person feel delhi courts equivalent gujarat courts totally biased point view ruling party article checked",
    "cleaned_comments": "another issue one cant openly speak judge decision judge especially related bjp media play creating pressure judiciary playing game hide truth spread lies happened bilkis bano happening wrestlers protest happening manipur parties afraid go district high courts specific state seems joining bjp one points presenting case judge mean privilege listened else malled give bjp weaponized judiciary pretty much indian institutions hon judge took days pronounce bail judgement says read merits case denying bail sisodiya influential person",
    "light_cleaned_title": "Excise policy scam: Delhi High Court denies bail to AAP's Manish Sisodia in CBI case",
    "light_cleaned_selftext": "\"The allegations are very serious in nature. The accused was a public servant... We have not examined the excise policy nor the power of the government. However, the applicant being a powerful person, there is the possibility of him influencing the witnesses,\" the Court said. I saw other articles regarding the same, media specifically omitted this line. My question when is the bail decision being just taken based on influence - How can court say we have not reviewed the file or even power of the Government? What justice system are we living in? On one side a Rape Accused is not sent to Jail, on the other hand court for a case with no proof yet as of now, doesn't even have time to review files related to granting bail to a person. I feel Delhi Courts are just equivalent to Gujarat Courts? A totally biased point of view of the ruling party. Other article I checked:",
    "light_cleaned_comments": "Another is issue is one can't openly speak about a judge or decision by a judge especially if it is related to BJP. The media can play this by creating a pressure on Judiciary but they are playing the game of hide the truth, spread the lies. The same happened with Bilkis Bano, the same is happening with Wrestlers Protest and the same is happening with Manipur. All parties are afraid to go to District or High Courts of specific state - It seems that joining BJP will be one of the points when presenting the case to a Judge as it will mean that you have the privilege to be listened else you will be malled down until you yourself give up. BJP has weaponized Judiciary and pretty much all of Indian institutions The hon. judge took 20 days to pronounce the bail judgement. Says he has not read the merits of the case and is denying bail because Sisodiya is an influential person."
}