{
    "id": "15mhvy9",
    "title": "'We Realise Their Importance Now': Gurugram Struggles After Muslim Migrants Flee Due To Haryana Violence",
    "url": "https://www.thequint.com/news/india/we-realise-their-importance-now-gurugram-struggles-after-muslim-migrants-flee",
    "selftext": "The RWAs would want a minimum level of security to keep the flow of migrant labor moving – not at all for any substantive transformation of their precarity. Keeping Muslims just secure enough while perpetuating their precarious position both economically and politically is precisely what works in the interest of the Hindu middle classes.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1691593517.0,
    "convurl": "https://external-preview.redd.it/mewc263H87vjYyOhXt4KLUAFFGL2q8FpljcVXrXVoz4.jpg?auto=webp&s=a4b37c090cfc787750b8a386cda505a764b6d2d6",
    "comments": [
        "Good. Migrate more and more of Muslims to South India to give them a better place and to teach H middle class the value of a blue collar worker.",
        "/r/LeopardsAteMyFace",
        "What do you mean I can’t abuse people and expect them to still be with me?",
        "Its like florida who made anti immigrant/lgbt/minority policies and are now shocked that their hate has consequences",
        "Oh yes, leave the Muslims alone because if they leave it will cause inconvenience to us. Not because they are human beings who deserve not be driven out of their homes. Fucking hell.",
        "Inke liye saste mein kaam karo, akad aur anyay saho, aur jaan bhi jokhim mein dalo.",
        "Also, the desi version r/ThemarkofVishnu"
    ],
    "cleaned_text": "realise importance gurugram struggles muslim migrants flee due haryana violence rwas would want minimum level security keep flow migrant labor moving substantive transformation precarity keeping muslims secure enough perpetuating precarious position economically politically precisely works interest hindu middle classes ",
    "cleaned_title": "realise importance gurugram struggles muslim migrants flee due haryana violence",
    "cleaned_selftext": "rwas would want minimum level security keep flow migrant labor moving substantive transformation precarity keeping muslims secure enough perpetuating precarious position economically politically precisely works interest hindu middle classes",
    "cleaned_comments": "good migrate muslims south india give better place teach h middle class value blue collar worker rleopardsatemyface mean cant abuse people expect still like florida made anti immigrantlgbtminority policies shocked hate consequences oh yes leave muslims alone leave cause inconvenience us human beings deserve driven homes fucking hell inke liye saste mein kaam karo akad aur anyay saho aur jaan bhi jokhim mein dalo also desi version rthemarkofvishnu",
    "light_cleaned_title": "'We Realise Their Importance Now': Gurugram Struggles After Muslim Migrants Flee Due To Haryana Violence",
    "light_cleaned_selftext": "The RWAs would want a minimum level of security to keep the flow of migrant labor moving – not at all for any substantive transformation of their precarity. Keeping Muslims just secure enough while perpetuating their precarious position both economically and politically is precisely what works in the interest of the Hindu middle classes.",
    "light_cleaned_comments": "Good. Migrate more and more of Muslims to South India to give them a better place and to teach H middle class the value of a blue collar worker. /r/LeopardsAteMyFace What do you mean I can’t abuse people and expect them to still be with me? Its like florida who made anti immigrant/lgbt/minority policies and are now shocked that their hate has consequences Oh yes, leave the Muslims alone because if they leave it will cause inconvenience to us. Not because they are human beings who deserve not be driven out of their homes. Fucking hell. Inke liye saste mein kaam karo, akad aur anyay saho, aur jaan bhi jokhim mein dalo. Also, the desi version r/ThemarkofVishnu"
}