{
    "id": "1ez0skb",
    "title": "Sport career is still not financially viable.",
    "url": "https://www.reddit.com/r/india/comments/1ez0skb/sport_career_is_still_not_financially_viable/",
    "selftext": "[https://sportstar.thehindu.com/table-tennis/archana-kamath-quits-table-tennis-retirement-pursue-academics-higher-studies-paris-olympics-india/article68554444.ece](https://sportstar.thehindu.com/table-tennis/archana-kamath-quits-table-tennis-retirement-pursue-academics-higher-studies-paris-olympics-india/article68554444.ece)\n\nhttps://preview.redd.it/33no1s5xjbkd1.png?width=1036&format=png&auto=webp&s=ede43f4dc20d901688181e961e46f382058b2aa5\n\n    I, like many others, was once a budding athlete. Clocking impressive times of 12-13 seconds in 100m sprint races, I consistently outpaced my competitors by huge leads. My passion for athletics consumed my thoughts, driving me to constantly seek ways to improve my pace.\n    \n    When I shared my aspirations of joining sports college and becoming a professional athlete  my middle-class parents, I faced stern opposition. My father, voicing concerns about financial stability, questioned the viability of athletics as a career path. \n    \n    Back in those days it used to be \"my(father) way or the highway\". So after lots of altercations I finally had to succumb and give up my idea on sprinting.\n    \n    Fast forward 25 years, and I achieved conventional success – a thriving career, financial stability, and a loving family. Yet, beneath the surface of his accomplishments lies a dormant ambition, an unfinished goal that continues to haunt.\n    \n    \n    When one says we are 1.5 billlion people and yet we cannot produce enough medals. I sigh and think may be there are more like me young dreamers with special gift but it just rusts away untapped.\n    \n    So today when Archana decides to move on to higher studies, it still shows that pursue sports means a dim financial prospect.\n    ",
    "flair": "Rant / Vent",
    "score": 18,
    "num_comments": 12,
    "created_utc": 1724377633.0,
    "convurl": "https://external-preview.redd.it/6l157adELaCsJw9IjvZoUOLUGqMRr-svhD3F7v2-Nwc.jpg?auto=webp&s=0f41dd071a6e36cd4aed660122eb52b578a06571",
    "comments": [
        "Yes. Because there is no support for anything non academic from society or the govt in India. \n\nThen people ask like idiots “why is China winning so many medals but India is not”, and next second enroll their kids into engineering or medical colleges.",
        "Exactly! ",
        "My brother wanted to play basketball full time and he's really really good but unfortunately middle class parents don't approve. They still let him play for his college and even for the state team. He has the potential to go pro but my parents told him to get an actual job first and then he can pursue other interests. When exactly will that time come? When he's 40? India really needs to understand that having a non traditional job isn't the end of the world.",
        "Yes when you get all that you are 40. You cannot be a pro. The body is nomore same as what it used to be.\n\n\nIn sports you need to be luck to get the right coach a secured life of you go down unrecoverably injury.\n\n\nSee Rishabh pant how he recovered from such a bad accident. But the support he got is because he is a successful cricketer.\n\n\nWhat if some things similar happen to a top notch basket ball player... No point for guessing he she never make it back again.\n\n\nGov takes so much tax even if 1 percent is spent on sports I think it will make a big difference.",
        "Exactly! What's the point of investing so much in education when there's barely any jobs available? Everyone wants to be an engineer or doctor. There's so many opportunities doing a trade. And Indian parents actually have to be supportive of what the child wants to do. From what I'm noticing a lot of parents had kids as a pension plan. \"oh no if you don't make money as an engineer how can I live comfortably?\" Parents are constantly forcing kids into big jobs without asking what they want to do. Look at the NBA. Literally anyone who makes it is pretty much a millionaire. But basketball players here? Zero recognition.",
        "Actually I met a budding badminton player while traveling, he haven't played any international player but he already got company sponsorship, government give him stipend.. he was barely 20 but doing good financially based on sports.",
        "Isn’t that true for any successful/rich sportsperson that they have means to get back?",
        "Alas! sports is for the privileged then.",
        "Nice to know! more power to him and his tribe. :)",
        "China style strategic spending will not work in India. We are too corrupt and lethargic for that. Promoting sports as a part of life is a much better approach. It's a slow approach but might bear fruits in the future as sports will be looked up rather down.",
        "Deep inside we know that she will not return.",
        "See its your choice , you chose the profession. Not government or the public."
    ],
    "cleaned_text": "sport career still financially viable httpssportstarthehinducomtabletennisarchanakamathquitstabletennisretirementpursueacademicshigherstudiesparisolympicsindiaarticleecehttpssportstarthehinducomtabletennisarchanakamathquitstabletennisretirementpursueacademicshigherstudiesparisolympicsindiaarticleece like many others budding athlete clocking impressive times seconds sprint races consistently outpaced competitors huge leads passion athletics consumed thoughts driving constantly seek ways improve pace shared aspirations joining sports college becoming professional athlete middleclass parents faced stern opposition father voicing concerns financial stability questioned viability athletics career path back days used myfather way highway lots altercations finally succumb give idea sprinting fast forward years achieved conventional success thriving career financial stability loving family yet beneath surface accomplishments lies dormant ambition unfinished goal continues haunt one says billlion people yet produce enough medals sigh think may like young dreamers special gift rusts away untapped today archana decides move higher studies still shows pursue sports means dim financial prospect ",
    "cleaned_title": "sport career still financially viable",
    "cleaned_selftext": "httpssportstarthehinducomtabletennisarchanakamathquitstabletennisretirementpursueacademicshigherstudiesparisolympicsindiaarticleecehttpssportstarthehinducomtabletennisarchanakamathquitstabletennisretirementpursueacademicshigherstudiesparisolympicsindiaarticleece like many others budding athlete clocking impressive times seconds sprint races consistently outpaced competitors huge leads passion athletics consumed thoughts driving constantly seek ways improve pace shared aspirations joining sports college becoming professional athlete middleclass parents faced stern opposition father voicing concerns financial stability questioned viability athletics career path back days used myfather way highway lots altercations finally succumb give idea sprinting fast forward years achieved conventional success thriving career financial stability loving family yet beneath surface accomplishments lies dormant ambition unfinished goal continues haunt one says billlion people yet produce enough medals sigh think may like young dreamers special gift rusts away untapped today archana decides move higher studies still shows pursue sports means dim financial prospect",
    "cleaned_comments": "yes support anything non academic society govt india people ask like idiots china winning many medals india next second enroll kids engineering medical colleges exactly brother wanted play basketball full time hes really really good unfortunately middle class parents dont approve still let play college even state team potential go pro parents told get actual job first pursue interests exactly time come hes india really needs understand non traditional job isnt end world yes get pro body nomore used sports need luck get right coach secured life go unrecoverably injury see rishabh pant recovered bad accident support got successful cricketer things similar happen top notch basket ball player point guessing never make back gov takes much tax even percent spent sports think make big difference exactly whats point investing much education theres barely jobs available everyone wants engineer doctor theres many opportunities trade indian parents actually supportive child wants im noticing lot parents kids pension plan oh dont make money engineer live comfortably parents constantly forcing kids big jobs without asking want look nba literally anyone makes pretty much millionaire basketball players zero recognition actually met budding badminton player traveling havent played international player already got company sponsorship government give stipend barely good financially based sports isnt true successfulrich sportsperson means get back alas sports privileged nice know power tribe china style strategic spending work india corrupt lethargic promoting sports part life much better approach slow approach might bear fruits future sports looked rather deep inside know return see choice chose profession government public",
    "light_cleaned_title": "Sport career is still not financially viable.",
    "light_cleaned_selftext": "[https://sportstar.thehindu.com/table-tennis/archana-kamath-quits-table-tennis-retirement-pursue-academics-higher-studies-paris-olympics-india/article68554444.ece](https://sportstar.thehindu.com/table-tennis/archana-kamath-quits-table-tennis-retirement-pursue-academics-higher-studies-paris-olympics-india/article68554444.ece) I, like many others, was once a budding athlete. Clocking impressive times of 12-13 seconds in 100m sprint races, I consistently outpaced my competitors by huge leads. My passion for athletics consumed my thoughts, driving me to constantly seek ways to improve my pace. When I shared my aspirations of joining sports college and becoming a professional athlete my middle-class parents, I faced stern opposition. My father, voicing concerns about financial stability, questioned the viability of athletics as a career path. Back in those days it used to be \"my(father) way or the highway\". So after lots of altercations I finally had to succumb and give up my idea on sprinting. Fast forward 25 years, and I achieved conventional success – a thriving career, financial stability, and a loving family. Yet, beneath the surface of his accomplishments lies a dormant ambition, an unfinished goal that continues to haunt. When one says we are 1.5 billlion people and yet we cannot produce enough medals. I sigh and think may be there are more like me young dreamers with special gift but it just rusts away untapped. So today when Archana decides to move on to higher studies, it still shows that pursue sports means a dim financial prospect.",
    "light_cleaned_comments": "Yes. Because there is no support for anything non academic from society or the govt in India. Then people ask like idiots “why is China winning so many medals but India is not”, and next second enroll their kids into engineering or medical colleges. Exactly! My brother wanted to play basketball full time and he's really really good but unfortunately middle class parents don't approve. They still let him play for his college and even for the state team. He has the potential to go pro but my parents told him to get an actual job first and then he can pursue other interests. When exactly will that time come? When he's 40? India really needs to understand that having a non traditional job isn't the end of the world. Yes when you get all that you are 40. You cannot be a pro. The body is nomore same as what it used to be. In sports you need to be luck to get the right coach a secured life of you go down unrecoverably injury. See Rishabh pant how he recovered from such a bad accident. But the support he got is because he is a successful cricketer. What if some things similar happen to a top notch basket ball player... No point for guessing he she never make it back again. Gov takes so much tax even if 1 percent is spent on sports I think it will make a big difference. Exactly! What's the point of investing so much in education when there's barely any jobs available? Everyone wants to be an engineer or doctor. There's so many opportunities doing a trade. And Indian parents actually have to be supportive of what the child wants to do. From what I'm noticing a lot of parents had kids as a pension plan. \"oh no if you don't make money as an engineer how can I live comfortably?\" Parents are constantly forcing kids into big jobs without asking what they want to do. Look at the NBA. Literally anyone who makes it is pretty much a millionaire. But basketball players here? Zero recognition. Actually I met a budding badminton player while traveling, he haven't played any international player but he already got company sponsorship, government give him stipend.. he was barely 20 but doing good financially based on sports. Isn’t that true for any successful/rich sportsperson that they have means to get back? Alas! sports is for the privileged then. Nice to know! more power to him and his tribe. :) China style strategic spending will not work in India. We are too corrupt and lethargic for that. Promoting sports as a part of life is a much better approach. It's a slow approach but might bear fruits in the future as sports will be looked up rather down. Deep inside we know that she will not return. See its your choice , you chose the profession. Not government or the public."
}