{
    "id": "1cprny3",
    "title": "How probe in 2017 Gauri Lankesh murder unlocked leads in 2013 killing of rationalist Narendra Dabholkar",
    "url": "https://indianexpress.com/article/cities/bangalore/gauri-lankesh-murder-rationalist-pune-narendra-dabholkar-9322450/",
    "selftext": "Still waiting for the leaders of the conspiracy to be identified and charged for their crimes against society. ",
    "flair": "Crime",
    "score": 78,
    "num_comments": 2,
    "created_utc": 1715462841.0,
    "convurl": "https://external-preview.redd.it/iThdyeNRE3DOchjmgdhilOASN6KD4Hv4NNKuy0r13qY.jpg?auto=webp&s=9737ac1306a9808cdd34107719779a2d7439e7c7",
    "comments": [
        "RSS/VHP and these organizations related people",
        "Watch the documentary Vivek (Reason) by Anand Patwardhan. The very last part goes deep into conspiracy theory and is based on one former policeman's theory. \n\nBut the bulk of it is solid and covers this conspiracy and the ATS investigation into the same people and organizations which vanished after 26/11."
    ],
    "cleaned_text": "probe gauri lankesh murder unlocked leads killing rationalist narendra dabholkar still waiting leaders conspiracy identified charged crimes society ",
    "cleaned_title": "probe gauri lankesh murder unlocked leads killing rationalist narendra dabholkar",
    "cleaned_selftext": "still waiting leaders conspiracy identified charged crimes society",
    "cleaned_comments": "rssvhp organizations related people watch documentary vivek reason anand patwardhan last part goes deep conspiracy theory based one former policemans theory bulk solid covers conspiracy ats investigation people organizations vanished",
    "light_cleaned_title": "How probe in 2017 Gauri Lankesh murder unlocked leads in 2013 killing of rationalist Narendra Dabholkar",
    "light_cleaned_selftext": "Still waiting for the leaders of the conspiracy to be identified and charged for their crimes against society.",
    "light_cleaned_comments": "RSS/VHP and these organizations related people Watch the documentary Vivek (Reason) by Anand Patwardhan. The very last part goes deep into conspiracy theory and is based on one former policeman's theory. But the bulk of it is solid and covers this conspiracy and the ATS investigation into the same people and organizations which vanished after 26/11."
}