{
    "id": "sxpjf9",
    "title": "8k/month salary in Bengaluru",
    "url": "https://www.reddit.com/r/india/comments/sxpjf9/8kmonth_salary_in_bengaluru/",
    "selftext": "Received a connection request from a recruiter for this company. I had never heard of them so I decided to google and find out more - when I found this gem in the reviews.\n\n8k/month? For real? Those are poverty wages, and if I found out that this is how they pay their junior staff, I'd never entertain the idea of working for them.\n\nSeriously, I wish there was a way we could spread the word about such exploitative companies.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l0ia0q4wn5j81.png?width=1362&amp;format=png&amp;auto=webp&amp;s=45a09753d19bc98fe0d3e220fa26eeb0eb276b34",
    "flair": "Rant / Vent",
    "score": 25,
    "num_comments": 13,
    "created_utc": 1645435949,
    "convurl": "https://b.thumbs.redditmedia.com/vv4AWEomB3RpJB6jCU4gnckRF2tphEYab8gYmPrIfUI.jpg",
    "comments": [
        "&gt; I wish there was a way we could spread the word about such exploitative companies.\n\nYes. By not censoring the company's name.",
        "Wasn't sure if that was allowed in the sub, so I decided to censor the name for good measure :)",
        "Post it in r/antiwork without redactions",
        "Please name and Shame, it is very much allowed, you are anyway sharing public info.",
        "Assholes actually justify bonded labor and poverty wages..\n\n&gt;pure investment\n\nThat's cost of doing business.",
        "I know someone who works in software for 5k . He is bsc in comp science but still 5k in Bangalore",
        "&gt;I wish there was a way we could spread the word about such exploitative companies.\n\nYes there's one. Don't hide the names of such exploitative companies.",
        "Well you can still tell us i guess....",
        "Degree only lets you get past the automated resume filtering systems, you need to be a good programmer to get great jobs. The age of getting a great job just by having a CS degree is over.",
        "Utthunga Technologies or as they like to call themselves just \"Utthunga\"",
        "True that. But I got 30k for journalism gig I did while my friend is still working for 5 k since he signed a bond ."
    ],
    "cleaned_text": "kmonth salary bengaluru received connection request recruiter company never heard decided google find found gem reviews kmonth real poverty wages found pay junior staff id never entertain idea working seriously wish way could spread word exploitative companies ampxb ",
    "cleaned_title": "kmonth salary bengaluru",
    "cleaned_selftext": "received connection request recruiter company never heard decided google find found gem reviews kmonth real poverty wages found pay junior staff id never entertain idea working seriously wish way could spread word exploitative companies ampxb",
    "cleaned_comments": "gt wish way could spread word exploitative companies yes censoring companys name wasnt sure allowed sub decided censor name good measure post rantiwork without redactions please name shame much allowed anyway sharing public info assholes actually justify bonded labor poverty wages gtpure investment thats cost business know someone works software k bsc comp science still k bangalore gti wish way could spread word exploitative companies yes theres one dont hide names exploitative companies well still tell us guess degree lets get past automated resume filtering systems need good programmer get great jobs age getting great job cs degree utthunga technologies like call utthunga true got k journalism gig friend still working k since signed bond",
    "light_cleaned_title": "8k/month salary in Bengaluru",
    "light_cleaned_selftext": "Received a connection request from a recruiter for this company. I had never heard of them so I decided to google and find out more - when I found this gem in the reviews. 8k/month? For real? Those are poverty wages, and if I found out that this is how they pay their junior staff, I'd never entertain the idea of working for them. Seriously, I wish there was a way we could spread the word about such exploitative companies.",
    "light_cleaned_comments": "&gt; I wish there was a way we could spread the word about such exploitative companies. Yes. By not censoring the company's name. Wasn't sure if that was allowed in the sub, so I decided to censor the name for good measure :) Post it in r/antiwork without redactions Please name and Shame, it is very much allowed, you are anyway sharing public info. Assholes actually justify bonded labor and poverty wages.. &gt;pure investment That's cost of doing business. I know someone who works in software for 5k . He is bsc in comp science but still 5k in Bangalore &gt;I wish there was a way we could spread the word about such exploitative companies. Yes there's one. Don't hide the names of such exploitative companies. Well you can still tell us i guess.... Degree only lets you get past the automated resume filtering systems, you need to be a good programmer to get great jobs. The age of getting a great job just by having a CS degree is over. Utthunga Technologies or as they like to call themselves just \"Utthunga\" True that. But I got 30k for journalism gig I did while my friend is still working for 5 k since he signed a bond ."
}