{
    "id": "1e0ascw",
    "title": "Reddit confession, teen from Faridabad, tip-off: How student who duped US varsity was caught",
    "url": "https://indianexpress.com/article/education/reddit-confession-teen-from-faridabad-tip-off-how-student-who-duped-us-varsity-was-caught-9445775/",
    "selftext": "The student, Aryan Anand, would have gotten away with it too, had it not been for an anonymous post by him on Reddit, and another 19-year-old from Faridabad who pieced together the alleged fraud.",
    "flair": "Crime",
    "score": 205,
    "num_comments": 56,
    "created_utc": 1720655321.0,
    "convurl": "https://external-preview.redd.it/u5F55yxIkYIPU0gOPMgsBTFtyZgK4LYf41cAcleh8fA.jpg?auto=webp&s=70c12c98674ecc2c01de15121473a1ebf68ec5d9",
    "comments": [
        "Why are you linking a paywalled story. Atleast post the contents in the comments.",
        "Lol I swear it wasn't under paywall in the morning when I posted it.  https://12ft.io/ you can always use this to bypass paywall but I have also posted the story in comments now.",
        "# article\n\nAt 1.03 pm on February 23, Lehigh University in Pennsylvania, US received an email titled “Urgent Report of Admission Fraud – Seeking Immediate Investigation”. The short email would set off a chain of events that would ultimately end in the arrest of a 19-year-old from India for allegedly duping the prestigious varsity and securing admission, alongside a scholarship of $85,000.\n\nThe student, Aryan Anand, would have gotten away with it too, had it not been for an anonymous post by him on Reddit, and another 19-year-old from Faridabad who pieced together the alleged fraud. Anand, a computer science student, was arrested on April 30, and charged with forgery, tampering with records or identification, theft by deception, and theft of services.\n\nA spokesperson for Homeland Security Investigations in the US told The Indian Express, “On June 12, Enforcement and Removal Operations arrested Anand based on this criminality and an immigration judge issued a removal order on June 24. ERO continues to hold Anand pending his removal from the United States.”\n\nIt was around 3 am on February 23 that Anand posted on a subreddit called Btechtards, which has over 50,000 members: “I have built my life and career on LIES and FRAUD.” In it, he referred to having fabricated admission paperwork, altered his grades, and even made a fake death certificate of his father to secure an “aid package” at a university.\n\nThe post stated that he scored 58% in Class 12, and he “edited that” to 91%. “I just wanted freedom at any cost, and if I could go to college without even spending a penny of my parents’ money, only then I could get that,” the post read.\n\nJust a day earlier, the whistleblower had joined the subreddit as a moderator. “When I read his post, it felt unbelievable at first. This was either one of the most elaborate frauds committed on an institution or fiction,” the teen, who did not wish to be identified, told The Indian Express. He is currently pursuing B.Tech in Computer Science at a reputed institute in India.\n\nGiven that the post was anonymous and didn’t disclose details of the university, the teenager started going through past posts Anand had made from his anonymous Reddit account – u/TransportationOk4728.\n\nA lot of them were random posts, but in two of them, I noticed he mentioned Lehigh University. He had also posted a photograph of a university, which via reverse image search I realised was also of Lehigh University. I also discovered that the only university community he followed on Reddit was Lehigh,” he said.\n\nIn his email to the university hours later, he wrote: “I serve as the moderator for the subreddit r/Btechtards. I am reaching out to bring to your attention a concerning post recently shared on our platform, which provides comprehensive details regarding an alleged case of admission fraud involving an Indian student… I will attach all the screenshots, which I believe will be enough for the concerned authorities to figure out who the student is.”\n\nAsked why he wrote the email, he told The Indian Express, “His post was horrifying… the fact that he faked his father’s death… I have been a JEE aspirant myself. I have seen how hard people work for the SAT and to get admission to universities abroad. Here this guy was proudly boasting about his fraud… It felt like the morally right thing to do.”\n\nA month passed, and on March 18, he heard back from Detective David Kokinda from the Lehigh University Campus Police Division. Kokinda requested “the exact date of the post” and inquired if the teen would be available for a phone call. The two got on a 15-minute video call around midnight on March 20.\n\nAccording to a complaint filed by the campus police division with the District Attorney’s office in Northampton, the university had pieced together circumstantial evidence to confirm Anand was the one who made the post. Since the post specified he moved to the US and joined the varsity in August 2023, officers figured he was a first-year student. He also wrote that his roommate at the university was involved with a fraternity.\n\nAt the time, Lehigh had only one first-year international student from India on full scholarship. “That student’s name is Aryan Anand. He has a roommate who is in an officially recognised fraternity,” the copy of the complaint filed with the DA’s office reads.\n\nThe university investigation also found that the Reddit account was created using the email address “aryanthegreat@gmail.com”. It had also been accessed from the Lehigh network from Anand’s account, ara327.\n\nThe university also wrote in its complaint that Anand had attended Ruby Children Senior Secondary School in Kota, Rajasthan.\n\nThe Indian Express reached out to the school to learn that school officials have not been contacted about the case so far. School records show he completed Class 10 from a Kendriya Vidyalaya in Hyderabad, and scored 538 out of 600 in his Board exams. He completed Class 11 from a Kendriya Vidyalaya in Kanpur and his permanent address is in Chandigarh. In class 11, he scored a C1 grade, with 58%.\n\nA visit to the Chandigarh address listed in school records led to a dead-end. According to residents at the colony, meant for Indian Air Force employees, Anand or his family did not reside there.\n\nThe university’s complaint also states that the “metadata of (his father’s) death certificate”, which got him the scholarship, “indicates the document was altered on the ‘iLovePDF’ webpage”. According to police, Anand has admitted that his father is alive and living in India.\n\nA press release from the Northampton County District Attorney’s office, dated June 24, reads that Anand “entered a negotiated plea of guilty to one count of forgery. Pursuant to the condition that he return to India… Lehigh University did not request restitution, which would have totaled approximately $85,000. As a condition of his sentence, Anand was released to the custody of the US Immigrations and Customs Enforcement”.\n\nWhen contacted, the university said, “Lehigh revoked his status as a student and his admission was rescinded.”",
        "Some people are so stupid that they don't deserve what they had. He will regret his decision not now but in 10 years when he will be doing some low end in job in some slave shop.",
        "Man kudos to the 19 year old mod in that sub lol. And why would you confess to your crimes on the internet lol?/reddit isn't as anonymous as it seems.",
        "Good. That mod was doing God's  work. Imagine being a student who is desperately in need of aid and then this guy comes in and swoops it with his fake sob story and certificates.",
        "I wonder if he would have succeeded in his life if he wasn't caught. Man was so proud of his achievement that he had to post it on the social media tho lol.",
        "Now every indian applying there will be seen with suspicion.",
        "I think I'm the only person who's angry? Now forget about anyone sharing anything remotely like that ever again.\n\nAlso the mod seems to be jealous.",
        "Nah Im with you dude.",
        "They stop giving grants to genuine Indian students because of bad elements like these.",
        "You guys woud be the first one complaining about reservation taking away opportunities, about BMW wala SC/STs and now you have a problem with a righteous mod aptly giving away a rich well off dude who lied, manipulated forged documents etc to avail a scholarship meant for international students of lesser means....",
        "Why are you angry that he's caught",
        "Mod did the right thing. It was a crime which must be reported.",
        "Huh. \n\nAnd you guys would be the first two complain about how undeserving SC/ST students are taking out your seats.",
        "A part of me thinks that Reddit's anonymity is its sanctity, a lot of people divulge a lot of stuff on this app, and it would all be lost if everyone began to play detective. That being said, this kid didn't hide his identity well enough and is solely to blame. \n\nThat being said, as someone who recently put in my Master’s apps, it's concerning how many Indians scam their way into unis and it's certainly hurt our reputation. So yeah, conflicted.",
        "We were already under increased scrutiny due to frauds in admissions in the past, but this will make it way worse. It only takes one bad example to ruin a good thing built on morality and trust.",
        "Fence paradox",
        "I don't care about the reservation. I'm concerned about reddit not being a safe place.",
        "I'm concerned about reddit not being a safe place.",
        "I'm concerned about reddit not being a safe place.",
        "I don't care about the reservation. I'm concerned about reddit not being a safe place.",
        "It’s easier to apply for better institutions abroad than in India with a cutoff of a germs killer solution.",
        "It’s easier to apply for international institutions than churn through kota factory in India.",
        "Pretty sure his regret would be the confession.",
        "The mod did the right thing. However, I am amazed at this dude fabricating his life. I read that post and couldn't believe how detailed and thorough he was about it all. Imagine if he had put that energy in actually studying.",
        "https://www.removepaywall.com is better.",
        "You can do fraud in india too lol, many people cheat and go to prestigious Institutes.",
        "It's a safe place unless u do stupid stuff.  If he hadn't followed his university or posted anything about university, no one wud have caught him. He posted identifiable information and got cuaght",
        "More like bribing if we are talking about prestigious like DU.",
        "I am also talking about medical colleges.",
        "In India, the colleges themselves are fraud that will even have investments from politicians involved just like most news channels.",
        "Agreed. But still, going after him like the way the mod did shows personal jealousy.",
        "But there has to be a limit to which anonymity has to be respected. This was a case of a scammer who took away a scholarship from someone who actually deserved it by his made up sob story and false documents.",
        "I am not sure where is the jealousy if u are committing a crime on Internet.",
        "Jealousy because he's in us of a and the mod isn't.",
        "Moral: it takes a Desi to catch a Desi hack in America",
        "Thanks for posting text 🤗",
        "Is the post still out there to read by any chance ?",
        "The thrill and high of doing something outlandish and getting away with it.In this case,that did not happen though 😜",
        "Desi on desi action 😆",
        "Because bud also wanted the thrill of boasting about his crime on the internet 🤦‍♂️😂",
        "Sometimes thrill kills.",
        "Link of the post?",
        "Safe place for crimes? Yeah we don't need that.",
        "It's still up on some other similar subs. I have seen it circulating around several times.",
        "Snitch",
        "Thanks for sharing the full article.",
        ":)",
        ":)",
        "lol re",
        "We definitely need that otherwise you'll never know such things at all.",
        "thats the only way to improve our image globally. if you don't stop fellow indians from being absolutely brain dead and poor in ethics/morals then you who will??",
        "I lost my father to ncslc last year and this news is so distressing to me I guess I wont even mention it now in my interviews people will think I am lying",
        "Made a documentary on this : [https://youtu.be/2\\_iePgIAm\\_M](https://youtu.be/2_iePgIAm_M)",
        "Made a documentary on this : https://youtu.be/2_iePgIAm_M",
        "Made a documentary on this : https://youtu.be/2_iePgIAm_M",
        "Made a documentary on this : https://youtu.be/2_iePgIAm_M",
        "Made a documentary on this : https://youtu.be/2_iePgIAm_M"
    ],
    "cleaned_text": "reddit confession teen faridabad tipoff student duped us varsity caught student aryan anand would gotten away anonymous post reddit another yearold faridabad pieced together alleged fraud ",
    "cleaned_title": "reddit confession teen faridabad tipoff student duped us varsity caught",
    "cleaned_selftext": "student aryan anand would gotten away anonymous post reddit another yearold faridabad pieced together alleged fraud",
    "cleaned_comments": "linking paywalled story atleast post contents comments lol swear wasnt paywall morning posted always use bypass paywall also posted story comments article pm february lehigh university pennsylvania us received email titled urgent report admission fraud seeking immediate investigation short email would set chain events would ultimately end arrest yearold india allegedly duping prestigious varsity securing admission alongside scholarship student aryan anand would gotten away anonymous post reddit another yearold faridabad pieced together alleged fraud anand computer science student arrested april charged forgery tampering records identification theft deception theft services spokesperson homeland security investigations us told indian express june enforcement removal operations arrested anand based criminality immigration judge issued removal order june ero continues hold anand pending removal united states around february anand posted subreddit called btechtards members built life career lies fraud referred fabricated admission paperwork altered grades even made fake death certificate father secure aid package university post stated scored class edited wanted freedom cost could go college without even spending penny parents money could get post read day earlier whistleblower joined subreddit moderator read post felt unbelievable first either one elaborate frauds committed institution fiction teen wish identified told indian express currently pursuing btech computer science reputed institute india given post anonymous didnt disclose details university teenager started going past posts anand made anonymous reddit account utransportationok lot random posts two noticed mentioned lehigh university also posted photograph university via reverse image search realised also lehigh university also discovered university community followed reddit lehigh said email university hours later wrote serve moderator subreddit rbtechtards reaching bring attention concerning post recently shared platform provides comprehensive details regarding alleged case admission fraud involving indian student attach screenshots believe enough concerned authorities figure student asked wrote email told indian express post horrifying fact faked fathers death jee aspirant seen hard people work sat get admission universities abroad guy proudly boasting fraud felt like morally right thing month passed march heard back detective david kokinda lehigh university campus police division kokinda requested exact date post inquired teen would available phone call two got minute video call around midnight march according complaint filed campus police division district attorneys office northampton university pieced together circumstantial evidence confirm anand one made post since post specified moved us joined varsity august officers figured firstyear student also wrote roommate university involved fraternity time lehigh one firstyear international student india full scholarship students name aryan anand roommate officially recognised fraternity copy complaint filed das office reads university investigation also found reddit account created using email address aryanthegreatgmailcom also accessed lehigh network anands account ara university also wrote complaint anand attended ruby children senior secondary school kota rajasthan indian express reached school learn school officials contacted case far school records show completed class kendriya vidyalaya hyderabad scored board exams completed class kendriya vidyalaya kanpur permanent address chandigarh class scored c grade visit chandigarh address listed school records led deadend according residents colony meant indian air force employees anand family reside universitys complaint also states metadata fathers death certificate got scholarship indicates document altered ilovepdf webpage according police anand admitted father alive living india press release northampton county district attorneys office dated june reads anand entered negotiated plea guilty one count forgery pursuant condition return india lehigh university request restitution would totaled approximately condition sentence anand released custody us immigrations customs enforcement contacted university said lehigh revoked status student admission rescinded people stupid dont deserve regret decision years low end job slave shop man kudos year old mod sub lol would confess crimes internet lolreddit isnt anonymous seems good mod gods work imagine student desperately need aid guy comes swoops fake sob story certificates wonder would succeeded life wasnt caught man proud achievement post social media tho lol every indian applying seen suspicion think im person whos angry forget anyone sharing anything remotely like ever also mod seems jealous nah im dude stop giving grants genuine indian students bad elements like guys woud first one complaining reservation taking away opportunities bmw wala scsts problem righteous mod aptly giving away rich well dude lied manipulated forged documents etc avail scholarship meant international students lesser means angry hes caught mod right thing crime must reported huh guys would first two complain undeserving scst students taking seats part thinks reddits anonymity sanctity lot people divulge lot stuff app would lost everyone began play detective said kid didnt hide identity well enough solely blame said someone recently put masters apps concerning many indians scam way unis certainly hurt reputation yeah conflicted already increased scrutiny due frauds admissions past make way worse takes one bad example ruin good thing built morality trust fence paradox dont care reservation im concerned reddit safe place im concerned reddit safe place im concerned reddit safe place dont care reservation im concerned reddit safe place easier apply better institutions abroad india cutoff germs killer solution easier apply international institutions churn kota factory india pretty sure regret would confession mod right thing however amazed dude fabricating life read post couldnt believe detailed thorough imagine put energy actually studying better fraud india lol many people cheat go prestigious institutes safe place unless u stupid stuff hadnt followed university posted anything university one wud caught posted identifiable information got cuaght like bribing talking prestigious like du also talking medical colleges india colleges fraud even investments politicians involved like news channels agreed still going like way mod shows personal jealousy limit anonymity respected case scammer took away scholarship someone actually deserved made sob story false documents sure jealousy u committing crime internet jealousy hes us mod isnt moral takes desi catch desi hack america thanks posting text post still read chance thrill high something outlandish getting away itin casethat happen though desi desi action bud also wanted thrill boasting crime internet sometimes thrill kills link post safe place crimes yeah dont need still similar subs seen circulating around several times snitch thanks sharing full article lol definitely need otherwise youll never know things thats way improve image globally dont stop fellow indians absolutely brain dead poor ethicsmorals lost father ncslc last year news distressing guess wont even mention interviews people think lying made documentary httpsyoutubeiepgiammhttpsyoutubeiepgiamm made documentary made documentary made documentary made documentary",
    "light_cleaned_title": "Reddit confession, teen from Faridabad, tip-off: How student who duped US varsity was caught",
    "light_cleaned_selftext": "The student, Aryan Anand, would have gotten away with it too, had it not been for an anonymous post by him on Reddit, and another 19-year-old from Faridabad who pieced together the alleged fraud.",
    "light_cleaned_comments": "Why are you linking a paywalled story. Atleast post the contents in the comments. Lol I swear it wasn't under paywall in the morning when I posted it. you can always use this to bypass paywall but I have also posted the story in comments now. # article At 1.03 pm on February 23, Lehigh University in Pennsylvania, US received an email titled “Urgent Report of Admission Fraud – Seeking Immediate Investigation”. The short email would set off a chain of events that would ultimately end in the arrest of a 19-year-old from India for allegedly duping the prestigious varsity and securing admission, alongside a scholarship of $85,000. The student, Aryan Anand, would have gotten away with it too, had it not been for an anonymous post by him on Reddit, and another 19-year-old from Faridabad who pieced together the alleged fraud. Anand, a computer science student, was arrested on April 30, and charged with forgery, tampering with records or identification, theft by deception, and theft of services. A spokesperson for Homeland Security Investigations in the US told The Indian Express, “On June 12, Enforcement and Removal Operations arrested Anand based on this criminality and an immigration judge issued a removal order on June 24. ERO continues to hold Anand pending his removal from the United States.” It was around 3 am on February 23 that Anand posted on a subreddit called Btechtards, which has over 50,000 members: “I have built my life and career on LIES and FRAUD.” In it, he referred to having fabricated admission paperwork, altered his grades, and even made a fake death certificate of his father to secure an “aid package” at a university. The post stated that he scored 58% in Class 12, and he “edited that” to 91%. “I just wanted freedom at any cost, and if I could go to college without even spending a penny of my parents’ money, only then I could get that,” the post read. Just a day earlier, the whistleblower had joined the subreddit as a moderator. “When I read his post, it felt unbelievable at first. This was either one of the most elaborate frauds committed on an institution or fiction,” the teen, who did not wish to be identified, told The Indian Express. He is currently pursuing B.Tech in Computer Science at a reputed institute in India. Given that the post was anonymous and didn’t disclose details of the university, the teenager started going through past posts Anand had made from his anonymous Reddit account – u/TransportationOk4728. A lot of them were random posts, but in two of them, I noticed he mentioned Lehigh University. He had also posted a photograph of a university, which via reverse image search I realised was also of Lehigh University. I also discovered that the only university community he followed on Reddit was Lehigh,” he said. In his email to the university hours later, he wrote: “I serve as the moderator for the subreddit r/Btechtards. I am reaching out to bring to your attention a concerning post recently shared on our platform, which provides comprehensive details regarding an alleged case of admission fraud involving an Indian student… I will attach all the screenshots, which I believe will be enough for the concerned authorities to figure out who the student is.” Asked why he wrote the email, he told The Indian Express, “His post was horrifying… the fact that he faked his father’s death… I have been a JEE aspirant myself. I have seen how hard people work for the SAT and to get admission to universities abroad. Here this guy was proudly boasting about his fraud… It felt like the morally right thing to do.” A month passed, and on March 18, he heard back from Detective David Kokinda from the Lehigh University Campus Police Division. Kokinda requested “the exact date of the post” and inquired if the teen would be available for a phone call. The two got on a 15-minute video call around midnight on March 20. According to a complaint filed by the campus police division with the District Attorney’s office in Northampton, the university had pieced together circumstantial evidence to confirm Anand was the one who made the post. Since the post specified he moved to the US and joined the varsity in August 2023, officers figured he was a first-year student. He also wrote that his roommate at the university was involved with a fraternity. At the time, Lehigh had only one first-year international student from India on full scholarship. “That student’s name is Aryan Anand. He has a roommate who is in an officially recognised fraternity,” the copy of the complaint filed with the DA’s office reads. The university investigation also found that the Reddit account was created using the email address “aryanthegreat@gmail.com”. It had also been accessed from the Lehigh network from Anand’s account, ara327. The university also wrote in its complaint that Anand had attended Ruby Children Senior Secondary School in Kota, Rajasthan. The Indian Express reached out to the school to learn that school officials have not been contacted about the case so far. School records show he completed Class 10 from a Kendriya Vidyalaya in Hyderabad, and scored 538 out of 600 in his Board exams. He completed Class 11 from a Kendriya Vidyalaya in Kanpur and his permanent address is in Chandigarh. In class 11, he scored a C1 grade, with 58%. A visit to the Chandigarh address listed in school records led to a dead-end. According to residents at the colony, meant for Indian Air Force employees, Anand or his family did not reside there. The university’s complaint also states that the “metadata of (his father’s) death certificate”, which got him the scholarship, “indicates the document was altered on the ‘iLovePDF’ webpage”. According to police, Anand has admitted that his father is alive and living in India. A press release from the Northampton County District Attorney’s office, dated June 24, reads that Anand “entered a negotiated plea of guilty to one count of forgery. Pursuant to the condition that he return to India… Lehigh University did not request restitution, which would have totaled approximately $85,000. As a condition of his sentence, Anand was released to the custody of the US Immigrations and Customs Enforcement”. When contacted, the university said, “Lehigh revoked his status as a student and his admission was rescinded.” Some people are so stupid that they don't deserve what they had. He will regret his decision not now but in 10 years when he will be doing some low end in job in some slave shop. Man kudos to the 19 year old mod in that sub lol. And why would you confess to your crimes on the internet lol?/reddit isn't as anonymous as it seems. Good. That mod was doing God's work. Imagine being a student who is desperately in need of aid and then this guy comes in and swoops it with his fake sob story and certificates. I wonder if he would have succeeded in his life if he wasn't caught. Man was so proud of his achievement that he had to post it on the social media tho lol. Now every indian applying there will be seen with suspicion. I think I'm the only person who's angry? Now forget about anyone sharing anything remotely like that ever again. Also the mod seems to be jealous. Nah Im with you dude. They stop giving grants to genuine Indian students because of bad elements like these. You guys woud be the first one complaining about reservation taking away opportunities, about BMW wala SC/STs and now you have a problem with a righteous mod aptly giving away a rich well off dude who lied, manipulated forged documents etc to avail a scholarship meant for international students of lesser means.... Why are you angry that he's caught Mod did the right thing. It was a crime which must be reported. Huh. And you guys would be the first two complain about how undeserving SC/ST students are taking out your seats. A part of me thinks that Reddit's anonymity is its sanctity, a lot of people divulge a lot of stuff on this app, and it would all be lost if everyone began to play detective. That being said, this kid didn't hide his identity well enough and is solely to blame. That being said, as someone who recently put in my Master’s apps, it's concerning how many Indians scam their way into unis and it's certainly hurt our reputation. So yeah, conflicted. We were already under increased scrutiny due to frauds in admissions in the past, but this will make it way worse. It only takes one bad example to ruin a good thing built on morality and trust. Fence paradox I don't care about the reservation. I'm concerned about reddit not being a safe place. I'm concerned about reddit not being a safe place. I'm concerned about reddit not being a safe place. I don't care about the reservation. I'm concerned about reddit not being a safe place. It’s easier to apply for better institutions abroad than in India with a cutoff of a germs killer solution. It’s easier to apply for international institutions than churn through kota factory in India. Pretty sure his regret would be the confession. The mod did the right thing. However, I am amazed at this dude fabricating his life. I read that post and couldn't believe how detailed and thorough he was about it all. Imagine if he had put that energy in actually studying. is better. You can do fraud in india too lol, many people cheat and go to prestigious Institutes. It's a safe place unless u do stupid stuff. If he hadn't followed his university or posted anything about university, no one wud have caught him. He posted identifiable information and got cuaght More like bribing if we are talking about prestigious like DU. I am also talking about medical colleges. In India, the colleges themselves are fraud that will even have investments from politicians involved just like most news channels. Agreed. But still, going after him like the way the mod did shows personal jealousy. But there has to be a limit to which anonymity has to be respected. This was a case of a scammer who took away a scholarship from someone who actually deserved it by his made up sob story and false documents. I am not sure where is the jealousy if u are committing a crime on Internet. Jealousy because he's in us of a and the mod isn't. Moral: it takes a Desi to catch a Desi hack in America Thanks for posting text 🤗 Is the post still out there to read by any chance ? The thrill and high of doing something outlandish and getting away with it.In this case,that did not happen though 😜 Desi on desi action 😆 Because bud also wanted the thrill of boasting about his crime on the internet 🤦‍♂️😂 Sometimes thrill kills. Link of the post? Safe place for crimes? Yeah we don't need that. It's still up on some other similar subs. I have seen it circulating around several times. Snitch Thanks for sharing the full article. :) :) lol re We definitely need that otherwise you'll never know such things at all. thats the only way to improve our image globally. if you don't stop fellow indians from being absolutely brain dead and poor in ethics/morals then you who will?? I lost my father to ncslc last year and this news is so distressing to me I guess I wont even mention it now in my interviews people will think I am lying Made a documentary on this : [https://youtu.be/2\\_iePgIAm\\_M](https://youtu.be/2_iePgIAm_M) Made a documentary on this : Made a documentary on this : Made a documentary on this : Made a documentary on this :"
}