{
    "id": "16gsuvo",
    "title": "Dalit woman raped, filmed, forced to eat beef by two Muslim men in Uttar Pradesh",
    "url": "https://www.reddit.com/r/india/comments/16gsuvo/dalit_woman_raped_filmed_forced_to_eat_beef_by/",
    "selftext": " [Dalit woman raped, filmed, forced to eat beef by two Muslim men in Uttar Pradesh - India Today](https://www.indiatoday.in/india/story/uttar-pradesh-dalit-woman-raped-forced-to-eat-beef-by-two-muslim-men-2432742-2023-09-08)   \nLiberals tell me where did your secularism go that you aren't even talking about this? ",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694528921.0,
    "convurl": "https://external-preview.redd.it/MW2Gq2MWZXzU8Gu6n0rpzBMrwTqZf2RZE3AmtKgNsjE.jpg?auto=webp&s=c9e7764892680223d79d5af2fb59e3402e662fcc",
    "comments": [
        "As a secular these guys should undergo the worst possible torcher in mankind",
        "https://reddit.com/r/india/s/I8Hcd5VOmt\n\n\nHere, like geez learn how to use search on reddit. It's not even that old.",
        "Liberals talk about cases where government is NOT taking action. Like in Manipur. It took months for FIRs to be filled. Like with the the wrestlers. Same situation. FIRs were filled months later.\n\nRead the article you have shared.\n\n>  All the accused have been arrested,\"\n\nHope that explains things.",
        "just high on the mutra",
        "You're human being  before being  classified  as a secular  or  non secular  individual  .Nd such scums should get the worst form of punishment  for all one cares",
        "Educated enough to make this post but not sincere enough to do a simple search.\n\nThat's OP.  \n\nThere are millions like him and they vote. Scary.",
        "sasta nasha!",
        "Why would they? OP only cares about making allegations and then disappearing when challenged. If someone’s only post about a horrific incidence is about how some people did not react to it then they clearly only care about their agenda."
    ],
    "cleaned_text": "dalit woman raped filmed forced eat beef two muslim men uttar pradesh dalit woman raped filmed forced eat beef two muslim men uttar pradesh india todayhttpswwwindiatodayinindiastoryuttarpradeshdalitwomanrapedforcedtoeatbeefbytwomuslimmen liberals tell secularism go arent even talking ",
    "cleaned_title": "dalit woman raped filmed forced eat beef two muslim men uttar pradesh",
    "cleaned_selftext": "dalit woman raped filmed forced eat beef two muslim men uttar pradesh india todayhttpswwwindiatodayinindiastoryuttarpradeshdalitwomanrapedforcedtoeatbeefbytwomuslimmen liberals tell secularism go arent even talking",
    "cleaned_comments": "secular guys undergo worst possible torcher mankind like geez learn use search reddit even old liberals talk cases government taking action like manipur took months firs filled like wrestlers situation firs filled months later read article shared accused arrested hope explains things high mutra youre human classified secular non secular individual nd scums get worst form punishment one cares educated enough make post sincere enough simple search thats op millions like vote scary sasta nasha would op cares making allegations disappearing challenged someones post horrific incidence people react clearly care agenda",
    "light_cleaned_title": "Dalit woman raped, filmed, forced to eat beef by two Muslim men in Uttar Pradesh",
    "light_cleaned_selftext": "[Dalit woman raped, filmed, forced to eat beef by two Muslim men in Uttar Pradesh - India Today](https://www.indiatoday.in/india/story/uttar-pradesh-dalit-woman-raped-forced-to-eat-beef-by-two-muslim-men-2432742-2023-09-08) Liberals tell me where did your secularism go that you aren't even talking about this?",
    "light_cleaned_comments": "As a secular these guys should undergo the worst possible torcher in mankind Here, like geez learn how to use search on reddit. It's not even that old. Liberals talk about cases where government is NOT taking action. Like in Manipur. It took months for FIRs to be filled. Like with the the wrestlers. Same situation. FIRs were filled months later. Read the article you have shared. > All the accused have been arrested,\" Hope that explains things. just high on the mutra You're human being before being classified as a secular or non secular individual .Nd such scums should get the worst form of punishment for all one cares Educated enough to make this post but not sincere enough to do a simple search. That's OP. There are millions like him and they vote. Scary. sasta nasha! Why would they? OP only cares about making allegations and then disappearing when challenged. If someone’s only post about a horrific incidence is about how some people did not react to it then they clearly only care about their agenda."
}