{
    "id": "1hlt0nd",
    "title": "Indian Demography: Myths and Facts A talk by Sujai Karampuri",
    "url": "https://youtu.be/KVQKgDkHst8",
    "selftext": "I came across a lot of misinformation about population trends. So hopefully this might help enlighten a few curious souls. \n\n1. Replacement rate for stable population is measured by total fertility rate (avg number of children per woman in her lifetime). 2.1 means population stays stable (over long term). India’s TFR has already dipped to 2.0 and will continue to go down further. \n2. India’s population will peak at 1.6 billion by 2048. After that it starts to decline. \n3. Bihar and UP have highest TFR currently (3.0 and 2.4), but it is declining fast. Most higher developed states have it below 2.\n4. China TFR is at 0.7 that means in another two generations their population will be half. Imagine what it means to have half the people needing half the homes, jobs, cars etc. \n\nReligion / Caste: \n1. TFR decline is universal trend across all religions in India. (2019 data; all have come down further since)\n- STs 2.5\n- Muslims 2.4\n- SCs: 2.3\n- OBCs: 2.2\n2. TFR is declining across all segments with development. TFR of Muslims in Telangana is 1.9 while of Hindus in Bihar is ~2.8. Correlation is stronger with development than religion. \n3. Even if current TFR remains (no further reduction for each group), majority in India will still be OBCs after 100 years! (Currently at 41% of population). \n",
    "flair": "Policy/Economy",
    "score": 66,
    "num_comments": 9,
    "created_utc": 1735098122.0,
    "convurl": "https://external-preview.redd.it/tA0S4r6t0tLTvJaf2NIdy8Wy78QkdE26MIEOcDX5DEI.jpg?auto=webp&s=fb7570f967e124df555b8667826735c09471d8b9",
    "comments": [
        "The big problem is our TFR is now low and we’ll get old before we get rich. So who’s gonna support our old asses with elder care and medical stuff",
        "Keep calm and trust Modiji and Adaniji",
        "Our generation (20-40 years old) will be on our own. Our taxes won’t support neither pension nor healthcare in our old age.\nWe run the risk of demographic burden (not enough jobs for working age) and demographic collapse (too many old people) within our lifetime. \n\nBut religion/reservations/freebies are more important issues /s.",
        "I think another significant (and probably bigger) issue, at least for the urban educated middle class, is the issue of people leaving the country. In my extended family, about half the youngsters in the 17-25 age group has left or has plans to leave the country for good. These people will (I believe) be counted as Indian citizens in the census, but they're not actually contributing to the economy or in other ways.",
        "One more point -\n\nFor India, replacement rate is not 2.1 but much higher. It might even be higher than 2.2.\n\nWhy? 2.1 is for developed countries like UK, US etc. not India. India has ten times infant mortality rate, 10 years less life expectancy, highest suicide rate etc. so india and UK cannot have same replacement rate.\n\nSo, India actually achieved sub replacement rate much before.\n\nAnd the direct impact of this change is actually visible. The biggest impact of this is on our education system. The total number of schools in India is actually decreasing every year. Number of students appearing for class X exam across India is steadily decreasing. There is labour shortage in many states.",
        ">But religion/reservations/freebies are more important issues /s.\n\nOfcourse. That gets them votes and keeps them in power. \n\nAnd they will be long dead so why care about these issues?",
        "Sadly, people are more politically motivated by fear than by inspiration. \n\nPeople are more likely to vote for me if I tell them that their 1BHK will be taken away, instead of a promise of 2BHK. Bird in hand is valued more.",
        "Spot on. This should be debate of our generation rather than mandir masjid. \n\nThis and growth delivering jobs!",
        "Depends on how honest you are to the census officer but I don’t think emigration is that high atm"
    ],
    "cleaned_text": "indian demography myths facts talk sujai karampuri came across lot misinformation population trends hopefully might help enlighten curious souls replacement rate stable population measured total fertility rate avg number children per woman lifetime means population stays stable long term indias tfr already dipped continue go indias population peak billion starts decline bihar highest tfr currently declining fast higher developed states china tfr means another two generations population half imagine means half people needing half homes jobs cars etc religion caste tfr decline universal trend across religions india data come since sts muslims scs obcs tfr declining across segments development tfr muslims telangana hindus bihar correlation stronger development religion even current tfr remains reduction group majority india still obcs years currently population ",
    "cleaned_title": "indian demography myths facts talk sujai karampuri",
    "cleaned_selftext": "came across lot misinformation population trends hopefully might help enlighten curious souls replacement rate stable population measured total fertility rate avg number children per woman lifetime means population stays stable long term indias tfr already dipped continue go indias population peak billion starts decline bihar highest tfr currently declining fast higher developed states china tfr means another two generations population half imagine means half people needing half homes jobs cars etc religion caste tfr decline universal trend across religions india data come since sts muslims scs obcs tfr declining across segments development tfr muslims telangana hindus bihar correlation stronger development religion even current tfr remains reduction group majority india still obcs years currently population",
    "cleaned_comments": "big problem tfr low well get old get rich whos gon na support old asses elder care medical stuff keep calm trust modiji adaniji generation years old taxes wont support neither pension healthcare old age run risk demographic burden enough jobs working age demographic collapse many old people within lifetime religionreservationsfreebies important issues think another significant probably bigger issue least urban educated middle class issue people leaving country extended family half youngsters age group left plans leave country good people believe counted indian citizens census theyre actually contributing economy ways one point india replacement rate much higher might even higher developed countries like uk us etc india india ten times infant mortality rate years less life expectancy highest suicide rate etc india uk replacement rate india actually achieved sub replacement rate much direct impact change actually visible biggest impact education system total number schools india actually decreasing every year number students appearing class x exam across india steadily decreasing labour shortage many states religionreservationsfreebies important issues ofcourse gets votes keeps power long dead care issues sadly people politically motivated fear inspiration people likely vote tell bhk taken away instead promise bhk bird hand valued spot debate generation rather mandir masjid growth delivering jobs depends honest census officer dont think emigration high atm",
    "light_cleaned_title": "Indian Demography: Myths and Facts A talk by Sujai Karampuri",
    "light_cleaned_selftext": "I came across a lot of misinformation about population trends. So hopefully this might help enlighten a few curious souls. 1. Replacement rate for stable population is measured by total fertility rate (avg number of children per woman in her lifetime). 2.1 means population stays stable (over long term). India’s TFR has already dipped to 2.0 and will continue to go down further. 2. India’s population will peak at 1.6 billion by 2048. After that it starts to decline. 3. Bihar and UP have highest TFR currently (3.0 and 2.4), but it is declining fast. Most higher developed states have it below 2. 4. China TFR is at 0.7 that means in another two generations their population will be half. Imagine what it means to have half the people needing half the homes, jobs, cars etc. Religion / Caste: 1. TFR decline is universal trend across all religions in India. (2019 data; all have come down further since) - STs 2.5 - Muslims 2.4 - SCs: 2.3 - OBCs: 2.2 2. TFR is declining across all segments with development. TFR of Muslims in Telangana is 1.9 while of Hindus in Bihar is ~2.8. Correlation is stronger with development than religion. 3. Even if current TFR remains (no further reduction for each group), majority in India will still be OBCs after 100 years! (Currently at 41% of population).",
    "light_cleaned_comments": "The big problem is our TFR is now low and we’ll get old before we get rich. So who’s gonna support our old asses with elder care and medical stuff Keep calm and trust Modiji and Adaniji Our generation (20-40 years old) will be on our own. Our taxes won’t support neither pension nor healthcare in our old age. We run the risk of demographic burden (not enough jobs for working age) and demographic collapse (too many old people) within our lifetime. But religion/reservations/freebies are more important issues /s. I think another significant (and probably bigger) issue, at least for the urban educated middle class, is the issue of people leaving the country. In my extended family, about half the youngsters in the 17-25 age group has left or has plans to leave the country for good. These people will (I believe) be counted as Indian citizens in the census, but they're not actually contributing to the economy or in other ways. One more point - For India, replacement rate is not 2.1 but much higher. It might even be higher than 2.2. Why? 2.1 is for developed countries like UK, US etc. not India. India has ten times infant mortality rate, 10 years less life expectancy, highest suicide rate etc. so india and UK cannot have same replacement rate. So, India actually achieved sub replacement rate much before. And the direct impact of this change is actually visible. The biggest impact of this is on our education system. The total number of schools in India is actually decreasing every year. Number of students appearing for class X exam across India is steadily decreasing. There is labour shortage in many states. >But religion/reservations/freebies are more important issues /s. Ofcourse. That gets them votes and keeps them in power. And they will be long dead so why care about these issues? Sadly, people are more politically motivated by fear than by inspiration. People are more likely to vote for me if I tell them that their 1BHK will be taken away, instead of a promise of 2BHK. Bird in hand is valued more. Spot on. This should be debate of our generation rather than mandir masjid. This and growth delivering jobs! Depends on how honest you are to the census officer but I don’t think emigration is that high atm"
}