{
    "id": "1egj4m9",
    "title": "Swiggy APK scam alert!",
    "url": "https://www.reddit.com/gallery/1egj4m9",
    "selftext": "Okay so today I had ordered a pasta from bowl company, and while I was eating, I found a fucking hair strand in my food. Now, I decided to go to the Swiggy app to lodge a complaint and the reply I got from the chatbot was \"the company has checked their standards, and it's all good so they can't give refund\"\nWhat was more concerning was I immediately got a call from an unknown number and the guy claimed to be a Swiggy customer care partner. He asked me to explain what the issue was, and after I told him, he told me to stay on call as he texts me on whatsapp. He told me he will send a \"file\" to input details into and the refund will be processed in an hour or so. I got the inkling that this was fake but because he called me almost instantaneously after I filed the complain,I thought he was genuine. So this guy sent me some weird APK file and told I've to input my details there (all the screenshots are uploaded) so I opened the file and put my name and then it asked for bank details. I immediately understood from the interface that this had no connection to Swiggy and cut the call and deleted the apk from my phone. \nI'm worried now..how the fuck did these guys get my number when I lodged the complaint so quick? ",
    "flair": "Crime",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1722419323.0,
    "convurl": "https://i.redd.it/ki15gyhystfd1.jpg",
    "comments": [],
    "cleaned_text": "swiggy apk scam alert okay today ordered pasta bowl company eating found fucking hair strand food decided go swiggy app lodge complaint reply got chatbot company checked standards good cant give refund concerning immediately got call unknown number guy claimed swiggy customer care partner asked explain issue told told stay call texts whatsapp told send file input details refund processed hour got inkling fake called almost instantaneously filed complaini thought genuine guy sent weird apk file told ive input details screenshots uploaded opened file put name asked bank details immediately understood interface connection swiggy cut call deleted apk phone im worried nowhow fuck guys get number lodged complaint quick ",
    "cleaned_title": "swiggy apk scam alert",
    "cleaned_selftext": "okay today ordered pasta bowl company eating found fucking hair strand food decided go swiggy app lodge complaint reply got chatbot company checked standards good cant give refund concerning immediately got call unknown number guy claimed swiggy customer care partner asked explain issue told told stay call texts whatsapp told send file input details refund processed hour got inkling fake called almost instantaneously filed complaini thought genuine guy sent weird apk file told ive input details screenshots uploaded opened file put name asked bank details immediately understood interface connection swiggy cut call deleted apk phone im worried nowhow fuck guys get number lodged complaint quick",
    "cleaned_comments": "",
    "light_cleaned_title": "Swiggy APK scam alert!",
    "light_cleaned_selftext": "Okay so today I had ordered a pasta from bowl company, and while I was eating, I found a fucking hair strand in my food. Now, I decided to go to the Swiggy app to lodge a complaint and the reply I got from the chatbot was \"the company has checked their standards, and it's all good so they can't give refund\" What was more concerning was I immediately got a call from an unknown number and the guy claimed to be a Swiggy customer care partner. He asked me to explain what the issue was, and after I told him, he told me to stay on call as he texts me on whatsapp. He told me he will send a \"file\" to input details into and the refund will be processed in an hour or so. I got the inkling that this was fake but because he called me almost instantaneously after I filed the complain,I thought he was genuine. So this guy sent me some weird APK file and told I've to input my details there (all the screenshots are uploaded) so I opened the file and put my name and then it asked for bank details. I immediately understood from the interface that this had no connection to Swiggy and cut the call and deleted the apk from my phone. I'm worried now..how the fuck did these guys get my number when I lodged the complaint so quick?",
    "light_cleaned_comments": ""
}