{
    "id": "12pmee5",
    "title": "Maharashtra Bhushan Award ceremony turns deadly; 11 die, over 600 suffer heatstroke in Kharghar | Navi Mumbai News - Times of India",
    "url": "https://timesofindia.indiatimes.com/city/navi-mumbai/11-attendees-of-maharashtra-bhushan-award-ceremony-die-of-heat-related-health-issues-in-navi-mumbais-kharghar/articleshow/99539090.cms",
    "selftext": "A crowd of lakhs sat under a scorching sun for over five hours (8am to 1pm) at the Kharghar International Corporate Park grounds while the award was being conferred on social activist Dattatreya Narayan alias Appasaheb Dharmadhikari. Union home minister Amit Shah, Shinde, deputy chief minister Devendra Fadnavis and Union minister Kapil Patil were on the dais, which was covered, along with other VIPs",
    "flair": "Politics",
    "score": 68,
    "num_comments": 6,
    "created_utc": 1681746637.0,
    "convurl": "https://external-preview.redd.it/2-1N2LDuLSj0AX4Zltg-DSy4yq3PULP64pBf1V4iE2g.jpg?auto=webp&v=enabled&s=b22373ccdda7f8aedb0a757c25b1d450baa7b3c0",
    "comments": [
        "They are stupid enough to fall for such a stupid trap that such stupid people set up.",
        "Obviously the organisers are stupid, heartless yadayada... But nobody was forcing them to sit there. You come there, feel the heat in the air and still chose to sit unrpotected from the sun without any incentive, you had it coming",
        "Oh dear son, you don't know what poverty forces people to do",
        "Blind faith and religion\n\n  \n\n\nPeople there were devotees of person getting awards, like Sadhguru or ramdev or some xyz. These PPL were kinda instructed to be there, it's stupid but blind faith can make you do this.",
        "Darwin awards?"
    ],
    "cleaned_text": "maharashtra bhushan award ceremony turns deadly die suffer heatstroke kharghar navi mumbai news times india crowd lakhs sat scorching sun five hours pm kharghar international corporate park grounds award conferred social activist dattatreya narayan alias appasaheb dharmadhikari union home minister amit shah shinde deputy chief minister devendra fadnavis union minister kapil patil dais covered along vips ",
    "cleaned_title": "maharashtra bhushan award ceremony turns deadly die suffer heatstroke kharghar navi mumbai news times india",
    "cleaned_selftext": "crowd lakhs sat scorching sun five hours pm kharghar international corporate park grounds award conferred social activist dattatreya narayan alias appasaheb dharmadhikari union home minister amit shah shinde deputy chief minister devendra fadnavis union minister kapil patil dais covered along vips",
    "cleaned_comments": "stupid enough fall stupid trap stupid people set obviously organisers stupid heartless yadayada nobody forcing sit come feel heat air still chose sit unrpotected sun without incentive coming oh dear son dont know poverty forces people blind faith religion people devotees person getting awards like sadhguru ramdev xyz ppl kinda instructed stupid blind faith make darwin awards",
    "light_cleaned_title": "Maharashtra Bhushan Award ceremony turns deadly; 11 die, over 600 suffer heatstroke in Kharghar | Navi Mumbai News - Times of India",
    "light_cleaned_selftext": "A crowd of lakhs sat under a scorching sun for over five hours (8am to 1pm) at the Kharghar International Corporate Park grounds while the award was being conferred on social activist Dattatreya Narayan alias Appasaheb Dharmadhikari. Union home minister Amit Shah, Shinde, deputy chief minister Devendra Fadnavis and Union minister Kapil Patil were on the dais, which was covered, along with other VIPs",
    "light_cleaned_comments": "They are stupid enough to fall for such a stupid trap that such stupid people set up. Obviously the organisers are stupid, heartless yadayada... But nobody was forcing them to sit there. You come there, feel the heat in the air and still chose to sit unrpotected from the sun without any incentive, you had it coming Oh dear son, you don't know what poverty forces people to do Blind faith and religion People there were devotees of person getting awards, like Sadhguru or ramdev or some xyz. These PPL were kinda instructed to be there, it's stupid but blind faith can make you do this. Darwin awards?"
}