{
    "id": "1677zao",
    "title": "What are your opinions?",
    "url": "https://www.reddit.com/r/india/comments/1677zao/what_are_your_opinions/",
    "selftext": "I believe such missions need to be in the mainstream then only people will have more knowledge about them ( inspire students to pursue careers in these fields).  It offers transparency in mission progress and outcomes. It allows the public to witness both successes and challenges, which can build trust in space agencies and their work. \n\nhttps://preview.redd.it/zawdlke3hnlb1.png?width=826&format=png&auto=webp&s=3d4975f9cd4cf0b962f89b11d93eb78bce4be85c",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693576896.0,
    "convurl": "https://b.thumbs.redditmedia.com/CSX8tMwnK3OC2V3asIqungBN28Rbol7PapjWqJTnUYc.jpg",
    "comments": [
        "Just another Idiot with a Dumb Opinion.",
        "Me or the guy who wrote the article? :')",
        "Nit picking and finding fault in everything.",
        "The guy who wrote the article. OP hahaha Sorry if you miss read that XD",
        "Oh XD   \nIt's alright!",
        "Yes",
        "You remember those aunties in the neighbourhood that had a problem with every little thing?\n\nThe writer of the article is that aunty"
    ],
    "cleaned_text": "opinions believe missions need mainstream people knowledge inspire students pursue careers fields offers transparency mission progress outcomes allows public witness successes challenges build trust space agencies work ",
    "cleaned_title": "opinions",
    "cleaned_selftext": "believe missions need mainstream people knowledge inspire students pursue careers fields offers transparency mission progress outcomes allows public witness successes challenges build trust space agencies work",
    "cleaned_comments": "another idiot dumb opinion guy wrote article nit picking finding fault everything guy wrote article op hahaha sorry miss read xd oh xd alright yes remember aunties neighbourhood problem every little thing writer article aunty",
    "light_cleaned_title": "What are your opinions?",
    "light_cleaned_selftext": "I believe such missions need to be in the mainstream then only people will have more knowledge about them ( inspire students to pursue careers in these fields). It offers transparency in mission progress and outcomes. It allows the public to witness both successes and challenges, which can build trust in space agencies and their work.",
    "light_cleaned_comments": "Just another Idiot with a Dumb Opinion. Me or the guy who wrote the article? :') Nit picking and finding fault in everything. The guy who wrote the article. OP hahaha Sorry if you miss read that XD Oh XD It's alright! Yes You remember those aunties in the neighbourhood that had a problem with every little thing? The writer of the article is that aunty"
}