{
    "id": "1he5z13",
    "title": "Seeing the rare STOP sign on the road took me by surprise...",
    "url": "https://i.redd.it/9yed8ggp7u6e1.jpeg",
    "selftext": "...but I facepalmed hard when I realized that it was actually being used to mark the location of bus stops! \n\nNow, on top of the already stressful experience of driving on Indian roads, we also have to put extra effort in figuring out whether the road signs actually mean what they're supposed to! \n\n(Location: Coimbatore)",
    "flair": "Rant / Vent",
    "score": 425,
    "num_comments": 30,
    "created_utc": 1734192178.0,
    "convurl": "https://i.redd.it/9yed8ggp7u6e1.jpeg",
    "comments": [
        "Totally useless. Not like any one in the country actually knows how these work",
        "Apparently, neither does the government.",
        "being honest I actually don't, could you tell what purpose does it serve?",
        "You stop at the sign and proceed when safe",
        "You need to stop once and then move again. Not a signal. Just make your vehicle momentarily stand still and then go again.",
        "Prob a bus stop🤨",
        "It's a stop sign put up by the bakery in the pic, to attract customers passing by 😂",
        "This. And when there’s a bunch of traffic, you simply take turns using the intersection. Think of it as a traffic light that either prioritizes one direction(in case of a stop in one direction) or a one car a time traffic light in case of a stop in both directions",
        "Speedometer should come to 0 , proceed if safe .",
        "I've seen this real rural Haryana rural roads-NH intersection surprisingly.",
        "It's like a speed breaker and a red to yellow signal in one. When you see a stop sign in countries that follow this, you come to a full stop, check the other roads in the junction for any vehicles or pedestrians and let them pass before you move on. \n\nObviously this will never work in India.",
        "\"Issued in public interest by your favorite liquor shop.\"\n\n(The shop next to the cake shop is, in fact, a liquor shop.)",
        "If for some reason my post's description isn't visible, that's exactly what it's being used for.",
        "Coimbatore has horrible signals. One side of the city has signals (Prozone mall side)\n\nOther side of the city has only U Turns (Avinashi road , Ukkadam side, Singanallur etc)\nOnly recently have they come up with the tandem signals.",
        "Why tho what’s the use of that, please explain it to me like I’m 5",
        "Basically these are put on intersections with no signals. So this is to safeguard the pedestrians or other vehicles before crossing. Like if there is no signal you would normally ride through it at full speed like many do so these are put as a deterrent for you to stop to make the place a bit safer. Ideally. In a country that follow traffic rules.",
        "Oh ok thanks!",
        "One day when I got back from US I noticed that we actually have turn only lanes, no pass zones, yield signs etc... on our roads. Just never really noticed them earlier because no one else does.",
        "Decorative piece",
        "They are placed at junctions without signals.\n\nSee there is this T junction. Where two roads meet each other. The stop sign will be located at the junction facing towards vertical limb of T. It means you should stop at the intersection (yes like you do at red light) n check for vehicles in horizontal limb. If any vehicles are in horizontal limb of T, they automatically get right of way. They needn’t slow down for you. You should wait n only turn when there are no vehicles in the eyesight (or when you are sure that the vehicle you see needn’t apply brakes because of you turning. This is for bit experienced drivers). The actual idea is that T junctions usually connect smaller roads to bigger ones (crossroads to main roads). So smaller road traffic will usually have the stop sign facing them n they should stop. Main road traffic has right of way.\n\nAlternatively, sometimes 4 road junctions may have this sign. Then vehicles coming in all 4 roads will stop at junction. The vehicle which was first to reach will then take off again. Same way 2, 3, 4 positions should take off in that order in which they reached.\n\nIts kinda taken seriously by americans. If we follow it, we’ll ridk getting hit by vehicle behind. But if u see a stop sign, just slow down like u would in a turning n watch for incoming vehicles.",
        "There will be plenty if u are tavelling on outskirts or near highways actually. Atleast in andhra.",
        "Indian road design and signage are both abysmal. Even with the newer roads / expressways, I see such dumb signage and terrible road exit / entry planning. It’s so frustrating.",
        "It is to STOP people from lifting their lungi.",
        "People read them Backwards for Potholes",
        "Sign for porsche drivers?",
        "People of India, it is a cake stop!!!!",
        "STOP producing babies",
        "Well, did you collaborate and listen?",
        "Stop for snacks?",
        "Stop and count two missisipis before driving again.",
        "Is there even an intersection where this sign is put up? Can't see the other side of the street in the pic.",
        "There is no intersection at all. The sign is being used for the wrong purpose - to mark the location of a bus stop.",
        "😵"
    ],
    "cleaned_text": "seeing rare stop sign road took surprise facepalmed hard realized actually used mark location bus stops top already stressful experience driving indian roads also put extra effort figuring whether road signs actually mean theyre supposed location coimbatore ",
    "cleaned_title": "seeing rare stop sign road took surprise",
    "cleaned_selftext": "facepalmed hard realized actually used mark location bus stops top already stressful experience driving indian roads also put extra effort figuring whether road signs actually mean theyre supposed location coimbatore",
    "cleaned_comments": "totally useless like one country actually knows work apparently neither government honest actually dont could tell purpose serve stop sign proceed safe need stop move signal make vehicle momentarily stand still go prob bus stop stop sign put bakery pic attract customers passing theres bunch traffic simply take turns using intersection think traffic light either prioritizes one directionin case stop one direction one car time traffic light case stop directions speedometer come proceed safe ive seen real rural haryana rural roadsnh intersection surprisingly like speed breaker red yellow signal one see stop sign countries follow come full stop check roads junction vehicles pedestrians let pass move obviously never work india issued public interest favorite liquor shop shop next cake shop fact liquor shop reason posts description isnt visible thats exactly used coimbatore horrible signals one side city signals prozone mall side side city u turns avinashi road ukkadam side singanallur etc recently come tandem signals tho whats use please explain like im basically put intersections signals safeguard pedestrians vehicles crossing like signal would normally ride full speed like many put deterrent stop make place bit safer ideally country follow traffic rules oh ok thanks one day got back us noticed actually turn lanes pass zones yield signs etc roads never really noticed earlier one else decorative piece placed junctions without signals see junction two roads meet stop sign located junction facing towards vertical limb means stop intersection yes like red light n check vehicles horizontal limb vehicles horizontal limb automatically get right way neednt slow wait n turn vehicles eyesight sure vehicle see neednt apply brakes turning bit experienced drivers actual idea junctions usually connect smaller roads bigger ones crossroads main roads smaller road traffic usually stop sign facing n stop main road traffic right way alternatively sometimes road junctions may sign vehicles coming roads stop junction vehicle first reach take way positions take order reached kinda taken seriously americans follow well ridk getting hit vehicle behind u see stop sign slow like u would turning n watch incoming vehicles plenty u tavelling outskirts near highways actually atleast andhra indian road design signage abysmal even newer roads expressways see dumb signage terrible road exit entry planning frustrating stop people lifting lungi people read backwards potholes sign porsche drivers people india cake stop stop producing babies well collaborate listen stop snacks stop count two missisipis driving even intersection sign put cant see side street pic intersection sign used wrong purpose mark location bus stop",
    "light_cleaned_title": "Seeing the rare STOP sign on the road took me by surprise...",
    "light_cleaned_selftext": "...but I facepalmed hard when I realized that it was actually being used to mark the location of bus stops! Now, on top of the already stressful experience of driving on Indian roads, we also have to put extra effort in figuring out whether the road signs actually mean what they're supposed to! (Location: Coimbatore)",
    "light_cleaned_comments": "Totally useless. Not like any one in the country actually knows how these work Apparently, neither does the government. being honest I actually don't, could you tell what purpose does it serve? You stop at the sign and proceed when safe You need to stop once and then move again. Not a signal. Just make your vehicle momentarily stand still and then go again. Prob a bus stop🤨 It's a stop sign put up by the bakery in the pic, to attract customers passing by 😂 This. And when there’s a bunch of traffic, you simply take turns using the intersection. Think of it as a traffic light that either prioritizes one direction(in case of a stop in one direction) or a one car a time traffic light in case of a stop in both directions Speedometer should come to 0 , proceed if safe . I've seen this real rural Haryana rural roads-NH intersection surprisingly. It's like a speed breaker and a red to yellow signal in one. When you see a stop sign in countries that follow this, you come to a full stop, check the other roads in the junction for any vehicles or pedestrians and let them pass before you move on. Obviously this will never work in India. \"Issued in public interest by your favorite liquor shop.\" (The shop next to the cake shop is, in fact, a liquor shop.) If for some reason my post's description isn't visible, that's exactly what it's being used for. Coimbatore has horrible signals. One side of the city has signals (Prozone mall side) Other side of the city has only U Turns (Avinashi road , Ukkadam side, Singanallur etc) Only recently have they come up with the tandem signals. Why tho what’s the use of that, please explain it to me like I’m 5 Basically these are put on intersections with no signals. So this is to safeguard the pedestrians or other vehicles before crossing. Like if there is no signal you would normally ride through it at full speed like many do so these are put as a deterrent for you to stop to make the place a bit safer. Ideally. In a country that follow traffic rules. Oh ok thanks! One day when I got back from US I noticed that we actually have turn only lanes, no pass zones, yield signs etc... on our roads. Just never really noticed them earlier because no one else does. Decorative piece They are placed at junctions without signals. See there is this T junction. Where two roads meet each other. The stop sign will be located at the junction facing towards vertical limb of T. It means you should stop at the intersection (yes like you do at red light) n check for vehicles in horizontal limb. If any vehicles are in horizontal limb of T, they automatically get right of way. They needn’t slow down for you. You should wait n only turn when there are no vehicles in the eyesight (or when you are sure that the vehicle you see needn’t apply brakes because of you turning. This is for bit experienced drivers). The actual idea is that T junctions usually connect smaller roads to bigger ones (crossroads to main roads). So smaller road traffic will usually have the stop sign facing them n they should stop. Main road traffic has right of way. Alternatively, sometimes 4 road junctions may have this sign. Then vehicles coming in all 4 roads will stop at junction. The vehicle which was first to reach will then take off again. Same way 2, 3, 4 positions should take off in that order in which they reached. Its kinda taken seriously by americans. If we follow it, we’ll ridk getting hit by vehicle behind. But if u see a stop sign, just slow down like u would in a turning n watch for incoming vehicles. There will be plenty if u are tavelling on outskirts or near highways actually. Atleast in andhra. Indian road design and signage are both abysmal. Even with the newer roads / expressways, I see such dumb signage and terrible road exit / entry planning. It’s so frustrating. It is to STOP people from lifting their lungi. People read them Backwards for Potholes Sign for porsche drivers? People of India, it is a cake stop!!!! STOP producing babies Well, did you collaborate and listen? Stop for snacks? Stop and count two missisipis before driving again. Is there even an intersection where this sign is put up? Can't see the other side of the street in the pic. There is no intersection at all. The sign is being used for the wrong purpose - to mark the location of a bus stop. 😵"
}