{
    "id": "137torf",
    "title": "Help us in saving the future of countless students who fell victim to the faulty system of NTA",
    "url": "https://www.reddit.com/r/india/comments/137torf/help_us_in_saving_the_future_of_countless/",
    "selftext": "I am a JEE aspirant studying in class 12 and one of my seniors in my coaching centre had her paper exchanged with someone else's in the recently concluded second attempt of JEE Mains. Her exam went fantastic and she would've easily been inside the top 1000 rank, but her response sheet provided to her was found to be completely different and now there's even a doubt if she would qualify for Advanced or not. She worked hard like anything these few years and her future is now at danger, she doesn't deserve anything like this at all. She doesn't have any evidence to show to NTA. I don't want something like this happening to me next year and losing brilliant students like her will only hinder the growth of our country. My coaching centre has started a petition [https://chng.it/9c7Fx7pW](https://chng.it/9c7Fx7pW) to bring this to NTA's attention. We want NTA to be more transparent in their Examination System so that students like her can fight against the injustice brought upon them. Please please please help us by signing this petition and spreading it because I am scared for my own future as well as my friends'.",
    "flair": "Policy/Economy",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1683220610.0,
    "convurl": "https://external-preview.redd.it/IsGNRuWdrEEOQ3gDs8QGG6tb3gDanfn2zwcpKn9Ftlw.jpg?auto=webp&v=enabled&s=9c1a609ba6ffbf649ebb4452f032b1e5476009aa",
    "comments": [],
    "cleaned_text": "help us saving future countless students fell victim faulty system nta jee aspirant studying class one seniors coaching centre paper exchanged someone elses recently concluded second attempt jee mains exam went fantastic wouldve easily inside top rank response sheet provided found completely different theres even doubt would qualify advanced worked hard like anything years future danger doesnt deserve anything like doesnt evidence show nta dont want something like happening next year losing brilliant students like hinder growth country coaching centre started petition httpschngitcfxpwhttpschngitcfxpw bring ntas attention want nta transparent examination system students like fight injustice brought upon please please please help us signing petition spreading scared future well friends ",
    "cleaned_title": "help us saving future countless students fell victim faulty system nta",
    "cleaned_selftext": "jee aspirant studying class one seniors coaching centre paper exchanged someone elses recently concluded second attempt jee mains exam went fantastic wouldve easily inside top rank response sheet provided found completely different theres even doubt would qualify advanced worked hard like anything years future danger doesnt deserve anything like doesnt evidence show nta dont want something like happening next year losing brilliant students like hinder growth country coaching centre started petition httpschngitcfxpwhttpschngitcfxpw bring ntas attention want nta transparent examination system students like fight injustice brought upon please please please help us signing petition spreading scared future well friends",
    "cleaned_comments": "",
    "light_cleaned_title": "Help us in saving the future of countless students who fell victim to the faulty system of NTA",
    "light_cleaned_selftext": "I am a JEE aspirant studying in class 12 and one of my seniors in my coaching centre had her paper exchanged with someone else's in the recently concluded second attempt of JEE Mains. Her exam went fantastic and she would've easily been inside the top 1000 rank, but her response sheet provided to her was found to be completely different and now there's even a doubt if she would qualify for Advanced or not. She worked hard like anything these few years and her future is now at danger, she doesn't deserve anything like this at all. She doesn't have any evidence to show to NTA. I don't want something like this happening to me next year and losing brilliant students like her will only hinder the growth of our country. My coaching centre has started a petition [https://chng.it/9c7Fx7pW](https://chng.it/9c7Fx7pW) to bring this to NTA's attention. We want NTA to be more transparent in their Examination System so that students like her can fight against the injustice brought upon them. Please please please help us by signing this petition and spreading it because I am scared for my own future as well as my friends'.",
    "light_cleaned_comments": ""
}