{
    "id": "1793hgy",
    "title": "Legal Metrology (packaged commodities) rules",
    "url": "https://www.reddit.com/r/india/comments/1793hgy/legal_metrology_packaged_commodities_rules/",
    "selftext": "Hi, I want to know how the The Legal Metrology (Packaged Commodities) Rules works in India. I specifically want to know about the weights to be packed by manufactures, not any other stuff like QR codes and all. Does this prevent companies in India from downsizing products marginally? \n\nHere (https://nkgabc.com/recommended-mandatory-standard-packages-quantity-of-packaged-commodities/) it says that biscuits should be packed in 25g, 50g, 60g and so on. So for example does this mean that a firm cannot reduce its biscuit weights from 50g to 48g and if they want to downsize a product they have to reduce to weight all the way to the lower bracket (25g in this case)?   \n\nI also want to know whether this rule is still in play. Because here (https://ksandk.com/legal-metrology/packaged-commodities-rules-2022/) it says that “Rule 5 recommended packing and selling specific commodities in recommended standard packages has been omitted”.  \n\nAny links to official documents and any personal views on this would also be helpful.\n\nThanks!!",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697454567.0,
    "convurl": "https://external-preview.redd.it/bX9TxmsatT1cWy9ejCMWGx4UyzMR5igZO5nXtB5IVn8.jpg?auto=webp&s=50a83e7520502b18a17b0d42dd52bc9d933c5d27",
    "comments": [],
    "cleaned_text": "legal metrology packaged commodities rules hi want know legal metrology packaged commodities rules works india specifically want know weights packed manufactures stuff like qr codes prevent companies india downsizing products marginally httpsnkgabccomrecommendedmandatorystandardpackagesquantityofpackagedcommodities says biscuits packed g g g example mean firm reduce biscuit weights g g want downsize product reduce weight way lower bracket g case also want know whether rule still play httpsksandkcomlegalmetrologypackagedcommoditiesrules says rule recommended packing selling specific commodities recommended standard packages omitted links official documents personal views would also helpful thanks ",
    "cleaned_title": "legal metrology packaged commodities rules",
    "cleaned_selftext": "hi want know legal metrology packaged commodities rules works india specifically want know weights packed manufactures stuff like qr codes prevent companies india downsizing products marginally httpsnkgabccomrecommendedmandatorystandardpackagesquantityofpackagedcommodities says biscuits packed g g g example mean firm reduce biscuit weights g g want downsize product reduce weight way lower bracket g case also want know whether rule still play httpsksandkcomlegalmetrologypackagedcommoditiesrules says rule recommended packing selling specific commodities recommended standard packages omitted links official documents personal views would also helpful thanks",
    "cleaned_comments": "",
    "light_cleaned_title": "Legal Metrology (packaged commodities) rules",
    "light_cleaned_selftext": "Hi, I want to know how the The Legal Metrology (Packaged Commodities) Rules works in India. I specifically want to know about the weights to be packed by manufactures, not any other stuff like QR codes and all. Does this prevent companies in India from downsizing products marginally? Here (https://nkgabc.com/recommended-mandatory-standard-packages-quantity-of-packaged-commodities/) it says that biscuits should be packed in 25g, 50g, 60g and so on. So for example does this mean that a firm cannot reduce its biscuit weights from 50g to 48g and if they want to downsize a product they have to reduce to weight all the way to the lower bracket (25g in this case)? I also want to know whether this rule is still in play. Because here (https://ksandk.com/legal-metrology/packaged-commodities-rules-2022/) it says that “Rule 5 recommended packing and selling specific commodities in recommended standard packages has been omitted”. Any links to official documents and any personal views on this would also be helpful. Thanks!!",
    "light_cleaned_comments": ""
}