{
    "id": "16k1md8",
    "title": "China built most of its rail network in 12 years. Starting from 2031, our plan is to have a full high-speed corridor by 2051. Do you think we can get it done?",
    "url": "https://www.reddit.com/r/india/comments/16k1md8/china_built_most_of_its_rail_network_in_12_years/",
    "selftext": "&#x200B;\n\n*Processing img swlkpm21okob1...*\n\n&#x200B;\n\nSaw this post on r/BeAmazed, and it got me thinking about our own high speed rail network.\n\nThe Ahmedabad - Mumbai route has already faced a ton of challenges, and has presented a massive enginering challenge: having the largest underground rail tunnel in the country. From the Bandra-Kurla Complex the rail will traverse 21 km underground before emerging above ground at Thane, and proceeding towards Ahemdabad on land. [This is a super informative video](https://www.youtube.com/watch?v=eeDTn_ObLP8&pp=ygUKYjFtIG11bWJhaQ%3D%3D) on the topic.\n\n&#x200B;\n\n[Undersea section of the Mumbai - Ahmedabad highspeed rail](https://preview.redd.it/a5kyoyytokob1.png?width=2352&format=png&auto=webp&s=0c4de2827956bc8ed45fb6cff662559deb683ab3)\n\nThe construction of this route has already faced a ton of challenges due to the shifting political tides in MH, and this correlation between infrastructural progress can surely be expected to happen in the other 3 zones of the high-speed rail corridor too.\n\nTo put it simply, I think the challenges of the Mumbai - Ahmedabad rail is a good representation of how the whole project could unravel - both geographical and political factors will invariably be present in other regions of the rail. \n\nSo, do you guys think we can actually expect our governments to take their lessons from this project and actually deliver the project withing projected timelines? What would be some other factors you'd consider in answering this question?",
    "flair": "Policy/Economy",
    "score": 20,
    "num_comments": 14,
    "created_utc": 1694850898,
    "convurl": "https://external-preview.redd.it/MYlwpHtj9rDlZpcbZIwawGh4ZM3YWmxgJT_vH55W-9k.jpg?auto=webp&s=ce44508287e6b5619e75e3b086094cd2d1195843",
    "comments": [
        "Ofc it's possible.\n\nThe money is there. The land is there. The know how is there. The workforce is there.\n\nThe biggest problem (as always) is politics. It's only possible when u have a govt. That knows how to get things done and isn't prone to policy paralysis :)",
        "Can we get it done? Yes. Will we get it done? I doubt it. There are too many variables in India. Variables that the government in China can just demolish through. I hope and pray it happens, but i simply don't see it. \n\nP.S.: I'd be 60 in 2051. Damn, there's a thought.",
        "And corruption!  Don't leave out this component of the equation by both state & center!",
        "We took time in building the first metro in Delhi and now we are building it in every part of country. It's similar with high speed train once we get technology and experience it will also be done on massive scale.\n\nBut we have one issue that is land acquisition. That's why current project got delayed in Maharashtra compare to Gujarat.",
        "That's not the biggest problem. Land acquisition and Cost are the biggest problem.\n\nThis 2031-51 thing requires context, if it's just creating the Quadrilateral connectivity (which would be like half dozen lines at most) then that is possible.\n\nBut if it means being bear China's level of HSR track length and efficiency, NO freaking way in hell is that possible in that listed timeframe.\n\nIndia simply would not be able to buy enough land back, esp in North where population density and spread is higher, which then leads to higher cost of the Project that then leads to higher recovery charges (ticket pricing, loan payments, etc).\n\nAnd making Mega projects Yesterday is the cheapest, next best time is today and worst time is tomorrow. This saying works not just for Tree's but for major Public Goods projects because the principle is basically same (Tree's TOO are long-term multi-generational mass Public Goods).\n\nIndia is going to spend more than it would have had it started when all this started (late 2000s and esp 2010 when feasibility studies for 6 corridors were given the go ahead). India dilly-dalied with China-Japan-European tech stack issues and then MAHSR became like what happens usually in Indian politics, a middle ground compromise that is neither here not there and basically solves nothing on a Mass scale.\n\nMAHSR will be massively and ridiculously successful when it eventually gets going. NO HSR anywhere in the world (esp where population density is near that of India) has failed, not only that no one in that range is even average, all are good to very good success stories. \n\nIndians will mock themselves and those in our generation for not having spend on this earlier.\n\nAnd this 12 year thing about China HSR isn't even the whole thing. It actually took them 7 or so years to go from 0 HSR to Largest HSR network on this planet. And now they are reaping Agglomerration and Network-effect benifits that are down right silly and incalculable even.",
        "Taking/finding land is the major roadblock in such massive projects.\n\nEach person has to approve, if land is owned by some government authority, there are long processes. If one person decide to not give land, there are cases for roadways construction where route has to be changed.\n\nFor China it may be easy, I don't know, but from it's image I think they won't ask/request people to give land, they will directly take it and give or pay that person according to their rules.",
        ">That's not the biggest problem. Land acquisition and Cost are the biggest problem.\n\nEvery single problem that you listed above ultimately comes down to politics.\n\nIf land acquisition is a problem, then pass laws in the parliament for the force sale of land. If the people don't like it, screw them.",
        "Absolutely",
        "Fundamentally yes but practically a distinction is helpful in this context due to System Structures & Ease-Order of different problems/solutions. \n\nIndia's System is setup in such a way that passing those Laws is itself a grand hassle that is non-trivial. Sure this exists in Political Domain however the base layer reality is this and it's a Harder Problem to solve than problems that exist on top of this (Land Acquisition, Costs, Political quid pro quo deals, etc).\n\nBut yes, Fundamentally India is the way it is because of its System (Politics being a function of that base structure).",
        "define full HS corridor",
        ">  If the people don't like it, screw them.\n\nthat...is not how India operates, China, yes.",
        "> If the people don't like it, screw them.\n\nthat guy who says this seem to forget about the farmers standoff. and GoI got eggs (& other) on the face.",
        "so....only 8 years more, to an equivalent result ? this is true definition of beyond-fuck clinical delusion.",
        "If costly Infrastructure are Public Goods then yes, the cost is justified.\n\nModern Economics has been hijacked by flawed formulas that doesn't take into accounts Time Variable and it's spillover effects of mass Public Goods investment."
    ],
    "cleaned_text": "china built rail network years starting plan full highspeed corridor think get done xb processing img swlkpmokob xb saw post rbeamazed got thinking high speed rail network ahmedabad mumbai route already faced ton challenges presented massive enginering challenge largest underground rail tunnel country bandrakurla complex rail traverse km underground emerging ground thane proceeding towards ahemdabad land super informative videohttpswwwyoutubecomwatchveedtnoblpppygukyjftigbwjhaqdd topic xb undersea section mumbai ahmedabad highspeed railhttpspreviewredditakyoyytokobpngwidthformatpngautowebpscdebcedfbcffdebab construction route already faced ton challenges due shifting political tides mh correlation infrastructural progress surely expected happen zones highspeed rail corridor put simply think challenges mumbai ahmedabad rail good representation whole project could unravel geographical political factors invariably present regions rail guys think actually expect governments take lessons project actually deliver project withing projected timelines would factors youd consider answering question ",
    "cleaned_title": "china built rail network years starting plan full highspeed corridor think get done",
    "cleaned_selftext": "xb processing img swlkpmokob xb saw post rbeamazed got thinking high speed rail network ahmedabad mumbai route already faced ton challenges presented massive enginering challenge largest underground rail tunnel country bandrakurla complex rail traverse km underground emerging ground thane proceeding towards ahemdabad land super informative videohttpswwwyoutubecomwatchveedtnoblpppygukyjftigbwjhaqdd topic xb undersea section mumbai ahmedabad highspeed railhttpspreviewredditakyoyytokobpngwidthformatpngautowebpscdebcedfbcffdebab construction route already faced ton challenges due shifting political tides mh correlation infrastructural progress surely expected happen zones highspeed rail corridor put simply think challenges mumbai ahmedabad rail good representation whole project could unravel geographical political factors invariably present regions rail guys think actually expect governments take lessons project actually deliver project withing projected timelines would factors youd consider answering question",
    "cleaned_comments": "ofc possible money land know workforce biggest problem always politics possible u govt knows get things done isnt prone policy paralysis get done yes get done doubt many variables india variables government china demolish hope pray happens simply dont see ps id damn theres thought corruption dont leave component equation state center took time building first metro delhi building every part country similar high speed train get technology experience also done massive scale one issue land acquisition thats current project got delayed maharashtra compare gujarat thats biggest problem land acquisition cost biggest problem thing requires context creating quadrilateral connectivity would like half dozen lines possible means bear chinas level hsr track length efficiency freaking way hell possible listed timeframe india simply would able buy enough land back esp north population density spread higher leads higher cost project leads higher recovery charges ticket pricing loan payments etc making mega projects yesterday cheapest next best time today worst time tomorrow saying works trees major public goods projects principle basically trees longterm multigenerational mass public goods india going spend would started started late esp feasibility studies corridors given go ahead india dillydalied chinajapaneuropean tech stack issues mahsr became like happens usually indian politics middle ground compromise neither basically solves nothing mass scale mahsr massively ridiculously successful eventually gets going hsr anywhere world esp population density near india failed one range even average good good success stories indians mock generation spend earlier year thing china hsr isnt even whole thing actually took years go hsr largest hsr network planet reaping agglomerration networkeffect benifits right silly incalculable even takingfinding land major roadblock massive projects person approve land owned government authority long processes one person decide give land cases roadways construction route changed china may easy dont know image think wont askrequest people give land directly take give pay person according rules thats biggest problem land acquisition cost biggest problem every single problem listed ultimately comes politics land acquisition problem pass laws parliament force sale land people dont like screw absolutely fundamentally yes practically distinction helpful context due system structures easeorder different problemssolutions indias system setup way passing laws grand hassle nontrivial sure exists political domain however base layer reality harder problem solve problems exist top land acquisition costs political quid pro quo deals etc yes fundamentally india way system politics function base structure define full hs corridor people dont like screw thatis india operates china yes people dont like screw guy says seem forget farmers standoff goi got eggs face soonly years equivalent result true definition beyondfuck clinical delusion costly infrastructure public goods yes cost justified modern economics hijacked flawed formulas doesnt take accounts time variable spillover effects mass public goods investment",
    "light_cleaned_title": "China built most of its rail network in 12 years. Starting from 2031, our plan is to have a full high-speed corridor by 2051. Do you think we can get it done?",
    "light_cleaned_selftext": "&#x200B; *Processing img swlkpm21okob1...* &#x200B; Saw this post on r/BeAmazed, and it got me thinking about our own high speed rail network. The Ahmedabad - Mumbai route has already faced a ton of challenges, and has presented a massive enginering challenge: having the largest underground rail tunnel in the country. From the Bandra-Kurla Complex the rail will traverse 21 km underground before emerging above ground at Thane, and proceeding towards Ahemdabad on land. [This is a super informative video](https://www.youtube.com/watch?v=eeDTn_ObLP8&pp=ygUKYjFtIG11bWJhaQ%3D%3D) on the topic. &#x200B; [Undersea section of the Mumbai - Ahmedabad highspeed rail](https://preview.redd.it/a5kyoyytokob1.png?width=2352&format=png&auto=webp&s=0c4de2827956bc8ed45fb6cff662559deb683ab3) The construction of this route has already faced a ton of challenges due to the shifting political tides in MH, and this correlation between infrastructural progress can surely be expected to happen in the other 3 zones of the high-speed rail corridor too. To put it simply, I think the challenges of the Mumbai - Ahmedabad rail is a good representation of how the whole project could unravel - both geographical and political factors will invariably be present in other regions of the rail. So, do you guys think we can actually expect our governments to take their lessons from this project and actually deliver the project withing projected timelines? What would be some other factors you'd consider in answering this question?",
    "light_cleaned_comments": "Ofc it's possible. The money is there. The land is there. The know how is there. The workforce is there. The biggest problem (as always) is politics. It's only possible when u have a govt. That knows how to get things done and isn't prone to policy paralysis :) Can we get it done? Yes. Will we get it done? I doubt it. There are too many variables in India. Variables that the government in China can just demolish through. I hope and pray it happens, but i simply don't see it. P.S.: I'd be 60 in 2051. Damn, there's a thought. And corruption! Don't leave out this component of the equation by both state & center! We took time in building the first metro in Delhi and now we are building it in every part of country. It's similar with high speed train once we get technology and experience it will also be done on massive scale. But we have one issue that is land acquisition. That's why current project got delayed in Maharashtra compare to Gujarat. That's not the biggest problem. Land acquisition and Cost are the biggest problem. This 2031-51 thing requires context, if it's just creating the Quadrilateral connectivity (which would be like half dozen lines at most) then that is possible. But if it means being bear China's level of HSR track length and efficiency, NO freaking way in hell is that possible in that listed timeframe. India simply would not be able to buy enough land back, esp in North where population density and spread is higher, which then leads to higher cost of the Project that then leads to higher recovery charges (ticket pricing, loan payments, etc). And making Mega projects Yesterday is the cheapest, next best time is today and worst time is tomorrow. This saying works not just for Tree's but for major Public Goods projects because the principle is basically same (Tree's TOO are long-term multi-generational mass Public Goods). India is going to spend more than it would have had it started when all this started (late 2000s and esp 2010 when feasibility studies for 6 corridors were given the go ahead). India dilly-dalied with China-Japan-European tech stack issues and then MAHSR became like what happens usually in Indian politics, a middle ground compromise that is neither here not there and basically solves nothing on a Mass scale. MAHSR will be massively and ridiculously successful when it eventually gets going. NO HSR anywhere in the world (esp where population density is near that of India) has failed, not only that no one in that range is even average, all are good to very good success stories. Indians will mock themselves and those in our generation for not having spend on this earlier. And this 12 year thing about China HSR isn't even the whole thing. It actually took them 7 or so years to go from 0 HSR to Largest HSR network on this planet. And now they are reaping Agglomerration and Network-effect benifits that are down right silly and incalculable even. Taking/finding land is the major roadblock in such massive projects. Each person has to approve, if land is owned by some government authority, there are long processes. If one person decide to not give land, there are cases for roadways construction where route has to be changed. For China it may be easy, I don't know, but from it's image I think they won't ask/request people to give land, they will directly take it and give or pay that person according to their rules. >That's not the biggest problem. Land acquisition and Cost are the biggest problem. Every single problem that you listed above ultimately comes down to politics. If land acquisition is a problem, then pass laws in the parliament for the force sale of land. If the people don't like it, screw them. Absolutely Fundamentally yes but practically a distinction is helpful in this context due to System Structures & Ease-Order of different problems/solutions. India's System is setup in such a way that passing those Laws is itself a grand hassle that is non-trivial. Sure this exists in Political Domain however the base layer reality is this and it's a Harder Problem to solve than problems that exist on top of this (Land Acquisition, Costs, Political quid pro quo deals, etc). But yes, Fundamentally India is the way it is because of its System (Politics being a function of that base structure). define full HS corridor > If the people don't like it, screw them. that...is not how India operates, China, yes. > If the people don't like it, screw them. that guy who says this seem to forget about the farmers standoff. and GoI got eggs (& other) on the face. so....only 8 years more, to an equivalent result ? this is true definition of beyond-fuck clinical delusion. If costly Infrastructure are Public Goods then yes, the cost is justified. Modern Economics has been hijacked by flawed formulas that doesn't take into accounts Time Variable and it's spillover effects of mass Public Goods investment."
}