{
    "id": "14ffi4a",
    "title": "What do we do when no one will help the girls? (murder in Shiv Nadar University)",
    "url": "https://www.reddit.com/r/india/comments/14ffi4a/what_do_we_do_when_no_one_will_help_the_girls/",
    "selftext": "A little over a month ago, there was a gruesome murder-suicide at Shiv Nadar University, a reputed research focused institution. In the days that followed, it became clear that in addition to \"men cannot take no for an answer\", there was also an alarming degree of negligence displayed by the University authorities. The man, Anuj, had been routinely beating the girl up on campus and despite emails detailing the graphic abuse sent directly to the highest levels of administration, clearly nothing substantial came of it.  \n\n\nI would urge you all to follow the link and read up on the case. Refrain from asking uninformed \"why didn't she leave\" questions, because, she did leave - and was gunned down in broad daylight in full public view for it by a man who further lied through his teeth in a confession video so that even post-death, everyone will malign the victim's character.  \n\n\nLink to a recent article - [https://www.outlookindia.com/national/death-of-girl-in-shiv-nadar-reflects-apathy-to-address-gender-based-violence-magazine-296295](https://www.outlookindia.com/national/death-of-girl-in-shiv-nadar-reflects-apathy-to-address-gender-based-violence-magazine-296295)\n\n&#x200B;",
    "flair": "Crime",
    "score": 179,
    "num_comments": 33,
    "created_utc": 1687372253.0,
    "convurl": "https://external-preview.redd.it/5s2KojojDmbSrvzAjOjv2-fuhNAWiIJCrQVHdZ9OqCQ.jpg?auto=webp&v=enabled&s=c4de203acd746a87e8ddb7e3f30885f1e05b32b7",
    "comments": [
        "This YouTube short has a sort of sensationalist air to it, but it does give a brief overview of the happenings - https://youtube.com/shorts/Qd0C7LtnD7o?feature=share",
        "In this country. crime only matters if a muslim is the accused.",
        "And cow is the victim.",
        "Went to SNU's counseling and didn't join ONLY because they themselves said how unsafe Noida is for women and that we'd have to be extra careful.",
        "What even? Bro get some sense",
        "The picture breaks my heart. It must be unbearable pain to lose a daughter like that. 😔",
        "They won’t sis",
        "Exactly... The current gov isn't really bothered if anything happens to girls. We are dangerously close to becoming a conservative society like we were in the past. Soon , females will be locked up in houses, not afforded education and only considered fit for kitchen and childbirth.",
        "Oh my! I can't stop wondering where are we heading as a nation, as a society, as humans.. Being a female, the concerns about my safety and of other females in my circle have only risen. We are moving ahead in time but regressing to being rotten. The fake pride many Indians hold should be shaken off somehow. So that we collectively can address problems and find solutions. But that seems like a far-fetched dream.",
        "See how Brij Bhushan is being treated VS how MJ Akbar was treated.",
        "Shouldnt the college management held for negligence? Is there any protest in college against the management?",
        "Same script playing here again , no action taken by authorities despite evidence. Life is cheap in India , especially when females are concerned.",
        "oh just shut up! I was shocked seeing this bs comment but then i saw on which sub it was rindia. understandable. EW!",
        "Funny how they claim to be aware of this but then they have a girl student sending emails that another guy is beating her up and threating to kill her and then all you hear are crickets.",
        "Not aware of the protest status, but I know for sure the University is going ahead with their annual Convocation ceremonies with the usual pomp and fervour as if nothing happened.\n\nThe article clearly states the girl had been sending them emails to save her from this animal.",
        "Unbearable even more to realise she was begging the University to save her life after each beat down by the guy (evidenced even in the article) and yet...",
        "Maybe the university students should peacefully boycott the ceremony? Will that work?",
        "I hope something like that is being planned, but the fact remains that there isn't much conversation about this tragedy born out of administrative ignorance at all.\n\nIf the media coverage was bigger, maybe there could be external calls for the students to boycott. Right now this has become yet another bereaved family Vs. multi-billion dollar University.",
        "Media coverage would have been bigger if 2 religions were involved otherwise they keep mum..",
        "Just like Taliban",
        "men are scary omfg",
        "op ye video dekha apna [https://youtu.be/qCz0bjIT0\\_4](https://youtu.be/qCz0bjIT0_4) ?"
    ],
    "cleaned_text": "one help girls murder shiv nadar university little month ago gruesome murdersuicide shiv nadar university reputed research focused institution days followed became clear addition men take answer also alarming degree negligence displayed university authorities man anuj routinely beating girl campus despite emails detailing graphic abuse sent directly highest levels administration clearly nothing substantial came would urge follow link read case refrain asking uninformed didnt leave questions leave gunned broad daylight full public view man lied teeth confession video even postdeath everyone malign victims character link recent article httpswwwoutlookindiacomnationaldeathofgirlinshivnadarreflectsapathytoaddressgenderbasedviolencemagazinehttpswwwoutlookindiacomnationaldeathofgirlinshivnadarreflectsapathytoaddressgenderbasedviolencemagazine xb ",
    "cleaned_title": "one help girls murder shiv nadar university",
    "cleaned_selftext": "little month ago gruesome murdersuicide shiv nadar university reputed research focused institution days followed became clear addition men take answer also alarming degree negligence displayed university authorities man anuj routinely beating girl campus despite emails detailing graphic abuse sent directly highest levels administration clearly nothing substantial came would urge follow link read case refrain asking uninformed didnt leave questions leave gunned broad daylight full public view man lied teeth confession video even postdeath everyone malign victims character link recent article httpswwwoutlookindiacomnationaldeathofgirlinshivnadarreflectsapathytoaddressgenderbasedviolencemagazinehttpswwwoutlookindiacomnationaldeathofgirlinshivnadarreflectsapathytoaddressgenderbasedviolencemagazine xb",
    "cleaned_comments": "youtube short sort sensationalist air give brief overview happenings country crime matters muslim accused cow victim went snus counseling didnt join said unsafe noida women wed extra careful even bro get sense picture breaks heart must unbearable pain lose daughter like wont sis exactly current gov isnt really bothered anything happens girls dangerously close becoming conservative society like past soon females locked houses afforded education considered fit kitchen childbirth oh cant stop wondering heading nation society humans female concerns safety females circle risen moving ahead time regressing rotten fake pride many indians hold shaken somehow collectively address problems find solutions seems like farfetched dream see brij bhushan treated vs mj akbar treated shouldnt college management held negligence protest college management script playing action taken authorities despite evidence life cheap india especially females concerned oh shut shocked seeing bs comment saw sub rindia understandable ew funny claim aware girl student sending emails another guy beating threating kill hear crickets aware protest status know sure university going ahead annual convocation ceremonies usual pomp fervour nothing happened article clearly states girl sending emails save animal unbearable even realise begging university save life beat guy evidenced even article yet maybe university students peacefully boycott ceremony work hope something like planned fact remains isnt much conversation tragedy born administrative ignorance media coverage bigger maybe could external calls students boycott right become yet another bereaved family vs multibillion dollar university media coverage would bigger religions involved otherwise keep mum like taliban men scary omfg op ye video dekha apna httpsyoutubeqczbjithttpsyoutubeqczbjit",
    "light_cleaned_title": "What do we do when no one will help the girls? (murder in Shiv Nadar University)",
    "light_cleaned_selftext": "A little over a month ago, there was a gruesome murder-suicide at Shiv Nadar University, a reputed research focused institution. In the days that followed, it became clear that in addition to \"men cannot take no for an answer\", there was also an alarming degree of negligence displayed by the University authorities. The man, Anuj, had been routinely beating the girl up on campus and despite emails detailing the graphic abuse sent directly to the highest levels of administration, clearly nothing substantial came of it. I would urge you all to follow the link and read up on the case. Refrain from asking uninformed \"why didn't she leave\" questions, because, she did leave - and was gunned down in broad daylight in full public view for it by a man who further lied through his teeth in a confession video so that even post-death, everyone will malign the victim's character. Link to a recent article - [https://www.outlookindia.com/national/death-of-girl-in-shiv-nadar-reflects-apathy-to-address-gender-based-violence-magazine-296295](https://www.outlookindia.com/national/death-of-girl-in-shiv-nadar-reflects-apathy-to-address-gender-based-violence-magazine-296295) &#x200B;",
    "light_cleaned_comments": "This YouTube short has a sort of sensationalist air to it, but it does give a brief overview of the happenings - In this country. crime only matters if a muslim is the accused. And cow is the victim. Went to SNU's counseling and didn't join ONLY because they themselves said how unsafe Noida is for women and that we'd have to be extra careful. What even? Bro get some sense The picture breaks my heart. It must be unbearable pain to lose a daughter like that. 😔 They won’t sis Exactly... The current gov isn't really bothered if anything happens to girls. We are dangerously close to becoming a conservative society like we were in the past. Soon , females will be locked up in houses, not afforded education and only considered fit for kitchen and childbirth. Oh my! I can't stop wondering where are we heading as a nation, as a society, as humans.. Being a female, the concerns about my safety and of other females in my circle have only risen. We are moving ahead in time but regressing to being rotten. The fake pride many Indians hold should be shaken off somehow. So that we collectively can address problems and find solutions. But that seems like a far-fetched dream. See how Brij Bhushan is being treated VS how MJ Akbar was treated. Shouldnt the college management held for negligence? Is there any protest in college against the management? Same script playing here again , no action taken by authorities despite evidence. Life is cheap in India , especially when females are concerned. oh just shut up! I was shocked seeing this bs comment but then i saw on which sub it was rindia. understandable. EW! Funny how they claim to be aware of this but then they have a girl student sending emails that another guy is beating her up and threating to kill her and then all you hear are crickets. Not aware of the protest status, but I know for sure the University is going ahead with their annual Convocation ceremonies with the usual pomp and fervour as if nothing happened. The article clearly states the girl had been sending them emails to save her from this animal. Unbearable even more to realise she was begging the University to save her life after each beat down by the guy (evidenced even in the article) and yet... Maybe the university students should peacefully boycott the ceremony? Will that work? I hope something like that is being planned, but the fact remains that there isn't much conversation about this tragedy born out of administrative ignorance at all. If the media coverage was bigger, maybe there could be external calls for the students to boycott. Right now this has become yet another bereaved family Vs. multi-billion dollar University. Media coverage would have been bigger if 2 religions were involved otherwise they keep mum.. Just like Taliban men are scary omfg op ye video dekha apna [https://youtu.be/qCz0bjIT0\\_4](https://youtu.be/qCz0bjIT0_4) ?"
}