{
    "id": "1h9hov1",
    "title": "With rate cards, Indians find a new way to pay domestic workers less",
    "url": "https://i.redd.it/eqqu6m9fam5e1.jpeg",
    "selftext": "Link to pay walled article: https://timesofindia.indiatimes.com/toi-plus/society-culture/with-rate-cards-indians-find-a-new-way-to-pay-domestic-workers-less/articleshow/116077217.cms",
    "flair": "Policy/Economy",
    "score": 381,
    "num_comments": 80,
    "created_utc": 1733660388.0,
    "convurl": "https://i.redd.it/eqqu6m9fam5e1.jpeg",
    "comments": [
        "i mean everyone is getting fucked, do you think your job pays you what you are worth? when you apply for a job do they offer you what the role is worth or do these ask you your last salary?",
        "What's that got to do with the article?",
        "1000 main 3 bhk kon kr raha zara hmko bhi btao",
        "shit flows downhill, our office screws us, we screw people we pay and the government screws everyone",
        "Sorry man, that's a piss poor attitude to have. Even if I assume a modest family income of 20 lakh/year (modest for someone who can afford to have a maid and live in a 3BHK), paying the maid 1000/month to clean your house is exploitation. \n\nIf you can justify it just because you are believe you are getting exploited, then you lack empathy.",
        "My life is not going great so I must piss over others who are lower in the pecking order",
        "I dont know which city has 1000 for a 3bhk, I have lived in 4 major cities and its always 1500+ for a 2bhk with only 2 people living",
        "1500 per week? or per month?",
        "Every time I think I can't hate fellow countrymen more, they take that as a challenge.",
        "month, you pay 1500 a week?",
        "Lol. With such rates nobody is gonna show up to work.\nWho they gonna disbar?",
        "I’m assuming there are always people who are  disenfranchised and desperate enough.",
        "You will surprised to know that how many don't look below while taking a piss.",
        "don't have maid , and I never lived in Metro cities, so was just curious about the money people pay to their maids.",
        "you dont get paid enough, are going to rob a bank to pay your maid? kaise log aate hain comment karne, if the rate isnt good she can obviously  refuse to work for you they aren't slaves",
        "Anywhere between 1500-2000 for a 2bhk for a month.",
        "Whether someone can afford to pay the maid or not is upto the individual. This situation is different in that it is using an institution to artificially reduce the wages. This is done to stop people from paying more who could otherwise afford to.",
        "Our dear brothers and sisters. Lol. We can’t exploit them enough",
        "What next?\nc programming for 70 hours per week = ₹20\nIf it's 40 hours = ₹5k",
        "minimum (livable) wage should be 25K/month India, these people have no idea how expensive basic necessities (food (vegetables, wheat, fruits), fuel, clothing, electricity, water) are nowadays.\n\nthat's how much one needs to actually sustain themselves and 2-3 other members of their family, esp when you factor in kids.\n\nand we pay that to entry-level engineers.",
        "In pune it's 1k every chore for 2 bhk.",
        "nope, Im in Pune, in a relatively cheaper area and we pay 1800 for 2bhk, we are 2 people family.",
        "Tbh the wages of domestic workers depends on the city. Considering pune rates in article is on par with what's happening atleast in my society. Only ppl who have to significantly pay more is bachelors. Ladke ladke bolke everyone milks them.",
        "Fake news",
        "True. When I was in Bangalore, the same maid that used to charge 1k to my neighbour was asking me 2k as I was a bachelor living alone. When I said 1k or I’ll do it myself they started obliging.",
        "This. With some much unemployment and people in desperate need of jobs there will always be someone to work for less, that is why we need labor laws and social security nets to prevent exploitation.\n\nSame strategy is used by corporates, just look at starting salary of WITCH companies that has remain stagnant for decades now.",
        "Looks like every every Indian in an apartment is a Simple Sudha and 70-murthy.",
        "I am more shocked by the fact that RWAs have a Collective as well.",
        "This is the single biggest arena that shows the hypocrisy of feminism in India. The very same women who bray about how shit men are go on to exploit and bargain down with their maids! 🤣\n\nI have seen it 1st hand in BLR and MUM where they campaign in their building kitty party group to push maids to use service lifts, enter the complex from a side gate etc.",
        "What are you smoking bro? Teachers get paid 9k.",
        "exactly my point, even engineers, a highly regarded profession, are paid 25K/month, what about other jobs then? 10K/month isn't even livable for a single person, let alone more than that. what would you even do with 10K in hand per month, that's barely enough to rent a place to live in, to pay the bills, to buy the food, to buy necessities, etc",
        "This rate card is not even applicable in tier 2 city let alone in Gurgaon. Kuch bhi",
        "I live in a multi building gated society with over 500 flats and thankfully this exploitation has not yet made it here. Hopefully it never will. \n\nInflation is anyway running faster than their monthly salary increases year after year and if we strip them of their fair right to negotiate, what are they even left with? I mean we negotiate when we move from one company to another, right? Then why not give them the same privileges,?",
        "Isn't Gurgaon a rich area comparatively in the ncr???? I toh live in not such upmarket area and pay almost double the rates they gave.\n\n1000 se zyaada toh 3bhk ki dusting ke lete hain yahan",
        "Not the first time I'm hearing of this so trust me, far from being a fake news, this one.",
        "The difference is the base salary.. You getting paid less by 30% is sad but a maid getting paid 30% less is criminal...\n\n\nThe same thing happened during covid.. Our office gave only 50% salary... A director  getting 25l instead of usual 50l can still manage his expenses but the peon getting 5000 instead of 10k will make his survival difficult\n\n\nPaying less to the people who are essential to make your house work and are economically so weak is not something you can justify by saying oh no one gets paid what they are worth",
        "This has nothing to do with feminism. Except issues regarding gender discrimination which they experience first hand, an average indian woman is as casteist, backward minded, classist and bigot as an Indian man.",
        "Lgta hain article 10 years pehle nikalna tha late hai gye thoda",
        "I pay 3k for 2.5bhk",
        "The same people who whine about WITCH will rage against this tho",
        "And then we get pissed off when we don’t get appraisals. BC we are the world’s most progressive regressive educated folk. Crabs.",
        "And these are the same people who are vehemently anti-union. Which is ironic because by rate fixing, they are operating as a union",
        "I stay in Gurgaon. These rates are insane. I have a 2 bhk and I pay 3 times the rates quoted here for a 3 bhk.",
        "I've seen this cheap mentality in so many places. Don't have the guts to talk back back to superiors but have enough bravery to talk down to house maids.",
        "Unionise and squeeze the rich!\nThis is just assholes assholing 🤬",
        "Hope domestic workers unionize and disbar the society.",
        "The Union doesn't realise how mych power they have. There are people out there in Pune who absolutely cannot function as normal human beings without the help of domestic help. It will take half a week for their houses to turn into dumps. \n\n\n\nThe scabs are doing a great disservice to themselves and also the other workers.",
        "Calculate their salary and you find out that it is a poor, pitiable pittance. Factor in the uncertainty and getting fired easily and understand that they lose 20-30% of what they'd be earning if it were a steady job.\n\nMost people make a potty face when these people ask for leaves. We salaries people can go for a week or even month of leave, but these people are so scared of losing their job to someone else that long leaves are just not for them. \n\nBe kind.",
        "25k/ per month?? Brother if you make that much you come in the top 10 percentile of salaried employees.. I agree that there should be some sort of minimum wage, but you suggest 25k as the amount shows that you don't understand that it is a pretty big amount, and essentially not possible.",
        "It's not about being kind or not kind. The thing is the rates quoted in this article are bullshit.\n\nThey are obviously underpaid but no one is getting 3 bhk cleaning at 1000 rupees in Gurgaon. The rate is 3x to 4x of that",
        "and all I am saying is that 3X-4X of that is totally reasonable.",
        "This is a reverse 'There's power in a Union'. \n\nI remember domestic workers in my locality were pretty organized and successfully got a hike at multiple times.",
        "25K/month is necessary to sustain a family is what i meant, you can't sustain a family of 4 or more without that.",
        "Read the parent comment. Nowhere does it say that the rates are unreasonable. \n\nThe entire point is that the rates mentioned in the article is BS.\n\nBe kind. Read the comment before responding.",
        "I earn 10k bruh.told my reality",
        "TOI searched for rate card a decade ago using internet explorer finally they have the result.\n\n/s",
        "Depends on where you live... in cities, it hard but possible. But you can and families do survive on much less in majority of India. It won't be comfortable life and you won't save anything. Majority of my family belongs to lower middle class, and one them used to make ~ 25k per month and supported a family of 7. A cousin lives in a city and she makes ~ 13k per month and lives fine. The thing is majority of us here are so privileged that we find 25k as a measly amount but if you are ready to live a bit uncomfortable and be careful with money it's certainly a lot for universal basic income. \n\nThis is a complete separate point I am making, I certainly do not agree with the exploitation of domestic workers, they deserve to be payed much more.",
        "Indian society housewives are some of the vilest women on the planet. They way that they haggle and gang up against the poor labour class is fucking disgusting. There was a conservative woman in the Bangalore subreddit who was arguing against giving the house helps Diwali bonus as \"it'll make them entitled and they will demand and expect the same from other houses too\". Blood suckers they are!",
        "My dear manchild, people who are feminist will gladly stand up for the unprivileged too, especially when they are women. Do you really think the conservative housing society aunties care about feminism?",
        "Don't give ideas",
        "But they can only work for so many people. Who will this reduced and cheap workforce be directed towards? Presidents and connected people only... Most residents will be left with no one to employ, meanwhile select few will get cheapest of services.",
        "This is happening from top level. Corporates exploiting employees, they trying to get whatever they can as cheaply while paying all the loans and bills, etc etc. Salaries don't increase much, but inflation rises, labour cost increases, people feel like they are getting overcharged. Take government for example. They don't change costs from 10-15 years and expect drivers and workers to come at the same price. Employees pay out of their pockets in many cases",
        "If you can't pay decent wages, do your own cooking, cleaning, laundry. Nowadays there are machines that can help. Cook for multiple days and store. Simplify your menu.\nAsk your kids and spouse to help. Let kids wash their own laundry and wash their dishes, pack their lunch. It is not that hard. That's how world operates. There is nothing special about Indian households that need special help other than sheer laziness. My mom had to travel 3 hours in one direction for many years, so she taught us how to do our own stuff at a young age, and we survived without any domestic help. You can do it too.",
        "If our global employers did the same, everyone would be crying rivers",
        "While I’m fine with paying domestic workers fairly, I’m yet to find a worker who does household work with diligence and sincerity. They demonstrate professionalism when it comes to demanding rates and taking leaves, but when it comes to doing the work with sincerity, I’m yet to see some genuine cleaning being done. \n\nNothing against anyone but this is what I’ve experienced in our society in Pune.",
        "I'm in Hyderabad and I pay 2k for my domestic help for a 2bhk. What the hell are these people smoking?",
        "I don't have any sympathy towards the domestic help maids. They demand more, they straight away say I don't do this, don't do that...take unscheduled leaves. F them, they make 50K easily.",
        "This is how rich treat/exploit poor, anywhere in the world. For them a salaried person is rich. For a salaried person, the owner/shareholder of their company is rich. \n\nFrom another angle, if one gets paid 1k for utensils, its' 1k/hour. If he/she works 5 hours a day \\* 30 days a week, its 1.50 lakhs per month, tax free. And I have seen the quality of work they do. Plus other govt benefits they get, which we, salaried class people don't get. Remember Ladki Bahin yojna? \n\nI do understand the kind of pain they go through and I have full sympathy for them.",
        "Is it just my issue or is the image too blurred to read",
        "Same people who whine about corporates not giving handsome increments.",
        "Meri bai ko samjhao koi gst aur pf. Reality is no bai wants to learn all this.",
        "Good decision. The lower class usually hokes their pay by 50-100% every year while the middle class barely gets 5-10% increment",
        "> I’m yet to see some genuine cleaning being done.\n\nDo it yourself man. Otherwise you will never be happy.",
        "1bhk 450sqt house (ise house nahi room kehte hain), I paid 2.5k to clean it when I was sick and bedridden for 2 months. Plus paid her gst (usne khana bartan sab chori kara) on top of her salary. Usko Diwali bonus bhi chahiye tha. I told her to get out and never come back.",
        "These are pretty good rates lmao once you combine it all.\n\nR/india is just filthy rich and thinks everyone can afford this",
        "Don’t you think the rates are unreasonable?",
        "I think you are reading it wrong. Usually these rates are to be additive based on the work.\n\nE.g. typically you'd have one person for sweeping,mopping, utensils, bathrooms and dusting. Acc to these rates that would be 1000+1000+1000+700 = 3700\n\nIt's still too low but just clarifying that's how I read it.",
        "Rich people are not assholes. Unless it's necessary quality to be a rich.\n\nBut I am sure if these poor people were to be born as rich they would do the same things",
        "There should be rate card because these maids try to loot you. ",
        "Most horrible comment. ",
        "So why don’t you go and share her domestic duties? ",
        "True"
    ],
    "cleaned_text": "rate cards indians find new way pay domestic workers less link pay walled article ",
    "cleaned_title": "rate cards indians find new way pay domestic workers less",
    "cleaned_selftext": "link pay walled article",
    "cleaned_comments": "mean everyone getting fucked think job pays worth apply job offer role worth ask last salary whats got article main bhk kon kr raha zara hmko bhi btao shit flows downhill office screws us screw people pay government screws everyone sorry man thats piss poor attitude even assume modest family income lakhyear modest someone afford maid live bhk paying maid month clean house exploitation justify believe getting exploited lack empathy life going great must piss others lower pecking order dont know city bhk lived major cities always bhk people living per week per month every time think cant hate fellow countrymen take challenge month pay week lol rates nobody gon na show work gon na disbar im assuming always people disenfranchised desperate enough surprised know many dont look taking piss dont maid never lived metro cities curious money people pay maids dont get paid enough going rob bank pay maid kaise log aate hain comment karne rate isnt good obviously refuse work arent slaves anywhere bhk month whether someone afford pay maid upto individual situation different using institution artificially reduce wages done stop people paying could otherwise afford dear brothers sisters lol cant exploit enough next c programming hours per week hours k minimum livable wage kmonth india people idea expensive basic necessities food vegetables wheat fruits fuel clothing electricity water nowadays thats much one needs actually sustain members family esp factor kids pay entrylevel engineers pune k every chore bhk nope im pune relatively cheaper area pay bhk people family tbh wages domestic workers depends city considering pune rates article par whats happening atleast society ppl significantly pay bachelors ladke ladke bolke everyone milks fake news true bangalore maid used charge k neighbour asking k bachelor living alone said k ill started obliging much unemployment people desperate need jobs always someone work less need labor laws social security nets prevent exploitation strategy used corporates look starting salary witch companies remain stagnant decades looks like every every indian apartment simple sudha murthy shocked fact rwas collective well single biggest arena shows hypocrisy feminism india women bray shit men go exploit bargain maids seen st hand blr mum campaign building kitty party group push maids use service lifts enter complex side gate etc smoking bro teachers get paid k exactly point even engineers highly regarded profession paid kmonth jobs kmonth isnt even livable single person let alone would even k hand per month thats barely enough rent place live pay bills buy food buy necessities etc rate card even applicable tier city let alone gurgaon kuch bhi live multi building gated society flats thankfully exploitation yet made hopefully never inflation anyway running faster monthly salary increases year year strip fair right negotiate even left mean negotiate move one company another right give privileges isnt gurgaon rich area comparatively ncr toh live upmarket area pay almost double rates gave se zyaada toh bhk ki dusting ke lete hain yahan first time im hearing trust far fake news one difference base salary getting paid less sad maid getting paid less criminal thing happened covid office gave salary director getting l instead usual l still manage expenses peon getting instead k make survival difficult paying less people essential make house work economically weak something justify saying oh one gets paid worth nothing feminism except issues regarding gender discrimination experience first hand average indian woman casteist backward minded classist bigot indian man lgta hain article years pehle nikalna tha late hai gye thoda pay k bhk people whine witch rage tho get pissed dont get appraisals bc worlds progressive regressive educated folk crabs people vehemently antiunion ironic rate fixing operating union stay gurgaon rates insane bhk pay times rates quoted bhk ive seen cheap mentality many places dont guts talk back back superiors enough bravery talk house maids unionise squeeze rich assholes assholing hope domestic workers unionize disbar society union doesnt realise mych power people pune absolutely function normal human beings without help domestic help take half week houses turn dumps scabs great disservice also workers calculate salary find poor pitiable pittance factor uncertainty getting fired easily understand lose theyd earning steady job people make potty face people ask leaves salaries people go week even month leave people scared losing job someone else long leaves kind k per month brother make much come top percentile salaried employees agree sort minimum wage suggest k amount shows dont understand pretty big amount essentially possible kind kind thing rates quoted article bullshit obviously underpaid one getting bhk cleaning rupees gurgaon rate x x saying xx totally reasonable reverse theres power union remember domestic workers locality pretty organized successfully got hike multiple times kmonth necessary sustain family meant cant sustain family without read parent comment nowhere say rates unreasonable entire point rates mentioned article bs kind read comment responding earn k bruhtold reality toi searched rate card decade ago using internet explorer finally result depends live cities hard possible families survive much less majority india wont comfortable life wont save anything majority family belongs lower middle class one used make k per month supported family cousin lives city makes k per month lives fine thing majority us privileged find k measly amount ready live bit uncomfortable careful money certainly lot universal basic income complete separate point making certainly agree exploitation domestic workers deserve payed much indian society housewives vilest women planet way haggle gang poor labour class fucking disgusting conservative woman bangalore subreddit arguing giving house helps diwali bonus itll make entitled demand expect houses blood suckers dear manchild people feminist gladly stand unprivileged especially women really think conservative housing society aunties care feminism dont give ideas work many people reduced cheap workforce directed towards presidents connected people residents left one employ meanwhile select get cheapest services happening top level corporates exploiting employees trying get whatever cheaply paying loans bills etc etc salaries dont increase much inflation rises labour cost increases people feel like getting overcharged take government example dont change costs years expect drivers workers come price employees pay pockets many cases cant pay decent wages cooking cleaning laundry nowadays machines help cook multiple days store simplify menu ask kids spouse help let kids wash laundry wash dishes pack lunch hard thats world operates nothing special indian households need special help sheer laziness mom travel hours one direction many years taught us stuff young age survived without domestic help global employers everyone would crying rivers im fine paying domestic workers fairly im yet find worker household work diligence sincerity demonstrate professionalism comes demanding rates taking leaves comes work sincerity im yet see genuine cleaning done nothing anyone ive experienced society pune im hyderabad pay k domestic help bhk hell people smoking dont sympathy towards domestic help maids demand straight away say dont dont thattake unscheduled leaves f make k easily rich treatexploit poor anywhere world salaried person rich salaried person ownershareholder company rich another angle one gets paid k utensils khour heshe works hours day days week lakhs per month tax free seen quality work plus govt benefits get salaried class people dont get remember ladki bahin yojna understand kind pain go full sympathy issue image blurred read people whine corporates giving handsome increments meri bai ko samjhao koi gst aur pf reality bai wants learn good decision lower class usually hokes pay every year middle class barely gets increment im yet see genuine cleaning done man otherwise never happy bhk sqt house ise house nahi room kehte hain paid k clean sick bedridden months plus paid gst usne khana bartan sab chori kara top salary usko diwali bonus bhi chahiye tha told get never come back pretty good rates lmao combine rindia filthy rich thinks everyone afford dont think rates unreasonable think reading wrong usually rates additive based work eg typically youd one person sweepingmopping utensils bathrooms dusting acc rates would still low clarifying thats read rich people assholes unless necessary quality rich sure poor people born rich would things rate card maids try loot horrible comment dont go share domestic duties true",
    "light_cleaned_title": "With rate cards, Indians find a new way to pay domestic workers less",
    "light_cleaned_selftext": "Link to pay walled article:",
    "light_cleaned_comments": "i mean everyone is getting fucked, do you think your job pays you what you are worth? when you apply for a job do they offer you what the role is worth or do these ask you your last salary? What's that got to do with the article? 1000 main 3 bhk kon kr raha zara hmko bhi btao shit flows downhill, our office screws us, we screw people we pay and the government screws everyone Sorry man, that's a piss poor attitude to have. Even if I assume a modest family income of 20 lakh/year (modest for someone who can afford to have a maid and live in a 3BHK), paying the maid 1000/month to clean your house is exploitation. If you can justify it just because you are believe you are getting exploited, then you lack empathy. My life is not going great so I must piss over others who are lower in the pecking order I dont know which city has 1000 for a 3bhk, I have lived in 4 major cities and its always 1500+ for a 2bhk with only 2 people living 1500 per week? or per month? Every time I think I can't hate fellow countrymen more, they take that as a challenge. month, you pay 1500 a week? Lol. With such rates nobody is gonna show up to work. Who they gonna disbar? I’m assuming there are always people who are disenfranchised and desperate enough. You will surprised to know that how many don't look below while taking a piss. don't have maid , and I never lived in Metro cities, so was just curious about the money people pay to their maids. you dont get paid enough, are going to rob a bank to pay your maid? kaise log aate hain comment karne, if the rate isnt good she can obviously refuse to work for you they aren't slaves Anywhere between 1500-2000 for a 2bhk for a month. Whether someone can afford to pay the maid or not is upto the individual. This situation is different in that it is using an institution to artificially reduce the wages. This is done to stop people from paying more who could otherwise afford to. Our dear brothers and sisters. Lol. We can’t exploit them enough What next? c programming for 70 hours per week = ₹20 If it's 40 hours = ₹5k minimum (livable) wage should be 25K/month India, these people have no idea how expensive basic necessities (food (vegetables, wheat, fruits), fuel, clothing, electricity, water) are nowadays. that's how much one needs to actually sustain themselves and 2-3 other members of their family, esp when you factor in kids. and we pay that to entry-level engineers. In pune it's 1k every chore for 2 bhk. nope, Im in Pune, in a relatively cheaper area and we pay 1800 for 2bhk, we are 2 people family. Tbh the wages of domestic workers depends on the city. Considering pune rates in article is on par with what's happening atleast in my society. Only ppl who have to significantly pay more is bachelors. Ladke ladke bolke everyone milks them. Fake news True. When I was in Bangalore, the same maid that used to charge 1k to my neighbour was asking me 2k as I was a bachelor living alone. When I said 1k or I’ll do it myself they started obliging. This. With some much unemployment and people in desperate need of jobs there will always be someone to work for less, that is why we need labor laws and social security nets to prevent exploitation. Same strategy is used by corporates, just look at starting salary of WITCH companies that has remain stagnant for decades now. Looks like every every Indian in an apartment is a Simple Sudha and 70-murthy. I am more shocked by the fact that RWAs have a Collective as well. This is the single biggest arena that shows the hypocrisy of feminism in India. The very same women who bray about how shit men are go on to exploit and bargain down with their maids! 🤣 I have seen it 1st hand in BLR and MUM where they campaign in their building kitty party group to push maids to use service lifts, enter the complex from a side gate etc. What are you smoking bro? Teachers get paid 9k. exactly my point, even engineers, a highly regarded profession, are paid 25K/month, what about other jobs then? 10K/month isn't even livable for a single person, let alone more than that. what would you even do with 10K in hand per month, that's barely enough to rent a place to live in, to pay the bills, to buy the food, to buy necessities, etc This rate card is not even applicable in tier 2 city let alone in Gurgaon. Kuch bhi I live in a multi building gated society with over 500 flats and thankfully this exploitation has not yet made it here. Hopefully it never will. Inflation is anyway running faster than their monthly salary increases year after year and if we strip them of their fair right to negotiate, what are they even left with? I mean we negotiate when we move from one company to another, right? Then why not give them the same privileges,? Isn't Gurgaon a rich area comparatively in the ncr???? I toh live in not such upmarket area and pay almost double the rates they gave. 1000 se zyaada toh 3bhk ki dusting ke lete hain yahan Not the first time I'm hearing of this so trust me, far from being a fake news, this one. The difference is the base salary.. You getting paid less by 30% is sad but a maid getting paid 30% less is criminal... The same thing happened during covid.. Our office gave only 50% salary... A director getting 25l instead of usual 50l can still manage his expenses but the peon getting 5000 instead of 10k will make his survival difficult Paying less to the people who are essential to make your house work and are economically so weak is not something you can justify by saying oh no one gets paid what they are worth This has nothing to do with feminism. Except issues regarding gender discrimination which they experience first hand, an average indian woman is as casteist, backward minded, classist and bigot as an Indian man. Lgta hain article 10 years pehle nikalna tha late hai gye thoda I pay 3k for 2.5bhk The same people who whine about WITCH will rage against this tho And then we get pissed off when we don’t get appraisals. BC we are the world’s most progressive regressive educated folk. Crabs. And these are the same people who are vehemently anti-union. Which is ironic because by rate fixing, they are operating as a union I stay in Gurgaon. These rates are insane. I have a 2 bhk and I pay 3 times the rates quoted here for a 3 bhk. I've seen this cheap mentality in so many places. Don't have the guts to talk back back to superiors but have enough bravery to talk down to house maids. Unionise and squeeze the rich! This is just assholes assholing 🤬 Hope domestic workers unionize and disbar the society. The Union doesn't realise how mych power they have. There are people out there in Pune who absolutely cannot function as normal human beings without the help of domestic help. It will take half a week for their houses to turn into dumps. The scabs are doing a great disservice to themselves and also the other workers. Calculate their salary and you find out that it is a poor, pitiable pittance. Factor in the uncertainty and getting fired easily and understand that they lose 20-30% of what they'd be earning if it were a steady job. Most people make a potty face when these people ask for leaves. We salaries people can go for a week or even month of leave, but these people are so scared of losing their job to someone else that long leaves are just not for them. Be kind. 25k/ per month?? Brother if you make that much you come in the top 10 percentile of salaried employees.. I agree that there should be some sort of minimum wage, but you suggest 25k as the amount shows that you don't understand that it is a pretty big amount, and essentially not possible. It's not about being kind or not kind. The thing is the rates quoted in this article are bullshit. They are obviously underpaid but no one is getting 3 bhk cleaning at 1000 rupees in Gurgaon. The rate is 3x to 4x of that and all I am saying is that 3X-4X of that is totally reasonable. This is a reverse 'There's power in a Union'. I remember domestic workers in my locality were pretty organized and successfully got a hike at multiple times. 25K/month is necessary to sustain a family is what i meant, you can't sustain a family of 4 or more without that. Read the parent comment. Nowhere does it say that the rates are unreasonable. The entire point is that the rates mentioned in the article is BS. Be kind. Read the comment before responding. I earn 10k bruh.told my reality TOI searched for rate card a decade ago using internet explorer finally they have the result. /s Depends on where you live... in cities, it hard but possible. But you can and families do survive on much less in majority of India. It won't be comfortable life and you won't save anything. Majority of my family belongs to lower middle class, and one them used to make ~ 25k per month and supported a family of 7. A cousin lives in a city and she makes ~ 13k per month and lives fine. The thing is majority of us here are so privileged that we find 25k as a measly amount but if you are ready to live a bit uncomfortable and be careful with money it's certainly a lot for universal basic income. This is a complete separate point I am making, I certainly do not agree with the exploitation of domestic workers, they deserve to be payed much more. Indian society housewives are some of the vilest women on the planet. They way that they haggle and gang up against the poor labour class is fucking disgusting. There was a conservative woman in the Bangalore subreddit who was arguing against giving the house helps Diwali bonus as \"it'll make them entitled and they will demand and expect the same from other houses too\". Blood suckers they are! My dear manchild, people who are feminist will gladly stand up for the unprivileged too, especially when they are women. Do you really think the conservative housing society aunties care about feminism? Don't give ideas But they can only work for so many people. Who will this reduced and cheap workforce be directed towards? Presidents and connected people only... Most residents will be left with no one to employ, meanwhile select few will get cheapest of services. This is happening from top level. Corporates exploiting employees, they trying to get whatever they can as cheaply while paying all the loans and bills, etc etc. Salaries don't increase much, but inflation rises, labour cost increases, people feel like they are getting overcharged. Take government for example. They don't change costs from 10-15 years and expect drivers and workers to come at the same price. Employees pay out of their pockets in many cases If you can't pay decent wages, do your own cooking, cleaning, laundry. Nowadays there are machines that can help. Cook for multiple days and store. Simplify your menu. Ask your kids and spouse to help. Let kids wash their own laundry and wash their dishes, pack their lunch. It is not that hard. That's how world operates. There is nothing special about Indian households that need special help other than sheer laziness. My mom had to travel 3 hours in one direction for many years, so she taught us how to do our own stuff at a young age, and we survived without any domestic help. You can do it too. If our global employers did the same, everyone would be crying rivers While I’m fine with paying domestic workers fairly, I’m yet to find a worker who does household work with diligence and sincerity. They demonstrate professionalism when it comes to demanding rates and taking leaves, but when it comes to doing the work with sincerity, I’m yet to see some genuine cleaning being done. Nothing against anyone but this is what I’ve experienced in our society in Pune. I'm in Hyderabad and I pay 2k for my domestic help for a 2bhk. What the hell are these people smoking? I don't have any sympathy towards the domestic help maids. They demand more, they straight away say I don't do this, don't do that...take unscheduled leaves. F them, they make 50K easily. This is how rich treat/exploit poor, anywhere in the world. For them a salaried person is rich. For a salaried person, the owner/shareholder of their company is rich. From another angle, if one gets paid 1k for utensils, its' 1k/hour. If he/she works 5 hours a day \\* 30 days a week, its 1.50 lakhs per month, tax free. And I have seen the quality of work they do. Plus other govt benefits they get, which we, salaried class people don't get. Remember Ladki Bahin yojna? I do understand the kind of pain they go through and I have full sympathy for them. Is it just my issue or is the image too blurred to read Same people who whine about corporates not giving handsome increments. Meri bai ko samjhao koi gst aur pf. Reality is no bai wants to learn all this. Good decision. The lower class usually hokes their pay by 50-100% every year while the middle class barely gets 5-10% increment > I’m yet to see some genuine cleaning being done. Do it yourself man. Otherwise you will never be happy. 1bhk 450sqt house (ise house nahi room kehte hain), I paid 2.5k to clean it when I was sick and bedridden for 2 months. Plus paid her gst (usne khana bartan sab chori kara) on top of her salary. Usko Diwali bonus bhi chahiye tha. I told her to get out and never come back. These are pretty good rates lmao once you combine it all. R/india is just filthy rich and thinks everyone can afford this Don’t you think the rates are unreasonable? I think you are reading it wrong. Usually these rates are to be additive based on the work. E.g. typically you'd have one person for sweeping,mopping, utensils, bathrooms and dusting. Acc to these rates that would be 1000+1000+1000+700 = 3700 It's still too low but just clarifying that's how I read it. Rich people are not assholes. Unless it's necessary quality to be a rich. But I am sure if these poor people were to be born as rich they would do the same things There should be rate card because these maids try to loot you. Most horrible comment. So why don’t you go and share her domestic duties? True"
}