{
    "id": "1e9i425",
    "title": "Scam Alert! Awareness about Edureify Technology Pvt Ltd for scamming Jobseekers/students.",
    "url": "https://www.reddit.com/gallery/1e9i425",
    "selftext": "Got this mail recently on 19th july. This great guy mailed  my fiance and 50+ more othera people about this fraud company so to spread awareness about this scammer company and nobody else becomes the victim of this.\n\nMy Fiance enrolled with this company for potential job opportunity but didn't continue with it and dropped within a month or so it was around near end of 2022. He also uploaded the docs through that drona app and got the call after few months that his EMIs will start from so and so date he simply blocked them and never heard from them again. \nBut this is so concerning that lots of these frauds take advantage of youngsters looking for job opportunities. In desperation many students/jobseekers fall for this type of scams.\n\n\n(Not sure what tag this comes under putting it under a crime tag fn) ",
    "flair": "Crime",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1721664590.0,
    "convurl": "https://i.redd.it/x47nwpxqg3ed1.png",
    "comments": [
        "Post in r/deverlopersindia too",
        "Done."
    ],
    "cleaned_text": "scam alert awareness edureify technology pvt ltd scamming jobseekersstudents got mail recently th july great guy mailed fiance othera people fraud company spread awareness scammer company nobody else becomes victim fiance enrolled company potential job opportunity didnt continue dropped within month around near end also uploaded docs drona app got call months emis start date simply blocked never heard concerning lots frauds take advantage youngsters looking job opportunities desperation many studentsjobseekers fall type scams sure tag comes putting crime tag fn ",
    "cleaned_title": "scam alert awareness edureify technology pvt ltd scamming jobseekersstudents",
    "cleaned_selftext": "got mail recently th july great guy mailed fiance othera people fraud company spread awareness scammer company nobody else becomes victim fiance enrolled company potential job opportunity didnt continue dropped within month around near end also uploaded docs drona app got call months emis start date simply blocked never heard concerning lots frauds take advantage youngsters looking job opportunities desperation many studentsjobseekers fall type scams sure tag comes putting crime tag fn",
    "cleaned_comments": "post rdeverlopersindia done",
    "light_cleaned_title": "Scam Alert! Awareness about Edureify Technology Pvt Ltd for scamming Jobseekers/students.",
    "light_cleaned_selftext": "Got this mail recently on 19th july. This great guy mailed my fiance and 50+ more othera people about this fraud company so to spread awareness about this scammer company and nobody else becomes the victim of this. My Fiance enrolled with this company for potential job opportunity but didn't continue with it and dropped within a month or so it was around near end of 2022. He also uploaded the docs through that drona app and got the call after few months that his EMIs will start from so and so date he simply blocked them and never heard from them again. But this is so concerning that lots of these frauds take advantage of youngsters looking for job opportunities. In desperation many students/jobseekers fall for this type of scams. (Not sure what tag this comes under putting it under a crime tag fn)",
    "light_cleaned_comments": "Post in r/deverlopersindia too Done."
}