{
    "id": "iwtu4b",
    "title": "Watch the Watchmen Series Part 3 : The Crime and Criminal Tracking Network System",
    "url": "https://www.reddit.com/r/india/comments/iwtu4b/watch_the_watchmen_series_part_3_the_crime_and/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/10ybudmslfo51.png?width=1024&amp;format=png&amp;auto=webp&amp;s=03c606a143e5073df07862ddc770f365f0d629ff\n\n# tl;dr\n\nThe [**Crime and Criminal Tracking Network System (CCTNS)**](https://ncrb.gov.in/en/crime-and-criminal-tracking-network-systems-cctns) aims to connect police stations across the country to increase ease of access to data related to FIR registration, investigation and chargesheets in all police stations.\n\n# History\n\nLike [**NATGRID**](https://internetfreedom.in/watch-the-watchmen-part-1-the-national-intelligence-grid/) and [**CMS**](https://internetfreedom.in/watch-the-watchmen-series-part-2-the-centralised-monitoring-system/), CCTNS was also developed in the aftermath of the 26/11 Mumbai terror attacks by then Home Minister P. Chidambaram to strengthen the internal security architecture of the country. [**The pilot testing of the Core Application Software (CAS) was started in 15 locations across Assam, Kerala and Uttar Pradesh, from 1st October 2011.**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=149698&amp;lsno=15)The testing continued till January, 2013. During the testing, the Ministry of Home Affairs (MHA)/National Crime Records Bureau (NCRB) closely monitored the progress and collected the feedback for issue resolution. [**The pilot launch of CCTNS was done by the Ministry of Home Affairs (MHA) on January 4, 2013 at New Delhi.** ](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=143583&amp;lsno=15)  \n\n\n[**The Crime and Criminal Tracking Network and Systems (CCTNS) Project was originally scheduled to be implemented by March, 2015.** ](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=38262&amp;lsno=16)The implementation of CCTNS is being done in a phased manner and has faced consistent delays. According to the [**CCTNS**](https://ncrb.gov.in/en/crime-and-criminal-tracking-network-systems-cctns) Pragati Dashboard [**Report dated July 31, 2020**](https://ncrb.gov.in/sites/default/files/PRAGATI_Dashboard-July2020.pdf), overall implementation of the project is currently at 77.8%.   \n\n\nOn January 1, 2019, in [**response**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=76816&amp;lsno=16) to a parliamentary question the then Minister of State in the Ministry Of Home Affairs, Shri Hansraj Gangaram Ahir stated that, “The Crime and Criminal Tracking Network and Systems (CCTNS) has been rolled out nationally and as on 30.11.2018, it has been deployed in 14764 police stations in the country.”  \n\n\n[**The total estimated cost of this Project is 2000 Crore INR during the 11th Five Year Plan**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=98553&amp;lsno=15)and the actual expenditure as on [**March 6, 2018**](http://164.100.24.220/loksabhaquestions/annex/14/AU1742.pdf) is 1451.398 crore INR.   \n\n\n# What is CCTNS?\n\nThe CCTNS was envisaged as a system which would help police stations across the country to [**“talk”**](https://indianexpress.com/article/explained/cctns-project-to-let-police-stations-talk-where-it-stands-and-how-it-can-help-fight-crime/) to each other. [**The aim of the project is to digitise all information related to FIRs registered, cases investigated, and charge sheets filed in all police stations, in order to develop a national database of crime and criminals.**](https://indianexpress.com/article/explained/cctns-project-to-let-police-stations-talk-where-it-stands-and-how-it-can-help-fight-crime/)  This project, which is proposed to be implemented as a [**Mission Mode Project under the National e-Governance Plan (NeGP)**](https://ncrb.gov.in/en/crime-and-criminal-tracking-network-systems-cctns) of Govt. of India, [**aims at creating a comprehensive and integrated system for enhancing the efficiency and effectiveness of policing at police station level through adoption of principles of e-Governance by creation of a nationwide networked infrastructure for evolution of IT-enabled state-of–the-art tracking system around “investigation of crime and detection of criminals”.** ](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=98553&amp;lsno=15)The [**National Crime Records Bureau is the nodal project implementation agency**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=136657&amp;lsno=15) for review, monitoring and coordination of the project under the overall guidance of the Ministry of Home Affairs.   \n\n\nOn December 8, 2015, in [**response**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=25621&amp;lsno=16) to a parliamentary question, the then Minister Of State In The Ministry Of Home Affairs, Shri Haribhai Parathibhai Chaudhary stated the aim of the project as under:\n\n&gt;To fully computerise the process of crime registration, investigation, prosecution etc. in all police stations in the country  \n&gt;  \n&gt;To create a central database to provide national level search facility as well as crime analytics for use by police and central agencies  \n&gt;  \n&gt;To electronically share data/information among Police Stations &amp; Police Higher Offices  \n&gt;  \n&gt;Computerisation of all prisons and provision of necessary hardware, software etc.  \n&gt;  \n&gt;To provide citizen services through a Citizen Portal  \n&gt;  \n&gt;Sharing of Crime and Criminal related data with Police, Prosecution, Courts, Prison and Forensics leading to Integrated Criminal Justice System  \n\n\n# What are the privacy concerns surrounding CCTNS?\n\nCCTNS is being implemented in the country without a data protection law in place. This leads to privacy concerns because the CCTNS is proposed to be integrated with various projects such the [**National Intelligence Grid (NATGRID)**](https://www.thehindu.com/news/national/natgrid-to-have-access-to-database-that-links-around-14000-police-stations/article32058643.ece) and the [**National Automated Facial Recognition System (AFRS)**](https://www.hindustantimes.com/india-news/home-ministry-moves-to-get-automated-facial-recognition-system-for-police/story-AfPOydDwKwz0leTt3t4WvI.html).  Integration of the CCTNS with these projects would thus allow the state to create complete profiles of citizens. Both these projects have been red-flagged by privacy experts and civil society organisations as potential tools of mass surveillance in the hands of the state. (Read [**here**](https://internetfreedom.in/watch-the-watchmen-part-1-the-national-intelligence-grid/) and [**here**](https://internetfreedom.in/iffs-legal-notice-to-the-ncrb-on-the-revised-rfp-for-the-national-automated-facial-recognition-system/))\n\nFor example, in a situation where a person has been wrongfully arrested, the integration of their data into the CCTNS would lead to further violations of their rights. This is because their data is now available to the NATGRID and the AFRS. This allows the government to track their every movement and ultimately violates their fundamental rights. \n\n# Who will ‘watch the watchmen’?\n\nThis look into CCTNS  is the third in IFF’s new series called Watch the Watchmen. Through this series we aim to look into and analyse the looming surveillance technology threats in India.  \n\n\n# Important Documents\n\n1. Watch the Watchmen Series Part 1 : The National Intelligence Grid dated September 2, 2020 ([**link**](https://internetfreedom.in/watch-the-watchmen-part-1-the-national-intelligence-grid/))\n2. Watch the Watchmen Series Part 2 : The Centralised Monitoring System dated September 14, 2020 ([**link**](https://internetfreedom.in/watch-the-watchmen-series-part-2-the-centralised-monitoring-system/))\n3. IFF's Legal Notice to the NCRB on the Revised RFP for the National Automated Facial Recognition System dated July 15, 2020 ([**link**](https://internetfreedom.in/iffs-legal-notice-to-the-ncrb-on-the-revised-rfp-for-the-national-automated-facial-recognition-system/))\n\n[Help us fight mass surveillance and protect your privacy and fundamental rights. Please help us sustain our efforts and donate to us generously and become a member with us today.](https://internetfreedom.in/donate)",
    "flair": "Policy/Economy",
    "score": 19,
    "num_comments": 14,
    "created_utc": 1600663882,
    "convurl": "https://b.thumbs.redditmedia.com/jfzKQUlIiZToc_nD3TZPALAob9zNLCs93-mqc4jPkjw.jpg",
    "comments": [
        "So if a person has been arrested in one police station you don’t want the data to be shared? Why? The reasoning isn’t clear.              \nEdit: also it would be useful to list the experts and their reasoning why. Just a throwaway line doesn’t help the case",
        "I am new to this topic but OP mentioned this as a concern:\n\n&gt; For example, in a situation where a person has been wrongfully arrested, the integration of their data into the CCTNS would lead to further violations of their rights. This is because their data is now available to the NATGRID and the AFRS. This allows the government to track their every movement and ultimately violates their fundamental rights.",
        "Thanks I saw that. But that part doesn’t explain why and the reasoning behind it. It is just a throwaway line. Hence my comment. And is the proposed solution works for rightfully arrested but doesn’t work for wrongfully arrested? It’s very cryptic",
        "I have a hard time understanding all these issues. \n\nMaybe I am too dumb to follow what Internet Freedom India says most of the time. I get the gist but I couldn't articulate the issue to others so there's definitely a gap in my knowledge.",
        "it is not your problem alone, I have been trying to understand these posts myself without anyway close to getting a clear picture. Either the post has to be self explanatory or there has to be an engagement by OP to clarify. Usually the posts are vague and there are no discussions by OP on these topics.            \nThe best thing to do if you don’t understand something is to ask! So next time internet freedom posts ask questions.",
        "These posts make me aware of potential issues but if I want to understand them, I have to look elsewhere. \n\nI value the awareness they raise so I always upvote them.\n\nBut I don't find the time or inclination to do the needed research afterwards. \n\nThere's a lot of things happening and it's difficult to be informed especially since the mainstream media is busy chasing TRPs. \n\nI am currently trying to understand the recent farm bill issue.",
        "No point looking at the media for explanation of any issue. Usually the interpretation is wrong or motivated. Better to check the original sources.           \nIn this case it is best to check the proposals linked in the post and directly read the documents.",
        "Agreed.\n\nBut I don't think I'll invest the time and patience needed to wade through bureaucratic legalese.",
        "Understandable. More the pity that posts like this doesn’t help understand the issue",
        "Police will still say FIR can't be registered as crime was committed in a different police station jurisdiction. /s",
        "Isn’t that problem be resolved when you have a network like this? That excuse would be gone",
        "Hi, if you read the linked blogposts for NATGRID &amp; AFRS, you may be able to understand why linking CCTNS with these projects raises privacy concerns.",
        "I went over that as well. It is not a cohesive argument.",
        "If you could explain why you think its not cohesive, that would help us in resolving your doubt."
    ],
    "cleaned_text": "watch watchmen series part crime criminal tracking network system ampxb tldr crime criminal tracking network system cctnshttpsncrbgovinencrimeandcriminaltrackingnetworksystemscctns aims connect police stations across country increase ease access data related fir registration investigation chargesheets police stations history like natgridhttpsinternetfreedominwatchthewatchmenpartthenationalintelligencegrid cmshttpsinternetfreedominwatchthewatchmenseriespartthecentralisedmonitoringsystem cctns also developed aftermath mumbai terror attacks home minister p chidambaram strengthen internal security architecture country pilot testing core application software cas started locations across assam kerala uttar pradesh st october httploksabhaphnicinquestionsqresultaspxqrefamplsnothe testing continued till january testing ministry home affairs mhanational crime records bureau ncrb closely monitored progress collected feedback issue resolution pilot launch cctns done ministry home affairs mha january new delhi httploksabhaphnicinquestionsqresultaspxqrefamplsno crime criminal tracking network systems cctns project originally scheduled implemented march httploksabhaphnicinquestionsqresultaspxqrefamplsnothe implementation cctns done phased manner faced consistent delays according cctnshttpsncrbgovinencrimeandcriminaltrackingnetworksystemscctns pragati dashboard report dated july httpsncrbgovinsitesdefaultfilespragatidashboardjulypdf overall implementation project currently january responsehttploksabhaphnicinquestionsqresultaspxqrefamplsno parliamentary question minister state ministry home affairs shri hansraj gangaram ahir stated crime criminal tracking network systems cctns rolled nationally deployed police stations country total estimated cost project crore inr th five year planhttploksabhaphnicinquestionsqresultaspxqrefamplsnoand actual expenditure march httploksabhaquestionsannexaupdf crore inr cctns cctns envisaged system would help police stations across country talkhttpsindianexpresscomarticleexplainedcctnsprojecttoletpolicestationstalkwhereitstandsandhowitcanhelpfightcrime aim project digitise information related firs registered cases investigated charge sheets filed police stations order develop national database crime criminalshttpsindianexpresscomarticleexplainedcctnsprojecttoletpolicestationstalkwhereitstandsandhowitcanhelpfightcrime project proposed implemented mission mode project national egovernance plan negphttpsncrbgovinencrimeandcriminaltrackingnetworksystemscctns govt india aims creating comprehensive integrated system enhancing efficiency effectiveness policing police station level adoption principles egovernance creation nationwide networked infrastructure evolution itenabled stateoftheart tracking system around investigation crime detection criminals httploksabhaphnicinquestionsqresultaspxqrefamplsnothe national crime records bureau nodal project implementation agencyhttploksabhaphnicinquestionsqresultaspxqrefamplsno review monitoring coordination project overall guidance ministry home affairs december responsehttploksabhaphnicinquestionsqresultaspxqrefamplsno parliamentary question minister state ministry home affairs shri haribhai parathibhai chaudhary stated aim project gtto fully computerise process crime registration investigation prosecution etc police stations country gt gtto create central database provide national level search facility well crime analytics use police central agencies gt gtto electronically share datainformation among police stations amp police higher offices gt gtcomputerisation prisons provision necessary hardware software etc gt gtto provide citizen services citizen portal gt gtsharing crime criminal related data police prosecution courts prison forensics leading integrated criminal justice system privacy concerns surrounding cctns cctns implemented country without data protection law place leads privacy concerns cctns proposed integrated various projects national intelligence grid natgridhttpswwwthehinducomnewsnationalnatgridtohaveaccesstodatabasethatlinksaroundpolicestationsarticleece national automated facial recognition system afrshttpswwwhindustantimescomindianewshomeministrymovestogetautomatedfacialrecognitionsystemforpolicestoryafpoyddwkwzletttwvihtml integration cctns projects would thus allow state create complete profiles citizens projects redflagged privacy experts civil society organisations potential tools mass surveillance hands state read herehttpsinternetfreedominwatchthewatchmenpartthenationalintelligencegrid herehttpsinternetfreedominiffslegalnoticetothencrbontherevisedrfpforthenationalautomatedfacialrecognitionsystem example situation person wrongfully arrested integration data cctns would lead violations rights data available natgrid afrs allows government track every movement ultimately violates fundamental rights watch watchmen look cctns third iffs new series called watch watchmen series aim look analyse looming surveillance technology threats india important documents watch watchmen series part national intelligence grid dated september linkhttpsinternetfreedominwatchthewatchmenpartthenationalintelligencegrid watch watchmen series part centralised monitoring system dated september linkhttpsinternetfreedominwatchthewatchmenseriespartthecentralisedmonitoringsystem iffs legal notice ncrb revised rfp national automated facial recognition system dated july linkhttpsinternetfreedominiffslegalnoticetothencrbontherevisedrfpforthenationalautomatedfacialrecognitionsystem help us fight mass surveillance protect privacy fundamental rights please help us sustain efforts donate us generously become member us todayhttpsinternetfreedomindonate ",
    "cleaned_title": "watch watchmen series part crime criminal tracking network system",
    "cleaned_selftext": "ampxb tldr crime criminal tracking network system cctnshttpsncrbgovinencrimeandcriminaltrackingnetworksystemscctns aims connect police stations across country increase ease access data related fir registration investigation chargesheets police stations history like natgridhttpsinternetfreedominwatchthewatchmenpartthenationalintelligencegrid cmshttpsinternetfreedominwatchthewatchmenseriespartthecentralisedmonitoringsystem cctns also developed aftermath mumbai terror attacks home minister p chidambaram strengthen internal security architecture country pilot testing core application software cas started locations across assam kerala uttar pradesh st october httploksabhaphnicinquestionsqresultaspxqrefamplsnothe testing continued till january testing ministry home affairs mhanational crime records bureau ncrb closely monitored progress collected feedback issue resolution pilot launch cctns done ministry home affairs mha january new delhi httploksabhaphnicinquestionsqresultaspxqrefamplsno crime criminal tracking network systems cctns project originally scheduled implemented march httploksabhaphnicinquestionsqresultaspxqrefamplsnothe implementation cctns done phased manner faced consistent delays according cctnshttpsncrbgovinencrimeandcriminaltrackingnetworksystemscctns pragati dashboard report dated july httpsncrbgovinsitesdefaultfilespragatidashboardjulypdf overall implementation project currently january responsehttploksabhaphnicinquestionsqresultaspxqrefamplsno parliamentary question minister state ministry home affairs shri hansraj gangaram ahir stated crime criminal tracking network systems cctns rolled nationally deployed police stations country total estimated cost project crore inr th five year planhttploksabhaphnicinquestionsqresultaspxqrefamplsnoand actual expenditure march httploksabhaquestionsannexaupdf crore inr cctns cctns envisaged system would help police stations across country talkhttpsindianexpresscomarticleexplainedcctnsprojecttoletpolicestationstalkwhereitstandsandhowitcanhelpfightcrime aim project digitise information related firs registered cases investigated charge sheets filed police stations order develop national database crime criminalshttpsindianexpresscomarticleexplainedcctnsprojecttoletpolicestationstalkwhereitstandsandhowitcanhelpfightcrime project proposed implemented mission mode project national egovernance plan negphttpsncrbgovinencrimeandcriminaltrackingnetworksystemscctns govt india aims creating comprehensive integrated system enhancing efficiency effectiveness policing police station level adoption principles egovernance creation nationwide networked infrastructure evolution itenabled stateoftheart tracking system around investigation crime detection criminals httploksabhaphnicinquestionsqresultaspxqrefamplsnothe national crime records bureau nodal project implementation agencyhttploksabhaphnicinquestionsqresultaspxqrefamplsno review monitoring coordination project overall guidance ministry home affairs december responsehttploksabhaphnicinquestionsqresultaspxqrefamplsno parliamentary question minister state ministry home affairs shri haribhai parathibhai chaudhary stated aim project gtto fully computerise process crime registration investigation prosecution etc police stations country gt gtto create central database provide national level search facility well crime analytics use police central agencies gt gtto electronically share datainformation among police stations amp police higher offices gt gtcomputerisation prisons provision necessary hardware software etc gt gtto provide citizen services citizen portal gt gtsharing crime criminal related data police prosecution courts prison forensics leading integrated criminal justice system privacy concerns surrounding cctns cctns implemented country without data protection law place leads privacy concerns cctns proposed integrated various projects national intelligence grid natgridhttpswwwthehinducomnewsnationalnatgridtohaveaccesstodatabasethatlinksaroundpolicestationsarticleece national automated facial recognition system afrshttpswwwhindustantimescomindianewshomeministrymovestogetautomatedfacialrecognitionsystemforpolicestoryafpoyddwkwzletttwvihtml integration cctns projects would thus allow state create complete profiles citizens projects redflagged privacy experts civil society organisations potential tools mass surveillance hands state read herehttpsinternetfreedominwatchthewatchmenpartthenationalintelligencegrid herehttpsinternetfreedominiffslegalnoticetothencrbontherevisedrfpforthenationalautomatedfacialrecognitionsystem example situation person wrongfully arrested integration data cctns would lead violations rights data available natgrid afrs allows government track every movement ultimately violates fundamental rights watch watchmen look cctns third iffs new series called watch watchmen series aim look analyse looming surveillance technology threats india important documents watch watchmen series part national intelligence grid dated september linkhttpsinternetfreedominwatchthewatchmenpartthenationalintelligencegrid watch watchmen series part centralised monitoring system dated september linkhttpsinternetfreedominwatchthewatchmenseriespartthecentralisedmonitoringsystem iffs legal notice ncrb revised rfp national automated facial recognition system dated july linkhttpsinternetfreedominiffslegalnoticetothencrbontherevisedrfpforthenationalautomatedfacialrecognitionsystem help us fight mass surveillance protect privacy fundamental rights please help us sustain efforts donate us generously become member us todayhttpsinternetfreedomindonate",
    "cleaned_comments": "person arrested one police station dont want data shared reasoning isnt clear edit also would useful list experts reasoning throwaway line doesnt help case new topic op mentioned concern gt example situation person wrongfully arrested integration data cctns would lead violations rights data available natgrid afrs allows government track every movement ultimately violates fundamental rights thanks saw part doesnt explain reasoning behind throwaway line hence comment proposed solution works rightfully arrested doesnt work wrongfully arrested cryptic hard time understanding issues maybe dumb follow internet freedom india says time get gist couldnt articulate issue others theres definitely gap knowledge problem alone trying understand posts without anyway close getting clear picture either post self explanatory engagement op clarify usually posts vague discussions op topics best thing dont understand something ask next time internet freedom posts ask questions posts make aware potential issues want understand look elsewhere value awareness raise always upvote dont find time inclination needed research afterwards theres lot things happening difficult informed especially since mainstream media busy chasing trps currently trying understand recent farm bill issue point looking media explanation issue usually interpretation wrong motivated better check original sources case best check proposals linked post directly read documents agreed dont think ill invest time patience needed wade bureaucratic legalese understandable pity posts like doesnt help understand issue police still say fir cant registered crime committed different police station jurisdiction isnt problem resolved network like excuse would gone hi read linked blogposts natgrid amp afrs may able understand linking cctns projects raises privacy concerns went well cohesive argument could explain think cohesive would help us resolving doubt",
    "light_cleaned_title": "Watch the Watchmen Series Part 3 : The Crime and Criminal Tracking Network System",
    "light_cleaned_selftext": "# tl;dr The [**Crime and Criminal Tracking Network System (CCTNS)**](https://ncrb.gov.in/en/crime-and-criminal-tracking-network-systems-cctns) aims to connect police stations across the country to increase ease of access to data related to FIR registration, investigation and chargesheets in all police stations. # History Like [**NATGRID**](https://internetfreedom.in/watch-the-watchmen-part-1-the-national-intelligence-grid/) and [**CMS**](https://internetfreedom.in/watch-the-watchmen-series-part-2-the-centralised-monitoring-system/), CCTNS was also developed in the aftermath of the 26/11 Mumbai terror attacks by then Home Minister P. Chidambaram to strengthen the internal security architecture of the country. [**The pilot testing of the Core Application Software (CAS) was started in 15 locations across Assam, Kerala and Uttar Pradesh, from 1st October 2011.**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=149698&amp;lsno=15)The testing continued till January, 2013. During the testing, the Ministry of Home Affairs (MHA)/National Crime Records Bureau (NCRB) closely monitored the progress and collected the feedback for issue resolution. [**The pilot launch of CCTNS was done by the Ministry of Home Affairs (MHA) on January 4, 2013 at New Delhi.** ](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=143583&amp;lsno=15) [**The Crime and Criminal Tracking Network and Systems (CCTNS) Project was originally scheduled to be implemented by March, 2015.** ](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=38262&amp;lsno=16)The implementation of CCTNS is being done in a phased manner and has faced consistent delays. According to the [**CCTNS**](https://ncrb.gov.in/en/crime-and-criminal-tracking-network-systems-cctns) Pragati Dashboard [**Report dated July 31, 2020**](https://ncrb.gov.in/sites/default/files/PRAGATI_Dashboard-July2020.pdf), overall implementation of the project is currently at 77.8%. On January 1, 2019, in [**response**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=76816&amp;lsno=16) to a parliamentary question the then Minister of State in the Ministry Of Home Affairs, Shri Hansraj Gangaram Ahir stated that, “The Crime and Criminal Tracking Network and Systems (CCTNS) has been rolled out nationally and as on 30.11.2018, it has been deployed in 14764 police stations in the country.” [**The total estimated cost of this Project is 2000 Crore INR during the 11th Five Year Plan**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=98553&amp;lsno=15)and the actual expenditure as on [**March 6, 2018**](http://164.100.24.220/loksabhaquestions/annex/14/AU1742.pdf) is 1451.398 crore INR. # What is CCTNS? The CCTNS was envisaged as a system which would help police stations across the country to [**“talk”**](https://indianexpress.com/article/explained/cctns-project-to-let-police-stations-talk-where-it-stands-and-how-it-can-help-fight-crime/) to each other. [**The aim of the project is to digitise all information related to FIRs registered, cases investigated, and charge sheets filed in all police stations, in order to develop a national database of crime and criminals.**](https://indianexpress.com/article/explained/cctns-project-to-let-police-stations-talk-where-it-stands-and-how-it-can-help-fight-crime/) This project, which is proposed to be implemented as a [**Mission Mode Project under the National e-Governance Plan (NeGP)**](https://ncrb.gov.in/en/crime-and-criminal-tracking-network-systems-cctns) of Govt. of India, [**aims at creating a comprehensive and integrated system for enhancing the efficiency and effectiveness of policing at police station level through adoption of principles of e-Governance by creation of a nationwide networked infrastructure for evolution of IT-enabled state-of–the-art tracking system around “investigation of crime and detection of criminals”.** ](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=98553&amp;lsno=15)The [**National Crime Records Bureau is the nodal project implementation agency**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=136657&amp;lsno=15) for review, monitoring and coordination of the project under the overall guidance of the Ministry of Home Affairs. On December 8, 2015, in [**response**](http://loksabhaph.nic.in/Questions/QResult15.aspx?qref=25621&amp;lsno=16) to a parliamentary question, the then Minister Of State In The Ministry Of Home Affairs, Shri Haribhai Parathibhai Chaudhary stated the aim of the project as under: &gt;To fully computerise the process of crime registration, investigation, prosecution etc. in all police stations in the country &gt; &gt;To create a central database to provide national level search facility as well as crime analytics for use by police and central agencies &gt; &gt;To electronically share data/information among Police Stations &amp; Police Higher Offices &gt; &gt;Computerisation of all prisons and provision of necessary hardware, software etc. &gt; &gt;To provide citizen services through a Citizen Portal &gt; &gt;Sharing of Crime and Criminal related data with Police, Prosecution, Courts, Prison and Forensics leading to Integrated Criminal Justice System # What are the privacy concerns surrounding CCTNS? CCTNS is being implemented in the country without a data protection law in place. This leads to privacy concerns because the CCTNS is proposed to be integrated with various projects such the [**National Intelligence Grid (NATGRID)**](https://www.thehindu.com/news/national/natgrid-to-have-access-to-database-that-links-around-14000-police-stations/article32058643.ece) and the [**National Automated Facial Recognition System (AFRS)**](https://www.hindustantimes.com/india-news/home-ministry-moves-to-get-automated-facial-recognition-system-for-police/story-AfPOydDwKwz0leTt3t4WvI.html). Integration of the CCTNS with these projects would thus allow the state to create complete profiles of citizens. Both these projects have been red-flagged by privacy experts and civil society organisations as potential tools of mass surveillance in the hands of the state. (Read [**here**](https://internetfreedom.in/watch-the-watchmen-part-1-the-national-intelligence-grid/) and [**here**](https://internetfreedom.in/iffs-legal-notice-to-the-ncrb-on-the-revised-rfp-for-the-national-automated-facial-recognition-system/)) For example, in a situation where a person has been wrongfully arrested, the integration of their data into the CCTNS would lead to further violations of their rights. This is because their data is now available to the NATGRID and the AFRS. This allows the government to track their every movement and ultimately violates their fundamental rights. # Who will ‘watch the watchmen’? This look into CCTNS is the third in IFF’s new series called Watch the Watchmen. Through this series we aim to look into and analyse the looming surveillance technology threats in India. # Important Documents 1. Watch the Watchmen Series Part 1 : The National Intelligence Grid dated September 2, 2020 ([**link**](https://internetfreedom.in/watch-the-watchmen-part-1-the-national-intelligence-grid/)) 2. Watch the Watchmen Series Part 2 : The Centralised Monitoring System dated September 14, 2020 ([**link**](https://internetfreedom.in/watch-the-watchmen-series-part-2-the-centralised-monitoring-system/)) 3. IFF's Legal Notice to the NCRB on the Revised RFP for the National Automated Facial Recognition System dated July 15, 2020 ([**link**](https://internetfreedom.in/iffs-legal-notice-to-the-ncrb-on-the-revised-rfp-for-the-national-automated-facial-recognition-system/)) [Help us fight mass surveillance and protect your privacy and fundamental rights. Please help us sustain our efforts and donate to us generously and become a member with us today.](https://internetfreedom.in/donate)",
    "light_cleaned_comments": "So if a person has been arrested in one police station you don’t want the data to be shared? Why? The reasoning isn’t clear. Edit: also it would be useful to list the experts and their reasoning why. Just a throwaway line doesn’t help the case I am new to this topic but OP mentioned this as a concern: &gt; For example, in a situation where a person has been wrongfully arrested, the integration of their data into the CCTNS would lead to further violations of their rights. This is because their data is now available to the NATGRID and the AFRS. This allows the government to track their every movement and ultimately violates their fundamental rights. Thanks I saw that. But that part doesn’t explain why and the reasoning behind it. It is just a throwaway line. Hence my comment. And is the proposed solution works for rightfully arrested but doesn’t work for wrongfully arrested? It’s very cryptic I have a hard time understanding all these issues. Maybe I am too dumb to follow what Internet Freedom India says most of the time. I get the gist but I couldn't articulate the issue to others so there's definitely a gap in my knowledge. it is not your problem alone, I have been trying to understand these posts myself without anyway close to getting a clear picture. Either the post has to be self explanatory or there has to be an engagement by OP to clarify. Usually the posts are vague and there are no discussions by OP on these topics. The best thing to do if you don’t understand something is to ask! So next time internet freedom posts ask questions. These posts make me aware of potential issues but if I want to understand them, I have to look elsewhere. I value the awareness they raise so I always upvote them. But I don't find the time or inclination to do the needed research afterwards. There's a lot of things happening and it's difficult to be informed especially since the mainstream media is busy chasing TRPs. I am currently trying to understand the recent farm bill issue. No point looking at the media for explanation of any issue. Usually the interpretation is wrong or motivated. Better to check the original sources. In this case it is best to check the proposals linked in the post and directly read the documents. Agreed. But I don't think I'll invest the time and patience needed to wade through bureaucratic legalese. Understandable. More the pity that posts like this doesn’t help understand the issue Police will still say FIR can't be registered as crime was committed in a different police station jurisdiction. /s Isn’t that problem be resolved when you have a network like this? That excuse would be gone Hi, if you read the linked blogposts for NATGRID &amp; AFRS, you may be able to understand why linking CCTNS with these projects raises privacy concerns. I went over that as well. It is not a cohesive argument. If you could explain why you think its not cohesive, that would help us in resolving your doubt."
}