{
    "id": "16xxw9d",
    "title": "Which religious procession is being taken out in which stones are being pelted at the mosque while raising slogans of Jai Shri Ram?",
    "url": "https://twitter.com/azizkavish/status/1708584885328527389",
    "selftext": "Which religious procession is being taken out in which stones are being pelted at the mosque while raising slogans of Jai Shri Ram?\nDuring the religious visit, DSP Swarna Prabhat himself is raising the slogan of Jai Shri Ram on the mic and is also getting those who throw stones at the mosque to do so.\nCase of Gopalganj Hathua of Bihar\n@yadavtejashwi\n \n@NitishKumar\n There is no BJP government in Bihar, yet such cases come every day..",
    "flair": "Crime",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1696256382.0,
    "convurl": "https://external-preview.redd.it/l1sv5mFpvevjl1vTwtzd6KoOmGtkl0UxLdjvuNIyulE.jpg?auto=webp&s=a0d65532b75bc52ae021ce0c118e252d33d7aea4",
    "comments": [],
    "cleaned_text": "religious procession taken stones pelted mosque raising slogans jai shri ram religious procession taken stones pelted mosque raising slogans jai shri ram religious visit dsp swarna prabhat raising slogan jai shri ram mic also getting throw stones mosque case gopalganj hathua bihar yadavtejashwi nitishkumar bjp government bihar yet cases come every day ",
    "cleaned_title": "religious procession taken stones pelted mosque raising slogans jai shri ram",
    "cleaned_selftext": "religious procession taken stones pelted mosque raising slogans jai shri ram religious visit dsp swarna prabhat raising slogan jai shri ram mic also getting throw stones mosque case gopalganj hathua bihar yadavtejashwi nitishkumar bjp government bihar yet cases come every day",
    "cleaned_comments": "",
    "light_cleaned_title": "Which religious procession is being taken out in which stones are being pelted at the mosque while raising slogans of Jai Shri Ram?",
    "light_cleaned_selftext": "Which religious procession is being taken out in which stones are being pelted at the mosque while raising slogans of Jai Shri Ram? During the religious visit, DSP Swarna Prabhat himself is raising the slogan of Jai Shri Ram on the mic and is also getting those who throw stones at the mosque to do so. Case of Gopalganj Hathua of Bihar @yadavtejashwi @NitishKumar There is no BJP government in Bihar, yet such cases come every day..",
    "light_cleaned_comments": ""
}