{
    "id": "14vmvk3",
    "title": "Modi’s ‘rouble wise rupee foolish’ policy",
    "url": "https://www.thehindu.com/opinion/op-ed/modis-rouble-wise-rupee-foolish-policy/article67060537.ece",
    "selftext": "Before Jumping to defend just by seeing the headline, please read through the Article and have an understanding of what is being said. \n\n\"This is what former Prime Minister Dr. Manmohan Singh had warned more than a year ago, in The Hindu. In essence, just when China was threatening to trample India, the Modi government’s foolhardy headline hunting geo-economic strategy has helped lift China’s foot and place it on India’s neck.\"\n\nExcerpts from the Article:\n\"\nChina is squatting on India’s territory in the Northeast and has threatened its sovereign integrity. It came close to waging a war against India during the pandemic. It is not in India’s interests to help China’s ascendancy, so one would expect India to not aid and abet China’s desire to move global trade settlements from the dollar to the yuan. But shockingly, this is precisely what it is doing — paying for its own foreign trade in yuan.\n\nThe Modi government’s myopic geo-economic strategy has boxed India into a corner where it is now forced to help China to the detriment of its own interests. After economic sanctions were imposed by the West against Russia for the Ukraine war, the Modi government decided not to support the sanctions and instead buy Russian oil, because it was apparently available at a discount. The External Affairs and Petroleum Ministers made chest-thumping announcements about how doing so would help the common Indian with lower fuel prices and inflation. Since the war began, India has imported 15 times more oil from Russia (compared to the previous year), worth $44 billion, money that presumably can be used by Russia to prolong the war.\n\nThere was one hitch in this saga – how would India pay Russia for the oil? Normally, it would have paid Russia in U.S. dollars, as it does for most of its foreign trade. But due to U.S. sanctions, Russia could not accept this. Russia could have accepted payment in roubles, but this was not favourable to India, since the value of roubles could no longer be efficiently determined by the currency markets. A bilateral arrangement to establish a mutual value between the rupee and the rouble was mooted, but this would hark India back to the pre-liberalisation days of bilateral currency arrangements. India would have liked to pay in rupees but this was not conducive to Russia because, contrary to the bombastic claims of the Reserve Bank of India, Indian rupee is neither an international nor a trusted currency, especially after bizarre policies such as demonetisation. China sensed an opportunity in this conundrum and given its proximity to Russia, the yuan has emerged as the currency to settle India’s purchase of Russian oil.\n\nIf India can settle Russian trade in yuan, what stops China from demanding settlements for India-China trade in yuan? India-China trade has grown four times in the last decade and is one-sided, with India importing seven times more from China than it exports. China is India’s second largest trading partner while India is only China’s 13th largest partner. In this context, it will be hard for India to refuse or resist a potential Chinese demand for trade settlement in yuan. If India starts to use yuan for a sizeable proportion of its trade, it would provide a big fillip to China’s ambitions to dominate the new world order. This is what former Prime Minister Dr. Manmohan Singh had warned more than a year ago, in The Hindu. In essence, just when China was threatening to trample India, the Modi government’s foolhardy headline hunting geo-economic strategy has helped lift China’s foot and place it on India’s neck.\"",
    "flair": "Policy/Economy",
    "score": 22,
    "num_comments": 4,
    "created_utc": 1688973904.0,
    "convurl": "https://external-preview.redd.it/lIx6JiEwTwQFwQNpKBXPj8pBjn7RU_mizNcVyibMelM.jpg?auto=webp&s=82ebfb19f55f68ce5d93674885d4158434d9a70a",
    "comments": [
        "gobi wanted mota bhai to earn some side income and now we are fucked"
    ],
    "cleaned_text": "modis rouble wise rupee foolish policy jumping defend seeing headline please read article understanding said former prime minister dr manmohan singh warned year ago hindu essence china threatening trample india modi governments foolhardy headline hunting geoeconomic strategy helped lift chinas foot place indias neck excerpts article china squatting indias territory northeast threatened sovereign integrity came close waging war india pandemic indias interests help chinas ascendancy one would expect india aid abet chinas desire move global trade settlements dollar yuan shockingly precisely paying foreign trade yuan modi governments myopic geoeconomic strategy boxed india corner forced help china detriment interests economic sanctions imposed west russia ukraine war modi government decided support sanctions instead buy russian oil apparently available discount external affairs petroleum ministers made chestthumping announcements would help common indian lower fuel prices inflation since war began india imported times oil russia compared previous year worth billion money presumably used russia prolong war one hitch saga would india pay russia oil normally would paid russia us dollars foreign trade due us sanctions russia could accept russia could accepted payment roubles favourable india since value roubles could longer efficiently determined currency markets bilateral arrangement establish mutual value rupee rouble mooted would hark india back preliberalisation days bilateral currency arrangements india would liked pay rupees conducive russia contrary bombastic claims reserve bank india indian rupee neither international trusted currency especially bizarre policies demonetisation china sensed opportunity conundrum given proximity russia yuan emerged currency settle indias purchase russian oil india settle russian trade yuan stops china demanding settlements indiachina trade yuan indiachina trade grown four times last decade onesided india importing seven times china exports china indias second largest trading partner india chinas th largest partner context hard india refuse resist potential chinese demand trade settlement yuan india starts use yuan sizeable proportion trade would provide big fillip chinas ambitions dominate new world order former prime minister dr manmohan singh warned year ago hindu essence china threatening trample india modi governments foolhardy headline hunting geoeconomic strategy helped lift chinas foot place indias neck ",
    "cleaned_title": "modis rouble wise rupee foolish policy",
    "cleaned_selftext": "jumping defend seeing headline please read article understanding said former prime minister dr manmohan singh warned year ago hindu essence china threatening trample india modi governments foolhardy headline hunting geoeconomic strategy helped lift chinas foot place indias neck excerpts article china squatting indias territory northeast threatened sovereign integrity came close waging war india pandemic indias interests help chinas ascendancy one would expect india aid abet chinas desire move global trade settlements dollar yuan shockingly precisely paying foreign trade yuan modi governments myopic geoeconomic strategy boxed india corner forced help china detriment interests economic sanctions imposed west russia ukraine war modi government decided support sanctions instead buy russian oil apparently available discount external affairs petroleum ministers made chestthumping announcements would help common indian lower fuel prices inflation since war began india imported times oil russia compared previous year worth billion money presumably used russia prolong war one hitch saga would india pay russia oil normally would paid russia us dollars foreign trade due us sanctions russia could accept russia could accepted payment roubles favourable india since value roubles could longer efficiently determined currency markets bilateral arrangement establish mutual value rupee rouble mooted would hark india back preliberalisation days bilateral currency arrangements india would liked pay rupees conducive russia contrary bombastic claims reserve bank india indian rupee neither international trusted currency especially bizarre policies demonetisation china sensed opportunity conundrum given proximity russia yuan emerged currency settle indias purchase russian oil india settle russian trade yuan stops china demanding settlements indiachina trade yuan indiachina trade grown four times last decade onesided india importing seven times china exports china indias second largest trading partner india chinas th largest partner context hard india refuse resist potential chinese demand trade settlement yuan india starts use yuan sizeable proportion trade would provide big fillip chinas ambitions dominate new world order former prime minister dr manmohan singh warned year ago hindu essence china threatening trample india modi governments foolhardy headline hunting geoeconomic strategy helped lift chinas foot place indias neck",
    "cleaned_comments": "gobi wanted mota bhai earn side income fucked",
    "light_cleaned_title": "Modi’s ‘rouble wise rupee foolish’ policy",
    "light_cleaned_selftext": "Before Jumping to defend just by seeing the headline, please read through the Article and have an understanding of what is being said. \"This is what former Prime Minister Dr. Manmohan Singh had warned more than a year ago, in The Hindu. In essence, just when China was threatening to trample India, the Modi government’s foolhardy headline hunting geo-economic strategy has helped lift China’s foot and place it on India’s neck.\" Excerpts from the Article: \" China is squatting on India’s territory in the Northeast and has threatened its sovereign integrity. It came close to waging a war against India during the pandemic. It is not in India’s interests to help China’s ascendancy, so one would expect India to not aid and abet China’s desire to move global trade settlements from the dollar to the yuan. But shockingly, this is precisely what it is doing — paying for its own foreign trade in yuan. The Modi government’s myopic geo-economic strategy has boxed India into a corner where it is now forced to help China to the detriment of its own interests. After economic sanctions were imposed by the West against Russia for the Ukraine war, the Modi government decided not to support the sanctions and instead buy Russian oil, because it was apparently available at a discount. The External Affairs and Petroleum Ministers made chest-thumping announcements about how doing so would help the common Indian with lower fuel prices and inflation. Since the war began, India has imported 15 times more oil from Russia (compared to the previous year), worth $44 billion, money that presumably can be used by Russia to prolong the war. There was one hitch in this saga – how would India pay Russia for the oil? Normally, it would have paid Russia in U.S. dollars, as it does for most of its foreign trade. But due to U.S. sanctions, Russia could not accept this. Russia could have accepted payment in roubles, but this was not favourable to India, since the value of roubles could no longer be efficiently determined by the currency markets. A bilateral arrangement to establish a mutual value between the rupee and the rouble was mooted, but this would hark India back to the pre-liberalisation days of bilateral currency arrangements. India would have liked to pay in rupees but this was not conducive to Russia because, contrary to the bombastic claims of the Reserve Bank of India, Indian rupee is neither an international nor a trusted currency, especially after bizarre policies such as demonetisation. China sensed an opportunity in this conundrum and given its proximity to Russia, the yuan has emerged as the currency to settle India’s purchase of Russian oil. If India can settle Russian trade in yuan, what stops China from demanding settlements for India-China trade in yuan? India-China trade has grown four times in the last decade and is one-sided, with India importing seven times more from China than it exports. China is India’s second largest trading partner while India is only China’s 13th largest partner. In this context, it will be hard for India to refuse or resist a potential Chinese demand for trade settlement in yuan. If India starts to use yuan for a sizeable proportion of its trade, it would provide a big fillip to China’s ambitions to dominate the new world order. This is what former Prime Minister Dr. Manmohan Singh had warned more than a year ago, in The Hindu. In essence, just when China was threatening to trample India, the Modi government’s foolhardy headline hunting geo-economic strategy has helped lift China’s foot and place it on India’s neck.\"",
    "light_cleaned_comments": "gobi wanted mota bhai to earn some side income and now we are fucked"
}