{
    "id": "16uhfks",
    "title": "Was Nehru really a bad PM?",
    "url": "https://www.reddit.com/r/india/comments/16uhfks/was_nehru_really_a_bad_pm/",
    "selftext": "Was scrolling and saw a bit by Abhijit Chavda (who I thought was a credible person) who states that Nehru denied Kennedy's offer of nuclear bomb much before China in 1960s.\nhttps://youtube.com/shorts/CTWbuQMEbcw?si=WlnFq-fVhe4cZ9z1\n\nThis didn't sound right to me because the Kennedy government was notoriously in bed with Pakistan during that time. So I googled and saw many articles supporting Chavda's claim. Except all the articles are based on based on former foreign secretary MK Rasgotra's assertion that Kennedy offered India help in developing nuclear bombs and Nehru refused. The problem is that Rasgotra was the Indian foreign secretary in the Rajiv Gandhi government, a good 20 years after Nehru's death.\n\nAnd also I found this:In April 1948, within a year of Independence, India passed the Atomic Energy Act that led to the creation of Indian Atomic Energy Commission (IAEC). At that time Nehru said: \"We must develop this atomic energy quite apart from war — indeed I think we must develop it for the purpose of using it for peaceful purposes. Of course, if we are compelled as a nation to use it for other purposes, possibly no pious sentiments of any of us will stop the nation from using it that way.\" (Weapons of Peace, Raj Chengappa, HarperCollins Publishers India, pg 79)\n\nWhat are your thoughts? Is all of India's bad plight due to a man who died 50 years ago?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695911066.0,
    "convurl": "https://external-preview.redd.it/MMR4UJtL1a7duC95Nnrsj10T9ApMw-dL7IkEDzfI9b0.jpg?auto=webp&s=1a5713b032f59caa82dcdf0e14ccc6ad2c09245f",
    "comments": [
        "No.",
        "I'am not a congress supporter , but let me let you this , Nehru is the best PM in India's history , and nobody's going to top that ever , because you'll never get back the political climate of 1947.  \nTo me he is the embodiment of what Modern India envisioned to be , progressive, secular , socialist that's why Sangh parivar made it their agenda to delete his entire existence and character assassinate him, don't give into the propaganda....",
        "The current chaddi gang just wants to defame him and project their leader as the best in everyone's minds. That is what is happening right now.",
        "USA didn't help their allies such as France to build their nuclear weapons. And now these clowns are thinking the US was willing to help India to build nuclear weapons. 😂😂",
        "Nehru did best as he can. He opposed captalism, he doesnt want to allign with neither U.S. nor Russia. It makes sense at that time. India was very poor so he felt being socalist is right choice and doesnt want to puppet state of neither U.S. nor Russia. \n\nThe problem there is no credible opposition during his tenure which meant there is somewhat complacecy. Only if we had two strong parties from get go so that each would have kept other in check",
        "This Chavda Guy is a fraud.\n\nHe claims to be a theoretical physicist and geopolitics expert, has qualification in none.\n\nCheck out Meghnad video where he goes in details about his credentials.\n\nhttps://youtu.be/AV8NhJcNBb0?si=ADROlocXfpPKzIAR",
        "As someone who has voted for BJP, Nehru is one of the best. On the other hand his daughter. Indira Gandhi is the absolute worst. She is the exact representation of a dumb person who somehow got to rule India .",
        "There is no PM who you can consider faultless.. Nehru was mostly good and steered the country in the right direction. He might have made some mistakes which are easy to judge in hindsight but at that moment those decisions would have made sense.\n\nAny other leader as PM could have avoided the mistakes Nehru made but he or she would have made mistakes of their own.",
        "Chaddi is a fraud. Thats all. Read english dailies, not such frauds.",
        "Absolutely not. When a country is formed and has to last, in the initial era, everybody should be on one side. We had a razor thin unity between everyone. There was no sense of a Unified Indian Subcontinent in the regular people mind's when there were a billion issues to hog their minds like less food, divided and uncontrollable populace, poverty etc. We needed no-one, absolutely no one to fan the flames. \n\nAbout the point OP is making, that is not true. US helping India? They didn't assist France for the cause, which was already an ally that helped in their struggle for independence. No way in hell they were gonna help us.",
        "Chawda is your typical Society WhatsApp Uncle Gyaani.",
        "Not the worst. Their were horrible things going on. But not the worst.",
        "She screwed up the economy on levels which cannot be described. IMO she is also responsible for the massive rise in corruption",
        "As society progresses the actions committed yesterday become barbaric compared to today.",
        "Nehru was a great PM, probably the best. He is the reason Democracy took root in India. That alone is his greatest achievement.",
        "Lol yeah everyone was just handing things to India, like security council seat, nuclear weapons, Kashmir. Silly Nehru just said no.",
        "Nehru was a good person. No one is questioning his intentions. \n\nBut he was rather stupid. Too much power landed on this person's lap.",
        "Even that Keerthi woman who claims to be a history grad, has made up facts about Nehru. One video I saw was of Operation Polo. She has blatantly lied that Nehru left the country and while Sardar patel was the PM in the meanwhile, he took up the operation and acted on his own",
        "Chavda guy just spews nonsense. I started listening to his podcast on Beer Biceps channel. He was starting with all knowledge in the world has been stolen from vedas, that was the point where i disliked the video and u subscribed.",
        "Nehru's big mistake, IMO, was thinking that cooperation with China would be easy. He did eventually learn from that as well.\n\nBut ther'es a lot of modern chaddis who have been happily making use of his legacy while claiming he doesn't have one.",
        "It shouldn't be underestimated what a big deal it was for him to gain international respect, too, in an era when non-Europeans were seen as backwards and incapable of self-governance.",
        "Good job actually breaking down facts !! There is so much of misinformation about Nehru now in the last 10 years which make it seem as if he was some fumbling jumbling clown who just did bad things for India. And then they say that see all the issues we are faced with now, are because of Nehru. And it is so easy to speak bakwas nowadays and people will just believe it. 99.9% won't go and verify it like you did.",
        "> states that Nehru denied Kennedy's offer of nuclear bomb much before China in 1960s.\n\nKennedy was the US president from 1961 to 1963. Not sure how he could have offered to do that.",
        "would recommend the book 'the long game' if u haven't read it already. describes the timeline of India china relations and how india improved its strategy over time very well.",
        "Then which party do you support?",
        "i share similar opinion. the kind of challenges country faced in the beginning were so unique and far more challenging and while handling those he still devoted energy towards IITs, IIMs, ISI(statistics), atomic energy, isro, etc.\n\npeople really seem to underestimate the first decade of independence, it could go really really wrong if not for apt leadership. Pakistan is the example of that.",
        "I know I shit on Nehru a lot for not doing enough as the first PM of newly independent India but I do understand the challenges he faced while governing this country. Since we are such a diverse country, he had to balance a lot of interests and can't tackle many issues head on and had to compromise. Yet, in my opinion he laid a solid foundation for this nation. Being non-aligned is still the best decision.",
        "When Nehru became the PM, india was the collection of princely states who wanted their own independence. We had a King in Kashmir, Nizam in Hyderabad etc and they had to deal with not only enemies from outside but also inside with an empty treasury and non existent army.\n\nI would say they did whatever they could to start with, If I had to compare witht eh current PM who couldn't solve Manipur riots, invasion by china with overflowing funds and one of the worlds finest military force... I think you have your answer.",
        "Replace Nehru with Modi and read again.",
        "He has a theoretical physicist\nBut he does a have a theoretical degree in physics",
        "Haha Meghnads video are informative and entertaining, the guy should really get more views!",
        "dude, nations are fucked, it's just more roman games",
        "These Chaddis are a special breed of retard, they read in history books that Priencely states like J&K had choice to join India or Pakistan, but J & K had complex situation, during independence Sheikh Abdullah of Kashmir valley who was Nehru's friend and Congress supporter was arrested by Hari Singh, because of his skirmish against some Muslim groups of Jammu who wanted to join pakistan. After Independence Nehru asked Hari Singh to sign instrument of accession and free Abdullah. Hari Singh was indecisive. \n\nAfter pakistani invaded kashmir valley, Nehru sent Mountbatten to J&K, but Hari Singh was still indecisive, sent Mountbatten to play golf and see sighting tours.\n\nNehru also appealed to UN on Mountbattens suggestion.\n\nYet chaddis somehow put all blames on Nehru.",
        "Independent India had trouble with putting food on the table and this person is talking about nukes. What would have been the benefits of nukes anyway? We live in this post revisionist version of history nowadays. Where anyday a loudmouth can come diss on achievements of the past.\n\nPeople take them from granted, India didn't disintegrate or fell into a dictatorship at that time. Built IITs and implemented green revolution. These laid the foundations of modern India. It is easy to look in the past from what we have on, but think of what we had then and what base we were starting from. A country recovering of pain of partition as for one, did we need wars or help build platform for fellow people to succeed?\n\nChavda is a revisionist, with sanghi background.",
        "there was a lot of opposition in Congress itself against Nehru, his China policy suffered due to that.",
        "Chawda kbse credible hone laga?",
        "that was also a lot to do with the generals and the foreign minister, china initially wanted a truce. India's forward policy backfired",
        "Domestically, he did good. External affairs, he got unlucky/misjudged some major things.",
        "He’s the best PM India has had till now.",
        "She was a package deal. Her achievements are as impressive as her blunders.",
        "Oh nice thanks, haven't read that one.",
        "Everyone can be a bad PM cos the altnerate is a hypothesis",
        "Chawda means wider",
        "Lavda ka degree hai chavda ke pass",
        "> When a country is formed and has to last, in the initial era, everybody should be on one side.  ... We needed no-one, absolutely no one to fan the flames. \n\nThis is bullshit and how dictatorships are formed. On the other hand, India did have lots of voices at the state level from early on, which is why we survived and remained a democracy. It's true that congress dominated but without credible local multicultural opposition we'd never have survived, and something like the 1975 emergency would have made us a dictatorship.",
        "No /r/Nehruvian",
        "Nehru’s masterstroke\n  Non aligned movement\n\n  Got elections done in 1952 He was elected for the interim     govt in ‘47 and still pushed for a election after constitution was ratified\n\n  Creation of iits iims and aims\n\n  Empowering homi J bhabha\n\nHis failure came as he trusted China a country who was suffering similar to India and he thought both can grow together",
        "He was the better ones during his time. We cannot compare him in today's context. Just one thing about him that I don't like is his brand of socialism. Other than that he was okayish in everything",
        "To answer your question, \"Was Nehru really a bad PM?\"\n\nNehru was an amazing PM. He was a master of keeping people together and maneuvering his way through beaureaucracy. He could very easily have become a chancellor/dictator but ensured that we have free and fair elections.  The only big mistake he made during his PM tenure was in understanding China. Leading a broke and broken nation is a very very difficult task and we were lucky to have Nehru, very lucky.",
        "FNV reference FTW.",
        "> Nehru was obviously famously in bed with the concept of Soviet Union. \n\nwhy do you say that? Nehru was neither opposed to capitalism nor was he a communist. The Communists in India believed that the Congress was pro-capitalist, as it was funded by the large business families of the Birlas and Tatas. The Communists were also the primary opposition to the Congress at the time. In fact, [the first country Nehru visited was the USA in 1949](https://theprint.in/theprint-essential/nehrus-1949-goodwill-tour-of-us-how-it-opened-a-new-chapter-in-bilateral-relations/913362/), visiting [USSR only in 1955](https://theprint.in/theprint-essential/nehrus-1949-goodwill-tour-of-us-how-it-opened-a-new-chapter-in-bilateral-relations/913362/). Moreover, Nehru was also adamantly against any kind of Authoritarianism, even critiquing his popularity publicly saying \"[We want no Caesars](https://caravanmagazine.in/vantage/want-no-caesars-nehrus-warning)\". [He criticized the Soviets when they invaded Hungary](https://www.nytimes.com/1956/11/20/archives/nehru-sharpens-soviet-criticism-on-advice-of-leading-indians-he.html). Yes, he adopted the 5 year plans of the Soviet system, but the 5 year plans also turned the largely agrarian Imperial Russia into an Industrial, literate country within 20 years. \n\n[Further reading](https://web.archive.org/web/20220520034200/https://www.thehindu.com/society/nehru-set-the-foundation-for-indo-soviet-friendship-but-never-let-it-cloud-his-judgement/article65417128.ece)",
        "Bro gets his history education from Abhijeet Chhavda 💀\nHope you don't become history teacher in your future..",
        "🤣",
        "Bhaatsep aankill 🤣",
        "Himalayan Blunder Hardcover – by J. P. Dalvi \n\nAmazon description:\n\n> The Indian military setback against the Chinese attack in 1962 was high time for an honest soul-searching. Quite a few books written by Army officers have tried to tell their version of the untold story. Brig. Dalvi's account of the Sino-Indian War is by far the most remarkable and authentic. He was present in the theatre of war throughout, commanded a brigade and was held captive by the Chinese for seven months. In discussing the day-to-day events from September 8 to October 20, 1962 the author graphically tells the truth which only an actual participant could experience and know. The background of the war is drawn from his first-hand information as a high-ranking commander.",
        "These people think retardation is a super strength. Wtf",
        "No, he was not. he had his faults but considering the time that he lived in, the actions that he took, he was undoubtedly an excellent PM. \n\nHe took on the role of a leader when the country was poor, population was uneducated and cultural and tensions were high.",
        "Nehru could have easily proclaimed himself as president for life as Democracy was novel concept as per usual practice of time. But he restrained himself and that’s enough for him to surpass Bhodiji by an infinite margin",
        "The only country they have ever helped on this level is the UK",
        "Israel?",
        "Read _Malevolent Republic_",
        "When a country is being formed there should always be a single voice at the top. The character of that leader decides if the country can become a democracy or devolve into a dictatorship. Obviously the presence of a loud and local multicultural opposition helps but that is it. It helps. If the leader of that infant country is corrupt and evil enough, that opposition can be crushed ruthlessly and violently. It is only the character of the leader that decides route a country is to take. A country which is as diverse as ours a strongman or a perceived one was needed at the upper echelons of the government. A sensible and thoughtful one helped. \n\nThe 1975 emergency wouldn't have made us a dictatorship. Because that emergency was lifted by Indira herself. She could have just not ended the emergency. She was clamping down on the opposition hard till the end parts of the emergency. \n\nI completely understand your point though. That this one man show could have gone very wrong but in a country like ours only one voice was needed. Look at the country even now, South doesn't trust the North, East is doing it's own shit, Kashmir is still tattered, Middle India has still not gotten it's shit together. This is after 75 years of being together. Think about the differences when we were actually formed. The chaos that could have happened if opposition was ready to wrestle the power and were to end at no means. It would have been a disaster.",
        "If want want learn indian history read books not watch youtube",
        "The emergency was lifted because Indira lost the 77 election. Everyone was against her, the people were against her, eventually the army would have gone against her if she'd kept on. That's entirely because there was opposition and it was successful and because the systems were in place. But maybe if she was PM and called for emergency in 55 instead of 75, the country could have gone a different route, so we're lucky we had someone like Nehru and not Indira or Modi at the helm then. That said I think you discount the size and plurality of India - there was opposition to Nehru (eg. Swatantra party, old BJP = Jan Sangh, regional parties) and people would not have taken it lying down even then. It was probably because of the respect Nehru deservedly got that the congress was dominant so long.",
        "Not public if they had any american help , whereas in the case of the British they even buy the only missiles carrying their nukes from the Americans",
        "His grandson was the worst.",
        "I disagree. Rajiv is much better. He's more corrupt than Indira but I despise incompetence more than corruption. If it has to be corruption, then the Telugu dude would be best",
        "No, Israel did not receive **ANY** assistance with nuclear weapons from America. The Israeli weapons program came from both the UK and France.  The Brits did not even know they we assisting a weapons program.",
        ">The only country they have ever helped on this level is the UK\n\nThis is incorrect.  The Americans did everything in their power to stop the Brits from gaining nuclear weapons. After 1946 they thought they would have a monopoly for years. \n\nDespite almost half the people working on the Manhattan Project being Brits or Europeans based in Britain.  In 1946 there was a total ban on information sharing in nuclear material with **ANYONE**.\n\nIn fact, Klaus Fuchs, the famous nuclear spy for the USSR was one the major people that got the UK a working nuclear weapon.",
        "The US did not share its nuclear weapons tech with any country lmao.\n\nOh and then there's the stupid claim on Nehru's refusal of UNSC seat offer for India.\n\nI mean, c'mon. Nehru had his share of bad decisions, biggest of which was trusting China - but he was otherwise not stupid.",
        "Are you for real man. Please read about Emergency then. Coz Indira definitely announced the elections herself. In am Emergency even the General Election goes on hold if the PM wants. That's why after the 1971 GE, the next happened in 1977. She herself announced that the election was gonna happen. She lifted the emergency. Lost the election.",
        "> Only if we had the perfect multi-party democracy from the precarious point in history that is the creation of a country\n\nI mean you're not wrong, Nehru wrote against himself under a pseudonym because he felt he was too popular and too well loved. I'd argue he was deserving of that popularity.\n\nThe legitimate problems we lay at Nehru's feet were only proved to be mistakes in hindsight. Having an ayush ministry that promotes pseudoscience or failing to do a census or murdering your own citizens or securing international deals for your capitalist masters at the cost of your country's interests are mistakes easily avoided.\n\nBy focusing on Nehru, Chavda wants to justify these mistakes.",
        "This. The thing you have to remember is that any Indian, with any level of clout on social media, is constantly under pressure from the regime to spread their propaganda. At the very least, it's financial pressure (oppose the regime and your finding dries up and say things in favor of the regime and you can make bank). But worse than that, they're always the threat of some bogus case being filed against you. \n\nThis, btw, goes well beyond influencers. The entire media ecosystem including news channels, newspapers, online only sources and even Bollywood etc are constantly working under such pressures.",
        "Also he claimed the sati system was optional ?",
        "Chadva using the same trick like sadguru and many others... In India if you Looks posh speak good English and bombard people with info even if it's not correct about the subject which most people don't know about .. they tend to believe you . Only few people cross check the info but rest believe it like it's a gospel from the prophet lol",
        "Nehru is the greatest PM the country has seen. Sure he made many mistakes during his tenure but task of governing a post Independence India was simply gargantuan. He was the one who pioneered many of the developments which we simply take for granted now including infrastructure such as dams, power plants, steel plants, formation of IITs, and encouraging growth of manufacturing. The country could have easily disintegrated into several smaller constituents at the hands of a lesser leader.",
        "Well he did fuck up the north eastern states.",
        "They didn't help even UK. They had to make their own explosive lenses.",
        "Every PM had good and bad sides. Nehru was the first PM and he died almost 60 years back.\n\nEver wondered which discussion you’re being diverted from by continuously talking about Nehru? Who does this debate help?",
        "Repeating a comment I made in a previous post:\nNehru was, is, will always remain the greatest post-independence Indian citizen ever, not just the greatest PM but the greatest Indian ever...his contributions are too much to ignore.\n\nWe need to vehemently counter the muck and propaganda thrown at him by cow urine drinking hindutva terrorists",
        "No, US wanted a monopoly on nuclear weapons. But Clement Atlee was adamant about the British nuclear arson. Since they already have inside information about the Manhattan project (A lot of British scientists and engineers were part of the project.) it was relatively easier for the British.",
        "Democracy, dissociation of state and military, india's non-aligned policy, forming all significant institutions and many more.",
        "Never said they helped build the bomb , but they sure gave them nuclear submarine tech and till date all submarine launched nuclear missiles which britain has ever deployed have been american . Kept the comment ambiguous, because I knew they helped with nuclear delivery mechanisms but wasn't sure they helped with the bomb itself",
        "Is M K Rasgotra - who served for decades before retiring as a Foreign secretary under Indira Gandhi and Rajiv Gandhi a fraud? \n\nBecause he was the one who actually stated this:\n\nhttps://economictimes.indiatimes.com/news/defence/Nehrus-no-to-Kennedys-offer-for-nuclear-detonation-reason-behind-impaired-India-China-relations/articleshow/52775121.cms",
        "I will not argue with you as you stated \"but they sure gave them nuclear submarine tech and till date all submarine launched nuclear missiles\".  No, they did not. America sold the subs at a very high price for older nuclear technology.  If they did not the Brits may have purchased either French equipment or developed their own independent systems.  \n\nApart from the billions that GE Electric Boat received, having another competitive system was not acceptable. \n\nAustralia is doing exactly the same thing currently.  Australia is buying up to 12 nuclear attack submarines for over USD 250 Billion.  Australia does not want nuclear weapons but the subs will be equipped with stand-off missiles with ranges up to 3,000 km.\n\nAustralia originally purchased French subs but switched to UK/USA boats after spending nearly $4 billion with the French.",
        "\"Gave it\" to them was wrong terminology, sold it to them would have been better .\n The case of the UK and Australia is not the same , UK built and designed their own sub based on the nuclear propulsion tech the Americans provided , Australia has no intention of doing so , they will be building the subs but the design will be a largely british one as it was their new SSN class that was renamed AUKUS  with american nuclear propulsion tech , with minimal technical contribution from Australia and Australia will not get to place any nukes on its submarine launched missiles",
        "The biggest gap I have in knowledge is that era between father and daughter. People blame her and I think she can take some of it, but I am really clueless about the economy and growth between those two. Because economy under Nehru actually grew quite steadily, but by the time it came to daughter we had fully become License Raj. Surely she can't have fucked it up all on her own.",
        "Do you prefer other brands of socialism? Or don't like socialism in general? What specific pars do you dislike?",
        "Nehru did refuse the seat and his reasoning was that it was offered not as an additional seat, but to replace China - one of the actual victors of WW2.",
        "Bro, there is no degree in theoretical physics that you can get. It's a specialisation that one does, most universities around the world don't call them Theoretical physics degree. They are masters courses where you specialize in math courses to solve theory problems of physics. \n\nAnd the dude states that he does research in everything from cosmology, study of the universe, basically GTR related topics and quantum mechanics as well. I have never seen a professor who specializes in both of these things. Those profs are usually the best in the world and have so many papers published in peer reviewed journals with very high number of citations as well as a very high h-index and this dude only has 1 and that too is second author. \n\nDon't give these quacks any attention.",
        "Abhijeeth Chavda is a retard.  I watched his video on CY -3 his opening comments were that ISRO never revealed why CY 2 failed hence lots of possibilities and then went off into a tangent that Chinese could have hacked the lander to crash.\n\nAround two weeks before his video, ISRO on Telivision , revealed the exact reason of crash of CY 2 and what changes had been made in CY 3 to negate the possibility of crash like CY2.\n\nThey had released papers pertaining the same info many months prior too but he doesn't really care about facts",
        "I don't think exclusively socialist policies even work, the govt should carry on its socialist activites but at the same time people capitalism and encourage wealth creators and not hassle them. For ex : free or cheap ration and education, healthcare etc is great but for govt to be involved in literally everything is dumb. Private entities were not even allowed to participate in some sectors. Nehru's socialism had all the flaws of socials but very few pros.",
        "Very true, although I would add a lack of competition initially allowed for long drawn Five Year Plans to take place. 90s Economic liberation wouldn't have been successful if our farming, animal husbandary, oil refining were unproductive. Meanwhile today those developments have gotten appropriated or encroached by cronies and to them production is extracted by cutting worker rights, and not from innovation.\n\nIt's easy to say Nehru or Indira were dictators while ignoring some benefits that got enabled over those decades. That all said though, leaders were well learned back then and there was better political discourse, something which is absent in Modi's dictatorship and will be absent in any future dictatorship by any party. A more comprehensive Five-year plan on Education was needed immediately post partition to avoid today's education standards being woefully lacking.",
        "I'd suggest starting with https://en.wikipedia.org/wiki/The_Archaeology_of_Knowledge, a book on Functional History. Especially in context of India where people fall into confirming and identity biases and end up reading \"history\" books from PN Oak",
        "You do you lol. She called the election because she thought she would win. Emergency ended day after her huge loss which she hadnt foreseen.",
        "All these famous guys are closet Sanghis. Nehru was the best PM and built modern India. If he was allowed to continue, we would be #1 in GDP today and would be a superpower far ahead of China.",
        "Imagine being a PM of a nation with worst literacy rate, extreme poverty, not much food production, no infrastructure, only some 2000 civil servant and compare him to any PM after him lol. Nehru can never be compared to anybody Period.",
        "nri aankill"
    ],
    "cleaned_text": "nehru really bad pm scrolling saw bit abhijit chavda thought credible person states nehru denied kennedys offer nuclear bomb much china didnt sound right kennedy government notoriously bed pakistan time googled saw many articles supporting chavdas claim except articles based based former foreign secretary mk rasgotras assertion kennedy offered india help developing nuclear bombs nehru refused problem rasgotra indian foreign secretary rajiv gandhi government good years nehrus death also found thisin april within year independence india passed atomic energy act led creation indian atomic energy commission iaec time nehru said must develop atomic energy quite apart war indeed think must develop purpose using peaceful purposes course compelled nation use purposes possibly pious sentiments us stop nation using way weapons peace raj chengappa harpercollins publishers india pg thoughts indias bad plight due man died years ago ",
    "cleaned_title": "nehru really bad pm",
    "cleaned_selftext": "scrolling saw bit abhijit chavda thought credible person states nehru denied kennedys offer nuclear bomb much china didnt sound right kennedy government notoriously bed pakistan time googled saw many articles supporting chavdas claim except articles based based former foreign secretary mk rasgotras assertion kennedy offered india help developing nuclear bombs nehru refused problem rasgotra indian foreign secretary rajiv gandhi government good years nehrus death also found thisin april within year independence india passed atomic energy act led creation indian atomic energy commission iaec time nehru said must develop atomic energy quite apart war indeed think must develop purpose using peaceful purposes course compelled nation use purposes possibly pious sentiments us stop nation using way weapons peace raj chengappa harpercollins publishers india pg thoughts indias bad plight due man died years ago",
    "cleaned_comments": "iam congress supporter let let nehru best pm indias history nobodys going top ever youll never get back political climate embodiment modern india envisioned progressive secular socialist thats sangh parivar made agenda delete entire existence character assassinate dont give propaganda current chaddi gang wants defame project leader best everyones minds happening right usa didnt help allies france build nuclear weapons clowns thinking us willing help india build nuclear weapons nehru best opposed captalism doesnt want allign neither us russia makes sense time india poor felt socalist right choice doesnt want puppet state neither us russia problem credible opposition tenure meant somewhat complacecy two strong parties get go would kept check chavda guy fraud claims theoretical physicist geopolitics expert qualification none check meghnad video goes details credentials someone voted bjp nehru one best hand daughter indira gandhi absolute worst exact representation dumb person somehow got rule india pm consider faultless nehru mostly good steered country right direction might made mistakes easy judge hindsight moment decisions would made sense leader pm could avoided mistakes nehru made would made mistakes chaddi fraud thats read english dailies frauds absolutely country formed last initial era everybody one side razor thin unity everyone sense unified indian subcontinent regular people minds billion issues hog minds like less food divided uncontrollable populace poverty etc needed noone absolutely one fan flames point op making true us helping india didnt assist france cause already ally helped struggle independence way hell gon na help us chawda typical society whatsapp uncle gyaani worst horrible things going worst screwed economy levels described imo also responsible massive rise corruption society progresses actions committed yesterday become barbaric compared today nehru great pm probably best reason democracy took root india alone greatest achievement lol yeah everyone handing things india like security council seat nuclear weapons kashmir silly nehru said nehru good person one questioning intentions rather stupid much power landed persons lap even keerthi woman claims history grad made facts nehru one video saw operation polo blatantly lied nehru left country sardar patel pm meanwhile took operation acted chavda guy spews nonsense started listening podcast beer biceps channel starting knowledge world stolen vedas point disliked video u subscribed nehrus big mistake imo thinking cooperation china would easy eventually learn well theres lot modern chaddis happily making use legacy claiming doesnt one shouldnt underestimated big deal gain international respect era noneuropeans seen backwards incapable selfgovernance good job actually breaking facts much misinformation nehru last years make seem fumbling jumbling clown bad things india say see issues faced nehru easy speak bakwas nowadays people believe wont go verify like states nehru denied kennedys offer nuclear bomb much china kennedy us president sure could offered would recommend book long game u havent read already describes timeline india china relations india improved strategy time well party support share similar opinion kind challenges country faced beginning unique far challenging handling still devoted energy towards iits iims isistatistics atomic energy isro etc people really seem underestimate first decade independence could go really really wrong apt leadership pakistan example know shit nehru lot enough first pm newly independent india understand challenges faced governing country since diverse country balance lot interests cant tackle many issues head compromise yet opinion laid solid foundation nation nonaligned still best decision nehru became pm india collection princely states wanted independence king kashmir nizam hyderabad etc deal enemies outside also inside empty treasury non existent army would say whatever could start compare witht eh current pm couldnt solve manipur riots invasion china overflowing funds one worlds finest military force think answer replace nehru modi read theoretical physicist theoretical degree physics haha meghnads video informative entertaining guy really get views dude nations fucked roman games chaddis special breed retard read history books priencely states like jk choice join india pakistan j k complex situation independence sheikh abdullah kashmir valley nehrus friend congress supporter arrested hari singh skirmish muslim groups jammu wanted join pakistan independence nehru asked hari singh sign instrument accession free abdullah hari singh indecisive pakistani invaded kashmir valley nehru sent mountbatten jk hari singh still indecisive sent mountbatten play golf see sighting tours nehru also appealed un mountbattens suggestion yet chaddis somehow put blames nehru independent india trouble putting food table person talking nukes would benefits nukes anyway live post revisionist version history nowadays anyday loudmouth come diss achievements past people take granted india didnt disintegrate fell dictatorship time built iits implemented green revolution laid foundations modern india easy look past think base starting country recovering pain partition one need wars help build platform fellow people succeed chavda revisionist sanghi background lot opposition congress nehru china policy suffered due chawda kbse credible hone laga also lot generals foreign minister china initially wanted truce indias forward policy backfired domestically good external affairs got unluckymisjudged major things hes best pm india till package deal achievements impressive blunders oh nice thanks havent read one everyone bad pm cos altnerate hypothesis chawda means wider lavda ka degree hai chavda ke pass country formed last initial era everybody one side needed noone absolutely one fan flames bullshit dictatorships formed hand india lots voices state level early survived remained democracy true congress dominated without credible local multicultural opposition wed never survived something like emergency would made us dictatorship rnehruvian nehrus masterstroke non aligned movement got elections done elected interim govt still pushed election constitution ratified creation iits iims aims empowering homi j bhabha failure came trusted china country suffering similar india thought grow together better ones time compare todays context one thing dont like brand socialism okayish everything answer question nehru really bad pm nehru amazing pm master keeping people together maneuvering way beaureaucracy could easily become chancellordictator ensured free fair elections big mistake made pm tenure understanding china leading broke broken nation difficult task lucky nehru lucky fnv reference ftw nehru obviously famously bed concept soviet union say nehru neither opposed capitalism communist communists india believed congress procapitalist funded large business families birlas tatas communists also primary opposition congress time fact first country nehru visited usa httpstheprintintheprintessentialnehrusgoodwilltourofushowitopenedanewchapterinbilateralrelations visiting ussr httpstheprintintheprintessentialnehrusgoodwilltourofushowitopenedanewchapterinbilateralrelations moreover nehru also adamantly kind authoritarianism even critiquing popularity publicly saying want caesarshttpscaravanmagazineinvantagewantnocaesarsnehruswarning criticized soviets invaded hungaryhttpswwwnytimescomarchivesnehrusharpenssovietcriticismonadviceofleadingindianshehtml yes adopted year plans soviet system year plans also turned largely agrarian imperial russia industrial literate country within years readinghttpswebarchiveorgwebhttpswwwthehinducomsocietynehrusetthefoundationforindosovietfriendshipbutneverletitcloudhisjudgementarticleece bro gets history education abhijeet chhavda hope dont become history teacher future bhaatsep aankill himalayan blunder hardcover j p dalvi amazon description indian military setback chinese attack high time honest soulsearching quite books written army officers tried tell version untold story brig dalvis account sinoindian war far remarkable authentic present theatre war throughout commanded brigade held captive chinese seven months discussing daytoday events september october author graphically tells truth actual participant could experience know background war drawn firsthand information highranking commander people think retardation super strength wtf faults considering time lived actions took undoubtedly excellent pm took role leader country poor population uneducated cultural tensions high nehru could easily proclaimed president life democracy novel concept per usual practice time restrained thats enough surpass bhodiji infinite margin country ever helped level uk israel read malevolent republic country formed always single voice top character leader decides country become democracy devolve dictatorship obviously presence loud local multicultural opposition helps helps leader infant country corrupt evil enough opposition crushed ruthlessly violently character leader decides route country take country diverse strongman perceived one needed upper echelons government sensible thoughtful one helped emergency wouldnt made us dictatorship emergency lifted indira could ended emergency clamping opposition hard till end parts emergency completely understand point though one man show could gone wrong country like one voice needed look country even south doesnt trust north east shit kashmir still tattered middle india still gotten shit together years together think differences actually formed chaos could happened opposition ready wrestle power end means would disaster want want learn indian history read books watch youtube emergency lifted indira lost election everyone people eventually army would gone shed kept thats entirely opposition successful systems place maybe pm called emergency instead country could gone different route lucky someone like nehru indira modi helm said think discount size plurality india opposition nehru eg swatantra party old bjp jan sangh regional parties people would taken lying even probably respect nehru deservedly got congress dominant long public american help whereas case british even buy missiles carrying nukes americans grandson worst disagree rajiv much better hes corrupt indira despise incompetence corruption corruption telugu dude would best israel receive assistance nuclear weapons america israeli weapons program came uk france brits even know assisting weapons program country ever helped level uk incorrect americans everything power stop brits gaining nuclear weapons thought would monopoly years despite almost half people working manhattan project brits europeans based britain total ban information sharing nuclear material anyone fact klaus fuchs famous nuclear spy ussr one major people got uk working nuclear weapon us share nuclear weapons tech country lmao oh theres stupid claim nehrus refusal unsc seat offer india mean cmon nehru share bad decisions biggest trusting china otherwise stupid real man please read emergency coz indira definitely announced elections emergency even general election goes hold pm wants thats ge next happened announced election gon na happen lifted emergency lost election perfect multiparty democracy precarious point history creation country mean youre wrong nehru wrote pseudonym felt popular well loved id argue deserving popularity legitimate problems lay nehrus feet proved mistakes hindsight ayush ministry promotes pseudoscience failing census murdering citizens securing international deals capitalist masters cost countrys interests mistakes easily avoided focusing nehru chavda wants justify mistakes thing remember indian level clout social media constantly pressure regime spread propaganda least financial pressure oppose regime finding dries say things favor regime make bank worse theyre always threat bogus case filed btw goes well beyond influencers entire media ecosystem including news channels newspapers online sources even bollywood etc constantly working pressures also claimed sati system optional chadva using trick like sadguru many others india looks posh speak good english bombard people info even correct subject people dont know tend believe people cross check info rest believe like gospel prophet lol nehru greatest pm country seen sure made many mistakes tenure task governing post independence india simply gargantuan one pioneered many developments simply take granted including infrastructure dams power plants steel plants formation iits encouraging growth manufacturing country could easily disintegrated several smaller constituents hands lesser leader well fuck north eastern states didnt help even uk make explosive lenses every pm good bad sides nehru first pm died almost years back ever wondered discussion youre diverted continuously talking nehru debate help repeating comment made previous post nehru always remain greatest postindependence indian citizen ever greatest pm greatest indian everhis contributions much ignore need vehemently counter muck propaganda thrown cow urine drinking hindutva terrorists us wanted monopoly nuclear weapons clement atlee adamant british nuclear arson since already inside information manhattan project lot british scientists engineers part project relatively easier british democracy dissociation state military indias nonaligned policy forming significant institutions many never said helped build bomb sure gave nuclear submarine tech till date submarine launched nuclear missiles britain ever deployed american kept comment ambiguous knew helped nuclear delivery mechanisms wasnt sure helped bomb k rasgotra served decades retiring foreign secretary indira gandhi rajiv gandhi fraud one actually stated argue stated sure gave nuclear submarine tech till date submarine launched nuclear missiles america sold subs high price older nuclear technology brits may purchased either french equipment developed independent systems apart billions ge electric boat received another competitive system acceptable australia exactly thing currently australia buying nuclear attack submarines usd billion australia want nuclear weapons subs equipped standoff missiles ranges km australia originally purchased french subs switched ukusa boats spending nearly billion french gave wrong terminology sold would better case uk australia uk built designed sub based nuclear propulsion tech americans provided australia intention building subs design largely british one new ssn class renamed aukus american nuclear propulsion tech minimal technical contribution australia australia get place nukes submarine launched missiles biggest gap knowledge era father daughter people blame think take really clueless economy growth two economy nehru actually grew quite steadily time came daughter fully become license raj surely cant fucked prefer brands socialism dont like socialism general specific pars dislike nehru refuse seat reasoning offered additional seat replace china one actual victors ww bro degree theoretical physics get specialisation one universities around world dont call theoretical physics degree masters courses specialize math courses solve theory problems physics dude states research everything cosmology study universe basically gtr related topics quantum mechanics well never seen professor specializes things profs usually best world many papers published peer reviewed journals high number citations well high hindex dude second author dont give quacks attention abhijeeth chavda retard watched video cy opening comments isro never revealed cy failed hence lots possibilities went tangent chinese could hacked lander crash around two weeks video isro telivision revealed exact reason crash cy changes made cy negate possibility crash like cy released papers pertaining info many months prior doesnt really care facts dont think exclusively socialist policies even work govt carry socialist activites time people capitalism encourage wealth creators hassle ex free cheap ration education healthcare etc great govt involved literally everything dumb private entities even allowed participate sectors nehrus socialism flaws socials pros true although would add lack competition initially allowed long drawn five year plans take place economic liberation wouldnt successful farming animal husbandary oil refining unproductive meanwhile today developments gotten appropriated encroached cronies production extracted cutting worker rights innovation easy say nehru indira dictators ignoring benefits got enabled decades said though leaders well learned back better political discourse something absent modis dictatorship absent future dictatorship party comprehensive fiveyear plan education needed immediately post partition avoid todays education standards woefully lacking id suggest starting book functional history especially context india people fall confirming identity biases end reading history books pn oak lol called election thought would win emergency ended day huge loss hadnt foreseen famous guys closet sanghis nehru best pm built modern india allowed continue would gdp today would superpower far ahead china imagine pm nation worst literacy rate extreme poverty much food production infrastructure civil servant compare pm lol nehru never compared anybody period nri aankill",
    "light_cleaned_title": "Was Nehru really a bad PM?",
    "light_cleaned_selftext": "Was scrolling and saw a bit by Abhijit Chavda (who I thought was a credible person) who states that Nehru denied Kennedy's offer of nuclear bomb much before China in 1960s. This didn't sound right to me because the Kennedy government was notoriously in bed with Pakistan during that time. So I googled and saw many articles supporting Chavda's claim. Except all the articles are based on based on former foreign secretary MK Rasgotra's assertion that Kennedy offered India help in developing nuclear bombs and Nehru refused. The problem is that Rasgotra was the Indian foreign secretary in the Rajiv Gandhi government, a good 20 years after Nehru's death. And also I found this:In April 1948, within a year of Independence, India passed the Atomic Energy Act that led to the creation of Indian Atomic Energy Commission (IAEC). At that time Nehru said: \"We must develop this atomic energy quite apart from war — indeed I think we must develop it for the purpose of using it for peaceful purposes. Of course, if we are compelled as a nation to use it for other purposes, possibly no pious sentiments of any of us will stop the nation from using it that way.\" (Weapons of Peace, Raj Chengappa, HarperCollins Publishers India, pg 79) What are your thoughts? Is all of India's bad plight due to a man who died 50 years ago?",
    "light_cleaned_comments": "No. I'am not a congress supporter , but let me let you this , Nehru is the best PM in India's history , and nobody's going to top that ever , because you'll never get back the political climate of 1947. To me he is the embodiment of what Modern India envisioned to be , progressive, secular , socialist that's why Sangh parivar made it their agenda to delete his entire existence and character assassinate him, don't give into the propaganda.... The current chaddi gang just wants to defame him and project their leader as the best in everyone's minds. That is what is happening right now. USA didn't help their allies such as France to build their nuclear weapons. And now these clowns are thinking the US was willing to help India to build nuclear weapons. 😂😂 Nehru did best as he can. He opposed captalism, he doesnt want to allign with neither U.S. nor Russia. It makes sense at that time. India was very poor so he felt being socalist is right choice and doesnt want to puppet state of neither U.S. nor Russia. The problem there is no credible opposition during his tenure which meant there is somewhat complacecy. Only if we had two strong parties from get go so that each would have kept other in check This Chavda Guy is a fraud. He claims to be a theoretical physicist and geopolitics expert, has qualification in none. Check out Meghnad video where he goes in details about his credentials. As someone who has voted for BJP, Nehru is one of the best. On the other hand his daughter. Indira Gandhi is the absolute worst. She is the exact representation of a dumb person who somehow got to rule India . There is no PM who you can consider faultless.. Nehru was mostly good and steered the country in the right direction. He might have made some mistakes which are easy to judge in hindsight but at that moment those decisions would have made sense. Any other leader as PM could have avoided the mistakes Nehru made but he or she would have made mistakes of their own. Chaddi is a fraud. Thats all. Read english dailies, not such frauds. Absolutely not. When a country is formed and has to last, in the initial era, everybody should be on one side. We had a razor thin unity between everyone. There was no sense of a Unified Indian Subcontinent in the regular people mind's when there were a billion issues to hog their minds like less food, divided and uncontrollable populace, poverty etc. We needed no-one, absolutely no one to fan the flames. About the point OP is making, that is not true. US helping India? They didn't assist France for the cause, which was already an ally that helped in their struggle for independence. No way in hell they were gonna help us. Chawda is your typical Society WhatsApp Uncle Gyaani. Not the worst. Their were horrible things going on. But not the worst. She screwed up the economy on levels which cannot be described. IMO she is also responsible for the massive rise in corruption As society progresses the actions committed yesterday become barbaric compared to today. Nehru was a great PM, probably the best. He is the reason Democracy took root in India. That alone is his greatest achievement. Lol yeah everyone was just handing things to India, like security council seat, nuclear weapons, Kashmir. Silly Nehru just said no. Nehru was a good person. No one is questioning his intentions. But he was rather stupid. Too much power landed on this person's lap. Even that Keerthi woman who claims to be a history grad, has made up facts about Nehru. One video I saw was of Operation Polo. She has blatantly lied that Nehru left the country and while Sardar patel was the PM in the meanwhile, he took up the operation and acted on his own Chavda guy just spews nonsense. I started listening to his podcast on Beer Biceps channel. He was starting with all knowledge in the world has been stolen from vedas, that was the point where i disliked the video and u subscribed. Nehru's big mistake, IMO, was thinking that cooperation with China would be easy. He did eventually learn from that as well. But ther'es a lot of modern chaddis who have been happily making use of his legacy while claiming he doesn't have one. It shouldn't be underestimated what a big deal it was for him to gain international respect, too, in an era when non-Europeans were seen as backwards and incapable of self-governance. Good job actually breaking down facts !! There is so much of misinformation about Nehru now in the last 10 years which make it seem as if he was some fumbling jumbling clown who just did bad things for India. And then they say that see all the issues we are faced with now, are because of Nehru. And it is so easy to speak bakwas nowadays and people will just believe it. 99.9% won't go and verify it like you did. > states that Nehru denied Kennedy's offer of nuclear bomb much before China in 1960s. Kennedy was the US president from 1961 to 1963. Not sure how he could have offered to do that. would recommend the book 'the long game' if u haven't read it already. describes the timeline of India china relations and how india improved its strategy over time very well. Then which party do you support? i share similar opinion. the kind of challenges country faced in the beginning were so unique and far more challenging and while handling those he still devoted energy towards IITs, IIMs, ISI(statistics), atomic energy, isro, etc. people really seem to underestimate the first decade of independence, it could go really really wrong if not for apt leadership. Pakistan is the example of that. I know I shit on Nehru a lot for not doing enough as the first PM of newly independent India but I do understand the challenges he faced while governing this country. Since we are such a diverse country, he had to balance a lot of interests and can't tackle many issues head on and had to compromise. Yet, in my opinion he laid a solid foundation for this nation. Being non-aligned is still the best decision. When Nehru became the PM, india was the collection of princely states who wanted their own independence. We had a King in Kashmir, Nizam in Hyderabad etc and they had to deal with not only enemies from outside but also inside with an empty treasury and non existent army. I would say they did whatever they could to start with, If I had to compare witht eh current PM who couldn't solve Manipur riots, invasion by china with overflowing funds and one of the worlds finest military force... I think you have your answer. Replace Nehru with Modi and read again. He has a theoretical physicist But he does a have a theoretical degree in physics Haha Meghnads video are informative and entertaining, the guy should really get more views! dude, nations are fucked, it's just more roman games These Chaddis are a special breed of retard, they read in history books that Priencely states like J&K had choice to join India or Pakistan, but J & K had complex situation, during independence Sheikh Abdullah of Kashmir valley who was Nehru's friend and Congress supporter was arrested by Hari Singh, because of his skirmish against some Muslim groups of Jammu who wanted to join pakistan. After Independence Nehru asked Hari Singh to sign instrument of accession and free Abdullah. Hari Singh was indecisive. After pakistani invaded kashmir valley, Nehru sent Mountbatten to J&K, but Hari Singh was still indecisive, sent Mountbatten to play golf and see sighting tours. Nehru also appealed to UN on Mountbattens suggestion. Yet chaddis somehow put all blames on Nehru. Independent India had trouble with putting food on the table and this person is talking about nukes. What would have been the benefits of nukes anyway? We live in this post revisionist version of history nowadays. Where anyday a loudmouth can come diss on achievements of the past. People take them from granted, India didn't disintegrate or fell into a dictatorship at that time. Built IITs and implemented green revolution. These laid the foundations of modern India. It is easy to look in the past from what we have on, but think of what we had then and what base we were starting from. A country recovering of pain of partition as for one, did we need wars or help build platform for fellow people to succeed? Chavda is a revisionist, with sanghi background. there was a lot of opposition in Congress itself against Nehru, his China policy suffered due to that. Chawda kbse credible hone laga? that was also a lot to do with the generals and the foreign minister, china initially wanted a truce. India's forward policy backfired Domestically, he did good. External affairs, he got unlucky/misjudged some major things. He’s the best PM India has had till now. She was a package deal. Her achievements are as impressive as her blunders. Oh nice thanks, haven't read that one. Everyone can be a bad PM cos the altnerate is a hypothesis Chawda means wider Lavda ka degree hai chavda ke pass > When a country is formed and has to last, in the initial era, everybody should be on one side. ... We needed no-one, absolutely no one to fan the flames. This is bullshit and how dictatorships are formed. On the other hand, India did have lots of voices at the state level from early on, which is why we survived and remained a democracy. It's true that congress dominated but without credible local multicultural opposition we'd never have survived, and something like the 1975 emergency would have made us a dictatorship. No /r/Nehruvian Nehru’s masterstroke Non aligned movement Got elections done in 1952 He was elected for the interim govt in ‘47 and still pushed for a election after constitution was ratified Creation of iits iims and aims Empowering homi J bhabha His failure came as he trusted China a country who was suffering similar to India and he thought both can grow together He was the better ones during his time. We cannot compare him in today's context. Just one thing about him that I don't like is his brand of socialism. Other than that he was okayish in everything To answer your question, \"Was Nehru really a bad PM?\" Nehru was an amazing PM. He was a master of keeping people together and maneuvering his way through beaureaucracy. He could very easily have become a chancellor/dictator but ensured that we have free and fair elections. The only big mistake he made during his PM tenure was in understanding China. Leading a broke and broken nation is a very very difficult task and we were lucky to have Nehru, very lucky. FNV reference FTW. > Nehru was obviously famously in bed with the concept of Soviet Union. why do you say that? Nehru was neither opposed to capitalism nor was he a communist. The Communists in India believed that the Congress was pro-capitalist, as it was funded by the large business families of the Birlas and Tatas. The Communists were also the primary opposition to the Congress at the time. In fact, [the first country Nehru visited was the USA in 1949](https://theprint.in/theprint-essential/nehrus-1949-goodwill-tour-of-us-how-it-opened-a-new-chapter-in-bilateral-relations/913362/), visiting [USSR only in 1955](https://theprint.in/theprint-essential/nehrus-1949-goodwill-tour-of-us-how-it-opened-a-new-chapter-in-bilateral-relations/913362/). Moreover, Nehru was also adamantly against any kind of Authoritarianism, even critiquing his popularity publicly saying \"[We want no Caesars](https://caravanmagazine.in/vantage/want-no-caesars-nehrus-warning)\". [He criticized the Soviets when they invaded Hungary](https://www.nytimes.com/1956/11/20/archives/nehru-sharpens-soviet-criticism-on-advice-of-leading-indians-he.html). Yes, he adopted the 5 year plans of the Soviet system, but the 5 year plans also turned the largely agrarian Imperial Russia into an Industrial, literate country within 20 years. [Further reading](https://web.archive.org/web/20220520034200/https://www.thehindu.com/society/nehru-set-the-foundation-for-indo-soviet-friendship-but-never-let-it-cloud-his-judgement/article65417128.ece) Bro gets his history education from Abhijeet Chhavda 💀 Hope you don't become history teacher in your future.. 🤣 Bhaatsep aankill 🤣 Himalayan Blunder Hardcover – by J. P. Dalvi Amazon description: > The Indian military setback against the Chinese attack in 1962 was high time for an honest soul-searching. Quite a few books written by Army officers have tried to tell their version of the untold story. Brig. Dalvi's account of the Sino-Indian War is by far the most remarkable and authentic. He was present in the theatre of war throughout, commanded a brigade and was held captive by the Chinese for seven months. In discussing the day-to-day events from September 8 to October 20, 1962 the author graphically tells the truth which only an actual participant could experience and know. The background of the war is drawn from his first-hand information as a high-ranking commander. These people think retardation is a super strength. Wtf No, he was not. he had his faults but considering the time that he lived in, the actions that he took, he was undoubtedly an excellent PM. He took on the role of a leader when the country was poor, population was uneducated and cultural and tensions were high. Nehru could have easily proclaimed himself as president for life as Democracy was novel concept as per usual practice of time. But he restrained himself and that’s enough for him to surpass Bhodiji by an infinite margin The only country they have ever helped on this level is the UK Israel? Read _Malevolent Republic_ When a country is being formed there should always be a single voice at the top. The character of that leader decides if the country can become a democracy or devolve into a dictatorship. Obviously the presence of a loud and local multicultural opposition helps but that is it. It helps. If the leader of that infant country is corrupt and evil enough, that opposition can be crushed ruthlessly and violently. It is only the character of the leader that decides route a country is to take. A country which is as diverse as ours a strongman or a perceived one was needed at the upper echelons of the government. A sensible and thoughtful one helped. The 1975 emergency wouldn't have made us a dictatorship. Because that emergency was lifted by Indira herself. She could have just not ended the emergency. She was clamping down on the opposition hard till the end parts of the emergency. I completely understand your point though. That this one man show could have gone very wrong but in a country like ours only one voice was needed. Look at the country even now, South doesn't trust the North, East is doing it's own shit, Kashmir is still tattered, Middle India has still not gotten it's shit together. This is after 75 years of being together. Think about the differences when we were actually formed. The chaos that could have happened if opposition was ready to wrestle the power and were to end at no means. It would have been a disaster. If want want learn indian history read books not watch youtube The emergency was lifted because Indira lost the 77 election. Everyone was against her, the people were against her, eventually the army would have gone against her if she'd kept on. That's entirely because there was opposition and it was successful and because the systems were in place. But maybe if she was PM and called for emergency in 55 instead of 75, the country could have gone a different route, so we're lucky we had someone like Nehru and not Indira or Modi at the helm then. That said I think you discount the size and plurality of India - there was opposition to Nehru (eg. Swatantra party, old BJP = Jan Sangh, regional parties) and people would not have taken it lying down even then. It was probably because of the respect Nehru deservedly got that the congress was dominant so long. Not public if they had any american help , whereas in the case of the British they even buy the only missiles carrying their nukes from the Americans His grandson was the worst. I disagree. Rajiv is much better. He's more corrupt than Indira but I despise incompetence more than corruption. If it has to be corruption, then the Telugu dude would be best No, Israel did not receive **ANY** assistance with nuclear weapons from America. The Israeli weapons program came from both the UK and France. The Brits did not even know they we assisting a weapons program. >The only country they have ever helped on this level is the UK This is incorrect. The Americans did everything in their power to stop the Brits from gaining nuclear weapons. After 1946 they thought they would have a monopoly for years. Despite almost half the people working on the Manhattan Project being Brits or Europeans based in Britain. In 1946 there was a total ban on information sharing in nuclear material with **ANYONE**. In fact, Klaus Fuchs, the famous nuclear spy for the USSR was one the major people that got the UK a working nuclear weapon. The US did not share its nuclear weapons tech with any country lmao. Oh and then there's the stupid claim on Nehru's refusal of UNSC seat offer for India. I mean, c'mon. Nehru had his share of bad decisions, biggest of which was trusting China - but he was otherwise not stupid. Are you for real man. Please read about Emergency then. Coz Indira definitely announced the elections herself. In am Emergency even the General Election goes on hold if the PM wants. That's why after the 1971 GE, the next happened in 1977. She herself announced that the election was gonna happen. She lifted the emergency. Lost the election. > Only if we had the perfect multi-party democracy from the precarious point in history that is the creation of a country I mean you're not wrong, Nehru wrote against himself under a pseudonym because he felt he was too popular and too well loved. I'd argue he was deserving of that popularity. The legitimate problems we lay at Nehru's feet were only proved to be mistakes in hindsight. Having an ayush ministry that promotes pseudoscience or failing to do a census or murdering your own citizens or securing international deals for your capitalist masters at the cost of your country's interests are mistakes easily avoided. By focusing on Nehru, Chavda wants to justify these mistakes. This. The thing you have to remember is that any Indian, with any level of clout on social media, is constantly under pressure from the regime to spread their propaganda. At the very least, it's financial pressure (oppose the regime and your finding dries up and say things in favor of the regime and you can make bank). But worse than that, they're always the threat of some bogus case being filed against you. This, btw, goes well beyond influencers. The entire media ecosystem including news channels, newspapers, online only sources and even Bollywood etc are constantly working under such pressures. Also he claimed the sati system was optional ? Chadva using the same trick like sadguru and many others... In India if you Looks posh speak good English and bombard people with info even if it's not correct about the subject which most people don't know about .. they tend to believe you . Only few people cross check the info but rest believe it like it's a gospel from the prophet lol Nehru is the greatest PM the country has seen. Sure he made many mistakes during his tenure but task of governing a post Independence India was simply gargantuan. He was the one who pioneered many of the developments which we simply take for granted now including infrastructure such as dams, power plants, steel plants, formation of IITs, and encouraging growth of manufacturing. The country could have easily disintegrated into several smaller constituents at the hands of a lesser leader. Well he did fuck up the north eastern states. They didn't help even UK. They had to make their own explosive lenses. Every PM had good and bad sides. Nehru was the first PM and he died almost 60 years back. Ever wondered which discussion you’re being diverted from by continuously talking about Nehru? Who does this debate help? Repeating a comment I made in a previous post: Nehru was, is, will always remain the greatest post-independence Indian citizen ever, not just the greatest PM but the greatest Indian ever...his contributions are too much to ignore. We need to vehemently counter the muck and propaganda thrown at him by cow urine drinking hindutva terrorists No, US wanted a monopoly on nuclear weapons. But Clement Atlee was adamant about the British nuclear arson. Since they already have inside information about the Manhattan project (A lot of British scientists and engineers were part of the project.) it was relatively easier for the British. Democracy, dissociation of state and military, india's non-aligned policy, forming all significant institutions and many more. Never said they helped build the bomb , but they sure gave them nuclear submarine tech and till date all submarine launched nuclear missiles which britain has ever deployed have been american . Kept the comment ambiguous, because I knew they helped with nuclear delivery mechanisms but wasn't sure they helped with the bomb itself Is M K Rasgotra - who served for decades before retiring as a Foreign secretary under Indira Gandhi and Rajiv Gandhi a fraud? Because he was the one who actually stated this: I will not argue with you as you stated \"but they sure gave them nuclear submarine tech and till date all submarine launched nuclear missiles\". No, they did not. America sold the subs at a very high price for older nuclear technology. If they did not the Brits may have purchased either French equipment or developed their own independent systems. Apart from the billions that GE Electric Boat received, having another competitive system was not acceptable. Australia is doing exactly the same thing currently. Australia is buying up to 12 nuclear attack submarines for over USD 250 Billion. Australia does not want nuclear weapons but the subs will be equipped with stand-off missiles with ranges up to 3,000 km. Australia originally purchased French subs but switched to UK/USA boats after spending nearly $4 billion with the French. \"Gave it\" to them was wrong terminology, sold it to them would have been better . The case of the UK and Australia is not the same , UK built and designed their own sub based on the nuclear propulsion tech the Americans provided , Australia has no intention of doing so , they will be building the subs but the design will be a largely british one as it was their new SSN class that was renamed AUKUS with american nuclear propulsion tech , with minimal technical contribution from Australia and Australia will not get to place any nukes on its submarine launched missiles The biggest gap I have in knowledge is that era between father and daughter. People blame her and I think she can take some of it, but I am really clueless about the economy and growth between those two. Because economy under Nehru actually grew quite steadily, but by the time it came to daughter we had fully become License Raj. Surely she can't have fucked it up all on her own. Do you prefer other brands of socialism? Or don't like socialism in general? What specific pars do you dislike? Nehru did refuse the seat and his reasoning was that it was offered not as an additional seat, but to replace China - one of the actual victors of WW2. Bro, there is no degree in theoretical physics that you can get. It's a specialisation that one does, most universities around the world don't call them Theoretical physics degree. They are masters courses where you specialize in math courses to solve theory problems of physics. And the dude states that he does research in everything from cosmology, study of the universe, basically GTR related topics and quantum mechanics as well. I have never seen a professor who specializes in both of these things. Those profs are usually the best in the world and have so many papers published in peer reviewed journals with very high number of citations as well as a very high h-index and this dude only has 1 and that too is second author. Don't give these quacks any attention. Abhijeeth Chavda is a retard. I watched his video on CY -3 his opening comments were that ISRO never revealed why CY 2 failed hence lots of possibilities and then went off into a tangent that Chinese could have hacked the lander to crash. Around two weeks before his video, ISRO on Telivision , revealed the exact reason of crash of CY 2 and what changes had been made in CY 3 to negate the possibility of crash like CY2. They had released papers pertaining the same info many months prior too but he doesn't really care about facts I don't think exclusively socialist policies even work, the govt should carry on its socialist activites but at the same time people capitalism and encourage wealth creators and not hassle them. For ex : free or cheap ration and education, healthcare etc is great but for govt to be involved in literally everything is dumb. Private entities were not even allowed to participate in some sectors. Nehru's socialism had all the flaws of socials but very few pros. Very true, although I would add a lack of competition initially allowed for long drawn Five Year Plans to take place. 90s Economic liberation wouldn't have been successful if our farming, animal husbandary, oil refining were unproductive. Meanwhile today those developments have gotten appropriated or encroached by cronies and to them production is extracted by cutting worker rights, and not from innovation. It's easy to say Nehru or Indira were dictators while ignoring some benefits that got enabled over those decades. That all said though, leaders were well learned back then and there was better political discourse, something which is absent in Modi's dictatorship and will be absent in any future dictatorship by any party. A more comprehensive Five-year plan on Education was needed immediately post partition to avoid today's education standards being woefully lacking. I'd suggest starting with a book on Functional History. Especially in context of India where people fall into confirming and identity biases and end up reading \"history\" books from PN Oak You do you lol. She called the election because she thought she would win. Emergency ended day after her huge loss which she hadnt foreseen. All these famous guys are closet Sanghis. Nehru was the best PM and built modern India. If he was allowed to continue, we would be #1 in GDP today and would be a superpower far ahead of China. Imagine being a PM of a nation with worst literacy rate, extreme poverty, not much food production, no infrastructure, only some 2000 civil servant and compare him to any PM after him lol. Nehru can never be compared to anybody Period. nri aankill"
}