{
    "id": "18pd3f9",
    "title": "Yep I am never going out of my home again...",
    "url": "https://youtu.be/APIAPD67Jds?si=IIbHUiXtBmoSteZJ",
    "selftext": "I actually can't believe what I just watched tbh. Like as a girl I am actually scared for my life. How is controlling the women in your family is teaching them culture????? Is raping someone because they are wearing revealing clothes also our culture??? \n\nI seriously want to lock myself up in my home and never leave.",
    "flair": "Rant / Vent",
    "score": 19,
    "num_comments": 30,
    "created_utc": 1703359935.0,
    "convurl": "https://external-preview.redd.it/yu5tni-ewhPpPWH-9G12MzkGqfgxEyo5ABgbbzGIW0o.jpg",
    "comments": [
        "Asking 100 people and showing only the negative responses out of them does not show our culture.",
        "He should have asked this question - \"Have you felt like raping girls who are not properly dressed \" . If yes, why didn't rape that girl what stopped them.   \nI guess some of them would have confessed to few rapes.",
        "How do you know he asked 100 people or 10 people ?",
        "I have seen Indian Uncles oggling at conservatively dressed women. Something is wrong with men in North India.",
        "Yes, because you know only these were negative.",
        "I thought people knew by the age of 16 how rape culture is maintained.",
        "Un madarchodo ka kuch nhi karsakte best is to focus our resources into the young generation and generations to come",
        "Offcourse not everyone think like that but Even if a certain percent of population have this view their mindset is scary and this video is not shot in some backward area it's heart of Delhi Connaught place",
        "sahi baat hai, north india ke bahar to rape hote hi nahi hain\n\nhttps://preview.redd.it/gfslj2rcv48c1.jpeg?width=828&format=pjpg&auto=webp&s=a063627771965d032c2d23a0ca526720740ee68e",
        "This ain't even the most bizzare take some leader has said chowmin and pizza cause harmonal imbalance which cause the urge to rape lol \nhttps://www.indiatoday.in/india/story/khap-rape-chowmein-118852-2012-10-15",
        "Okay this is what I hate about leftist media, they sensationalise beyond logical bounds\n\nCase in point , **the rising rapes in India.....**\n\nAccording to [statistics ](https://www.statista.com/statistics/632493/reported-rape-cases-india/) in 2021 , **total rape cases reported were  31,677.**\n\n**Now left media will hue and cry that rape instances are increasing, but what they conviniently avoid telling is population is also increasing....**\n\nIn 2021 , the total population of [of females ](https://www.globaldata.com/data-insights/macroeconomic/female-population-in-india-2095923/) was **646 million**\n\n**So per capita rape, even if you extend the reported numbers of rape to include those cases which are never reported, this will still not even be 10%**\n\nThat means for every 100 woman in India , less than 10 woman have been raped .\n\nNow do i condemn rape, ofcourse i do, any sensible man with morals will do that. \n\n**But the propaganda which these left propogate, as if all woman in India keep getting raped everyday ,paints all of us men in poor picture, and increases distance in the community, something which these left liberals want**",
        "Yes that is the main reason Indian and pakistani men are not allowed in South Korean bar. \nAnd when Russian blogger come to India\nThey always mention one thing about our country. \n\"Women should not come to India alone. Here r@pe happens every 2 min\"\nThat is the image that our so called civilized people have made outside\nNow blame the government for that also. \nAs a proud Indian",
        "Only one reason. The criminals never get punished. Their ability to get away has only emboldened others to indulge in crime. Plus massive levels of unemployment is in general giving a rise to crime.\n\nWhat can you say when the majority of criminals are sitting in parliament and are the ones responsible for drafting laws.\n\nThis country has gone to dogs in every aspect of life.",
        "You do realize, majority of rapes dont even get reported due to dear of retaliation or the social stigma attached with it.\n\nAnd assholes like you are the primary reason who are out here spouting per capita rape numbers out of your sorry ass.",
        "Yav you are right\nBut India represents even worse than afghanistan in Western media. \nMost of the outside world think\nR@pe as a culture of Indian. They think that\nYou can r@pe any women and if women complain a file then police also h@ve a right to r@pe.\n\nI mean India has a problem but not worse than afghanistan Or somalia",
        ">You do realize, majority of rapes dont even get reported due to dear of retaliation or the social stigma attached with it.\n\nIf you had carefully read my post, i have talked about such cases as well. I am well aware of this situation.\n\nThat's why i assumed, even if you count those cases which are not reported, still it won't touch 10% \n\n>And assholes like you are the primary reason who are out here spouting per capita rape numbers out of your sorry ass.\n\nI am not here to defend rape, ofcourse any sensible man will agree that it is a crime which warrants a death penalty.\n\n**What i am against is, painting all men as potential rapist by playing around with statistics.**\n\nI am against exaggerated fear which is being spread in the society.",
        "Exactly, someone gets my point.\n\nBy playing around with statistics, India's image is purposely maligned on world stage...\n\nYes we do have a problem in India.... But the manner it is presented, as if indian men are animals, and sub human as compared to rest of the world. And as if rape is part of our culture...\n\nCase in point, the journalism by print mentioned in this post...\n\n**Now are you telling me, this man walked on streets of Delhi and could not find one decent man who would say something against rape ?**\n\n**Or were the people in his report,cherry picked among a lot of men, so as to forward a particular narrative and  an agenda**",
        "Not even close as compared to the rest of India.",
        "Ah men \nWhy you post this\"India is really a r@pe capital of world \" on Reddit?? \nYou also know there is a huge amount of racism against Indian .",
        ">That's why i assumed, even if you count those cases which are not reported, still it won't touch 10% \n\nYou really think so??? Just ask all the women around you how many of them have been subjected to some kind of sexual assault. \n\nLet me give a list of a few women I know who have been through this shit -\n1) I was SAed by a family friend when I was 14.\n2)My mother was touched inappropriately by a doctor when she was 17.\n3)My friend was also touched inappropriately when she was 10. \n4)A friend of mine was nearly raped by this guy friend of her.\n5)Another friend was raped and she tried to kill herself by drowning but was saved and in coma.\n6)My mother's sister was raped by a family member.\n7)A woman who used to work in my home was stalked and raped.\n8)A six year old little girl I knew was raped by her own father.\n9)A woman in my neighborhood was raped and threatened by her husband's friends. \n10)My grandmother was raped day after day by a family friend. \n\n\nNone of these cases were reported. I can keep going if 10 is not enough cause there are many more cases like this. Nearly all the women I know have been molested one way or another. \n\nSo please tell me how it won't touch 10%???\n\nI am not saying that all men rape yk. But most do or assault in some way. It's a truth that you have to live with cause it's true.",
        "Are you seriously worried about men being painted in a bad light while there are women being raped and killed by men????\n\nSeriously I can't with you. Yk videos like this are needed so we girls know how to keep ourselves safe cause you men definitely aren't changing.",
        "First of all, my sympathies and regrets that you faced trauma. Trust me, i am in no way justifying rape. Men like those deserve the noose..\n\nComing to argument, i have limited my conversation just to rape. It does not account for eve teasing or touching, which i am sure every woman has faced in her life..\n\nMy argument is strictly limited to rape, which is most heinous crime against women..\n\n\nLet's assume, every rape is reported, even then, how many rapes will we end up with? \n\nIn the stats, it was given 31 thousand rapes were reported . Now i am saying let's increase that number , not by 10 times, not by 100 times, but a whopping 1000 times !!\n\nStill the number you will get is 3.1 crore.... Which is still less that 10% of total woman in the country....\n\nAnd just to put in perspective, The Kumbh Mela gathering , had [9.1 million devotees according to govt data](https://www.hindustantimes.com/cities/dehradun-news/91-million-thronged-mahakumbh-despite-covid-19-surge-govt-data-101619729096750.html). Mind you this is the govt number, actual numbers would be way more...\n\n\n**So are we saying rapes in India are more than people visiting kumb mela?**\n\nIf this was true, every Indian would know one person in their vincinty who has been raped..... Now tell me is this true?\n\n**Again the point of my argument is not to trivialise rape, it's a horrendous crime and in ideal society, not even one should be there.. But i want to call out the narrative that is purposely built by misquoting data to push propaganda**",
        "I am not gonna say anything cause honestly I can't. Data is more important to you obviously so ok.",
        ">Are you seriously worried about men being painted in a bad light while there are women being raped and killed by men????\n\nYes i am,i don't want men to feel ashamed of their gender, just because of few bad apples. \n\nAnd statistically i have shown you i am right. I am sure you are biased because of your past and rightfully so, even i would have been if i was in your shoes... But just because i have an opinion, it doesn't mean it's the truth..\n\n>Yk videos like this are needed so we girls know how to keep ourselves safe cause you men definitely aren't changing.\n\nThis is the exact problem i have with such propoganda videos. \n\n**Are you telling me, this man walked around in Connaught place, one of the most crowded places in Delhi, in broad day light, and *could not find one decent guy who doesn't believe in the nonsense those men are saying*?**\n\nOr\n\n**Was he cherry picking and showing only those people who's statement confirmed to the narrative he was trying to build?**",
        "……And still get raped by a relative \n\nMajority of rapes happen by people the victim knows",
        "I can understand your anguish, and rightfully so. Please don't think i am in any way belittling your pain...\n\nBe it one or one thousand, any form of sexual assault not only affects the woman, it affects her generations to come...\n\nHaving said that, i am against the propoganda of painting all men in one brush stroke, because this shuts down even well meaning men \n\n\nThink about it, there are so many publically feminist men who speak for women rights... Name one publically known woman who has stood up for men rights except Deepika bharadwaj? \n\nAnd this is not because all woman are evil, this is because when propaganda like all men are rapist are spread, even well meaning woman who know this is bullshit, are afraid to rise and speak against crimes against men.\n\nAnd then this cycle continues....\n\nSuch bad propoganda like in the video actually affects more woman than men",
        "> Atticus Finch says, “The truth that applies to the human race and to no particular race of men. There is not a person in this courtroom who has never told a lie, who has never done an immoral thing, and there is no man living who has never looked upon a woman without desire.”  - To Kill a Mockingbird",
        "It is true that self control is needed. I wonder how to achieve more self control."
    ],
    "cleaned_text": "yep never going home actually cant believe watched tbh like girl actually scared life controlling women family teaching culture raping someone wearing revealing clothes also culture seriously want lock home never leave ",
    "cleaned_title": "yep never going home",
    "cleaned_selftext": "actually cant believe watched tbh like girl actually scared life controlling women family teaching culture raping someone wearing revealing clothes also culture seriously want lock home never leave",
    "cleaned_comments": "asking people showing negative responses show culture asked question felt like raping girls properly dressed yes didnt rape girl stopped guess would confessed rapes know asked people people seen indian uncles oggling conservatively dressed women something wrong men north india yes know negative thought people knew age rape culture maintained un madarchodo ka kuch nhi karsakte best focus resources young generation generations come offcourse everyone think like even certain percent population view mindset scary video shot backward area heart delhi connaught place sahi baat hai north india ke bahar rape hote hi nahi hain aint even bizzare take leader said chowmin pizza cause harmonal imbalance cause urge rape lol okay hate leftist media sensationalise beyond logical bounds case point rising rapes india according statistics httpswwwstatistacomstatisticsreportedrapecasesindia total rape cases reported left media hue cry rape instances increasing conviniently avoid telling population also increasing total population females httpswwwglobaldatacomdatainsightsmacroeconomicfemalepopulationinindia million per capita rape even extend reported numbers rape include cases never reported still even means every woman india less woman raped condemn rape ofcourse sensible man morals propaganda left propogate woman india keep getting raped everyday paints us men poor picture increases distance community something left liberals want yes main reason indian pakistani men allowed south korean bar russian blogger come india always mention one thing country women come india alone rpe happens every min image called civilized people made outside blame government also proud indian one reason criminals never get punished ability get away emboldened others indulge crime plus massive levels unemployment general giving rise crime say majority criminals sitting parliament ones responsible drafting laws country gone dogs every aspect life realize majority rapes dont even get reported due dear retaliation social stigma attached assholes like primary reason spouting per capita rape numbers sorry ass yav right india represents even worse afghanistan western media outside world think rpe culture indian think rpe women women complain file police also hve right rpe mean india problem worse afghanistan somalia realize majority rapes dont even get reported due dear retaliation social stigma attached carefully read post talked cases well well aware situation thats assumed even count cases reported still wont touch assholes like primary reason spouting per capita rape numbers sorry ass defend rape ofcourse sensible man agree crime warrants death penalty painting men potential rapist playing around statistics exaggerated fear spread society exactly someone gets point playing around statistics indias image purposely maligned world stage yes problem india manner presented indian men animals sub human compared rest world rape part culture case point journalism print mentioned post telling man walked streets delhi could find one decent man would say something rape people reportcherry picked among lot men forward particular narrative agenda even close compared rest india ah men post thisindia really rpe capital world reddit also know huge amount racism indian thats assumed even count cases reported still wont touch really think ask women around many subjected kind sexual assault let give list women know shit saed family friend mother touched inappropriately doctor friend also touched inappropriately friend mine nearly raped guy friend another friend raped tried kill drowning saved coma mothers sister raped family member woman used work home stalked raped six year old little girl knew raped father woman neighborhood raped threatened husbands friends grandmother raped day day family friend none cases reported keep going enough cause many cases like nearly women know molested one way another please tell wont touch saying men rape yk assault way truth live cause true seriously worried men painted bad light women raped killed men seriously cant yk videos like needed girls know keep safe cause men definitely arent changing first sympathies regrets faced trauma trust way justifying rape men like deserve noose coming argument limited conversation rape account eve teasing touching sure every woman faced life argument strictly limited rape heinous crime women lets assume every rape reported even many rapes end stats given thousand rapes reported saying lets increase number times times whopping times still number get crore still less total woman country put perspective kumbh mela gathering million devotees according govt datahttpswwwhindustantimescomcitiesdehradunnewsmillionthrongedmahakumbhdespitecovidsurgegovtdatahtml mind govt number actual numbers would way saying rapes india people visiting kumb mela true every indian would know one person vincinty raped tell true point argument trivialise rape horrendous crime ideal society even one want call narrative purposely built misquoting data push propaganda gon na say anything cause honestly cant data important obviously ok seriously worried men painted bad light women raped killed men yes ami dont want men feel ashamed gender bad apples statistically shown right sure biased past rightfully even would shoes opinion doesnt mean truth yk videos like needed girls know keep safe cause men definitely arent changing exact problem propoganda videos telling man walked around connaught place one crowded places delhi broad day light could find one decent guy doesnt believe nonsense men saying cherry picking showing people whos statement confirmed narrative trying build still get raped relative majority rapes happen people victim knows understand anguish rightfully please dont think way belittling pain one one thousand form sexual assault affects woman affects generations come said propoganda painting men one brush stroke shuts even well meaning men think many publically feminist men speak women rights name one publically known woman stood men rights except deepika bharadwaj woman evil propaganda like men rapist spread even well meaning woman know bullshit afraid rise speak crimes men cycle continues bad propoganda like video actually affects woman men atticus finch says truth applies human race particular race men person courtroom never told lie never done immoral thing man living never looked upon woman without desire kill mockingbird true self control needed wonder achieve self control",
    "light_cleaned_title": "Yep I am never going out of my home again...",
    "light_cleaned_selftext": "I actually can't believe what I just watched tbh. Like as a girl I am actually scared for my life. How is controlling the women in your family is teaching them culture????? Is raping someone because they are wearing revealing clothes also our culture??? I seriously want to lock myself up in my home and never leave.",
    "light_cleaned_comments": "Asking 100 people and showing only the negative responses out of them does not show our culture. He should have asked this question - \"Have you felt like raping girls who are not properly dressed \" . If yes, why didn't rape that girl what stopped them. I guess some of them would have confessed to few rapes. How do you know he asked 100 people or 10 people ? I have seen Indian Uncles oggling at conservatively dressed women. Something is wrong with men in North India. Yes, because you know only these were negative. I thought people knew by the age of 16 how rape culture is maintained. Un madarchodo ka kuch nhi karsakte best is to focus our resources into the young generation and generations to come Offcourse not everyone think like that but Even if a certain percent of population have this view their mindset is scary and this video is not shot in some backward area it's heart of Delhi Connaught place sahi baat hai, north india ke bahar to rape hote hi nahi hain This ain't even the most bizzare take some leader has said chowmin and pizza cause harmonal imbalance which cause the urge to rape lol Okay this is what I hate about leftist media, they sensationalise beyond logical bounds Case in point , **the rising rapes in India.....** According to [statistics ](https://www.statista.com/statistics/632493/reported-rape-cases-india/) in 2021 , **total rape cases reported were 31,677.** **Now left media will hue and cry that rape instances are increasing, but what they conviniently avoid telling is population is also increasing....** In 2021 , the total population of [of females ](https://www.globaldata.com/data-insights/macroeconomic/female-population-in-india-2095923/) was **646 million** **So per capita rape, even if you extend the reported numbers of rape to include those cases which are never reported, this will still not even be 10%** That means for every 100 woman in India , less than 10 woman have been raped . Now do i condemn rape, ofcourse i do, any sensible man with morals will do that. **But the propaganda which these left propogate, as if all woman in India keep getting raped everyday ,paints all of us men in poor picture, and increases distance in the community, something which these left liberals want** Yes that is the main reason Indian and pakistani men are not allowed in South Korean bar. And when Russian blogger come to India They always mention one thing about our country. \"Women should not come to India alone. Here r@pe happens every 2 min\" That is the image that our so called civilized people have made outside Now blame the government for that also. As a proud Indian Only one reason. The criminals never get punished. Their ability to get away has only emboldened others to indulge in crime. Plus massive levels of unemployment is in general giving a rise to crime. What can you say when the majority of criminals are sitting in parliament and are the ones responsible for drafting laws. This country has gone to dogs in every aspect of life. You do realize, majority of rapes dont even get reported due to dear of retaliation or the social stigma attached with it. And assholes like you are the primary reason who are out here spouting per capita rape numbers out of your sorry ass. Yav you are right But India represents even worse than afghanistan in Western media. Most of the outside world think R@pe as a culture of Indian. They think that You can r@pe any women and if women complain a file then police also h@ve a right to r@pe. I mean India has a problem but not worse than afghanistan Or somalia >You do realize, majority of rapes dont even get reported due to dear of retaliation or the social stigma attached with it. If you had carefully read my post, i have talked about such cases as well. I am well aware of this situation. That's why i assumed, even if you count those cases which are not reported, still it won't touch 10% >And assholes like you are the primary reason who are out here spouting per capita rape numbers out of your sorry ass. I am not here to defend rape, ofcourse any sensible man will agree that it is a crime which warrants a death penalty. **What i am against is, painting all men as potential rapist by playing around with statistics.** I am against exaggerated fear which is being spread in the society. Exactly, someone gets my point. By playing around with statistics, India's image is purposely maligned on world stage... Yes we do have a problem in India.... But the manner it is presented, as if indian men are animals, and sub human as compared to rest of the world. And as if rape is part of our culture... Case in point, the journalism by print mentioned in this post... **Now are you telling me, this man walked on streets of Delhi and could not find one decent man who would say something against rape ?** **Or were the people in his report,cherry picked among a lot of men, so as to forward a particular narrative and an agenda** Not even close as compared to the rest of India. Ah men Why you post this\"India is really a r@pe capital of world \" on Reddit?? You also know there is a huge amount of racism against Indian . >That's why i assumed, even if you count those cases which are not reported, still it won't touch 10% You really think so??? Just ask all the women around you how many of them have been subjected to some kind of sexual assault. Let me give a list of a few women I know who have been through this shit - 1) I was SAed by a family friend when I was 14. 2)My mother was touched inappropriately by a doctor when she was 17. 3)My friend was also touched inappropriately when she was 10. 4)A friend of mine was nearly raped by this guy friend of her. 5)Another friend was raped and she tried to kill herself by drowning but was saved and in coma. 6)My mother's sister was raped by a family member. 7)A woman who used to work in my home was stalked and raped. 8)A six year old little girl I knew was raped by her own father. 9)A woman in my neighborhood was raped and threatened by her husband's friends. 10)My grandmother was raped day after day by a family friend. None of these cases were reported. I can keep going if 10 is not enough cause there are many more cases like this. Nearly all the women I know have been molested one way or another. So please tell me how it won't touch 10%??? I am not saying that all men rape yk. But most do or assault in some way. It's a truth that you have to live with cause it's true. Are you seriously worried about men being painted in a bad light while there are women being raped and killed by men???? Seriously I can't with you. Yk videos like this are needed so we girls know how to keep ourselves safe cause you men definitely aren't changing. First of all, my sympathies and regrets that you faced trauma. Trust me, i am in no way justifying rape. Men like those deserve the noose.. Coming to argument, i have limited my conversation just to rape. It does not account for eve teasing or touching, which i am sure every woman has faced in her life.. My argument is strictly limited to rape, which is most heinous crime against women.. Let's assume, every rape is reported, even then, how many rapes will we end up with? In the stats, it was given 31 thousand rapes were reported . Now i am saying let's increase that number , not by 10 times, not by 100 times, but a whopping 1000 times !! Still the number you will get is 3.1 crore.... Which is still less that 10% of total woman in the country.... And just to put in perspective, The Kumbh Mela gathering , had [9.1 million devotees according to govt data](https://www.hindustantimes.com/cities/dehradun-news/91-million-thronged-mahakumbh-despite-covid-19-surge-govt-data-101619729096750.html). Mind you this is the govt number, actual numbers would be way more... **So are we saying rapes in India are more than people visiting kumb mela?** If this was true, every Indian would know one person in their vincinty who has been raped..... Now tell me is this true? **Again the point of my argument is not to trivialise rape, it's a horrendous crime and in ideal society, not even one should be there.. But i want to call out the narrative that is purposely built by misquoting data to push propaganda** I am not gonna say anything cause honestly I can't. Data is more important to you obviously so ok. >Are you seriously worried about men being painted in a bad light while there are women being raped and killed by men???? Yes i am,i don't want men to feel ashamed of their gender, just because of few bad apples. And statistically i have shown you i am right. I am sure you are biased because of your past and rightfully so, even i would have been if i was in your shoes... But just because i have an opinion, it doesn't mean it's the truth.. >Yk videos like this are needed so we girls know how to keep ourselves safe cause you men definitely aren't changing. This is the exact problem i have with such propoganda videos. **Are you telling me, this man walked around in Connaught place, one of the most crowded places in Delhi, in broad day light, and *could not find one decent guy who doesn't believe in the nonsense those men are saying*?** Or **Was he cherry picking and showing only those people who's statement confirmed to the narrative he was trying to build?** ……And still get raped by a relative Majority of rapes happen by people the victim knows I can understand your anguish, and rightfully so. Please don't think i am in any way belittling your pain... Be it one or one thousand, any form of sexual assault not only affects the woman, it affects her generations to come... Having said that, i am against the propoganda of painting all men in one brush stroke, because this shuts down even well meaning men Think about it, there are so many publically feminist men who speak for women rights... Name one publically known woman who has stood up for men rights except Deepika bharadwaj? And this is not because all woman are evil, this is because when propaganda like all men are rapist are spread, even well meaning woman who know this is bullshit, are afraid to rise and speak against crimes against men. And then this cycle continues.... Such bad propoganda like in the video actually affects more woman than men > Atticus Finch says, “The truth that applies to the human race and to no particular race of men. There is not a person in this courtroom who has never told a lie, who has never done an immoral thing, and there is no man living who has never looked upon a woman without desire.” - To Kill a Mockingbird It is true that self control is needed. I wonder how to achieve more self control."
}