{
    "id": "13uwa2g",
    "title": "My plumber asked me 800rs for this saying its \"Rare\" [Help!]",
    "url": "https://www.reddit.com/r/india/comments/13uwa2g/my_plumber_asked_me_800rs_for_this_saying_its/",
    "selftext": " \n\nI have this [water filter](https://www.amazon.in/Eureka-Forbes-Aquaguard-Countertop-Installation/dp/B09NKS8Q2V/ref=sr_1_3?crid=25UGGF79HQ43N&keywords=marvel+nxt&qid=1685367236&sprefix=marvel+nx%2Caps%2C444&sr=8-3) and want to attatch its connection to the water pipe. which usually requires one of these [connection divertors](https://www.amazon.in/GE-Filtration-Coupling-Connector-Purifier/dp/B09MFRGKBN/ref=sr_1_9?crid=34CVVP88QVY3B&keywords=water+filter+valve&qid=1685367299&sprefix=water+filter+val%2Caps%2C342&sr=8-9). got a local plumber to do the installation and he quoted me 800rs for this piece of junk. i told him he can screw off and called aquagaurds installation team to do it. they did the installation, before installation they told me this valve would cost 200rs and after installation they said 600rs. cause its apparently rare and \"branded and it is the heart of the system for the filter to function\" dei adhu oru just a piece of plastic and gunk metal connector. its not like i was too broke to pay the amount , i just didn't want to give money to these scammers. The one they came with was an extremely brittle cheap plastic one aswell.\n\ni tried getting this [filter valve](https://www.amazon.in/Stainless-Connector-Connection-Purifier-DV/dp/B09QSBVYNH/ref=sr_1_4?crid=2KFXWKX2MLIPN&keywords=water+filter+valve&qid=1685367537&sprefix=water+filter+valve%2Caps%2C293&sr=8-4) on amazon but the input pipe from the filter is too large for it .  \nthen tried getting [this one](https://www.amazon.in/gp/product/B09M7HH2RD/ref=ppx_yo_dt_b_asin_title_o06_s00?ie=UTF8&psc=1) but the pipe is too small for it  \nHere is the image with the size of the input pipe from the filter : [https://imgur.com/a/3aIGscJ](https://imgur.com/a/3aIGscJ)\n\nif anybody is familiar with the filter that i am using or this pipe size, please let me know what valve i should get for this.",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 4,
    "created_utc": 1685370121.0,
    "convurl": "https://external-preview.redd.it/9XiPtTZMPXWG3SVt-xae0VXI55F6Rvae25xJ8IFN5bc.jpg?auto=webp&v=enabled&s=26b3151c25150ece21a8332f3ee29e5159f797c0",
    "comments": [
        "Try offline market.",
        "All water filter uses similar pipes. Check local Hardware stores. You will find it easily. Also buy sealing tape(yellow/white color) and a tool to screw this in the mainline. These things are easily done you just need to start.",
        "I have changed them last month .\n\nI took the connection from my existing tap, so the coupling should match with the tap\n and the other plastic connector is of standard size.\n\nThe metal coupling costs around Rs 70 in the local market, and the plastic connector around 150-200 (it was not available at the store I went to )"
    ],
    "cleaned_text": "plumber asked rs saying rare help water filterhttpswwwamazonineurekaforbesaquaguardcountertopinstallationdpbnksqvrefsrcriduggfhqnkeywordsmarvelnxtqidsprefixmarvelnxcapscsr want attatch connection water pipe usually requires one connection divertorshttpswwwamazoningefiltrationcouplingconnectorpurifierdpbmfrgkbnrefsrcridcvvpqvybkeywordswaterfiltervalveqidsprefixwaterfiltervalcapscsr got local plumber installation quoted rs piece junk told screw called aquagaurds installation team installation installation told valve would cost rs installation said rs cause apparently rare branded heart system filter function dei adhu oru piece plastic gunk metal connector like broke pay amount didnt want give money scammers one came extremely brittle cheap plastic one aswell tried getting filter valvehttpswwwamazoninstainlessconnectorconnectionpurifierdvdpbqsbvynhrefsrcridkfxwkxmlipnkeywordswaterfiltervalveqidsprefixwaterfiltervalvecapscsr amazon input pipe filter large tried getting onehttpswwwamazoningpproductbmhhrdrefppxyodtbasintitleosieutfpsc pipe small image size input pipe filter httpsimgurcomaaigscjhttpsimgurcomaaigscj anybody familiar filter using pipe size please let know valve get ",
    "cleaned_title": "plumber asked rs saying rare help",
    "cleaned_selftext": "water filterhttpswwwamazonineurekaforbesaquaguardcountertopinstallationdpbnksqvrefsrcriduggfhqnkeywordsmarvelnxtqidsprefixmarvelnxcapscsr want attatch connection water pipe usually requires one connection divertorshttpswwwamazoningefiltrationcouplingconnectorpurifierdpbmfrgkbnrefsrcridcvvpqvybkeywordswaterfiltervalveqidsprefixwaterfiltervalcapscsr got local plumber installation quoted rs piece junk told screw called aquagaurds installation team installation installation told valve would cost rs installation said rs cause apparently rare branded heart system filter function dei adhu oru piece plastic gunk metal connector like broke pay amount didnt want give money scammers one came extremely brittle cheap plastic one aswell tried getting filter valvehttpswwwamazoninstainlessconnectorconnectionpurifierdvdpbqsbvynhrefsrcridkfxwkxmlipnkeywordswaterfiltervalveqidsprefixwaterfiltervalvecapscsr amazon input pipe filter large tried getting onehttpswwwamazoningpproductbmhhrdrefppxyodtbasintitleosieutfpsc pipe small image size input pipe filter httpsimgurcomaaigscjhttpsimgurcomaaigscj anybody familiar filter using pipe size please let know valve get",
    "cleaned_comments": "try offline market water filter uses similar pipes check local hardware stores find easily also buy sealing tapeyellowwhite color tool screw mainline things easily done need start changed last month took connection existing tap coupling match tap plastic connector standard size metal coupling costs around rs local market plastic connector around available store went",
    "light_cleaned_title": "My plumber asked me 800rs for this saying its \"Rare\" [Help!]",
    "light_cleaned_selftext": "I have this [water filter](https://www.amazon.in/Eureka-Forbes-Aquaguard-Countertop-Installation/dp/B09NKS8Q2V/ref=sr_1_3?crid=25UGGF79HQ43N&keywords=marvel+nxt&qid=1685367236&sprefix=marvel+nx%2Caps%2C444&sr=8-3) and want to attatch its connection to the water pipe. which usually requires one of these [connection divertors](https://www.amazon.in/GE-Filtration-Coupling-Connector-Purifier/dp/B09MFRGKBN/ref=sr_1_9?crid=34CVVP88QVY3B&keywords=water+filter+valve&qid=1685367299&sprefix=water+filter+val%2Caps%2C342&sr=8-9). got a local plumber to do the installation and he quoted me 800rs for this piece of junk. i told him he can screw off and called aquagaurds installation team to do it. they did the installation, before installation they told me this valve would cost 200rs and after installation they said 600rs. cause its apparently rare and \"branded and it is the heart of the system for the filter to function\" dei adhu oru just a piece of plastic and gunk metal connector. its not like i was too broke to pay the amount , i just didn't want to give money to these scammers. The one they came with was an extremely brittle cheap plastic one aswell. i tried getting this [filter valve](https://www.amazon.in/Stainless-Connector-Connection-Purifier-DV/dp/B09QSBVYNH/ref=sr_1_4?crid=2KFXWKX2MLIPN&keywords=water+filter+valve&qid=1685367537&sprefix=water+filter+valve%2Caps%2C293&sr=8-4) on amazon but the input pipe from the filter is too large for it . then tried getting [this one](https://www.amazon.in/gp/product/B09M7HH2RD/ref=ppx_yo_dt_b_asin_title_o06_s00?ie=UTF8&psc=1) but the pipe is too small for it Here is the image with the size of the input pipe from the filter : [https://imgur.com/a/3aIGscJ](https://imgur.com/a/3aIGscJ) if anybody is familiar with the filter that i am using or this pipe size, please let me know what valve i should get for this.",
    "light_cleaned_comments": "Try offline market. All water filter uses similar pipes. Check local Hardware stores. You will find it easily. Also buy sealing tape(yellow/white color) and a tool to screw this in the mainline. These things are easily done you just need to start. I have changed them last month . I took the connection from my existing tap, so the coupling should match with the tap and the other plastic connector is of standard size. The metal coupling costs around Rs 70 in the local market, and the plastic connector around 150-200 (it was not available at the store I went to )"
}