{
    "id": "1erusow",
    "title": "So now late running trains are called \"Rescheduled\" trains ?",
    "url": "https://www.reddit.com/gallery/1erusow",
    "selftext": "Train was late by over 9 hours and was terminated early. I know Indian Railways dont value their customers time and think they are doing a favour to the people by offering passenger services. But should they not pay fine in the form of partial refunding of ticket within 24 hours of arriving ?",
    "flair": "Rant / Vent",
    "score": 31,
    "num_comments": 3,
    "created_utc": 1723617873.0,
    "convurl": "https://i.redd.it/ggru1n3vskid1.jpg",
    "comments": [
        "Yep !\n\nA protectionist govt. wants to do away with all the data and data points that can be used to anticipate the internals of the indian market/stock exchange.\n\nFor eg. Lets say if you wanted to pitch investors food catering - \n\nhaldiram serving on 100 trains out of which 60 are 'delayed' doesnt sound invest'able to investers (indian or abroad) \n\nBUT \n\nhaldiram serving to 100 trains Out of which 60 are 'rescheduled' is still kind of ok to look at.\n\nWhile you might see such a simple thing as stupid. Its actually a deeper play.\n\nNow imagine how invest'able indian market would be globally, had they released poverty data, bpl data, etc.\n\nIt looks simple, but its supercomplex. To get to know what $hit india is in, economically.",
        "Targeting the definition is a major issue. Fast train, superfast train definitions are all bad. Poverty definition has changed.",
        "Yeah 'invest'ability' in india as a market has been made a joke of.\n\nAnd services are destroyed completely, to make a new definition that suits a particular narrative"
    ],
    "cleaned_text": "late running trains called rescheduled trains train late hours terminated early know indian railways dont value customers time think favour people offering passenger services pay fine form partial refunding ticket within hours arriving ",
    "cleaned_title": "late running trains called rescheduled trains",
    "cleaned_selftext": "train late hours terminated early know indian railways dont value customers time think favour people offering passenger services pay fine form partial refunding ticket within hours arriving",
    "cleaned_comments": "yep protectionist govt wants away data data points used anticipate internals indian marketstock exchange eg lets say wanted pitch investors food catering haldiram serving trains delayed doesnt sound investable investers indian abroad haldiram serving trains rescheduled still kind ok look might see simple thing stupid actually deeper play imagine investable indian market would globally released poverty data bpl data etc looks simple supercomplex get know hit india economically targeting definition major issue fast train superfast train definitions bad poverty definition changed yeah investability india market made joke services destroyed completely make new definition suits particular narrative",
    "light_cleaned_title": "So now late running trains are called \"Rescheduled\" trains ?",
    "light_cleaned_selftext": "Train was late by over 9 hours and was terminated early. I know Indian Railways dont value their customers time and think they are doing a favour to the people by offering passenger services. But should they not pay fine in the form of partial refunding of ticket within 24 hours of arriving ?",
    "light_cleaned_comments": "Yep ! A protectionist govt. wants to do away with all the data and data points that can be used to anticipate the internals of the indian market/stock exchange. For eg. Lets say if you wanted to pitch investors food catering - haldiram serving on 100 trains out of which 60 are 'delayed' doesnt sound invest'able to investers (indian or abroad) BUT haldiram serving to 100 trains Out of which 60 are 'rescheduled' is still kind of ok to look at. While you might see such a simple thing as stupid. Its actually a deeper play. Now imagine how invest'able indian market would be globally, had they released poverty data, bpl data, etc. It looks simple, but its supercomplex. To get to know what $hit india is in, economically. Targeting the definition is a major issue. Fast train, superfast train definitions are all bad. Poverty definition has changed. Yeah 'invest'ability' in india as a market has been made a joke of. And services are destroyed completely, to make a new definition that suits a particular narrative"
}