{
    "id": "16mo5xw",
    "title": "Sexual harrasment with an intern at Inmobi/Glance",
    "url": "https://www.reddit.com/gallery/16mo5xw",
    "selftext": "Really bad state of affairs, even boys are not safe and we don't even seen to have proper laws for sexual harrasment with man.\n\nhttps://twitter.com/karanux20/status/1704037922360689123\n\nOver a week, and company is just beating around the bush",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695122069.0,
    "convurl": "https://i.redd.it/pae5gb3747pb1.jpg",
    "comments": [
        "No comment from 38 minutes, see, this is what reality is.\n\nNo one cares if a guy dies, much less insignificant sexual harassment.",
        "https://preview.redd.it/7lkaf6mxe7pb1.jpeg?width=1080&format=pjpg&auto=webp&s=3b4c040d82067bc64861219ab24f9bdc9f6e1a3a\n\nThis is the reach of the rn with single comment",
        "Actually this is bowing up in twitter.",
        "Hope these scumbags get what’s coming to them. Sorry to hear that you’ve gone through this.",
        "It is not me. I'm sharing the post for wider reach.",
        "Wow, even boys?",
        "I don't understand what can be done, if the person has no other people who reported him for harassment and no prior pattern, its a he said - she said situation",
        "Can we do something to help?",
        "Are there anyways to expedite such an investigation process? They seem to be just stalling for time given the classic text book replies.\n\nHopefully some serious action gets taken against that manager if he is guilty",
        "Delhi police, Bangalore police, Mumbai police have responded under tweet",
        "Hope this person gets the justice he deserves. Now this is no longer an internal matter and the company can send a cease and desist notice to the victim because he posted it on social media. Hope he finds the right legal help in this situation. The SH laws say the company has 90 days to resolve this and the company has to provide an update every time an update is requested by the victim. But that HR person is right, a date cannot be set without a proper internal inquiry is conducted by a fact finding team. It might hurt the victim if they rush the procedure. Ask the victim to write down everything in as much detail, however difficult it might be, for his own record because 90 days is a long time to remember every little detail.",
        "May I get the link to the post please?",
        "I think this is why mens don't even come forward when they're sexually harassed.. while Karan is getting lot of support on twitter, there are a few who are blaming him...his own colleagues didn't support him...I wish this case get better reach among all...who knows more male survivors of sexual harassment find their voice in way too",
        "The link is not opening",
        "Mail it to HR and ask them to file a complaint under POSH and follow the procedure laid down by supreme court as vishahkha guideliness."
    ],
    "cleaned_text": "sexual harrasment intern inmobiglance really bad state affairs even boys safe dont even seen proper laws sexual harrasment man week company beating around bush ",
    "cleaned_title": "sexual harrasment intern inmobiglance",
    "cleaned_selftext": "really bad state affairs even boys safe dont even seen proper laws sexual harrasment man week company beating around bush",
    "cleaned_comments": "comment minutes see reality one cares guy dies much less insignificant sexual harassment reach rn single comment actually bowing twitter hope scumbags get whats coming sorry hear youve gone im sharing post wider reach wow even boys dont understand done person people reported harassment prior pattern said said situation something help anyways expedite investigation process seem stalling time given classic text book replies hopefully serious action gets taken manager guilty delhi police bangalore police mumbai police responded tweet hope person gets justice deserves longer internal matter company send cease desist notice victim posted social media hope finds right legal help situation sh laws say company days resolve company provide update every time update requested victim hr person right date set without proper internal inquiry conducted fact finding team might hurt victim rush procedure ask victim write everything much detail however difficult might record days long time remember every little detail may get link post please think mens dont even come forward theyre sexually harassed karan getting lot support twitter blaming himhis colleagues didnt support himi wish case get better reach among allwho knows male survivors sexual harassment find voice way link opening mail hr ask file complaint posh follow procedure laid supreme court vishahkha guideliness",
    "light_cleaned_title": "Sexual harrasment with an intern at Inmobi/Glance",
    "light_cleaned_selftext": "Really bad state of affairs, even boys are not safe and we don't even seen to have proper laws for sexual harrasment with man. Over a week, and company is just beating around the bush",
    "light_cleaned_comments": "No comment from 38 minutes, see, this is what reality is. No one cares if a guy dies, much less insignificant sexual harassment. This is the reach of the rn with single comment Actually this is bowing up in twitter. Hope these scumbags get what’s coming to them. Sorry to hear that you’ve gone through this. It is not me. I'm sharing the post for wider reach. Wow, even boys? I don't understand what can be done, if the person has no other people who reported him for harassment and no prior pattern, its a he said - she said situation Can we do something to help? Are there anyways to expedite such an investigation process? They seem to be just stalling for time given the classic text book replies. Hopefully some serious action gets taken against that manager if he is guilty Delhi police, Bangalore police, Mumbai police have responded under tweet Hope this person gets the justice he deserves. Now this is no longer an internal matter and the company can send a cease and desist notice to the victim because he posted it on social media. Hope he finds the right legal help in this situation. The SH laws say the company has 90 days to resolve this and the company has to provide an update every time an update is requested by the victim. But that HR person is right, a date cannot be set without a proper internal inquiry is conducted by a fact finding team. It might hurt the victim if they rush the procedure. Ask the victim to write down everything in as much detail, however difficult it might be, for his own record because 90 days is a long time to remember every little detail. May I get the link to the post please? I think this is why mens don't even come forward when they're sexually harassed.. while Karan is getting lot of support on twitter, there are a few who are blaming him...his own colleagues didn't support him...I wish this case get better reach among all...who knows more male survivors of sexual harassment find their voice in way too The link is not opening Mail it to HR and ask them to file a complaint under POSH and follow the procedure laid down by supreme court as vishahkha guideliness."
}