{
    "id": "15f6hfg",
    "title": "About recent RPF incident",
    "url": "https://www.reddit.com/r/india/comments/15f6hfg/about_recent_rpf_incident/",
    "selftext": "I showed the video of the recent incident that happened in the B5 coach with the RPF personnel.\nOn showing the video, the majority of them said that the video doesn't show a B5 coach but is rather a general coach and that the video is from some other incident.\n\nI wish to confirm whether the coach here is actually a B5 coach of some other coach to make my point valid.\n\nLink for the video from Twitter\n\nhttps://twitter.com/meerfaisal01/status/1685979420404936706?t=RPLPY9rsWAxCpoo2xn3OjA&s=19",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690878854.0,
    "convurl": "https://external-preview.redd.it/sbSqln6tFhGwehfYWBQZ1VIQ1Em6GiuMT_7V6-6HDxI.jpg?auto=webp&s=c5692d63425ae7ec6bede275dfc96a6334e94f61",
    "comments": [
        "What’s the difference between the coaches if you don’t mind me asking?",
        "The guy first shot his superior and one person in B5. Then he went to PC and shot another. He shot his final victim in S6. Could be the video was shot in S6 (although I don't think it's clear which coach it is from the video). Anyway, if it was a different video, would have come out already. Not too many videos of RPF people standing over dead people and giving speeches.",
        "B5 is an AC coach without any fans overhead and the design of the seats is also different",
        "Yeah, but I personally would like it to be confirmed. I guess we'll have to wait for official statements.",
        "Thank you. \n\nSorry I’m just trying to understand, so the people you are debating with - why is this relevant? \n\nAre they trying to swing on the side of conspiracy?",
        "They just want solid video and evidence. But yeah, they have their own biases. \n\nAll they know is a RPF personnel shot 4 people in a B5 coach of Mumbai and Jaipur train in Maharashtra.\n\nThey would like to avoid any fake news. Me included.",
        "Sounds like we're getting our own version of holocaust deniers.",
        "it is B5. look at the video, passngers have blankets and pillows. Another tactic by godi media, next time dont listen to them.",
        "The main difference is that of the fan on the top. Do some AC coaches have a fan?",
        "Yes",
        "He is in remand so definitely not fake news. But just like trumpers never believe anything bad about him so they also won't believe even with video proof.",
        "Not an AC coach, they dont have fans. Can be sleeper, they are usually after 3rd AC.",
        "Nope, they don't. This is clearly an LHB Sleeper Coach",
        "It's not an AC coach. Equally as improbable to be an old video. It's prolly S6 as u/jituthesat said\n\nSource: Travel on trains a lot",
        "Is it now fair to say that not all terrorists are just muslims?",
        "Lol they don’t provide pillows and bedsheets in sleeper",
        "Are you talking about that one white sheet? Prolly one the passenger brought from home",
        "Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\"\n\nAlso some terrorists are so lucky that they become MP, MLA or even ministers.",
        "Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\"\n\nAlso some terrorists are so lucky that they become MP, MLA or even ministers.",
        "Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\"\n\nAlso some terrorists are so lucky that they become MP, MLA or even ministers.",
        "Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\"\n\nAlso some terrorists are so lucky that they become MP, MLA or even ministers.",
        "It was always fair to say",
        "That is not possible. Who is a terrorist and who is not depends on who is in power. I would assume terrorists don't usually call themselves as terrorists.",
        "But this would qualify as an act of terror?",
        "Depends on the definition of what is an act of terror. It is always a debate on what constitutes as terrorism. Every country has its own definitions. Killing random people on account of an ideology, religion, politics, race, ethnicity etc., all seem like an act of terrorism to me.",
        "If it makes people afraid to travel on the train, then it is terrorism.",
        "Terrorists want to spread terror. This guy wanted to spread terror in people of a certain community",
        "But you can't quantify that. Some will be afraid, some won't be.",
        "It is the intent that matters. Did he intend to terrorize or not - in this case it seems he did intend to terrorize a community. This is different from a targeted killing or assassination which does not make regular people afraid.",
        "Says you. But the police is saying he is just sick mentally and no communal angle.\n\nWhich brings back to may first comment that the govt gets to decide who is terrorist and who is not.",
        "One more question, is NIA handling this case?",
        "What fake news,4 people died, video evidence is not necessary we have the bodies, and eyewitness accounts. I swear people these days are in so much denial. What part of hate rhetoric don't you get this and Gurgaon was inevitable and it's going to get worse unless the media changes the rhetoric.",
        "We know the crime but I specifically wish to have a solid proof for the sentence for \"vote for modi and Yogi\" to share. We have a video here but as I said, there in an inconsistency. I wish to get to the bottom of this one.\n\nCan you share the link for eyewitness accounts details if you have any? That would be a solid proof to share among my friends and colleagues.",
        "If you’re looking to quantify, then yeah, all aren’t Muslims. But how many % of a religion contributes to terrorism is skewed.",
        "It is a sleeper coach. The blankets may be their personal. But the seats are of sleeper boggies. I am not sure how he was able to move from AC to sleeper without deboarding first. Are those interconnected from inside?",
        "https://preview.redd.it/z43p0qcdbnfb1.jpeg?width=687&format=pjpg&auto=webp&s=7ad23e2987703aa7318c6deef454b50b0a81349c\n\nThis is the answer that I found.\n\nIf the investigation report for the recent crime says that the bodies were found in sleepers. Then the video is true.",
        "The video is indeed correct. I was just wondering about how he was able to move. This explains how he was able to do it. He was RAF so he had access to it. And he was not mentally unstable like the media is saying. He was perfectly calm when he did it. If he had anger issues then his voice would show it. He was as calm as the Jodhpur terrorists who beheaded that poor tailor. People need to stop defending terrorists saying they are mentally unstable.",
        "Yes, that man definitely was not in an unstable condition. He must have had an argument with the Muslims and lost his shit.\n\nMy main question is, the RAF has access to it. But how did the bodies of the victims reach the sleeper coach?",
        "Is it really? If you ask an average Ukrainian, for them Russian state is a terrorist state. But you wouldn’t want to bother about their religion, would you?",
        "With that logic USA is a terrorist state to lot of countries. Your original argument was about religion, not the state! Don’t get into whataboutism"
    ],
    "cleaned_text": "recent rpf incident showed video recent incident happened b coach rpf personnel showing video majority said video doesnt show b coach rather general coach video incident wish confirm whether coach actually b coach coach make point valid link video twitter ",
    "cleaned_title": "recent rpf incident",
    "cleaned_selftext": "showed video recent incident happened b coach rpf personnel showing video majority said video doesnt show b coach rather general coach video incident wish confirm whether coach actually b coach coach make point valid link video twitter",
    "cleaned_comments": "whats difference coaches dont mind asking guy first shot superior one person b went pc shot another shot final victim could video shot although dont think clear coach video anyway different video would come already many videos rpf people standing dead people giving speeches b ac coach without fans overhead design seats also different yeah personally would like confirmed guess well wait official statements thank sorry im trying understand people debating relevant trying swing side conspiracy want solid video evidence yeah biases know rpf personnel shot people b coach mumbai jaipur train maharashtra would like avoid fake news included sounds like getting version holocaust deniers b look video passngers blankets pillows another tactic godi media next time dont listen main difference fan top ac coaches fan yes remand definitely fake news like trumpers never believe anything bad also wont believe even video proof ac coach dont fans sleeper usually rd ac nope dont clearly lhb sleeper coach ac coach equally improbable old video prolly ujituthesat said source travel trains lot fair say terrorists muslims lol dont provide pillows bedsheets sleeper talking one white sheet prolly one passenger brought home terrorists come many names colours terrorists happen sanskaari also terrorists lucky become mp mla even ministers terrorists come many names colours terrorists happen sanskaari also terrorists lucky become mp mla even ministers terrorists come many names colours terrorists happen sanskaari also terrorists lucky become mp mla even ministers terrorists come many names colours terrorists happen sanskaari also terrorists lucky become mp mla even ministers always fair say possible terrorist depends power would assume terrorists dont usually call terrorists would qualify act terror depends definition act terror always debate constitutes terrorism every country definitions killing random people account ideology religion politics race ethnicity etc seem like act terrorism makes people afraid travel train terrorism terrorists want spread terror guy wanted spread terror people certain community cant quantify afraid wont intent matters intend terrorize case seems intend terrorize community different targeted killing assassination make regular people afraid says police saying sick mentally communal angle brings back may first comment govt gets decide terrorist one question nia handling case fake news people died video evidence necessary bodies eyewitness accounts swear people days much denial part hate rhetoric dont get gurgaon inevitable going get worse unless media changes rhetoric know crime specifically wish solid proof sentence vote modi yogi share video said inconsistency wish get bottom one share link eyewitness accounts details would solid proof share among friends colleagues youre looking quantify yeah arent muslims many religion contributes terrorism skewed sleeper coach blankets may personal seats sleeper boggies sure able move ac sleeper without deboarding first interconnected inside answer found investigation report recent crime says bodies found sleepers video true video indeed correct wondering able move explains able raf access mentally unstable like media saying perfectly calm anger issues voice would show calm jodhpur terrorists beheaded poor tailor people need stop defending terrorists saying mentally unstable yes man definitely unstable condition must argument muslims lost shit main question raf access bodies victims reach sleeper coach really ask average ukrainian russian state terrorist state wouldnt want bother religion would logic usa terrorist state lot countries original argument religion state dont get whataboutism",
    "light_cleaned_title": "About recent RPF incident",
    "light_cleaned_selftext": "I showed the video of the recent incident that happened in the B5 coach with the RPF personnel. On showing the video, the majority of them said that the video doesn't show a B5 coach but is rather a general coach and that the video is from some other incident. I wish to confirm whether the coach here is actually a B5 coach of some other coach to make my point valid. Link for the video from Twitter",
    "light_cleaned_comments": "What’s the difference between the coaches if you don’t mind me asking? The guy first shot his superior and one person in B5. Then he went to PC and shot another. He shot his final victim in S6. Could be the video was shot in S6 (although I don't think it's clear which coach it is from the video). Anyway, if it was a different video, would have come out already. Not too many videos of RPF people standing over dead people and giving speeches. B5 is an AC coach without any fans overhead and the design of the seats is also different Yeah, but I personally would like it to be confirmed. I guess we'll have to wait for official statements. Thank you. Sorry I’m just trying to understand, so the people you are debating with - why is this relevant? Are they trying to swing on the side of conspiracy? They just want solid video and evidence. But yeah, they have their own biases. All they know is a RPF personnel shot 4 people in a B5 coach of Mumbai and Jaipur train in Maharashtra. They would like to avoid any fake news. Me included. Sounds like we're getting our own version of holocaust deniers. it is B5. look at the video, passngers have blankets and pillows. Another tactic by godi media, next time dont listen to them. The main difference is that of the fan on the top. Do some AC coaches have a fan? Yes He is in remand so definitely not fake news. But just like trumpers never believe anything bad about him so they also won't believe even with video proof. Not an AC coach, they dont have fans. Can be sleeper, they are usually after 3rd AC. Nope, they don't. This is clearly an LHB Sleeper Coach It's not an AC coach. Equally as improbable to be an old video. It's prolly S6 as u/jituthesat said Source: Travel on trains a lot Is it now fair to say that not all terrorists are just muslims? Lol they don’t provide pillows and bedsheets in sleeper Are you talking about that one white sheet? Prolly one the passenger brought from home Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\" Also some terrorists are so lucky that they become MP, MLA or even ministers. Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\" Also some terrorists are so lucky that they become MP, MLA or even ministers. Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\" Also some terrorists are so lucky that they become MP, MLA or even ministers. Terrorists come in many names and colours. Some terrorists happen to be \"Sanskaari\" Also some terrorists are so lucky that they become MP, MLA or even ministers. It was always fair to say That is not possible. Who is a terrorist and who is not depends on who is in power. I would assume terrorists don't usually call themselves as terrorists. But this would qualify as an act of terror? Depends on the definition of what is an act of terror. It is always a debate on what constitutes as terrorism. Every country has its own definitions. Killing random people on account of an ideology, religion, politics, race, ethnicity etc., all seem like an act of terrorism to me. If it makes people afraid to travel on the train, then it is terrorism. Terrorists want to spread terror. This guy wanted to spread terror in people of a certain community But you can't quantify that. Some will be afraid, some won't be. It is the intent that matters. Did he intend to terrorize or not - in this case it seems he did intend to terrorize a community. This is different from a targeted killing or assassination which does not make regular people afraid. Says you. But the police is saying he is just sick mentally and no communal angle. Which brings back to may first comment that the govt gets to decide who is terrorist and who is not. One more question, is NIA handling this case? What fake news,4 people died, video evidence is not necessary we have the bodies, and eyewitness accounts. I swear people these days are in so much denial. What part of hate rhetoric don't you get this and Gurgaon was inevitable and it's going to get worse unless the media changes the rhetoric. We know the crime but I specifically wish to have a solid proof for the sentence for \"vote for modi and Yogi\" to share. We have a video here but as I said, there in an inconsistency. I wish to get to the bottom of this one. Can you share the link for eyewitness accounts details if you have any? That would be a solid proof to share among my friends and colleagues. If you’re looking to quantify, then yeah, all aren’t Muslims. But how many % of a religion contributes to terrorism is skewed. It is a sleeper coach. The blankets may be their personal. But the seats are of sleeper boggies. I am not sure how he was able to move from AC to sleeper without deboarding first. Are those interconnected from inside? This is the answer that I found. If the investigation report for the recent crime says that the bodies were found in sleepers. Then the video is true. The video is indeed correct. I was just wondering about how he was able to move. This explains how he was able to do it. He was RAF so he had access to it. And he was not mentally unstable like the media is saying. He was perfectly calm when he did it. If he had anger issues then his voice would show it. He was as calm as the Jodhpur terrorists who beheaded that poor tailor. People need to stop defending terrorists saying they are mentally unstable. Yes, that man definitely was not in an unstable condition. He must have had an argument with the Muslims and lost his shit. My main question is, the RAF has access to it. But how did the bodies of the victims reach the sleeper coach? Is it really? If you ask an average Ukrainian, for them Russian state is a terrorist state. But you wouldn’t want to bother about their religion, would you? With that logic USA is a terrorist state to lot of countries. Your original argument was about religion, not the state! Don’t get into whataboutism"
}