{
    "id": "1ahn0pd",
    "title": "India releases pigeon accused of spying for China",
    "url": "https://www.channelnewsasia.com/asia/india-pigeon-china-spy-released-4094546",
    "selftext": "I am so sorry for y'all, there are so many issues to be fixed in India and THIS is what they waste resources on 🙄\n\nAlso, very LOL.",
    "flair": "Crime",
    "score": 28,
    "num_comments": 10,
    "created_utc": 1706932653.0,
    "convurl": "https://external-preview.redd.it/n7kflwdTBk--iZgsPcMbjkWZpWN0Vs4DgJZugYSkEug.jpg?auto=webp&s=105fcc344d753bf5de8b9d9c5927fa56a707516e",
    "comments": [
        "This is some next level shit.",
        "A good face palm meme would work here",
        "They kept a bird in bird jail for eight months. You can’t make this stuff up.\n\nPoor little guy escaped in Taiwan and flew all the way here to be free, only to be locked in a cage again.",
        "Meanwhile, r/Birds aren't real 😬😬😬",
        "For godsake not another pigeon spy  .. these guys should stop making a meme out of themselves.... Bringing shame to the entire country",
        "Am I reading this right?",
        "Meanwhile China - Aayein?",
        "To be fair, they're not entirely wrong that pigeons can be used for such a purpose, carrying messages in secret. But accusing the pigeon (if that was they really did) is \\*\\*\\*\\*ing moronic.",
        "China: So what did you learn about India?\nPigeon: Gutar gu"
    ],
    "cleaned_text": "india releases pigeon accused spying china sorry yall many issues fixed india waste resources also lol ",
    "cleaned_title": "india releases pigeon accused spying china",
    "cleaned_selftext": "sorry yall many issues fixed india waste resources also lol",
    "cleaned_comments": "next level shit good face palm meme would work kept bird bird jail eight months cant make stuff poor little guy escaped taiwan flew way free locked cage meanwhile rbirds arent real godsake another pigeon spy guys stop making meme bringing shame entire country reading right meanwhile china aayein fair theyre entirely wrong pigeons used purpose carrying messages secret accusing pigeon really ing moronic china learn india pigeon gutar gu",
    "light_cleaned_title": "India releases pigeon accused of spying for China",
    "light_cleaned_selftext": "I am so sorry for y'all, there are so many issues to be fixed in India and THIS is what they waste resources on 🙄 Also, very LOL.",
    "light_cleaned_comments": "This is some next level shit. A good face palm meme would work here They kept a bird in bird jail for eight months. You can’t make this stuff up. Poor little guy escaped in Taiwan and flew all the way here to be free, only to be locked in a cage again. Meanwhile, r/Birds aren't real 😬😬😬 For godsake not another pigeon spy .. these guys should stop making a meme out of themselves.... Bringing shame to the entire country Am I reading this right? Meanwhile China - Aayein? To be fair, they're not entirely wrong that pigeons can be used for such a purpose, carrying messages in secret. But accusing the pigeon (if that was they really did) is \\*\\*\\*\\*ing moronic. China: So what did you learn about India? Pigeon: Gutar gu"
}