{
    "id": "1dyxqzx",
    "title": "BJP Leader Smashes Windshield, Threatens Police, Over Parking A Car Outside His Residence ",
    "url": "https://thesootr.com/state/madhya-pradesh/mp-ratlam-bjp-leader-misbehaved-police-personnel-5551109",
    "selftext": "I wasn’t able to find any article in English kindly use the translate button…\nBut here is all the relevant information given in the article:\n\nThe recent incident involving BJP leader Dinesh Porwal has raised concerns about lawlessness and abuse of power among certain political figures. Porwal, a former Municipal Corporation Chairman, was seen in a viral video engaging in hooliganism and verbally abusing police officers. The video, filmed two days ago, captures an altercation outside Gayatri Cinema in the city.\n\nThe situation escalated when a four-wheeler was parked outside Porwal's house. Around 1 AM, Porwal emerged from his home and began causing a commotion. He broke the car's glass and threw stones at the Gayatri Cinema premises. When police officers arrived, Porwal became even more enraged, verbally abusing them and demanding they call the Superintendent of Police (SP).\n\nPolice hasn’t taken any kind of action yet.\n(Video in the article)",
    "flair": "Crime",
    "score": 43,
    "num_comments": 2,
    "created_utc": 1720515690.0,
    "convurl": "https://external-preview.redd.it/Xe4EdIahwHmbh5jIio8liGDvaTJrYovzcFpfDcBVVfE.jpg?auto=webp&s=6402ba69417adac41e9cec2877deb78885c6bebf",
    "comments": [
        "> (Video in the article)\n\n\nWhere ? Can't find.",
        "Can't he hire a security guard to stop people parking there? Does the mp have no money to hire a security guard?"
    ],
    "cleaned_text": "bjp leader smashes windshield threatens police parking car outside residence wasnt able find article english kindly use translate button relevant information given article recent incident involving bjp leader dinesh porwal raised concerns lawlessness abuse power among certain political figures porwal former municipal corporation chairman seen viral video engaging hooliganism verbally abusing police officers video filmed two days ago captures altercation outside gayatri cinema city situation escalated fourwheeler parked outside porwals house around porwal emerged home began causing commotion broke cars glass threw stones gayatri cinema premises police officers arrived porwal became even enraged verbally abusing demanding call superintendent police sp police hasnt taken kind action yet video article ",
    "cleaned_title": "bjp leader smashes windshield threatens police parking car outside residence",
    "cleaned_selftext": "wasnt able find article english kindly use translate button relevant information given article recent incident involving bjp leader dinesh porwal raised concerns lawlessness abuse power among certain political figures porwal former municipal corporation chairman seen viral video engaging hooliganism verbally abusing police officers video filmed two days ago captures altercation outside gayatri cinema city situation escalated fourwheeler parked outside porwals house around porwal emerged home began causing commotion broke cars glass threw stones gayatri cinema premises police officers arrived porwal became even enraged verbally abusing demanding call superintendent police sp police hasnt taken kind action yet video article",
    "cleaned_comments": "video article cant find cant hire security guard stop people parking mp money hire security guard",
    "light_cleaned_title": "BJP Leader Smashes Windshield, Threatens Police, Over Parking A Car Outside His Residence",
    "light_cleaned_selftext": "I wasn’t able to find any article in English kindly use the translate button… But here is all the relevant information given in the article: The recent incident involving BJP leader Dinesh Porwal has raised concerns about lawlessness and abuse of power among certain political figures. Porwal, a former Municipal Corporation Chairman, was seen in a viral video engaging in hooliganism and verbally abusing police officers. The video, filmed two days ago, captures an altercation outside Gayatri Cinema in the city. The situation escalated when a four-wheeler was parked outside Porwal's house. Around 1 AM, Porwal emerged from his home and began causing a commotion. He broke the car's glass and threw stones at the Gayatri Cinema premises. When police officers arrived, Porwal became even more enraged, verbally abusing them and demanding they call the Superintendent of Police (SP). Police hasn’t taken any kind of action yet. (Video in the article)",
    "light_cleaned_comments": "> (Video in the article) Where ? Can't find. Can't he hire a security guard to stop people parking there? Does the mp have no money to hire a security guard?"
}