{
    "id": "128bhdo",
    "title": "Crypto crash in India caused by high taxes, regulations | Rest of World",
    "url": "https://restofworld.org/2023/india-crypto-industry-crash/",
    "selftext": "How safe is it to invest in Crypto? What have been your experiences?",
    "flair": "AskIndia",
    "score": 15,
    "num_comments": 23,
    "created_utc": 1680324378.0,
    "convurl": "https://external-preview.redd.it/w2tLyviNnGoXofnQBy5E39GZhixtJaegBsN3k_D1fsM.jpg?auto=webp&v=enabled&s=aa5898cc265c6fa3f07b8a070bdaa6d3a8a720ab",
    "comments": [
        "> How safe is it to invest in Crypto? What have been your experiences?",
        "Misleading title. \n\nIt's the Crypto Industry/Business crash in India caused by taxes and regulations. The title makes it sound like we're the reason for Crypto bubble crashing..",
        "It is definitely a very high risk investment and you can only invest money that will have no effect on you even if you lose it all. You should only invest in famous and big coins like ethereum and bitcoin.",
        "Is it easy?",
        "I would definitely not recommend you to invest in crypto as it is very risky and very high tax will cut deeply into your profits.",
        "It will be better for you to invest in index funds and etfs if you don't have much experience in investing.",
        "Read the title and read what you wrote, its the same sentence word by word, how is it misleading?",
        "Best strategy is to just buy a small amount, hold & forget about it. If it goes crazy you have a decision to make, if it tanks or nothing happens, meh just leave it.\n\nThe trick being deciding that small amount as it will differ for different people.\n\nRegular trading in Crypto is too volatile, an unnecessary effort.",
        "US, UK and many other govts are going after crypto. They are trying to completely stop exchange of Crypto currencies and dollar in future.",
        "Crypto is a scam. It's all speculation without any real world use. It's functionally the same as a pyramid scheme.",
        "I have no sympathy for crypto Bros who lost their money. \n\nAnd Tax em.",
        "I made 30₹ profit once in crypto trading. I started with 50₹ which grew to around 80 in less than 2 hours. I was just experimenting to test a theory. Had I put 5K the profit could’ve been 3K in less than 2 hours. I still have some money invested in crypto. \n\nBut India is not the reason for Crypto crash. We are not that influential (yet). Cryptos have crashed globally and India has nothing to do with it.",
        "The same way you could have lost the same amount in less than 2 hours. Crypto is glorified gambling. Some people also make a lot of money from gambling, but most don't.",
        "Bruh you're stocks and businesses everything else is also getting fucked by taxes and regulations. Dumbass",
        "Cryptos were not taxed a few years ago. \n\nPlus fwiu, you can't offset losses in cryptos. Long term and short term capital gains are offset.",
        "No actually, you can use some basic candle stick technical analysis and make some short term money. I made a profit because I knew it would go up. That’s why I put the money in the first place. I have lost 37% in crypto and then recovered a profit of 27% in my portfolio. It’s all planned and part of the process. IMO, it’s an opportunity. Most people who played it right are millionaires now. Most of them live in the west though, because India has a shaky take on crypto.",
        "No, some people got lucky and some / most didn't. Same as gambling. I made a bit of money on crypto myself but unlike other people, I don't go around saying it's because I was smart. Some people got lucky and are millionaires, many others got unlucky and lost money. Same as on the stock market, poker, the casino etc.",
        "I think you are seeing it as gambling because you don’t know how it relates to the global macro economics. Notice how it is rising again. It was well documented and predicted that it would go up again in 2023 and it did. Despite all the crashes. I am not asking you to invest in it. Just saying that if one knows how to ride the wave, they can make serious gains. And 90% of the new crypto is scam. But the top 50 are not and follow the rules of technical analysis. \n\nPeople call stock markets, FandO gamble too. But they are not if you know how to manage them.",
        "Just you keep telling yourself that and everything will be ok. \n\nHowever, for the rest of us that have done a little reading and investigation into the matter may I suggest that in this instance you may be incorrect, and this opinion that you have been given could well end up costing you and your family the chance to make a difference in this world in the not too distant future.  \n\nNFA \nDYOR\nDon't trust, verify!",
        "Let's be honest here, life's a glorified gamble when you think about it.",
        "It takes a bit of work on your own part to be your own bank, but it's well worth it.",
        "Watching one James Jani video doesn't make you an expert on Cryptocurrency - 'It's all speculation without any real world use' ?? All Fiat currency is useless by that metric . Crypto is like any other currency , trading on crypto is just a consequence of the rising value of Crypto in relation to each other and other fiat currency - Not that different from Forex Trading (the basic difference is the rate at which the value fluctuates ).\n\n'It's functionally the same as a pyramid scheme' - you have to be smart about which crypto you're backing , would you sell USD to buy Zimbabwean Dollars ? Not if you've done your research well , any country's currency will fall depending on it's actions in the geopolitical scene, it's economy etc.\n\nBUT with decentralized currencies like Bitcoin and Ethereum there's greater transparency and the whole notion of a pyramid scheme falls flat on its face. There have been pyramid schemes because of people pushing their own alt coins which are just a front for basic fraud and there have been crypto exchanges that have misappropriated user funds and gone bust because unlike central banks crypto exchanges are not insured by the FED .  This is a consequence of human interference and not the fault of the underlying technology .\n\nBitcoin has the potential to regulate world trade and kill the supremacy of the dollar. The only problem is that countries of the world haven't found a fool proof way of regulating and tracking crypto - If they can't track it - they can't tax you.\n\nCrypto exchanges are Centralized but Cryptos by their nature are Decentralized.\n\n&#x200B;\n\nSo yeah, there's that."
    ],
    "cleaned_text": "crypto crash india caused high taxes regulations rest world safe invest crypto experiences ",
    "cleaned_title": "crypto crash india caused high taxes regulations rest world",
    "cleaned_selftext": "safe invest crypto experiences",
    "cleaned_comments": "safe invest crypto experiences misleading title crypto industrybusiness crash india caused taxes regulations title makes sound like reason crypto bubble crashing definitely high risk investment invest money effect even lose invest famous big coins like ethereum bitcoin easy would definitely recommend invest crypto risky high tax cut deeply profits better invest index funds etfs dont much experience investing read title read wrote sentence word word misleading best strategy buy small amount hold forget goes crazy decision make tanks nothing happens meh leave trick deciding small amount differ different people regular trading crypto volatile unnecessary effort us uk many govts going crypto trying completely stop exchange crypto currencies dollar future crypto scam speculation without real world use functionally pyramid scheme sympathy crypto bros lost money tax em made profit crypto trading started grew around less hours experimenting test theory put k profit couldve k less hours still money invested crypto india reason crypto crash influential yet cryptos crashed globally india nothing way could lost amount less hours crypto glorified gambling people also make lot money gambling dont bruh youre stocks businesses everything else also getting fucked taxes regulations dumbass cryptos taxed years ago plus fwiu cant offset losses cryptos long term short term capital gains offset actually use basic candle stick technical analysis make short term money made profit knew would go thats put money first place lost crypto recovered profit portfolio planned part process imo opportunity people played right millionaires live west though india shaky take crypto people got lucky didnt gambling made bit money crypto unlike people dont go around saying smart people got lucky millionaires many others got unlucky lost money stock market poker casino etc think seeing gambling dont know relates global macro economics notice rising well documented predicted would go despite crashes asking invest saying one knows ride wave make serious gains new crypto scam top follow rules technical analysis people call stock markets fando gamble know manage keep telling everything ok however rest us done little reading investigation matter may suggest instance may incorrect opinion given could well end costing family chance make difference world distant future nfa dyor dont trust verify lets honest lifes glorified gamble think takes bit work part bank well worth watching one james jani video doesnt make expert cryptocurrency speculation without real world use fiat currency useless metric crypto like currency trading crypto consequence rising value crypto relation fiat currency different forex trading basic difference rate value fluctuates functionally pyramid scheme smart crypto youre backing would sell usd buy zimbabwean dollars youve done research well countrys currency fall depending actions geopolitical scene economy etc decentralized currencies like bitcoin ethereum theres greater transparency whole notion pyramid scheme falls flat face pyramid schemes people pushing alt coins front basic fraud crypto exchanges misappropriated user funds gone bust unlike central banks crypto exchanges insured fed consequence human interference fault underlying technology bitcoin potential regulate world trade kill supremacy dollar problem countries world havent found fool proof way regulating tracking crypto cant track cant tax crypto exchanges centralized cryptos nature decentralized xb yeah theres",
    "light_cleaned_title": "Crypto crash in India caused by high taxes, regulations | Rest of World",
    "light_cleaned_selftext": "How safe is it to invest in Crypto? What have been your experiences?",
    "light_cleaned_comments": "> How safe is it to invest in Crypto? What have been your experiences? Misleading title. It's the Crypto Industry/Business crash in India caused by taxes and regulations. The title makes it sound like we're the reason for Crypto bubble crashing.. It is definitely a very high risk investment and you can only invest money that will have no effect on you even if you lose it all. You should only invest in famous and big coins like ethereum and bitcoin. Is it easy? I would definitely not recommend you to invest in crypto as it is very risky and very high tax will cut deeply into your profits. It will be better for you to invest in index funds and etfs if you don't have much experience in investing. Read the title and read what you wrote, its the same sentence word by word, how is it misleading? Best strategy is to just buy a small amount, hold & forget about it. If it goes crazy you have a decision to make, if it tanks or nothing happens, meh just leave it. The trick being deciding that small amount as it will differ for different people. Regular trading in Crypto is too volatile, an unnecessary effort. US, UK and many other govts are going after crypto. They are trying to completely stop exchange of Crypto currencies and dollar in future. Crypto is a scam. It's all speculation without any real world use. It's functionally the same as a pyramid scheme. I have no sympathy for crypto Bros who lost their money. And Tax em. I made 30₹ profit once in crypto trading. I started with 50₹ which grew to around 80 in less than 2 hours. I was just experimenting to test a theory. Had I put 5K the profit could’ve been 3K in less than 2 hours. I still have some money invested in crypto. But India is not the reason for Crypto crash. We are not that influential (yet). Cryptos have crashed globally and India has nothing to do with it. The same way you could have lost the same amount in less than 2 hours. Crypto is glorified gambling. Some people also make a lot of money from gambling, but most don't. Bruh you're stocks and businesses everything else is also getting fucked by taxes and regulations. Dumbass Cryptos were not taxed a few years ago. Plus fwiu, you can't offset losses in cryptos. Long term and short term capital gains are offset. No actually, you can use some basic candle stick technical analysis and make some short term money. I made a profit because I knew it would go up. That’s why I put the money in the first place. I have lost 37% in crypto and then recovered a profit of 27% in my portfolio. It’s all planned and part of the process. IMO, it’s an opportunity. Most people who played it right are millionaires now. Most of them live in the west though, because India has a shaky take on crypto. No, some people got lucky and some / most didn't. Same as gambling. I made a bit of money on crypto myself but unlike other people, I don't go around saying it's because I was smart. Some people got lucky and are millionaires, many others got unlucky and lost money. Same as on the stock market, poker, the casino etc. I think you are seeing it as gambling because you don’t know how it relates to the global macro economics. Notice how it is rising again. It was well documented and predicted that it would go up again in 2023 and it did. Despite all the crashes. I am not asking you to invest in it. Just saying that if one knows how to ride the wave, they can make serious gains. And 90% of the new crypto is scam. But the top 50 are not and follow the rules of technical analysis. People call stock markets, FandO gamble too. But they are not if you know how to manage them. Just you keep telling yourself that and everything will be ok. However, for the rest of us that have done a little reading and investigation into the matter may I suggest that in this instance you may be incorrect, and this opinion that you have been given could well end up costing you and your family the chance to make a difference in this world in the not too distant future. NFA DYOR Don't trust, verify! Let's be honest here, life's a glorified gamble when you think about it. It takes a bit of work on your own part to be your own bank, but it's well worth it. Watching one James Jani video doesn't make you an expert on Cryptocurrency - 'It's all speculation without any real world use' ?? All Fiat currency is useless by that metric . Crypto is like any other currency , trading on crypto is just a consequence of the rising value of Crypto in relation to each other and other fiat currency - Not that different from Forex Trading (the basic difference is the rate at which the value fluctuates ). 'It's functionally the same as a pyramid scheme' - you have to be smart about which crypto you're backing , would you sell USD to buy Zimbabwean Dollars ? Not if you've done your research well , any country's currency will fall depending on it's actions in the geopolitical scene, it's economy etc. BUT with decentralized currencies like Bitcoin and Ethereum there's greater transparency and the whole notion of a pyramid scheme falls flat on its face. There have been pyramid schemes because of people pushing their own alt coins which are just a front for basic fraud and there have been crypto exchanges that have misappropriated user funds and gone bust because unlike central banks crypto exchanges are not insured by the FED . This is a consequence of human interference and not the fault of the underlying technology . Bitcoin has the potential to regulate world trade and kill the supremacy of the dollar. The only problem is that countries of the world haven't found a fool proof way of regulating and tracking crypto - If they can't track it - they can't tax you. Crypto exchanges are Centralized but Cryptos by their nature are Decentralized. &#x200B; So yeah, there's that."
}