{
    "id": "18w6518",
    "title": "3 people shot dead in Manipur's Thoubal, curfew reimposed",
    "url": "https://www.siasat.com/3-people-shot-dead-in-manipurs-thoubal-curfew-reimposed-2947076/",
    "selftext": "Why is there no coverage for Manipur on national channels?\n\nHow many of you know the severity of the situation in Manipur?",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1704141706.0,
    "convurl": "https://external-preview.redd.it/maNx7ZruCMgrDULw8OKMAzC7PWVanQXa7mVK5-2ZtkY.jpg?auto=webp&s=d7d9419ae1ab84e1a9cb2258b90250d8022bb426",
    "comments": [
        "How are these people getting so many guns and ammunition??🤔🤔. Am I missing something here ?",
        "Close to border (both Bangladesh and Myanmar) which are not having walls.",
        "Myanmar's military junta is explicitly supporting a side by providing them with weapons and protection. \nBut hamare modi ji matter pr 1 percent bhi attention Ni de rhe .",
        "Yeah I read somewhere that there is a civil war type thing going on in Burma .",
        "Right now as we speak. thousands of both Meitei and Kuki youths are undergoing military training. The situation in Manipur is just going to get worse and the centre doesnt care at all.",
        "Most Indians likely:\n\n- don't even know Manipur exists\n\n- couldn't even pick it out on the map",
        "Who is training them and why",
        "Can't even name three states in NE💀.",
        "This is singularly modis fuck up.. His greed to exploit manipur natural resources has led to this. \n\nAnd this same model will eventually be pan India."
    ],
    "cleaned_text": "people shot dead manipurs thoubal curfew reimposed coverage manipur national channels many know severity situation manipur ",
    "cleaned_title": "people shot dead manipurs thoubal curfew reimposed",
    "cleaned_selftext": "coverage manipur national channels many know severity situation manipur",
    "cleaned_comments": "people getting many guns ammunition missing something close border bangladesh myanmar walls myanmars military junta explicitly supporting side providing weapons protection hamare modi ji matter pr percent bhi attention ni de rhe yeah read somewhere civil war type thing going burma right speak thousands meitei kuki youths undergoing military training situation manipur going get worse centre doesnt care indians likely dont even know manipur exists couldnt even pick map training cant even name three states ne singularly modis fuck greed exploit manipur natural resources led model eventually pan india",
    "light_cleaned_title": "3 people shot dead in Manipur's Thoubal, curfew reimposed",
    "light_cleaned_selftext": "Why is there no coverage for Manipur on national channels? How many of you know the severity of the situation in Manipur?",
    "light_cleaned_comments": "How are these people getting so many guns and ammunition??🤔🤔. Am I missing something here ? Close to border (both Bangladesh and Myanmar) which are not having walls. Myanmar's military junta is explicitly supporting a side by providing them with weapons and protection. But hamare modi ji matter pr 1 percent bhi attention Ni de rhe . Yeah I read somewhere that there is a civil war type thing going on in Burma . Right now as we speak. thousands of both Meitei and Kuki youths are undergoing military training. The situation in Manipur is just going to get worse and the centre doesnt care at all. Most Indians likely: - don't even know Manipur exists - couldn't even pick it out on the map Who is training them and why Can't even name three states in NE💀. This is singularly modis fuck up.. His greed to exploit manipur natural resources has led to this. And this same model will eventually be pan India."
}