{
    "id": "16lxsb4",
    "title": "As INDIA alliance gets down to the nitty gritty, the nits and the grits show",
    "url": "https://indianexpress.com/article/political-pulse/as-india-alliance-gets-down-to-the-nitty-gritty-the-nits-and-the-grits-show-8945575/",
    "selftext": "Coordinating panel's decision on TV anchors' boycott, the cancelled Bhopal meet, seat-sharing anxieties reveal fissures in bloc, women's quota Bill may exacerbate same",
    "flair": "Politics",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1695048973.0,
    "convurl": "https://external-preview.redd.it/Z8nCRCyC4sD_9hPcSOTfTycqGOy5KOm8V9rq9IUEpYY.jpg?auto=webp&s=64309eaed5ee7f7c6910b8fba9697559b73d52a5",
    "comments": [
        "The issues with growing RSS were already shitty now I.N.D.I.A bloc is falling apart, hope it gets together and takes a strong hold of situation",
        "The whole dharma commentary was a needless blunder. Other issues were expected but now tmc's disagreement to caste census is a disappointment",
        "The dharma commentary was justified but after that the \"Boycott reporters\" added woods in the forest fire. The internal fights of I.N.D.I.A bloc is also killing the unity of the bloc.\n\nA sad state of opposition, if this continues on then forget flipping powers. BJ Party would win elections with majority. Don't think it would go over 50% this time, but if it does then India is doomed",
        "Forget their own voters, opposition parties only care only about preserving their own personal and wealth.  \n\nAt least BJP does deliver on its core plank of Hindutva - laws around gau raksha, love jihad, article 370,  CAA-NRC, banning triple talaq, among countless others.",
        "In that way even opposition continues to deliver for its caste based, \"freebie\" welfarist politics",
        "None of them have a core ideology like BJP has Hindutva. Nothing unites people more than hate."
    ],
    "cleaned_text": "india alliance gets nitty gritty nits grits show coordinating panels decision tv anchors boycott cancelled bhopal meet seatsharing anxieties reveal fissures bloc womens quota bill may exacerbate ",
    "cleaned_title": "india alliance gets nitty gritty nits grits show",
    "cleaned_selftext": "coordinating panels decision tv anchors boycott cancelled bhopal meet seatsharing anxieties reveal fissures bloc womens quota bill may exacerbate",
    "cleaned_comments": "issues growing rss already shitty india bloc falling apart hope gets together takes strong hold situation whole dharma commentary needless blunder issues expected tmcs disagreement caste census disappointment dharma commentary justified boycott reporters added woods forest fire internal fights india bloc also killing unity bloc sad state opposition continues forget flipping powers bj party would win elections majority dont think would go time india doomed forget voters opposition parties care preserving personal wealth least bjp deliver core plank hindutva laws around gau raksha love jihad article caanrc banning triple talaq among countless others way even opposition continues deliver caste based freebie welfarist politics none core ideology like bjp hindutva nothing unites people hate",
    "light_cleaned_title": "As INDIA alliance gets down to the nitty gritty, the nits and the grits show",
    "light_cleaned_selftext": "Coordinating panel's decision on TV anchors' boycott, the cancelled Bhopal meet, seat-sharing anxieties reveal fissures in bloc, women's quota Bill may exacerbate same",
    "light_cleaned_comments": "The issues with growing RSS were already shitty now I.N.D.I.A bloc is falling apart, hope it gets together and takes a strong hold of situation The whole dharma commentary was a needless blunder. Other issues were expected but now tmc's disagreement to caste census is a disappointment The dharma commentary was justified but after that the \"Boycott reporters\" added woods in the forest fire. The internal fights of I.N.D.I.A bloc is also killing the unity of the bloc. A sad state of opposition, if this continues on then forget flipping powers. BJ Party would win elections with majority. Don't think it would go over 50% this time, but if it does then India is doomed Forget their own voters, opposition parties only care only about preserving their own personal and wealth. At least BJP does deliver on its core plank of Hindutva - laws around gau raksha, love jihad, article 370, CAA-NRC, banning triple talaq, among countless others. In that way even opposition continues to deliver for its caste based, \"freebie\" welfarist politics None of them have a core ideology like BJP has Hindutva. Nothing unites people more than hate."
}