{
    "id": "18jnhjm",
    "title": "How exactly to reach a \"real\" customer care support in Flipkart?",
    "url": "https://i.redd.it/5c3ddm86jm6c1.png",
    "selftext": "As above. I've been trying to get out of this loop to talk to a living person but to no avail. I need to return a particular product and there hasn't been any delivery person to pick the item. These bots are useless. Flipkart and sellers hiding behind these sly bots to get away with things😂",
    "flair": "Rant / Vent",
    "score": 118,
    "num_comments": 49,
    "created_utc": 1702718120.0,
    "convurl": "https://i.redd.it/5c3ddm86jm6c1.png",
    "comments": [
        "Does anyone still use Flipkart? And why?",
        "That’s the trick you don’t",
        "You mail them your concern and they'll probably call you in 2 days.",
        "type something like - human - agent",
        "Call ?",
        "Try swearing, the bots will escalate if they detect certain emotions like anger and frustration. So cussing them out will most likely get you a human rep",
        "Unless that entire loop is broken, then there’s no point lol",
        "I buy lots and lots of products from Flipkart 🤭\n\nWait I'll teach you: \n\nWrite: \"I wanna talk to your customer care agent\"\n\nThen they'll give you two options: \"Request a call\" & \"End chat\" \n\nClick on \"Request a call\" and select your phone number.\n\nThey'll then call you within 5 minutes.",
        "Define Real 🤭",
        "Directly type in your phone number and they'll ask you to select a language and call time. This worked the last time I used Flipkart. Keep us posted :)",
        "Call this no.-+91 44 4561 4700",
        "That's the neat thing, you don't.",
        "Anyother platform other than amazon for a tier 2 city people ?",
        "Just put\n Live Agent \nOr\nLive Support. They worked for me against most bots",
        "Why everyone should use Amazon only?",
        "1) Better customer support (based on my experience)\n2) Better variety and range of products\n3) Better discounts whenever applicable\n4) Not a concrete reason, but better UI/UX\n\nThese are some of the points on top of my mind.",
        "When I used to live in a tier 3 city few years back, I used to only rely on Amazon. For clothes and fashion - Myntra. For groceries, nearby subzi mandi and departmental store.",
        "India lacks a law that guides online business to operate with a minimum way to reach further and these kindof companies are just thriving by throwing customers. You see Ola, Uber everyone has setup only an automated channel that gives you limited options (what they feel they can respond as if other issues are both their problem).\n\nI hope there is an advocate who will file PIL to drive a law that makes it mandatory for companies to put up an Email complaint receiving center on which a max number of days become binding for companies to resolve issue",
        "Just abuse them and say that you want to talk to an agent, always works",
        "1. They have worst customer support ( based on my experiences)\n2. For a normal person or professional Flipkart too have all the products and range.\n3. Best discounts when it comes to steal deal on phones, appliances, etc.\n4. I guess UI/UX should be simple to appeal to people, unlike Amazon where the drill down of menus and different menus makes you feel you're lost.",
        "# i want to talk to a human",
        "You cannot. They keep on making tuchiya out of you.",
        ">when it comes to steal deal on phones,\n\nI think you misunderstood, they will literally steal your phones.",
        "This, their chat is useless",
        "Generally, if you see a chat text box that lets you type in your question, just write \"Talk to a human\" or \"Talk to a customer care agent\".\n\nI've seen this work on multiple platforms, and you get connected directly to an agent.",
        "I have seen a lot of smartphone only available on flipkart.",
        "Write consumer court. You'll get an instant call back.",
        "Not just them, every company does this nowadays. To avoid hiring human customer support for the peanuts they are paid, companies spend large amounts on AI and IVRS systems that won't give you the answer you need and won't help you with problems.\n\nThey're intentional dark patterns to prevent you from complaining and getting help from the company.\n\nWe all need to start taking legal action against companies more often.",
        "The reason you buy online is, it saves some money. Be prepared to loose that money one few of these similar situations. That is how online shopping works in India. \n\nSecond option is to buy from store near you, they will serve your all your life. You will actually save far more in money terms if you stop shopping online since many things we buy online were not even planned.",
        "I get your point...but I ve seen that in Amazon too.",
        "They're exclusive official Pixel seller. Warranty is void if you don't buy from Flipkart. Also Flipkart runs the repair/insurance service, and the same people get sent to examine the device if you try to return/refund.\n\nFlipkart is running a scam with Google's blessing.",
        "Which one? How do I do this?",
        "Also they sell nothing phone and some others too.",
        "Just say I've filed a case to consumer court. Gaand fat jaati hai unki",
        "Yeah, that too. I got a defective Pixel 6a from them. Was planning to fight them all the way, but now screw it. I'll just use the defective phone.",
        "I want to file an actual case in consumer court. And get them legally summoned to court.",
        "I was also looking to buy pixel 7 pro from flipkart, still deciding",
        "Damn. Shit just got serious!",
        "Connect to an agent",
        "Maybe it will turn out well, maybe it won't. My advice, better not to take such a chance. That thing is overpriced anyway. You can get basically the same experience with the cheaper a series devices. Wait a few months and buy the Pixel 7a at a heavy discount.",
        "Is it not worth at 60k ?",
        "Please don't use flipkart, myntra. Use Amazon.",
        "I use it for small electronic items. \n\n\"Appario Retail\" on amazon would be my first choice, but their prices are often quite high - so it's either flipkart or local shop.",
        "Not at all. My brother bought Pixel 7 at 50k at launch like an idiot. And he regrets it. It may have some \"premium\" features. But in reality, it's all bespoke nonsense that's just meant to have a \"premium\" feel.\n\nIt fails to record video sometimes, saying that it's overheating.......... because the amazing tech talent at Google won't use the inbuilt video encoder hardware.......",
        "Post your complain with proper order id of the product on twitter and tag flipkart and walmart.. I have worked as a customer service associate in Flipkart.",
        "It's the only way I can consider getting certain brands of mobile phones (Motorola, Nothing, Poco and Google Pixel). It sucks but I don't have an alternative (except for certain motos which can be bought in person).",
        "Download the app - National Consumer Helpline. \n\nAnd register your grievance there. It's by the Department of Consumer Affairs. You will get a call from customer care in 1 or 2 days.",
        "1800 208 9898\n\nYou can reach here... But in app call request feature is better actually, they directly jump to your concerned order details..."
    ],
    "cleaned_text": "exactly reach real customer care support flipkart ive trying get loop talk living person avail need return particular product hasnt delivery person pick item bots useless flipkart sellers hiding behind sly bots get away things ",
    "cleaned_title": "exactly reach real customer care support flipkart",
    "cleaned_selftext": "ive trying get loop talk living person avail need return particular product hasnt delivery person pick item bots useless flipkart sellers hiding behind sly bots get away things",
    "cleaned_comments": "anyone still use flipkart thats trick dont mail concern theyll probably call days type something like human agent call try swearing bots escalate detect certain emotions like anger frustration cussing likely get human rep unless entire loop broken theres point lol buy lots lots products flipkart wait ill teach write wan na talk customer care agent theyll give two options request call end chat click request call select phone number theyll call within minutes define real directly type phone number theyll ask select language call time worked last time used flipkart keep us posted call thats neat thing dont anyother platform amazon tier city people put live agent live support worked bots everyone use amazon better customer support based experience better variety range products better discounts whenever applicable concrete reason better uiux points top mind used live tier city years back used rely amazon clothes fashion myntra groceries nearby subzi mandi departmental store india lacks law guides online business operate minimum way reach kindof companies thriving throwing customers see ola uber everyone setup automated channel gives limited options feel respond issues problem hope advocate file pil drive law makes mandatory companies put email complaint receiving center max number days become binding companies resolve issue abuse say want talk agent always works worst customer support based experiences normal person professional flipkart products range best discounts comes steal deal phones appliances etc guess uiux simple appeal people unlike amazon drill menus different menus makes feel youre lost want talk human keep making tuchiya comes steal deal phones think misunderstood literally steal phones chat useless generally see chat text box lets type question write talk human talk customer care agent ive seen work multiple platforms get connected directly agent seen lot smartphone available flipkart write consumer court youll get instant call back every company nowadays avoid hiring human customer support peanuts paid companies spend large amounts ai ivrs systems wont give answer need wont help problems theyre intentional dark patterns prevent complaining getting help company need start taking legal action companies often reason buy online saves money prepared loose money one similar situations online shopping works india second option buy store near serve life actually save far money terms stop shopping online since many things buy online even planned get pointbut seen amazon theyre exclusive official pixel seller warranty void dont buy flipkart also flipkart runs repairinsurance service people get sent examine device try returnrefund flipkart running scam googles blessing one also sell nothing phone others say ive filed case consumer court gaand fat jaati hai unki yeah got defective pixel planning fight way screw ill use defective phone want file actual case consumer court get legally summoned court also looking buy pixel pro flipkart still deciding damn shit got serious connect agent maybe turn well maybe wont advice better take chance thing overpriced anyway get basically experience cheaper series devices wait months buy pixel heavy discount worth k please dont use flipkart myntra use amazon use small electronic items appario retail amazon would first choice prices often quite high either flipkart local shop brother bought pixel k launch like idiot regrets may premium features reality bespoke nonsense thats meant premium feel fails record video sometimes saying overheating amazing tech talent google wont use inbuilt video encoder hardware post complain proper order id product twitter tag flipkart walmart worked customer service associate flipkart way consider getting certain brands mobile phones motorola nothing poco google pixel sucks dont alternative except certain motos bought person download app national consumer helpline register grievance department consumer affairs get call customer care days reach app call request feature better actually directly jump concerned order details",
    "light_cleaned_title": "How exactly to reach a \"real\" customer care support in Flipkart?",
    "light_cleaned_selftext": "As above. I've been trying to get out of this loop to talk to a living person but to no avail. I need to return a particular product and there hasn't been any delivery person to pick the item. These bots are useless. Flipkart and sellers hiding behind these sly bots to get away with things😂",
    "light_cleaned_comments": "Does anyone still use Flipkart? And why? That’s the trick you don’t You mail them your concern and they'll probably call you in 2 days. type something like - human - agent Call ? Try swearing, the bots will escalate if they detect certain emotions like anger and frustration. So cussing them out will most likely get you a human rep Unless that entire loop is broken, then there’s no point lol I buy lots and lots of products from Flipkart 🤭 Wait I'll teach you: Write: \"I wanna talk to your customer care agent\" Then they'll give you two options: \"Request a call\" & \"End chat\" Click on \"Request a call\" and select your phone number. They'll then call you within 5 minutes. Define Real 🤭 Directly type in your phone number and they'll ask you to select a language and call time. This worked the last time I used Flipkart. Keep us posted :) Call this no.-+91 44 4561 4700 That's the neat thing, you don't. Anyother platform other than amazon for a tier 2 city people ? Just put Live Agent Or Live Support. They worked for me against most bots Why everyone should use Amazon only? 1) Better customer support (based on my experience) 2) Better variety and range of products 3) Better discounts whenever applicable 4) Not a concrete reason, but better UI/UX These are some of the points on top of my mind. When I used to live in a tier 3 city few years back, I used to only rely on Amazon. For clothes and fashion - Myntra. For groceries, nearby subzi mandi and departmental store. India lacks a law that guides online business to operate with a minimum way to reach further and these kindof companies are just thriving by throwing customers. You see Ola, Uber everyone has setup only an automated channel that gives you limited options (what they feel they can respond as if other issues are both their problem). I hope there is an advocate who will file PIL to drive a law that makes it mandatory for companies to put up an Email complaint receiving center on which a max number of days become binding for companies to resolve issue Just abuse them and say that you want to talk to an agent, always works 1. They have worst customer support ( based on my experiences) 2. For a normal person or professional Flipkart too have all the products and range. 3. Best discounts when it comes to steal deal on phones, appliances, etc. 4. I guess UI/UX should be simple to appeal to people, unlike Amazon where the drill down of menus and different menus makes you feel you're lost. # i want to talk to a human You cannot. They keep on making tuchiya out of you. >when it comes to steal deal on phones, I think you misunderstood, they will literally steal your phones. This, their chat is useless Generally, if you see a chat text box that lets you type in your question, just write \"Talk to a human\" or \"Talk to a customer care agent\". I've seen this work on multiple platforms, and you get connected directly to an agent. I have seen a lot of smartphone only available on flipkart. Write consumer court. You'll get an instant call back. Not just them, every company does this nowadays. To avoid hiring human customer support for the peanuts they are paid, companies spend large amounts on AI and IVRS systems that won't give you the answer you need and won't help you with problems. They're intentional dark patterns to prevent you from complaining and getting help from the company. We all need to start taking legal action against companies more often. The reason you buy online is, it saves some money. Be prepared to loose that money one few of these similar situations. That is how online shopping works in India. Second option is to buy from store near you, they will serve your all your life. You will actually save far more in money terms if you stop shopping online since many things we buy online were not even planned. I get your point...but I ve seen that in Amazon too. They're exclusive official Pixel seller. Warranty is void if you don't buy from Flipkart. Also Flipkart runs the repair/insurance service, and the same people get sent to examine the device if you try to return/refund. Flipkart is running a scam with Google's blessing. Which one? How do I do this? Also they sell nothing phone and some others too. Just say I've filed a case to consumer court. Gaand fat jaati hai unki Yeah, that too. I got a defective Pixel 6a from them. Was planning to fight them all the way, but now screw it. I'll just use the defective phone. I want to file an actual case in consumer court. And get them legally summoned to court. I was also looking to buy pixel 7 pro from flipkart, still deciding Damn. Shit just got serious! Connect to an agent Maybe it will turn out well, maybe it won't. My advice, better not to take such a chance. That thing is overpriced anyway. You can get basically the same experience with the cheaper a series devices. Wait a few months and buy the Pixel 7a at a heavy discount. Is it not worth at 60k ? Please don't use flipkart, myntra. Use Amazon. I use it for small electronic items. \"Appario Retail\" on amazon would be my first choice, but their prices are often quite high - so it's either flipkart or local shop. Not at all. My brother bought Pixel 7 at 50k at launch like an idiot. And he regrets it. It may have some \"premium\" features. But in reality, it's all bespoke nonsense that's just meant to have a \"premium\" feel. It fails to record video sometimes, saying that it's overheating.......... because the amazing tech talent at Google won't use the inbuilt video encoder hardware....... Post your complain with proper order id of the product on twitter and tag flipkart and walmart.. I have worked as a customer service associate in Flipkart. It's the only way I can consider getting certain brands of mobile phones (Motorola, Nothing, Poco and Google Pixel). It sucks but I don't have an alternative (except for certain motos which can be bought in person). Download the app - National Consumer Helpline. And register your grievance there. It's by the Department of Consumer Affairs. You will get a call from customer care in 1 or 2 days. 1800 208 9898 You can reach here... But in app call request feature is better actually, they directly jump to your concerned order details..."
}