{
    "id": "14buean",
    "title": "Want honest feedback",
    "url": "https://www.reddit.com/r/india/comments/14buean/want_honest_feedback/",
    "selftext": "With a heavy heart and teary eyes,I think I have parted ways with UPSC finally…I don’t think I can do it anymore…looking for “plan B” I have decided to give cat exam as a backup option…but they too require good past marks,work experience etc for top colleges and I am lacking in some expects.However,to overcome this shortcoming,I had decided to do YouTube as a side project and see if I can build some numbers so that I can impress the interview board of IIM’s.\n\ncan you give a honest feedback to my video I made recently ( not asking for like share or subscribe,I would build it on my own) but please do give feedback no matter how hard it is.\n\nthankyou\n\n(videos are in hindi language primarily)\n\nlink to the vido : [https://youtu.be/Fkra00fDlII](https://youtu.be/Fkra00fDlII)\n\nlink to a short : [https://youtu.be/Tr9ByD0B-LA](https://youtu.be/Tr9ByD0B-LA)\n\nthankyou once again.",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 3,
    "created_utc": 1687017037.0,
    "convurl": "https://external-preview.redd.it/2-TLvlidp4VZD2KD44tdmMJpRA6qyymYlIlBO_TJhXA.jpg?auto=webp&v=enabled&s=fce5971a4e24a476b24dcc055f41ecbb052a6af6",
    "comments": [
        "I'm not saying to lower your goals, but mba-cet in Maharashtra don't need interviews, you can get in jbims, welingkar, Sydenham without interviews.with just the percentile you get. Check if it's same for your state mba-cet. That way you won't have to justify your gap. This could be your plan-C just in case. Stay Strong!!",
        "Good for your new start. \n\nFeedback :-\n\nBuy a earphone any price and use it as mic. The voice is very low and under confident.\n\nWatch YouTubers like Khan Sir & Ojha Sir to see how to make YouTube video on the topic of UPSC.\n\nMake shots for faster growth \nKeep your long format Content under 10 mins. \nUse more visual images and animation.\nPrepare notes before hand to avoid pauses in between.\nStop putting your opinion on what you feel about certain topics go with the syallabus and what needs to be taught.\n\nBring more enthusiasm",
        "Thankyou for your feedback ❤️"
    ],
    "cleaned_text": "want honest feedback heavy heart teary eyesi think parted ways upsc finallyi dont think anymorelooking plan b decided give cat exam backup optionbut require good past markswork experience etc top colleges lacking expectshoweverto overcome shortcomingi decided youtube side project see build numbers impress interview board iims give honest feedback video made recently asking like share subscribei would build please give feedback matter hard thankyou videos hindi language primarily link vido httpsyoutubefkrafdliihttpsyoutubefkrafdlii link short httpsyoutubetrbydblahttpsyoutubetrbydbla thankyou ",
    "cleaned_title": "want honest feedback",
    "cleaned_selftext": "heavy heart teary eyesi think parted ways upsc finallyi dont think anymorelooking plan b decided give cat exam backup optionbut require good past markswork experience etc top colleges lacking expectshoweverto overcome shortcomingi decided youtube side project see build numbers impress interview board iims give honest feedback video made recently asking like share subscribei would build please give feedback matter hard thankyou videos hindi language primarily link vido httpsyoutubefkrafdliihttpsyoutubefkrafdlii link short httpsyoutubetrbydblahttpsyoutubetrbydbla thankyou",
    "cleaned_comments": "im saying lower goals mbacet maharashtra dont need interviews get jbims welingkar sydenham without interviewswith percentile get check state mbacet way wont justify gap could planc case stay strong good new start feedback buy earphone price use mic voice low confident watch youtubers like khan sir ojha sir see make youtube video topic upsc make shots faster growth keep long format content mins use visual images animation prepare notes hand avoid pauses stop putting opinion feel certain topics go syallabus needs taught bring enthusiasm thankyou feedback",
    "light_cleaned_title": "Want honest feedback",
    "light_cleaned_selftext": "With a heavy heart and teary eyes,I think I have parted ways with UPSC finally…I don’t think I can do it anymore…looking for “plan B” I have decided to give cat exam as a backup option…but they too require good past marks,work experience etc for top colleges and I am lacking in some expects.However,to overcome this shortcoming,I had decided to do YouTube as a side project and see if I can build some numbers so that I can impress the interview board of IIM’s. can you give a honest feedback to my video I made recently ( not asking for like share or subscribe,I would build it on my own) but please do give feedback no matter how hard it is. thankyou (videos are in hindi language primarily) link to the vido : [https://youtu.be/Fkra00fDlII](https://youtu.be/Fkra00fDlII) link to a short : [https://youtu.be/Tr9ByD0B-LA](https://youtu.be/Tr9ByD0B-LA) thankyou once again.",
    "light_cleaned_comments": "I'm not saying to lower your goals, but mba-cet in Maharashtra don't need interviews, you can get in jbims, welingkar, Sydenham without interviews.with just the percentile you get. Check if it's same for your state mba-cet. That way you won't have to justify your gap. This could be your plan-C just in case. Stay Strong!! Good for your new start. Feedback :- Buy a earphone any price and use it as mic. The voice is very low and under confident. Watch YouTubers like Khan Sir & Ojha Sir to see how to make YouTube video on the topic of UPSC. Make shots for faster growth Keep your long format Content under 10 mins. Use more visual images and animation. Prepare notes before hand to avoid pauses in between. Stop putting your opinion on what you feel about certain topics go with the syallabus and what needs to be taught. Bring more enthusiasm Thankyou for your feedback ❤️"
}