{
    "id": "19f7fgn",
    "title": "\"Digital Nagriks\" for a Free, Equal, and Inclusive Internet: Our demands from the incoming Union Government",
    "url": "https://www.reddit.com/r/india/comments/19f7fgn/digital_nagriks_for_a_free_equal_and_inclusive/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/i3pz3sxepkec1.jpg?width=1600&format=pjpg&auto=webp&s=3d0a87c76d573a2698e8720812fa156589a3af8f\n\nThe 2024 general elections to elect Lok Sabha members are slated to be an event of grandeur. With [over 900 million Indian voters](https://www.businesstoday.in/latest/world/story/the-year-of-elections-4-billion-people-will-cast-a-vote-in-over-60-countries-in-2024-412123-2024-01-06?ref=static.internetfreedom.in)  geared up to vote a new Union government to power, the focus will soon  shift to promises, development agendas, and governance priorities of  political parties in the running. In that context, IFF has attempted to  list out a [seven-point agenda](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/djl2zc6j7ukmb4q/digital_rights_manifesto_2024_7rxzqKH0Hg.pdf?ref=static.internetfreedom.in) on  technology and human rights that can be adopted by electoral candidates  and political parties in their party manifestos for the 2024 general  and state elections. \n\nMore Indians are online today than ever before. A [Hindu report](https://www.thehindu.com/news/national/over-50-indians-are-active-internet-users-now-base-to-reach-900-million-by-2025-report/article66809522.ece?ref=static.internetfreedom.in)  from May 2023 speculates that half the Indian population now has access  to the internet. At the outset, the numbers paint a positive picture –  the country’s digital divide, a gaping problem that alienates many  groups from reaping the benefits of digital technologies recreationally  as well as for better quality of life, is seemingly being bridged. The  increasing adoption of the internet also signals a continuing belief  that it has the potential to make our lives better. But on a closer  look, we see that the internet is also being wielded as a tool of  arbitrary executive control by our government, which deepens the divide  and excludes vulnerable communities. Instances of indefinite and  disproportionate internet shutdowns, threats to net neutrality,  tech-enabled gender violence – all indicate that while Indians are  online, our engagement with the internet is not necessarily meaningful  or fructuous. A free, equal and inclusive internet  can only be ensured  when the rights of users are written into the law, and our institutions  invest their time and resources in building rights-affirming, secure and  trustworthy legal mechanisms for us to safely make the most of the  internet. \n\nSometimes, we find that our government slips up on this  legitimate expectation. Their interests may misalign with ours – as can  be seen from the wide array of flawed or underdeveloped tech-policy  regulatory developments that have been enacted in the last few years.  But our demands for rights-centric legislation and good governance must  not stop. As \"Digital Nagriks\", a title endowed upon citizens of a  “Digital India” by the Digital Personal Data Protection Act, 2023, we  must continue to participate in our democracy and hold our governments  accountable for the protection, preservation, and advancement of our  constitutionally guaranteed digital rights.\n\nWe, at IFF, noted the  absence of a clearly articulated message or political charter of demands  surrounding the use of digital technologies in India. This seven-point  agenda has been created to fill that gap. We attempted a similar  exercise in 2019 – where we [presented a set of demands](https://internetfreedom.in/digital-rights-as-a-campaign-priority-as-we-step-toward-the-next-election/?ref=static.internetfreedom.in)  and reached out to all political parties and candidates to open a  channel of communication. This year, we have streamlined these demands  into seven broad themes of governance. \n\n### I. Digital rights are human rights\n\nThe  incoming government must support and advocate for protecting and  expanding our fundamental human rights in the realm of digital  technologies, with a focus on constitutional principles of justice,  liberty, equality, and fraternity. With growing digitisation and more  Indians coming online, the human rights impact of digital technologies  has become a core governance issue, which must be implemented through  executive and legislative action. The government must apply systemic  solutions to systemic problems such as cybersecurity threats and online  harms, while preserving our security through the adoption of  privacy-protecting technologies. The protection and advancement of the  digital rights of individuals and collectives must become a governance  priority. \n\n### II. Technology should lead to inclusion and equality\n\nThe  incoming government must ensure greater access to the internet and to  digital technologies – access that is physical, educational, monetary,  intersectional, and equitable. Internet penetration must increase in  remote corners of the country to secure the right of every Indian to  communicate, send, and receive information and to bridge the digital  divide. No person should be excluded from government services, benefits,  or entitlements due to the adoption of e-governance services or  digitisation, and the delivery of welfare services must not be impeded  due to technical failures or inaccessibility. The government should  empower those from backgrounds and identities who can use technology for  a better, more productive life across boundaries of religion, caste and  gender. \n\n### III. Free speech must be respected\n\nThe  growing presence of Indians in online spaces reinforces the need to  protect their freedom of speech and expression as well as their right to  receive information online. Reinterpretation or replacement of  antiquated laws must not be employed as a means to suppress dissenting  and vulnerable voices and to solidify disproportionate power with the  Executive. While an online attack on the freedoms and rights of others  must be countered with effective measures, the incoming government must  ensure that legitimate, constitutional rights are protected and  promoted. Neither the government nor the platforms can become sole  arbiters of online free speech, in the absence of judicial safeguards.  The government must oppose the disproportionate, unreasoned, and  non-transparent suspension of the internet. India’s troublesome  performance in globally renowned indexes measuring internet shutdowns  and online speech censorship is a cause for alarm, and the government  must safeguard fundamental and human rights in online domains,  preventing any authoritarian abuse of power.\n\n### IV. Upholding informational privacy\n\nProtection of privacy, as articulated by a nine-judge bench of the Supreme Court in the two *Puttaswamy v. Union of India*  judgments (2017 and 2019), is indispensable to a digital India. To  ensure that the informational privacy of all Indians is protected, the  incoming government must commit to building a rights-affirming digital  environment with adequate channels for grievance redress. The data  protection legislation must be amended to meet the standards of privacy  and principles of proportionality set out by the Supreme Court in the *Puttaswamy* judgments.  The government must implement robust data processing, storage and  sharing mechanisms in line with internationally accepted principles. At  the same time, the right to information and the RTI Act, which is a  significant pillar of democratic governance, must not be diluted.\n\n### V. Checks on surveillance\n\nIn  order to preserve the privacy, dignity, and freedom of movement of  Indian citizens, there is a critical need to establish proper safeguards  and oversight over digital surveillance by the Executive. Legal  safeguards and processes with adequate checks and balances must be  created for surveillance by police and intelligence agencies, to prevent  misuse and targeted or mass surveillance of individuals. The incoming  government must introduce long overdue reform in surveillance practices  and powers of the Executive, with sufficient legislative and judicial  oversight on any interception of digital devices, including computer  access and phone tapping. The role of intrusive, emerging technological  use-cases such as artificial intelligence and facial recognition in  surveillance must be closely reevaluated, and privacy impact assessments  conducted before deploying such tools. The government must protect and  encourage the adoption of encryption technologies like end-to-end  encryption, and eliminate the use of spyware as a tool for  surveillance. \n\n### VI. Making consumer facing digital platforms accountable\n\nIndia  is a valuable market for companies globally, with Indians forming a  bulk of their user base. In exchange for establishing a presence on and  using the services of these platforms, users are unknowingly  relinquishing effective control over how they interact with technology.  Legislative, regulatory, and policy measures are needed to effectively  ensure an equitable balance of company interests and individual rights,  in a way that the former respects the fundamental right to free speech  and privacy. Technology companies as well as the government must strive  to serve the public’s best interests instead of protecting company  profits. To that end, the incoming government must ensure that companies  adopt measures for greater transparency and accountability through  tools such as a Human Rights Impact Assessment. \n\n### VII. Ensuring legitimate use of generative AI\n\nThe  legitimate use of generative AI for reasons such as translation or  authorised dubbing of audio-video content to reach a broader audience  can achieve positive outcomes. However, the unauthorised use of such  technology for nefarious use to create manipulated media can have  devastating consequences, including financial fraud, defamation,  impersonation, etc. In light of the existing limitations of detection  tools and redressal capabilities of platforms and companies, the  incoming government must commit to not creating and/or using manipulated  media for nefarious reasons as government actors and otherwise. The  government must create solutions at the legal, policy, and societal  levels for such emerging technologies in a way that balances the right  to online free legitimate and legal speech and the right to receive  information. In addition to working towards building technical capacity  within the government and its allied organisations to tackle these  emerging threats, media literacy should be a priority both in the  digital and physical space, to raise awareness about the existence of  and threats posed by these technologies.\n\n## As always, we can’t do this without you\n\nHere’s how you can help:\n\n1. **Add to the agenda:** We  call on the IFF community and all those who are passionate about  digital rights and policy in India to send us inputs, suggestions or  feedback on our Digital Rights Manifesto. What is a digital rights issue  that would make you cast your vote in favour of a candidate? What area  or theme would you want the incoming government to focus on? Do you have  different expectations or perspectives as a stakeholder in the  tech-policy space? Tell us today! Write us an email at [policy@internetfreedom.in](mailto:policy@internetfreedom.in) or leave a message via any of our social media channels (linked at the bottom of this page). \n2. **Put us in touch with an electoral candidate or party:** You  can help by connecting or introducing us to electoral candidates,  political parties, or anyone seeking legislative office through the next  general and state elections. Please write to us at [policy@internetfreedom.in](mailto:policy@internetfreedom.in)*.*\n3. **Support IFF:** As  we dial up our advocacy efforts to uphold the demands of \" \"Digital  Nagriks\" this election season, we take this opportunity to thank IFF's  community of supporters, volunteers, donors and members. We are able to  continue doing what we love, fighting for your rights only because of  your unending affection and support. If you want to be a part of our  journey, [donate](https://static.internetfreedom.in/donate) to us or sign up to become a member today!\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 21,
    "num_comments": 0,
    "created_utc": 1706182878.0,
    "convurl": "https://external-preview.redd.it/jPTA4y4AaNfiqfGLNb3E52LhnZi8FP2t24vVkzFmxBg.jpg?auto=webp&s=9789b1f980974a7632296639ac45503f3d31cb16",
    "comments": [],
    "cleaned_text": "digital nagriks free equal inclusive internet demands incoming union government xb general elections elect lok sabha members slated event grandeur million indian votershttpswwwbusinesstodayinlatestworldstorytheyearofelectionsbillionpeoplewillcastavoteinovercountriesinrefstaticinternetfreedomin geared vote new union government power focus soon shift promises development agendas governance priorities political parties running context iff attempted list sevenpoint agendahttpscontentinternetfreedominapifilesdivcoywedtrpedjlzcjukmbqdigitalrightsmanifestorxzqkhhgpdfrefstaticinternetfreedomin technology human rights adopted electoral candidates political parties party manifestos general state elections indians online today ever hindu reporthttpswwwthehinducomnewsnationaloverindiansareactiveinternetusersnowbasetoreachmillionbyreportarticleecerefstaticinternetfreedomin may speculates half indian population access internet outset numbers paint positive picture countrys digital divide gaping problem alienates many groups reaping benefits digital technologies recreationally well better quality life seemingly bridged increasing adoption internet also signals continuing belief potential make lives better closer look see internet also wielded tool arbitrary executive control government deepens divide excludes vulnerable communities instances indefinite disproportionate internet shutdowns threats net neutrality techenabled gender violence indicate indians online engagement internet necessarily meaningful fructuous free equal inclusive internet ensured rights users written law institutions invest time resources building rightsaffirming secure trustworthy legal mechanisms us safely make internet sometimes find government slips legitimate expectation interests may misalign seen wide array flawed underdeveloped techpolicy regulatory developments enacted last years demands rightscentric legislation good governance must stop digital nagriks title endowed upon citizens digital india digital personal data protection act must continue participate democracy hold governments accountable protection preservation advancement constitutionally guaranteed digital rights iff noted absence clearly articulated message political charter demands surrounding use digital technologies india sevenpoint agenda created fill gap attempted similar exercise presented set demandshttpsinternetfreedomindigitalrightsasacampaignpriorityaswesteptowardthenextelectionrefstaticinternetfreedomin reached political parties candidates open channel communication year streamlined demands seven broad themes governance digital rights human rights incoming government must support advocate protecting expanding fundamental human rights realm digital technologies focus constitutional principles justice liberty equality fraternity growing digitisation indians coming online human rights impact digital technologies become core governance issue must implemented executive legislative action government must apply systemic solutions systemic problems cybersecurity threats online harms preserving security adoption privacyprotecting technologies protection advancement digital rights individuals collectives must become governance priority ii technology lead inclusion equality incoming government must ensure greater access internet digital technologies access physical educational monetary intersectional equitable internet penetration must increase remote corners country secure right every indian communicate send receive information bridge digital divide person excluded government services benefits entitlements due adoption egovernance services digitisation delivery welfare services must impeded due technical failures inaccessibility government empower backgrounds identities use technology better productive life across boundaries religion caste gender iii free speech must respected growing presence indians online spaces reinforces need protect freedom speech expression well right receive information online reinterpretation replacement antiquated laws must employed means suppress dissenting vulnerable voices solidify disproportionate power executive online attack freedoms rights others must countered effective measures incoming government must ensure legitimate constitutional rights protected promoted neither government platforms become sole arbiters online free speech absence judicial safeguards government must oppose disproportionate unreasoned nontransparent suspension internet indias troublesome performance globally renowned indexes measuring internet shutdowns online speech censorship cause alarm government must safeguard fundamental human rights online domains preventing authoritarian abuse power iv upholding informational privacy protection privacy articulated ninejudge bench supreme court two puttaswamy v union india judgments indispensable digital india ensure informational privacy indians protected incoming government must commit building rightsaffirming digital environment adequate channels grievance redress data protection legislation must amended meet standards privacy principles proportionality set supreme court puttaswamy judgments government must implement robust data processing storage sharing mechanisms line internationally accepted principles time right information rti act significant pillar democratic governance must diluted v checks surveillance order preserve privacy dignity freedom movement indian citizens critical need establish proper safeguards oversight digital surveillance executive legal safeguards processes adequate checks balances must created surveillance police intelligence agencies prevent misuse targeted mass surveillance individuals incoming government must introduce long overdue reform surveillance practices powers executive sufficient legislative judicial oversight interception digital devices including computer access phone tapping role intrusive emerging technological usecases artificial intelligence facial recognition surveillance must closely reevaluated privacy impact assessments conducted deploying tools government must protect encourage adoption encryption technologies like endtoend encryption eliminate use spyware tool surveillance vi making consumer facing digital platforms accountable india valuable market companies globally indians forming bulk user base exchange establishing presence using services platforms users unknowingly relinquishing effective control interact technology legislative regulatory policy measures needed effectively ensure equitable balance company interests individual rights way former respects fundamental right free speech privacy technology companies well government must strive serve publics best interests instead protecting company profits end incoming government must ensure companies adopt measures greater transparency accountability tools human rights impact assessment vii ensuring legitimate use generative ai legitimate use generative ai reasons translation authorised dubbing audiovideo content reach broader audience achieve positive outcomes however unauthorised use technology nefarious use create manipulated media devastating consequences including financial fraud defamation impersonation etc light existing limitations detection tools redressal capabilities platforms companies incoming government must commit creating andor using manipulated media nefarious reasons government actors otherwise government must create solutions legal policy societal levels emerging technologies way balances right online free legitimate legal speech right receive information addition working towards building technical capacity within government allied organisations tackle emerging threats media literacy priority digital physical space raise awareness existence threats posed technologies always cant without heres help add agenda call iff community passionate digital rights policy india send us inputs suggestions feedback digital rights manifesto digital rights issue would make cast vote favour candidate area theme would want incoming government focus different expectations perspectives stakeholder techpolicy space tell us today write us email policyinternetfreedominmailtopolicyinternetfreedomin leave message via social media channels linked bottom page put us touch electoral candidate party help connecting introducing us electoral candidates political parties anyone seeking legislative office next general state elections please write us policyinternetfreedominmailtopolicyinternetfreedomin support iff dial advocacy efforts uphold demands digital nagriks election season take opportunity thank iffs community supporters volunteers donors members able continue love fighting rights unending affection support want part journey donatehttpsstaticinternetfreedomindonate us sign become member today xb ",
    "cleaned_title": "digital nagriks free equal inclusive internet demands incoming union government",
    "cleaned_selftext": "xb general elections elect lok sabha members slated event grandeur million indian votershttpswwwbusinesstodayinlatestworldstorytheyearofelectionsbillionpeoplewillcastavoteinovercountriesinrefstaticinternetfreedomin geared vote new union government power focus soon shift promises development agendas governance priorities political parties running context iff attempted list sevenpoint agendahttpscontentinternetfreedominapifilesdivcoywedtrpedjlzcjukmbqdigitalrightsmanifestorxzqkhhgpdfrefstaticinternetfreedomin technology human rights adopted electoral candidates political parties party manifestos general state elections indians online today ever hindu reporthttpswwwthehinducomnewsnationaloverindiansareactiveinternetusersnowbasetoreachmillionbyreportarticleecerefstaticinternetfreedomin may speculates half indian population access internet outset numbers paint positive picture countrys digital divide gaping problem alienates many groups reaping benefits digital technologies recreationally well better quality life seemingly bridged increasing adoption internet also signals continuing belief potential make lives better closer look see internet also wielded tool arbitrary executive control government deepens divide excludes vulnerable communities instances indefinite disproportionate internet shutdowns threats net neutrality techenabled gender violence indicate indians online engagement internet necessarily meaningful fructuous free equal inclusive internet ensured rights users written law institutions invest time resources building rightsaffirming secure trustworthy legal mechanisms us safely make internet sometimes find government slips legitimate expectation interests may misalign seen wide array flawed underdeveloped techpolicy regulatory developments enacted last years demands rightscentric legislation good governance must stop digital nagriks title endowed upon citizens digital india digital personal data protection act must continue participate democracy hold governments accountable protection preservation advancement constitutionally guaranteed digital rights iff noted absence clearly articulated message political charter demands surrounding use digital technologies india sevenpoint agenda created fill gap attempted similar exercise presented set demandshttpsinternetfreedomindigitalrightsasacampaignpriorityaswesteptowardthenextelectionrefstaticinternetfreedomin reached political parties candidates open channel communication year streamlined demands seven broad themes governance digital rights human rights incoming government must support advocate protecting expanding fundamental human rights realm digital technologies focus constitutional principles justice liberty equality fraternity growing digitisation indians coming online human rights impact digital technologies become core governance issue must implemented executive legislative action government must apply systemic solutions systemic problems cybersecurity threats online harms preserving security adoption privacyprotecting technologies protection advancement digital rights individuals collectives must become governance priority ii technology lead inclusion equality incoming government must ensure greater access internet digital technologies access physical educational monetary intersectional equitable internet penetration must increase remote corners country secure right every indian communicate send receive information bridge digital divide person excluded government services benefits entitlements due adoption egovernance services digitisation delivery welfare services must impeded due technical failures inaccessibility government empower backgrounds identities use technology better productive life across boundaries religion caste gender iii free speech must respected growing presence indians online spaces reinforces need protect freedom speech expression well right receive information online reinterpretation replacement antiquated laws must employed means suppress dissenting vulnerable voices solidify disproportionate power executive online attack freedoms rights others must countered effective measures incoming government must ensure legitimate constitutional rights protected promoted neither government platforms become sole arbiters online free speech absence judicial safeguards government must oppose disproportionate unreasoned nontransparent suspension internet indias troublesome performance globally renowned indexes measuring internet shutdowns online speech censorship cause alarm government must safeguard fundamental human rights online domains preventing authoritarian abuse power iv upholding informational privacy protection privacy articulated ninejudge bench supreme court two puttaswamy v union india judgments indispensable digital india ensure informational privacy indians protected incoming government must commit building rightsaffirming digital environment adequate channels grievance redress data protection legislation must amended meet standards privacy principles proportionality set supreme court puttaswamy judgments government must implement robust data processing storage sharing mechanisms line internationally accepted principles time right information rti act significant pillar democratic governance must diluted v checks surveillance order preserve privacy dignity freedom movement indian citizens critical need establish proper safeguards oversight digital surveillance executive legal safeguards processes adequate checks balances must created surveillance police intelligence agencies prevent misuse targeted mass surveillance individuals incoming government must introduce long overdue reform surveillance practices powers executive sufficient legislative judicial oversight interception digital devices including computer access phone tapping role intrusive emerging technological usecases artificial intelligence facial recognition surveillance must closely reevaluated privacy impact assessments conducted deploying tools government must protect encourage adoption encryption technologies like endtoend encryption eliminate use spyware tool surveillance vi making consumer facing digital platforms accountable india valuable market companies globally indians forming bulk user base exchange establishing presence using services platforms users unknowingly relinquishing effective control interact technology legislative regulatory policy measures needed effectively ensure equitable balance company interests individual rights way former respects fundamental right free speech privacy technology companies well government must strive serve publics best interests instead protecting company profits end incoming government must ensure companies adopt measures greater transparency accountability tools human rights impact assessment vii ensuring legitimate use generative ai legitimate use generative ai reasons translation authorised dubbing audiovideo content reach broader audience achieve positive outcomes however unauthorised use technology nefarious use create manipulated media devastating consequences including financial fraud defamation impersonation etc light existing limitations detection tools redressal capabilities platforms companies incoming government must commit creating andor using manipulated media nefarious reasons government actors otherwise government must create solutions legal policy societal levels emerging technologies way balances right online free legitimate legal speech right receive information addition working towards building technical capacity within government allied organisations tackle emerging threats media literacy priority digital physical space raise awareness existence threats posed technologies always cant without heres help add agenda call iff community passionate digital rights policy india send us inputs suggestions feedback digital rights manifesto digital rights issue would make cast vote favour candidate area theme would want incoming government focus different expectations perspectives stakeholder techpolicy space tell us today write us email policyinternetfreedominmailtopolicyinternetfreedomin leave message via social media channels linked bottom page put us touch electoral candidate party help connecting introducing us electoral candidates political parties anyone seeking legislative office next general state elections please write us policyinternetfreedominmailtopolicyinternetfreedomin support iff dial advocacy efforts uphold demands digital nagriks election season take opportunity thank iffs community supporters volunteers donors members able continue love fighting rights unending affection support want part journey donatehttpsstaticinternetfreedomindonate us sign become member today xb",
    "cleaned_comments": "",
    "light_cleaned_title": "\"Digital Nagriks\" for a Free, Equal, and Inclusive Internet: Our demands from the incoming Union Government",
    "light_cleaned_selftext": "&#x200B; The 2024 general elections to elect Lok Sabha members are slated to be an event of grandeur. With [over 900 million Indian voters](https://www.businesstoday.in/latest/world/story/the-year-of-elections-4-billion-people-will-cast-a-vote-in-over-60-countries-in-2024-412123-2024-01-06?ref=static.internetfreedom.in) geared up to vote a new Union government to power, the focus will soon shift to promises, development agendas, and governance priorities of political parties in the running. In that context, IFF has attempted to list out a [seven-point agenda](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/djl2zc6j7ukmb4q/digital_rights_manifesto_2024_7rxzqKH0Hg.pdf?ref=static.internetfreedom.in) on technology and human rights that can be adopted by electoral candidates and political parties in their party manifestos for the 2024 general and state elections. More Indians are online today than ever before. A [Hindu report](https://www.thehindu.com/news/national/over-50-indians-are-active-internet-users-now-base-to-reach-900-million-by-2025-report/article66809522.ece?ref=static.internetfreedom.in) from May 2023 speculates that half the Indian population now has access to the internet. At the outset, the numbers paint a positive picture – the country’s digital divide, a gaping problem that alienates many groups from reaping the benefits of digital technologies recreationally as well as for better quality of life, is seemingly being bridged. The increasing adoption of the internet also signals a continuing belief that it has the potential to make our lives better. But on a closer look, we see that the internet is also being wielded as a tool of arbitrary executive control by our government, which deepens the divide and excludes vulnerable communities. Instances of indefinite and disproportionate internet shutdowns, threats to net neutrality, tech-enabled gender violence – all indicate that while Indians are online, our engagement with the internet is not necessarily meaningful or fructuous. A free, equal and inclusive internet can only be ensured when the rights of users are written into the law, and our institutions invest their time and resources in building rights-affirming, secure and trustworthy legal mechanisms for us to safely make the most of the internet. Sometimes, we find that our government slips up on this legitimate expectation. Their interests may misalign with ours – as can be seen from the wide array of flawed or underdeveloped tech-policy regulatory developments that have been enacted in the last few years. But our demands for rights-centric legislation and good governance must not stop. As \"Digital Nagriks\", a title endowed upon citizens of a “Digital India” by the Digital Personal Data Protection Act, 2023, we must continue to participate in our democracy and hold our governments accountable for the protection, preservation, and advancement of our constitutionally guaranteed digital rights. We, at IFF, noted the absence of a clearly articulated message or political charter of demands surrounding the use of digital technologies in India. This seven-point agenda has been created to fill that gap. We attempted a similar exercise in 2019 – where we [presented a set of demands](https://internetfreedom.in/digital-rights-as-a-campaign-priority-as-we-step-toward-the-next-election/?ref=static.internetfreedom.in) and reached out to all political parties and candidates to open a channel of communication. This year, we have streamlined these demands into seven broad themes of governance. ### I. Digital rights are human rights The incoming government must support and advocate for protecting and expanding our fundamental human rights in the realm of digital technologies, with a focus on constitutional principles of justice, liberty, equality, and fraternity. With growing digitisation and more Indians coming online, the human rights impact of digital technologies has become a core governance issue, which must be implemented through executive and legislative action. The government must apply systemic solutions to systemic problems such as cybersecurity threats and online harms, while preserving our security through the adoption of privacy-protecting technologies. The protection and advancement of the digital rights of individuals and collectives must become a governance priority. ### II. Technology should lead to inclusion and equality The incoming government must ensure greater access to the internet and to digital technologies – access that is physical, educational, monetary, intersectional, and equitable. Internet penetration must increase in remote corners of the country to secure the right of every Indian to communicate, send, and receive information and to bridge the digital divide. No person should be excluded from government services, benefits, or entitlements due to the adoption of e-governance services or digitisation, and the delivery of welfare services must not be impeded due to technical failures or inaccessibility. The government should empower those from backgrounds and identities who can use technology for a better, more productive life across boundaries of religion, caste and gender. ### III. Free speech must be respected The growing presence of Indians in online spaces reinforces the need to protect their freedom of speech and expression as well as their right to receive information online. Reinterpretation or replacement of antiquated laws must not be employed as a means to suppress dissenting and vulnerable voices and to solidify disproportionate power with the Executive. While an online attack on the freedoms and rights of others must be countered with effective measures, the incoming government must ensure that legitimate, constitutional rights are protected and promoted. Neither the government nor the platforms can become sole arbiters of online free speech, in the absence of judicial safeguards. The government must oppose the disproportionate, unreasoned, and non-transparent suspension of the internet. India’s troublesome performance in globally renowned indexes measuring internet shutdowns and online speech censorship is a cause for alarm, and the government must safeguard fundamental and human rights in online domains, preventing any authoritarian abuse of power. ### IV. Upholding informational privacy Protection of privacy, as articulated by a nine-judge bench of the Supreme Court in the two *Puttaswamy v. Union of India* judgments (2017 and 2019), is indispensable to a digital India. To ensure that the informational privacy of all Indians is protected, the incoming government must commit to building a rights-affirming digital environment with adequate channels for grievance redress. The data protection legislation must be amended to meet the standards of privacy and principles of proportionality set out by the Supreme Court in the *Puttaswamy* judgments. The government must implement robust data processing, storage and sharing mechanisms in line with internationally accepted principles. At the same time, the right to information and the RTI Act, which is a significant pillar of democratic governance, must not be diluted. ### V. Checks on surveillance In order to preserve the privacy, dignity, and freedom of movement of Indian citizens, there is a critical need to establish proper safeguards and oversight over digital surveillance by the Executive. Legal safeguards and processes with adequate checks and balances must be created for surveillance by police and intelligence agencies, to prevent misuse and targeted or mass surveillance of individuals. The incoming government must introduce long overdue reform in surveillance practices and powers of the Executive, with sufficient legislative and judicial oversight on any interception of digital devices, including computer access and phone tapping. The role of intrusive, emerging technological use-cases such as artificial intelligence and facial recognition in surveillance must be closely reevaluated, and privacy impact assessments conducted before deploying such tools. The government must protect and encourage the adoption of encryption technologies like end-to-end encryption, and eliminate the use of spyware as a tool for surveillance. ### VI. Making consumer facing digital platforms accountable India is a valuable market for companies globally, with Indians forming a bulk of their user base. In exchange for establishing a presence on and using the services of these platforms, users are unknowingly relinquishing effective control over how they interact with technology. Legislative, regulatory, and policy measures are needed to effectively ensure an equitable balance of company interests and individual rights, in a way that the former respects the fundamental right to free speech and privacy. Technology companies as well as the government must strive to serve the public’s best interests instead of protecting company profits. To that end, the incoming government must ensure that companies adopt measures for greater transparency and accountability through tools such as a Human Rights Impact Assessment. ### VII. Ensuring legitimate use of generative AI The legitimate use of generative AI for reasons such as translation or authorised dubbing of audio-video content to reach a broader audience can achieve positive outcomes. However, the unauthorised use of such technology for nefarious use to create manipulated media can have devastating consequences, including financial fraud, defamation, impersonation, etc. In light of the existing limitations of detection tools and redressal capabilities of platforms and companies, the incoming government must commit to not creating and/or using manipulated media for nefarious reasons as government actors and otherwise. The government must create solutions at the legal, policy, and societal levels for such emerging technologies in a way that balances the right to online free legitimate and legal speech and the right to receive information. In addition to working towards building technical capacity within the government and its allied organisations to tackle these emerging threats, media literacy should be a priority both in the digital and physical space, to raise awareness about the existence of and threats posed by these technologies. ## As always, we can’t do this without you Here’s how you can help: 1. **Add to the agenda:** We call on the IFF community and all those who are passionate about digital rights and policy in India to send us inputs, suggestions or feedback on our Digital Rights Manifesto. What is a digital rights issue that would make you cast your vote in favour of a candidate? What area or theme would you want the incoming government to focus on? Do you have different expectations or perspectives as a stakeholder in the tech-policy space? Tell us today! Write us an email at [policy@internetfreedom.in](mailto:policy@internetfreedom.in) or leave a message via any of our social media channels (linked at the bottom of this page). 2. **Put us in touch with an electoral candidate or party:** You can help by connecting or introducing us to electoral candidates, political parties, or anyone seeking legislative office through the next general and state elections. Please write to us at [policy@internetfreedom.in](mailto:policy@internetfreedom.in)*.* 3. **Support IFF:** As we dial up our advocacy efforts to uphold the demands of \" \"Digital Nagriks\" this election season, we take this opportunity to thank IFF's community of supporters, volunteers, donors and members. We are able to continue doing what we love, fighting for your rights only because of your unending affection and support. If you want to be a part of our journey, [donate](https://static.internetfreedom.in/donate) to us or sign up to become a member today! &#x200B;",
    "light_cleaned_comments": ""
}