{
    "id": "13k6nc7",
    "title": "Trying to find an Indian music video shot in a car, a la James Corden",
    "url": "https://www.reddit.com/r/india/comments/13k6nc7/trying_to_find_an_indian_music_video_shot_in_a/",
    "selftext": "I'm trying to find a music video. It's in Hindi, maybe a bit of Punjabi. It was shot in a car, a la James Corden. The singer has a beard, maybe is wearing black sunglasses, and there's a few men in the car dancing along. The entire video is shot in the car. The singer's name is one word, something like Asroor, but not that. I think it starts with an 'A'.\n\nI can't remember much of the song. It's not too fast/loud and maybe there's a guitar in the car.\n\nSome people pointed out that the singer looks like a Pakistani singer, and then they collaborated on a song which the Pakistani singer shot in a car in Pakistan. That has a disclaimer about how the Indian singer couldn't get a visa to Pakistan.\n\nEdit: Solved! [https://www.youtube.com/watch?v=RHszWAPkipA](https://www.youtube.com/watch?v=RHszWAPkipA)",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 5,
    "created_utc": 1684340867.0,
    "convurl": "https://external-preview.redd.it/qyjvFdms14fCB-48bJhpe5wRz_UwW-5MH4-BiYjq-oU.jpg?auto=webp&v=enabled&s=40de67593783627e5bb93e13b499e22c4b40d1da",
    "comments": [
        "All Punjabi music videos are in a car, be more specific. Hum the tune of a some lyrics",
        "This is all I remember, sorry. All Punjabi music videos aren't followed by a collaboration with a Pakistani lookalike---if someone's familiar with the song, I imagine this would be enough to know it's what I'm talking about.",
        "There’s a Pakistan singer named Asrar, he’s the singer of Afghan Jalebi Ya Baba in Phantom, check his YouTube channel if the song you are looking for is by him?",
        ">Asrar\n\nOh, great, [https://www.youtube.com/watch?v=RHszWAPkipA](https://www.youtube.com/watch?v=RHszWAPkipA) is it. Thanks!"
    ],
    "cleaned_text": "trying find indian music video shot car la james corden im trying find music video hindi maybe bit punjabi shot car la james corden singer beard maybe wearing black sunglasses theres men car dancing along entire video shot car singers name one word something like asroor think starts cant remember much song fastloud maybe theres guitar car people pointed singer looks like pakistani singer collaborated song pakistani singer shot car pakistan disclaimer indian singer couldnt get visa pakistan edit solved httpswwwyoutubecomwatchvrhszwapkipahttpswwwyoutubecomwatchvrhszwapkipa ",
    "cleaned_title": "trying find indian music video shot car la james corden",
    "cleaned_selftext": "im trying find music video hindi maybe bit punjabi shot car la james corden singer beard maybe wearing black sunglasses theres men car dancing along entire video shot car singers name one word something like asroor think starts cant remember much song fastloud maybe theres guitar car people pointed singer looks like pakistani singer collaborated song pakistani singer shot car pakistan disclaimer indian singer couldnt get visa pakistan edit solved httpswwwyoutubecomwatchvrhszwapkipahttpswwwyoutubecomwatchvrhszwapkipa",
    "cleaned_comments": "punjabi music videos car specific hum tune lyrics remember sorry punjabi music videos arent followed collaboration pakistani lookalikeif someones familiar song imagine would enough know im talking theres pakistan singer named asrar hes singer afghan jalebi ya baba phantom check youtube channel song looking asrar oh great httpswwwyoutubecomwatchvrhszwapkipahttpswwwyoutubecomwatchvrhszwapkipa thanks",
    "light_cleaned_title": "Trying to find an Indian music video shot in a car, a la James Corden",
    "light_cleaned_selftext": "I'm trying to find a music video. It's in Hindi, maybe a bit of Punjabi. It was shot in a car, a la James Corden. The singer has a beard, maybe is wearing black sunglasses, and there's a few men in the car dancing along. The entire video is shot in the car. The singer's name is one word, something like Asroor, but not that. I think it starts with an 'A'. I can't remember much of the song. It's not too fast/loud and maybe there's a guitar in the car. Some people pointed out that the singer looks like a Pakistani singer, and then they collaborated on a song which the Pakistani singer shot in a car in Pakistan. That has a disclaimer about how the Indian singer couldn't get a visa to Pakistan. Edit: Solved! [https://www.youtube.com/watch?v=RHszWAPkipA](https://www.youtube.com/watch?v=RHszWAPkipA)",
    "light_cleaned_comments": "All Punjabi music videos are in a car, be more specific. Hum the tune of a some lyrics This is all I remember, sorry. All Punjabi music videos aren't followed by a collaboration with a Pakistani lookalike---if someone's familiar with the song, I imagine this would be enough to know it's what I'm talking about. There’s a Pakistan singer named Asrar, he’s the singer of Afghan Jalebi Ya Baba in Phantom, check his YouTube channel if the song you are looking for is by him? >Asrar Oh, great, [https://www.youtube.com/watch?v=RHszWAPkipA](https://www.youtube.com/watch?v=RHszWAPkipA) is it. Thanks!"
}