{
    "id": "1bfbomg",
    "title": "Nikhil who exposed  prostitution and drug racket outside LPU University has been arrested by Punjab police with fraudulent documents",
    "url": "https://i.redd.it/n7h3q8lbghoc1.png",
    "selftext": "Desidudewithsign is the name of his X handle",
    "flair": "Crime",
    "score": 567,
    "num_comments": 45,
    "created_utc": 1710501892.0,
    "convurl": "https://i.redd.it/n7h3q8lbghoc1.png",
    "comments": [
        "AAp mp & Punjab govt really want a big issue just before the Loksabha elections ?",
        "I believe we need a whole new political front, current one has rotten to a point that none of the available choices are good for health",
        "i beleive he was released by J&K police as per twitter",
        "He took extra income from the police, police will harass him",
        "Yup just saw [this](https://twitter.com/TajinderBagga/status/1768540442172510239) tweet. He has been let go for now.",
        "All of Delhi, West UP, Harayana, Punjab etc North India group got divided to show massive support to Elvish Yadav, Maxtern, Dalal and RandomSena but no one is speaking a word for him because he is talking something good, something which is not religious but is for the society.",
        "India main Bigg Boss zyada zaruri hai than actual people and women suffering\n\nProstitution ka kya, hota rehta, youtuber drama toh rare hai na \n\n/s",
        "There should be a law where police from one state cannot arbitrarily arrest people from another state.",
        "I thought prostitution is legal now after a supreme court judgement.\n\nhttps://www.outlookindia.com/story/national/explained-the-supreme-court-order-on-sex-workers-laws-on-prostitution-how-sc-order-changes-things-news-198865",
        "Bhai fir post bhi edit kar do na. Otherwise info about his release will be lost in comments.",
        "A new one will be made from this one's fragments, so don't expect any chance.",
        "He definitely made a mistake by taking AAP's MP name even when that MP is not related to the issie directly or indirectly. This prostitution thing was happening since 2015 and as long as the owner is not directly involved in facilitating this, there was no need to implicate him in the matter. \n\nAlso, women are free to sell their body for sex as long as there is no Pimp or Middleman involved and it is completely legal for a girl to take money in exchange for sex so there was nothing illegal about the situation he was referring to. \n\nThis AAP MP was elected in 2021 and this whole prostitution and drugs business has been going on since a very long time. Just to make a party look guilty you cannot take names till the time you don't have any supporting evidence regarding their involvement in the same. \n\nWhen he posted that video with a note about the owner being a member of AAP, I pointed this out there and then. Trying to sensationalize something without any evidence is outrageous. \n\nAnyone can make a video of GB Road and write a note that such and such party or mla is in power but this does not mean that the person is directly involved in it.",
        "How abt police not arbitrarily arresting any1 in general?",
        "That doesn't make it legal. More like decriminalized.",
        "What's the difference?",
        "He definitely made a mistake by taking AAP's MP name but that doesn't justify using [fake ](https://x.com/Nikhilsingh21_/status/1766025307759272339?s=20) FIR papers for the arrest. This is an illegal arrest.",
        "What is wrong with India? Is this what the kids need to do to survive? Corruption is rampant, rapes are rampant, same with prostitution and liquor. Just showing the world a fake side will not help.",
        "I'm in dark here, are the university girls being forced to do the prostitution??",
        "Constructive criticism is what we need.",
        "Forced? Naah. They doing on their own bro",
        "WTF!? Seriously??",
        "And the media giving victims a platform, public ko aesi information news pe phele, reddit pe baad mai pata chalni chahiye",
        "Yes . This thing is also happening in Kota, girls around age of 16-19 are part there. I heard that from a friend",
        "Bro, The thing I don't get is are they being blackmailed to do so? Or they doing it on their own? That's what I'm concerned and confused about",
        "You touber phehle samajik kam karte hai fir mafi mangte hai.",
        "It means there is no law making it legal. You are only immune to criminal cases. Hypothetically you can be tied up in civil cases and other criminal cases. For eg: The money prostitutes earn isn't white money as their source of income isn't legal. So hypothetically, they can be arrested for financial crimes. Basically until legislation is passed you are in a legal grey area.",
        "i think in the video he said girls were nigerian",
        "Public ko Hindu Muslim drama chaiye. News ka demand bahut Kam hai. Large news media corporations are financially unfeasible.",
        "Do you have Any link or something?? If you have please kindly share I'll watch it",
        "https://www.thehindu.com/news/national/supreme-court-recognises-sex-work-as-a-profession/article65461331.ece\n\nSupreme court does recognise sex work as a profession and clearly states that if a brothel is raided no prostitutes should be arrested.",
        "No offence but what the fuck is RandomSena, it popped on my thread a couple of times but I never pursued or paid attention to this (because I've got a life of my own). Can you please explain what kind of new cancer is it?",
        "op did post yt link",
        "People who have power want more for themselves, why do you think only 2% of the population pays direct taxes",
        "Pretty sure another police cannot just come and arrest a person residing in another state. The visiting police needs the home state’s permission first",
        "I can accertain you with the situation but I think they are not matured . Also in the LPU video girl was ready to do in 2000 rs which is cheap prostitution, so you can understand . \n\nAlso for the Kota part , I heard this from my friend that auto wala was ready to make the arrangements in 1500 or so. And girls were those who come for preparation .",
        "Easy money",
        "This guy has an interesting content profile. I have a feeling he would not be upset if this happened to JNU students in Delhi. He is just upset that fascism has come to bite his ass.",
        "Everyday the country strays away from humanity and fuckin logic. Sometimes I just want to castrated half the country so we don’t have kids growing up with values these fuckin power hungry fucks are entitled with.",
        "Misleading post. \n\n>Kaushik, in his latest post on his Instagram channel “Sab Lok Tantra” claimed that he was a “bold voice of Hindutva, famous journalist, political analyst” who was “picked up under a political conspiracy” by the Punjab Police from UP’s Muzaffarnagar after he “presented some facts on his channels regarding Arvind Kejriwal, his family and Punjab government.” With around 24,000 followers, his Instagram channel describes him as a ‘Political Satirist’.\n\n>An FIR against unknown person was registered on the complaint of Alisha Masih, a pastor of a church in Peeru Banda area of Ludhiana. Masih in his complaint said that a video hurting religious sentiments of the Christian community was uploaded on X from a handle named “No conversion”. Masih said he had filed the complaint after seeing online videos and that he never knew who the man was.\n\n>CP Chahal said a probe found that Rachit Kaushik was running a handle on X, where he would put many such clips instigating one community against the other. “He is also running many such other handles on YouTube and Instagram, where he gives hate speech and tries to instigate communities,” CP Chahal told The Indian Express.\n\nRead more at: https://indianexpress.com/article/who-is/who-is-rachit-kaushik-the-youtuber-arrested-by-punjab-police-for-inciting-hate-9149392/\n\nThere's no reference either to prostitution at LPU by the person who was arrested, or by the police that arrested him. Post removed - please post news from verified sources, not Sanghi twitter handles."
    ],
    "cleaned_text": "nikhil exposed prostitution drug racket outside lpu university arrested punjab police fraudulent documents desidudewithsign name x handle ",
    "cleaned_title": "nikhil exposed prostitution drug racket outside lpu university arrested punjab police fraudulent documents",
    "cleaned_selftext": "desidudewithsign name x handle",
    "cleaned_comments": "aap mp punjab govt really want big issue loksabha elections believe need whole new political front current one rotten point none available choices good health beleive released jk police per twitter took extra income police police harass yup saw thishttpstwittercomtajinderbaggastatus tweet let go delhi west harayana punjab etc north india group got divided show massive support elvish yadav maxtern dalal randomsena one speaking word talking something good something religious society india main bigg boss zyada zaruri hai actual people women suffering prostitution ka kya hota rehta youtuber drama toh rare hai na law police one state arbitrarily arrest people another state thought prostitution legal supreme court judgement bhai fir post bhi edit kar na otherwise info release lost comments new one made ones fragments dont expect chance definitely made mistake taking aaps mp name even mp related issie directly indirectly prostitution thing happening since long owner directly involved facilitating need implicate matter also women free sell body sex long pimp middleman involved completely legal girl take money exchange sex nothing illegal situation referring aap mp elected whole prostitution drugs business going since long time make party look guilty take names till time dont supporting evidence regarding involvement posted video note owner member aap pointed trying sensationalize something without evidence outrageous anyone make video gb road write note party mla power mean person directly involved abt police arbitrarily arresting general doesnt make legal like decriminalized whats difference definitely made mistake taking aaps mp name doesnt justify using fake httpsxcomnikhilsinghstatuss fir papers arrest illegal arrest wrong india kids need survive corruption rampant rapes rampant prostitution liquor showing world fake side help im dark university girls forced prostitution constructive criticism need forced naah bro wtf seriously media giving victims platform public ko aesi information news pe phele reddit pe baad mai pata chalni chahiye yes thing also happening kota girls around age part heard friend bro thing dont get blackmailed thats im concerned confused touber phehle samajik kam karte hai fir mafi mangte hai means law making legal immune criminal cases hypothetically tied civil cases criminal cases eg money prostitutes earn isnt white money source income isnt legal hypothetically arrested financial crimes basically legislation passed legal grey area think video said girls nigerian public ko hindu muslim drama chaiye news ka demand bahut kam hai large news media corporations financially unfeasible link something please kindly share ill watch supreme court recognise sex work profession clearly states brothel raided prostitutes arrested offence fuck randomsena popped thread couple times never pursued paid attention ive got life please explain kind new cancer op post yt link people power want think population pays direct taxes pretty sure another police come arrest person residing another state visiting police needs home states permission first accertain situation think matured also lpu video girl ready rs cheap prostitution understand also kota part heard friend auto wala ready make arrangements girls come preparation easy money guy interesting content profile feeling would upset happened jnu students delhi upset fascism come bite ass everyday country strays away humanity fuckin logic sometimes want castrated half country dont kids growing values fuckin power hungry fucks entitled misleading post kaushik latest post instagram channel sab lok tantra claimed bold voice hindutva famous journalist political analyst picked political conspiracy punjab police ups muzaffarnagar presented facts channels regarding arvind kejriwal family punjab government around followers instagram channel describes political satirist fir unknown person registered complaint alisha masih pastor church peeru banda area ludhiana masih complaint said video hurting religious sentiments christian community uploaded x handle named conversion masih said filed complaint seeing online videos never knew man cp chahal said probe found rachit kaushik running handle x would put many clips instigating one community also running many handles youtube instagram gives hate speech tries instigate communities cp chahal told indian express read theres reference either prostitution lpu person arrested police arrested post removed please post news verified sources sanghi twitter handles",
    "light_cleaned_title": "Nikhil who exposed prostitution and drug racket outside LPU University has been arrested by Punjab police with fraudulent documents",
    "light_cleaned_selftext": "Desidudewithsign is the name of his X handle",
    "light_cleaned_comments": "AAp mp & Punjab govt really want a big issue just before the Loksabha elections ? I believe we need a whole new political front, current one has rotten to a point that none of the available choices are good for health i beleive he was released by J&K police as per twitter He took extra income from the police, police will harass him Yup just saw [this](https://twitter.com/TajinderBagga/status/1768540442172510239) tweet. He has been let go for now. All of Delhi, West UP, Harayana, Punjab etc North India group got divided to show massive support to Elvish Yadav, Maxtern, Dalal and RandomSena but no one is speaking a word for him because he is talking something good, something which is not religious but is for the society. India main Bigg Boss zyada zaruri hai than actual people and women suffering Prostitution ka kya, hota rehta, youtuber drama toh rare hai na /s There should be a law where police from one state cannot arbitrarily arrest people from another state. I thought prostitution is legal now after a supreme court judgement. Bhai fir post bhi edit kar do na. Otherwise info about his release will be lost in comments. A new one will be made from this one's fragments, so don't expect any chance. He definitely made a mistake by taking AAP's MP name even when that MP is not related to the issie directly or indirectly. This prostitution thing was happening since 2015 and as long as the owner is not directly involved in facilitating this, there was no need to implicate him in the matter. Also, women are free to sell their body for sex as long as there is no Pimp or Middleman involved and it is completely legal for a girl to take money in exchange for sex so there was nothing illegal about the situation he was referring to. This AAP MP was elected in 2021 and this whole prostitution and drugs business has been going on since a very long time. Just to make a party look guilty you cannot take names till the time you don't have any supporting evidence regarding their involvement in the same. When he posted that video with a note about the owner being a member of AAP, I pointed this out there and then. Trying to sensationalize something without any evidence is outrageous. Anyone can make a video of GB Road and write a note that such and such party or mla is in power but this does not mean that the person is directly involved in it. How abt police not arbitrarily arresting any1 in general? That doesn't make it legal. More like decriminalized. What's the difference? He definitely made a mistake by taking AAP's MP name but that doesn't justify using [fake ](https://x.com/Nikhilsingh21_/status/1766025307759272339?s=20) FIR papers for the arrest. This is an illegal arrest. What is wrong with India? Is this what the kids need to do to survive? Corruption is rampant, rapes are rampant, same with prostitution and liquor. Just showing the world a fake side will not help. I'm in dark here, are the university girls being forced to do the prostitution?? Constructive criticism is what we need. Forced? Naah. They doing on their own bro WTF!? Seriously?? And the media giving victims a platform, public ko aesi information news pe phele, reddit pe baad mai pata chalni chahiye Yes . This thing is also happening in Kota, girls around age of 16-19 are part there. I heard that from a friend Bro, The thing I don't get is are they being blackmailed to do so? Or they doing it on their own? That's what I'm concerned and confused about You touber phehle samajik kam karte hai fir mafi mangte hai. It means there is no law making it legal. You are only immune to criminal cases. Hypothetically you can be tied up in civil cases and other criminal cases. For eg: The money prostitutes earn isn't white money as their source of income isn't legal. So hypothetically, they can be arrested for financial crimes. Basically until legislation is passed you are in a legal grey area. i think in the video he said girls were nigerian Public ko Hindu Muslim drama chaiye. News ka demand bahut Kam hai. Large news media corporations are financially unfeasible. Do you have Any link or something?? If you have please kindly share I'll watch it Supreme court does recognise sex work as a profession and clearly states that if a brothel is raided no prostitutes should be arrested. No offence but what the fuck is RandomSena, it popped on my thread a couple of times but I never pursued or paid attention to this (because I've got a life of my own). Can you please explain what kind of new cancer is it? op did post yt link People who have power want more for themselves, why do you think only 2% of the population pays direct taxes Pretty sure another police cannot just come and arrest a person residing in another state. The visiting police needs the home state’s permission first I can accertain you with the situation but I think they are not matured . Also in the LPU video girl was ready to do in 2000 rs which is cheap prostitution, so you can understand . Also for the Kota part , I heard this from my friend that auto wala was ready to make the arrangements in 1500 or so. And girls were those who come for preparation . Easy money This guy has an interesting content profile. I have a feeling he would not be upset if this happened to JNU students in Delhi. He is just upset that fascism has come to bite his ass. Everyday the country strays away from humanity and fuckin logic. Sometimes I just want to castrated half the country so we don’t have kids growing up with values these fuckin power hungry fucks are entitled with. Misleading post. >Kaushik, in his latest post on his Instagram channel “Sab Lok Tantra” claimed that he was a “bold voice of Hindutva, famous journalist, political analyst” who was “picked up under a political conspiracy” by the Punjab Police from UP’s Muzaffarnagar after he “presented some facts on his channels regarding Arvind Kejriwal, his family and Punjab government.” With around 24,000 followers, his Instagram channel describes him as a ‘Political Satirist’. >An FIR against unknown person was registered on the complaint of Alisha Masih, a pastor of a church in Peeru Banda area of Ludhiana. Masih in his complaint said that a video hurting religious sentiments of the Christian community was uploaded on X from a handle named “No conversion”. Masih said he had filed the complaint after seeing online videos and that he never knew who the man was. >CP Chahal said a probe found that Rachit Kaushik was running a handle on X, where he would put many such clips instigating one community against the other. “He is also running many such other handles on YouTube and Instagram, where he gives hate speech and tries to instigate communities,” CP Chahal told The Indian Express. Read more at: There's no reference either to prostitution at LPU by the person who was arrested, or by the police that arrested him. Post removed - please post news from verified sources, not Sanghi twitter handles."
}