{
    "id": "15ozise",
    "title": "Have you watched OMG 2? If yes, is it worth watching?",
    "url": "https://i.redd.it/agmr52pj9nhb1.jpg",
    "selftext": "I'm 21M and I'm planning to watch it with my parents next week. I've taken a day off of my work. Will it be worth the time?\n\nI'd love to know y'alls opinions on the movie.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691830789.0,
    "convurl": "https://i.redd.it/agmr52pj9nhb1.jpg",
    "comments": [
        "Why do you want other's opinion.. go and watch.. what's stopping you...for plot details do Google search and enjoy....",
        "idk man. maybe you'll like maybe you won't. who the hell knows. but i wouldn't skip work for this guy though",
        "It is for sure worth it",
        "Yes must watch",
        "Must watch"
    ],
    "cleaned_text": "watched omg yes worth watching im im planning watch parents next week ive taken day work worth time id love know yalls opinions movie ",
    "cleaned_title": "watched omg yes worth watching",
    "cleaned_selftext": "im im planning watch parents next week ive taken day work worth time id love know yalls opinions movie",
    "cleaned_comments": "want others opinion go watch whats stopping youfor plot details google search enjoy idk man maybe youll like maybe wont hell knows wouldnt skip work guy though sure worth yes must watch must watch",
    "light_cleaned_title": "Have you watched OMG 2? If yes, is it worth watching?",
    "light_cleaned_selftext": "I'm 21M and I'm planning to watch it with my parents next week. I've taken a day off of my work. Will it be worth the time? I'd love to know y'alls opinions on the movie.",
    "light_cleaned_comments": "Why do you want other's opinion.. go and watch.. what's stopping you...for plot details do Google search and enjoy.... idk man. maybe you'll like maybe you won't. who the hell knows. but i wouldn't skip work for this guy though It is for sure worth it Yes must watch Must watch"
}