{
    "id": "15uib47",
    "title": "Sick Society",
    "url": "https://www.reddit.com/r/india/comments/15uib47/sick_society/",
    "selftext": "**Gujarat:**  A Muslim girl student topped her class, but at prize ceremony, she  wasn't named! Only winners of prizes from 2nd number were named! She  cried; teachers told her parents she'd get a prize 'later'! She didn't  want the prize; she wanted recognition, which her school denied!\n\nSource: [https://thehindustangazette.com/latest-news/a-muslim-girl-topper-was-denied-recognition-by-her-school-at-a-prize-ceremony-function-17210](https://thehindustangazette.com/latest-news/a-muslim-girl-topper-was-denied-recognition-by-her-school-at-a-prize-ceremony-function-17210)",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692359204.0,
    "convurl": "https://external-preview.redd.it/EFmTyi9pyCl8evmYJTwsDYAGMDsOdxznXsMlXmF3YCE.jpg?auto=webp&s=344c7a7499111c128c8ae33a0649e10cc6f81a94",
    "comments": [
        "Holy shit",
        "Nah  a fucked up insecure society  .And why give her a prize later nd why drag kids in this religious  hate spewing venom ..",
        "If this news is true, this is yet another proof of how the BJP's lust for power has completely decimated the social fabric of the country. Honestly, no one with an iota of conscience will give a fuck about how many pointy-nosed trains we made if this is the price we paid.",
        "If this is true, it’s really sickening! I am wary of click bait articles so I hope this isn’t true actually.",
        "Not surprised this is from Gujarat, they are by far the most bigoted when it comes to Muslims. My Hindu driver in Gujarat was uncomfortable that we were playing Sufi songs while driving through the state. The constant rioting there since independence also attests to the fact",
        "Welcome to India",
        "Great, we don’t do first so the second in the class is ,,,,,",
        "Genuine news? I don’t see any news article/ channel covering it. Also, looked local news none from it.",
        "My school is shit too \nI topped the school in 10th board examination (air 3)\nBut the school didn't even invite me to its felicitation ceremony and is now refusing to award me my cash prize",
        "You gotta start them young.",
        "It happened in Gujarat.\nI'm not surprised or outraged by it at all. 🤷🏽‍♂️\nThat's how it is there.\nWhat matters is her safety. She's safe, that's more than enough in that fucked up state.\nAlways think of the bare minimum when it comes to states like UP, MP, Gujarat, Haryana, Bihar, Jharkhand, Chhattisgarh, etc.",
        "Was it because she was Muslim?",
        "Yup",
        "Why would they !!!!",
        "https://twitter.com/saliltripathi/status/1692246600049897932",
        "Yeah source isn't reliable",
        "A shameless and uncultured state and a shameless and uncultured country.\n\nWhat else you expected",
        "Well, I mean they will not debate but they do cover news.",
        "Nasty people",
        "Gujarat model",
        "I have no expectations and still disappointed.",
        "This happens only in the state of pm...and damn...he talks about secular India???",
        "Not meaning to paint all Gujarati's with the same color, but the level of obsequiousness to hindutva is just beyond compare.",
        "**You know who**'s state. No wonder.",
        "A generation lost to this religious hatred",
        "Here we go, nazism on full on display",
        "Critu? Is this girl a terrorist?",
        "Suddenly Gujrat sounds like Uttar Pradesh… when did this happen 🤬",
        "Beti bachao…. Pad ke kya ukhad legi 🫣",
        "Other places you named have problems with Muslims in Gujarat they have problems with everyone who's not from their community. A person from Nagaland was beaten for selling chicken momos a dalit was beaten for wearing good clothes and sunglasses. I have stayed there I was also treated the same.",
        "Which city are you in?",
        "Yeah. I was talking about everyone. Not just Muslims. \nThese states have this problem.",
        "Isliye woh log 1st nahi aaye",
        "Bhai kuch kaand kiye the school me ya phir religion/caste ki wajah se?",
        "Disgusting behaviour on part of the school.Will this absolutely cruel behaviour not impact the child ? Will it not cause pain and resentment ? Someone needs to make a big poster with her pic and name as a topper and put it outside her school .",
        "Wrong Sub.",
        "This is pathetic. Even merit does not come above politics for them.",
        "OP post it again without changing the headline title.",
        "Lol! Gujarat was the OG",
        "School chod diya isliye",
        "Lucknow",
        "Thanks for ur certificate. Off course u are the authority which will decide and declare which states are nice and which states are not. And off course u are so reliable and have some real proofs, data to prove ur assessments. I mean the states which aren't in ur list don't have any religious/communal riots or problems,  discrimination against lower castes right?",
        "West Bengal - Discrimination against Hindus and atrocities on lower castes. Communal violence between both communities. \nTamil Nadu- Caste inequality and sedition ideology \nMaharashtra- Literally State supremacist like u.",
        "Smelling jealousy",
        "Thankss for ur assessment.  Off course every state needs certification from ur highness to be considered good. I mean off course that's why the supposedly cultured states have high inflation, poverty, crime rates etc right?",
        "Proof?",
        "Amazing 👏 grammar right there 👏",
        "Oops 😬  I thought socialist, anti capitalism view point was t nazism but guess I was wrong.",
        "Nazi was called national socialist party but was very capitalistic and dictatory",
        "How many communal violences took place in WB??\nIt's true they indulged in appeasement of some Islamic hardliner clerics 2-3 years ago.\nBut, those assholes aren't relevant anymore.\n\nTamil Nadu- those issues aren't that rampant like in the states I've mentioned before.\n\nMaharashtra- demographic shift leads to populism. Lack of integration of the North Indians in Maharashtra led to the situation. It's also the fault of the State Government of Maharashtra. They took no step in integrating the migrants. Learning the language is the first step towards achieving that.",
        "Such problems exist everywhere.\nBut, the states I have mentioned have this the most. That's what I meant.",
        "\" BJP is generalizing Muslims , not all Muslims are terrorists just because few are\"\n\" All gujaratis are a**holes, not like I have met all of em\"\nYeah what I can see is a Bigot. All politically inclined people are bigots. Leftist,  right ... all of u. Bunch of monsters who want to ruin the earth. Let people live Bigots.\n#Bigots_go_to_hell",
        "1l So u believe wb goverment is better then any governments u mentioned? Mamta is the last person I would trust a state with. And ur living under rock if u think communal violence and atrocities against lower castes isn't common in wb. Lynching is Lynching.  Be it on Muslims or ne it on Hindus.\n2] Sedition ideology (especially against India as a union) is only there in handful of states and TM is one of them. \n3) and? Does it change my point?",
        "Yeah maybe? But it's bad to generalize something on some community or region.  That leads to further conflicts and even civil wars sometimes.  Some Muslims are terrorists doesn't mean we start to call Muslims bad. Same with Gujjus.  I wanna ask u how many communal riots u witnessed in gujarat after 2002. That was the big one  but last one in my knowledge.  No big communal violence after that.  And other crime rates are really low here.",
        "You re whalecum"
    ],
    "cleaned_text": "sick society gujarat muslim girl student topped class prize ceremony wasnt named winners prizes nd number named cried teachers told parents shed get prize later didnt want prize wanted recognition school denied source httpsthehindustangazettecomlatestnewsamuslimgirltopperwasdeniedrecognitionbyherschoolataprizeceremonyfunctionhttpsthehindustangazettecomlatestnewsamuslimgirltopperwasdeniedrecognitionbyherschoolataprizeceremonyfunction ",
    "cleaned_title": "sick society",
    "cleaned_selftext": "gujarat muslim girl student topped class prize ceremony wasnt named winners prizes nd number named cried teachers told parents shed get prize later didnt want prize wanted recognition school denied source httpsthehindustangazettecomlatestnewsamuslimgirltopperwasdeniedrecognitionbyherschoolataprizeceremonyfunctionhttpsthehindustangazettecomlatestnewsamuslimgirltopperwasdeniedrecognitionbyherschoolataprizeceremonyfunction",
    "cleaned_comments": "holy shit nah fucked insecure society give prize later nd drag kids religious hate spewing venom news true yet another proof bjps lust power completely decimated social fabric country honestly one iota conscience give fuck many pointynosed trains made price paid true really sickening wary click bait articles hope isnt true actually surprised gujarat far bigoted comes muslims hindu driver gujarat uncomfortable playing sufi songs driving state constant rioting since independence also attests fact welcome india great dont first second class genuine news dont see news article channel covering also looked local news none school shit topped school th board examination air school didnt even invite felicitation ceremony refusing award cash prize got ta start young happened gujarat im surprised outraged thats matters safety shes safe thats enough fucked state always think bare minimum comes states like mp gujarat haryana bihar jharkhand chhattisgarh etc muslim yup would yeah source isnt reliable shameless uncultured state shameless uncultured country else expected well mean debate cover news nasty people gujarat model expectations still disappointed happens state pmand damnhe talks secular india meaning paint gujaratis color level obsequiousness hindutva beyond compare know whos state wonder generation lost religious hatred go nazism full display critu girl terrorist suddenly gujrat sounds like uttar pradesh happen beti bachao pad ke kya ukhad legi places named problems muslims gujarat problems everyone whos community person nagaland beaten selling chicken momos dalit beaten wearing good clothes sunglasses stayed also treated city yeah talking everyone muslims states problem isliye woh log st nahi aaye bhai kuch kaand kiye school ya phir religioncaste ki wajah se disgusting behaviour part schoolwill absolutely cruel behaviour impact child cause pain resentment someone needs make big poster pic name topper put outside school wrong sub pathetic even merit come politics op post without changing headline title lol gujarat og school chod diya isliye lucknow thanks ur certificate course u authority decide declare states nice states course u reliable real proofs data prove ur assessments mean states arent ur list dont religiouscommunal riots problems discrimination lower castes right west bengal discrimination hindus atrocities lower castes communal violence communities tamil nadu caste inequality sedition ideology maharashtra literally state supremacist like u smelling jealousy thankss ur assessment course every state needs certification ur highness considered good mean course thats supposedly cultured states high inflation poverty crime rates etc right proof amazing grammar right oops thought socialist anti capitalism view point nazism guess wrong nazi called national socialist party capitalistic dictatory many communal violences took place wb true indulged appeasement islamic hardliner clerics years ago assholes arent relevant anymore tamil nadu issues arent rampant like states ive mentioned maharashtra demographic shift leads populism lack integration north indians maharashtra led situation also fault state government maharashtra took step integrating migrants learning language first step towards achieving problems exist everywhere states mentioned thats meant bjp generalizing muslims muslims terrorists gujaratis aholes like met em yeah see bigot politically inclined people bigots leftist right u bunch monsters want ruin earth let people live bigots bigotsgotohell l u believe wb goverment better governments u mentioned mamta last person would trust state ur living rock u think communal violence atrocities lower castes isnt common wb lynching lynching muslims ne hindus sedition ideology especially india union handful states tm one change point yeah maybe bad generalize something community region leads conflicts even civil wars sometimes muslims terrorists doesnt mean start call muslims bad gujjus wan na ask u many communal riots u witnessed gujarat big one last one knowledge big communal violence crime rates really low whalecum",
    "light_cleaned_title": "Sick Society",
    "light_cleaned_selftext": "**Gujarat:** A Muslim girl student topped her class, but at prize ceremony, she wasn't named! Only winners of prizes from 2nd number were named! She cried; teachers told her parents she'd get a prize 'later'! She didn't want the prize; she wanted recognition, which her school denied! Source: [https://thehindustangazette.com/latest-news/a-muslim-girl-topper-was-denied-recognition-by-her-school-at-a-prize-ceremony-function-17210](https://thehindustangazette.com/latest-news/a-muslim-girl-topper-was-denied-recognition-by-her-school-at-a-prize-ceremony-function-17210)",
    "light_cleaned_comments": "Holy shit Nah a fucked up insecure society .And why give her a prize later nd why drag kids in this religious hate spewing venom .. If this news is true, this is yet another proof of how the BJP's lust for power has completely decimated the social fabric of the country. Honestly, no one with an iota of conscience will give a fuck about how many pointy-nosed trains we made if this is the price we paid. If this is true, it’s really sickening! I am wary of click bait articles so I hope this isn’t true actually. Not surprised this is from Gujarat, they are by far the most bigoted when it comes to Muslims. My Hindu driver in Gujarat was uncomfortable that we were playing Sufi songs while driving through the state. The constant rioting there since independence also attests to the fact Welcome to India Great, we don’t do first so the second in the class is ,,,,, Genuine news? I don’t see any news article/ channel covering it. Also, looked local news none from it. My school is shit too I topped the school in 10th board examination (air 3) But the school didn't even invite me to its felicitation ceremony and is now refusing to award me my cash prize You gotta start them young. It happened in Gujarat. I'm not surprised or outraged by it at all. 🤷🏽‍♂️ That's how it is there. What matters is her safety. She's safe, that's more than enough in that fucked up state. Always think of the bare minimum when it comes to states like UP, MP, Gujarat, Haryana, Bihar, Jharkhand, Chhattisgarh, etc. Was it because she was Muslim? Yup Why would they !!!! Yeah source isn't reliable A shameless and uncultured state and a shameless and uncultured country. What else you expected Well, I mean they will not debate but they do cover news. Nasty people Gujarat model I have no expectations and still disappointed. This happens only in the state of pm...and damn...he talks about secular India??? Not meaning to paint all Gujarati's with the same color, but the level of obsequiousness to hindutva is just beyond compare. **You know who**'s state. No wonder. A generation lost to this religious hatred Here we go, nazism on full on display Critu? Is this girl a terrorist? Suddenly Gujrat sounds like Uttar Pradesh… when did this happen 🤬 Beti bachao…. Pad ke kya ukhad legi 🫣 Other places you named have problems with Muslims in Gujarat they have problems with everyone who's not from their community. A person from Nagaland was beaten for selling chicken momos a dalit was beaten for wearing good clothes and sunglasses. I have stayed there I was also treated the same. Which city are you in? Yeah. I was talking about everyone. Not just Muslims. These states have this problem. Isliye woh log 1st nahi aaye Bhai kuch kaand kiye the school me ya phir religion/caste ki wajah se? Disgusting behaviour on part of the school.Will this absolutely cruel behaviour not impact the child ? Will it not cause pain and resentment ? Someone needs to make a big poster with her pic and name as a topper and put it outside her school . Wrong Sub. This is pathetic. Even merit does not come above politics for them. OP post it again without changing the headline title. Lol! Gujarat was the OG School chod diya isliye Lucknow Thanks for ur certificate. Off course u are the authority which will decide and declare which states are nice and which states are not. And off course u are so reliable and have some real proofs, data to prove ur assessments. I mean the states which aren't in ur list don't have any religious/communal riots or problems, discrimination against lower castes right? West Bengal - Discrimination against Hindus and atrocities on lower castes. Communal violence between both communities. Tamil Nadu- Caste inequality and sedition ideology Maharashtra- Literally State supremacist like u. Smelling jealousy Thankss for ur assessment. Off course every state needs certification from ur highness to be considered good. I mean off course that's why the supposedly cultured states have high inflation, poverty, crime rates etc right? Proof? Amazing 👏 grammar right there 👏 Oops 😬 I thought socialist, anti capitalism view point was t nazism but guess I was wrong. Nazi was called national socialist party but was very capitalistic and dictatory How many communal violences took place in WB?? It's true they indulged in appeasement of some Islamic hardliner clerics 2-3 years ago. But, those assholes aren't relevant anymore. Tamil Nadu- those issues aren't that rampant like in the states I've mentioned before. Maharashtra- demographic shift leads to populism. Lack of integration of the North Indians in Maharashtra led to the situation. It's also the fault of the State Government of Maharashtra. They took no step in integrating the migrants. Learning the language is the first step towards achieving that. Such problems exist everywhere. But, the states I have mentioned have this the most. That's what I meant. \" BJP is generalizing Muslims , not all Muslims are terrorists just because few are\" \" All gujaratis are a**holes, not like I have met all of em\" Yeah what I can see is a Bigot. All politically inclined people are bigots. Leftist, right ... all of u. Bunch of monsters who want to ruin the earth. Let people live Bigots. #Bigots_go_to_hell 1l So u believe wb goverment is better then any governments u mentioned? Mamta is the last person I would trust a state with. And ur living under rock if u think communal violence and atrocities against lower castes isn't common in wb. Lynching is Lynching. Be it on Muslims or ne it on Hindus. 2] Sedition ideology (especially against India as a union) is only there in handful of states and TM is one of them. 3) and? Does it change my point? Yeah maybe? But it's bad to generalize something on some community or region. That leads to further conflicts and even civil wars sometimes. Some Muslims are terrorists doesn't mean we start to call Muslims bad. Same with Gujjus. I wanna ask u how many communal riots u witnessed in gujarat after 2002. That was the big one but last one in my knowledge. No big communal violence after that. And other crime rates are really low here. You re whalecum"
}