{
    "id": "14t4hnc",
    "title": "US ready to help in Manipur if asked, says Garcetti",
    "url": "https://www.reddit.com/r/india/comments/14t4hnc/us_ready_to_help_in_manipur_if_asked_says_garcetti/",
    "selftext": " \n\n## US ambassador to India Eric Garcetti said Manipur situation is of human concern and one does not have to be an Indian to care for loss of lives in violence.\n\n On a question pertaining to Manipur violence, US ambassador to India [Eric Garcetti ](https://www.hindustantimes.com/world-news/who-is-eric-garcetti-the-new-us-ambassador-to-india-5-points-101678915376828.html)who was in Kolkata on Thursday said the US is ready to assist in any way if asked to resolve the crisis and the northeast can't prosper without peace. Noting that this is an internal matter of India, Eric Garcetti said the US does not have any strategic concerns but it has human concerns. The comment drew a response from Congress MP Manish Tewari who said it is very rare for a US envoy to make a statement \"of this nature about the internal affairs of India\". \n\n[https://www.hindustantimes.com/india-news/us-ready-to-help-in-manipur-if-asked-says-garcetti-never-heard-statement-of-this-nature-cong-leader-101688697463278.html](https://www.hindustantimes.com/india-news/us-ready-to-help-in-manipur-if-asked-says-garcetti-never-heard-statement-of-this-nature-cong-leader-101688697463278.html)\n\nIts an Internal matter of India but when our Honourable P.M refuses to utter a single word even after more than 60 days, i say make it an international matter.",
    "flair": "Politics",
    "score": 248,
    "num_comments": 63,
    "created_utc": 1688729033.0,
    "convurl": "https://external-preview.redd.it/0oaEEd_Lzz6yaF_yW31AJJxpYPgAuFbEyoNPJ03dgXc.jpg?auto=webp&s=5b1cb8bb76ee9eb0b189bd2b5c274a6c310d4346",
    "comments": [
        "Anti national amreekan",
        "Afghanistan-kaal?",
        "Ab Jaishankar finally \"internal matter \" Bodega..",
        "Vishwaguru moment!!!!",
        "What kind of peace will America bring, like Afghanistan or like Iraq or like Libya?",
        "Americans and value for other humans lives, don't go hand in hand.",
        "I mean he was talking about getting investments in Eastern and North Eastern parts of the country and was stating about how stability would be a factor to get it. \n\nAlthough, surely if he has read about Indian culture, what was he thinking, he wants to go back or what?",
        "Bhai tu rehne de",
        "If your concern for your country's (already quite shitty) reputation on the world stage is higher than your concern for your compatriots' lives, congratulations. You are an average Indian.",
        "American opportunism aside, Modi ji ab to kuch bol do! Mera Manipur jal raha he!",
        "US only helps itself by ruining other countries.",
        "I am not concerned about my country's reputation. People who preach must practice.",
        "Maybe like Vietnam?",
        "Yeah thats definitely what u/pijd said. Next up we should call North Korea to teach us about Democracy.",
        "Isnt it fucking wild that we had deployed 40,000+ troops all the way from police to paramilitary to army deployed to quell the unrest. Yet our Prime Minister still hasnt said anything. \n\nIn what other democracy will a man like him stay in power?",
        "I didn't know we'd struck oil in Manipur",
        "Chirate chirate khud Manmohan Singh ban geya~",
        "India in exchange can help with shooting at school issues. Problems solved for both countries.",
        "Fun fact: North East has more insurgency than Kashmir. News from North East is usually blocked. There is plenty of armed forces deployment there.",
        "Nope. We don't want Northeast to be the next Middle East.",
        "Tiktokiya reals incoming with Gigachad EAM.",
        "Ukraine?",
        "Phucking Bidesi Sajis.",
        "We preach democracy and plurality everywhere we go. Maybe we ought to hold our own country accountable before we jump to criticize a move by the US that will at the very least force our government to appear to be doing something about manipur. Which would be an improvement.",
        "Yup. AFSPA is heavily used in NE as well. Generated quite a controversy when it was renewed a few years back",
        "That's because insurgents in NE are fucking animals. They not only just shoot, they come back to make sure to kill ya. They make Kashmir insurgents looks like school kids. No wonder there is a World famous jungle warfare school set up in NE area.",
        "It doesn't have to be Jaishankar either. BJP cabinet members are notorious for reacting to matters out of their allotted ministries. Especially, Ms. Sitaraman.",
        "[You jest, but there is some truth in it. Many even believe the current violence is a ploy to drive out the Tribals Kuki from their inhabited areas in the Hills Districts where these oil reserve are found. ](https://www.thestatesman.com/cities/no-oil-exploration-1502449397.html)",
        "Lmao. Kuki propaganda at play. Majority of Hill regions are owned by the Naga tribes. Kukis were \"rented\" land by the nagas when Kukis were brought by the Britishers from Myanmar. \n\nIf the crisis was solely because of oil (which btw is unconfirmed and even more expensive to drill) , then why are the Naga tribes not fighting against the valley people? \n\nYou can't try to hide the Separationist/Kukiland propaganda by masking it with the narrative that valley people want your land for oil. Give me a break!"
    ],
    "cleaned_text": "us ready help manipur asked says garcetti us ambassador india eric garcetti said manipur situation human concern one indian care loss lives violence question pertaining manipur violence us ambassador india eric garcetti httpswwwhindustantimescomworldnewswhoisericgarcettithenewusambassadortoindiapointshtmlwho kolkata thursday said us ready assist way asked resolve crisis northeast cant prosper without peace noting internal matter india eric garcetti said us strategic concerns human concerns comment drew response congress mp manish tewari said rare us envoy make statement nature internal affairs india httpswwwhindustantimescomindianewsusreadytohelpinmanipurifaskedsaysgarcettineverheardstatementofthisnaturecongleaderhtmlhttpswwwhindustantimescomindianewsusreadytohelpinmanipurifaskedsaysgarcettineverheardstatementofthisnaturecongleaderhtml internal matter india honourable pm refuses utter single word even days say make international matter ",
    "cleaned_title": "us ready help manipur asked says garcetti",
    "cleaned_selftext": "us ambassador india eric garcetti said manipur situation human concern one indian care loss lives violence question pertaining manipur violence us ambassador india eric garcetti httpswwwhindustantimescomworldnewswhoisericgarcettithenewusambassadortoindiapointshtmlwho kolkata thursday said us ready assist way asked resolve crisis northeast cant prosper without peace noting internal matter india eric garcetti said us strategic concerns human concerns comment drew response congress mp manish tewari said rare us envoy make statement nature internal affairs india httpswwwhindustantimescomindianewsusreadytohelpinmanipurifaskedsaysgarcettineverheardstatementofthisnaturecongleaderhtmlhttpswwwhindustantimescomindianewsusreadytohelpinmanipurifaskedsaysgarcettineverheardstatementofthisnaturecongleaderhtml internal matter india honourable pm refuses utter single word even days say make international matter",
    "cleaned_comments": "anti national amreekan afghanistankaal ab jaishankar finally internal matter bodega vishwaguru moment kind peace america bring like afghanistan like iraq like libya americans value humans lives dont go hand hand mean talking getting investments eastern north eastern parts country stating stability would factor get although surely read indian culture thinking wants go back bhai tu rehne de concern countrys already quite shitty reputation world stage higher concern compatriots lives congratulations average indian american opportunism aside modi ji ab kuch bol mera manipur jal raha us helps ruining countries concerned countrys reputation people preach must practice maybe like vietnam yeah thats definitely upijd said next call north korea teach us democracy isnt fucking wild deployed troops way police paramilitary army deployed quell unrest yet prime minister still hasnt said anything democracy man like stay power didnt know wed struck oil manipur chirate chirate khud manmohan singh ban geya india exchange help shooting school issues problems solved countries fun fact north east insurgency kashmir news north east usually blocked plenty armed forces deployment nope dont want northeast next middle east tiktokiya reals incoming gigachad eam ukraine phucking bidesi sajis preach democracy plurality everywhere go maybe ought hold country accountable jump criticize move us least force government appear something manipur would improvement yup afspa heavily used ne well generated quite controversy renewed years back thats insurgents ne fucking animals shoot come back make sure kill ya make kashmir insurgents looks like school kids wonder world famous jungle warfare school set ne area doesnt jaishankar either bjp cabinet members notorious reacting matters allotted ministries especially ms sitaraman jest truth many even believe current violence ploy drive tribals kuki inhabited areas hills districts oil reserve found httpswwwthestatesmancomcitiesnooilexplorationhtml lmao kuki propaganda play majority hill regions owned naga tribes kukis rented land nagas kukis brought britishers myanmar crisis solely oil btw unconfirmed even expensive drill naga tribes fighting valley people cant try hide separationistkukiland propaganda masking narrative valley people want land oil give break",
    "light_cleaned_title": "US ready to help in Manipur if asked, says Garcetti",
    "light_cleaned_selftext": "## US ambassador to India Eric Garcetti said Manipur situation is of human concern and one does not have to be an Indian to care for loss of lives in violence. On a question pertaining to Manipur violence, US ambassador to India [Eric Garcetti ](https://www.hindustantimes.com/world-news/who-is-eric-garcetti-the-new-us-ambassador-to-india-5-points-101678915376828.html)who was in Kolkata on Thursday said the US is ready to assist in any way if asked to resolve the crisis and the northeast can't prosper without peace. Noting that this is an internal matter of India, Eric Garcetti said the US does not have any strategic concerns but it has human concerns. The comment drew a response from Congress MP Manish Tewari who said it is very rare for a US envoy to make a statement \"of this nature about the internal affairs of India\". [https://www.hindustantimes.com/india-news/us-ready-to-help-in-manipur-if-asked-says-garcetti-never-heard-statement-of-this-nature-cong-leader-101688697463278.html](https://www.hindustantimes.com/india-news/us-ready-to-help-in-manipur-if-asked-says-garcetti-never-heard-statement-of-this-nature-cong-leader-101688697463278.html) Its an Internal matter of India but when our Honourable P.M refuses to utter a single word even after more than 60 days, i say make it an international matter.",
    "light_cleaned_comments": "Anti national amreekan Afghanistan-kaal? Ab Jaishankar finally \"internal matter \" Bodega.. Vishwaguru moment!!!! What kind of peace will America bring, like Afghanistan or like Iraq or like Libya? Americans and value for other humans lives, don't go hand in hand. I mean he was talking about getting investments in Eastern and North Eastern parts of the country and was stating about how stability would be a factor to get it. Although, surely if he has read about Indian culture, what was he thinking, he wants to go back or what? Bhai tu rehne de If your concern for your country's (already quite shitty) reputation on the world stage is higher than your concern for your compatriots' lives, congratulations. You are an average Indian. American opportunism aside, Modi ji ab to kuch bol do! Mera Manipur jal raha he! US only helps itself by ruining other countries. I am not concerned about my country's reputation. People who preach must practice. Maybe like Vietnam? Yeah thats definitely what u/pijd said. Next up we should call North Korea to teach us about Democracy. Isnt it fucking wild that we had deployed 40,000+ troops all the way from police to paramilitary to army deployed to quell the unrest. Yet our Prime Minister still hasnt said anything. In what other democracy will a man like him stay in power? I didn't know we'd struck oil in Manipur Chirate chirate khud Manmohan Singh ban geya~ India in exchange can help with shooting at school issues. Problems solved for both countries. Fun fact: North East has more insurgency than Kashmir. News from North East is usually blocked. There is plenty of armed forces deployment there. Nope. We don't want Northeast to be the next Middle East. Tiktokiya reals incoming with Gigachad EAM. Ukraine? Phucking Bidesi Sajis. We preach democracy and plurality everywhere we go. Maybe we ought to hold our own country accountable before we jump to criticize a move by the US that will at the very least force our government to appear to be doing something about manipur. Which would be an improvement. Yup. AFSPA is heavily used in NE as well. Generated quite a controversy when it was renewed a few years back That's because insurgents in NE are fucking animals. They not only just shoot, they come back to make sure to kill ya. They make Kashmir insurgents looks like school kids. No wonder there is a World famous jungle warfare school set up in NE area. It doesn't have to be Jaishankar either. BJP cabinet members are notorious for reacting to matters out of their allotted ministries. Especially, Ms. Sitaraman. [You jest, but there is some truth in it. Many even believe the current violence is a ploy to drive out the Tribals Kuki from their inhabited areas in the Hills Districts where these oil reserve are found. ](https://www.thestatesman.com/cities/no-oil-exploration-1502449397.html) Lmao. Kuki propaganda at play. Majority of Hill regions are owned by the Naga tribes. Kukis were \"rented\" land by the nagas when Kukis were brought by the Britishers from Myanmar. If the crisis was solely because of oil (which btw is unconfirmed and even more expensive to drill) , then why are the Naga tribes not fighting against the valley people? You can't try to hide the Separationist/Kukiland propaganda by masking it with the narrative that valley people want your land for oil. Give me a break!"
}