{
    "id": "16adzcu",
    "title": "India’s Economy 16.5 Years Behind China’s: Bernstein Research Report",
    "url": "https://www.reddit.com/r/india/comments/16adzcu/indias_economy_165_years_behind_chinas_bernstein/",
    "selftext": "India is a median 16.5 years behind China in broad business and economic parameters, according to a recent research by brokerage firm Bernstein. The report measured the gap by looking at various yardsticks such as patents, foreign direct investment (FDI), forex reserves, nominal GDP, and exports. India is behind China by 21 years in patents, 20 years in FDI, 19 years in forex reserves, and 17 years in exports. India is 15 years behind in nominal GDP and per capita income, 13 years behind in consumption expenditure, and 16 years behind in gross fixed capital formation.\n\nBernstein's analysis is based on data from the Reserve Bank of India (RBI), China's National Bureau of Statistics, the Ministry of Statistics and Programme Implementation, the World Bank, and the World Intellectual Property Organization. China being ahead of India in these parameters is understandable given that India's GDP was only the 11th largest in the world a decade ago. However, in recent years, India became the fifth largest economy, with its GDP of $3.53 trillion pushing ahead of the UK's $3.38 trillion.\n\nIndia aims to hit $10 trillion by 2030, a target experts say is very achievable. Business Standard suggests that India can leverage the slowing down of Chinese growth by leveraging geopolitical tensions between the US and China. India has managed to persuade global companies manufacturing in China to shift manufacturing capacity to the country and export a large part of its production. India also has a growing young workforce with lower labour costs than China, but China's productivity per labor is far higher.\n\nhttps://m.thewire.in/article/economy/indias-economy-16-5-years-behind-chinas-bernstein-research-report",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693887500.0,
    "convurl": "https://external-preview.redd.it/lJRiaywEtXROniTGrNoE_yqQqcNbsdiMCv-4Sd0x3GM.jpg?auto=webp&s=bce362238d13c3e373327adaed4fff066bf1f77a",
    "comments": [],
    "cleaned_text": "indias economy years behind chinas bernstein research report india median years behind china broad business economic parameters according recent research brokerage firm bernstein report measured gap looking various yardsticks patents foreign direct investment fdi forex reserves nominal gdp exports india behind china years patents years fdi years forex reserves years exports india years behind nominal gdp per capita income years behind consumption expenditure years behind gross fixed capital formation bernsteins analysis based data reserve bank india rbi chinas national bureau statistics ministry statistics programme implementation world bank world intellectual property organization china ahead india parameters understandable given indias gdp th largest world decade ago however recent years india became fifth largest economy gdp trillion pushing ahead uks trillion india aims hit trillion target experts say achievable business standard suggests india leverage slowing chinese growth leveraging geopolitical tensions us china india managed persuade global companies manufacturing china shift manufacturing capacity country export large part production india also growing young workforce lower labour costs china chinas productivity per labor far higher ",
    "cleaned_title": "indias economy years behind chinas bernstein research report",
    "cleaned_selftext": "india median years behind china broad business economic parameters according recent research brokerage firm bernstein report measured gap looking various yardsticks patents foreign direct investment fdi forex reserves nominal gdp exports india behind china years patents years fdi years forex reserves years exports india years behind nominal gdp per capita income years behind consumption expenditure years behind gross fixed capital formation bernsteins analysis based data reserve bank india rbi chinas national bureau statistics ministry statistics programme implementation world bank world intellectual property organization china ahead india parameters understandable given indias gdp th largest world decade ago however recent years india became fifth largest economy gdp trillion pushing ahead uks trillion india aims hit trillion target experts say achievable business standard suggests india leverage slowing chinese growth leveraging geopolitical tensions us china india managed persuade global companies manufacturing china shift manufacturing capacity country export large part production india also growing young workforce lower labour costs china chinas productivity per labor far higher",
    "cleaned_comments": "",
    "light_cleaned_title": "India’s Economy 16.5 Years Behind China’s: Bernstein Research Report",
    "light_cleaned_selftext": "India is a median 16.5 years behind China in broad business and economic parameters, according to a recent research by brokerage firm Bernstein. The report measured the gap by looking at various yardsticks such as patents, foreign direct investment (FDI), forex reserves, nominal GDP, and exports. India is behind China by 21 years in patents, 20 years in FDI, 19 years in forex reserves, and 17 years in exports. India is 15 years behind in nominal GDP and per capita income, 13 years behind in consumption expenditure, and 16 years behind in gross fixed capital formation. Bernstein's analysis is based on data from the Reserve Bank of India (RBI), China's National Bureau of Statistics, the Ministry of Statistics and Programme Implementation, the World Bank, and the World Intellectual Property Organization. China being ahead of India in these parameters is understandable given that India's GDP was only the 11th largest in the world a decade ago. However, in recent years, India became the fifth largest economy, with its GDP of $3.53 trillion pushing ahead of the UK's $3.38 trillion. India aims to hit $10 trillion by 2030, a target experts say is very achievable. Business Standard suggests that India can leverage the slowing down of Chinese growth by leveraging geopolitical tensions between the US and China. India has managed to persuade global companies manufacturing in China to shift manufacturing capacity to the country and export a large part of its production. India also has a growing young workforce with lower labour costs than China, but China's productivity per labor is far higher.",
    "light_cleaned_comments": ""
}