{
    "id": "1dexreb",
    "title": "Amazon do better!",
    "url": "https://www.reddit.com/r/india/comments/1dexreb/amazon_do_better/",
    "selftext": "We all shop at Amazon, but let's take a moment to acknowledge the people working in the warehouses and making deliveries for us.\n\n🔥Recently, reports have emerged of workers being subjected to sweltering conditions and being asked to pledge not to take any water or restroom breaks until targets are met. Furthermore, there are inadequate resting areas and ventilation at the workplace.\n\n📢 Despite Amazon's turnover for the financial year 2023 stands at INR 222 billion, workers continue to endure miserable conditions and low wages. They are expected to stand for 10 hours with unrealistic work targets, even during heat waves when temperatures go above forty-seven degrees in the afternoons.\n\nAmazon has frequently faced criticism for its inhumane working conditions and exploitation of workers. However, Amazon cannot exist without its workers.👉🏽 Let's ensure Amazon pays them respectable wages and provides dignified working conditions.\n\nJoin us at[ Jhatkaa.org](http://jhatkaa.org) in making a strong case for Amazon to do better. We have been campaigning for workers' rights and invite you to sign the petition to ensure that you are not only standing with Amazon’s warehouse workers in India but are also demanding accountability from large corporations like Amazon that flout workers’ rights globally. ✊🏽[ Sign our petition](https://act.jhatkaa.org/campaigns/make-amazonpay?utm_source=reddit&utm_medium=reddit&utm_campaign=reddit_20240613) demanding that Amazon India:\n\n* Implements a minimum salary of INR 25,000 for all warehouse workers.\n* Regularize part-time workers.\n* Provides adequate rest, sanitation, and hygiene facilities for all workers.\n* Sets practical and humane work targets.\n* Properly compensates all workers for work-related accidents\n\nhttps://preview.redd.it/psdjr1n21c6d1.jpg?width=512&format=pjpg&auto=webp&s=fe51b635f2dcfd939cde8fb2f07c482f79af9169",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1718281629.0,
    "convurl": "https://external-preview.redd.it/xlPHNZ8TeFXTu-wAdJKysL9gS4DtB9UNgfN71044UFI.jpg?auto=webp&s=59e3f8a4d42f0176c9391bece24c846503e721f9",
    "comments": [
        "This is the best way to drive companies outside India. Stupid as fuck. \n\nI'm sure you guys will move on to your next target when Amazon decides to shut shop or automate their FCs and thousands will be unemployed. This kind of socialist thinking is what has kept India backwards."
    ],
    "cleaned_text": "amazon better shop amazon lets take moment acknowledge people working warehouses making deliveries us recently reports emerged workers subjected sweltering conditions asked pledge take water restroom breaks targets met furthermore inadequate resting areas ventilation workplace despite amazons turnover financial year stands inr billion workers continue endure miserable conditions low wages expected stand hours unrealistic work targets even heat waves temperatures go fortyseven degrees afternoons amazon frequently faced criticism inhumane working conditions exploitation workers however amazon exist without workers lets ensure amazon pays respectable wages provides dignified working conditions join us jhatkaaorghttpjhatkaaorg making strong case amazon better campaigning workers rights invite sign petition ensure standing amazons warehouse workers india also demanding accountability large corporations like amazon flout workers rights globally sign petitionhttpsactjhatkaaorgcampaignsmakeamazonpayutmsourceredditutmmediumredditutmcampaignreddit demanding amazon india implements minimum salary inr warehouse workers regularize parttime workers provides adequate rest sanitation hygiene facilities workers sets practical humane work targets properly compensates workers workrelated accidents ",
    "cleaned_title": "amazon better",
    "cleaned_selftext": "shop amazon lets take moment acknowledge people working warehouses making deliveries us recently reports emerged workers subjected sweltering conditions asked pledge take water restroom breaks targets met furthermore inadequate resting areas ventilation workplace despite amazons turnover financial year stands inr billion workers continue endure miserable conditions low wages expected stand hours unrealistic work targets even heat waves temperatures go fortyseven degrees afternoons amazon frequently faced criticism inhumane working conditions exploitation workers however amazon exist without workers lets ensure amazon pays respectable wages provides dignified working conditions join us jhatkaaorghttpjhatkaaorg making strong case amazon better campaigning workers rights invite sign petition ensure standing amazons warehouse workers india also demanding accountability large corporations like amazon flout workers rights globally sign petitionhttpsactjhatkaaorgcampaignsmakeamazonpayutmsourceredditutmmediumredditutmcampaignreddit demanding amazon india implements minimum salary inr warehouse workers regularize parttime workers provides adequate rest sanitation hygiene facilities workers sets practical humane work targets properly compensates workers workrelated accidents",
    "cleaned_comments": "best way drive companies outside india stupid fuck im sure guys move next target amazon decides shut shop automate fcs thousands unemployed kind socialist thinking kept india backwards",
    "light_cleaned_title": "Amazon do better!",
    "light_cleaned_selftext": "We all shop at Amazon, but let's take a moment to acknowledge the people working in the warehouses and making deliveries for us. 🔥Recently, reports have emerged of workers being subjected to sweltering conditions and being asked to pledge not to take any water or restroom breaks until targets are met. Furthermore, there are inadequate resting areas and ventilation at the workplace. 📢 Despite Amazon's turnover for the financial year 2023 stands at INR 222 billion, workers continue to endure miserable conditions and low wages. They are expected to stand for 10 hours with unrealistic work targets, even during heat waves when temperatures go above forty-seven degrees in the afternoons. Amazon has frequently faced criticism for its inhumane working conditions and exploitation of workers. However, Amazon cannot exist without its workers.👉🏽 Let's ensure Amazon pays them respectable wages and provides dignified working conditions. Join us at[ Jhatkaa.org](http://jhatkaa.org) in making a strong case for Amazon to do better. We have been campaigning for workers' rights and invite you to sign the petition to ensure that you are not only standing with Amazon’s warehouse workers in India but are also demanding accountability from large corporations like Amazon that flout workers’ rights globally. ✊🏽[ Sign our petition](https://act.jhatkaa.org/campaigns/make-amazonpay?utm_source=reddit&utm_medium=reddit&utm_campaign=reddit_20240613) demanding that Amazon India: * Implements a minimum salary of INR 25,000 for all warehouse workers. * Regularize part-time workers. * Provides adequate rest, sanitation, and hygiene facilities for all workers. * Sets practical and humane work targets. * Properly compensates all workers for work-related accidents",
    "light_cleaned_comments": "This is the best way to drive companies outside India. Stupid as fuck. I'm sure you guys will move on to your next target when Amazon decides to shut shop or automate their FCs and thousands will be unemployed. This kind of socialist thinking is what has kept India backwards."
}