{
    "id": "18uhgjd",
    "title": "Mumbai: Man Blows Smoke Into Woman’s Face, Kills Her Dad",
    "url": "https://www.freepressjournal.in/mumbai/mumbai-man-blows-smoke-into-womans-face-kills-her-dad",
    "selftext": "Francis Fernandes was standing with his wife and daughter near a store in Chapel road, bandra late night. 23 year old Abbas Muhammad Shaikh came near them and started smoking cigarette on her daughter's face. When the father resisted, he was attacked by Mr Shaikh and later joined by his friends. He was murdered cold blooded in a \"posh\" area like bandra.",
    "flair": "Crime",
    "score": 280,
    "num_comments": 33,
    "created_utc": 1703948421.0,
    "convurl": "https://external-preview.redd.it/HeXJulDclC9XFoIJXZ3qvYqeHz_Mm6nECxhYv0bsmps.jpg?auto=webp&s=1c51aaaca9eddec757479dfffecee46c1179c767",
    "comments": [
        "Sad news",
        "Bandra is filled with Muslims",
        "This is where that Salman Khan, Sharukh Dunki Khan lives right and lots of fans goto to see them correct? Maybe one of the fans did it after seeing their movies?",
        "Mumbai is becoming crime capital, general u hear such news from UP/Bihar states but killing some1 just coz they told u dont smoke at them is next level of cold blood",
        "2 stroke filles air you could cut but making a fuss of inhaling basically filtering a burning plant with your lungs.",
        "I thought ye yaha post nahi hoga🤐",
        "wtf",
        "Bandra east invading Bandra west.",
        "Irony is such characters are usually from UP, bihar itself",
        "I know right. Poor guy had to kill the man for his \"fuss\". /s",
        "If you ever wonder why some Indians dream of emigration: for all it's many faults Western countries can provide safety and personal liberty that you will never find in Mumbai even after a thousand years of GDP growth.",
        "Not all western countries are safe. Especially for Indians. I don't need to speak about USA. I personally know a friend who got beaten up by drunk locals in Australia because he was Indian. You're gonna be treated as an outsider abroad all your life.",
        "Wasn't there recently as case in the US where an Indian student was run over by a policeman? And he seemed to not care much about it?",
        "There’s assholes everywhere\n\nhttps://www.cbc.ca/amp/1.6795679\n\nThis was big news close to where I work",
        "The bylanes of Bandra are not safe.",
        "I have lived outside India for a couple of years and travelled extensively to other countries. Counties that your term safe are not so safe especially if you are an outsider.",
        "smokers ..why you do this bs",
        "The other subs suppress the news if it goes against their ideology. This one doesn't.\n\nThere's a reason they're called andhbhakts. They don't want to see what they don't believe.",
        "Ayoo I just use it as a laxative my man.",
        "apradhi ka naam 'MOHAMMAD SHEIKH' hai",
        "Peaceful group se kya?",
        "haa",
        "It is a pretty common thought across Indians, that a move to a \"developed\" country is gonna fix everything that's wrong in India. Mostly it does, but you'll encounter a new set of problems which will haunt you day in day out. \n\nI've been to France for a 3 month exchange semester, the last 2-3 weeks when the novelty has worn out, I was just waiting for the return flight back to India, and so did most of my friends, some even preponed their flights.\n\nThe grass is always greener on the other side.",
        "CA",
        "What problems besides expensive?",
        "* Casual racism: For example we visited Amsterdam for a week, the house owner didn't mention any policies while we were booking the house for a week. On the day of checkin, a person (caretaker) showed up who works for the owner and was visually disgusted at the sight of us, asked whether we were Indians and explained the house rules the most condescending way possible. 2 days in we asked for dryer facility which a lot of reviews on airbnb site mentioned was available in the building, upon request he denied such a thing existed and on our last day the owner replied that indeed there was a dryer facility and gave us guidelines on how to use it, upon confronting the caretaker, with a straighface he said \"the last time Indians checked in the house they broke the dryer, so I was skeptical giving the info\". Mind you this wasn't just a one off incident, I have loads of other incidents faced by me, my friends mostly in Italy, Swiss, France, Germany. **Simple things like people clutching their baggage at the sight of us, used to bother us a lot.**\n* Culture: You are always an outsider, couldnt make one good friend other than ones I met in college (exchange semester), and actually I made effort to talk to a lot of people. This was more prevalent in western Europe. I understand this might not bother most, but I was.\n* Food: It sucked big time, visited all the popular food places with great reviews barring few rest were just underwhelming at best. Once again it might just be a personal thing.\n* Travel:  As good as it is in most places, inter country train travel left us stranded at remote locations multiple times. The reasons vary from delay, cancellations, malfunctions, train strikes, weather.\n* Weather: It was always grey, cold and wet. I understand I visted during the winter, but the last two months (November, December) I was just miserable.\n\nAll these problems, money could be the easiest solution, but everything was damn expensive. For example, due to a malfunction we were deserted in a station nearby Naples at 11pm. The next train was 5 am in the morning, so we had two options: 1) Sleep in the station (even the locals warned it wasnt safe) 2) Pay for a cab that was costing 10000 for a 40 min ride. Simple things like water costed us 2-3 euros. Want to take a piss? shell out 1-3 euros. A 10 min bus ride? pay up 5 euros (Venice).\n\nThese were my experiences and few from my friends, that made me conclude that India was better for me!",
        "Depending on where you live in India, you’ll be treated as an outsider too",
        "good to explain the s*** part..please explain the bull part too"
    ],
    "cleaned_text": "mumbai man blows smoke womans face kills dad francis fernandes standing wife daughter near store chapel road bandra late night year old abbas muhammad shaikh came near started smoking cigarette daughters face father resisted attacked mr shaikh later joined friends murdered cold blooded posh area like bandra ",
    "cleaned_title": "mumbai man blows smoke womans face kills dad",
    "cleaned_selftext": "francis fernandes standing wife daughter near store chapel road bandra late night year old abbas muhammad shaikh came near started smoking cigarette daughters face father resisted attacked mr shaikh later joined friends murdered cold blooded posh area like bandra",
    "cleaned_comments": "sad news bandra filled muslims salman khan sharukh dunki khan lives right lots fans goto see correct maybe one fans seeing movies mumbai becoming crime capital general u hear news upbihar states killing coz told u dont smoke next level cold blood stroke filles air could cut making fuss inhaling basically filtering burning plant lungs thought ye yaha post nahi hoga wtf bandra east invading bandra west irony characters usually bihar know right poor guy kill man fuss ever wonder indians dream emigration many faults western countries provide safety personal liberty never find mumbai even thousand years gdp growth western countries safe especially indians dont need speak usa personally know friend got beaten drunk locals australia indian youre gon na treated outsider abroad life wasnt recently case us indian student run policeman seemed care much theres assholes everywhere big news close work bylanes bandra safe lived outside india couple years travelled extensively countries counties term safe safe especially outsider smokers bs subs suppress news goes ideology one doesnt theres reason theyre called andhbhakts dont want see dont believe ayoo use laxative man apradhi ka naam mohammad sheikh hai peaceful group se kya haa pretty common thought across indians move developed country gon na fix everything thats wrong india mostly youll encounter new set problems haunt day day ive france month exchange semester last weeks novelty worn waiting return flight back india friends even preponed flights grass always greener side ca problems besides expensive casual racism example visited amsterdam week house owner didnt mention policies booking house week day checkin person caretaker showed works owner visually disgusted sight us asked whether indians explained house rules condescending way possible days asked dryer facility lot reviews airbnb site mentioned available building upon request denied thing existed last day owner replied indeed dryer facility gave us guidelines use upon confronting caretaker straighface said last time indians checked house broke dryer skeptical giving info mind wasnt one incident loads incidents faced friends mostly italy swiss france germany simple things like people clutching baggage sight us used bother us lot culture always outsider couldnt make one good friend ones met college exchange semester actually made effort talk lot people prevalent western europe understand might bother food sucked big time visited popular food places great reviews barring rest underwhelming best might personal thing travel good places inter country train travel left us stranded remote locations multiple times reasons vary delay cancellations malfunctions train strikes weather weather always grey cold wet understand visted winter last two months november december miserable problems money could easiest solution everything damn expensive example due malfunction deserted station nearby naples pm next train morning two options sleep station even locals warned wasnt safe pay cab costing min ride simple things like water costed us euros want take piss shell euros min bus ride pay euros venice experiences friends made conclude india better depending live india youll treated outsider good explain partplease explain bull part",
    "light_cleaned_title": "Mumbai: Man Blows Smoke Into Woman’s Face, Kills Her Dad",
    "light_cleaned_selftext": "Francis Fernandes was standing with his wife and daughter near a store in Chapel road, bandra late night. 23 year old Abbas Muhammad Shaikh came near them and started smoking cigarette on her daughter's face. When the father resisted, he was attacked by Mr Shaikh and later joined by his friends. He was murdered cold blooded in a \"posh\" area like bandra.",
    "light_cleaned_comments": "Sad news Bandra is filled with Muslims This is where that Salman Khan, Sharukh Dunki Khan lives right and lots of fans goto to see them correct? Maybe one of the fans did it after seeing their movies? Mumbai is becoming crime capital, general u hear such news from UP/Bihar states but killing some1 just coz they told u dont smoke at them is next level of cold blood 2 stroke filles air you could cut but making a fuss of inhaling basically filtering a burning plant with your lungs. I thought ye yaha post nahi hoga🤐 wtf Bandra east invading Bandra west. Irony is such characters are usually from UP, bihar itself I know right. Poor guy had to kill the man for his \"fuss\". /s If you ever wonder why some Indians dream of emigration: for all it's many faults Western countries can provide safety and personal liberty that you will never find in Mumbai even after a thousand years of GDP growth. Not all western countries are safe. Especially for Indians. I don't need to speak about USA. I personally know a friend who got beaten up by drunk locals in Australia because he was Indian. You're gonna be treated as an outsider abroad all your life. Wasn't there recently as case in the US where an Indian student was run over by a policeman? And he seemed to not care much about it? There’s assholes everywhere This was big news close to where I work The bylanes of Bandra are not safe. I have lived outside India for a couple of years and travelled extensively to other countries. Counties that your term safe are not so safe especially if you are an outsider. smokers ..why you do this bs The other subs suppress the news if it goes against their ideology. This one doesn't. There's a reason they're called andhbhakts. They don't want to see what they don't believe. Ayoo I just use it as a laxative my man. apradhi ka naam 'MOHAMMAD SHEIKH' hai Peaceful group se kya? haa It is a pretty common thought across Indians, that a move to a \"developed\" country is gonna fix everything that's wrong in India. Mostly it does, but you'll encounter a new set of problems which will haunt you day in day out. I've been to France for a 3 month exchange semester, the last 2-3 weeks when the novelty has worn out, I was just waiting for the return flight back to India, and so did most of my friends, some even preponed their flights. The grass is always greener on the other side. CA What problems besides expensive? * Casual racism: For example we visited Amsterdam for a week, the house owner didn't mention any policies while we were booking the house for a week. On the day of checkin, a person (caretaker) showed up who works for the owner and was visually disgusted at the sight of us, asked whether we were Indians and explained the house rules the most condescending way possible. 2 days in we asked for dryer facility which a lot of reviews on airbnb site mentioned was available in the building, upon request he denied such a thing existed and on our last day the owner replied that indeed there was a dryer facility and gave us guidelines on how to use it, upon confronting the caretaker, with a straighface he said \"the last time Indians checked in the house they broke the dryer, so I was skeptical giving the info\". Mind you this wasn't just a one off incident, I have loads of other incidents faced by me, my friends mostly in Italy, Swiss, France, Germany. **Simple things like people clutching their baggage at the sight of us, used to bother us a lot.** * Culture: You are always an outsider, couldnt make one good friend other than ones I met in college (exchange semester), and actually I made effort to talk to a lot of people. This was more prevalent in western Europe. I understand this might not bother most, but I was. * Food: It sucked big time, visited all the popular food places with great reviews barring few rest were just underwhelming at best. Once again it might just be a personal thing. * Travel: As good as it is in most places, inter country train travel left us stranded at remote locations multiple times. The reasons vary from delay, cancellations, malfunctions, train strikes, weather. * Weather: It was always grey, cold and wet. I understand I visted during the winter, but the last two months (November, December) I was just miserable. All these problems, money could be the easiest solution, but everything was damn expensive. For example, due to a malfunction we were deserted in a station nearby Naples at 11pm. The next train was 5 am in the morning, so we had two options: 1) Sleep in the station (even the locals warned it wasnt safe) 2) Pay for a cab that was costing 10000 for a 40 min ride. Simple things like water costed us 2-3 euros. Want to take a piss? shell out 1-3 euros. A 10 min bus ride? pay up 5 euros (Venice). These were my experiences and few from my friends, that made me conclude that India was better for me! Depending on where you live in India, you’ll be treated as an outsider too good to explain the s*** part..please explain the bull part too"
}