{
    "id": "giuxen",
    "title": "We Studied the Protocol: And No This Doesn’t Sufficiently Protect Your Privacy",
    "url": "https://www.reddit.com/r/india/comments/giuxen/we_studied_the_protocol_and_no_this_doesnt/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/aaj4rww1nhy41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=39f95da388540b2480e906ceeb54031d6853b3b4\n\n**Tl;dr**\n\nOn May 11, 2020 the Ministry of Electronics and Information Technology (MeitY) released the Aarogya Setu Data Access and Knowledge Sharing Protocol, 2020 (“[**The Protocol**](https://meity.gov.in/writereaddata/files/Aarogya_Setu_data_access_knowledge_Protocol.pdf)”). It revealed the Government of India’s National Executive Committee (“NEC”) has constituted an Empowered Group on Technology and Data Management, which is looking at among other things the development and implementation of the Aarogya Setu. The Protocol is meant to allay concerns of informational privacy and mass surveillance which are attached with the Aarogya Setu programme. However, according to our clause by clause analysis it falls considerably short of principles of legality, necessity and proportionality.\n\nWe would like to thank IFF’s off-counsel Vrinda Bhandari; and lawyers Abhinav Sekhri and Gautam Bhatia in helping us unpack the Protocol.\n\n**Background**\n\nMultiple petitions have been filed before the Kerala High Court against the mandatory imposition of Aarogya Setu. These petitions include one which is filed by Jackson Mathew, in which IFF is offering legal support. A day before hearings on May 11, 2020 the MeitY released the Aarogya Setu Data Access and Knowledge Sharing Protocol, 2020 (“[**The Protocol**](https://meity.gov.in/writereaddata/files/Aarogya_Setu_data_access_knowledge_Protocol.pdf)”). As highlighted in our [**update yesterday**](https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/), about the hearings at the Kerala High Court, highlighted that the Counsel from MeitY insisted that Aarogya Setu was the best app in the world and emphasized that a protocol had also been issued to address privacy concerns. This argument was meant to suggest that the Protocol ring fences the Aarogya Setu app sufficient legal backing and also offers enough safeguards to people’s privacy.\n\nOur analysis also comes in the wake of the Aarogya Setu app being made mandatory to access many essential services and facilities. For instance, in a late night [**tweet**](https://twitter.com/RailMinIndia/status/1259919781945319426), the Ministry of Railways announced that as passenger trains restart, it will be mandatory for passengers to download the app. Similarly, the Ministry of Civil Aviation has proposed a standard operating procedure (SOP) to restart commercial travel. [**The proposed SOP reportedly will require all flight passengers to have a “Green Status” on the Aarogya Setu app**](https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/post-lockdown-flights-civil-aviation-ministry-suggests-no-cabin-baggage-in-initial-phase-detailed-questionnaire-for-passengers/articleshow/75695955.cms).\n\n&amp;#x200B;\n\n[Tweet by Ministry of Railways](https://preview.redd.it/sqm9pgvdrhy41.png?width=542&amp;format=png&amp;auto=webp&amp;s=e0652ce4054fd89444efa81bebb1f796a7999f95)\n\nHowever, as our analysis states (a PDF of which is provided at the end of this document) very clearly states that the Protocol fails to satisfy the **legality threshold**.\n\n**Compatibility with Legality**\n\nThe Protocol is not a statute, and nor does it offer any legislative foundation for the Aarogya Setu Mobile Application. Therefore, the primary issue of Aarogya Setu lacking legal basis is still alive and unaddressed. For clarity fundamental rights under the Constitution cannot be restricted by the Government even for legitimate purposes without express legislative authorisation. The Protocol is not - and does not purport to provide - any such authorisation. A troubling aspect in this regard, is that Government authorities have said that there are no plans to create an underlying legislation to hold the usage of the app accountable, since the “[***priority at present is to deal with the epidemic itself***](https://www.business-standard.com/article/economy-policy/no-plan-to-bring-in-law-to-regulate-aarogya-setu-at-this-point-secy-meity-120051000727_1.html)*.*”\n\n**Underlying Basis and Rationale of the Order is Questionable**\n\nKeeping this questionable legality in mind, we notice that the Government has constituted 11 Empowered Groups. **Empowered Group 9 is specifically tasked with Technology and Data Management**. It is important to note that to the best of our knowledge there is no mention in a press bulletin, Government notification, the Aarogya Setu app’s Terms of Service, Privacy Policy or FAQs, that Empowered Group 9 has been solely responsible for the creation and execution of the Aarogya Setu app.\n\nThere is also no reference in this Order or any other government notification about the actual membership composition of Empowered Group 9 on Technology and Data Management. **In addition, there is no reference in the Protocol or any other government notification about the means through which Empowered Group 9 has sought external inputs on the drafting of the Protocol**.\n\nThe Protocol is drafted in a manner, which justifies the centralised collection of data through the new Aarogya Setu platform. It does this without any discussion about the choice of design, and why existing alternatives which exist through avenues like telecom operators, or for that matter anonymised mobility reports reports developed in an open source format by researchers and organisations like Facebook/Google, are not enough. **There is no discussion on why existing data at the Government’s disposal collected through hospitals, the Indian Council of Medical Research, the Integrated Disease Surveillance Programme, on ground surveillance teams, etc. does not suffice in fulfilling the objective referenced by the Protocol.**\n\nThe Protocol also fails to acknowledge the fact that when data is collected in a primary fashion from individual users, it is of course a more intrusive collection process. Therefore it comes with inherent risks to informational privacy. Instead the Protocol stresses on the need for *efficient* data collection and sharing. Unfortunately, there is little to no discussion on ensuring that the most privacy-respecting practices are adopted, which are least intrusive in nature.\n\nIn addition the Protocol arbitrarily states that there is an urgent need for data pertaining to individuals “*to formulate appropriate health responses for addressing the Covid-19 pandemic*”. What is convenient for authorities is that “Appropriate health responses” **is expansively defined**. In fact such an expansive definition is curious since a think tank which supported the Government of India in drafting the Protocol has [**stated in an explainer blog post**](https://vidhilegalpolicy.in/2020/05/11/aarogya-setus-data-access-and-knowledge-sharing-protocol-2020/) that the purpose of the Protocol is “*exposure notification and contact tracing”*. If that were indeed the case, then such a broad definition for Appropriate health responses is incompatible with the principle of *proportionality*.\n\nIn contrast, all other apps across the world’s democracies (across the economic and geographical spectrum) are only deploying apps to support/expedite their country’s on-ground contact tracing efforts. [**In India the app’s expansiveness is being positioned as it speaks to India’s innovation**](https://twitter.com/CNBCTV18News/status/1259878975729369091?s=09). This would be a disingenuous characterisation. Most other countries are taking their time to ensure that the application of such technologies when ultimately scaled are in fact consistent with their civil liberties obligations.\n\nTherefore, the Protocol is not engaging in data collection through the prism of deploying the least restrictive measure that is hemmed in by clear purpose-based requirements, and is, therefore, falling foul of the proportionality principle.\n\n**Concerns About Implementation and Possible Mission Creep**\n\nThe Protocol fails to specify how it will interact with the Aarogya Setu app’s Terms of Service and Privacy Policy that were already in place. For instance, the Privacy Policy already contains a set of practices governing data collection and storage. Many of those provisions are now in conflict with the Protocol. However, the Protocol fails to outline the effect of these conflicts and how they will be rationalised.  This creates confusion, uncertainty, and risks of greater flexibility for retention and sharing of people’s personal and sensitive personal information.\n\nWe also believe that the chain of command **evokes concerns of possible mission creep**. What is especially concerning is that India’s public health institutions have minimal leadership even as these technologies are being built to respond to a public health crisis.\n\n**Don’t Just Use Buzzwords Like “Necessary and Proportionate”. Meaningfully Incorporate Them**\n\nThe use of such phraseology is meant to demonstrate that the Protocol incorporates *purpose* and *use* limitations on data collected by the App. However, they are far from *restrictive*. For example, “Appropriate health responses” is a broad term that covers a wide gamut of government operations. In other words, “purpose limitation” and the principles of necessity and proportionality with respect to data collection acts as a meaningful constraint only if the purpose is spelt out with clarity and specificity to start with. If the purpose itself is excessively broad, vague, and evolving, then “necessity” and “proportionality” have no meaning at all, since data collection needs to be necessary and proportionate with regard to the purpose for which it is being collected. The Protocol, therefore, attempts to do an end run around core data principles by leaving the purpose so vague and ill-defined, that excessive data collection can potentially always be justified as necessary and proportionate.\n\nFurther, the Protocol’s reference to the principle for processing data in a “*fair, transparent and non-discriminatory manner*” rings hollow. Specifically, it does not require the NIC to *publicly share* its data processing practises. **In fact, one way for processing to be transparent is by publishing the app’s underlying source code. Instead, India has not published the Aarogya Setu app’s source code and even now, a** [**recent statement of the Secretary, MeitY**](https://techcrunch.com/2020/05/12/aarogya-setu-india-contact-tracing-app-10-crore/?tpcc=ECTW2020)**indicates a reticence to publish the source code before the public**.\n\n**Excessive Collection, Processing and Storage of Personal Data**\n\nAccording to the Protocol, the default setting is that contact and location data remain on the device and not uploaded on to the server. This default setting is, however, immediately overridden by the next sentence which states that such data **may be** uploaded to the server to formulate / implement appropriate health responses. Given the breadth of this purpose, there is, in effect, no clarity or certainty on when contact and location data may be uploaded on the server. Moreover, the breadth of this exemption allows for the seamless creation of a centralised system.\n\nIn general the storage policies are high deficient and cannot be aligned with people’s right to privacy, or the proportionality principle:\n\n1. Data retention for six months, without any process of review while allowing for potential extension of this time-limit, is not the least intrusive measure that could be adopted. This is because it allows for retaining of people’s personal data for durations beyond the duration of the Protocol itself. Consider the following example. Imagine someone’s contact/location/self assessment data is exported on daya 45. Then that data could be retained for a period of 45 days beyond the purported last date of the Protocol which is fixed at 6 months where this data retention takes place in a legal vacuum.\n2. The Protocol also fails to clarify what are the *extraordinary* circumstances in which the Government may unilaterally retain contact, location and self assessment data for a period longer than 180 days.\n3. There is no policy for destroying contact, location and self assessment data based on a user request, contrary to the Protocol for demographic data. The total failure to consider user-request based destruction of such data amounts to retaining personal data without consent and is a clear breach of the right to privacy.\n4. Para 5(e) also fails to clarify whether this provision applies to anonymised data or not. This is important to highlight because the current Privacy Policy of the Aarogya Setu App specifies that the data retention clause is not applicable to anonymised data. Such exemptions, if they still subsist, retain concerns of permanent systems of data analysis/surveillance.\n\n**Researchers Can Get Access to Our Data. Wait? What?**\n\nThe Protocol allows for **sharing response data for research purposes** with certain specified institutions / entities registered in India where the data has undergone “Hard Anonymisation”. This demonstrates the incentives for why the Government of India has taken a centralised approach. It is less about taking the least intrusive measure towards responding to the public health crisis, but more towards maximising the utility of data. In some ways it also shows an appetite on the Government of India to commercialise or discover commercial applications the Aarogya Setu app, rather than go the path of other democratic societies which are more focused on decentralised models which may effectively alert people to get tested and treated for the coronavirus itself. That such opportunities would be non-existent in a decentralised model of data storage only further supports the argument that the adoption of a centralised model for the Aarogya Setu App is not driven by purposes related to containing the spread of Covid-19.  Additionally, it shows why the data retention limits of the Aarogya Setu programme do not apply to anonymised and aggregated datasets. Therefore, there is a greater need for public scrutiny on this front.\n\n**The Sunset Clause Misses the Point**\n\nThe Sunset Clause (Para 10) fails to adequately address temporal restrictions on the gathering of data by the Aarogya Setu Mobile Application. In fact, the sunset clause potentially allows for gathering such data on even more relaxed terms and conditions. Moreover, the Sunset Clause allows for its extension without any independent institutional review.\n\nMost importantly, the Sunset Clause is insufficient since there is no reference to the actual destruction of servers and systems created as an output of the Aarogya Setu programme. Without such a reference, a sunset clause is meaningless and evokes concerns of the creation of a permanent infrastructure of Government surveillance.\n\n**Concluding Thoughts**\n\nFor more, please go through our detailed analysis in which we deconstruct the various shortcomings of the Protocol. At the end we also analyse certain disclosures made by the Government in a press briefing made on the same day, which evoke concerns of interlinking of Government databases and risks of permanent systems of surveillance.\n\n**Important Documents**\n\n1. Link to IFF’s Clause by Clause Analysis of the Aarogya Setu Protocol ([**link**](https://drive.google.com/file/d/1CsDRlMDvqAH1Dq2xU5nP7GxdnDPIKhWp/view?usp=sharing))\n2. Writ Petition filed in Jackson Mathew v. Union of India ([**link**](https://drive.google.com/file/d/1wSaVWxJHhCcOkccPz9axjdtXq1GnvGY0/view?usp=sharing))\n\n***We are hosting a fundraiser this month to secure the salary of one staffer at IFF for a year. We need your help to remain effective and continue our work on digital rights amidst this pandemic.*** [***Help us by donating to the fund today!***](https://www.internetfreedom.in/donate)\n\n***Don’t forget to*** [***join the Internet Freedom Forum***](https://forum.internetfreedom.in/) ***for closer dialogue with the IFF staff and community about technology, society and law!***",
    "flair": "Policy/Economy",
    "score": 270,
    "num_comments": 18,
    "created_utc": 1589358166,
    "convurl": "https://a.thumbs.redditmedia.com/JiY9vxuW3YTN00fGOcBdOfDpc8C11N9ZGoBpikFl0n4.jpg",
    "comments": [
        "Good luck. Make it stop. We don't want China 2.0.",
        "I think they are indirectly trying to get data for NPR.",
        "Genuine question - What happens if someone doesn't have a smartphone?",
        "\"There is no discussion on why existing data at the Government’s disposal collected through hospitals, the Indian Council of Medical Research, the Integrated Disease Surveillance Programme, on ground surveillance teams, etc. does not suffice in fulfilling the objective referenced by the Protocol.\"\n\n\nBut this data isn't enough for contact tracing. It's impossible to trace back the temporal overlap of an infected and non-infected person's travel. If u don't have an active Bluetooth system, you'll have to rely on broad time periods and quarantine of massive groups of pple based on mild suspicion alone",
        "We are on this. Trying our best. Opening up broader coalitions and working to improve civic literacy. Engaging with all state institutions in good faith while also objectively challenging it in court.",
        "We really fear on what may be a response. As per most government notifications we have seen there has not been any recognition of such people. Moreover, there is the absence of any exemption categories. It's somewhat cruel, no?",
        "At this point we really do not know. Even RTIs on source code are being rejected. And this is only on the client side, we still do not know what are all the moving parts at the server side and the product architecture to fully map it. [https://twitter.com/internetfreedom/status/1260584436489506818](https://twitter.com/internetfreedom/status/1260584436489506818)",
        "As Prof. Subhashis Banerjee explains at length contact tracing apps, specifically Aarogya Setu is questionable on grounds of utility. Link at the bottom of the linked page. [https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/](https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/)",
        "The data seems too unreliable to be used for NPR though. That seems far fetched. The only problem is with location data of people and especially if the govt stores it in their servers even after we delete the apps. Though they have the aadhar anyway...",
        "There is also the nature of patients to be considered. If a patient who comes in to the hospital is too sick, for example a SARI patient needing oxygen there is no way traditional form contact tracing which involves interviewing the patient about all the places he visited and people he met over last 14 days is going to work. The patient may not be in a position to answer and may not be able to remember all his contacts over a two week period. \n\nIf you read the daily reports of patients in Karnataka, most of the deaths are in SARI patients who end up dead within days of reaching the hospital or are detected as positive after deaths. How much time is lost in conducting interviews of multiple relatives to imperfectly recreate their life over last few weeks is unknown. This is especially harmful when you need to reach contacts as quickly as possible to cut off chains of transmission.",
        "Yeah",
        "Upvoted for visibility",
        "Thanks u/InternetFreedomIn\n\n&amp;#x200B;\n\nKeep the pressure on.",
        "Now that you have seen MAy11 notification, is it better or worse than what you had hoped in terms of privacy?",
        "Talks about privacy and links to google drive.\nNot gonna make it.",
        "The usage of tools is considerate of engaging with wider communities and we are incrementally moving away from dependency that involves such products. \n\nThis is a real commitment from our forms and surveys (block survey), email tool (Mautic) and evening video calls (Jitsi and BigBlueButton). \n\nAlso a lot of these decisions are upon our resource capacity which will improve in time. Stick with us for this journey!",
        "Which one ? The MHA one? We have already acted upon it. Check our website for the same day.",
        "Thank you! We will!"
    ],
    "cleaned_text": "studied protocol doesnt sufficiently protect privacy ampxb tldr may ministry electronics information technology meity released aarogya setu data access knowledge sharing protocol protocolhttpsmeitygovinwritereaddatafilesaarogyasetudataaccessknowledgeprotocolpdf revealed government indias national executive committee nec constituted empowered group technology data management looking among things development implementation aarogya setu protocol meant allay concerns informational privacy mass surveillance attached aarogya setu programme however according clause clause analysis falls considerably short principles legality necessity proportionality would like thank iffs offcounsel vrinda bhandari lawyers abhinav sekhri gautam bhatia helping us unpack protocol background multiple petitions filed kerala high court mandatory imposition aarogya setu petitions include one filed jackson mathew iff offering legal support day hearings may meity released aarogya setu data access knowledge sharing protocol protocolhttpsmeitygovinwritereaddatafilesaarogyasetudataaccessknowledgeprotocolpdf highlighted update yesterdayhttpsinternetfreedominkeralahchearschallengesagainstmandatoryimpositionofaarogyasetu hearings kerala high court highlighted counsel meity insisted aarogya setu best app world emphasized protocol also issued address privacy concerns argument meant suggest protocol ring fences aarogya setu app sufficient legal backing also offers enough safeguards peoples privacy analysis also comes wake aarogya setu app made mandatory access many essential services facilities instance late night tweethttpstwittercomrailminindiastatus ministry railways announced passenger trains restart mandatory passengers download app similarly ministry civil aviation proposed standard operating procedure sop restart commercial travel proposed sop reportedly require flight passengers green status aarogya setu apphttpseconomictimesindiatimescomindustrytransportationairlinesaviationpostlockdownflightscivilaviationministrysuggestsnocabinbaggageininitialphasedetailedquestionnaireforpassengersarticleshowcms ampxb tweet ministry railwayshttpspreviewredditsqmpgvdrhypngwidthampformatpngampautowebpampsecefdefabebbfaf however analysis states pdf provided end document clearly states protocol fails satisfy legality threshold compatibility legality protocol statute offer legislative foundation aarogya setu mobile application therefore primary issue aarogya setu lacking legal basis still alive unaddressed clarity fundamental rights constitution restricted government even legitimate purposes without express legislative authorisation protocol purport provide authorisation troubling aspect regard government authorities said plans create underlying legislation hold usage app accountable since priority present deal epidemic itselfhttpswwwbusinessstandardcomarticleeconomypolicynoplantobringinlawtoregulateaarogyasetuatthispointsecymeityhtml underlying basis rationale order questionable keeping questionable legality mind notice government constituted empowered groups empowered group specifically tasked technology data management important note best knowledge mention press bulletin government notification aarogya setu apps terms service privacy policy faqs empowered group solely responsible creation execution aarogya setu app also reference order government notification actual membership composition empowered group technology data management addition reference protocol government notification means empowered group sought external inputs drafting protocol protocol drafted manner justifies centralised collection data new aarogya setu platform without discussion choice design existing alternatives exist avenues like telecom operators matter anonymised mobility reports reports developed open source format researchers organisations like facebookgoogle enough discussion existing data governments disposal collected hospitals indian council medical research integrated disease surveillance programme ground surveillance teams etc suffice fulfilling objective referenced protocol protocol also fails acknowledge fact data collected primary fashion individual users course intrusive collection process therefore comes inherent risks informational privacy instead protocol stresses need efficient data collection sharing unfortunately little discussion ensuring privacyrespecting practices adopted least intrusive nature addition protocol arbitrarily states urgent need data pertaining individuals formulate appropriate health responses addressing covid pandemic convenient authorities appropriate health responses expansively defined fact expansive definition curious since think tank supported government india drafting protocol stated explainer blog posthttpsvidhilegalpolicyinaarogyasetusdataaccessandknowledgesharingprotocol purpose protocol exposure notification contact tracing indeed case broad definition appropriate health responses incompatible principle proportionality contrast apps across worlds democracies across economic geographical spectrum deploying apps supportexpedite countrys onground contact tracing efforts india apps expansiveness positioned speaks indias innovationhttpstwittercomcnbctvnewsstatuss would disingenuous characterisation countries taking time ensure application technologies ultimately scaled fact consistent civil liberties obligations therefore protocol engaging data collection prism deploying least restrictive measure hemmed clear purposebased requirements therefore falling foul proportionality principle concerns implementation possible mission creep protocol fails specify interact aarogya setu apps terms service privacy policy already place instance privacy policy already contains set practices governing data collection storage many provisions conflict protocol however protocol fails outline effect conflicts rationalised creates confusion uncertainty risks greater flexibility retention sharing peoples personal sensitive personal information also believe chain command evokes concerns possible mission creep especially concerning indias public health institutions minimal leadership even technologies built respond public health crisis dont use buzzwords like necessary proportionate meaningfully incorporate use phraseology meant demonstrate protocol incorporates purpose use limitations data collected app however far restrictive example appropriate health responses broad term covers wide gamut government operations words purpose limitation principles necessity proportionality respect data collection acts meaningful constraint purpose spelt clarity specificity start purpose excessively broad vague evolving necessity proportionality meaning since data collection needs necessary proportionate regard purpose collected protocol therefore attempts end run around core data principles leaving purpose vague illdefined excessive data collection potentially always justified necessary proportionate protocols reference principle processing data fair transparent nondiscriminatory manner rings hollow specifically require nic publicly share data processing practises fact one way processing transparent publishing apps underlying source code instead india published aarogya setu apps source code even recent statement secretary meityhttpstechcrunchcomaarogyasetuindiacontacttracingappcroretpccectwindicates reticence publish source code public excessive collection processing storage personal data according protocol default setting contact location data remain device uploaded server default setting however immediately overridden next sentence states data may uploaded server formulate implement appropriate health responses given breadth purpose effect clarity certainty contact location data may uploaded server moreover breadth exemption allows seamless creation centralised system general storage policies high deficient aligned peoples right privacy proportionality principle data retention six months without process review allowing potential extension timelimit least intrusive measure could adopted allows retaining peoples personal data durations beyond duration protocol consider following example imagine someones contactlocationself assessment data exported daya data could retained period days beyond purported last date protocol fixed months data retention takes place legal vacuum protocol also fails clarify extraordinary circumstances government may unilaterally retain contact location self assessment data period longer days policy destroying contact location self assessment data based user request contrary protocol demographic data total failure consider userrequest based destruction data amounts retaining personal data without consent clear breach right privacy para e also fails clarify whether provision applies anonymised data important highlight current privacy policy aarogya setu app specifies data retention clause applicable anonymised data exemptions still subsist retain concerns permanent systems data analysissurveillance researchers get access data wait protocol allows sharing response data research purposes certain specified institutions entities registered india data undergone hard anonymisation demonstrates incentives government india taken centralised approach less taking least intrusive measure towards responding public health crisis towards maximising utility data ways also shows appetite government india commercialise discover commercial applications aarogya setu app rather go path democratic societies focused decentralised models may effectively alert people get tested treated coronavirus opportunities would nonexistent decentralised model data storage supports argument adoption centralised model aarogya setu app driven purposes related containing spread covid additionally shows data retention limits aarogya setu programme apply anonymised aggregated datasets therefore greater need public scrutiny front sunset clause misses point sunset clause para fails adequately address temporal restrictions gathering data aarogya setu mobile application fact sunset clause potentially allows gathering data even relaxed terms conditions moreover sunset clause allows extension without independent institutional review importantly sunset clause insufficient since reference actual destruction servers systems created output aarogya setu programme without reference sunset clause meaningless evokes concerns creation permanent infrastructure government surveillance concluding thoughts please go detailed analysis deconstruct various shortcomings protocol end also analyse certain disclosures made government press briefing made day evoke concerns interlinking government databases risks permanent systems surveillance important documents link iffs clause clause analysis aarogya setu protocol linkhttpsdrivegooglecomfiledcsdrlmdvqahdqxunpgxdndpikhwpviewuspsharing writ petition filed jackson mathew v union india linkhttpsdrivegooglecomfiledwsavwxjhhccokccpzaxjdtxqgnvgyviewuspsharing hosting fundraiser month secure salary one staffer iff year need help remain effective continue work digital rights amidst pandemic help us donating fund todayhttpswwwinternetfreedomindonate dont forget join internet freedom forumhttpsforuminternetfreedomin closer dialogue iff staff community technology society law ",
    "cleaned_title": "studied protocol doesnt sufficiently protect privacy",
    "cleaned_selftext": "ampxb tldr may ministry electronics information technology meity released aarogya setu data access knowledge sharing protocol protocolhttpsmeitygovinwritereaddatafilesaarogyasetudataaccessknowledgeprotocolpdf revealed government indias national executive committee nec constituted empowered group technology data management looking among things development implementation aarogya setu protocol meant allay concerns informational privacy mass surveillance attached aarogya setu programme however according clause clause analysis falls considerably short principles legality necessity proportionality would like thank iffs offcounsel vrinda bhandari lawyers abhinav sekhri gautam bhatia helping us unpack protocol background multiple petitions filed kerala high court mandatory imposition aarogya setu petitions include one filed jackson mathew iff offering legal support day hearings may meity released aarogya setu data access knowledge sharing protocol protocolhttpsmeitygovinwritereaddatafilesaarogyasetudataaccessknowledgeprotocolpdf highlighted update yesterdayhttpsinternetfreedominkeralahchearschallengesagainstmandatoryimpositionofaarogyasetu hearings kerala high court highlighted counsel meity insisted aarogya setu best app world emphasized protocol also issued address privacy concerns argument meant suggest protocol ring fences aarogya setu app sufficient legal backing also offers enough safeguards peoples privacy analysis also comes wake aarogya setu app made mandatory access many essential services facilities instance late night tweethttpstwittercomrailminindiastatus ministry railways announced passenger trains restart mandatory passengers download app similarly ministry civil aviation proposed standard operating procedure sop restart commercial travel proposed sop reportedly require flight passengers green status aarogya setu apphttpseconomictimesindiatimescomindustrytransportationairlinesaviationpostlockdownflightscivilaviationministrysuggestsnocabinbaggageininitialphasedetailedquestionnaireforpassengersarticleshowcms ampxb tweet ministry railwayshttpspreviewredditsqmpgvdrhypngwidthampformatpngampautowebpampsecefdefabebbfaf however analysis states pdf provided end document clearly states protocol fails satisfy legality threshold compatibility legality protocol statute offer legislative foundation aarogya setu mobile application therefore primary issue aarogya setu lacking legal basis still alive unaddressed clarity fundamental rights constitution restricted government even legitimate purposes without express legislative authorisation protocol purport provide authorisation troubling aspect regard government authorities said plans create underlying legislation hold usage app accountable since priority present deal epidemic itselfhttpswwwbusinessstandardcomarticleeconomypolicynoplantobringinlawtoregulateaarogyasetuatthispointsecymeityhtml underlying basis rationale order questionable keeping questionable legality mind notice government constituted empowered groups empowered group specifically tasked technology data management important note best knowledge mention press bulletin government notification aarogya setu apps terms service privacy policy faqs empowered group solely responsible creation execution aarogya setu app also reference order government notification actual membership composition empowered group technology data management addition reference protocol government notification means empowered group sought external inputs drafting protocol protocol drafted manner justifies centralised collection data new aarogya setu platform without discussion choice design existing alternatives exist avenues like telecom operators matter anonymised mobility reports reports developed open source format researchers organisations like facebookgoogle enough discussion existing data governments disposal collected hospitals indian council medical research integrated disease surveillance programme ground surveillance teams etc suffice fulfilling objective referenced protocol protocol also fails acknowledge fact data collected primary fashion individual users course intrusive collection process therefore comes inherent risks informational privacy instead protocol stresses need efficient data collection sharing unfortunately little discussion ensuring privacyrespecting practices adopted least intrusive nature addition protocol arbitrarily states urgent need data pertaining individuals formulate appropriate health responses addressing covid pandemic convenient authorities appropriate health responses expansively defined fact expansive definition curious since think tank supported government india drafting protocol stated explainer blog posthttpsvidhilegalpolicyinaarogyasetusdataaccessandknowledgesharingprotocol purpose protocol exposure notification contact tracing indeed case broad definition appropriate health responses incompatible principle proportionality contrast apps across worlds democracies across economic geographical spectrum deploying apps supportexpedite countrys onground contact tracing efforts india apps expansiveness positioned speaks indias innovationhttpstwittercomcnbctvnewsstatuss would disingenuous characterisation countries taking time ensure application technologies ultimately scaled fact consistent civil liberties obligations therefore protocol engaging data collection prism deploying least restrictive measure hemmed clear purposebased requirements therefore falling foul proportionality principle concerns implementation possible mission creep protocol fails specify interact aarogya setu apps terms service privacy policy already place instance privacy policy already contains set practices governing data collection storage many provisions conflict protocol however protocol fails outline effect conflicts rationalised creates confusion uncertainty risks greater flexibility retention sharing peoples personal sensitive personal information also believe chain command evokes concerns possible mission creep especially concerning indias public health institutions minimal leadership even technologies built respond public health crisis dont use buzzwords like necessary proportionate meaningfully incorporate use phraseology meant demonstrate protocol incorporates purpose use limitations data collected app however far restrictive example appropriate health responses broad term covers wide gamut government operations words purpose limitation principles necessity proportionality respect data collection acts meaningful constraint purpose spelt clarity specificity start purpose excessively broad vague evolving necessity proportionality meaning since data collection needs necessary proportionate regard purpose collected protocol therefore attempts end run around core data principles leaving purpose vague illdefined excessive data collection potentially always justified necessary proportionate protocols reference principle processing data fair transparent nondiscriminatory manner rings hollow specifically require nic publicly share data processing practises fact one way processing transparent publishing apps underlying source code instead india published aarogya setu apps source code even recent statement secretary meityhttpstechcrunchcomaarogyasetuindiacontacttracingappcroretpccectwindicates reticence publish source code public excessive collection processing storage personal data according protocol default setting contact location data remain device uploaded server default setting however immediately overridden next sentence states data may uploaded server formulate implement appropriate health responses given breadth purpose effect clarity certainty contact location data may uploaded server moreover breadth exemption allows seamless creation centralised system general storage policies high deficient aligned peoples right privacy proportionality principle data retention six months without process review allowing potential extension timelimit least intrusive measure could adopted allows retaining peoples personal data durations beyond duration protocol consider following example imagine someones contactlocationself assessment data exported daya data could retained period days beyond purported last date protocol fixed months data retention takes place legal vacuum protocol also fails clarify extraordinary circumstances government may unilaterally retain contact location self assessment data period longer days policy destroying contact location self assessment data based user request contrary protocol demographic data total failure consider userrequest based destruction data amounts retaining personal data without consent clear breach right privacy para e also fails clarify whether provision applies anonymised data important highlight current privacy policy aarogya setu app specifies data retention clause applicable anonymised data exemptions still subsist retain concerns permanent systems data analysissurveillance researchers get access data wait protocol allows sharing response data research purposes certain specified institutions entities registered india data undergone hard anonymisation demonstrates incentives government india taken centralised approach less taking least intrusive measure towards responding public health crisis towards maximising utility data ways also shows appetite government india commercialise discover commercial applications aarogya setu app rather go path democratic societies focused decentralised models may effectively alert people get tested treated coronavirus opportunities would nonexistent decentralised model data storage supports argument adoption centralised model aarogya setu app driven purposes related containing spread covid additionally shows data retention limits aarogya setu programme apply anonymised aggregated datasets therefore greater need public scrutiny front sunset clause misses point sunset clause para fails adequately address temporal restrictions gathering data aarogya setu mobile application fact sunset clause potentially allows gathering data even relaxed terms conditions moreover sunset clause allows extension without independent institutional review importantly sunset clause insufficient since reference actual destruction servers systems created output aarogya setu programme without reference sunset clause meaningless evokes concerns creation permanent infrastructure government surveillance concluding thoughts please go detailed analysis deconstruct various shortcomings protocol end also analyse certain disclosures made government press briefing made day evoke concerns interlinking government databases risks permanent systems surveillance important documents link iffs clause clause analysis aarogya setu protocol linkhttpsdrivegooglecomfiledcsdrlmdvqahdqxunpgxdndpikhwpviewuspsharing writ petition filed jackson mathew v union india linkhttpsdrivegooglecomfiledwsavwxjhhccokccpzaxjdtxqgnvgyviewuspsharing hosting fundraiser month secure salary one staffer iff year need help remain effective continue work digital rights amidst pandemic help us donating fund todayhttpswwwinternetfreedomindonate dont forget join internet freedom forumhttpsforuminternetfreedomin closer dialogue iff staff community technology society law",
    "cleaned_comments": "good luck make stop dont want china think indirectly trying get data npr genuine question happens someone doesnt smartphone discussion existing data governments disposal collected hospitals indian council medical research integrated disease surveillance programme ground surveillance teams etc suffice fulfilling objective referenced protocol data isnt enough contact tracing impossible trace back temporal overlap infected noninfected persons travel u dont active bluetooth system youll rely broad time periods quarantine massive groups pple based mild suspicion alone trying best opening broader coalitions working improve civic literacy engaging state institutions good faith also objectively challenging court really fear may response per government notifications seen recognition people moreover absence exemption categories somewhat cruel point really know even rtis source code rejected client side still know moving parts server side product architecture fully map httpstwittercominternetfreedomstatushttpstwittercominternetfreedomstatus prof subhashis banerjee explains length contact tracing apps specifically aarogya setu questionable grounds utility link bottom linked page httpsinternetfreedominkeralahchearschallengesagainstmandatoryimpositionofaarogyasetuhttpsinternetfreedominkeralahchearschallengesagainstmandatoryimpositionofaarogyasetu data seems unreliable used npr though seems far fetched problem location data people especially govt stores servers even delete apps though aadhar anyway also nature patients considered patient comes hospital sick example sari patient needing oxygen way traditional form contact tracing involves interviewing patient places visited people met last days going work patient may position answer may able remember contacts two week period read daily reports patients karnataka deaths sari patients end dead within days reaching hospital detected positive deaths much time lost conducting interviews multiple relatives imperfectly recreate life last weeks unknown especially harmful need reach contacts quickly possible cut chains transmission yeah upvoted visibility thanks uinternetfreedomin ampxb keep pressure seen may notification better worse hoped terms privacy talks privacy links google drive gon na make usage tools considerate engaging wider communities incrementally moving away dependency involves products real commitment forms surveys block survey email tool mautic evening video calls jitsi bigbluebutton also lot decisions upon resource capacity improve time stick us journey one mha one already acted upon check website day thank",
    "light_cleaned_title": "We Studied the Protocol: And No This Doesn’t Sufficiently Protect Your Privacy",
    "light_cleaned_selftext": "**Tl;dr** On May 11, 2020 the Ministry of Electronics and Information Technology (MeitY) released the Aarogya Setu Data Access and Knowledge Sharing Protocol, 2020 (“[**The Protocol**](https://meity.gov.in/writereaddata/files/Aarogya_Setu_data_access_knowledge_Protocol.pdf)”). It revealed the Government of India’s National Executive Committee (“NEC”) has constituted an Empowered Group on Technology and Data Management, which is looking at among other things the development and implementation of the Aarogya Setu. The Protocol is meant to allay concerns of informational privacy and mass surveillance which are attached with the Aarogya Setu programme. However, according to our clause by clause analysis it falls considerably short of principles of legality, necessity and proportionality. We would like to thank IFF’s off-counsel Vrinda Bhandari; and lawyers Abhinav Sekhri and Gautam Bhatia in helping us unpack the Protocol. **Background** Multiple petitions have been filed before the Kerala High Court against the mandatory imposition of Aarogya Setu. These petitions include one which is filed by Jackson Mathew, in which IFF is offering legal support. A day before hearings on May 11, 2020 the MeitY released the Aarogya Setu Data Access and Knowledge Sharing Protocol, 2020 (“[**The Protocol**](https://meity.gov.in/writereaddata/files/Aarogya_Setu_data_access_knowledge_Protocol.pdf)”). As highlighted in our [**update yesterday**](https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/), about the hearings at the Kerala High Court, highlighted that the Counsel from MeitY insisted that Aarogya Setu was the best app in the world and emphasized that a protocol had also been issued to address privacy concerns. This argument was meant to suggest that the Protocol ring fences the Aarogya Setu app sufficient legal backing and also offers enough safeguards to people’s privacy. Our analysis also comes in the wake of the Aarogya Setu app being made mandatory to access many essential services and facilities. For instance, in a late night [**tweet**](https://twitter.com/RailMinIndia/status/1259919781945319426), the Ministry of Railways announced that as passenger trains restart, it will be mandatory for passengers to download the app. Similarly, the Ministry of Civil Aviation has proposed a standard operating procedure (SOP) to restart commercial travel. [**The proposed SOP reportedly will require all flight passengers to have a “Green Status” on the Aarogya Setu app**](https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/post-lockdown-flights-civil-aviation-ministry-suggests-no-cabin-baggage-in-initial-phase-detailed-questionnaire-for-passengers/articleshow/75695955.cms).  [Tweet by Ministry of Railways](https://preview.redd.it/sqm9pgvdrhy41.png?width=542&amp;format=png&amp;auto=webp&amp;s=e0652ce4054fd89444efa81bebb1f796a7999f95) However, as our analysis states (a PDF of which is provided at the end of this document) very clearly states that the Protocol fails to satisfy the **legality threshold**. **Compatibility with Legality** The Protocol is not a statute, and nor does it offer any legislative foundation for the Aarogya Setu Mobile Application. Therefore, the primary issue of Aarogya Setu lacking legal basis is still alive and unaddressed. For clarity fundamental rights under the Constitution cannot be restricted by the Government even for legitimate purposes without express legislative authorisation. The Protocol is not - and does not purport to provide - any such authorisation. A troubling aspect in this regard, is that Government authorities have said that there are no plans to create an underlying legislation to hold the usage of the app accountable, since the “[***priority at present is to deal with the epidemic itself***](https://www.business-standard.com/article/economy-policy/no-plan-to-bring-in-law-to-regulate-aarogya-setu-at-this-point-secy-meity-120051000727_1.html)*.*” **Underlying Basis and Rationale of the Order is Questionable** Keeping this questionable legality in mind, we notice that the Government has constituted 11 Empowered Groups. **Empowered Group 9 is specifically tasked with Technology and Data Management**. It is important to note that to the best of our knowledge there is no mention in a press bulletin, Government notification, the Aarogya Setu app’s Terms of Service, Privacy Policy or FAQs, that Empowered Group 9 has been solely responsible for the creation and execution of the Aarogya Setu app. There is also no reference in this Order or any other government notification about the actual membership composition of Empowered Group 9 on Technology and Data Management. **In addition, there is no reference in the Protocol or any other government notification about the means through which Empowered Group 9 has sought external inputs on the drafting of the Protocol**. The Protocol is drafted in a manner, which justifies the centralised collection of data through the new Aarogya Setu platform. It does this without any discussion about the choice of design, and why existing alternatives which exist through avenues like telecom operators, or for that matter anonymised mobility reports reports developed in an open source format by researchers and organisations like Facebook/Google, are not enough. **There is no discussion on why existing data at the Government’s disposal collected through hospitals, the Indian Council of Medical Research, the Integrated Disease Surveillance Programme, on ground surveillance teams, etc. does not suffice in fulfilling the objective referenced by the Protocol.** The Protocol also fails to acknowledge the fact that when data is collected in a primary fashion from individual users, it is of course a more intrusive collection process. Therefore it comes with inherent risks to informational privacy. Instead the Protocol stresses on the need for *efficient* data collection and sharing. Unfortunately, there is little to no discussion on ensuring that the most privacy-respecting practices are adopted, which are least intrusive in nature. In addition the Protocol arbitrarily states that there is an urgent need for data pertaining to individuals “*to formulate appropriate health responses for addressing the Covid-19 pandemic*”. What is convenient for authorities is that “Appropriate health responses” **is expansively defined**. In fact such an expansive definition is curious since a think tank which supported the Government of India in drafting the Protocol has [**stated in an explainer blog post**](https://vidhilegalpolicy.in/2020/05/11/aarogya-setus-data-access-and-knowledge-sharing-protocol-2020/) that the purpose of the Protocol is “*exposure notification and contact tracing”*. If that were indeed the case, then such a broad definition for Appropriate health responses is incompatible with the principle of *proportionality*. In contrast, all other apps across the world’s democracies (across the economic and geographical spectrum) are only deploying apps to support/expedite their country’s on-ground contact tracing efforts. [**In India the app’s expansiveness is being positioned as it speaks to India’s innovation**](https://twitter.com/CNBCTV18News/status/1259878975729369091?s=09). This would be a disingenuous characterisation. Most other countries are taking their time to ensure that the application of such technologies when ultimately scaled are in fact consistent with their civil liberties obligations. Therefore, the Protocol is not engaging in data collection through the prism of deploying the least restrictive measure that is hemmed in by clear purpose-based requirements, and is, therefore, falling foul of the proportionality principle. **Concerns About Implementation and Possible Mission Creep** The Protocol fails to specify how it will interact with the Aarogya Setu app’s Terms of Service and Privacy Policy that were already in place. For instance, the Privacy Policy already contains a set of practices governing data collection and storage. Many of those provisions are now in conflict with the Protocol. However, the Protocol fails to outline the effect of these conflicts and how they will be rationalised. This creates confusion, uncertainty, and risks of greater flexibility for retention and sharing of people’s personal and sensitive personal information. We also believe that the chain of command **evokes concerns of possible mission creep**. What is especially concerning is that India’s public health institutions have minimal leadership even as these technologies are being built to respond to a public health crisis. **Don’t Just Use Buzzwords Like “Necessary and Proportionate”. Meaningfully Incorporate Them** The use of such phraseology is meant to demonstrate that the Protocol incorporates *purpose* and *use* limitations on data collected by the App. However, they are far from *restrictive*. For example, “Appropriate health responses” is a broad term that covers a wide gamut of government operations. In other words, “purpose limitation” and the principles of necessity and proportionality with respect to data collection acts as a meaningful constraint only if the purpose is spelt out with clarity and specificity to start with. If the purpose itself is excessively broad, vague, and evolving, then “necessity” and “proportionality” have no meaning at all, since data collection needs to be necessary and proportionate with regard to the purpose for which it is being collected. The Protocol, therefore, attempts to do an end run around core data principles by leaving the purpose so vague and ill-defined, that excessive data collection can potentially always be justified as necessary and proportionate. Further, the Protocol’s reference to the principle for processing data in a “*fair, transparent and non-discriminatory manner*” rings hollow. Specifically, it does not require the NIC to *publicly share* its data processing practises. **In fact, one way for processing to be transparent is by publishing the app’s underlying source code. Instead, India has not published the Aarogya Setu app’s source code and even now, a** [**recent statement of the Secretary, MeitY**](https://techcrunch.com/2020/05/12/aarogya-setu-india-contact-tracing-app-10-crore/?tpcc=ECTW2020)**indicates a reticence to publish the source code before the public**. **Excessive Collection, Processing and Storage of Personal Data** According to the Protocol, the default setting is that contact and location data remain on the device and not uploaded on to the server. This default setting is, however, immediately overridden by the next sentence which states that such data **may be** uploaded to the server to formulate / implement appropriate health responses. Given the breadth of this purpose, there is, in effect, no clarity or certainty on when contact and location data may be uploaded on the server. Moreover, the breadth of this exemption allows for the seamless creation of a centralised system. In general the storage policies are high deficient and cannot be aligned with people’s right to privacy, or the proportionality principle: 1. Data retention for six months, without any process of review while allowing for potential extension of this time-limit, is not the least intrusive measure that could be adopted. This is because it allows for retaining of people’s personal data for durations beyond the duration of the Protocol itself. Consider the following example. Imagine someone’s contact/location/self assessment data is exported on daya 45. Then that data could be retained for a period of 45 days beyond the purported last date of the Protocol which is fixed at 6 months where this data retention takes place in a legal vacuum. 2. The Protocol also fails to clarify what are the *extraordinary* circumstances in which the Government may unilaterally retain contact, location and self assessment data for a period longer than 180 days. 3. There is no policy for destroying contact, location and self assessment data based on a user request, contrary to the Protocol for demographic data. The total failure to consider user-request based destruction of such data amounts to retaining personal data without consent and is a clear breach of the right to privacy. 4. Para 5(e) also fails to clarify whether this provision applies to anonymised data or not. This is important to highlight because the current Privacy Policy of the Aarogya Setu App specifies that the data retention clause is not applicable to anonymised data. Such exemptions, if they still subsist, retain concerns of permanent systems of data analysis/surveillance. **Researchers Can Get Access to Our Data. Wait? What?** The Protocol allows for **sharing response data for research purposes** with certain specified institutions / entities registered in India where the data has undergone “Hard Anonymisation”. This demonstrates the incentives for why the Government of India has taken a centralised approach. It is less about taking the least intrusive measure towards responding to the public health crisis, but more towards maximising the utility of data. In some ways it also shows an appetite on the Government of India to commercialise or discover commercial applications the Aarogya Setu app, rather than go the path of other democratic societies which are more focused on decentralised models which may effectively alert people to get tested and treated for the coronavirus itself. That such opportunities would be non-existent in a decentralised model of data storage only further supports the argument that the adoption of a centralised model for the Aarogya Setu App is not driven by purposes related to containing the spread of Covid-19. Additionally, it shows why the data retention limits of the Aarogya Setu programme do not apply to anonymised and aggregated datasets. Therefore, there is a greater need for public scrutiny on this front. **The Sunset Clause Misses the Point** The Sunset Clause (Para 10) fails to adequately address temporal restrictions on the gathering of data by the Aarogya Setu Mobile Application. In fact, the sunset clause potentially allows for gathering such data on even more relaxed terms and conditions. Moreover, the Sunset Clause allows for its extension without any independent institutional review. Most importantly, the Sunset Clause is insufficient since there is no reference to the actual destruction of servers and systems created as an output of the Aarogya Setu programme. Without such a reference, a sunset clause is meaningless and evokes concerns of the creation of a permanent infrastructure of Government surveillance. **Concluding Thoughts** For more, please go through our detailed analysis in which we deconstruct the various shortcomings of the Protocol. At the end we also analyse certain disclosures made by the Government in a press briefing made on the same day, which evoke concerns of interlinking of Government databases and risks of permanent systems of surveillance. **Important Documents** 1. Link to IFF’s Clause by Clause Analysis of the Aarogya Setu Protocol ([**link**](https://drive.google.com/file/d/1CsDRlMDvqAH1Dq2xU5nP7GxdnDPIKhWp/view?usp=sharing)) 2. Writ Petition filed in Jackson Mathew v. Union of India ([**link**](https://drive.google.com/file/d/1wSaVWxJHhCcOkccPz9axjdtXq1GnvGY0/view?usp=sharing)) ***We are hosting a fundraiser this month to secure the salary of one staffer at IFF for a year. We need your help to remain effective and continue our work on digital rights amidst this pandemic.*** [***Help us by donating to the fund today!***](https://www.internetfreedom.in/donate) ***Don’t forget to*** [***join the Internet Freedom Forum***](https://forum.internetfreedom.in/) ***for closer dialogue with the IFF staff and community about technology, society and law!***",
    "light_cleaned_comments": "Good luck. Make it stop. We don't want China 2.0. I think they are indirectly trying to get data for NPR. Genuine question - What happens if someone doesn't have a smartphone? \"There is no discussion on why existing data at the Government’s disposal collected through hospitals, the Indian Council of Medical Research, the Integrated Disease Surveillance Programme, on ground surveillance teams, etc. does not suffice in fulfilling the objective referenced by the Protocol.\" But this data isn't enough for contact tracing. It's impossible to trace back the temporal overlap of an infected and non-infected person's travel. If u don't have an active Bluetooth system, you'll have to rely on broad time periods and quarantine of massive groups of pple based on mild suspicion alone We are on this. Trying our best. Opening up broader coalitions and working to improve civic literacy. Engaging with all state institutions in good faith while also objectively challenging it in court. We really fear on what may be a response. As per most government notifications we have seen there has not been any recognition of such people. Moreover, there is the absence of any exemption categories. It's somewhat cruel, no? At this point we really do not know. Even RTIs on source code are being rejected. And this is only on the client side, we still do not know what are all the moving parts at the server side and the product architecture to fully map it. [https://twitter.com/internetfreedom/status/1260584436489506818](https://twitter.com/internetfreedom/status/1260584436489506818) As Prof. Subhashis Banerjee explains at length contact tracing apps, specifically Aarogya Setu is questionable on grounds of utility. Link at the bottom of the linked page. [https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/](https://internetfreedom.in/kerala-hc-hears-challenges-against-mandatory-imposition-of-aarogya-setu/) The data seems too unreliable to be used for NPR though. That seems far fetched. The only problem is with location data of people and especially if the govt stores it in their servers even after we delete the apps. Though they have the aadhar anyway... There is also the nature of patients to be considered. If a patient who comes in to the hospital is too sick, for example a SARI patient needing oxygen there is no way traditional form contact tracing which involves interviewing the patient about all the places he visited and people he met over last 14 days is going to work. The patient may not be in a position to answer and may not be able to remember all his contacts over a two week period. If you read the daily reports of patients in Karnataka, most of the deaths are in SARI patients who end up dead within days of reaching the hospital or are detected as positive after deaths. How much time is lost in conducting interviews of multiple relatives to imperfectly recreate their life over last few weeks is unknown. This is especially harmful when you need to reach contacts as quickly as possible to cut off chains of transmission. Yeah Upvoted for visibility Thanks u/InternetFreedomIn  Keep the pressure on. Now that you have seen MAy11 notification, is it better or worse than what you had hoped in terms of privacy? Talks about privacy and links to google drive. Not gonna make it. The usage of tools is considerate of engaging with wider communities and we are incrementally moving away from dependency that involves such products. This is a real commitment from our forms and surveys (block survey), email tool (Mautic) and evening video calls (Jitsi and BigBlueButton). Also a lot of these decisions are upon our resource capacity which will improve in time. Stick with us for this journey! Which one ? The MHA one? We have already acted upon it. Check our website for the same day. Thank you! We will!"
}