{
    "id": "1dwlqsq",
    "title": "How compensation for Agniveers differs from that for regular soldiers",
    "url": "https://indianexpress.com/article/explained/compensation-agniveers-differs-from-regular-soldiers-9434369/",
    "selftext": "Rahul Gandhi has alleged that an Agniveer who died in January has not received compensation, an accusation the Govt and Army have denied. How much do families of Agniveers get in case of death, and under what heads?",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1720258017,
    "convurl": "https://external-preview.redd.it/k4uJgmfQca8HKZMtm_6sNduskQtLBc70TK0ExNFh2_4.jpg",
    "comments": [
        "Government sources said the Rs 1.65 crore include Rs 48 lakh and Rs 50 lakh as insurance from the central government and from financial institutions under an MoU respectively; an additional sum of ⁠Rs 39,000; Rs 44 lakh as ex gratia; ⁠Rs 8 lakh from the Army welfare fund; Rs 13 lakh as balance of pay until completion of tenure; and Rs 2.3 lakh as Seva Nidhi, the contributory scheme that Agniveers are entitled to.\nThe Army said Rs 98.39 lakh had already been paid to the fallen Agniveer’s family."
    ],
    "cleaned_text": "compensation agniveers differs regular soldiers rahul gandhi alleged agniveer died january received compensation accusation govt army denied much families agniveers get case death heads ",
    "cleaned_title": "compensation agniveers differs regular soldiers",
    "cleaned_selftext": "rahul gandhi alleged agniveer died january received compensation accusation govt army denied much families agniveers get case death heads",
    "cleaned_comments": "government sources said rs crore include rs lakh rs lakh insurance central government financial institutions mou respectively additional sum rs rs lakh ex gratia rs lakh army welfare fund rs lakh balance pay completion tenure rs lakh seva nidhi contributory scheme agniveers entitled army said rs lakh already paid fallen agniveers family",
    "light_cleaned_title": "How compensation for Agniveers differs from that for regular soldiers",
    "light_cleaned_selftext": "Rahul Gandhi has alleged that an Agniveer who died in January has not received compensation, an accusation the Govt and Army have denied. How much do families of Agniveers get in case of death, and under what heads?",
    "light_cleaned_comments": "Government sources said the Rs 1.65 crore include Rs 48 lakh and Rs 50 lakh as insurance from the central government and from financial institutions under an MoU respectively; an additional sum of ⁠Rs 39,000; Rs 44 lakh as ex gratia; ⁠Rs 8 lakh from the Army welfare fund; Rs 13 lakh as balance of pay until completion of tenure; and Rs 2.3 lakh as Seva Nidhi, the contributory scheme that Agniveers are entitled to. The Army said Rs 98.39 lakh had already been paid to the fallen Agniveer’s family."
}