{
    "id": "15wv0bb",
    "title": "Supreme Court judgment delivered four decades ago counters President’s rule in J&K",
    "url": "https://www.thehindu.com/news/national/supreme-court-judgment-delivered-four-decades-ago-counters-president-rule-in-jk/article67216398.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fnational%2Fsupreme-court-judgment-delivered-four-decades-ago-counters-president-rule-in-jk%2Farticle67216398.ece",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1692586088.0,
    "convurl": "https://external-preview.redd.it/lV3iU3kvURfAwEfNTtSggShAmo0O2eaiNqcXQsAEteQ.jpg?auto=webp&s=af3e1d2b2d2d2e890c1b5f4e4b7e368329bb3806",
    "comments": [
        ">The 1971 judgment, in a nutshell, holds that once a Governor dissolves a State’s legislative Assembly and assumes powers of the State, there is no question of the President taking over by claiming “failure of constitutional machinery” under Article 356 of the Constitution.\n\n>Mr. Naphade, for the petitioner side, said it was “absurd” for the President to claim there was a “breakdown of constitutional machinery” when the reins of the State was with the very Governor he had appointed.",
        "The repeal of Art. 370 was an underhanded move by the central government. However, I refuse to believe that the SC will overturn the decision. At best, they will say that it should not have happened but they can't overturn it now.",
        "Yeah they seem to be taking that path a lot \n\n[Courts Shouldn't Waver In Granting Real Relief After Deciding Something To Be Unconstitutional : Justice Deepak Gupta](https://www.livelaw.in/top-stories/courts-shouldnt-waver-in-granting-real-relief-after-deciding-something-to-be-unconstitutional-justice-deepak-gupta-235677) \nFormer sc judge echoed the same recently"
    ],
    "cleaned_text": "supreme court judgment delivered four decades ago counters presidents rule jk  ",
    "cleaned_title": "supreme court judgment delivered four decades ago counters presidents rule jk",
    "cleaned_selftext": "",
    "cleaned_comments": "judgment nutshell holds governor dissolves states legislative assembly assumes powers state question president taking claiming failure constitutional machinery article constitution mr naphade petitioner side said absurd president claim breakdown constitutional machinery reins state governor appointed repeal art underhanded move central government however refuse believe sc overturn decision best say happened cant overturn yeah seem taking path lot courts shouldnt waver granting real relief deciding something unconstitutional justice deepak guptahttpswwwlivelawintopstoriescourtsshouldntwaveringrantingrealreliefafterdecidingsomethingtobeunconstitutionaljusticedeepakgupta former sc judge echoed recently",
    "light_cleaned_title": "Supreme Court judgment delivered four decades ago counters President’s rule in J&K",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": ">The 1971 judgment, in a nutshell, holds that once a Governor dissolves a State’s legislative Assembly and assumes powers of the State, there is no question of the President taking over by claiming “failure of constitutional machinery” under Article 356 of the Constitution. >Mr. Naphade, for the petitioner side, said it was “absurd” for the President to claim there was a “breakdown of constitutional machinery” when the reins of the State was with the very Governor he had appointed. The repeal of Art. 370 was an underhanded move by the central government. However, I refuse to believe that the SC will overturn the decision. At best, they will say that it should not have happened but they can't overturn it now. Yeah they seem to be taking that path a lot [Courts Shouldn't Waver In Granting Real Relief After Deciding Something To Be Unconstitutional : Justice Deepak Gupta](https://www.livelaw.in/top-stories/courts-shouldnt-waver-in-granting-real-relief-after-deciding-something-to-be-unconstitutional-justice-deepak-gupta-235677) Former sc judge echoed the same recently"
}