{
    "id": "17pvqsn",
    "title": "AMA Announcement: Live AMA with The Liver Doc. Join us on 9th Nov, Thursday at 7:30 pm IST in r/india",
    "url": "https://www.reddit.com/r/india/comments/17pvqsn/ama_announcement_live_ama_with_the_liver_doc_join/",
    "selftext": "  Join **The Liver Doc (u/TheLiverDoc)** on 9th Nov, Thursday at 7:30 pm for a Reddit AMA (Ask Me Anything).\n\nDr Cyriac Abby Philips, popularly known as “The Liver Doc” on X (previously Twitter) is a clinician scientist and senior consultant in the Department of Clinical & Translational Hepatology at The Liver Institute, Rajagiri Hospital, Kochi, Kerala. His core clinical work and research focus is on severe alcoholic liver disease and drug-induced liver injury in the context of Indian traditional systems of medicine. His pioneering work has been the introduction of stool transplant for salvaging patients dying from severe alcohol-related hepatitis and disruptive peer-reviewed publications that showcase the adverse impact of traditional Indian healthcare practices collectively known as Ayush on public health. \n\nDr Cyriac Abby Philips, popularly known as “The Liver Doc” on X (previously Twitter) is a clinician scientist and senior consultant in the Department of Clinical & Translational Hepatology at The Liver Institute, Rajagiri Hospital, Kochi, Kerala. His core clinical work and research focus is on severe alcoholic liver disease and drug-induced liver injury in the context of Indian traditional systems of medicine. His pioneering work has been the introduction of stool transplant for salvaging patients dying from severe alcohol-related hepatitis and disruptive peer-reviewed publications that showcase the adverse impact of traditional Indian healthcare practices collectively known as Ayush on public health. our-time AASLD Young Investigator Award winner, the only young investigator Hepatologist to do so from the Asian continent. The Indian Society of Gastroenterology awarded the National Om-Prakash Memorial Rising Star to Dr Abby in 2022 for his work on liver toxicity of Ayurvedic herbals. Shri. V Sivankutty, the Minister of Education, Kerala awarded Dr Abby the coveted State-level P. Kesavadev Prize 2023 for using his social media to educate the public on harms due to unscientific alternative medicine practices. \n\nDr Abby is a prolific researcher with over 220 peer-reviewed publications in major Gastroenterology and Hepatology journals with over 2300 citations. Dr Abby has been extensively featured by almost all major Indian media including Lallantop, Barkha Dutt’s Mojo Story, The Times of India, Malayala Manorama; and prominent international media on his professional and academic work including Germany’s media behemoth Der Spiegel, Radio France Internationale and Hong Kong’s South China Morning Post, and The Insider. The Week Magazine featured him as the top “Influencer Doctor” from India in their special feature; The Hindu featured him in their Special issue on “People Waging War on Medical Science Misinformation,” and India Today featured him as a powerhouse “de-influencer” battling health misinformation online at great personal cost.\n\nCatch The Liver Doc here on r/India this Thursday and ask him anything!\n\nhttps://preview.redd.it/gl7fqqltrxyb1.jpg?width=1080&format=pjpg&auto=webp&s=f71d21657e12e640453aa5daea23c71d1e94f937",
    "flair": "Law & Courts",
    "score": 107,
    "num_comments": 24,
    "created_utc": 1699367994.0,
    "convurl": "https://b.thumbs.redditmedia.com/zuedRFI2oS_QS8SG1U2Kf777S_JLO1I1bRSXtGu7TFo.jpg",
    "comments": [
        "Thank you for your service. 🫡",
        "Nice",
        "This is great! Your tweets are pure gold! We need more Doctors like you in the USA. Never censor yourself Dr. Abby.",
        "You have a really dope PC setup. When you get some free time, what kind of games do you get to play?",
        "I have help C detected in 2014 I don't smoke don't drink don't do any drugs, what are the risk I may be having",
        "Hey! Why aren't you making YouTube videos anymore?\n\nAnd what happened to Himalaya lawsuit??\n\nBig fan of your work btw.",
        "I Follow ur work on tweeter . \nHow u deal with so much toxicity around u \nAll the pressure from so many influential people \nWhat is the cost ur paying for it \nWhat’s ur family’s reaction to it \nBest wishes doctor 💐\nA fellow doctor here",
        "To what extent does Rajagiri Hospital Management support your efforts to debunk pseudoscientific claims in the field of Ayurveda and other traditional Indian medical practices, given the potential for backlash from Hindu nationalist groups and the central government?",
        "I'll drink to that 🍻",
        "I have medical mbbs doctors who are telling Ashwagandha and Shilajit work, and that drinking turmeric milk before sleep is good. how are such medical professionals recommending it?   \nbefore major surgery, how many doctors should one ask for opinions?  \nAny RW  troll ever harassed you in real life? if yes how did you deal with them.",
        "How to join in this discussion?",
        "Yes looking forward yes joing",
        "Hi Doctor,\n\nI highly appreciate what you are doing for the community.\n\nI just want to ask how do I reduce my sleeping time and still feel fresh.\n\nThe studies have confused me a lot. I know recently a study has come out wherein they said it is not important to sleep for 8 hours. \nBut then what is the minimum hours of sleep that one needs. \n\nThanks",
        "Started drinking 3 cups of black coffee every day following your advice on Twitter, I can already see benefits of it. It’s just been 2 months. Please suggest more such drinks or food.",
        "Other than lawsuits and legal letters, have you received any other forms of threats or messages? \n\nDo you think your peers are shushed from exposing general medical malpractices expecting backlash?",
        "Don't know about turmeric but ashwagandha does have some proven health benifits.",
        "Dear folks please ask your doubts not his !!",
        "Thank you Doc!",
        "https://x.com/theliverdr/status/1526169530984062977?s=20\n\nLmao",
        "Huge fan. Thanks for everything you do to battle pseudoscience.\n\nI used to think literacy would help combat pseudoscience. But with people in even the STEM fields blatantly pedaling alternative medicine, how do we encourage the general public to put their trust in modern medicine?",
        "Remember, this is an announcement thread and not an AMA thread. AMA thread will be posted at the aforementioned time. Please keep your questions reserved for that thread.",
        "Please suggest a legit diet/drink specifically for detox purpose after a heavy drinking night(not hangover)"
    ],
    "cleaned_text": "ama announcement live ama liver doc join us th nov thursday pm ist rindia join liver doc utheliverdoc th nov thursday pm reddit ama ask anything dr cyriac abby philips popularly known liver doc x previously twitter clinician scientist senior consultant department clinical translational hepatology liver institute rajagiri hospital kochi kerala core clinical work research focus severe alcoholic liver disease druginduced liver injury context indian traditional systems medicine pioneering work introduction stool transplant salvaging patients dying severe alcoholrelated hepatitis disruptive peerreviewed publications showcase adverse impact traditional indian healthcare practices collectively known ayush public health dr cyriac abby philips popularly known liver doc x previously twitter clinician scientist senior consultant department clinical translational hepatology liver institute rajagiri hospital kochi kerala core clinical work research focus severe alcoholic liver disease druginduced liver injury context indian traditional systems medicine pioneering work introduction stool transplant salvaging patients dying severe alcoholrelated hepatitis disruptive peerreviewed publications showcase adverse impact traditional indian healthcare practices collectively known ayush public health ourtime aasld young investigator award winner young investigator hepatologist asian continent indian society gastroenterology awarded national omprakash memorial rising star dr abby work liver toxicity ayurvedic herbals shri v sivankutty minister education kerala awarded dr abby coveted statelevel p kesavadev prize using social media educate public harms due unscientific alternative medicine practices dr abby prolific researcher peerreviewed publications major gastroenterology hepatology journals citations dr abby extensively featured almost major indian media including lallantop barkha dutts mojo story times india malayala manorama prominent international media professional academic work including germanys media behemoth der spiegel radio france internationale hong kongs south china morning post insider week magazine featured top influencer doctor india special feature hindu featured special issue people waging war medical science misinformation india today featured powerhouse deinfluencer battling health misinformation online great personal cost catch liver doc rindia thursday ask anything ",
    "cleaned_title": "ama announcement live ama liver doc join us th nov thursday pm ist rindia",
    "cleaned_selftext": "join liver doc utheliverdoc th nov thursday pm reddit ama ask anything dr cyriac abby philips popularly known liver doc x previously twitter clinician scientist senior consultant department clinical translational hepatology liver institute rajagiri hospital kochi kerala core clinical work research focus severe alcoholic liver disease druginduced liver injury context indian traditional systems medicine pioneering work introduction stool transplant salvaging patients dying severe alcoholrelated hepatitis disruptive peerreviewed publications showcase adverse impact traditional indian healthcare practices collectively known ayush public health dr cyriac abby philips popularly known liver doc x previously twitter clinician scientist senior consultant department clinical translational hepatology liver institute rajagiri hospital kochi kerala core clinical work research focus severe alcoholic liver disease druginduced liver injury context indian traditional systems medicine pioneering work introduction stool transplant salvaging patients dying severe alcoholrelated hepatitis disruptive peerreviewed publications showcase adverse impact traditional indian healthcare practices collectively known ayush public health ourtime aasld young investigator award winner young investigator hepatologist asian continent indian society gastroenterology awarded national omprakash memorial rising star dr abby work liver toxicity ayurvedic herbals shri v sivankutty minister education kerala awarded dr abby coveted statelevel p kesavadev prize using social media educate public harms due unscientific alternative medicine practices dr abby prolific researcher peerreviewed publications major gastroenterology hepatology journals citations dr abby extensively featured almost major indian media including lallantop barkha dutts mojo story times india malayala manorama prominent international media professional academic work including germanys media behemoth der spiegel radio france internationale hong kongs south china morning post insider week magazine featured top influencer doctor india special feature hindu featured special issue people waging war medical science misinformation india today featured powerhouse deinfluencer battling health misinformation online great personal cost catch liver doc rindia thursday ask anything",
    "cleaned_comments": "thank service nice great tweets pure gold need doctors like usa never censor dr abby really dope pc setup get free time kind games get play help c detected dont smoke dont drink dont drugs risk may hey arent making youtube videos anymore happened himalaya lawsuit big fan work btw follow ur work tweeter u deal much toxicity around u pressure many influential people cost ur paying whats ur familys reaction best wishes doctor fellow doctor extent rajagiri hospital management support efforts debunk pseudoscientific claims field ayurveda traditional indian medical practices given potential backlash hindu nationalist groups central government ill drink medical mbbs doctors telling ashwagandha shilajit work drinking turmeric milk sleep good medical professionals recommending major surgery many doctors one ask opinions rw troll ever harassed real life yes deal join discussion yes looking forward yes joing hi doctor highly appreciate community want ask reduce sleeping time still feel fresh studies confused lot know recently study come wherein said important sleep hours minimum hours sleep one needs thanks started drinking cups black coffee every day following advice twitter already see benefits months please suggest drinks food lawsuits legal letters received forms threats messages think peers shushed exposing general medical malpractices expecting backlash dont know turmeric ashwagandha proven health benifits dear folks please ask doubts thank doc lmao huge fan thanks everything battle pseudoscience used think literacy would help combat pseudoscience people even stem fields blatantly pedaling alternative medicine encourage general public put trust modern medicine remember announcement thread ama thread ama thread posted aforementioned time please keep questions reserved thread please suggest legit dietdrink specifically detox purpose heavy drinking nightnot hangover",
    "light_cleaned_title": "AMA Announcement: Live AMA with The Liver Doc. Join us on 9th Nov, Thursday at 7:30 pm IST in r/india",
    "light_cleaned_selftext": "Join **The Liver Doc (u/TheLiverDoc)** on 9th Nov, Thursday at 7:30 pm for a Reddit AMA (Ask Me Anything). Dr Cyriac Abby Philips, popularly known as “The Liver Doc” on X (previously Twitter) is a clinician scientist and senior consultant in the Department of Clinical & Translational Hepatology at The Liver Institute, Rajagiri Hospital, Kochi, Kerala. His core clinical work and research focus is on severe alcoholic liver disease and drug-induced liver injury in the context of Indian traditional systems of medicine. His pioneering work has been the introduction of stool transplant for salvaging patients dying from severe alcohol-related hepatitis and disruptive peer-reviewed publications that showcase the adverse impact of traditional Indian healthcare practices collectively known as Ayush on public health. Dr Cyriac Abby Philips, popularly known as “The Liver Doc” on X (previously Twitter) is a clinician scientist and senior consultant in the Department of Clinical & Translational Hepatology at The Liver Institute, Rajagiri Hospital, Kochi, Kerala. His core clinical work and research focus is on severe alcoholic liver disease and drug-induced liver injury in the context of Indian traditional systems of medicine. His pioneering work has been the introduction of stool transplant for salvaging patients dying from severe alcohol-related hepatitis and disruptive peer-reviewed publications that showcase the adverse impact of traditional Indian healthcare practices collectively known as Ayush on public health. our-time AASLD Young Investigator Award winner, the only young investigator Hepatologist to do so from the Asian continent. The Indian Society of Gastroenterology awarded the National Om-Prakash Memorial Rising Star to Dr Abby in 2022 for his work on liver toxicity of Ayurvedic herbals. Shri. V Sivankutty, the Minister of Education, Kerala awarded Dr Abby the coveted State-level P. Kesavadev Prize 2023 for using his social media to educate the public on harms due to unscientific alternative medicine practices. Dr Abby is a prolific researcher with over 220 peer-reviewed publications in major Gastroenterology and Hepatology journals with over 2300 citations. Dr Abby has been extensively featured by almost all major Indian media including Lallantop, Barkha Dutt’s Mojo Story, The Times of India, Malayala Manorama; and prominent international media on his professional and academic work including Germany’s media behemoth Der Spiegel, Radio France Internationale and Hong Kong’s South China Morning Post, and The Insider. The Week Magazine featured him as the top “Influencer Doctor” from India in their special feature; The Hindu featured him in their Special issue on “People Waging War on Medical Science Misinformation,” and India Today featured him as a powerhouse “de-influencer” battling health misinformation online at great personal cost. Catch The Liver Doc here on r/India this Thursday and ask him anything!",
    "light_cleaned_comments": "Thank you for your service. 🫡 Nice This is great! Your tweets are pure gold! We need more Doctors like you in the USA. Never censor yourself Dr. Abby. You have a really dope PC setup. When you get some free time, what kind of games do you get to play? I have help C detected in 2014 I don't smoke don't drink don't do any drugs, what are the risk I may be having Hey! Why aren't you making YouTube videos anymore? And what happened to Himalaya lawsuit?? Big fan of your work btw. I Follow ur work on tweeter . How u deal with so much toxicity around u All the pressure from so many influential people What is the cost ur paying for it What’s ur family’s reaction to it Best wishes doctor 💐 A fellow doctor here To what extent does Rajagiri Hospital Management support your efforts to debunk pseudoscientific claims in the field of Ayurveda and other traditional Indian medical practices, given the potential for backlash from Hindu nationalist groups and the central government? I'll drink to that 🍻 I have medical mbbs doctors who are telling Ashwagandha and Shilajit work, and that drinking turmeric milk before sleep is good. how are such medical professionals recommending it? before major surgery, how many doctors should one ask for opinions? Any RW troll ever harassed you in real life? if yes how did you deal with them. How to join in this discussion? Yes looking forward yes joing Hi Doctor, I highly appreciate what you are doing for the community. I just want to ask how do I reduce my sleeping time and still feel fresh. The studies have confused me a lot. I know recently a study has come out wherein they said it is not important to sleep for 8 hours. But then what is the minimum hours of sleep that one needs. Thanks Started drinking 3 cups of black coffee every day following your advice on Twitter, I can already see benefits of it. It’s just been 2 months. Please suggest more such drinks or food. Other than lawsuits and legal letters, have you received any other forms of threats or messages? Do you think your peers are shushed from exposing general medical malpractices expecting backlash? Don't know about turmeric but ashwagandha does have some proven health benifits. Dear folks please ask your doubts not his !! Thank you Doc! Lmao Huge fan. Thanks for everything you do to battle pseudoscience. I used to think literacy would help combat pseudoscience. But with people in even the STEM fields blatantly pedaling alternative medicine, how do we encourage the general public to put their trust in modern medicine? Remember, this is an announcement thread and not an AMA thread. AMA thread will be posted at the aforementioned time. Please keep your questions reserved for that thread. Please suggest a legit diet/drink specifically for detox purpose after a heavy drinking night(not hangover)"
}