{
    "id": "145uc3u",
    "title": "Uttarkashi: Cross marks, “leave” threats on Muslim shops, hatred spreads to other towns: Uttarakhand",
    "url": "https://sabrangindia.in/article/uttarkashi-cross-marks-leave-threats-muslim-shops-hatred-spreads-other-towns-uttarakhand/",
    "selftext": "https://m.timesofindia.com/india/in-uttarakhand-towns-muslims-wake-up-to-marked-shops-and-quit-notices/articleshow/100872675.cms\n\nDoors marked by an 'X', Muslims are fleeing Uttarakhand - Times of India",
    "flair": "Politics",
    "score": 25,
    "num_comments": 3,
    "created_utc": 1686384554.0,
    "convurl": "https://external-preview.redd.it/D0zrRLiZlW6bBUmO_zsTB4MvZpBo74DTRHjecsNrDXE.jpg?auto=webp&v=enabled&s=5c90bc114a0230b780028692d7d379f5074ad7aa",
    "comments": [
        "What more proof do we need of what we have become as a people and as a country?",
        "Days after tensions erupted in Uttarkashi over the abduction of Hindu girl by two young men in Uttarkashi’s Purola, the effects are being seen in other towns as well.\n\nThe outrage has simmered and now spread to another town, namely, Barkot. In Purola, as the shops belonging to Muslims remain shut, some errant right wing groups pasted posters on the shutters of these shops on Saturday. These posters threaten them to “shut down their business and leave the town before a ‘mahapanchayat’ to be held on June 15 or else face action.” In some places, shops belonging to Muslims have been vandalized with black cross marks, reported The Times of India. The posters were removed by the police on Monday.",
        "This is the best tl;dr I could make, [original](https://sabrangindia.in/article/uttarkashi-cross-marks-leave-threats-muslim-shops-hatred-spreads-other-towns-uttarakhand/) reduced by 89%. (I'm a bot)\n*****\n> In Purola, as the shops belonging to Muslims remain shut, some errant right wing groups pasted posters on the shutters of these shops on Saturday.\n\n> These posters threaten them to &quot;Shut down their business and leave the town before a &#039;mahapanchayat&#039; to be held on June 15 or else face action.&quot; In some places, shops belonging to Muslims have been vandalized with black cross marks, reported The Times of India.\n\n> The protest march in Purola on May 29 had turned violent whereby Muslim shops were attacked and over 900 people had taken part in this mob.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/145wual/cross_marks_on_muslim_shops_vacate_the_shops_or/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~688434 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Muslim**^#1 **shops**^#2 **Purola**^#3 **poster**^#4 **town**^#5"
    ],
    "cleaned_text": "uttarkashi cross marks leave threats muslim shops hatred spreads towns uttarakhand doors marked x muslims fleeing uttarakhand times india ",
    "cleaned_title": "uttarkashi cross marks leave threats muslim shops hatred spreads towns uttarakhand",
    "cleaned_selftext": "doors marked x muslims fleeing uttarakhand times india",
    "cleaned_comments": "proof need become people country days tensions erupted uttarkashi abduction hindu girl two young men uttarkashis purola effects seen towns well outrage simmered spread another town namely barkot purola shops belonging muslims remain shut errant right wing groups pasted posters shutters shops saturday posters threaten shut business leave town mahapanchayat held june else face action places shops belonging muslims vandalized black cross marks reported times india posters removed police monday best tldr could make originalhttpssabrangindiainarticleuttarkashicrossmarksleavethreatsmuslimshopshatredspreadsothertownsuttarakhand reduced im bot purola shops belonging muslims remain shut errant right wing groups pasted posters shutters shops saturday posters threaten quotshut business leave town mahapanchayat held june else face actionquot places shops belonging muslims vandalized black cross marks reported times india protest march purola may turned violent whereby muslim shops attacked people taken part mob extended summaryhttpnpredditcomrautotldrcommentswualcrossmarksonmuslimshopsvacatetheshopsor faqhttpnpredditcomrautotldrcommentsbfmfaqautotldrbot version tldrs far feedbackhttpnpredditcommessagecomposetoautotldr pms comments monitored constructive feedback welcome top keywords muslim shops purola poster town",
    "light_cleaned_title": "Uttarkashi: Cross marks, “leave” threats on Muslim shops, hatred spreads to other towns: Uttarakhand",
    "light_cleaned_selftext": "Doors marked by an 'X', Muslims are fleeing Uttarakhand - Times of India",
    "light_cleaned_comments": "What more proof do we need of what we have become as a people and as a country? Days after tensions erupted in Uttarkashi over the abduction of Hindu girl by two young men in Uttarkashi’s Purola, the effects are being seen in other towns as well. The outrage has simmered and now spread to another town, namely, Barkot. In Purola, as the shops belonging to Muslims remain shut, some errant right wing groups pasted posters on the shutters of these shops on Saturday. These posters threaten them to “shut down their business and leave the town before a ‘mahapanchayat’ to be held on June 15 or else face action.” In some places, shops belonging to Muslims have been vandalized with black cross marks, reported The Times of India. The posters were removed by the police on Monday. This is the best tl;dr I could make, [original](https://sabrangindia.in/article/uttarkashi-cross-marks-leave-threats-muslim-shops-hatred-spreads-other-towns-uttarakhand/) reduced by 89%. (I'm a bot) ***** > In Purola, as the shops belonging to Muslims remain shut, some errant right wing groups pasted posters on the shutters of these shops on Saturday. > These posters threaten them to &quot;Shut down their business and leave the town before a &#039;mahapanchayat&#039; to be held on June 15 or else face action.&quot; In some places, shops belonging to Muslims have been vandalized with black cross marks, reported The Times of India. > The protest march in Purola on May 29 had turned violent whereby Muslim shops were attacked and over 900 people had taken part in this mob. ***** [**Extended Summary**](http://np.reddit.com/r/autotldr/comments/145wual/cross_marks_on_muslim_shops_vacate_the_shops_or/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~688434 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Muslim**^#1 **shops**^#2 **Purola**^#3 **poster**^#4 **town**^#5"
}