{
    "id": "1dgc5a7",
    "title": "Middle class will eventually reduce and either be absorbed into lower or upper economic strata based on the predatory schemes of this system on Middle Class",
    "url": "https://www.reddit.com/r/india/comments/1dgc5a7/middle_class_will_eventually_reduce_and_either_be/",
    "selftext": "While salaried employees get upto 5-10% increment per year and real inflation hovering at 7-8%, Autowalas, maids, drivers, etc hike their salaries by 15-25% every year. \n\nThe rich keep their money in stock market and only pay taxes when they cash out those taxes as LTCG, STT, GST, SEBI turnover fee and NSE charges \n\nTheir companies pay taxes on income but claim GST returns using debt, depreciation value of assets and expenses. \n\nLower economic strata take 15-25%+ hikes and try to deal in cash to skip paying direct income tax while getting assistance from government for housing , jobs, etc \n\nSalaried middle class has to pay TDS at source, TDS for FD, face reduced interest rates on savings bank account, reduced interest rates on FD, high taxes on Stock market buy and sell orders, minimal to nil assistance for housing, education, etc \n\nMiddle class money keep getting extracted by Lower and Upper economic strata till middle class disappears completely and gets converted to upper or lower economic strata \n\nIncome tax rebate 80c has been capped at 1.5L for the last 10 years and inflation has soared in this period but it’s not adjusted as per inflation like many countries in the world do. \n\nhttps://frontline.thehindu.com/columns/indias-middle-class-is-caught-in-economic-woes-and-divisive-politics-more-debt-bjp-indian-citizens-religion/article68139087.ece/amp/\n\nhttps://timesofindia.indiatimes.com/blogs/voices/the-what-and-why-of-indias-shrinking-middle-class/\n\n\n\n",
    "flair": "Policy/Economy",
    "score": 398,
    "num_comments": 58,
    "created_utc": 1718434860.0,
    "convurl": "https://external-preview.redd.it/JqAOwPvngE6BwotVvwGuzHTxK_dKzoKmDMusJ_5KGZE.jpg?auto=webp&s=16ec7e962eaa9bf67d7f16f87fbfd3f2fa071675",
    "comments": [
        "Not one policy maker is incentivised to work for us. It's a sad state of affairs. While the working class drives the country forward it bears most or all of the brunt.",
        "Rich has money to fund political parties....\nPoor have votes to give them majority....\nMiddle class does not matter.....\n\nEither become poor to get benifits from Government or Get rich",
        "Middle class also doesn’t vote",
        "Even if they do...Their vote may change affect some seats but...far away from making majority \n..",
        "That why one shouldn’t be loyal to a company and jump for some another ship with some decent hike. No is there for you except you. \n\nFor housing you get deduction of 2L every year on your interest. The housing loan interest is also subsidised by the government. For education, RBI has a clear rule that you can get collateral free loan from a bank. And when you paying off the interest you can claim the entire interest amount for that year as deductible.",
        "It's just a simple excuse of not voting by giving yourselves consolation that our votes don't matter. The day the majority of the middle class starts voting- all the politician would pay heed to them and starts working for them.",
        "Middle class is the least class concious. They try to ape the upper class who consider them as slaves. Middle class consider themselves above the poor who hate them.",
        "Indian middle class are the most anti-poor, anti-class struggle, pro-rich, pro-free market, pro libertarian capitalists. They don't consider themselves to be a part of the working class for some reason, I think their militant anti-poor stands just doesn't allow them to acknowledge that. It's same with how working class in western countries are against international class struggle because they consider themselves to \"privileged\" over workers in 3rd world.",
        "There's 2 classes\nWorking and the rich, the rich has divided working into \"working/lower\" class and \"middle\" class and has convinced both that they are the enemies. Any autorickshaw driver/maid will switch lives with any average \"middle\" class individual but no \"middle\" class individual will actually switch lives with a autorickshaw driver/maid.\n\n\nStop treating blue collar individuals as your enemy. Your only enemy is the rich and ruling class who hold majority of the wealth",
        "Salaried middle class in private jobs especially are the real middle class, not like businessman who don't pay taxes and exploits their labour or customers or govt employees who takes bribes or lawyers who got sold-out or doctors whose write unecessary tests or surgeries or policemen everybody knows about them.",
        ">Salaried middle class has to pay TDS at source, TDS for FD, face reduced interest rates on savings bank account, reduced interest rates on FD, high taxes on Stock market buy and sell orders, minimal to nil assistance for housing, education, etc \n\n\nIf you are getting low interest rate for FDs and savings means you also get housing and car loans ate cheaper rates. Which directly benefits the middle class most.",
        "Merge with the lower in politics and fight. This country is being sold or handed over free to gujju bijnej-men.",
        "Being poor should never be an option. As someone who has experienced poverty, it's a fate worse than death.",
        "> Middle class money keep getting extracted by Lower\n\nby extracted, you mean paying people exploitative wages, and slowly needing to increase those to still exploitative, but slightly higher wages?\n\nby that logic, the middle class is extracting money from their bosses.",
        "This! If OP thinks lower class is lucky, then he should join them.",
        "Facts. Ppl who work jobs desk jobs consider themself higher than the janitors, Watchmen, etc just because of their salaries.\n\n\nWhen I was working as an intern my senior told me no matter the post we r all employees which means we r all slaves to our corporate overlords. I guess only the executives, VPs & CEOs r the safe ones.",
        "This is the RSS's long term vision. A two class feudal like society with water tight caste boundaries",
        "I worked at a “branded” place for 4 years. A name that everyone knows but can’t disclose here. Did good projects, was regular and punctual. In that span they only gave increment only, that was minuscule. \n\nBeing from lower middle class, I think with the increasing price I will be soon be categorised as EWS.",
        "Middle class is a significant number in this country, but still not significant enough to be a core voter base. Caste and religion are better tools for political parties to divide the people. Rich people, as long as they invest heavily in the country, will always be key for the govt. Most of the poor and middle class vote on the basis of caste or religion. \n\nI had said this in another post and gotten downvoted, but the only kind of parties which can cater to all sections of the society is one that is focused on development, especially infrastructure focused development.",
        "Lol the indian middle class is the most deluded self righteous bunch of fucks on the planet.",
        "In a city like Mumbai there was an election won by 48 votes this year\n\nNever think one vote doesnt matter",
        "I have seen middle class idiots from my previous and current company complain about water and electricity subsidy in Delhi, even if they are from Delhi or not. These people don't even realise that literally this is like only subsidy that somewhat gives direct benefits to middle class. \n\nBJP has given so much free ration for poor class, and his capitalist buddies are all enjoying great tax benefits, lax environment laws & labour laws, and middle class is simply being fooled.",
        "Nonsense!\n\nDefine middle class.",
        "I don't fully agree with you but the other day I was thinking the same thing. How come none of the policies are in favour of middle class ? No one is even thinking about middle class. None of the government schemes include middle class. \n\nWe should really do something about this and come together instead of divided by caste and religion.",
        "https://preview.redd.it/lb2m0z5ihs6d1.jpeg?width=828&format=pjpg&auto=webp&s=ec27d3b76fc9bb5145936cf118de079479b49bf8",
        "Middle class is also rife with insecurity and envy. It's what makes them anti-middleclass themselves trying to put down their peers to one up them.",
        "Someone born poor could still be fiscally responsible with what they get. I think it's worse for people who end up getting downgraded and having no experience how to adjust. Maslow's hierarchy also proves it's really hard for people to demote their level of needs. It results in males resorting to drinking to match their old happiness, and females giving up work to marry and be completely dependent on their husbands.",
        ">It's same with how working class in western countries are against international class struggle because they consider themselves to \"privileged\" over workers in 3rd world\n\nBut the requirements of working class in western and eastern societies might differ\n\nA majority of voters for example would be against outsourcing/ offshoring to Asia as an example.",
        "I think OP has zero self reflection.",
        ">the society is one that is focused on development, especially infrastructure focused development.\n\nJust infrastructure development without improving ease of doing business, speed of courts etc would not give the full benefits of good infrastructure.\n\nThese are called structural reforms.\n\nThat is what economists have been saying for years.",
        "I am suddenly very very scared for my future as someone from a middle class family",
        "Salaried Class will end soon, Only labour class will remain.",
        "For all this hue and cry the urban savarna votebank will still go vote for Modi, because they're mostly insulated from larger issues of the country, would love to remain that way.\n\nJust look at the voter turnout of major cities.",
        "Middle class won't reduce but will starve to death. See we middle class people can't do lower Class jobs like plumbers, electricians, mechanics, janitors , neither can we become big industrialists. Our type of jobs are so few. Also things like price rise affects the middle class most. So from all directions we are screwed. Healthcare is so expensive but our salaries are so low..",
        "Middle class can be king maker but not the decider of who holds the majority",
        "This is exactly what happened in Andhra and why Jagan got voted out in a landslide. His schemes actually were implemented very well, too well in fact. He did nothing but implement his welfare schemes. The middle class and upper castes consolidated like never before and voted him out.",
        "Best option is to leave the country!!",
        "That is also important. But in this country, we have not even built basic infrastructure everywhere. Good infrastructure will increase the investments and businesses will be able to do better. The govt also has to bring in good laws to improve the ease of doing business. But at the core of it all, good infrastructure is the most important part.\n\nThe legislative part can be changed easily. But it's the actual physical on ground work that is the most difficult, especially because of the corruption that's involved at the moment.",
        "Middle class is very important for the economy. They are called the consuming class. They mass consume products mass produced by companies owned by the top 1%.",
        "Vote for Raga. He’s a socialist. I hope the khatakahat schemes come true.",
        "The main reason why he got voted out was stalling of the Amaravati project. \n\nHe did many good things but the right wing extremists got a reason to smear him \n\nThe right wing extremists started labelling him as anti majority, etc and started finding relatives of his who belong to other faiths , etc",
        "U are spot on.",
        "New trend of middle class nowadays is to be against unions or any sort of org which protects rights. Granted that excessive unionisation has its own demerits, but having no unions to protect labour rights is far dangerous in a growing capitalists dystopia.",
        "We would have to disagree then.\n\nIf I was a businessman, I would only use India as a low cost center and not try to do cutting edge research here.\n\nThe reason is simple, I would not be convinced of the IP laws being defended properly and getting a proper judgment in time from Indian Courts.\n\nJustice delayed is Justice denied.",
        "For India to start doing cutting edge technology, we need better R&D. Infrastructure for manufacturing has to be built up first and then we need to invest heavily in R&D. That's extremely important. A judiciary overhaul has to be done as well.",
        ">For India to start doing cutting edge technology, we need better R&D.\n\nR&D money can come from private.\n\nThe best examples are Walmart Labs, Huawei Labs etc.\n\n>Infrastructure for manufacturing has to be built up first and then we need to invest heavily in R&D\n\nAgain it's the same issue right.\n\nHaving good roads is amazing but India itself has very bad labor laws and the red tape is atrocious to set up manufacturing.\n\nThe sad fact is a lot of locals who want to set up manufacturing actually travel to Vietnam rather than India which only has budding infrastructure.",
        "> Having good roads is amazing but India itself has very bad labor laws and the red tape is atrocious to set up manufacturing.\n\nInfrastructure is not just roads and railways. It involves a lot of other investments, even done privately. But the govt is responsible to set up the means by which private investment can be increased.",
        "so we're all *hoes* in the end..... ....",
        "I'm sorry this some kind of joke that i'm too old to understand.",
        "hoes = whores = prostitutes = anyone offering intimate services for money = us\n\ny'know like if you look at it, you're just another hoe for your boss to use and then when we act up, he can just go out and get a cheaper one.\n\nwatch this video for more info:  \n[https://www.youtube.com/watch?v=y1o99QLzewA](https://www.youtube.com/watch?v=y1o99QLzewA)",
        "This govt. is anti-service class. It took some reforms after 2014 but then realized that middle class can be easily fooled by religious politics so they turned their attention to businesses.",
        "Thanks for taking the time to explain the joke my man. Appreciate it. Will watch the video later but loved the quote at the beginning of the video."
    ],
    "cleaned_text": "middle class eventually reduce either absorbed lower upper economic strata based predatory schemes system middle class salaried employees get upto increment per year real inflation hovering autowalas maids drivers etc hike salaries every year rich keep money stock market pay taxes cash taxes ltcg stt gst sebi turnover fee nse charges companies pay taxes income claim gst returns using debt depreciation value assets expenses lower economic strata take hikes try deal cash skip paying direct income tax getting assistance government housing jobs etc salaried middle class pay tds source tds fd face reduced interest rates savings bank account reduced interest rates fd high taxes stock market buy sell orders minimal nil assistance housing education etc middle class money keep getting extracted lower upper economic strata till middle class disappears completely gets converted upper lower economic strata income tax rebate c capped l last years inflation soared period adjusted per inflation like many countries world ",
    "cleaned_title": "middle class eventually reduce either absorbed lower upper economic strata based predatory schemes system middle class",
    "cleaned_selftext": "salaried employees get upto increment per year real inflation hovering autowalas maids drivers etc hike salaries every year rich keep money stock market pay taxes cash taxes ltcg stt gst sebi turnover fee nse charges companies pay taxes income claim gst returns using debt depreciation value assets expenses lower economic strata take hikes try deal cash skip paying direct income tax getting assistance government housing jobs etc salaried middle class pay tds source tds fd face reduced interest rates savings bank account reduced interest rates fd high taxes stock market buy sell orders minimal nil assistance housing education etc middle class money keep getting extracted lower upper economic strata till middle class disappears completely gets converted upper lower economic strata income tax rebate c capped l last years inflation soared period adjusted per inflation like many countries world",
    "cleaned_comments": "one policy maker incentivised work us sad state affairs working class drives country forward bears brunt rich money fund political parties poor votes give majority middle class matter either become poor get benifits government get rich middle class also doesnt vote even dotheir vote may change affect seats butfar away making majority one shouldnt loyal company jump another ship decent hike except housing get deduction l every year interest housing loan interest also subsidised government education rbi clear rule get collateral free loan bank paying interest claim entire interest amount year deductible simple excuse voting giving consolation votes dont matter day majority middle class starts voting politician would pay heed starts working middle class least class concious try ape upper class consider slaves middle class consider poor hate indian middle class antipoor anticlass struggle prorich profree market pro libertarian capitalists dont consider part working class reason think militant antipoor stands doesnt allow acknowledge working class western countries international class struggle consider privileged workers rd world theres classes working rich rich divided working workinglower class middle class convinced enemies autorickshaw drivermaid switch lives average middle class individual middle class individual actually switch lives autorickshaw drivermaid stop treating blue collar individuals enemy enemy rich ruling class hold majority wealth salaried middle class private jobs especially real middle class like businessman dont pay taxes exploits labour customers govt employees takes bribes lawyers got soldout doctors whose write unecessary tests surgeries policemen everybody knows salaried middle class pay tds source tds fd face reduced interest rates savings bank account reduced interest rates fd high taxes stock market buy sell orders minimal nil assistance housing education etc getting low interest rate fds savings means also get housing car loans ate cheaper rates directly benefits middle class merge lower politics fight country sold handed free gujju bijnejmen poor never option someone experienced poverty fate worse death middle class money keep getting extracted lower extracted mean paying people exploitative wages slowly needing increase still exploitative slightly higher wages logic middle class extracting money bosses op thinks lower class lucky join facts ppl work jobs desk jobs consider themself higher janitors watchmen etc salaries working intern senior told matter post r employees means r slaves corporate overlords guess executives vps ceos r safe ones rsss long term vision two class feudal like society water tight caste boundaries worked branded place years name everyone knows cant disclose good projects regular punctual span gave increment minuscule lower middle class think increasing price soon categorised ews middle class significant number country still significant enough core voter base caste religion better tools political parties divide people rich people long invest heavily country always key govt poor middle class vote basis caste religion said another post gotten downvoted kind parties cater sections society one focused development especially infrastructure focused development lol indian middle class deluded self righteous bunch fucks planet city like mumbai election votes year never think one vote doesnt matter seen middle class idiots previous current company complain water electricity subsidy delhi even delhi people dont even realise literally like subsidy somewhat gives direct benefits middle class bjp given much free ration poor class capitalist buddies enjoying great tax benefits lax environment laws labour laws middle class simply fooled nonsense define middle class dont fully agree day thinking thing come none policies favour middle class one even thinking middle class none government schemes include middle class really something come together instead divided caste religion middle class also rife insecurity envy makes antimiddleclass trying put peers one someone born poor could still fiscally responsible get think worse people end getting downgraded experience adjust maslows hierarchy also proves really hard people demote level needs results males resorting drinking match old happiness females giving work marry completely dependent husbands working class western countries international class struggle consider privileged workers rd world requirements working class western eastern societies might differ majority voters example would outsourcing offshoring asia example think op zero self reflection society one focused development especially infrastructure focused development infrastructure development without improving ease business speed courts etc would give full benefits good infrastructure called structural reforms economists saying years suddenly scared future someone middle class family salaried class end soon labour class remain hue cry urban savarna votebank still go vote modi theyre mostly insulated larger issues country would love remain way look voter turnout major cities middle class wont reduce starve death see middle class people cant lower class jobs like plumbers electricians mechanics janitors neither become big industrialists type jobs also things like price rise affects middle class directions screwed healthcare expensive salaries low middle class king maker decider holds majority exactly happened andhra jagan got voted landslide schemes actually implemented well well fact nothing implement welfare schemes middle class upper castes consolidated like never voted best option leave country also important country even built basic infrastructure everywhere good infrastructure increase investments businesses able better govt also bring good laws improve ease business core good infrastructure important part legislative part changed easily actual physical ground work difficult especially corruption thats involved moment middle class important economy called consuming class mass consume products mass produced companies owned top vote raga hes socialist hope khatakahat schemes come true main reason got voted stalling amaravati project many good things right wing extremists got reason smear right wing extremists started labelling anti majority etc started finding relatives belong faiths etc u spot new trend middle class nowadays unions sort org protects rights granted excessive unionisation demerits unions protect labour rights far dangerous growing capitalists dystopia would disagree businessman would use india low cost center try cutting edge research reason simple would convinced ip laws defended properly getting proper judgment time indian courts justice delayed justice denied india start cutting edge technology need better rd infrastructure manufacturing built first need invest heavily rd thats extremely important judiciary overhaul done well india start cutting edge technology need better rd rd money come private best examples walmart labs huawei labs etc infrastructure manufacturing built first need invest heavily rd issue right good roads amazing india bad labor laws red tape atrocious set manufacturing sad fact lot locals want set manufacturing actually travel vietnam rather india budding infrastructure good roads amazing india bad labor laws red tape atrocious set manufacturing infrastructure roads railways involves lot investments even done privately govt responsible set means private investment increased hoes end im sorry kind joke im old understand hoes whores prostitutes anyone offering intimate services money us yknow like look youre another hoe boss use act go get cheaper one watch video info httpswwwyoutubecomwatchvyoqlzewahttpswwwyoutubecomwatchvyoqlzewa govt antiservice class took reforms realized middle class easily fooled religious politics turned attention businesses thanks taking time explain joke man appreciate watch video later loved quote beginning video",
    "light_cleaned_title": "Middle class will eventually reduce and either be absorbed into lower or upper economic strata based on the predatory schemes of this system on Middle Class",
    "light_cleaned_selftext": "While salaried employees get upto 5-10% increment per year and real inflation hovering at 7-8%, Autowalas, maids, drivers, etc hike their salaries by 15-25% every year. The rich keep their money in stock market and only pay taxes when they cash out those taxes as LTCG, STT, GST, SEBI turnover fee and NSE charges Their companies pay taxes on income but claim GST returns using debt, depreciation value of assets and expenses. Lower economic strata take 15-25%+ hikes and try to deal in cash to skip paying direct income tax while getting assistance from government for housing , jobs, etc Salaried middle class has to pay TDS at source, TDS for FD, face reduced interest rates on savings bank account, reduced interest rates on FD, high taxes on Stock market buy and sell orders, minimal to nil assistance for housing, education, etc Middle class money keep getting extracted by Lower and Upper economic strata till middle class disappears completely and gets converted to upper or lower economic strata Income tax rebate 80c has been capped at 1.5L for the last 10 years and inflation has soared in this period but it’s not adjusted as per inflation like many countries in the world do.",
    "light_cleaned_comments": "Not one policy maker is incentivised to work for us. It's a sad state of affairs. While the working class drives the country forward it bears most or all of the brunt. Rich has money to fund political parties.... Poor have votes to give them majority.... Middle class does not matter..... Either become poor to get benifits from Government or Get rich Middle class also doesn’t vote Even if they do...Their vote may change affect some seats but...far away from making majority .. That why one shouldn’t be loyal to a company and jump for some another ship with some decent hike. No is there for you except you. For housing you get deduction of 2L every year on your interest. The housing loan interest is also subsidised by the government. For education, RBI has a clear rule that you can get collateral free loan from a bank. And when you paying off the interest you can claim the entire interest amount for that year as deductible. It's just a simple excuse of not voting by giving yourselves consolation that our votes don't matter. The day the majority of the middle class starts voting- all the politician would pay heed to them and starts working for them. Middle class is the least class concious. They try to ape the upper class who consider them as slaves. Middle class consider themselves above the poor who hate them. Indian middle class are the most anti-poor, anti-class struggle, pro-rich, pro-free market, pro libertarian capitalists. They don't consider themselves to be a part of the working class for some reason, I think their militant anti-poor stands just doesn't allow them to acknowledge that. It's same with how working class in western countries are against international class struggle because they consider themselves to \"privileged\" over workers in 3rd world. There's 2 classes Working and the rich, the rich has divided working into \"working/lower\" class and \"middle\" class and has convinced both that they are the enemies. Any autorickshaw driver/maid will switch lives with any average \"middle\" class individual but no \"middle\" class individual will actually switch lives with a autorickshaw driver/maid. Stop treating blue collar individuals as your enemy. Your only enemy is the rich and ruling class who hold majority of the wealth Salaried middle class in private jobs especially are the real middle class, not like businessman who don't pay taxes and exploits their labour or customers or govt employees who takes bribes or lawyers who got sold-out or doctors whose write unecessary tests or surgeries or policemen everybody knows about them. >Salaried middle class has to pay TDS at source, TDS for FD, face reduced interest rates on savings bank account, reduced interest rates on FD, high taxes on Stock market buy and sell orders, minimal to nil assistance for housing, education, etc If you are getting low interest rate for FDs and savings means you also get housing and car loans ate cheaper rates. Which directly benefits the middle class most. Merge with the lower in politics and fight. This country is being sold or handed over free to gujju bijnej-men. Being poor should never be an option. As someone who has experienced poverty, it's a fate worse than death. > Middle class money keep getting extracted by Lower by extracted, you mean paying people exploitative wages, and slowly needing to increase those to still exploitative, but slightly higher wages? by that logic, the middle class is extracting money from their bosses. This! If OP thinks lower class is lucky, then he should join them. Facts. Ppl who work jobs desk jobs consider themself higher than the janitors, Watchmen, etc just because of their salaries. When I was working as an intern my senior told me no matter the post we r all employees which means we r all slaves to our corporate overlords. I guess only the executives, VPs & CEOs r the safe ones. This is the RSS's long term vision. A two class feudal like society with water tight caste boundaries I worked at a “branded” place for 4 years. A name that everyone knows but can’t disclose here. Did good projects, was regular and punctual. In that span they only gave increment only, that was minuscule. Being from lower middle class, I think with the increasing price I will be soon be categorised as EWS. Middle class is a significant number in this country, but still not significant enough to be a core voter base. Caste and religion are better tools for political parties to divide the people. Rich people, as long as they invest heavily in the country, will always be key for the govt. Most of the poor and middle class vote on the basis of caste or religion. I had said this in another post and gotten downvoted, but the only kind of parties which can cater to all sections of the society is one that is focused on development, especially infrastructure focused development. Lol the indian middle class is the most deluded self righteous bunch of fucks on the planet. In a city like Mumbai there was an election won by 48 votes this year Never think one vote doesnt matter I have seen middle class idiots from my previous and current company complain about water and electricity subsidy in Delhi, even if they are from Delhi or not. These people don't even realise that literally this is like only subsidy that somewhat gives direct benefits to middle class. BJP has given so much free ration for poor class, and his capitalist buddies are all enjoying great tax benefits, lax environment laws & labour laws, and middle class is simply being fooled. Nonsense! Define middle class. I don't fully agree with you but the other day I was thinking the same thing. How come none of the policies are in favour of middle class ? No one is even thinking about middle class. None of the government schemes include middle class. We should really do something about this and come together instead of divided by caste and religion. Middle class is also rife with insecurity and envy. It's what makes them anti-middleclass themselves trying to put down their peers to one up them. Someone born poor could still be fiscally responsible with what they get. I think it's worse for people who end up getting downgraded and having no experience how to adjust. Maslow's hierarchy also proves it's really hard for people to demote their level of needs. It results in males resorting to drinking to match their old happiness, and females giving up work to marry and be completely dependent on their husbands. >It's same with how working class in western countries are against international class struggle because they consider themselves to \"privileged\" over workers in 3rd world But the requirements of working class in western and eastern societies might differ A majority of voters for example would be against outsourcing/ offshoring to Asia as an example. I think OP has zero self reflection. >the society is one that is focused on development, especially infrastructure focused development. Just infrastructure development without improving ease of doing business, speed of courts etc would not give the full benefits of good infrastructure. These are called structural reforms. That is what economists have been saying for years. I am suddenly very very scared for my future as someone from a middle class family Salaried Class will end soon, Only labour class will remain. For all this hue and cry the urban savarna votebank will still go vote for Modi, because they're mostly insulated from larger issues of the country, would love to remain that way. Just look at the voter turnout of major cities. Middle class won't reduce but will starve to death. See we middle class people can't do lower Class jobs like plumbers, electricians, mechanics, janitors , neither can we become big industrialists. Our type of jobs are so few. Also things like price rise affects the middle class most. So from all directions we are screwed. Healthcare is so expensive but our salaries are so low.. Middle class can be king maker but not the decider of who holds the majority This is exactly what happened in Andhra and why Jagan got voted out in a landslide. His schemes actually were implemented very well, too well in fact. He did nothing but implement his welfare schemes. The middle class and upper castes consolidated like never before and voted him out. Best option is to leave the country!! That is also important. But in this country, we have not even built basic infrastructure everywhere. Good infrastructure will increase the investments and businesses will be able to do better. The govt also has to bring in good laws to improve the ease of doing business. But at the core of it all, good infrastructure is the most important part. The legislative part can be changed easily. But it's the actual physical on ground work that is the most difficult, especially because of the corruption that's involved at the moment. Middle class is very important for the economy. They are called the consuming class. They mass consume products mass produced by companies owned by the top 1%. Vote for Raga. He’s a socialist. I hope the khatakahat schemes come true. The main reason why he got voted out was stalling of the Amaravati project. He did many good things but the right wing extremists got a reason to smear him The right wing extremists started labelling him as anti majority, etc and started finding relatives of his who belong to other faiths , etc U are spot on. New trend of middle class nowadays is to be against unions or any sort of org which protects rights. Granted that excessive unionisation has its own demerits, but having no unions to protect labour rights is far dangerous in a growing capitalists dystopia. We would have to disagree then. If I was a businessman, I would only use India as a low cost center and not try to do cutting edge research here. The reason is simple, I would not be convinced of the IP laws being defended properly and getting a proper judgment in time from Indian Courts. Justice delayed is Justice denied. For India to start doing cutting edge technology, we need better R&D. Infrastructure for manufacturing has to be built up first and then we need to invest heavily in R&D. That's extremely important. A judiciary overhaul has to be done as well. >For India to start doing cutting edge technology, we need better R&D. R&D money can come from private. The best examples are Walmart Labs, Huawei Labs etc. >Infrastructure for manufacturing has to be built up first and then we need to invest heavily in R&D Again it's the same issue right. Having good roads is amazing but India itself has very bad labor laws and the red tape is atrocious to set up manufacturing. The sad fact is a lot of locals who want to set up manufacturing actually travel to Vietnam rather than India which only has budding infrastructure. > Having good roads is amazing but India itself has very bad labor laws and the red tape is atrocious to set up manufacturing. Infrastructure is not just roads and railways. It involves a lot of other investments, even done privately. But the govt is responsible to set up the means by which private investment can be increased. so we're all *hoes* in the end..... .... I'm sorry this some kind of joke that i'm too old to understand. hoes = whores = prostitutes = anyone offering intimate services for money = us y'know like if you look at it, you're just another hoe for your boss to use and then when we act up, he can just go out and get a cheaper one. watch this video for more info: [https://www.youtube.com/watch?v=y1o99QLzewA](https://www.youtube.com/watch?v=y1o99QLzewA) This govt. is anti-service class. It took some reforms after 2014 but then realized that middle class can be easily fooled by religious politics so they turned their attention to businesses. Thanks for taking the time to explain the joke my man. Appreciate it. Will watch the video later but loved the quote at the beginning of the video."
}