{
    "id": "195uqy9",
    "title": "ECommerce SCAM!",
    "url": "https://www.reddit.com/gallery/195uqy9",
    "selftext": "Came across this website today: https://laurelmorgan.com today and was able to find that it’s a fake website. \n\nWhat’s shocking is they have made the website pretty good - I think anyone can fall for it?\n\nAttaching some screenshots of the products from the website and the original source (most of the products I researched are from the brand Mango). \n\nThis is the first time I’m coming across something like this. Is this common? Have any of you come across anything like this?",
    "flair": "Crime",
    "score": 13,
    "num_comments": 4,
    "created_utc": 1705171046.0,
    "convurl": "https://i.redd.it/jg4qfm9z49cc1.jpg",
    "comments": [
        "Use only Myntra ajio Amazon Flipkart and avoid everything else",
        "I’m curious. How do you know it’s a fake website?\n\nI went through the order flow, the thing is they do have the real Apple Pay express checkout on iPhone. To integrate that, you need to have a legitimate business or you’d be banned from there. And why would they even spend money to integrate there if they’re not legit. They can’t even steal card info if that’s their goal. \n\nI do think it is fraudulent due to few other things, but I don’t understand what they are aiming for."
    ],
    "cleaned_text": "ecommerce scam came across website today today able find fake website whats shocking made website pretty good think anyone fall attaching screenshots products website original source products researched brand mango first time im coming across something like common come across anything like ",
    "cleaned_title": "ecommerce scam",
    "cleaned_selftext": "came across website today today able find fake website whats shocking made website pretty good think anyone fall attaching screenshots products website original source products researched brand mango first time im coming across something like common come across anything like",
    "cleaned_comments": "use myntra ajio amazon flipkart avoid everything else im curious know fake website went order flow thing real apple pay express checkout iphone integrate need legitimate business youd banned would even spend money integrate theyre legit cant even steal card info thats goal think fraudulent due things dont understand aiming",
    "light_cleaned_title": "ECommerce SCAM!",
    "light_cleaned_selftext": "Came across this website today: today and was able to find that it’s a fake website. What’s shocking is they have made the website pretty good - I think anyone can fall for it? Attaching some screenshots of the products from the website and the original source (most of the products I researched are from the brand Mango). This is the first time I’m coming across something like this. Is this common? Have any of you come across anything like this?",
    "light_cleaned_comments": "Use only Myntra ajio Amazon Flipkart and avoid everything else I’m curious. How do you know it’s a fake website? I went through the order flow, the thing is they do have the real Apple Pay express checkout on iPhone. To integrate that, you need to have a legitimate business or you’d be banned from there. And why would they even spend money to integrate there if they’re not legit. They can’t even steal card info if that’s their goal. I do think it is fraudulent due to few other things, but I don’t understand what they are aiming for."
}