{
    "id": "1c17h5g",
    "title": "Akash Banerjee’s Take On BJP Propaganda Movies Is One-Sided @thedeshbhakt",
    "url": "https://youtu.be/FRxxeN7429s?si=uS4mVQ_hD65syoCl",
    "selftext": "Recently came across this, and I found out how easy it is to show yourself knowledgeable on stuff that you have no idea about by using half baked arguments.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 13,
    "created_utc": 1712814432.0,
    "convurl": "https://external-preview.redd.it/FFVCaElvLU5gGFFpPNRRil7QrXtm2KIquAv_lvtqFWs.jpg?auto=webp&s=94638d91500f5867182b5379ce157ef772bdff37",
    "comments": [
        "I haven't watched Akash's video. Did he really say there were no propaganda movies made during the congress period?",
        "Nope. He simply called out Bollywood for their bend over backward behavior in recent times (back in the day their were both for and against movies, which is a well-known thing). That was the sole moto of the video.",
        "Then this whole video is based on a strawman argument?",
        "If you are talking about Shan's video, then yes.",
        "I want my 14 minutes back.",
        "Joblessness is really at its peak.",
        "I did watched this guy's reply on Dhruv Rathee's take on Animal movie. Sorry OP, but he's just a mysoginist, who's making views on big youtubers. Wanna be in controversy",
        "I won't call Dhruv's video exactly right, but yeah, I get what you mean. \n\nBut this video on Banerjee was just false on so many levels.",
        "reply dena hain to comment me dena tha, dusri video pe nhi",
        "The leaps of logic he took to justify his arguments. Attempting to appease a right-wing audience for views may seem like a lucrative strategy for growth, as many are adopting it but that doesn't justify the harm it can cause.",
        "Nowadays to enter this knowledge yt space you need to be dhruv rathee and akash Banerjee roaster. There isn't a single youtuber who is not biased about politics cause there is tons of data whatever way you represent that in your video some people will think you are a supporter of any certain party or you are spreading misinformation about that certain party. Like when \"Animal'' movie released at that time \"Sambahadur\" also released all the youtubers made roast about dhruv rathee but didn't make a single review of \"Sambahadur\" or suggested to watch Sambahadur instead of Animal. Cause Animal movie and Dhruv rathee gives too much views easily then why should a youtuber suggest young kids to watch good films like Sambahadur.",
        "hnn 2009 aur purani baate bol rha tha video band kr di kyuki 2009 me channel exist nhi krta tha"
    ],
    "cleaned_text": "akash banerjees take bjp propaganda movies onesided thedeshbhakt recently came across found easy show knowledgeable stuff idea using half baked arguments ",
    "cleaned_title": "akash banerjees take bjp propaganda movies onesided thedeshbhakt",
    "cleaned_selftext": "recently came across found easy show knowledgeable stuff idea using half baked arguments",
    "cleaned_comments": "havent watched akashs video really say propaganda movies made congress period nope simply called bollywood bend backward behavior recent times back day movies wellknown thing sole moto video whole video based strawman argument talking shans video yes want minutes back joblessness really peak watched guys reply dhruv rathees take animal movie sorry op hes mysoginist whos making views big youtubers wan na controversy wont call dhruvs video exactly right yeah get mean video banerjee false many levels reply dena hain comment dena tha dusri video pe nhi leaps logic took justify arguments attempting appease rightwing audience views may seem like lucrative strategy growth many adopting doesnt justify harm cause nowadays enter knowledge yt space need dhruv rathee akash banerjee roaster isnt single youtuber biased politics cause tons data whatever way represent video people think supporter certain party spreading misinformation certain party like animal movie released time sambahadur also released youtubers made roast dhruv rathee didnt make single review sambahadur suggested watch sambahadur instead animal cause animal movie dhruv rathee gives much views easily youtuber suggest young kids watch good films like sambahadur hnn aur purani baate bol rha tha video band kr di kyuki channel exist nhi krta tha",
    "light_cleaned_title": "Akash Banerjee’s Take On BJP Propaganda Movies Is One-Sided @thedeshbhakt",
    "light_cleaned_selftext": "Recently came across this, and I found out how easy it is to show yourself knowledgeable on stuff that you have no idea about by using half baked arguments.",
    "light_cleaned_comments": "I haven't watched Akash's video. Did he really say there were no propaganda movies made during the congress period? Nope. He simply called out Bollywood for their bend over backward behavior in recent times (back in the day their were both for and against movies, which is a well-known thing). That was the sole moto of the video. Then this whole video is based on a strawman argument? If you are talking about Shan's video, then yes. I want my 14 minutes back. Joblessness is really at its peak. I did watched this guy's reply on Dhruv Rathee's take on Animal movie. Sorry OP, but he's just a mysoginist, who's making views on big youtubers. Wanna be in controversy I won't call Dhruv's video exactly right, but yeah, I get what you mean. But this video on Banerjee was just false on so many levels. reply dena hain to comment me dena tha, dusri video pe nhi The leaps of logic he took to justify his arguments. Attempting to appease a right-wing audience for views may seem like a lucrative strategy for growth, as many are adopting it but that doesn't justify the harm it can cause. Nowadays to enter this knowledge yt space you need to be dhruv rathee and akash Banerjee roaster. There isn't a single youtuber who is not biased about politics cause there is tons of data whatever way you represent that in your video some people will think you are a supporter of any certain party or you are spreading misinformation about that certain party. Like when \"Animal'' movie released at that time \"Sambahadur\" also released all the youtubers made roast about dhruv rathee but didn't make a single review of \"Sambahadur\" or suggested to watch Sambahadur instead of Animal. Cause Animal movie and Dhruv rathee gives too much views easily then why should a youtuber suggest young kids to watch good films like Sambahadur. hnn 2009 aur purani baate bol rha tha video band kr di kyuki 2009 me channel exist nhi krta tha"
}