{
    "id": "17b763t",
    "title": "Bi-Weekly Career and Hiring Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/17b763t/biweekly_career_and_hiring_discussion_thread/",
    "selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here.\n\n**If You or Your Company is Hiring:**\n\n1. Name of the company\n2. Location\n3. Requirements\n4. Preferred way of contacting you\n\n**If You are looking to get hired**\n\n1. Your skillset/experience\n2. Portfolio (if any/applicable)\n3. Location\n4. Preferred way of contacting you\n\nPlease do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps.\n\nDo follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps!\n\n**Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/osdztmrfx8n61.png?width=1487&format=png&auto=webp&s=dab56a83877ffe7dc6fd93767a8f63e9c366e592",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697679012.0,
    "convurl": "https://b.thumbs.redditmedia.com/uSjsYgLoiXp3O3r3Ax_DISyC5RTVLOV016HHBbnewto.jpg",
    "comments": [
        "Looking for a role in Political Consulting\n\nYoE: 2.5+ years across Design and Strategy roles \nQualifications: Bachelor's \nContact: DM",
        "Uneecops Business Solutions\n\nNoida\n\nSql and tableau\n\nDM.",
        "My wife is looking to change her career to non-Sales.\n\n1. PGDM Marketing and HR, BE in Electrical and Electronics\n2. Total EXP. 4+ years. Mostly in Sales and several roles within startups. \n2. Skillset: Power BI, SQL, MS Excel, Marketing Research, Key Account Management.\n3. Trying hard for Data analyst role with internships she did, but having no written Experience in a company is making it impossible to find a job. (Catch 22 situation).\n\nWe're located in Mumbai, and looking for any Mumbai/Pune/Remote roles. Any help is appreciated.",
        "Looking for my first permanent role.   \n\n\n1. BS Economics from a Tier 1 College.\n2. Just graduated. Slightly unsure of what role I fit in. Preparing for CFA while interning in the holding company of an MNC.\n3. Skillet: R, Stata, SQL, Excel, R&A in Economics stuff. Lots of PG Finance courses done in UG. \n4. Location any. Want to get to finance. If you have no roles but can give some advice, would be helpful too."
    ],
    "cleaned_text": "biweekly career hiring discussion thread hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly career hiring discussion thread",
    "cleaned_selftext": "hello rindia need suggestionshelp regarding career ask company hiring looking job post company hiring name company location requirements preferred way contacting looking get hired skillsetexperience portfolio anyapplicable location preferred way contacting please mention emails canshould prefer take conversation forward pms instead avoid privacy mishaps follow experience get job hire someone successfully via threads feedback helps career thread posted every two weeks thursday mornings old threadshttpsredditcomrindiasearchqcareerandhiringthreadrestrictsronsortnewtall",
    "cleaned_comments": "looking role political consulting yoe years across design strategy roles qualifications bachelors contact dm uneecops business solutions noida sql tableau dm wife looking change career nonsales pgdm marketing hr electrical electronics total exp years mostly sales several roles within startups skillset power bi sql ms excel marketing research key account management trying hard data analyst role internships written experience company making impossible find job catch situation located mumbai looking mumbaipuneremote roles help appreciated looking first permanent role bs economics tier college graduated slightly unsure role fit preparing cfa interning holding company mnc skillet r stata sql excel ra economics stuff lots pg finance courses done ug location want get finance roles give advice would helpful",
    "light_cleaned_title": "Bi-Weekly Career and Hiring Discussion Thread",
    "light_cleaned_selftext": "Hello r/india! If you need any suggestions/help regarding your career, ask here. If your company is hiring or if you are looking for a job, then post here. **If You or Your Company is Hiring:** 1. Name of the company 2. Location 3. Requirements 4. Preferred way of contacting you **If You are looking to get hired** 1. Your skillset/experience 2. Portfolio (if any/applicable) 3. Location 4. Preferred way of contacting you Please do not mention your emails. You can/should prefer to take conversation forward in PMs instead to avoid any privacy mishaps. Do follow up here with your experience. Did you get a job or hire someone successfully via these threads? Your feedback helps! **Career Thread is posted every two weeks on Thursday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Career+and+Hiring+thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Looking for a role in Political Consulting YoE: 2.5+ years across Design and Strategy roles Qualifications: Bachelor's Contact: DM Uneecops Business Solutions Noida Sql and tableau DM. My wife is looking to change her career to non-Sales. 1. PGDM Marketing and HR, BE in Electrical and Electronics 2. Total EXP. 4+ years. Mostly in Sales and several roles within startups. 2. Skillset: Power BI, SQL, MS Excel, Marketing Research, Key Account Management. 3. Trying hard for Data analyst role with internships she did, but having no written Experience in a company is making it impossible to find a job. (Catch 22 situation). We're located in Mumbai, and looking for any Mumbai/Pune/Remote roles. Any help is appreciated. Looking for my first permanent role. 1. BS Economics from a Tier 1 College. 2. Just graduated. Slightly unsure of what role I fit in. Preparing for CFA while interning in the holding company of an MNC. 3. Skillet: R, Stata, SQL, Excel, R&A in Economics stuff. Lots of PG Finance courses done in UG. 4. Location any. Want to get to finance. If you have no roles but can give some advice, would be helpful too."
}