{
    "id": "16mq4o5",
    "title": "Help with a survey for Indian Flyers! Please indulge.",
    "url": "https://www.reddit.com/r/india/comments/16mq4o5/help_with_a_survey_for_indian_flyers_please/",
    "selftext": "Hi All,\n\nPosting this here as we specifically need Indians to fill the survey form!\n\nOur team is conducting a survey regarding airport baggage handling and services and we need input from Indian flyers (Whether you fly domestic or International).\n\nKindly requesting you to fill this form: [https://forms.gle/soU3RThQVuXeMVTF6](https://forms.gle/soU3RThQVuXeMVTF6)\n\nIt will not take more than 5 minutes!\n\nAny suggestions can be provided in the form itself or here as comments too!\n\nThanks in advance.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695127798.0,
    "convurl": "https://external-preview.redd.it/HORgbrkXMSXu1kDqAMPXMninChsXWIb12sdQdyG8mR4.jpg?auto=webp&s=109055f6cabb3489d0833797d893e8cd6fdff5ec",
    "comments": [],
    "cleaned_text": "help survey indian flyers please indulge hi posting specifically need indians fill survey form team conducting survey regarding airport baggage handling services need input indian flyers whether fly domestic international kindly requesting fill form httpsformsglesourthqvuxemvtfhttpsformsglesourthqvuxemvtf take minutes suggestions provided form comments thanks advance ",
    "cleaned_title": "help survey indian flyers please indulge",
    "cleaned_selftext": "hi posting specifically need indians fill survey form team conducting survey regarding airport baggage handling services need input indian flyers whether fly domestic international kindly requesting fill form httpsformsglesourthqvuxemvtfhttpsformsglesourthqvuxemvtf take minutes suggestions provided form comments thanks advance",
    "cleaned_comments": "",
    "light_cleaned_title": "Help with a survey for Indian Flyers! Please indulge.",
    "light_cleaned_selftext": "Hi All, Posting this here as we specifically need Indians to fill the survey form! Our team is conducting a survey regarding airport baggage handling and services and we need input from Indian flyers (Whether you fly domestic or International). Kindly requesting you to fill this form: [https://forms.gle/soU3RThQVuXeMVTF6](https://forms.gle/soU3RThQVuXeMVTF6) It will not take more than 5 minutes! Any suggestions can be provided in the form itself or here as comments too! Thanks in advance.",
    "light_cleaned_comments": ""
}