{
    "id": "12rop89",
    "title": "Is it easy to get a job on an oil rig in India?",
    "url": "https://www.reddit.com/r/india/comments/12rop89/is_it_easy_to_get_a_job_on_an_oil_rig_in_india/",
    "selftext": "Hi everyone.\n\n&#x200B;\n\nI'm currently looking for a job, and while browsing for alternatives, I came across a few posts about people working on rigs. It made me curious whether getting a position on the drilling rig without any experience was possible. I've read a few posts on Reddit about people in the US who got hired on rigs without having any study degrees or qualifications, and I'd like to know if the same is true for India.\n\n&#x200B;\n\nI know that working on an oil rig can be tough and demanding, but I'm up for the challenge. Besides, all my previous jobs implied a lot of physical work, so I'm not scared of having to work long hours or deal with heavy stuff. I've done that since I started working, so it won't be something new for me. Also, I'm not scared of all the dangers that working on [mobile rigs](https://upet.com/drilling-rigs/) could imply, and I'm fine with all the risks of dealing with heavy equipment.\n\n&#x200B;\n\nI won't be lying. I'm interested in a position in this industry because of the high payments. I've read that even entry-level workers receive good money. So I'm extremely curious about the salaries paid for entry-level positions in India. Do Indian companies pay as well as those from the US or Saudi Arabia? Or are my expectations inflated, and I should forget about it?\n\n&#x200B;\n\nIn case anyone has any information or advice about finding a job in India's oil and gas industry, I'd greatly appreciate it. I'm open to any kind of suggestion, even if you'll say to give up the idea. Still, I'd be very grateful if you could advise me on how to look for entry-level positions and guide me on the best practices for getting a job in oil recovery. Also, I'm especially interested in hearing opinions from people who work for companies like ONGC and similar ones.\n\n&#x200B;\n\nThank you in advance for any help you can offer!",
    "flair": "AskIndia",
    "score": 19,
    "num_comments": 8,
    "created_utc": 1681900355.0,
    "convurl": "https://external-preview.redd.it/f0T6scx6i3uYw63_oTDr__Cfs3vwKbTV6iIVJjUO7B4.jpg?auto=webp&v=enabled&s=b7df74448f6eaeefef2640f00a33ba7fd4d43bf7",
    "comments": [
        "Many companies are willing to train workers with a strong work ethic and a willingness to learn. However, keep in mind that working on an oil rig can be physically demanding and dangerous, so it's important to be aware of the risks involved and make sure you're prepared for the job.",
        "as easy as any other job. Some companies really need new guys and even train them separetely.",
        "You can expect to find some good payed jobs there but you should search for it carefully",
        " I'm not entirely sure about the current job market in India's oil and gas industry. However, I can tell you that the oil and gas industry is highly regulated in India and there are strict requirements for working on offshore oil rigs.\n\nTo work on an oil rig in India, you would typically need to have the required education and training, relevant work experience, and necessary certifications. In addition, you may also need to pass a medical examination to demonstrate your physical fitness and ability to work in a challenging offshore environment.",
        "Getting a job on an oil rig in India may not be easy, as it requires specific skills and qualifications. However, it is possible to find job openings through online job portals, recruitment agencies, and directly contacting oil and gas companies. It is important to have relevant education, experience, and certifications in fields such as mechanical engineering, electrical engineering, instrumentation engineering, and drilling operations. Additionally, candidates should be physically fit and able to work in harsh conditions for extended periods. As with any job search, networking and persistence can also increase the chances of finding a job on an oil rig in India."
    ],
    "cleaned_text": "easy get job oil rig india hi everyone xb im currently looking job browsing alternatives came across posts people working rigs made curious whether getting position drilling rig without experience possible ive read posts reddit people us got hired rigs without study degrees qualifications id like know true india xb know working oil rig tough demanding im challenge besides previous jobs implied lot physical work im scared work long hours deal heavy stuff ive done since started working wont something new also im scared dangers working mobile rigshttpsupetcomdrillingrigs could imply im fine risks dealing heavy equipment xb wont lying im interested position industry high payments ive read even entrylevel workers receive good money im extremely curious salaries paid entrylevel positions india indian companies pay well us saudi arabia expectations inflated forget xb case anyone information advice finding job indias oil gas industry id greatly appreciate im open kind suggestion even youll say give idea still id grateful could advise look entrylevel positions guide best practices getting job oil recovery also im especially interested hearing opinions people work companies like ongc similar ones xb thank advance help offer ",
    "cleaned_title": "easy get job oil rig india",
    "cleaned_selftext": "hi everyone xb im currently looking job browsing alternatives came across posts people working rigs made curious whether getting position drilling rig without experience possible ive read posts reddit people us got hired rigs without study degrees qualifications id like know true india xb know working oil rig tough demanding im challenge besides previous jobs implied lot physical work im scared work long hours deal heavy stuff ive done since started working wont something new also im scared dangers working mobile rigshttpsupetcomdrillingrigs could imply im fine risks dealing heavy equipment xb wont lying im interested position industry high payments ive read even entrylevel workers receive good money im extremely curious salaries paid entrylevel positions india indian companies pay well us saudi arabia expectations inflated forget xb case anyone information advice finding job indias oil gas industry id greatly appreciate im open kind suggestion even youll say give idea still id grateful could advise look entrylevel positions guide best practices getting job oil recovery also im especially interested hearing opinions people work companies like ongc similar ones xb thank advance help offer",
    "cleaned_comments": "many companies willing train workers strong work ethic willingness learn however keep mind working oil rig physically demanding dangerous important aware risks involved make sure youre prepared job easy job companies really need new guys even train separetely expect find good payed jobs search carefully im entirely sure current job market indias oil gas industry however tell oil gas industry highly regulated india strict requirements working offshore oil rigs work oil rig india would typically need required education training relevant work experience necessary certifications addition may also need pass medical examination demonstrate physical fitness ability work challenging offshore environment getting job oil rig india may easy requires specific skills qualifications however possible find job openings online job portals recruitment agencies directly contacting oil gas companies important relevant education experience certifications fields mechanical engineering electrical engineering instrumentation engineering drilling operations additionally candidates physically fit able work harsh conditions extended periods job search networking persistence also increase chances finding job oil rig india",
    "light_cleaned_title": "Is it easy to get a job on an oil rig in India?",
    "light_cleaned_selftext": "Hi everyone. &#x200B; I'm currently looking for a job, and while browsing for alternatives, I came across a few posts about people working on rigs. It made me curious whether getting a position on the drilling rig without any experience was possible. I've read a few posts on Reddit about people in the US who got hired on rigs without having any study degrees or qualifications, and I'd like to know if the same is true for India. &#x200B; I know that working on an oil rig can be tough and demanding, but I'm up for the challenge. Besides, all my previous jobs implied a lot of physical work, so I'm not scared of having to work long hours or deal with heavy stuff. I've done that since I started working, so it won't be something new for me. Also, I'm not scared of all the dangers that working on [mobile rigs](https://upet.com/drilling-rigs/) could imply, and I'm fine with all the risks of dealing with heavy equipment. &#x200B; I won't be lying. I'm interested in a position in this industry because of the high payments. I've read that even entry-level workers receive good money. So I'm extremely curious about the salaries paid for entry-level positions in India. Do Indian companies pay as well as those from the US or Saudi Arabia? Or are my expectations inflated, and I should forget about it? &#x200B; In case anyone has any information or advice about finding a job in India's oil and gas industry, I'd greatly appreciate it. I'm open to any kind of suggestion, even if you'll say to give up the idea. Still, I'd be very grateful if you could advise me on how to look for entry-level positions and guide me on the best practices for getting a job in oil recovery. Also, I'm especially interested in hearing opinions from people who work for companies like ONGC and similar ones. &#x200B; Thank you in advance for any help you can offer!",
    "light_cleaned_comments": "Many companies are willing to train workers with a strong work ethic and a willingness to learn. However, keep in mind that working on an oil rig can be physically demanding and dangerous, so it's important to be aware of the risks involved and make sure you're prepared for the job. as easy as any other job. Some companies really need new guys and even train them separetely. You can expect to find some good payed jobs there but you should search for it carefully I'm not entirely sure about the current job market in India's oil and gas industry. However, I can tell you that the oil and gas industry is highly regulated in India and there are strict requirements for working on offshore oil rigs. To work on an oil rig in India, you would typically need to have the required education and training, relevant work experience, and necessary certifications. In addition, you may also need to pass a medical examination to demonstrate your physical fitness and ability to work in a challenging offshore environment. Getting a job on an oil rig in India may not be easy, as it requires specific skills and qualifications. However, it is possible to find job openings through online job portals, recruitment agencies, and directly contacting oil and gas companies. It is important to have relevant education, experience, and certifications in fields such as mechanical engineering, electrical engineering, instrumentation engineering, and drilling operations. Additionally, candidates should be physically fit and able to work in harsh conditions for extended periods. As with any job search, networking and persistence can also increase the chances of finding a job on an oil rig in India."
}