{
    "id": "tnf5ek",
    "title": "Unpleasant experiences with Decathlon online shopping",
    "url": "https://www.reddit.com/r/india/comments/tnf5ek/unpleasant_experiences_with_decathlon_online/",
    "selftext": "I had ordered a product called \" HEADLAMP MOONLIGHT USB 500 \" on March 11th and the delivery was specified to happen at 18th of March. 18th of March came and there is no news on the item. Logged into the account and saw a delivery failed. There was no communication from the delivery team. No messages, no calls nothing. So Sent an email to customer support and got a response saying they will retry the delivery and asked to wait for 48 hrs. Now one week  has gone by and no update on the product or no further responses from the Decathlon team. (I know the delivery team will be an independent agency but since my contact and payment is with Decathlon, they should atleast make communications with us on the status).\n\nSo fed up with this, i went to cancel the order. \n\nIt says the cancellation can be done only when the product is delivered. WHATTTT?\n\nSo i dont receive the product ever, then no cancellation that means no refund? no responses from customer support either. WOW.\n\nThis made me think, how many more are out there have faced the same situation as me. So i went to their company owned forum and could see lots of folks complaining on the same.\n\nOn a company of this stature, their website is a mess.  No status updates, login is a hurdle.\n\nAnyway, folks be safe out there.\n\n&amp;#x200B;\n\n[track panel](https://preview.redd.it/uhbe1l25wgp81.png?width=625&amp;format=png&amp;auto=webp&amp;s=56cb52b36e5e7cc5ded351da8d70598da6c73f60)\n\n&amp;#x200B;\n\n[Cannot cancel the order](https://preview.redd.it/i9ts13v9wgp81.png?width=717&amp;format=png&amp;auto=webp&amp;s=ae30d49699b78a7f7221cad2cc5c1cd3a1cd2ad7)\n\n&amp;#x200B;\n\n[Others in similar situation ](https://preview.redd.it/chflkbfewgp81.png?width=872&amp;format=png&amp;auto=webp&amp;s=92831f14c485a335976165c5b77037945f3435e5)",
    "flair": "Rant / Vent",
    "score": 9,
    "num_comments": 3,
    "created_utc": 1648186946,
    "convurl": "https://b.thumbs.redditmedia.com/jX6TbzSJpnqgWlNUEHU17XDzkQ9_WoFb9SZROprzScg.jpg",
    "comments": [
        "In case you are looking to make a complaint, download the consumer app and post the complaint. Consumer forum will make sure that you get your product.\n\nYou can then return the item. If they fuck around again, again post the complaint\n\nIt's total satisfaction I say. Try it.",
        "I've ordered multiple times via Decathlon, received the product with atleast a week's delay everytime.  \n  \nBut the products were good so I didn't care",
        "Try contacting the courier partner directly, that would be way more helpful.",
        "Same thing is happening with me right now\nDid you get the product?",
        "I'm facing exact same thing right now. Their customer care number is a robot, so, it's quite useless talking on that number and email is irresponsive.",
        "what's that consumer app?",
        "https://preview.redd.it/skj59695j4bd1.jpeg?width=1080&format=pjpg&auto=webp&s=1000af6b30d99ce48010efa9be26d43acd80c21f"
    ],
    "cleaned_text": "unpleasant experiences decathlon online shopping ordered product called headlamp moonlight usb march th delivery specified happen th march th march came news item logged account saw delivery failed communication delivery team messages calls nothing sent email customer support got response saying retry delivery asked wait hrs one week gone update product responses decathlon team know delivery team independent agency since contact payment decathlon atleast make communications us status fed went cancel order says cancellation done product delivered whatttt dont receive product ever cancellation means refund responses customer support either wow made think many faced situation went company owned forum could see lots folks complaining company stature website mess status updates login hurdle anyway folks safe ampxb track panelhttpspreviewreddituhbelwgppngwidthampformatpngampautowebpampscbbeeccdeddaddacf ampxb cancel orderhttpspreviewreddititsvwgppngwidthampformatpngampautowebpampsaedbafcadccccdacdad ampxb others similar situation httpspreviewredditchflkbfewgppngwidthampformatpngampautowebpampsfcacbfe ",
    "cleaned_title": "unpleasant experiences decathlon online shopping",
    "cleaned_selftext": "ordered product called headlamp moonlight usb march th delivery specified happen th march th march came news item logged account saw delivery failed communication delivery team messages calls nothing sent email customer support got response saying retry delivery asked wait hrs one week gone update product responses decathlon team know delivery team independent agency since contact payment decathlon atleast make communications us status fed went cancel order says cancellation done product delivered whatttt dont receive product ever cancellation means refund responses customer support either wow made think many faced situation went company owned forum could see lots folks complaining company stature website mess status updates login hurdle anyway folks safe ampxb track panelhttpspreviewreddituhbelwgppngwidthampformatpngampautowebpampscbbeeccdeddaddacf ampxb cancel orderhttpspreviewreddititsvwgppngwidthampformatpngampautowebpampsaedbafcadccccdacdad ampxb others similar situation httpspreviewredditchflkbfewgppngwidthampformatpngampautowebpampsfcacbfe",
    "cleaned_comments": "case looking make complaint download consumer app post complaint consumer forum make sure get product return item fuck around post complaint total satisfaction say try ive ordered multiple times via decathlon received product atleast weeks delay everytime products good didnt care try contacting courier partner directly would way helpful thing happening right get product im facing exact thing right customer care number robot quite useless talking number email irresponsive whats consumer app",
    "light_cleaned_title": "Unpleasant experiences with Decathlon online shopping",
    "light_cleaned_selftext": "I had ordered a product called \" HEADLAMP MOONLIGHT USB 500 \" on March 11th and the delivery was specified to happen at 18th of March. 18th of March came and there is no news on the item. Logged into the account and saw a delivery failed. There was no communication from the delivery team. No messages, no calls nothing. So Sent an email to customer support and got a response saying they will retry the delivery and asked to wait for 48 hrs. Now one week has gone by and no update on the product or no further responses from the Decathlon team. (I know the delivery team will be an independent agency but since my contact and payment is with Decathlon, they should atleast make communications with us on the status). So fed up with this, i went to cancel the order. It says the cancellation can be done only when the product is delivered. WHATTTT? So i dont receive the product ever, then no cancellation that means no refund? no responses from customer support either. WOW. This made me think, how many more are out there have faced the same situation as me. So i went to their company owned forum and could see lots of folks complaining on the same. On a company of this stature, their website is a mess. No status updates, login is a hurdle. Anyway, folks be safe out there.  [track panel](https://preview.redd.it/uhbe1l25wgp81.png?width=625&amp;format=png&amp;auto=webp&amp;s=56cb52b36e5e7cc5ded351da8d70598da6c73f60)  [Cannot cancel the order](https://preview.redd.it/i9ts13v9wgp81.png?width=717&amp;format=png&amp;auto=webp&amp;s=ae30d49699b78a7f7221cad2cc5c1cd3a1cd2ad7)  [Others in similar situation ](https://preview.redd.it/chflkbfewgp81.png?width=872&amp;format=png&amp;auto=webp&amp;s=92831f14c485a335976165c5b77037945f3435e5)",
    "light_cleaned_comments": "In case you are looking to make a complaint, download the consumer app and post the complaint. Consumer forum will make sure that you get your product. You can then return the item. If they fuck around again, again post the complaint It's total satisfaction I say. Try it. I've ordered multiple times via Decathlon, received the product with atleast a week's delay everytime. But the products were good so I didn't care Try contacting the courier partner directly, that would be way more helpful. Same thing is happening with me right now Did you get the product? I'm facing exact same thing right now. Their customer care number is a robot, so, it's quite useless talking on that number and email is irresponsive. what's that consumer app?"
}