{
    "id": "1h15rgg",
    "title": "Propaganda vs Reality ",
    "url": "https://www.reddit.com/gallery/1h15rgg",
    "selftext": "Propaganda:\nhttps://indianexpress.com/article/business/gautam-adani-fcpa-securities-violations-involving-penalties-adani-group-9692756/\nReality:\nhttps://www.justice.gov/usao-edny/media/1377806/dl?inline",
    "flair": "Policy/Economy",
    "score": 68,
    "num_comments": 22,
    "created_utc": 1732718273.0,
    "convurl": "https://i.redd.it/t0r4be21hg3e1.jpg",
    "comments": [
        "Golmaal hain bhai sab golmaal hain",
        "5 din baad aya adani ko kya propaganda kare, janta to c hai",
        "Not really, the article mentions that Adani +2 others are not charged under counts 1 and 5 which is true and checks out in the indictment pdf, it also says that they are charged under count 2,3 and 4 which is also true. So I do not know what you are getting at unless I'm missing something.",
        "The propaganda is they are not charged under bribery, which is absolutely false",
        "These writers need to stop with \"he said she said\" articles and just report with facts in hand. When the court document itself uses the words \"bribery\" and \"corruption\", why didn't the reporters call them out while asking for a statement?",
        "I do not see this statement anywhere in the article, only one from the senior lawyer talking about a lack of detail surrounding the names in the bribery indictment. Can you please quote the statement you are talking about.",
        "OP, do everyone a favour and link them to the original documents so they can check for themselves. Posting a bunch of screenshots containing out-of-context information does not cut it.",
        "It's there plss check",
        "My apologies, I just noticed it.",
        "No issues",
        "They lied to the courts again.",
        "OP trust me we can be BJP voters and ask for Adani's investigation together. Earlier, I used to also feel attack on Adani as an attack on our India. \n\nBut, now I clearly believe Adani is just misusing the goodwill of BJP and us the citizen to his benefit. This investigation should have been done in India itself. Now, we have to be hostage to the USA for all the facts and evidences.",
        "I'm not sure I understand what you are trying to say here? Do you get paid by Adani to post like this? How can I sign up?",
        "But wtf do you mean by \"PROMISE TO PAY BRIBES TO GOVERNMENT OFFICIALS\" ? How are they gonna prove that?",
        "By pdf ,  Excel sheet and hearsay. As some other company official have claimed that .",
        "They dare to ask money, they have to post what is sent to them",
        "It's funny how ToIletpaper is going out of its way to help adani control the narrative by letting lawyerspeak become news headline. \n\n\nThey burry the fact that the adani group admits there are charges against adanis deep in the article:\n\n\n>AGEL further said Gautam Adani, Sagar Adani, and Vneet Jain have been charged on three counts in the criminal indictment – alleged securities fraud conspiracy, alleged wire fraud conspiracy, and alleged securities fraud.\n\n\nWhile prominently displaying the denial of existence of \"more serious charges\" ",
        "IMO after reading that I feel like it's one of those poke around and find out if anything's wrong...",
        "Wait! You are bootlicking Adani for free? \n\nWhy?"
    ],
    "cleaned_text": "propaganda vs reality propaganda reality ",
    "cleaned_title": "propaganda vs reality",
    "cleaned_selftext": "propaganda reality",
    "cleaned_comments": "golmaal hain bhai sab golmaal hain din baad aya adani ko kya propaganda kare janta c hai really article mentions adani others charged counts true checks indictment pdf also says charged count also true know getting unless im missing something propaganda charged bribery absolutely false writers need stop said said articles report facts hand court document uses words bribery corruption didnt reporters call asking statement see statement anywhere article one senior lawyer talking lack detail surrounding names bribery indictment please quote statement talking op everyone favour link original documents check posting bunch screenshots containing outofcontext information cut plss check apologies noticed issues lied courts op trust bjp voters ask adanis investigation together earlier used also feel attack adani attack india clearly believe adani misusing goodwill bjp us citizen benefit investigation done india hostage usa facts evidences im sure understand trying say get paid adani post like sign wtf mean promise pay bribes government officials gon na prove pdf excel sheet hearsay company official claimed dare ask money post sent funny toiletpaper going way help adani control narrative letting lawyerspeak become news headline burry fact adani group admits charges adanis deep article agel said gautam adani sagar adani vneet jain charged three counts criminal indictment alleged securities fraud conspiracy alleged wire fraud conspiracy alleged securities fraud prominently displaying denial existence serious charges imo reading feel like one poke around find anythings wrong wait bootlicking adani free",
    "light_cleaned_title": "Propaganda vs Reality",
    "light_cleaned_selftext": "Propaganda: Reality:",
    "light_cleaned_comments": "Golmaal hain bhai sab golmaal hain 5 din baad aya adani ko kya propaganda kare, janta to c hai Not really, the article mentions that Adani +2 others are not charged under counts 1 and 5 which is true and checks out in the indictment pdf, it also says that they are charged under count 2,3 and 4 which is also true. So I do not know what you are getting at unless I'm missing something. The propaganda is they are not charged under bribery, which is absolutely false These writers need to stop with \"he said she said\" articles and just report with facts in hand. When the court document itself uses the words \"bribery\" and \"corruption\", why didn't the reporters call them out while asking for a statement? I do not see this statement anywhere in the article, only one from the senior lawyer talking about a lack of detail surrounding the names in the bribery indictment. Can you please quote the statement you are talking about. OP, do everyone a favour and link them to the original documents so they can check for themselves. Posting a bunch of screenshots containing out-of-context information does not cut it. It's there plss check My apologies, I just noticed it. No issues They lied to the courts again. OP trust me we can be BJP voters and ask for Adani's investigation together. Earlier, I used to also feel attack on Adani as an attack on our India. But, now I clearly believe Adani is just misusing the goodwill of BJP and us the citizen to his benefit. This investigation should have been done in India itself. Now, we have to be hostage to the USA for all the facts and evidences. I'm not sure I understand what you are trying to say here? Do you get paid by Adani to post like this? How can I sign up? But wtf do you mean by \"PROMISE TO PAY BRIBES TO GOVERNMENT OFFICIALS\" ? How are they gonna prove that? By pdf , Excel sheet and hearsay. As some other company official have claimed that . They dare to ask money, they have to post what is sent to them It's funny how ToIletpaper is going out of its way to help adani control the narrative by letting lawyerspeak become news headline. They burry the fact that the adani group admits there are charges against adanis deep in the article: >AGEL further said Gautam Adani, Sagar Adani, and Vneet Jain have been charged on three counts in the criminal indictment – alleged securities fraud conspiracy, alleged wire fraud conspiracy, and alleged securities fraud. While prominently displaying the denial of existence of \"more serious charges\" IMO after reading that I feel like it's one of those poke around and find out if anything's wrong... Wait! You are bootlicking Adani for free? Why?"
}