{
    "id": "14awxw1",
    "title": "Is anyone else experiencing this ? Looks like bot attack…",
    "url": "https://i.redd.it/64rosthwtd6b1.jpg",
    "selftext": "This has been happening for a few weeks and it’s freaking me out. Random followers and im not actively posting. Should I be preparing for something 😒",
    "flair": "AskIndia",
    "score": 7,
    "num_comments": 12,
    "created_utc": 1686922238.0,
    "convurl": "https://i.redd.it/64rosthwtd6b1.jpg",
    "comments": [
        "I'm sure every one of them is promoting their OF here.",
        "Not followers but couple days back I got hit with quoted retweet attack from a bunch of crypto groups. Happening as a trend nowadays.",
        "Promoting OF or bots. I just disabled my follow icon so that I don’t keep getting the notification",
        "Or maybe you're a stud and a funny person.",
        "Apni OnlyRandiezzz account promote kar rahe honge.",
        "You have don't allow someone to follow you option in settings.",
        "Yup, had to look twice to find this option",
        "Wait, You guys are using Instagram?",
        "How to do that?\nAnd get rid of current followers?",
        "https://new.reddit.com/settings/profile\n\nUnder \"advanced\" you will find \"allow people to follow you\" option. Switch that off.\n\nNo one can follow you from now on. Idk if it gets rid of current followers."
    ],
    "cleaned_text": "anyone else experiencing looks like bot attack happening weeks freaking random followers im actively posting preparing something ",
    "cleaned_title": "anyone else experiencing looks like bot attack",
    "cleaned_selftext": "happening weeks freaking random followers im actively posting preparing something",
    "cleaned_comments": "im sure every one promoting followers couple days back got hit quoted retweet attack bunch crypto groups happening trend nowadays promoting bots disabled follow icon dont keep getting notification maybe youre stud funny person apni onlyrandiezzz account promote kar rahe honge dont allow someone follow option settings yup look twice find option wait guys using instagram get rid current followers advanced find allow people follow option switch one follow idk gets rid current followers",
    "light_cleaned_title": "Is anyone else experiencing this ? Looks like bot attack…",
    "light_cleaned_selftext": "This has been happening for a few weeks and it’s freaking me out. Random followers and im not actively posting. Should I be preparing for something 😒",
    "light_cleaned_comments": "I'm sure every one of them is promoting their OF here. Not followers but couple days back I got hit with quoted retweet attack from a bunch of crypto groups. Happening as a trend nowadays. Promoting OF or bots. I just disabled my follow icon so that I don’t keep getting the notification Or maybe you're a stud and a funny person. Apni OnlyRandiezzz account promote kar rahe honge. You have don't allow someone to follow you option in settings. Yup, had to look twice to find this option Wait, You guys are using Instagram? How to do that? And get rid of current followers? Under \"advanced\" you will find \"allow people to follow you\" option. Switch that off. No one can follow you from now on. Idk if it gets rid of current followers."
}