{
    "id": "1fmp18y",
    "title": "A little crazy way by which I stopped CARS24 from spamming me",
    "url": "https://www.reddit.com/r/india/comments/1fmp18y/a_little_crazy_way_by_which_i_stopped_cars24_from/",
    "selftext": "So, I am sure by the title you are aware how this company loves to egregiously breach your privacy at random times of the day, and the funny part is I do not even own a car in the first place to begin with as I can't afford it at the moment. But, be it work meetings or during personal time, this organization loves to breach the boundaries by shamelessly calling me and playing a pre-recorded message. The funny thing is I have enabled FULLY BLOCK DND settings on my number, yet they bypass that filter. I denounced their mischief on LinkedIn/Twitter to no avail and even reporting their numbers to DND of my operator (even though they were warned, did not really help). All they could say is, \"Please share your number, we will add it to our DND list and will not bother you again\". Why should I share my number with an entity that I never was interested in the first place?\n\nIt was time to take a different course.\n\nSo, I logged into my dad's personal email-ID and drafted a strict and confrontational mail to their customer care  pretending that he was intervening in the issue and how he was appalled and disgusted by the way they harass me for no apparent reason, and I threatened them that the next time they call, we will lodge an FIR with the police and will drag their CEO and their company to court and sue them for the same. I refined the mail using ChatGPT. And, voila the calls stopped for good! In the meanwhile I also ported out of Jio to BSNL, and the spam calls also reduced by 90%. So, I have a suspicion that Jio might sell our data to advertisers and spammers. \n\n[The mail I wrote on behalf of my dad to stop harrassing me. Few details are hidden for the sake of privacy. ](https://preview.redd.it/t2xr3vhosbqd1.png?width=3300&format=png&auto=webp&s=21f19b6cb51c00565a721d4214561a09a9fb6a3d)\n\nWhen I did some research on how do these firms like Bajaj Finance and Cars24 get our numbers in the first place? Well, the answer is very simple. A few of us often give our mobile numbers in shopping malls, supermarkets and cinema halls when the cashier says that he/she will enroll us so that we can get discounts/ be a member of their club promising attractive offers. The problem is a few unassuming people give their details and we all know how data privacy laws are non-existent in our country. Before you know it your details are quickly packaged and are sold to data brokers who sort your data based on the city, state, age-group and income who then forward these details to various businesses. \n\nThe solution? \n\nWell, just don't give out your primary number and if possible! You can get a secondary SIM/a virtual number which you really don't care about and you can use it for these purposes.\n\nNow, what to do if your primary number is a victim of spamming? Well, you can only start reporting the numbers to TRAI using your operator's UCC complaint form from their app and the offenders would be warned, then put under restricted usage and eventually debarred from all operators. Since, I use an iPhone and Truecaller does not work well as of now on iOS, I use the voicemail feature to filter out unwanted calls. If someone is trying to reach me, I can redial them back after checking the number's details on Truecaller.\n\n",
    "flair": "Rant / Vent",
    "score": 13,
    "num_comments": 21,
    "created_utc": 1726996119.0,
    "convurl": "https://b.thumbs.redditmedia.com/O0PFDzqhlEDA7OeKPETqzs6kEb_5X5BaxwLgS4glrdg.jpg",
    "comments": [
        "When porting, your number remains the same. So how would it reduce spam calls? \n\nJio sucks ass though. Everyone sells your data, even the govt sells our aadhaar data.",
        "I have a conspiracy theory I feel Jio has some sort of conduit or they have found a loophole through which it whitelists and relays a few spam calls especially the unregistered telecallers. I did observe that when I ported my mom's Jio SIM to airtel, the spam calls went down to a lot extent.\n\nI was facing call failures while on Jio and it is my work number, I have Wi-Fi at home and another airtel SIM for data, hence I ported my SIM to BSNL as I mostly need it to keep the SIM active and receive ocassional calls. I get close to 50 Mbps DL and 20 Mbps UL speeds at my home.",
        "Chill bhai itna kuch nahi hua hai......1 hafta naa uthao toh calls band ho jate hai \n\n\n\n\nInsurance,used cars, credit cards ho gaya. Filhal abi mera real estate me kisi ne data bech diya hai (me dhundh rha tha ghar 3 saal pehle aur mene liya bhi) but spam calls abi shuru hue h random projects ke.",
        "Bhai, har cheez ki ek seema hoti hain. Even if I did not answer few calls, these incorrigible f\\*\\*kers will call me to annoy me. Ek baar ek important client ke saath deal finalize kar raha tha, tab aa gaya unka call. Din mein 5-10 baar inke hi calls aate the.",
        "Itne aggressively kyu tujhe pursue kar rhe the bhai......Bulk deal me 100 gaadiya lene wala tha kya😝",
        "Even I failed to understand! I never owned a car, nor I have my driving license yet. Toh yeh calls kaha se aur kyon aa rahe hain?",
        "Mene bas ek bar kisi used car site pe meri gadi ka online valuation kiya tha aur report generate ki thi.....Fir ek hi bar call aaya ki aap bech rahe hai kya?\n\n\n\nNahi me toh bas market value dekh rha tha.\n\n\n\nOk. Call ended.",
        "Bhai, I did not even visit their site in the first place.",
        "Very weird.....check if cars 24 has otp verification to confirm your number when enquiring a car. Someone might be using your number to enquire cars because there is not otp verification. Because its very weird to get such repeated calls if its just a mere data leak.",
        "use Google Dailer with Spam filter",
        "Please post the email text here.",
        "Install the TRAI app and keep reporting.\n\nThey actually screw up the tele-callers and the brand, both. You can track the status too.",
        "That's not true at all  its all about how much you shared your number online. I have two airtel sim which i have been using for over a decade now one of them is used at every. Other site login and the other one is just for  important documents and accounts. \n\nI receive far more calls on the public number just bcus ive given it online to sites more than the other one.",
        "When you don't oppose wrong soon it will become a norm",
        "Fr \nReading that specially in white bg is a pain",
        "Doosra was a great startup  which was solving this exact issue by giving a virtual Sim.\nBut unfortunately because of dumb government it had to wind up ",
        "Nonsense theory",
        "\"Warm regards\" roflmaoooooo",
        "Here are some steps you can take to avoid spam calls. Never give your phone number:\n1. To cashiers at a store who say you'll get your bill on the phone.\n2. To again the cashiers who try to sell you memberships for deals etc.\n3. To any website who asks your phone number to proceed with your query. Example: Policybazaar.\n4. To any charity organization's representative commonly found in crowded public places asking for donations.\n5. To anyone and any business except the one you trust."
    ],
    "cleaned_text": "little crazy way stopped cars spamming sure title aware company loves egregiously breach privacy random times day funny part even car first place begin cant afford moment work meetings personal time organization loves breach boundaries shamelessly calling playing prerecorded message funny thing enabled fully block dnd settings number yet bypass filter denounced mischief linkedintwitter avail even reporting numbers dnd operator even though warned really help could say please share number add dnd list bother share number entity never interested first place time take different course logged dads personal emailid drafted strict confrontational mail customer care pretending intervening issue appalled disgusted way harass apparent reason threatened next time call lodge fir police drag ceo company court sue refined mail using chatgpt voila calls stopped good meanwhile also ported jio bsnl spam calls also reduced suspicion jio might sell data advertisers spammers mail wrote behalf dad stop harrassing details hidden sake privacy httpspreviewreddittxrvhosbqdpngwidthformatpngautowebpsfbcbcadaafbad research firms like bajaj finance cars get numbers first place well answer simple us often give mobile numbers shopping malls supermarkets cinema halls cashier says heshe enroll us get discounts member club promising attractive offers problem unassuming people give details know data privacy laws nonexistent country know details quickly packaged sold data brokers sort data based city state agegroup income forward details various businesses solution well dont give primary number possible get secondary sima virtual number really dont care use purposes primary number victim spamming well start reporting numbers trai using operators ucc complaint form app offenders would warned put restricted usage eventually debarred operators since use iphone truecaller work well ios use voicemail feature filter unwanted calls someone trying reach redial back checking numbers details truecaller ",
    "cleaned_title": "little crazy way stopped cars spamming",
    "cleaned_selftext": "sure title aware company loves egregiously breach privacy random times day funny part even car first place begin cant afford moment work meetings personal time organization loves breach boundaries shamelessly calling playing prerecorded message funny thing enabled fully block dnd settings number yet bypass filter denounced mischief linkedintwitter avail even reporting numbers dnd operator even though warned really help could say please share number add dnd list bother share number entity never interested first place time take different course logged dads personal emailid drafted strict confrontational mail customer care pretending intervening issue appalled disgusted way harass apparent reason threatened next time call lodge fir police drag ceo company court sue refined mail using chatgpt voila calls stopped good meanwhile also ported jio bsnl spam calls also reduced suspicion jio might sell data advertisers spammers mail wrote behalf dad stop harrassing details hidden sake privacy httpspreviewreddittxrvhosbqdpngwidthformatpngautowebpsfbcbcadaafbad research firms like bajaj finance cars get numbers first place well answer simple us often give mobile numbers shopping malls supermarkets cinema halls cashier says heshe enroll us get discounts member club promising attractive offers problem unassuming people give details know data privacy laws nonexistent country know details quickly packaged sold data brokers sort data based city state agegroup income forward details various businesses solution well dont give primary number possible get secondary sima virtual number really dont care use purposes primary number victim spamming well start reporting numbers trai using operators ucc complaint form app offenders would warned put restricted usage eventually debarred operators since use iphone truecaller work well ios use voicemail feature filter unwanted calls someone trying reach redial back checking numbers details truecaller",
    "cleaned_comments": "porting number remains would reduce spam calls jio sucks ass though everyone sells data even govt sells aadhaar data conspiracy theory feel jio sort conduit found loophole whitelists relays spam calls especially unregistered telecallers observe ported moms jio sim airtel spam calls went lot extent facing call failures jio work number wifi home another airtel sim data hence ported sim bsnl mostly need keep sim active receive ocassional calls get close mbps dl mbps ul speeds home chill bhai itna kuch nahi hua hai hafta naa uthao toh calls band ho jate hai insuranceused cars credit cards ho gaya filhal abi mera real estate kisi ne data bech diya hai dhundh rha tha ghar saal pehle aur mene liya bhi spam calls abi shuru hue h random projects ke bhai har cheez ki ek seema hoti hain even answer calls incorrigible fkers call annoy ek baar ek important client ke saath deal finalize kar raha tha tab aa gaya unka call din mein baar inke hi calls aate itne aggressively kyu tujhe pursue kar rhe bhaibulk deal gaadiya lene wala tha kya even failed understand never owned car driving license yet toh yeh calls kaha se aur kyon aa rahe hain mene bas ek bar kisi used car site pe meri gadi ka online valuation kiya tha aur report generate ki thifir ek hi bar call aaya ki aap bech rahe hai kya nahi toh bas market value dekh rha tha ok call ended bhai even visit site first place weirdcheck cars otp verification confirm number enquiring car someone might using number enquire cars otp verification weird get repeated calls mere data leak use google dailer spam filter please post email text install trai app keep reporting actually screw telecallers brand track status thats true much shared number online two airtel sim using decade one used every site login one important documents accounts receive far calls public number bcus ive given online sites one dont oppose wrong soon become norm fr reading specially white bg pain doosra great startup solving exact issue giving virtual sim unfortunately dumb government wind nonsense theory warm regards roflmaoooooo steps take avoid spam calls never give phone number cashiers store say youll get bill phone cashiers try sell memberships deals etc website asks phone number proceed query example policybazaar charity organizations representative commonly found crowded public places asking donations anyone business except one trust",
    "light_cleaned_title": "A little crazy way by which I stopped CARS24 from spamming me",
    "light_cleaned_selftext": "So, I am sure by the title you are aware how this company loves to egregiously breach your privacy at random times of the day, and the funny part is I do not even own a car in the first place to begin with as I can't afford it at the moment. But, be it work meetings or during personal time, this organization loves to breach the boundaries by shamelessly calling me and playing a pre-recorded message. The funny thing is I have enabled FULLY BLOCK DND settings on my number, yet they bypass that filter. I denounced their mischief on LinkedIn/Twitter to no avail and even reporting their numbers to DND of my operator (even though they were warned, did not really help). All they could say is, \"Please share your number, we will add it to our DND list and will not bother you again\". Why should I share my number with an entity that I never was interested in the first place? It was time to take a different course. So, I logged into my dad's personal email-ID and drafted a strict and confrontational mail to their customer care pretending that he was intervening in the issue and how he was appalled and disgusted by the way they harass me for no apparent reason, and I threatened them that the next time they call, we will lodge an FIR with the police and will drag their CEO and their company to court and sue them for the same. I refined the mail using ChatGPT. And, voila the calls stopped for good! In the meanwhile I also ported out of Jio to BSNL, and the spam calls also reduced by 90%. So, I have a suspicion that Jio might sell our data to advertisers and spammers. [The mail I wrote on behalf of my dad to stop harrassing me. Few details are hidden for the sake of privacy. ](https://preview.redd.it/t2xr3vhosbqd1.png?width=3300&format=png&auto=webp&s=21f19b6cb51c00565a721d4214561a09a9fb6a3d) When I did some research on how do these firms like Bajaj Finance and Cars24 get our numbers in the first place? Well, the answer is very simple. A few of us often give our mobile numbers in shopping malls, supermarkets and cinema halls when the cashier says that he/she will enroll us so that we can get discounts/ be a member of their club promising attractive offers. The problem is a few unassuming people give their details and we all know how data privacy laws are non-existent in our country. Before you know it your details are quickly packaged and are sold to data brokers who sort your data based on the city, state, age-group and income who then forward these details to various businesses. The solution? Well, just don't give out your primary number and if possible! You can get a secondary SIM/a virtual number which you really don't care about and you can use it for these purposes. Now, what to do if your primary number is a victim of spamming? Well, you can only start reporting the numbers to TRAI using your operator's UCC complaint form from their app and the offenders would be warned, then put under restricted usage and eventually debarred from all operators. Since, I use an iPhone and Truecaller does not work well as of now on iOS, I use the voicemail feature to filter out unwanted calls. If someone is trying to reach me, I can redial them back after checking the number's details on Truecaller.",
    "light_cleaned_comments": "When porting, your number remains the same. So how would it reduce spam calls? Jio sucks ass though. Everyone sells your data, even the govt sells our aadhaar data. I have a conspiracy theory I feel Jio has some sort of conduit or they have found a loophole through which it whitelists and relays a few spam calls especially the unregistered telecallers. I did observe that when I ported my mom's Jio SIM to airtel, the spam calls went down to a lot extent. I was facing call failures while on Jio and it is my work number, I have Wi-Fi at home and another airtel SIM for data, hence I ported my SIM to BSNL as I mostly need it to keep the SIM active and receive ocassional calls. I get close to 50 Mbps DL and 20 Mbps UL speeds at my home. Chill bhai itna kuch nahi hua hai......1 hafta naa uthao toh calls band ho jate hai Insurance,used cars, credit cards ho gaya. Filhal abi mera real estate me kisi ne data bech diya hai (me dhundh rha tha ghar 3 saal pehle aur mene liya bhi) but spam calls abi shuru hue h random projects ke. Bhai, har cheez ki ek seema hoti hain. Even if I did not answer few calls, these incorrigible f\\*\\*kers will call me to annoy me. Ek baar ek important client ke saath deal finalize kar raha tha, tab aa gaya unka call. Din mein 5-10 baar inke hi calls aate the. Itne aggressively kyu tujhe pursue kar rhe the bhai......Bulk deal me 100 gaadiya lene wala tha kya😝 Even I failed to understand! I never owned a car, nor I have my driving license yet. Toh yeh calls kaha se aur kyon aa rahe hain? Mene bas ek bar kisi used car site pe meri gadi ka online valuation kiya tha aur report generate ki thi.....Fir ek hi bar call aaya ki aap bech rahe hai kya? Nahi me toh bas market value dekh rha tha. Ok. Call ended. Bhai, I did not even visit their site in the first place. Very weird.....check if cars 24 has otp verification to confirm your number when enquiring a car. Someone might be using your number to enquire cars because there is not otp verification. Because its very weird to get such repeated calls if its just a mere data leak. use Google Dailer with Spam filter Please post the email text here. Install the TRAI app and keep reporting. They actually screw up the tele-callers and the brand, both. You can track the status too. That's not true at all its all about how much you shared your number online. I have two airtel sim which i have been using for over a decade now one of them is used at every. Other site login and the other one is just for important documents and accounts. I receive far more calls on the public number just bcus ive given it online to sites more than the other one. When you don't oppose wrong soon it will become a norm Fr Reading that specially in white bg is a pain Doosra was a great startup which was solving this exact issue by giving a virtual Sim. But unfortunately because of dumb government it had to wind up Nonsense theory \"Warm regards\" roflmaoooooo Here are some steps you can take to avoid spam calls. Never give your phone number: 1. To cashiers at a store who say you'll get your bill on the phone. 2. To again the cashiers who try to sell you memberships for deals etc. 3. To any website who asks your phone number to proceed with your query. Example: Policybazaar. 4. To any charity organization's representative commonly found in crowded public places asking for donations. 5. To anyone and any business except the one you trust."
}