{
    "id": "1btsuja",
    "title": "No petrol, diesel vehicles in India: Gadkari vows to eliminate fuel cars",
    "url": "https://m.economictimes.com/industry/auto/auto-news/no-petrol-diesel-vehicles-in-india-gadkari-vows-to-eliminate-fuel-cars/articleshow/108935891.cms",
    "selftext": "\"One hundred per cent,\" the Union Minister for Road Transport and Highways said when asked whether it is possible for India to get rid of petrol and diesel cars altogether.",
    "flair": "Policy/Economy",
    "score": 915,
    "num_comments": 285,
    "created_utc": 1712043652.0,
    "convurl": "https://external-preview.redd.it/85c5xs83xcaOjhp-TRKmsncBjYQfeQU7kvdWg8IIFGU.jpg?auto=webp&s=475c830337a2444be9722b156c846bcca77548ea",
    "comments": [
        "Obligatory, \" *Muh se mungfali toot nahi rahi* \"...",
        "🤣",
        "Jai Adani",
        "Tax payers should protest this level of idiocy. They makes us buy vehicles, pay tax, pay tax to use it, then say that all of your money that you invested in it is useless.\n\nNice Gandkari.",
        "This is inevitable, no need to coerce people into it. Just adapt the right policies, establish the needed infrastructure and the market forces will take care of the rest.",
        "People get the leaders they deserve. Unfortunately the masses like this lie being sold that EVs are always zero emissions. ",
        "> \"One hundred per cent,\" Gadkari, the Union Minister for Road Transport and Highways, said when asked whether it is possible for India to get rid of petrol and diesel cars altogether. \n\nYes, but not in India and not in the near future for EV leaders like Norway.",
        "did you read the article ?",
        "Who cares about zero emissions people care about fuel charges which is very low on EV",
        "Yeah what about it?",
        "Ghanta he' ll listen",
        "EV is not the future. Do these guys know the amount of pollution 1 EV does even before it hits the road?",
        "Are you joking? Market forces, really? When our climate catastrophe is so market driven? Adapt right policies, yes, but don't expect a fucking carbon tax and a slight slap on the wrist to fix things.",
        "In other news imports from China rise by 500%",
        "Hold your horses bro! He said it in right sequence. Policy, infra, then adoption driven by market forces!",
        "Do tell us bro!",
        "Isn't majority of our electric needs still happening due to burning fossil fuels? And those rare minerals mined majorly from a single country?",
        "exactly! anything but trams and bike lanes ffs",
        "But govt get a lots of taxes from fuel, if everyone adapts to ev I bet they will levy taxes on ev charging",
        "What's needed is an active industrial policy. In India, \"market forces\" will boil down to just Adani.",
        "today's *garibi hatao*",
        "Won't happen. The government relies heavily on taxes from fossil fuels to give it up",
        "i kid you not - the lights in our office just went out! we are on genset power now, hahahaha",
        "They will tax public charging infra for sure.",
        "The financier must make returns on his investments.",
        "Eliminate private cars altogether. Invest in public transportation. We need it more than ever.",
        "Tata power stock 📈",
        "gand se akhrot todne ki batein krta hai",
        "Replace them with what ? Electric cars ? How long does the battery in our mobile phones last ?",
        "This logic has led to a lot of today's social, economic, environmental crisis and massive inequalities.",
        "Learn to read the sarcasm on Internet bro! Don’t let NRI status ruin your spidy sense.",
        "Ahhhhh hahaha. My bad :))",
        "This is folly and in wrong order of priority.\n\n1. Many rural and cities still have regular power cuts especially in summer. There isn't enough power generation and capacity.\n\n2. The point of electric car is to reduce tail emission, based on cleaner electricity. This far from the case as most electricity in India comes from Coal and not renewable but improving.\n\n3. Where is the infrastructure for rapid car charging? I looked at plugshare for over 50 kWh charger...there were 11 for new Delhi!",
        "Gadkari ka pakka kisi ev auto ancillary mei passive investment hai",
        "On that point plz fill this questionnaire regarding consumer perception for EVs for my college project \nhttps://forms.gle/peq1HKtysKbocZRS6",
        "Just once correction. India has enough power generation and capacity - the problem is transportation and distribution of power. \n\nWe are a power surplous country.",
        "Just imagine\n\nThe amount of jobs we will loose because of this decision.\n\nEV should not be forced by the government. It should be decided by Market Forces. \n\nNithin Gadakari is a good minister.\n\nBut both BJP and Congress have an anti capitalist socialist attitude which doesn't respect free markets and consumer choices.",
        "I dont want my car subscription running out like Netflix. Sorry diesel and petrol cars are still preferred.",
        "They are still better than the current alternatives. For cities that are full of traffic, EVs are a no brainer. I don't really care about what Mr Gadkari is saying, but I hate people who say 'but EVs are not 0 emissions!!'. Yes dumbass, but you got to start somewhere. You don't go to 0 from a 100 but don't criticizw when technology can bring it to 50.",
        "So car no go vroom 🥲",
        "Abey gaddhe… road aur vehicles ka itna tax lete ho uska kuch kaam kar na? Why are these politicians so stupid? Why do they think we are so stupid?",
        "You’re absolutely right. The most sustainable move forward is a to have a robust and extremely well maintained public transport system. Good buses, metros, trains, etc.\n\nOn top of that improving the roads too.",
        "But Mudizi can't take the credit na?",
        "Not sure but he isnt specif talking about ev…hydrogen too is his pet project (I hope it succeeds)",
        "And paving the way for Tesla",
        "The way they are taxing the middle class, how do they hope for people to purchase EVs?",
        "To manufacture each EV battery, you must process 25,000 pounds of brine for the lithium 30,000 pounds of ore for the cobalt 5,000 pounds of ore for the nickel, 25,000 pounds of ore for copper.Digging up 500,000 pounds of the earth's crust..For just - one - battery. This I got off google. \n\nhttps://www.wionews.com/science/electric-vehicles-emit-more-particle-pollution-than-petrol-diesel-cars-study-says-697186/amp\n\nI think it says due to their weight they cause 1850 times more particle pollution than normal vehicles. \n\nhttps://yourstory.com/2024/03/toyota-ev-hybrid-debate\n\nToyota did a study called the 1-6-90 study. \n\n1 EV car production equals 6 plug in Hybrids or 90 Hybrids.  EV is stupid really.",
        "Arrey its actually simple... we all going back to bullock cart days.",
        "Gareebon ko*",
        "All pvt cars EV , all commercial vehicles CNG. Trucks carry on with Diesel i guess.\n\nIndia is a big market and EV can complement the population.\nFor instance, there is a pilot project in US where all EV connected to grid can be used for load shedding.\nImagine you’re in rural area, your car is connected to charger. you also have solar panels, if there is no electricity because of load shedding then the car works as an inverter and powers your home. \n\nI know range is an issue with most EV ,however its mostly in extremely cold and new charging tech can charge vehicles in 15 mins.",
        "Done",
        "Thanks man",
        "You mean 'पेट' project? Place where all the money goes?",
        "Does the Scania bus he got as gift run on batteries?",
        "Bold of you to assume taxes will not be levied on EV vechicles. There could very well be a 'charging' tax applied at a later stage. So you pay whenever you charge.",
        "That’s the worst decision they could make. \nIndia is growing, we need fuel efficient vehicles but we also need long range vehicles which EV won’t be able to provide the solution for.",
        "Yes. Those sort of things will ensure all major highways are blocked in India.",
        "Nice, lets start with government vehicles!!",
        "But no plans to move away from electricity generated by consuming fossil fuel?",
        "People said excuses against digital payments as well. Now what's the situation of it?\n\nIf we can start implementing these things in cities, it will quickly develop all across India. Did we wait for every shop to stick qr codes before we started using UPI? As the numbers grow, the situation will also improve. We can't build the entire car charging infrastructure in one day. As the EVs get more and more popular, it will soon get better.\n\nAs far as the second point is considered, it's still better than importing oil from middle east and russia. While that transition is taking place, we can switch to Nuclear power (and we are building around 10 nuclear plants now). \n\nFor the first point, we actually have excess power. It's the distribution that's the problem. If we can get a lot more nuclear power plants running within the next 2-3 years, we can switch all the thermal power plants into backup mode. Every summer, they should start operating to provide an extra boost so that we can meet our demand, until we can completely switch over to nuclear power.",
        "Foreign exchange is also a big headache for the government. Less petroleum import means more saving of foreign exchange. When we export more, the economy will naturally develop just like other exporting economies all over the world. There will be less need for government to stimulate the economy through public spending and hence needing less in taxes.",
        "Tesla isn't affordable for the masses. Tata is doing good though",
        "We are a power surplus country because many people are too poor to afford AC and other electrical devices and our industrialization which requires power-hungry machines is lacking. We generate less than 1/5 of the electricity of China.",
        "Hydrogen is the worst technology to venture into. Go figure.",
        "Corruptkari",
        "Electric vehicles won't succeed unless we have good charging infra. They are not prioritizing it. Just focusing on vehicles.",
        "They will add distance tax. This is the worst I can think of. And since it's India, that's what they will do.",
        "Pehele isko hatana... buddha aaj kal bohut bolne laga",
        "I would like to see this moron banning fuel cars...",
        "Most non sensical guy.",
        "Great decision. \n\nIndia has already found deposits of lithium for the battery manufacturing. \n\nNow if we can find enough renewable and nuclear energy sources, we can eliminate the coal plants too.",
        "Today yes. But EV will continue to improve at a faster rate than combustion engines. It’s the only way ahead. And subscription running out is a business problem not a tech problem.",
        "But this change can be easily done. Compared to petrol pumps, building infra for electric is comparatively easy. Even the people who owns some land in the roadsides can provide facilities for 2-3 car charging in future.",
        "Motor whine replaces vroom.",
        "Exactly , they might not mean zero emissions but they’ll defined have a huge effect on the AQI of many major cities.",
        "Where does energy come from though?",
        "Dude no.\n\nWe have enough power generation capacity for all these needs. \n\nUnless you fault the correct thing, how will we improve?\n\nPeople not being able to afford AC is another matter. At the current point in time, we are power surplus. As demand increases, power generatin capacity will also increase.",
        "We have not updated core structure of our trucks in the past 30-40 years. But sure",
        "India is now depending on coal. We have to explore other sources. We are already building couple more nuclear reactors and other sources.",
        "How?\n\nas far as I know…if hydrogen catching fire plus affordable synthesis is figured out,we have hydrogen in abundance.",
        "Whatever. Policy is drafted by government. They can ban subscription based driving features for cars in future. Otherwise there's no point in switching to Electric.\n\nAlso, since it's a democracy, people should still be able to use gasoline cars, as long as we pay the carbon tax.",
        "Haha nice 😂😂",
        "It's important to prioritize things necessary for society, these regulations are democratic. \"Free\" market has only done more harm than good.\n\nThis gadakari = good, seems to be some largescale propaganda, he's just as corrupt as anyone.",
        "bhai mere plate me khana thodi dal ke de raha wo jo respect kru. For me he is a part of crowd same like 7 billion people on this earth ",
        "lol no they shouldn’t, democracy doesn’t mean you get to actively harm the environment when a better alternative is present. It’s like saying people should be allowed to commit murder as long as they’re willing to go to jail for it.",
        "Lol using petrol cars is equivalent to murder? Wow. The wokeness is high in this one",
        "He explicitly mentions that there is no defined timeline to ban petrol and diesel vehicles. But its the ultimate goal for a greener india initiative. You didnt read the article.",
        "You get an award for completely the missing the point.",
        "Jhumla hai....we will not be competitive if we move to zero petrol.",
        "He is also part of the corrupt gobermint and sangh parivaar so I don't believe a word he says!",
        "Tu kar, humein nai karna.",
        "Who is this helping? Paagal hogaya hai ye aadmi. The environmental cost of batteries is just as bad. How about we limit the number of cars on the roads and sale of cars, bring back odd even, push towards hybrid cars more and more public transport. I think we need less rickshaws and autorickshaw and cars on the road and lots more busses and metro connectivity. and also nighttime availability of public transport eventually. ",
        "Market forces don't exist even for petrol. What do you think govt control over the price of petrol means, a free market?",
        "Just improve public transport. The last thing we need is more cars",
        "Bro respects waiters ",
        "Regarding this, i am conducting a survey on consumer perception of EVs as my college project \nhttps://forms.gle/peq1HKtysKbocZRS6",
        "This policy won't be implemented until Adani and Ambani sells of their fossil fuel based business.\n\nIt is easy to make big claims.",
        "https://preview.redd.it/vz83d0kuv1sc1.jpeg?width=634&format=pjpg&auto=webp&s=c7a3b0293bd41e5bb761e8aaf329bec495b7804b",
        "Digital payments were way easier. Everyone had a mobile and Jio had made data cheap. So infra was not a problem. The govt also removed transaction charges, making it attractive. \n\nEV charging is way more difficult. You need charging to be available for vehicles. In a country where most people struggle to find parking space for their vehicles, charging where they park is a major logistical nightmare. Putting fast chargers everywhere is also difficult: first, your grid needs to support the higher wattage and second even if it does, EVs take way longer to charge than an ICE takes to refuel. Even if some magical tech makes charging quicker, it'll still need even higher wattage charging equipment and grids. You can't tech your way out of the laws of physics. \n\nThen there's the highway. As someone who's driven a few times on highways, it's been a nightmare each time. Poor charging infrastructure, charge points breaking down or not having power due to rains, compatibility issues, software issues etc. I know the stock answer is \"plan your trips\", but that's basically code for \"the tech isn't mature\". And the best laid plans with 2 backups for each charge point can still not work.",
        "Distribution is probably the biggest issue.",
        "real id se aajao Sanju",
        "Idhar waise bhi acchi gaadiyaan nahi milti because of the high af taxes.",
        "Holi ki bhaang abhi utri nagi lagta hai",
        "\"ohh really? what luck! Mera ghar ke bahar gu hai, kab hatega?\"",
        "🤣🤣",
        "EV in india can develop only if RIL or Adhani gets seriously into race \n\n>!(Reliance to roll out swappable batteries for electric vehicles, Adhani Power is already big ofc ....)!<",
        "Good charging infra that cannot be uprooted and stolen.",
        "The Union Minister for Road Transport & Highways should first vow to fix the damn roads. I ain't driving a Tesla on the moon's surface lol",
        "One of our biggest issues is that our cities are congested af. It takes a good 20 minutes for cars to charge around 75% with the fast chargers. Where will these ports come up? How many stations per center?",
        "Just get security guards 24x7. If petrol pumps were unmanned, those machines and too would get stolen in India including the petrol and diesel.",
        "In totally unrelated news: Adani opens new EV factory in Gujarat",
        "What happened to flex fuels and bio fuels which were apparently the solution to all our problems just last year?",
        "good point. sasti gadi vroom <<< motor whine <<< achi gadi vroom",
        "Yes tarpaulin sheets will do, just put some poles and you’re good to go",
        "That's nice if we can produce enough electricity",
        "There is no point in vroom vroom especially in india. High af taxes, high af potholes, high af traffic jam. High af brain dead thar/creta owners on road.",
        "Pehle road sahi karo yaar. And where is the infra for EV charging.",
        "this guy has to go too!.... enough of his stupidity!..another guy with MESSIAH complex!",
        "Thank you",
        "First fix the damn city roads and then highways man! in Bangalore I am contemplating if I should buy a Tractor as my first car!",
        "Ill be on the optimistic side and say that it might be possible. People said the same about UPI once",
        "Security guards = more jobs as well ... So",
        "Much better, less chhapris on bullet",
        "This",
        "They're doing this because they want to end oil imports and use domestic coal to power cars. Also, cronyism.",
        "BC log iss me bhi fault finding karna start ka denge..BC atleast koi to cabinate ministry me kuch  kaam kar rha he",
        "I always ask how do you generate electricity to EV saves environment guys, but no one answers. They think electricity is generated from air",
        "I mean, EVs are not the only alternative to petroleum based cars. You have CNG/LNG, Hydrogen based vehicles etc. So, let’s see!",
        "Parhaps he might be removed from the ministry in upcoming term!",
        ">Everyone had a mobile and Jio had made data cheap\n\nExactly. All we need to change our present situation is for some company like Jio to enter the market and create a large scale disruption of it. \n\nAs far as the other things you mention, it's fair criticism. But one thing in my opinion is that if you do not have a proper parking space, then don't buy a car. Get a two wheeler. Don't cause inconvenience to everyone by blocking the roads. \n\nOur present highways are actually the best for building electric car infrastructure. At frequent intervals, like every 100km or so, have a building with a lot of charging facility as \"wayside amenities\". People will stop there to take some rest and have a chai. Their vehicle will get charged by that time. \n\nThe EV technology is still in it's infant phases. We need to fix these issues and there's a lot of potential for it in the future. Not all vehicles can be replaced by EV's but for the city roads, EVs are the best. Especially the two wheeler EVs. For anything further than your local shop, in an ideal scenario, we should be using public transport. Trains for medium-long distance and flights for long-extremely long distant journey.",
        "Bruh it's April 1st article",
        "That's the goal but it needs to be backed by enough power generation and modern distribution systems. Even if we produce the electricity required for a near 100% electrification of transportation we'll be worse off with fossil fuel power plants. \n\nWe need nuclear power complemented by renewable energy capture.",
        "The only way that's possible in India is to make vehicles with removable batteries. Queues at petrol stations can be long right now with like 5 mins or less to fill up, charging speeds are atrocious with current tech stacks.",
        "yes sir, very much possible sir. India 24/7 power supply sir. Unbeatable charging infra sir. Sir, quick charge times sir.\n\nPeople? BJP said the same thing about UPI and digital India, citing lack of internet access. Which was an accurate judgement.\n\nNow, how does BJ-Pee plans to fulfill energy requirements for houses, EVs? I understand they want to cut down on crude oil dependency, but wth are they building these NEs for? If all they want us to use our cars for is intra-city travel?\n\nAlso, I'm very much skeptical about behind the scenes lobbying by Tata and Mahindra.",
        "Mr. Gadkari ki gaand mein daal ke charge kar lunga bro, but EV hi chalaunga",
        "More like BYD",
        "I think this is a gross simplification of the scale of the issue. \n\nCountries like China and most of Europe which have superb power grids and highway systems are struggling to implement high speed rapid chargers. These require resilient very high load cabling and electricity distribution. For example a typical home might be provided with 10 kW max load.... Compare to make a bank of rapid chargers (let's say the norm high end is 250 kW X 10 at a stop) ...you need 2500 kW in one location. Now scale this up for millions of cars and thousands of locations.\n\nCountries in Europe with superb highways have been struggling with building capacity for years, and electric cars in most of Europe are still not a majority. On busy days there is a queue at the Tesla chargers. This is not like an app that works on most android phones and modular cloud servers.\n\nCan it be done, yes. Will it be done quickly. No. I'll be surprised if 25% cars in India are electric by 2050.",
        "You do realise that the issue is there because you can only get fuel from petrol stations right now. And if it is electric it can be anywhere. In your house, school, college, office, market. Anywhere. So that would actually result in less stacking at charging stations because you can have more charging stations and everywhere. The real issue is generating enough electricity to support that. I have doubts about that given how many people still don't have access to 24 hour electricity in this country.",
        "Yup. There are still so many people who don't get 24 hour electricity supply in this country and we can never even imagine the consumption if all vehicles are electric. We first need to have enough electricity for household and infrastructures before we can talk about vehicles.",
        "Technically it is. Electricity is generated by transfer of electrons which can be done through air, solar, etc. Many ways to make electricity but I do agree with you. We still do not have enough electricity to provide everyone with 24 hour supply in this country.",
        "I know renewable energy can be a source, but both wind and Solar are very less efficient. We have to depend on coal for electricity. My point is that people saying electricity vehicles can save the environment don't know how electricity is generated",
        "Not entirely true. We get so much energy from these sources that even when they are inefficient they can provide enough. The real problem is the battery technology. Currently all batteries are made with lithium and mining lithium is a big issue on the environment. Plus the people mining it are heavily exploited. So yes we always have to pay a price but coal is way worse. Because not only are you mining it, you are also burning it which releases a ton of carbon into the atmosphere. Making the air hotter, oceans acidic and when it combines with other gases in the air it can cause health effects.",
        "You aren't getting my point. I'm speaking about uncles who say Solar energy is enough to run entire world since it's getting hotter. Thanks for pointing about Lithium I once made a speech about issues in Lithium extraction and how it's same as what Africa went through while extracting Diamonds and why Lithium is the new diamond and it's extraction place is new Africa but no one cared",
        "Kya yar puree hi maje le lete ho, super bro \nI imagined how is giong to do that but gonna fail",
        "No no I got your point. I'm only saying I don't completely agree with it because we don't have any other option. Those sources are the only way going forward. All fossil fuels will a) cause pollution and b) be completely used some day. Then only these sources of energy will be there. Especially our Sun. Our sun does send a crazy amount of energy towards earth and if we used even a small amount we could have enough for the world. It's the biggest nuclear reactor we can ever have access to.",
        "Extremely valid points. Electricity would be the main thing. Confidence in long trips with electric vehicles will come with either extremely fast charging or removable batteries. Buying decisions in India depend a lot on it.",
        "I hope he's talking abt Biofuels . But since his daddies are being gifted the mining rights to lithium i think we are going to see a massive push to electric .\nEspecially since the said daddies already have control of coal .\n\nNot to mention the way our environment is being ravaged at an unprecedented scale for coal and lithium . The deafening silence by the media on hasdeo forest and sonam wangchuk's climate fast just foretells what's planned for the future.\n\nForget BS4 and diesel , Soon your 10 year old petrol BS6 will become too polluting",
        "biggest jumlebaaz!",
        "Yeah, so what's wrong with my comment? It's stupid for ministers to make comments on policy that doesn't exist. Either the policy is stupid or he is. Or both are. And by trying to find him safe exit clauses you definitely are. Why defend asses?",
        "How will you power the grid ? By burning coal. Great success",
        "i hope hes lying",
        "This is the way but that will never happen in India",
        "> Exactly. All we need to change our present situation is for some company like Jio to enter the market and create a large scale disruption of it. \n\nIt's easier to do that with airwaves than with EVs. You need physical space for charging for instance, and you need time for charging. Both of those are physical constraints that don't exist with 4G. \n\n\n> But one thing in my opinion is that if you do not have a proper parking space, then don't buy a car. Get a two wheeler\n\nThat might be your opinion, but people are going to ignore that if they want and can afford a car. \n\n\n> At frequent intervals, like every 100km or so, have a building with a lot of charging facility as \"wayside amenities\". People will stop there to take some rest and have a chai. Their vehicle will get charged by that time. \n\nThat's what I thought as well. Turns out, reality is different. You need land because cars need a lot of time to charge. You also need power supply - I encountered several chargers not working because it was raining. Apparently, our country has developed a miraculous technology that shuts down all power supply the moment a few drops fall from the sky. Chai-time isn't sufficient for charging because if you drive a Tata (market leaders in India), anything less than 100% and you're risking a sudden charge drop while driving. Yes, the manual will tell you that you only need 100% once in four charges but my practical experience is otherwise. \n\n\n> We need to fix these issues and there's a lot of potential for it in the future.\n\nWell yes, there is potential. But given the state of EV infra in India, my next car won't be an EV and I won't recommend anybody buy one.",
        "Gas powered cars are polluting as well, just not much. CNG is for poor people apparently, so there’s a whole stigma around it. \nHydrogen powered vehicles are super expensive and require hydrogen pump network, on top of that, you still need to waste electricity to produce hydrogen and the energy conversion efficiency is not great which is why the entire concept failed everywhere in the world.  \n\nEVs are the only possible alternative to petroleum cars.",
        "Safer infrastructure for pedestrians and cyclists too.",
        "There will soon be a jugaad option to just use an anchor to connect to power lines and charge your car. No need for charging stations XD",
        "We are just turning into a shit America",
        "I meant it in the context of what Gadkari may have meant. Frankly, I’d take any of these over petroleum based cars but I guess as battery tech evolves, we’ll know more about possibilities and limitations with EVs.",
        "Ah got it! IMO it’s entirely possible that the government will put all efforts behind Hydrogen powered vehicles and still fail to get mass adoption (unless they pull another demonetisation like move).",
        "Yeah this will take the next 100 years",
        "Yeah, I’ll be curious to see how it works out with demonetization like move with vehicles. It’ll cause mass hysteria and so they will have to build a major infrastructure and have some level of adoption before pulling something like that.\n\nWe’re yet to catch up with China wrt production assembly of EVs and still have to import too much to be self-reliant yet!",
        "I am glad somebody said this. Public transport is all we need. EV buses fleet, metro connectivity, and public cycles/e-cycles is all we need. It will also be beneficial for traffic.",
        "Diesel buses are fine. Cost 4 times less. Less maintenance issues. Don't catch fire.\n\nHaving extra buses gets more people out their personal vehicles which in turns reduces carbon emissions a lot more than a single ev can.\n\nNo need for rare minerals either.",
        "Toyota invested heavily into hydrogen which completely screwed them when the industry went into ev’s.",
        "Try cycling in the summer bro",
        "I said trams and bike lanes",
        "> Or have less cars\n\nHoorah for more walkable cities!",
        "Has no fuel cars worked in any country? Not even the first world. What utopia are these ministers living in?",
        "Every city should aim to be like Amsterdam",
        "Was looking for this comment EV is not a solution, it won't solve traffic and overcrowdedness and minimally helps the environment at best, we're slowly becoming America but without the road infra",
        "Adani into lithium business.",
        "Which one of his friends is making ev cars that are going to run for 1000 km on a charge",
        "They just like the aesthetic of progress. It's obvious EVs won't make a difference but people are impressed by them so that's what they'll go for.",
        "haha nuclear car go brr with 70 grams fuel for many years.",
        "Yes, that is also feasible.",
        "https://preview.redd.it/o42pcj56v3sc1.jpeg?width=1170&format=pjpg&auto=webp&s=86836d4b41f3352c55d6789a000707e88c669686\n\nLooks pretty good to me",
        "Why not just tell us what stock to purchase, than play riddles. \n\nReality check \n\n1)Ev infra is very very poor in india \n2)Liquid State lithium batteries don't have long range.  Toyota is testing solid state batteries and might come up with a model next year with a range of 1200-1500 km per charge. \n3) EV with longer battery range will cost a bomb so mass market will stay out of it. \n4) This is the first generation of EV car buyers in india. We should know there is absolutely no resale value of EV , just scrap value. \n\nConclusion \n\n1)Sounds like an election promise. \n2) May be talking about 2040 .",
        "What senseless statements and moves by this govt, transport min doesn't knw much abt it udhr fin minister doesn't knw shit aur ek bhai sirf muh se gobar nikal rahe hai aise kese chalega",
        "This is fucking stupid.",
        "NJB fans here 🫡",
        "They're going in a different direction. They're following the US model which is good for economy and commercial goods transportation but not for the average commuter. Public transport is the way go to. Relying on  cars only for transportation dependent sucks big time.",
        "Cargo rail is far more efficient than trucks. Tbf they are building a few corridors for that but we need more",
        "Are the trams air-conditioned? I specifically rebuked your point about cycle lanes, is there much of a point in making them in areas which are excruciatingly hot?",
        "While more than 50% of the power is coming from thermal plants 🤦‍♂️",
        "JhatuKari",
        "Google average distance between these and those of petrol pumps. Then also consider the fact that fast chargers still take upwards of 30 minutes to charge.. Then think of the length of the lines that will be there because of these two.",
        "Chapris on Ather doesn't sound much better",
        "politicians are in the business of making promises. This is election season and politicians are making promises left and right. I am not defending anybody, i am just stating the facts.   \nRegardless, full EV coverage of india is a goal i would like to see fulfilled in my lifetime. It helps that there are politicians who are speaking/dreaming of such a reality. There are only a few ministers who try out new ideas/strategies even if they are outlandish as fuck and gatkari is one of them. Is he stupid, i dont think so. Bro has been maintaining successful businesses and is a national politician.   \nIt is infact YOU, who is stupid. Have a nice day.",
        "It will improve AQI of major cities. A lot of electricity right now is produced through coal, but renewables are steadily increasing and it's only going to get better.\n\nA push towards EV has improved air quality in China massively.",
        "At a time when the US reexting the battery-powered cars, India is looking to invest in it. Even Merc have said no more electric cars! \n\nIndia is made for electric cars, many many functional impossiblities. First of them is charging:\nImagine just 5,000 tourist cars going to Manali.\n\nHow will scale the steep elevations?\nHow many will be able to reach Manali?\nWhere would they recharge on the way, (Remember all the local cars would also be getting recharged)\n\nAnd even if they reach Manali, where are they gonna recharge so many cars?\nAnd if there's snow do you think the cars would be able to move?",
        "Another bold statement..",
        "Only if onboarding cost is less",
        "Why ?",
        "yeah trams are air conditioned. and about the other thing, you seriously think most people in this country travel in a car? This is a third world country and most people can't afford cars. The primary mode of transport for the majority is already Motorbikes or Scooters (even in areas which are excruciatingly hot). Bike lanes are just supposed to complement the trams by providing an easy access to the tram stops. On top of that, cars ARE a part of the reason already excruciatingly hot areas keep getting hotter and hotter.",
        "I agree that public infrastructure needs to be improved, but I won't say I am a fan of Not Just Bikes. That guy thinks Americans should move out of their country just because of cycling and public transport infrastructure.",
        "Crude oil is our biggest import item. If we start replacing cars, we will have a trade surplus. That will be huge. \n\nChina has made it it's mission make EVs mainstream. China too imports a LOT of crude. They are adding solar capacities like crazy. \n\nThe more china pushes this, the cheaper crude gets, and when we start importing less, crude will cost even less. \n\nAcche din are coming.",
        "Nah this man will do it",
        "Well he's definitely too far but being that far is a result of how cities are designed. I live in Calgary, Canada and the car dependency is horrendous here. My work location is 28km from my home and it takes me 35 minutes to drive in peak hours and via public transport it takes 1h20m which is quite bad. Any amount of change can never bring that travel time down via public transport because you can't demolish places and remake them. A new train line is being constructed in my side of the city and people are opposing it big time while the province shelled out $2B for road infra maintenance. It's almost impossible to change people's minds as well.",
        "Based on past record, not going to happen soon..",
        "To make it happen, you have to remove taxes.",
        "But then you'll increase electricity charges.."
    ],
    "cleaned_text": "petrol diesel vehicles india gadkari vows eliminate fuel cars one hundred per cent union minister road transport highways said asked whether possible india get rid petrol diesel cars altogether ",
    "cleaned_title": "petrol diesel vehicles india gadkari vows eliminate fuel cars",
    "cleaned_selftext": "one hundred per cent union minister road transport highways said asked whether possible india get rid petrol diesel cars altogether",
    "cleaned_comments": "obligatory muh se mungfali toot nahi rahi jai adani tax payers protest level idiocy makes us buy vehicles pay tax pay tax use say money invested useless nice gandkari inevitable need coerce people adapt right policies establish needed infrastructure market forces take care rest people get leaders deserve unfortunately masses like lie sold evs always zero emissions one hundred per cent gadkari union minister road transport highways said asked whether possible india get rid petrol diesel cars altogether yes india near future ev leaders like norway read article cares zero emissions people care fuel charges low ev yeah ghanta listen ev future guys know amount pollution ev even hits road joking market forces really climate catastrophe market driven adapt right policies yes dont expect fucking carbon tax slight slap wrist fix things news imports china rise hold horses bro said right sequence policy infra adoption driven market forces tell us bro isnt majority electric needs still happening due burning fossil fuels rare minerals mined majorly single country exactly anything trams bike lanes ffs govt get lots taxes fuel everyone adapts ev bet levy taxes ev charging whats needed active industrial policy india market forces boil adani todays garibi hatao wont happen government relies heavily taxes fossil fuels give kid lights office went genset power hahahaha tax public charging infra sure financier must make returns investments eliminate private cars altogether invest public transportation need ever tata power stock gand se akhrot todne ki batein krta hai replace electric cars long battery mobile phones last logic led lot todays social economic environmental crisis massive inequalities learn read sarcasm internet bro dont let nri status ruin spidy sense ahhhhh hahaha bad folly wrong order priority many rural cities still regular power cuts especially summer isnt enough power generation capacity point electric car reduce tail emission based cleaner electricity far case electricity india comes coal renewable improving infrastructure rapid car charging looked plugshare kwh chargerthere new delhi gadkari ka pakka kisi ev auto ancillary mei passive investment hai point plz fill questionnaire regarding consumer perception evs college project correction india enough power generation capacity problem transportation distribution power power surplous country imagine amount jobs loose decision ev forced government decided market forces nithin gadakari good minister bjp congress anti capitalist socialist attitude doesnt respect free markets consumer choices dont want car subscription running like netflix sorry diesel petrol cars still preferred still better current alternatives cities full traffic evs brainer dont really care mr gadkari saying hate people say evs emissions yes dumbass got start somewhere dont go dont criticizw technology bring car go vroom abey gaddhe road aur vehicles ka itna tax lete ho uska kuch kaam kar na politicians stupid think stupid youre absolutely right sustainable move forward robust extremely well maintained public transport system good buses metros trains etc top improving roads mudizi cant take credit na sure isnt specif talking evhydrogen pet project hope succeeds paving way tesla way taxing middle class hope people purchase evs manufacture ev battery must process pounds brine lithium pounds ore cobalt pounds ore nickel pounds ore copperdigging pounds earths crustfor one battery got google think says due weight cause times particle pollution normal vehicles toyota study called study ev car production equals plug hybrids hybrids ev stupid really arrey actually simple going back bullock cart days gareebon ko pvt cars ev commercial vehicles cng trucks carry diesel guess india big market ev complement population instance pilot project us ev connected grid used load shedding imagine youre rural area car connected charger also solar panels electricity load shedding car works inverter powers home know range issue ev however mostly extremely cold new charging tech charge vehicles mins done thanks man mean project place money goes scania bus got gift run batteries bold assume taxes levied ev vechicles could well charging tax applied later stage pay whenever charge thats worst decision could make india growing need fuel efficient vehicles also need long range vehicles ev wont able provide solution yes sort things ensure major highways blocked india nice lets start government vehicles plans move away electricity generated consuming fossil fuel people said excuses digital payments well whats situation start implementing things cities quickly develop across india wait every shop stick qr codes started using upi numbers grow situation also improve cant build entire car charging infrastructure one day evs get popular soon get better far second point considered still better importing oil middle east russia transition taking place switch nuclear power building around nuclear plants first point actually excess power distribution thats problem get lot nuclear power plants running within next years switch thermal power plants backup mode every summer start operating provide extra boost meet demand completely switch nuclear power foreign exchange also big headache government less petroleum import means saving foreign exchange export economy naturally develop like exporting economies world less need government stimulate economy public spending hence needing less taxes tesla isnt affordable masses tata good though power surplus country many people poor afford ac electrical devices industrialization requires powerhungry machines lacking generate less electricity china hydrogen worst technology venture go figure corruptkari electric vehicles wont succeed unless good charging infra prioritizing focusing vehicles add distance tax worst think since india thats pehele isko hatana buddha aaj kal bohut bolne laga would like see moron banning fuel cars non sensical guy great decision india already found deposits lithium battery manufacturing find enough renewable nuclear energy sources eliminate coal plants today yes ev continue improve faster rate combustion engines way ahead subscription running business problem tech problem change easily done compared petrol pumps building infra electric comparatively easy even people owns land roadsides provide facilities car charging future motor whine replaces vroom exactly might mean zero emissions theyll defined huge effect aqi many major cities energy come though dude enough power generation capacity needs unless fault correct thing improve people able afford ac another matter current point time power surplus demand increases power generatin capacity also increase updated core structure trucks past years sure india depending coal explore sources already building couple nuclear reactors sources far knowif hydrogen catching fire plus affordable synthesis figured outwe hydrogen abundance whatever policy drafted government ban subscription based driving features cars future otherwise theres point switching electric also since democracy people still able use gasoline cars long pay carbon tax haha nice important prioritize things necessary society regulations democratic free market done harm good gadakari good seems largescale propaganda hes corrupt anyone bhai mere plate khana thodi dal ke de raha wo jo respect kru part crowd like billion people earth lol shouldnt democracy doesnt mean get actively harm environment better alternative present like saying people allowed commit murder long theyre willing go jail lol using petrol cars equivalent murder wow wokeness high one explicitly mentions defined timeline ban petrol diesel vehicles ultimate goal greener india initiative didnt read article get award completely missing point jhumla haiwe competitive move zero petrol also part corrupt gobermint sangh parivaar dont believe word says tu kar humein nai karna helping paagal hogaya hai ye aadmi environmental cost batteries bad limit number cars roads sale cars bring back odd even push towards hybrid cars public transport think need less rickshaws autorickshaw cars road lots busses metro connectivity also nighttime availability public transport eventually market forces dont exist even petrol think govt control price petrol means free market improve public transport last thing need cars bro respects waiters regarding conducting survey consumer perception evs college project policy wont implemented adani ambani sells fossil fuel based business easy make big claims digital payments way easier everyone mobile jio made data cheap infra problem govt also removed transaction charges making attractive ev charging way difficult need charging available vehicles country people struggle find parking space vehicles charging park major logistical nightmare putting fast chargers everywhere also difficult first grid needs support higher wattage second even evs take way longer charge ice takes refuel even magical tech makes charging quicker itll still need even higher wattage charging equipment grids cant tech way laws physics theres highway someone whos driven times highways nightmare time poor charging infrastructure charge points breaking power due rains compatibility issues software issues etc know stock answer plan trips thats basically code tech isnt mature best laid plans backups charge point still work distribution probably biggest issue real id se aajao sanju idhar waise bhi acchi gaadiyaan nahi milti high af taxes holi ki bhaang abhi utri nagi lagta hai ohh really luck mera ghar ke bahar gu hai kab hatega ev india develop ril adhani gets seriously race reliance roll swappable batteries electric vehicles adhani power already big ofc good charging infra uprooted stolen union minister road transport highways first vow fix damn roads aint driving tesla moons surface lol one biggest issues cities congested af takes good minutes cars charge around fast chargers ports come many stations per center get security guards x petrol pumps unmanned machines would get stolen india including petrol diesel totally unrelated news adani opens new ev factory gujarat happened flex fuels bio fuels apparently solution problems last year good point sasti gadi vroom motor whine achi gadi vroom yes tarpaulin sheets put poles youre good go thats nice produce enough electricity point vroom vroom especially india high af taxes high af potholes high af traffic jam high af brain dead tharcreta owners road pehle road sahi karo yaar infra ev charging guy go enough stupidityanother guy messiah complex thank first fix damn city roads highways man bangalore contemplating buy tractor first car ill optimistic side say might possible people said upi security guards jobs well much better less chhapris bullet theyre want end oil imports use domestic coal power cars also cronyism bc log iss bhi fault finding karna start ka dengebc atleast koi cabinate ministry kuch kaam kar rha always ask generate electricity ev saves environment guys one answers think electricity generated air mean evs alternative petroleum based cars cnglng hydrogen based vehicles etc lets see parhaps might removed ministry upcoming term everyone mobile jio made data cheap exactly need change present situation company like jio enter market create large scale disruption far things mention fair criticism one thing opinion proper parking space dont buy car get two wheeler dont cause inconvenience everyone blocking roads present highways actually best building electric car infrastructure frequent intervals like every km building lot charging facility wayside amenities people stop take rest chai vehicle get charged time ev technology still infant phases need fix issues theres lot potential future vehicles replaced evs city roads evs best especially two wheeler evs anything local shop ideal scenario using public transport trains mediumlong distance flights longextremely long distant journey bruh april st article thats goal needs backed enough power generation modern distribution systems even produce electricity required near electrification transportation well worse fossil fuel power plants need nuclear power complemented renewable energy capture way thats possible india make vehicles removable batteries queues petrol stations long right like mins less fill charging speeds atrocious current tech stacks yes sir much possible sir india power supply sir unbeatable charging infra sir sir quick charge times sir people bjp said thing upi digital india citing lack internet access accurate judgement bjpee plans fulfill energy requirements houses evs understand want cut crude oil dependency wth building nes want us use cars intracity travel also im much skeptical behind scenes lobbying tata mahindra mr gadkari ki gaand mein daal ke charge kar lunga bro ev hi chalaunga like byd think gross simplification scale issue countries like china europe superb power grids highway systems struggling implement high speed rapid chargers require resilient high load cabling electricity distribution example typical home might provided kw max load compare make bank rapid chargers lets say norm high end kw x stop need kw one location scale millions cars thousands locations countries europe superb highways struggling building capacity years electric cars europe still majority busy days queue tesla chargers like app works android phones modular cloud servers done yes done quickly ill surprised cars india electric realise issue get fuel petrol stations right electric anywhere house school college office market anywhere would actually result less stacking charging stations charging stations everywhere real issue generating enough electricity support doubts given many people still dont access hour electricity country yup still many people dont get hour electricity supply country never even imagine consumption vehicles electric first need enough electricity household infrastructures talk vehicles technically electricity generated transfer electrons done air solar etc many ways make electricity agree still enough electricity provide everyone hour supply country know renewable energy source wind solar less efficient depend coal electricity point people saying electricity vehicles save environment dont know electricity generated entirely true get much energy sources even inefficient provide enough real problem battery technology currently batteries made lithium mining lithium big issue environment plus people mining heavily exploited yes always pay price coal way worse mining also burning releases ton carbon atmosphere making air hotter oceans acidic combines gases air cause health effects arent getting point im speaking uncles say solar energy enough run entire world since getting hotter thanks pointing lithium made speech issues lithium extraction africa went extracting diamonds lithium new diamond extraction place new africa one cared kya yar puree hi maje le lete ho super bro imagined giong gon na fail got point im saying dont completely agree dont option sources way going forward fossil fuels cause pollution b completely used day sources energy especially sun sun send crazy amount energy towards earth used even small amount could enough world biggest nuclear reactor ever access extremely valid points electricity would main thing confidence long trips electric vehicles come either extremely fast charging removable batteries buying decisions india depend lot hope hes talking abt biofuels since daddies gifted mining rights lithium think going see massive push electric especially since said daddies already control coal mention way environment ravaged unprecedented scale coal lithium deafening silence media hasdeo forest sonam wangchuks climate fast foretells whats planned future forget bs diesel soon year old petrol bs become polluting biggest jumlebaaz yeah whats wrong comment stupid ministers make comments policy doesnt exist either policy stupid trying find safe exit clauses definitely defend asses power grid burning coal great success hope hes lying way never happen india exactly need change present situation company like jio enter market create large scale disruption easier airwaves evs need physical space charging instance need time charging physical constraints dont exist g one thing opinion proper parking space dont buy car get two wheeler might opinion people going ignore want afford car frequent intervals like every km building lot charging facility wayside amenities people stop take rest chai vehicle get charged time thats thought well turns reality different need land cars need lot time charge also need power supply encountered several chargers working raining apparently country developed miraculous technology shuts power supply moment drops fall sky chaitime isnt sufficient charging drive tata market leaders india anything less youre risking sudden charge drop driving yes manual tell need four charges practical experience otherwise need fix issues theres lot potential future well yes potential given state ev infra india next car wont ev wont recommend anybody buy one gas powered cars polluting well much cng poor people apparently theres whole stigma around hydrogen powered vehicles super expensive require hydrogen pump network top still need waste electricity produce hydrogen energy conversion efficiency great entire concept failed everywhere world evs possible alternative petroleum cars safer infrastructure pedestrians cyclists soon jugaad option use anchor connect power lines charge car need charging stations xd turning shit america meant context gadkari may meant frankly id take petroleum based cars guess battery tech evolves well know possibilities limitations evs ah got imo entirely possible government put efforts behind hydrogen powered vehicles still fail get mass adoption unless pull another demonetisation like move yeah take next years yeah ill curious see works demonetization like move vehicles itll cause mass hysteria build major infrastructure level adoption pulling something like yet catch china wrt production assembly evs still import much selfreliant yet glad somebody said public transport need ev buses fleet metro connectivity public cyclesecycles need also beneficial traffic diesel buses fine cost times less less maintenance issues dont catch fire extra buses gets people personal vehicles turns reduces carbon emissions lot single ev need rare minerals either toyota invested heavily hydrogen completely screwed industry went evs try cycling summer bro said trams bike lanes less cars hoorah walkable cities fuel cars worked country even first world utopia ministers living every city aim like amsterdam looking comment ev solution wont solve traffic overcrowdedness minimally helps environment best slowly becoming america without road infra adani lithium business one friends making ev cars going run km charge like aesthetic progress obvious evs wont make difference people impressed thats theyll go haha nuclear car go brr grams fuel many years yes also feasible looks pretty good tell us stock purchase play riddles reality check ev infra poor india liquid state lithium batteries dont long range toyota testing solid state batteries might come model next year range km per charge ev longer battery range cost bomb mass market stay first generation ev car buyers india know absolutely resale value ev scrap value conclusion sounds like election promise may talking senseless statements moves govt transport min doesnt knw much abt udhr fin minister doesnt knw shit aur ek bhai sirf muh se gobar nikal rahe hai aise kese chalega fucking stupid njb fans theyre going different direction theyre following us model good economy commercial goods transportation average commuter public transport way go relying cars transportation dependent sucks big time cargo rail far efficient trucks tbf building corridors need trams airconditioned specifically rebuked point cycle lanes much point making areas excruciatingly hot power coming thermal plants jhatukari google average distance petrol pumps also consider fact fast chargers still take upwards minutes charge think length lines two chapris ather doesnt sound much better politicians business making promises election season politicians making promises left right defending anybody stating facts regardless full ev coverage india goal would like see fulfilled lifetime helps politicians speakingdreaming reality ministers try new ideasstrategies even outlandish fuck gatkari one stupid dont think bro maintaining successful businesses national politician infact stupid nice day improve aqi major cities lot electricity right produced coal renewables steadily increasing going get better push towards ev improved air quality china massively time us reexting batterypowered cars india looking invest even merc said electric cars india made electric cars many many functional impossiblities first charging imagine tourist cars going manali scale steep elevations many able reach manali would recharge way remember local cars would also getting recharged even reach manali gon na recharge many cars theres snow think cars would able move another bold statement onboarding cost less yeah trams air conditioned thing seriously think people country travel car third world country people cant afford cars primary mode transport majority already motorbikes scooters even areas excruciatingly hot bike lanes supposed complement trams providing easy access tram stops top cars part reason already excruciatingly hot areas keep getting hotter hotter agree public infrastructure needs improved wont say fan bikes guy thinks americans move country cycling public transport infrastructure crude oil biggest import item start replacing cars trade surplus huge china made mission make evs mainstream china imports lot crude adding solar capacities like crazy china pushes cheaper crude gets start importing less crude cost even less acche din coming nah man well hes definitely far far result cities designed live calgary canada car dependency horrendous work location km home takes minutes drive peak hours via public transport takes hm quite bad amount change never bring travel time via public transport cant demolish places remake new train line constructed side city people opposing big time province shelled b road infra maintenance almost impossible change peoples minds well based past record going happen soon make happen remove taxes youll increase electricity charges",
    "light_cleaned_title": "No petrol, diesel vehicles in India: Gadkari vows to eliminate fuel cars",
    "light_cleaned_selftext": "\"One hundred per cent,\" the Union Minister for Road Transport and Highways said when asked whether it is possible for India to get rid of petrol and diesel cars altogether.",
    "light_cleaned_comments": "Obligatory, \" *Muh se mungfali toot nahi rahi* \"... 🤣 Jai Adani Tax payers should protest this level of idiocy. They makes us buy vehicles, pay tax, pay tax to use it, then say that all of your money that you invested in it is useless. Nice Gandkari. This is inevitable, no need to coerce people into it. Just adapt the right policies, establish the needed infrastructure and the market forces will take care of the rest. People get the leaders they deserve. Unfortunately the masses like this lie being sold that EVs are always zero emissions. > \"One hundred per cent,\" Gadkari, the Union Minister for Road Transport and Highways, said when asked whether it is possible for India to get rid of petrol and diesel cars altogether. Yes, but not in India and not in the near future for EV leaders like Norway. did you read the article ? Who cares about zero emissions people care about fuel charges which is very low on EV Yeah what about it? Ghanta he' ll listen EV is not the future. Do these guys know the amount of pollution 1 EV does even before it hits the road? Are you joking? Market forces, really? When our climate catastrophe is so market driven? Adapt right policies, yes, but don't expect a fucking carbon tax and a slight slap on the wrist to fix things. In other news imports from China rise by 500% Hold your horses bro! He said it in right sequence. Policy, infra, then adoption driven by market forces! Do tell us bro! Isn't majority of our electric needs still happening due to burning fossil fuels? And those rare minerals mined majorly from a single country? exactly! anything but trams and bike lanes ffs But govt get a lots of taxes from fuel, if everyone adapts to ev I bet they will levy taxes on ev charging What's needed is an active industrial policy. In India, \"market forces\" will boil down to just Adani. today's *garibi hatao* Won't happen. The government relies heavily on taxes from fossil fuels to give it up i kid you not - the lights in our office just went out! we are on genset power now, hahahaha They will tax public charging infra for sure. The financier must make returns on his investments. Eliminate private cars altogether. Invest in public transportation. We need it more than ever. Tata power stock 📈 gand se akhrot todne ki batein krta hai Replace them with what ? Electric cars ? How long does the battery in our mobile phones last ? This logic has led to a lot of today's social, economic, environmental crisis and massive inequalities. Learn to read the sarcasm on Internet bro! Don’t let NRI status ruin your spidy sense. Ahhhhh hahaha. My bad :)) This is folly and in wrong order of priority. 1. Many rural and cities still have regular power cuts especially in summer. There isn't enough power generation and capacity. 2. The point of electric car is to reduce tail emission, based on cleaner electricity. This far from the case as most electricity in India comes from Coal and not renewable but improving. 3. Where is the infrastructure for rapid car charging? I looked at plugshare for over 50 kWh charger...there were 11 for new Delhi! Gadkari ka pakka kisi ev auto ancillary mei passive investment hai On that point plz fill this questionnaire regarding consumer perception for EVs for my college project Just once correction. India has enough power generation and capacity - the problem is transportation and distribution of power. We are a power surplous country. Just imagine The amount of jobs we will loose because of this decision. EV should not be forced by the government. It should be decided by Market Forces. Nithin Gadakari is a good minister. But both BJP and Congress have an anti capitalist socialist attitude which doesn't respect free markets and consumer choices. I dont want my car subscription running out like Netflix. Sorry diesel and petrol cars are still preferred. They are still better than the current alternatives. For cities that are full of traffic, EVs are a no brainer. I don't really care about what Mr Gadkari is saying, but I hate people who say 'but EVs are not 0 emissions!!'. Yes dumbass, but you got to start somewhere. You don't go to 0 from a 100 but don't criticizw when technology can bring it to 50. So car no go vroom 🥲 Abey gaddhe… road aur vehicles ka itna tax lete ho uska kuch kaam kar na? Why are these politicians so stupid? Why do they think we are so stupid? You’re absolutely right. The most sustainable move forward is a to have a robust and extremely well maintained public transport system. Good buses, metros, trains, etc. On top of that improving the roads too. But Mudizi can't take the credit na? Not sure but he isnt specif talking about ev…hydrogen too is his pet project (I hope it succeeds) And paving the way for Tesla The way they are taxing the middle class, how do they hope for people to purchase EVs? To manufacture each EV battery, you must process 25,000 pounds of brine for the lithium 30,000 pounds of ore for the cobalt 5,000 pounds of ore for the nickel, 25,000 pounds of ore for copper.Digging up 500,000 pounds of the earth's crust..For just - one - battery. This I got off google. I think it says due to their weight they cause 1850 times more particle pollution than normal vehicles. Toyota did a study called the 1-6-90 study. 1 EV car production equals 6 plug in Hybrids or 90 Hybrids. EV is stupid really. Arrey its actually simple... we all going back to bullock cart days. Gareebon ko* All pvt cars EV , all commercial vehicles CNG. Trucks carry on with Diesel i guess. India is a big market and EV can complement the population. For instance, there is a pilot project in US where all EV connected to grid can be used for load shedding. Imagine you’re in rural area, your car is connected to charger. you also have solar panels, if there is no electricity because of load shedding then the car works as an inverter and powers your home. I know range is an issue with most EV ,however its mostly in extremely cold and new charging tech can charge vehicles in 15 mins. Done Thanks man You mean 'पेट' project? Place where all the money goes? Does the Scania bus he got as gift run on batteries? Bold of you to assume taxes will not be levied on EV vechicles. There could very well be a 'charging' tax applied at a later stage. So you pay whenever you charge. That’s the worst decision they could make. India is growing, we need fuel efficient vehicles but we also need long range vehicles which EV won’t be able to provide the solution for. Yes. Those sort of things will ensure all major highways are blocked in India. Nice, lets start with government vehicles!! But no plans to move away from electricity generated by consuming fossil fuel? People said excuses against digital payments as well. Now what's the situation of it? If we can start implementing these things in cities, it will quickly develop all across India. Did we wait for every shop to stick qr codes before we started using UPI? As the numbers grow, the situation will also improve. We can't build the entire car charging infrastructure in one day. As the EVs get more and more popular, it will soon get better. As far as the second point is considered, it's still better than importing oil from middle east and russia. While that transition is taking place, we can switch to Nuclear power (and we are building around 10 nuclear plants now). For the first point, we actually have excess power. It's the distribution that's the problem. If we can get a lot more nuclear power plants running within the next 2-3 years, we can switch all the thermal power plants into backup mode. Every summer, they should start operating to provide an extra boost so that we can meet our demand, until we can completely switch over to nuclear power. Foreign exchange is also a big headache for the government. Less petroleum import means more saving of foreign exchange. When we export more, the economy will naturally develop just like other exporting economies all over the world. There will be less need for government to stimulate the economy through public spending and hence needing less in taxes. Tesla isn't affordable for the masses. Tata is doing good though We are a power surplus country because many people are too poor to afford AC and other electrical devices and our industrialization which requires power-hungry machines is lacking. We generate less than 1/5 of the electricity of China. Hydrogen is the worst technology to venture into. Go figure. Corruptkari Electric vehicles won't succeed unless we have good charging infra. They are not prioritizing it. Just focusing on vehicles. They will add distance tax. This is the worst I can think of. And since it's India, that's what they will do. Pehele isko hatana... buddha aaj kal bohut bolne laga I would like to see this moron banning fuel cars... Most non sensical guy. Great decision. India has already found deposits of lithium for the battery manufacturing. Now if we can find enough renewable and nuclear energy sources, we can eliminate the coal plants too. Today yes. But EV will continue to improve at a faster rate than combustion engines. It’s the only way ahead. And subscription running out is a business problem not a tech problem. But this change can be easily done. Compared to petrol pumps, building infra for electric is comparatively easy. Even the people who owns some land in the roadsides can provide facilities for 2-3 car charging in future. Motor whine replaces vroom. Exactly , they might not mean zero emissions but they’ll defined have a huge effect on the AQI of many major cities. Where does energy come from though? Dude no. We have enough power generation capacity for all these needs. Unless you fault the correct thing, how will we improve? People not being able to afford AC is another matter. At the current point in time, we are power surplus. As demand increases, power generatin capacity will also increase. We have not updated core structure of our trucks in the past 30-40 years. But sure India is now depending on coal. We have to explore other sources. We are already building couple more nuclear reactors and other sources. How? as far as I know…if hydrogen catching fire plus affordable synthesis is figured out,we have hydrogen in abundance. Whatever. Policy is drafted by government. They can ban subscription based driving features for cars in future. Otherwise there's no point in switching to Electric. Also, since it's a democracy, people should still be able to use gasoline cars, as long as we pay the carbon tax. Haha nice 😂😂 It's important to prioritize things necessary for society, these regulations are democratic. \"Free\" market has only done more harm than good. This gadakari = good, seems to be some largescale propaganda, he's just as corrupt as anyone. bhai mere plate me khana thodi dal ke de raha wo jo respect kru. For me he is a part of crowd same like 7 billion people on this earth lol no they shouldn’t, democracy doesn’t mean you get to actively harm the environment when a better alternative is present. It’s like saying people should be allowed to commit murder as long as they’re willing to go to jail for it. Lol using petrol cars is equivalent to murder? Wow. The wokeness is high in this one He explicitly mentions that there is no defined timeline to ban petrol and diesel vehicles. But its the ultimate goal for a greener india initiative. You didnt read the article. You get an award for completely the missing the point. Jhumla hai....we will not be competitive if we move to zero petrol. He is also part of the corrupt gobermint and sangh parivaar so I don't believe a word he says! Tu kar, humein nai karna. Who is this helping? Paagal hogaya hai ye aadmi. The environmental cost of batteries is just as bad. How about we limit the number of cars on the roads and sale of cars, bring back odd even, push towards hybrid cars more and more public transport. I think we need less rickshaws and autorickshaw and cars on the road and lots more busses and metro connectivity. and also nighttime availability of public transport eventually. Market forces don't exist even for petrol. What do you think govt control over the price of petrol means, a free market? Just improve public transport. The last thing we need is more cars Bro respects waiters Regarding this, i am conducting a survey on consumer perception of EVs as my college project This policy won't be implemented until Adani and Ambani sells of their fossil fuel based business. It is easy to make big claims. Digital payments were way easier. Everyone had a mobile and Jio had made data cheap. So infra was not a problem. The govt also removed transaction charges, making it attractive. EV charging is way more difficult. You need charging to be available for vehicles. In a country where most people struggle to find parking space for their vehicles, charging where they park is a major logistical nightmare. Putting fast chargers everywhere is also difficult: first, your grid needs to support the higher wattage and second even if it does, EVs take way longer to charge than an ICE takes to refuel. Even if some magical tech makes charging quicker, it'll still need even higher wattage charging equipment and grids. You can't tech your way out of the laws of physics. Then there's the highway. As someone who's driven a few times on highways, it's been a nightmare each time. Poor charging infrastructure, charge points breaking down or not having power due to rains, compatibility issues, software issues etc. I know the stock answer is \"plan your trips\", but that's basically code for \"the tech isn't mature\". And the best laid plans with 2 backups for each charge point can still not work. Distribution is probably the biggest issue. real id se aajao Sanju Idhar waise bhi acchi gaadiyaan nahi milti because of the high af taxes. Holi ki bhaang abhi utri nagi lagta hai \"ohh really? what luck! Mera ghar ke bahar gu hai, kab hatega?\" 🤣🤣 EV in india can develop only if RIL or Adhani gets seriously into race >!(Reliance to roll out swappable batteries for electric vehicles, Adhani Power is already big ofc ....)!< Good charging infra that cannot be uprooted and stolen. The Union Minister for Road Transport & Highways should first vow to fix the damn roads. I ain't driving a Tesla on the moon's surface lol One of our biggest issues is that our cities are congested af. It takes a good 20 minutes for cars to charge around 75% with the fast chargers. Where will these ports come up? How many stations per center? Just get security guards 24x7. If petrol pumps were unmanned, those machines and too would get stolen in India including the petrol and diesel. In totally unrelated news: Adani opens new EV factory in Gujarat What happened to flex fuels and bio fuels which were apparently the solution to all our problems just last year? good point. sasti gadi vroom <<< motor whine <<< achi gadi vroom Yes tarpaulin sheets will do, just put some poles and you’re good to go That's nice if we can produce enough electricity There is no point in vroom vroom especially in india. High af taxes, high af potholes, high af traffic jam. High af brain dead thar/creta owners on road. Pehle road sahi karo yaar. And where is the infra for EV charging. this guy has to go too!.... enough of his stupidity!..another guy with MESSIAH complex! Thank you First fix the damn city roads and then highways man! in Bangalore I am contemplating if I should buy a Tractor as my first car! Ill be on the optimistic side and say that it might be possible. People said the same about UPI once Security guards = more jobs as well ... So Much better, less chhapris on bullet This They're doing this because they want to end oil imports and use domestic coal to power cars. Also, cronyism. BC log iss me bhi fault finding karna start ka denge..BC atleast koi to cabinate ministry me kuch kaam kar rha he I always ask how do you generate electricity to EV saves environment guys, but no one answers. They think electricity is generated from air I mean, EVs are not the only alternative to petroleum based cars. You have CNG/LNG, Hydrogen based vehicles etc. So, let’s see! Parhaps he might be removed from the ministry in upcoming term! >Everyone had a mobile and Jio had made data cheap Exactly. All we need to change our present situation is for some company like Jio to enter the market and create a large scale disruption of it. As far as the other things you mention, it's fair criticism. But one thing in my opinion is that if you do not have a proper parking space, then don't buy a car. Get a two wheeler. Don't cause inconvenience to everyone by blocking the roads. Our present highways are actually the best for building electric car infrastructure. At frequent intervals, like every 100km or so, have a building with a lot of charging facility as \"wayside amenities\". People will stop there to take some rest and have a chai. Their vehicle will get charged by that time. The EV technology is still in it's infant phases. We need to fix these issues and there's a lot of potential for it in the future. Not all vehicles can be replaced by EV's but for the city roads, EVs are the best. Especially the two wheeler EVs. For anything further than your local shop, in an ideal scenario, we should be using public transport. Trains for medium-long distance and flights for long-extremely long distant journey. Bruh it's April 1st article That's the goal but it needs to be backed by enough power generation and modern distribution systems. Even if we produce the electricity required for a near 100% electrification of transportation we'll be worse off with fossil fuel power plants. We need nuclear power complemented by renewable energy capture. The only way that's possible in India is to make vehicles with removable batteries. Queues at petrol stations can be long right now with like 5 mins or less to fill up, charging speeds are atrocious with current tech stacks. yes sir, very much possible sir. India 24/7 power supply sir. Unbeatable charging infra sir. Sir, quick charge times sir. People? BJP said the same thing about UPI and digital India, citing lack of internet access. Which was an accurate judgement. Now, how does BJ-Pee plans to fulfill energy requirements for houses, EVs? I understand they want to cut down on crude oil dependency, but wth are they building these NEs for? If all they want us to use our cars for is intra-city travel? Also, I'm very much skeptical about behind the scenes lobbying by Tata and Mahindra. Mr. Gadkari ki gaand mein daal ke charge kar lunga bro, but EV hi chalaunga More like BYD I think this is a gross simplification of the scale of the issue. Countries like China and most of Europe which have superb power grids and highway systems are struggling to implement high speed rapid chargers. These require resilient very high load cabling and electricity distribution. For example a typical home might be provided with 10 kW max load.... Compare to make a bank of rapid chargers (let's say the norm high end is 250 kW X 10 at a stop) ...you need 2500 kW in one location. Now scale this up for millions of cars and thousands of locations. Countries in Europe with superb highways have been struggling with building capacity for years, and electric cars in most of Europe are still not a majority. On busy days there is a queue at the Tesla chargers. This is not like an app that works on most android phones and modular cloud servers. Can it be done, yes. Will it be done quickly. No. I'll be surprised if 25% cars in India are electric by 2050. You do realise that the issue is there because you can only get fuel from petrol stations right now. And if it is electric it can be anywhere. In your house, school, college, office, market. Anywhere. So that would actually result in less stacking at charging stations because you can have more charging stations and everywhere. The real issue is generating enough electricity to support that. I have doubts about that given how many people still don't have access to 24 hour electricity in this country. Yup. There are still so many people who don't get 24 hour electricity supply in this country and we can never even imagine the consumption if all vehicles are electric. We first need to have enough electricity for household and infrastructures before we can talk about vehicles. Technically it is. Electricity is generated by transfer of electrons which can be done through air, solar, etc. Many ways to make electricity but I do agree with you. We still do not have enough electricity to provide everyone with 24 hour supply in this country. I know renewable energy can be a source, but both wind and Solar are very less efficient. We have to depend on coal for electricity. My point is that people saying electricity vehicles can save the environment don't know how electricity is generated Not entirely true. We get so much energy from these sources that even when they are inefficient they can provide enough. The real problem is the battery technology. Currently all batteries are made with lithium and mining lithium is a big issue on the environment. Plus the people mining it are heavily exploited. So yes we always have to pay a price but coal is way worse. Because not only are you mining it, you are also burning it which releases a ton of carbon into the atmosphere. Making the air hotter, oceans acidic and when it combines with other gases in the air it can cause health effects. You aren't getting my point. I'm speaking about uncles who say Solar energy is enough to run entire world since it's getting hotter. Thanks for pointing about Lithium I once made a speech about issues in Lithium extraction and how it's same as what Africa went through while extracting Diamonds and why Lithium is the new diamond and it's extraction place is new Africa but no one cared Kya yar puree hi maje le lete ho, super bro I imagined how is giong to do that but gonna fail No no I got your point. I'm only saying I don't completely agree with it because we don't have any other option. Those sources are the only way going forward. All fossil fuels will a) cause pollution and b) be completely used some day. Then only these sources of energy will be there. Especially our Sun. Our sun does send a crazy amount of energy towards earth and if we used even a small amount we could have enough for the world. It's the biggest nuclear reactor we can ever have access to. Extremely valid points. Electricity would be the main thing. Confidence in long trips with electric vehicles will come with either extremely fast charging or removable batteries. Buying decisions in India depend a lot on it. I hope he's talking abt Biofuels . But since his daddies are being gifted the mining rights to lithium i think we are going to see a massive push to electric . Especially since the said daddies already have control of coal . Not to mention the way our environment is being ravaged at an unprecedented scale for coal and lithium . The deafening silence by the media on hasdeo forest and sonam wangchuk's climate fast just foretells what's planned for the future. Forget BS4 and diesel , Soon your 10 year old petrol BS6 will become too polluting biggest jumlebaaz! Yeah, so what's wrong with my comment? It's stupid for ministers to make comments on policy that doesn't exist. Either the policy is stupid or he is. Or both are. And by trying to find him safe exit clauses you definitely are. Why defend asses? How will you power the grid ? By burning coal. Great success i hope hes lying This is the way but that will never happen in India > Exactly. All we need to change our present situation is for some company like Jio to enter the market and create a large scale disruption of it. It's easier to do that with airwaves than with EVs. You need physical space for charging for instance, and you need time for charging. Both of those are physical constraints that don't exist with 4G. > But one thing in my opinion is that if you do not have a proper parking space, then don't buy a car. Get a two wheeler That might be your opinion, but people are going to ignore that if they want and can afford a car. > At frequent intervals, like every 100km or so, have a building with a lot of charging facility as \"wayside amenities\". People will stop there to take some rest and have a chai. Their vehicle will get charged by that time. That's what I thought as well. Turns out, reality is different. You need land because cars need a lot of time to charge. You also need power supply - I encountered several chargers not working because it was raining. Apparently, our country has developed a miraculous technology that shuts down all power supply the moment a few drops fall from the sky. Chai-time isn't sufficient for charging because if you drive a Tata (market leaders in India), anything less than 100% and you're risking a sudden charge drop while driving. Yes, the manual will tell you that you only need 100% once in four charges but my practical experience is otherwise. > We need to fix these issues and there's a lot of potential for it in the future. Well yes, there is potential. But given the state of EV infra in India, my next car won't be an EV and I won't recommend anybody buy one. Gas powered cars are polluting as well, just not much. CNG is for poor people apparently, so there’s a whole stigma around it. Hydrogen powered vehicles are super expensive and require hydrogen pump network, on top of that, you still need to waste electricity to produce hydrogen and the energy conversion efficiency is not great which is why the entire concept failed everywhere in the world. EVs are the only possible alternative to petroleum cars. Safer infrastructure for pedestrians and cyclists too. There will soon be a jugaad option to just use an anchor to connect to power lines and charge your car. No need for charging stations XD We are just turning into a shit America I meant it in the context of what Gadkari may have meant. Frankly, I’d take any of these over petroleum based cars but I guess as battery tech evolves, we’ll know more about possibilities and limitations with EVs. Ah got it! IMO it’s entirely possible that the government will put all efforts behind Hydrogen powered vehicles and still fail to get mass adoption (unless they pull another demonetisation like move). Yeah this will take the next 100 years Yeah, I’ll be curious to see how it works out with demonetization like move with vehicles. It’ll cause mass hysteria and so they will have to build a major infrastructure and have some level of adoption before pulling something like that. We’re yet to catch up with China wrt production assembly of EVs and still have to import too much to be self-reliant yet! I am glad somebody said this. Public transport is all we need. EV buses fleet, metro connectivity, and public cycles/e-cycles is all we need. It will also be beneficial for traffic. Diesel buses are fine. Cost 4 times less. Less maintenance issues. Don't catch fire. Having extra buses gets more people out their personal vehicles which in turns reduces carbon emissions a lot more than a single ev can. No need for rare minerals either. Toyota invested heavily into hydrogen which completely screwed them when the industry went into ev’s. Try cycling in the summer bro I said trams and bike lanes > Or have less cars Hoorah for more walkable cities! Has no fuel cars worked in any country? Not even the first world. What utopia are these ministers living in? Every city should aim to be like Amsterdam Was looking for this comment EV is not a solution, it won't solve traffic and overcrowdedness and minimally helps the environment at best, we're slowly becoming America but without the road infra Adani into lithium business. Which one of his friends is making ev cars that are going to run for 1000 km on a charge They just like the aesthetic of progress. It's obvious EVs won't make a difference but people are impressed by them so that's what they'll go for. haha nuclear car go brr with 70 grams fuel for many years. Yes, that is also feasible. Looks pretty good to me Why not just tell us what stock to purchase, than play riddles. Reality check 1)Ev infra is very very poor in india 2)Liquid State lithium batteries don't have long range. Toyota is testing solid state batteries and might come up with a model next year with a range of 1200-1500 km per charge. 3) EV with longer battery range will cost a bomb so mass market will stay out of it. 4) This is the first generation of EV car buyers in india. We should know there is absolutely no resale value of EV , just scrap value. Conclusion 1)Sounds like an election promise. 2) May be talking about 2040 . What senseless statements and moves by this govt, transport min doesn't knw much abt it udhr fin minister doesn't knw shit aur ek bhai sirf muh se gobar nikal rahe hai aise kese chalega This is fucking stupid. NJB fans here 🫡 They're going in a different direction. They're following the US model which is good for economy and commercial goods transportation but not for the average commuter. Public transport is the way go to. Relying on cars only for transportation dependent sucks big time. Cargo rail is far more efficient than trucks. Tbf they are building a few corridors for that but we need more Are the trams air-conditioned? I specifically rebuked your point about cycle lanes, is there much of a point in making them in areas which are excruciatingly hot? While more than 50% of the power is coming from thermal plants 🤦‍♂️ JhatuKari Google average distance between these and those of petrol pumps. Then also consider the fact that fast chargers still take upwards of 30 minutes to charge.. Then think of the length of the lines that will be there because of these two. Chapris on Ather doesn't sound much better politicians are in the business of making promises. This is election season and politicians are making promises left and right. I am not defending anybody, i am just stating the facts. Regardless, full EV coverage of india is a goal i would like to see fulfilled in my lifetime. It helps that there are politicians who are speaking/dreaming of such a reality. There are only a few ministers who try out new ideas/strategies even if they are outlandish as fuck and gatkari is one of them. Is he stupid, i dont think so. Bro has been maintaining successful businesses and is a national politician. It is infact YOU, who is stupid. Have a nice day. It will improve AQI of major cities. A lot of electricity right now is produced through coal, but renewables are steadily increasing and it's only going to get better. A push towards EV has improved air quality in China massively. At a time when the US reexting the battery-powered cars, India is looking to invest in it. Even Merc have said no more electric cars! India is made for electric cars, many many functional impossiblities. First of them is charging: Imagine just 5,000 tourist cars going to Manali. How will scale the steep elevations? How many will be able to reach Manali? Where would they recharge on the way, (Remember all the local cars would also be getting recharged) And even if they reach Manali, where are they gonna recharge so many cars? And if there's snow do you think the cars would be able to move? Another bold statement.. Only if onboarding cost is less Why ? yeah trams are air conditioned. and about the other thing, you seriously think most people in this country travel in a car? This is a third world country and most people can't afford cars. The primary mode of transport for the majority is already Motorbikes or Scooters (even in areas which are excruciatingly hot). Bike lanes are just supposed to complement the trams by providing an easy access to the tram stops. On top of that, cars ARE a part of the reason already excruciatingly hot areas keep getting hotter and hotter. I agree that public infrastructure needs to be improved, but I won't say I am a fan of Not Just Bikes. That guy thinks Americans should move out of their country just because of cycling and public transport infrastructure. Crude oil is our biggest import item. If we start replacing cars, we will have a trade surplus. That will be huge. China has made it it's mission make EVs mainstream. China too imports a LOT of crude. They are adding solar capacities like crazy. The more china pushes this, the cheaper crude gets, and when we start importing less, crude will cost even less. Acche din are coming. Nah this man will do it Well he's definitely too far but being that far is a result of how cities are designed. I live in Calgary, Canada and the car dependency is horrendous here. My work location is 28km from my home and it takes me 35 minutes to drive in peak hours and via public transport it takes 1h20m which is quite bad. Any amount of change can never bring that travel time down via public transport because you can't demolish places and remake them. A new train line is being constructed in my side of the city and people are opposing it big time while the province shelled out $2B for road infra maintenance. It's almost impossible to change people's minds as well. Based on past record, not going to happen soon.. To make it happen, you have to remove taxes. But then you'll increase electricity charges.."
}