{
    "id": "fkomvp",
    "title": "SOS: 3 ways how the DoT can help #FlattenTheCurve #Covid19",
    "url": "https://www.reddit.com/r/india/comments/fkomvp/sos_3_ways_how_the_dot_can_help_flattenthecurve/",
    "selftext": "https://preview.redd.it/xl5x0otkbfn41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=e129292a378cf251da1f916f9dcdf9ed02cb6cbd\n\n### Tl;dr\n\nAccess to good quality internet has never been more important than right now. With most experts unanimous on the need for  social distancing and many workplaces putting into place work from home plans, voice and data connectivity become critical. To ensure that high quality bandwidth is available to all parts of India we have suggested specific steps to be taken by the Department of Telecom. \n\n### \"We the people...\", of the Internet\n\nDue to the unprecedented nature of the COVID-19 pandemic, the Union Government is taking various policy measures to safeguard the health and welfare of all Indians as per an advisory by the Ministry of Health and Family Welfare titled, “*Advisory on Social Distancing Measure in view of spread of COVID-19 disease*” ([**link**](https://www.mohfw.gov.in/pdf/SocialDistancingAdvisorybyMOHFW.pdf)). Point number 3 to this advisory recommends to, “*Encourage private sector organizations/employers to allow employees to work from home wherever feasible.*” A “work from home” measure is critical during this time to contain adverse economic impacts on individuals, companies and the entire Indian economy.\n\nAt the same time during this period many people are likely to undergo mental stress and will reach out to loved ones for comfort and support. Even for children, remote educational modes of learning will become vital at this time as schools are closed. Many such interests which require social distancing necessary to restrict the spread of Covid-19 are supported by the availability of telecom and data services. However, as is the case with such a measure we would like to highlight that there comes certain network capacity related risks which policymakers must respond to. \n\nA recent report in the New York Times, dated March 16, 2020 informs us that a work and learn from home set up, leads to considerable stress on underlying network infrastructure ([**link**](https://www.nytimes.com/2020/03/16/technology/coronavirus-working-from-home-internet.html)). This is because last mile home service networks are designed to handle traffic patterns which are considerably different to enterprise grade internet broadband networks. Moreover, Wi-Fi based home internet systems have their own set of challenges in terms of reliability and quality of service. \n\n### We need to have a plan to support each other\n\nWe urge for crucial policy measures by putting forth a comprehensive plan in coordination with appropriate government departments and ministries. We specifically suggest the following:\n\n1. **Periodic reviews of telecom infrastructure** **constraints:** There is an urgent need for the DOT and TRAI to conduct assessments in consultation with large telecom and internet service providers on the capacity to carry voice and internet traffic. Separately, there's a need for authorities to engage with representatives from internet users both enterprise facing stakeholders and consumer facing stakeholders in challenges they may face in continuing their day to day activities online. All of these actions must nonetheless, uphold the spirit of net neutrality and not lead to discriminatory treatment of internet traffic.\n2. **Encourage voluntary pledges by telecom companies:** We recommend that a voluntary pledge may be encouraged by the Union Government in which telecom and internet service providers decide to not terminate services of any residential or small business users because of their inability to pay their bills due to disruptions caused specifically by COVID-19. \n3. **Ensure full and complete access at all times:** We urge that an advisory may be issued to all State Governments to halt any internet shutdowns or actions under the Telecommunications Suspension Rules, 2017 which are likely to increase hardship for people and organisations. This includes measures which slow down internet access speeds since that has the potential cripple economic activities.\n\nWe urge people from across the community (especially technical experts and small businesses) on if they have experienced any difficulties whilst accessing the internet, or using voice and video conferencing services. IFF will remain alert to the situation should it develop.\n\n### Important Documents\n\n1. Link to IFF’s representation to the Minister of Communications, Mr Ravi Shankar Prasad which has been copied to both the DoT and TRAI ([**click here**](https://drive.google.com/file/d/1NoItFPO92ND12WDlw1VdI13KaiAa3tpU/view?usp=sharing))\n2. Link to New York Times article dated March 16, 2020 which articulates some of the network connectivity issues faced in the US ([**click here**](https://www.nytimes.com/2020/03/16/technology/coronavirus-working-from-home-internet.html))\n\n**We've got your back folks! Our objective is to keep your internet experiences fair, open and private. You too can jump on the cause and** **#SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/)\n\n**Facing connectivity challenges with the new work from home transition? Kick start the conversation with our community on IFF’s new forum at** [**forum.internetfreedom.in**](https://forum.internetfreedom.in/)**.**",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1584534023,
    "convurl": "https://a.thumbs.redditmedia.com/0D7H2TilItSNsZAi3NTVfSGz1OyQgwLi6LZb8WjMP34.jpg",
    "comments": [],
    "cleaned_text": "sos ways dot help flattenthecurve covid tldr access good quality internet never important right experts unanimous need social distancing many workplaces putting place work home plans voice data connectivity become critical ensure high quality bandwidth available parts india suggested specific steps taken department telecom people internet due unprecedented nature covid pandemic union government taking various policy measures safeguard health welfare indians per advisory ministry health family welfare titled advisory social distancing measure view spread covid disease linkhttpswwwmohfwgovinpdfsocialdistancingadvisorybymohfwpdf point number advisory recommends encourage private sector organizationsemployers allow employees work home wherever feasible work home measure critical time contain adverse economic impacts individuals companies entire indian economy time period many people likely undergo mental stress reach loved ones comfort support even children remote educational modes learning become vital time schools closed many interests require social distancing necessary restrict spread covid supported availability telecom data services however case measure would like highlight comes certain network capacity related risks policymakers must respond recent report new york times dated march informs us work learn home set leads considerable stress underlying network infrastructure linkhttpswwwnytimescomtechnologycoronavirusworkingfromhomeinternethtml last mile home service networks designed handle traffic patterns considerably different enterprise grade internet broadband networks moreover wifi based home internet systems set challenges terms reliability quality service need plan support urge crucial policy measures putting forth comprehensive plan coordination appropriate government departments ministries specifically suggest following periodic reviews telecom infrastructure constraints urgent need dot trai conduct assessments consultation large telecom internet service providers capacity carry voice internet traffic separately theres need authorities engage representatives internet users enterprise facing stakeholders consumer facing stakeholders challenges may face continuing day day activities online actions must nonetheless uphold spirit net neutrality lead discriminatory treatment internet traffic encourage voluntary pledges telecom companies recommend voluntary pledge may encouraged union government telecom internet service providers decide terminate services residential small business users inability pay bills due disruptions caused specifically covid ensure full complete access times urge advisory may issued state governments halt internet shutdowns actions telecommunications suspension rules likely increase hardship people organisations includes measures slow internet access speeds since potential cripple economic activities urge people across community especially technical experts small businesses experienced difficulties whilst accessing internet using voice video conferencing services iff remain alert situation develop important documents link iffs representation minister communications mr ravi shankar prasad copied dot trai click herehttpsdrivegooglecomfilednoitfpondwdlwvdikaiaatpuviewuspsharing link new york times article dated march articulates network connectivity issues faced us click herehttpswwwnytimescomtechnologycoronavirusworkingfromhomeinternethtml weve got back folks objective keep internet experiences fair open private jump cause savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate facing connectivity challenges new work home transition kick start conversation community iffs new forum foruminternetfreedominhttpsforuminternetfreedomin ",
    "cleaned_title": "sos ways dot help flattenthecurve covid",
    "cleaned_selftext": "tldr access good quality internet never important right experts unanimous need social distancing many workplaces putting place work home plans voice data connectivity become critical ensure high quality bandwidth available parts india suggested specific steps taken department telecom people internet due unprecedented nature covid pandemic union government taking various policy measures safeguard health welfare indians per advisory ministry health family welfare titled advisory social distancing measure view spread covid disease linkhttpswwwmohfwgovinpdfsocialdistancingadvisorybymohfwpdf point number advisory recommends encourage private sector organizationsemployers allow employees work home wherever feasible work home measure critical time contain adverse economic impacts individuals companies entire indian economy time period many people likely undergo mental stress reach loved ones comfort support even children remote educational modes learning become vital time schools closed many interests require social distancing necessary restrict spread covid supported availability telecom data services however case measure would like highlight comes certain network capacity related risks policymakers must respond recent report new york times dated march informs us work learn home set leads considerable stress underlying network infrastructure linkhttpswwwnytimescomtechnologycoronavirusworkingfromhomeinternethtml last mile home service networks designed handle traffic patterns considerably different enterprise grade internet broadband networks moreover wifi based home internet systems set challenges terms reliability quality service need plan support urge crucial policy measures putting forth comprehensive plan coordination appropriate government departments ministries specifically suggest following periodic reviews telecom infrastructure constraints urgent need dot trai conduct assessments consultation large telecom internet service providers capacity carry voice internet traffic separately theres need authorities engage representatives internet users enterprise facing stakeholders consumer facing stakeholders challenges may face continuing day day activities online actions must nonetheless uphold spirit net neutrality lead discriminatory treatment internet traffic encourage voluntary pledges telecom companies recommend voluntary pledge may encouraged union government telecom internet service providers decide terminate services residential small business users inability pay bills due disruptions caused specifically covid ensure full complete access times urge advisory may issued state governments halt internet shutdowns actions telecommunications suspension rules likely increase hardship people organisations includes measures slow internet access speeds since potential cripple economic activities urge people across community especially technical experts small businesses experienced difficulties whilst accessing internet using voice video conferencing services iff remain alert situation develop important documents link iffs representation minister communications mr ravi shankar prasad copied dot trai click herehttpsdrivegooglecomfilednoitfpondwdlwvdikaiaatpuviewuspsharing link new york times article dated march articulates network connectivity issues faced us click herehttpswwwnytimescomtechnologycoronavirusworkingfromhomeinternethtml weve got back folks objective keep internet experiences fair open private jump cause savetheinternet help us joining forces becoming iff member todayhttpsinternetfreedomindonate facing connectivity challenges new work home transition kick start conversation community iffs new forum foruminternetfreedominhttpsforuminternetfreedomin",
    "cleaned_comments": "",
    "light_cleaned_title": "SOS: 3 ways how the DoT can help #FlattenTheCurve #Covid19",
    "light_cleaned_selftext": "### Tl;dr Access to good quality internet has never been more important than right now. With most experts unanimous on the need for social distancing and many workplaces putting into place work from home plans, voice and data connectivity become critical. To ensure that high quality bandwidth is available to all parts of India we have suggested specific steps to be taken by the Department of Telecom. ### \"We the people...\", of the Internet Due to the unprecedented nature of the COVID-19 pandemic, the Union Government is taking various policy measures to safeguard the health and welfare of all Indians as per an advisory by the Ministry of Health and Family Welfare titled, “*Advisory on Social Distancing Measure in view of spread of COVID-19 disease*” ([**link**](https://www.mohfw.gov.in/pdf/SocialDistancingAdvisorybyMOHFW.pdf)). Point number 3 to this advisory recommends to, “*Encourage private sector organizations/employers to allow employees to work from home wherever feasible.*” A “work from home” measure is critical during this time to contain adverse economic impacts on individuals, companies and the entire Indian economy. At the same time during this period many people are likely to undergo mental stress and will reach out to loved ones for comfort and support. Even for children, remote educational modes of learning will become vital at this time as schools are closed. Many such interests which require social distancing necessary to restrict the spread of Covid-19 are supported by the availability of telecom and data services. However, as is the case with such a measure we would like to highlight that there comes certain network capacity related risks which policymakers must respond to. A recent report in the New York Times, dated March 16, 2020 informs us that a work and learn from home set up, leads to considerable stress on underlying network infrastructure ([**link**](https://www.nytimes.com/2020/03/16/technology/coronavirus-working-from-home-internet.html)). This is because last mile home service networks are designed to handle traffic patterns which are considerably different to enterprise grade internet broadband networks. Moreover, Wi-Fi based home internet systems have their own set of challenges in terms of reliability and quality of service. ### We need to have a plan to support each other We urge for crucial policy measures by putting forth a comprehensive plan in coordination with appropriate government departments and ministries. We specifically suggest the following: 1. **Periodic reviews of telecom infrastructure** **constraints:** There is an urgent need for the DOT and TRAI to conduct assessments in consultation with large telecom and internet service providers on the capacity to carry voice and internet traffic. Separately, there's a need for authorities to engage with representatives from internet users both enterprise facing stakeholders and consumer facing stakeholders in challenges they may face in continuing their day to day activities online. All of these actions must nonetheless, uphold the spirit of net neutrality and not lead to discriminatory treatment of internet traffic. 2. **Encourage voluntary pledges by telecom companies:** We recommend that a voluntary pledge may be encouraged by the Union Government in which telecom and internet service providers decide to not terminate services of any residential or small business users because of their inability to pay their bills due to disruptions caused specifically by COVID-19. 3. **Ensure full and complete access at all times:** We urge that an advisory may be issued to all State Governments to halt any internet shutdowns or actions under the Telecommunications Suspension Rules, 2017 which are likely to increase hardship for people and organisations. This includes measures which slow down internet access speeds since that has the potential cripple economic activities. We urge people from across the community (especially technical experts and small businesses) on if they have experienced any difficulties whilst accessing the internet, or using voice and video conferencing services. IFF will remain alert to the situation should it develop. ### Important Documents 1. Link to IFF’s representation to the Minister of Communications, Mr Ravi Shankar Prasad which has been copied to both the DoT and TRAI ([**click here**](https://drive.google.com/file/d/1NoItFPO92ND12WDlw1VdI13KaiAa3tpU/view?usp=sharing)) 2. Link to New York Times article dated March 16, 2020 which articulates some of the network connectivity issues faced in the US ([**click here**](https://www.nytimes.com/2020/03/16/technology/coronavirus-working-from-home-internet.html)) **We've got your back folks! Our objective is to keep your internet experiences fair, open and private. You too can jump on the cause and** **#SaveTheInternet.** [**Help us by joining forces and becoming an IFF Member today!**](https://internetfreedom.in/donate/) **Facing connectivity challenges with the new work from home transition? Kick start the conversation with our community on IFF’s new forum at** [**forum.internetfreedom.in**](https://forum.internetfreedom.in/)**.**",
    "light_cleaned_comments": ""
}