{
    "id": "1294py9",
    "title": "Howrah violence: BJP says police crackdown was selective; fear and grief cut across divide",
    "url": "https://indianexpress.com/article/cities/kolkata/howrah-violence-bjp-says-police-crackdown-was-selective-fear-and-grief-cut-across-divide-8532878/",
    "selftext": "Most of the cases filed against the 36 invoke IPC sections related to unlawful assembly, rioting, promoting enmity between two groups, attempt to murder, criminal intimidation and conspiracy and under various sections of The Prevention of Damage to Public Property Act",
    "flair": "Politics",
    "score": 78,
    "num_comments": 11,
    "created_utc": 1680396460.0,
    "convurl": "https://external-preview.redd.it/Sw1SJP3udX13HTbhba1argp1xWFIOhPQSTmOpKCriJ4.jpg?auto=webp&v=enabled&s=401295f361c9f7f2b9a39609323c626dde811c50",
    "comments": [
        "Police records, reviewed by The Indian Express, show that of the 36 arrested so far in the wake of clashes on March 30 and March 31, most are those who were associated with the Ram Navami rally, including BJP supporters, workers and local residents\n\nThat makes the TMC’s politics clear, said senior BJP leader and former state party chief Rahul Sinha. “Over 80 per cent of those arrested are Hindus…Those who were attacked were arrested, those who pelted stones are roaming freely. Even those six Muslims arrested, I tell you, have only been picked up to show numbers for token balancing. After her Sagardighi by-poll defeat, Chief Minister Mamata Banerjee knows that Muslims are going away from her. That is why this pre-planned violence.”",
        "Ashok Shaw who runs an iron beam shop and whose brother Anup Shaw is in jail. “My brother is a jute mill worker, he returned from work, took a bath and wore a yellow kurta for the rally. Like all of us, he stood near the end of the lane on G T Road to watch the Ram Navami procession pass by. After stone-pelting started from adjacent rooftops, he ran home. Later, police came and took him away. I met him in jail. He is constantly crying. This is the first time he is seeing the inside of jail,” said Shaw.\n\nBarely a five-minute walk away from Shaw’s house, standing at the entrance of his photo-frame workshop, Ashfaq Hussain recalls how his brother Ibrar, who works as helper to a cook, has been arrested. “He took Rs 50 from me and said he wanted to enjoy DJ music. He was even dancing during the Ram Navami procession. Since that evening, we haven’t been able to contact him. He has no mobile phone. Later, we were told he was arrested. We are going to meet him in jail tomorrow,” said Ashfaq.",
        "Police picked up five more men from Ashok Shaw’s neighbourhood: Sipti Kumar Das (works in a private company);  Govind Prasad (works in a small event management company); Ravi Prasad (student); local residents Sanjay Mahato and Munna Rai.\n\n“Sipti was returning home after work and had a black bag in his hand. He was picked up by police,” said family friend Gautam Verma. “We have no idea why.”\n\nSaid Mohammad Imran, uncle of 18-year-old Pintu Molla who has been arrested, “My nephew just got a job driving an e- rickshaw, his passengers are both Hindu and Muslim. But on Ram Navami day, there was no passenger, so he went to spend some time with his friends. He was picked up by police hours after the clash. We met him in jail, he was crying. All those who have been arrested, whether Hindu or Muslim, are poor people, randomly picked up by police. Those actually behind the violence haven’t been arrested.”\n\nCutting across the divide, there is a consensus the clashes could have been averted given that for the past two years, the area has seen violence and tension on Ram Navami day. But police lowered the guard and politicians upped the ante.",
        "For the past two years, it looks like this place is cursed… Earlier, everything was peaceful. Now, just look at the number of policemen patrolling after the violence,” said Ashfaq.\n\nThis is echoed by Shaw. “Even in 1992, (Babri Masjid demolition) nothing happened here. Muslim youths used to work with us. Since 2015, whenever the Ram Navami rally was held, local Muslim boys served sherbet to those in the procession but in the last two years, it has been a nightmare,” said Shaw.\n\nMost of the cases filed against the 36 invoke IPC sections related to unlawful assembly, rioting, promoting enmity between two groups, attempt to murder, criminal intimidation and conspiracy and under various sections of The Prevention of Damage to Public Property Act.\n\n“The situation is normal. We are patrolling the area and meeting the public,” said Howrah Police Commissioner Praveen Kumar Tripathi.",
        "Related \n\nCID takes over probe into Howrah Ram Navami clash:\n https://www.thehindu.com/news/cities/kolkata/cid-takes-over-probe-into-howrah-violence-after-west-bengal-cm-and-governor-discuss-the-issue/article66688960.ece",
        "Communal violence happens wherever a certain party wants to grow. This is an old strategy. Everyone can guess who are behind these attacks.",
        "Rioters should be in jail. BJP should be happy.",
        "modes operandi of one party",
        "If 80% of the perpetrators are BJP Hindus, obviously 80% of the arrests will be of Hindus. BJP is just complaining that TMC is not fascist like them.",
        ">TMC is not fascist\n\nlmao"
    ],
    "cleaned_text": "howrah violence bjp says police crackdown selective fear grief cut across divide cases filed invoke ipc sections related unlawful assembly rioting promoting enmity two groups attempt murder criminal intimidation conspiracy various sections prevention damage public property act ",
    "cleaned_title": "howrah violence bjp says police crackdown selective fear grief cut across divide",
    "cleaned_selftext": "cases filed invoke ipc sections related unlawful assembly rioting promoting enmity two groups attempt murder criminal intimidation conspiracy various sections prevention damage public property act",
    "cleaned_comments": "police records reviewed indian express show arrested far wake clashes march march associated ram navami rally including bjp supporters workers local residents makes tmcs politics clear said senior bjp leader former state party chief rahul sinha per cent arrested hindusthose attacked arrested pelted stones roaming freely even six muslims arrested tell picked show numbers token balancing sagardighi bypoll defeat chief minister mamata banerjee knows muslims going away preplanned violence ashok shaw runs iron beam shop whose brother anup shaw jail brother jute mill worker returned work took bath wore yellow kurta rally like us stood near end lane g road watch ram navami procession pass stonepelting started adjacent rooftops ran home later police came took away met jail constantly crying first time seeing inside jail said shaw barely fiveminute walk away shaws house standing entrance photoframe workshop ashfaq hussain recalls brother ibrar works helper cook arrested took rs said wanted enjoy dj music even dancing ram navami procession since evening havent able contact mobile phone later told arrested going meet jail tomorrow said ashfaq police picked five men ashok shaws neighbourhood sipti kumar das works private company govind prasad works small event management company ravi prasad student local residents sanjay mahato munna rai sipti returning home work black bag hand picked police said family friend gautam verma idea said mohammad imran uncle yearold pintu molla arrested nephew got job driving e rickshaw passengers hindu muslim ram navami day passenger went spend time friends picked police hours clash met jail crying arrested whether hindu muslim poor people randomly picked police actually behind violence havent arrested cutting across divide consensus clashes could averted given past two years area seen violence tension ram navami day police lowered guard politicians upped ante past two years looks like place cursed earlier everything peaceful look number policemen patrolling violence said ashfaq echoed shaw even babri masjid demolition nothing happened muslim youths used work us since whenever ram navami rally held local muslim boys served sherbet procession last two years nightmare said shaw cases filed invoke ipc sections related unlawful assembly rioting promoting enmity two groups attempt murder criminal intimidation conspiracy various sections prevention damage public property act situation normal patrolling area meeting public said howrah police commissioner praveen kumar tripathi related cid takes probe howrah ram navami clash communal violence happens wherever certain party wants grow old strategy everyone guess behind attacks rioters jail bjp happy modes operandi one party perpetrators bjp hindus obviously arrests hindus bjp complaining tmc fascist like tmc fascist lmao",
    "light_cleaned_title": "Howrah violence: BJP says police crackdown was selective; fear and grief cut across divide",
    "light_cleaned_selftext": "Most of the cases filed against the 36 invoke IPC sections related to unlawful assembly, rioting, promoting enmity between two groups, attempt to murder, criminal intimidation and conspiracy and under various sections of The Prevention of Damage to Public Property Act",
    "light_cleaned_comments": "Police records, reviewed by The Indian Express, show that of the 36 arrested so far in the wake of clashes on March 30 and March 31, most are those who were associated with the Ram Navami rally, including BJP supporters, workers and local residents That makes the TMC’s politics clear, said senior BJP leader and former state party chief Rahul Sinha. “Over 80 per cent of those arrested are Hindus…Those who were attacked were arrested, those who pelted stones are roaming freely. Even those six Muslims arrested, I tell you, have only been picked up to show numbers for token balancing. After her Sagardighi by-poll defeat, Chief Minister Mamata Banerjee knows that Muslims are going away from her. That is why this pre-planned violence.” Ashok Shaw who runs an iron beam shop and whose brother Anup Shaw is in jail. “My brother is a jute mill worker, he returned from work, took a bath and wore a yellow kurta for the rally. Like all of us, he stood near the end of the lane on G T Road to watch the Ram Navami procession pass by. After stone-pelting started from adjacent rooftops, he ran home. Later, police came and took him away. I met him in jail. He is constantly crying. This is the first time he is seeing the inside of jail,” said Shaw. Barely a five-minute walk away from Shaw’s house, standing at the entrance of his photo-frame workshop, Ashfaq Hussain recalls how his brother Ibrar, who works as helper to a cook, has been arrested. “He took Rs 50 from me and said he wanted to enjoy DJ music. He was even dancing during the Ram Navami procession. Since that evening, we haven’t been able to contact him. He has no mobile phone. Later, we were told he was arrested. We are going to meet him in jail tomorrow,” said Ashfaq. Police picked up five more men from Ashok Shaw’s neighbourhood: Sipti Kumar Das (works in a private company); Govind Prasad (works in a small event management company); Ravi Prasad (student); local residents Sanjay Mahato and Munna Rai. “Sipti was returning home after work and had a black bag in his hand. He was picked up by police,” said family friend Gautam Verma. “We have no idea why.” Said Mohammad Imran, uncle of 18-year-old Pintu Molla who has been arrested, “My nephew just got a job driving an e- rickshaw, his passengers are both Hindu and Muslim. But on Ram Navami day, there was no passenger, so he went to spend some time with his friends. He was picked up by police hours after the clash. We met him in jail, he was crying. All those who have been arrested, whether Hindu or Muslim, are poor people, randomly picked up by police. Those actually behind the violence haven’t been arrested.” Cutting across the divide, there is a consensus the clashes could have been averted given that for the past two years, the area has seen violence and tension on Ram Navami day. But police lowered the guard and politicians upped the ante. For the past two years, it looks like this place is cursed… Earlier, everything was peaceful. Now, just look at the number of policemen patrolling after the violence,” said Ashfaq. This is echoed by Shaw. “Even in 1992, (Babri Masjid demolition) nothing happened here. Muslim youths used to work with us. Since 2015, whenever the Ram Navami rally was held, local Muslim boys served sherbet to those in the procession but in the last two years, it has been a nightmare,” said Shaw. Most of the cases filed against the 36 invoke IPC sections related to unlawful assembly, rioting, promoting enmity between two groups, attempt to murder, criminal intimidation and conspiracy and under various sections of The Prevention of Damage to Public Property Act. “The situation is normal. We are patrolling the area and meeting the public,” said Howrah Police Commissioner Praveen Kumar Tripathi. Related CID takes over probe into Howrah Ram Navami clash: Communal violence happens wherever a certain party wants to grow. This is an old strategy. Everyone can guess who are behind these attacks. Rioters should be in jail. BJP should be happy. modes operandi of one party If 80% of the perpetrators are BJP Hindus, obviously 80% of the arrests will be of Hindus. BJP is just complaining that TMC is not fascist like them. >TMC is not fascist lmao"
}