{
    "id": "16aluig",
    "title": "Anonymous Podcast For People to Vent Things Out",
    "url": "https://www.reddit.com/r/india/comments/16aluig/anonymous_podcast_for_people_to_vent_things_out/",
    "selftext": "Hi,\n\nWe are doing a Podcast, the show is fully Anonymous, the Hosts, the Guests, Everyone.\n\nWe are trying to help people by letting them vent\nthings out that have been weighing on them for a\nlong time.\n\nSo who can Join?\n\nAnyone can join, all you have to do is just DM us.\n\nWe  tweak your voice that way and nobody's gonna know that it was you and you can say whatever you want \n\nWe'd love to have anyone on our Podcast.\n\nIf you like the Idea of the Podcast, can you guys\nput up a Story on your Insta pages,\n\nIt would be a Great deal of help.\n\nIf your putting up the story,it might help us build\nsome credibility and it would help reach more\npeople.\n\nI Know this is too much to ask for,but if you could\nput a story about our page..we would be so\nGrateful to you.\n\nSpotify Podcast Link : https://spotify.openinapp.co/hhamd\n\nInsta Page Link : https://insta.openinapp.co/va2qf",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693913910.0,
    "convurl": "https://external-preview.redd.it/N-6zl23aomWBBvp8nhfsZDmDHoIOYNihyzeN-1_IVQk.jpg?auto=webp&s=c189e11af1f3218ac5096c2c61e6a2333f127ceb",
    "comments": [],
    "cleaned_text": "anonymous podcast people vent things hi podcast show fully anonymous hosts guests everyone trying help people letting vent things weighing long time join anyone join dm us tweak voice way nobodys gon na know say whatever want wed love anyone podcast like idea podcast guys put story insta pages would great deal help putting storyit might help us build credibility would help reach people know much ask forbut could put story pagewe would grateful spotify podcast link insta page link ",
    "cleaned_title": "anonymous podcast people vent things",
    "cleaned_selftext": "hi podcast show fully anonymous hosts guests everyone trying help people letting vent things weighing long time join anyone join dm us tweak voice way nobodys gon na know say whatever want wed love anyone podcast like idea podcast guys put story insta pages would great deal help putting storyit might help us build credibility would help reach people know much ask forbut could put story pagewe would grateful spotify podcast link insta page link",
    "cleaned_comments": "",
    "light_cleaned_title": "Anonymous Podcast For People to Vent Things Out",
    "light_cleaned_selftext": "Hi, We are doing a Podcast, the show is fully Anonymous, the Hosts, the Guests, Everyone. We are trying to help people by letting them vent things out that have been weighing on them for a long time. So who can Join? Anyone can join, all you have to do is just DM us. We tweak your voice that way and nobody's gonna know that it was you and you can say whatever you want We'd love to have anyone on our Podcast. If you like the Idea of the Podcast, can you guys put up a Story on your Insta pages, It would be a Great deal of help. If your putting up the story,it might help us build some credibility and it would help reach more people. I Know this is too much to ask for,but if you could put a story about our page..we would be so Grateful to you. Spotify Podcast Link : Insta Page Link :",
    "light_cleaned_comments": ""
}