{
    "id": "11sv7sy",
    "title": "What kind of toys/games do you like?",
    "url": "https://www.reddit.com/r/india/comments/11sv7sy/what_kind_of_toysgames_do_you_like/",
    "selftext": "[GAMES!!](https://preview.redd.it/1x0cs799z3oa1.jpg?width=512&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=cb7db43c7be3385f1d869b72b8cdcf6abfac6c69)\n\nI'm a product designer, I'm working to make physical games/toys. I'm asking all of you of any age(if possible please mention) to everyone what kind of games you like. (non-mobile) \n\nFor example, our beloved snakes and ladder, monopoly, uno cards, twister, Science Kit toys, and fidget toys, what types of play games with your siblings? children? friends? Indoor. \n\nIt would be really helpful if you all could tap into your childhood or current memories and share your experience, which would help me make better games for you. \n\nThank you, I appreciate your time and effort.",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 12,
    "created_utc": 1678975740,
    "convurl": "https://b.thumbs.redditmedia.com/pFRKS1dDdgDeNgOu2l1SsBgTIW-j3O6S1UeM8OoME7s.jpg",
    "comments": [
        "Connect 4",
        "I like card based games. Or games that don't need much bigger box. \n\nI also like few print and play games.",
        "I think doing a survey with google forms would gain more traction",
        "Socializing was the most important factor regarding physical games rather than the game itself. So, I'd say focus on the social aspect of the game.",
        "Carrom board brings back good memories of my childhood. \n\nCollege had billiards and pool, I love to play that with friends.\n\nI've also tried a lot of board games but they're not very popular in India.",
        "What kind of print and play games are you referring to?",
        "I hope people respond, even in this thread very few responses :⁠'⁠(",
        "Thank you for your input",
        "Thank you for your input.",
        "boardgame geeks have some good recommendations.",
        "Exploding kittens  \nMonopoly  \nUNO  \n\n\nanything other than the typical chess and LUDO as it gets stagnant games like Monopoly and uno allows befriending or fucking some over"
    ],
    "cleaned_text": "kind toysgames like gameshttpspreviewredditxcszoajpgwidthampformatpjpgampautowebpampvenabledampscbdbcbefdbbcdcfabfacc im product designer im working make physical gamestoys im asking ageif possible please mention everyone kind games like nonmobile example beloved snakes ladder monopoly uno cards twister science kit toys fidget toys types play games siblings children friends indoor would really helpful could tap childhood current memories share experience would help make better games thank appreciate time effort ",
    "cleaned_title": "kind toysgames like",
    "cleaned_selftext": "gameshttpspreviewredditxcszoajpgwidthampformatpjpgampautowebpampvenabledampscbdbcbefdbbcdcfabfacc im product designer im working make physical gamestoys im asking ageif possible please mention everyone kind games like nonmobile example beloved snakes ladder monopoly uno cards twister science kit toys fidget toys types play games siblings children friends indoor would really helpful could tap childhood current memories share experience would help make better games thank appreciate time effort",
    "cleaned_comments": "connect like card based games games dont need much bigger box also like print play games think survey google forms would gain traction socializing important factor regarding physical games rather game id say focus social aspect game carrom board brings back good memories childhood college billiards pool love play friends ive also tried lot board games theyre popular india kind print play games referring hope people respond even thread responses thank input thank input boardgame geeks good recommendations exploding kittens monopoly uno anything typical chess ludo gets stagnant games like monopoly uno allows befriending fucking",
    "light_cleaned_title": "What kind of toys/games do you like?",
    "light_cleaned_selftext": "[GAMES!!](https://preview.redd.it/1x0cs799z3oa1.jpg?width=512&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=cb7db43c7be3385f1d869b72b8cdcf6abfac6c69) I'm a product designer, I'm working to make physical games/toys. I'm asking all of you of any age(if possible please mention) to everyone what kind of games you like. (non-mobile) For example, our beloved snakes and ladder, monopoly, uno cards, twister, Science Kit toys, and fidget toys, what types of play games with your siblings? children? friends? Indoor. It would be really helpful if you all could tap into your childhood or current memories and share your experience, which would help me make better games for you. Thank you, I appreciate your time and effort.",
    "light_cleaned_comments": "Connect 4 I like card based games. Or games that don't need much bigger box. I also like few print and play games. I think doing a survey with google forms would gain more traction Socializing was the most important factor regarding physical games rather than the game itself. So, I'd say focus on the social aspect of the game. Carrom board brings back good memories of my childhood. College had billiards and pool, I love to play that with friends. I've also tried a lot of board games but they're not very popular in India. What kind of print and play games are you referring to? I hope people respond, even in this thread very few responses :⁠'⁠( Thank you for your input Thank you for your input. boardgame geeks have some good recommendations. Exploding kittens Monopoly UNO anything other than the typical chess and LUDO as it gets stagnant games like Monopoly and uno allows befriending or fucking some over"
}