{
    "id": "1fvs485",
    "title": "Why do Indian uncles ask for CTC so casually",
    "url": "https://www.reddit.com/r/india/comments/1fvs485/why_do_indian_uncles_ask_for_ctc_so_casually/",
    "selftext": "So I have come home for few days since my father is getting retired . So a lot of Uncles are coming to meet him . And me being the only son , I have to meet all of them . While my sisters dont care to meet them .  Now this one uncle started talking about my career and salary , and directly jumped to how much I earn now (\"Kitna mil jaata hai ?\") . Now I thought i would just brush it off somehow but couldn't. So ended up telling him 40LPA, a round fig which is a  tiny bit more than I earn  .\n\nNow the funny thing is I asked about his son who recently got placed . Lol he didn't tell the exact number. His son did masters from ISI  Bangalore. He started saying that he got placed low because he sat for the first company and couldn't sit for other placements . He even said the average placement was 40LPA at the college 🌝. I am like man why do you have to match the number that I quoted . I have been working for 6years to reach there. There people have just come out of college, although with a masters degree but still 40Lpa doesn't sit right.\n\nNow I have realised the best way to deal with such questions is to reply with an insanely inflated number. Next time anyone asks me i will say 60 LPA 💀",
    "flair": "Rant / Vent",
    "score": 1962,
    "num_comments": 564,
    "created_utc": 1728020585.0,
    "convurl": "https://external-preview.redd.it/V_QMC3tKUz3x4fG5heeeXJKo0vf0YkWEposB_4SoV1s.png?auto=webp&s=584c1777cd3ba7f1c5ee1f0d528b5776ff6466ef",
    "comments": [
        "No, lowball your response - they'll feel good.",
        "but why would you want to make them feel good?",
        "Why massage their ego?",
        "To be judgemental",
        "Two reasons:\n\n1. They are nosey.\n\n2. Because most people don't say 'no' when asked just out of sheer courtesy or pseudo respect.",
        "its their version of d!ck-measuring contest",
        "That’s how they measure anyone’s worth \n\nThey’ll either feel great if you earn less or taunt their kids incase you earn more.",
        "Mat batao seeda bolo it's low it's confidential.. but i am ooking forward to have 90lakh PA.. do you know anyone who can set me up for a job with this much salary?",
        "Well said",
        "Haha perfect reply",
        "I read here that they ask your caste (ctc now) to decide if you should be respected.",
        "Me like: अरे अंकल जी, आज कल दस लाख महीना में होता ही क्या है।",
        "Salaries should be discussed openly with everyone. The corporate policy of not discussing it was created to keep salaries low. Let uncles know. They'll probably have the knowledge that you're getting screwed and have better jobs for you.",
        "Jaat poocha toh 'shaved hai' bolneka",
        "Indian uncles and aunties have 0 sense of boundaries and shame. Will start yapping about salary, weight, complexion, height, hair, skin, marriage prospects, children or the lack thereof, etc.",
        "Hota sabke paas hai dikhata koi nahin",
        "They dont give a shit. My dad, when he first met my Indian girlfriend, said to her face that she was darker skinned than her sister. Later, he told my white American girlfriend that her skin looked pale. These guys have no filters LOL But that was 25 years ago... things may have changed now for his generation.",
        "Uncle ke bete ke L lag jayenge iske baad .",
        "They aren't asking so they can look out for you. Openly sharing salary info with colleagues, sure. With nosy relatives? Naah.",
        "🤣🤣",
        "Bruh, your uncle just asked for CTC. Mere toh in-hand, bonus vgrh bhi puchte hain 😂",
        "A lot of things happen. A lot of things don't. Lot of things just never happen. Unkils asking CTC to help is something that most never happened.",
        "Uncle HR me hai kya",
        "and u r naive like OP to say it or smart like others to not share it",
        "My parents as well relatives frequently asks me when your CTC will get increase, xyz got 15LPA package; abc got 10LPA\n\n\nNowadays I’m literally in frustration though I’ve enough salary that I saves upto 15 to 20k monthly",
        "I just say जितका आवश्यक आहे तितका पगार मिळतो and smile :)",
        "Forget why - be assured his son will get some words handed to him tonight for getting lower package 😄",
        "Pagal hote he ye log. \n\nThey won’t be happy anyways. \n\nI am also talking about my dad, he was not satisfied with my salary. I am satisfied but he is not. When I left the job and was jobless then he was like kuch bhi mile kar lo.",
        "Bruh why to make them feel good . Give them an insane amount .",
        "Ig uncles ask for dick measuring and to shame their kids. \n\n\nAnd aunties ask to update their arranged marriage network database. ",
        "Damn 6 years 40LPA, i chose the wrong profession",
        "Nope... His kids have gone through the high CTC low in-hand situation isliye he knows 😂",
        "Almost everyone is naive during their first job, especially when it's asked by someone close to parents. Main nhi toh vo bta denge 😶‍🌫️",
        "Average placement at ISI Kolkata is indeed 40L. However, at ISI Bangalore should be lower - but still should be greater than 30L. In any case Indian uncle and aunty se Bach ke raho.",
        "This is an innocent generation who dont have filters and have fake face and thats the fact. I agree they have those negative traits of asking and comparing skin, color, height, package but thats how they are made.",
        "Why Indian’s can’t man the fuck up ? Ask uncle, I’ll tell you my CTC if you tell me how much you have made in your career working ?  The number he quotes add 10 lakh to it and say that’s your CTC.",
        "Because Indians BARELY have the concept of consent, privacy and personal space.\n\nThey judge people with their bank balance and family's wealth. Let me tell you, a lot of them are LYING when they mention their own LPA. Jo mann mein ayein bol dena,  throw in some foreign country visits as well, they won't ask again.",
        "Well to be fair everyone is an indian uncle separated in time by a decade.",
        "I got asked that question multiple times and I respond to them by saying that I don’t share this with anyone not even with my dad. Ann that is true. Parents have this thing to show off their kids income in social circles. This has some direct or indirect consequences. People think I am rude but I don’t give a fu*k.",
        "बस खर्चा पानी चल जाता है",
        "Once i said - I don't discuss money and walked off. I felt so proud.",
        "Lol avg placement of 40lpa in any college is insane. The BEST of the best, that is MBA from IIM A B C is 35 lpa",
        "Tbh I earn as much I you and I assume you also know how the actual placement statistics in most colleges are inflated, I clearly know that uncles are lying and that they can never match me salary lol.",
        "Say less bro, some people will ask for loan when they think you earn a lot.",
        "you should also have said something like \"mil jaata hai thora bohot\" and immediately started talking about his son and how's placement in his college. Never give them the info they are looking for, they are just here to compare and be jealous.",
        "Arre gaitonde bhau 🫡",
        "I always reply Bas kharcha pani chl jata h thik se.",
        "honestly I feel like they just ask so they can give you free advice/suggestions I've noticed a lots of ppl in our country likes doing it😂.",
        "FR they have nothing going on in their lives",
        "I mean I discuss it with close circles . Not for showoff but because they genuinely want to know",
        "\"Next time, just say ‘Oh, I don’t count, I just let my financial advisor handle it.’ 😎 That way, the awkward number game gets crushed before it even starts!\"",
        "Ask them their salary too before answering. Tell them yours is more than theirs, and ask them if they want to work in your company.",
        "Bas mil jaata h , kaam chal  jaata h - the very cliche reply you can give. \n\nYou n ur parents r enough to know how much you really earn. Some random uncle uses it either to humiliate you or to bring some marriage offers from his side.",
        "Well there was a time when my parents asked me to leave job and prep for govt exams. I denied . But being unemployed for 2 years would have made them happier then. Luckily they dont force it now .",
        "So that they don't ask you for money",
        "lol CTC.",
        "I am an indian , this is what i have experienced over many years  so Indian uncles and aunties ask and get straight to the point. \n\nWhere did you study?\nWhere do you live? \nHow much do you earn ? \nAre you married ? \n\nDifferent interpretations can be drawn from where the person asking the question is \n\nDelhi - mostly snob value \nMumbai mostly practical and assessment based \nBangalore you won't hear these  questions here \nChennai more curious and pigeon hole assessment .\nCalcutta don't know.\n\nAll the more reason to despise these seemingly harmless questions.",
        "next time  praise the size of their pelvis to assert dominance!\n\nlet uncle live with it for the rest of his life being uncomfortable!",
        "indians ka bas ek hi goal hota hai. sharma ji ke ladke se better karna. western concept hai maslows theory of hierarchy. india mai toh saari needs hai sharmaji ke ladke se better karna. whats funny to me is that these parents dont compare themselves with other parents though. always kids are used as pawns to play this dick measuring contest",
        "Pretty sure not 40 even in calcutta",
        "Never share your CTC. It's the worst thing to do. Casually say I don't share my salary with anyone, I am sorry.\nI have done this because there was time I was earning 10k per month, and now I earn a lot better, but I know one thing my salary doesn't define who I am or what I am worth. Once you share your salary, people try to categorize you unintentionally, and it's super racist.",
        "Never share your CTC. It's the worst thing to do. Casually say I don't share my salary with anyone, I am sorry.\nI have done this because there was time I was earning 10k per month, and now I earn a lot better, but I know one thing my salary doesn't define who I am or what I am worth. Once you share your salary, people try to categorize you unintentionally, and it's super racist.",
        "I think it’s a boundary issue. I’ve set boundaries with the entirety of my extended family, and no one dares ask me such questions. \n\nOr maybe they’re scared that my response will probably want to kill their kids and start questioning their own life’s choices. (:",
        "Kya pata apni ladki k liye potential husband dhoond rahe ho",
        "Happens less to me. But whenever they ask me my salary, I ask them theirs.",
        "\"why do Indian uncles ask for CTC\"\n\nHave some self respect, man. Call it your income. I can understand why your company would call it CTC -- from their perspective, you are an expense -- but for you to call it that is you acknowledging yourself as nothing more than that expense.",
        "I always respond: enough to keep me happy",
        "A man’s worth is how much money he makes in society. This is bitter truth I have learned as I have grown older.",
        "I just say, enough for me. Or say something very low like 4lacs. I don’t need people to know, and I don’t care what they think. Even my dad doesn’t know how much I make. The more you say your salary is, the more people with expect from you down the line.",
        "Quoting your CTC acts like a double edged sword.\nBe Careful.",
        "Bas aapki dua hai. Ghar chal jata hai bolke nikal Jaane ke ka",
        "Sir CTC bolo ya income bolo , kaam to tum company ke liye hi kar rhe ho .",
        "Always go low, tell them that you go to gurudwara to survive and work behind Wendy's part time",
        "Ye to sirf ye jaaanne ke liye hai ki kitni ijjjat deni hai saamne waale ko, very sad but true.",
        "Just say \"bhookha nahi sona padta hai\" and move on",
        "Lol I used to say i work at a startup and make very little. It helps weed out people who are only interested in talking to me for my status.",
        "I always quote low numbers, and pretend that I'm barely scraping by. My mom always scolds me for it but I'd rather let them think I'm lying about it being that low just to mess with their head",
        "True, lol even tier 3 colleges boast their average like that,my friend who did her engineering from chandigarh University, chandigarh, said mba guys of her college get placed at 25lpa on average.  40lpa+ in any tier 1 college is possible for only the top 20% of the crowd.",
        "Just say 2 Cr. Lol",
        "Wait for random reddit dms dw💀",
        "Never give them a figure. They will borrow from you and when you'll be asking for return, they will say you have this much, why do you need it now etc etc. Just say that dal chawal ho jata hai... never give them an estimate.",
        "Tried to make himself feel better by putting you down but instead 🤭",
        "I’d like to add - even women get asked .  What  annoys me even more is  , it is not just in India and it is not even the uncle-aunty types or age group: it is the comparison or nosy type mentality more than anything else . In the US there are this type which ask “ when did you come to US” without even saying the usual Hi- Hello pleasantries",
        "Aur jhaat pucha to bolna brahman",
        "In this case I prefer to be a low-key coz they just want to see that you’re not that successful. Yehi chiz unke dil ko tassali deta hai. \nAs Mark Manson said : “ A rich guy doesn’t have to prove that he’s rich similarly A beautiful women doesn’t need to tell she’s beautiful “\n\nHence apne and apni family ko khush rkho, bhaad mei gya dunia ka competition.",
        "This year IIT-B has average of 4 LPA. Right?",
        "Next time just say bus kharcha nikal jata hai",
        "Majority of Indians, especially men, spend their lives centred on their jobs and salary whille having no other discernable identity \n\n\nSo they can only make themselves feel better by depending on salary or money ",
        "You aren’t bound to answer them so why even lie. Not many people have asked me such questions but those few who have asked I straight away told them I don’t discuss my salary with anyone. TBF even my parents never asked me my salary and I only told them out of respect and for them to know that I earn enough to spoil them and they can ask me for anything if and when they require anything.",
        "There's this uncle who was asked to renovate our house that we currently live in. We later found out that he had ripped us off and used low quality materials for the renovation. We discussed it and just decided to ignore him and move on.\nHe also maintained his distance. This was around 2012. He's never been inside our house since then.\n\nAbout a year and half ago my grandmother had a minor accident and is bedridden. All neighbours and people in the area came to see her. This guy just drops in 3 months ago and comes in under the pretence of seeing my grandma. I was working in my room. I just came down to meet him and he suddenly starts asking me where I work, what kind of work I do and how much I earn. I was pissed and just told him that I get enough. I thought that was the last of it but no, he had the audacity to then ask my mom my salary which she too didn't answer. \n\nHe then proceeded to forward his son's resume to me and to my aunt (she's a VP in a huge corporate firm) to get him a job. \n\nAll these uncles are toxic and rotten to the core.",
        "My Father told me to say this if anyone asks what I earn. I tell people like Kaam chal jata h. Kharcha Nikal Jata.",
        "i tell such people to quote theirs first or straight up f off, hate nosy seniors more than modi",
        "My answer is always \"pet paani ho jaata hai\"\n\n\nThe other thing indians insist on telling you is your last name. Thats to determine your caste and hence social standing. I refuse. ",
        "Guys may I know the best answer to this question? I get a lot and I have just started my career so I don’t wanna let them know I am working with low wage pay.",
        "The diff is between bachelors and masters",
        "Bruh I'd always lowball my salary. Keep people around you happy, keep them pampered and live an easy life.",
        "lol, i have been in so many such situations and I just say 2 time ke roti khaane jitna. if they ask further, I stare them blank. even my dad is supportive of this. he says koi bhi salary pooche, irrespective of their age, no need to tell them. they're not your father in-law asking before handing his daughter's hand to you.",
        "Flash a smile 😃 and ask them why Do they want to know!? That will eliminate more than half the questions. \n\nNext point is more custom: Be ready to keep a poker face and ask them some uncomfortable questions. That will shut up the rest. Check with your parents and tell them that you are going to ask uncomfortable questions :-)",
        "Let's say you tell your CTC and that didn mention his son's CTC. What's there to loose my friend. Its very common for them to ask these questions. And if you try to reason with them that they should n ask such questions, they won't understand.",
        "My response always has been “Pet Bhar Jata hai itna, aur kya chahiye life mai(?)” (with a sarcastic smile). \n\nThen he’ll never ask again",
        "✋🏻 Foreigner here. What do these acronyms mean. Like LPA - what is this? and CTC? ",
        "Their whole personality is based on money and career,you live well they envy and you didnt make it they feel good about themselves.Next time dont mention how much you make instead set boundaries with them that its wrong to ask about how much money you make coz they dont have any shame about privacy.",
        "If you give an inflated number, be prepared for marriage proposals, loan requests. \n\nI don't get asked this much, but last time this happened, my answer was just the equivalent of \"more than enough\"",
        "Thats my Dad himself ... I told him my CTC, now he continuously ask every 1 or 2 weeks, that when I am switching job, or increase my ctc or to do a certification ..... And many times his talks will be like, my friends son/daughter got in this company, and got this package, like someone got in google; same will talk about some relative. ......   \n  \nAnother thing, my dad's sister's kid \\[*3 year older then me, but got job just recently as he was jobless*\\] not earned degree from a good college and not earn that much \\[*THough I don't judge or even ask about his ctc, bcs others ctc does not matter i guess*\\], but dad will try to put him up, and even lie for it, like will say that he is earning same as me \\[*even though he is not*\\], then dad said recently he is also doing freelancing, and earning as much as my salary.... I dont understand, why he try to put him up like me or even above, even by lying, even he is not, to belittle me. He says so proudly and also try to put me down, like dad's son is my cousin instead of me.\n\nThis feels so frustrating and annoying before as it felt like comparison and putting me down, but I learned to ignore it. Anyway, it is better bcs now I learnt that \"it does not matter who says what, and to ignore it or even reply to him\", and not taking it to mind, draining my energy and wasting whole day etc. I have strong mind now.\n\nPs. I earn good double digit lpa ctc \\[still a fresher\\] and proud of myself, as well as working hard to further improve. And never thought my dad will be like this",
        "He now got his sharmaji ka ladka",
        "LPA means what? Lakhs per year?",
        "I told my dad my CTC, now he continuously ask every 1 or 2 weeks, that when I am switching job, or increase my ctc or to do a certification ..... And many times his talks will be like, my friends son/daughter got in this company, and got this package, like someone got in google; same will talk about some relative. ......   \n  \nAnother thing, my dad's sister's kid \\[*3 year older then me, but got job just recently as he was jobless*\\] not earned degree from a good college and not earn that much \\[*THough I don't judge or even ask about his ctc, bcs others ctc does not matter i guess*\\], but dad will try to put him up, and even lie for it, like will say that he is earning same as me \\[*even though he is not*\\], then dad said recently he is also doing freelancing, and earning as much as my salary.... I dont understand, why he try to put him up like me or even above, even by lying, even he is not, to belittle me. He says so proudly and also try to put me down, like dad's son is my cousin instead of me.\n\nThis feels so frustrating and annoying before as it felt like comparison and putting me down, but I learned to ignore it. Anyway, it is better bcs now I learnt that \"it does not matter who says what, and to ignore it or even reply to him\", and not taking it to mind, draining my energy and wasting whole day etc. I have strong mind now.\n\nPs. I earn good double digit lpa ctc \\[still a fresher\\] and proud of myself, as well as working hard to further improve. And never thought my dad will be like this",
        "More than i need less than i want.\n\nFir bhi kitna\n\nKaam chal jata hai.\n\nArey kam to 50k /month me chal jayega.\n\nHa.\n\nMatlab 50k milta hai.\n\nNahi.\n\nFir?\n\nAapka beta heroine peeta tha na ? Abhi bhi peeta hai?\n\n------\n\nChalte hai kam hai thoda.",
        "you all might not realise, but this guy subtly posted his topic to flaunt his own CTC. he knows it is in the top 1%.\n\ntactics men employ.",
        "Some reddit men will show you v easily ☺️",
        "Whenever people ask me about my CTC I always replied \n\n  \n\"इतना मिल रहा है की दाल रोटी चल रही है\n\nपर कभी कभी हफ्ते में एक बार चिकन भी खा लेते है \"",
        "You can just ask them their savings and retirement planning. Equivalent of pulling out your bigger one in response.",
        "Best response.",
        "I was so frustrated once I had written a short article of sorts on this topic & forwarded it to my relatives saying it’s a forwarded message I received xD \n\nHere it goes…\n\nIndian relatives & neighbours suffer from inferiority & superiority complex irrespective of their financial wealth. Some reasons :\n\nGetting a sense of superiority by comparing themselves with their relatives/neighbours is one of the few cheap thrills they can afford in their lives under the garb of social interaction AND concern ('We're just concerned for you, beta').\n\nIn India, etiquette & culture is more about touching feet & listening to elders, regardless of how they treat you. But the real global etiquette, the real culture, which is fostering good feelings in others & preventing people (even enemies) from feeling bad at all costs — is unquestionably absent in India. Ultimately, how you make others feel about themselves says a lot about you. \n\nThe typical Indian relative is lackluster, uncreative & lives an unbeautiful life. So they settle with their boring mediocre life as it is & spend the rest of their time being inquisitive about others.",
        "these relatives Never come to ask about health at our bad times but they want full information on how we're doing in our lives.",
        "LPA is lakhs per annum . Lakh is the currency here.  CTC is Cost to Company . It doesnt show the complete picture of how much you will actually get in-hand . CTC usually has a base component, variable component, stocks , bonuses , etc",
        "Dal roti kha lete hai",
        "Is that considered upper middle class?",
        "isliye to son mention kar diya post pe.",
        "Uncle ne apne bete ki class laga di hogi ghar jaake. Dekh usko 40 lakh ka package mil raha hai.\n\nShould have told him even more to piss him off",
        "Ladki se umar aur ladke se salary nhi puchi jati 😶‍🌫️",
        "LPA- Lakh per annum, 1 lakh = 100000 rupees =~ 1200 usd \n\nCTC- cost to company or total compensation including perks",
        "aint no way matka avg from isi that too banglore is 40 lpa avg",
        "What’s CTC",
        "Then you say \"uncle ji, rent is 30 LPA, and commute is 8 LPA\".",
        "Never have been in this situation but the best response I have learnt from others in this case is \"Bas chal raha hai, kuch khas nahi\"",
        "Next time ask him what was his salary at the time of retirement. If you don't shame these uncles, they will never change their behavior.",
        "Ladkon mein tharak bahut hai. Nhich chhodte kisiko",
        "There was this uncle in.my neighborhood who loved to boast about his son who recently got placed in a good company. He would sit outside his house in the evening and tell everyone who passes by how his son is now successful and earns a lot of money. \n\nA close friend came home recently and we were talking about it. He told me the uncle has this bad habit of boasting a few years back as well when his son was preparing for the JEE exams. \n\nHe decided to prank her. One evening when he was sitting outside (to boast to people obviously) me and my friend started strolling outside our homes. He called us. \n\nStarted to ask us about our career. He then asks, \"salary kitni hai tumhari?\" My friend says, \"zyada nahi hai uncle abhi toh bas 2.5 crore ka package laga hai. Freshers ko itna hi milta hai\" \n\nUncle ki shakal utar gayi. My friend then proceeded - \"uncle ye apko pata hai aas paas zameen kitne ki bik rahi hai? Soch raha hu lelu. Kaam ayegi\" \n\nFrom that day on. The uncle was never seen outside his house.",
        "Same difference between \"I'm living\" and \"I'm dying\". Both mean the same thing, because every moment you are living is every moment you live is a moment that draws you closer to death. Alas, the philosophy of language seems to be lost on you.",
        "Just say my Cost to the Company is ‘ Priceless.’ Smile and walk away!",
        "lakh is not a currency, it's the amount.\n\nlakh means a million",
        "Funny bhai kaafi funny .",
        "Bhai sun : Tu aapne liye hi musibaat bana raha hai\n\nInstead of saying 40 LPA, next time play this simple trick :\n\nUncle layoff ho gaya tha, abhi to me 18 LPA wali job kar raha hu.\n\nPhir Wo bolenge mere beta to 25 LPA Kama ta hai\n\nYour simple reply is - acha hai uncle, phir uski company me lagva dijiye please \n\nAnd trust me : the moment you ask these uncles for favour, they never comeback - do a casual follow up 2-3 times and they are never gonna bother you in life.\n\nFrom 2020 - till now, my actual salary growth is quite a lot but in eyes of my relatives and all, it is still 18 LPA & I still work at Paytm 🤣 ( even better to show that I don’t get much money because of all the drama )\n\nI always say as you know IT industry is under pressure, lots of layoffs etc happening, it is tough to find job in such market.",
        "kala jadu vashikaran krwa denge wrna isliye inn sbse door rehna h..XD",
        "The consequence to saying 60LPA is people will start calling for monetary help :-) IMO, Iwould just say a pretty lower number so that the other person empathises and closes the discussion.\nP.S. I have not encountered this situation as I earn pretty low.",
        "I just say 1 Cr se thoda kam hai uncle .. and wink .. never have I have been questioned back till now 😁",
        "Next time tell them:  \"I earn 100 INR per minute. Calculate rest of it\" then leave with little smile.",
        "Every time I get asked this question, I almost always reply to that enough to survive and then some.",
        "People who are envious and insecure\n\nPeople who are looking for partner for their son/daughter \n\nIn any case I think just denying answer the question is the best or quote a really low number. If you say 40LPA and shit people will be envious of you and tell it to everyone around or keep taunting you by saying he's the rich man or ameer bangae etc etc.",
        "to flex",
        "People are so random, I was in Singapore and there all of a sudden an uncle from Delhi with whom I had exchanged some pleasantries asked me how much I had paid for the trip.\nI was stunned, didn't even know what to say.",
        "Just say 5 lakhs more than your son or daughter. Now do the maths 😉",
        "How to flex your ctc without actually flexing it",
        "Oh yeah sorry i was lost lol . Just updated",
        "Yes somebody is gonna get hurt today.. somebaaady",
        "I tell my income depending on the person who asks, if he wants to ask me for a loan or something, I say bahut loss hogya iss saal. And if someone wants to compare, I tell them my family businesses' profit 4cr+ ( most people stop after that).",
        "Some questions you can ask to drive the point :\n\nToh how much property uncle has?\n How is he performing in bed these days?",
        "Just tell him \"Uncle gareeb log poochte hain ye sab, hum to pushtaini ameer hain.\"",
        "i usually tell 2cr.",
        "Bhai inflated number bolna hai toh 10cr bolde hafte ka. \n/Jk\n\nI respond with kaafi mil jaata haiz ki kya karoo nahi samjhta toh Ghar pe thoda, savings me thoda, trading me thoda aur baaki jeene ka thoda spend hota hai.\nAap kitna kama lete ho, (mami, mausi, bhabhi, etc ko kuch dete ho)\n\nGive vague answers and ask to the point hard hitting questions they will take the hint or get offended. Sometimes it's okay to offend some people cuz petty log cheezo ko pakad ke rakhte hai, khud se cutoff kisko karna ya bhav nahi dena dikh jaata hai.\n\n/Ps. Discussion salary, benefits and everything should be more normalised imo. No harm unless the degens are there",
        "Haha more or less CTC is a problem! The Q&A session always remain, worries uncles and aunties.",
        "its Lakhs per annum, one lakh is hundred thousand aka 1,00,000 rupees\nso 10 lpa would be 10 lakhs per annum",
        "I just say, theek thaak hai, kaam chal jata pura, then they generally quote a number as question, which is theek thaak according to them, and I just say yes to that, which is always way less than what I get paid.\nOver the years, I’ve seen that relatives will expect you to help them during money problems if they find out that you earn more than their metrice of enough, and property division ke time bhi tumhara hi katega because you earn more",
        "That's exactly what I say -\"I earn enough to spend and save a bit with your blessings\" and join my hands while saying that. They usually understand this as my boundary and don't pester any further.",
        "\"do waqt ki roti kha lete ha itna\" ahh reply",
        "Next time start with this \"not much but in between 60-80 LPA\"",
        "My cousin was beaten up by his father, because his father somehow name to know my salary. 🙁",
        "How do you earn so much bro ? What kind of job are ya doing bro ?",
        "It's gonna backfire spectacularly when one uncle needs money and asks your dad .. and then days \"your son earns 60L can't you do even this much for me\" . Avoid salary discussion, just say I get enough to afford food and accommodation and be done",
        "Aaja Ahmedabad mein, bina jaat bataye ghar kiraye pe bhi le ke dikha, kharidna to durr ki baat hein\n\n(T) Come to Ahmedabad and rent a place without disclosing your caste, (forget about buying)",
        "Bro my dad is exactly opposite! I want to switch for so long and my dad is like.. if it’s just money no! Dont switch, sort priorities first you want to give up on tennis or your easy routine the “WLB” at the cost of 3Lpa more? Not worth it.",
        "When you see him next time, just tell you got promoted and your new salary is 50 L. Let him stew.",
        "The only correct answer is \"enough for my needs and some savings\" (or, if you want to be snarky, \"₹1\"), unless you *know* it's more because they're looking out for you (e.g. 40L sounds about right, or _with you skills you really should ask for 60_)\n\n\nThere's also the angle of who to ask money from if they're short. \"oh you make 40L a year, surely you can spare 50k\". ",
        "bro don't! XD they'll come to ask for money someday. you better keep your money safe from them. Your money Your Rules!",
        "40LPA is a fair package why do you with such a package hesitate to tell. \nI would’ve brag it.",
        "...racist?",
        "They are assessing how much respect they should give you..",
        "Initially I wud openly tell them my CTC thinking that they are asking casually. But now I understand they r judgemental, better way is to say mil jata h achha thik thak.",
        "Just say 6. \n\n\"6 LPA?\"\n\n\"No 6 inches\"\n\n\"What?\"\n\n\"Indirect kyun pucha uncle, maine direct answer de diya\"",
        "The point is not that it is a fair package. Point is that it is my personal stuff which I dont want to disclose",
        "Never knew this side of Gujarat.. :(",
        "~~Wow, under which rock are you living?~~\n :D \n\nIt's well talked about and very well documented fact.",
        "this is a common practice in Indian households, to belittle their own son, and praise sister's/cousin's sons.\n\nI see, it comes from the parent's own deep rooted inferiority complex, which they unload on their child, and belittle him/her.\n\nEven though you're meritorious than their nephew/niece they'll still try pulling you down in one or other situation.\n\nBest is to assign Zero to their opinions for your own peace, when you know you're better.\n\nPS: Indians only look at the money you earn as a metric of success. \n\nWhereas every individual can have his/her own definition of success.",
        "As a person working in govt, these uncles never ask me this, they rather show respect in a very envious way. I'd rather have that corporate money than this false respect tbf.",
        "~I know it very well~ :'(\n\nI choose to stay ignorant...",
        "Just give different numbers to every uncle every time they ask and leave them very confused",
        "Bhai, I am staying in Gujarat for last 20 years @Surat. Previously I was staying in Mehsana. I didn't face any atrocity and neither any body asked my Jaat / caste. BTW, I am from Bengal and doing a job in MNC.",
        "aunts too. She just asked casually in front of everyone. After hearing the number she was like I should help my cousin too to get a job",
        "2 waqt ki roti nikal jaati hai. Baki 2-4 hazaar ki saving festival me kharch ho jato hai.\n\nThis takes care of most of the nosy ones.",
        "Where can I find such men?",
        "That's a dream salary and I am sure you've put a lot of hardcore work along with great grades from a great university. But what do you do for a living?",
        "Out of all this your sister is the one with brains. I won't lie I have a big brother as well and because he's the older one people generally know him more than I do and I can't be more happier about it.",
        "I remember when I went to meet my boyfriend’s mom for the first time, she asked me kitna kama lete ho. It felt a bit weird.",
        "I am born Ahmedavadi and what you says is completely wrong. I can show you ads and billboards for real estate, totally discriminating based on the caste.\n\nJust because you are an exception doesn't make you an example.",
        "Make a post mentioning you wanna make friends or you're an F.\nMost likely they'll pop up.",
        "Next time when someone asks how much you earn and you don't want to share it, just reply \"Enough\".",
        "I told one such nosy uncle that FBI is watching over me and that I can't disclose my salary as it is legally forbidden.",
        "I was kidding but thanks for the reply! XD",
        "Yeah, next time some uncle asks you that just say you have a \"handsome package\" 😌",
        "Yup. I am quite young, compared to my cousins. I have a cousin who is overweight, and a general slouch of a human being.\n\nStill it's unbelievable how casually people like my mother use a casual condescending remark as the ice breaker. Atleast the last time I was sure to reprimand her bullshit. My god that woman's jealousy and backbiting are a major cause of my fucked up head.",
        "Bro don't do that, they will die of cardiac attack 😆",
        "My answer is Thik Thak Hai CTC uncle",
        "Oopsie haha.",
        "Main to Bol detach 1 crore hai",
        "Kyun ki unko Kitna kamathe ho bolte hai Islie amko ctc bolke puchte",
        "Yeah good plan. Then they will expect you to pay for things or ask to borrow money. Tell them an amount way lower than actual and then ask to borrow money. They won’t interrogate you on salary any more.",
        "I love fuckin around when they ask shit like this. Always give them a higher number and watch jealousy take over them 🤣",
        "I have started drawing lines whenever needed. Just like the cockroach ones.",
        "Just say No and get the popcorn ready (with caramel of course)",
        "Correct .. I made it a point to not tell my parents my CTC early on in my career and they don’t bother too much. If anyone asks them they just say he earns decent. Also I am an entrepreneur and my income varies a lot and I am potentially one of the highest tax payers in my T2 city but no one around me knows other than my CA.",
        ">Next time anyone asks me i will say 60 LPA \n\nPagal hain kya. Quote it so low that it should contradict your lifestyle. He should realise you are being sarcastic",
        "just say its confidential.\ni usually tell them 50 % of what i earn.\nif you earn much they might ask money to borrow.\nits better to take sympathy then lend money.\nin this way they dont bother me to pay for unnecessary stuff.",
        "Once an uncle asked me \"Aap Kitna kama lete ho?\" I replied coldly \"Sharad se duguna hein mera\" Sharad is his son. \nThat man never visited us again.",
        "Between colleagues yes. Family is asking just to benchmark and brag",
        "7 karoooddddd",
        "Classism maybe?",
        "Bro I always respond 10k per month, if they say ki last time bhi wahi bola tha toh I increase it to 12.5k. I keep it consistent.",
        "OP EARNS 40LPA FOLKS. If anyone couldn't figure out.",
        "I had a random uncle in my building meet me in the middle of the street and state loudly how much weight I had put on and how my cheeks are chubbier for a good 5 minutes. I am a 31 year old married woman.\nShocked disgusted and unable to respond in that moment, I left.",
        "When someone ask me something like this, I just put a. Exaggerated expression on my face and say it is a lot !!  Worked for me till now",
        "Nothing, they are failures in life, hence they try to feel accomplished by projecting themselves on their children.",
        "Unfortunately my parents are also like this...too much invested in other's business😭😭",
        "This will happen you cannot avoid it, make sure you are telling 60% of your actuals if it is utterly necessary else tell them \"bas uncle ji daal roti ho jati hai uppar wale ki kripa se, kitna bhi kama lo salary to kam he padti hai aajkal.\" then divert talk to all the expenses and all...",
        "They ask just to understand the market.  Someone might have cited that you earn a lot. 40 LPA is a big number.  Secondly older people dont see it as offense to ask salary.  They dont judge anyone past 10 lpa.  Since thats a lot of for them.\n\nYou are 40 LPA. I am Mechanical Engineer I started a 3.5 LPA and till first 7 years in my career I reached only 5 LPA.  When you are asked at that time and compared.  You feel not bad but like you whole existence is useless.",
        "Not inflated. Always say ‘Itna kama leta hun ki sukoon ki do roti kha leta hun. Hai na uncle, or kya chahiye life mai? ‘ with zen face \n\n\nSay it with confidence. \n\nIs jawaab se logo ki bohot jalti hai. \n\nKyuki they do not get number they seek for. They assume either you earn too much that you don’t wanna speak it loud. Or tooo less yet happy .",
        "I, too, don't share it with my parents. They understand that I earn good, but they are clueless about my salary.",
        "When I get asked \"Kitna mil jata hai\" and the person doesn't get the hint I don't want to respond... I reply with \"itna ki mujhe paise k liye shadi karne ki zaroorat nhi\"\n\nI'm the youngest amongst all my cousins and unmarried with the age thats considered \"too late to be married now\" in my relatives' perspectives. All my cousin brothers got married receiving lots of \"gifts\" and cousin sisters got married giving lots of \"gifts\".\n\nThis leads to a bas taste in their mouth and embarrassment for my father who then jumps to salvage the situation.\n\n💁‍♀️",
        "Just tell them a huge number and say it takes a lot of hard work to reach here, your kid will be able to earn this much too if they work hard enough and then walk off",
        "These are the same kind of men who during school time used to peek in toilet and compare dick size.",
        "I usually say it is confidential and brush it off. Because if you say any x, they will come back with some y >>> x. Ridiculously difficult to understand the badgering though",
        "If u dont want anyone to budge u for money\n\nThen tell low ctc\n\nIf u think like u wanna flex it\nThen tell higher ctc\n\nIll choose former xD",
        "If you can be adamant enough to not tell them how much you earn, you can also tell them no when they ask for money. But if you feed their ego by saying you earn less, they'll ask someone else too, in hopes of feeling that ego boost again. Why give them that satisfaction?",
        "\"I am comfortable and I am not allowed to disclose it. I could get into trouble.\"",
        "Just say itna kama leta hoon ki do bhainson ka doodh pilati hai meri maa 🤣",
        "Ha bhai kitna hai?",
        "“I’d prefer not to share my salary details, hope that’s okay with you” say that with a smile but firmly. In India we are expected to give a reply everytime someone asks us something. \n\nNot true sometimes we don’t need to give info just because an elderly person asked for it.",
        "I have found great solution for this. Always say 50$ per hour. I work with international clients and they pay per hour.\n\n\nSo if any uncle or annoying aunty asks i just confuse the hell out of them\n\n\nMy normal answer is \"50$ per hour one client and 30$ per hour second. It fluctualtes depends on number of hours worked\"\n\n\nRepond to their second question - so approx how much i make\n\n\nMy answer \"somewhere between 10 LPA to 40 LPA. Depends on retianer amount and hours. Different project has different hourly rate some are fixed.\n\n\nItna irrirate kr do unko wo smjh hi na paye aur bhag jae",
        "When you share your salary with anyone, they will categorize you and pass statements about what you can afford and what you can't. So you will start feeling the heat. If you earn good and everyone is aware, there will be high expectations about how you live your life, and they will call you chindi if you choose to live with simplicity. \nSecond is even worse place to be, people will look down on you because of your earnings and you will be given low importance. \nThis is my personal observation. So I never ask for anyone's salary, I am not even aware of my close friends salary , and I never disclose my salary to them, forget about disclosing it to my Dad's colleagues. Never.",
        "I just refuse to answer. They can go fuck themselves. Especially some relatives, If I say them smaller number they will judge, get cocky and try to demoralise if I say them decent numbers they will try to fleece me.",
        "Hahaha oh God such an Indian thing to do! my family was opposite money is never discussed. I still don’t know my dad’s salary 😂",
        "That only applies to Sthan I mean Dhan🤣.",
        "I simply say \"Bas kharcha paani nikal jaata hai\" and repeat until they give up",
        "Why do Indian gen zs get easily offended by every single thing? 🤔 It's a question, answer it, don't answer it, upto u. Move on and focus on more important things in life. 🤦🏼‍♀️",
        "This is so intrusive. Just like so much everywhere in India. I wish one could be sarcastically yet respectfully able to brush off this inquisitiveness until it becomes too insistent when a more direct approach is needed. I am exercising a direct approach right now in a different context.",
        "just say \"bas kharcha nikal jaata hai\" and move on.",
        "Be a man, these stupid stories don't need to be cared about.",
        "And that’s bad",
        "I am home for a few months. I am 29, left my job and going to start PhD soon. All the uncles and aunties are so intrusive. They want to know everything from money I was making, how much I must have saved, when am I getting married, what my salary would be after PhD. One of my uncles told me to get married soon so I can concentrate on PhD and not have to worry about doing chores at home.",
        "To measure your net worth",
        "And since they’re Indian they can’t have a real dick-measuring contest since there would only be losers 😬",
        "You should say “enough”",
        "A few years ago I was asked my salary by the kind of motor mouth relative everyone has, in the middle of 8-10 other relatives.\n\nI replied quietly \"Ninety Thousand\".\n\nRelative: \"Aap milo mujhse aa ke, kuch help karta hu job change main.\"\n\nI barely even know the guy. \n\nMe, embarrassed, speaking in a low voice so no one thinks I'm bragging: \"It's 90 thousand a month.\"\n\nRelative: ....\n\nHe did not mouth off for the rest of the evening.",
        ">He even said the average placement was 40LPA at the college \n\nI laughed so hard at this. Coming from a top 10 ranked IIT ,Less than 10% of IITians earn that. If that's the case people would prefer ISI Bangalore over IIT Mumbai lol.  Your uncle is definitely spicing up the numbers",
        "Better to quote, enough to make my parents retire, lol....",
        "Might just say \"Jitna milta hain usme mai bohot khush hoon\". And after that if they still poke and ask you a figure just keep saying the same thing over and over \"Arey uncleji Jitna mil raha hain usme khush hoon bas\". \nI know to some close relatives who have no boundaries we can't really tell anything much to their face, but we can maintain our boundary, BY making it known to them that we aren't interested and will not give an answer to a question which isn't their concern.\n\nWhether I might learn less or more, no matter I wouldn't let even the range of my salary known to people, cuz if it's less they would think less of us and more then you know unki nazar hogi.\n\nAt the end if they say \"arey bacha batana nahi chahta\" , just continue your work, give a smile, get up and go from there for a while or just change the topic.",
        "One of my friends keeps asking the same question. I don’t want to answer, but she keeps repeating it. I don’t like being asked such questions.",
        "I tell “enough to manage my expenses” 😬",
        "best jawab diya hai- jitni zaroorat hai, utna milta hai. as if roz bhagwan poochhte hain- kitna budget hai aaj ka? fir malik se utna hi dilwa dete hain",
        "The best answer according to me is - \"Bus uncle itna package hai ki Daal, Roti aur Kiraya nikal jata hai\"",
        "You should compare him with other dad's and give a taste of his own medicine. Like that guy's dad gifted him a bike/home etc.",
        "Speaking of boundaries...\n\nWait till you have a child and travel by train with the toddler. Every Unkil and Auntie will want to squeeze her cheeks and feed her god-knows-what!",
        "Looking at the comments, no one is giving a fuck about the CTC so it’s alright",
        "I tell them there is an NDA between me and the company and thus can't disclose the amount. I tell them I earn enough to live happily and peacefully.\n\n\"3 waqt ka roti, kapde and makan aa jata hai. Itna kaafi hai\"",
        "Time has changed. \n\nAb log \"Rahul naam toh suna hoga\" ki jaghe\n\n\"Rahul kitna kama lete ho\" pe focus hai.",
        "Where are all these jobs offering so much money re",
        "https://preview.redd.it/yj6lcfcjkpsd1.jpeg?width=482&format=pjpg&auto=webp&s=8b7ea663931d4badefaa74992657c13484c1116c",
        "I just tell people really low number and let them have their ego satisfied. I just secretly feel happy that no one knows I make a lot more.",
        "Never undersell yourself, always mention a number above 1cr net after tax",
        "i hate this thing in our indian culture people poking there nose in other's life. Whenever any of my relatives asks this question i give a very blunt reply, i get enough money to sustain myself and i am sorry i cannot tell you the figure. I dont give a shit how they feel after this.",
        "It's a generational difference- while they battle on respectability, us youngins ask stuff like \"do you have pets\", \"are you a cat person or a dog person\" etc",
        "😹😹😹 good analogy",
        "We didn't ask for OP's CTC but he told us all (anonymous users) so casually. Why do Indians do this?",
        "One doesn't say any figure in such situations, least of all the real salary. One tries to portray oneself as humble and get by with \"bas, guzaara chal jaata hai\" (or the equivalent in other languages) and a laugh.",
        "Can somebody tell how to respond to such questions without being rude but not even sharing the figures",
        "So you were offended when some uncle asked your salary (and I don't blame you for that) but you have no qualms about openly boasting about it to thousands of strangers on the internet.",
        "I've started answering. \"Acha hai (Its' good)\"\n\nand when they ask \"fir bhi kitna\" - (still how much)\n\nI reply - Its' quite good!\n\nby the third reply, the conversation starts getting awkward, and i brush it off with a smile!",
        "You are among the few who realizes the importance of privacy and sanctity of these boundaries. When you become an uncle, you will do much better. But there will be still a large group of Indian uncles who don't know any better. In other words, there are several people of uvuncler age today who also are sensitive and do not intrude. It may just be that such folks may not be among your dad's friends.",
        "Haha, tell them an astronomical amount like 3Cr and destroy their mental state.  While you are at it tell them you got an opportunity to go to US but only got 40% increment, so waiting it out until you get atleast 80%. \n\nMake them suffer in silence.",
        "Unhinged uncles know no boundaries.",
        "So that they know who to borrow money from",
        "Every time when I visit my hometown, there is at least one relative or parents friends who ask this question. And my answer every time has been , enough to manage the city life, parents expenses and save some for future. When they ask for further details I tell them the same thing above.\n\nWhen they are asking this question, be sure they want to know yours because they want compare with their son or daughters. \n\nAnd when they try to be picky and get more details I straight forward say, if it’s less than your son/daughter then you will feel happy else you will feel sad. And I know I don’t want to make you feel sad😁😁 \n\nThey understand that and stop further questioning.",
        "You said 40L? If you are earning 40L you should say 14L when asked",
        "with uncles like this your salary should always be 3lpa",
        "and food is 2lpa",
        "Pretty much sure ISI Bangalore average placement package is not 40 LPA. People get placed well with good package, but, no, 40 LPA is definitely not the average.",
        "people who go to ISI are passionate, they do not care about things like money. They often go towards research. They value respect more than money.",
        "After 12 years of experiences I will advise you never give them inflated number those people are only want to put other people below them. I always deflate my no. Around 50% than see them smirk. \nListen them to boast about theirs. Than give them cunning smirk without telling them they will know you played them and never ask CTC again ever.",
        "Lmao, uncles stare at any woman who passes by like monkeys, but they like to moral police them saying 'kaise kapde pehente ho'",
        "They directly ask for in hand salary",
        "Next time say this - uncle kaha lage hue ho, sun ke apko constipation ho jayega, rehne do! 🤣\n\nIt’s a common Indian society interaction technique to bring you down to their level, and then berate you! Never-Ever play a game to others terms! Let them guess..",
        "In India, people access each other's value by numericals. How much you earn, how many cars, houses, etc. He or other Indians ask these because they think they can. Whenever someone asks you how much you earn, always tell them a false number much more than the reality. If they want to be like this, have fun with it. Tell them you are earning 1 crore pa. And laugh at the end or wink at them. 😆",
        "70% of population of urban Ahmedabad is moving out of the old Ahmedabad where they have seen how other people influence and now they don't want to be with the others again",
        "So that they can ask pic of your bob next time.",
        "Because you can never accuse Indian Uncles for Subtlety",
        "Well I had one such incident in Bangalore as well. He asked if we were Brahmin. I mean casteism is pretty much prevalent everywhere.",
        "Literally how they determine your worth as a person so they don't even see anything wrong with it!",
        "Damn, dude thats right, I am gonna tell everyone insane inflated numbers and tell them like it's a secret and I haven't told others",
        "It’s a generational thing. We’ve become more and more reclusive and careful about how we interact with people. But 40 years ago, no internet no phone, talking about your life and everyone else’s life was the key form of entertainment. While some of that has been replaced, the habit is unlikely to fade away in that generation. Today it’s offensive, then it was an actual ice breaker / get to know you sort of thing.",
        "What do you do? From what I know with a master's degree and 6 years of experience 40LPA is just about right, anything less and you are underpaid.",
        "OP, next time same situation happens, just say: I think ur son or daughter is lying to you. There’s no way a fresh graduate will earn the same as an experienced professional (unless the offer was from Google or so).",
        "Congrats OP,you have achieved Sharma ji ka beta status... 😂",
        "Don't know about them chickas my sorry asss is feeling a bit let down though... It's good to know what's going on in the Indian job market.",
        "In the US here.  Appllies everywhere.   When you dont tell them the get offended.  I think it's just culture with that generation and especially true more of those that have come here from india no matter the age.  Early on in my career I've divulged this information only to be ridiculed.  I make close to 170k USD annually and they dismiss it as if it was a small number.  No number will satisfy them unless you makeup some insane number.  I just don't answer any questions on salary anymore.",
        "Exactly!\n\nI had said politely \"personal finance ka mamla h I don't discuss this with anyone, sorry.\"\n\nBhai.... Face dekhna tha! \n\nEven then he was like firbhi roughly then I gave the broadest range. 🤣\n\nKaro beeth k guess.",
        "Thank god, I don't believe in caste system, mujhe affect nahi karega 🤣",
        "You nailed it. So many moments I wish I had a quick retort that would make them feel like shit so they’d never cross a boundary with me or anyone else. I’m waiting for next time lmao",
        "Bro you are still earning low if you’re living in Bangalore or Mumbai or Delhi. I hope you understand that.",
        "What was their reply",
        "Agar aisa hua toh taro mairo bhairo bolke nikal jaunga (I know the language but I'll act like I don't know)",
        "It honestly depends on what you do . You can have a phd w/6 years of experience and still earn less than half of what you quoted (40lpa). Not all professions scale the same way, please stop living in delusion",
        "Panauti hai tu",
        "What did you do your masters in? i did a B.E.",
        "Sr Data Eng",
        "I say the lowest respectable amount (30k per month) as I am afraid of people borrowing money from me due to bad past experiences.",
        "No no. Just tell them a lower amount. Like pennies. Tell them Your salary is 1.2 LPA and that you are planning to start a business. “Uncle you must have saved crores in all these years. Gimme a zero interest loan of 40L, I’ll pay you back in 5 years”. Keep doing that 3-4 times and watch them run at the sight of you.",
        "Let me correct your last sentence for you - Openly discussing salaries is a good thing since it tells you about market standards. At least you won't be low-balled in interviews. \n\nJust because people don't discuss salaries is the reason why now we must pay out of pocket for analysts to share salary reports every year (such as motion recruiting). \n\nJust because people don't discuss salaries is the reason why it has become taboo. \nMaybe we could learn a thing or two from your uncle.",
        "mere paas to hai hi nahin 😎",
        "Still not racist",
        "it's true indeed. They bring this mindset along to other places too. Gujaratis in Mumbai love to gatekeep. If they live in a housing compelx, they will make sure to populate it with Gujaratis/Marwaris only. Fucking retards.",
        "Apna to ek hi jawab h ... Athanni Chavanni..",
        "just tell them a low number so that they get happy and sense of pride that their son is earning more. you keep earning and enjoy your peace✌️",
        "I didnt say I am earning a lot. It is good enough for me currently. But I also know there is a huge skew in the job market . So you will always feel you are not earning enough. Ye sab cheezo se upar uth chuka hoon  ab.",
        "I just say - \"Bas guzara ho jata hai\" and watch their face with innocence.",
        ">you guys are not my uncle\n\nAreh beta!  Kaise esa? \n\nWoh uncle seh achhe hai hum uncle aapke. 😂",
        "Amdani athanni kharcha rupaiya   is the only right answer",
        "Totally bro ...",
        "Arre uncle ! Aunty se milwao kabhi. Batata hoon Thailand trip pe kya kar rhe the aap",
        "Apne pe kabhi nahi lenge magar apne bacho ko zarror sunayenge",
        "It’s like measuring your brick size by assessing your market price.",
        "sabko apna wala bada lagta hai",
        "Work hard to the point where revealing your income is not an embarrassing confession or a misleading lie, but a proud flex.",
        "My usual response is \"bus sukh shanti se jeevan nikal jata hai\"\n\nOnce an uncle asked multiple times so I asked him, \"Ram (his son) ko kitna milta hai? Usse kitna kaam ya jyada hai me btata hu\". He went mute after that.",
        "When uncle’s ask how much do you make? I tell them - humko kya hai jee hum toh jhola uthakar chale jaayenge.",
        "There are fields other than STEM",
        "Wao ! Hade for honesty! I guess this generation has some serious issue guys. We need to fix ourselves before blaming others. I am not supporting them, i am just saying thats how it is- try to see some beautify is something at times instead of just hating everything.",
        "Agreed! Never said it isnt but we can we fix them is the question, which is a no in this case. So better see what is good in them",
        "The correct answer is \"roti khaane layak kama, leta hun\"",
        "This. That's it. Boundaries. I learnt it the hard way. No one teaches these things.",
        "I don't know why all the other answers assume the worst in people, but at least from my own experience - Indian uncles who ask this question are always looking for a groom for their own/sister's/neighbour's/watchman's daughter.\n\nIf they're asking you CTC it's to enter you into their mental database on which they run their matchmaking algorithm.",
        "Bhai bandi hai meri 💀 Uska kya",
        "One  of my uncle brags how his daughter gets a stipend of a lac per month, she's my cousin too, he motivates others to study hard etc, on the other hand, she's totally burnt out, wants to quit and has lot of health issues but he doesn't care about that  These uncles/aunts gets some sort of orgasm talking about your CTCs and comparing them with others and belittling you.",
        "I tell half of what I earn...too much crying by everyone & hajam nahi hota hai unhe sunke",
        "Average uncle convo.\n These convo are either 100% vibes or just like what op got",
        "Don't over flaunt your salary just to win a dick measuring ego contest.  Once the world knows you earn good first they feel impressed and some of them feel insecure. They will start asking small loans from you which you will find hard to refuse. In case you refuse they will call you egoistic, prideful and bad person. Tell your parents also to maintain a low key.  It's better to avoid the fuss. Spend, save and invest your salary wisely.",
        "You don't need to tell inflated number, in fact you should tell if at all, very less number.\nTry to avoid answer directly as much as possible like 'kaam chal ja raha hai big city hai, high expenses etc' , similar to like your acquaintance tried to avoid telling exact figures for his son.\n\nIf nothing works out tell some random but less number.\nAlso you don't need to be disrespectful, they are your parents friends.",
        "Uncle tera hi market badha re hain, chod gayi bandi to option rahega baad me. Aajkal arranged marriage ki market bahut kharab chalri hai waise bhi, accha hi hai pipeline bana ke rakhna.",
        "Never share your CTC. This will turn into “arre aapka beta toh itna kamaata hai, aap udhaar do/ kharch karo….”, in blink an eye. I’m from a notorious northern state so never know when someone will abduct my father for a ransom equals to my CTC, lol - kidding but as a general practice, never share finances with outsiders.\n\nI have similar uncles and relatives too, when they ask - I say “kaam chal jaata hai”. Some hard asses don’t let it go and keep asking, but I don’t relent. The looks on their faces is worth enjoying 😄",
        "Just reply w 'a comfortable amount/bas ghar chal jaata hai' unless it's an uncle whose daughter you might be interested in.",
        "Aukad janni hoti hai",
        "Usine bheja tha muje!  Tu kya batayega!",
        "Bhai, this never changes in such households. I am from a tier 1 college, earning \\~50L pre tax, with 4YOE. I also get same shit from my father. So, my point is that it has nothing to do with how much you make or how good you are doing. Some people just have this habit of putting their children down. What I have observed is that they are more concerned about other people's opinions, rather than their own children's happiness.",
        "खर्चा चल जाता है !\n\nGive a very low number, like 10% of what I really make. In reality they want to feel good about their children because comparison is important for Indian parents. It makes them feel better. And I don’t get to reveal what I make.",
        "you are so right",
        "THIS.\n\nEarning enough to cover the expenses should be the right answer for such people.",
        "Say 2crores",
        "You should've said ew. Aapka beta below average kamata hai kya? Ew.",
        "People are absolute shameless these days , they just know to flex on their achievements and make others feel small.CTC is not just one thing they flex on other things to like we got a property there , we went to so and so country for vacay etc",
        "Abe chip kar show off. You and the uncle aren’t different. ",
        "One of the major reasons why I left India was this. I was considered as a rebel talking back to these sort of uncles and showing them their position. The fact that indians thrive on unhealthy competition and jealousy is beyond my comprehension. \n\nNext time if the uncle says “kitna mil jata hai”, just say none of your business. You will feel bad at first, but will eventually realize that these sort of interferences in your life has reduced.",
        "I just tell them. 5CR. Then add monthly. Good to see their faces after.",
        "You ask them revenue and profit details first",
        "average placement of ISI Bangalore masters is not that high. Next time you meet him, ask what branch he is from. From what I know, average placement for ISI Bang is around 12-15 LPA, with exceptional students landing 25-30 LPA. The college itself is not placement oriented, hence please stop your uncle from doing such bragging while we actually publish previous year placement and package records online. \n\nPS: I am from ISI Bangalore hence commenting.",
        "I just say it’s close to 1Cr and every uncle/aunty gets very awkward 😂",
        "Cause ur value in front their eyes is based on the amount of money u make,\n\nIt’s not there fault, it’s our cultures fault",
        "Remove one zero and that's my CTC. It's insane to imagine that somebody gets 40LPA",
        "fr! i know so many people well into their careers making a fourth of that. it's all about the perceived value of a profession and available labor pool",
        "You have a thing or two to learn from your sisters.",
        "Always give a range but never tell exact number.",
        "Why doesn't it sit right? Our company gives a base of 40LPA to fresh Masters grads too, CTC easily crosses 75-80. You wanted to flex, but couldn't lmao.",
        "How do you create that boundary with your parents? My parents enquire about EVERY aspect of my life, including what I ate for every meal.",
        "the result of limiting your personality to your kids",
        "If an Indian uncle is working in the IT Department, then how should we answer this?\n\nAsking for a friend",
        "yes they probably meant classist",
        "Being from the UK whenever I visit India that is the first thing I always get asked, no how are you, how was your trip, haven’t seen you in ages, straight to how much do you earn in the UK.\n\nMost Indians seem to think that everybody earns millions and that the streets are paved in gold!",
        "Whose boobs are bigger? It’s the same shit",
        "“Boundary? What’s that?” - every Indian uncle/aunty\n\nI think they do it so they can judge you. The more you earn, the more valuable your opinions and forgivable your sins. \n\nYou’ll never see them treat someone with respect who earns less than their own son/daughter etc.",
        "I'd rather answer lower. Inflated figures are also being heard by people around you. And Indians are nothing if not entitled. You'll become the default lender of the family.\n\nRather answer lower, smile and wave, and not to take the \"arey beta itna kam\" personally",
        "bol do 220 volt aata hai",
        "If I were you, I'd have said 20LPA. Leave alone you rounding it up, but you would say 60 in the future 🤦\n\nJust live your life man",
        "coz it gives happiness infront to their goofy ass",
        "Just say - ha mil jata hai thik thak and bounce, why even give them any figure lol",
        "Wait for a year, they will start asking you money for hospital charges.",
        "Indians are the most racism culture in the US.    \n\nEver see an African American at one of the Indian witch companies ?",
        "Question- why inflate the number, is it an ego game where you have to be on the top?\n\nPeople are inquisitive. If I don’t want to share, and I know they are asking to measure the social status, I would downplay. Quote something meagre just for them to be happy.",
        "“ Well Thats  none of your business uncle , but I assure you , it’s not low””",
        "Kuchh shlok bolke dikhao",
        "Aham kalam, twavam kalam. Russian gulabam.",
        "Salaries should be disclosed. So that people get treated equally for pnce",
        "Brother I'm in the same boat as you. 3+ years of experience but still far from 10 lpa. I keep hearing taunts from parents. Switch is the only option but in this market it seems so hard these days. What are you planning brother ? Dm me maybe we both could help out each other in job hunting",
        "Bhai a number is not the goal. Goal is to be satisfied.",
        "See beta, that guy got this much of salary. And thanks might use some bad words towards you though. Like that bacha got this much, why can't you?",
        "Good for you man 🙌 .",
        "Uncle ghar  hai paisa hai gaadi, do jodo me ladki bhejo ladki hui hamari 🙂‍↔️",
        "You don’t have to answer. I just respond, it’s a decent amount. My parents also do not know my exact salary.",
        "Finally we are comparing boobs now . Too much dick comparison was going on",
        "I always dodge the question. Apart from my parents and my partner, no one else needs to know - and only because I have a healthy relationship with them and it helps to plan life. \n\n“I get as much as I need”",
        "I usually give a vague answer at first but if they still persist then I quote a figure 5-6 lacks less than my CTC. Never tell your relatives how much you're making, you don't know when they'll ask for money. Uncle's ego gets satisfied knowing a low number, my ego gets satisfied in actually earning more than what I've quoted. Win, win!",
        "This is the same way they ask about your kids percentage marks this year.",
        "Because they are stupid.",
        "Never tell anyone how much money you make. If for some reason you feel compelled to then do the opposite, give them a really low number. You can rest with the fact they will not be asking you for money. It's none of their business. ",
        "Then they'll reply \"Haan avg 60 hai\".\n\nNever say specifics.",
        "I lived in the urban Ahmedabad until last year. One of the poshest, most cosmopolitan areas too. There were people from all castes but not one muslim.",
        "Zyada se zyada potential recruiter ko batao salary, not rishtedaar. \n\nI remember when I was asked when i got my first job. I just said 'Nahi sorry ye toh na ho payega, mera bas chale toh ghar pe bhi na batau, itni kam hai....' with a smile.   \n  \nNobody asked me this question after that",
        "How to tackle such situations is the question here!!!!!\nI really need an answer to this \n\nI too have a besharm fufa who would outta nowhere ask what is my salary???? \n\nI mean wtf???? \nUghhhh! This post was relatable",
        "Most of them couldn’t counter it. One of them (my aunt) said she still believes Indian culture is the best in the world. According to her, ours is the only culture which cares about aging parents. So thoda curiosity is fine apparently.",
        "Muze to raste se jate jate log puch lete he mahine ka kitna",
        "bcoz they have niece and daughters to marry off... my father in law used to always ask me about my package everytime i changed jobs...",
        "My approach is the same. There was one incident though. I was invited by an uncle who is a family friend. The uncle himself is a self made man and a very nice guy. So, we were sitting at his place and one of his neighbours joined us ununounced. This neighbour was a retired judge and he asked for my salary. Initially, I didn't respond but he kept asking and the situation became awkward and tense. To diffuse the situation, I gave him a figure that was 1/4th of my actual salary. He then went on a rant about his son rejecting a govt job and instead joining private sector. In his rant, he disclosed horrible stuff he used to do to people who were businessman. I believe he missed the power and was a psychopath. I sucked it up at that time to save trouble for the uncle later. But yeah, I don't disclose in the first place and if I have to then I give a very low figure.",
        "Huh never said that's my salary, that's what my company pays for Masters graduates, it's really the market rate especially if you're from ISI Bangalore",
        "💀  Atleast ghante ka kitna toh nahin puchte",
        "women too!!",
        "Tell them an insane number like 2-3 Cr.",
        "they will happily tell u incl encashed leave and what da they receive and how the indian govt fleece them",
        "Our society needs at least few more generations to mature and learn some basic manners and boundaries.",
        "mumbai too",
        "Then good for ISI peeps. Tbh I dont care so much kitna mil rha inko",
        "Indians in general lack boundaries. Commenting on salary, job, weight, childlessness, skin color, hair etc. is fairly normal. I have to cultivate inner fortitude for about 4 months every time I visit family back home. I’m not kidding.",
        "In India nobody is taught what is basic etiquette in conversation. Parents dont have the time in such a competitive society to impart this knowledge and the less said the better about schools.",
        "Ye reddit par nai bolna tha 💀\n\n\nNow turn off dms for your own sanity",
        "I ask my dad the same thing. I tell him my friends dad's are making so much more what are you doing.",
        "The best way to deal with this is ask the uncle how much he is earning or how much savings he has. And then non chalantly tell them all your friends dad make more than them or have more savings than them. We should hit them back at the same place they try to hit us lol. \n\n\nThis is what I do whenever my dad asks me why I am earning less or some bullshit in this regards. I tell him modi a chaiwala has become the president and is earning crores everyday what are you doing.",
        "And then I can also feel pity for them for such a sad situation:\n\n“Uncle despite 30 years of experience you could only save this much”. Look at Sharma uncle ji who invested in plots and he’s worth this much.",
        "I usually do the other way. I dont like anybody gauging my financial ability. If i make 40LPA, i would say 25LPA.",
        "Just go with 1 Cr as base and add there is variable component of 20% to 90% stocks",
        "I face this often. I’ve stopped giving them numbers. Worst case scenario, give them a deflated number. Saves you from nazar🧿",
        "For some reason I read this in South Indian accent in my head.",
        "I can proudly say that I can refuse to answer such question with no hesitation to ignore further inquiries",
        "What is this CTC term ?",
        "Don’t over inflate. Make your self poor. Then they won’t ask you for money. Say that after the promotion I get 10 lacs! With a beaming smile. They’ll slowly slink away",
        "Honestly, I fucking hate such uncles. Similar to your story, some uncle asked me about my salary at that time and I hesitantly told him 30LPA(which is decent for 2yoe). But this uncle mocked me that it’s so low and what’s the point of so much of your education. I was also furious that my dad didn’t told anything to him and just told me to tell the inflated numbers from next time. \n\nFrom then on, I have stopped telling people my CTC unless they are my good friends. It’s good to discuss CTC with your peer group in a healthy way so that you are aware of market trends but I am not revealing actual numbers to any uncle. I just brush off the topic or if they insist too much, I tell them an inflated number.",
        "Funny that Indian redditors feel only uncle and aunties are doing that. Just go on most Indian subs and they are talking about salaries almost everyday. There is not much difference but yet uncles and aunties would be made fun of while it should be other way around at least they are asking known people you guys are shamelessly asking random strangers over internet. \nStop shaming oldies when you are doing the exact same thing in a different setting and yet you will have a non sense defense for it.",
        "My family members used to do this until I started making more money than them. Surprise, they never asked again!",
        "Whenever they ask always say, i do well for myself.\n\nWhen they asl but how much, say, good enough.\n\nWhen they insist, say your company has made ur sign an NDA and it would land you in trouble if you give details.",
        "> tactics men employ.\n\npeople who complain about ctc gossip are usually well earning individuals. \n\nPeople who live paycheck to paycheck don't care to post about this gossip  because they are insecure about their income levels.",
        "that is so true. Bhai shaadi ke baad bhi some will crib about how the wife snatched away her son. I am like aunty bada ho gya hai beta , sax karne ki umar ho gyi hai karne do bhai .",
        "yes. \n\nLPA- Lakhs Per Anum.\n\n40 LPA is equivalent of $47,607.68 USD, which is like earning $172,875 in Los Angeles. (PPP conversion)",
        "When I started earning, I had 6 lpa and my father's friend had 12 lpa so I got constant reminders that I was a failure.\nNow they don't know what I earn and never will, only people who should be aware of your salary are your  colleagues and significant other.",
        "Easy - lie",
        "This is the way. I've done this and then enjoyed not budging as they pressed again and again, their faces becoming visibly uncomfortable. Then they start sharing numbers of other people to goad me, to which I say \"bohat accha uncle\".",
        "I quote a number based on what I think, they think of me. Which usually isn't too much!  \nAnd the conversation ends up at - \"Koi ni beta, aaj kal market kharab h\".",
        "All uncles are also matchmakers. So they are trying ti judge your market value in shaadi market.",
        "Sundar pitchai's father isn't happy either.",
        "lmao the timing of this post is exactly on the day i got placed in campus interview.",
        "This happens to me. When no one is around me my mama(with a smiling face) comes n asks me \"kitna hua increment\"  and I'm always uncomfortable sharing. He keeps on asking till I give him the number.Any suggestions on how to avoid.Due to this I hate going to family functions .",
        "Don’t you mean prime minister lol.",
        "Typical Indian Unkil or Aunti whose highest point in their entire  lifetime was to make a kid and shove all their hopes and dreams into them. People like these are usually sad really.\nJust shatter their perspective like you thought you’d do by giving an inflated number, works the best. They stop asking. Or,  just say mahine k 3 iPhone ajate hai.",
        "Oh yeah. Edited the comment thanks lol.",
        "Plz have balls to say ‘’it’s personal uncle, I am very happy with what I am making” that’s it!!! If he insists, just move to diff convo.",
        "Well.. in future if someone asks you about your CTC and you are left with no choice but to answer them you can just try saying \"enough to live comfortably\" with a little smile so that it can make you seem not too rude also you will not be revealing facts about the paycheck. It worked for me might come in handy for you too and even after answering their question if they are still being Persistent and want to know the exact number..hey 40 LPA is a great number if you are working in INDIA or as you said inflate the number soo high they start questioning their own existence.",
        "Ladki hoke aise bol sakte hain kya? 😭😂",
        "Dude, my manager asked me ‘what’ I am on my first day. \n\nI’m an advocate. Working in corp law 😭🥰 \n\nyou’d think they’d be more aware/ sensitive considering their education and field of work but nope, definitely not the case lol",
        "Not even them, only you and Him.",
        "Their is the last generation _ have fun.\nThey will be extinct soon",
        "Its weird i already know this trick…… in my case it was college marks. ",
        "In general people at least in the same field should talk about CTC often. That's how you know how much more you can ask the company.",
        "!?! Really?\n\nOnly a few tier 1 mba and eng colleges can provide close to that for their flagship course \n\nCurrently , on paper 10 lakh Indians make over 50 lakh yearly and that includes non salaried professionals who would def be making the majority of this number. \n\nSo roughly 5-6 lakh salaried individuals r above that figure , again, majority of those would be having a lot more than just 6 years exp",
        "Bolna hota hai bas dal roti chalrhi, this is the way.",
        ">people saying I was offended , Nope I wasn't\n\nHonestly I would he offended. I would've worked 6 years to reach there and this uncle is lying to show off. Even top colleges in India does not have 40LPA overall average package. (I would've said that to his face frankly if I were you)",
        "Every situation doesn't need a comeback...a polite walkaway is better. \n\nAlways be respectful even if the other isn't specially if they are older",
        "i quote 5 lpa that too gets deducted after tax soo 3 lpa uncle😅😂. So that i can be sure that they never come to ask for money.",
        "Always say low, my dad thought me that",
        "My standard response is “more than your illegitimate son” does.  That usually forces the moti aunties gathered around to faint and I walk away pleased",
        "He lied for the same reasons you did, and similar reasons as you plan to next time. Perpetuating the cycle and complaining about it. Fascinating.",
        "Hey how did you got that much salary ?",
        "I did this a couple times (a bit more respectfully obv) and now nobody asks about my pay anymore. I'd say it's a win",
        "Just have the balls to say \"none of your business\".\n\nIf our generation can't say it, this shit will never end.",
        "My trick is say something around 1.4LPA. Its barely 10k in hand lol…this way you both are happy!",
        "Dude, I don't know why things like this are contests. This was in 2014, not so much domestic air connectivity as today and before I was leaving for US for my MS. Before leaving the town this Uncle called me to visit his family and I went. While speak we spoke about my travel arrangements, date etc. I got to know that the Uncle's son(similar in my age) is also going to VIT(Vellore one) for Masters. I congratulated him and we moved on with conversation.\n\nThe next day I received a call from the Uncle and we spoke for a bit. And he not so casually mentions that his son is leaving for his masters  on a plane and that too a week before me. So he will have his first plane ride before me. For the express purpose of flying, he and his family went to bigger metro 6 hrs away by train.",
        "Never ask a Man His Wage and Women her Age.",
        "It gets worse when you realize it’s really a sons d!ck measuring contest. Lmao my sons pp is bigger than your sons pp 🤣",
        "They don't care about being politically correct. They don't think it's an offensive question.",
        "Does this uncle have a beautiful daughter? Then definitely go for 1 Cr",
        "To inhand bara kar bol de.. bas uncle ki bolti bandh..",
        "Try backanswering with \"Tumhaari beti se shaadi karwaani hain....?\"",
        "I dont think they mean to be crude, unless of course they are Sharma ji and they compare beta's ctc to yours",
        "You should say 60LPA \\[haath me 25\\] that amount would shut up most.. It works for me..",
        "Na man that's too much..",
        "Out of experience let me tell you. The uncle would have flaunted his son’s CTC if that would have been more than yours 😂",
        "I always prefer to quote a much lower number.",
        "Totally relatable, it is so frustrating to deal. Happens with me in flights as well. \nInki mkc",
        "I answer like this .. gujara ho jata hai",
        "by Indian uncles and aunties you basically mean everyone lol.\n\nour gen has learnt the concept of privacy, they apparently never did",
        "1st of all placements are shit this year everywhere and no way ISI Bangalore avg salary is 40 LPA. \n\nI had hired from ISI Kolkata in 2022 and 2023, and we paid 18 LPA. So ur uncle is bluffing.",
        "Lol you should've asked whether he had a fight with aunty",
        "These are the kinds of uncles who work as a clerk in some shitty government office for 20k pm and are the reason why getting any government work takes so much time",
        "I was like you. Then I noticed how people started taking advantage of me knowing i have money. Now my answer to how much i earn: I am unemployed.",
        "Sthan ya dhan?",
        "Wait does this really works do these annoying people eventually stop asking such questions \n\nBtw nice username 😄 I am a poha lover too",
        "Indians usually don’t have any civic sense and don’t respect any boundaries",
        "It is just to troll him. Why do you think you are liable to tell the truth",
        "It came hell more creeper when u told u are a married woman like wtf don't these uncles think ur husband would best the shit out of them if they talk to u like this,leave that also u are a grown up person and one can't talk to a person like this",
        "Age-old wisdom from my grand parents to my parents and then to me : Never disclose your salary. Stuffs I say when someone asks:\n\n\n1. Bas guzara ho jata h aur kuch bach jata h\n2. well off for every day life\n3. Industry standard, (I am in tech) jitna 2-3 saal ke experience me milta h logo ko.\n\n\nIf they insist, I asked point blank: Aap to eise pooch rahe ho jaise rista karane wale ho..",
        "Nobody except my manager and coworkers know my CTC. I always avoid giving a number",
        "They do that to people whi are not related to them, mere.se poocha tha ek baar, maine bas ye bola ki kyu uncle apni beti byahne ki soch rahe kya, meri to shaadi ho gayi kisi aur se pooch lo.\nHe got very angry....",
        "Their kids learn the same and the cycle continues.",
        "TBH always share your salary with uncle aunty whatever. And share it without any pride or shame, Indians already have too many stigmas around money",
        "Or Agee jada noisy hai to samajh jao they are not good people and avoid them, but reddit pe aake apne low agency hone ka pardarshan mat karo",
        "Quote an absurd number next time.",
        "Bold of you to assume, things have changed.\n\n\nWe are still very judgemental society.",
        "Not sure whether to feel good or bad for you. If you are getting good treatment, enjoy.\n\n\nBut, I personally feel is bad, treating people based on their earning potential. The reason, is if things go south, these would generally be the first person in line to bad mouth you as well.\n\n\nMost of the people  especially relatives get happy, if you're not on their level.",
        "Not just uncle's bro aunties too .all relatives are like this . Hell even my parents are too .\n\nNow What do parents do with these details? they torture us with the \n\"Sharma ji ka beta 300000 rupay kama leta hai tu toh 300 ka ek din me kha lete ho sharam karo\".\n\nIts like a stress relief for them to nag at us\n1)Find a simple reason to yell at your child .\n\n2)Yell at your child .\n\n3)If child rebels Say the dialogue\"We are all working hard for your sake \" .\n\n4)Happy sleep for  them .",
        "Op the link says 2021-2022 highest is 21 lpa. Are u guys getting paid 40lpa in India? Holy shit!!",
        "I'll just tell them I'm unemployed and see their reaction....",
        "To such questions i always answer “guzara chal jata hai” they immediately know to back off .. but then there are some who will put a number like 50k per month to mil jata hoga na to which i respond han itna to hai .. so basically you didn’t tell them the real number and said yes to their quotes figures so probably giving them the satisfaction ki chalo kam hi kama rahe hain hmse / hmare bachho se !! Which in my opinion is much better than getting evil eyes !",
        "A better answer will be\nUncle itna mil jata hai ki aapse help lene ke liye aana nahin parta\nKabhi zarurat hua to aapke pass hi aunga",
        "Learn to say No. Simple.\n\nGrammatical mistake: Asking about the CTC, not \"for\". It's not something you can give or do for them.",
        "Ahh the great Indian parenting saga, my mom still compares how kids younger than me are married and have offspring and how I failed them even though they indeed provided me all the support to be successful. I don't even feel bad about myself but for my mother as it's nearly impossible to change her point of view, which is tangled with society's expectations and never ending path to content.\nI mean look at Americans, they retire, sell off their big house, move to a small one so that they can travel around the world. My grandfather, he gets a pension from the army, money from agriculture activities, rent from the shops and at 80 money is still on his mind, same goes for my father and sadly for me as well. Our whole 3rd generation just has money in our mind",
        "Don't inflate the number. Deflate it. a lot. you should have said 10LPA, and very proudly. Now he will brag about his son getting 20LPA, and also start pitying you. But you can be laughing inside, because you know the truth.",
        "‘Bas ghar chal jata hai Uncle’ - you have to say only this",
        "I do exactly the opposite, I deflate the salary and say it.   \nFor example, \n\nRandom Uncle (RU): How is your job? How much do you earn?\n\nMe: 1.3L  per month(Any number between 1.2-1.5)\n\nRU: Bangalore is expensive right? Or are you planning to buy a home?.\n\nMe: I don't have any savings, 50k goes into rent, maid, bills etc. Another 70k for groceries, outings and travels to functions like these.\n\nRU looks at me with such disappointment for getting this after 10+ years and a very good college. Sometimes they give suggestions.\n\nRU: Why don't you try learning XYZ or do certification or go to the US, or join ABC company, etc?\n\nMe: I need to work extra time for that, If I move to a different company or the US I need to work harder. I can't and don't want to work hard. I am happy with what I am getting.\n\nRU thinks I have gone nuts and either gets a call or changes the topic.\n\nI am happy, that he will not bring up this topic again with me or ask me to help his neighbours cousins son to find a job, who has completed BCom and wants to work in AI.",
        "To Humble You",
        "I didnt ask for your emotional response. It was just sharing a particular experience. Earning potential had nothing to do with his response, he was happy that his daughter was secure although she had a fairly secure PSU job and income which was pensionable. Also the person is a traditionalist; will never bad mouth the damaad unless I have done something criminal. Also relatives dont give a damn of where u are in life unless u are living with your extended family in a ghetto",
        "I have an MBA - working at one of the largest MNCs in India - 2.7 LPA.",
        "An MBA doesn't guarantee high package, the college you graduate from makes all the difference.",
        "What line of work are you in Bob? You seem about just as fragile about this as your uncles.",
        ">An MBA doesn't guarantee high package\n\nneither does a master's degree and 6 years of experience. In other news, the sky is still blue.\n\nWhat line of work are you in tho?",
        "True, the initial comment above was a little ignorant on my part. \nI work in auditing, specifically IT auditing at a Big4.\n\nIsn't 2.7 really low for even after an MBA degree? I did my BCA and my friends who opened for placements were getting average 4lpa...\n\nI'm guessing you're not in the IT field.",
        "Tier 1 MBA colleges have an average of 25+lpa tho",
        "Bhai, agli baar koi CTC pooche toh 500 ka note nikalna, aur use aag laga dena uske saamne. Gand fat jaegi uski. \n\nDevesh Dixit ka recommended hai.",
        "I usually say an average salary since I don't bother nor care what uncles, aunties or my next door nosey neighbor think!",
        "I grew up in the U.S., so I tell them \"it's rude to ask about salaries in my culture.\" \n\nThey never know what to say, lol.",
        "India is the most judgmental country on the planet. \n\n\nI love India. Even despite this problem it is my favorite country. I have traveled all over the world.\n\n\nHowever, this is a good thing. Everyone needs to be intrusive and know how much money everyone is making.\n\n\n It only helps the 0.1% and hurts 99.9.\n\n\nThis is how two people working the same job at the same company can get half the salary of the other one.\n\n\nThis is how you can earn 50% of what you should be earning in your field, bc you didn't know.\n\n\nYeah the comments and judgment are absolutely disgusting but i would rather have everyone being paid fairly.",
        "Just counter them and ask them how much money they have in savings",
        "My answer was always “comfortable”",
        "You are not far from truth. That uncle died one year later.",
        "I am like, me exact figure nahi bata sakta. App batao aap kitna kamate ho then I will tell you if it is more or less. That really shuts them up. Plus, I am known to be very straightforward, so folks in my family don't ask dumb questions to me.",
        "I'm wondering what would happen if OP had told random uncle \"I'm not comfortable discussing that\"",
        "concept of privacy? were 1.4 billion people produced from intercourses that happened openly in public? \ndo people in your family expect you to change your  cloths or shower while they are watching?\nDo they ask you to share your password or private diary or online journal?",
        "Aukaat naapne ke liye.",
        "why can you explain the context behind that?",
        "I give contradictory answers. Example “even my father has no idea, do you think I will tell you?” And then not a single word coming out of their mouth. I’m 5.4’ ft in height so some uncles be like my son is younger but taller than you and I answer them “measure how much we grew mentally not physically “ and pin drop silent 😂\nI think you have to give savage answers that they never dare to ask such questions. Peace ✌🏻",
        "You know Indian society was poor in the last generation, so money matters a lot.\n\nAnd a person feels great if his son/daughter make good money as compare to kids of his peers.\n\nThe previous generation outlook couldn't evolve beyond a narrow spectrum unfortunately.",
        "What’s CTC ?",
        "Indian uncles are anything but who we are today, they despise us, are jealous of us.",
        "May be they have daughters they are just looking for a wealthy groom",
        "Total compensation",
        "Didn’t knew builders also practiced caste system for selling new projects? 😭",
        "Indian parents life is all about comparasion. This sole behaviour makes them miser, since someone will always be at better place than you. This behaviour also makes one to take silly financial decisions like taking home loan when one is not really needed. Home is important but with planning.",
        "My pops became sad after placement cause my best friend got 52 lpa package, and I could only get 20. Still he says to me \"kuch to kamk reh gayi hogi\". I do appreciate his hardwork for me throughout his life, but this comparasion mindset of our society 🤡.",
        "plan is to silence not create more questions",
        "My friend used to dodge this question by saying “ not enough “ which I think is perfect",
        "On the face reply with a smile \"How does it matter how much I earn, anyway I am not going to give you a single paisa from it\"",
        "So they can ensure their son/daughter make more than you",
        "avg salary is not a good indicator. median salary is a better indicator for a college placement.",
        "Thanks 🙏🏻",
        "So you can say 'mind your own business' or 'f*ck off' if you are sanskaari enough",
        "Jhaat pooche to bolo katuaa",
        "I too used to face same question long ago and as I didn't want reveal my CTC/salary amount with my relatives/acquittances, I have figured out replies. One of the reply I tell them is 'Uparwala ki meharbani hai'. Second is  'bas uncle guzar basar ho jata hai', although we both know I earn decent money (by the grace of god) but they would never know exact amount.",
        "yes. \n\nlearn the sublime art of telling but not revealing. it will come in handy with HR, family, friends, girl friends. \n\nand one night in the dark, when no one is around, tell yourself how much you earn to yourself!",
        "You should always reply with bas roti pani ka kharcha nikal jaata h uncle 😊",
        "It is very simple. They want to know so that they can compare it with their kids and prepare their kids to compete. \"Dekho sharma ki ladka aaj kitna kama raha hai\", for this one activity.",
        "I always tell them the thrice of my salary so they never dare to ask and never try to compete.",
        "May be he is doing market analysis like you can do anonymously , but he doesn't know how to use reddit.\nIt's generation thing. \nMay be he is not personal , but also happy for you .\n\nI am not sure his intentions were not to hurt you, but you did had bad intentions. \nSo what's exactly the difference here ?",
        "Just because someone is asking your salary doesnt mean you need to let them know, just deny, plain and simple.",
        "You are absolutely right man, some motherfuckers in this society will even try to say lies in order to match a more successful person in conversation, like what the fuck man you have become a fucking 40 year old person and rather than being wise you are trying to protect your so called reputation by lying? People just don't realise that the person in front of them has worked really hard to achieve their level.",
        "🤣👍 Correct !!",
        "Bhai kya bolte ho aap? When people ask…?",
        "Always lowball such questions, I feel it just gives people a sense of achievement and no harm is done.",
        "Wait what ? How were my intentions bad ? He asked mine , I asked about his son's . Instead of giving me the straight answer he just played around with words .",
        "Naah he has 2 sons , none are gay",
        "Correction… father is retiring. It’s not “today morning”. It’s “this morning”.",
        "Life is too short to argue about money. Just say, \"Aapse matlab?\" and move on.",
        "Just ask them to mind their own effing business. I would really be annoyed if somebody asked me this question",
        "Maybe just say 'enough'.",
        "Remember that meme: to kamao na bh****K?",
        "Tab seedha vinaybhang chillaneka, permanently chup hojayenge",
        "Suggestion (and what I do during this scenario).\n\nMy conversation with uncles/aunties goes like this --\nThem: \"Kitna salary milta hai ?\"\nMe \"Aapko kya lagta hai ?\"\nThem: \"Humko kya pata ? Tum batao kita hai ?\"\nMe\" \"To bhi, kya lagta hai aapko kitna milta hoga mujhe ?\"\n\nAt this point they might say some figure. Say \"Yes\" to whatever they say and move on.",
        "Huh I always do the opposite, give them a super low number. They are always happy to hear that their son/daughter make a lot more. Win win",
        "Because Indian culture does not comprehend boundaries.",
        "Remember when they ask your salary, they are judging how much respect they should give you",
        "Main core Ahmedabad mai rehta hun. Maine to yey sab nahi dekha. *Mere khud Ghar Mai rehta hun lekin 💀",
        "I have never seen anyone put it as well as you do.",
        "Of course, they ask.. to be nosey. Can't do anything about it. \n\nJust ask them \"CTC Matlab\" and then use that time to think of a way to take the conversation to a tangent. \n\n\"Bas kharcha paani nikalte jata hai\" works too, but sometimes they come back with \"phir Bhi\".\n\nYou can say dekhiye uncle, ambani Bhi woi gehun ka roti khataa hai.. aap aur hum bhi.. sab moh maaya hai. \n\nPro tip: Tackling uncles can teach you skills MBA courses cannot.",
        "whataboutism",
        "I suppose you're right",
        "Uncle ke life kuch jaat nahi chal raha isliye",
        "Smile and say “ kaam chal jaata hai” .. or “I get by ok” version in your local language.",
        "It’s another modern Indian habit of being intrusive and weirdly competitive. \n\nIndian society needs to reestablish personal boundaries on politics, salaries and religion",
        "One of the best joys in adult life is to dole out advice (even if it’s for the best of intentions). But that’s the way to dodge it - inflate your numbers.",
        "You hired M.Stat folks ?",
        "[A reality check for people like you.](https://www.reddit.com/r/ahmedabad/s/wtqPsNhdM1)"
    ],
    "cleaned_text": "indian uncles ask ctc casually come home days since father getting retired lot uncles coming meet son meet sisters dont care meet one uncle started talking career salary directly jumped much earn kitna mil jaata hai thought would brush somehow couldnt ended telling lpa round fig tiny bit earn funny thing asked son recently got placed lol didnt tell exact number son masters isi bangalore started saying got placed low sat first company couldnt sit placements even said average placement lpa college like man match number quoted working years reach people come college although masters degree still lpa doesnt sit right realised best way deal questions reply insanely inflated number next time anyone asks say lpa ",
    "cleaned_title": "indian uncles ask ctc casually",
    "cleaned_selftext": "come home days since father getting retired lot uncles coming meet son meet sisters dont care meet one uncle started talking career salary directly jumped much earn kitna mil jaata hai thought would brush somehow couldnt ended telling lpa round fig tiny bit earn funny thing asked son recently got placed lol didnt tell exact number son masters isi bangalore started saying got placed low sat first company couldnt sit placements even said average placement lpa college like man match number quoted working years reach people come college although masters degree still lpa doesnt sit right realised best way deal questions reply insanely inflated number next time anyone asks say lpa",
    "cleaned_comments": "lowball response theyll feel good would want make feel good massage ego judgemental two reasons nosey people dont say asked sheer courtesy pseudo respect version dckmeasuring contest thats measure anyones worth theyll either feel great earn less taunt kids incase earn mat batao seeda bolo low confidential ooking forward lakh pa know anyone set job much salary well said haha perfect reply read ask caste ctc decide respected like salaries discussed openly everyone corporate policy discussing created keep salaries low let uncles know theyll probably knowledge youre getting screwed better jobs jaat poocha toh shaved hai bolneka indian uncles aunties sense boundaries shame start yapping salary weight complexion height hair skin marriage prospects children lack thereof etc hota sabke paas hai dikhata koi nahin dont give shit dad first met indian girlfriend said face darker skinned sister later told white american girlfriend skin looked pale guys filters lol years ago things may changed generation uncle ke bete ke l lag jayenge iske baad arent asking look openly sharing salary info colleagues sure nosy relatives naah bruh uncle asked ctc mere toh inhand bonus vgrh bhi puchte hain lot things happen lot things dont lot things never happen unkils asking ctc help something never happened uncle hr hai kya u r naive like op say smart like others share parents well relatives frequently asks ctc get increase xyz got lpa package abc got lpa nowadays im literally frustration though ive enough salary saves upto k monthly say smile forget assured son get words handed tonight getting lower package pagal hote ye log wont happy anyways also talking dad satisfied salary satisfied left job jobless like kuch bhi mile kar lo bruh make feel good give insane amount ig uncles ask dick measuring shame kids aunties ask update arranged marriage network database damn years lpa chose wrong profession nope kids gone high ctc low inhand situation isliye knows almost everyone naive first job especially asked someone close parents main nhi toh vo bta denge average placement isi kolkata indeed l however isi bangalore lower still greater l case indian uncle aunty se bach ke raho innocent generation dont filters fake face thats fact agree negative traits asking comparing skin color height package thats made indians cant man fuck ask uncle ill tell ctc tell much made career working number quotes add lakh say thats ctc indians barely concept consent privacy personal space judge people bank balance familys wealth let tell lot lying mention lpa jo mann mein ayein bol dena throw foreign country visits well wont ask well fair everyone indian uncle separated time decade got asked question multiple times respond saying dont share anyone even dad ann true parents thing show kids income social circles direct indirect consequences people think rude dont give fuk said dont discuss money walked felt proud lol avg placement lpa college insane best best mba iim b c lpa tbh earn much assume also know actual placement statistics colleges inflated clearly know uncles lying never match salary lol say less bro people ask loan think earn lot also said something like mil jaata hai thora bohot immediately started talking son hows placement college never give info looking compare jealous arre gaitonde bhau always reply bas kharcha pani chl jata h thik se honestly feel like ask give free advicesuggestions ive noticed lots ppl country likes fr nothing going lives mean discuss close circles showoff genuinely want know next time say oh dont count let financial advisor handle way awkward number game gets crushed even starts ask salary answering tell ask want work company bas mil jaata h kaam chal jaata h cliche reply give n ur parents r enough know much really earn random uncle uses either humiliate bring marriage offers side well time parents asked leave job prep govt exams denied unemployed years would made happier luckily dont force dont ask money lol ctc indian experienced many years indian uncles aunties ask get straight point study live much earn married different interpretations drawn person asking question delhi mostly snob value mumbai mostly practical assessment based bangalore wont hear questions chennai curious pigeon hole assessment calcutta dont know reason despise seemingly harmless questions next time praise size pelvis assert dominance let uncle live rest life uncomfortable indians ka bas ek hi goal hota hai sharma ji ke ladke se better karna western concept hai maslows theory hierarchy india mai toh saari needs hai sharmaji ke ladke se better karna whats funny parents dont compare parents though always kids used pawns play dick measuring contest pretty sure even calcutta never share ctc worst thing casually say dont share salary anyone sorry done time earning k per month earn lot better know one thing salary doesnt define worth share salary people try categorize unintentionally super racist never share ctc worst thing casually say dont share salary anyone sorry done time earning k per month earn lot better know one thing salary doesnt define worth share salary people try categorize unintentionally super racist think boundary issue ive set boundaries entirety extended family one dares ask questions maybe theyre scared response probably want kill kids start questioning lifes choices kya pata apni ladki k liye potential husband dhoond rahe ho happens less whenever ask salary ask indian uncles ask ctc self respect man call income understand company would call ctc perspective expense call acknowledging nothing expense always respond enough keep happy mans worth much money makes society bitter truth learned grown older say enough say something low like lacs dont need people know dont care think even dad doesnt know much make say salary people expect line quoting ctc acts like double edged sword careful bas aapki dua hai ghar chal jata hai bolke nikal jaane ke ka sir ctc bolo ya income bolo kaam tum company ke liye hi kar rhe ho always go low tell go gurudwara survive work behind wendys part time ye sirf ye jaaanne ke liye hai ki kitni ijjjat deni hai saamne waale ko sad true say bhookha nahi sona padta hai move lol used say work startup make little helps weed people interested talking status always quote low numbers pretend im barely scraping mom always scolds id rather let think im lying low mess head true lol even tier colleges boast average like thatmy friend engineering chandigarh university chandigarh said mba guys college get placed lpa average lpa tier college possible top crowd say cr lol wait random reddit dms dw never give figure borrow youll asking return say much need etc etc say dal chawal ho jata hai never give estimate tried make feel better putting instead id like add even women get asked annoys even india even uncleaunty types age group comparison nosy type mentality anything else us type ask come us without even saying usual hi hello pleasantries aur jhaat pucha bolna brahman case prefer lowkey coz want see youre successful yehi chiz unke dil ko tassali deta hai mark manson said rich guy doesnt prove hes rich similarly beautiful women doesnt need tell shes beautiful hence apne apni family ko khush rkho bhaad mei gya dunia ka competition year iitb average lpa right next time say bus kharcha nikal jata hai majority indians especially men spend lives centred jobs salary whille discernable identity make feel better depending salary money arent bound answer even lie many people asked questions asked straight away told dont discuss salary anyone tbf even parents never asked salary told respect know earn enough spoil ask anything require anything theres uncle asked renovate house currently live later found ripped us used low quality materials renovation discussed decided ignore move also maintained distance around hes never inside house since year half ago grandmother minor accident bedridden neighbours people area came see guy drops months ago comes pretence seeing grandma working room came meet suddenly starts asking work kind work much earn pissed told get enough thought last audacity ask mom salary didnt answer proceeded forward sons resume aunt shes vp huge corporate firm get job uncles toxic rotten core father told say anyone asks earn tell people like kaam chal jata h kharcha nikal jata tell people quote first straight f hate nosy seniors modi answer always pet paani ho jaata hai thing indians insist telling last name thats determine caste hence social standing refuse guys may know best answer question get lot started career dont wan na let know working low wage pay diff bachelors masters bruh id always lowball salary keep people around happy keep pampered live easy life lol many situations say time ke roti khaane jitna ask stare blank even dad supportive says koi bhi salary pooche irrespective age need tell theyre father inlaw asking handing daughters hand flash smile ask want know eliminate half questions next point custom ready keep poker face ask uncomfortable questions shut rest check parents tell going ask uncomfortable questions lets say tell ctc mention sons ctc whats loose friend common ask questions try reason n ask questions wont understand response always pet bhar jata hai itna aur kya chahiye life mai sarcastic smile hell never ask foreigner acronyms mean like lpa ctc whole personality based money careeryou live well envy didnt make feel good themselvesnext time dont mention much make instead set boundaries wrong ask much money make coz dont shame privacy give inflated number prepared marriage proposals loan requests dont get asked much last time happened answer equivalent enough thats dad told ctc continuously ask every weeks switching job increase ctc certification many times talks like friends sondaughter got company got package like someone got google talk relative another thing dads sisters kid year older got job recently jobless earned degree good college earn much though dont judge even ask ctc bcs others ctc matter guess dad try put even lie like say earning even though dad said recently also freelancing earning much salary dont understand try put like even even lying even belittle says proudly also try put like dads son cousin instead feels frustrating annoying felt like comparison putting learned ignore anyway better bcs learnt matter says ignore even reply taking mind draining energy wasting whole day etc strong mind ps earn good double digit lpa ctc still fresher proud well working hard improve never thought dad like got sharmaji ka ladka lpa means lakhs per year told dad ctc continuously ask every weeks switching job increase ctc certification many times talks like friends sondaughter got company got package like someone got google talk relative another thing dads sisters kid year older got job recently jobless earned degree good college earn much though dont judge even ask ctc bcs others ctc matter guess dad try put even lie like say earning even though dad said recently also freelancing earning much salary dont understand try put like even even lying even belittle says proudly also try put like dads son cousin instead feels frustrating annoying felt like comparison putting learned ignore anyway better bcs learnt matter says ignore even reply taking mind draining energy wasting whole day etc strong mind ps earn good double digit lpa ctc still fresher proud well working hard improve never thought dad like need less want fir bhi kitna kaam chal jata hai arey kam k month chal jayega ha matlab k milta hai nahi fir aapka beta heroine peeta tha na abhi bhi peeta hai chalte hai kam hai thoda might realise guy subtly posted topic flaunt ctc knows top tactics men employ reddit men show v easily whenever people ask ctc always replied ask savings retirement planning equivalent pulling bigger one response best response frustrated written short article sorts topic forwarded relatives saying forwarded message received xd goes indian relatives neighbours suffer inferiority superiority complex irrespective financial wealth reasons getting sense superiority comparing relativesneighbours one cheap thrills afford lives garb social interaction concern concerned beta india etiquette culture touching feet listening elders regardless treat real global etiquette real culture fostering good feelings others preventing people even enemies feeling bad costs unquestionably absent india ultimately make others feel says lot typical indian relative lackluster uncreative lives unbeautiful life settle boring mediocre life spend rest time inquisitive others relatives never come ask health bad times want full information lives lpa lakhs per annum lakh currency ctc cost company doesnt show complete picture much actually get inhand ctc usually base component variable component stocks bonuses etc dal roti kha lete hai considered upper middle class isliye son mention kar diya post pe uncle ne apne bete ki class laga di hogi ghar jaake dekh usko lakh ka package mil raha hai told even piss ladki se umar aur ladke se salary nhi puchi jati lpa lakh per annum lakh rupees usd ctc cost company total compensation including perks aint way matka avg isi banglore lpa avg whats ctc say uncle ji rent lpa commute lpa never situation best response learnt others case bas chal raha hai kuch khas nahi next time ask salary time retirement dont shame uncles never change behavior ladkon mein tharak bahut hai nhich chhodte kisiko uncle inmy neighborhood loved boast son recently got placed good company would sit outside house evening tell everyone passes son successful earns lot money close friend came home recently talking told uncle bad habit boasting years back well son preparing jee exams decided prank one evening sitting outside boast people obviously friend started strolling outside homes called us started ask us career asks salary kitni hai tumhari friend says zyada nahi hai uncle abhi toh bas crore ka package laga hai freshers ko itna hi milta hai uncle ki shakal utar gayi friend proceeded uncle ye apko pata hai aas paas zameen kitne ki bik rahi hai soch raha hu lelu kaam ayegi day uncle never seen outside house difference im living im dying mean thing every moment living every moment live moment draws closer death alas philosophy language seems lost say cost company priceless smile walk away lakh currency amount lakh means million funny bhai kaafi funny bhai sun tu aapne liye hi musibaat bana raha hai instead saying lpa next time play simple trick uncle layoff ho gaya tha abhi lpa wali job kar raha hu phir wo bolenge mere beta lpa kama ta hai simple reply acha hai uncle phir uski company lagva dijiye please trust moment ask uncles favour never comeback casual follow times never gon na bother life till actual salary growth quite lot eyes relatives still lpa still work paytm even better show dont get much money drama always say know industry pressure lots layoffs etc happening tough find job market kala jadu vashikaran krwa denge wrna isliye inn sbse door rehna hxd consequence saying lpa people start calling monetary help imo iwould say pretty lower number person empathises closes discussion ps encountered situation earn pretty low say cr se thoda kam hai uncle wink never questioned back till next time tell earn inr per minute calculate rest leave little smile every time get asked question almost always reply enough survive people envious insecure people looking partner sondaughter case think denying answer question best quote really low number say lpa shit people envious tell everyone around keep taunting saying hes rich man ameer bangae etc etc flex people random singapore sudden uncle delhi exchanged pleasantries asked much paid trip stunned didnt even know say say lakhs son daughter maths flex ctc without actually flexing oh yeah sorry lost lol updated yes somebody gon na get hurt today somebaaady tell income depending person asks wants ask loan something say bahut loss hogya iss saal someone wants compare tell family businesses profit cr people stop questions ask drive point toh much property uncle performing bed days tell uncle gareeb log poochte hain ye sab hum pushtaini ameer hain usually tell cr bhai inflated number bolna hai toh cr bolde hafte ka jk respond kaafi mil jaata haiz ki kya karoo nahi samjhta toh ghar pe thoda savings thoda trading thoda aur baaki jeene ka thoda spend hota hai aap kitna kama lete ho mami mausi bhabhi etc ko kuch dete ho give vague answers ask point hard hitting questions take hint get offended sometimes okay offend people cuz petty log cheezo ko pakad ke rakhte hai khud se cutoff kisko karna ya bhav nahi dena dikh jaata hai ps discussion salary benefits everything normalised imo harm unless degens haha less ctc problem qa session always remain worries uncles aunties lakhs per annum one lakh hundred thousand aka rupees lpa would lakhs per annum say theek thaak hai kaam chal jata pura generally quote number question theek thaak according say yes always way less get paid years ive seen relatives expect help money problems find earn metrice enough property division ke time bhi tumhara hi katega earn thats exactly say earn enough spend save bit blessings join hands saying usually understand boundary dont pester waqt ki roti kha lete ha itna ahh reply next time start much lpa cousin beaten father father somehow name know salary earn much bro kind job ya bro gon na backfire spectacularly one uncle needs money asks dad days son earns l cant even much avoid salary discussion say get enough afford food accommodation done aaja ahmedabad mein bina jaat bataye ghar kiraye pe bhi le ke dikha kharidna durr ki baat hein come ahmedabad rent place without disclosing caste forget buying bro dad exactly opposite want switch long dad like money dont switch sort priorities first want give tennis easy routine wlb cost lpa worth see next time tell got promoted new salary l let stew correct answer enough needs savings want snarky unless know theyre looking eg l sounds right skills really ask theres also angle ask money theyre short oh make l year surely spare k bro dont xd theyll come ask money someday better keep money safe money rules lpa fair package package hesitate tell wouldve brag racist assessing much respect give initially wud openly tell ctc thinking asking casually understand r judgemental better way say mil jata h achha thik thak say lpa inches indirect kyun pucha uncle maine direct answer de diya point fair package point personal stuff dont want disclose never knew side gujarat wow rock living well talked well documented fact common practice indian households belittle son praise sisterscousins sons see comes parents deep rooted inferiority complex unload child belittle himher even though youre meritorious nephewniece theyll still try pulling one situation best assign zero opinions peace know youre better ps indians look money earn metric success whereas every individual hisher definition success person working govt uncles never ask rather show respect envious way id rather corporate money false respect tbf know well choose stay ignorant give different numbers every uncle every time ask leave confused bhai staying gujarat last years surat previously staying mehsana didnt face atrocity neither body asked jaat caste btw bengal job mnc aunts asked casually front everyone hearing number like help cousin get job waqt ki roti nikal jaati hai baki hazaar ki saving festival kharch ho jato hai takes care nosy ones find men thats dream salary sure youve put lot hardcore work along great grades great university living sister one brains wont lie big brother well hes older one people generally know cant happier remember went meet boyfriends mom first time asked kitna kama lete ho felt bit weird born ahmedavadi says completely wrong show ads billboards real estate totally discriminating based caste exception doesnt make example make post mentioning wan na make friends youre f likely theyll pop next time someone asks much earn dont want share reply enough told one nosy uncle fbi watching cant disclose salary legally forbidden kidding thanks reply xd yeah next time uncle asks say handsome package yup quite young compared cousins cousin overweight general slouch human still unbelievable casually people like mother use casual condescending remark ice breaker atleast last time sure reprimand bullshit god womans jealousy backbiting major cause fucked head bro dont die cardiac attack answer thik thak hai ctc uncle oopsie haha main bol detach crore hai kyun ki unko kitna kamathe ho bolte hai islie amko ctc bolke puchte yeah good plan expect pay things ask borrow money tell amount way lower actual ask borrow money wont interrogate salary love fuckin around ask shit like always give higher number watch jealousy take started drawing lines whenever needed like cockroach ones say get popcorn ready caramel course correct made point tell parents ctc early career dont bother much anyone asks say earns decent also entrepreneur income varies lot potentially one highest tax payers city one around knows ca next time anyone asks say lpa pagal hain kya quote low contradict lifestyle realise sarcastic say confidential usually tell earn earn much might ask money borrow better take sympathy lend money way dont bother pay unnecessary stuff uncle asked aap kitna kama lete ho replied coldly sharad se duguna hein mera sharad son man never visited us colleagues yes family asking benchmark brag karoooddddd classism maybe bro always respond k per month say ki last time bhi wahi bola tha toh increase k keep consistent op earns lpa folks anyone couldnt figure random uncle building meet middle street state loudly much weight put cheeks chubbier good minutes year old married woman shocked disgusted unable respond moment left someone ask something like put exaggerated expression face say lot worked till nothing failures life hence try feel accomplished projecting children unfortunately parents also like thistoo much invested others business happen avoid make sure telling actuals utterly necessary else tell bas uncle ji daal roti ho jati hai uppar wale ki kripa se kitna bhi kama lo salary kam padti hai aajkal divert talk expenses ask understand market someone might cited earn lot lpa big number secondly older people dont see offense ask salary dont judge anyone past lpa since thats lot lpa mechanical engineer started lpa till first years career reached lpa asked time compared feel bad like whole existence useless inflated always say itna kama leta hun ki sukoon ki roti kha leta hun hai na uncle kya chahiye life mai zen face say confidence jawaab se logo ki bohot jalti hai kyuki get number seek assume either earn much dont wan na speak loud tooo less yet happy dont share parents understand earn good clueless salary get asked kitna mil jata hai person doesnt get hint dont want respond reply itna ki mujhe paise k liye shadi karne ki zaroorat nhi im youngest amongst cousins unmarried age thats considered late married relatives perspectives cousin brothers got married receiving lots gifts cousin sisters got married giving lots gifts leads bas taste mouth embarrassment father jumps salvage situation tell huge number say takes lot hard work reach kid able earn much work hard enough walk kind men school time used peek toilet compare dick size usually say confidential brush say x come back x ridiculously difficult understand badgering though u dont want anyone budge u money tell low ctc u think like u wan na flex tell higher ctc ill choose former xd adamant enough tell much earn also tell ask money feed ego saying earn less theyll ask someone else hopes feeling ego boost give satisfaction comfortable allowed disclose could get trouble say itna kama leta hoon ki bhainson ka doodh pilati hai meri maa ha bhai kitna hai id prefer share salary details hope thats okay say smile firmly india expected give reply everytime someone asks us something true sometimes dont need give info elderly person asked found great solution always say per hour work international clients pay per hour uncle annoying aunty asks confuse hell normal answer per hour one client per hour second fluctualtes depends number hours worked repond second question approx much make answer somewhere lpa lpa depends retianer amount hours different project different hourly rate fixed itna irrirate kr unko wo smjh hi na paye aur bhag jae share salary anyone categorize pass statements afford cant start feeling heat earn good everyone aware high expectations live life call chindi choose live simplicity second even worse place people look earnings given low importance personal observation never ask anyones salary even aware close friends salary never disclose salary forget disclosing dads colleagues never refuse answer go fuck especially relatives say smaller number judge get cocky try demoralise say decent numbers try fleece hahaha oh god indian thing family opposite money never discussed still dont know dads salary applies sthan mean dhan simply say bas kharcha paani nikal jaata hai repeat give indian gen zs get easily offended every single thing question answer dont answer upto u move focus important things life intrusive like much everywhere india wish one could sarcastically yet respectfully able brush inquisitiveness becomes insistent direct approach needed exercising direct approach right different context say bas kharcha nikal jaata hai move man stupid stories dont need cared thats bad home months left job going start phd soon uncles aunties intrusive want know everything money making much must saved getting married salary would phd one uncles told get married soon concentrate phd worry chores home measure net worth since theyre indian cant real dickmeasuring contest since would losers say enough years ago asked salary kind motor mouth relative everyone middle relatives replied quietly ninety thousand relative aap milo mujhse aa ke kuch help karta hu job change main barely even know guy embarrassed speaking low voice one thinks im bragging thousand month relative mouth rest evening even said average placement lpa college laughed hard coming top ranked iit less iitians earn thats case people would prefer isi bangalore iit mumbai lol uncle definitely spicing numbers better quote enough make parents retire lol might say jitna milta hain usme mai bohot khush hoon still poke ask figure keep saying thing arey uncleji jitna mil raha hain usme khush hoon bas know close relatives boundaries cant really tell anything much face maintain boundary making known arent interested give answer question isnt concern whether might learn less matter wouldnt let even range salary known people cuz less would think less us know unki nazar hogi end say arey bacha batana nahi chahta continue work give smile get go change topic one friends keeps asking question dont want answer keeps repeating dont like asked questions tell enough manage expenses best jawab diya hai jitni zaroorat hai utna milta hai roz bhagwan poochhte hain kitna budget hai aaj ka fir malik se utna hi dilwa dete hain best answer according bus uncle itna package hai ki daal roti aur kiraya nikal jata hai compare dads give taste medicine like guys dad gifted bikehome etc speaking boundaries wait till child travel train toddler every unkil auntie want squeeze cheeks feed godknowswhat looking comments one giving fuck ctc alright tell nda company thus cant disclose amount tell earn enough live happily peacefully waqt ka roti kapde makan aa jata hai itna kaafi hai time changed ab log rahul naam toh suna hoga ki jaghe rahul kitna kama lete ho pe focus hai jobs offering much money tell people really low number let ego satisfied secretly feel happy one knows make lot never undersell always mention number cr net tax hate thing indian culture people poking nose others life whenever relatives asks question give blunt reply get enough money sustain sorry tell figure dont give shit feel generational difference battle respectability us youngins ask stuff like pets cat person dog person etc good analogy didnt ask ops ctc told us anonymous users casually indians one doesnt say figure situations least real salary one tries portray oneself humble get bas guzaara chal jaata hai equivalent languages laugh somebody tell respond questions without rude even sharing figures offended uncle asked salary dont blame qualms openly boasting thousands strangers internet ive started answering acha hai good ask fir bhi kitna still much reply quite good third reply conversation starts getting awkward brush smile among realizes importance privacy sanctity boundaries become uncle much better still large group indian uncles dont know better words several people uvuncler age today also sensitive intrude may folks may among dads friends haha tell astronomical amount like cr destroy mental state tell got opportunity go us got increment waiting get atleast make suffer silence unhinged uncles know boundaries know borrow money every time visit hometown least one relative parents friends ask question answer every time enough manage city life parents expenses save future ask details tell thing asking question sure want know want compare son daughters try picky get details straight forward say less sondaughter feel happy else feel sad know dont want make feel sad understand stop questioning said l earning l say l asked uncles like salary always lpa food lpa pretty much sure isi bangalore average placement package lpa people get placed well good package lpa definitely average people go isi passionate care things like money often go towards research value respect money years experiences advise never give inflated number people want put people always deflate around see smirk listen boast give cunning smirk without telling know played never ask ctc ever lmao uncles stare woman passes like monkeys like moral police saying kaise kapde pehente ho directly ask hand salary next time say uncle kaha lage hue ho sun ke apko constipation ho jayega rehne common indian society interaction technique bring level berate neverever play game others terms let guess india people access others value numericals much earn many cars houses etc indians ask think whenever someone asks much earn always tell false number much reality want like fun tell earning crore pa laugh end wink population urban ahmedabad moving old ahmedabad seen people influence dont want others ask pic bob next time never accuse indian uncles subtlety well one incident bangalore well asked brahmin mean casteism pretty much prevalent everywhere literally determine worth person dont even see anything wrong damn dude thats right gon na tell everyone insane inflated numbers tell like secret havent told others generational thing weve become reclusive careful interact people years ago internet phone talking life everyone elses life key form entertainment replaced habit unlikely fade away generation today offensive actual ice breaker get know sort thing know masters degree years experience lpa right anything less underpaid op next time situation happens say think ur son daughter lying theres way fresh graduate earn experienced professional unless offer google congrats opyou achieved sharma ji ka beta status dont know chickas sorry asss feeling bit let though good know whats going indian job market us appllies everywhere dont tell get offended think culture generation especially true come india matter age early career ive divulged information ridiculed make close k usd annually dismiss small number number satisfy unless makeup insane number dont answer questions salary anymore exactly said politely personal finance ka mamla h dont discuss anyone sorry bhai face dekhna tha even like firbhi roughly gave broadest range karo beeth k guess thank god dont believe caste system mujhe affect nahi karega nailed many moments wish quick retort would make feel like shit theyd never cross boundary anyone else im waiting next time lmao bro still earning low youre living bangalore mumbai delhi hope understand reply agar aisa hua toh taro mairo bhairo bolke nikal jaunga know language ill act like dont know honestly depends phd w years experience still earn less half quoted lpa professions scale way please stop living delusion panauti hai tu masters sr data eng say lowest respectable amount k per month afraid people borrowing money due bad past experiences tell lower amount like pennies tell salary lpa planning start business uncle must saved crores years gim zero interest loan l ill pay back years keep times watch run sight let correct last sentence openly discussing salaries good thing since tells market standards least wont lowballed interviews people dont discuss salaries reason must pay pocket analysts share salary reports every year motion recruiting people dont discuss salaries reason become taboo maybe could learn thing two uncle mere paas hai hi nahin still racist true indeed bring mindset along places gujaratis mumbai love gatekeep live housing compelx make sure populate gujaratismarwaris fucking retards apna ek hi jawab h athanni chavanni tell low number get happy sense pride son earning keep earning enjoy peace didnt say earning lot good enough currently also know huge skew job market always feel earning enough ye sab cheezo se upar uth chuka hoon ab say bas guzara ho jata hai watch face innocence guys uncle areh beta kaise esa woh uncle seh achhe hai hum uncle aapke amdani athanni kharcha rupaiya right answer totally bro arre uncle aunty se milwao kabhi batata hoon thailand trip pe kya kar rhe aap apne pe kabhi nahi lenge magar apne bacho ko zarror sunayenge like measuring brick size assessing market price sabko apna wala bada lagta hai work hard point revealing income embarrassing confession misleading lie proud flex usual response bus sukh shanti se jeevan nikal jata hai uncle asked multiple times asked ram son ko kitna milta hai usse kitna kaam ya jyada hai btata hu went mute uncles ask much make tell humko kya hai jee hum toh jhola uthakar chale jaayenge fields stem wao hade honesty guess generation serious issue guys need fix blaming others supporting saying thats try see beautify something times instead hating everything agreed never said isnt fix question case better see good correct answer roti khaane layak kama leta hun thats boundaries learnt hard way one teaches things dont know answers assume worst people least experience indian uncles ask question always looking groom ownsistersneighbourswatchmans daughter theyre asking ctc enter mental database run matchmaking algorithm bhai bandi hai meri uska kya one uncle brags daughter gets stipend lac per month shes cousin motivates others study hard etc hand shes totally burnt wants quit lot health issues doesnt care unclesaunts gets sort orgasm talking ctcs comparing others belittling tell half earntoo much crying everyone hajam nahi hota hai unhe sunke average uncle convo convo either vibes like op got dont flaunt salary win dick measuring ego contest world knows earn good first feel impressed feel insecure start asking small loans find hard refuse case refuse call egoistic prideful bad person tell parents also maintain low key better avoid fuss spend save invest salary wisely dont need tell inflated number fact tell less number try avoid answer directly much possible like kaam chal ja raha hai big city hai high expenses etc similar like acquaintance tried avoid telling exact figures son nothing works tell random less number also dont need disrespectful parents friends uncle tera hi market badha hain chod gayi bandi option rahega baad aajkal arranged marriage ki market bahut kharab chalri hai waise bhi accha hi hai pipeline bana ke rakhna never share ctc turn arre aapka beta toh itna kamaata hai aap udhaar kharch karo blink eye im notorious northern state never know someone abduct father ransom equals ctc lol kidding general practice never share finances outsiders similar uncles relatives ask say kaam chal jaata hai hard asses dont let go keep asking dont relent looks faces worth enjoying reply w comfortable amountbas ghar chal jaata hai unless uncle whose daughter might interested aukad janni hoti hai usine bheja tha muje tu kya batayega bhai never changes households tier college earning l pre tax yoe also get shit father point nothing much make good people habit putting children observed concerned peoples opinions rather childrens happiness give low number like really make reality want feel good children comparison important indian parents makes feel better dont get reveal make right earning enough cover expenses right answer people say crores shouldve said ew aapka beta average kamata hai kya ew people absolute shameless days know flex achievements make others feel smallctc one thing flex things like got property went country vacay etc abe chip kar show uncle arent different one major reasons left india considered rebel talking back sort uncles showing position fact indians thrive unhealthy competition jealousy beyond comprehension next time uncle says kitna mil jata hai say none business feel bad first eventually realize sort interferences life reduced tell cr add monthly good see faces ask revenue profit details first average placement isi bangalore masters high next time meet ask branch know average placement isi bang around lpa exceptional students landing lpa college placement oriented hence please stop uncle bragging actually publish previous year placement package records online ps isi bangalore hence commenting say close cr every uncleaunty gets awkward cause ur value front eyes based amount money u make fault cultures fault remove one zero thats ctc insane imagine somebody gets lpa fr know many people well careers making fourth perceived value profession available labor pool thing two learn sisters always give range never tell exact number doesnt sit right company gives base lpa fresh masters grads ctc easily crosses wanted flex couldnt lmao create boundary parents parents enquire every aspect life including ate every meal result limiting personality kids indian uncle working department answer asking friend yes probably meant classist uk whenever visit india first thing always get asked trip havent seen ages straight much earn uk indians seem think everybody earns millions streets paved gold whose boobs bigger shit boundary whats every indian uncleaunty think judge earn valuable opinions forgivable sins youll never see treat someone respect earns less sondaughter etc id rather answer lower inflated figures also heard people around indians nothing entitled youll become default lender family rather answer lower smile wave take arey beta itna kam personally bol volt aata hai id said lpa leave alone rounding would say future live life man coz gives happiness infront goofy ass say ha mil jata hai thik thak bounce even give figure lol wait year start asking money hospital charges indians racism culture us ever see african american one indian witch companies question inflate number ego game top people inquisitive dont want share know asking measure social status would downplay quote something meagre happy well thats none business uncle assure low kuchh shlok bolke dikhao aham kalam twavam kalam russian gulabam salaries disclosed people get treated equally pnce brother im boat years experience still far lpa keep hearing taunts parents switch option market seems hard days planning brother dm maybe could help job hunting bhai number goal goal satisfied see beta guy got much salary thanks might use bad words towards though like bacha got much cant good man uncle ghar hai paisa hai gaadi jodo ladki bhejo ladki hui hamari dont answer respond decent amount parents also know exact salary finally comparing boobs much dick comparison going always dodge question apart parents partner one else needs know healthy relationship helps plan life get much need usually give vague answer first still persist quote figure lacks less ctc never tell relatives much youre making dont know theyll ask money uncles ego gets satisfied knowing low number ego gets satisfied actually earning ive quoted win win way ask kids percentage marks year stupid never tell anyone much money make reason feel compelled opposite give really low number rest fact asking money none business theyll reply haan avg hai never say specifics lived urban ahmedabad last year one poshest cosmopolitan areas people castes one muslim zyada se zyada potential recruiter ko batao salary rishtedaar remember asked got first job said nahi sorry ye toh na ho payega mera bas chale toh ghar pe bhi na batau itni kam hai smile nobody asked question tackle situations question really need answer besharm fufa would outta nowhere ask salary mean wtf ughhhh post relatable couldnt counter one aunt said still believes indian culture best world according culture cares aging parents thoda curiosity fine apparently muze raste se jate jate log puch lete mahine ka kitna bcoz niece daughters marry father law used always ask package everytime changed jobs approach one incident though invited uncle family friend uncle self made man nice guy sitting place one neighbours joined us ununounced neighbour retired judge asked salary initially didnt respond kept asking situation became awkward tense diffuse situation gave figure th actual salary went rant son rejecting govt job instead joining private sector rant disclosed horrible stuff used people businessman believe missed power psychopath sucked time save trouble uncle later yeah dont disclose first place give low figure huh never said thats salary thats company pays masters graduates really market rate especially youre isi bangalore atleast ghante ka kitna toh nahin puchte women tell insane number like cr happily tell u incl encashed leave da receive indian govt fleece society needs least generations mature learn basic manners boundaries mumbai good isi peeps tbh dont care much kitna mil rha inko indians general lack boundaries commenting salary job weight childlessness skin color hair etc fairly normal cultivate inner fortitude months every time visit family back home im kidding india nobody taught basic etiquette conversation parents dont time competitive society impart knowledge less said better schools ye reddit par nai bolna tha turn dms sanity ask dad thing tell friends dads making much best way deal ask uncle much earning much savings non chalantly tell friends dad make savings hit back place try hit us lol whenever dad asks earning less bullshit regards tell modi chaiwala become president earning crores everyday also feel pity sad situation uncle despite years experience could save much look sharma uncle ji invested plots hes worth much usually way dont like anybody gauging financial ability make lpa would say lpa go cr base add variable component stocks face often ive stopped giving numbers worst case scenario give deflated number saves nazar reason read south indian accent head proudly say refuse answer question hesitation ignore inquiries ctc term dont inflate make self poor wont ask money say promotion get lacs beaming smile theyll slowly slink away honestly fucking hate uncles similar story uncle asked salary time hesitantly told lpawhich decent yoe uncle mocked low whats point much education also furious dad didnt told anything told tell inflated numbers next time stopped telling people ctc unless good friends good discuss ctc peer group healthy way aware market trends revealing actual numbers uncle brush topic insist much tell inflated number funny indian redditors feel uncle aunties go indian subs talking salaries almost everyday much difference yet uncles aunties would made fun way around least asking known people guys shamelessly asking random strangers internet stop shaming oldies exact thing different setting yet non sense defense family members used started making money surprise never asked whenever ask always say well asl much say good enough insist say company made ur sign nda would land trouble give details tactics men employ people complain ctc gossip usually well earning individuals people live paycheck paycheck dont care post gossip insecure income levels true bhai shaadi ke baad bhi crib wife snatched away son like aunty bada ho gya hai beta sax karne ki umar ho gyi hai karne bhai yes lpa lakhs per anum lpa equivalent usd like earning los angeles ppp conversion started earning lpa fathers friend lpa got constant reminders failure dont know earn never people aware salary colleagues significant easy lie way ive done enjoyed budging pressed faces becoming visibly uncomfortable start sharing numbers people goad say bohat accha uncle quote number based think think usually isnt much conversation ends koi ni beta aaj kal market kharab h uncles also matchmakers trying ti judge market value shaadi market sundar pitchais father isnt happy either lmao timing post exactly day got placed campus interview happens one around mamawith smiling face comes n asks kitna hua increment im always uncomfortable sharing keeps asking till give numberany suggestions avoiddue hate going family functions dont mean prime minister lol typical indian unkil aunti whose highest point entire lifetime make kid shove hopes dreams people like usually sad really shatter perspective like thought youd giving inflated number works best stop asking say mahine k iphone ajate hai oh yeah edited comment thanks lol plz balls say personal uncle happy making thats insists move diff convo well future someone asks ctc left choice answer try saying enough live comfortably little smile make seem rude also revealing facts paycheck worked might come handy even answering question still persistent want know exact numberhey lpa great number working india said inflate number soo high start questioning existence ladki hoke aise bol sakte hain kya dude manager asked first day im advocate working corp law youd think theyd aware sensitive considering education field work nope definitely case lol even last generation fun extinct soon weird already know trick case college marks general people least field talk ctc often thats know much ask company really tier mba eng colleges provide close flagship course currently paper lakh indians make lakh yearly includes non salaried professionals would def making majority number roughly lakh salaried individuals r figure majority would lot years exp bolna hota hai bas dal roti chalrhi way people saying offended nope wasnt honestly would offended wouldve worked years reach uncle lying show even top colleges india lpa overall average package wouldve said face frankly every situation doesnt need comebacka polite walkaway better always respectful even isnt specially older quote lpa gets deducted tax soo lpa uncle sure never come ask money always say low dad thought standard response illegitimate son usually forces moti aunties gathered around faint walk away pleased lied reasons similar reasons plan next time perpetuating cycle complaining fascinating hey got much salary couple times bit respectfully obv nobody asks pay anymore id say win balls say none business generation cant say shit never end trick say something around lpa barely k hand lolthis way happy dude dont know things like contests much domestic air connectivity today leaving us ms leaving town uncle called visit family went speak spoke travel arrangements date etc got know uncles sonsimilar age also going vitvellore one masters congratulated moved conversation next day received call uncle spoke bit casually mentions son leaving masters plane week first plane ride express purpose flying family went bigger metro hrs away train never ask man wage women age gets worse realize really sons dck measuring contest lmao sons pp bigger sons pp dont care politically correct dont think offensive question uncle beautiful daughter definitely go cr inhand bara kar bol de bas uncle ki bolti bandh try backanswering tumhaari beti se shaadi karwaani hain dont think mean crude unless course sharma ji compare betas ctc say lpa haath amount would shut works na man thats much experience let tell uncle would flaunted sons ctc would always prefer quote much lower number totally relatable frustrating deal happens flights well inki mkc answer like gujara ho jata hai indian uncles aunties basically mean everyone lol gen learnt concept privacy apparently never st placements shit year everywhere way isi bangalore avg salary lpa hired isi kolkata paid lpa ur uncle bluffing lol shouldve asked whether fight aunty kinds uncles work clerk shitty government office k pm reason getting government work takes much time like noticed people started taking advantage knowing money answer much earn unemployed sthan ya dhan wait really works annoying people eventually stop asking questions btw nice username poha lover indians usually dont civic sense dont respect boundaries troll think liable tell truth came hell creeper u told u married woman like wtf dont uncles think ur husband would best shit talk u like thisleave also u grown person one cant talk person like ageold wisdom grand parents parents never disclose salary stuffs say someone asks bas guzara ho jata h aur kuch bach jata h well every day life industry standard tech jitna saal ke experience milta h logo ko insist asked point blank aap eise pooch rahe ho jaise rista karane wale ho nobody except manager coworkers know ctc always avoid giving number people whi related merese poocha tha ek baar maine bas ye bola ki kyu uncle apni beti byahne ki soch rahe kya meri shaadi ho gayi kisi aur se pooch lo got angry kids learn cycle continues tbh always share salary uncle aunty whatever share without pride shame indians already many stigmas around money agee jada noisy hai samajh jao good people avoid reddit pe aake apne low agency hone ka pardarshan mat karo quote absurd number next time bold assume things changed still judgemental society sure whether feel good bad getting good treatment enjoy personally feel bad treating people based earning potential reason things go south would generally first person line bad mouth well people especially relatives get happy youre level uncles bro aunties relatives like hell even parents parents details torture us sharma ji ka beta rupay kama leta hai tu toh ka ek din kha lete ho sharam karo like stress relief nag us find simple reason yell child yell child child rebels say dialoguewe working hard sake happy sleep op link says highest lpa u guys getting paid lpa india holy shit ill tell im unemployed see reaction questions always answer guzara chal jata hai immediately know back put number like k per month mil jata hoga na respond han itna hai basically didnt tell real number said yes quotes figures probably giving satisfaction ki chalo kam hi kama rahe hain hmse hmare bachho se opinion much better getting evil eyes better answer uncle itna mil jata hai ki aapse help lene ke liye aana nahin parta kabhi zarurat hua aapke pass hi aunga learn say simple grammatical mistake asking ctc something give ahh great indian parenting saga mom still compares kids younger married offspring failed even though indeed provided support successful dont even feel bad mother nearly impossible change point view tangled societys expectations never ending path content mean look americans retire sell big house move small one travel around world grandfather gets pension army money agriculture activities rent shops money still mind goes father sadly well whole rd generation money mind dont inflate number deflate lot said lpa proudly brag son getting lpa also start pitying laughing inside know truth bas ghar chal jata hai uncle say exactly opposite deflate salary say example random uncle ru job much earn l per monthany number ru bangalore expensive right planning buy home dont savings k goes rent maid bills etc another k groceries outings travels functions like ru looks disappointment getting years good college sometimes give suggestions ru dont try learning xyz certification go us join abc company etc need work extra time move different company us need work harder cant dont want work hard happy getting ru thinks gone nuts either gets call changes topic happy bring topic ask help neighbours cousins son find job completed bcom wants work ai humble didnt ask emotional response sharing particular experience earning potential nothing response happy daughter secure although fairly secure psu job income pensionable also person traditionalist never bad mouth damaad unless done something criminal also relatives dont give damn u life unless u living extended family ghetto mba working one largest mncs india lpa mba doesnt guarantee high package college graduate makes difference line work bob seem fragile uncles mba doesnt guarantee high package neither masters degree years experience news sky still blue line work tho true initial comment little ignorant part work auditing specifically auditing big isnt really low even mba degree bca friends opened placements getting average lpa im guessing youre field tier mba colleges average lpa tho bhai agli baar koi ctc pooche toh ka note nikalna aur use aag laga dena uske saamne gand fat jaegi uski devesh dixit ka recommended hai usually say average salary since dont bother care uncles aunties next door nosey neighbor think grew us tell rude ask salaries culture never know say lol india judgmental country planet love india even despite problem favorite country traveled world however good thing everyone needs intrusive know much money everyone making helps hurts two people working job company get half salary one earn earning field bc didnt know yeah comments judgment absolutely disgusting would rather everyone paid fairly counter ask much money savings answer always comfortable far truth uncle died one year later like exact figure nahi bata sakta app batao aap kitna kamate ho tell less really shuts plus known straightforward folks family dont ask dumb questions im wondering would happen op told random uncle im comfortable discussing concept privacy billion people produced intercourses happened openly public people family expect change cloths shower watching ask share password private diary online journal aukaat naapne ke liye explain context behind give contradictory answers example even father idea think tell single word coming mouth im ft height uncles like son younger taller answer measure much grew mentally physically pin drop silent think give savage answers never dare ask questions peace know indian society poor last generation money matters lot person feels great sondaughter make good money compare kids peers previous generation outlook couldnt evolve beyond narrow spectrum unfortunately whats ctc indian uncles anything today despise us jealous us may daughters looking wealthy groom total compensation didnt knew builders also practiced caste system selling new projects indian parents life comparasion sole behaviour makes miser since someone always better place behaviour also makes one take silly financial decisions like taking home loan one really needed home important planning pops became sad placement cause best friend got lpa package could get still says kuch kamk reh gayi hogi appreciate hardwork throughout life comparasion mindset society plan silence create questions friend used dodge question saying enough think perfect face reply smile matter much earn anyway going give single paisa ensure sondaughter make avg salary good indicator median salary better indicator college placement thanks say mind business fck sanskaari enough jhaat pooche bolo katuaa used face question long ago didnt want reveal ctcsalary amount relativesacquittances figured replies one reply tell uparwala ki meharbani hai second bas uncle guzar basar ho jata hai although know earn decent money grace god would never know exact amount yes learn sublime art telling revealing come handy hr family friends girl friends one night dark one around tell much earn always reply bas roti pani ka kharcha nikal jaata h uncle simple want know compare kids prepare kids compete dekho sharma ki ladka aaj kitna kama raha hai one activity always tell thrice salary never dare ask never try compete may market analysis like anonymously doesnt know use reddit generation thing may personal also happy sure intentions hurt bad intentions whats exactly difference someone asking salary doesnt mean need let know deny plain simple absolutely right man motherfuckers society even try say lies order match successful person conversation like fuck man become fucking year old person rather wise trying protect called reputation lying people dont realise person front worked really hard achieve level correct bhai kya bolte ho aap people ask always lowball questions feel gives people sense achievement harm done wait intentions bad asked mine asked sons instead giving straight answer played around words naah sons none gay correction father retiring today morning morning life short argue money say aapse matlab move ask mind effing business would really annoyed somebody asked question maybe say enough remember meme kamao na bhk tab seedha vinaybhang chillaneka permanently chup hojayenge suggestion scenario conversation unclesaunties goes like kitna salary milta hai aapko kya lagta hai humko kya pata tum batao kita hai bhi kya lagta hai aapko kitna milta hoga mujhe point might say figure say yes whatever say move huh always opposite give super low number always happy hear sondaughter make lot win win indian culture comprehend boundaries remember ask salary judging much respect give main core ahmedabad mai rehta hun maine yey sab nahi dekha mere khud ghar mai rehta hun lekin never seen anyone put well course ask nosey cant anything ask ctc matlab use time think way take conversation tangent bas kharcha paani nikalte jata hai works sometimes come back phir bhi say dekhiye uncle ambani bhi woi gehun ka roti khataa hai aap aur hum bhi sab moh maaya hai pro tip tackling uncles teach skills mba courses whataboutism suppose youre right uncle ke life kuch jaat nahi chal raha isliye smile say kaam chal jaata hai get ok version local language another modern indian habit intrusive weirdly competitive indian society needs reestablish personal boundaries politics salaries religion one best joys adult life dole advice even best intentions thats way dodge inflate numbers hired mstat folks reality check people like youhttpswwwredditcomrahmedabadswtqpsnhdm",
    "light_cleaned_title": "Why do Indian uncles ask for CTC so casually",
    "light_cleaned_selftext": "So I have come home for few days since my father is getting retired . So a lot of Uncles are coming to meet him . And me being the only son , I have to meet all of them . While my sisters dont care to meet them . Now this one uncle started talking about my career and salary , and directly jumped to how much I earn now (\"Kitna mil jaata hai ?\") . Now I thought i would just brush it off somehow but couldn't. So ended up telling him 40LPA, a round fig which is a tiny bit more than I earn . Now the funny thing is I asked about his son who recently got placed . Lol he didn't tell the exact number. His son did masters from ISI Bangalore. He started saying that he got placed low because he sat for the first company and couldn't sit for other placements . He even said the average placement was 40LPA at the college 🌝. I am like man why do you have to match the number that I quoted . I have been working for 6years to reach there. There people have just come out of college, although with a masters degree but still 40Lpa doesn't sit right. Now I have realised the best way to deal with such questions is to reply with an insanely inflated number. Next time anyone asks me i will say 60 LPA 💀",
    "light_cleaned_comments": "No, lowball your response - they'll feel good. but why would you want to make them feel good? Why massage their ego? To be judgemental Two reasons: 1. They are nosey. 2. Because most people don't say 'no' when asked just out of sheer courtesy or pseudo respect. its their version of d!ck-measuring contest That’s how they measure anyone’s worth They’ll either feel great if you earn less or taunt their kids incase you earn more. Mat batao seeda bolo it's low it's confidential.. but i am ooking forward to have 90lakh PA.. do you know anyone who can set me up for a job with this much salary? Well said Haha perfect reply I read here that they ask your caste (ctc now) to decide if you should be respected. Me like: अरे अंकल जी, आज कल दस लाख महीना में होता ही क्या है। Salaries should be discussed openly with everyone. The corporate policy of not discussing it was created to keep salaries low. Let uncles know. They'll probably have the knowledge that you're getting screwed and have better jobs for you. Jaat poocha toh 'shaved hai' bolneka Indian uncles and aunties have 0 sense of boundaries and shame. Will start yapping about salary, weight, complexion, height, hair, skin, marriage prospects, children or the lack thereof, etc. Hota sabke paas hai dikhata koi nahin They dont give a shit. My dad, when he first met my Indian girlfriend, said to her face that she was darker skinned than her sister. Later, he told my white American girlfriend that her skin looked pale. These guys have no filters LOL But that was 25 years ago... things may have changed now for his generation. Uncle ke bete ke L lag jayenge iske baad . They aren't asking so they can look out for you. Openly sharing salary info with colleagues, sure. With nosy relatives? Naah. 🤣🤣 Bruh, your uncle just asked for CTC. Mere toh in-hand, bonus vgrh bhi puchte hain 😂 A lot of things happen. A lot of things don't. Lot of things just never happen. Unkils asking CTC to help is something that most never happened. Uncle HR me hai kya and u r naive like OP to say it or smart like others to not share it My parents as well relatives frequently asks me when your CTC will get increase, xyz got 15LPA package; abc got 10LPA Nowadays I’m literally in frustration though I’ve enough salary that I saves upto 15 to 20k monthly I just say जितका आवश्यक आहे तितका पगार मिळतो and smile :) Forget why - be assured his son will get some words handed to him tonight for getting lower package 😄 Pagal hote he ye log. They won’t be happy anyways. I am also talking about my dad, he was not satisfied with my salary. I am satisfied but he is not. When I left the job and was jobless then he was like kuch bhi mile kar lo. Bruh why to make them feel good . Give them an insane amount . Ig uncles ask for dick measuring and to shame their kids. And aunties ask to update their arranged marriage network database. Damn 6 years 40LPA, i chose the wrong profession Nope... His kids have gone through the high CTC low in-hand situation isliye he knows 😂 Almost everyone is naive during their first job, especially when it's asked by someone close to parents. Main nhi toh vo bta denge 😶‍🌫️ Average placement at ISI Kolkata is indeed 40L. However, at ISI Bangalore should be lower - but still should be greater than 30L. In any case Indian uncle and aunty se Bach ke raho. This is an innocent generation who dont have filters and have fake face and thats the fact. I agree they have those negative traits of asking and comparing skin, color, height, package but thats how they are made. Why Indian’s can’t man the fuck up ? Ask uncle, I’ll tell you my CTC if you tell me how much you have made in your career working ? The number he quotes add 10 lakh to it and say that’s your CTC. Because Indians BARELY have the concept of consent, privacy and personal space. They judge people with their bank balance and family's wealth. Let me tell you, a lot of them are LYING when they mention their own LPA. Jo mann mein ayein bol dena, throw in some foreign country visits as well, they won't ask again. Well to be fair everyone is an indian uncle separated in time by a decade. I got asked that question multiple times and I respond to them by saying that I don’t share this with anyone not even with my dad. Ann that is true. Parents have this thing to show off their kids income in social circles. This has some direct or indirect consequences. People think I am rude but I don’t give a fu*k. बस खर्चा पानी चल जाता है Once i said - I don't discuss money and walked off. I felt so proud. Lol avg placement of 40lpa in any college is insane. The BEST of the best, that is MBA from IIM A B C is 35 lpa Tbh I earn as much I you and I assume you also know how the actual placement statistics in most colleges are inflated, I clearly know that uncles are lying and that they can never match me salary lol. Say less bro, some people will ask for loan when they think you earn a lot. you should also have said something like \"mil jaata hai thora bohot\" and immediately started talking about his son and how's placement in his college. Never give them the info they are looking for, they are just here to compare and be jealous. Arre gaitonde bhau 🫡 I always reply Bas kharcha pani chl jata h thik se. honestly I feel like they just ask so they can give you free advice/suggestions I've noticed a lots of ppl in our country likes doing it😂. FR they have nothing going on in their lives I mean I discuss it with close circles . Not for showoff but because they genuinely want to know \"Next time, just say ‘Oh, I don’t count, I just let my financial advisor handle it.’ 😎 That way, the awkward number game gets crushed before it even starts!\" Ask them their salary too before answering. Tell them yours is more than theirs, and ask them if they want to work in your company. Bas mil jaata h , kaam chal jaata h - the very cliche reply you can give. You n ur parents r enough to know how much you really earn. Some random uncle uses it either to humiliate you or to bring some marriage offers from his side. Well there was a time when my parents asked me to leave job and prep for govt exams. I denied . But being unemployed for 2 years would have made them happier then. Luckily they dont force it now . So that they don't ask you for money lol CTC. I am an indian , this is what i have experienced over many years so Indian uncles and aunties ask and get straight to the point. Where did you study? Where do you live? How much do you earn ? Are you married ? Different interpretations can be drawn from where the person asking the question is Delhi - mostly snob value Mumbai mostly practical and assessment based Bangalore you won't hear these questions here Chennai more curious and pigeon hole assessment . Calcutta don't know. All the more reason to despise these seemingly harmless questions. next time praise the size of their pelvis to assert dominance! let uncle live with it for the rest of his life being uncomfortable! indians ka bas ek hi goal hota hai. sharma ji ke ladke se better karna. western concept hai maslows theory of hierarchy. india mai toh saari needs hai sharmaji ke ladke se better karna. whats funny to me is that these parents dont compare themselves with other parents though. always kids are used as pawns to play this dick measuring contest Pretty sure not 40 even in calcutta Never share your CTC. It's the worst thing to do. Casually say I don't share my salary with anyone, I am sorry. I have done this because there was time I was earning 10k per month, and now I earn a lot better, but I know one thing my salary doesn't define who I am or what I am worth. Once you share your salary, people try to categorize you unintentionally, and it's super racist. Never share your CTC. It's the worst thing to do. Casually say I don't share my salary with anyone, I am sorry. I have done this because there was time I was earning 10k per month, and now I earn a lot better, but I know one thing my salary doesn't define who I am or what I am worth. Once you share your salary, people try to categorize you unintentionally, and it's super racist. I think it’s a boundary issue. I’ve set boundaries with the entirety of my extended family, and no one dares ask me such questions. Or maybe they’re scared that my response will probably want to kill their kids and start questioning their own life’s choices. (: Kya pata apni ladki k liye potential husband dhoond rahe ho Happens less to me. But whenever they ask me my salary, I ask them theirs. \"why do Indian uncles ask for CTC\" Have some self respect, man. Call it your income. I can understand why your company would call it CTC -- from their perspective, you are an expense -- but for you to call it that is you acknowledging yourself as nothing more than that expense. I always respond: enough to keep me happy A man’s worth is how much money he makes in society. This is bitter truth I have learned as I have grown older. I just say, enough for me. Or say something very low like 4lacs. I don’t need people to know, and I don’t care what they think. Even my dad doesn’t know how much I make. The more you say your salary is, the more people with expect from you down the line. Quoting your CTC acts like a double edged sword. Be Careful. Bas aapki dua hai. Ghar chal jata hai bolke nikal Jaane ke ka Sir CTC bolo ya income bolo , kaam to tum company ke liye hi kar rhe ho . Always go low, tell them that you go to gurudwara to survive and work behind Wendy's part time Ye to sirf ye jaaanne ke liye hai ki kitni ijjjat deni hai saamne waale ko, very sad but true. Just say \"bhookha nahi sona padta hai\" and move on Lol I used to say i work at a startup and make very little. It helps weed out people who are only interested in talking to me for my status. I always quote low numbers, and pretend that I'm barely scraping by. My mom always scolds me for it but I'd rather let them think I'm lying about it being that low just to mess with their head True, lol even tier 3 colleges boast their average like that,my friend who did her engineering from chandigarh University, chandigarh, said mba guys of her college get placed at 25lpa on average. 40lpa+ in any tier 1 college is possible for only the top 20% of the crowd. Just say 2 Cr. Lol Wait for random reddit dms dw💀 Never give them a figure. They will borrow from you and when you'll be asking for return, they will say you have this much, why do you need it now etc etc. Just say that dal chawal ho jata hai... never give them an estimate. Tried to make himself feel better by putting you down but instead 🤭 I’d like to add - even women get asked . What annoys me even more is , it is not just in India and it is not even the uncle-aunty types or age group: it is the comparison or nosy type mentality more than anything else . In the US there are this type which ask “ when did you come to US” without even saying the usual Hi- Hello pleasantries Aur jhaat pucha to bolna brahman In this case I prefer to be a low-key coz they just want to see that you’re not that successful. Yehi chiz unke dil ko tassali deta hai. As Mark Manson said : “ A rich guy doesn’t have to prove that he’s rich similarly A beautiful women doesn’t need to tell she’s beautiful “ Hence apne and apni family ko khush rkho, bhaad mei gya dunia ka competition. This year IIT-B has average of 4 LPA. Right? Next time just say bus kharcha nikal jata hai Majority of Indians, especially men, spend their lives centred on their jobs and salary whille having no other discernable identity So they can only make themselves feel better by depending on salary or money You aren’t bound to answer them so why even lie. Not many people have asked me such questions but those few who have asked I straight away told them I don’t discuss my salary with anyone. TBF even my parents never asked me my salary and I only told them out of respect and for them to know that I earn enough to spoil them and they can ask me for anything if and when they require anything. There's this uncle who was asked to renovate our house that we currently live in. We later found out that he had ripped us off and used low quality materials for the renovation. We discussed it and just decided to ignore him and move on. He also maintained his distance. This was around 2012. He's never been inside our house since then. About a year and half ago my grandmother had a minor accident and is bedridden. All neighbours and people in the area came to see her. This guy just drops in 3 months ago and comes in under the pretence of seeing my grandma. I was working in my room. I just came down to meet him and he suddenly starts asking me where I work, what kind of work I do and how much I earn. I was pissed and just told him that I get enough. I thought that was the last of it but no, he had the audacity to then ask my mom my salary which she too didn't answer. He then proceeded to forward his son's resume to me and to my aunt (she's a VP in a huge corporate firm) to get him a job. All these uncles are toxic and rotten to the core. My Father told me to say this if anyone asks what I earn. I tell people like Kaam chal jata h. Kharcha Nikal Jata. i tell such people to quote theirs first or straight up f off, hate nosy seniors more than modi My answer is always \"pet paani ho jaata hai\" The other thing indians insist on telling you is your last name. Thats to determine your caste and hence social standing. I refuse. Guys may I know the best answer to this question? I get a lot and I have just started my career so I don’t wanna let them know I am working with low wage pay. The diff is between bachelors and masters Bruh I'd always lowball my salary. Keep people around you happy, keep them pampered and live an easy life. lol, i have been in so many such situations and I just say 2 time ke roti khaane jitna. if they ask further, I stare them blank. even my dad is supportive of this. he says koi bhi salary pooche, irrespective of their age, no need to tell them. they're not your father in-law asking before handing his daughter's hand to you. Flash a smile 😃 and ask them why Do they want to know!? That will eliminate more than half the questions. Next point is more custom: Be ready to keep a poker face and ask them some uncomfortable questions. That will shut up the rest. Check with your parents and tell them that you are going to ask uncomfortable questions :-) Let's say you tell your CTC and that didn mention his son's CTC. What's there to loose my friend. Its very common for them to ask these questions. And if you try to reason with them that they should n ask such questions, they won't understand. My response always has been “Pet Bhar Jata hai itna, aur kya chahiye life mai(?)” (with a sarcastic smile). Then he’ll never ask again ✋🏻 Foreigner here. What do these acronyms mean. Like LPA - what is this? and CTC? Their whole personality is based on money and career,you live well they envy and you didnt make it they feel good about themselves.Next time dont mention how much you make instead set boundaries with them that its wrong to ask about how much money you make coz they dont have any shame about privacy. If you give an inflated number, be prepared for marriage proposals, loan requests. I don't get asked this much, but last time this happened, my answer was just the equivalent of \"more than enough\" Thats my Dad himself ... I told him my CTC, now he continuously ask every 1 or 2 weeks, that when I am switching job, or increase my ctc or to do a certification ..... And many times his talks will be like, my friends son/daughter got in this company, and got this package, like someone got in google; same will talk about some relative. ...... Another thing, my dad's sister's kid \\[*3 year older then me, but got job just recently as he was jobless*\\] not earned degree from a good college and not earn that much \\[*THough I don't judge or even ask about his ctc, bcs others ctc does not matter i guess*\\], but dad will try to put him up, and even lie for it, like will say that he is earning same as me \\[*even though he is not*\\], then dad said recently he is also doing freelancing, and earning as much as my salary.... I dont understand, why he try to put him up like me or even above, even by lying, even he is not, to belittle me. He says so proudly and also try to put me down, like dad's son is my cousin instead of me. This feels so frustrating and annoying before as it felt like comparison and putting me down, but I learned to ignore it. Anyway, it is better bcs now I learnt that \"it does not matter who says what, and to ignore it or even reply to him\", and not taking it to mind, draining my energy and wasting whole day etc. I have strong mind now. Ps. I earn good double digit lpa ctc \\[still a fresher\\] and proud of myself, as well as working hard to further improve. And never thought my dad will be like this He now got his sharmaji ka ladka LPA means what? Lakhs per year? I told my dad my CTC, now he continuously ask every 1 or 2 weeks, that when I am switching job, or increase my ctc or to do a certification ..... And many times his talks will be like, my friends son/daughter got in this company, and got this package, like someone got in google; same will talk about some relative. ...... Another thing, my dad's sister's kid \\[*3 year older then me, but got job just recently as he was jobless*\\] not earned degree from a good college and not earn that much \\[*THough I don't judge or even ask about his ctc, bcs others ctc does not matter i guess*\\], but dad will try to put him up, and even lie for it, like will say that he is earning same as me \\[*even though he is not*\\], then dad said recently he is also doing freelancing, and earning as much as my salary.... I dont understand, why he try to put him up like me or even above, even by lying, even he is not, to belittle me. He says so proudly and also try to put me down, like dad's son is my cousin instead of me. This feels so frustrating and annoying before as it felt like comparison and putting me down, but I learned to ignore it. Anyway, it is better bcs now I learnt that \"it does not matter who says what, and to ignore it or even reply to him\", and not taking it to mind, draining my energy and wasting whole day etc. I have strong mind now. Ps. I earn good double digit lpa ctc \\[still a fresher\\] and proud of myself, as well as working hard to further improve. And never thought my dad will be like this More than i need less than i want. Fir bhi kitna Kaam chal jata hai. Arey kam to 50k /month me chal jayega. Ha. Matlab 50k milta hai. Nahi. Fir? Aapka beta heroine peeta tha na ? Abhi bhi peeta hai? ------ Chalte hai kam hai thoda. you all might not realise, but this guy subtly posted his topic to flaunt his own CTC. he knows it is in the top 1%. tactics men employ. Some reddit men will show you v easily ☺️ Whenever people ask me about my CTC I always replied \"इतना मिल रहा है की दाल रोटी चल रही है पर कभी कभी हफ्ते में एक बार चिकन भी खा लेते है \" You can just ask them their savings and retirement planning. Equivalent of pulling out your bigger one in response. Best response. I was so frustrated once I had written a short article of sorts on this topic & forwarded it to my relatives saying it’s a forwarded message I received xD Here it goes… Indian relatives & neighbours suffer from inferiority & superiority complex irrespective of their financial wealth. Some reasons : Getting a sense of superiority by comparing themselves with their relatives/neighbours is one of the few cheap thrills they can afford in their lives under the garb of social interaction AND concern ('We're just concerned for you, beta'). In India, etiquette & culture is more about touching feet & listening to elders, regardless of how they treat you. But the real global etiquette, the real culture, which is fostering good feelings in others & preventing people (even enemies) from feeling bad at all costs — is unquestionably absent in India. Ultimately, how you make others feel about themselves says a lot about you. The typical Indian relative is lackluster, uncreative & lives an unbeautiful life. So they settle with their boring mediocre life as it is & spend the rest of their time being inquisitive about others. these relatives Never come to ask about health at our bad times but they want full information on how we're doing in our lives. LPA is lakhs per annum . Lakh is the currency here. CTC is Cost to Company . It doesnt show the complete picture of how much you will actually get in-hand . CTC usually has a base component, variable component, stocks , bonuses , etc Dal roti kha lete hai Is that considered upper middle class? isliye to son mention kar diya post pe. Uncle ne apne bete ki class laga di hogi ghar jaake. Dekh usko 40 lakh ka package mil raha hai. Should have told him even more to piss him off Ladki se umar aur ladke se salary nhi puchi jati 😶‍🌫️ LPA- Lakh per annum, 1 lakh = 100000 rupees =~ 1200 usd CTC- cost to company or total compensation including perks aint no way matka avg from isi that too banglore is 40 lpa avg What’s CTC Then you say \"uncle ji, rent is 30 LPA, and commute is 8 LPA\". Never have been in this situation but the best response I have learnt from others in this case is \"Bas chal raha hai, kuch khas nahi\" Next time ask him what was his salary at the time of retirement. If you don't shame these uncles, they will never change their behavior. Ladkon mein tharak bahut hai. Nhich chhodte kisiko There was this uncle in.my neighborhood who loved to boast about his son who recently got placed in a good company. He would sit outside his house in the evening and tell everyone who passes by how his son is now successful and earns a lot of money. A close friend came home recently and we were talking about it. He told me the uncle has this bad habit of boasting a few years back as well when his son was preparing for the JEE exams. He decided to prank her. One evening when he was sitting outside (to boast to people obviously) me and my friend started strolling outside our homes. He called us. Started to ask us about our career. He then asks, \"salary kitni hai tumhari?\" My friend says, \"zyada nahi hai uncle abhi toh bas 2.5 crore ka package laga hai. Freshers ko itna hi milta hai\" Uncle ki shakal utar gayi. My friend then proceeded - \"uncle ye apko pata hai aas paas zameen kitne ki bik rahi hai? Soch raha hu lelu. Kaam ayegi\" From that day on. The uncle was never seen outside his house. Same difference between \"I'm living\" and \"I'm dying\". Both mean the same thing, because every moment you are living is every moment you live is a moment that draws you closer to death. Alas, the philosophy of language seems to be lost on you. Just say my Cost to the Company is ‘ Priceless.’ Smile and walk away! lakh is not a currency, it's the amount. lakh means a million Funny bhai kaafi funny . Bhai sun : Tu aapne liye hi musibaat bana raha hai Instead of saying 40 LPA, next time play this simple trick : Uncle layoff ho gaya tha, abhi to me 18 LPA wali job kar raha hu. Phir Wo bolenge mere beta to 25 LPA Kama ta hai Your simple reply is - acha hai uncle, phir uski company me lagva dijiye please And trust me : the moment you ask these uncles for favour, they never comeback - do a casual follow up 2-3 times and they are never gonna bother you in life. From 2020 - till now, my actual salary growth is quite a lot but in eyes of my relatives and all, it is still 18 LPA & I still work at Paytm 🤣 ( even better to show that I don’t get much money because of all the drama ) I always say as you know IT industry is under pressure, lots of layoffs etc happening, it is tough to find job in such market. kala jadu vashikaran krwa denge wrna isliye inn sbse door rehna h..XD The consequence to saying 60LPA is people will start calling for monetary help :-) IMO, Iwould just say a pretty lower number so that the other person empathises and closes the discussion. P.S. I have not encountered this situation as I earn pretty low. I just say 1 Cr se thoda kam hai uncle .. and wink .. never have I have been questioned back till now 😁 Next time tell them: \"I earn 100 INR per minute. Calculate rest of it\" then leave with little smile. Every time I get asked this question, I almost always reply to that enough to survive and then some. People who are envious and insecure People who are looking for partner for their son/daughter In any case I think just denying answer the question is the best or quote a really low number. If you say 40LPA and shit people will be envious of you and tell it to everyone around or keep taunting you by saying he's the rich man or ameer bangae etc etc. to flex People are so random, I was in Singapore and there all of a sudden an uncle from Delhi with whom I had exchanged some pleasantries asked me how much I had paid for the trip. I was stunned, didn't even know what to say. Just say 5 lakhs more than your son or daughter. Now do the maths 😉 How to flex your ctc without actually flexing it Oh yeah sorry i was lost lol . Just updated Yes somebody is gonna get hurt today.. somebaaady I tell my income depending on the person who asks, if he wants to ask me for a loan or something, I say bahut loss hogya iss saal. And if someone wants to compare, I tell them my family businesses' profit 4cr+ ( most people stop after that). Some questions you can ask to drive the point : Toh how much property uncle has? How is he performing in bed these days? Just tell him \"Uncle gareeb log poochte hain ye sab, hum to pushtaini ameer hain.\" i usually tell 2cr. Bhai inflated number bolna hai toh 10cr bolde hafte ka. /Jk I respond with kaafi mil jaata haiz ki kya karoo nahi samjhta toh Ghar pe thoda, savings me thoda, trading me thoda aur baaki jeene ka thoda spend hota hai. Aap kitna kama lete ho, (mami, mausi, bhabhi, etc ko kuch dete ho) Give vague answers and ask to the point hard hitting questions they will take the hint or get offended. Sometimes it's okay to offend some people cuz petty log cheezo ko pakad ke rakhte hai, khud se cutoff kisko karna ya bhav nahi dena dikh jaata hai. /Ps. Discussion salary, benefits and everything should be more normalised imo. No harm unless the degens are there Haha more or less CTC is a problem! The Q&A session always remain, worries uncles and aunties. its Lakhs per annum, one lakh is hundred thousand aka 1,00,000 rupees so 10 lpa would be 10 lakhs per annum I just say, theek thaak hai, kaam chal jata pura, then they generally quote a number as question, which is theek thaak according to them, and I just say yes to that, which is always way less than what I get paid. Over the years, I’ve seen that relatives will expect you to help them during money problems if they find out that you earn more than their metrice of enough, and property division ke time bhi tumhara hi katega because you earn more That's exactly what I say -\"I earn enough to spend and save a bit with your blessings\" and join my hands while saying that. They usually understand this as my boundary and don't pester any further. \"do waqt ki roti kha lete ha itna\" ahh reply Next time start with this \"not much but in between 60-80 LPA\" My cousin was beaten up by his father, because his father somehow name to know my salary. 🙁 How do you earn so much bro ? What kind of job are ya doing bro ? It's gonna backfire spectacularly when one uncle needs money and asks your dad .. and then days \"your son earns 60L can't you do even this much for me\" . Avoid salary discussion, just say I get enough to afford food and accommodation and be done Aaja Ahmedabad mein, bina jaat bataye ghar kiraye pe bhi le ke dikha, kharidna to durr ki baat hein (T) Come to Ahmedabad and rent a place without disclosing your caste, (forget about buying) Bro my dad is exactly opposite! I want to switch for so long and my dad is like.. if it’s just money no! Dont switch, sort priorities first you want to give up on tennis or your easy routine the “WLB” at the cost of 3Lpa more? Not worth it. When you see him next time, just tell you got promoted and your new salary is 50 L. Let him stew. The only correct answer is \"enough for my needs and some savings\" (or, if you want to be snarky, \"₹1\"), unless you *know* it's more because they're looking out for you (e.g. 40L sounds about right, or _with you skills you really should ask for 60_) There's also the angle of who to ask money from if they're short. \"oh you make 40L a year, surely you can spare 50k\". bro don't! XD they'll come to ask for money someday. you better keep your money safe from them. Your money Your Rules! 40LPA is a fair package why do you with such a package hesitate to tell. I would’ve brag it. ...racist? They are assessing how much respect they should give you.. Initially I wud openly tell them my CTC thinking that they are asking casually. But now I understand they r judgemental, better way is to say mil jata h achha thik thak. Just say 6. \"6 LPA?\" \"No 6 inches\" \"What?\" \"Indirect kyun pucha uncle, maine direct answer de diya\" The point is not that it is a fair package. Point is that it is my personal stuff which I dont want to disclose Never knew this side of Gujarat.. :( ~~Wow, under which rock are you living?~~ :D It's well talked about and very well documented fact. this is a common practice in Indian households, to belittle their own son, and praise sister's/cousin's sons. I see, it comes from the parent's own deep rooted inferiority complex, which they unload on their child, and belittle him/her. Even though you're meritorious than their nephew/niece they'll still try pulling you down in one or other situation. Best is to assign Zero to their opinions for your own peace, when you know you're better. PS: Indians only look at the money you earn as a metric of success. Whereas every individual can have his/her own definition of success. As a person working in govt, these uncles never ask me this, they rather show respect in a very envious way. I'd rather have that corporate money than this false respect tbf. ~I know it very well~ :'( I choose to stay ignorant... Just give different numbers to every uncle every time they ask and leave them very confused Bhai, I am staying in Gujarat for last 20 years @Surat. Previously I was staying in Mehsana. I didn't face any atrocity and neither any body asked my Jaat / caste. BTW, I am from Bengal and doing a job in MNC. aunts too. She just asked casually in front of everyone. After hearing the number she was like I should help my cousin too to get a job 2 waqt ki roti nikal jaati hai. Baki 2-4 hazaar ki saving festival me kharch ho jato hai. This takes care of most of the nosy ones. Where can I find such men? That's a dream salary and I am sure you've put a lot of hardcore work along with great grades from a great university. But what do you do for a living? Out of all this your sister is the one with brains. I won't lie I have a big brother as well and because he's the older one people generally know him more than I do and I can't be more happier about it. I remember when I went to meet my boyfriend’s mom for the first time, she asked me kitna kama lete ho. It felt a bit weird. I am born Ahmedavadi and what you says is completely wrong. I can show you ads and billboards for real estate, totally discriminating based on the caste. Just because you are an exception doesn't make you an example. Make a post mentioning you wanna make friends or you're an F. Most likely they'll pop up. Next time when someone asks how much you earn and you don't want to share it, just reply \"Enough\". I told one such nosy uncle that FBI is watching over me and that I can't disclose my salary as it is legally forbidden. I was kidding but thanks for the reply! XD Yeah, next time some uncle asks you that just say you have a \"handsome package\" 😌 Yup. I am quite young, compared to my cousins. I have a cousin who is overweight, and a general slouch of a human being. Still it's unbelievable how casually people like my mother use a casual condescending remark as the ice breaker. Atleast the last time I was sure to reprimand her bullshit. My god that woman's jealousy and backbiting are a major cause of my fucked up head. Bro don't do that, they will die of cardiac attack 😆 My answer is Thik Thak Hai CTC uncle Oopsie haha. Main to Bol detach 1 crore hai Kyun ki unko Kitna kamathe ho bolte hai Islie amko ctc bolke puchte Yeah good plan. Then they will expect you to pay for things or ask to borrow money. Tell them an amount way lower than actual and then ask to borrow money. They won’t interrogate you on salary any more. I love fuckin around when they ask shit like this. Always give them a higher number and watch jealousy take over them 🤣 I have started drawing lines whenever needed. Just like the cockroach ones. Just say No and get the popcorn ready (with caramel of course) Correct .. I made it a point to not tell my parents my CTC early on in my career and they don’t bother too much. If anyone asks them they just say he earns decent. Also I am an entrepreneur and my income varies a lot and I am potentially one of the highest tax payers in my T2 city but no one around me knows other than my CA. >Next time anyone asks me i will say 60 LPA Pagal hain kya. Quote it so low that it should contradict your lifestyle. He should realise you are being sarcastic just say its confidential. i usually tell them 50 % of what i earn. if you earn much they might ask money to borrow. its better to take sympathy then lend money. in this way they dont bother me to pay for unnecessary stuff. Once an uncle asked me \"Aap Kitna kama lete ho?\" I replied coldly \"Sharad se duguna hein mera\" Sharad is his son. That man never visited us again. Between colleagues yes. Family is asking just to benchmark and brag 7 karoooddddd Classism maybe? Bro I always respond 10k per month, if they say ki last time bhi wahi bola tha toh I increase it to 12.5k. I keep it consistent. OP EARNS 40LPA FOLKS. If anyone couldn't figure out. I had a random uncle in my building meet me in the middle of the street and state loudly how much weight I had put on and how my cheeks are chubbier for a good 5 minutes. I am a 31 year old married woman. Shocked disgusted and unable to respond in that moment, I left. When someone ask me something like this, I just put a. Exaggerated expression on my face and say it is a lot !! Worked for me till now Nothing, they are failures in life, hence they try to feel accomplished by projecting themselves on their children. Unfortunately my parents are also like this...too much invested in other's business😭😭 This will happen you cannot avoid it, make sure you are telling 60% of your actuals if it is utterly necessary else tell them \"bas uncle ji daal roti ho jati hai uppar wale ki kripa se, kitna bhi kama lo salary to kam he padti hai aajkal.\" then divert talk to all the expenses and all... They ask just to understand the market. Someone might have cited that you earn a lot. 40 LPA is a big number. Secondly older people dont see it as offense to ask salary. They dont judge anyone past 10 lpa. Since thats a lot of for them. You are 40 LPA. I am Mechanical Engineer I started a 3.5 LPA and till first 7 years in my career I reached only 5 LPA. When you are asked at that time and compared. You feel not bad but like you whole existence is useless. Not inflated. Always say ‘Itna kama leta hun ki sukoon ki do roti kha leta hun. Hai na uncle, or kya chahiye life mai? ‘ with zen face Say it with confidence. Is jawaab se logo ki bohot jalti hai. Kyuki they do not get number they seek for. They assume either you earn too much that you don’t wanna speak it loud. Or tooo less yet happy . I, too, don't share it with my parents. They understand that I earn good, but they are clueless about my salary. When I get asked \"Kitna mil jata hai\" and the person doesn't get the hint I don't want to respond... I reply with \"itna ki mujhe paise k liye shadi karne ki zaroorat nhi\" I'm the youngest amongst all my cousins and unmarried with the age thats considered \"too late to be married now\" in my relatives' perspectives. All my cousin brothers got married receiving lots of \"gifts\" and cousin sisters got married giving lots of \"gifts\". This leads to a bas taste in their mouth and embarrassment for my father who then jumps to salvage the situation. 💁‍♀️ Just tell them a huge number and say it takes a lot of hard work to reach here, your kid will be able to earn this much too if they work hard enough and then walk off These are the same kind of men who during school time used to peek in toilet and compare dick size. I usually say it is confidential and brush it off. Because if you say any x, they will come back with some y >>> x. Ridiculously difficult to understand the badgering though If u dont want anyone to budge u for money Then tell low ctc If u think like u wanna flex it Then tell higher ctc Ill choose former xD If you can be adamant enough to not tell them how much you earn, you can also tell them no when they ask for money. But if you feed their ego by saying you earn less, they'll ask someone else too, in hopes of feeling that ego boost again. Why give them that satisfaction? \"I am comfortable and I am not allowed to disclose it. I could get into trouble.\" Just say itna kama leta hoon ki do bhainson ka doodh pilati hai meri maa 🤣 Ha bhai kitna hai? “I’d prefer not to share my salary details, hope that’s okay with you” say that with a smile but firmly. In India we are expected to give a reply everytime someone asks us something. Not true sometimes we don’t need to give info just because an elderly person asked for it. I have found great solution for this. Always say 50$ per hour. I work with international clients and they pay per hour. So if any uncle or annoying aunty asks i just confuse the hell out of them My normal answer is \"50$ per hour one client and 30$ per hour second. It fluctualtes depends on number of hours worked\" Repond to their second question - so approx how much i make My answer \"somewhere between 10 LPA to 40 LPA. Depends on retianer amount and hours. Different project has different hourly rate some are fixed. Itna irrirate kr do unko wo smjh hi na paye aur bhag jae When you share your salary with anyone, they will categorize you and pass statements about what you can afford and what you can't. So you will start feeling the heat. If you earn good and everyone is aware, there will be high expectations about how you live your life, and they will call you chindi if you choose to live with simplicity. Second is even worse place to be, people will look down on you because of your earnings and you will be given low importance. This is my personal observation. So I never ask for anyone's salary, I am not even aware of my close friends salary , and I never disclose my salary to them, forget about disclosing it to my Dad's colleagues. Never. I just refuse to answer. They can go fuck themselves. Especially some relatives, If I say them smaller number they will judge, get cocky and try to demoralise if I say them decent numbers they will try to fleece me. Hahaha oh God such an Indian thing to do! my family was opposite money is never discussed. I still don’t know my dad’s salary 😂 That only applies to Sthan I mean Dhan🤣. I simply say \"Bas kharcha paani nikal jaata hai\" and repeat until they give up Why do Indian gen zs get easily offended by every single thing? 🤔 It's a question, answer it, don't answer it, upto u. Move on and focus on more important things in life. 🤦🏼‍♀️ This is so intrusive. Just like so much everywhere in India. I wish one could be sarcastically yet respectfully able to brush off this inquisitiveness until it becomes too insistent when a more direct approach is needed. I am exercising a direct approach right now in a different context. just say \"bas kharcha nikal jaata hai\" and move on. Be a man, these stupid stories don't need to be cared about. And that’s bad I am home for a few months. I am 29, left my job and going to start PhD soon. All the uncles and aunties are so intrusive. They want to know everything from money I was making, how much I must have saved, when am I getting married, what my salary would be after PhD. One of my uncles told me to get married soon so I can concentrate on PhD and not have to worry about doing chores at home. To measure your net worth And since they’re Indian they can’t have a real dick-measuring contest since there would only be losers 😬 You should say “enough” A few years ago I was asked my salary by the kind of motor mouth relative everyone has, in the middle of 8-10 other relatives. I replied quietly \"Ninety Thousand\". Relative: \"Aap milo mujhse aa ke, kuch help karta hu job change main.\" I barely even know the guy. Me, embarrassed, speaking in a low voice so no one thinks I'm bragging: \"It's 90 thousand a month.\" Relative: .... He did not mouth off for the rest of the evening. >He even said the average placement was 40LPA at the college I laughed so hard at this. Coming from a top 10 ranked IIT ,Less than 10% of IITians earn that. If that's the case people would prefer ISI Bangalore over IIT Mumbai lol. Your uncle is definitely spicing up the numbers Better to quote, enough to make my parents retire, lol.... Might just say \"Jitna milta hain usme mai bohot khush hoon\". And after that if they still poke and ask you a figure just keep saying the same thing over and over \"Arey uncleji Jitna mil raha hain usme khush hoon bas\". I know to some close relatives who have no boundaries we can't really tell anything much to their face, but we can maintain our boundary, BY making it known to them that we aren't interested and will not give an answer to a question which isn't their concern. Whether I might learn less or more, no matter I wouldn't let even the range of my salary known to people, cuz if it's less they would think less of us and more then you know unki nazar hogi. At the end if they say \"arey bacha batana nahi chahta\" , just continue your work, give a smile, get up and go from there for a while or just change the topic. One of my friends keeps asking the same question. I don’t want to answer, but she keeps repeating it. I don’t like being asked such questions. I tell “enough to manage my expenses” 😬 best jawab diya hai- jitni zaroorat hai, utna milta hai. as if roz bhagwan poochhte hain- kitna budget hai aaj ka? fir malik se utna hi dilwa dete hain The best answer according to me is - \"Bus uncle itna package hai ki Daal, Roti aur Kiraya nikal jata hai\" You should compare him with other dad's and give a taste of his own medicine. Like that guy's dad gifted him a bike/home etc. Speaking of boundaries... Wait till you have a child and travel by train with the toddler. Every Unkil and Auntie will want to squeeze her cheeks and feed her god-knows-what! Looking at the comments, no one is giving a fuck about the CTC so it’s alright I tell them there is an NDA between me and the company and thus can't disclose the amount. I tell them I earn enough to live happily and peacefully. \"3 waqt ka roti, kapde and makan aa jata hai. Itna kaafi hai\" Time has changed. Ab log \"Rahul naam toh suna hoga\" ki jaghe \"Rahul kitna kama lete ho\" pe focus hai. Where are all these jobs offering so much money re I just tell people really low number and let them have their ego satisfied. I just secretly feel happy that no one knows I make a lot more. Never undersell yourself, always mention a number above 1cr net after tax i hate this thing in our indian culture people poking there nose in other's life. Whenever any of my relatives asks this question i give a very blunt reply, i get enough money to sustain myself and i am sorry i cannot tell you the figure. I dont give a shit how they feel after this. It's a generational difference- while they battle on respectability, us youngins ask stuff like \"do you have pets\", \"are you a cat person or a dog person\" etc 😹😹😹 good analogy We didn't ask for OP's CTC but he told us all (anonymous users) so casually. Why do Indians do this? One doesn't say any figure in such situations, least of all the real salary. One tries to portray oneself as humble and get by with \"bas, guzaara chal jaata hai\" (or the equivalent in other languages) and a laugh. Can somebody tell how to respond to such questions without being rude but not even sharing the figures So you were offended when some uncle asked your salary (and I don't blame you for that) but you have no qualms about openly boasting about it to thousands of strangers on the internet. I've started answering. \"Acha hai (Its' good)\" and when they ask \"fir bhi kitna\" - (still how much) I reply - Its' quite good! by the third reply, the conversation starts getting awkward, and i brush it off with a smile! You are among the few who realizes the importance of privacy and sanctity of these boundaries. When you become an uncle, you will do much better. But there will be still a large group of Indian uncles who don't know any better. In other words, there are several people of uvuncler age today who also are sensitive and do not intrude. It may just be that such folks may not be among your dad's friends. Haha, tell them an astronomical amount like 3Cr and destroy their mental state. While you are at it tell them you got an opportunity to go to US but only got 40% increment, so waiting it out until you get atleast 80%. Make them suffer in silence. Unhinged uncles know no boundaries. So that they know who to borrow money from Every time when I visit my hometown, there is at least one relative or parents friends who ask this question. And my answer every time has been , enough to manage the city life, parents expenses and save some for future. When they ask for further details I tell them the same thing above. When they are asking this question, be sure they want to know yours because they want compare with their son or daughters. And when they try to be picky and get more details I straight forward say, if it’s less than your son/daughter then you will feel happy else you will feel sad. And I know I don’t want to make you feel sad😁😁 They understand that and stop further questioning. You said 40L? If you are earning 40L you should say 14L when asked with uncles like this your salary should always be 3lpa and food is 2lpa Pretty much sure ISI Bangalore average placement package is not 40 LPA. People get placed well with good package, but, no, 40 LPA is definitely not the average. people who go to ISI are passionate, they do not care about things like money. They often go towards research. They value respect more than money. After 12 years of experiences I will advise you never give them inflated number those people are only want to put other people below them. I always deflate my no. Around 50% than see them smirk. Listen them to boast about theirs. Than give them cunning smirk without telling them they will know you played them and never ask CTC again ever. Lmao, uncles stare at any woman who passes by like monkeys, but they like to moral police them saying 'kaise kapde pehente ho' They directly ask for in hand salary Next time say this - uncle kaha lage hue ho, sun ke apko constipation ho jayega, rehne do! 🤣 It’s a common Indian society interaction technique to bring you down to their level, and then berate you! Never-Ever play a game to others terms! Let them guess.. In India, people access each other's value by numericals. How much you earn, how many cars, houses, etc. He or other Indians ask these because they think they can. Whenever someone asks you how much you earn, always tell them a false number much more than the reality. If they want to be like this, have fun with it. Tell them you are earning 1 crore pa. And laugh at the end or wink at them. 😆 70% of population of urban Ahmedabad is moving out of the old Ahmedabad where they have seen how other people influence and now they don't want to be with the others again So that they can ask pic of your bob next time. Because you can never accuse Indian Uncles for Subtlety Well I had one such incident in Bangalore as well. He asked if we were Brahmin. I mean casteism is pretty much prevalent everywhere. Literally how they determine your worth as a person so they don't even see anything wrong with it! Damn, dude thats right, I am gonna tell everyone insane inflated numbers and tell them like it's a secret and I haven't told others It’s a generational thing. We’ve become more and more reclusive and careful about how we interact with people. But 40 years ago, no internet no phone, talking about your life and everyone else’s life was the key form of entertainment. While some of that has been replaced, the habit is unlikely to fade away in that generation. Today it’s offensive, then it was an actual ice breaker / get to know you sort of thing. What do you do? From what I know with a master's degree and 6 years of experience 40LPA is just about right, anything less and you are underpaid. OP, next time same situation happens, just say: I think ur son or daughter is lying to you. There’s no way a fresh graduate will earn the same as an experienced professional (unless the offer was from Google or so). Congrats OP,you have achieved Sharma ji ka beta status... 😂 Don't know about them chickas my sorry asss is feeling a bit let down though... It's good to know what's going on in the Indian job market. In the US here. Appllies everywhere. When you dont tell them the get offended. I think it's just culture with that generation and especially true more of those that have come here from india no matter the age. Early on in my career I've divulged this information only to be ridiculed. I make close to 170k USD annually and they dismiss it as if it was a small number. No number will satisfy them unless you makeup some insane number. I just don't answer any questions on salary anymore. Exactly! I had said politely \"personal finance ka mamla h I don't discuss this with anyone, sorry.\" Bhai.... Face dekhna tha! Even then he was like firbhi roughly then I gave the broadest range. 🤣 Karo beeth k guess. Thank god, I don't believe in caste system, mujhe affect nahi karega 🤣 You nailed it. So many moments I wish I had a quick retort that would make them feel like shit so they’d never cross a boundary with me or anyone else. I’m waiting for next time lmao Bro you are still earning low if you’re living in Bangalore or Mumbai or Delhi. I hope you understand that. What was their reply Agar aisa hua toh taro mairo bhairo bolke nikal jaunga (I know the language but I'll act like I don't know) It honestly depends on what you do . You can have a phd w/6 years of experience and still earn less than half of what you quoted (40lpa). Not all professions scale the same way, please stop living in delusion Panauti hai tu What did you do your masters in? i did a B.E. Sr Data Eng I say the lowest respectable amount (30k per month) as I am afraid of people borrowing money from me due to bad past experiences. No no. Just tell them a lower amount. Like pennies. Tell them Your salary is 1.2 LPA and that you are planning to start a business. “Uncle you must have saved crores in all these years. Gimme a zero interest loan of 40L, I’ll pay you back in 5 years”. Keep doing that 3-4 times and watch them run at the sight of you. Let me correct your last sentence for you - Openly discussing salaries is a good thing since it tells you about market standards. At least you won't be low-balled in interviews. Just because people don't discuss salaries is the reason why now we must pay out of pocket for analysts to share salary reports every year (such as motion recruiting). Just because people don't discuss salaries is the reason why it has become taboo. Maybe we could learn a thing or two from your uncle. mere paas to hai hi nahin 😎 Still not racist it's true indeed. They bring this mindset along to other places too. Gujaratis in Mumbai love to gatekeep. If they live in a housing compelx, they will make sure to populate it with Gujaratis/Marwaris only. Fucking retards. Apna to ek hi jawab h ... Athanni Chavanni.. just tell them a low number so that they get happy and sense of pride that their son is earning more. you keep earning and enjoy your peace✌️ I didnt say I am earning a lot. It is good enough for me currently. But I also know there is a huge skew in the job market . So you will always feel you are not earning enough. Ye sab cheezo se upar uth chuka hoon ab. I just say - \"Bas guzara ho jata hai\" and watch their face with innocence. >you guys are not my uncle Areh beta! Kaise esa? Woh uncle seh achhe hai hum uncle aapke. 😂 Amdani athanni kharcha rupaiya is the only right answer Totally bro ... Arre uncle ! Aunty se milwao kabhi. Batata hoon Thailand trip pe kya kar rhe the aap Apne pe kabhi nahi lenge magar apne bacho ko zarror sunayenge It’s like measuring your brick size by assessing your market price. sabko apna wala bada lagta hai Work hard to the point where revealing your income is not an embarrassing confession or a misleading lie, but a proud flex. My usual response is \"bus sukh shanti se jeevan nikal jata hai\" Once an uncle asked multiple times so I asked him, \"Ram (his son) ko kitna milta hai? Usse kitna kaam ya jyada hai me btata hu\". He went mute after that. When uncle’s ask how much do you make? I tell them - humko kya hai jee hum toh jhola uthakar chale jaayenge. There are fields other than STEM Wao ! Hade for honesty! I guess this generation has some serious issue guys. We need to fix ourselves before blaming others. I am not supporting them, i am just saying thats how it is- try to see some beautify is something at times instead of just hating everything. Agreed! Never said it isnt but we can we fix them is the question, which is a no in this case. So better see what is good in them The correct answer is \"roti khaane layak kama, leta hun\" This. That's it. Boundaries. I learnt it the hard way. No one teaches these things. I don't know why all the other answers assume the worst in people, but at least from my own experience - Indian uncles who ask this question are always looking for a groom for their own/sister's/neighbour's/watchman's daughter. If they're asking you CTC it's to enter you into their mental database on which they run their matchmaking algorithm. Bhai bandi hai meri 💀 Uska kya One of my uncle brags how his daughter gets a stipend of a lac per month, she's my cousin too, he motivates others to study hard etc, on the other hand, she's totally burnt out, wants to quit and has lot of health issues but he doesn't care about that These uncles/aunts gets some sort of orgasm talking about your CTCs and comparing them with others and belittling you. I tell half of what I earn...too much crying by everyone & hajam nahi hota hai unhe sunke Average uncle convo. These convo are either 100% vibes or just like what op got Don't over flaunt your salary just to win a dick measuring ego contest. Once the world knows you earn good first they feel impressed and some of them feel insecure. They will start asking small loans from you which you will find hard to refuse. In case you refuse they will call you egoistic, prideful and bad person. Tell your parents also to maintain a low key. It's better to avoid the fuss. Spend, save and invest your salary wisely. You don't need to tell inflated number, in fact you should tell if at all, very less number. Try to avoid answer directly as much as possible like 'kaam chal ja raha hai big city hai, high expenses etc' , similar to like your acquaintance tried to avoid telling exact figures for his son. If nothing works out tell some random but less number. Also you don't need to be disrespectful, they are your parents friends. Uncle tera hi market badha re hain, chod gayi bandi to option rahega baad me. Aajkal arranged marriage ki market bahut kharab chalri hai waise bhi, accha hi hai pipeline bana ke rakhna. Never share your CTC. This will turn into “arre aapka beta toh itna kamaata hai, aap udhaar do/ kharch karo….”, in blink an eye. I’m from a notorious northern state so never know when someone will abduct my father for a ransom equals to my CTC, lol - kidding but as a general practice, never share finances with outsiders. I have similar uncles and relatives too, when they ask - I say “kaam chal jaata hai”. Some hard asses don’t let it go and keep asking, but I don’t relent. The looks on their faces is worth enjoying 😄 Just reply w 'a comfortable amount/bas ghar chal jaata hai' unless it's an uncle whose daughter you might be interested in. Aukad janni hoti hai Usine bheja tha muje! Tu kya batayega! Bhai, this never changes in such households. I am from a tier 1 college, earning \\~50L pre tax, with 4YOE. I also get same shit from my father. So, my point is that it has nothing to do with how much you make or how good you are doing. Some people just have this habit of putting their children down. What I have observed is that they are more concerned about other people's opinions, rather than their own children's happiness. खर्चा चल जाता है ! Give a very low number, like 10% of what I really make. In reality they want to feel good about their children because comparison is important for Indian parents. It makes them feel better. And I don’t get to reveal what I make. you are so right THIS. Earning enough to cover the expenses should be the right answer for such people. Say 2crores You should've said ew. Aapka beta below average kamata hai kya? Ew. People are absolute shameless these days , they just know to flex on their achievements and make others feel small.CTC is not just one thing they flex on other things to like we got a property there , we went to so and so country for vacay etc Abe chip kar show off. You and the uncle aren’t different. One of the major reasons why I left India was this. I was considered as a rebel talking back to these sort of uncles and showing them their position. The fact that indians thrive on unhealthy competition and jealousy is beyond my comprehension. Next time if the uncle says “kitna mil jata hai”, just say none of your business. You will feel bad at first, but will eventually realize that these sort of interferences in your life has reduced. I just tell them. 5CR. Then add monthly. Good to see their faces after. You ask them revenue and profit details first average placement of ISI Bangalore masters is not that high. Next time you meet him, ask what branch he is from. From what I know, average placement for ISI Bang is around 12-15 LPA, with exceptional students landing 25-30 LPA. The college itself is not placement oriented, hence please stop your uncle from doing such bragging while we actually publish previous year placement and package records online. PS: I am from ISI Bangalore hence commenting. I just say it’s close to 1Cr and every uncle/aunty gets very awkward 😂 Cause ur value in front their eyes is based on the amount of money u make, It’s not there fault, it’s our cultures fault Remove one zero and that's my CTC. It's insane to imagine that somebody gets 40LPA fr! i know so many people well into their careers making a fourth of that. it's all about the perceived value of a profession and available labor pool You have a thing or two to learn from your sisters. Always give a range but never tell exact number. Why doesn't it sit right? Our company gives a base of 40LPA to fresh Masters grads too, CTC easily crosses 75-80. You wanted to flex, but couldn't lmao. How do you create that boundary with your parents? My parents enquire about EVERY aspect of my life, including what I ate for every meal. the result of limiting your personality to your kids If an Indian uncle is working in the IT Department, then how should we answer this? Asking for a friend yes they probably meant classist Being from the UK whenever I visit India that is the first thing I always get asked, no how are you, how was your trip, haven’t seen you in ages, straight to how much do you earn in the UK. Most Indians seem to think that everybody earns millions and that the streets are paved in gold! Whose boobs are bigger? It’s the same shit “Boundary? What’s that?” - every Indian uncle/aunty I think they do it so they can judge you. The more you earn, the more valuable your opinions and forgivable your sins. You’ll never see them treat someone with respect who earns less than their own son/daughter etc. I'd rather answer lower. Inflated figures are also being heard by people around you. And Indians are nothing if not entitled. You'll become the default lender of the family. Rather answer lower, smile and wave, and not to take the \"arey beta itna kam\" personally bol do 220 volt aata hai If I were you, I'd have said 20LPA. Leave alone you rounding it up, but you would say 60 in the future 🤦 Just live your life man coz it gives happiness infront to their goofy ass Just say - ha mil jata hai thik thak and bounce, why even give them any figure lol Wait for a year, they will start asking you money for hospital charges. Indians are the most racism culture in the US. Ever see an African American at one of the Indian witch companies ? Question- why inflate the number, is it an ego game where you have to be on the top? People are inquisitive. If I don’t want to share, and I know they are asking to measure the social status, I would downplay. Quote something meagre just for them to be happy. “ Well Thats none of your business uncle , but I assure you , it’s not low”” Kuchh shlok bolke dikhao Aham kalam, twavam kalam. Russian gulabam. Salaries should be disclosed. So that people get treated equally for pnce Brother I'm in the same boat as you. 3+ years of experience but still far from 10 lpa. I keep hearing taunts from parents. Switch is the only option but in this market it seems so hard these days. What are you planning brother ? Dm me maybe we both could help out each other in job hunting Bhai a number is not the goal. Goal is to be satisfied. See beta, that guy got this much of salary. And thanks might use some bad words towards you though. Like that bacha got this much, why can't you? Good for you man 🙌 . Uncle ghar hai paisa hai gaadi, do jodo me ladki bhejo ladki hui hamari 🙂‍↔️ You don’t have to answer. I just respond, it’s a decent amount. My parents also do not know my exact salary. Finally we are comparing boobs now . Too much dick comparison was going on I always dodge the question. Apart from my parents and my partner, no one else needs to know - and only because I have a healthy relationship with them and it helps to plan life. “I get as much as I need” I usually give a vague answer at first but if they still persist then I quote a figure 5-6 lacks less than my CTC. Never tell your relatives how much you're making, you don't know when they'll ask for money. Uncle's ego gets satisfied knowing a low number, my ego gets satisfied in actually earning more than what I've quoted. Win, win! This is the same way they ask about your kids percentage marks this year. Because they are stupid. Never tell anyone how much money you make. If for some reason you feel compelled to then do the opposite, give them a really low number. You can rest with the fact they will not be asking you for money. It's none of their business. Then they'll reply \"Haan avg 60 hai\". Never say specifics. I lived in the urban Ahmedabad until last year. One of the poshest, most cosmopolitan areas too. There were people from all castes but not one muslim. Zyada se zyada potential recruiter ko batao salary, not rishtedaar. I remember when I was asked when i got my first job. I just said 'Nahi sorry ye toh na ho payega, mera bas chale toh ghar pe bhi na batau, itni kam hai....' with a smile. Nobody asked me this question after that How to tackle such situations is the question here!!!!! I really need an answer to this I too have a besharm fufa who would outta nowhere ask what is my salary???? I mean wtf???? Ughhhh! This post was relatable Most of them couldn’t counter it. One of them (my aunt) said she still believes Indian culture is the best in the world. According to her, ours is the only culture which cares about aging parents. So thoda curiosity is fine apparently. Muze to raste se jate jate log puch lete he mahine ka kitna bcoz they have niece and daughters to marry off... my father in law used to always ask me about my package everytime i changed jobs... My approach is the same. There was one incident though. I was invited by an uncle who is a family friend. The uncle himself is a self made man and a very nice guy. So, we were sitting at his place and one of his neighbours joined us ununounced. This neighbour was a retired judge and he asked for my salary. Initially, I didn't respond but he kept asking and the situation became awkward and tense. To diffuse the situation, I gave him a figure that was 1/4th of my actual salary. He then went on a rant about his son rejecting a govt job and instead joining private sector. In his rant, he disclosed horrible stuff he used to do to people who were businessman. I believe he missed the power and was a psychopath. I sucked it up at that time to save trouble for the uncle later. But yeah, I don't disclose in the first place and if I have to then I give a very low figure. Huh never said that's my salary, that's what my company pays for Masters graduates, it's really the market rate especially if you're from ISI Bangalore 💀 Atleast ghante ka kitna toh nahin puchte women too!! Tell them an insane number like 2-3 Cr. they will happily tell u incl encashed leave and what da they receive and how the indian govt fleece them Our society needs at least few more generations to mature and learn some basic manners and boundaries. mumbai too Then good for ISI peeps. Tbh I dont care so much kitna mil rha inko Indians in general lack boundaries. Commenting on salary, job, weight, childlessness, skin color, hair etc. is fairly normal. I have to cultivate inner fortitude for about 4 months every time I visit family back home. I’m not kidding. In India nobody is taught what is basic etiquette in conversation. Parents dont have the time in such a competitive society to impart this knowledge and the less said the better about schools. Ye reddit par nai bolna tha 💀 Now turn off dms for your own sanity I ask my dad the same thing. I tell him my friends dad's are making so much more what are you doing. The best way to deal with this is ask the uncle how much he is earning or how much savings he has. And then non chalantly tell them all your friends dad make more than them or have more savings than them. We should hit them back at the same place they try to hit us lol. This is what I do whenever my dad asks me why I am earning less or some bullshit in this regards. I tell him modi a chaiwala has become the president and is earning crores everyday what are you doing. And then I can also feel pity for them for such a sad situation: “Uncle despite 30 years of experience you could only save this much”. Look at Sharma uncle ji who invested in plots and he’s worth this much. I usually do the other way. I dont like anybody gauging my financial ability. If i make 40LPA, i would say 25LPA. Just go with 1 Cr as base and add there is variable component of 20% to 90% stocks I face this often. I’ve stopped giving them numbers. Worst case scenario, give them a deflated number. Saves you from nazar🧿 For some reason I read this in South Indian accent in my head. I can proudly say that I can refuse to answer such question with no hesitation to ignore further inquiries What is this CTC term ? Don’t over inflate. Make your self poor. Then they won’t ask you for money. Say that after the promotion I get 10 lacs! With a beaming smile. They’ll slowly slink away Honestly, I fucking hate such uncles. Similar to your story, some uncle asked me about my salary at that time and I hesitantly told him 30LPA(which is decent for 2yoe). But this uncle mocked me that it’s so low and what’s the point of so much of your education. I was also furious that my dad didn’t told anything to him and just told me to tell the inflated numbers from next time. From then on, I have stopped telling people my CTC unless they are my good friends. It’s good to discuss CTC with your peer group in a healthy way so that you are aware of market trends but I am not revealing actual numbers to any uncle. I just brush off the topic or if they insist too much, I tell them an inflated number. Funny that Indian redditors feel only uncle and aunties are doing that. Just go on most Indian subs and they are talking about salaries almost everyday. There is not much difference but yet uncles and aunties would be made fun of while it should be other way around at least they are asking known people you guys are shamelessly asking random strangers over internet. Stop shaming oldies when you are doing the exact same thing in a different setting and yet you will have a non sense defense for it. My family members used to do this until I started making more money than them. Surprise, they never asked again! Whenever they ask always say, i do well for myself. When they asl but how much, say, good enough. When they insist, say your company has made ur sign an NDA and it would land you in trouble if you give details. > tactics men employ. people who complain about ctc gossip are usually well earning individuals. People who live paycheck to paycheck don't care to post about this gossip because they are insecure about their income levels. that is so true. Bhai shaadi ke baad bhi some will crib about how the wife snatched away her son. I am like aunty bada ho gya hai beta , sax karne ki umar ho gyi hai karne do bhai . yes. LPA- Lakhs Per Anum. 40 LPA is equivalent of $47,607.68 USD, which is like earning $172,875 in Los Angeles. (PPP conversion) When I started earning, I had 6 lpa and my father's friend had 12 lpa so I got constant reminders that I was a failure. Now they don't know what I earn and never will, only people who should be aware of your salary are your colleagues and significant other. Easy - lie This is the way. I've done this and then enjoyed not budging as they pressed again and again, their faces becoming visibly uncomfortable. Then they start sharing numbers of other people to goad me, to which I say \"bohat accha uncle\". I quote a number based on what I think, they think of me. Which usually isn't too much! And the conversation ends up at - \"Koi ni beta, aaj kal market kharab h\". All uncles are also matchmakers. So they are trying ti judge your market value in shaadi market. Sundar pitchai's father isn't happy either. lmao the timing of this post is exactly on the day i got placed in campus interview. This happens to me. When no one is around me my mama(with a smiling face) comes n asks me \"kitna hua increment\" and I'm always uncomfortable sharing. He keeps on asking till I give him the number.Any suggestions on how to avoid.Due to this I hate going to family functions . Don’t you mean prime minister lol. Typical Indian Unkil or Aunti whose highest point in their entire lifetime was to make a kid and shove all their hopes and dreams into them. People like these are usually sad really. Just shatter their perspective like you thought you’d do by giving an inflated number, works the best. They stop asking. Or, just say mahine k 3 iPhone ajate hai. Oh yeah. Edited the comment thanks lol. Plz have balls to say ‘’it’s personal uncle, I am very happy with what I am making” that’s it!!! If he insists, just move to diff convo. Well.. in future if someone asks you about your CTC and you are left with no choice but to answer them you can just try saying \"enough to live comfortably\" with a little smile so that it can make you seem not too rude also you will not be revealing facts about the paycheck. It worked for me might come in handy for you too and even after answering their question if they are still being Persistent and want to know the exact number..hey 40 LPA is a great number if you are working in INDIA or as you said inflate the number soo high they start questioning their own existence. Ladki hoke aise bol sakte hain kya? 😭😂 Dude, my manager asked me ‘what’ I am on my first day. I’m an advocate. Working in corp law 😭🥰 you’d think they’d be more aware/ sensitive considering their education and field of work but nope, definitely not the case lol Not even them, only you and Him. Their is the last generation _ have fun. They will be extinct soon Its weird i already know this trick…… in my case it was college marks. In general people at least in the same field should talk about CTC often. That's how you know how much more you can ask the company. !?! Really? Only a few tier 1 mba and eng colleges can provide close to that for their flagship course Currently , on paper 10 lakh Indians make over 50 lakh yearly and that includes non salaried professionals who would def be making the majority of this number. So roughly 5-6 lakh salaried individuals r above that figure , again, majority of those would be having a lot more than just 6 years exp Bolna hota hai bas dal roti chalrhi, this is the way. >people saying I was offended , Nope I wasn't Honestly I would he offended. I would've worked 6 years to reach there and this uncle is lying to show off. Even top colleges in India does not have 40LPA overall average package. (I would've said that to his face frankly if I were you) Every situation doesn't need a comeback...a polite walkaway is better. Always be respectful even if the other isn't specially if they are older i quote 5 lpa that too gets deducted after tax soo 3 lpa uncle😅😂. So that i can be sure that they never come to ask for money. Always say low, my dad thought me that My standard response is “more than your illegitimate son” does. That usually forces the moti aunties gathered around to faint and I walk away pleased He lied for the same reasons you did, and similar reasons as you plan to next time. Perpetuating the cycle and complaining about it. Fascinating. Hey how did you got that much salary ? I did this a couple times (a bit more respectfully obv) and now nobody asks about my pay anymore. I'd say it's a win Just have the balls to say \"none of your business\". If our generation can't say it, this shit will never end. My trick is say something around 1.4LPA. Its barely 10k in hand lol…this way you both are happy! Dude, I don't know why things like this are contests. This was in 2014, not so much domestic air connectivity as today and before I was leaving for US for my MS. Before leaving the town this Uncle called me to visit his family and I went. While speak we spoke about my travel arrangements, date etc. I got to know that the Uncle's son(similar in my age) is also going to VIT(Vellore one) for Masters. I congratulated him and we moved on with conversation. The next day I received a call from the Uncle and we spoke for a bit. And he not so casually mentions that his son is leaving for his masters on a plane and that too a week before me. So he will have his first plane ride before me. For the express purpose of flying, he and his family went to bigger metro 6 hrs away by train. Never ask a Man His Wage and Women her Age. It gets worse when you realize it’s really a sons d!ck measuring contest. Lmao my sons pp is bigger than your sons pp 🤣 They don't care about being politically correct. They don't think it's an offensive question. Does this uncle have a beautiful daughter? Then definitely go for 1 Cr To inhand bara kar bol de.. bas uncle ki bolti bandh.. Try backanswering with \"Tumhaari beti se shaadi karwaani hain....?\" I dont think they mean to be crude, unless of course they are Sharma ji and they compare beta's ctc to yours You should say 60LPA \\[haath me 25\\] that amount would shut up most.. It works for me.. Na man that's too much.. Out of experience let me tell you. The uncle would have flaunted his son’s CTC if that would have been more than yours 😂 I always prefer to quote a much lower number. Totally relatable, it is so frustrating to deal. Happens with me in flights as well. Inki mkc I answer like this .. gujara ho jata hai by Indian uncles and aunties you basically mean everyone lol. our gen has learnt the concept of privacy, they apparently never did 1st of all placements are shit this year everywhere and no way ISI Bangalore avg salary is 40 LPA. I had hired from ISI Kolkata in 2022 and 2023, and we paid 18 LPA. So ur uncle is bluffing. Lol you should've asked whether he had a fight with aunty These are the kinds of uncles who work as a clerk in some shitty government office for 20k pm and are the reason why getting any government work takes so much time I was like you. Then I noticed how people started taking advantage of me knowing i have money. Now my answer to how much i earn: I am unemployed. Sthan ya dhan? Wait does this really works do these annoying people eventually stop asking such questions Btw nice username 😄 I am a poha lover too Indians usually don’t have any civic sense and don’t respect any boundaries It is just to troll him. Why do you think you are liable to tell the truth It came hell more creeper when u told u are a married woman like wtf don't these uncles think ur husband would best the shit out of them if they talk to u like this,leave that also u are a grown up person and one can't talk to a person like this Age-old wisdom from my grand parents to my parents and then to me : Never disclose your salary. Stuffs I say when someone asks: 1. Bas guzara ho jata h aur kuch bach jata h 2. well off for every day life 3. Industry standard, (I am in tech) jitna 2-3 saal ke experience me milta h logo ko. If they insist, I asked point blank: Aap to eise pooch rahe ho jaise rista karane wale ho.. Nobody except my manager and coworkers know my CTC. I always avoid giving a number They do that to people whi are not related to them, mere.se poocha tha ek baar, maine bas ye bola ki kyu uncle apni beti byahne ki soch rahe kya, meri to shaadi ho gayi kisi aur se pooch lo. He got very angry.... Their kids learn the same and the cycle continues. TBH always share your salary with uncle aunty whatever. And share it without any pride or shame, Indians already have too many stigmas around money Or Agee jada noisy hai to samajh jao they are not good people and avoid them, but reddit pe aake apne low agency hone ka pardarshan mat karo Quote an absurd number next time. Bold of you to assume, things have changed. We are still very judgemental society. Not sure whether to feel good or bad for you. If you are getting good treatment, enjoy. But, I personally feel is bad, treating people based on their earning potential. The reason, is if things go south, these would generally be the first person in line to bad mouth you as well. Most of the people especially relatives get happy, if you're not on their level. Not just uncle's bro aunties too .all relatives are like this . Hell even my parents are too . Now What do parents do with these details? they torture us with the \"Sharma ji ka beta 300000 rupay kama leta hai tu toh 300 ka ek din me kha lete ho sharam karo\". Its like a stress relief for them to nag at us 1)Find a simple reason to yell at your child . 2)Yell at your child . 3)If child rebels Say the dialogue\"We are all working hard for your sake \" . 4)Happy sleep for them . Op the link says 2021-2022 highest is 21 lpa. Are u guys getting paid 40lpa in India? Holy shit!! I'll just tell them I'm unemployed and see their reaction.... To such questions i always answer “guzara chal jata hai” they immediately know to back off .. but then there are some who will put a number like 50k per month to mil jata hoga na to which i respond han itna to hai .. so basically you didn’t tell them the real number and said yes to their quotes figures so probably giving them the satisfaction ki chalo kam hi kama rahe hain hmse / hmare bachho se !! Which in my opinion is much better than getting evil eyes ! A better answer will be Uncle itna mil jata hai ki aapse help lene ke liye aana nahin parta Kabhi zarurat hua to aapke pass hi aunga Learn to say No. Simple. Grammatical mistake: Asking about the CTC, not \"for\". It's not something you can give or do for them. Ahh the great Indian parenting saga, my mom still compares how kids younger than me are married and have offspring and how I failed them even though they indeed provided me all the support to be successful. I don't even feel bad about myself but for my mother as it's nearly impossible to change her point of view, which is tangled with society's expectations and never ending path to content. I mean look at Americans, they retire, sell off their big house, move to a small one so that they can travel around the world. My grandfather, he gets a pension from the army, money from agriculture activities, rent from the shops and at 80 money is still on his mind, same goes for my father and sadly for me as well. Our whole 3rd generation just has money in our mind Don't inflate the number. Deflate it. a lot. you should have said 10LPA, and very proudly. Now he will brag about his son getting 20LPA, and also start pitying you. But you can be laughing inside, because you know the truth. ‘Bas ghar chal jata hai Uncle’ - you have to say only this I do exactly the opposite, I deflate the salary and say it. For example, Random Uncle (RU): How is your job? How much do you earn? Me: 1.3L per month(Any number between 1.2-1.5) RU: Bangalore is expensive right? Or are you planning to buy a home?. Me: I don't have any savings, 50k goes into rent, maid, bills etc. Another 70k for groceries, outings and travels to functions like these. RU looks at me with such disappointment for getting this after 10+ years and a very good college. Sometimes they give suggestions. RU: Why don't you try learning XYZ or do certification or go to the US, or join ABC company, etc? Me: I need to work extra time for that, If I move to a different company or the US I need to work harder. I can't and don't want to work hard. I am happy with what I am getting. RU thinks I have gone nuts and either gets a call or changes the topic. I am happy, that he will not bring up this topic again with me or ask me to help his neighbours cousins son to find a job, who has completed BCom and wants to work in AI. To Humble You I didnt ask for your emotional response. It was just sharing a particular experience. Earning potential had nothing to do with his response, he was happy that his daughter was secure although she had a fairly secure PSU job and income which was pensionable. Also the person is a traditionalist; will never bad mouth the damaad unless I have done something criminal. Also relatives dont give a damn of where u are in life unless u are living with your extended family in a ghetto I have an MBA - working at one of the largest MNCs in India - 2.7 LPA. An MBA doesn't guarantee high package, the college you graduate from makes all the difference. What line of work are you in Bob? You seem about just as fragile about this as your uncles. >An MBA doesn't guarantee high package neither does a master's degree and 6 years of experience. In other news, the sky is still blue. What line of work are you in tho? True, the initial comment above was a little ignorant on my part. I work in auditing, specifically IT auditing at a Big4. Isn't 2.7 really low for even after an MBA degree? I did my BCA and my friends who opened for placements were getting average 4lpa... I'm guessing you're not in the IT field. Tier 1 MBA colleges have an average of 25+lpa tho Bhai, agli baar koi CTC pooche toh 500 ka note nikalna, aur use aag laga dena uske saamne. Gand fat jaegi uski. Devesh Dixit ka recommended hai. I usually say an average salary since I don't bother nor care what uncles, aunties or my next door nosey neighbor think! I grew up in the U.S., so I tell them \"it's rude to ask about salaries in my culture.\" They never know what to say, lol. India is the most judgmental country on the planet. I love India. Even despite this problem it is my favorite country. I have traveled all over the world. However, this is a good thing. Everyone needs to be intrusive and know how much money everyone is making. It only helps the 0.1% and hurts 99.9. This is how two people working the same job at the same company can get half the salary of the other one. This is how you can earn 50% of what you should be earning in your field, bc you didn't know. Yeah the comments and judgment are absolutely disgusting but i would rather have everyone being paid fairly. Just counter them and ask them how much money they have in savings My answer was always “comfortable” You are not far from truth. That uncle died one year later. I am like, me exact figure nahi bata sakta. App batao aap kitna kamate ho then I will tell you if it is more or less. That really shuts them up. Plus, I am known to be very straightforward, so folks in my family don't ask dumb questions to me. I'm wondering what would happen if OP had told random uncle \"I'm not comfortable discussing that\" concept of privacy? were 1.4 billion people produced from intercourses that happened openly in public? do people in your family expect you to change your cloths or shower while they are watching? Do they ask you to share your password or private diary or online journal? Aukaat naapne ke liye. why can you explain the context behind that? I give contradictory answers. Example “even my father has no idea, do you think I will tell you?” And then not a single word coming out of their mouth. I’m 5.4’ ft in height so some uncles be like my son is younger but taller than you and I answer them “measure how much we grew mentally not physically “ and pin drop silent 😂 I think you have to give savage answers that they never dare to ask such questions. Peace ✌🏻 You know Indian society was poor in the last generation, so money matters a lot. And a person feels great if his son/daughter make good money as compare to kids of his peers. The previous generation outlook couldn't evolve beyond a narrow spectrum unfortunately. What’s CTC ? Indian uncles are anything but who we are today, they despise us, are jealous of us. May be they have daughters they are just looking for a wealthy groom Total compensation Didn’t knew builders also practiced caste system for selling new projects? 😭 Indian parents life is all about comparasion. This sole behaviour makes them miser, since someone will always be at better place than you. This behaviour also makes one to take silly financial decisions like taking home loan when one is not really needed. Home is important but with planning. My pops became sad after placement cause my best friend got 52 lpa package, and I could only get 20. Still he says to me \"kuch to kamk reh gayi hogi\". I do appreciate his hardwork for me throughout his life, but this comparasion mindset of our society 🤡. plan is to silence not create more questions My friend used to dodge this question by saying “ not enough “ which I think is perfect On the face reply with a smile \"How does it matter how much I earn, anyway I am not going to give you a single paisa from it\" So they can ensure their son/daughter make more than you avg salary is not a good indicator. median salary is a better indicator for a college placement. Thanks 🙏🏻 So you can say 'mind your own business' or 'f*ck off' if you are sanskaari enough Jhaat pooche to bolo katuaa I too used to face same question long ago and as I didn't want reveal my CTC/salary amount with my relatives/acquittances, I have figured out replies. One of the reply I tell them is 'Uparwala ki meharbani hai'. Second is 'bas uncle guzar basar ho jata hai', although we both know I earn decent money (by the grace of god) but they would never know exact amount. yes. learn the sublime art of telling but not revealing. it will come in handy with HR, family, friends, girl friends. and one night in the dark, when no one is around, tell yourself how much you earn to yourself! You should always reply with bas roti pani ka kharcha nikal jaata h uncle 😊 It is very simple. They want to know so that they can compare it with their kids and prepare their kids to compete. \"Dekho sharma ki ladka aaj kitna kama raha hai\", for this one activity. I always tell them the thrice of my salary so they never dare to ask and never try to compete. May be he is doing market analysis like you can do anonymously , but he doesn't know how to use reddit. It's generation thing. May be he is not personal , but also happy for you . I am not sure his intentions were not to hurt you, but you did had bad intentions. So what's exactly the difference here ? Just because someone is asking your salary doesnt mean you need to let them know, just deny, plain and simple. You are absolutely right man, some motherfuckers in this society will even try to say lies in order to match a more successful person in conversation, like what the fuck man you have become a fucking 40 year old person and rather than being wise you are trying to protect your so called reputation by lying? People just don't realise that the person in front of them has worked really hard to achieve their level. 🤣👍 Correct !! Bhai kya bolte ho aap? When people ask…? Always lowball such questions, I feel it just gives people a sense of achievement and no harm is done. Wait what ? How were my intentions bad ? He asked mine , I asked about his son's . Instead of giving me the straight answer he just played around with words . Naah he has 2 sons , none are gay Correction… father is retiring. It’s not “today morning”. It’s “this morning”. Life is too short to argue about money. Just say, \"Aapse matlab?\" and move on. Just ask them to mind their own effing business. I would really be annoyed if somebody asked me this question Maybe just say 'enough'. Remember that meme: to kamao na bh****K? Tab seedha vinaybhang chillaneka, permanently chup hojayenge Suggestion (and what I do during this scenario). My conversation with uncles/aunties goes like this -- Them: \"Kitna salary milta hai ?\" Me \"Aapko kya lagta hai ?\" Them: \"Humko kya pata ? Tum batao kita hai ?\" Me\" \"To bhi, kya lagta hai aapko kitna milta hoga mujhe ?\" At this point they might say some figure. Say \"Yes\" to whatever they say and move on. Huh I always do the opposite, give them a super low number. They are always happy to hear that their son/daughter make a lot more. Win win Because Indian culture does not comprehend boundaries. Remember when they ask your salary, they are judging how much respect they should give you Main core Ahmedabad mai rehta hun. Maine to yey sab nahi dekha. *Mere khud Ghar Mai rehta hun lekin 💀 I have never seen anyone put it as well as you do. Of course, they ask.. to be nosey. Can't do anything about it. Just ask them \"CTC Matlab\" and then use that time to think of a way to take the conversation to a tangent. \"Bas kharcha paani nikalte jata hai\" works too, but sometimes they come back with \"phir Bhi\". You can say dekhiye uncle, ambani Bhi woi gehun ka roti khataa hai.. aap aur hum bhi.. sab moh maaya hai. Pro tip: Tackling uncles can teach you skills MBA courses cannot. whataboutism I suppose you're right Uncle ke life kuch jaat nahi chal raha isliye Smile and say “ kaam chal jaata hai” .. or “I get by ok” version in your local language. It’s another modern Indian habit of being intrusive and weirdly competitive. Indian society needs to reestablish personal boundaries on politics, salaries and religion One of the best joys in adult life is to dole out advice (even if it’s for the best of intentions). But that’s the way to dodge it - inflate your numbers. You hired M.Stat folks ? [A reality check for people like you.](https://www.reddit.com/r/ahmedabad/s/wtqPsNhdM1)"
}