{
    "id": "1537g55",
    "title": "Why isn't our media reporting on investment being pulled out by international organisations",
    "url": "https://www.reddit.com/r/india/comments/1537g55/why_isnt_our_media_reporting_on_investment_being/",
    "selftext": "https://m.economictimes.com/tech/newsletters/tech-top-5/softbank-sheds-another-2-in-paytm-will-seek-review-on-28-gst-once-gaming-rules-in-place-chandrasekhar/articleshow/101863674.cms\n\n\nRecently saw that Foxconn, which was supposed to replace iPhone facilities from China into India suddenly cut all ties. Now Softbank which funds most of the major startups has started to trim down on the investments. \n\nThese are just a few examples, but haven't seen mainstream media reporting or questioning our government on this. India relies so heavily on IT sector, which has been going through a layoff period since last year and somehow everything seems peaceful when watching news financially.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689707651.0,
    "convurl": "https://external-preview.redd.it/J1WOyOGB-4hu35u2n7Oj9_QrIcyuMIiOKmoGhQk3NWw.jpg?auto=webp&s=8e3d6b424923575527d96966a1643d7e2e0df218",
    "comments": [
        "I doubt our average Indian janta cares about this news, they are busy in India-Pakistan, Chandrayaan and Ram Mandir.",
        "Mainstream media stopped reporting ages ago.",
        "Why dont you read news in details than spreading fake propaganda ? \n\nFoxconn pulled out of India? When? \n\nhttps://m.timesofindia.com/business/india-business/foxconn-buys-equipment-from-apple-for-expansion-in-india/articleshow/101873458.cms\n\nhttps://www.business-standard.com/companies/news/foxconn-buys-worth-33-mn-equipment-from-apple-for-expansion-in-india-123071800612_1.html\n\nInstead foxconn is expanding massively. \n\nSeems like you can’t differentiate between iphone manufacturer and chip manufacturer. \n\nFoxconn pulled out of semiconductor joint venture with Vedanta not completely out of India. \n\nhttps://www.livemint.com/news/india/foxconn-mulling-over-to-apply-separately-for-chip-manufacturing-unit-in-indiataiwanvedanta-11689059802414.html\n\nThey have clarified they will go ahead without vedanta due to lack of funds and disagreements. \n\nSecondly, softbank is running at a loss and is cutting costs all around the world not just India. \n\nhttps://www.bloomberg.com/news/articles/2022-08-08/softbank-ceo-pledges-sweeping-cost-cuts-after-23-4-billion-loss\n\nThey have even sold their stake in alibaba for 20billion. \n\nI assume you are a hyper emotional 16-17year kid who wants attention on internet. Next time do through study in details than complaining here. Everything is available on internet. Many youtube study channels also explain these issues in details every now and then if you want to learn i can hit you up with some channels. If you want to continue your political vendetta bullshit go ahead.",
        "I have no idea why you're getting so pumped up eager to insult someone you don't know personally.\n\nThere are 2 things you need to know: firstly, the ramp-up is a promise of $ 33 million and not finalised. Secondly, the vedanta sc chip was a done deal, which is cancelled now for approx $ 19 billion. So what was India's total profit? Just do the maths.\n\nSecondly, I clearly wrote about the so-called national media that is the hindi news channel that day n night show the same thing all over again. Without having the slightest responsibility towards the nation.\n\nIt's good to have a political belief, but when your belief starts to cause damage to our country, people like me will speak. You can glorify your supreme leaders and keep your families starved so they can enjoy a life of luxury. But some of us have problems with that and work hard to provide a better life to our families.",
        "First thing you wrote about foxconn moving away iphone production from India which is a straight up lie. You didnt know difference between iphone and semiconductor operations of foxconn. Now you mug up some numbers form google and copy paste here to act as intellectual which you are clearly not. \n\nWe haven’t sold any of our PSU irrespective of what you think. No ISRO staff is working without getting paid. ISRO doesnt make any parts they outsource them from various sub partners. It’s HEC a psu whose staff havent paid salaries. Atleast read about it than typing things without having iota of knowledge. \n\nIndia doesnt rely on semiconductor for its own use. Our defence forces use Indian chips. India is trying to get into consumer semiconductor market for which having established players like foxconn and tsmc is a must. \n\nI have see  likes of zee news,India today,republic etc post news regarding foxconn’s withdrawal from JV with Vedanta. I dont know why you feel they havent reported the incident. \n\nWhy you getting triggered for being called out after posting fake propaganda?"
    ],
    "cleaned_text": "isnt media reporting investment pulled international organisations recently saw foxconn supposed replace iphone facilities china india suddenly cut ties softbank funds major startups started trim investments examples havent seen mainstream media reporting questioning government india relies heavily sector going layoff period since last year somehow everything seems peaceful watching news financially ",
    "cleaned_title": "isnt media reporting investment pulled international organisations",
    "cleaned_selftext": "recently saw foxconn supposed replace iphone facilities china india suddenly cut ties softbank funds major startups started trim investments examples havent seen mainstream media reporting questioning government india relies heavily sector going layoff period since last year somehow everything seems peaceful watching news financially",
    "cleaned_comments": "doubt average indian janta cares news busy indiapakistan chandrayaan ram mandir mainstream media stopped reporting ages ago dont read news details spreading fake propaganda foxconn pulled india instead foxconn expanding massively seems like cant differentiate iphone manufacturer chip manufacturer foxconn pulled semiconductor joint venture vedanta completely india clarified go ahead without vedanta due lack funds disagreements secondly softbank running loss cutting costs around world india even sold stake alibaba billion assume hyper emotional year kid wants attention internet next time study details complaining everything available internet many youtube study channels also explain issues details every want learn hit channels want continue political vendetta bullshit go ahead idea youre getting pumped eager insult someone dont know personally things need know firstly rampup promise million finalised secondly vedanta sc chip done deal cancelled approx billion indias total profit maths secondly clearly wrote socalled national media hindi news channel day n night show thing without slightest responsibility towards nation good political belief belief starts cause damage country people like speak glorify supreme leaders keep families starved enjoy life luxury us problems work hard provide better life families first thing wrote foxconn moving away iphone production india straight lie didnt know difference iphone semiconductor operations foxconn mug numbers form google copy paste act intellectual clearly havent sold psu irrespective think isro staff working without getting paid isro doesnt make parts outsource various sub partners hec psu whose staff havent paid salaries atleast read typing things without iota knowledge india doesnt rely semiconductor use defence forces use indian chips india trying get consumer semiconductor market established players like foxconn tsmc must see likes zee newsindia todayrepublic etc post news regarding foxconns withdrawal jv vedanta dont know feel havent reported incident getting triggered called posting fake propaganda",
    "light_cleaned_title": "Why isn't our media reporting on investment being pulled out by international organisations",
    "light_cleaned_selftext": "Recently saw that Foxconn, which was supposed to replace iPhone facilities from China into India suddenly cut all ties. Now Softbank which funds most of the major startups has started to trim down on the investments. These are just a few examples, but haven't seen mainstream media reporting or questioning our government on this. India relies so heavily on IT sector, which has been going through a layoff period since last year and somehow everything seems peaceful when watching news financially.",
    "light_cleaned_comments": "I doubt our average Indian janta cares about this news, they are busy in India-Pakistan, Chandrayaan and Ram Mandir. Mainstream media stopped reporting ages ago. Why dont you read news in details than spreading fake propaganda ? Foxconn pulled out of India? When? Instead foxconn is expanding massively. Seems like you can’t differentiate between iphone manufacturer and chip manufacturer. Foxconn pulled out of semiconductor joint venture with Vedanta not completely out of India. They have clarified they will go ahead without vedanta due to lack of funds and disagreements. Secondly, softbank is running at a loss and is cutting costs all around the world not just India. They have even sold their stake in alibaba for 20billion. I assume you are a hyper emotional 16-17year kid who wants attention on internet. Next time do through study in details than complaining here. Everything is available on internet. Many youtube study channels also explain these issues in details every now and then if you want to learn i can hit you up with some channels. If you want to continue your political vendetta bullshit go ahead. I have no idea why you're getting so pumped up eager to insult someone you don't know personally. There are 2 things you need to know: firstly, the ramp-up is a promise of $ 33 million and not finalised. Secondly, the vedanta sc chip was a done deal, which is cancelled now for approx $ 19 billion. So what was India's total profit? Just do the maths. Secondly, I clearly wrote about the so-called national media that is the hindi news channel that day n night show the same thing all over again. Without having the slightest responsibility towards the nation. It's good to have a political belief, but when your belief starts to cause damage to our country, people like me will speak. You can glorify your supreme leaders and keep your families starved so they can enjoy a life of luxury. But some of us have problems with that and work hard to provide a better life to our families. First thing you wrote about foxconn moving away iphone production from India which is a straight up lie. You didnt know difference between iphone and semiconductor operations of foxconn. Now you mug up some numbers form google and copy paste here to act as intellectual which you are clearly not. We haven’t sold any of our PSU irrespective of what you think. No ISRO staff is working without getting paid. ISRO doesnt make any parts they outsource them from various sub partners. It’s HEC a psu whose staff havent paid salaries. Atleast read about it than typing things without having iota of knowledge. India doesnt rely on semiconductor for its own use. Our defence forces use Indian chips. India is trying to get into consumer semiconductor market for which having established players like foxconn and tsmc is a must. I have see likes of zee news,India today,republic etc post news regarding foxconn’s withdrawal from JV with Vedanta. I dont know why you feel they havent reported the incident. Why you getting triggered for being called out after posting fake propaganda?"
}