{
    "id": "mea874",
    "title": "Read this letter which may have led to OTT censorship in India | Policy Analysis: Tandav is a Case Study for OTT censorship under the IT Rules, 2021 #LetUsChill",
    "url": "https://www.reddit.com/r/india/comments/mea874/read_this_letter_which_may_have_led_to_ott/",
    "selftext": "## \n\nhttps://preview.redd.it/xra69vkvfjp61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=1d72e7db14345240931324345ac28bd0a66f0e45\n\n## tl;dr\n\nWe accessed, through RTI requests, the complaints sent from all across India to the Ministry of Information and Broadcasting on Amazon Prime Show, \"Tandav\". This was potentially a trigger for the regulation of OTT platforms under the undemocratic and unconstitutional IT Rules, 2021. We consider these complaints today against these new rules to show how it provides a heckler's veto and will lead to censorship of speech which is otherwise legal.\n\n&amp;#x200B;\n\n## The Tandav Controversy: A case study\n\nThe \"Tandav\" web series was released on the OTT Platform Amazon Prime Video on January 15, 2021. Immediately upon release, it was embroiled in controversy. The series has been criticised by various factions of the Indian society for hurting the religious sentiments of Hindus. Following numerous complaints, the Ministry of Information &amp; Broadcasting intervened and raised these concerns to the makers of the series. The makers issued an [**unconditional apology**](https://www.livemint.com/news/india/amazon-prime-video-apologizes-over-tandav-row-11614695216465.html) and also removed parts of the series that were said to be objectionable. However, dissatisfied by these steps, [**multiple FIRs**](https://www.hindustantimes.com/entertainment/web-series/tandav-row-two-scenes-axed-as-fresh-firs-are-filed-here-are-details-of-cuts-101611146196552.html) across states were filed against the series' actors, producers and directors as well as the India head of Amazon Prime Video's original content.\n\nThe controversy also spurred demands for censorship and criminal penalties for OTT platforms in India. Then on February 25, 2021 the Government notified the [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (the “Intermediary Rules, 2021”)**](http://egazette.nic.in/WriteReadData/2021/225464.pdf). Part III of the Rules deals with the regulation of digital news media (though there is a lack of clarity on exactly which news media these Rules apply to) and OTT platforms, such as Netflix, Amazon Prime and Disney+Hotstar and is administered by the Ministry of Information and Broadcasting. We analyse these complaints today against the backdrop of the antidemocratic and unconstitutional Intermediary Rules, 2021 to discover that they provide a heckler's veto leading to the censorship of speech that is legal across OTT platforms in India.\n\n## Ongoing litigation around Tandav and the Intermediary Rules, 2021\n\nAs a result of multiple FIRs being filed in various states across the country, the makers of the series approached the Supreme Court and the Court agreed to club these FIRs. The Court initially declined to pass an order to protect the makers and artists of the series from arrest. However, [**on March 5, 2021**](https://www.livelaw.in/top-stories/supreme-court-tandav-amazon-prime-information-technology-rules-2021aparna-purohit-170757), the Court granted protection from arrest to India Head of Amazon Prime Video, Aparna Purohit in the case registered against her.\n\nAt the same time, the Intermediary Rules, 2021 have faced criticism since they were notified and their constitutionality has been challenged in the Courts in the following cases:\n\n1. ***LiveLaw Media Private Limited and others vs Union of India and others*** WP(C) 6272/2021 - Kerala High Court ([**read more here**](https://internetfreedom.in/kerala-hc-grants-a-stay-of-the-operation-of-part-iii-of-the-intermediaries-rules-2021-to-livelaw/))\n2. ***Foundation for Independent Journalism and others vs Union of India and another*** WP(C) 3125/2021 - Delhi High Court\n3. ***Quint Digital Media Limited and another vs Union of India and another*** WP(C)11097/2021 - Delhi High Court\n4. ***Sanjay Kumar Singh vs Union of India and others*** WP(C) 3483/2021 - Delhi High Court\n\n## Our findings through the Right to Information Act, 2005\n\nWe use the RTI Act, 2005 as a tool for demanding transparency and accountability from public authorities on issues of public importance. The Tandav controversy and the resulting conversation around censorship of OTT content is one such issue which we feel is of public importance.  Therefore, on February 8, 2021, we filed a RTI request with the Ministry of Information and Broadcasting asking them to share with us the complaints they received against the series. The issue also gained importance subsequently because it essentially spurred the regulation of OTT platforms through the Intermediaries Rules, 2021.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1w0fyyjwdjp61.png?width=1277&amp;format=png&amp;auto=webp&amp;s=7341db1cad5875786e7cdf045724de82b3fd89c6\n\nOn March 23, 2021 we received 3 documents of a total 112 pages containing the complaints filed against the series with the Ministry of Information &amp; Broadcasting. The broad trends that we observed in the complaints are:\n\n1. The complaints have been filed majorly in only two languages: Hindi and English.\n2. The approximate date range of the complaints is from January 16 to January 18, 2021.\n3. There is a template which has been used to file these complaints are broadly clustered within familiar themes around hurting religious sentiments and are anti-dalit.\n4. In addition to private individuals, complaints have also been filed by advocates, non-governmental organisations and functionaries of political parties.\n\nWe are reproducing one such complaint below which has been sent across by multiple complainants. These are made available as public documents while redacting the personally identifiable information.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/purt8hmzdjp61.png?width=1193&amp;format=png&amp;auto=webp&amp;s=bf45cb094c9ad361a16cf45a05481795fb3e192e\n\nThe consolidated document containing all the complaints against the Tandav series sent to us by the Ministry of Information and Broadcasting can be found [**here**](https://drive.google.com/file/d/1cKwAza8MTZyV_fSZDMml6M3DhBDGf_CA/view?usp=sharing). We are sharing this information not only because it is a public issue but also for further academic study.\n\n## Heckler's veto : Contrasting OTT Rules with the Tandav Complaints\n\nA heckler's veto is a situation wherein the government curtails the right to freedom of speech and expression of a party in order to prevent reactionary behaviour from the other party. Through the recently notified Intermediaries Rules, 2021 the government has essentially created a situation of heckler's veto in India and seriously weakened the freedom of speech and expression in the country. We provide reasons for it below.  \n\nClause II(*A*)(c) of the Code of Ethics made applicable to OTT platforms under the Intermediaries Rules, 2021, that states:\n\n&gt;A publisher shall take into consideration India‘s multi-racial and multi-religious context and exercise due caution and discretion when featuring the activities, beliefs, practices, or views of any racial or religious group.\n\nThis provision therefore allows complaints to be filed that go beyond the law (as previous clauses of the Intermediary Rules, 2o21 clearly state that this provision is in addition to existing prohibitions of law) as it stands currently on freedom of speech and the reasonable restrictions that can be imposed upon this fundamental right. Further, *any* person having *any* grievance with the content that is published on an OTT platform may lodge such grievance with the Grievance Officer of the platform, who *must* acknowledge the grievance within 24 hours, *and also* address the grievance and reach a communicated decision within 15 days. It is easy to see how such a provision may be misused in a landscape where, for instance, review-bombing on app stores has led to the removal of several apps.\n\nThe Grievance Officer mentioned above is only tier-1 of a 3-tier system. If the response of the Grievance Officer is not considered satisfactory by the complainant, they may appeal to the second tier. The second tier is a self-regulatory body with up to 6 members who are experts in the fields of media, broadcasting, entertainment, child rights, human rights, etc. However, while this is framed as the second layer of self-regulation, this is actually the first layer of government oversight, since the composition of this body is ultimately subject to the approval of the Ministry of Information &amp; Broadcasting. Hence, the complainant can continue escalating the complaint till they achieve the desired result.\n\nThe third tier is the government itself, where an Inter-Departmental Committee, comprising officers of various government ministries, including the Home Ministry, the Law Ministry, the Ministry of Defence, Ministry of Women and Child Development etc., and chaired by the Joint Secretary of the Ministry of Information and Broadcasting. This Committee is empowered to hear appeals from the second tier, and has wide powers of punishment under the Intermediaries Rules, 2021. It can warn, reprimand, censure, admonish, require an apology, reclassify content ratings (A, u/A, U etc.), or even block or censor content as it deems fit.\n\nThis structure has been created without any statutory basis and without [**any public consultation with stakeholders**](https://www.medianama.com/2021/03/223-it-committee-intermediary-rules/). Such wide powers without constitutional or parliamentary backing are a grave threat to the freedom of speech and expression of content creators and publishers, as well as to the right of free access to information of the consumers of such content.\n\nThe Intermediaries Rules, 2021, their scope and the concerns regarding the manner in which they will be implemented will have a chilling effect on fundamental rights of the citizens of India, not just on the creator side, but also on the consumer side. Exerting executive control over OTT content will lead to over-compliance and self-censorship on part of platforms, who will be keen to avoid the wide discretion allowed to the government when it comes to punishments.\n\n&amp;#x200B;\n\n## Ominous signs for creativity in India\n\nThe Intermediary Rules, 2021 have now prescribed a process for complaint that can be premised on vague criteria even beyond existing criminal offences and civil penalties. To us this conflicts directly against the observations of the Hon'ble Supreme Court in the classic case of [***S. Rangarajan Etc vs P. Jagjivan Ram*** **1989 SCR (2) 204**](https://indiankanoon.org/doc/341773/) :\n\n&gt;We want to put the anguished question, what good is the protection of freedom of expression if the State does not take care to protect it? If the film is unobjectionable and cannot constitutionally be restricted under Article 19(2), freedom of expression cannot be suppressed on account of threat of demonstration and processions or threats of violence. That would tantamount to negation of the rule of law and a surrender to black mail and intimidation.\n\n## Important Documents\n\n1. Complaints received from the Ministry of Information and Broadcasting dated March 23, 2021 ([**link**](https://drive.google.com/file/d/1cKwAza8MTZyV_fSZDMml6M3DhBDGf_CA/view?usp=sharing))\n2. Constitutional questions against unconstitutional Rules dated March 11, 2021 ([**link**](https://internetfreedom.in/constitutional-questions-against-unconstitutional-rules/))\n3. Coming to streaming services near you: Self-censorship! dated March 4, 2021 ([**link**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/))",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1616836077,
    "convurl": "https://b.thumbs.redditmedia.com/OPX57h-55VUCdDHfwGGVq61q4svYg7-PifjVlp8TKpg.jpg",
    "comments": [],
    "cleaned_text": "read letter may led ott censorship india policy analysis tandav case study ott censorship rules letuschill tldr accessed rti requests complaints sent across india ministry information broadcasting amazon prime show tandav potentially trigger regulation ott platforms undemocratic unconstitutional rules consider complaints today new rules show provides hecklers veto lead censorship speech otherwise legal ampxb tandav controversy case study tandav web series released ott platform amazon prime video january immediately upon release embroiled controversy series criticised various factions indian society hurting religious sentiments hindus following numerous complaints ministry information amp broadcasting intervened raised concerns makers series makers issued unconditional apologyhttpswwwlivemintcomnewsindiaamazonprimevideoapologizesovertandavrowhtml also removed parts series said objectionable however dissatisfied steps multiple firshttpswwwhindustantimescomentertainmentwebseriestandavrowtwoscenesaxedasfreshfirsarefiledherearedetailsofcutshtml across states filed series actors producers directors well india head amazon prime videos original content controversy also spurred demands censorship criminal penalties ott platforms india february government notified information technology intermediary guidelines digital media ethics code rules intermediary rules httpegazettenicinwritereaddatapdf part iii rules deals regulation digital news media though lack clarity exactly news media rules apply ott platforms netflix amazon prime disneyhotstar administered ministry information broadcasting analyse complaints today backdrop antidemocratic unconstitutional intermediary rules discover provide hecklers veto leading censorship speech legal across ott platforms india ongoing litigation around tandav intermediary rules result multiple firs filed various states across country makers series approached supreme court court agreed club firs court initially declined pass order protect makers artists series arrest however march httpswwwlivelawintopstoriessupremecourttandavamazonprimeinformationtechnologyrulesaparnapurohit court granted protection arrest india head amazon prime video aparna purohit case registered time intermediary rules faced criticism since notified constitutionality challenged courts following cases livelaw media private limited others vs union india others wpc kerala high court read herehttpsinternetfreedominkeralahcgrantsastayoftheoperationofpartiiioftheintermediariesrulestolivelaw foundation independent journalism others vs union india another wpc delhi high court quint digital media limited another vs union india another wpc delhi high court sanjay kumar singh vs union india others wpc delhi high court findings right information act use rti act tool demanding transparency accountability public authorities issues public importance tandav controversy resulting conversation around censorship ott content one issue feel public importance therefore february filed rti request ministry information broadcasting asking share us complaints received series issue also gained importance subsequently essentially spurred regulation ott platforms intermediaries rules ampxb ampxb march received documents total pages containing complaints filed series ministry information amp broadcasting broad trends observed complaints complaints filed majorly two languages hindi english approximate date range complaints january january template used file complaints broadly clustered within familiar themes around hurting religious sentiments antidalit addition private individuals complaints also filed advocates nongovernmental organisations functionaries political parties reproducing one complaint sent across multiple complainants made available public documents redacting personally identifiable information ampxb consolidated document containing complaints tandav series sent us ministry information broadcasting found herehttpsdrivegooglecomfiledckwazamtzyvfszdmmlmdhbdgfcaviewuspsharing sharing information public issue also academic study hecklers veto contrasting ott rules tandav complaints hecklers veto situation wherein government curtails right freedom speech expression party order prevent reactionary behaviour party recently notified intermediaries rules government essentially created situation hecklers veto india seriously weakened freedom speech expression country provide reasons clause iiac code ethics made applicable ott platforms intermediaries rules states gta publisher shall take consideration indias multiracial multireligious context exercise due caution discretion featuring activities beliefs practices views racial religious group provision therefore allows complaints filed go beyond law previous clauses intermediary rules clearly state provision addition existing prohibitions law stands currently freedom speech reasonable restrictions imposed upon fundamental right person grievance content published ott platform may lodge grievance grievance officer platform must acknowledge grievance within hours also address grievance reach communicated decision within days easy see provision may misused landscape instance reviewbombing app stores led removal several apps grievance officer mentioned tier tier system response grievance officer considered satisfactory complainant may appeal second tier second tier selfregulatory body members experts fields media broadcasting entertainment child rights human rights etc however framed second layer selfregulation actually first layer government oversight since composition body ultimately subject approval ministry information amp broadcasting hence complainant continue escalating complaint till achieve desired result third tier government interdepartmental committee comprising officers various government ministries including home ministry law ministry ministry defence ministry women child development etc chaired joint secretary ministry information broadcasting committee empowered hear appeals second tier wide powers punishment intermediaries rules warn reprimand censure admonish require apology reclassify content ratings ua u etc even block censor content deems fit structure created without statutory basis without public consultation stakeholdershttpswwwmedianamacomitcommitteeintermediaryrules wide powers without constitutional parliamentary backing grave threat freedom speech expression content creators publishers well right free access information consumers content intermediaries rules scope concerns regarding manner implemented chilling effect fundamental rights citizens india creator side also consumer side exerting executive control ott content lead overcompliance selfcensorship part platforms keen avoid wide discretion allowed government comes punishments ampxb ominous signs creativity india intermediary rules prescribed process complaint premised vague criteria even beyond existing criminal offences civil penalties us conflicts directly observations honble supreme court classic case rangarajan etc vs p jagjivan ram scr httpsindiankanoonorgdoc gtwe want put anguished question good protection freedom expression state take care protect film unobjectionable constitutionally restricted article freedom expression suppressed account threat demonstration processions threats violence would tantamount negation rule law surrender black mail intimidation important documents complaints received ministry information broadcasting dated march linkhttpsdrivegooglecomfiledckwazamtzyvfszdmmlmdhbdgfcaviewuspsharing constitutional questions unconstitutional rules dated march linkhttpsinternetfreedominconstitutionalquestionsagainstunconstitutionalrules coming streaming services near selfcensorship dated march linkhttpsinternetfreedominselfcensorshipandtheendofgoodcontent ",
    "cleaned_title": "read letter may led ott censorship india policy analysis tandav case study ott censorship rules letuschill",
    "cleaned_selftext": "tldr accessed rti requests complaints sent across india ministry information broadcasting amazon prime show tandav potentially trigger regulation ott platforms undemocratic unconstitutional rules consider complaints today new rules show provides hecklers veto lead censorship speech otherwise legal ampxb tandav controversy case study tandav web series released ott platform amazon prime video january immediately upon release embroiled controversy series criticised various factions indian society hurting religious sentiments hindus following numerous complaints ministry information amp broadcasting intervened raised concerns makers series makers issued unconditional apologyhttpswwwlivemintcomnewsindiaamazonprimevideoapologizesovertandavrowhtml also removed parts series said objectionable however dissatisfied steps multiple firshttpswwwhindustantimescomentertainmentwebseriestandavrowtwoscenesaxedasfreshfirsarefiledherearedetailsofcutshtml across states filed series actors producers directors well india head amazon prime videos original content controversy also spurred demands censorship criminal penalties ott platforms india february government notified information technology intermediary guidelines digital media ethics code rules intermediary rules httpegazettenicinwritereaddatapdf part iii rules deals regulation digital news media though lack clarity exactly news media rules apply ott platforms netflix amazon prime disneyhotstar administered ministry information broadcasting analyse complaints today backdrop antidemocratic unconstitutional intermediary rules discover provide hecklers veto leading censorship speech legal across ott platforms india ongoing litigation around tandav intermediary rules result multiple firs filed various states across country makers series approached supreme court court agreed club firs court initially declined pass order protect makers artists series arrest however march httpswwwlivelawintopstoriessupremecourttandavamazonprimeinformationtechnologyrulesaparnapurohit court granted protection arrest india head amazon prime video aparna purohit case registered time intermediary rules faced criticism since notified constitutionality challenged courts following cases livelaw media private limited others vs union india others wpc kerala high court read herehttpsinternetfreedominkeralahcgrantsastayoftheoperationofpartiiioftheintermediariesrulestolivelaw foundation independent journalism others vs union india another wpc delhi high court quint digital media limited another vs union india another wpc delhi high court sanjay kumar singh vs union india others wpc delhi high court findings right information act use rti act tool demanding transparency accountability public authorities issues public importance tandav controversy resulting conversation around censorship ott content one issue feel public importance therefore february filed rti request ministry information broadcasting asking share us complaints received series issue also gained importance subsequently essentially spurred regulation ott platforms intermediaries rules ampxb ampxb march received documents total pages containing complaints filed series ministry information amp broadcasting broad trends observed complaints complaints filed majorly two languages hindi english approximate date range complaints january january template used file complaints broadly clustered within familiar themes around hurting religious sentiments antidalit addition private individuals complaints also filed advocates nongovernmental organisations functionaries political parties reproducing one complaint sent across multiple complainants made available public documents redacting personally identifiable information ampxb consolidated document containing complaints tandav series sent us ministry information broadcasting found herehttpsdrivegooglecomfiledckwazamtzyvfszdmmlmdhbdgfcaviewuspsharing sharing information public issue also academic study hecklers veto contrasting ott rules tandav complaints hecklers veto situation wherein government curtails right freedom speech expression party order prevent reactionary behaviour party recently notified intermediaries rules government essentially created situation hecklers veto india seriously weakened freedom speech expression country provide reasons clause iiac code ethics made applicable ott platforms intermediaries rules states gta publisher shall take consideration indias multiracial multireligious context exercise due caution discretion featuring activities beliefs practices views racial religious group provision therefore allows complaints filed go beyond law previous clauses intermediary rules clearly state provision addition existing prohibitions law stands currently freedom speech reasonable restrictions imposed upon fundamental right person grievance content published ott platform may lodge grievance grievance officer platform must acknowledge grievance within hours also address grievance reach communicated decision within days easy see provision may misused landscape instance reviewbombing app stores led removal several apps grievance officer mentioned tier tier system response grievance officer considered satisfactory complainant may appeal second tier second tier selfregulatory body members experts fields media broadcasting entertainment child rights human rights etc however framed second layer selfregulation actually first layer government oversight since composition body ultimately subject approval ministry information amp broadcasting hence complainant continue escalating complaint till achieve desired result third tier government interdepartmental committee comprising officers various government ministries including home ministry law ministry ministry defence ministry women child development etc chaired joint secretary ministry information broadcasting committee empowered hear appeals second tier wide powers punishment intermediaries rules warn reprimand censure admonish require apology reclassify content ratings ua u etc even block censor content deems fit structure created without statutory basis without public consultation stakeholdershttpswwwmedianamacomitcommitteeintermediaryrules wide powers without constitutional parliamentary backing grave threat freedom speech expression content creators publishers well right free access information consumers content intermediaries rules scope concerns regarding manner implemented chilling effect fundamental rights citizens india creator side also consumer side exerting executive control ott content lead overcompliance selfcensorship part platforms keen avoid wide discretion allowed government comes punishments ampxb ominous signs creativity india intermediary rules prescribed process complaint premised vague criteria even beyond existing criminal offences civil penalties us conflicts directly observations honble supreme court classic case rangarajan etc vs p jagjivan ram scr httpsindiankanoonorgdoc gtwe want put anguished question good protection freedom expression state take care protect film unobjectionable constitutionally restricted article freedom expression suppressed account threat demonstration processions threats violence would tantamount negation rule law surrender black mail intimidation important documents complaints received ministry information broadcasting dated march linkhttpsdrivegooglecomfiledckwazamtzyvfszdmmlmdhbdgfcaviewuspsharing constitutional questions unconstitutional rules dated march linkhttpsinternetfreedominconstitutionalquestionsagainstunconstitutionalrules coming streaming services near selfcensorship dated march linkhttpsinternetfreedominselfcensorshipandtheendofgoodcontent",
    "cleaned_comments": "",
    "light_cleaned_title": "Read this letter which may have led to OTT censorship in India | Policy Analysis: Tandav is a Case Study for OTT censorship under the IT Rules, 2021 #LetUsChill",
    "light_cleaned_selftext": "## ## tl;dr We accessed, through RTI requests, the complaints sent from all across India to the Ministry of Information and Broadcasting on Amazon Prime Show, \"Tandav\". This was potentially a trigger for the regulation of OTT platforms under the undemocratic and unconstitutional IT Rules, 2021. We consider these complaints today against these new rules to show how it provides a heckler's veto and will lead to censorship of speech which is otherwise legal.  ## The Tandav Controversy: A case study The \"Tandav\" web series was released on the OTT Platform Amazon Prime Video on January 15, 2021. Immediately upon release, it was embroiled in controversy. The series has been criticised by various factions of the Indian society for hurting the religious sentiments of Hindus. Following numerous complaints, the Ministry of Information &amp; Broadcasting intervened and raised these concerns to the makers of the series. The makers issued an [**unconditional apology**](https://www.livemint.com/news/india/amazon-prime-video-apologizes-over-tandav-row-11614695216465.html) and also removed parts of the series that were said to be objectionable. However, dissatisfied by these steps, [**multiple FIRs**](https://www.hindustantimes.com/entertainment/web-series/tandav-row-two-scenes-axed-as-fresh-firs-are-filed-here-are-details-of-cuts-101611146196552.html) across states were filed against the series' actors, producers and directors as well as the India head of Amazon Prime Video's original content. The controversy also spurred demands for censorship and criminal penalties for OTT platforms in India. Then on February 25, 2021 the Government notified the [**Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (the “Intermediary Rules, 2021”)**](http://egazette.nic.in/WriteReadData/2021/225464.pdf). Part III of the Rules deals with the regulation of digital news media (though there is a lack of clarity on exactly which news media these Rules apply to) and OTT platforms, such as Netflix, Amazon Prime and Disney+Hotstar and is administered by the Ministry of Information and Broadcasting. We analyse these complaints today against the backdrop of the antidemocratic and unconstitutional Intermediary Rules, 2021 to discover that they provide a heckler's veto leading to the censorship of speech that is legal across OTT platforms in India. ## Ongoing litigation around Tandav and the Intermediary Rules, 2021 As a result of multiple FIRs being filed in various states across the country, the makers of the series approached the Supreme Court and the Court agreed to club these FIRs. The Court initially declined to pass an order to protect the makers and artists of the series from arrest. However, [**on March 5, 2021**](https://www.livelaw.in/top-stories/supreme-court-tandav-amazon-prime-information-technology-rules-2021aparna-purohit-170757), the Court granted protection from arrest to India Head of Amazon Prime Video, Aparna Purohit in the case registered against her. At the same time, the Intermediary Rules, 2021 have faced criticism since they were notified and their constitutionality has been challenged in the Courts in the following cases: 1. ***LiveLaw Media Private Limited and others vs Union of India and others*** WP(C) 6272/2021 - Kerala High Court ([**read more here**](https://internetfreedom.in/kerala-hc-grants-a-stay-of-the-operation-of-part-iii-of-the-intermediaries-rules-2021-to-livelaw/)) 2. ***Foundation for Independent Journalism and others vs Union of India and another*** WP(C) 3125/2021 - Delhi High Court 3. ***Quint Digital Media Limited and another vs Union of India and another*** WP(C)11097/2021 - Delhi High Court 4. ***Sanjay Kumar Singh vs Union of India and others*** WP(C) 3483/2021 - Delhi High Court ## Our findings through the Right to Information Act, 2005 We use the RTI Act, 2005 as a tool for demanding transparency and accountability from public authorities on issues of public importance. The Tandav controversy and the resulting conversation around censorship of OTT content is one such issue which we feel is of public importance. Therefore, on February 8, 2021, we filed a RTI request with the Ministry of Information and Broadcasting asking them to share with us the complaints they received against the series. The issue also gained importance subsequently because it essentially spurred the regulation of OTT platforms through the Intermediaries Rules, 2021.   On March 23, 2021 we received 3 documents of a total 112 pages containing the complaints filed against the series with the Ministry of Information &amp; Broadcasting. The broad trends that we observed in the complaints are: 1. The complaints have been filed majorly in only two languages: Hindi and English. 2. The approximate date range of the complaints is from January 16 to January 18, 2021. 3. There is a template which has been used to file these complaints are broadly clustered within familiar themes around hurting religious sentiments and are anti-dalit. 4. In addition to private individuals, complaints have also been filed by advocates, non-governmental organisations and functionaries of political parties. We are reproducing one such complaint below which has been sent across by multiple complainants. These are made available as public documents while redacting the personally identifiable information.  The consolidated document containing all the complaints against the Tandav series sent to us by the Ministry of Information and Broadcasting can be found [**here**](https://drive.google.com/file/d/1cKwAza8MTZyV_fSZDMml6M3DhBDGf_CA/view?usp=sharing). We are sharing this information not only because it is a public issue but also for further academic study. ## Heckler's veto : Contrasting OTT Rules with the Tandav Complaints A heckler's veto is a situation wherein the government curtails the right to freedom of speech and expression of a party in order to prevent reactionary behaviour from the other party. Through the recently notified Intermediaries Rules, 2021 the government has essentially created a situation of heckler's veto in India and seriously weakened the freedom of speech and expression in the country. We provide reasons for it below. Clause II(*A*)(c) of the Code of Ethics made applicable to OTT platforms under the Intermediaries Rules, 2021, that states: &gt;A publisher shall take into consideration India‘s multi-racial and multi-religious context and exercise due caution and discretion when featuring the activities, beliefs, practices, or views of any racial or religious group. This provision therefore allows complaints to be filed that go beyond the law (as previous clauses of the Intermediary Rules, 2o21 clearly state that this provision is in addition to existing prohibitions of law) as it stands currently on freedom of speech and the reasonable restrictions that can be imposed upon this fundamental right. Further, *any* person having *any* grievance with the content that is published on an OTT platform may lodge such grievance with the Grievance Officer of the platform, who *must* acknowledge the grievance within 24 hours, *and also* address the grievance and reach a communicated decision within 15 days. It is easy to see how such a provision may be misused in a landscape where, for instance, review-bombing on app stores has led to the removal of several apps. The Grievance Officer mentioned above is only tier-1 of a 3-tier system. If the response of the Grievance Officer is not considered satisfactory by the complainant, they may appeal to the second tier. The second tier is a self-regulatory body with up to 6 members who are experts in the fields of media, broadcasting, entertainment, child rights, human rights, etc. However, while this is framed as the second layer of self-regulation, this is actually the first layer of government oversight, since the composition of this body is ultimately subject to the approval of the Ministry of Information &amp; Broadcasting. Hence, the complainant can continue escalating the complaint till they achieve the desired result. The third tier is the government itself, where an Inter-Departmental Committee, comprising officers of various government ministries, including the Home Ministry, the Law Ministry, the Ministry of Defence, Ministry of Women and Child Development etc., and chaired by the Joint Secretary of the Ministry of Information and Broadcasting. This Committee is empowered to hear appeals from the second tier, and has wide powers of punishment under the Intermediaries Rules, 2021. It can warn, reprimand, censure, admonish, require an apology, reclassify content ratings (A, u/A, U etc.), or even block or censor content as it deems fit. This structure has been created without any statutory basis and without [**any public consultation with stakeholders**](https://www.medianama.com/2021/03/223-it-committee-intermediary-rules/). Such wide powers without constitutional or parliamentary backing are a grave threat to the freedom of speech and expression of content creators and publishers, as well as to the right of free access to information of the consumers of such content. The Intermediaries Rules, 2021, their scope and the concerns regarding the manner in which they will be implemented will have a chilling effect on fundamental rights of the citizens of India, not just on the creator side, but also on the consumer side. Exerting executive control over OTT content will lead to over-compliance and self-censorship on part of platforms, who will be keen to avoid the wide discretion allowed to the government when it comes to punishments.  ## Ominous signs for creativity in India The Intermediary Rules, 2021 have now prescribed a process for complaint that can be premised on vague criteria even beyond existing criminal offences and civil penalties. To us this conflicts directly against the observations of the Hon'ble Supreme Court in the classic case of [***S. Rangarajan Etc vs P. Jagjivan Ram*** **1989 SCR (2) 204**](https://indiankanoon.org/doc/341773/) : &gt;We want to put the anguished question, what good is the protection of freedom of expression if the State does not take care to protect it? If the film is unobjectionable and cannot constitutionally be restricted under Article 19(2), freedom of expression cannot be suppressed on account of threat of demonstration and processions or threats of violence. That would tantamount to negation of the rule of law and a surrender to black mail and intimidation. ## Important Documents 1. Complaints received from the Ministry of Information and Broadcasting dated March 23, 2021 ([**link**](https://drive.google.com/file/d/1cKwAza8MTZyV_fSZDMml6M3DhBDGf_CA/view?usp=sharing)) 2. Constitutional questions against unconstitutional Rules dated March 11, 2021 ([**link**](https://internetfreedom.in/constitutional-questions-against-unconstitutional-rules/)) 3. Coming to streaming services near you: Self-censorship! dated March 4, 2021 ([**link**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/))",
    "light_cleaned_comments": ""
}