{
    "id": "1hlojqd",
    "title": "GST on selling your car second hand? ",
    "url": "https://i.redd.it/8p7bj89pmv8e1.jpeg",
    "selftext": "Is this something new? I sold my Hyundai getz a few years ago and never had to pay GST on the sale to a private buyer? ",
    "flair": "Policy/Economy",
    "score": 80,
    "num_comments": 15,
    "created_utc": 1735081023.0,
    "convurl": "https://i.redd.it/8p7bj89pmv8e1.jpeg",
    "comments": [
        "If the seller is not GST registered, then this doesn’t apply IIUC.",
        "Incompetent nirmala didn't explain it well. This tax applies to the profits in a used car transactions. So typically for used car dealers. 12% tax is already applicable. They raised it to 18%. nothing new. You sell your car for less than what you bought, no gst applies in that case.",
        "Yes. This is so much more reasonable. A private sale would be always for a loss.\nGod this woman is useless at explaining simple concepts",
        "3 points to note: \n\n1) This is applicable only when you sell your car to a business and not to any individual\n\n2) You can claim depreciation, i.e. If you bought a car for 10L and sold it 10 years later for 1L then you can claim a depreciation on the purchase price. Let's say 7L depreciation, so your new purchase price will be 3L.\n\n3) No tax on negative margins. If after depreciation, the purchase price is 3L and you're selling it for 1L then NO TAX has to be paid",
        "Thank you. This makes more sense. I watched her interview and I was like WTF lmao",
        "No. If the dealership bought the car for 3L, spent 30K dressing it up, and sold it for 4L sticker price, the tax would be on 4L -3.3L = 70K times 18% = ₹12,600. \n\nExisting tax rate is 12%. This would hurt dealers margins but they'd pass it on. Considering the hassle in private purchase, used car dealerships aren't going anywhere.",
        "The tweet misunderstands how GST works when selling second-hand goods like cars. GST is only charged on the profit or \"margin\" made when selling something. For example, if a car dealer buys a second-hand car for £10,000 and sells it for £12,000, GST is applied only to the £2,000 profit. However, if you sell your car for less than you bought it for, like buying it for £10,000 and selling it for £1,000, there’s no profit. In this case, no GST would apply because you’re making a loss, not a gain.\n\nIt’s also worth noting that GST rules like this are designed for businesses, such as second-hand car dealers, not for private individuals. If you’re selling your personal car, GST usually wouldn’t be relevant at all unless you’re registered for GST as a business. So, the example in the tweet suggesting that someone would have to pay a large amount of GST when selling their car at a loss is incorrect and doesn’t reflect how the tax system actually works.",
        "I'm still shocked how a finance minister can explain their own rules this poorly.",
        "Link to original source? Sharing screenshot isn't sufficient as per rules.",
        "If FM didn’t explain it well, isn’t it this guys responsibility to not tweet without understanding it first. He’s a lawyer I suppose. To me he’s just pushing a propaganda",
        "Because she herself being a puppet doesn’t know the rule. She just have to put the signature.",
        "https://preview.redd.it/ik333rcy5w8e1.jpeg?width=1193&format=pjpg&auto=webp&s=fd833837f381417b61c689ddfba547cd5b264721",
        "I think it’s the profit made by the dealership. If they a car for 5L, do some painting, cleaning etc and then sell it for 7L, they have to pay 18% on it.\nThere is no GST if you sell your car to another individual",
        "For those asking for link to original tweet.. Please find it here [GST on car sales ](https://x.com/pbhushan1/status/1871480616413200698?t=Wf57qXBvNU4UKGGxwtk2kg&s=19)"
    ],
    "cleaned_text": "gst selling car second hand something new sold hyundai getz years ago never pay gst sale private buyer ",
    "cleaned_title": "gst selling car second hand",
    "cleaned_selftext": "something new sold hyundai getz years ago never pay gst sale private buyer",
    "cleaned_comments": "seller gst registered doesnt apply iiuc incompetent nirmala didnt explain well tax applies profits used car transactions typically used car dealers tax already applicable raised nothing new sell car less bought gst applies case yes much reasonable private sale would always loss god woman useless explaining simple concepts points note applicable sell car business individual claim depreciation ie bought car l sold years later l claim depreciation purchase price lets say l depreciation new purchase price l tax negative margins depreciation purchase price l youre selling l tax paid thank makes sense watched interview like wtf lmao dealership bought car l spent k dressing sold l sticker price tax would l l k times existing tax rate would hurt dealers margins theyd pass considering hassle private purchase used car dealerships arent going anywhere tweet misunderstands gst works selling secondhand goods like cars gst charged profit margin made selling something example car dealer buys secondhand car sells gst applied profit however sell car less bought like buying selling theres profit case gst would apply youre making loss gain also worth noting gst rules like designed businesses secondhand car dealers private individuals youre selling personal car gst usually wouldnt relevant unless youre registered gst business example tweet suggesting someone would pay large amount gst selling car loss incorrect doesnt reflect tax system actually works im still shocked finance minister explain rules poorly link original source sharing screenshot isnt sufficient per rules fm didnt explain well isnt guys responsibility tweet without understanding first hes lawyer suppose hes pushing propaganda puppet doesnt know rule put signature think profit made dealership car l painting cleaning etc sell l pay gst sell car another individual asking link original tweet please find gst car sales httpsxcompbhushanstatustwfqxbvnuukggxwtkkgs",
    "light_cleaned_title": "GST on selling your car second hand?",
    "light_cleaned_selftext": "Is this something new? I sold my Hyundai getz a few years ago and never had to pay GST on the sale to a private buyer?",
    "light_cleaned_comments": "If the seller is not GST registered, then this doesn’t apply IIUC. Incompetent nirmala didn't explain it well. This tax applies to the profits in a used car transactions. So typically for used car dealers. 12% tax is already applicable. They raised it to 18%. nothing new. You sell your car for less than what you bought, no gst applies in that case. Yes. This is so much more reasonable. A private sale would be always for a loss. God this woman is useless at explaining simple concepts 3 points to note: 1) This is applicable only when you sell your car to a business and not to any individual 2) You can claim depreciation, i.e. If you bought a car for 10L and sold it 10 years later for 1L then you can claim a depreciation on the purchase price. Let's say 7L depreciation, so your new purchase price will be 3L. 3) No tax on negative margins. If after depreciation, the purchase price is 3L and you're selling it for 1L then NO TAX has to be paid Thank you. This makes more sense. I watched her interview and I was like WTF lmao No. If the dealership bought the car for 3L, spent 30K dressing it up, and sold it for 4L sticker price, the tax would be on 4L -3.3L = 70K times 18% = ₹12,600. Existing tax rate is 12%. This would hurt dealers margins but they'd pass it on. Considering the hassle in private purchase, used car dealerships aren't going anywhere. The tweet misunderstands how GST works when selling second-hand goods like cars. GST is only charged on the profit or \"margin\" made when selling something. For example, if a car dealer buys a second-hand car for £10,000 and sells it for £12,000, GST is applied only to the £2,000 profit. However, if you sell your car for less than you bought it for, like buying it for £10,000 and selling it for £1,000, there’s no profit. In this case, no GST would apply because you’re making a loss, not a gain. It’s also worth noting that GST rules like this are designed for businesses, such as second-hand car dealers, not for private individuals. If you’re selling your personal car, GST usually wouldn’t be relevant at all unless you’re registered for GST as a business. So, the example in the tweet suggesting that someone would have to pay a large amount of GST when selling their car at a loss is incorrect and doesn’t reflect how the tax system actually works. I'm still shocked how a finance minister can explain their own rules this poorly. Link to original source? Sharing screenshot isn't sufficient as per rules. If FM didn’t explain it well, isn’t it this guys responsibility to not tweet without understanding it first. He’s a lawyer I suppose. To me he’s just pushing a propaganda Because she herself being a puppet doesn’t know the rule. She just have to put the signature. I think it’s the profit made by the dealership. If they a car for 5L, do some painting, cleaning etc and then sell it for 7L, they have to pay 18% on it. There is no GST if you sell your car to another individual For those asking for link to original tweet.. Please find it here [GST on car sales ](https://x.com/pbhushan1/status/1871480616413200698?t=Wf57qXBvNU4UKGGxwtk2kg&s=19)"
}