{
    "id": "12kalar",
    "title": "Akhil Bharat Hindu Mahasabha leader, three aides arrested in Agra cow slaughter case",
    "url": "https://www.thehindu.com/news/national/akhil-bharat-hindu-mahasabha-leader-three-aides-arrested-in-agra-cow-slaughter-case/article66730220.ece",
    "selftext": "Akhil Bharat Hindu Mahasabha leader, three aides arrested in Agra cow slaughter case:",
    "flair": "Law & Courts",
    "score": 115,
    "num_comments": 9,
    "created_utc": 1681357162.0,
    "convurl": "https://external-preview.redd.it/JKrQQcOxqkrzSYy9bxOEaa72cF1Ik4wKlEW7-hDy9GU.jpg?auto=webp&v=enabled&s=513202611dd3e9a03fec71633e246c51d6acbded",
    "comments": [
        "The Uttar Pradesh police on Wednesday arrested Sanjay Jat, national spokesperson of the Akhil Bharat Hindu Mahasabha, and three of his aides in connection with a case of cow slaughter in Agra on March 30.",
        "The police found the carcass in the area and picked up one of the Muslim men from his house at 3 a.m., the officer said.\n\nHowever, the police investigation revealed that the Muslim men were not involved in the case and Mr. Jat’s associates allegedly committed the offence to frame the men. “Call detail records (CDR) showed that those named in the FIR were not present at the crime spot,” the officer said.\n\nThe call detail records of the Mahasabha members and Mr. Jhallu showed they were in touch, and CCTV footage revealed that the act was premeditated.\n\nMr. Jhallu was jailed on charges of cow slaughter in the past, while Mr. Jat and his aides have cases of extortion, attempt to murder and cheating lodged against them, the police said.",
        "If the Supreme Leader and his party loses the 2024 elections I’m gearing up for an all out civil war. His followers will storm the streets bring the country to a standstill.",
        "Will they bulldoze and encounter these guys as well? Would love to see it happen",
        "We'll be lucky if we get a standstill and not a regression",
        "Hindu khatre mai hai\n\nNot from any other religion but from within.",
        "Straight outta from playbook of Israeli Mossad's false flag operations , kill own people or destroy property and blame it on the enemy, then use it as an excuse to attack & bomb them, soon these Hinduwadis will start killing Hindus and blame it on Muslims, no wonder RSS are friends of Israel",
        "Hindutva fucks murdering their mothers for political games.",
        "ye bolte hai hindu khatre mai hai and then jaake cow ko marte hai. Khatre mai hai hai hindu khudse lol"
    ],
    "cleaned_text": "akhil bharat hindu mahasabha leader three aides arrested agra cow slaughter case akhil bharat hindu mahasabha leader three aides arrested agra cow slaughter case ",
    "cleaned_title": "akhil bharat hindu mahasabha leader three aides arrested agra cow slaughter case",
    "cleaned_selftext": "akhil bharat hindu mahasabha leader three aides arrested agra cow slaughter case",
    "cleaned_comments": "uttar pradesh police wednesday arrested sanjay jat national spokesperson akhil bharat hindu mahasabha three aides connection case cow slaughter agra march police found carcass area picked one muslim men house officer said however police investigation revealed muslim men involved case mr jats associates allegedly committed offence frame men call detail records cdr showed named fir present crime spot officer said call detail records mahasabha members mr jhallu showed touch cctv footage revealed act premeditated mr jhallu jailed charges cow slaughter past mr jat aides cases extortion attempt murder cheating lodged police said supreme leader party loses elections im gearing civil war followers storm streets bring country standstill bulldoze encounter guys well would love see happen well lucky get standstill regression hindu khatre mai hai religion within straight outta playbook israeli mossads false flag operations kill people destroy property blame enemy use excuse attack bomb soon hinduwadis start killing hindus blame muslims wonder rss friends israel hindutva fucks murdering mothers political games ye bolte hai hindu khatre mai hai jaake cow ko marte hai khatre mai hai hai hindu khudse lol",
    "light_cleaned_title": "Akhil Bharat Hindu Mahasabha leader, three aides arrested in Agra cow slaughter case",
    "light_cleaned_selftext": "Akhil Bharat Hindu Mahasabha leader, three aides arrested in Agra cow slaughter case:",
    "light_cleaned_comments": "The Uttar Pradesh police on Wednesday arrested Sanjay Jat, national spokesperson of the Akhil Bharat Hindu Mahasabha, and three of his aides in connection with a case of cow slaughter in Agra on March 30. The police found the carcass in the area and picked up one of the Muslim men from his house at 3 a.m., the officer said. However, the police investigation revealed that the Muslim men were not involved in the case and Mr. Jat’s associates allegedly committed the offence to frame the men. “Call detail records (CDR) showed that those named in the FIR were not present at the crime spot,” the officer said. The call detail records of the Mahasabha members and Mr. Jhallu showed they were in touch, and CCTV footage revealed that the act was premeditated. Mr. Jhallu was jailed on charges of cow slaughter in the past, while Mr. Jat and his aides have cases of extortion, attempt to murder and cheating lodged against them, the police said. If the Supreme Leader and his party loses the 2024 elections I’m gearing up for an all out civil war. His followers will storm the streets bring the country to a standstill. Will they bulldoze and encounter these guys as well? Would love to see it happen We'll be lucky if we get a standstill and not a regression Hindu khatre mai hai Not from any other religion but from within. Straight outta from playbook of Israeli Mossad's false flag operations , kill own people or destroy property and blame it on the enemy, then use it as an excuse to attack & bomb them, soon these Hinduwadis will start killing Hindus and blame it on Muslims, no wonder RSS are friends of Israel Hindutva fucks murdering their mothers for political games. ye bolte hai hindu khatre mai hai and then jaake cow ko marte hai. Khatre mai hai hai hindu khudse lol"
}