{
    "id": "1790cfs",
    "title": "Beware of phising scam",
    "url": "https://www.reddit.com/gallery/1790cfs",
    "selftext": "My mom almost fell for a new phising scam. She was trying to track her passport which is delivered through speed post. She got the tracking number in her email id from the official passport mail and then proceeded to enter that number on this site that she found on Google search \n\nhttps://tracknowcourier.online/?gclid=Cj0KCQjwm66pBhDQARIsALIR2zCntnzrafPoHSGzHzRrb0XmiZv2k3xGnNm_erAlzCG0CX3Bv2RIsXoaAvIrEALw_wcB\n\nOfcourse to the tech savvy people we can differentiate between a phising site and an authentic site, but mom could not. We were not aware that she had done this. \n\nLater she informs us that she got a msg that some address verification needed to be done and someone will contact her.\n\nNow keep in mind, no official communication was made for the same through passport seva Kendra on mail or sms, this MSG had just popped up on the tracking site, that the address is wrong and will need verification.\n\nToday morning she recieved a call saying she needs to send the address and pincode on this WhatsApp number 7029258238 and also shared another phising site like that was literally made on a wix website! This site was a basic wirefram site with 3 input fields\n1. Mobile number\n2. Bank name\n3. UPI pin\n\nAnd she proceeded ahead with adding all of these...everytime she hit send it said incorrect input and the guys, apparently who was \"guiding her on the phone on what to do\" kept asking what other banks you have account in, try them.\n\nI was in a meeting and had just gotten free when I heard her doing this. I immediately asked her to cut the call and took over her phone. \n\nThis guy then proceeded to send another apk link and asked her to download it for the verification. \n\nIn the meantime, she also kept recieving \"hi\" on sms from another number 9641236829 at least some 10 times in a span of 5 mins. Whenever I tried calling back to that number it went unanswered.\n\nWhen calling these two numbers we heard an Assamese/ Bangla msg not sure of the language\n\nBy this point I stopped responding and changed all her passwords and informed my brother to raise a complaint in cyber cell.\n\nIf she had downloaded the apk it could have been much worse. Thankfully no money was lost and a lesson was learnt. \n\nScreen shots attached\n\nNote-not blurring out the numbers since this is a scam account",
    "flair": "Crime",
    "score": 10,
    "num_comments": 2,
    "created_utc": 1697441157.0,
    "convurl": "https://i.redd.it/9o10z4p1oiub1.jpg",
    "comments": [],
    "cleaned_text": "beware phising scam mom almost fell new phising scam trying track passport delivered speed post got tracking number email id official passport mail proceeded enter number site found google search ofcourse tech savvy people differentiate phising site authentic site mom could aware done later informs us got msg address verification needed done someone contact keep mind official communication made passport seva kendra mail sms msg popped tracking site address wrong need verification today morning recieved call saying needs send address pincode whatsapp number also shared another phising site like literally made wix website site basic wirefram site input fields mobile number bank name upi pin proceeded ahead adding theseeverytime hit send said incorrect input guys apparently guiding phone kept asking banks account try meeting gotten free heard immediately asked cut call took phone guy proceeded send another apk link asked download verification meantime also kept recieving hi sms another number least times span mins whenever tried calling back number went unanswered calling two numbers heard assamese bangla msg sure language point stopped responding changed passwords informed brother raise complaint cyber cell downloaded apk could much worse thankfully money lost lesson learnt screen shots attached notenot blurring numbers since scam account ",
    "cleaned_title": "beware phising scam",
    "cleaned_selftext": "mom almost fell new phising scam trying track passport delivered speed post got tracking number email id official passport mail proceeded enter number site found google search ofcourse tech savvy people differentiate phising site authentic site mom could aware done later informs us got msg address verification needed done someone contact keep mind official communication made passport seva kendra mail sms msg popped tracking site address wrong need verification today morning recieved call saying needs send address pincode whatsapp number also shared another phising site like literally made wix website site basic wirefram site input fields mobile number bank name upi pin proceeded ahead adding theseeverytime hit send said incorrect input guys apparently guiding phone kept asking banks account try meeting gotten free heard immediately asked cut call took phone guy proceeded send another apk link asked download verification meantime also kept recieving hi sms another number least times span mins whenever tried calling back number went unanswered calling two numbers heard assamese bangla msg sure language point stopped responding changed passwords informed brother raise complaint cyber cell downloaded apk could much worse thankfully money lost lesson learnt screen shots attached notenot blurring numbers since scam account",
    "cleaned_comments": "",
    "light_cleaned_title": "Beware of phising scam",
    "light_cleaned_selftext": "My mom almost fell for a new phising scam. She was trying to track her passport which is delivered through speed post. She got the tracking number in her email id from the official passport mail and then proceeded to enter that number on this site that she found on Google search Ofcourse to the tech savvy people we can differentiate between a phising site and an authentic site, but mom could not. We were not aware that she had done this. Later she informs us that she got a msg that some address verification needed to be done and someone will contact her. Now keep in mind, no official communication was made for the same through passport seva Kendra on mail or sms, this MSG had just popped up on the tracking site, that the address is wrong and will need verification. Today morning she recieved a call saying she needs to send the address and pincode on this WhatsApp number 7029258238 and also shared another phising site like that was literally made on a wix website! This site was a basic wirefram site with 3 input fields 1. Mobile number 2. Bank name 3. UPI pin And she proceeded ahead with adding all of these...everytime she hit send it said incorrect input and the guys, apparently who was \"guiding her on the phone on what to do\" kept asking what other banks you have account in, try them. I was in a meeting and had just gotten free when I heard her doing this. I immediately asked her to cut the call and took over her phone. This guy then proceeded to send another apk link and asked her to download it for the verification. In the meantime, she also kept recieving \"hi\" on sms from another number 9641236829 at least some 10 times in a span of 5 mins. Whenever I tried calling back to that number it went unanswered. When calling these two numbers we heard an Assamese/ Bangla msg not sure of the language By this point I stopped responding and changed all her passwords and informed my brother to raise a complaint in cyber cell. If she had downloaded the apk it could have been much worse. Thankfully no money was lost and a lesson was learnt. Screen shots attached Note-not blurring out the numbers since this is a scam account",
    "light_cleaned_comments": ""
}