{
    "id": "154pzz0",
    "title": "Brij bhushan get bail",
    "url": "https://www.livemint.com/news/wfi-chief-brij-bhushan-gets-bail-in-wrestlers-sexual-harassment-case-11689850842428.html",
    "selftext": "Brij bhushan get bail by paying 25k,manipur incident,etc. \n\n seeing all these makes me really wonder what will we do if these things happen to our closed ones.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1689857260.0,
    "convurl": "https://external-preview.redd.it/cUavMVIbu4cN5Ifh_-PWsdaPi2IB7T182CwNai4O4v0.jpg?auto=webp&s=ab00d823e0d9ae492a415e5589257ba7e60c1067",
    "comments": [
        "Disgusting. Look at his hideous face.",
        "Congratulations bhakts.",
        "For some the process is the punishment  for some it's a joke .",
        ">... what will we do if these things happen to our closed ones...\n\nWe'll vote for the BJP. \n\nRemember the second wave of Covid. I don't think there was a single family in India that didn't lose someone during that time, and yet nobody even talks about it now. It is already forgotten. If we cannot remember something that personally injured us, the rape and sexual exploitation of someone we don't even know will be even more easily forgotten. \n\nThe *bhakts* will do *bhakti*. BJP will come back to power. There is no salvation left for those of us with a single functioning brain cell."
    ],
    "cleaned_text": "brij bhushan get bail brij bhushan get bail paying kmanipur incidentetc seeing makes really wonder things happen closed ones ",
    "cleaned_title": "brij bhushan get bail",
    "cleaned_selftext": "brij bhushan get bail paying kmanipur incidentetc seeing makes really wonder things happen closed ones",
    "cleaned_comments": "disgusting look hideous face congratulations bhakts process punishment joke things happen closed ones well vote bjp remember second wave covid dont think single family india didnt lose someone time yet nobody even talks already forgotten remember something personally injured us rape sexual exploitation someone dont even know even easily forgotten bhakts bhakti bjp come back power salvation left us single functioning brain cell",
    "light_cleaned_title": "Brij bhushan get bail",
    "light_cleaned_selftext": "Brij bhushan get bail by paying 25k,manipur incident,etc. seeing all these makes me really wonder what will we do if these things happen to our closed ones.",
    "light_cleaned_comments": "Disgusting. Look at his hideous face. Congratulations bhakts. For some the process is the punishment for some it's a joke . >... what will we do if these things happen to our closed ones... We'll vote for the BJP. Remember the second wave of Covid. I don't think there was a single family in India that didn't lose someone during that time, and yet nobody even talks about it now. It is already forgotten. If we cannot remember something that personally injured us, the rape and sexual exploitation of someone we don't even know will be even more easily forgotten. The *bhakts* will do *bhakti*. BJP will come back to power. There is no salvation left for those of us with a single functioning brain cell."
}