{
    "id": "18z2t4h",
    "title": "Zomato is getting pathetic day by day!",
    "url": "https://www.reddit.com/gallery/18z2t4h",
    "selftext": "Today I ordered Burgers and fries from a restaurant on Zomato and the order was late. Got a \"claim your late coupon\" prompt which was a puny 73₹ whereas order amount was 329₹. \n\nPoint is not to get a refund but to get connected with customer support to resolve the issue. Lately, Zomato just redirects any issue to email and does not let you get to chat support. This is really pathetic and transforms into a frustrating user experience. \n\nNot to mention their artificially inflated prices and ridiculously high \"packing charges\". Have been a Zomato Gold member since they first started it but now I don't think it's worth renewing anymore.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1704446420.0,
    "convurl": "https://i.redd.it/5uidkflaalac1.jpg",
    "comments": [
        "beshram ki tarah puch bhi raha hai ' what would you like to order next'"
    ],
    "cleaned_text": "zomato getting pathetic day day today ordered burgers fries restaurant zomato order late got claim late coupon prompt puny whereas order amount point get refund get connected customer support resolve issue lately zomato redirects issue email let get chat support really pathetic transforms frustrating user experience mention artificially inflated prices ridiculously high packing charges zomato gold member since first started dont think worth renewing anymore ",
    "cleaned_title": "zomato getting pathetic day day",
    "cleaned_selftext": "today ordered burgers fries restaurant zomato order late got claim late coupon prompt puny whereas order amount point get refund get connected customer support resolve issue lately zomato redirects issue email let get chat support really pathetic transforms frustrating user experience mention artificially inflated prices ridiculously high packing charges zomato gold member since first started dont think worth renewing anymore",
    "cleaned_comments": "beshram ki tarah puch bhi raha hai would like order next",
    "light_cleaned_title": "Zomato is getting pathetic day by day!",
    "light_cleaned_selftext": "Today I ordered Burgers and fries from a restaurant on Zomato and the order was late. Got a \"claim your late coupon\" prompt which was a puny 73₹ whereas order amount was 329₹. Point is not to get a refund but to get connected with customer support to resolve the issue. Lately, Zomato just redirects any issue to email and does not let you get to chat support. This is really pathetic and transforms into a frustrating user experience. Not to mention their artificially inflated prices and ridiculously high \"packing charges\". Have been a Zomato Gold member since they first started it but now I don't think it's worth renewing anymore.",
    "light_cleaned_comments": "beshram ki tarah puch bhi raha hai ' what would you like to order next'"
}