{
    "id": "14pu6rx",
    "title": "How common are the names Kala Mian and Munir Cassab?",
    "url": "https://www.reddit.com/r/india/comments/14pu6rx/how_common_are_the_names_kala_mian_and_munir/",
    "selftext": "They were seamen who died when their ship, SS Matra, hit a mine North of Margate on the south-east coast of England on the 13th November 1939. I take [pictures](https://imgur.com/exYfugS) of graves and try to find out about the people in them. I found a lot about their ship but nothing at all online about these poor men, or the other 17 Indian sailors who died on the same day. They're a long way from home and I wondered if there were any relatives who might like to see the graves.",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 10,
    "created_utc": 1688416897.0,
    "convurl": "https://external-preview.redd.it/QhOoeARGF4R1MLubNyEoCeumSkGJfzY0-uDLqPKAj10.jpg?auto=webp&s=64040a23bbc148d3e4f70fbad1e38d2a0553826b",
    "comments": [
        "Thank you for doing this and taking the picture. Probably these sailors were from really poor families back then. I doubt if their families saw the grave.\nBy the way, where is the location of the graves ?",
        "The graves are in Margate cemetery, Manston Road, Margate, CT9 4LY. I tried to provide a link but the automod didn't like it and removed it. Twice! :) \n\nThe headstones are placed unusually close to each other and in a small clearing on their own, under a large tree near an area used to scatter ashes. They are in a very nice location and I think their families would be happy with it. I don't know who placed the flowers there, or why.",
        "No issues, thank you.\n I have also visited graveyards of englishmen here in India . The dates are from mid 1800s.\nI also wonder if the family members visited these graves, kind of makes me sad.\nBut i am sure they were informed about the deaths.",
        "The Indian Rebellion and Mutiny graves, perhaps?",
        "No, normal british offcials who were working here and died.",
        "Oh right. I'm surprised they weren't taken back to the UK. Actually, that probably wouldn't have been a good idea back then...",
        "I have visited this one ; Christian Burial Ground - Dumdum Kolkata.\n\nThere are many very old cemetery in kolkata such as\n\nhttps://en.m.wikipedia.org/wiki/South_Park_Street_Cemetery"
    ],
    "cleaned_text": "common names kala mian munir cassab seamen died ship ss matra hit mine north margate southeast coast england th november take pictureshttpsimgurcomexyfugs graves try find people found lot ship nothing online poor men indian sailors died day theyre long way home wondered relatives might like see graves ",
    "cleaned_title": "common names kala mian munir cassab",
    "cleaned_selftext": "seamen died ship ss matra hit mine north margate southeast coast england th november take pictureshttpsimgurcomexyfugs graves try find people found lot ship nothing online poor men indian sailors died day theyre long way home wondered relatives might like see graves",
    "cleaned_comments": "thank taking picture probably sailors really poor families back doubt families saw grave way location graves graves margate cemetery manston road margate ct ly tried provide link automod didnt like removed twice headstones placed unusually close small clearing large tree near area used scatter ashes nice location think families would happy dont know placed flowers issues thank also visited graveyards englishmen india dates mid also wonder family members visited graves kind makes sad sure informed deaths indian rebellion mutiny graves perhaps normal british offcials working died oh right im surprised werent taken back uk actually probably wouldnt good idea back visited one christian burial ground dumdum kolkata many old cemetery kolkata",
    "light_cleaned_title": "How common are the names Kala Mian and Munir Cassab?",
    "light_cleaned_selftext": "They were seamen who died when their ship, SS Matra, hit a mine North of Margate on the south-east coast of England on the 13th November 1939. I take [pictures](https://imgur.com/exYfugS) of graves and try to find out about the people in them. I found a lot about their ship but nothing at all online about these poor men, or the other 17 Indian sailors who died on the same day. They're a long way from home and I wondered if there were any relatives who might like to see the graves.",
    "light_cleaned_comments": "Thank you for doing this and taking the picture. Probably these sailors were from really poor families back then. I doubt if their families saw the grave. By the way, where is the location of the graves ? The graves are in Margate cemetery, Manston Road, Margate, CT9 4LY. I tried to provide a link but the automod didn't like it and removed it. Twice! :) The headstones are placed unusually close to each other and in a small clearing on their own, under a large tree near an area used to scatter ashes. They are in a very nice location and I think their families would be happy with it. I don't know who placed the flowers there, or why. No issues, thank you. I have also visited graveyards of englishmen here in India . The dates are from mid 1800s. I also wonder if the family members visited these graves, kind of makes me sad. But i am sure they were informed about the deaths. The Indian Rebellion and Mutiny graves, perhaps? No, normal british offcials who were working here and died. Oh right. I'm surprised they weren't taken back to the UK. Actually, that probably wouldn't have been a good idea back then... I have visited this one ; Christian Burial Ground - Dumdum Kolkata. There are many very old cemetery in kolkata such as"
}