{
    "id": "1ec1t3g",
    "title": "The good, better, worst in indian content creators.",
    "url": "https://www.reddit.com/r/india/comments/1ec1t3g/the_good_better_worst_in_indian_content_creators/",
    "selftext": "So we just got our budget in and then i started checking in youtube to find out which all teams has made the best videos out of it, who all made the worst videos of off it and who really ticks me off regardless of the budget. So my 2 cents on this topic. \n\nDisclaimer : i don't like bjp, i don't like congress and nowadays i mostly vote nota\n\ncoming back to this:\n\nIf you want to see a filtered opinion on what bjp has done the best in this budget and not see anything bad they have done (be an andh bakth, quite literally) go follow this guy:\n https://youtu.be/_SAtdVsQgwY?si=L0lshZ1fYQ0G5u56  (Think school)\n\nNow if you want to see only the bad things that bjp has done (if with respect to budget, all the investors right now) but irrespective of budget:\n\nhttps://youtu.be/tBPBfBdpMDc?si=K00cUEtcCMshEJ0z  (Dhruv Rathee)\n\nNow if you want someone to point out what all bad things India has to address upon, like let it be infrastructure, health care, sanity. You can look upto:\n\nhttps://youtu.be/Be-QX2fkb30?si=u2Az0ze-CkYBi5Kk  (Mohak Mangal)\n\nNow the one i liked watching before for my financial knowledge but now he who just feels like is the best out of all the people who lives on this planet, just watch this unfiltered video and see the first 10 mins of the podcast. Fook fook ke beja uda liya isne\n\nhttps://youtu.be/QgKte6ODrks?si=0lOd0lphUWuTY3l7  (Untriggered with Aminjaz)\n\nThanks and thats my 2 cents, even if noone asked.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1721931298,
    "convurl": "https://external-preview.redd.it/bVrA7NPHnJy_h4KFX76U2YP6IlIFnwge6kf5eHTn1PY.jpg?auto=webp&s=de5219fe848b4576a9d239302986ad0637c9449f",
    "comments": [
        "You forgot the greatest of all time, Legend Ravish Kumarji."
    ],
    "cleaned_text": "good better worst indian content creators got budget started checking youtube find teams made best videos made worst videos really ticks regardless budget cents topic disclaimer dont like bjp dont like congress nowadays mostly vote nota coming back want see filtered opinion bjp done best budget see anything bad done andh bakth quite literally go follow guy think school want see bad things bjp done respect budget investors right irrespective budget dhruv rathee want someone point bad things india address upon like let infrastructure health care sanity look upto mohak mangal one liked watching financial knowledge feels like best people lives planet watch unfiltered video see first mins podcast fook fook ke beja uda liya isne untriggered aminjaz thanks thats cents even noone asked ",
    "cleaned_title": "good better worst indian content creators",
    "cleaned_selftext": "got budget started checking youtube find teams made best videos made worst videos really ticks regardless budget cents topic disclaimer dont like bjp dont like congress nowadays mostly vote nota coming back want see filtered opinion bjp done best budget see anything bad done andh bakth quite literally go follow guy think school want see bad things bjp done respect budget investors right irrespective budget dhruv rathee want someone point bad things india address upon like let infrastructure health care sanity look upto mohak mangal one liked watching financial knowledge feels like best people lives planet watch unfiltered video see first mins podcast fook fook ke beja uda liya isne untriggered aminjaz thanks thats cents even noone asked",
    "cleaned_comments": "forgot greatest time legend ravish kumarji",
    "light_cleaned_title": "The good, better, worst in indian content creators.",
    "light_cleaned_selftext": "So we just got our budget in and then i started checking in youtube to find out which all teams has made the best videos out of it, who all made the worst videos of off it and who really ticks me off regardless of the budget. So my 2 cents on this topic. Disclaimer : i don't like bjp, i don't like congress and nowadays i mostly vote nota coming back to this: If you want to see a filtered opinion on what bjp has done the best in this budget and not see anything bad they have done (be an andh bakth, quite literally) go follow this guy: (Think school) Now if you want to see only the bad things that bjp has done (if with respect to budget, all the investors right now) but irrespective of budget: (Dhruv Rathee) Now if you want someone to point out what all bad things India has to address upon, like let it be infrastructure, health care, sanity. You can look upto: (Mohak Mangal) Now the one i liked watching before for my financial knowledge but now he who just feels like is the best out of all the people who lives on this planet, just watch this unfiltered video and see the first 10 mins of the podcast. Fook fook ke beja uda liya isne (Untriggered with Aminjaz) Thanks and thats my 2 cents, even if noone asked.",
    "light_cleaned_comments": "You forgot the greatest of all time, Legend Ravish Kumarji."
}