{
    "id": "1d04znz",
    "title": "Is this a scam",
    "url": "https://www.reddit.com/gallery/1d04znz",
    "selftext": "I have taken loans from few third party apps but due date is not even nearby and I have not taken from any of the apps mentioned here. Also I pay my dues on time every month, just wanted to reconfirm that this is a scam. Thank you",
    "flair": "Crime",
    "score": 3,
    "num_comments": 4,
    "created_utc": 1716615470.0,
    "convurl": "https://i.redd.it/of481vl4fi2d1.jpg",
    "comments": [
        "It will download an apk. SCAM.",
        "How does that not look like a scam? The name [New Credit] should fire all your alarms itself.",
        "It does, honestly have taken so many loans I was worried I forgot something and just wanted to make sure",
        "No problem. Also, a tip for future. No loan company will message you on WhatsApp, if they are half serious. Even when they do use WhatsApp, they will have a verified business account. And if you do engage in communication, search their number online to see if someone else made a complaint against them. If they seem very pushy, be firm and ask them to share their ID along with their face so you can verify they are who they say and the ID is theirs. Also, it helps to push them to communicate via email channels that use the domain of organisation they claim to belong to."
    ],
    "cleaned_text": "scam taken loans third party apps due date even nearby taken apps mentioned also pay dues time every month wanted reconfirm scam thank ",
    "cleaned_title": "scam",
    "cleaned_selftext": "taken loans third party apps due date even nearby taken apps mentioned also pay dues time every month wanted reconfirm scam thank",
    "cleaned_comments": "download apk scam look like scam name new credit fire alarms honestly taken many loans worried forgot something wanted make sure problem also tip future loan company message whatsapp half serious even use whatsapp verified business account engage communication search number online see someone else made complaint seem pushy firm ask share id along face verify say id also helps push communicate via email channels use domain organisation claim belong",
    "light_cleaned_title": "Is this a scam",
    "light_cleaned_selftext": "I have taken loans from few third party apps but due date is not even nearby and I have not taken from any of the apps mentioned here. Also I pay my dues on time every month, just wanted to reconfirm that this is a scam. Thank you",
    "light_cleaned_comments": "It will download an apk. SCAM. How does that not look like a scam? The name [New Credit] should fire all your alarms itself. It does, honestly have taken so many loans I was worried I forgot something and just wanted to make sure No problem. Also, a tip for future. No loan company will message you on WhatsApp, if they are half serious. Even when they do use WhatsApp, they will have a verified business account. And if you do engage in communication, search their number online to see if someone else made a complaint against them. If they seem very pushy, be firm and ask them to share their ID along with their face so you can verify they are who they say and the ID is theirs. Also, it helps to push them to communicate via email channels that use the domain of organisation they claim to belong to."
}