{
    "id": "13unfxs",
    "title": "India Today: Wrestlers' protest live updates: Going ahead with march would hamper 'national heritage', says FIR against Sakshi Malik, 11 others",
    "url": "https://www.indiatoday.in/india/story/wrestlers-protests-vinesh-phogat-sakshi-malik-wfi-chief-bajrang-punia-brij-bhushan-singh-delhi-jantar-mantar-detained-2385753-2023-05-29",
    "selftext": "Just to protect ONE person, this drama is being played out. Imagine how deep the rot has set in and how many so-called Desk Bhakt politicians may be involved.",
    "flair": "Politics",
    "score": 474,
    "num_comments": 27,
    "created_utc": 1685343483.0,
    "convurl": "https://external-preview.redd.it/GP_VSMCJkvaEZzI8mNmUvyAfGZhO9I8b9UsDjNLwjLw.jpg?auto=webp&v=enabled&s=dc39ba21de58b443317fca39ef1ed162f30d7068",
    "comments": [
        "National Heritage... Oh the irony... \n\nThe last ounce of dignity that any women in our country had was lost when we used women to suppress other women. This is the absolute rock bottom low.",
        "Do these guys even know how this national heritage was formed? Peaceful protests and marches are what resulted in the formation of India in the first place.",
        "What National  Heritage ,the one which is inhabited  by Rapists nd Murderers  🤔. Those Athletes who won them  🏅's are also Nation's Pride",
        "and people say police is not prompt in filing fir.\n/s",
        "Respect rapists please /s",
        "'National heritage' is code for dear leader's PR",
        "Imagine Sakshi started slamming those people right there on the road.",
        "National heritage, my ass.",
        "National heritage? Do they even believe what they say? How low can the Govt and its subordinate the Delhi Police really fall? How do you sleep at night knowing you do what you do?",
        "Do they just make up stuff for the FIR?",
        "Apology letter worshippers would deny that",
        "Medal winners aren't Heritage /s",
        "ye situation hi nahi aata agar Govt. proper action leti. Atleast us aadmi ko suspend tou karti.",
        "Madarchod",
        "Please reply to this tweet https://twitter.com/narendramodi/status/766073086844239872",
        "She wisely didn't do it. Otherwise she would have been branded an urban naxal, AI-generated photos would have come out showing her eating beef and they would claim she has a secret Muslim husband/bf and her real name is Shabana Malik.",
        "Peaceful protests have never prevented tyrants from doing what they wanted. In fact, it is when people are peaceful that its most convenient for the tyrants to do what they want.\n\nThe propaganda to tarnish these athletes would be spread regardless of how they behave. The mere act of raising the voice against a tyrant is enough for them to act against them.",
        "You have a point. However, beating up the policemen who were ordered to arrest her, wouldn't harm the tyrants at all. Besides, I don't think even a wrestler can handle multiple policemen from overpowering her. \n\nIt would at most have symbolic value and IMO would have a negative symbolic value.",
        "No, I was not suggesting that they go after the police who are just paid grunts in the grand scheme of things. Just saying that them being peaceful is not going to stop Mr. Tyrant from going after them. They would still brand them Naxal's and terrorists and still use AI generated photos and other propaganda against them. Women talking back (after being sexually molested/harassed) is the last thing conservative wannabe's tolerate.\n\nAt the same time, I don't think peaceful solutions exist for these kind of situations.\n\nGermany didn't de-nazify just because Hitler died or because they went after the military personnel that had a role in the Holocaust. They methodically weeded out the Nazi sympathizers from the the society at the grass roots level."
    ],
    "cleaned_text": "india today wrestlers protest live updates going ahead march would hamper national heritage says fir sakshi malik others protect one person drama played imagine deep rot set many socalled desk bhakt politicians may involved ",
    "cleaned_title": "india today wrestlers protest live updates going ahead march would hamper national heritage says fir sakshi malik others",
    "cleaned_selftext": "protect one person drama played imagine deep rot set many socalled desk bhakt politicians may involved",
    "cleaned_comments": "national heritage oh irony last ounce dignity women country lost used women suppress women absolute rock bottom low guys even know national heritage formed peaceful protests marches resulted formation india first place national heritage one inhabited rapists nd murderers athletes also nations pride people say police prompt filing fir respect rapists please national heritage code dear leaders pr imagine sakshi started slamming people right road national heritage ass national heritage even believe say low govt subordinate delhi police really fall sleep night knowing make stuff fir apology letter worshippers would deny medal winners arent heritage ye situation hi nahi aata agar govt proper action leti atleast us aadmi ko suspend tou karti madarchod please reply tweet wisely didnt otherwise would branded urban naxal aigenerated photos would come showing eating beef would claim secret muslim husbandbf real name shabana malik peaceful protests never prevented tyrants wanted fact people peaceful convenient tyrants want propaganda tarnish athletes would spread regardless behave mere act raising voice tyrant enough act point however beating policemen ordered arrest wouldnt harm tyrants besides dont think even wrestler handle multiple policemen overpowering would symbolic value imo would negative symbolic value suggesting go police paid grunts grand scheme things saying peaceful going stop mr tyrant going would still brand naxals terrorists still use ai generated photos propaganda women talking back sexually molestedharassed last thing conservative wannabes tolerate time dont think peaceful solutions exist kind situations germany didnt denazify hitler died went military personnel role holocaust methodically weeded nazi sympathizers society grass roots level",
    "light_cleaned_title": "India Today: Wrestlers' protest live updates: Going ahead with march would hamper 'national heritage', says FIR against Sakshi Malik, 11 others",
    "light_cleaned_selftext": "Just to protect ONE person, this drama is being played out. Imagine how deep the rot has set in and how many so-called Desk Bhakt politicians may be involved.",
    "light_cleaned_comments": "National Heritage... Oh the irony... The last ounce of dignity that any women in our country had was lost when we used women to suppress other women. This is the absolute rock bottom low. Do these guys even know how this national heritage was formed? Peaceful protests and marches are what resulted in the formation of India in the first place. What National Heritage ,the one which is inhabited by Rapists nd Murderers 🤔. Those Athletes who won them 🏅's are also Nation's Pride and people say police is not prompt in filing fir. /s Respect rapists please /s 'National heritage' is code for dear leader's PR Imagine Sakshi started slamming those people right there on the road. National heritage, my ass. National heritage? Do they even believe what they say? How low can the Govt and its subordinate the Delhi Police really fall? How do you sleep at night knowing you do what you do? Do they just make up stuff for the FIR? Apology letter worshippers would deny that Medal winners aren't Heritage /s ye situation hi nahi aata agar Govt. proper action leti. Atleast us aadmi ko suspend tou karti. Madarchod Please reply to this tweet She wisely didn't do it. Otherwise she would have been branded an urban naxal, AI-generated photos would have come out showing her eating beef and they would claim she has a secret Muslim husband/bf and her real name is Shabana Malik. Peaceful protests have never prevented tyrants from doing what they wanted. In fact, it is when people are peaceful that its most convenient for the tyrants to do what they want. The propaganda to tarnish these athletes would be spread regardless of how they behave. The mere act of raising the voice against a tyrant is enough for them to act against them. You have a point. However, beating up the policemen who were ordered to arrest her, wouldn't harm the tyrants at all. Besides, I don't think even a wrestler can handle multiple policemen from overpowering her. It would at most have symbolic value and IMO would have a negative symbolic value. No, I was not suggesting that they go after the police who are just paid grunts in the grand scheme of things. Just saying that them being peaceful is not going to stop Mr. Tyrant from going after them. They would still brand them Naxal's and terrorists and still use AI generated photos and other propaganda against them. Women talking back (after being sexually molested/harassed) is the last thing conservative wannabe's tolerate. At the same time, I don't think peaceful solutions exist for these kind of situations. Germany didn't de-nazify just because Hitler died or because they went after the military personnel that had a role in the Holocaust. They methodically weeded out the Nazi sympathizers from the the society at the grass roots level."
}