{
    "id": "14vnrgy",
    "title": "Absolute disgrace of a company that NoBroker.com is. Here's my experience. STAY AWAY FROM THIS COMPANY",
    "url": "https://www.reddit.com/r/india/comments/14vnrgy/absolute_disgrace_of_a_company_that_nobrokercom/",
    "selftext": "My absolute horrible experience with NoBroker.com @nobrokercom\n> Long thread, read on. Name and Shame I shall. I don't have the time else I'd take them to consumer court.\n\nI literally just finished my house hunt here in Bangalore and finally ended up getting a house through a broker, and in doing so I paid 1 month in brokerage, 50 thousand.\n\nNow, house hunting in Bangalore is a one of the most shitty things you can through in life, like job hunting some times. So naturally, to leave no stone unturned, I explored every possible avenue, from brokers to Facebook groups to WhatsApp to housing.com to, lo and behold NoBroker.\n\nI took their 45 day money back guarantee plan that said if you don’t find a house through NoBroker in 45 days they’ll return your money. The fine print was, which I’d found after I purchased the plan, that they’d only return your money if you get a house through OTHER AVENUES, WITHIN 45 days, and not if NB is not able to get you a house in 45 days.\n\nWhen I was browsing through their plans, they’d call me 8 times a day, convincing me to convert and buy their plan, and once I did, they assigned a “relationship manager” whose job it was to send me 8-10 leads everyday and I’d short list some and schedule visits.\n\nThis lady would send me 3-4 leads in 3-4 days, in places 20 km from my preferred areas. My budget was 55-60k for fully furnished and I’d receive houses for 30k rent. And everytime I’d ask her to check my requirements and send relevant leads, she’d send me responses that would look like responses from a broken chatbot from 2010. This went on for three whole weeks.\n\n25 days later I found a house through a local broker on housing.com, and now check the balls on these NB fuckers, they started sending me incessant messages and calls to avail their moving services. Their price was competitive so I scheduled it. Coz how much worse could it get. Again, their reps would call me 8 times a day to pay the token amount and confirm the booking.\n\nA day before the moving date, I tried calling the assigned driver and his phone was busy. Called a couple more time and still busy so I called NB to confirm. In the subsequent 5 calls, I spoke to every department but the movers and packers and when I got a hold of a rep from packers dept he said the booking is confirmed and truck would come.\n\nAppointment was for 2pm the next day so I started calling driver from 10 am. Still busy. Then, I would have made some 8 calls to different NB departments to finally reach the packers department and in my final call with NB at 1:58 pm I was told that the driver would come between 2-3 pm.\n\nI waited another 30 mins, no calls no driver. I then booked porter, guy came in 10 mins and helped me with moving. To this day, I haven’t received a single call or notification about what happened to my booking. They still have my token amount.\n\nNow I'm trying to get my \"Money back\" and I’ve given them my rental agreement 14 days ago, which they are still processing from last 2 weeks.\n\nIn summary, they have NO OPERATIONS, they're just running a call center, selling phony services, and scamming people who are in need, and once they get the money they go MIA\nAnd don't even get me started on their Product. Horrible Mobile AND Desktop app. Fake Listings. Fake Contacts. I wish I the time to sue them and take them to court\n\nHere's the Twitter thread where they'll try and save face on social media. Let's see what they come up with\n\n[Twitter!](https://twitter.com/rohit09khanna/status/1678298067991425024?s=20)",
    "flair": "Rant / Vent",
    "score": 663,
    "num_comments": 81,
    "created_utc": 1688976928.0,
    "convurl": "https://external-preview.redd.it/-QFjbg9ALLIctp_YTrV1Db_aDDpSEiTcKxvHoftiWE4.jpg?auto=webp&s=ae490ebb4818074cf38d5aa7dcd8ae873d2cac34",
    "comments": [
        "Ironically, its co-founder Saurabh Garg published this article today: [How to not fall prey to real estate frauds](https://www.deccanherald.com/business/business-news/how-to-not-fall-prey-to-real-estate-frauds-1235516.html) \n\nTakes a fraud to know a fraud, I guess!",
        "haha ironic indeed. I'm getting \"Save your house from fraudsters\" push notifications from Nobroker app as we speak.\n\nIt's just tragic the state of these companies. The likes of Byju's NB's raise a ton of money, and all they have to show for is shitty customer experience, and scams.",
        "Hey man, I'm sorry for your experience. But I'm telling you, I don't understand how people gravitate towards NoBroker, because the app literally doesn't work for me. Whenever I have tried to look for apartments, it never sends the details to me, although it shows on the app that it has. Lots of glitches on the app as well. So, I have always stayed away from it.\n\nI hope this post acts as a public service announcement and opens people's eyes.",
        "Upvoting and commenting for reach",
        "Welcome to Indian Startup Model. Most companies are running callcenters with tieups with random third party providers.",
        "So I just went through their LinkedIn and twitter and it’s ALL people just ranting for bad service and crying for their refund.\nI wish I’d known.\nWell at least this will serve as a PSA for others in future.",
        "We have a lot of bad examples but What are some of the good examples of Indian startups doing gods work? I’d say Swiggy, Zerodha, Razorpay. What else?",
        "Sue them, I'll help you.",
        "I thought OP worked for NoBroker and is asking us to stay away from there as an employee.",
        "I suspect they're selling user's personal info too. I started getting waaaaay too many spam calls and emails after I created my NoBroker profile.",
        "GoGlocal, InfraMarket, Delhivery, Rivigo",
        "Wow, just quoted about 3 times the rate for a long distance shifting for thier so called better service. Wanted to vent out came here and saw this.",
        "Haha na I don’t work for them. I’m just another victim. I would however love to know what goes on on the inside at NB. Any NoBroker employees here can enlighten us?",
        "That’s true. Happened to me too. Plus the number of push notifications and what’sapp alerts they send. Yuck",
        "This isn't only the state of no broker. Their are many LEGIT big companies that do this scammy buisness, for ex LG. Not all dept of all LG tho only the mobile phone and laptop buisness and there are plenty more.   \nSad thing is even if you take them to consumer court it'll be a huge pain in the ass for you and 2 weeks after this ordeal they will come out unharmed",
        "Hahah you’re welcome I just saved you the trouble. In my experience, Porter has been really good but I don’t know about their long distance packing and moving service",
        "If only I had the time. For general knowledge purposes however, how rewarding would the ordeal be?",
        "I just narrowly avoided them. \n\nWas about to buy the 25 leads program from them for about 1000 bucks. \n\nBut fortunately I found a PG on my own..",
        "As someone who has posted property to rent out on nobroker a few times, I have found my experience to be pretty good tbh. They provide genuine leads, my relationship manager last time was good and I've had largely very professional and courteous conversations over phone. Though I've never really availed any of their over the top services. \n\nMaybe it's different when you're looking for a house. Or could be different due to different city. For instance, my experience with housing.com has been absolutely pathetic thus far. But that was long back.",
        "Postman is absolutely amazing, also Zoho has been good. While swiggy/zomato are good products they have never been profitable.",
        "well i guess i have gotten lucky in this case, since it seems like im the only one who actually got good service from them. i used nobroker for packing and moving all my stuff since i had shifted to another area and the people were amazing, quick and came right on time. Their speed of working in packing all the stuff and everything was exceptional. Gave a 5 star rating to them.",
        "I've had decent experience in magic bricks premium. They claim you get direct contacts of the owners but I didn't get as many as I would like. Although I did find decent brokers over there. They charged half a month's rent as brokerage. At this point I've made up my mind, that's the price you have to pay to find a house. \n\nMind you, this was in Hyderabad. Not sure how the brokerage scene is in bangalore. I don't imagine it would be very different. Rental deposit is a whole can of worms though. Hyderabad is much, much better at this.",
        "Yes they do that.",
        "Same experience, but only with their moving services (I guess you can extrapolate to all of their services). I got my money back in 3 days. From the first email I sent them, I threatened legal action with screenshots of chat messages and call records. Worked like a charm.",
        "Take help of a competitor to sue them.",
        "Damn, thats exactly my freaking experience right now. I too paid money for their shitty service. I found a house through free posting on 99acres and currently facing the wrath of no broker to pay token amount for relocation. Thank you so much. I peacefully tell them to fick off",
        "I found the perfect home on nobroker in an emergency situation. I only paid their package plan, and i got help within days.\n\nWhat i DIDN'T DO, was route any money through nobroker. All money txns were between me and the owner. I took care of my own shifting (because of history of not trusting some online source).\n\nNobroker did its job to find me a house, and rest of the things i did myself. Me and room owner were both happy.\n\nSo it seems nobroker should only be used for buying their package plans, which give wider exposure.\n\nMy society is planning to use nobroker for entry-gate operations (which is already dominated by NoGate). After this post i am doubtful.\n\nSo my basic suggestion is - use what they are good for, and not keep any money pending with them.",
        "Most of Indian start ups are just scams.",
        "Not at all. As much I hate Nobroker, their T&Cs would be solid af and you have no ground to prove any grounds for suing whatsoever. They will return the money after making you wait for weeks by contacting the 3rd party mover etc but forget about the broker amount. That’s not happening",
        "Also where in Bangalore did you find a fully furnished house for 55k?",
        "apparently this is their primary market, in addition to selling properties so I can believe that service for those might’ be a tad bit better. The rest of their offerings are just pure shit as is the service/experience",
        "I’d recently heard about a maid finding startup that was just scamming people with fake listings as well",
        "Hahah bullet dodged",
        "Which city?",
        "Seriously man I know. \n\nJust signed up for Stanza living PG in Navi Mumbai.",
        "Hahaha tell me about it. I’ve lived in Hyderabad for most of my life. Good lord the difference in real estate when it comes to Hyderabad vs Bangalore is just not even a discussion at this point. It’s pretty much Bombay vs Bangalore now. Shitty apartments for exorbitant rents",
        "Yep. It’s endemic. Just look at their LinkedIn page and see the number of people grieving. It’s a sad sight",
        "In Caps. Also uninstall their apps, I’d say",
        "The problem is, even if you buy their plans just for visibility, they have a ton of fake listings. Out of 100+ houses listed, I didn’t find one decent apartment matching my requirements and I’m not even exaggerating",
        "I’m not even looking for a refund on the broker amount. I just want my “money back guarantee” money back. And there’s no chance in hell I’m letting them get away with it. If that means legal action, I’ll do it. More for principles than for money",
        "I got a semi-furnished flat in Domlur for 53k but it had 2 beds with good mattresses it worked out with renting some other stuff.",
        "Well, even when I wanted to sell my house and I paid 25k to 35k to find the buyers. People use to like the house and wanted to make appointments but when I revert them back, they were making excuses like there's no elevator, no wheelchair accessibility and other things even when I mention on the site all the details. \n\nIt took more than 5 months to find a buyer but my house couldn't able to sell. They always forced me to upgrade the plan for more perks. Done that but didn't able to sell the house. At time I thought that I'm only facing the problem but most of people are unhappy from NoBroker. \n\nCouldn't able to sell the first house and then I lost 10% of the money (which I paid for other house and Stamp duty money)",
        "Oh god....I was thinking of paying to  Nobroker. I randomly opened reddit and this is the first post I saw. You saved me. People should target these scammers on twitter.",
        "Bengaluru",
        "Don't know how people are getting frustrated with the app. I along with my flatmates got a flat in Pune without even getting a subscription. Maybe because we moved into the second flat we visited. Apart from some pesky phone calls from them for ratings, everything is smooth for us.",
        "All these startups have just become sales oriented. Once the sales guy converts then they simply don't give a fuck. Sadly this is Indian services culture at its worst. \nI had bought a plan to sell my house and they are just so bloody incompetent that not a single visit has been scheduled for any interested party till date after 70 days of the plan. They charged me 13k for this. A local broker can get me multiple buyer visits free of charge.\n\nAll these so called funded startups that were flexing on valuations till 2019-2020 have all become dog shit. Oyo, Practo, Paytm, you name it.",
        "dream11. I know it's not the answer u wanna hear, but they have an actual product and works amazing. Now the product itself is ethically bad, but the quality is very good. Fantasy gaming was a remote concept before this.",
        "Dream11 is an actual product (fantasy gaming) and very profitable. The problem people have with the company is cuz of gambling being morally bad, but the product itself is amazing.",
        "IndiaMart, IdeaForge, EasemyTrip, BigBasket, InfoEdge, IDFresh .. All of these companies started very small and slowly generated revenue and profits.",
        "The state of india exactly. The number of people running scammy call centres are crazy. A word of advice my dad goes berserk (like full on swearing) on the phone and they will return your money but make sure that when u go berserk u repeat the point of them scamming you and record it this way they can't do shit to u",
        "It's incredibly sad how bangalore residents have to struggle everyday with basic things",
        "IMO , no brokers paid service has no other real benefit for the flat. \nThey do have some vendors listed , that help in getting electricity, plumbing and painting jobs also.\n( Nothing you won't get on UC ).\nThe problem is that these guys also end up taking a cut from other real estate agents .\nSo while, there are a few genuine clients coming in, most are again brokers who come and vwt your flats before getting in customer",
        "All my Oyo bookings get cancelled at the hotels, giving some or the other reasons. Now I only book with the option to pay at the hotel.",
        "Dream11 is as bad as Byjus. Any company that preys on FUD and the feeling of \"missing out\" can duck my sick.",
        "I too have had a bad experience with nobroker. \nMy father was a builder a few years ago. He's since retired. The last project he worked on was/is under litigation for more than a decade now. Ownership is not clear. There is a stay on the sale of the property from the court. Despite this,some of the involved people tried to sell it by placing an ad on nobroker. This was brought to my father's notice and he tried to contact nobroker and inform them that there is a stay on the sale of those flats,but they refused to listen to my father. And the ad continues to be live on their app till date. \nThey said that it is not their responsibility to check for such things and prospective buyers should check for such legal issues. \nI really don't understand how they continue to advertise such a property on their app. It's one thing if they don't know,but they are aware and say they don't care.",
        "How to avoid such properties/projects which are under litigation? \n\nThanks",
        "I was an employee for I guess 10 days or so in the year 2021.\n\nHired as an HR Executive & the target was to take interviews of random people whom I searched from Naukri.com. The total call should be 2.5hrs i.e., 150mins - if the total mins would be less than this then they would deduct that day’s salary.\n\nMoreover, we had to build pipeline of candidates (this was OK bcos everyone had deadlines to meet). But the calling hours ! Man that sucked & that’s y I left. That’s mentally exhausting. \n\nThe suitable candidates didn’t even receive calls bcos they didn’t wanted to work for a real estate company. They mark the HR calls as spam. This is the “image”.",
        "zoho is not a startup too old well established not one of those companies that stayed afloat with vc money for a long time...",
        "Try filing a complaint on pgportal with Dept of consumer affairs. It usually works and you may get your refund. Or try INGRAM.",
        "When i first moved to Bangalore in 2019, I had to find a home in my budget for a family of two. I didn't have that many friends in Bglr so i used nb free plan with filters on budget and location and found a very good house for rent and moved there.\n\nThis year, i planned to buy a resale apartment, so i again started using NB. I even brought their plan so that i can use more filters like age of the building etc. I too got assigned with relationship manager but after the initial days of calls from her, i stopped picking them as her suggestions were not suiting me and i enjoyed the process of searching on my own. After some days they too stopped calling as i made it clear that i dont want to have a call but asked her to msg in the app itself so she used to send her suggestions. I shortlisted some properties and they arranged for site visits too which i have visited and spoke to the owners living there.\n\nI didn't feel there is an issue with fake listings or at least not done deliberately by NB. I agree with the spam and repeated calls, that is the biggest issue i faced with them\n\nI still use nb, as a person who just likes to window shop houses, NB is my Instagram",
        "No Broker paid plan is crap.\n\nI had 1 firm requirement: a house within 5 kms of my kids school.\n\nThey literally could not give me any leads despite there being multiple 300-3000 flat apartment complexes being in the vicinity, and user generated listings for the same coming up on their own platform.\n\nThey kept on trying to convince us to change the locality to some place else, without consideration for my one non negotiable requirement.\n\nRefund was in form of credit which we never managed to use.",
        "Yeah, except gambling is still considered a product. A very profitable one...that's why almost no casino in the world runs on a loss. So they have an actual working model. \n\nWhat you're arguing is the ethics of the product, that i agree that is bad. \n\nThere's a reason Dream11 is profitable and Byju's is losing money.",
        "I tried finding an apartment through them 6 years back. Same experience. NoBroker means \"We only are the Broker\"",
        "Take a problem, aggregate it, put a nice-looking UI over it. seems to be the mantra of all startups. No effort to actually solve the problem",
        "“If I speak I’m in big trouble”",
        "Please don't pay NoBroker a single paise. Anything free from them is all its worth. No one. I repeat, No one has benefitted from NoBroker paid plans other than NoBroker themselves."
    ],
    "cleaned_text": "absolute disgrace company nobrokercom heres experience stay away company absolute horrible experience nobrokercom nobrokercom long thread read name shame shall dont time else id take consumer court literally finished house hunt bangalore finally ended getting house broker paid month brokerage thousand house hunting bangalore one shitty things life like job hunting times naturally leave stone unturned explored every possible avenue brokers facebook groups whatsapp housingcom lo behold nobroker took day money back guarantee plan said dont find house nobroker days theyll return money fine print id found purchased plan theyd return money get house avenues within days nb able get house days browsing plans theyd call times day convincing convert buy plan assigned relationship manager whose job send leads everyday id short list schedule visits lady would send leads days places km preferred areas budget k fully furnished id receive houses k rent everytime id ask check requirements send relevant leads shed send responses would look like responses broken chatbot went three whole weeks days later found house local broker housingcom check balls nb fuckers started sending incessant messages calls avail moving services price competitive scheduled coz much worse could get reps would call times day pay token amount confirm booking day moving date tried calling assigned driver phone busy called couple time still busy called nb confirm subsequent calls spoke every department movers packers got hold rep packers dept said booking confirmed truck would come appointment pm next day started calling driver still busy would made calls different nb departments finally reach packers department final call nb pm told driver would come pm waited another mins calls driver booked porter guy came mins helped moving day havent received single call notification happened booking still token amount im trying get money back ive given rental agreement days ago still processing last weeks summary operations theyre running call center selling phony services scamming people need get money go mia dont even get started product horrible mobile desktop app fake listings fake contacts wish time sue take court heres twitter thread theyll try save face social media lets see come twitterhttpstwittercomrohitkhannastatuss ",
    "cleaned_title": "absolute disgrace company nobrokercom heres experience stay away company",
    "cleaned_selftext": "absolute horrible experience nobrokercom nobrokercom long thread read name shame shall dont time else id take consumer court literally finished house hunt bangalore finally ended getting house broker paid month brokerage thousand house hunting bangalore one shitty things life like job hunting times naturally leave stone unturned explored every possible avenue brokers facebook groups whatsapp housingcom lo behold nobroker took day money back guarantee plan said dont find house nobroker days theyll return money fine print id found purchased plan theyd return money get house avenues within days nb able get house days browsing plans theyd call times day convincing convert buy plan assigned relationship manager whose job send leads everyday id short list schedule visits lady would send leads days places km preferred areas budget k fully furnished id receive houses k rent everytime id ask check requirements send relevant leads shed send responses would look like responses broken chatbot went three whole weeks days later found house local broker housingcom check balls nb fuckers started sending incessant messages calls avail moving services price competitive scheduled coz much worse could get reps would call times day pay token amount confirm booking day moving date tried calling assigned driver phone busy called couple time still busy called nb confirm subsequent calls spoke every department movers packers got hold rep packers dept said booking confirmed truck would come appointment pm next day started calling driver still busy would made calls different nb departments finally reach packers department final call nb pm told driver would come pm waited another mins calls driver booked porter guy came mins helped moving day havent received single call notification happened booking still token amount im trying get money back ive given rental agreement days ago still processing last weeks summary operations theyre running call center selling phony services scamming people need get money go mia dont even get started product horrible mobile desktop app fake listings fake contacts wish time sue take court heres twitter thread theyll try save face social media lets see come twitterhttpstwittercomrohitkhannastatuss",
    "cleaned_comments": "ironically cofounder saurabh garg published article today fall prey real estate fraudshttpswwwdeccanheraldcombusinessbusinessnewshowtonotfallpreytorealestatefraudshtml takes fraud know fraud guess haha ironic indeed im getting save house fraudsters push notifications nobroker app speak tragic state companies likes byjus nbs raise ton money show shitty customer experience scams hey man im sorry experience im telling dont understand people gravitate towards nobroker app literally doesnt work whenever tried look apartments never sends details although shows app lots glitches app well always stayed away hope post acts public service announcement opens peoples eyes upvoting commenting reach welcome indian startup model companies running callcenters tieups random third party providers went linkedin twitter people ranting bad service crying refund wish id known well least serve psa others future lot bad examples good examples indian startups gods work id say swiggy zerodha razorpay else sue ill help thought op worked nobroker asking us stay away employee suspect theyre selling users personal info started getting waaaaay many spam calls emails created nobroker profile goglocal inframarket delhivery rivigo wow quoted times rate long distance shifting thier called better service wanted vent came saw haha na dont work im another victim would however love know goes inside nb nobroker employees enlighten us thats true happened plus number push notifications whatsapp alerts send yuck isnt state broker many legit big companies scammy buisness ex lg dept lg tho mobile phone laptop buisness plenty sad thing even take consumer court itll huge pain ass weeks ordeal come unharmed hahah youre welcome saved trouble experience porter really good dont know long distance packing moving service time general knowledge purposes however rewarding would ordeal narrowly avoided buy leads program bucks fortunately found pg someone posted property rent nobroker times found experience pretty good tbh provide genuine leads relationship manager last time good ive largely professional courteous conversations phone though ive never really availed top services maybe different youre looking house could different due different city instance experience housingcom absolutely pathetic thus far long back postman absolutely amazing also zoho good swiggyzomato good products never profitable well guess gotten lucky case since seems like im one actually got good service used nobroker packing moving stuff since shifted another area people amazing quick came right time speed working packing stuff everything exceptional gave star rating ive decent experience magic bricks premium claim get direct contacts owners didnt get many would like although find decent brokers charged half months rent brokerage point ive made mind thats price pay find house mind hyderabad sure brokerage scene bangalore dont imagine would different rental deposit whole worms though hyderabad much much better yes experience moving services guess extrapolate services got money back days first email sent threatened legal action screenshots chat messages call records worked like charm take help competitor sue damn thats exactly freaking experience right paid money shitty service found house free posting acres currently facing wrath broker pay token amount relocation thank much peacefully tell fick found perfect home nobroker emergency situation paid package plan got help within days didnt route money nobroker money txns owner took care shifting history trusting online source nobroker job find house rest things room owner happy seems nobroker used buying package plans give wider exposure society planning use nobroker entrygate operations already dominated nogate post doubtful basic suggestion use good keep money pending indian start ups scams much hate nobroker tcs would solid af ground prove grounds suing whatsoever return money making wait weeks contacting rd party mover etc forget broker amount thats happening also bangalore find fully furnished house k apparently primary market addition selling properties believe service might tad bit better rest offerings pure shit serviceexperience id recently heard maid finding startup scamming people fake listings well hahah bullet dodged city seriously man know signed stanza living pg navi mumbai hahaha tell ive lived hyderabad life good lord difference real estate comes hyderabad vs bangalore even discussion point pretty much bombay vs bangalore shitty apartments exorbitant rents yep endemic look linkedin page see number people grieving sad sight caps also uninstall apps id say problem even buy plans visibility ton fake listings houses listed didnt find one decent apartment matching requirements im even exaggerating im even looking refund broker amount want money back guarantee money back theres chance hell im letting get away means legal action ill principles money got semifurnished flat domlur k beds good mattresses worked renting stuff well even wanted sell house paid k k find buyers people use like house wanted make appointments revert back making excuses like theres elevator wheelchair accessibility things even mention site details took months find buyer house couldnt able sell always forced upgrade plan perks done didnt able sell house time thought im facing problem people unhappy nobroker couldnt able sell first house lost money paid house stamp duty money oh godi thinking paying nobroker randomly opened reddit first post saw saved people target scammers twitter bengaluru dont know people getting frustrated app along flatmates got flat pune without even getting subscription maybe moved second flat visited apart pesky phone calls ratings everything smooth us startups become sales oriented sales guy converts simply dont give fuck sadly indian services culture worst bought plan sell house bloody incompetent single visit scheduled interested party till date days plan charged k local broker get multiple buyer visits free charge called funded startups flexing valuations till become dog shit oyo practo paytm name dream know answer u wan na hear actual product works amazing product ethically bad quality good fantasy gaming remote concept dream actual product fantasy gaming profitable problem people company cuz gambling morally bad product amazing indiamart ideaforge easemytrip bigbasket infoedge idfresh companies started small slowly generated revenue profits state india exactly number people running scammy call centres crazy word advice dad goes berserk like full swearing phone return money make sure u go berserk u repeat point scamming record way cant shit u incredibly sad bangalore residents struggle everyday basic things imo brokers paid service real benefit flat vendors listed help getting electricity plumbing painting jobs also nothing wont get uc problem guys also end taking cut real estate agents genuine clients coming brokers come vwt flats getting customer oyo bookings get cancelled hotels giving reasons book option pay hotel dream bad byjus company preys fud feeling missing duck sick bad experience nobroker father builder years ago hes since retired last project worked wasis litigation decade ownership clear stay sale property court despite thissome involved people tried sell placing ad nobroker brought fathers notice tried contact nobroker inform stay sale flatsbut refused listen father ad continues live app till date said responsibility check things prospective buyers check legal issues really dont understand continue advertise property app one thing dont knowbut aware say dont care avoid propertiesprojects litigation thanks employee guess days year hired hr executive target take interviews random people searched naukricom total call hrs ie mins total mins would less would deduct days salary moreover build pipeline candidates ok bcos everyone deadlines meet calling hours man sucked thats left thats mentally exhausting suitable candidates didnt even receive calls bcos didnt wanted work real estate company mark hr calls spam image zoho startup old well established one companies stayed afloat vc money long time try filing complaint pgportal dept consumer affairs usually works may get refund try ingram first moved bangalore find home budget family two didnt many friends bglr used nb free plan filters budget location found good house rent moved year planned buy resale apartment started using nb even brought plan use filters like age building etc got assigned relationship manager initial days calls stopped picking suggestions suiting enjoyed process searching days stopped calling made clear dont want call asked msg app used send suggestions shortlisted properties arranged site visits visited spoke owners living didnt feel issue fake listings least done deliberately nb agree spam repeated calls biggest issue faced still use nb person likes window shop houses nb instagram broker paid plan crap firm requirement house within kms kids school literally could give leads despite multiple flat apartment complexes vicinity user generated listings coming platform kept trying convince us change locality place else without consideration one non negotiable requirement refund form credit never managed use yeah except gambling still considered product profitable onethats almost casino world runs loss actual working model youre arguing ethics product agree bad theres reason dream profitable byjus losing money tried finding apartment years back experience nobroker means broker take problem aggregate put nicelooking ui seems mantra startups effort actually solve problem speak im big trouble please dont pay nobroker single paise anything free worth one repeat one benefitted nobroker paid plans nobroker",
    "light_cleaned_title": "Absolute disgrace of a company that NoBroker.com is. Here's my experience. STAY AWAY FROM THIS COMPANY",
    "light_cleaned_selftext": "My absolute horrible experience with NoBroker.com @nobrokercom > Long thread, read on. Name and Shame I shall. I don't have the time else I'd take them to consumer court. I literally just finished my house hunt here in Bangalore and finally ended up getting a house through a broker, and in doing so I paid 1 month in brokerage, 50 thousand. Now, house hunting in Bangalore is a one of the most shitty things you can through in life, like job hunting some times. So naturally, to leave no stone unturned, I explored every possible avenue, from brokers to Facebook groups to WhatsApp to housing.com to, lo and behold NoBroker. I took their 45 day money back guarantee plan that said if you don’t find a house through NoBroker in 45 days they’ll return your money. The fine print was, which I’d found after I purchased the plan, that they’d only return your money if you get a house through OTHER AVENUES, WITHIN 45 days, and not if NB is not able to get you a house in 45 days. When I was browsing through their plans, they’d call me 8 times a day, convincing me to convert and buy their plan, and once I did, they assigned a “relationship manager” whose job it was to send me 8-10 leads everyday and I’d short list some and schedule visits. This lady would send me 3-4 leads in 3-4 days, in places 20 km from my preferred areas. My budget was 55-60k for fully furnished and I’d receive houses for 30k rent. And everytime I’d ask her to check my requirements and send relevant leads, she’d send me responses that would look like responses from a broken chatbot from 2010. This went on for three whole weeks. 25 days later I found a house through a local broker on housing.com, and now check the balls on these NB fuckers, they started sending me incessant messages and calls to avail their moving services. Their price was competitive so I scheduled it. Coz how much worse could it get. Again, their reps would call me 8 times a day to pay the token amount and confirm the booking. A day before the moving date, I tried calling the assigned driver and his phone was busy. Called a couple more time and still busy so I called NB to confirm. In the subsequent 5 calls, I spoke to every department but the movers and packers and when I got a hold of a rep from packers dept he said the booking is confirmed and truck would come. Appointment was for 2pm the next day so I started calling driver from 10 am. Still busy. Then, I would have made some 8 calls to different NB departments to finally reach the packers department and in my final call with NB at 1:58 pm I was told that the driver would come between 2-3 pm. I waited another 30 mins, no calls no driver. I then booked porter, guy came in 10 mins and helped me with moving. To this day, I haven’t received a single call or notification about what happened to my booking. They still have my token amount. Now I'm trying to get my \"Money back\" and I’ve given them my rental agreement 14 days ago, which they are still processing from last 2 weeks. In summary, they have NO OPERATIONS, they're just running a call center, selling phony services, and scamming people who are in need, and once they get the money they go MIA And don't even get me started on their Product. Horrible Mobile AND Desktop app. Fake Listings. Fake Contacts. I wish I the time to sue them and take them to court Here's the Twitter thread where they'll try and save face on social media. Let's see what they come up with [Twitter!](https://twitter.com/rohit09khanna/status/1678298067991425024?s=20)",
    "light_cleaned_comments": "Ironically, its co-founder Saurabh Garg published this article today: [How to not fall prey to real estate frauds](https://www.deccanherald.com/business/business-news/how-to-not-fall-prey-to-real-estate-frauds-1235516.html) Takes a fraud to know a fraud, I guess! haha ironic indeed. I'm getting \"Save your house from fraudsters\" push notifications from Nobroker app as we speak. It's just tragic the state of these companies. The likes of Byju's NB's raise a ton of money, and all they have to show for is shitty customer experience, and scams. Hey man, I'm sorry for your experience. But I'm telling you, I don't understand how people gravitate towards NoBroker, because the app literally doesn't work for me. Whenever I have tried to look for apartments, it never sends the details to me, although it shows on the app that it has. Lots of glitches on the app as well. So, I have always stayed away from it. I hope this post acts as a public service announcement and opens people's eyes. Upvoting and commenting for reach Welcome to Indian Startup Model. Most companies are running callcenters with tieups with random third party providers. So I just went through their LinkedIn and twitter and it’s ALL people just ranting for bad service and crying for their refund. I wish I’d known. Well at least this will serve as a PSA for others in future. We have a lot of bad examples but What are some of the good examples of Indian startups doing gods work? I’d say Swiggy, Zerodha, Razorpay. What else? Sue them, I'll help you. I thought OP worked for NoBroker and is asking us to stay away from there as an employee. I suspect they're selling user's personal info too. I started getting waaaaay too many spam calls and emails after I created my NoBroker profile. GoGlocal, InfraMarket, Delhivery, Rivigo Wow, just quoted about 3 times the rate for a long distance shifting for thier so called better service. Wanted to vent out came here and saw this. Haha na I don’t work for them. I’m just another victim. I would however love to know what goes on on the inside at NB. Any NoBroker employees here can enlighten us? That’s true. Happened to me too. Plus the number of push notifications and what’sapp alerts they send. Yuck This isn't only the state of no broker. Their are many LEGIT big companies that do this scammy buisness, for ex LG. Not all dept of all LG tho only the mobile phone and laptop buisness and there are plenty more. Sad thing is even if you take them to consumer court it'll be a huge pain in the ass for you and 2 weeks after this ordeal they will come out unharmed Hahah you’re welcome I just saved you the trouble. In my experience, Porter has been really good but I don’t know about their long distance packing and moving service If only I had the time. For general knowledge purposes however, how rewarding would the ordeal be? I just narrowly avoided them. Was about to buy the 25 leads program from them for about 1000 bucks. But fortunately I found a PG on my own.. As someone who has posted property to rent out on nobroker a few times, I have found my experience to be pretty good tbh. They provide genuine leads, my relationship manager last time was good and I've had largely very professional and courteous conversations over phone. Though I've never really availed any of their over the top services. Maybe it's different when you're looking for a house. Or could be different due to different city. For instance, my experience with housing.com has been absolutely pathetic thus far. But that was long back. Postman is absolutely amazing, also Zoho has been good. While swiggy/zomato are good products they have never been profitable. well i guess i have gotten lucky in this case, since it seems like im the only one who actually got good service from them. i used nobroker for packing and moving all my stuff since i had shifted to another area and the people were amazing, quick and came right on time. Their speed of working in packing all the stuff and everything was exceptional. Gave a 5 star rating to them. I've had decent experience in magic bricks premium. They claim you get direct contacts of the owners but I didn't get as many as I would like. Although I did find decent brokers over there. They charged half a month's rent as brokerage. At this point I've made up my mind, that's the price you have to pay to find a house. Mind you, this was in Hyderabad. Not sure how the brokerage scene is in bangalore. I don't imagine it would be very different. Rental deposit is a whole can of worms though. Hyderabad is much, much better at this. Yes they do that. Same experience, but only with their moving services (I guess you can extrapolate to all of their services). I got my money back in 3 days. From the first email I sent them, I threatened legal action with screenshots of chat messages and call records. Worked like a charm. Take help of a competitor to sue them. Damn, thats exactly my freaking experience right now. I too paid money for their shitty service. I found a house through free posting on 99acres and currently facing the wrath of no broker to pay token amount for relocation. Thank you so much. I peacefully tell them to fick off I found the perfect home on nobroker in an emergency situation. I only paid their package plan, and i got help within days. What i DIDN'T DO, was route any money through nobroker. All money txns were between me and the owner. I took care of my own shifting (because of history of not trusting some online source). Nobroker did its job to find me a house, and rest of the things i did myself. Me and room owner were both happy. So it seems nobroker should only be used for buying their package plans, which give wider exposure. My society is planning to use nobroker for entry-gate operations (which is already dominated by NoGate). After this post i am doubtful. So my basic suggestion is - use what they are good for, and not keep any money pending with them. Most of Indian start ups are just scams. Not at all. As much I hate Nobroker, their T&Cs would be solid af and you have no ground to prove any grounds for suing whatsoever. They will return the money after making you wait for weeks by contacting the 3rd party mover etc but forget about the broker amount. That’s not happening Also where in Bangalore did you find a fully furnished house for 55k? apparently this is their primary market, in addition to selling properties so I can believe that service for those might’ be a tad bit better. The rest of their offerings are just pure shit as is the service/experience I’d recently heard about a maid finding startup that was just scamming people with fake listings as well Hahah bullet dodged Which city? Seriously man I know. Just signed up for Stanza living PG in Navi Mumbai. Hahaha tell me about it. I’ve lived in Hyderabad for most of my life. Good lord the difference in real estate when it comes to Hyderabad vs Bangalore is just not even a discussion at this point. It’s pretty much Bombay vs Bangalore now. Shitty apartments for exorbitant rents Yep. It’s endemic. Just look at their LinkedIn page and see the number of people grieving. It’s a sad sight In Caps. Also uninstall their apps, I’d say The problem is, even if you buy their plans just for visibility, they have a ton of fake listings. Out of 100+ houses listed, I didn’t find one decent apartment matching my requirements and I’m not even exaggerating I’m not even looking for a refund on the broker amount. I just want my “money back guarantee” money back. And there’s no chance in hell I’m letting them get away with it. If that means legal action, I’ll do it. More for principles than for money I got a semi-furnished flat in Domlur for 53k but it had 2 beds with good mattresses it worked out with renting some other stuff. Well, even when I wanted to sell my house and I paid 25k to 35k to find the buyers. People use to like the house and wanted to make appointments but when I revert them back, they were making excuses like there's no elevator, no wheelchair accessibility and other things even when I mention on the site all the details. It took more than 5 months to find a buyer but my house couldn't able to sell. They always forced me to upgrade the plan for more perks. Done that but didn't able to sell the house. At time I thought that I'm only facing the problem but most of people are unhappy from NoBroker. Couldn't able to sell the first house and then I lost 10% of the money (which I paid for other house and Stamp duty money) Oh god....I was thinking of paying to Nobroker. I randomly opened reddit and this is the first post I saw. You saved me. People should target these scammers on twitter. Bengaluru Don't know how people are getting frustrated with the app. I along with my flatmates got a flat in Pune without even getting a subscription. Maybe because we moved into the second flat we visited. Apart from some pesky phone calls from them for ratings, everything is smooth for us. All these startups have just become sales oriented. Once the sales guy converts then they simply don't give a fuck. Sadly this is Indian services culture at its worst. I had bought a plan to sell my house and they are just so bloody incompetent that not a single visit has been scheduled for any interested party till date after 70 days of the plan. They charged me 13k for this. A local broker can get me multiple buyer visits free of charge. All these so called funded startups that were flexing on valuations till 2019-2020 have all become dog shit. Oyo, Practo, Paytm, you name it. dream11. I know it's not the answer u wanna hear, but they have an actual product and works amazing. Now the product itself is ethically bad, but the quality is very good. Fantasy gaming was a remote concept before this. Dream11 is an actual product (fantasy gaming) and very profitable. The problem people have with the company is cuz of gambling being morally bad, but the product itself is amazing. IndiaMart, IdeaForge, EasemyTrip, BigBasket, InfoEdge, IDFresh .. All of these companies started very small and slowly generated revenue and profits. The state of india exactly. The number of people running scammy call centres are crazy. A word of advice my dad goes berserk (like full on swearing) on the phone and they will return your money but make sure that when u go berserk u repeat the point of them scamming you and record it this way they can't do shit to u It's incredibly sad how bangalore residents have to struggle everyday with basic things IMO , no brokers paid service has no other real benefit for the flat. They do have some vendors listed , that help in getting electricity, plumbing and painting jobs also. ( Nothing you won't get on UC ). The problem is that these guys also end up taking a cut from other real estate agents . So while, there are a few genuine clients coming in, most are again brokers who come and vwt your flats before getting in customer All my Oyo bookings get cancelled at the hotels, giving some or the other reasons. Now I only book with the option to pay at the hotel. Dream11 is as bad as Byjus. Any company that preys on FUD and the feeling of \"missing out\" can duck my sick. I too have had a bad experience with nobroker. My father was a builder a few years ago. He's since retired. The last project he worked on was/is under litigation for more than a decade now. Ownership is not clear. There is a stay on the sale of the property from the court. Despite this,some of the involved people tried to sell it by placing an ad on nobroker. This was brought to my father's notice and he tried to contact nobroker and inform them that there is a stay on the sale of those flats,but they refused to listen to my father. And the ad continues to be live on their app till date. They said that it is not their responsibility to check for such things and prospective buyers should check for such legal issues. I really don't understand how they continue to advertise such a property on their app. It's one thing if they don't know,but they are aware and say they don't care. How to avoid such properties/projects which are under litigation? Thanks I was an employee for I guess 10 days or so in the year 2021. Hired as an HR Executive & the target was to take interviews of random people whom I searched from Naukri.com. The total call should be 2.5hrs i.e., 150mins - if the total mins would be less than this then they would deduct that day’s salary. Moreover, we had to build pipeline of candidates (this was OK bcos everyone had deadlines to meet). But the calling hours ! Man that sucked & that’s y I left. That’s mentally exhausting. The suitable candidates didn’t even receive calls bcos they didn’t wanted to work for a real estate company. They mark the HR calls as spam. This is the “image”. zoho is not a startup too old well established not one of those companies that stayed afloat with vc money for a long time... Try filing a complaint on pgportal with Dept of consumer affairs. It usually works and you may get your refund. Or try INGRAM. When i first moved to Bangalore in 2019, I had to find a home in my budget for a family of two. I didn't have that many friends in Bglr so i used nb free plan with filters on budget and location and found a very good house for rent and moved there. This year, i planned to buy a resale apartment, so i again started using NB. I even brought their plan so that i can use more filters like age of the building etc. I too got assigned with relationship manager but after the initial days of calls from her, i stopped picking them as her suggestions were not suiting me and i enjoyed the process of searching on my own. After some days they too stopped calling as i made it clear that i dont want to have a call but asked her to msg in the app itself so she used to send her suggestions. I shortlisted some properties and they arranged for site visits too which i have visited and spoke to the owners living there. I didn't feel there is an issue with fake listings or at least not done deliberately by NB. I agree with the spam and repeated calls, that is the biggest issue i faced with them I still use nb, as a person who just likes to window shop houses, NB is my Instagram No Broker paid plan is crap. I had 1 firm requirement: a house within 5 kms of my kids school. They literally could not give me any leads despite there being multiple 300-3000 flat apartment complexes being in the vicinity, and user generated listings for the same coming up on their own platform. They kept on trying to convince us to change the locality to some place else, without consideration for my one non negotiable requirement. Refund was in form of credit which we never managed to use. Yeah, except gambling is still considered a product. A very profitable one...that's why almost no casino in the world runs on a loss. So they have an actual working model. What you're arguing is the ethics of the product, that i agree that is bad. There's a reason Dream11 is profitable and Byju's is losing money. I tried finding an apartment through them 6 years back. Same experience. NoBroker means \"We only are the Broker\" Take a problem, aggregate it, put a nice-looking UI over it. seems to be the mantra of all startups. No effort to actually solve the problem “If I speak I’m in big trouble” Please don't pay NoBroker a single paise. Anything free from them is all its worth. No one. I repeat, No one has benefitted from NoBroker paid plans other than NoBroker themselves."
}