{
    "id": "16fnmyo",
    "title": "Article on Religious Extremism in The Hindu",
    "url": "https://i.redd.it/a85rzeqciknb1.png",
    "selftext": "This needs to be highlighted. Both the author and the organization. My promoting moderate thought instead of hardline ideas, it is a good counter to the propaganda of 'Muslims are all conservative'.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694412522.0,
    "convurl": "https://i.redd.it/a85rzeqciknb1.png",
    "comments": [
        "The Hindu, page 6, 11th September 2023, Kozhikode.",
        "Hopefully something like this can be written by our Indian Hindu organization on regular lynching of Indian Muslims, demolition of their homes, discrimination in jobs.",
        "Seriously need some big Hindu organization promoting moderate to thought. Acharya Prashant among others can head it.",
        "What did people expect when they let a monster grow unchecked,  if from an early age religion was kept in shackles we wouldn't have reached such shitty reality,  people never questioned it they simply followed it like idiots,  and now the same religion that was could probably have been used as a way to bring hope n peace to people,  all it does is provides shelter and justification to murders, pedos and rapist \n\n\nOver the ages religion became a center of huge power because people were too much of a weakling to let it go , to change with time ,  look at how deeply this shit is rooted in middle eastern and Indian subcontinent region,  both islamic and hindusim,   christianity started dying long time ago. Now we have these 2 remaining relics of the past. The former was always violent and the later has started following in the footsteps of the former because why not.\n\nAs long as religion is protected by their stupid followers nothing will change ,   the vocal minority in these religions will keep causing such incidents again and again and again.",
        ">Acharya Prashant\n\nWho is this?",
        "Sure but if we don't encourage change and villify every single action people within the religion take including the good ones, then you will be doing nothing but yelling at clouds. With only 7% of the world population being atheist, i can confidently say religion won't disappear anytime.",
        "Re think Theology. Moment people give up religion, Santana darma, Sankakara darma etc, the path is clear. Work hard. Don't waste time talking about old stories.\n\nBut people are scared to work hard. So they hide behind past glory (which is not even true).",
        "The last paragraph completely misses the point. Books written by humans, such as laws and constitutions of democratic societies, absolutely need to overwrite any book that claims to come from an extraterrestrial power. No one in present has any control over any verse in old books, there is no way to change what is written there as people’s idea of justice evolves.",
        "a spiritualist. Go check his videos"
    ],
    "cleaned_text": "article religious extremism hindu needs highlighted author organization promoting moderate thought instead hardline ideas good counter propaganda muslims conservative ",
    "cleaned_title": "article religious extremism hindu",
    "cleaned_selftext": "needs highlighted author organization promoting moderate thought instead hardline ideas good counter propaganda muslims conservative",
    "cleaned_comments": "hindu page th september kozhikode hopefully something like written indian hindu organization regular lynching indian muslims demolition homes discrimination jobs seriously need big hindu organization promoting moderate thought acharya prashant among others head people expect let monster grow unchecked early age religion kept shackles wouldnt reached shitty reality people never questioned simply followed like idiots religion could probably used way bring hope n peace people provides shelter justification murders pedos rapist ages religion became center huge power people much weakling let go change time look deeply shit rooted middle eastern indian subcontinent region islamic hindusim christianity started dying long time ago remaining relics past former always violent later started following footsteps former long religion protected stupid followers nothing change vocal minority religions keep causing incidents acharya prashant sure dont encourage change villify every single action people within religion take including good ones nothing yelling clouds world population atheist confidently say religion wont disappear anytime think theology moment people give religion santana darma sankakara darma etc path clear work hard dont waste time talking old stories people scared work hard hide behind past glory even true last paragraph completely misses point books written humans laws constitutions democratic societies absolutely need overwrite book claims come extraterrestrial power one present control verse old books way change written peoples idea justice evolves spiritualist go check videos",
    "light_cleaned_title": "Article on Religious Extremism in The Hindu",
    "light_cleaned_selftext": "This needs to be highlighted. Both the author and the organization. My promoting moderate thought instead of hardline ideas, it is a good counter to the propaganda of 'Muslims are all conservative'.",
    "light_cleaned_comments": "The Hindu, page 6, 11th September 2023, Kozhikode. Hopefully something like this can be written by our Indian Hindu organization on regular lynching of Indian Muslims, demolition of their homes, discrimination in jobs. Seriously need some big Hindu organization promoting moderate to thought. Acharya Prashant among others can head it. What did people expect when they let a monster grow unchecked, if from an early age religion was kept in shackles we wouldn't have reached such shitty reality, people never questioned it they simply followed it like idiots, and now the same religion that was could probably have been used as a way to bring hope n peace to people, all it does is provides shelter and justification to murders, pedos and rapist Over the ages religion became a center of huge power because people were too much of a weakling to let it go , to change with time , look at how deeply this shit is rooted in middle eastern and Indian subcontinent region, both islamic and hindusim, christianity started dying long time ago. Now we have these 2 remaining relics of the past. The former was always violent and the later has started following in the footsteps of the former because why not. As long as religion is protected by their stupid followers nothing will change , the vocal minority in these religions will keep causing such incidents again and again and again. >Acharya Prashant Who is this? Sure but if we don't encourage change and villify every single action people within the religion take including the good ones, then you will be doing nothing but yelling at clouds. With only 7% of the world population being atheist, i can confidently say religion won't disappear anytime. Re think Theology. Moment people give up religion, Santana darma, Sankakara darma etc, the path is clear. Work hard. Don't waste time talking about old stories. But people are scared to work hard. So they hide behind past glory (which is not even true). The last paragraph completely misses the point. Books written by humans, such as laws and constitutions of democratic societies, absolutely need to overwrite any book that claims to come from an extraterrestrial power. No one in present has any control over any verse in old books, there is no way to change what is written there as people’s idea of justice evolves. a spiritualist. Go check his videos"
}