{
    "id": "1e8ojqu",
    "title": "Why Are We Neglecting Our Ancient Heritage? A Comparison of Bhimbetka and Lascaux cave paintings.",
    "url": "https://www.reddit.com/gallery/1e8ojqu",
    "selftext": "I recently toured Bhimbetka rock shelters paintings near Bhopal, India. It was magical seeing ancient cave art at such a picturesque site, where tall rocks litter the area as if a fake Hollywood movie set.\n\nHowever compared to Lascaux caves in France, it’s quite a stark contrast. Bhimbetka, despite its valuable historical significance, is in a very sorry state due to poor maintenance and lack of proper conservation efforts. Only a very few paintings remain visible while most have fadded due to time or due to local tourism.\n\nSadly locals have no respect for the paintings or it's historic significance instead they find value in capturing selfies with beauty of rocks. They can be seen mostly taking selfies standing on rocks, standing inside restricted areas or touching the rare cave art, walking on and climbing over anything they can climb on for a few selfies. The worst part was seeing Indian signature writings of lovebirds writing their names on rock walls all over the site.\n\nCompared to this the Lascaux caves have been preserved meticulously, with restricted access and advanced preservation methods. Certainly France has taken it seriously. They even have a mockup of the original instead of direct access to actual site, for better preservation.\n\nAlthough good efforts have been made to make the site accessible compared to before, it's a different story for preservation of the actual paintings, . Over half have completely fadded, most are accessible to public hands and are missing and the design of the site is more like a tourist site.\n\nIt’s sad to see our ancient heritage being neglected and completely disrespected by the general public and failed preservation efforts by authorities while other countries manage to preserve their historical treasures so well. \n\nWe really need to think deep for safeguarding ancient sites like Bhimbetka for future \"educated\" generation.\n\nDon't make our history a mere tourist space, educate the public before letting them enter the site, guide the newspaper media to not promote the site as a mere tourist spot, and better preservation efforts are expected from archalogiacal authority of the site.",
    "flair": "Rant / Vent",
    "score": 23,
    "num_comments": 0,
    "created_utc": 1721574863.0,
    "convurl": "https://i.redd.it/bqgd5qrx1wdd1.jpg",
    "comments": [],
    "cleaned_text": "neglecting ancient heritage comparison bhimbetka lascaux cave paintings recently toured bhimbetka rock shelters paintings near bhopal india magical seeing ancient cave art picturesque site tall rocks litter area fake hollywood movie set however compared lascaux caves france quite stark contrast bhimbetka despite valuable historical significance sorry state due poor maintenance lack proper conservation efforts paintings remain visible fadded due time due local tourism sadly locals respect paintings historic significance instead find value capturing selfies beauty rocks seen mostly taking selfies standing rocks standing inside restricted areas touching rare cave art walking climbing anything climb selfies worst part seeing indian signature writings lovebirds writing names rock walls site compared lascaux caves preserved meticulously restricted access advanced preservation methods certainly france taken seriously even mockup original instead direct access actual site better preservation although good efforts made make site accessible compared different story preservation actual paintings half completely fadded accessible public hands missing design site like tourist site sad see ancient heritage neglected completely disrespected general public failed preservation efforts authorities countries manage preserve historical treasures well really need think deep safeguarding ancient sites like bhimbetka future educated generation dont make history mere tourist space educate public letting enter site guide newspaper media promote site mere tourist spot better preservation efforts expected archalogiacal authority site ",
    "cleaned_title": "neglecting ancient heritage comparison bhimbetka lascaux cave paintings",
    "cleaned_selftext": "recently toured bhimbetka rock shelters paintings near bhopal india magical seeing ancient cave art picturesque site tall rocks litter area fake hollywood movie set however compared lascaux caves france quite stark contrast bhimbetka despite valuable historical significance sorry state due poor maintenance lack proper conservation efforts paintings remain visible fadded due time due local tourism sadly locals respect paintings historic significance instead find value capturing selfies beauty rocks seen mostly taking selfies standing rocks standing inside restricted areas touching rare cave art walking climbing anything climb selfies worst part seeing indian signature writings lovebirds writing names rock walls site compared lascaux caves preserved meticulously restricted access advanced preservation methods certainly france taken seriously even mockup original instead direct access actual site better preservation although good efforts made make site accessible compared different story preservation actual paintings half completely fadded accessible public hands missing design site like tourist site sad see ancient heritage neglected completely disrespected general public failed preservation efforts authorities countries manage preserve historical treasures well really need think deep safeguarding ancient sites like bhimbetka future educated generation dont make history mere tourist space educate public letting enter site guide newspaper media promote site mere tourist spot better preservation efforts expected archalogiacal authority site",
    "cleaned_comments": "",
    "light_cleaned_title": "Why Are We Neglecting Our Ancient Heritage? A Comparison of Bhimbetka and Lascaux cave paintings.",
    "light_cleaned_selftext": "I recently toured Bhimbetka rock shelters paintings near Bhopal, India. It was magical seeing ancient cave art at such a picturesque site, where tall rocks litter the area as if a fake Hollywood movie set. However compared to Lascaux caves in France, it’s quite a stark contrast. Bhimbetka, despite its valuable historical significance, is in a very sorry state due to poor maintenance and lack of proper conservation efforts. Only a very few paintings remain visible while most have fadded due to time or due to local tourism. Sadly locals have no respect for the paintings or it's historic significance instead they find value in capturing selfies with beauty of rocks. They can be seen mostly taking selfies standing on rocks, standing inside restricted areas or touching the rare cave art, walking on and climbing over anything they can climb on for a few selfies. The worst part was seeing Indian signature writings of lovebirds writing their names on rock walls all over the site. Compared to this the Lascaux caves have been preserved meticulously, with restricted access and advanced preservation methods. Certainly France has taken it seriously. They even have a mockup of the original instead of direct access to actual site, for better preservation. Although good efforts have been made to make the site accessible compared to before, it's a different story for preservation of the actual paintings, . Over half have completely fadded, most are accessible to public hands and are missing and the design of the site is more like a tourist site. It’s sad to see our ancient heritage being neglected and completely disrespected by the general public and failed preservation efforts by authorities while other countries manage to preserve their historical treasures so well. We really need to think deep for safeguarding ancient sites like Bhimbetka for future \"educated\" generation. Don't make our history a mere tourist space, educate the public before letting them enter the site, guide the newspaper media to not promote the site as a mere tourist spot, and better preservation efforts are expected from archalogiacal authority of the site.",
    "light_cleaned_comments": ""
}