{
    "id": "kns1rm",
    "title": "How we did economically in the past decade (very simplistic calculation)",
    "url": "https://www.reddit.com/r/india/comments/kns1rm/how_we_did_economically_in_the_past_decade_very/",
    "selftext": "Over the past decade, India's GDP has grown by close to 1 trillion $. Not as much as I (or most other projections) expected it to grow, but none of us could predict that things like demonetization would happen.\n\nInternational economic organizations predict a growth rate of about 6 percent per year for the country over the next decade. This is close to what we got over the past 10 years.\n\n(Note: the 6 percent is in constant prices while the next sections are in current prices, and the next section is in rupees, not $, so the discounting of INR is also something to keep in mind).\n\nThere is rising inequality by state within the country. The states with some of the lowest per capita incomes have the lowest growth rates (which is unusual). Reports like CRISILs state of state 2.0 highlight this fact. There aren't too many projections I could find so I made a dumb projection that maps the next decade with the same yearly rate of growth as the current one. The states close to or containing the metros do exceptionally, as expected.\n\nI would like to do a more thorough analysis with some additional parameters for education, population and income, but have no time. This is also what some newspapers like TOI did, so please spare me that.\n\n[Per capita GSDP, growth rate and projection ](https://preview.redd.it/ml76dleiij861.png?width=1127&amp;format=png&amp;auto=webp&amp;s=e62ed1945e63fd57a6a02226f94a3560eed33e1d)",
    "flair": "Policy/Economy",
    "score": 17,
    "num_comments": 1,
    "created_utc": 1609428956,
    "convurl": "https://b.thumbs.redditmedia.com/SFDNzqyClGj6520ZHssO3xf_MlJllpDSC_LI9jv1kao.jpg",
    "comments": [
        "Good analysis. Do it for last 5 years."
    ],
    "cleaned_text": "economically past decade simplistic calculation past decade indias gdp grown close trillion much projections expected grow none us could predict things like demonetization would happen international economic organizations predict growth rate percent per year country next decade close got past years note percent constant prices next sections current prices next section rupees discounting inr also something keep mind rising inequality state within country states lowest per capita incomes lowest growth rates unusual reports like crisils state state highlight fact arent many projections could find made dumb projection maps next decade yearly rate growth current one states close containing metros exceptionally expected would like thorough analysis additional parameters education population income time also newspapers like toi please spare per capita gsdp growth rate projection httpspreviewredditmldleiijpngwidthampformatpngampautowebpampseedefdaafaeeded ",
    "cleaned_title": "economically past decade simplistic calculation",
    "cleaned_selftext": "past decade indias gdp grown close trillion much projections expected grow none us could predict things like demonetization would happen international economic organizations predict growth rate percent per year country next decade close got past years note percent constant prices next sections current prices next section rupees discounting inr also something keep mind rising inequality state within country states lowest per capita incomes lowest growth rates unusual reports like crisils state state highlight fact arent many projections could find made dumb projection maps next decade yearly rate growth current one states close containing metros exceptionally expected would like thorough analysis additional parameters education population income time also newspapers like toi please spare per capita gsdp growth rate projection httpspreviewredditmldleiijpngwidthampformatpngampautowebpampseedefdaafaeeded",
    "cleaned_comments": "good analysis last years",
    "light_cleaned_title": "How we did economically in the past decade (very simplistic calculation)",
    "light_cleaned_selftext": "Over the past decade, India's GDP has grown by close to 1 trillion $. Not as much as I (or most other projections) expected it to grow, but none of us could predict that things like demonetization would happen. International economic organizations predict a growth rate of about 6 percent per year for the country over the next decade. This is close to what we got over the past 10 years. (Note: the 6 percent is in constant prices while the next sections are in current prices, and the next section is in rupees, not $, so the discounting of INR is also something to keep in mind). There is rising inequality by state within the country. The states with some of the lowest per capita incomes have the lowest growth rates (which is unusual). Reports like CRISILs state of state 2.0 highlight this fact. There aren't too many projections I could find so I made a dumb projection that maps the next decade with the same yearly rate of growth as the current one. The states close to or containing the metros do exceptionally, as expected. I would like to do a more thorough analysis with some additional parameters for education, population and income, but have no time. This is also what some newspapers like TOI did, so please spare me that. [Per capita GSDP, growth rate and projection ](https://preview.redd.it/ml76dleiij861.png?width=1127&amp;format=png&amp;auto=webp&amp;s=e62ed1945e63fd57a6a02226f94a3560eed33e1d)",
    "light_cleaned_comments": "Good analysis. Do it for last 5 years."
}