{
    "id": "17l233t",
    "title": "Did you link your Aadhaar with your Passport and/or your Voter ID? Then read this.",
    "url": "https://www.reddit.com/r/india/comments/17l233t/did_you_link_your_aadhaar_with_your_passport/",
    "selftext": "Did you link your Aadhaar to your passport and/or your voter ID? (Neither of which are mandatory, as per the Sep'2018 judgement of the Hon'ble Supreme Court of India). Then know this: **There is a massive data breach, where the PII (Personally Identifiable Information) is up for sale on the darkweb - including your Aadhaar, Passport and Voter ID**\n\n### October 31st, 2023\n1. [Back Back\nAadhaar data leak: Massive data breach exposes about 81 crore Indians' personal information on dark web. Details here](https://www.livemint.com/news/india/aadhaar-data-leak-massive-data-breach-exposes-815-million-indians-personal-information-on-dark-web-details-here-11698712793223.html)\n2. [Data Breach: Aadhaar And Passport Details Of 815 Million Indians Listed For Sale](https://www.medianama.com/2023/10/223-aadhaar-815-million-indian-data-breach/)\n3. [Massive dark web data leak exposes India to digital identity theft and financial scams, warns Resecurity](https://www.cnbctv18.com/technology/massive-dark-web-data-leak-exposes-india-to-digital-identity-theft-and-financial-scams-warns-resecurity-18196331.htm)\n\nIt is very likely that you are one among the 81.5 crore Indians, who linked your Aadhaar with your Passport and/or your Voter ID, whose personal data is on sale on the dark web. This breach exposes 81.5 crore Indians to **IDENTITY THEFT**, which is **irreversible**\n\n## Related links to old news articles from credible sources of news\n\n### September 26, 2018\n[What Supreme Court’s Aadhaar verdict means for you: 10 points](https://www.livemint.com/Companies/cpSHu1fjQ1WvOP8vMi27aL/What-Supreme-Courts-Aadhaar-verdict-means-for-you-10-point.html)\n\n> - A 5-member constitution bench of the Supreme Court led by Chief Justice Dipak Misra ruled that Aadhaar is mandatory for filing of income tax returns (ITR) and allotment of Permanent Account Number (PAN). So if you are a tax payer or want a PAN card then you cannot run away from Aadhaar.\n> - Aadhaar authentication for bank accounts is now a thing of the past.\n> - To buy a new SIM card, your telecom service provider cannot seek Aadhaar details from you.\n> - Students of CBSE, NEET, UGC also do not require Aadhaar number to appear in exams. Even schools cannot seek Aadhaar card for admissions.\n> - The Supreme Court has made exception for children saying that no child can be denied benefits of any scheme if he or she doesn’t have Aadhaar card.\"\n> - The apex court has struck down Section 57 of the Aadhaar Act as “unconstitutional\". This means that no company or private entity can seek Aadhaar identification from you.\n> - The constitution bench of the top court has also struck down the national security exception under the Aadhaar Act. This will indirectly ensure greater privacy of individual’s Aadhaar data while restricting the government accessibility to it.\n\nThe push to link Aadhaar with Voter ID came from the Law Ministry of the Union Government.\n\n### March 5, 2020\n> @the_hindu\n> The Law Ministry has informed the Lok Sabha that it has a proposal from the Election Commission (EC) to link the Aadhaar card with the Election Photo Identity Card (EPIC) to prepare an error free electoral roll.\n> Aadhar LokSabha\n- [EC moots linking Aadhaar with voter ID, Law ministry tells LS](https://www.thehindu.com/news/national/ec-moots-linking-aadhaar-with-voter-id-law-ministry-tells-ls/article30992455.ece?homepage=true)\n- [Link to above tweet](https://x.com/the_hindu/status/1235589093037400064?s=20)",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698805578.0,
    "convurl": "https://external-preview.redd.it/9K23lK8Ce2ZE46vz6WP76HYbPaqanGKOTMU_yenPFDA.jpg?auto=webp&s=ab743c2fab36a6877265e24b67a0a131dfb00a27",
    "comments": [],
    "cleaned_text": "link aadhaar passport andor voter id read link aadhaar passport andor voter id neither mandatory per sep judgement honble supreme court india know massive data breach pii personally identifiable information sale darkweb including aadhaar passport voter id october st back back aadhaar data leak massive data breach exposes crore indians personal information dark web details herehttpswwwlivemintcomnewsindiaaadhaardataleakmassivedatabreachexposesmillionindianspersonalinformationondarkwebdetailsherehtml data breach aadhaar passport details million indians listed salehttpswwwmedianamacomaadhaarmillionindiandatabreach massive dark web data leak exposes india digital identity theft financial scams warns resecurityhttpswwwcnbctvcomtechnologymassivedarkwebdataleakexposesindiatodigitalidentitytheftandfinancialscamswarnsresecurityhtm likely one among crore indians linked aadhaar passport andor voter id whose personal data sale dark web breach exposes crore indians identity theft irreversible related links old news articles credible sources news september supreme courts aadhaar verdict means pointshttpswwwlivemintcomcompaniescpshufjqwvopvmialwhatsupremecourtsaadhaarverdictmeansforyoupointhtml member constitution bench supreme court led chief justice dipak misra ruled aadhaar mandatory filing income tax returns itr allotment permanent account number pan tax payer want pan card run away aadhaar aadhaar authentication bank accounts thing past buy new sim card telecom service provider seek aadhaar details students cbse neet ugc also require aadhaar number appear exams even schools seek aadhaar card admissions supreme court made exception children saying child denied benefits scheme doesnt aadhaar card apex court struck section aadhaar act unconstitutional means company private entity seek aadhaar identification constitution bench top court also struck national security exception aadhaar act indirectly ensure greater privacy individuals aadhaar data restricting government accessibility push link aadhaar voter id came law ministry union government march thehindu law ministry informed lok sabha proposal election commission ec link aadhaar card election photo identity card epic prepare error free electoral roll aadhar loksabha ec moots linking aadhaar voter id law ministry tells lshttpswwwthehinducomnewsnationalecmootslinkingaadhaarwithvoteridlawministrytellslsarticleecehomepagetrue link tweethttpsxcomthehindustatuss ",
    "cleaned_title": "link aadhaar passport andor voter id read",
    "cleaned_selftext": "link aadhaar passport andor voter id neither mandatory per sep judgement honble supreme court india know massive data breach pii personally identifiable information sale darkweb including aadhaar passport voter id october st back back aadhaar data leak massive data breach exposes crore indians personal information dark web details herehttpswwwlivemintcomnewsindiaaadhaardataleakmassivedatabreachexposesmillionindianspersonalinformationondarkwebdetailsherehtml data breach aadhaar passport details million indians listed salehttpswwwmedianamacomaadhaarmillionindiandatabreach massive dark web data leak exposes india digital identity theft financial scams warns resecurityhttpswwwcnbctvcomtechnologymassivedarkwebdataleakexposesindiatodigitalidentitytheftandfinancialscamswarnsresecurityhtm likely one among crore indians linked aadhaar passport andor voter id whose personal data sale dark web breach exposes crore indians identity theft irreversible related links old news articles credible sources news september supreme courts aadhaar verdict means pointshttpswwwlivemintcomcompaniescpshufjqwvopvmialwhatsupremecourtsaadhaarverdictmeansforyoupointhtml member constitution bench supreme court led chief justice dipak misra ruled aadhaar mandatory filing income tax returns itr allotment permanent account number pan tax payer want pan card run away aadhaar aadhaar authentication bank accounts thing past buy new sim card telecom service provider seek aadhaar details students cbse neet ugc also require aadhaar number appear exams even schools seek aadhaar card admissions supreme court made exception children saying child denied benefits scheme doesnt aadhaar card apex court struck section aadhaar act unconstitutional means company private entity seek aadhaar identification constitution bench top court also struck national security exception aadhaar act indirectly ensure greater privacy individuals aadhaar data restricting government accessibility push link aadhaar voter id came law ministry union government march thehindu law ministry informed lok sabha proposal election commission ec link aadhaar card election photo identity card epic prepare error free electoral roll aadhar loksabha ec moots linking aadhaar voter id law ministry tells lshttpswwwthehinducomnewsnationalecmootslinkingaadhaarwithvoteridlawministrytellslsarticleecehomepagetrue link tweethttpsxcomthehindustatuss",
    "cleaned_comments": "",
    "light_cleaned_title": "Did you link your Aadhaar with your Passport and/or your Voter ID? Then read this.",
    "light_cleaned_selftext": "Did you link your Aadhaar to your passport and/or your voter ID? (Neither of which are mandatory, as per the Sep'2018 judgement of the Hon'ble Supreme Court of India). Then know this: **There is a massive data breach, where the PII (Personally Identifiable Information) is up for sale on the darkweb - including your Aadhaar, Passport and Voter ID** ### October 31st, 2023 1. [Back Back Aadhaar data leak: Massive data breach exposes about 81 crore Indians' personal information on dark web. Details here](https://www.livemint.com/news/india/aadhaar-data-leak-massive-data-breach-exposes-815-million-indians-personal-information-on-dark-web-details-here-11698712793223.html) 2. [Data Breach: Aadhaar And Passport Details Of 815 Million Indians Listed For Sale](https://www.medianama.com/2023/10/223-aadhaar-815-million-indian-data-breach/) 3. [Massive dark web data leak exposes India to digital identity theft and financial scams, warns Resecurity](https://www.cnbctv18.com/technology/massive-dark-web-data-leak-exposes-india-to-digital-identity-theft-and-financial-scams-warns-resecurity-18196331.htm) It is very likely that you are one among the 81.5 crore Indians, who linked your Aadhaar with your Passport and/or your Voter ID, whose personal data is on sale on the dark web. This breach exposes 81.5 crore Indians to **IDENTITY THEFT**, which is **irreversible** ## Related links to old news articles from credible sources of news ### September 26, 2018 [What Supreme Court’s Aadhaar verdict means for you: 10 points](https://www.livemint.com/Companies/cpSHu1fjQ1WvOP8vMi27aL/What-Supreme-Courts-Aadhaar-verdict-means-for-you-10-point.html) > - A 5-member constitution bench of the Supreme Court led by Chief Justice Dipak Misra ruled that Aadhaar is mandatory for filing of income tax returns (ITR) and allotment of Permanent Account Number (PAN). So if you are a tax payer or want a PAN card then you cannot run away from Aadhaar. > - Aadhaar authentication for bank accounts is now a thing of the past. > - To buy a new SIM card, your telecom service provider cannot seek Aadhaar details from you. > - Students of CBSE, NEET, UGC also do not require Aadhaar number to appear in exams. Even schools cannot seek Aadhaar card for admissions. > - The Supreme Court has made exception for children saying that no child can be denied benefits of any scheme if he or she doesn’t have Aadhaar card.\" > - The apex court has struck down Section 57 of the Aadhaar Act as “unconstitutional\". This means that no company or private entity can seek Aadhaar identification from you. > - The constitution bench of the top court has also struck down the national security exception under the Aadhaar Act. This will indirectly ensure greater privacy of individual’s Aadhaar data while restricting the government accessibility to it. The push to link Aadhaar with Voter ID came from the Law Ministry of the Union Government. ### March 5, 2020 > @the_hindu > The Law Ministry has informed the Lok Sabha that it has a proposal from the Election Commission (EC) to link the Aadhaar card with the Election Photo Identity Card (EPIC) to prepare an error free electoral roll. > Aadhar LokSabha - [EC moots linking Aadhaar with voter ID, Law ministry tells LS](https://www.thehindu.com/news/national/ec-moots-linking-aadhaar-with-voter-id-law-ministry-tells-ls/article30992455.ece?homepage=true) - [Link to above tweet](https://x.com/the_hindu/status/1235589093037400064?s=20)",
    "light_cleaned_comments": ""
}