{
    "id": "1e5cory",
    "title": "Hindutva mob attacks Christian prayer meet in Dehradun",
    "url": "https://i.redd.it/4xd51cmsd1dd1.png",
    "selftext": "A video of the incident reviewed by Newslaundry showed a group of men vandalising a cross podium and musical equipment in a room, and engaging in assault. \n\n“They misbehaved with the children too. They slapped their heads and asked them why do you participate in this prayer? They told them to never take part in Sunday prayers in future,” he said about the incident which took place on July 14\n\n\nhttps://www.newslaundry.com/2024/07/16/hindutva-mob-targets-christian-prayer-meet-dehradun-house-vandalised-7-assaulted",
    "flair": "Crime",
    "score": 94,
    "num_comments": 17,
    "created_utc": 1721203540.0,
    "convurl": "https://i.redd.it/4xd51cmsd1dd1.png",
    "comments": [
        "Despite our 21st century media, newspapers, cameras, police, judiciary, democracy, a bit of formal education for all, and global criticism, these conservative Hindus carry this much impunity and hate.\n\nMakes me wonder what all really happened across ancient and medieval India on a day to day basis. I wonder what really happened to Buddhism in India.",
        ">Despite our 21st century media, newspapers, cameras, police, judiciary, democracy, some formal education for most people, and global criticism, these conservative Hindus carry this much impunity and hate.\n\nRead what happened in Kandhamal and then talk about conservative Hindus. Aadha adhura dekh ke gyan chodne aa jaate hain idhar.\n\n>Makes me wonder what all really happened across ancient and medieval India on a day to day basis. I wonder what really happened to Buddhism in India.\n\nThey were intellectually inferior and lost to Aastikas in Shastrarthas.",
        "\"Hindu Khatre mein hah\" hah Khud Hindu se.",
        "You are intellectually inferior if you think acting like this on the basis of something that happened centuries ago is justified",
        "Don’t blame the hindus bro. Its just the goons that need to be controlled here. If only we had a good government",
        "Aaah yes. Welcome to Godijis India where anything other than one religion gets to eat shit.",
        "Hey, what happened to Hindus-Christians united in hate against Muslims? That was a big RSS push a couple of months back.",
        "Only works in states where Christians are more than 5% of population, like Goa, Kerala, northeast etc.\n\nIn states like Odisha, Chhattisgarh, Andhra, Karnataka, Punjab, Jharkhand etc. Christians are targeted.",
        "Yesterday a mosque, today a prayer meet. Tomorrow who?",
        "Khandamal? You mean anti Christian violence where Graham steins was burnt alive by the mob?",
        "This is what present day nationalism is in our country.",
        ">Don’t blame the hindus bro.\n\nI am not! See my name and you will know what side I belong to.\n\n>If only we had a good government\n\nTrue!",
        "What centuries ago? Swami Laxmananda Saraswati and his entourage were murdered by Christians in 2008! That too on the day of Janmashtami!!",
        "Don't dude, it's not ok to be harbouring hatred for an entire community for an alleged crime, bring more proof if you're insinuating that Christianity itself is murderous \nWhoever that guy is probably had it coming btw",
        "Alleged crimes? There are people who celebrate it claiming to be the power of Christ. You are very unaware about things!\n\n>bring more proof if you're insinuating that Christianity itself is murderous\n\nLook up inquisitions. I am not going to do your work for you.\n\n>Whoever that guy is probably had it coming btw\n\nI have never seen someone justifying the murder of a monk and his entourage like this. Amazing! You sound just like those terrorists."
    ],
    "cleaned_text": "hindutva mob attacks christian prayer meet dehradun video incident reviewed newslaundry showed group men vandalising cross podium musical equipment room engaging assault misbehaved children slapped heads asked participate prayer told never take part sunday prayers future said incident took place july ",
    "cleaned_title": "hindutva mob attacks christian prayer meet dehradun",
    "cleaned_selftext": "video incident reviewed newslaundry showed group men vandalising cross podium musical equipment room engaging assault misbehaved children slapped heads asked participate prayer told never take part sunday prayers future said incident took place july",
    "cleaned_comments": "despite st century media newspapers cameras police judiciary democracy bit formal education global criticism conservative hindus carry much impunity hate makes wonder really happened across ancient medieval india day day basis wonder really happened buddhism india despite st century media newspapers cameras police judiciary democracy formal education people global criticism conservative hindus carry much impunity hate read happened kandhamal talk conservative hindus aadha adhura dekh ke gyan chodne aa jaate hain idhar makes wonder really happened across ancient medieval india day day basis wonder really happened buddhism india intellectually inferior lost aastikas shastrarthas hindu khatre mein hah hah khud hindu se intellectually inferior think acting like basis something happened centuries ago justified dont blame hindus bro goons need controlled good government aaah yes welcome godijis india anything one religion gets eat shit hey happened hinduschristians united hate muslims big rss push couple months back works states christians population like goa kerala northeast etc states like odisha chhattisgarh andhra karnataka punjab jharkhand etc christians targeted yesterday mosque today prayer meet tomorrow khandamal mean anti christian violence graham steins burnt alive mob present day nationalism country dont blame hindus bro see name know side belong good government true centuries ago swami laxmananda saraswati entourage murdered christians day janmashtami dont dude ok harbouring hatred entire community alleged crime bring proof youre insinuating christianity murderous whoever guy probably coming btw alleged crimes people celebrate claiming power christ unaware things bring proof youre insinuating christianity murderous look inquisitions going work whoever guy probably coming btw never seen someone justifying murder monk entourage like amazing sound like terrorists",
    "light_cleaned_title": "Hindutva mob attacks Christian prayer meet in Dehradun",
    "light_cleaned_selftext": "A video of the incident reviewed by Newslaundry showed a group of men vandalising a cross podium and musical equipment in a room, and engaging in assault. “They misbehaved with the children too. They slapped their heads and asked them why do you participate in this prayer? They told them to never take part in Sunday prayers in future,” he said about the incident which took place on July 14",
    "light_cleaned_comments": "Despite our 21st century media, newspapers, cameras, police, judiciary, democracy, a bit of formal education for all, and global criticism, these conservative Hindus carry this much impunity and hate. Makes me wonder what all really happened across ancient and medieval India on a day to day basis. I wonder what really happened to Buddhism in India. >Despite our 21st century media, newspapers, cameras, police, judiciary, democracy, some formal education for most people, and global criticism, these conservative Hindus carry this much impunity and hate. Read what happened in Kandhamal and then talk about conservative Hindus. Aadha adhura dekh ke gyan chodne aa jaate hain idhar. >Makes me wonder what all really happened across ancient and medieval India on a day to day basis. I wonder what really happened to Buddhism in India. They were intellectually inferior and lost to Aastikas in Shastrarthas. \"Hindu Khatre mein hah\" hah Khud Hindu se. You are intellectually inferior if you think acting like this on the basis of something that happened centuries ago is justified Don’t blame the hindus bro. Its just the goons that need to be controlled here. If only we had a good government Aaah yes. Welcome to Godijis India where anything other than one religion gets to eat shit. Hey, what happened to Hindus-Christians united in hate against Muslims? That was a big RSS push a couple of months back. Only works in states where Christians are more than 5% of population, like Goa, Kerala, northeast etc. In states like Odisha, Chhattisgarh, Andhra, Karnataka, Punjab, Jharkhand etc. Christians are targeted. Yesterday a mosque, today a prayer meet. Tomorrow who? Khandamal? You mean anti Christian violence where Graham steins was burnt alive by the mob? This is what present day nationalism is in our country. >Don’t blame the hindus bro. I am not! See my name and you will know what side I belong to. >If only we had a good government True! What centuries ago? Swami Laxmananda Saraswati and his entourage were murdered by Christians in 2008! That too on the day of Janmashtami!! Don't dude, it's not ok to be harbouring hatred for an entire community for an alleged crime, bring more proof if you're insinuating that Christianity itself is murderous Whoever that guy is probably had it coming btw Alleged crimes? There are people who celebrate it claiming to be the power of Christ. You are very unaware about things! >bring more proof if you're insinuating that Christianity itself is murderous Look up inquisitions. I am not going to do your work for you. >Whoever that guy is probably had it coming btw I have never seen someone justifying the murder of a monk and his entourage like this. Amazing! You sound just like those terrorists."
}