{
    "id": "14asn1q",
    "title": "24 hours to go, we’re nearly there! You’ve helped us meet 90% of our target!",
    "url": "https://www.reddit.com/r/india/comments/14asn1q/24_hours_to_go_were_nearly_there_youve_helped_us/",
    "selftext": "&#x200B;\n\nhttps://preview.redd.it/we8u4l9vqc6b1.png?width=1600&format=png&auto=webp&v=enabled&s=9103eb61309aad476986f37646d760d57f8cb5f4\n\nToday is the last day of our r/India fundraiser. We’ve been able to raise INR 1,79,450, nearly 90% of our 2 lakh goal. We know that it’s been a tough time for the Reddit community and we are so so grateful for the outpouring of support we have received! \n\n🔗 [https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/)\n\nr/India has been and continues to be a core part of the IFF community. Earlier this week, we [wrote](https://www.instagram.com/p/CtbtvFgS9LV/?utm_source=ig_web_copy_link&igshid=MzRlODBiNWFlZA==) about the changes to Reddit’s API access as thousands of subreddits went dark. Looking to the future, we will continue to play our part in preserving this community that has come to be so integral for our mission to safeguard digital rights. \n\nWe’re in the last 24 hours of our r/India fundraiser, and we are making one final push to reach our target. We will need to raise INR 20,550 to achieve our 2 lakh goal.Your contribution, no matter the size, will make a significant impact on our efforts. By donating today, you help to safeguard our digital rights. \n\n**Here’s what you’re supporting:**\n\n* This week, we launched a [joint report](https://www.hrw.org/report/2023/06/14/no-internet-means-no-work-no-pay-no-food/internet-shutdowns-deny-access-basic) with Human Rights Watch that documents the harm caused by internet shutdowns by denying access to basic rights and entitlements to marginalised communities. \n* Next week, we’re launching PlugTheBreach, a project by IFF that tracks and records instances of data breaches in India to raise awareness and promote transparency and accountability. Register for the launch [here](https://us06web.zoom.us/meeting/register/tZUuf-qorT0oHd1YgQRDUefPOVR-IcjcTr_y#/registration)!\n\n[https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/)\n\nTo donate or learn more about our cause, visit [https://internetfreedom.in/donate/](https://internetfreedom.in/donate/). \n\nYour support means the world to us. Thank you for being a part of our community and for your unwavering support",
    "flair": "Policy/Economy",
    "score": 87,
    "num_comments": 3,
    "created_utc": 1686909219.0,
    "convurl": "https://external-preview.redd.it/xl9312awVEalZfiWHSkovl6_1r_r8DisVbozR3L5xrg.jpg",
    "comments": [
        "Can an exemption under income tax claimed if donation done to you?",
        "Hello u/Select-Feedback-1833. IFF is registered under Section 80G of the Income Tax Act, and all donations are tax deductable, subject to the tax regime under which you pay your taxes. If you have any other questions reply to comment here or email us at [donate@internetfreedom.in](mailto:donate@internetfreedom.in) and we'll get back to you."
    ],
    "cleaned_text": "hours go nearly youve helped us meet target xb today last day rindia fundraiser weve able raise inr nearly lakh goal know tough time reddit community grateful outpouring support received httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff rindia continues core part iff community earlier week wrotehttpswwwinstagramcompctbtvfgslvutmsourceigwebcopylinkigshidmzrlodbinwflza changes reddits api access thousands subreddits went dark looking future continue play part preserving community come integral mission safeguard digital rights last hours rindia fundraiser making one final push reach target need raise inr achieve lakh goalyour contribution matter size make significant impact efforts donating today help safeguard digital rights heres youre supporting week launched joint reporthttpswwwhrworgreportnointernetmeansnoworknopaynofoodinternetshutdownsdenyaccessbasic human rights watch documents harm caused internet shutdowns denying access basic rights entitlements marginalised communities next week launching plugthebreach project iff tracks records instances data breaches india raise awareness promote transparency accountability register launch herehttpsuswebzoomusmeetingregistertzuufqortohdygqrduefpovricjctryregistration httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff donate learn cause visit httpsinternetfreedomindonatehttpsinternetfreedomindonate support means world us thank part community unwavering support ",
    "cleaned_title": "hours go nearly youve helped us meet target",
    "cleaned_selftext": "xb today last day rindia fundraiser weve able raise inr nearly lakh goal know tough time reddit community grateful outpouring support received httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff rindia continues core part iff community earlier week wrotehttpswwwinstagramcompctbtvfgslvutmsourceigwebcopylinkigshidmzrlodbinwflza changes reddits api access thousands subreddits went dark looking future continue play part preserving community come integral mission safeguard digital rights last hours rindia fundraiser making one final push reach target need raise inr achieve lakh goalyour contribution matter size make significant impact efforts donating today help safeguard digital rights heres youre supporting week launched joint reporthttpswwwhrworgreportnointernetmeansnoworknopaynofoodinternetshutdownsdenyaccessbasic human rights watch documents harm caused internet shutdowns denying access basic rights entitlements marginalised communities next week launching plugthebreach project iff tracks records instances data breaches india raise awareness promote transparency accountability register launch herehttpsuswebzoomusmeetingregistertzuufqortohdygqrduefpovricjctryregistration httpsinternetfreedominrindiaforiffhttpsinternetfreedominrindiaforiff donate learn cause visit httpsinternetfreedomindonatehttpsinternetfreedomindonate support means world us thank part community unwavering support",
    "cleaned_comments": "exemption income tax claimed donation done hello uselectfeedback iff registered section g income tax act donations tax deductable subject tax regime pay taxes questions reply comment email us donateinternetfreedominmailtodonateinternetfreedomin well get back",
    "light_cleaned_title": "24 hours to go, we’re nearly there! You’ve helped us meet 90% of our target!",
    "light_cleaned_selftext": "&#x200B; Today is the last day of our r/India fundraiser. We’ve been able to raise INR 1,79,450, nearly 90% of our 2 lakh goal. We know that it’s been a tough time for the Reddit community and we are so so grateful for the outpouring of support we have received! 🔗 [https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/) r/India has been and continues to be a core part of the IFF community. Earlier this week, we [wrote](https://www.instagram.com/p/CtbtvFgS9LV/?utm_source=ig_web_copy_link&igshid=MzRlODBiNWFlZA==) about the changes to Reddit’s API access as thousands of subreddits went dark. Looking to the future, we will continue to play our part in preserving this community that has come to be so integral for our mission to safeguard digital rights. We’re in the last 24 hours of our r/India fundraiser, and we are making one final push to reach our target. We will need to raise INR 20,550 to achieve our 2 lakh goal.Your contribution, no matter the size, will make a significant impact on our efforts. By donating today, you help to safeguard our digital rights. **Here’s what you’re supporting:** * This week, we launched a [joint report](https://www.hrw.org/report/2023/06/14/no-internet-means-no-work-no-pay-no-food/internet-shutdowns-deny-access-basic) with Human Rights Watch that documents the harm caused by internet shutdowns by denying access to basic rights and entitlements to marginalised communities. * Next week, we’re launching PlugTheBreach, a project by IFF that tracks and records instances of data breaches in India to raise awareness and promote transparency and accountability. Register for the launch [here](https://us06web.zoom.us/meeting/register/tZUuf-qorT0oHd1YgQRDUefPOVR-IcjcTr_y#/registration)! [https://internetfreedom.in/r-india-for-iff/](https://internetfreedom.in/r-india-for-iff/) To donate or learn more about our cause, visit [https://internetfreedom.in/donate/](https://internetfreedom.in/donate/). Your support means the world to us. Thank you for being a part of our community and for your unwavering support",
    "light_cleaned_comments": "Can an exemption under income tax claimed if donation done to you? Hello u/Select-Feedback-1833. IFF is registered under Section 80G of the Income Tax Act, and all donations are tax deductable, subject to the tax regime under which you pay your taxes. If you have any other questions reply to comment here or email us at [donate@internetfreedom.in](mailto:donate@internetfreedom.in) and we'll get back to you."
}