{
    "id": "15x0d8e",
    "title": "I got scammed of Rs. 76,000. I'm broken and suic*dal.",
    "url": "https://www.reddit.com/r/india/comments/15x0d8e/i_got_scammed_of_rs_76000_im_broken_and_suicdal/",
    "selftext": "I know this isn't the correct subreddit. But it's r/india and only place I can get help. Please mordertor don't remove this 🙏🥺\n\nI know you're gonna call me moron for what I did(gave OTP on open box) and I know I'm stupid because this was my first experience purchase. It's alot of money for my family and mom is crying her eyes out.\n\nProof in twitter:-\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)\n\nHere is story: I need your help. I ordered Macbook M1 from a website called as Flipkart. The price of laptop was 76000 rupees(on sale)\n\nOur initial order delivery date was 13th of August, but delivery guy did not pick up our call. On 15th of August he finally picked up our call. He asked us to come to Flipkart delivery hub, to receive our package because it will take him to more days to deliver our order.\n\nFor your information the item came under open delivery rule. That means you have to open the order before giving the OTP to delivery boy. The item also came under no refund policy, as it was an open box delivery.\n\nWhen we reached to the Flipkart hub. The delivery guy asked us to give OTP before opening the order and said it is a Flipkart protocol to get OTP before you can open your order. We gave him the OTP thinking that it's Flipkart rule. (I know I am dumb. You can call me that and even worse. I'm crying since th day). Delivery guy told us it's Flipkart Protocol, I have never ordered anything and laptop was for college. Everybody said I'm naive to order it from Flipkart I know! It was 14000 rs cheaper and it's alot of money for middle class family like me.\n\nAfter he took our OTP, he opened the box. When we saw inside there were some cheap speakers, cost of the speaker was 3000. We received a wrong and cheap order.\n\nPlease retweet 🥺\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)\n\n\nWe have few proof that I would like to state: I) We have the footage and evidence that we are standing in the Flipkart hub. ii) also capture the face of the Flipkart delivery executive. iii) we have footage of the delivery executive opening the box that means the delivery boy open the box and not us. Thearby eliminating the allegation that we mightve changed the item. iv) we took the confession of delivery boy admitting that we have received the wrong product. v) the cameras in the ekart hub might have captured the incident that the delivery guy ask us to give OTP before delivery our package. That means it was the delivery guy who asked us to give the OTP before handling us our package.(we also called him later and made him confess he took OTP first and recorded it)\n\nWe contacted the Flipkart authority. They denied giving us our refund as it came under no returns policy.\n\nI am new on Reddit. I do not know how it will help but please be my voice ▲ I can show you proof. Idk if can attach two videos here, I'll try! Please retweet my tweet A\n\nIdk how to send both link and video at the same time!\n\nCan you please retweet my tweet? I have provided video proof there\n\n(After posting tweet it doesn't send the Post) I'll give Twitter link in comments)\n\nI'm sending Twitter link to everyone in case they wanna help .\n\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)\n\nEdit: thank you for all your support ❤️ how can I ever pay gratitude to y'all for support? Thank you for all retweets and likes. and no Flipkart did not offered a refund yet but I see them being in pressure.\n\nYou all asked me for seller name it's :- TREASURE HAUL ONLINE\n\nEDIT:\nYAYYYYYYYY FLIPKART CALLED ME FOR REFUND 💖🥳🥳🥳🥳🥳 THANKS TO ALL OF YOU 🥺💖\n\nI'LL POST AN UPDATE WHEN THEY'LL ACTUALLY SEND ME MONEY ON 28TH 🥺💖💖💖",
    "flair": "Crime",
    "score": 1719,
    "num_comments": 390,
    "created_utc": 1692602759,
    "convurl": "https://external-preview.redd.it/FfiaiseFYoKk1vRBbwrwC1npnvCzETQjIbfFyVpdbS8.jpg?auto=webp&s=3e82b4e4726d525c3ee0f27460a54efe1e4a35b4",
    "comments": [
        "[Twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=qP-TU9BjQ_nTse9A2w48eg&s=19)",
        "Consumer court, and if you paid by credit card try a chargeback.",
        "Consumer court will take 3 to 6 months and I paid by UPI. I've already started a case in consumer court. They're not responding. The Flipkart",
        "You can easily get this resolved. Just reach consumer court and find a journalist who can publish this",
        "Please tell me how to find a journalist 🙏🥺",
        "A student with a credit card limit of Rs 76,000? Do you live in an alternate universe?",
        "Maybe its his parents creditcard.",
        "Are you stupid mate? He could have used his parents credit card to order it. A lot of times people use others credit cards to order stuff to avail discounts on Flipkart, Amazon.",
        "How many middle-class middle-aged parents have credit cards? Do you have statistics? ***Are you stupid \"mate\"?***",
        "Flipkart is running big scam or something you are not alone just check in r/IndiaGaming community Flipkart review. Also post this on r/IndianGaming.",
        "Thank you so much 🙏🥺",
        "It says ita a private community",
        "Your life is worth more than 76k and on a lighter note ajkal ek kidney itself can fetch about 4 to 5 lakhs 🌚",
        "Post this on twitter, tag Flipkart higher authorities and some influencers. Make the tweet go viral by any means necessary! Once it's viral enough to hurt the image of Flipkart, they'll give you the full refund along with some extra!",
        "😂🤣",
        "I've posted 5 tweet and tagged 50 people with news channel. Still no response",
        "You suspected a crime (defraud) happening to you at Flipkart center. You should have dialed 100 right then. \nIt's strange people don't think of police. In most cases the moment police gets involved, the other party changes tone. Flipkart would have wanted to resolve it as soon as possible. \n\nCalling 100 for assistance is not a crime when you feel honestly that your have been duped.",
        "No other option than consumer court..you can't even blame Flipkart here, when they have especially brought open delivery thing to put a stop to this kind of frauds. \n\nAlso, threaten that delivery executive too with a case of fraud. Never has any delivery executive asked me otp before hand, in case of open box delivery. The instructions clearly says not to give OTP before checking the box. So it seems the delivery boy knew very well about the fraud. Or else he wouldn't ask you for OTP before. Some delivery people themselves are removing original products by clever opening of the packing.. mention to him that in your consumer complaint as well as police complaint you are mentioning his name too along with Flipkart.",
        "Thank you 🙏 Everyone is saying that. We filed a case on him aswell. He said sorry I didn't knew.",
        "This is my final reply I don't see a point in replying further.\n\nWhat the fuck is actually wrong with you? It's a suggestion, I didn't assume he has a credit card, i said if he paid by credit card he can file for a chargeback.\n\n\nThere are 3 methods of payment, by credit, debit or by cash. Usually a credit card has a huge discount on a product, so people ask their relatives/friends to use their credit card to order a product.\n\nEven right now the price of MacBook m1 is 81k on flipkart and with HDFC credit card you bring the price to 76k which is ops price.\n\n\nShut the fuck up about statistics when it doesn't play a role here. Unless op told he paid by debit, credit, or UPI you have to assume all 3 ways of payment are possible. If no one used credit cards then you would be right but a lot of people use them to order big purchases especially because the discount is so huge. \n\nYour stupid statistics \"argument\" can also be twisted \"how many middle class people can buy a MacBook, do you have statistics 🤓\"",
        "We found out very late that it was open box delivery when Flipkart explained what it was. I went to file case in police they said, he has CCTV of 4 days from parcel coming and parcel going. They asked him but he's denying",
        "\"76,000 ka laptop mangaya par nikla sasta speaker. Flipkart ka scam\"\n\nGo to your local thana and get the complain done as it become an official and legal. That itself will escalate the matters in the local Ekart/Flipkart level. Also Go to your local newspaper office. You have the pics. Local newspapers like these kinds of new.\n\nConsumer court bhi ja. Unlike other courts consumer courts are better and you don't even need a lawyer.\n\nAlso keep tagging relevant authorities on twitter and make a longform post in FB as well tagging your state Police DGP, CM etc etc",
        "I ordered an iPad pro with apple pencil, from Flipkart.\n\nPost order confirmation, it was specifically mentioned in site regd open box delivery.\n\nThe guy came to my home, unboxed in front of me and even turned on the device, while I recorded everything. Only then I gave the OTP.\n\nYou should've been more cognizant, since a lot if people end up with Rin Soap bars, while ordering phones",
        "I've done everything! I've went to police par unhone kaha he has cctv as proof in office he didn't steal . Consumer court me case dala.they said 4 months lag sakte hai",
        "Yes I know 😓 this was my first expensive item. He said it's protocol and I wasn't tech savvy",
        "Hmm I've ordered laptops from these places before and it wasn't ideal (damaged keyboard) but it at least was the right item",
        "Considering that organ donation for money is illegal they will keep the money and your kidney and leave you with complications for life.",
        "Bro, I recently got scammed for 2,64,588. I understand your situation but suicide isn't the solution.\nYou'll earn it back, giving up your life isn't the answer",
        "There are some ways to solve this problem, lol, go to consumer court, \nFind that delivery boy which it gon be easy, get his ass real good",
        "I know him I recorded him he said nit ny",
        "Life lesson - Never purchase high value items on flipkart. Have heard way too many incidents like these. Amazon/ offline is the way to go.",
        "is Amazon better?",
        "Please raise a grievance on PMO portal.\n\nPlease raise multiple concerns on all possible consumer forums of government",
        "Even Amazon is not safe nowadays \n\nJust buy offline \n\nCroma mostly matches the online prices",
        "Flipkart open box delivery is a joke... why should  customers ensure that the right product is being delivered... they take zero responsibility whatsoever 😒",
        "I'm really sorry to hear about your situation. Here's a tweet suggestion for you to post on twitter:\n\n\"Absolutely gutted and furious! Just got scammed out of Rs. 76,000 by a @Flipkart delivery guy. Your delivery executive manipulated us to provide OTP before opening the box. I found cheap speakers instead of the MacBook M1 I ordered. @Flipkart @flipkartsupport, this is NOT okay! My family's hard-earned money is gone, and we're shattered. Your delivery executive played a part in this, and I've got evidence – videos, photos, confession! Middle-class families rely on your platform, and this is how we're treated? Unbelievable! @StatePolice, I hope you're watching. #FlipkartScam #JusticeNeeded\"\n\nTweet this and tag your state police where I have written @StatePolice.",
        " Bhai tu alag level ka chootiya hai. Why are you not at the gates of your local district magistrate and thana? Why is this not appearing in newspapers? You think newspapers won't take this, those fuckers are dying for non political contents! Heck you could even involve local politicians in this, especially their trade wings! \n\n'i have nowhere to go but r/India' r/india should have been where you come after doing all this. Tum naive nahi ho bhai, actually bevakoof ho.",
        "Bhai reddit par kitni baar mana kiya hai flipkart se expensive saman mangwane ko.  Chal ab shant hoja. Jo ho gaya so hogaya. Aage se dhyaan rakhna",
        "Bhai wha bhi daal diya",
        "It's definitely a devastating situation for anyone belonging to the middle-class. Try reaching the executive of flipkart regarding, if they didn't say anything try to reach with another agent on flipkart. And tell them your situation with each and every detail possible. They will surely do something [in reference](https://www.flipkart.com/pages/open-box-delivery-tnc#:~:text=In%20case%20you%20find%20the,the%20time%20of%20the%20delivery%3F)",
        "It's a famous comment so I'm adding Twitter link please retweet 🙏🥺 you are all the sweetest \n\n[Twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Always buy expensive things at the official store be it watches, laptops and shoes or expensive cosmetics.",
        "I too used to say the same about police until I too got into a scam and filed a complaint into cyber cell office. They took it so lightly that after my 4-5 visits to the cyber cell they started saying \"aap abhi yahan aana band karo, hum investigate kar rhe hain\" . It's been 2 months and no response since then. \nThey used to make fun of me behind my back(I've heard it) whenever I went to enquire about the case.",
        "r/LegalAdviceIndia post in this sub too.",
        "I will! Learned it the hard way 😓\n\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "You are not dumb at all, you have all the evidence. Just make a post on X and tag them.",
        "I'm sending Twitter to everyone if they wanna retweet\n\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Subah gadhe ka gobhar khaya mat kar nahi toh aise hi yahan par aa kar huggega. Have some empathy, you chipkali ki c#ut. Bechara stressed out hai aur tu uski mental wellbeing ki gend mar raha hai.",
        "Twitter 🐦🐦",
        "Therapy ke paiss bacha raha hu uske loduchand! If he doesn't buck up uske 76k ke saath saath trust karne ki capacity bhi jaygi.\n\n'Awwlelele' se teri duniya chalti hogi, lower middle class nahi chalta.",
        "Many of them have credit cards wtf",
        "I did ! Can you retweet it?\n\nI'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "I got scammed of Rs. 7,50,000/-\nThat's all my saving but that's alright I can earn it back. Not worth my life.",
        "https://www.flipkart.com/pages/obd-tnc\n\nAccording to their policy, once OTP is given and product is found to be wrong, then you are free to return it for a full refund. If cash paid, it'll be refunded immediately. If online payment, it'll take few processing days.\n\nTalk to Flipkart customer service and get it returned.\n\nIf unfavourable, approach consumer court.\n\nYou'll get your money back for sure.",
        "I got scammed of Rs. 7,50,000/-\nThat's all my saving but that's alright I can earn it back. Not worth my life.",
        "They said no. Because as per open box delivery, you're not refundable\n\nI'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Yeh sare scam Flipkart pe hi kyu ho rhe, i thought things would have gotten better after Walmart investment",
        "Honestly, this was easily avoidable if you are vigilant",
        "Feeling sorry for you bro your life must be hard for you to be so shit to other people.",
        "Please file a case and claim a crore at least. Flipkart must compensate for your mental breakdown",
        "I am not making this up, but I am one of the people who actually received a Rin soup bar when I ordered an iPhone 6 long time back. But it was Amazon instead of Flipkart.",
        "I ordered an iPad pro with apple pencil, from Flipkart.\n\nPost order confirmation, it was specifically mentioned on site regd open box delivery.\n\n#give OTP only after verifying box contents \n\nThe guy came to my home, unboxed in front of me and even turned on the device, while I recorded everything. Only then I gave the OTP.\n\nOP should've been more cognizant, since a lot of people end up with Rin Soap bars, while ordering phones",
        "File in consumer court. That will set fire under them. They will come running to you to resolve the matter.\nFile against both flipkart and delivery service.\nLater don't settle just for product. If needed take legal help.",
        "Bhai tujhe therapy ki sakth zarurat hai. Being supportive doesn't require one to be financially rich. Seriously, you need to seek help. I know you won't accept it but phir bhi bolunga. Aur acche therapist ke paas jaana boht bekar pade hue hai.",
        "If you paid amount using credit card File a chargeback with your credit card issuer by attaching all the proofs you’ll get the resolution\n\nRecently faced same issue with mobile phone filed a chargeback and got refund",
        "Yes it is? Tera baap ameer hoga, mere wala would consider such things a justified cause for war, mai aur flipkart wale dono pitte, SP aur MLA alag involved hote. Shaam tak notice aur raat tak media brief tayar ho chuka hota.",
        "Kyu, tujhe experience hai kya bekar walo se katwane ka? Isiliye empty advice aur mere moral support dene mein expert ho gaya hai? Learnt from the best, did you?",
        "Also add cyber cell Twitter, if applicable and definitely add news channel and some social activitist IDs",
        "File a complaint with police and give us an update here. I am sure there are some journalists lurking around this subreddit, just waiting to see some concrete step from your side.",
        "go to twitter post on their profile with every evidence you have",
        "Contact youtubers like techpedia they will help you",
        "I did. Can you plz retweet me 🙏😓\n\n\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "yes",
        "Police complaints and escalating to flipkart using Twitter etc is one thing but it’s not guaranteed to work. You know how these scamsters work. Take  a legit break from school (assuming you are doing bachelors) and start working . It’s not that hard to earn 76000 k if you have 12th . Pay your money back . Rejoin school. \nThis will boost your resume, you need to give reasons for break years . If you say you took a break year to pay off this , HR interviews lap this shit up .",
        "Guess it must be mandatory for 90% of the civil servants to be a bunch of clowns 🤡",
        "All this advice, but where is Op?",
        "Fir is the only option.",
        "Target the guy at the flipkart office … why did that staff took the OTP before opening the box ???",
        "Op is here 😊 I am trying to reply everyone 🙏😊 there are alot of comments. Thank you hbkdll\n\nCan you pls help me? I'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "It's high time we stop using Flipkart.",
        "Flipkart is terrible. It took me 3 months to get a refund for rs 1600 for a router which I did not even receive.\n\nNow I only buy groceries from them.",
        "Thank you CHATGPT",
        "Never use croma online they are worst than anything you will ever experience, offline is good tho",
        "I did! It's not helping 😓 \n\nCan you pls help me? I'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "I believe you,  my friend ordered a 30k washing machine and it's front loading door was broken.\nNo cooporation from flipkart. He had to spend his own money to get it fixed.\n\nBut that was before the open box delivery was a thing.",
        "Consumer court will take some time, but just the threat of a case filed scares companies. Keep messaging them and ask them to escalate the issue.   \n\n\nI recently got my money back from Cultfit after fighting for a month. It's possible.",
        "Middle class is buying a MacBook??",
        "Thank you so much for advice 🙏 I'm trying to get retweet to put pressure on them\n\nCan you pls help me? I'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Post your tweet link here, people can make it viral",
        "I feel bad for your situation. You file an FIR against Flipkart and give a copy of your evidence to the police along with the complaint. Ensure you have the complete set of evidence with you as well and don't blindly give it off to police without keeping copies. After that, approach the consumer court and file a complaint with a copy of the FIR and evidence. Whatever you're doing do it legally so that nothing goes against you later on. This process will take time but that's the only option you have. Fight for your rights immediately. The longer you take to initiate the legal process, the more diluted your issue will become. So act fast. If you don't, you can't get your money back.",
        "Go to any local newspaper to get your story published. Try to reach out to them on Twitter etc",
        "Make a complaint [here](https://consumerhelpline.gov.in/), there are multiple avenues mentioned. Record all your calls with Flipkart customer support. Also, email the video proof here: [grievance.officer@flipkart.com](mailto:grievance.officer@flipkart.com), [cs@flipkart.com](mailto:cs@flipkart.com), [cs-head@flipkart.com](mailto:cs-head@flipkart.com) and mention that if they don't help you out, you'll be getting in touch with dept of consumer affairs.",
        "Just find some mail ids of all media handles online and just mail dump to everyone",
        "I hope you have at least contacted the Police. Should be the first thing to do when you are a victim of a crime. First incident report becomes the basis for any further action.\n\nI would also suggest to post on r/legaladviceindia\n\nAnd contact consumer guidance society of India if you feel Flipkart is being negligent. They have offices in every state and consumer protection is their job.",
        "He is buying for college not for showoff",
        "I'm so sorry 😔\n\nCan you pls help me? I'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "I've contacted police and started a case with lawyer. He said it might take 3 months\n\nCan you pls help me? I'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "r/kothibanglacheck",
        "I've tweeted them and mailed some YouTubers\n\nCan you pls help me? I'm sending Twitter link to everyone in case they wanna help .\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Avoid flipkart..",
        "Bro i feel sorry for you, fuck these scammers. I hope u get ur money back. The only drawback of upi is that refund is a headache. Credit cards are safer.",
        "I've learned it the hard way\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Once I lost 50k in stock trading, had 2k left in bank a/c, ate a pizza of 200 rs and slept. Struggled for 3 months then made money again. No need to kill yourself over 75k. Fight for it.",
        "To all my Indian people, please always take video while unboxing any parcel even if it costs less, you will thank yourself later.",
        ">I've contacted police\n\nHave you filed an FIR?\n\n>started a case with lawyer\n\nWhat suit are you filing? Criminal or Civil? Against whom are you filing a lawsuit?\n\nCall Consumer Guidance Society of India. You won't have to even pay for a lawyer as they will fight it on your behalf.",
        "After seeing so many issues with online E-commerce stores, I guess I will buy high ticket item in offline. No headaches ans chance of scams",
        "Search for your local news channels and find them on linkedin and dm them your case with evidence",
        "Bro there is still hope, pressurise flipkart with this video.\nTalk with seniors Cs, there will be chance of flipkart will consider it and investigate..\nTalk with their Cs frequently until your case get escalated. If they say it's not possible to refund just tell them you wanna talk with your seniors and explain, just don't give up",
        "Thank you! I already found a local news and I told Flipkart I'll send It to news\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Thank you 🙏🥺",
        "Try tagging their investor house accounts as well",
        "I tagged all of them 🥺\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Whatever happens, don't consider ending your life over this. Not even for a second. Trust me, 76000 is not a lot of money (for someone who can afford a mac book).\n\nIf you did nothing wrong, don't even consider punishing yourself in this way.",
        "rubbish. completely wrong.  \n\n\nIt's 98%",
        "Did u get tat parcel at home or is it still at their place flipkart centre and do u have recording of the flipkart peraon requesting ubto give u otp prior the package opening? It was flipkart person was wrong here as you can see usually they entry otp once you are ok 👍 with it. As clearly it can be seen flipkart person mever entered or asked for otp. You should waited for them to deliver the laptop at home.",
        "99.7%",
        "An advice to you, since I have gotten my money back from Flipkart through Twitter only. Don't write so many big tweets. In your main tweet, where problem is explained, Flipkart support is not being tagged. You have tagged them in separate tweet where you are demanding justice but the matter is not mentioned. \n\nWrite matter in short and precise manner and tag Flipkart support in them. They will then reply you to explain the matter in detail in inbox. By writing so many tweets, with main problem not even visible in their tag, they won't be able to respond as there are many many people tagging them and it will get difficult for them to see the tag, come to your profile and then check out your other tweet where you are explaining the problem. \nLeave the other tweets as it is for better reach, but for now write a simple short tweet  and tag only Flipkart support. They will reply immediately.",
        "https://www.reddit.com/r/IndianGaming/",
        "To ALL\n\nFK is an organisation that lacks Accountability, specially High Ticket Item. We have seen this a lot on news, on Reddit too. hence treat FK for low ticket items or dont even use it.  \n\n\nHi\n\nSorry to hear that and can understand this may not be easy, specially for you and family. \n\nPositive is that you are articulate hence firstly know this is addressable , to a certain extent. Hence you need to be smart and take control of this with Flipkart.\n\n(+ves)\n\n&#x200B;\n\n1. In the Flipkart hub\n2. Also capture the face of the Flipkart delivery executive. \n3. have footage of the delivery executive opening the box that means the delivery boy open the box and not u\n4. Video available confirming opening the package with different product\n5. the confession of delivery boy admitting that we have received the wrong product\n6. the cameras in the ekart hub might have captured the incident that the delivery guy ask us to give OTP before delivery our package\n\n(-ves)\n\n&#x200B;\n\n1. Despite clear instructions, you provided the OTP before opening the package.\n2. Delivery executive \"MANIPULATED\" you into thinking the OTP needs to be given before.\n\n&#x200B;\n\nMy sugestions:\n\n&#x200B;\n\n1. Stop being sad when have of the evidence is in your favour. Use it to build a case and make FK accountable.\n2. Write a CLEAR MAIL with above points, share video .. On mail as well as Twitter. Ask for support from friends/ Reddit community and let all retweet. Some will, some won't.\n3. Clearly state in email that while instructions were clear and you demanded to see the product from executive in their own warehouse , yet Flipkart executive \"MANIUPULATED\" you into believing that it is FK rule/policy to give code before product. ( Attach the video , hopefully voice recorded, if not , it is OK )\n4. Why FK executive asked you multiple times to see the CODE before product. Is he not trained or is he part of this scam. How is FK safeguarding customers from such behaviours where customers are \"MANIPULATED\" into giving codes before handover and product is wrong and FK says they aren't accountable. Clearly state is FK accountable or in this game as well , how can we be sure ?\n5. Tell them and you MUST, Consumer court or police complaint with evidence and create a case. \n\nTag senior leaders of Flipkart to your Tweet too. \n\nI think you'll have to be after them for your refund and a Police case or a news article must help you get this expedited.\n\nGood Luck.",
        "Sorry for your loss and its a shame what happened, flipkart is just a shit show these days NGL, but you mentioned you from a middleclass family and money is an issue, then why did you buy a macbook? you could have got a better and more powerful laptop in the 50-60K range and could have saved more.",
        "It cost me 76k.my mom said so, because she thinka for ones for my college I should buy something good. I've never purchased anything expensive because of financial condition. Since a good college is. A achievement she thought it'll be like a gift and I'll eatm alot after good college\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "What are the steps to be vigilant?",
        "Post on LinkedIn too and Tag Flipkart Current officials.",
        "He did everything still in trouble. Check his tweet and retweet it so that it gets highlighted.",
        "Thank you🙏🥺. I'll do that",
        "If I understand correctly, then someone sent you the wrong item and not the Flipkart hub, then I would suggest you raise a request to Flipkart and file a FIR.",
        "Bro never ever give OTP unless you’re satisfied. Hopefully you get your product or money. Good luck",
        "Consumer court is your best bet. Not exactly the same situation but my friend had an issue with Flipkart regarding one of the Samsung Galaxy flagship phone. It took around 2 months but he got all his money back. \n\nYou’ve all the required evidence so file the case asap and keep tweeting daily with videos etc",
        "Also tag tech youtubers like geekyranjit, he mentioned in a video where he too faced such issues with flipkart. I have stopped using flipkart ever since I saw that video, and so should everyone.",
        "100 times better. Also use a credit card in future",
        "Isme suicidal kyu bhai",
        "Yeah bro, I'm sincerely sorry. Hope it gets better, or you learn to not let it affect how you treat other people ❤️",
        "Doesn't matter what they said. See their TnC. Whatever is written there is the source of truth. Send it to the customer care person and ask them to follow their TnC or you will take them to court for fraud.",
        "It said they can't return.\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "Try getting in touch with your bank and see if they can raise a dispute for fraud from their side.",
        "Go to police.",
        "File a complaint at National Consumer Helpline. It is resolved within 2 weeks.",
        "I got scammed too I ordered Earbuds from Flipkart they gave me the shell but there were no earbuds inside it, they gave an empty circular thing no earbuds 😠",
        "That works for smaller transactions. Higher disputes companies will take up.",
        "Thank you so much! I'll do that",
        "I do want to call you an idiot. But not for providing that guy with an OTP but for paying 76k for a 3.5 years old MacBook.",
        "What else can I buy instead of a macbook? I just thought apple runs smoother",
        "Bad advice, police need chai Pani first then they agree to even listen.",
        "I've got some experience in this case . Don't ever post such things on social media . Each e- commerce team has their own social media team that handles such cases , they will directly reject your claim on such things . Don't buy expensive things from online websites even if it looks cheap these things are all scams . It is just a trick scam people and looks like you got scammed . The best thing you can do is now go to the consumer court and file a complaint .",
        "The attractive discounts are precisely the scam. Even more so Flipkart Assured now blocks any form of return, all assured products carry Open Box now and people have to be very very very very vigilant before giving OTP on open box. Take half hour, one hour to inspect, let the delivery guy wait. Only when these delays will hit Flipkart will they stop this bs.",
        "Yeah local ones won't even file cases of stalking, forget about money scams.",
        "Always use Amazon, and don't worry about the money. You can always earn it back. #fuckflipkart",
        "This is why you always buy online through a credit card. If anything goes bad, you just file for a chargeback.",
        "Your best bet is approaching the consumer court. There’s a low chance you’ll get your money back but its still better than doing nothing. Sorry to hear what you’ve gone through. Hope you get some kind of reimbursement. \n\nIts scams like this that made me leave India. India is developing with lightning fast speed but the core issues are still unsolved.",
        "What was the problem with Cultfit, facing an issue with them aswell",
        "This is what appears for OBD before final confirmation. The link you shared has not been updated since Dec 2022.\n\nhttps://preview.redd.it/05upegm12gjb1.png?width=1188&format=png&auto=webp&s=ae8b840c0a5f56fec924dfe0ad9b617f9ae43cdf",
        "Never use flopkart.com they even bought the domain flopkart coz they knew what they are.",
        "I bought an exercise cycle and after a month it started making noise. No amount of repair would fix it. They were like the next repair would be final, next repair will sort out the issue. Had to fight with them on the call and get the money back.",
        "i used croma online to buy a laptop, my experience was smoother than a baby's butt",
        "That delivery is guy is sketchy, he shouldn’t have asked for the otp first if he was genuine.",
        "[This]\n(https://imgur.com/0Bopph4) is what appears for OBD before final confirmation. The TnC linked before has no mention of it.",
        "lol. literally any decent windows laptop",
        "Don't worry you will get your money back!! Don't give up",
        "If it was OBD, [this popup](https://imgur.com/0Bopph4) would have appeared before final order placement. He goofed up if he didn't notice it. Not that it excuses Flipkart, their third term is beyond ridiculous from the get go. I would keep the executives wait for hours if I have to be 99% sure things are correct.",
        "Bhai retweet kiya hai. Agar refund vagera kuch hua toh yaha par bhi update kardena",
        "These scams are happening cause of last mile operations scams and.not from e-commerce portals. \nFile a case against Flipkart and also against ekart. \nAlso reach out to communities and try to get this viral against both these entities. Share as much as possible and probably in 7 days you should get a resolution from them. \nTry to involve as many people or just create fake social media accounts to spam the shit out of a single thread on as many platforms as possible. A spike in the numbers will hit their counters as well.",
        "Thank you bhaiya 💖 🥺",
        "Thank you so much 💖🙏 I'll follow your advice 💖🥺\n\nPlease retweet if you can!\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "I think you should tweet under FK’s latest tweets in their own account \nThis is the way to get visibility and get a response \n\nWhatever their latest ads on twitter , just go to FK’s and  post your tweets as comments / replies . \n\nI am so sorry this happens to you and others \n\nSince the company has become notorious for this , it was their responsibility to call purchasers of high value electronic item ( even if automated call ) and explain to them properly about open delivery procedure",
        "I agree 💖❣️ I'm not very informed about these things 😓 I'll do as you said!",
        "Thank you so much 🙏🥺",
        "Ok 🙏😓",
        "Sure.\nI saw your video and it's evident by the body language that this is done by ekart guy. Raise a consumer case against both and provide GSTIN number of the ekart delivery centre. Unke dhande pe attack kro and if possible raise a case in police with help of opposition or ruling leader. Twitter pe tag kro unko. I have worked in global fraud analytics in Amazon and I can tell this is a common fraud modus operandi over the world.",
        "Bro u living delusion life or what, even if ya DM and ask to share ur news, they will ask u to pay the money first",
        "You will get the money back. It's not a small amount. Court case takes time but you will not loose you money. keep as much proof as you can with you.",
        "I am so sorry this happened to you. Since you opened the package in their premise, you have sufficient proof and you should pursue this in consumer court if required. Try to lookup top executives on linked in and reach out to them if needed. Lastly, don’t beat your self to it. Happens to the best of people inspite of all the awareness. You will be fine. \n\nSince the launch of Amazon, I have never once ordered from any other Indian owned website. We simply don’t know how to business with integrity. This is why a lot of companies don’t want to come to India and setup business as we lack the business ethics, we are also in the west known for running scams and looting innocent people.",
        "Posed your question to AI and got the following response :\n\nHere is a summary and analysis of the Reddit post, along with suggestions for further actions:\n\nSummary:\n\n- The OP ordered a MacBook Air M1 from Flipkart for Rs. 76,000\n- The delivery was scheduled for August 13th but was delayed\n- On August 15th, the delivery executive asked OP to collect the package from the Flipkart hub directly\n- At the hub, the executive asked for the OTP before letting OP open the package\n- After providing the OTP, OP discovered cheap speakers instead of the laptop they ordered\n- Flipkart is refusing a refund due to their no-returns policy on \"open box\" deliveries\n- OP is seeking help to escalate the issue and get a refund\n\nAnalysis:\n\n- This seems like a clear case of fraud by the delivery executive who swapped the product after getting the OTP\n- OP is not at fault and provided evidence including CCTV footage and confession\n- Flipkart is not taking responsibility despite their protocol being violated\n- OP stands to lose a significant amount of money needed for college\n\nSuggested next steps:\n\n- Continue posting on Twitter with evidence and tag influencers, journalists, police authorities etc to raise visibility\n- Contact consumer court as already done and pursue the case actively\n- Try escalating further within Flipkart through emails/calls to senior management\n- Lodge an FIR against the delivery executive for fraud and swapping products\n- Consider approaching local newspapers/tv channels to highlight the issue\n- Post on other platforms like LinkedIn to directly engage Flipkart employees\n\nThe key is to not give up and continuously pursue this from all angles until Flipkart is forced to intervene and provide a refund. Remaining persistent and raising visibility seems the best approach based on the information provided.",
        "Just give OTP after checking your product incase of Flipkart. For expensive device they tell you that do not give OTP before checking your product to counter these scams.",
        "it's not flipkart fault, 3rd party sellers doing scams, anyone can make seller account on amazon & flipkart. Always check who is seller before purchasing, \n\nlike on amazon  [Appario Retail Private Ltd](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A14CZOWI0VEHLG&isAmazonFulfilled=1&ref_=dp_merchant_link&asin=B09QQPGDBG)  & some others are official sellers. on flipkart omnitel retail, retailnet etc are genuine sellers. avoid new sellers, scam sellers are always new.\n\ni was seller on ebay from 2010 to 2013,",
        "Bro just go to consumer court , also keep proofs of contact no , prod purchased , bill etc",
        "Fuck flip kart",
        "Hmm that was a rookie mistake made by OP. I think the delivery executive is on the scam, he smartly forced them to give the OTP before unpacking and technically cleared himself of accountability afterwards.",
        "If it was Flipkart you will need to sleep there for 4 days to get something done. Cyber cell service is better.",
        "Yes true, but given we know about these scams, we can continue using Flipkart and safeguard ourselves by not making the same mistakes. \nAlthough this solution is not a good enough fix, given we don't see much of such incidents with amazon and Flipkart should fix this issue",
        "99.72%",
        "> ***I'm broken and suic\\*dal.*** \n\nThis part is worrying. Please do not worry. This may waste some of your time but I believe you have sufficient evidence to get your money back. Just keep at it.",
        "76k meri 3 mahine hi salary h",
        "Your life is not worth 3 months salary, I lost money that I will probably never recoup again. It wasn’t even my money I wasted. Guilt bahot hai but suicide is not the solution.",
        "PMO portal?",
        "I am really curious about people's reactions to problems on this subreddit.\n\nI am sorry that you got scammed, it can be a very harrowing experience, but are you really \"broken\" or are you really \"suicidal\"?\n\nIt's a laptop, even if you are scammed and you don't get the money back. What really is your loss? It's not as if you paid for a life saving medicine or anything of that sort?\n\nObviously fight Flipkart, and I hope you get your money back - but please learn to contexualise problems, that might help as well.",
        "Flipkart sucks",
        "Thank you , idk it's such a precise proof why are they not helping me\n\nI have delivery guy confessiom too, and camera recording too if ekart hub that I'm ready to give to them\n\nHere's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏\n[twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19)",
        "I have observed if something is taking more time than expected its usually wrong product or the seller doesn't have that item. I recently ordered an expensive cream at abnormal discount from amazon which delayed and arrived after 10 days and there was some expired cheap cream inside. Though I called amazon and they told me for few pics and got refund within 2 hours and told me to keep that cheap cream with me too.",
        "Flipkart seller here:\n\nThe Flipkart (Ekart) delivery offices are full of cctv cameras. So if it was stolen inside office it would be captured. \n\nMy recommendation:\n\nFile a police complain and go with police officer to Flipkart office. The manager may allow you to check cctv footage alongside them. Otherwise this will put pressure on flipkart as well as Flipkart office. \n\nNow about twitter. Tag CEO, Walmart, Walmart CEO and everyone at top related to Flipkart.\n\nBut do FILE FIR first.",
        "Ye to jyada bada fraud nikla",
        "Again I wanna emphasise that please for the love of god don’t buy anything from flipkart. Those people have zero ethics and care for customers.",
        "Shouldn't the delivery guy upload pictures of the item you purchased on their app in case of open box delivery, isn't that the procedure? \n\nI don't buy from Fk often but I ordered something for the first time last week which had open box policy. The guy asked me for OTP before opening the delivery.  But I too was stupid enough to share it with him before he could open the box (I'm not familiar with fk delivery procedures since I order from amz when I buy online). I realized it was dumb only after I shared it with him but luckily the item was all good.\n\nBut I did notice him taking pictures of the product from every angle after unboxing to upload on the app. Didn't the delivery guy do that in OP's case? That should be a proof for you not having delivered the actual product right?",
        "I am definitely going to be the asshole here but if 76k was a life or death amount for OP, buying a MacBook should have been the least of his priorities. There are many windows laptops for cheaper options.",
        "Damn. Feeling really sorry for you. Flipkart just seem to be hitting new lows everyday",
        "I agree but suicide is not a solution even if his priorities are wrong",
        "Always buy expensive things offline (i traveled to another city to buy a laptop)\n\n\nWhile recording always record in wide angle and in full resolution with fully lit light or use flash if required \n\n\nMake sure delivery boy is face is visible\n\nTurn down background noise for example tv, speaker song when recording \n\nSpeak time and date and product name in recording",
        "If you have proof. And you did nothing wrong. Time to fight and not be a scared of anything. It’s your money and they scammed you. You have every right to escalate the matter. And 76k is a small amount, it will be refunded. I’ve seen people loose their savings over a flat built on bogus papers.",
        "I had a bad experience on amzn few years ago where I received empty box for a laptop purchase. The order wasn't amzn fulfilled either. But I received the refund after a week long of calls and emails. After receiving the refund, I purchased it again from amzn itself but this time a fulfilled product. amzn imo takes care of their customers' issues at least from my experiences.",
        "They scratched my ass with sandpaper",
        "You can also try to check who the seller is. Find out the seller, get the contact details and add them to your case too.",
        "Yep, if it's such a large amount for him, and can't afford to lose then shouldn't have bought MacBook. Even I require laptop for my work and can't afford good one so using window",
        "Keep us updated with the situation, we gotta make sure this doesn't happen to others as well. I have ordered a few things from Flipkart and this open box thing they do is truly nerve wrecking. We have to make sure that not just you get recompensated, but also Flipkart to change their anti consumer policies.",
        "See if you can use any local area supporters with you to the police station and request to view the footage. Smells like underhanded money exchange.",
        "Amazon is also scam - scammers who quit flipkart are joining amazon . I would advise people to buy offline purchase anything above 2000 rupees.",
        "It's always \"a nice laptop\" = Mac. This lazy and simp thinking is disgusting.",
        "This contradicts a lot of other people who have had success through social media.",
        "It's worth trying at least for a month, for this much money, before giving up.",
        "Post this on LinkedIn. Sensationalize it. It'll reach to the higher ups and you'll get a resolution.\n\nFlipkart's ekart logistics is run by local Mafia and gundas.",
        "You purchased an Apple Mac, got scammed and now you are suicidal?\n\nAs someone who has dealt with a suicidal person, either get yourself to a therapist if you are that unstable or (more likely) don't hyperbole and take words like suicidal /depression in vain?",
        "Flipkart openbox delivery means they need to open it while recording it and if the item is not correct it is not on you. You should get your money back or a replacement. Have courage and be calm for now.",
        "Get recording from Flipkart hub of your unboxing report it to consumer complaints and go to cyber crime office and file a fir against seller\nSeller address can be found in invoice if you can't ask local ca or someone who work in it to help you identify who owns that gst number your money is safe you don't need to worry",
        "File case on seller rather than Flipkart and ask him to give you not only laptop but compensation of mental health damage if you file complaint against Flipkart it will take months even if you go to court there will be atleast 10-15lawyer standing in front of you From Flipkart",
        "   \nr/LegalAdviceIndia",
        "99.75%",
        "wtf why are you scolding him for buying a MAC. Either way he would have lost 50 to 60k",
        "A ThinkPad would have been far, FAR better, and you can use both Windows and Linux on it comfortably. It is also more durable, has better keyboard and officially allows user repairability with manual, along with multiple ports.",
        "File a case of cheating",
        "Money, its all about his hard earned money. Many people feels the same. Work and save for months to spends on our wishes just to go down the drain.",
        "Media don't give a rat's ass about scams. There are so many, it's just routine day-to-day life. Now if there was a sex-scandal involved somehow..",
        "Retwitting bhai \nI understand what you’re going through. Don’t be too harsh on yourself",
        "I just don't understand why people keep purchasing Apple products from third party sellers. There are two physical Apple stores now where you can pick up genuine products - direct from the manufacturer. Or you can order online direct from them. Why involve a scammy third party like FK?",
        "Honestly, consumer forum is your only option left. Or hire a lawyer and send a legal notice to Flipkart",
        "First of all, anyone telling you that this is somehow your fault for sharing the OTP before opening the box can fuck right off. It's not your fault that a scam like this is so frequent on Flipkart. The fact that it happened at a company warehouse where there is clear evidence that you were not handed the product you ordered is basically criminal negligence. This should be illegal.\n\nThe whole open box policy should be illegal as it involves Flipkart basically washing its hands off all the scams happening on its platform. It is telling the customer that dodging scammy sellers is your responsibility, not its own. That's fucking bullshit. Nowhere in the world does e-commerce work like this, heck even eBay which involves person-to-person sales has better consumer protection than this. I'm sure even buying knock-off items from AliExpress isn't as bad an experience (as long as you know what you are buying.)\n\nPersonally I have only ordered one thing from Flipkart in the past 3-4 years (I stick to Amazon). That was my Pixel 7 Phone since Amazon did not officially sell it. The whole experience was really annoying. The delivery agent unboxed the phone at my doorstep, peel off all the plastic wrapping and turn it on. Then they had to take four-five photos of the unboxed phone and fiddle with the touch screen before handing it to me and collecting the OTP. This might seem petty but it totally ruins the joy of unboxing a new piece of tech on your own and booting it up for the first time. On the flipside I recently bought a Macbook Air from Apple's online store and it was shipped via Bluedart. No hassles at all. Item was delivered in a tamperproof package, OTP was collected and I unboxed the thing peacefully at my own leisure a few hours later.",
        "> I paid by UPI.\n\nThat's the other mistake. Always pay for expensive goods with a credit card - one of the well known international chains. They usually have good fraud protection built in.",
        "what was the price and which variant ?",
        "The National Consumer Disputes Redressal Commission (NCDRC), India is a quasi-judicial commission in India which was set up in 1988 under the Consumer Protection.\n\nTAKE UP THE MATTER WITH THE ABOVE AGENCY.",
        "There's no way to soften the blow OP. You ARE in for a long fight. \n\nBetter convince yourself now. Don't think of getting your money immediately. Keep a cool head and keep trying as many avenues as you can",
        "\\- From my observations, the box was sealed loosely- doesn't seem to happen when they deliver a product like a laptop, it was clearly done by the delivery agent (or someone involved in the freight) and he must have known about the policy that once he gets the OTP, he would get a freehand in this crime.",
        "They mention it several times to only give OTP **after** inspecting the product. I",
        ">He said it's protocol and I wasn't tech savvy\n\nHate to break it to you, then its totally on you. You trusted the delivery guy over written instructions by the company. And I don't think you have any claim over flipkart too, if you choose to ignore the instructions.",
        " Consumer grievances will surely respond.",
        "Lure of discounts",
        "I myself did order my laptop through flipkart during 2019's bbdays, I was lucky that in those days we used to have return or refund policy, unlike present's open box delivery. Now in the upcoming bbdays I am to order another one for my sister, am skeptical this time due to flipkart's shenanigans.",
        "yeah. scam is bad and company should pay through nose but macbook could also have fallen from hand and broke. how could someone spend money on MacBook if they go suicidal if it doesn't work",
        "Hey. First relax, take a deep breath. Your case will 100% be solved. It's clearly a genuine case based on your video evidence.\n\nIt's a big company and whenever such cases have happened the buyer does manage to get a refund. I can see FK social media team has already replied to you saying that they are looking into it.\n\nOne other suggestion is to post this on LinkedIN and tag some of the folks at FK. Especially head of social media and head of marketing.\n\nI can definitely see your issue will get resolved.",
        "Consumer court is your only option. Take a printout of the order from the Flipkart website and show it to them. Also, show the item received. This is why amazon is better than Flipkart any day of the week.",
        "Please provide a number or a website link for National Consumer Helpline.",
        "Another lesson you've learned here is know what you're buying, if you don't ask someone who does. Research the product and the website/seller.  If you had asked someone who knows things regarding such expensive products they would have   \n first advised against buying from Flipkart and second advised against buying a macbook for college.  \n\nNow all you can do is hope the courts can help you, and make sure to highlight the delivery centre/people in everything",
        "Never buy anything from Flipkart",
        "exactly. It literally comes as a popup and mentions no returns for any case once OTP is provided",
        "Hey, can you please go to your filpkart order section and also mention the name of seller in your posts? This might also put some pressure on seller",
        "Seriously I wonder the age of people advising and upvoting this police, journalists and news channel route. None of them will care for a scam around a 1000$ 4yr old device. They earn more through bribes and ads every hour. Only Consumer complaint or lawyering up will have a realistic result.",
        "In OP's case reading the three line popup that comes up just before payment which specifically mentions to provide OTP after satisfaction, and also that no returns will be possible after OTP.",
        "You take a screenshot of the seller's name and update your post so that others can be aware. example\n\n&#x200B;\n\nhttps://preview.redd.it/kvi3xfl0chjb1.png?width=371&format=png&auto=webp&s=bdbdeb3fd5689d630f44695cfd024c65fd772ca6",
        "Yes it's my seller. How do you know?",
        "Won't involving the police work ? I mean they can find the seller and solve the issue right?",
        "MAC bros tend to not do basic research on any of their purchases, apple or otherwise. It's exceptionally fitting with OP ignoring the three simple sentences that pops up on Flipkart opendelivery before making payment and did the opposite for all the three. He is lucky he has some semblence of proof that implicates Flipkart with its representative not following their own terms.",
        "it should be renamed scamkart n not flipkart",
        "Just to give you an example, I searched for a MacBook M1 on Flipkart and found it. The seller has a good rating. Maybe the delivery guys scammed you.",
        "If you're middle class, how you failed to do basic research before spending your significant money is beyond me. It applies for both the choice for Mac and failing to read the three simple sentences Flipkart displays for openbox before making the payment.",
        "It will be solved\nI have lost over 2 lakh rs in crypto being in a lower middle class family.\nLife time savings but I didn't think of suicide\nSo don't say stupid things like this",
        "Yeah about that. Looks like you value you 75k over your life. You've got more issues than losing 75k if you ask me. Which literally amounts to little to nothing in the long run. Try to get it back otherwise make peace with getting scammed and move on. If it's too good to be true, it most probably is. Think of it as a 75k lesson and move on.",
        "There are many complaints about this seller. I hope these links help.\n\n[https://www.google.com/search?q=TREASURE+HAUL+ONLINE&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=TREASURE+HAUL+ONLINE&sourceid=chrome&ie=UTF-8)",
        "bhai exactly my thoughts, trivializing something like suicide for a macbook, for college",
        "Keep yourself together, brother. Your case seems strong enough, plus you have video evidence too. Something will turn in your favour.",
        "Ignore macbook, for any purchase a basic research should have done. Dell, HP, Lenovo for instance fleece people on windows laptops similarly. Now he has proof so he will likely get refunded but as the saying goes \"a fool and his gold is soon parted.\"",
        "His parents paid for it so",
        "File a complaint, thats your only remedy",
        "Same statement but hard work of their parents.",
        "which city is this..?",
        "All the people asking to go to consumer court ,order another macbook pro this time a better spec version .now keep the macbook and tell the delivery giy to fuck off and close the door.he will say i will lose my job and bullshit .just say not my problem.after a week or so flipkart will call you and ask you why you doing this sir tell him this and he will say we will file a police complaint tell him to go ahead .they wont for 1 lakh rs because it is bad publicity for them.\n\n\nI have done this so i know as i was victim to something like this.you can dm if you need any help.",
        "wait what how why when",
        "Middle class guy why do you need Mac Book Pro worth 75k?",
        "One thing to keep in mind is that. Always use a credit card while purchasing stuff online.",
        "Just had a similar incident. I got fridge delivered which is a little defective. I told them to do a replacement.\n\nThe replacement was even sent out and reached my city. The they canceled it and now they are claiming to reach out to seller. Apparently the issue i raised was \"damaged\" and not \"defective\". But since it was open box delivery, Imno visible damage was found.\n\nNow I've been calling Flipkart and seller and hoping that this is resolved. Never expected such services from Flipkart.",
        "Don’t know which city you’re from but a few things you can do : \na. Consumer court b. Local police station \nc. Maybe try contacting some YouTuber who covers such scam related content. They could make your incident viral if you’ve photo/ video proof to back it up. This might help in making the case reach out to more people. \nd. Pls contact a local newspaper or even bigger ones like times and all. Find out who writes the crime reports, their mail id is given. Mail them the details. Contact the editorial for this. They love these cases. \nHope you get back the money",
        "Sure.\n\nhttps://consumerhelpline.gov.in\n\nhttps://web.umang.gov.in/landing/department/national-consumer-helpline.html\n\nApplication is also available for both iOS and Android.",
        "There was a recent post on r/India of a girl who was scammed via Amazon.",
        "Yes, that's a lot of money but there is no need to feel suicidal for it. With luck and discipline, you can earn more money in future. This can happen to anyone. Learn the lesson and move on.",
        "MacBook Air, not MacBook Pro, but yes I understand your point.",
        "The fact that you could afford to pay for a Rs 76000 laptop upfront suggests that you do have the means and this is not such a huge amount for you. Regardless it is not worth ending your life. Take the L for now and try your best to recover. Other people have already given some good suggestions including consumer court.",
        "Honestly DON'T BUY ANYTHING ON FLIPKART.\n\nOrdered 3k worth of art supplies (washi tape etc) and they're not what they showed in images, asked for return, refused. The another box which was sent was alreaady opened and there were less tapes.",
        "I fucking hate the open box crap that Flipkart pulls, ruined a phone unboxing experience with the delivery person only touching my phone with filthy hands during COVID. Do the unbox and record it but I will be the one doing both along with the delivery person filming too if needed.",
        "Dont worry consumer court will get your money back and good chunk of extra money for all the harassment and pain.",
        "why not?? can middle class people not save up and buy a macbook?",
        ":(",
        "OP I have lost 30 lacs to IDBI Bank.  I'm just as middle class as you. But never ever think money is worth more than your life!!! As long as you have your health you can make money! As for this case, you need not even worry because you have proofs and Flipkart can't just scam you like that. Please reach out to Consumer court.",
        "That's why I always use Amazon. I have lots of scams related to Flipkart and rarely any related to Amazon. Infact Amazon customer is much better than Flipkart. They will try their best to solve your problems ASAP while Flipkart? It's the worst!",
        "Lifebuoy ka sabun hai ye log. 99.99 percent.",
        "Bro don’t stress it I know it’s a lot of money in India  but you’ll get more and more senior in your career where that money will be nothing",
        "Seconded, I also attempted to buy an expensive laptop from FK and they played several games with me; delayed delivery, no response from agent, order delivered but not received, then they increased the price and asked me to pay the remaining and \"uske baad delivery hogi\". Spent a month on the case and finally just did a chargeback cuz was lucky to have used a CC.",
        "Bro, do update us when your issue gets resolved",
        "Why credit card ?",
        "Thank you 😊 I did got called for refund, but I'll update when they'll send money in my account that'll be on 28th august",
        "Don't explain your purchases to random strangers. It is your choice what you buy.",
        "I too avoid Flipkart. But bought pixel 6a. The delivery guy however gave the box to me and told me to unbox and check. It was weird to unbox standing in my doorway, but atleast I did the unboxing. Still, it's pretty dumb policy honestly.",
        "Welp -  Better luck next time!",
        "This guy is playing, dont trust him.",
        "If losing a MacBook makes you suicidal you have a different problem to worry about other than the money lost.",
        "Credit card istemal kar re ho aur 81k ka laptop hai aur apne AAP ko garib bata re ho you are moron period",
        "also buy things from Credit card and do a charge back",
        "Don't know op personally but from what I can see he is a moron probably in his late teens",
        "Can you share your incident how you lost this much amount",
        "Tf bro, how? Was it fuckcart too?",
        "Op is in his late teens bacha hai abhi 😅😅",
        "Congratulations brother❤️",
        "I have completely stopped using flipkart since the day the news of people receiving bricks and soap bar. \n\nI have worked as a social media specialist and I can’t even tell you how many tweets there are where a customer has received a defective product, never really received the product, never refunded money. From smartphones to tv and laptops.\n\nI wonder how this platform still not in trouble for literally looting the customers and then the mental harassment that comes later speaking to the customer care representatives who mostly lack manners and etiquettes.\n\n\nONE THING I found out recently about Flipkart reviews for TV smelling suspicious just to know later that whenever you purchase a TV the manufacturer will get in touch with you over WhatsApp and offer you an extended warranty of 3 months in exchange for 5 star reviews so basically regardless of the product’s quality, service assistance, build quality, shelf life one would end up buying faulty product.\n\n\n\nIf you have made it till here, thanks. During the sales like big billion days, do check out Twitter hashtags you will have your blood boiling to see how big of a fraudulent this company is even when it’s not you who is in loss but you empathise with someone who’s suffering",
        "insurance money. they rejected my claim.",
        "Just put it on twitter",
        "OP, learn cross posting. It will be helpful for staying on reddit.",
        "Didn’t read but who gets suicidal over 75K rupees. Like lol 😂 bro really. You really ready to give up your life over this much",
        "Good work fam. That's why I love Reddit!",
        "Which college work requires a 70K Macbook?",
        "Sad to say hum aise law and order ko empower karne ke liye tax bharte hai",
        "Why would they save up to buy MacBook?",
        "Hello Brother. So glad you got your money back. I know you will be extra careful from now on. Cheers!",
        "what's OTP ?",
        "Lesson Number 1: Don't ever order from the bitch called flipkart. They give attractive offers just to attract honeybees like you. The best you can do is go to consumer court and if they couldn't help then just forget about the money. It's a common scam run by flipkart and you should have been aware of it.",
        "Open delivery is terrible. They’re absolving themselves of all responsibility. Someone isn’t always going to be physically present.",
        "First 76k is not worth being sucidal, calm down.\nSecond, You're not dumb, he is literally scamming you if he said it was flipkart protocol and it wasn't, i wont be surprised if this is a new type of scam where depivery boy is a part of it, people really do need to be very careful and read terms and conditions on these websites before purchasing or stick to local purchase for simplicity and less hassle and avoiding getting scammed.\nRetweeted hoping it helped.",
        "its a expensive purchase, accidents can happen. What will you do if something goes wrong. you spill a cup of tea on it or it falls down from the corner of the bed.",
        "Why? Can you elaborate on this.",
        "Because they want it? What kind of question is that even...",
        "This is a reason why you should never pay by UPI for anything you would not regret seeing lost totally. It is convenient but lacks features like chargebacks.",
        "You're missing the point. Anyway, looks like he got the money back.",
        "Contact Peepoye on Twitter, he's an influencer and I guess he supports people on Twitter, try reaching him out.",
        "Be very careful when buying online. NEVER trust random online sellers. It sucks for all of the genuine small indie sellers, but that's life.\n\nI'm glad you got your money back.",
        "Best thing to do, contact a lawyer and get them to send a legal notice in such cases. It's not an actual case yet, but it may get companies to take it more seriously.",
        "Shit happens, it's life.\n\nThe one thing that I have a problem is you saying that you're suicidal because of this. You've got something really wrong going on OP. This shouldn't be your first thought, sounds like you're getting your money back, which is good, but please do work on your mental health,. for your own sake.",
        "Bro go to consumer court asap",
        "Credit Cards has something called chargebacks.\n\nCredit Cards have something called chargebacks. if you don't receive the goods or services you paid for. If you're scammed by a fraudulent seller, you can contact your credit card issuer and dispute the charge,  potentially getting your money back.have",
        "Mate just a thought, if you are getting broken and suicidal because of Rs. 76,000,I will advise to sell this laptop and seek mental health coach. \n\nCause this life is going to be a lot tougher than that. This mishap/mistake will seem like a luxury.",
        "So did they not take the cycle back. And was it very costly?",
        "If 76k makes your suicidal then you need to rethink your finances, spending &  future. It’s a drop of water in the bucket for most.",
        "Tag police and also place an FIR. And then talk to Flipkart, they'll usually take actions once they see the FIR report and all.",
        "I think if you purchase a Mac with student id\nYou will get it cheaper around same price so no need to order from some where else.",
        "Scammers are present in both at Amazon and Flipkart. But Amazon's customer service is what makes them better.",
        "It cost me 32.5k. Yes, they took back the cycle. Charged me 1000 rupees for packaging because I threw out the box. But I have peace of mind atleast.",
        "Yeah but first preference should always be offline especially apple products",
        "I’m surprised people still use Flipkart . Stopped using it 3 years ago. Absolute dogshit.",
        "Agreed.",
        "Oh, thnx good to know.",
        "Why people still use Flipkart don't get it , switch to Amazon or your local dealer. Amazon use Trusted sellers",
        "Dell, HP, Asus, Lenovo aren't meant for college when MacBook money is lost, OP has reach to a point considering Suicide...WHY?",
        "The OP said he got into a good college that's why his parents gifted him Mac. Why you care? Let he be happy",
        "Just search \"TREASURE HAUL ONLINE\" name online. There are multiple complain",
        "Just search \"TREASURE HAUL ONLINE\" name online. There are multiple complaints.\n\nSeems like they are fraud sellers. And still, Flipkart is allowing them to do business on their platform. Shame...\n\n*(Got another reason why I should not order from Flipkart)*",
        "While the current open box delivery being the sole option, and absolving any responsibility post OTP is definitely scummy from flipkart, flipkart isn't necessarily bad.\n\nMost of my purchases I do through Amazon, but my biggest ones like my LG C2, ROG Ally, two smartphones, galaxy watch I did through Flipkart with 0 issues. People just have to be vigilant and aware how both of the platforms work. Both platforms have sketchy sellers, just the scam processes are different and people at best apply their sleuthing skills learned from Amazon and fail to detect scams on flipkart.  \n\nIn the case of the LG C2 my plan was to purchase through Amazon but on the day of making the order the fulfilled sellers had their stock run out and had nonfullfilled sellers. At that point buying through FK Assured seller over a non-fulfilled Amazon seller was simply more trustworthy. I'd easily rate Amazon Fulfilled>>FK Assured>>Amazon random seller>>Flipkart sketchy seller. Agreed on the Apple store, unless something is exclusive most of the big companies like Apple, Samsung have the same prices everywhere with or without offers.",
        "I am not here to give you a lesson or to clarify your response, sure he is happy now (getting a refund) but  he shouldn't have witnessed suicidal thoughts at this young age.",
        "And the bigger scams are when they have some sort of failure with their pricing. I once ordered a memory foam pillow for 99 RS due to a pricing error. The smartass seller or fk, ended up sending a pillow from the street(had black marks and possibly mold). Immediately returned and wrote a review on the product, FK removed the review saying it's a seller review and not applicable to the product.",
        "Flipkart is a horrible place to buy electronics. I made the mistake of buying two phones. Never again. It's not your fault okay? I understand we feel dumb when we get scammed.but the scammers should be more ashamed of this",
        "Ever wondered why they are selling cheaper than the manufacturer themselves?",
        "I have faced multiple issues with Flipkart in the past. I once ordered a Dell replacement battery from them. Turned out the seller was selling batteries that were discontinued. Another time I ordered a technical book that was quite expensive and which I needed for my work. The seller sent me a copy of Pride and Prejudice - a good book but not what I ordered. I escalated the issue and it received a refund. One issue with Flipkart is negative reviews are simply removed!. I no longer buy anything from Flipkart and usually use Amazon.",
        "I really like the Croma Store because its prices are comparable to online retailers ,always use a credit card for purchases  my dad has got a amex card it looks lovely 😍😍",
        "This was covered in news too \n\nIndia Today: Man orders MacBook worth Rs 76,000 from Flipkart, receives boAt speakers worth Rs 3000.\nhttps://www.indiatoday.in/technology/news/story/man-orders-macbook-worth-rs-76000-from-flipkart-receives-boat-speakers-worth-rs-3000-2425455-2023-08-23",
        "Congrats .. today it’s even in news .. \n\nThank the reporter .. \n\n[India Today](https://www.indiatoday.in/technology/news/story/man-orders-macbook-worth-rs-76000-from-flipkart-receives-boat-speakers-worth-rs-3000-2425455-2023-08-23)",
        "It definitely a scam,I tried to withdraw money and there are telling me to pay 20% according to IRS,I almost fell for that too after paying $35k before I came across someone testify about the same platform,so I ask her how she get her money back from them,she then  introduced me to(@reclaim_assest) Instagram",
        "What about OP who gives OTP without verifying the product?",
        "Who rejected your claim? the bank or insurance company? I am thinking of  getting health insurance but I am not sure what its worth.",
        "The company I guess. It has a different name now.. It was my father's life insurance. I couldn't claim it after his death.  I don't know much about these things. The agents who came for investigation asked me for his medical history which I gave. I'm autistic and live alone I don't know how to deal with things like this so they most likely scammed me.",
        " I think you are right. I wish your father taught you how to deal with such circumstances. Looks like the company and an insurance company clubbed together for this scam. What's the insurance company name? It saves the rest of us by avoiding it.",
        "he should have :( IDBI life insurance.",
        "https://www.indiatoday.in/technology/news/story/man-orders-macbook-worth-rs-76000-from-flipkart-receives-boat-speakers-worth-rs-3000-2425455-2023-08-23\n\nIs this the same story...OP did u reach out to any media outlets... just curious",
        "Which AMD Ryzen processor? Please link me to an AMD Ryzen processor that benchmarks better than an M1, and is available in a 73k price range, I’ll wait. Not to mention a laptop that gives you 18 hours of battery life. Not many people care about Linux or User repairability. People however do care about having some of the best speakers on a laptop, a top notch trackpad, instant wake from sleep, etc. Some of you people are clueless about what the general public actually care about.",
        "Show me another laptop within a 73k budget that offers a 2K display panel, a processor that benchmarks as well as an M1, offers 18 hours of battery life, has speakers and a trackpad as acclaimed as the ones on that “3 year old MacBook Air”, or instant wake from sleep that doesn’t drain your battery. Please link me to a windows laptop that has every one of these things that doesn’t cost more than the 3 year old MacBook Air.",
        "I just looked up the E series thinkpad. A 1080p TN panel and 8 hours battery life for 70k is “far, FAR better”. Y’all love getting scammed. That is a garbage tier display for a decidedly premium price.",
        "Firstly, you are an Apple/TaylorSwift fanboy. Secondly...\n\nI consider machines that cannot run x86 software as not computers. ARM Macbooks are glorified iPhones (even have a notch now). I consider 10-12 hours of battery more than enough for a day. I consider unrepairable Macbooks as Fisher Price toys.\n\nAnyone outside of a use case of Final Cut Pro or audio production is not a traditional computer user and exclusively uses their Macbooks just as much as they would find use out of $200 Chromebooks – word documents, web browsing and 1080p video streaming.\n\nTouchpad and speakers are Macbook's strengths. But what about the weaknesses like:\n\n* a bad keyboard\n* bad durability\n* lack of repairability\n* user not being able to swap RAM and HDD/SSD\n* not being able to use Windows/Linux freely\n* lack of ports\n* lack of free software\n* incompatibility with non-Apple users (Windows, Linux, Android)\n* x86 incompatibility (95% of computer software is not made for ARM)\n* WHAT IS THE NOTCH DOING ON THE SCREEN?\n\n... and so on?\n\nMacbook is only good for people with the most basic surfing machine needs, something even a Chromebook can do. Its just a glorified Chromebook unless you are a Final Cut Pro or professional audio producer user. Objectively, this does make Macbook an inferior prospect for any user who want to do anything more serious than surfing the web.",
        "ThinkPad also has IPS options and your dookey Macbook glass screen with no anti glare film will be a piece of shit both outdoors and indoors. Indoors because there are tubelights behind you, unless you sit in bed to stream Netflix, and outdoors because there is sun and all kinds of bright objects behind you.\n\nI can use those 10 hours of battery life to actually do work and actually be able to create documents and files compatible with Windows, Linux and Android peers. Your hunk of expensive Fisher Price crApple cannot survive a fall and cannot run 95% of the software made for computers.\n\nAlso you are an Apple/TaylorSwift fanboy."
    ],
    "cleaned_text": "got scammed rs im broken suicdal know isnt correct subreddit rindia place get help please mordertor dont remove know youre gon na call moron didgave otp open box know im stupid first experience purchase alot money family mom crying eyes proof twitter twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws story need help ordered macbook website called flipkart price laptop rupeeson sale initial order delivery date th august delivery guy pick call th august finally picked call asked us come flipkart delivery hub receive package take days deliver order information item came open delivery rule means open order giving otp delivery boy item also came refund policy open box delivery reached flipkart hub delivery guy asked us give otp opening order said flipkart protocol get otp open order gave otp thinking flipkart rule know dumb call even worse im crying since th day delivery guy told us flipkart protocol never ordered anything laptop college everybody said im naive order flipkart know rs cheaper alot money middle class family like took otp opened box saw inside cheap speakers cost speaker received wrong cheap order please retweet twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws proof would like state footage evidence standing flipkart hub ii also capture face flipkart delivery executive iii footage delivery executive opening box means delivery boy open box us thearby eliminating allegation mightve changed item iv took confession delivery boy admitting received wrong product v cameras ekart hub might captured incident delivery guy ask us give otp delivery package means delivery guy asked us give otp handling us packagewe also called later made confess took otp first recorded contacted flipkart authority denied giving us refund came returns policy new reddit know help please voice show proof idk attach two videos ill try please retweet tweet idk send link video time please retweet tweet provided video proof posting tweet doesnt send post ill give twitter link comments im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws edit thank support ever pay gratitude yall support thank retweets likes flipkart offered refund yet see pressure asked seller name treasure haul online edit yayyyyyyyy flipkart called refund thanks ill post update theyll actually send money th ",
    "cleaned_title": "got scammed rs im broken suicdal",
    "cleaned_selftext": "know isnt correct subreddit rindia place get help please mordertor dont remove know youre gon na call moron didgave otp open box know im stupid first experience purchase alot money family mom crying eyes proof twitter twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws story need help ordered macbook website called flipkart price laptop rupeeson sale initial order delivery date th august delivery guy pick call th august finally picked call asked us come flipkart delivery hub receive package take days deliver order information item came open delivery rule means open order giving otp delivery boy item also came refund policy open box delivery reached flipkart hub delivery guy asked us give otp opening order said flipkart protocol get otp open order gave otp thinking flipkart rule know dumb call even worse im crying since th day delivery guy told us flipkart protocol never ordered anything laptop college everybody said im naive order flipkart know rs cheaper alot money middle class family like took otp opened box saw inside cheap speakers cost speaker received wrong cheap order please retweet twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws proof would like state footage evidence standing flipkart hub ii also capture face flipkart delivery executive iii footage delivery executive opening box means delivery boy open box us thearby eliminating allegation mightve changed item iv took confession delivery boy admitting received wrong product v cameras ekart hub might captured incident delivery guy ask us give otp delivery package means delivery guy asked us give otp handling us packagewe also called later made confess took otp first recorded contacted flipkart authority denied giving us refund came returns policy new reddit know help please voice show proof idk attach two videos ill try please retweet tweet idk send link video time please retweet tweet provided video proof posting tweet doesnt send post ill give twitter link comments im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws edit thank support ever pay gratitude yall support thank retweets likes flipkart offered refund yet see pressure asked seller name treasure haul online edit yayyyyyyyy flipkart called refund thanks ill post update theyll actually send money th",
    "cleaned_comments": "twitter httpstwittercomatharvastatustqptubjqntseawegs consumer court paid credit card try chargeback consumer court take months paid upi ive already started case consumer court theyre responding flipkart easily get resolved reach consumer court find journalist publish please tell find journalist student credit card limit rs live alternate universe maybe parents creditcard stupid mate could used parents credit card order lot times people use others credit cards order stuff avail discounts flipkart amazon many middleclass middleaged parents credit cards statistics stupid mate flipkart running big scam something alone check rindiagaming community flipkart review also post rindiangaming thank much says ita private community life worth k lighter note ajkal ek kidney fetch lakhs post twitter tag flipkart higher authorities influencers make tweet go viral means necessary viral enough hurt image flipkart theyll give full refund along extra ive posted tweet tagged people news channel still response suspected crime defraud happening flipkart center dialed right strange people dont think police cases moment police gets involved party changes tone flipkart would wanted resolve soon possible calling assistance crime feel honestly duped option consumer courtyou cant even blame flipkart especially brought open delivery thing put stop kind frauds also threaten delivery executive case fraud never delivery executive asked otp hand case open box delivery instructions clearly says give otp checking box seems delivery boy knew well fraud else wouldnt ask otp delivery people removing original products clever opening packing mention consumer complaint well police complaint mentioning name along flipkart thank everyone saying filed case aswell said sorry didnt knew final reply dont see point replying fuck actually wrong suggestion didnt assume credit card said paid credit card file chargeback methods payment credit debit cash usually credit card huge discount product people ask relativesfriends use credit card order product even right price macbook k flipkart hdfc credit card bring price k ops price shut fuck statistics doesnt play role unless op told paid debit credit upi assume ways payment possible one used credit cards would right lot people use order big purchases especially discount huge stupid statistics argument also twisted many middle class people buy macbook statistics found late open box delivery flipkart explained went file case police said cctv days parcel coming parcel going asked hes denying ka laptop mangaya par nikla sasta speaker flipkart ka scam go local thana get complain done become official legal escalate matters local ekartflipkart level also go local newspaper office pics local newspapers like kinds new consumer court bhi ja unlike courts consumer courts better dont even need lawyer also keep tagging relevant authorities twitter make longform post fb well tagging state police dgp cm etc etc ordered ipad pro apple pencil flipkart post order confirmation specifically mentioned site regd open box delivery guy came home unboxed front even turned device recorded everything gave otp shouldve cognizant since lot people end rin soap bars ordering phones ive done everything ive went police par unhone kaha cctv proof office didnt steal consumer court case dalathey said months lag sakte hai yes know first expensive item said protocol wasnt tech savvy hmm ive ordered laptops places wasnt ideal damaged keyboard least right item considering organ donation money illegal keep money kidney leave complications life bro recently got scammed understand situation suicide isnt solution youll earn back giving life isnt answer ways solve problem lol go consumer court find delivery boy gon easy get ass real good know recorded said nit ny life lesson never purchase high value items flipkart heard way many incidents like amazon offline way go amazon better please raise grievance pmo portal please raise multiple concerns possible consumer forums government even amazon safe nowadays buy offline croma mostly matches online prices flipkart open box delivery joke customers ensure right product delivered take zero responsibility whatsoever im really sorry hear situation heres tweet suggestion post twitter absolutely gutted furious got scammed rs flipkart delivery guy delivery executive manipulated us provide otp opening box found cheap speakers instead macbook ordered flipkart flipkartsupport okay familys hardearned money gone shattered delivery executive played part ive got evidence videos photos confession middleclass families rely platform treated unbelievable statepolice hope youre watching flipkartscam justiceneeded tweet tag state police written statepolice bhai tu alag level ka chootiya hai gates local district magistrate thana appearing newspapers think newspapers wont take fuckers dying non political contents heck could even involve local politicians especially trade wings nowhere go rindia rindia come tum naive nahi ho bhai actually bevakoof ho bhai reddit par kitni baar mana kiya hai flipkart se expensive saman mangwane ko chal ab shant hoja jo ho gaya hogaya aage se dhyaan rakhna bhai wha bhi daal diya definitely devastating situation anyone belonging middleclass try reaching executive flipkart regarding didnt say anything try reach another agent flipkart tell situation every detail possible surely something referencehttpswwwflipkartcompagesopenboxdeliverytnctextincaseyoufindthethetimeofthedeliveryf famous comment im adding twitter link please retweet sweetest twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws always buy expensive things official store watches laptops shoes expensive cosmetics used say police got scam filed complaint cyber cell office took lightly visits cyber cell started saying aap abhi yahan aana band karo hum investigate kar rhe hain months response since used make fun behind backive heard whenever went enquire case rlegaladviceindia post sub learned hard way twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws dumb evidence make post x tag im sending twitter everyone wan na retweet twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws subah gadhe ka gobhar khaya mat kar nahi toh aise hi yahan par aa kar huggega empathy chipkali ki cut bechara stressed hai aur tu uski mental wellbeing ki gend mar raha hai twitter therapy ke paiss bacha raha hu uske loduchand doesnt buck uske k ke saath saath trust karne ki capacity bhi jaygi awwlelele se teri duniya chalti hogi lower middle class nahi chalta many credit cards wtf retweet im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws got scammed rs thats saving thats alright earn back worth life according policy otp given product found wrong free return full refund cash paid itll refunded immediately online payment itll take processing days talk flipkart customer service get returned unfavourable approach consumer court youll get money back sure got scammed rs thats saving thats alright earn back worth life said per open box delivery youre refundable im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws yeh sare scam flipkart pe hi kyu ho rhe thought things would gotten better walmart investment honestly easily avoidable vigilant feeling sorry bro life must hard shit people please file case claim crore least flipkart must compensate mental breakdown making one people actually received rin soup bar ordered iphone long time back amazon instead flipkart ordered ipad pro apple pencil flipkart post order confirmation specifically mentioned site regd open box delivery give otp verifying box contents guy came home unboxed front even turned device recorded everything gave otp op shouldve cognizant since lot people end rin soap bars ordering phones file consumer court set fire come running resolve matter file flipkart delivery service later dont settle product needed take legal help bhai tujhe therapy ki sakth zarurat hai supportive doesnt require one financially rich seriously need seek help know wont accept phir bhi bolunga aur acche therapist ke paas jaana boht bekar pade hue hai paid amount using credit card file chargeback credit card issuer attaching proofs youll get resolution recently faced issue mobile phone filed chargeback got refund yes tera baap ameer hoga mere wala would consider things justified cause war mai aur flipkart wale dono pitte sp aur mla alag involved hote shaam tak notice aur raat tak media brief tayar ho chuka hota kyu tujhe experience hai kya bekar walo se katwane ka isiliye empty advice aur mere moral support dene mein expert ho gaya hai learnt best also add cyber cell twitter applicable definitely add news channel social activitist ids file complaint police give us update sure journalists lurking around subreddit waiting see concrete step side go twitter post profile every evidence contact youtubers like techpedia help plz retweet twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws yes police complaints escalating flipkart using twitter etc one thing guaranteed work know scamsters work take legit break school assuming bachelors start working hard earn k th pay money back rejoin school boost resume need give reasons break years say took break year pay hr interviews lap shit guess must mandatory civil servants bunch clowns advice op fir option target guy flipkart office staff took otp opening box op trying reply everyone alot comments thank hbkdll pls help im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws high time stop using flipkart flipkart terrible took months get refund rs router even receive buy groceries thank chatgpt never use croma online worst anything ever experience offline good tho helping pls help im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws believe friend ordered k washing machine front loading door broken cooporation flipkart spend money get fixed open box delivery thing consumer court take time threat case filed scares companies keep messaging ask escalate issue recently got money back cultfit fighting month possible middle class buying macbook thank much advice im trying get retweet put pressure pls help im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws post tweet link people make viral feel bad situation file fir flipkart give copy evidence police along complaint ensure complete set evidence well dont blindly give police without keeping copies approach consumer court file complaint copy fir evidence whatever youre legally nothing goes later process take time thats option fight rights immediately longer take initiate legal process diluted issue become act fast dont cant get money back go local newspaper get story published try reach twitter etc make complaint herehttpsconsumerhelplinegovin multiple avenues mentioned record calls flipkart customer support also email video proof grievanceofficerflipkartcommailtogrievanceofficerflipkartcom csflipkartcommailtocsflipkartcom csheadflipkartcommailtocsheadflipkartcom mention dont help youll getting touch dept consumer affairs find mail ids media handles online mail dump everyone hope least contacted police first thing victim crime first incident report becomes basis action would also suggest post rlegaladviceindia contact consumer guidance society india feel flipkart negligent offices every state consumer protection job buying college showoff im sorry pls help im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws ive contacted police started case lawyer said might take months pls help im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws rkothibanglacheck ive tweeted mailed youtubers pls help im sending twitter link everyone case wan na help twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws avoid flipkart bro feel sorry fuck scammers hope u get ur money back drawback upi refund headache credit cards safer ive learned hard way heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws lost k stock trading k left bank ac ate pizza rs slept struggled months made money need kill k fight indian people please always take video unboxing parcel even costs less thank later ive contacted police filed fir started case lawyer suit filing criminal civil filing lawsuit call consumer guidance society india wont even pay lawyer fight behalf seeing many issues online ecommerce stores guess buy high ticket item offline headaches ans chance scams search local news channels find linkedin dm case evidence bro still hope pressurise flipkart video talk seniors cs chance flipkart consider investigate talk cs frequently case get escalated say possible refund tell wan na talk seniors explain dont give thank already found local news told flipkart ill send news heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws thank try tagging investor house accounts well tagged heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws whatever happens dont consider ending life even second trust lot money someone afford mac book nothing wrong dont even consider punishing way rubbish completely wrong u get tat parcel home still place flipkart centre u recording flipkart peraon requesting ubto give u otp prior package opening flipkart person wrong see usually entry otp ok clearly seen flipkart person mever entered asked otp waited deliver laptop home advice since gotten money back flipkart twitter dont write many big tweets main tweet problem explained flipkart support tagged tagged separate tweet demanding justice matter mentioned write matter short precise manner tag flipkart support reply explain matter detail inbox writing many tweets main problem even visible tag wont able respond many many people tagging get difficult see tag come profile check tweet explaining problem leave tweets better reach write simple short tweet tag flipkart support reply immediately fk organisation lacks accountability specially high ticket item seen lot news reddit hence treat fk low ticket items dont even use hi sorry hear understand may easy specially family positive articulate hence firstly know addressable certain extent hence need smart take control flipkart ves xb flipkart hub also capture face flipkart delivery executive footage delivery executive opening box means delivery boy open box u video available confirming opening package different product confession delivery boy admitting received wrong product cameras ekart hub might captured incident delivery guy ask us give otp delivery package ves xb despite clear instructions provided otp opening package delivery executive manipulated thinking otp needs given xb sugestions xb stop sad evidence favour use build case make fk accountable write clear mail points share video mail well twitter ask support friends reddit community let retweet wont clearly state email instructions clear demanded see product executive warehouse yet flipkart executive maniupulated believing fk rulepolicy give code product attach video hopefully voice recorded ok fk executive asked multiple times see code product trained part scam fk safeguarding customers behaviours customers manipulated giving codes handover product wrong fk says arent accountable clearly state fk accountable game well sure tell must consumer court police complaint evidence create case tag senior leaders flipkart tweet think youll refund police case news article must help get expedited good luck sorry loss shame happened flipkart shit show days ngl mentioned middleclass family money issue buy macbook could got better powerful laptop k range could saved cost kmy mom said thinka ones college buy something good ive never purchased anything expensive financial condition since good college achievement thought itll like gift ill eatm alot good college heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws steps vigilant post linkedin tag flipkart current officials everything still trouble check tweet retweet gets highlighted thank ill understand correctly someone sent wrong item flipkart hub would suggest raise request flipkart file fir bro never ever give otp unless youre satisfied hopefully get product money good luck consumer court best bet exactly situation friend issue flipkart regarding one samsung galaxy flagship phone took around months got money back youve required evidence file case asap keep tweeting daily videos etc also tag tech youtubers like geekyranjit mentioned video faced issues flipkart stopped using flipkart ever since saw video everyone times better also use credit card future isme suicidal kyu bhai yeah bro im sincerely sorry hope gets better learn let affect treat people doesnt matter said see tnc whatever written source truth send customer care person ask follow tnc take court fraud said cant return heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws try getting touch bank see raise dispute fraud side go police file complaint national consumer helpline resolved within weeks got scammed ordered earbuds flipkart gave shell earbuds inside gave empty circular thing earbuds works smaller transactions higher disputes companies take thank much ill want call idiot providing guy otp paying k years old macbook else buy instead macbook thought apple runs smoother bad advice police need chai pani first agree even listen ive got experience case dont ever post things social media e commerce team social media team handles cases directly reject claim things dont buy expensive things online websites even looks cheap things scams trick scam people looks like got scammed best thing go consumer court file complaint attractive discounts precisely scam even flipkart assured blocks form return assured products carry open box people vigilant giving otp open box take half hour one hour inspect let delivery guy wait delays hit flipkart stop bs yeah local ones wont even file cases stalking forget money scams always use amazon dont worry money always earn back fuckflipkart always buy online credit card anything goes bad file chargeback best bet approaching consumer court theres low chance youll get money back still better nothing sorry hear youve gone hope get kind reimbursement scams like made leave india india developing lightning fast speed core issues still unsolved problem cultfit facing issue aswell appears obd final confirmation link shared updated since dec never use flopkartcom even bought domain flopkart coz knew bought exercise cycle month started making noise amount repair would fix like next repair would final next repair sort issue fight call get money back used croma online buy laptop experience smoother babys butt delivery guy sketchy shouldnt asked otp first genuine httpsimgurcombopph appears obd final confirmation tnc linked mention lol literally decent windows laptop dont worry get money back dont give obd popuphttpsimgurcombopph would appeared final order placement goofed didnt notice excuses flipkart third term beyond ridiculous get go would keep executives wait hours sure things correct bhai retweet kiya hai agar refund vagera kuch hua toh yaha par bhi update kardena scams happening cause last mile operations scams andnot ecommerce portals file case flipkart also ekart also reach communities try get viral entities share much possible probably days get resolution try involve many people create fake social media accounts spam shit single thread many platforms possible spike numbers hit counters well thank bhaiya thank much ill follow advice please retweet heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws think tweet fks latest tweets account way get visibility get response whatever latest ads twitter go fks post tweets comments replies sorry happens others since company become notorious responsibility call purchasers high value electronic item even automated call explain properly open delivery procedure agree im informed things ill said thank much ok sure saw video evident body language done ekart guy raise consumer case provide gstin number ekart delivery centre unke dhande pe attack kro possible raise case police help opposition ruling leader twitter pe tag kro unko worked global fraud analytics amazon tell common fraud modus operandi world bro u living delusion life even ya dm ask share ur news ask u pay money first get money back small amount court case takes time loose money keep much proof sorry happened since opened package premise sufficient proof pursue consumer court required try lookup top executives linked reach needed lastly dont beat self happens best people inspite awareness fine since launch amazon never ordered indian owned website simply dont know business integrity lot companies dont want come india setup business lack business ethics also west known running scams looting innocent people posed question ai got following response summary analysis reddit post along suggestions actions summary op ordered macbook air flipkart rs delivery scheduled august th delayed august th delivery executive asked op collect package flipkart hub directly hub executive asked otp letting op open package providing otp op discovered cheap speakers instead laptop ordered flipkart refusing refund due noreturns policy open box deliveries op seeking help escalate issue get refund analysis seems like clear case fraud delivery executive swapped product getting otp op fault provided evidence including cctv footage confession flipkart taking responsibility despite protocol violated op stands lose significant amount money needed college suggested next steps continue posting twitter evidence tag influencers journalists police authorities etc raise visibility contact consumer court already done pursue case actively try escalating within flipkart emailscalls senior management lodge fir delivery executive fraud swapping products consider approaching local newspaperstv channels highlight issue post platforms like linkedin directly engage flipkart employees key give continuously pursue angles flipkart forced intervene provide refund remaining persistent raising visibility seems best approach based information provided give otp checking product incase flipkart expensive device tell give otp checking product counter scams flipkart fault rd party sellers scams anyone make seller account amazon flipkart always check seller purchasing like amazon appario retail private ltdhttpswwwamazoninspmarketplaceidatjruunkgvselleraczowivehlgisamazonfulfilledrefdpmerchantlinkasinbqqpgdbg others official sellers flipkart omnitel retail retailnet etc genuine sellers avoid new sellers scam sellers always new seller ebay bro go consumer court also keep proofs contact prod purchased bill etc fuck flip kart hmm rookie mistake made op think delivery executive scam smartly forced give otp unpacking technically cleared accountability afterwards flipkart need sleep days get something done cyber cell service better yes true given know scams continue using flipkart safeguard making mistakes although solution good enough fix given dont see much incidents amazon flipkart fix issue im broken suicdal part worrying please worry may waste time believe sufficient evidence get money back keep k meri mahine hi salary h life worth months salary lost money probably never recoup wasnt even money wasted guilt bahot hai suicide solution pmo portal really curious peoples reactions problems subreddit sorry got scammed harrowing experience really broken really suicidal laptop even scammed dont get money back really loss paid life saving medicine anything sort obviously fight flipkart hope get money back please learn contexualise problems might help well flipkart sucks thank idk precise proof helping delivery guy confessiom camera recording ekart hub im ready give heres video delivery boy opening accepting got scammed plz also repost twitter httpstwittercomatharvastatustdjrhnnghfyogrnhwws observed something taking time expected usually wrong product seller doesnt item recently ordered expensive cream abnormal discount amazon delayed arrived days expired cheap cream inside though called amazon told pics got refund within hours told keep cheap cream flipkart seller flipkart ekart delivery offices full cctv cameras stolen inside office would captured recommendation file police complain go police officer flipkart office manager may allow check cctv footage alongside otherwise put pressure flipkart well flipkart office twitter tag ceo walmart walmart ceo everyone top related flipkart file fir first ye jyada bada fraud nikla wan na emphasise please love god dont buy anything flipkart people zero ethics care customers shouldnt delivery guy upload pictures item purchased app case open box delivery isnt procedure dont buy fk often ordered something first time last week open box policy guy asked otp opening delivery stupid enough share could open box im familiar fk delivery procedures since order amz buy online realized dumb shared luckily item good notice taking pictures product every angle unboxing upload app didnt delivery guy ops case proof delivered actual product right definitely going asshole k life death amount op buying macbook least priorities many windows laptops cheaper options damn feeling really sorry flipkart seem hitting new lows everyday agree suicide solution even priorities wrong always buy expensive things offline traveled another city buy laptop recording always record wide angle full resolution fully lit light use flash required make sure delivery boy face visible turn background noise example tv speaker song recording speak time date product name recording proof nothing wrong time fight scared anything money scammed every right escalate matter k small amount refunded ive seen people loose savings flat built bogus papers bad experience amzn years ago received empty box laptop purchase order wasnt amzn fulfilled either received refund week long calls emails receiving refund purchased amzn time fulfilled product amzn imo takes care customers issues least experiences scratched ass sandpaper also try check seller find seller get contact details add case yep large amount cant afford lose shouldnt bought macbook even require laptop work cant afford good one using window keep us updated situation got ta make sure doesnt happen others well ordered things flipkart open box thing truly nerve wrecking make sure get recompensated also flipkart change anti consumer policies see use local area supporters police station request view footage smells like underhanded money exchange amazon also scam scammers quit flipkart joining amazon would advise people buy offline purchase anything rupees always nice laptop mac lazy simp thinking disgusting contradicts lot people success social media worth trying least month much money giving post linkedin sensationalize itll reach higher ups youll get resolution flipkarts ekart logistics run local mafia gundas purchased apple mac got scammed suicidal someone dealt suicidal person either get therapist unstable likely dont hyperbole take words like suicidal depression vain flipkart openbox delivery means need open recording item correct get money back replacement courage calm get recording flipkart hub unboxing report consumer complaints go cyber crime office file fir seller seller address found invoice cant ask local ca someone work help identify owns gst number money safe dont need worry file case seller rather flipkart ask give laptop compensation mental health damage file complaint flipkart take months even go court atleast lawyer standing front flipkart rlegaladviceindia wtf scolding buying mac either way would lost k thinkpad would far far better use windows linux comfortably also durable better keyboard officially allows user repairability manual along multiple ports file case cheating money hard earned money many people feels work save months spends wishes go drain media dont give rats ass scams many routine daytoday life sexscandal involved somehow retwitting bhai understand youre going dont harsh dont understand people keep purchasing apple products third party sellers two physical apple stores pick genuine products direct manufacturer order online direct involve scammy third party like fk honestly consumer forum option left hire lawyer send legal notice flipkart first anyone telling somehow fault sharing otp opening box fuck right fault scam like frequent flipkart fact happened company warehouse clear evidence handed product ordered basically criminal negligence illegal whole open box policy illegal involves flipkart basically washing hands scams happening platform telling customer dodging scammy sellers responsibility thats fucking bullshit nowhere world ecommerce work like heck even ebay involves persontoperson sales better consumer protection im sure even buying knockoff items aliexpress isnt bad experience long know buying personally ordered one thing flipkart past years stick amazon pixel phone since amazon officially sell whole experience really annoying delivery agent unboxed phone doorstep peel plastic wrapping turn take fourfive photos unboxed phone fiddle touch screen handing collecting otp might seem petty totally ruins joy unboxing new piece tech booting first time flipside recently bought macbook air apples online store shipped via bluedart hassles item delivered tamperproof package otp collected unboxed thing peacefully leisure hours later paid upi thats mistake always pay expensive goods credit card one well known international chains usually good fraud protection built price variant national consumer disputes redressal commission ncdrc india quasijudicial commission india set consumer protection take matter agency theres way soften blow op long fight better convince dont think getting money immediately keep cool head keep trying many avenues observations box sealed loosely doesnt seem happen deliver product like laptop clearly done delivery agent someone involved freight must known policy gets otp would get freehand crime mention several times give otp inspecting product said protocol wasnt tech savvy hate break totally trusted delivery guy written instructions company dont think claim flipkart choose ignore instructions consumer grievances surely respond lure discounts order laptop flipkart bbdays lucky days used return refund policy unlike presents open box delivery upcoming bbdays order another one sister skeptical time due flipkarts shenanigans yeah scam bad company pay nose macbook could also fallen hand broke could someone spend money macbook go suicidal doesnt work hey first relax take deep breath case solved clearly genuine case based video evidence big company whenever cases happened buyer manage get refund see fk social media team already replied saying looking one suggestion post linkedin tag folks fk especially head social media head marketing definitely see issue get resolved consumer court option take printout order flipkart website show also show item received amazon better flipkart day week please provide number website link national consumer helpline another lesson youve learned know youre buying dont ask someone research product websiteseller asked someone knows things regarding expensive products would first advised buying flipkart second advised buying macbook college hope courts help make sure highlight delivery centrepeople everything never buy anything flipkart exactly literally comes popup mentions returns case otp provided hey please go filpkart order section also mention name seller posts might also put pressure seller seriously wonder age people advising upvoting police journalists news channel route none care scam around yr old device earn bribes ads every hour consumer complaint lawyering realistic result ops case reading three line popup comes payment specifically mentions provide otp satisfaction also returns possible otp take screenshot sellers name update post others aware example xb yes seller know wont involving police work mean find seller solve issue right mac bros tend basic research purchases apple otherwise exceptionally fitting op ignoring three simple sentences pops flipkart opendelivery making payment opposite three lucky semblence proof implicates flipkart representative following terms renamed scamkart n flipkart give example searched macbook flipkart found seller good rating maybe delivery guys scammed youre middle class failed basic research spending significant money beyond applies choice mac failing read three simple sentences flipkart displays openbox making payment solved lost lakh rs crypto lower middle class family life time savings didnt think suicide dont say stupid things like yeah looks like value k life youve got issues losing k ask literally amounts little nothing long run try get back otherwise make peace getting scammed move good true probably think k lesson move many complaints seller hope links help httpswwwgooglecomsearchqtreasurehaulonlinesourceidchromeieutfhttpswwwgooglecomsearchqtreasurehaulonlinesourceidchromeieutf bhai exactly thoughts trivializing something like suicide macbook college keep together brother case seems strong enough plus video evidence something turn favour ignore macbook purchase basic research done dell hp lenovo instance fleece people windows laptops similarly proof likely get refunded saying goes fool gold soon parted parents paid file complaint thats remedy statement hard work parents city people asking go consumer court order another macbook pro time better spec version keep macbook tell delivery giy fuck close doorhe say lose job bullshit say problemafter week flipkart call ask sir tell say file police complaint tell go ahead wont lakh rs bad publicity done know victim something like thisyou dm need help wait middle class guy need mac book pro worth k one thing keep mind always use credit card purchasing stuff online similar incident got fridge delivered little defective told replacement replacement even sent reached city canceled claiming reach seller apparently issue raised damaged defective since open box delivery imno visible damage found ive calling flipkart seller hoping resolved never expected services flipkart dont know city youre things consumer court b local police station c maybe try contacting youtuber covers scam related content could make incident viral youve photo video proof back might help making case reach people pls contact local newspaper even bigger ones like times find writes crime reports mail id given mail details contact editorial love cases hope get back money sure application also available ios android recent post rindia girl scammed via amazon yes thats lot money need feel suicidal luck discipline earn money future happen anyone learn lesson move macbook air macbook pro yes understand point fact could afford pay rs laptop upfront suggests means huge amount regardless worth ending life take l try best recover people already given good suggestions including consumer court honestly dont buy anything flipkart ordered k worth art supplies washi tape etc theyre showed images asked return refused another box sent alreaady opened less tapes fucking hate open box crap flipkart pulls ruined phone unboxing experience delivery person touching phone filthy hands covid unbox record one along delivery person filming needed dont worry consumer court get money back good chunk extra money harassment pain middle class people save buy macbook op lost lacs idbi bank im middle class never ever think money worth life long health make money case need even worry proofs flipkart cant scam like please reach consumer court thats always use amazon lots scams related flipkart rarely related amazon infact amazon customer much better flipkart try best solve problems asap flipkart worst lifebuoy ka sabun hai ye log percent bro dont stress know lot money india youll get senior career money nothing seconded also attempted buy expensive laptop fk played several games delayed delivery response agent order delivered received increased price asked pay remaining uske baad delivery hogi spent month case finally chargeback cuz lucky used cc bro update us issue gets resolved credit card thank got called refund ill update theyll send money account thatll th august dont explain purchases random strangers choice buy avoid flipkart bought pixel delivery guy however gave box told unbox check weird unbox standing doorway atleast unboxing still pretty dumb policy honestly welp better luck next time guy playing dont trust losing macbook makes suicidal different problem worry money lost credit card istemal kar ho aur k ka laptop hai aur apne aap ko garib bata ho moron period also buy things credit card charge back dont know op personally see moron probably late teens share incident lost much amount tf bro fuckcart op late teens bacha hai abhi congratulations brother completely stopped using flipkart since day news people receiving bricks soap bar worked social media specialist cant even tell many tweets customer received defective product never really received product never refunded money smartphones tv laptops wonder platform still trouble literally looting customers mental harassment comes later speaking customer care representatives mostly lack manners etiquettes one thing found recently flipkart reviews tv smelling suspicious know later whenever purchase tv manufacturer get touch whatsapp offer extended warranty months exchange star reviews basically regardless products quality service assistance build quality shelf life one would end buying faulty product made till thanks sales like big billion days check twitter hashtags blood boiling see big fraudulent company even loss empathise someone whos suffering insurance money rejected claim put twitter op learn cross posting helpful staying reddit didnt read gets suicidal k rupees like lol bro really really ready give life much good work fam thats love reddit college work requires k macbook sad say hum aise law order ko empower karne ke liye tax bharte hai would save buy macbook hello brother glad got money back know extra careful cheers whats otp lesson number dont ever order bitch called flipkart give attractive offers attract honeybees like best go consumer court couldnt help forget money common scam run flipkart aware open delivery terrible theyre absolving responsibility someone isnt always going physically present first k worth sucidal calm second youre dumb literally scamming said flipkart protocol wasnt wont surprised new type scam depivery boy part people really need careful read terms conditions websites purchasing stick local purchase simplicity less hassle avoiding getting scammed retweeted hoping helped expensive purchase accidents happen something goes wrong spill cup tea falls corner bed elaborate want kind question even reason never pay upi anything would regret seeing lost totally convenient lacks features like chargebacks youre missing point anyway looks like got money back contact peepoye twitter hes influencer guess supports people twitter try reaching careful buying online never trust random online sellers sucks genuine small indie sellers thats life im glad got money back best thing contact lawyer get send legal notice cases actual case yet may get companies take seriously shit happens life one thing problem saying youre suicidal youve got something really wrong going op shouldnt first thought sounds like youre getting money back good please work mental health sake bro go consumer court asap credit cards something called chargebacks credit cards something called chargebacks dont receive goods services paid youre scammed fraudulent seller contact credit card issuer dispute charge potentially getting money backhave mate thought getting broken suicidal rs advise sell laptop seek mental health coach cause life going lot tougher mishapmistake seem like luxury take cycle back costly k makes suicidal need rethink finances spending future drop water bucket tag police also place fir talk flipkart theyll usually take actions see fir report think purchase mac student id get cheaper around price need order else scammers present amazon flipkart amazons customer service makes better cost k yes took back cycle charged rupees packaging threw box peace mind atleast yeah first preference always offline especially apple products im surprised people still use flipkart stopped using years ago absolute dogshit agreed oh thnx good know people still use flipkart dont get switch amazon local dealer amazon use trusted sellers dell hp asus lenovo arent meant college macbook money lost op reach point considering suicidewhy op said got good college thats parents gifted mac care let happy search treasure haul online name online multiple complain search treasure haul online name online multiple complaints seems like fraud sellers still flipkart allowing business platform shame got another reason order flipkart current open box delivery sole option absolving responsibility post otp definitely scummy flipkart flipkart isnt necessarily bad purchases amazon biggest ones like lg c rog ally two smartphones galaxy watch flipkart issues people vigilant aware platforms work platforms sketchy sellers scam processes different people best apply sleuthing skills learned amazon fail detect scams flipkart case lg c plan purchase amazon day making order fulfilled sellers stock run nonfullfilled sellers point buying fk assured seller nonfulfilled amazon seller simply trustworthy id easily rate amazon fulfilledfk assuredamazon random sellerflipkart sketchy seller agreed apple store unless something exclusive big companies like apple samsung prices everywhere without offers give lesson clarify response sure happy getting refund shouldnt witnessed suicidal thoughts young age bigger scams sort failure pricing ordered memory foam pillow rs due pricing error smartass seller fk ended sending pillow streethad black marks possibly mold immediately returned wrote review product fk removed review saying seller review applicable product flipkart horrible place buy electronics made mistake buying two phones never fault okay understand feel dumb get scammedbut scammers ashamed ever wondered selling cheaper manufacturer faced multiple issues flipkart past ordered dell replacement battery turned seller selling batteries discontinued another time ordered technical book quite expensive needed work seller sent copy pride prejudice good book ordered escalated issue received refund one issue flipkart negative reviews simply removed longer buy anything flipkart usually use amazon really like croma store prices comparable online retailers always use credit card purchases dad got amex card looks lovely covered news india today man orders macbook worth rs flipkart receives boat speakers worth rs congrats today even news thank reporter india todayhttpswwwindiatodayintechnologynewsstorymanordersmacbookworthrsfromflipkartreceivesboatspeakersworthrs definitely scami tried withdraw money telling pay according irsi almost fell paying k came across someone testify platformso ask get money back themshe introduced toreclaimassest instagram op gives otp without verifying product rejected claim bank insurance company thinking getting health insurance sure worth company guess different name fathers life insurance couldnt claim death dont know much things agents came investigation asked medical history gave im autistic live alone dont know deal things like likely scammed think right wish father taught deal circumstances looks like company insurance company clubbed together scam whats insurance company name saves rest us avoiding idbi life insurance storyop u reach media outlets curious amd ryzen processor please link amd ryzen processor benchmarks better available k price range ill wait mention laptop gives hours battery life many people care linux user repairability people however care best speakers laptop top notch trackpad instant wake sleep etc people clueless general public actually care show another laptop within k budget offers k display panel processor benchmarks well offers hours battery life speakers trackpad acclaimed ones year old macbook air instant wake sleep doesnt drain battery please link windows laptop every one things doesnt cost year old macbook air looked e series thinkpad p tn panel hours battery life k far far better yall love getting scammed garbage tier display decidedly premium price firstly appletaylorswift fanboy secondly consider machines run x software computers arm macbooks glorified iphones even notch consider hours battery enough day consider unrepairable macbooks fisher price toys anyone outside use case final cut pro audio production traditional computer user exclusively uses macbooks much would find use chromebooks word documents web browsing p video streaming touchpad speakers macbooks strengths weaknesses like bad keyboard bad durability lack repairability user able swap ram hddssd able use windowslinux freely lack ports lack free software incompatibility nonapple users windows linux android x incompatibility computer software made arm notch screen macbook good people basic surfing machine needs something even chromebook glorified chromebook unless final cut pro professional audio producer user objectively make macbook inferior prospect user want anything serious surfing web thinkpad also ips options dookey macbook glass screen anti glare film piece shit outdoors indoors indoors tubelights behind unless sit bed stream netflix outdoors sun kinds bright objects behind use hours battery life actually work actually able create documents files compatible windows linux android peers hunk expensive fisher price crapple survive fall run software made computers also appletaylorswift fanboy",
    "light_cleaned_title": "I got scammed of Rs. 76,000. I'm broken and suic*dal.",
    "light_cleaned_selftext": "I know this isn't the correct subreddit. But it's r/india and only place I can get help. Please mordertor don't remove this 🙏🥺 I know you're gonna call me moron for what I did(gave OTP on open box) and I know I'm stupid because this was my first experience purchase. It's alot of money for my family and mom is crying her eyes out. Proof in twitter:- [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Here is story: I need your help. I ordered Macbook M1 from a website called as Flipkart. The price of laptop was 76000 rupees(on sale) Our initial order delivery date was 13th of August, but delivery guy did not pick up our call. On 15th of August he finally picked up our call. He asked us to come to Flipkart delivery hub, to receive our package because it will take him to more days to deliver our order. For your information the item came under open delivery rule. That means you have to open the order before giving the OTP to delivery boy. The item also came under no refund policy, as it was an open box delivery. When we reached to the Flipkart hub. The delivery guy asked us to give OTP before opening the order and said it is a Flipkart protocol to get OTP before you can open your order. We gave him the OTP thinking that it's Flipkart rule. (I know I am dumb. You can call me that and even worse. I'm crying since th day). Delivery guy told us it's Flipkart Protocol, I have never ordered anything and laptop was for college. Everybody said I'm naive to order it from Flipkart I know! It was 14000 rs cheaper and it's alot of money for middle class family like me. After he took our OTP, he opened the box. When we saw inside there were some cheap speakers, cost of the speaker was 3000. We received a wrong and cheap order. Please retweet 🥺 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) We have few proof that I would like to state: I) We have the footage and evidence that we are standing in the Flipkart hub. ii) also capture the face of the Flipkart delivery executive. iii) we have footage of the delivery executive opening the box that means the delivery boy open the box and not us. Thearby eliminating the allegation that we mightve changed the item. iv) we took the confession of delivery boy admitting that we have received the wrong product. v) the cameras in the ekart hub might have captured the incident that the delivery guy ask us to give OTP before delivery our package. That means it was the delivery guy who asked us to give the OTP before handling us our package.(we also called him later and made him confess he took OTP first and recorded it) We contacted the Flipkart authority. They denied giving us our refund as it came under no returns policy. I am new on Reddit. I do not know how it will help but please be my voice ▲ I can show you proof. Idk if can attach two videos here, I'll try! Please retweet my tweet A Idk how to send both link and video at the same time! Can you please retweet my tweet? I have provided video proof there (After posting tweet it doesn't send the Post) I'll give Twitter link in comments) I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Edit: thank you for all your support ❤️ how can I ever pay gratitude to y'all for support? Thank you for all retweets and likes. and no Flipkart did not offered a refund yet but I see them being in pressure. You all asked me for seller name it's :- TREASURE HAUL ONLINE EDIT: YAYYYYYYYY FLIPKART CALLED ME FOR REFUND 💖🥳🥳🥳🥳🥳 THANKS TO ALL OF YOU 🥺💖 I'LL POST AN UPDATE WHEN THEY'LL ACTUALLY SEND ME MONEY ON 28TH 🥺💖💖💖",
    "light_cleaned_comments": "[Twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=qP-TU9BjQ_nTse9A2w48eg&s=19) Consumer court, and if you paid by credit card try a chargeback. Consumer court will take 3 to 6 months and I paid by UPI. I've already started a case in consumer court. They're not responding. The Flipkart You can easily get this resolved. Just reach consumer court and find a journalist who can publish this Please tell me how to find a journalist 🙏🥺 A student with a credit card limit of Rs 76,000? Do you live in an alternate universe? Maybe its his parents creditcard. Are you stupid mate? He could have used his parents credit card to order it. A lot of times people use others credit cards to order stuff to avail discounts on Flipkart, Amazon. How many middle-class middle-aged parents have credit cards? Do you have statistics? ***Are you stupid \"mate\"?*** Flipkart is running big scam or something you are not alone just check in r/IndiaGaming community Flipkart review. Also post this on r/IndianGaming. Thank you so much 🙏🥺 It says ita a private community Your life is worth more than 76k and on a lighter note ajkal ek kidney itself can fetch about 4 to 5 lakhs 🌚 Post this on twitter, tag Flipkart higher authorities and some influencers. Make the tweet go viral by any means necessary! Once it's viral enough to hurt the image of Flipkart, they'll give you the full refund along with some extra! 😂🤣 I've posted 5 tweet and tagged 50 people with news channel. Still no response You suspected a crime (defraud) happening to you at Flipkart center. You should have dialed 100 right then. It's strange people don't think of police. In most cases the moment police gets involved, the other party changes tone. Flipkart would have wanted to resolve it as soon as possible. Calling 100 for assistance is not a crime when you feel honestly that your have been duped. No other option than consumer court..you can't even blame Flipkart here, when they have especially brought open delivery thing to put a stop to this kind of frauds. Also, threaten that delivery executive too with a case of fraud. Never has any delivery executive asked me otp before hand, in case of open box delivery. The instructions clearly says not to give OTP before checking the box. So it seems the delivery boy knew very well about the fraud. Or else he wouldn't ask you for OTP before. Some delivery people themselves are removing original products by clever opening of the packing.. mention to him that in your consumer complaint as well as police complaint you are mentioning his name too along with Flipkart. Thank you 🙏 Everyone is saying that. We filed a case on him aswell. He said sorry I didn't knew. This is my final reply I don't see a point in replying further. What the fuck is actually wrong with you? It's a suggestion, I didn't assume he has a credit card, i said if he paid by credit card he can file for a chargeback. There are 3 methods of payment, by credit, debit or by cash. Usually a credit card has a huge discount on a product, so people ask their relatives/friends to use their credit card to order a product. Even right now the price of MacBook m1 is 81k on flipkart and with HDFC credit card you bring the price to 76k which is ops price. Shut the fuck up about statistics when it doesn't play a role here. Unless op told he paid by debit, credit, or UPI you have to assume all 3 ways of payment are possible. If no one used credit cards then you would be right but a lot of people use them to order big purchases especially because the discount is so huge. Your stupid statistics \"argument\" can also be twisted \"how many middle class people can buy a MacBook, do you have statistics 🤓\" We found out very late that it was open box delivery when Flipkart explained what it was. I went to file case in police they said, he has CCTV of 4 days from parcel coming and parcel going. They asked him but he's denying \"76,000 ka laptop mangaya par nikla sasta speaker. Flipkart ka scam\" Go to your local thana and get the complain done as it become an official and legal. That itself will escalate the matters in the local Ekart/Flipkart level. Also Go to your local newspaper office. You have the pics. Local newspapers like these kinds of new. Consumer court bhi ja. Unlike other courts consumer courts are better and you don't even need a lawyer. Also keep tagging relevant authorities on twitter and make a longform post in FB as well tagging your state Police DGP, CM etc etc I ordered an iPad pro with apple pencil, from Flipkart. Post order confirmation, it was specifically mentioned in site regd open box delivery. The guy came to my home, unboxed in front of me and even turned on the device, while I recorded everything. Only then I gave the OTP. You should've been more cognizant, since a lot if people end up with Rin Soap bars, while ordering phones I've done everything! I've went to police par unhone kaha he has cctv as proof in office he didn't steal . Consumer court me case dala.they said 4 months lag sakte hai Yes I know 😓 this was my first expensive item. He said it's protocol and I wasn't tech savvy Hmm I've ordered laptops from these places before and it wasn't ideal (damaged keyboard) but it at least was the right item Considering that organ donation for money is illegal they will keep the money and your kidney and leave you with complications for life. Bro, I recently got scammed for 2,64,588. I understand your situation but suicide isn't the solution. You'll earn it back, giving up your life isn't the answer There are some ways to solve this problem, lol, go to consumer court, Find that delivery boy which it gon be easy, get his ass real good I know him I recorded him he said nit ny Life lesson - Never purchase high value items on flipkart. Have heard way too many incidents like these. Amazon/ offline is the way to go. is Amazon better? Please raise a grievance on PMO portal. Please raise multiple concerns on all possible consumer forums of government Even Amazon is not safe nowadays Just buy offline Croma mostly matches the online prices Flipkart open box delivery is a joke... why should customers ensure that the right product is being delivered... they take zero responsibility whatsoever 😒 I'm really sorry to hear about your situation. Here's a tweet suggestion for you to post on twitter: \"Absolutely gutted and furious! Just got scammed out of Rs. 76,000 by a @Flipkart delivery guy. Your delivery executive manipulated us to provide OTP before opening the box. I found cheap speakers instead of the MacBook M1 I ordered. @Flipkart @flipkartsupport, this is NOT okay! My family's hard-earned money is gone, and we're shattered. Your delivery executive played a part in this, and I've got evidence – videos, photos, confession! Middle-class families rely on your platform, and this is how we're treated? Unbelievable! @StatePolice, I hope you're watching. #FlipkartScam #JusticeNeeded\" Tweet this and tag your state police where I have written @StatePolice. Bhai tu alag level ka chootiya hai. Why are you not at the gates of your local district magistrate and thana? Why is this not appearing in newspapers? You think newspapers won't take this, those fuckers are dying for non political contents! Heck you could even involve local politicians in this, especially their trade wings! 'i have nowhere to go but r/India' r/india should have been where you come after doing all this. Tum naive nahi ho bhai, actually bevakoof ho. Bhai reddit par kitni baar mana kiya hai flipkart se expensive saman mangwane ko. Chal ab shant hoja. Jo ho gaya so hogaya. Aage se dhyaan rakhna Bhai wha bhi daal diya It's definitely a devastating situation for anyone belonging to the middle-class. Try reaching the executive of flipkart regarding, if they didn't say anything try to reach with another agent on flipkart. And tell them your situation with each and every detail possible. They will surely do something [in reference](https://www.flipkart.com/pages/open-box-delivery-tnc#:~:text=In%20case%20you%20find%20the,the%20time%20of%20the%20delivery%3F) It's a famous comment so I'm adding Twitter link please retweet 🙏🥺 you are all the sweetest [Twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Always buy expensive things at the official store be it watches, laptops and shoes or expensive cosmetics. I too used to say the same about police until I too got into a scam and filed a complaint into cyber cell office. They took it so lightly that after my 4-5 visits to the cyber cell they started saying \"aap abhi yahan aana band karo, hum investigate kar rhe hain\" . It's been 2 months and no response since then. They used to make fun of me behind my back(I've heard it) whenever I went to enquire about the case. r/LegalAdviceIndia post in this sub too. I will! Learned it the hard way 😓 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) You are not dumb at all, you have all the evidence. Just make a post on X and tag them. I'm sending Twitter to everyone if they wanna retweet [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Subah gadhe ka gobhar khaya mat kar nahi toh aise hi yahan par aa kar huggega. Have some empathy, you chipkali ki c#ut. Bechara stressed out hai aur tu uski mental wellbeing ki gend mar raha hai. Twitter 🐦🐦 Therapy ke paiss bacha raha hu uske loduchand! If he doesn't buck up uske 76k ke saath saath trust karne ki capacity bhi jaygi. 'Awwlelele' se teri duniya chalti hogi, lower middle class nahi chalta. Many of them have credit cards wtf I did ! Can you retweet it? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) I got scammed of Rs. 7,50,000/- That's all my saving but that's alright I can earn it back. Not worth my life. According to their policy, once OTP is given and product is found to be wrong, then you are free to return it for a full refund. If cash paid, it'll be refunded immediately. If online payment, it'll take few processing days. Talk to Flipkart customer service and get it returned. If unfavourable, approach consumer court. You'll get your money back for sure. I got scammed of Rs. 7,50,000/- That's all my saving but that's alright I can earn it back. Not worth my life. They said no. Because as per open box delivery, you're not refundable I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Yeh sare scam Flipkart pe hi kyu ho rhe, i thought things would have gotten better after Walmart investment Honestly, this was easily avoidable if you are vigilant Feeling sorry for you bro your life must be hard for you to be so shit to other people. Please file a case and claim a crore at least. Flipkart must compensate for your mental breakdown I am not making this up, but I am one of the people who actually received a Rin soup bar when I ordered an iPhone 6 long time back. But it was Amazon instead of Flipkart. I ordered an iPad pro with apple pencil, from Flipkart. Post order confirmation, it was specifically mentioned on site regd open box delivery. #give OTP only after verifying box contents The guy came to my home, unboxed in front of me and even turned on the device, while I recorded everything. Only then I gave the OTP. OP should've been more cognizant, since a lot of people end up with Rin Soap bars, while ordering phones File in consumer court. That will set fire under them. They will come running to you to resolve the matter. File against both flipkart and delivery service. Later don't settle just for product. If needed take legal help. Bhai tujhe therapy ki sakth zarurat hai. Being supportive doesn't require one to be financially rich. Seriously, you need to seek help. I know you won't accept it but phir bhi bolunga. Aur acche therapist ke paas jaana boht bekar pade hue hai. If you paid amount using credit card File a chargeback with your credit card issuer by attaching all the proofs you’ll get the resolution Recently faced same issue with mobile phone filed a chargeback and got refund Yes it is? Tera baap ameer hoga, mere wala would consider such things a justified cause for war, mai aur flipkart wale dono pitte, SP aur MLA alag involved hote. Shaam tak notice aur raat tak media brief tayar ho chuka hota. Kyu, tujhe experience hai kya bekar walo se katwane ka? Isiliye empty advice aur mere moral support dene mein expert ho gaya hai? Learnt from the best, did you? Also add cyber cell Twitter, if applicable and definitely add news channel and some social activitist IDs File a complaint with police and give us an update here. I am sure there are some journalists lurking around this subreddit, just waiting to see some concrete step from your side. go to twitter post on their profile with every evidence you have Contact youtubers like techpedia they will help you I did. Can you plz retweet me 🙏😓 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) yes Police complaints and escalating to flipkart using Twitter etc is one thing but it’s not guaranteed to work. You know how these scamsters work. Take a legit break from school (assuming you are doing bachelors) and start working . It’s not that hard to earn 76000 k if you have 12th . Pay your money back . Rejoin school. This will boost your resume, you need to give reasons for break years . If you say you took a break year to pay off this , HR interviews lap this shit up . Guess it must be mandatory for 90% of the civil servants to be a bunch of clowns 🤡 All this advice, but where is Op? Fir is the only option. Target the guy at the flipkart office … why did that staff took the OTP before opening the box ??? Op is here 😊 I am trying to reply everyone 🙏😊 there are alot of comments. Thank you hbkdll Can you pls help me? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) It's high time we stop using Flipkart. Flipkart is terrible. It took me 3 months to get a refund for rs 1600 for a router which I did not even receive. Now I only buy groceries from them. Thank you CHATGPT Never use croma online they are worst than anything you will ever experience, offline is good tho I did! It's not helping 😓 Can you pls help me? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) I believe you, my friend ordered a 30k washing machine and it's front loading door was broken. No cooporation from flipkart. He had to spend his own money to get it fixed. But that was before the open box delivery was a thing. Consumer court will take some time, but just the threat of a case filed scares companies. Keep messaging them and ask them to escalate the issue. I recently got my money back from Cultfit after fighting for a month. It's possible. Middle class is buying a MacBook?? Thank you so much for advice 🙏 I'm trying to get retweet to put pressure on them Can you pls help me? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Post your tweet link here, people can make it viral I feel bad for your situation. You file an FIR against Flipkart and give a copy of your evidence to the police along with the complaint. Ensure you have the complete set of evidence with you as well and don't blindly give it off to police without keeping copies. After that, approach the consumer court and file a complaint with a copy of the FIR and evidence. Whatever you're doing do it legally so that nothing goes against you later on. This process will take time but that's the only option you have. Fight for your rights immediately. The longer you take to initiate the legal process, the more diluted your issue will become. So act fast. If you don't, you can't get your money back. Go to any local newspaper to get your story published. Try to reach out to them on Twitter etc Make a complaint [here](https://consumerhelpline.gov.in/), there are multiple avenues mentioned. Record all your calls with Flipkart customer support. Also, email the video proof here: [grievance.officer@flipkart.com](mailto:grievance.officer@flipkart.com), [cs@flipkart.com](mailto:cs@flipkart.com), [cs-head@flipkart.com](mailto:cs-head@flipkart.com) and mention that if they don't help you out, you'll be getting in touch with dept of consumer affairs. Just find some mail ids of all media handles online and just mail dump to everyone I hope you have at least contacted the Police. Should be the first thing to do when you are a victim of a crime. First incident report becomes the basis for any further action. I would also suggest to post on r/legaladviceindia And contact consumer guidance society of India if you feel Flipkart is being negligent. They have offices in every state and consumer protection is their job. He is buying for college not for showoff I'm so sorry 😔 Can you pls help me? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) I've contacted police and started a case with lawyer. He said it might take 3 months Can you pls help me? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) r/kothibanglacheck I've tweeted them and mailed some YouTubers Can you pls help me? I'm sending Twitter link to everyone in case they wanna help . [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Avoid flipkart.. Bro i feel sorry for you, fuck these scammers. I hope u get ur money back. The only drawback of upi is that refund is a headache. Credit cards are safer. I've learned it the hard way Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Once I lost 50k in stock trading, had 2k left in bank a/c, ate a pizza of 200 rs and slept. Struggled for 3 months then made money again. No need to kill yourself over 75k. Fight for it. To all my Indian people, please always take video while unboxing any parcel even if it costs less, you will thank yourself later. >I've contacted police Have you filed an FIR? >started a case with lawyer What suit are you filing? Criminal or Civil? Against whom are you filing a lawsuit? Call Consumer Guidance Society of India. You won't have to even pay for a lawyer as they will fight it on your behalf. After seeing so many issues with online E-commerce stores, I guess I will buy high ticket item in offline. No headaches ans chance of scams Search for your local news channels and find them on linkedin and dm them your case with evidence Bro there is still hope, pressurise flipkart with this video. Talk with seniors Cs, there will be chance of flipkart will consider it and investigate.. Talk with their Cs frequently until your case get escalated. If they say it's not possible to refund just tell them you wanna talk with your seniors and explain, just don't give up Thank you! I already found a local news and I told Flipkart I'll send It to news Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Thank you 🙏🥺 Try tagging their investor house accounts as well I tagged all of them 🥺 Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Whatever happens, don't consider ending your life over this. Not even for a second. Trust me, 76000 is not a lot of money (for someone who can afford a mac book). If you did nothing wrong, don't even consider punishing yourself in this way. rubbish. completely wrong. It's 98% Did u get tat parcel at home or is it still at their place flipkart centre and do u have recording of the flipkart peraon requesting ubto give u otp prior the package opening? It was flipkart person was wrong here as you can see usually they entry otp once you are ok 👍 with it. As clearly it can be seen flipkart person mever entered or asked for otp. You should waited for them to deliver the laptop at home. 99.7% An advice to you, since I have gotten my money back from Flipkart through Twitter only. Don't write so many big tweets. In your main tweet, where problem is explained, Flipkart support is not being tagged. You have tagged them in separate tweet where you are demanding justice but the matter is not mentioned. Write matter in short and precise manner and tag Flipkart support in them. They will then reply you to explain the matter in detail in inbox. By writing so many tweets, with main problem not even visible in their tag, they won't be able to respond as there are many many people tagging them and it will get difficult for them to see the tag, come to your profile and then check out your other tweet where you are explaining the problem. Leave the other tweets as it is for better reach, but for now write a simple short tweet and tag only Flipkart support. They will reply immediately. To ALL FK is an organisation that lacks Accountability, specially High Ticket Item. We have seen this a lot on news, on Reddit too. hence treat FK for low ticket items or dont even use it. Hi Sorry to hear that and can understand this may not be easy, specially for you and family. Positive is that you are articulate hence firstly know this is addressable , to a certain extent. Hence you need to be smart and take control of this with Flipkart. (+ves) &#x200B; 1. In the Flipkart hub 2. Also capture the face of the Flipkart delivery executive. 3. have footage of the delivery executive opening the box that means the delivery boy open the box and not u 4. Video available confirming opening the package with different product 5. the confession of delivery boy admitting that we have received the wrong product 6. the cameras in the ekart hub might have captured the incident that the delivery guy ask us to give OTP before delivery our package (-ves) &#x200B; 1. Despite clear instructions, you provided the OTP before opening the package. 2. Delivery executive \"MANIPULATED\" you into thinking the OTP needs to be given before. &#x200B; My sugestions: &#x200B; 1. Stop being sad when have of the evidence is in your favour. Use it to build a case and make FK accountable. 2. Write a CLEAR MAIL with above points, share video .. On mail as well as Twitter. Ask for support from friends/ Reddit community and let all retweet. Some will, some won't. 3. Clearly state in email that while instructions were clear and you demanded to see the product from executive in their own warehouse , yet Flipkart executive \"MANIUPULATED\" you into believing that it is FK rule/policy to give code before product. ( Attach the video , hopefully voice recorded, if not , it is OK ) 4. Why FK executive asked you multiple times to see the CODE before product. Is he not trained or is he part of this scam. How is FK safeguarding customers from such behaviours where customers are \"MANIPULATED\" into giving codes before handover and product is wrong and FK says they aren't accountable. Clearly state is FK accountable or in this game as well , how can we be sure ? 5. Tell them and you MUST, Consumer court or police complaint with evidence and create a case. Tag senior leaders of Flipkart to your Tweet too. I think you'll have to be after them for your refund and a Police case or a news article must help you get this expedited. Good Luck. Sorry for your loss and its a shame what happened, flipkart is just a shit show these days NGL, but you mentioned you from a middleclass family and money is an issue, then why did you buy a macbook? you could have got a better and more powerful laptop in the 50-60K range and could have saved more. It cost me 76k.my mom said so, because she thinka for ones for my college I should buy something good. I've never purchased anything expensive because of financial condition. Since a good college is. A achievement she thought it'll be like a gift and I'll eatm alot after good college Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) What are the steps to be vigilant? Post on LinkedIn too and Tag Flipkart Current officials. He did everything still in trouble. Check his tweet and retweet it so that it gets highlighted. Thank you🙏🥺. I'll do that If I understand correctly, then someone sent you the wrong item and not the Flipkart hub, then I would suggest you raise a request to Flipkart and file a FIR. Bro never ever give OTP unless you’re satisfied. Hopefully you get your product or money. Good luck Consumer court is your best bet. Not exactly the same situation but my friend had an issue with Flipkart regarding one of the Samsung Galaxy flagship phone. It took around 2 months but he got all his money back. You’ve all the required evidence so file the case asap and keep tweeting daily with videos etc Also tag tech youtubers like geekyranjit, he mentioned in a video where he too faced such issues with flipkart. I have stopped using flipkart ever since I saw that video, and so should everyone. 100 times better. Also use a credit card in future Isme suicidal kyu bhai Yeah bro, I'm sincerely sorry. Hope it gets better, or you learn to not let it affect how you treat other people ❤️ Doesn't matter what they said. See their TnC. Whatever is written there is the source of truth. Send it to the customer care person and ask them to follow their TnC or you will take them to court for fraud. It said they can't return. Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) Try getting in touch with your bank and see if they can raise a dispute for fraud from their side. Go to police. File a complaint at National Consumer Helpline. It is resolved within 2 weeks. I got scammed too I ordered Earbuds from Flipkart they gave me the shell but there were no earbuds inside it, they gave an empty circular thing no earbuds 😠 That works for smaller transactions. Higher disputes companies will take up. Thank you so much! I'll do that I do want to call you an idiot. But not for providing that guy with an OTP but for paying 76k for a 3.5 years old MacBook. What else can I buy instead of a macbook? I just thought apple runs smoother Bad advice, police need chai Pani first then they agree to even listen. I've got some experience in this case . Don't ever post such things on social media . Each e- commerce team has their own social media team that handles such cases , they will directly reject your claim on such things . Don't buy expensive things from online websites even if it looks cheap these things are all scams . It is just a trick scam people and looks like you got scammed . The best thing you can do is now go to the consumer court and file a complaint . The attractive discounts are precisely the scam. Even more so Flipkart Assured now blocks any form of return, all assured products carry Open Box now and people have to be very very very very vigilant before giving OTP on open box. Take half hour, one hour to inspect, let the delivery guy wait. Only when these delays will hit Flipkart will they stop this bs. Yeah local ones won't even file cases of stalking, forget about money scams. Always use Amazon, and don't worry about the money. You can always earn it back. #fuckflipkart This is why you always buy online through a credit card. If anything goes bad, you just file for a chargeback. Your best bet is approaching the consumer court. There’s a low chance you’ll get your money back but its still better than doing nothing. Sorry to hear what you’ve gone through. Hope you get some kind of reimbursement. Its scams like this that made me leave India. India is developing with lightning fast speed but the core issues are still unsolved. What was the problem with Cultfit, facing an issue with them aswell This is what appears for OBD before final confirmation. The link you shared has not been updated since Dec 2022. Never use flopkart.com they even bought the domain flopkart coz they knew what they are. I bought an exercise cycle and after a month it started making noise. No amount of repair would fix it. They were like the next repair would be final, next repair will sort out the issue. Had to fight with them on the call and get the money back. i used croma online to buy a laptop, my experience was smoother than a baby's butt That delivery is guy is sketchy, he shouldn’t have asked for the otp first if he was genuine. [This] (https://imgur.com/0Bopph4) is what appears for OBD before final confirmation. The TnC linked before has no mention of it. lol. literally any decent windows laptop Don't worry you will get your money back!! Don't give up If it was OBD, [this popup](https://imgur.com/0Bopph4) would have appeared before final order placement. He goofed up if he didn't notice it. Not that it excuses Flipkart, their third term is beyond ridiculous from the get go. I would keep the executives wait for hours if I have to be 99% sure things are correct. Bhai retweet kiya hai. Agar refund vagera kuch hua toh yaha par bhi update kardena These scams are happening cause of last mile operations scams and.not from e-commerce portals. File a case against Flipkart and also against ekart. Also reach out to communities and try to get this viral against both these entities. Share as much as possible and probably in 7 days you should get a resolution from them. Try to involve as many people or just create fake social media accounts to spam the shit out of a single thread on as many platforms as possible. A spike in the numbers will hit their counters as well. Thank you bhaiya 💖 🥺 Thank you so much 💖🙏 I'll follow your advice 💖🥺 Please retweet if you can! Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) I think you should tweet under FK’s latest tweets in their own account This is the way to get visibility and get a response Whatever their latest ads on twitter , just go to FK’s and post your tweets as comments / replies . I am so sorry this happens to you and others Since the company has become notorious for this , it was their responsibility to call purchasers of high value electronic item ( even if automated call ) and explain to them properly about open delivery procedure I agree 💖❣️ I'm not very informed about these things 😓 I'll do as you said! Thank you so much 🙏🥺 Ok 🙏😓 Sure. I saw your video and it's evident by the body language that this is done by ekart guy. Raise a consumer case against both and provide GSTIN number of the ekart delivery centre. Unke dhande pe attack kro and if possible raise a case in police with help of opposition or ruling leader. Twitter pe tag kro unko. I have worked in global fraud analytics in Amazon and I can tell this is a common fraud modus operandi over the world. Bro u living delusion life or what, even if ya DM and ask to share ur news, they will ask u to pay the money first You will get the money back. It's not a small amount. Court case takes time but you will not loose you money. keep as much proof as you can with you. I am so sorry this happened to you. Since you opened the package in their premise, you have sufficient proof and you should pursue this in consumer court if required. Try to lookup top executives on linked in and reach out to them if needed. Lastly, don’t beat your self to it. Happens to the best of people inspite of all the awareness. You will be fine. Since the launch of Amazon, I have never once ordered from any other Indian owned website. We simply don’t know how to business with integrity. This is why a lot of companies don’t want to come to India and setup business as we lack the business ethics, we are also in the west known for running scams and looting innocent people. Posed your question to AI and got the following response : Here is a summary and analysis of the Reddit post, along with suggestions for further actions: Summary: - The OP ordered a MacBook Air M1 from Flipkart for Rs. 76,000 - The delivery was scheduled for August 13th but was delayed - On August 15th, the delivery executive asked OP to collect the package from the Flipkart hub directly - At the hub, the executive asked for the OTP before letting OP open the package - After providing the OTP, OP discovered cheap speakers instead of the laptop they ordered - Flipkart is refusing a refund due to their no-returns policy on \"open box\" deliveries - OP is seeking help to escalate the issue and get a refund Analysis: - This seems like a clear case of fraud by the delivery executive who swapped the product after getting the OTP - OP is not at fault and provided evidence including CCTV footage and confession - Flipkart is not taking responsibility despite their protocol being violated - OP stands to lose a significant amount of money needed for college Suggested next steps: - Continue posting on Twitter with evidence and tag influencers, journalists, police authorities etc to raise visibility - Contact consumer court as already done and pursue the case actively - Try escalating further within Flipkart through emails/calls to senior management - Lodge an FIR against the delivery executive for fraud and swapping products - Consider approaching local newspapers/tv channels to highlight the issue - Post on other platforms like LinkedIn to directly engage Flipkart employees The key is to not give up and continuously pursue this from all angles until Flipkart is forced to intervene and provide a refund. Remaining persistent and raising visibility seems the best approach based on the information provided. Just give OTP after checking your product incase of Flipkart. For expensive device they tell you that do not give OTP before checking your product to counter these scams. it's not flipkart fault, 3rd party sellers doing scams, anyone can make seller account on amazon & flipkart. Always check who is seller before purchasing, like on amazon [Appario Retail Private Ltd](https://www.amazon.in/sp?marketplaceID=A21TJRUUN4KGV&seller=A14CZOWI0VEHLG&isAmazonFulfilled=1&ref_=dp_merchant_link&asin=B09QQPGDBG) & some others are official sellers. on flipkart omnitel retail, retailnet etc are genuine sellers. avoid new sellers, scam sellers are always new. i was seller on ebay from 2010 to 2013, Bro just go to consumer court , also keep proofs of contact no , prod purchased , bill etc Fuck flip kart Hmm that was a rookie mistake made by OP. I think the delivery executive is on the scam, he smartly forced them to give the OTP before unpacking and technically cleared himself of accountability afterwards. If it was Flipkart you will need to sleep there for 4 days to get something done. Cyber cell service is better. Yes true, but given we know about these scams, we can continue using Flipkart and safeguard ourselves by not making the same mistakes. Although this solution is not a good enough fix, given we don't see much of such incidents with amazon and Flipkart should fix this issue 99.72% > ***I'm broken and suic\\*dal.*** This part is worrying. Please do not worry. This may waste some of your time but I believe you have sufficient evidence to get your money back. Just keep at it. 76k meri 3 mahine hi salary h Your life is not worth 3 months salary, I lost money that I will probably never recoup again. It wasn’t even my money I wasted. Guilt bahot hai but suicide is not the solution. PMO portal? I am really curious about people's reactions to problems on this subreddit. I am sorry that you got scammed, it can be a very harrowing experience, but are you really \"broken\" or are you really \"suicidal\"? It's a laptop, even if you are scammed and you don't get the money back. What really is your loss? It's not as if you paid for a life saving medicine or anything of that sort? Obviously fight Flipkart, and I hope you get your money back - but please learn to contexualise problems, that might help as well. Flipkart sucks Thank you , idk it's such a precise proof why are they not helping me I have delivery guy confessiom too, and camera recording too if ekart hub that I'm ready to give to them Here's the video of delivery boy opening and accepting I got scammed. Can you plz also repost it 🙏 [twitter ](https://twitter.com/atharva_1913/status/1693503663929807035?t=dJrhn3nGh-3FYOg-rn5HWw&s=19) I have observed if something is taking more time than expected its usually wrong product or the seller doesn't have that item. I recently ordered an expensive cream at abnormal discount from amazon which delayed and arrived after 10 days and there was some expired cheap cream inside. Though I called amazon and they told me for few pics and got refund within 2 hours and told me to keep that cheap cream with me too. Flipkart seller here: The Flipkart (Ekart) delivery offices are full of cctv cameras. So if it was stolen inside office it would be captured. My recommendation: File a police complain and go with police officer to Flipkart office. The manager may allow you to check cctv footage alongside them. Otherwise this will put pressure on flipkart as well as Flipkart office. Now about twitter. Tag CEO, Walmart, Walmart CEO and everyone at top related to Flipkart. But do FILE FIR first. Ye to jyada bada fraud nikla Again I wanna emphasise that please for the love of god don’t buy anything from flipkart. Those people have zero ethics and care for customers. Shouldn't the delivery guy upload pictures of the item you purchased on their app in case of open box delivery, isn't that the procedure? I don't buy from Fk often but I ordered something for the first time last week which had open box policy. The guy asked me for OTP before opening the delivery. But I too was stupid enough to share it with him before he could open the box (I'm not familiar with fk delivery procedures since I order from amz when I buy online). I realized it was dumb only after I shared it with him but luckily the item was all good. But I did notice him taking pictures of the product from every angle after unboxing to upload on the app. Didn't the delivery guy do that in OP's case? That should be a proof for you not having delivered the actual product right? I am definitely going to be the asshole here but if 76k was a life or death amount for OP, buying a MacBook should have been the least of his priorities. There are many windows laptops for cheaper options. Damn. Feeling really sorry for you. Flipkart just seem to be hitting new lows everyday I agree but suicide is not a solution even if his priorities are wrong Always buy expensive things offline (i traveled to another city to buy a laptop) While recording always record in wide angle and in full resolution with fully lit light or use flash if required Make sure delivery boy is face is visible Turn down background noise for example tv, speaker song when recording Speak time and date and product name in recording If you have proof. And you did nothing wrong. Time to fight and not be a scared of anything. It’s your money and they scammed you. You have every right to escalate the matter. And 76k is a small amount, it will be refunded. I’ve seen people loose their savings over a flat built on bogus papers. I had a bad experience on amzn few years ago where I received empty box for a laptop purchase. The order wasn't amzn fulfilled either. But I received the refund after a week long of calls and emails. After receiving the refund, I purchased it again from amzn itself but this time a fulfilled product. amzn imo takes care of their customers' issues at least from my experiences. They scratched my ass with sandpaper You can also try to check who the seller is. Find out the seller, get the contact details and add them to your case too. Yep, if it's such a large amount for him, and can't afford to lose then shouldn't have bought MacBook. Even I require laptop for my work and can't afford good one so using window Keep us updated with the situation, we gotta make sure this doesn't happen to others as well. I have ordered a few things from Flipkart and this open box thing they do is truly nerve wrecking. We have to make sure that not just you get recompensated, but also Flipkart to change their anti consumer policies. See if you can use any local area supporters with you to the police station and request to view the footage. Smells like underhanded money exchange. Amazon is also scam - scammers who quit flipkart are joining amazon . I would advise people to buy offline purchase anything above 2000 rupees. It's always \"a nice laptop\" = Mac. This lazy and simp thinking is disgusting. This contradicts a lot of other people who have had success through social media. It's worth trying at least for a month, for this much money, before giving up. Post this on LinkedIn. Sensationalize it. It'll reach to the higher ups and you'll get a resolution. Flipkart's ekart logistics is run by local Mafia and gundas. You purchased an Apple Mac, got scammed and now you are suicidal? As someone who has dealt with a suicidal person, either get yourself to a therapist if you are that unstable or (more likely) don't hyperbole and take words like suicidal /depression in vain? Flipkart openbox delivery means they need to open it while recording it and if the item is not correct it is not on you. You should get your money back or a replacement. Have courage and be calm for now. Get recording from Flipkart hub of your unboxing report it to consumer complaints and go to cyber crime office and file a fir against seller Seller address can be found in invoice if you can't ask local ca or someone who work in it to help you identify who owns that gst number your money is safe you don't need to worry File case on seller rather than Flipkart and ask him to give you not only laptop but compensation of mental health damage if you file complaint against Flipkart it will take months even if you go to court there will be atleast 10-15lawyer standing in front of you From Flipkart r/LegalAdviceIndia 99.75% wtf why are you scolding him for buying a MAC. Either way he would have lost 50 to 60k A ThinkPad would have been far, FAR better, and you can use both Windows and Linux on it comfortably. It is also more durable, has better keyboard and officially allows user repairability with manual, along with multiple ports. File a case of cheating Money, its all about his hard earned money. Many people feels the same. Work and save for months to spends on our wishes just to go down the drain. Media don't give a rat's ass about scams. There are so many, it's just routine day-to-day life. Now if there was a sex-scandal involved somehow.. Retwitting bhai I understand what you’re going through. Don’t be too harsh on yourself I just don't understand why people keep purchasing Apple products from third party sellers. There are two physical Apple stores now where you can pick up genuine products - direct from the manufacturer. Or you can order online direct from them. Why involve a scammy third party like FK? Honestly, consumer forum is your only option left. Or hire a lawyer and send a legal notice to Flipkart First of all, anyone telling you that this is somehow your fault for sharing the OTP before opening the box can fuck right off. It's not your fault that a scam like this is so frequent on Flipkart. The fact that it happened at a company warehouse where there is clear evidence that you were not handed the product you ordered is basically criminal negligence. This should be illegal. The whole open box policy should be illegal as it involves Flipkart basically washing its hands off all the scams happening on its platform. It is telling the customer that dodging scammy sellers is your responsibility, not its own. That's fucking bullshit. Nowhere in the world does e-commerce work like this, heck even eBay which involves person-to-person sales has better consumer protection than this. I'm sure even buying knock-off items from AliExpress isn't as bad an experience (as long as you know what you are buying.) Personally I have only ordered one thing from Flipkart in the past 3-4 years (I stick to Amazon). That was my Pixel 7 Phone since Amazon did not officially sell it. The whole experience was really annoying. The delivery agent unboxed the phone at my doorstep, peel off all the plastic wrapping and turn it on. Then they had to take four-five photos of the unboxed phone and fiddle with the touch screen before handing it to me and collecting the OTP. This might seem petty but it totally ruins the joy of unboxing a new piece of tech on your own and booting it up for the first time. On the flipside I recently bought a Macbook Air from Apple's online store and it was shipped via Bluedart. No hassles at all. Item was delivered in a tamperproof package, OTP was collected and I unboxed the thing peacefully at my own leisure a few hours later. > I paid by UPI. That's the other mistake. Always pay for expensive goods with a credit card - one of the well known international chains. They usually have good fraud protection built in. what was the price and which variant ? The National Consumer Disputes Redressal Commission (NCDRC), India is a quasi-judicial commission in India which was set up in 1988 under the Consumer Protection. TAKE UP THE MATTER WITH THE ABOVE AGENCY. There's no way to soften the blow OP. You ARE in for a long fight. Better convince yourself now. Don't think of getting your money immediately. Keep a cool head and keep trying as many avenues as you can \\- From my observations, the box was sealed loosely- doesn't seem to happen when they deliver a product like a laptop, it was clearly done by the delivery agent (or someone involved in the freight) and he must have known about the policy that once he gets the OTP, he would get a freehand in this crime. They mention it several times to only give OTP **after** inspecting the product. I >He said it's protocol and I wasn't tech savvy Hate to break it to you, then its totally on you. You trusted the delivery guy over written instructions by the company. And I don't think you have any claim over flipkart too, if you choose to ignore the instructions. Consumer grievances will surely respond. Lure of discounts I myself did order my laptop through flipkart during 2019's bbdays, I was lucky that in those days we used to have return or refund policy, unlike present's open box delivery. Now in the upcoming bbdays I am to order another one for my sister, am skeptical this time due to flipkart's shenanigans. yeah. scam is bad and company should pay through nose but macbook could also have fallen from hand and broke. how could someone spend money on MacBook if they go suicidal if it doesn't work Hey. First relax, take a deep breath. Your case will 100% be solved. It's clearly a genuine case based on your video evidence. It's a big company and whenever such cases have happened the buyer does manage to get a refund. I can see FK social media team has already replied to you saying that they are looking into it. One other suggestion is to post this on LinkedIN and tag some of the folks at FK. Especially head of social media and head of marketing. I can definitely see your issue will get resolved. Consumer court is your only option. Take a printout of the order from the Flipkart website and show it to them. Also, show the item received. This is why amazon is better than Flipkart any day of the week. Please provide a number or a website link for National Consumer Helpline. Another lesson you've learned here is know what you're buying, if you don't ask someone who does. Research the product and the website/seller. If you had asked someone who knows things regarding such expensive products they would have first advised against buying from Flipkart and second advised against buying a macbook for college. Now all you can do is hope the courts can help you, and make sure to highlight the delivery centre/people in everything Never buy anything from Flipkart exactly. It literally comes as a popup and mentions no returns for any case once OTP is provided Hey, can you please go to your filpkart order section and also mention the name of seller in your posts? This might also put some pressure on seller Seriously I wonder the age of people advising and upvoting this police, journalists and news channel route. None of them will care for a scam around a 1000$ 4yr old device. They earn more through bribes and ads every hour. Only Consumer complaint or lawyering up will have a realistic result. In OP's case reading the three line popup that comes up just before payment which specifically mentions to provide OTP after satisfaction, and also that no returns will be possible after OTP. You take a screenshot of the seller's name and update your post so that others can be aware. example &#x200B; Yes it's my seller. How do you know? Won't involving the police work ? I mean they can find the seller and solve the issue right? MAC bros tend to not do basic research on any of their purchases, apple or otherwise. It's exceptionally fitting with OP ignoring the three simple sentences that pops up on Flipkart opendelivery before making payment and did the opposite for all the three. He is lucky he has some semblence of proof that implicates Flipkart with its representative not following their own terms. it should be renamed scamkart n not flipkart Just to give you an example, I searched for a MacBook M1 on Flipkart and found it. The seller has a good rating. Maybe the delivery guys scammed you. If you're middle class, how you failed to do basic research before spending your significant money is beyond me. It applies for both the choice for Mac and failing to read the three simple sentences Flipkart displays for openbox before making the payment. It will be solved I have lost over 2 lakh rs in crypto being in a lower middle class family. Life time savings but I didn't think of suicide So don't say stupid things like this Yeah about that. Looks like you value you 75k over your life. You've got more issues than losing 75k if you ask me. Which literally amounts to little to nothing in the long run. Try to get it back otherwise make peace with getting scammed and move on. If it's too good to be true, it most probably is. Think of it as a 75k lesson and move on. There are many complaints about this seller. I hope these links help. [https://www.google.com/search?q=TREASURE+HAUL+ONLINE&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=TREASURE+HAUL+ONLINE&sourceid=chrome&ie=UTF-8) bhai exactly my thoughts, trivializing something like suicide for a macbook, for college Keep yourself together, brother. Your case seems strong enough, plus you have video evidence too. Something will turn in your favour. Ignore macbook, for any purchase a basic research should have done. Dell, HP, Lenovo for instance fleece people on windows laptops similarly. Now he has proof so he will likely get refunded but as the saying goes \"a fool and his gold is soon parted.\" His parents paid for it so File a complaint, thats your only remedy Same statement but hard work of their parents. which city is this..? All the people asking to go to consumer court ,order another macbook pro this time a better spec version .now keep the macbook and tell the delivery giy to fuck off and close the door.he will say i will lose my job and bullshit .just say not my problem.after a week or so flipkart will call you and ask you why you doing this sir tell him this and he will say we will file a police complaint tell him to go ahead .they wont for 1 lakh rs because it is bad publicity for them. I have done this so i know as i was victim to something like this.you can dm if you need any help. wait what how why when Middle class guy why do you need Mac Book Pro worth 75k? One thing to keep in mind is that. Always use a credit card while purchasing stuff online. Just had a similar incident. I got fridge delivered which is a little defective. I told them to do a replacement. The replacement was even sent out and reached my city. The they canceled it and now they are claiming to reach out to seller. Apparently the issue i raised was \"damaged\" and not \"defective\". But since it was open box delivery, Imno visible damage was found. Now I've been calling Flipkart and seller and hoping that this is resolved. Never expected such services from Flipkart. Don’t know which city you’re from but a few things you can do : a. Consumer court b. Local police station c. Maybe try contacting some YouTuber who covers such scam related content. They could make your incident viral if you’ve photo/ video proof to back it up. This might help in making the case reach out to more people. d. Pls contact a local newspaper or even bigger ones like times and all. Find out who writes the crime reports, their mail id is given. Mail them the details. Contact the editorial for this. They love these cases. Hope you get back the money Sure. Application is also available for both iOS and Android. There was a recent post on r/India of a girl who was scammed via Amazon. Yes, that's a lot of money but there is no need to feel suicidal for it. With luck and discipline, you can earn more money in future. This can happen to anyone. Learn the lesson and move on. MacBook Air, not MacBook Pro, but yes I understand your point. The fact that you could afford to pay for a Rs 76000 laptop upfront suggests that you do have the means and this is not such a huge amount for you. Regardless it is not worth ending your life. Take the L for now and try your best to recover. Other people have already given some good suggestions including consumer court. Honestly DON'T BUY ANYTHING ON FLIPKART. Ordered 3k worth of art supplies (washi tape etc) and they're not what they showed in images, asked for return, refused. The another box which was sent was alreaady opened and there were less tapes. I fucking hate the open box crap that Flipkart pulls, ruined a phone unboxing experience with the delivery person only touching my phone with filthy hands during COVID. Do the unbox and record it but I will be the one doing both along with the delivery person filming too if needed. Dont worry consumer court will get your money back and good chunk of extra money for all the harassment and pain. why not?? can middle class people not save up and buy a macbook? :( OP I have lost 30 lacs to IDBI Bank. I'm just as middle class as you. But never ever think money is worth more than your life!!! As long as you have your health you can make money! As for this case, you need not even worry because you have proofs and Flipkart can't just scam you like that. Please reach out to Consumer court. That's why I always use Amazon. I have lots of scams related to Flipkart and rarely any related to Amazon. Infact Amazon customer is much better than Flipkart. They will try their best to solve your problems ASAP while Flipkart? It's the worst! Lifebuoy ka sabun hai ye log. 99.99 percent. Bro don’t stress it I know it’s a lot of money in India but you’ll get more and more senior in your career where that money will be nothing Seconded, I also attempted to buy an expensive laptop from FK and they played several games with me; delayed delivery, no response from agent, order delivered but not received, then they increased the price and asked me to pay the remaining and \"uske baad delivery hogi\". Spent a month on the case and finally just did a chargeback cuz was lucky to have used a CC. Bro, do update us when your issue gets resolved Why credit card ? Thank you 😊 I did got called for refund, but I'll update when they'll send money in my account that'll be on 28th august Don't explain your purchases to random strangers. It is your choice what you buy. I too avoid Flipkart. But bought pixel 6a. The delivery guy however gave the box to me and told me to unbox and check. It was weird to unbox standing in my doorway, but atleast I did the unboxing. Still, it's pretty dumb policy honestly. Welp - Better luck next time! This guy is playing, dont trust him. If losing a MacBook makes you suicidal you have a different problem to worry about other than the money lost. Credit card istemal kar re ho aur 81k ka laptop hai aur apne AAP ko garib bata re ho you are moron period also buy things from Credit card and do a charge back Don't know op personally but from what I can see he is a moron probably in his late teens Can you share your incident how you lost this much amount Tf bro, how? Was it fuckcart too? Op is in his late teens bacha hai abhi 😅😅 Congratulations brother❤️ I have completely stopped using flipkart since the day the news of people receiving bricks and soap bar. I have worked as a social media specialist and I can’t even tell you how many tweets there are where a customer has received a defective product, never really received the product, never refunded money. From smartphones to tv and laptops. I wonder how this platform still not in trouble for literally looting the customers and then the mental harassment that comes later speaking to the customer care representatives who mostly lack manners and etiquettes. ONE THING I found out recently about Flipkart reviews for TV smelling suspicious just to know later that whenever you purchase a TV the manufacturer will get in touch with you over WhatsApp and offer you an extended warranty of 3 months in exchange for 5 star reviews so basically regardless of the product’s quality, service assistance, build quality, shelf life one would end up buying faulty product. If you have made it till here, thanks. During the sales like big billion days, do check out Twitter hashtags you will have your blood boiling to see how big of a fraudulent this company is even when it’s not you who is in loss but you empathise with someone who’s suffering insurance money. they rejected my claim. Just put it on twitter OP, learn cross posting. It will be helpful for staying on reddit. Didn’t read but who gets suicidal over 75K rupees. Like lol 😂 bro really. You really ready to give up your life over this much Good work fam. That's why I love Reddit! Which college work requires a 70K Macbook? Sad to say hum aise law and order ko empower karne ke liye tax bharte hai Why would they save up to buy MacBook? Hello Brother. So glad you got your money back. I know you will be extra careful from now on. Cheers! what's OTP ? Lesson Number 1: Don't ever order from the bitch called flipkart. They give attractive offers just to attract honeybees like you. The best you can do is go to consumer court and if they couldn't help then just forget about the money. It's a common scam run by flipkart and you should have been aware of it. Open delivery is terrible. They’re absolving themselves of all responsibility. Someone isn’t always going to be physically present. First 76k is not worth being sucidal, calm down. Second, You're not dumb, he is literally scamming you if he said it was flipkart protocol and it wasn't, i wont be surprised if this is a new type of scam where depivery boy is a part of it, people really do need to be very careful and read terms and conditions on these websites before purchasing or stick to local purchase for simplicity and less hassle and avoiding getting scammed. Retweeted hoping it helped. its a expensive purchase, accidents can happen. What will you do if something goes wrong. you spill a cup of tea on it or it falls down from the corner of the bed. Why? Can you elaborate on this. Because they want it? What kind of question is that even... This is a reason why you should never pay by UPI for anything you would not regret seeing lost totally. It is convenient but lacks features like chargebacks. You're missing the point. Anyway, looks like he got the money back. Contact Peepoye on Twitter, he's an influencer and I guess he supports people on Twitter, try reaching him out. Be very careful when buying online. NEVER trust random online sellers. It sucks for all of the genuine small indie sellers, but that's life. I'm glad you got your money back. Best thing to do, contact a lawyer and get them to send a legal notice in such cases. It's not an actual case yet, but it may get companies to take it more seriously. Shit happens, it's life. The one thing that I have a problem is you saying that you're suicidal because of this. You've got something really wrong going on OP. This shouldn't be your first thought, sounds like you're getting your money back, which is good, but please do work on your mental health,. for your own sake. Bro go to consumer court asap Credit Cards has something called chargebacks. Credit Cards have something called chargebacks. if you don't receive the goods or services you paid for. If you're scammed by a fraudulent seller, you can contact your credit card issuer and dispute the charge, potentially getting your money back.have Mate just a thought, if you are getting broken and suicidal because of Rs. 76,000,I will advise to sell this laptop and seek mental health coach. Cause this life is going to be a lot tougher than that. This mishap/mistake will seem like a luxury. So did they not take the cycle back. And was it very costly? If 76k makes your suicidal then you need to rethink your finances, spending & future. It’s a drop of water in the bucket for most. Tag police and also place an FIR. And then talk to Flipkart, they'll usually take actions once they see the FIR report and all. I think if you purchase a Mac with student id You will get it cheaper around same price so no need to order from some where else. Scammers are present in both at Amazon and Flipkart. But Amazon's customer service is what makes them better. It cost me 32.5k. Yes, they took back the cycle. Charged me 1000 rupees for packaging because I threw out the box. But I have peace of mind atleast. Yeah but first preference should always be offline especially apple products I’m surprised people still use Flipkart . Stopped using it 3 years ago. Absolute dogshit. Agreed. Oh, thnx good to know. Why people still use Flipkart don't get it , switch to Amazon or your local dealer. Amazon use Trusted sellers Dell, HP, Asus, Lenovo aren't meant for college when MacBook money is lost, OP has reach to a point considering Suicide...WHY? The OP said he got into a good college that's why his parents gifted him Mac. Why you care? Let he be happy Just search \"TREASURE HAUL ONLINE\" name online. There are multiple complain Just search \"TREASURE HAUL ONLINE\" name online. There are multiple complaints. Seems like they are fraud sellers. And still, Flipkart is allowing them to do business on their platform. Shame... *(Got another reason why I should not order from Flipkart)* While the current open box delivery being the sole option, and absolving any responsibility post OTP is definitely scummy from flipkart, flipkart isn't necessarily bad. Most of my purchases I do through Amazon, but my biggest ones like my LG C2, ROG Ally, two smartphones, galaxy watch I did through Flipkart with 0 issues. People just have to be vigilant and aware how both of the platforms work. Both platforms have sketchy sellers, just the scam processes are different and people at best apply their sleuthing skills learned from Amazon and fail to detect scams on flipkart. In the case of the LG C2 my plan was to purchase through Amazon but on the day of making the order the fulfilled sellers had their stock run out and had nonfullfilled sellers. At that point buying through FK Assured seller over a non-fulfilled Amazon seller was simply more trustworthy. I'd easily rate Amazon Fulfilled>>FK Assured>>Amazon random seller>>Flipkart sketchy seller. Agreed on the Apple store, unless something is exclusive most of the big companies like Apple, Samsung have the same prices everywhere with or without offers. I am not here to give you a lesson or to clarify your response, sure he is happy now (getting a refund) but he shouldn't have witnessed suicidal thoughts at this young age. And the bigger scams are when they have some sort of failure with their pricing. I once ordered a memory foam pillow for 99 RS due to a pricing error. The smartass seller or fk, ended up sending a pillow from the street(had black marks and possibly mold). Immediately returned and wrote a review on the product, FK removed the review saying it's a seller review and not applicable to the product. Flipkart is a horrible place to buy electronics. I made the mistake of buying two phones. Never again. It's not your fault okay? I understand we feel dumb when we get scammed.but the scammers should be more ashamed of this Ever wondered why they are selling cheaper than the manufacturer themselves? I have faced multiple issues with Flipkart in the past. I once ordered a Dell replacement battery from them. Turned out the seller was selling batteries that were discontinued. Another time I ordered a technical book that was quite expensive and which I needed for my work. The seller sent me a copy of Pride and Prejudice - a good book but not what I ordered. I escalated the issue and it received a refund. One issue with Flipkart is negative reviews are simply removed!. I no longer buy anything from Flipkart and usually use Amazon. I really like the Croma Store because its prices are comparable to online retailers ,always use a credit card for purchases my dad has got a amex card it looks lovely 😍😍 This was covered in news too India Today: Man orders MacBook worth Rs 76,000 from Flipkart, receives boAt speakers worth Rs 3000. Congrats .. today it’s even in news .. Thank the reporter .. [India Today](https://www.indiatoday.in/technology/news/story/man-orders-macbook-worth-rs-76000-from-flipkart-receives-boat-speakers-worth-rs-3000-2425455-2023-08-23) It definitely a scam,I tried to withdraw money and there are telling me to pay 20% according to IRS,I almost fell for that too after paying $35k before I came across someone testify about the same platform,so I ask her how she get her money back from them,she then introduced me to(@reclaim_assest) Instagram What about OP who gives OTP without verifying the product? Who rejected your claim? the bank or insurance company? I am thinking of getting health insurance but I am not sure what its worth. The company I guess. It has a different name now.. It was my father's life insurance. I couldn't claim it after his death. I don't know much about these things. The agents who came for investigation asked me for his medical history which I gave. I'm autistic and live alone I don't know how to deal with things like this so they most likely scammed me. I think you are right. I wish your father taught you how to deal with such circumstances. Looks like the company and an insurance company clubbed together for this scam. What's the insurance company name? It saves the rest of us by avoiding it. he should have :( IDBI life insurance. Is this the same story...OP did u reach out to any media outlets... just curious Which AMD Ryzen processor? Please link me to an AMD Ryzen processor that benchmarks better than an M1, and is available in a 73k price range, I’ll wait. Not to mention a laptop that gives you 18 hours of battery life. Not many people care about Linux or User repairability. People however do care about having some of the best speakers on a laptop, a top notch trackpad, instant wake from sleep, etc. Some of you people are clueless about what the general public actually care about. Show me another laptop within a 73k budget that offers a 2K display panel, a processor that benchmarks as well as an M1, offers 18 hours of battery life, has speakers and a trackpad as acclaimed as the ones on that “3 year old MacBook Air”, or instant wake from sleep that doesn’t drain your battery. Please link me to a windows laptop that has every one of these things that doesn’t cost more than the 3 year old MacBook Air. I just looked up the E series thinkpad. A 1080p TN panel and 8 hours battery life for 70k is “far, FAR better”. Y’all love getting scammed. That is a garbage tier display for a decidedly premium price. Firstly, you are an Apple/TaylorSwift fanboy. Secondly... I consider machines that cannot run x86 software as not computers. ARM Macbooks are glorified iPhones (even have a notch now). I consider 10-12 hours of battery more than enough for a day. I consider unrepairable Macbooks as Fisher Price toys. Anyone outside of a use case of Final Cut Pro or audio production is not a traditional computer user and exclusively uses their Macbooks just as much as they would find use out of $200 Chromebooks – word documents, web browsing and 1080p video streaming. Touchpad and speakers are Macbook's strengths. But what about the weaknesses like: * a bad keyboard * bad durability * lack of repairability * user not being able to swap RAM and HDD/SSD * not being able to use Windows/Linux freely * lack of ports * lack of free software * incompatibility with non-Apple users (Windows, Linux, Android) * x86 incompatibility (95% of computer software is not made for ARM) * WHAT IS THE NOTCH DOING ON THE SCREEN? ... and so on? Macbook is only good for people with the most basic surfing machine needs, something even a Chromebook can do. Its just a glorified Chromebook unless you are a Final Cut Pro or professional audio producer user. Objectively, this does make Macbook an inferior prospect for any user who want to do anything more serious than surfing the web. ThinkPad also has IPS options and your dookey Macbook glass screen with no anti glare film will be a piece of shit both outdoors and indoors. Indoors because there are tubelights behind you, unless you sit in bed to stream Netflix, and outdoors because there is sun and all kinds of bright objects behind you. I can use those 10 hours of battery life to actually do work and actually be able to create documents and files compatible with Windows, Linux and Android peers. Your hunk of expensive Fisher Price crApple cannot survive a fall and cannot run 95% of the software made for computers. Also you are an Apple/TaylorSwift fanboy."
}