{
    "id": "1h37qly",
    "title": "Indian Engineers Supremacy",
    "url": "https://www.reddit.com/gallery/1h37qly",
    "selftext": "I have never seen so many typos together at one place in a consumer facing page ever.\n\nAmazon India didn’t even bother to check the spellings or is this the new GenZ lingo we all must accustomed to now.",
    "flair": "Rant / Vent",
    "score": 8,
    "num_comments": 15,
    "created_utc": 1732953234,
    "convurl": "https://i.redd.it/dtotxooovz3e1.jpg",
    "comments": [
        "Thnk u for this post stelp brother",
        "First of all, when did amazon started selling scooters?",
        "Cause getting and managing dealers to give consistent customer service is hard...",
        "Select vehicle from vehicle \nAs opposed to select vehicle from not vehicle",
        "And here's a lil bit of AmazonIN mathematics\n\nhttps://preview.redd.it/tzhj4pgp004e1.jpeg?width=540&format=pjpg&auto=webp&s=2883b2c76028e32f3d595a43660c1ac3acb5ddc5",
        "If it said `select vehicle from vehicles` I'd legit think it was coder writing this",
        "methematics*",
        "Amazon is an aggregator. The listing of products is done by the seller who is selling the product. Amazon doesn't need to bother about what the seller puts up. If companies don't present their products well, it affects only the seller.",
        "Prices are decided by the seller and not Amazon. Amazon is simply a platform that charges a fee for selling a product.",
        "See the price calculation per 100 grams. Doesn't Amazon have basic converter integrated into it's software?",
        "It could be something to do with the seller not entering the details properly. For example, you may see that it says 4 kg, but it could be written in the description, but the actual weight not entered correctly in the weights column. It could also have been done intentionally because the Amazon fees is calculated based on the weight.",
        "Scroll down to the product weight of all the different weights. It shows as 1 Kg. So based on what the seller has entered, it is correct.\n\nhttps://preview.redd.it/1d8mvcy8704e1.jpeg?width=720&format=pjpg&auto=webp&s=f8bcd5bf043ff32fbd14a26077a915053cc8de0d",
        "Why should flipkart have all the fun?",
        "This isn’t a seller page to be honest. This is just Amazon advertising one of their marketplaces and procedures about how to use their app. This is a landing page. Seller listing is below. I guess anyone can see that.",
        "Okay. Understood 👍"
    ],
    "cleaned_text": "indian engineers supremacy never seen many typos together one place consumer facing page ever amazon india didnt even bother check spellings new genz lingo must accustomed ",
    "cleaned_title": "indian engineers supremacy",
    "cleaned_selftext": "never seen many typos together one place consumer facing page ever amazon india didnt even bother check spellings new genz lingo must accustomed",
    "cleaned_comments": "thnk u post stelp brother first amazon started selling scooters cause getting managing dealers give consistent customer service hard select vehicle vehicle opposed select vehicle vehicle heres lil bit amazonin mathematics said select vehicle vehicles id legit think coder writing methematics amazon aggregator listing products done seller selling product amazon doesnt need bother seller puts companies dont present products well affects seller prices decided seller amazon amazon simply platform charges fee selling product see price calculation per grams doesnt amazon basic converter integrated software could something seller entering details properly example may see says kg could written description actual weight entered correctly weights column could also done intentionally amazon fees calculated based weight scroll product weight different weights shows kg based seller entered correct flipkart fun isnt seller page honest amazon advertising one marketplaces procedures use app landing page seller listing guess anyone see okay understood",
    "light_cleaned_title": "Indian Engineers Supremacy",
    "light_cleaned_selftext": "I have never seen so many typos together at one place in a consumer facing page ever. Amazon India didn’t even bother to check the spellings or is this the new GenZ lingo we all must accustomed to now.",
    "light_cleaned_comments": "Thnk u for this post stelp brother First of all, when did amazon started selling scooters? Cause getting and managing dealers to give consistent customer service is hard... Select vehicle from vehicle As opposed to select vehicle from not vehicle And here's a lil bit of AmazonIN mathematics If it said `select vehicle from vehicles` I'd legit think it was coder writing this methematics* Amazon is an aggregator. The listing of products is done by the seller who is selling the product. Amazon doesn't need to bother about what the seller puts up. If companies don't present their products well, it affects only the seller. Prices are decided by the seller and not Amazon. Amazon is simply a platform that charges a fee for selling a product. See the price calculation per 100 grams. Doesn't Amazon have basic converter integrated into it's software? It could be something to do with the seller not entering the details properly. For example, you may see that it says 4 kg, but it could be written in the description, but the actual weight not entered correctly in the weights column. It could also have been done intentionally because the Amazon fees is calculated based on the weight. Scroll down to the product weight of all the different weights. It shows as 1 Kg. So based on what the seller has entered, it is correct. Why should flipkart have all the fun? This isn’t a seller page to be honest. This is just Amazon advertising one of their marketplaces and procedures about how to use their app. This is a landing page. Seller listing is below. I guess anyone can see that. Okay. Understood 👍"
}