{
    "id": "15h4s82",
    "title": "The draft Digital Personal Data Protection, 2023 is here... | IFF's first read | #SaveOurPrivacy #SMH",
    "url": "https://www.reddit.com/r/india/comments/15h4s82/the_draft_digital_personal_data_protection_2023/",
    "selftext": " \n\n### tl;dr\n\nThe Ministry of Electronics & Information Technology has introduced the [**draft**](https://drive.google.com/file/d/1jbXWVqzpDMvFFKHgAvpxRU-NhoTfqp2N/view?ref=static.internetfreedom.in) Digital Personal Data Protection Bill, 2023 before the Parliament today. Below, we present our initial thoughts on the draft proposal and how it compares to the 2022 draft. We strongly urge the Union Government to address the numerous recurring problems with successive iterations that have been raised by civil society stakeholders.\n\n \n\n### Background\n\nhttps://preview.redd.it/u4wt0tukgwfb1.png?width=1414&format=png&auto=webp&s=8211ac65ec5d00bb4c86426ad0df53497be5be3c\n\n An Expert Committee on Privacy headed by Justice A.P. Shah under the erstwhile Planning Commission presented a report on October 12, 2012 which serves as an influential document on international & national privacy standards.The Expert Committee on Data Protection chaired by Justice BN Srikrishna was constituted by the Ministry for Electronics and Information Technology (“MeitY”) on July 31, 2017. The Committee released its 176 page Report to the MeitY and proposed the Personal Data Protection Bill, 2018 on July 27, 2018. As soon as the Personal Data Protection Bill, 2019 (“PDPB, 2019”) was introduced in the Parliament on December 11, 2019, it was sent to a Joint Parliamentary Committee (“JPC”) with members from both the Houses for its review and suggestions. After nearly two years and several extensions, the Joint Committee on the Personal Data Protection Bill, 2019 brought out its report on December 16, 2021. The Report also contained a new version of the law titled, “The Data Protection Bill, 2021” (“DBP, 2021”). However, the DPB, 2021 was withdrawn by the Minister for Communications and Information Technology, Ashwini Vaishnaw on August 3, 2022. The Ministry of Electronics & Information Technology released the draft Digital Personal Data Protection Bill, 2022 (DPDPB, 2022) on November 18, 2022 for public consultation. The notice accompanying the DPDPB, 2022 stated that submissions made as part of the consultation process will not be made public.\n\n### Overall analysis\n\n1. **Consultation and introduction process raises concerns**: The notice accompanying the DPDPB, 2022 stated that comments received will not be made public by MeitY. Further, the consultation process required interested participants to register on the MyGov website in order to be able to provide comments which was a significant hurdle. Here, parliamentary procedure also may have been circumvented when the Standing Committee on Information Technology took up the DPDPB, 2023 even though it was not formally referred to it, a move which led the opposition party members of the Standing Committee to [**walk out**](https://economictimes.indiatimes.com/news/india/data-protection-bill-parliamentary-panel-adopts-report-amid-opposition-walkout/articleshow/102149678.cms?ref=static.internetfreedom.in) from the meeting adopting the report.\n2. **Weak notice requirement**s: Compared to the 2019 & 2021 versions, data fiduciaries do not have to inform principals about the third-parties with whom their data will be shared, the duration for which their data will be stored and if their data will be transferred to other countries.\n3. **Vague non-consensual processing of data permitted**: The DPDPB, 2022 allowed the Data Fiduciary to assume consent of the Data Principal if the processing was considered necessary as per certain situations such as for the breakdown of public order, for purposes related to employment, and in public interest. The “deemed consent” clause of DPDPB, 2022 has now been replaced with the “certain legitimate uses” clause with only the public interest sub-clause being removed in DPDPB, 2023.\n4. **Duties and penalties imposed on Data Principals**: Duties such as not registering a false or frivolous grievance or complaint have been imposed on the Data Principal, the violation of which could result in penalties (of upto 10,000 INR).\n5. **Vague factors for data transfer**: The DPDPB, 2022 did away with the requirement of data localisation contained in the 2019 & 2021 iterations but proposed to put in place an allowlist of countries that would be eligible to receive Indian data. The DPDPB, 2023 further changes this provision to propose that a blocklist of countries will be notified instead to which Indian data may not be transferred. However, the factors based on which it will be determined that a country may or may not be eligible to receive Indian data have not been specified.\n6. **Exemptions created for private actors**: The DPDPB, 2022 provided the Union Government with the power to exempt certain data fiduciaries or class of data fiduciaries from selected provisions. The DPDPB, 2023 retains this provision and specifically includes startups as data fiduciaries that may be exempted by the Union Government.\n7. **Exemptions for government widened further**: The Union Government had retained the power to exempt any government instrumentality (GI) from the application of the DPDPB, 2022. Additionally, the DPDPB, 2022 also failed to put into place any meaningful safeguards against overbroad surveillance which weakens the right to privacy of Indian citizens. The DPDPB, 2023 has further widened the scope of these exemptions by expanding it to include any processing of data done by the Union Government on information provided to it by an exempted instrumentality. Thus, the data collected by these instrumentalities itself will be exempted.\n8. **Data Protection Board’s independence under question**: In the DPDPB, 2022 the Union Government had been empowered to prescribe the strength and composition of the Data Protection Board, the process of selection, terms and conditions of appointment and service, removal of its Chairperson and other Members at a later stage as well as appointing the Chief Executive of the Board. However, the DPDPB, 2023 weakens the DPB further as all appointments will now be made by the Union Government.\n9. **Weakening of the Right to Information Act, 2005**: Through amendments, the DPDPB, 2023 removes the public interest exception to disclosure of personal information under the Right to Information Act, 2005.\n10. **Failure to carry out surveillance reform**: In addition to providing wide exemptions to the state, the DPDPB, 2023 also fails to put into place any meaningful safeguards against overbroad surveillance which weakens the right to privacy of Indian citizens.\n11. **Power to block access to information introduced**: The DPDPB, 2023 has empowered the Union Government to block access to any information if it receives a direction from the DPB to restrict such information in the interest of the general public.\n12. **Important provisions left to future executive rule-making**: The DPDPB, 2023 lists 25 specific situations for which the Union Government will notify rules at a later stage and also gives itself the leeway to notify rules at a later stage for “any other matter which is to be or may be prescribed”. This cripples the ability of stakeholders to meaningfully engage with the draft proposal.  \n\n### Analysis of the key changes in DPDPB, 2023\n\n**A. Deemed consent rebranded to “certain legitimate uses”**\n\nClause 7 of the DPDPB, 2023 pertains to “certain legitimate uses”. This clause replaces the “deemed consent” clause of DPDPB, 2022 in name; however, the content of the clause largely remains the same. The clause states that processing of personal data may be done without obtaining the informed consent of the data principal in certain situations. The DPDPB, 2022 was widely criticised for facilitating non-consensual processing of personal data. The DPDPB, 2023 varies from the 2022 iteration by omitting the sub-clause which allowed consent to be deemed in “public interest”. This is a positive development since the sub-clause failed to strictly define the situations in which it may be invoked and thus, could have been widely interpreted leading to misuse.\n\n**B.** **Processing of personal data outside India to be done according to a blocklist**\n\nClause 16 of the DPDPB, 2023 relates to the transfer and processing of personal data outside India. While the 2022 draft provided for a allowlist of countries to which data transfer would be allowed, the DPDPB, 2023 proposes a blocklist of countries to which data transfer would not be allowed. Thus, data transfer will be allowed to all countries which are not on the blocklist. The blocklist will be notified by the Union Government upon the assessment of such factors as it may consider necessary. Here, it is disappointing that an exhaustive list of the necessary factors which the Union Government would consider to arrive at the blocklist have not been included in the DPDPB, 2023. It is essential that the criteria for inclusion on the blocklist be specifically defined to protect against arbitrary standards.\n\n**C. Government exemptions expanded**\n\nClause 17(2)(a) of the DPDPB, 2023 expands the scope of the exemptions provided to government instrumentalities and their data processing activities. In the 2022 draft, processing of personal data by notified instrumentalities of the Union Government was exempted from the application of the bill. In DPDPB, 2023, this exemption has been expanded to include any processing of data done by the Union Government on information provided to it by an exempted instrumentality. Thus, any information once collected by an exempted instrumentality and shared with the Union Government would continue to be exempted from the purview of the bill, regardless of whether it is being processed by an exempted instrumentality of the Union Government. Any exemptions sought by government agencies should be granted only if they fulfil the standards of legality, necessity, and proportionality. It is essential that government collection and processing of citizen data is regulated to prevent misuse.\n\n**D. Data Protection Board still weak**\n\nChapters 5 and 6 of the DPDPB, 2023 relates to the Data Protection Board (DPB). The provisions related to the DPB have worsened considerably. In the 2022 draft, only the Chairperson of the DPB was to be appointed by the Union Government. However, in DPDPB, 2023, all members of the DPB will now be appointed by the Union Government. This strengthens the criticism that had been levied at previous versions of the bill which questioned the independence of the DPB. It is essential that the Board is independent of executive control. This was also held by the Supreme Court of India in *Madras Bar Association vs Union of India* (2020) where they stated that, “Dispensation of justice by the Tribunals can be effective only when they function independent of any executive control: this renders them credible and generates public confidence”. Further, the DPDPB, 2023, like its predecessor, only provides adjudicatory powers to the DPB. Here, it is essential that the DPB should also be tasked with regulatory powers that previous iterations of the data protection legislation in 2019 and 2021 tasked the Data Protection Authority with. This will also be keeping in line with supervisory authorities across various jurisdictions which enjoy both adjudicatory and regulatory powers. One positive change which has been made is that the salary, allowances and other terms and conditions of service of the Chairperson and other Members can not be varied to their disadvantage after their appointment.\n\n**E. Appeals process revised**\n\nThe DPDPB, 2023 denotes the Telecom Disputes Settlement and  Appellate Tribunal established under section 14 of the Telecom Regulatory Authority of India Act, 1997 as the appellate tribunal to which appeals against the decisions of the DPB will lie. It is unclear why this change has been made and how the Telecom Disputes Settlement and  Appellate Tribunal was selected specifically.\n\n### Recommendations\n\nThe DPDPB, 2023 reiterates the shortcomings of the DPDPB, 2022 and fails to inculcate several of the meaningful recommendations that had been made during the consultation process which were subsequently made public by the relevant stakeholders. We strongly urge the Union Government to address the numerous recurring problems with successive iterations that have been raised by civil society stakeholders.\n\nIn its present form, the DPDPB, 2023 does not sufficiently safeguard the Right to Privacy and must not be enacted. There must be meaningful discussion and debate on the draft bill in the Parliament, including a referral to an appropriate committee which may further seek public inputs in the course of its deliberations to re-architect the bill such that it protects citizens’ privacy from private entities as well as state instrumentalities.\n\nWe will continue to monitor the developments around the DPDPB, 2023 and publish further analysis to raise public awareness around our concerns with the draft.\n\n### Important documents\n\n1. The draft Digital Personal Data Protection Bill, 2023 dated August 3, 2023 ([**link**](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/7hw4zj8vsvwdake/the_draft_digital_personal_data_protection_bill_2023_QCSAkZYLMx.pdf?ref=static.internetfreedom.in))\n2. Read our public brief on the draft Digital Personal Data Protection Bill, 2022 dated February 16, 2023 ([**link**](https://internetfreedom.in/read-our-public-brief-on-the-draft-digital-personal-data-protection-bill-2022/?ref=static.internetfreedom.in))\n3. Living document containing key changes in the DPDPB, 2023 when compared to the DPDPB, 2022  ([**link**](https://docs.google.com/document/d/1BDUCQ_Wc01nof1Qr8HlU9RTkg2SkXWrQmIfOL9uCHgs/edit?ref=static.internetfreedom.in))  \n\n\n&#x200B;\n\nhttps://preview.redd.it/wup7tvfugwfb1.png?width=616&format=png&auto=webp&s=16ebe0274735aa6390449a6253985ecf71f1baac\n\nThe Digital Data Protection Bill, 2023 was introduced in Parliament today & from tracking the debate in Lok Sabha, to publishing our statement, to writing our first read…it has been a… day. One of many on the long road toward just data protection legislation.\n\nAnd while the Bill may have disappointed, we don’t.\n\nWe keep showing up, day after day, to defend your rights. But we can’t do it alone. To help us keep the fight going, donate/become an IFF member today!\n\n[https://internetfreedom.in/donate/](https://internetfreedom.in/donate/)   \n",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691070536.0,
    "convurl": "https://b.thumbs.redditmedia.com/PwC_nllUcZd-sBtBVfzMsJM2zujMeOQAdW6PzAHG1ds.jpg",
    "comments": [
        "Can you summarize it ?",
        "They already have. Its a wholeass bill and they've provided both a basic summary and a final comment on their analysis.",
        "We are working on smaller and simpler explainers for the bill that we'll put out soon! Please stay tuned and thank you for your support."
    ],
    "cleaned_text": "draft digital personal data protection iffs first read saveourprivacy smh tldr ministry electronics information technology introduced drafthttpsdrivegooglecomfiledjbxwvqzpdmvffkhgavpxrunhotfqpnviewrefstaticinternetfreedomin digital personal data protection bill parliament today present initial thoughts draft proposal compares draft strongly urge union government address numerous recurring problems successive iterations raised civil society stakeholders background expert committee privacy headed justice ap shah erstwhile planning commission presented report october serves influential document international national privacy standardsthe expert committee data protection chaired justice bn srikrishna constituted ministry electronics information technology meity july committee released page report meity proposed personal data protection bill july soon personal data protection bill pdpb introduced parliament december sent joint parliamentary committee jpc members houses review suggestions nearly two years several extensions joint committee personal data protection bill brought report december report also contained new version law titled data protection bill dbp however dpb withdrawn minister communications information technology ashwini vaishnaw august ministry electronics information technology released draft digital personal data protection bill dpdpb november public consultation notice accompanying dpdpb stated submissions made part consultation process made public overall analysis consultation introduction process raises concerns notice accompanying dpdpb stated comments received made public meity consultation process required interested participants register mygov website order able provide comments significant hurdle parliamentary procedure also may circumvented standing committee information technology took dpdpb even though formally referred move led opposition party members standing committee walk outhttpseconomictimesindiatimescomnewsindiadataprotectionbillparliamentarypaneladoptsreportamidoppositionwalkoutarticleshowcmsrefstaticinternetfreedomin meeting adopting report weak notice requirements compared versions data fiduciaries inform principals thirdparties data shared duration data stored data transferred countries vague nonconsensual processing data permitted dpdpb allowed data fiduciary assume consent data principal processing considered necessary per certain situations breakdown public order purposes related employment public interest deemed consent clause dpdpb replaced certain legitimate uses clause public interest subclause removed dpdpb duties penalties imposed data principals duties registering false frivolous grievance complaint imposed data principal violation could result penalties upto inr vague factors data transfer dpdpb away requirement data localisation contained iterations proposed put place allowlist countries would eligible receive indian data dpdpb changes provision propose blocklist countries notified instead indian data may transferred however factors based determined country may may eligible receive indian data specified exemptions created private actors dpdpb provided union government power exempt certain data fiduciaries class data fiduciaries selected provisions dpdpb retains provision specifically includes startups data fiduciaries may exempted union government exemptions government widened union government retained power exempt government instrumentality gi application dpdpb additionally dpdpb also failed put place meaningful safeguards overbroad surveillance weakens right privacy indian citizens dpdpb widened scope exemptions expanding include processing data done union government information provided exempted instrumentality thus data collected instrumentalities exempted data protection boards independence question dpdpb union government empowered prescribe strength composition data protection board process selection terms conditions appointment service removal chairperson members later stage well appointing chief executive board however dpdpb weakens dpb appointments made union government weakening right information act amendments dpdpb removes public interest exception disclosure personal information right information act failure carry surveillance reform addition providing wide exemptions state dpdpb also fails put place meaningful safeguards overbroad surveillance weakens right privacy indian citizens power block access information introduced dpdpb empowered union government block access information receives direction dpb restrict information interest general public important provisions left future executive rulemaking dpdpb lists specific situations union government notify rules later stage also gives leeway notify rules later stage matter may prescribed cripples ability stakeholders meaningfully engage draft proposal analysis key changes dpdpb deemed consent rebranded certain legitimate uses clause dpdpb pertains certain legitimate uses clause replaces deemed consent clause dpdpb name however content clause largely remains clause states processing personal data may done without obtaining informed consent data principal certain situations dpdpb widely criticised facilitating nonconsensual processing personal data dpdpb varies iteration omitting subclause allowed consent deemed public interest positive development since subclause failed strictly define situations may invoked thus could widely interpreted leading misuse b processing personal data outside india done according blocklist clause dpdpb relates transfer processing personal data outside india draft provided allowlist countries data transfer would allowed dpdpb proposes blocklist countries data transfer would allowed thus data transfer allowed countries blocklist blocklist notified union government upon assessment factors may consider necessary disappointing exhaustive list necessary factors union government would consider arrive blocklist included dpdpb essential criteria inclusion blocklist specifically defined protect arbitrary standards c government exemptions expanded clause dpdpb expands scope exemptions provided government instrumentalities data processing activities draft processing personal data notified instrumentalities union government exempted application bill dpdpb exemption expanded include processing data done union government information provided exempted instrumentality thus information collected exempted instrumentality shared union government would continue exempted purview bill regardless whether processed exempted instrumentality union government exemptions sought government agencies granted fulfil standards legality necessity proportionality essential government collection processing citizen data regulated prevent misuse data protection board still weak chapters dpdpb relates data protection board dpb provisions related dpb worsened considerably draft chairperson dpb appointed union government however dpdpb members dpb appointed union government strengthens criticism levied previous versions bill questioned independence dpb essential board independent executive control also held supreme court india madras bar association vs union india stated dispensation justice tribunals effective function independent executive control renders credible generates public confidence dpdpb like predecessor provides adjudicatory powers dpb essential dpb also tasked regulatory powers previous iterations data protection legislation tasked data protection authority also keeping line supervisory authorities across various jurisdictions enjoy adjudicatory regulatory powers one positive change made salary allowances terms conditions service chairperson members varied disadvantage appointment e appeals process revised dpdpb denotes telecom disputes settlement appellate tribunal established section telecom regulatory authority india act appellate tribunal appeals decisions dpb lie unclear change made telecom disputes settlement appellate tribunal selected specifically recommendations dpdpb reiterates shortcomings dpdpb fails inculcate several meaningful recommendations made consultation process subsequently made public relevant stakeholders strongly urge union government address numerous recurring problems successive iterations raised civil society stakeholders present form dpdpb sufficiently safeguard right privacy must enacted must meaningful discussion debate draft bill parliament including referral appropriate committee may seek public inputs course deliberations rearchitect bill protects citizens privacy private entities well state instrumentalities continue monitor developments around dpdpb publish analysis raise public awareness around concerns draft important documents draft digital personal data protection bill dated august linkhttpscontentinternetfreedominapifilesdivcoywedtrpehwzjvsvwdakethedraftdigitalpersonaldataprotectionbillqcsakzylmxpdfrefstaticinternetfreedomin read public brief draft digital personal data protection bill dated february linkhttpsinternetfreedominreadourpublicbriefonthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin living document containing key changes dpdpb compared dpdpb linkhttpsdocsgooglecomdocumentdbducqwcnofqrhlurtkgskxwrqmifoluchgseditrefstaticinternetfreedomin xb digital data protection bill introduced parliament today tracking debate lok sabha publishing statement writing first readit day one many long road toward data protection legislation bill may disappointed dont keep showing day day defend rights cant alone help us keep fight going donatebecome iff member today httpsinternetfreedomindonatehttpsinternetfreedomindonate ",
    "cleaned_title": "draft digital personal data protection iffs first read saveourprivacy smh",
    "cleaned_selftext": "tldr ministry electronics information technology introduced drafthttpsdrivegooglecomfiledjbxwvqzpdmvffkhgavpxrunhotfqpnviewrefstaticinternetfreedomin digital personal data protection bill parliament today present initial thoughts draft proposal compares draft strongly urge union government address numerous recurring problems successive iterations raised civil society stakeholders background expert committee privacy headed justice ap shah erstwhile planning commission presented report october serves influential document international national privacy standardsthe expert committee data protection chaired justice bn srikrishna constituted ministry electronics information technology meity july committee released page report meity proposed personal data protection bill july soon personal data protection bill pdpb introduced parliament december sent joint parliamentary committee jpc members houses review suggestions nearly two years several extensions joint committee personal data protection bill brought report december report also contained new version law titled data protection bill dbp however dpb withdrawn minister communications information technology ashwini vaishnaw august ministry electronics information technology released draft digital personal data protection bill dpdpb november public consultation notice accompanying dpdpb stated submissions made part consultation process made public overall analysis consultation introduction process raises concerns notice accompanying dpdpb stated comments received made public meity consultation process required interested participants register mygov website order able provide comments significant hurdle parliamentary procedure also may circumvented standing committee information technology took dpdpb even though formally referred move led opposition party members standing committee walk outhttpseconomictimesindiatimescomnewsindiadataprotectionbillparliamentarypaneladoptsreportamidoppositionwalkoutarticleshowcmsrefstaticinternetfreedomin meeting adopting report weak notice requirements compared versions data fiduciaries inform principals thirdparties data shared duration data stored data transferred countries vague nonconsensual processing data permitted dpdpb allowed data fiduciary assume consent data principal processing considered necessary per certain situations breakdown public order purposes related employment public interest deemed consent clause dpdpb replaced certain legitimate uses clause public interest subclause removed dpdpb duties penalties imposed data principals duties registering false frivolous grievance complaint imposed data principal violation could result penalties upto inr vague factors data transfer dpdpb away requirement data localisation contained iterations proposed put place allowlist countries would eligible receive indian data dpdpb changes provision propose blocklist countries notified instead indian data may transferred however factors based determined country may may eligible receive indian data specified exemptions created private actors dpdpb provided union government power exempt certain data fiduciaries class data fiduciaries selected provisions dpdpb retains provision specifically includes startups data fiduciaries may exempted union government exemptions government widened union government retained power exempt government instrumentality gi application dpdpb additionally dpdpb also failed put place meaningful safeguards overbroad surveillance weakens right privacy indian citizens dpdpb widened scope exemptions expanding include processing data done union government information provided exempted instrumentality thus data collected instrumentalities exempted data protection boards independence question dpdpb union government empowered prescribe strength composition data protection board process selection terms conditions appointment service removal chairperson members later stage well appointing chief executive board however dpdpb weakens dpb appointments made union government weakening right information act amendments dpdpb removes public interest exception disclosure personal information right information act failure carry surveillance reform addition providing wide exemptions state dpdpb also fails put place meaningful safeguards overbroad surveillance weakens right privacy indian citizens power block access information introduced dpdpb empowered union government block access information receives direction dpb restrict information interest general public important provisions left future executive rulemaking dpdpb lists specific situations union government notify rules later stage also gives leeway notify rules later stage matter may prescribed cripples ability stakeholders meaningfully engage draft proposal analysis key changes dpdpb deemed consent rebranded certain legitimate uses clause dpdpb pertains certain legitimate uses clause replaces deemed consent clause dpdpb name however content clause largely remains clause states processing personal data may done without obtaining informed consent data principal certain situations dpdpb widely criticised facilitating nonconsensual processing personal data dpdpb varies iteration omitting subclause allowed consent deemed public interest positive development since subclause failed strictly define situations may invoked thus could widely interpreted leading misuse b processing personal data outside india done according blocklist clause dpdpb relates transfer processing personal data outside india draft provided allowlist countries data transfer would allowed dpdpb proposes blocklist countries data transfer would allowed thus data transfer allowed countries blocklist blocklist notified union government upon assessment factors may consider necessary disappointing exhaustive list necessary factors union government would consider arrive blocklist included dpdpb essential criteria inclusion blocklist specifically defined protect arbitrary standards c government exemptions expanded clause dpdpb expands scope exemptions provided government instrumentalities data processing activities draft processing personal data notified instrumentalities union government exempted application bill dpdpb exemption expanded include processing data done union government information provided exempted instrumentality thus information collected exempted instrumentality shared union government would continue exempted purview bill regardless whether processed exempted instrumentality union government exemptions sought government agencies granted fulfil standards legality necessity proportionality essential government collection processing citizen data regulated prevent misuse data protection board still weak chapters dpdpb relates data protection board dpb provisions related dpb worsened considerably draft chairperson dpb appointed union government however dpdpb members dpb appointed union government strengthens criticism levied previous versions bill questioned independence dpb essential board independent executive control also held supreme court india madras bar association vs union india stated dispensation justice tribunals effective function independent executive control renders credible generates public confidence dpdpb like predecessor provides adjudicatory powers dpb essential dpb also tasked regulatory powers previous iterations data protection legislation tasked data protection authority also keeping line supervisory authorities across various jurisdictions enjoy adjudicatory regulatory powers one positive change made salary allowances terms conditions service chairperson members varied disadvantage appointment e appeals process revised dpdpb denotes telecom disputes settlement appellate tribunal established section telecom regulatory authority india act appellate tribunal appeals decisions dpb lie unclear change made telecom disputes settlement appellate tribunal selected specifically recommendations dpdpb reiterates shortcomings dpdpb fails inculcate several meaningful recommendations made consultation process subsequently made public relevant stakeholders strongly urge union government address numerous recurring problems successive iterations raised civil society stakeholders present form dpdpb sufficiently safeguard right privacy must enacted must meaningful discussion debate draft bill parliament including referral appropriate committee may seek public inputs course deliberations rearchitect bill protects citizens privacy private entities well state instrumentalities continue monitor developments around dpdpb publish analysis raise public awareness around concerns draft important documents draft digital personal data protection bill dated august linkhttpscontentinternetfreedominapifilesdivcoywedtrpehwzjvsvwdakethedraftdigitalpersonaldataprotectionbillqcsakzylmxpdfrefstaticinternetfreedomin read public brief draft digital personal data protection bill dated february linkhttpsinternetfreedominreadourpublicbriefonthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin living document containing key changes dpdpb compared dpdpb linkhttpsdocsgooglecomdocumentdbducqwcnofqrhlurtkgskxwrqmifoluchgseditrefstaticinternetfreedomin xb digital data protection bill introduced parliament today tracking debate lok sabha publishing statement writing first readit day one many long road toward data protection legislation bill may disappointed dont keep showing day day defend rights cant alone help us keep fight going donatebecome iff member today httpsinternetfreedomindonatehttpsinternetfreedomindonate",
    "cleaned_comments": "summarize already wholeass bill theyve provided basic summary final comment analysis working smaller simpler explainers bill well put soon please stay tuned thank support",
    "light_cleaned_title": "The draft Digital Personal Data Protection, 2023 is here... | IFF's first read | #SaveOurPrivacy #SMH",
    "light_cleaned_selftext": "### tl;dr The Ministry of Electronics & Information Technology has introduced the [**draft**](https://drive.google.com/file/d/1jbXWVqzpDMvFFKHgAvpxRU-NhoTfqp2N/view?ref=static.internetfreedom.in) Digital Personal Data Protection Bill, 2023 before the Parliament today. Below, we present our initial thoughts on the draft proposal and how it compares to the 2022 draft. We strongly urge the Union Government to address the numerous recurring problems with successive iterations that have been raised by civil society stakeholders. ### Background An Expert Committee on Privacy headed by Justice A.P. Shah under the erstwhile Planning Commission presented a report on October 12, 2012 which serves as an influential document on international & national privacy standards.The Expert Committee on Data Protection chaired by Justice BN Srikrishna was constituted by the Ministry for Electronics and Information Technology (“MeitY”) on July 31, 2017. The Committee released its 176 page Report to the MeitY and proposed the Personal Data Protection Bill, 2018 on July 27, 2018. As soon as the Personal Data Protection Bill, 2019 (“PDPB, 2019”) was introduced in the Parliament on December 11, 2019, it was sent to a Joint Parliamentary Committee (“JPC”) with members from both the Houses for its review and suggestions. After nearly two years and several extensions, the Joint Committee on the Personal Data Protection Bill, 2019 brought out its report on December 16, 2021. The Report also contained a new version of the law titled, “The Data Protection Bill, 2021” (“DBP, 2021”). However, the DPB, 2021 was withdrawn by the Minister for Communications and Information Technology, Ashwini Vaishnaw on August 3, 2022. The Ministry of Electronics & Information Technology released the draft Digital Personal Data Protection Bill, 2022 (DPDPB, 2022) on November 18, 2022 for public consultation. The notice accompanying the DPDPB, 2022 stated that submissions made as part of the consultation process will not be made public. ### Overall analysis 1. **Consultation and introduction process raises concerns**: The notice accompanying the DPDPB, 2022 stated that comments received will not be made public by MeitY. Further, the consultation process required interested participants to register on the MyGov website in order to be able to provide comments which was a significant hurdle. Here, parliamentary procedure also may have been circumvented when the Standing Committee on Information Technology took up the DPDPB, 2023 even though it was not formally referred to it, a move which led the opposition party members of the Standing Committee to [**walk out**](https://economictimes.indiatimes.com/news/india/data-protection-bill-parliamentary-panel-adopts-report-amid-opposition-walkout/articleshow/102149678.cms?ref=static.internetfreedom.in) from the meeting adopting the report. 2. **Weak notice requirement**s: Compared to the 2019 & 2021 versions, data fiduciaries do not have to inform principals about the third-parties with whom their data will be shared, the duration for which their data will be stored and if their data will be transferred to other countries. 3. **Vague non-consensual processing of data permitted**: The DPDPB, 2022 allowed the Data Fiduciary to assume consent of the Data Principal if the processing was considered necessary as per certain situations such as for the breakdown of public order, for purposes related to employment, and in public interest. The “deemed consent” clause of DPDPB, 2022 has now been replaced with the “certain legitimate uses” clause with only the public interest sub-clause being removed in DPDPB, 2023. 4. **Duties and penalties imposed on Data Principals**: Duties such as not registering a false or frivolous grievance or complaint have been imposed on the Data Principal, the violation of which could result in penalties (of upto 10,000 INR). 5. **Vague factors for data transfer**: The DPDPB, 2022 did away with the requirement of data localisation contained in the 2019 & 2021 iterations but proposed to put in place an allowlist of countries that would be eligible to receive Indian data. The DPDPB, 2023 further changes this provision to propose that a blocklist of countries will be notified instead to which Indian data may not be transferred. However, the factors based on which it will be determined that a country may or may not be eligible to receive Indian data have not been specified. 6. **Exemptions created for private actors**: The DPDPB, 2022 provided the Union Government with the power to exempt certain data fiduciaries or class of data fiduciaries from selected provisions. The DPDPB, 2023 retains this provision and specifically includes startups as data fiduciaries that may be exempted by the Union Government. 7. **Exemptions for government widened further**: The Union Government had retained the power to exempt any government instrumentality (GI) from the application of the DPDPB, 2022. Additionally, the DPDPB, 2022 also failed to put into place any meaningful safeguards against overbroad surveillance which weakens the right to privacy of Indian citizens. The DPDPB, 2023 has further widened the scope of these exemptions by expanding it to include any processing of data done by the Union Government on information provided to it by an exempted instrumentality. Thus, the data collected by these instrumentalities itself will be exempted. 8. **Data Protection Board’s independence under question**: In the DPDPB, 2022 the Union Government had been empowered to prescribe the strength and composition of the Data Protection Board, the process of selection, terms and conditions of appointment and service, removal of its Chairperson and other Members at a later stage as well as appointing the Chief Executive of the Board. However, the DPDPB, 2023 weakens the DPB further as all appointments will now be made by the Union Government. 9. **Weakening of the Right to Information Act, 2005**: Through amendments, the DPDPB, 2023 removes the public interest exception to disclosure of personal information under the Right to Information Act, 2005. 10. **Failure to carry out surveillance reform**: In addition to providing wide exemptions to the state, the DPDPB, 2023 also fails to put into place any meaningful safeguards against overbroad surveillance which weakens the right to privacy of Indian citizens. 11. **Power to block access to information introduced**: The DPDPB, 2023 has empowered the Union Government to block access to any information if it receives a direction from the DPB to restrict such information in the interest of the general public. 12. **Important provisions left to future executive rule-making**: The DPDPB, 2023 lists 25 specific situations for which the Union Government will notify rules at a later stage and also gives itself the leeway to notify rules at a later stage for “any other matter which is to be or may be prescribed”. This cripples the ability of stakeholders to meaningfully engage with the draft proposal. ### Analysis of the key changes in DPDPB, 2023 **A. Deemed consent rebranded to “certain legitimate uses”** Clause 7 of the DPDPB, 2023 pertains to “certain legitimate uses”. This clause replaces the “deemed consent” clause of DPDPB, 2022 in name; however, the content of the clause largely remains the same. The clause states that processing of personal data may be done without obtaining the informed consent of the data principal in certain situations. The DPDPB, 2022 was widely criticised for facilitating non-consensual processing of personal data. The DPDPB, 2023 varies from the 2022 iteration by omitting the sub-clause which allowed consent to be deemed in “public interest”. This is a positive development since the sub-clause failed to strictly define the situations in which it may be invoked and thus, could have been widely interpreted leading to misuse. **B.** **Processing of personal data outside India to be done according to a blocklist** Clause 16 of the DPDPB, 2023 relates to the transfer and processing of personal data outside India. While the 2022 draft provided for a allowlist of countries to which data transfer would be allowed, the DPDPB, 2023 proposes a blocklist of countries to which data transfer would not be allowed. Thus, data transfer will be allowed to all countries which are not on the blocklist. The blocklist will be notified by the Union Government upon the assessment of such factors as it may consider necessary. Here, it is disappointing that an exhaustive list of the necessary factors which the Union Government would consider to arrive at the blocklist have not been included in the DPDPB, 2023. It is essential that the criteria for inclusion on the blocklist be specifically defined to protect against arbitrary standards. **C. Government exemptions expanded** Clause 17(2)(a) of the DPDPB, 2023 expands the scope of the exemptions provided to government instrumentalities and their data processing activities. In the 2022 draft, processing of personal data by notified instrumentalities of the Union Government was exempted from the application of the bill. In DPDPB, 2023, this exemption has been expanded to include any processing of data done by the Union Government on information provided to it by an exempted instrumentality. Thus, any information once collected by an exempted instrumentality and shared with the Union Government would continue to be exempted from the purview of the bill, regardless of whether it is being processed by an exempted instrumentality of the Union Government. Any exemptions sought by government agencies should be granted only if they fulfil the standards of legality, necessity, and proportionality. It is essential that government collection and processing of citizen data is regulated to prevent misuse. **D. Data Protection Board still weak** Chapters 5 and 6 of the DPDPB, 2023 relates to the Data Protection Board (DPB). The provisions related to the DPB have worsened considerably. In the 2022 draft, only the Chairperson of the DPB was to be appointed by the Union Government. However, in DPDPB, 2023, all members of the DPB will now be appointed by the Union Government. This strengthens the criticism that had been levied at previous versions of the bill which questioned the independence of the DPB. It is essential that the Board is independent of executive control. This was also held by the Supreme Court of India in *Madras Bar Association vs Union of India* (2020) where they stated that, “Dispensation of justice by the Tribunals can be effective only when they function independent of any executive control: this renders them credible and generates public confidence”. Further, the DPDPB, 2023, like its predecessor, only provides adjudicatory powers to the DPB. Here, it is essential that the DPB should also be tasked with regulatory powers that previous iterations of the data protection legislation in 2019 and 2021 tasked the Data Protection Authority with. This will also be keeping in line with supervisory authorities across various jurisdictions which enjoy both adjudicatory and regulatory powers. One positive change which has been made is that the salary, allowances and other terms and conditions of service of the Chairperson and other Members can not be varied to their disadvantage after their appointment. **E. Appeals process revised** The DPDPB, 2023 denotes the Telecom Disputes Settlement and Appellate Tribunal established under section 14 of the Telecom Regulatory Authority of India Act, 1997 as the appellate tribunal to which appeals against the decisions of the DPB will lie. It is unclear why this change has been made and how the Telecom Disputes Settlement and Appellate Tribunal was selected specifically. ### Recommendations The DPDPB, 2023 reiterates the shortcomings of the DPDPB, 2022 and fails to inculcate several of the meaningful recommendations that had been made during the consultation process which were subsequently made public by the relevant stakeholders. We strongly urge the Union Government to address the numerous recurring problems with successive iterations that have been raised by civil society stakeholders. In its present form, the DPDPB, 2023 does not sufficiently safeguard the Right to Privacy and must not be enacted. There must be meaningful discussion and debate on the draft bill in the Parliament, including a referral to an appropriate committee which may further seek public inputs in the course of its deliberations to re-architect the bill such that it protects citizens’ privacy from private entities as well as state instrumentalities. We will continue to monitor the developments around the DPDPB, 2023 and publish further analysis to raise public awareness around our concerns with the draft. ### Important documents 1. The draft Digital Personal Data Protection Bill, 2023 dated August 3, 2023 ([**link**](https://content.internetfreedom.in/api/files/divco3ywedt9rpe/7hw4zj8vsvwdake/the_draft_digital_personal_data_protection_bill_2023_QCSAkZYLMx.pdf?ref=static.internetfreedom.in)) 2. Read our public brief on the draft Digital Personal Data Protection Bill, 2022 dated February 16, 2023 ([**link**](https://internetfreedom.in/read-our-public-brief-on-the-draft-digital-personal-data-protection-bill-2022/?ref=static.internetfreedom.in)) 3. Living document containing key changes in the DPDPB, 2023 when compared to the DPDPB, 2022 ([**link**](https://docs.google.com/document/d/1BDUCQ_Wc01nof1Qr8HlU9RTkg2SkXWrQmIfOL9uCHgs/edit?ref=static.internetfreedom.in)) &#x200B; The Digital Data Protection Bill, 2023 was introduced in Parliament today & from tracking the debate in Lok Sabha, to publishing our statement, to writing our first read…it has been a… day. One of many on the long road toward just data protection legislation. And while the Bill may have disappointed, we don’t. We keep showing up, day after day, to defend your rights. But we can’t do it alone. To help us keep the fight going, donate/become an IFF member today! [https://internetfreedom.in/donate/](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": "Can you summarize it ? They already have. Its a wholeass bill and they've provided both a basic summary and a final comment on their analysis. We are working on smaller and simpler explainers for the bill that we'll put out soon! Please stay tuned and thank you for your support."
}