{
    "id": "13z9dzs",
    "title": "[31 May 2023] Increase in train accidents worries Indian Railways",
    "url": "https://www.thehindu.com/news/national/increase-in-train-accidents-worries-indian-railways/article66915585.ece",
    "selftext": "Rather than resignation, demand for better accountability of railways towards it's staff and passengers",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 1,
    "created_utc": 1685790260.0,
    "convurl": "https://external-preview.redd.it/nTlBdIL4o-0JC5JEMNoEZxz4w2oMSDMSh8xGkNjuytc.jpg?auto=webp&v=enabled&s=cde5abba05b459f5fb5a8e2c592c0d4a14cf5c1b",
    "comments": [
        ">Manpower shortages are causing many loco pilots to work long hours, beyond the 12 hours per day maximum, often without leave or rest; Railway Board urges immediate measures to fill vacancies\n\n>The number of non-consequential train accidents was 162 in 2022-23, which included 35 cases of Signal Passed at Danger (SPAD). The prolonged working hours of loco pilots due to an acute shortage of manpower was suspected to be the main reason for the increasing number of accidents, particularly SPAD cases, though there were other causes as well."
    ],
    "cleaned_text": "may increase train accidents worries indian railways rather resignation demand better accountability railways towards staff passengers ",
    "cleaned_title": "may increase train accidents worries indian railways",
    "cleaned_selftext": "rather resignation demand better accountability railways towards staff passengers",
    "cleaned_comments": "manpower shortages causing many loco pilots work long hours beyond hours per day maximum often without leave rest railway board urges immediate measures fill vacancies number nonconsequential train accidents included cases signal passed danger spad prolonged working hours loco pilots due acute shortage manpower suspected main reason increasing number accidents particularly spad cases though causes well",
    "light_cleaned_title": "[31 May 2023] Increase in train accidents worries Indian Railways",
    "light_cleaned_selftext": "Rather than resignation, demand for better accountability of railways towards it's staff and passengers",
    "light_cleaned_comments": ">Manpower shortages are causing many loco pilots to work long hours, beyond the 12 hours per day maximum, often without leave or rest; Railway Board urges immediate measures to fill vacancies >The number of non-consequential train accidents was 162 in 2022-23, which included 35 cases of Signal Passed at Danger (SPAD). The prolonged working hours of loco pilots due to an acute shortage of manpower was suspected to be the main reason for the increasing number of accidents, particularly SPAD cases, though there were other causes as well."
}