{
    "id": "rnzjvn",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/rnzjvn/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=c6623226acf7856bb5a61313af7bec382c8525f1",
    "flair": "Scheduled",
    "score": 8,
    "num_comments": 24,
    "created_utc": 1640395822,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Finished Sopranos.Best TV series I have ever watched.",
        "\"Don't look up\" is a must watch political satire and very relevant to kind of nationalistic politics, crony capitalism and corruption that we see in current India especially after the way the government handled the pandemic..",
        "Saw 83 in a theatre, good movie.",
        "Sopranos is the greatest tv show of all time!",
        "The Wheel of Time season 1 and Witcher season 2. Great month for fantasy fans. Both shows were amazing.",
        "Not The Wire?",
        "I am watching the wire now",
        "Watching Super Crooks on Netflix. Not as good as The Invincible, but still pretty decent.",
        "\"minnal Murali\", superhero movie done right.. Probably one of the best if not The best superhero origin movie from India",
        "The Pentagon officer charging 10 USD for a snack inside White House is one great cinematic pieces I have seen in recent times. Satire so on point xD",
        "I have read all Foundation books and I found the series to be meh!",
        "Sneha babu is her name lol",
        "Yeah it was pretty bad. Only Lee pace was good.",
        "Not Band of Brothers?",
        "I felt it was an okay movie. The attempt was good but it felt lacking somewhere.",
        "The WoT was ao good! Rosamond Pike is great! Cannot say the same for Witcher although the acting is on point but the story was meh.",
        "Same goes for WoT. The series was pretty meh compared to the books",
        "I have read the first three WOT books too and the show does stray and drop a lot of things, but still stays true to the source material. Foundation on the other hand was plain boring and nowhere close to the books.",
        "I watched Mindhunter on Netflix, thought it was great",
        "Sopranos is good, but The Wire is the best for me.",
        "Didn't like WoT that much. Last episode felt like a letdown. Witcher was good.\n\nAlso do check out The Expanse. Very good sci-fi",
        "Yes, I have been meaning to start Expanse.",
        "1883 is a new western show that came out recently, if you're a fan of Yellowstone you'll love this."
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "finished sopranosbest tv series ever watched dont look must watch political satire relevant kind nationalistic politics crony capitalism corruption see current india especially way government handled pandemic saw theatre good movie sopranos greatest tv show time wheel time season witcher season great month fantasy fans shows amazing wire watching wire watching super crooks netflix good invincible still pretty decent minnal murali superhero movie done right probably one best best superhero origin movie india pentagon officer charging usd snack inside white house one great cinematic pieces seen recent times satire point xd read foundation books found series meh sneha babu name lol yeah pretty bad lee pace good band brothers felt okay movie attempt good felt lacking somewhere wot ao good rosamond pike great say witcher although acting point story meh goes wot series pretty meh compared books read first three wot books show stray drop lot things still stays true source material foundation hand plain boring nowhere close books watched mindhunter netflix thought great sopranos good wire best didnt like wot much last episode felt like letdown witcher good also check expanse good scifi yes meaning start expanse new western show came recently youre fan yellowstone youll love",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Finished Sopranos.Best TV series I have ever watched. \"Don't look up\" is a must watch political satire and very relevant to kind of nationalistic politics, crony capitalism and corruption that we see in current India especially after the way the government handled the pandemic.. Saw 83 in a theatre, good movie. Sopranos is the greatest tv show of all time! The Wheel of Time season 1 and Witcher season 2. Great month for fantasy fans. Both shows were amazing. Not The Wire? I am watching the wire now Watching Super Crooks on Netflix. Not as good as The Invincible, but still pretty decent. \"minnal Murali\", superhero movie done right.. Probably one of the best if not The best superhero origin movie from India The Pentagon officer charging 10 USD for a snack inside White House is one great cinematic pieces I have seen in recent times. Satire so on point xD I have read all Foundation books and I found the series to be meh! Sneha babu is her name lol Yeah it was pretty bad. Only Lee pace was good. Not Band of Brothers? I felt it was an okay movie. The attempt was good but it felt lacking somewhere. The WoT was ao good! Rosamond Pike is great! Cannot say the same for Witcher although the acting is on point but the story was meh. Same goes for WoT. The series was pretty meh compared to the books I have read the first three WOT books too and the show does stray and drop a lot of things, but still stays true to the source material. Foundation on the other hand was plain boring and nowhere close to the books. I watched Mindhunter on Netflix, thought it was great Sopranos is good, but The Wire is the best for me. Didn't like WoT that much. Last episode felt like a letdown. Witcher was good. Also do check out The Expanse. Very good sci-fi Yes, I have been meaning to start Expanse. 1883 is a new western show that came out recently, if you're a fan of Yellowstone you'll love this."
}