{
    "id": "16viglr",
    "title": "This video sheds light on how Modi and Amit Shah allegedly misused their authority in a case involving the surveillance of a woman, with the help of an IPS officer.",
    "url": "https://youtu.be/roVZrT2_xuc?si=uZP-Bobi6tvcfuvA",
    "selftext": "Are we so blind? What has Narendra modi ever done except fake promises and being a part of rapid reported declining economy of India?",
    "flair": "Politics",
    "score": 1,
    "num_comments": 13,
    "created_utc": 1696010148.0,
    "convurl": "https://external-preview.redd.it/PYZFDAr-59wmAeyxKbwUzPzGt1h7Fg-_2oW4clOhaSE.jpg?auto=webp&s=4a9a4dfb1b3e37655520a36a526a4acd80d0b094",
    "comments": [
        "Yes, it's a very famous case. Unfortunately, there won't be justice in this case as well.",
        "Bcoz venom is a blinding drug",
        "They were never good guys they're just a better option compared to dim wits in Congress who'll give the whole land to extremists.",
        "You forget that the average Indian parent wants kids to be spied upon and controlled.",
        "There used to be an old case of chacha. He used to stalk a college girl as well...",
        "Sadly justice In India is only for the rich and not for the poor."
    ],
    "cleaned_text": "video sheds light modi amit shah allegedly misused authority case involving surveillance woman help ips officer blind narendra modi ever done except fake promises part rapid reported declining economy india ",
    "cleaned_title": "video sheds light modi amit shah allegedly misused authority case involving surveillance woman help ips officer",
    "cleaned_selftext": "blind narendra modi ever done except fake promises part rapid reported declining economy india",
    "cleaned_comments": "yes famous case unfortunately wont justice case well bcoz venom blinding drug never good guys theyre better option compared dim wits congress wholl give whole land extremists forget average indian parent wants kids spied upon controlled used old case chacha used stalk college girl well sadly justice india rich poor",
    "light_cleaned_title": "This video sheds light on how Modi and Amit Shah allegedly misused their authority in a case involving the surveillance of a woman, with the help of an IPS officer.",
    "light_cleaned_selftext": "Are we so blind? What has Narendra modi ever done except fake promises and being a part of rapid reported declining economy of India?",
    "light_cleaned_comments": "Yes, it's a very famous case. Unfortunately, there won't be justice in this case as well. Bcoz venom is a blinding drug They were never good guys they're just a better option compared to dim wits in Congress who'll give the whole land to extremists. You forget that the average Indian parent wants kids to be spied upon and controlled. There used to be an old case of chacha. He used to stalk a college girl as well... Sadly justice In India is only for the rich and not for the poor."
}