{
    "id": "1577wm1",
    "title": "Freedom fighters's wife burnt alive in Manipur.",
    "url": "https://www.reddit.com/r/india/comments/1577wm1/freedom_fighterss_wife_burnt_alive_in_manipur/",
    "selftext": "'Come back for Me' she said to her grandson.\n\nIn Kakching district's Serou village, the 80-year-old wife of a freedom fighter was locked inside her house and set on fire by an armed group, according to a case filed with Serou police station.\n\nhttps://www.ndtv.com/india-news/her-last-words-grandson-of-80-year-old-woman-burnt-alive-in-manipur-serou-village-in-kakching-4232396",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690096470.0,
    "convurl": "https://external-preview.redd.it/g08Acv4hlru1K5K9aNLumtopEHSPkRdr8OX8P3p-uDU.jpg?auto=webp&s=351f0d3af79757f63bd040f8d2664ef19400916f",
    "comments": [
        "NDTV is now owned by Adani, remember that they are closely aligned with BJP, so I would take this news with a grain of salt.",
        "You can find the same news in Mint \n\nhttps://www.livemint.com/news/india/manipur-violence-n-biren-singh-meitei-kuki-clashes-narendra-modicongressbjp-11690080491859.html",
        "That mint article says \"According to a report by the NDTV news channel,\"",
        "Economics Times with reference to TOI\nhttps://m.economictimes.com/news/india/more-disturbing-incidents-reported-in-violence-hit-manipur-80-year-old-freedom-fighters-wife-burnt-alive-in-home/articleshow/102048575.cms",
        "News Media are Circlejerking",
        "Bas kar bhai",
        "**Holy Fucking Shit**",
        "Right it happened to a community you don’t like so let’s deny it happened completely. Correct?",
        "Are you serious? Why would anyone even care about that? What has happened is a fucking disgrace to our society and you go 'aDaNi oWnS nDtV' and proceed to spew bullshit. Why?",
        "I don't even care if they are tribals or if their fight is justified. Just put them down at this point. Women are being raped left and right and innocent people are being murdered.",
        "Why are people fighting whether she belonged to one community or not.  ?\n\nThe fact is one woman was burnt alive, where is CM resignation and why not president rule yet.",
        "Two other Kuki girls who were gangraped and murdered after the Meitei women folk tell their sons to ''Rape Them\".  \nThis is from a different incident. Not the Two girls from the viral video who were paraded naked.  \n\n\nhttps://preview.redd.it/393xtyp7todb1.jpeg?width=720&format=pjpg&auto=webp&s=9ac78fe176fddd48772fb18cce5281db0a56250e",
        "[Moment before they were raped and murdered.](https://twitter.com/abhaysiingh123/status/1682319266488659970?s=20)"
    ],
    "cleaned_text": "freedom fighterss wife burnt alive manipur come back said grandson kakching districts serou village yearold wife freedom fighter locked inside house set fire armed group according case filed serou police station ",
    "cleaned_title": "freedom fighterss wife burnt alive manipur",
    "cleaned_selftext": "come back said grandson kakching districts serou village yearold wife freedom fighter locked inside house set fire armed group according case filed serou police station",
    "cleaned_comments": "ndtv owned adani remember closely aligned bjp would take news grain salt find news mint mint article says according report ndtv news channel economics times reference toi news media circlejerking bas kar bhai holy fucking shit right happened community dont like lets deny happened completely correct serious would anyone even care happened fucking disgrace society go adani owns ndtv proceed spew bullshit dont even care tribals fight justified put point women raped left right innocent people murdered people fighting whether belonged one community fact one woman burnt alive cm resignation president rule yet two kuki girls gangraped murdered meitei women folk tell sons rape different incident two girls viral video paraded naked moment raped murderedhttpstwittercomabhaysiinghstatuss",
    "light_cleaned_title": "Freedom fighters's wife burnt alive in Manipur.",
    "light_cleaned_selftext": "'Come back for Me' she said to her grandson. In Kakching district's Serou village, the 80-year-old wife of a freedom fighter was locked inside her house and set on fire by an armed group, according to a case filed with Serou police station.",
    "light_cleaned_comments": "NDTV is now owned by Adani, remember that they are closely aligned with BJP, so I would take this news with a grain of salt. You can find the same news in Mint That mint article says \"According to a report by the NDTV news channel,\" Economics Times with reference to TOI News Media are Circlejerking Bas kar bhai **Holy Fucking Shit** Right it happened to a community you don’t like so let’s deny it happened completely. Correct? Are you serious? Why would anyone even care about that? What has happened is a fucking disgrace to our society and you go 'aDaNi oWnS nDtV' and proceed to spew bullshit. Why? I don't even care if they are tribals or if their fight is justified. Just put them down at this point. Women are being raped left and right and innocent people are being murdered. Why are people fighting whether she belonged to one community or not. ? The fact is one woman was burnt alive, where is CM resignation and why not president rule yet. Two other Kuki girls who were gangraped and murdered after the Meitei women folk tell their sons to ''Rape Them\". This is from a different incident. Not the Two girls from the viral video who were paraded naked. [Moment before they were raped and murdered.](https://twitter.com/abhaysiingh123/status/1682319266488659970?s=20)"
}