{
    "id": "16pwkay",
    "title": "Live-in/Marriage pre-nup realities",
    "url": "https://www.reddit.com/r/india/comments/16pwkay/liveinmarriage_prenup_realities/",
    "selftext": "I’ve seen this being discussed over and over in different forms here. I wanted to bring forth some points which most men tend to forget about marriage, and yes, this is more important than money/properties ever will be. \n\n\nIndia's law still allows men to rape their wives.\n(https://www.theweek.in/news/india/2023/01/09/marital-rape-law-india-supreme-court.html)\n\nNearly one in three women aged between 18 and 49 have suffered some form of spousal abuse, and around six percent have suffered sexual violence.\n\n\nAt the same time, we saw 35.5k dowry cases between 2017-2021; or about 7k a year. Maybe a minority of these are ‘fake’ cases but the total % is minuscule. \n\n\nHonestly, a woman should question why she is marrying someone in India, not the other way around. She is opening herself up to a 33% chance of DV and legalising possibly daily rapes from her husband. \n\nNo normal person wants to get into a live-in/marriage with someone, spending years of their lives, bringing parents etc into it and pouring their time, emotions and effort into it while plotting and scheming in the background. This works both ways of course, for men and women. \n\n\nTwo years is ample time for adults to judge compatibility. If you are with someone that long, marriage is just a tag, you are together. If you don’t feel that after two years, you are simply using the other person.\n\n\nFor all those asking why the laws are so skewed towards women, have you ever protested the exception to the law that allows a rapist to come home to his wife and assault her as he pleases everyday with no legal recourse? Given the 1/3 number for DV, you probably know someone, maybe within the extended family even, that have been DV victims at some point. Do you not see how helpful the laws are for them? \n\n\nWhen two people choose to live together, over time they get accustomed to a certain lifestyle. Typically in India, a woman, working or not, is seen as someone who has to handle a majority of domestic chores, especially if they are living with their in-laws. Please get this into your heads, marriage is not equal to free domestic help. It’s even worse in some backward homes where a woman is forced to leave their job and hence become financially reliant on their partner.\n\n\n In both these cases, and hence I’m addressing a vast majority of marriages/live-ins in India, a woman is sacrificing her time and effort for the household, same as the man when he goes to work. If a woman is working, typically the equation is even more lopsided. \n\n\nConsidering this, the laws are fair and address a majority of the populace. There will be exceptions to every rule but we can all agree that no law can ever be perfect. So please, get into a relationship for the right reasons and treat each other with respect and love (and make sure the extended family does too). 99% of you will then never need to care about such laws.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695448817.0,
    "convurl": "https://external-preview.redd.it/8eDKLlxxeKHYU8BIKqPzutGWHZrVJ3pY8nMzrxWPUyM.jpg?auto=webp&s=d68cdb332b4eedf022f4ce2a8100a1c3bd395dae",
    "comments": [],
    "cleaned_text": "liveinmarriage prenup realities ive seen discussed different forms wanted bring forth points men tend forget marriage yes important moneyproperties ever indias law still allows men rape wives httpswwwtheweekinnewsindiamaritalrapelawindiasupremecourthtml nearly one three women aged suffered form spousal abuse around six percent suffered sexual violence time saw k dowry cases k year maybe minority fake cases total minuscule honestly woman question marrying someone india way around opening chance dv legalising possibly daily rapes husband normal person wants get liveinmarriage someone spending years lives bringing parents etc pouring time emotions effort plotting scheming background works ways course men women two years ample time adults judge compatibility someone long marriage tag together dont feel two years simply using person asking laws skewed towards women ever protested exception law allows rapist come home wife assault pleases everyday legal recourse given number dv probably know someone maybe within extended family even dv victims point see helpful laws two people choose live together time get accustomed certain lifestyle typically india woman working seen someone handle majority domestic chores especially living inlaws please get heads marriage equal free domestic help even worse backward homes woman forced leave job hence become financially reliant partner cases hence im addressing vast majority marriagesliveins india woman sacrificing time effort household man goes work woman working typically equation even lopsided considering laws fair address majority populace exceptions every rule agree law ever perfect please get relationship right reasons treat respect love make sure extended family never need care laws ",
    "cleaned_title": "liveinmarriage prenup realities",
    "cleaned_selftext": "ive seen discussed different forms wanted bring forth points men tend forget marriage yes important moneyproperties ever indias law still allows men rape wives httpswwwtheweekinnewsindiamaritalrapelawindiasupremecourthtml nearly one three women aged suffered form spousal abuse around six percent suffered sexual violence time saw k dowry cases k year maybe minority fake cases total minuscule honestly woman question marrying someone india way around opening chance dv legalising possibly daily rapes husband normal person wants get liveinmarriage someone spending years lives bringing parents etc pouring time emotions effort plotting scheming background works ways course men women two years ample time adults judge compatibility someone long marriage tag together dont feel two years simply using person asking laws skewed towards women ever protested exception law allows rapist come home wife assault pleases everyday legal recourse given number dv probably know someone maybe within extended family even dv victims point see helpful laws two people choose live together time get accustomed certain lifestyle typically india woman working seen someone handle majority domestic chores especially living inlaws please get heads marriage equal free domestic help even worse backward homes woman forced leave job hence become financially reliant partner cases hence im addressing vast majority marriagesliveins india woman sacrificing time effort household man goes work woman working typically equation even lopsided considering laws fair address majority populace exceptions every rule agree law ever perfect please get relationship right reasons treat respect love make sure extended family never need care laws",
    "cleaned_comments": "",
    "light_cleaned_title": "Live-in/Marriage pre-nup realities",
    "light_cleaned_selftext": "I’ve seen this being discussed over and over in different forms here. I wanted to bring forth some points which most men tend to forget about marriage, and yes, this is more important than money/properties ever will be. India's law still allows men to rape their wives. (https://www.theweek.in/news/india/2023/01/09/marital-rape-law-india-supreme-court.html) Nearly one in three women aged between 18 and 49 have suffered some form of spousal abuse, and around six percent have suffered sexual violence. At the same time, we saw 35.5k dowry cases between 2017-2021; or about 7k a year. Maybe a minority of these are ‘fake’ cases but the total % is minuscule. Honestly, a woman should question why she is marrying someone in India, not the other way around. She is opening herself up to a 33% chance of DV and legalising possibly daily rapes from her husband. No normal person wants to get into a live-in/marriage with someone, spending years of their lives, bringing parents etc into it and pouring their time, emotions and effort into it while plotting and scheming in the background. This works both ways of course, for men and women. Two years is ample time for adults to judge compatibility. If you are with someone that long, marriage is just a tag, you are together. If you don’t feel that after two years, you are simply using the other person. For all those asking why the laws are so skewed towards women, have you ever protested the exception to the law that allows a rapist to come home to his wife and assault her as he pleases everyday with no legal recourse? Given the 1/3 number for DV, you probably know someone, maybe within the extended family even, that have been DV victims at some point. Do you not see how helpful the laws are for them? When two people choose to live together, over time they get accustomed to a certain lifestyle. Typically in India, a woman, working or not, is seen as someone who has to handle a majority of domestic chores, especially if they are living with their in-laws. Please get this into your heads, marriage is not equal to free domestic help. It’s even worse in some backward homes where a woman is forced to leave their job and hence become financially reliant on their partner. In both these cases, and hence I’m addressing a vast majority of marriages/live-ins in India, a woman is sacrificing her time and effort for the household, same as the man when he goes to work. If a woman is working, typically the equation is even more lopsided. Considering this, the laws are fair and address a majority of the populace. There will be exceptions to every rule but we can all agree that no law can ever be perfect. So please, get into a relationship for the right reasons and treat each other with respect and love (and make sure the extended family does too). 99% of you will then never need to care about such laws.",
    "light_cleaned_comments": ""
}