{
    "id": "1eq7gac",
    "title": "Greatest collab of the era",
    "url": "https://www.reddit.com/gallery/1eq7gac",
    "selftext": "I have the habit of cleaning my spam mails every other day. So when I opened the spam, I found a top secret document which was sent via mail to me and I witnessed the greatest collab of the era. ",
    "flair": "Crime",
    "score": 82,
    "num_comments": 21,
    "created_utc": 1723447395.0,
    "convurl": "https://i.redd.it/jnj7rt3yp6id1.jpg",
    "comments": [
        "Bhai tumhare piche pura 11 mulko ki police lagi hui hai 😭",
        "TOP SECRET",
        "One of the very very well photoshopped scam pics",
        "You are cooked",
        "I give it an 8/10 at best. There's still a lot of space at the top for a few more seals.",
        "“State of the art spider”\n\nLike the one that bit Peter Parker?",
        "Power Rangers Aur Avengers reh gaye bas",
        "Bro stole queens pussy pics",
        "Don ke peeche 11 ...........",
        "Collector's item. Just like stamps, keep collecting them. One day, you will get rich.",
        "Interpol worst-of-list is killing me LMFAOO",
        "Top Secret 🤡"
    ],
    "cleaned_text": "greatest collab era habit cleaning spam mails every day opened spam found top secret document sent via mail witnessed greatest collab era ",
    "cleaned_title": "greatest collab era",
    "cleaned_selftext": "habit cleaning spam mails every day opened spam found top secret document sent via mail witnessed greatest collab era",
    "cleaned_comments": "bhai tumhare piche pura mulko ki police lagi hui hai top secret one well photoshopped scam pics cooked give best theres still lot space top seals state art spider like one bit peter parker power rangers aur avengers reh gaye bas bro stole queens pussy pics ke peeche collectors item like stamps keep collecting one day get rich interpol worstoflist killing lmfaoo top secret",
    "light_cleaned_title": "Greatest collab of the era",
    "light_cleaned_selftext": "I have the habit of cleaning my spam mails every other day. So when I opened the spam, I found a top secret document which was sent via mail to me and I witnessed the greatest collab of the era.",
    "light_cleaned_comments": "Bhai tumhare piche pura 11 mulko ki police lagi hui hai 😭 TOP SECRET One of the very very well photoshopped scam pics You are cooked I give it an 8/10 at best. There's still a lot of space at the top for a few more seals. “State of the art spider” Like the one that bit Peter Parker? Power Rangers Aur Avengers reh gaye bas Bro stole queens pussy pics Don ke peeche 11 ........... Collector's item. Just like stamps, keep collecting them. One day, you will get rich. Interpol worst-of-list is killing me LMFAOO Top Secret 🤡"
}