{
    "id": "12m4jnt",
    "title": "What do you guys think of Nitish as opposition candidate for next General election?",
    "url": "https://www.reddit.com/r/india/comments/12m4jnt/what_do_you_guys_think_of_nitish_as_opposition/",
    "selftext": "> Kumar, who dumped the BJP in August last year and formed the Mahagathbandhan government, said, “I am working towards forging opposition unity...but I am not a claimant for the prime minister's post. All opposition parties are united over forming an alliance against the BJP-led government at the Centre before the 2024 general elections.\"\n\nhttps://www.hindustantimes.com/india-news/those-who-vote-for-bjp-in-2024-lok-sabha-polls-will-nitish-kumar-s-warning-101681481909312.html\n\nNitish has said many times recently that he doesnt want the PMs position. But he is a good bet. He has a small presence at the national level but a good image. Other regional leaders will not find him threatening and will prefer a non congress PM candidate.\n\nHe has already planned out a nation wide tour\n\nhttps://www.thehindu.com/news/national/other-states/will-travel-across-country-in-2024-to-forge-opposition-unity-says-nitish/article66737718.ece\n\nPlus he can actually be the lynchpin\n\n> The parties which don't want to talk to the Congress, may be open to negotiating with Kumar.\n\nhttps://www.thequint.com/news/politics/nitish-kumar-rahul-ganghi-mallikarjun-kharge-opposition-bjp-coalition#read-more\n\nAnd RG is out of the picture\n\n> In Rahul Gandhi’s scheme of things, unless the Congress crosses ‘half of half’ figure in Lok Sabha, i.e. half of the 272 mark, the grand old party would not be staking a claim for the coveted post. As things stand, the Congress would consider itself lucky to win 100 seats in the Lok Sabha. Thus, at an informal level, the word is out among the Opposition ranks that the office of the Prime Minister is up for grabs\n\nhttps://www.deccanherald.com/opinion/can-nitish-kumar-unite-the-opposition-yes-but-not-so-easily-1209578.html\n\nWhat do you think",
    "flair": "Politics",
    "score": 0,
    "num_comments": 31,
    "created_utc": 1681492948.0,
    "convurl": "https://external-preview.redd.it/mtoCO-QSsZsyYEoSVIkNh0K6A3wfr6WEeqqSgQfqKmk.jpg?auto=webp&v=enabled&s=7101f8919cef007230b843ba7b37a1b7c87af712",
    "comments": [
        "Only Somebody from CONGRESS has the potential to be a Contestant to Supreme Leader. Anyone else from any other party doesn't have the Nationwide recognisibilty as RaGa or anyone endorsed by the Gandhi parivar.",
        "I don't think Congress would agree. But they have to put a face. Otherwise everyone will think it's Rahul Gandhi and we all know how they will end. They need someone really good. Nitish is one who has a lot of influence. I think kejriwal is too fickle to make any real connection with other parties",
        "Honestly RaGa over nitish anyday, nitish haven't done anything significant in Bihar, how can he generate confidence among people across India. Atleast modi had gujrat model to capitalise on Nitish have nothing, except party badal diya memes.",
        "He was a staunch bjp Ally till the day his own survival was jeopardized by them. He can flip at any moment. No way I am choosing him and thankfully neither will the opposition.",
        "Bihar Model to be implemented all over India?",
        "And what exactly has raga done. Never been a cm or a minister. Just made stupid comments all his life.",
        "Recently stalin also tried forging an opposition unity. Honestly these guys keep on talking without making much moves. I really hope they all come together on a single platform and officially form an alliance. PM candidate can be decided after election, honestly it will be counterproductive to announce a candidate against modi",
        "You think RG will be able to have his disqualification nullified by then?",
        "BJP fails when a strong local leader exists. A PM face is absolutely neccesary.",
        "Congress will be the death of democracy in India.",
        "True. But he wont be able to flip with 10-15 LS seats.",
        "anyone but pr Mantri in chief would work for me",
        "you don't listen or watch his interviews, he has been on the point in the last 4 years since the pandemic.",
        "I think you're incorrect here. I remember that he went against BJP once Mr. Modi was given some official post in BJP as some sort of leader in 2013. I remember the reason being a communal Modi vs secular Nitish.\n\nEven when he again joined NDA, if you remember the time during CAA and NRC, he specifically said that he wouldn't allow NRC to be implemented there. Prashant Kishor had to quit the party because of differences in opinion, but 1 year later JDU did split up again. He never was a staunch ally of BJP, and neither is he a staunch ally of RJD.\n\nBJP is the corrupt communal monster which was simply waiting for Nitish to go away, so that they could comfortably shift into power, and RJD is a corrupt party which isn't an option either. \n\nNitish as the leader makes more sense in Bihar as he has effectively kept most of the power with a bunch of bureaucrats instead of the actual ministers. I don't think you realize how much worse the state will be if either BJP or RJD comes into power. Their current setup is nothing but an adversarial alliance against BJP.\n\nMaybe the above text may provide more context on his actions, or at least my perception of his actions.",
        "You'd be surprised. 10-15 LS seats gets him a ministerial position.",
        "The problem is, there is no strong local leader except stalin, kcr, mamata and baghel. Whom will they project and will that face have national acceptability among voters. Answer is no",
        "lol I forgot he was disqualified.",
        "point toh hai anyways doesn't matter, modi can't be defeated.",
        "Even less gets you a ministerial position. See LJP.\n\nBut it doesnt get you PMs position. Nitish is on an upwards trajectory. He left ministry for being CM.",
        "heh. so Nitish?",
        "Being on point is very different from having administrative experience. Which he has none. So one can't even compare him with Nitish. The surname can only do so much for him.",
        "Kursi kumar",
        "Nitish?",
        "He is disqualified for now. Will take some time before his disqualification is overturned or nullified or whatever. I doubt it will happen in time for '24 elections",
        "It doesn’t matter, anyone but modi should be the motto. Modi is going to run India into the ground."
    ],
    "cleaned_text": "guys think nitish opposition candidate next general election kumar dumped bjp august last year formed mahagathbandhan government said working towards forging opposition unitybut claimant prime ministers post opposition parties united forming alliance bjpled government centre general elections nitish said many times recently doesnt want pms position good bet small presence national level good image regional leaders find threatening prefer non congress pm candidate already planned nation wide tour plus actually lynchpin parties dont want talk congress may open negotiating kumar rg picture rahul gandhis scheme things unless congress crosses half half figure lok sabha ie half mark grand old party would staking claim coveted post things stand congress would consider lucky win seats lok sabha thus informal level word among opposition ranks office prime minister grabs think ",
    "cleaned_title": "guys think nitish opposition candidate next general election",
    "cleaned_selftext": "kumar dumped bjp august last year formed mahagathbandhan government said working towards forging opposition unitybut claimant prime ministers post opposition parties united forming alliance bjpled government centre general elections nitish said many times recently doesnt want pms position good bet small presence national level good image regional leaders find threatening prefer non congress pm candidate already planned nation wide tour plus actually lynchpin parties dont want talk congress may open negotiating kumar rg picture rahul gandhis scheme things unless congress crosses half half figure lok sabha ie half mark grand old party would staking claim coveted post things stand congress would consider lucky win seats lok sabha thus informal level word among opposition ranks office prime minister grabs think",
    "cleaned_comments": "somebody congress potential contestant supreme leader anyone else party doesnt nationwide recognisibilty raga anyone endorsed gandhi parivar dont think congress would agree put face otherwise everyone think rahul gandhi know end need someone really good nitish one lot influence think kejriwal fickle make real connection parties honestly raga nitish anyday nitish havent done anything significant bihar generate confidence among people across india atleast modi gujrat model capitalise nitish nothing except party badal diya memes staunch bjp ally till day survival jeopardized flip moment way choosing thankfully neither opposition bihar model implemented india exactly raga done never cm minister made stupid comments life recently stalin also tried forging opposition unity honestly guys keep talking without making much moves really hope come together single platform officially form alliance pm candidate decided election honestly counterproductive announce candidate modi think rg able disqualification nullified bjp fails strong local leader exists pm face absolutely neccesary congress death democracy india true wont able flip ls seats anyone pr mantri chief would work dont listen watch interviews point last years since pandemic think youre incorrect remember went bjp mr modi given official post bjp sort leader remember reason communal modi vs secular nitish even joined nda remember time caa nrc specifically said wouldnt allow nrc implemented prashant kishor quit party differences opinion year later jdu split never staunch ally bjp neither staunch ally rjd bjp corrupt communal monster simply waiting nitish go away could comfortably shift power rjd corrupt party isnt option either nitish leader makes sense bihar effectively kept power bunch bureaucrats instead actual ministers dont think realize much worse state either bjp rjd comes power current setup nothing adversarial alliance bjp maybe text may provide context actions least perception actions youd surprised ls seats gets ministerial position problem strong local leader except stalin kcr mamata baghel project face national acceptability among voters answer lol forgot disqualified point toh hai anyways doesnt matter modi cant defeated even less gets ministerial position see ljp doesnt get pms position nitish upwards trajectory left ministry cm heh nitish point different administrative experience none one cant even compare nitish surname much kursi kumar nitish disqualified take time disqualification overturned nullified whatever doubt happen time elections doesnt matter anyone modi motto modi going run india ground",
    "light_cleaned_title": "What do you guys think of Nitish as opposition candidate for next General election?",
    "light_cleaned_selftext": "> Kumar, who dumped the BJP in August last year and formed the Mahagathbandhan government, said, “I am working towards forging opposition unity...but I am not a claimant for the prime minister's post. All opposition parties are united over forming an alliance against the BJP-led government at the Centre before the 2024 general elections.\" Nitish has said many times recently that he doesnt want the PMs position. But he is a good bet. He has a small presence at the national level but a good image. Other regional leaders will not find him threatening and will prefer a non congress PM candidate. He has already planned out a nation wide tour Plus he can actually be the lynchpin > The parties which don't want to talk to the Congress, may be open to negotiating with Kumar. And RG is out of the picture > In Rahul Gandhi’s scheme of things, unless the Congress crosses ‘half of half’ figure in Lok Sabha, i.e. half of the 272 mark, the grand old party would not be staking a claim for the coveted post. As things stand, the Congress would consider itself lucky to win 100 seats in the Lok Sabha. Thus, at an informal level, the word is out among the Opposition ranks that the office of the Prime Minister is up for grabs What do you think",
    "light_cleaned_comments": "Only Somebody from CONGRESS has the potential to be a Contestant to Supreme Leader. Anyone else from any other party doesn't have the Nationwide recognisibilty as RaGa or anyone endorsed by the Gandhi parivar. I don't think Congress would agree. But they have to put a face. Otherwise everyone will think it's Rahul Gandhi and we all know how they will end. They need someone really good. Nitish is one who has a lot of influence. I think kejriwal is too fickle to make any real connection with other parties Honestly RaGa over nitish anyday, nitish haven't done anything significant in Bihar, how can he generate confidence among people across India. Atleast modi had gujrat model to capitalise on Nitish have nothing, except party badal diya memes. He was a staunch bjp Ally till the day his own survival was jeopardized by them. He can flip at any moment. No way I am choosing him and thankfully neither will the opposition. Bihar Model to be implemented all over India? And what exactly has raga done. Never been a cm or a minister. Just made stupid comments all his life. Recently stalin also tried forging an opposition unity. Honestly these guys keep on talking without making much moves. I really hope they all come together on a single platform and officially form an alliance. PM candidate can be decided after election, honestly it will be counterproductive to announce a candidate against modi You think RG will be able to have his disqualification nullified by then? BJP fails when a strong local leader exists. A PM face is absolutely neccesary. Congress will be the death of democracy in India. True. But he wont be able to flip with 10-15 LS seats. anyone but pr Mantri in chief would work for me you don't listen or watch his interviews, he has been on the point in the last 4 years since the pandemic. I think you're incorrect here. I remember that he went against BJP once Mr. Modi was given some official post in BJP as some sort of leader in 2013. I remember the reason being a communal Modi vs secular Nitish. Even when he again joined NDA, if you remember the time during CAA and NRC, he specifically said that he wouldn't allow NRC to be implemented there. Prashant Kishor had to quit the party because of differences in opinion, but 1 year later JDU did split up again. He never was a staunch ally of BJP, and neither is he a staunch ally of RJD. BJP is the corrupt communal monster which was simply waiting for Nitish to go away, so that they could comfortably shift into power, and RJD is a corrupt party which isn't an option either. Nitish as the leader makes more sense in Bihar as he has effectively kept most of the power with a bunch of bureaucrats instead of the actual ministers. I don't think you realize how much worse the state will be if either BJP or RJD comes into power. Their current setup is nothing but an adversarial alliance against BJP. Maybe the above text may provide more context on his actions, or at least my perception of his actions. You'd be surprised. 10-15 LS seats gets him a ministerial position. The problem is, there is no strong local leader except stalin, kcr, mamata and baghel. Whom will they project and will that face have national acceptability among voters. Answer is no lol I forgot he was disqualified. point toh hai anyways doesn't matter, modi can't be defeated. Even less gets you a ministerial position. See LJP. But it doesnt get you PMs position. Nitish is on an upwards trajectory. He left ministry for being CM. heh. so Nitish? Being on point is very different from having administrative experience. Which he has none. So one can't even compare him with Nitish. The surname can only do so much for him. Kursi kumar Nitish? He is disqualified for now. Will take some time before his disqualification is overturned or nullified or whatever. I doubt it will happen in time for '24 elections It doesn’t matter, anyone but modi should be the motto. Modi is going to run India into the ground."
}