{
    "id": "1404nhc",
    "title": "Odisha Train Tragedy: Indigenous 'Kavach' system to prevent accidents was missing on Balasore route; Here's why",
    "url": "https://www.freepressjournal.in/india/odisha-train-tragedy-indigenous-kavach-system-to-prevent-accidents-was-missing-on-balasore-route-heres-why",
    "selftext": "The system that came into existence in 2012 had received a huge fillip last year, with the Union Railways Minister present during the trial of the newly-packaged Kavach. \n\nHowever, it has come to light after the accident that the implementation of Kavach is still in its nascent stage. Railways Spokesperson Amitabh Sharma, speaking to ANI, said that Kavach system is route specific and currently only the Delhi-Howrah and Delhi-Bombay (Mumbai) routes have the installation process started for this system.",
    "flair": "Politics",
    "score": 6,
    "num_comments": 1,
    "created_utc": 1685862778.0,
    "convurl": "https://external-preview.redd.it/aRkbbKpCj5-Uw4Y2hUl6VFChiLwN7zhy0bNBiMIj_cM.jpg?auto=webp&v=enabled&s=93350082659e84f59f181cecd7e1e257424802c6",
    "comments": [],
    "cleaned_text": "odisha train tragedy indigenous kavach system prevent accidents missing balasore route heres system came existence received huge fillip last year union railways minister present trial newlypackaged kavach however come light accident implementation kavach still nascent stage railways spokesperson amitabh sharma speaking ani said kavach system route specific currently delhihowrah delhibombay mumbai routes installation process started system ",
    "cleaned_title": "odisha train tragedy indigenous kavach system prevent accidents missing balasore route heres",
    "cleaned_selftext": "system came existence received huge fillip last year union railways minister present trial newlypackaged kavach however come light accident implementation kavach still nascent stage railways spokesperson amitabh sharma speaking ani said kavach system route specific currently delhihowrah delhibombay mumbai routes installation process started system",
    "cleaned_comments": "",
    "light_cleaned_title": "Odisha Train Tragedy: Indigenous 'Kavach' system to prevent accidents was missing on Balasore route; Here's why",
    "light_cleaned_selftext": "The system that came into existence in 2012 had received a huge fillip last year, with the Union Railways Minister present during the trial of the newly-packaged Kavach. However, it has come to light after the accident that the implementation of Kavach is still in its nascent stage. Railways Spokesperson Amitabh Sharma, speaking to ANI, said that Kavach system is route specific and currently only the Delhi-Howrah and Delhi-Bombay (Mumbai) routes have the installation process started for this system.",
    "light_cleaned_comments": ""
}