{
    "id": "1h9xjfw",
    "title": "Sitting Allahabad HC Judge Delivers Speech on Uniform Civil Code at Vishva Hindu Parishad Event",
    "url": "https://m.thewire.in/article/news/sitting-allahabad-high-court-judge-vhp-event-ucc",
    "selftext": "What is the difference between mullah of taliban ? And this guy?\n\n\nNever thought it was this bad - may be living in the south, was oblivious to the cancer growing in my country ",
    "flair": "Law & Courts",
    "score": 91,
    "num_comments": 40,
    "created_utc": 1733705246.0,
    "convurl": "https://external-preview.redd.it/X1fegW0EwDJpsmjVMaDME4wTomhJiX3Nf5jn-cRfBeY.jpg?auto=webp&s=87b1a8c8ab050704d24c3d2afd8986876fbca837",
    "comments": [
        "Post retirement he will go back to his roots aka RSS",
        "Post retirement he will go back to his roots aka RSS",
        "This country is hopeless and I can't wait to leave.",
        "Kya bhai bhagat singh ka photo lagakar bhagne ki baat karte ho inquilab ki baatien karo..",
        "Reminds me of certain events in Europe 80 odd years ago",
        "No one is asking for their accountability. Judges are one of the most elitist class of persons. They will recuse themself from any case whenever they want no one to ask why they are abandoning their official responsibility. But if a small time government employee goes absent or comes late to the office. They are dismissed without any chances of explaining themselves.",
        "Avi ke time Bhagat Singh bann ke dekho na bhai...Puri Jindagi kharab kr denge tumhari.... it's better to leave the country at the first chance we get.",
        "boria bistar bandho aur niklo is country se…let all the trash remain in this shithole",
        "Why is uniform civil code hated so much?\nWhat’s wrong in treating every citizen equally before law irrespective of religion?",
        "This guy is a blot on constitution",
        "UCC by RSS/VHP will be more close to hindutva civil code than anything the name UCC implies.",
        "So opinion against polygamy and triple talaq is bad? But halala a system where woman are raped is good. This defines why our secularism got the terror flavor.",
        "How?",
        "https://www.livelaw.in/top-stories/allahabad-high-court-justice-shekhar-kumar-yadav-speech-triple-talaq-halala-uniform-civil-code-277679 here is his complete speech. \nHe is talking about majoritarian politics. I do not trust this govt to consider any other religions / groups outside their main hindutva fold while comibg up with rlthia UCC code.",
        "cant wait to leave? where will you go",
        "law should be same for all is not what ucc is, you should know better\n\ni dont know about halala but i do know vhp celebrates rape and garlands rapists while your family nods in approval",
        "All i see is opinion against polygamy and triple talaq. If thats majoritarian politics. I guess its ok.",
        "Supreme court promotion incoming",
        "Hey I don't know much abt it can you elaborate on what's wrong with it ?",
        "about what is wrong? garlanding convicted rapists? or the saffronised UCC?\n\nlet me assume you mean the latter, then my dear your imagination must be lacking if you think the ucc of sangh parivar is truly going to be, \"UCC\"\n\nAm I fearmongering now? not at all, already you can see freedom of muslim is curbed in the name of tackling \"love jihad\" and \"land jihad\"\n\ndo you really think its all that rosy?",
        "I wanna know where UCC is getting wrong or not giving equality \n\nAs u said that freedom of muslims is being curbed, and even if I assume it's true, it still doesn’t explain how the UCC wrong",
        "you are not paying attention, please reread the last comment\n\nUCC itself isnt the problem, its the saffron UCC which isnt actually a UCC, that is the problem\n\nwhen their leaders openly call for hindu rashtra, when they call muslims as infiltrators and ugrawadi, do you have faith their UCC is uniform?\n\nThis shouldnt be treated as fearmongering, its projection of their past behaviour, why is this sounding unreasonable to you ? care to explain",
        "Says the person with Bhagat singh as their profile pic. Run off coward, we dont need you anyways.",
        "Ahh now I get it , u wanna say it may get bias in implementation coz of past behaviour by some leader \nBut idea of UCC is right ?\n\nThen instead of UCC what will be solution?",
        "Only when the last of the honest people leave will you guys accept the turmoil our country is in, until then it's just blind patriotism right?",
        "solution for what exactly? what exactly is the problem?",
        "Equal right",
        "Talking of running away while having a martyred freedom fighter as PP= Honest… \nCalling off blatant hypocrisy and cowardice= Blind patriotism.",
        "Bhagat singh was the biggest communist you could ever find and having read his letters, he was also against the caste system. Safe to say he himself wouldn't like the way our country is right now. Also it's not running away, it's making a better investment of the little time we have in this world",
        "And? Just cause we aren’t there yet does not mean we are some failed country, we are developing despite the problems we face, some other country would have destroyed itself already(Pakistan,Srilanka,Bangladesh),All y’all ever do is complain and complain as if politicians are here reading about your problems, ever joined city planning societies? Charitable NGO’s? Protests? Do you even Vote? Unless you make yourself heard where it matters all the people who are running away are doing is justifying your cowardice. Bhagat Singh’s sacrifice is wasted on you lot.",
        "Atleast he's open about it.\n\nThe rest are closeted bhakts and will only come out after retirement.",
        "But Indians were on Bhagatsingh's side.  Here, people are in support of a cancerous government with carcinogenic ideology.",
        "In his speech he mentioned the judiciary will work as per/in support of majority.  If justice take the heavier side, where is the justice.",
        "You say people are in support of cancerous society, do you consider yourself included in these “people”? You dont right? Then that means there are people who think like you, have the same opinions about governance. Join these people, spread your message, protest and ask your politicians about the problems you face hold them responsible, you WILL find such groups in every city. Cause if you dont do those things and just complain on reddit about it all you are doing is providing ammunition for these cowards to justify their choice to leave.",
        "The majority doesnt mean religion, the constitution exceot the basuic structure can be changed by majority. And ucc doesnt come under badic structure",
        "Saying that standing on the RSS platform does mean he meant religion and that too Hindu.    This also means the UCC will be pro-Hindu. They already assured they would not touch any law that is pro-Hindu like Hindu undivided family so that Hindus can evade more tax."
    ],
    "cleaned_text": "sitting allahabad hc judge delivers speech uniform civil code vishva hindu parishad event difference mullah taliban guy never thought bad may living south oblivious cancer growing country ",
    "cleaned_title": "sitting allahabad hc judge delivers speech uniform civil code vishva hindu parishad event",
    "cleaned_selftext": "difference mullah taliban guy never thought bad may living south oblivious cancer growing country",
    "cleaned_comments": "post retirement go back roots aka rss post retirement go back roots aka rss country hopeless cant wait leave kya bhai bhagat singh ka photo lagakar bhagne ki baat karte ho inquilab ki baatien karo reminds certain events europe odd years ago one asking accountability judges one elitist class persons recuse themself case whenever want one ask abandoning official responsibility small time government employee goes absent comes late office dismissed without chances explaining avi ke time bhagat singh bann ke dekho na bhaipuri jindagi kharab kr denge tumhari better leave country first chance get boria bistar bandho aur niklo country selet trash remain shithole uniform civil code hated much whats wrong treating every citizen equally law irrespective religion guy blot constitution ucc rssvhp close hindutva civil code anything name ucc implies opinion polygamy triple talaq bad halala system woman raped good defines secularism got terror flavor complete speech talking majoritarian politics trust govt consider religions groups outside main hindutva fold comibg rlthia ucc code cant wait leave go law ucc know better dont know halala know vhp celebrates rape garlands rapists family nods approval see opinion polygamy triple talaq thats majoritarian politics guess ok supreme court promotion incoming hey dont know much abt elaborate whats wrong wrong garlanding convicted rapists saffronised ucc let assume mean latter dear imagination must lacking think ucc sangh parivar truly going ucc fearmongering already see freedom muslim curbed name tackling love jihad land jihad really think rosy wan na know ucc getting wrong giving equality u said freedom muslims curbed even assume true still doesnt explain ucc wrong paying attention please reread last comment ucc isnt problem saffron ucc isnt actually ucc problem leaders openly call hindu rashtra call muslims infiltrators ugrawadi faith ucc uniform shouldnt treated fearmongering projection past behaviour sounding unreasonable care explain says person bhagat singh profile pic run coward dont need anyways ahh get u wan na say may get bias implementation coz past behaviour leader idea ucc right instead ucc solution last honest people leave guys accept turmoil country blind patriotism right solution exactly exactly problem equal right talking running away martyred freedom fighter pp honest calling blatant hypocrisy cowardice blind patriotism bhagat singh biggest communist could ever find read letters also caste system safe say wouldnt like way country right also running away making better investment little time world cause arent yet mean failed country developing despite problems face country would destroyed alreadypakistansrilankabangladeshall yall ever complain complain politicians reading problems ever joined city planning societies charitable ngos protests even vote unless make heard matters people running away justifying cowardice bhagat singhs sacrifice wasted lot atleast hes open rest closeted bhakts come retirement indians bhagatsinghs side people support cancerous government carcinogenic ideology speech mentioned judiciary work perin support majority justice take heavier side justice say people support cancerous society consider included people dont right means people think like opinions governance join people spread message protest ask politicians problems face hold responsible find groups every city cause dont things complain reddit providing ammunition cowards justify choice leave majority doesnt mean religion constitution exceot basuic structure changed majority ucc doesnt come badic structure saying standing rss platform mean meant religion hindu also means ucc prohindu already assured would touch law prohindu like hindu undivided family hindus evade tax",
    "light_cleaned_title": "Sitting Allahabad HC Judge Delivers Speech on Uniform Civil Code at Vishva Hindu Parishad Event",
    "light_cleaned_selftext": "What is the difference between mullah of taliban ? And this guy? Never thought it was this bad - may be living in the south, was oblivious to the cancer growing in my country",
    "light_cleaned_comments": "Post retirement he will go back to his roots aka RSS Post retirement he will go back to his roots aka RSS This country is hopeless and I can't wait to leave. Kya bhai bhagat singh ka photo lagakar bhagne ki baat karte ho inquilab ki baatien karo.. Reminds me of certain events in Europe 80 odd years ago No one is asking for their accountability. Judges are one of the most elitist class of persons. They will recuse themself from any case whenever they want no one to ask why they are abandoning their official responsibility. But if a small time government employee goes absent or comes late to the office. They are dismissed without any chances of explaining themselves. Avi ke time Bhagat Singh bann ke dekho na bhai...Puri Jindagi kharab kr denge tumhari.... it's better to leave the country at the first chance we get. boria bistar bandho aur niklo is country se…let all the trash remain in this shithole Why is uniform civil code hated so much? What’s wrong in treating every citizen equally before law irrespective of religion? This guy is a blot on constitution UCC by RSS/VHP will be more close to hindutva civil code than anything the name UCC implies. So opinion against polygamy and triple talaq is bad? But halala a system where woman are raped is good. This defines why our secularism got the terror flavor. How? here is his complete speech. He is talking about majoritarian politics. I do not trust this govt to consider any other religions / groups outside their main hindutva fold while comibg up with rlthia UCC code. cant wait to leave? where will you go law should be same for all is not what ucc is, you should know better i dont know about halala but i do know vhp celebrates rape and garlands rapists while your family nods in approval All i see is opinion against polygamy and triple talaq. If thats majoritarian politics. I guess its ok. Supreme court promotion incoming Hey I don't know much abt it can you elaborate on what's wrong with it ? about what is wrong? garlanding convicted rapists? or the saffronised UCC? let me assume you mean the latter, then my dear your imagination must be lacking if you think the ucc of sangh parivar is truly going to be, \"UCC\" Am I fearmongering now? not at all, already you can see freedom of muslim is curbed in the name of tackling \"love jihad\" and \"land jihad\" do you really think its all that rosy? I wanna know where UCC is getting wrong or not giving equality As u said that freedom of muslims is being curbed, and even if I assume it's true, it still doesn’t explain how the UCC wrong you are not paying attention, please reread the last comment UCC itself isnt the problem, its the saffron UCC which isnt actually a UCC, that is the problem when their leaders openly call for hindu rashtra, when they call muslims as infiltrators and ugrawadi, do you have faith their UCC is uniform? This shouldnt be treated as fearmongering, its projection of their past behaviour, why is this sounding unreasonable to you ? care to explain Says the person with Bhagat singh as their profile pic. Run off coward, we dont need you anyways. Ahh now I get it , u wanna say it may get bias in implementation coz of past behaviour by some leader But idea of UCC is right ? Then instead of UCC what will be solution? Only when the last of the honest people leave will you guys accept the turmoil our country is in, until then it's just blind patriotism right? solution for what exactly? what exactly is the problem? Equal right Talking of running away while having a martyred freedom fighter as PP= Honest… Calling off blatant hypocrisy and cowardice= Blind patriotism. Bhagat singh was the biggest communist you could ever find and having read his letters, he was also against the caste system. Safe to say he himself wouldn't like the way our country is right now. Also it's not running away, it's making a better investment of the little time we have in this world And? Just cause we aren’t there yet does not mean we are some failed country, we are developing despite the problems we face, some other country would have destroyed itself already(Pakistan,Srilanka,Bangladesh),All y’all ever do is complain and complain as if politicians are here reading about your problems, ever joined city planning societies? Charitable NGO’s? Protests? Do you even Vote? Unless you make yourself heard where it matters all the people who are running away are doing is justifying your cowardice. Bhagat Singh’s sacrifice is wasted on you lot. Atleast he's open about it. The rest are closeted bhakts and will only come out after retirement. But Indians were on Bhagatsingh's side. Here, people are in support of a cancerous government with carcinogenic ideology. In his speech he mentioned the judiciary will work as per/in support of majority. If justice take the heavier side, where is the justice. You say people are in support of cancerous society, do you consider yourself included in these “people”? You dont right? Then that means there are people who think like you, have the same opinions about governance. Join these people, spread your message, protest and ask your politicians about the problems you face hold them responsible, you WILL find such groups in every city. Cause if you dont do those things and just complain on reddit about it all you are doing is providing ammunition for these cowards to justify their choice to leave. The majority doesnt mean religion, the constitution exceot the basuic structure can be changed by majority. And ucc doesnt come under badic structure Saying that standing on the RSS platform does mean he meant religion and that too Hindu. This also means the UCC will be pro-Hindu. They already assured they would not touch any law that is pro-Hindu like Hindu undivided family so that Hindus can evade more tax."
}