{
    "id": "14ci2e5",
    "title": "Seen many posts saying how people are fed up with \"hatred\" towards Mulsims.",
    "url": "https://www.reddit.com/r/india/comments/14ci2e5/seen_many_posts_saying_how_people_are_fed_up_with/",
    "selftext": "[Clash between Muslims and Police.](https://www.freepressjournal.in/india/junagadh-violence-gujarat-cops-thrash-men-involved-in-clash-over-illegal-dargah-with-belt-video-surfaces)\n\nYou may have heard about the clashes between Muslims and the police that occurred on June 14th. I wasn't aware of it until today when I found out that my mother's uncle was hit by stones thrown by people during those clashes.\n\nI've seen many people posting about how the government is fueling Hindus and how Hindus are targeting Muslims. But what actually happened here? A notice was sent to a dargah stating that it was built on state-owned land, and that's when everything started. My mother's uncle is a man in his 60s with a paralyzed son. He's the one who runs a small store to support his family of three. Just imagine going out for something and getting hit by Muslims with stones and fire in their hands simply because they received a notice. I don't care if you receive a notice according to the law, but setting vehicles on fire and throwing stones is never the solution.\n\nNow let me ask you, the \"peace-loving\" people. If you think about my mother's side of the family, is there any way they wouldn't harbor hatred towards the Muslim community? Most of us here were born with enough money to ignore the problems faced at the grassroots level. We embrace the idea of secularism and detest the \"idea\" of hating a particular community. But that's because most of us have never lived on the streets. Most of us have never experienced violence on the roads. I can guarantee that many of us have never visited a police station to file a complaint about violence.\n\nHowever, the reality of the problems on the ground is completely different. If you are the sole breadwinner in a very poor family burdened with debts, and then you get hit by a stone while walking home by a community that has taken matters into their own hands, there is no way you and your family won't harbor lifelong hatred towards that community. Stop complaining about \"hatred.\" This is not a world of strawberries where everyone is good. Hatred between communities is real. Even if you are a peace-loving individual, no one will spare you.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 22,
    "created_utc": 1687087462.0,
    "convurl": "https://external-preview.redd.it/UW7NyiROnLEdo-UVaFvQuBecTPxOqlaoz9akQCVPjD8.jpg?auto=webp&v=enabled&s=5980eb415c5572076ff0bda698e1d9ef57893f27",
    "comments": [
        "I am really sorry for what happened to the old man. Such an incident definitely makes us angry and thinks twice about the idea of \"secularism\". This hatred would be passed on to the second generation. Maybe that generation won't choose violence but then again they might face such stone pelters, next thing you know stone pelters came into power in your area. Now the stone pelting will be done in lawful manner on the third gen and this gen just cannot tolerate it anymore and would opt for violence. This vicious cycle will continue and will not stop.\n\nWhat I wanted to say is that a common man who is living his life to earn for the family would never want such conflicts, would never want to see a Police station in their life, and would never want to be in a situation to file a complaint. We all want those strawberries but like you said ground reality is just thorns. \n\nWho is supposed to take care of these thorns, govt because we pay them to service us and make our life  better in society. We are busy making life for us but the responsibility of making life around us better is of the government. But instead they are using our money to hire bulldozers and then destroy the houses built by khoon paseene ki mehnat, destroying the roads to stop farmers who are fighting for their livelihood, resulting in growing more thorns. \n\nI know at personal level it feels we are wronged by a particular group of people but at a higher level we reap what we sow.",
        "State sponsored violence is not an answer. Ever ! We cannot accept \"mob justice\". Mob rule is lawlessness. Yes, our criminal justice system is broken but we need to fix that without taking recourse to \"shortcuts\"\n\nThe police in India with very few exceptions behave like a colonial power. We need to change that. I am not saying that the flogged persons are innocent. They may well be the vilest criminals. But, public flogging is not on the statute books and cannot be countenanced. \n\nPublic safety lies in the rule of law. Otherwise anyone can be beaten up by a policeman on any pretext.",
        "That's a video of public flogging of Muslim men. \n\n\nSorry for injury to your family member. \n\n\nHowever, it's Gujarat and we have to not believe anything that comes out from this state especially whatever Police sources tell. One person is dead, and police have not revealed his name - because he most probably died in police brutality. \n\nIt is most likely that, people came to protest and Gujarat police saw an opportunity to beat them up, and went about doing the same. Some people in crowd got agitated and threw rocks. And police had more reasons to do the same. Once situation calmed, they picked up some people, lined them up, beat the shit out of them to show others to stay in line. This is Gujarat, a police state where at every level chaddis are present including Gujarat HC.",
        "What kind of shitty logic is this. You seem to be batting for collective hatred against all Muslims based on individual victims. And since this hatred started and spread long before your uncle's unfortunate suffering, you seem to be batting for collective hatred based on the probabilities of victims in future.\n\nIf that logic is fine, then somewhere today a Hindu must have surely been the victim of a road accident by a reckless Hindu driver or violence by another Hindu. Now justify why your logic can't be applied to ask every Hindu to hate every other Hindu.\n\nThere's a name for your logic. It's called the outgroup homogeneity cognitive bias. Yes, it's a bias. And it's poor logic.",
        "Hate the individuals causing the violence, not everyone who is muslim.",
        "Bro if the state wasn't sponsoring hatred against Muslims this wouldn't have happened or wouldn't have gotten this worse. Intolerant people are in each religion , on each side . What differs is which side is dominant among them - tolerant or intolerant . \nWith what's going on in our nation , I wouldn't be surprised if Muslims or Christians one day took to road and waged a civil war. \nYou cannot expect the other side to remain \"peaceful\" if your side is the one constantly provoking or belittling them. \nAnd as always , it's the Common man that suffers not the politicians , religious leaders who incite hate .",
        "Post title: The word hatred is in quotes for some reason.\n\n🚩 \n\n\n>Now let me ask you, the \"peace-loving\" people.\n\n🚩",
        "> outgroup homogeneity cognitive bias\n\nSounds nasty. Is there a cure?",
        "Hey man, if someone can’t separate personal prejudices and systemic prejudices then the individual is at fault, I’m sorry. \n\nSame nonsense when I hear #KillAllMen, same nonsense when I hear that because of Muslims rioting someone dislikes all Muslims.",
        "If you don't have the basic ability to differentiate between an entire community and some violent jerks, then that's your problem.\n\nAlso, going by your half baked annecdotal logic, all men are rapists and all Indians are social media creeps"
    ],
    "cleaned_text": "seen many posts saying people fed hatred towards mulsims clash muslims policehttpswwwfreepressjournalinindiajunagadhviolencegujaratcopsthrashmeninvolvedinclashoverillegaldargahwithbeltvideosurfaces may heard clashes muslims police occurred june th wasnt aware today found mothers uncle hit stones thrown people clashes ive seen many people posting government fueling hindus hindus targeting muslims actually happened notice sent dargah stating built stateowned land thats everything started mothers uncle man paralyzed son hes one runs small store support family three imagine going something getting hit muslims stones fire hands simply received notice dont care receive notice according law setting vehicles fire throwing stones never solution let ask peaceloving people think mothers side family way wouldnt harbor hatred towards muslim community us born enough money ignore problems faced grassroots level embrace idea secularism detest idea hating particular community thats us never lived streets us never experienced violence roads guarantee many us never visited police station file complaint violence however reality problems ground completely different sole breadwinner poor family burdened debts get hit stone walking home community taken matters hands way family wont harbor lifelong hatred towards community stop complaining hatred world strawberries everyone good hatred communities real even peaceloving individual one spare ",
    "cleaned_title": "seen many posts saying people fed hatred towards mulsims",
    "cleaned_selftext": "clash muslims policehttpswwwfreepressjournalinindiajunagadhviolencegujaratcopsthrashmeninvolvedinclashoverillegaldargahwithbeltvideosurfaces may heard clashes muslims police occurred june th wasnt aware today found mothers uncle hit stones thrown people clashes ive seen many people posting government fueling hindus hindus targeting muslims actually happened notice sent dargah stating built stateowned land thats everything started mothers uncle man paralyzed son hes one runs small store support family three imagine going something getting hit muslims stones fire hands simply received notice dont care receive notice according law setting vehicles fire throwing stones never solution let ask peaceloving people think mothers side family way wouldnt harbor hatred towards muslim community us born enough money ignore problems faced grassroots level embrace idea secularism detest idea hating particular community thats us never lived streets us never experienced violence roads guarantee many us never visited police station file complaint violence however reality problems ground completely different sole breadwinner poor family burdened debts get hit stone walking home community taken matters hands way family wont harbor lifelong hatred towards community stop complaining hatred world strawberries everyone good hatred communities real even peaceloving individual one spare",
    "cleaned_comments": "really sorry happened old man incident definitely makes us angry thinks twice idea secularism hatred would passed second generation maybe generation wont choose violence might face stone pelters next thing know stone pelters came power area stone pelting done lawful manner third gen gen tolerate anymore would opt violence vicious cycle continue stop wanted say common man living life earn family would never want conflicts would never want see police station life would never want situation file complaint want strawberries like said ground reality thorns supposed take care thorns govt pay service us make life better society busy making life us responsibility making life around us better government instead using money hire bulldozers destroy houses built khoon paseene ki mehnat destroying roads stop farmers fighting livelihood resulting growing thorns know personal level feels wronged particular group people higher level reap sow state sponsored violence answer ever accept mob justice mob rule lawlessness yes criminal justice system broken need fix without taking recourse shortcuts police india exceptions behave like colonial power need change saying flogged persons innocent may well vilest criminals public flogging statute books countenanced public safety lies rule law otherwise anyone beaten policeman pretext thats video public flogging muslim men sorry injury family member however gujarat believe anything comes state especially whatever police sources tell one person dead police revealed name probably died police brutality likely people came protest gujarat police saw opportunity beat went people crowd got agitated threw rocks police reasons situation calmed picked people lined beat shit show others stay line gujarat police state every level chaddis present including gujarat hc kind shitty logic seem batting collective hatred muslims based individual victims since hatred started spread long uncles unfortunate suffering seem batting collective hatred based probabilities victims future logic fine somewhere today hindu must surely victim road accident reckless hindu driver violence another hindu justify logic cant applied ask every hindu hate every hindu theres name logic called outgroup homogeneity cognitive bias yes bias poor logic hate individuals causing violence everyone muslim bro state wasnt sponsoring hatred muslims wouldnt happened wouldnt gotten worse intolerant people religion side differs side dominant among tolerant intolerant whats going nation wouldnt surprised muslims christians one day took road waged civil war expect side remain peaceful side one constantly provoking belittling always common man suffers politicians religious leaders incite hate post title word hatred quotes reason let ask peaceloving people outgroup homogeneity cognitive bias sounds nasty cure hey man someone cant separate personal prejudices systemic prejudices individual fault im sorry nonsense hear killallmen nonsense hear muslims rioting someone dislikes muslims dont basic ability differentiate entire community violent jerks thats problem also going half baked annecdotal logic men rapists indians social media creeps",
    "light_cleaned_title": "Seen many posts saying how people are fed up with \"hatred\" towards Mulsims.",
    "light_cleaned_selftext": "[Clash between Muslims and Police.](https://www.freepressjournal.in/india/junagadh-violence-gujarat-cops-thrash-men-involved-in-clash-over-illegal-dargah-with-belt-video-surfaces) You may have heard about the clashes between Muslims and the police that occurred on June 14th. I wasn't aware of it until today when I found out that my mother's uncle was hit by stones thrown by people during those clashes. I've seen many people posting about how the government is fueling Hindus and how Hindus are targeting Muslims. But what actually happened here? A notice was sent to a dargah stating that it was built on state-owned land, and that's when everything started. My mother's uncle is a man in his 60s with a paralyzed son. He's the one who runs a small store to support his family of three. Just imagine going out for something and getting hit by Muslims with stones and fire in their hands simply because they received a notice. I don't care if you receive a notice according to the law, but setting vehicles on fire and throwing stones is never the solution. Now let me ask you, the \"peace-loving\" people. If you think about my mother's side of the family, is there any way they wouldn't harbor hatred towards the Muslim community? Most of us here were born with enough money to ignore the problems faced at the grassroots level. We embrace the idea of secularism and detest the \"idea\" of hating a particular community. But that's because most of us have never lived on the streets. Most of us have never experienced violence on the roads. I can guarantee that many of us have never visited a police station to file a complaint about violence. However, the reality of the problems on the ground is completely different. If you are the sole breadwinner in a very poor family burdened with debts, and then you get hit by a stone while walking home by a community that has taken matters into their own hands, there is no way you and your family won't harbor lifelong hatred towards that community. Stop complaining about \"hatred.\" This is not a world of strawberries where everyone is good. Hatred between communities is real. Even if you are a peace-loving individual, no one will spare you.",
    "light_cleaned_comments": "I am really sorry for what happened to the old man. Such an incident definitely makes us angry and thinks twice about the idea of \"secularism\". This hatred would be passed on to the second generation. Maybe that generation won't choose violence but then again they might face such stone pelters, next thing you know stone pelters came into power in your area. Now the stone pelting will be done in lawful manner on the third gen and this gen just cannot tolerate it anymore and would opt for violence. This vicious cycle will continue and will not stop. What I wanted to say is that a common man who is living his life to earn for the family would never want such conflicts, would never want to see a Police station in their life, and would never want to be in a situation to file a complaint. We all want those strawberries but like you said ground reality is just thorns. Who is supposed to take care of these thorns, govt because we pay them to service us and make our life better in society. We are busy making life for us but the responsibility of making life around us better is of the government. But instead they are using our money to hire bulldozers and then destroy the houses built by khoon paseene ki mehnat, destroying the roads to stop farmers who are fighting for their livelihood, resulting in growing more thorns. I know at personal level it feels we are wronged by a particular group of people but at a higher level we reap what we sow. State sponsored violence is not an answer. Ever ! We cannot accept \"mob justice\". Mob rule is lawlessness. Yes, our criminal justice system is broken but we need to fix that without taking recourse to \"shortcuts\" The police in India with very few exceptions behave like a colonial power. We need to change that. I am not saying that the flogged persons are innocent. They may well be the vilest criminals. But, public flogging is not on the statute books and cannot be countenanced. Public safety lies in the rule of law. Otherwise anyone can be beaten up by a policeman on any pretext. That's a video of public flogging of Muslim men. Sorry for injury to your family member. However, it's Gujarat and we have to not believe anything that comes out from this state especially whatever Police sources tell. One person is dead, and police have not revealed his name - because he most probably died in police brutality. It is most likely that, people came to protest and Gujarat police saw an opportunity to beat them up, and went about doing the same. Some people in crowd got agitated and threw rocks. And police had more reasons to do the same. Once situation calmed, they picked up some people, lined them up, beat the shit out of them to show others to stay in line. This is Gujarat, a police state where at every level chaddis are present including Gujarat HC. What kind of shitty logic is this. You seem to be batting for collective hatred against all Muslims based on individual victims. And since this hatred started and spread long before your uncle's unfortunate suffering, you seem to be batting for collective hatred based on the probabilities of victims in future. If that logic is fine, then somewhere today a Hindu must have surely been the victim of a road accident by a reckless Hindu driver or violence by another Hindu. Now justify why your logic can't be applied to ask every Hindu to hate every other Hindu. There's a name for your logic. It's called the outgroup homogeneity cognitive bias. Yes, it's a bias. And it's poor logic. Hate the individuals causing the violence, not everyone who is muslim. Bro if the state wasn't sponsoring hatred against Muslims this wouldn't have happened or wouldn't have gotten this worse. Intolerant people are in each religion , on each side . What differs is which side is dominant among them - tolerant or intolerant . With what's going on in our nation , I wouldn't be surprised if Muslims or Christians one day took to road and waged a civil war. You cannot expect the other side to remain \"peaceful\" if your side is the one constantly provoking or belittling them. And as always , it's the Common man that suffers not the politicians , religious leaders who incite hate . Post title: The word hatred is in quotes for some reason. 🚩 >Now let me ask you, the \"peace-loving\" people. 🚩 > outgroup homogeneity cognitive bias Sounds nasty. Is there a cure? Hey man, if someone can’t separate personal prejudices and systemic prejudices then the individual is at fault, I’m sorry. Same nonsense when I hear #KillAllMen, same nonsense when I hear that because of Muslims rioting someone dislikes all Muslims. If you don't have the basic ability to differentiate between an entire community and some violent jerks, then that's your problem. Also, going by your half baked annecdotal logic, all men are rapists and all Indians are social media creeps"
}