{
    "id": "17jo6ha",
    "title": "Most tax breaks under UPA went to corporates, individuals gain more under Modi",
    "url": "https://www.reddit.com/r/india/comments/17jo6ha/most_tax_breaks_under_upa_went_to_corporates/",
    "selftext": "[https://theprint.in/economy/suit-boot-ki-sarkar-most-tax-breaks-under-upa-went-to-corporates-individuals-gain-more-under-modi/1822512/](https://theprint.in/economy/suit-boot-ki-sarkar-most-tax-breaks-under-upa-went-to-corporates-individuals-gain-more-under-modi/1822512/)\n\n&#x200B;\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698652283.0,
    "convurl": "https://external-preview.redd.it/3uXphfgSdphcJRVRnpU92dNROCM8dIoa6WnKCiiHhTA.jpg?auto=webp&s=2de8b5fb0a6a4644de7364a1abbb271821d25154",
    "comments": [
        "did not expect to hear this",
        "Let me explain:\n\nCorporates = favourite corporates\n\nindividual taxpayers = Politicians/Chamchas/Gundas\n\nHope this helps. \n\n\n(Any tax break a govt employee or any private sector job has received let me know)",
        "So you are saying corporates should have been kept given tax breaks??\n\nBTW.. post 2017.. there is a Std.deduction.. \n\nGST removes vat and incosisten tax at multiple levels..\n\nALL THESE SCHEMES ASSYME TAX FOREGONE AT IMPLEMENTATUON.. for the rest\n\nRead tbe fucking repot in link...",
        "The point to be looked at is the quantum of tax waive offs. Under NDA the corporate tax was lowered. The personal benefits have been stripped of under the new scheme for  IT returns. Net net the burden of taxation on the general public has increased under NDA, while corporates are paying less tax.",
        "Print and shekhar is a godi media in disguise of neutral. Others are openly godi media",
        "No shit, UPA scams favored several corporates. NDA scams favor two, every other corporate is just competitor in race for the two. People are delusional either party going to favor servile people, what for? Still end of the day you can prevent one side going overwhelmingly ahead than the other by voting non-bhajpa. Thats why parties like TMC, CPM are trying to find concensus, or AAP and INC.",
        "Can someone please explain the term tax breaks or revenue foregone?\n\nCorporate tax was reduced during the last government's tenure, right? Since the tax rate is reduced it won't be considered as a tax break, right?",
        "More specifically the individuals are Adani and Ambani 😂",
        "Modi ki sazish /s",
        "Yes.. or else tax break to corporates would have shown much more...",
        "So, that's it.\n\nThis article is just a statistical gymnastics. 🤦🏽‍♂️",
        "No, I am saying that corporate taxes being reduced are not taken into these consideration as they do not come under Tax cutbacks/Tax rebates. They will come under tax reduction (read laffere curve for that)  \n\n\nMy Yes meant, Yes Tax rate reduction will not count as tax break.. otherwise these numbers would have shown higher tax break to corporates which is not applicable here/..",
        "I understand your point. \n\nBut this article in the print is a hit job.",
        "TCA is someone who hits both.. abd print is more neutral than either side I see..",
        "Maybe, but this piece is misleading.",
        "It's in The Print. A right wing mouthpiece. What else do we expect?"
    ],
    "cleaned_text": "tax breaks upa went corporates individuals gain modi httpstheprintineconomysuitbootkisarkarmosttaxbreaksunderupawenttocorporatesindividualsgainmoreundermodihttpstheprintineconomysuitbootkisarkarmosttaxbreaksunderupawenttocorporatesindividualsgainmoreundermodi xb xb ",
    "cleaned_title": "tax breaks upa went corporates individuals gain modi",
    "cleaned_selftext": "httpstheprintineconomysuitbootkisarkarmosttaxbreaksunderupawenttocorporatesindividualsgainmoreundermodihttpstheprintineconomysuitbootkisarkarmosttaxbreaksunderupawenttocorporatesindividualsgainmoreundermodi xb xb",
    "cleaned_comments": "expect hear let explain corporates favourite corporates individual taxpayers politicianschamchasgundas hope helps tax break govt employee private sector job received let know saying corporates kept given tax breaks btw post stddeduction gst removes vat incosisten tax multiple levels schemes assyme tax foregone implementatuon rest read tbe fucking repot link point looked quantum tax waive offs nda corporate tax lowered personal benefits stripped new scheme returns net net burden taxation general public increased nda corporates paying less tax print shekhar godi media disguise neutral others openly godi media shit upa scams favored several corporates nda scams favor two every corporate competitor race two people delusional either party going favor servile people still end day prevent one side going overwhelmingly ahead voting nonbhajpa thats parties like tmc cpm trying find concensus aap inc someone please explain term tax breaks revenue foregone corporate tax reduced last governments tenure right since tax rate reduced wont considered tax break right specifically individuals adani ambani modi ki sazish yes else tax break corporates would shown much thats article statistical gymnastics saying corporate taxes reduced taken consideration come tax cutbackstax rebates come tax reduction read laffere curve yes meant yes tax rate reduction count tax break otherwise numbers would shown higher tax break corporates applicable understand point article print hit job tca someone hits abd print neutral either side see maybe piece misleading print right wing mouthpiece else expect",
    "light_cleaned_title": "Most tax breaks under UPA went to corporates, individuals gain more under Modi",
    "light_cleaned_selftext": "[https://theprint.in/economy/suit-boot-ki-sarkar-most-tax-breaks-under-upa-went-to-corporates-individuals-gain-more-under-modi/1822512/](https://theprint.in/economy/suit-boot-ki-sarkar-most-tax-breaks-under-upa-went-to-corporates-individuals-gain-more-under-modi/1822512/) &#x200B; &#x200B;",
    "light_cleaned_comments": "did not expect to hear this Let me explain: Corporates = favourite corporates individual taxpayers = Politicians/Chamchas/Gundas Hope this helps. (Any tax break a govt employee or any private sector job has received let me know) So you are saying corporates should have been kept given tax breaks?? BTW.. post 2017.. there is a Std.deduction.. GST removes vat and incosisten tax at multiple levels.. ALL THESE SCHEMES ASSYME TAX FOREGONE AT IMPLEMENTATUON.. for the rest Read tbe fucking repot in link... The point to be looked at is the quantum of tax waive offs. Under NDA the corporate tax was lowered. The personal benefits have been stripped of under the new scheme for IT returns. Net net the burden of taxation on the general public has increased under NDA, while corporates are paying less tax. Print and shekhar is a godi media in disguise of neutral. Others are openly godi media No shit, UPA scams favored several corporates. NDA scams favor two, every other corporate is just competitor in race for the two. People are delusional either party going to favor servile people, what for? Still end of the day you can prevent one side going overwhelmingly ahead than the other by voting non-bhajpa. Thats why parties like TMC, CPM are trying to find concensus, or AAP and INC. Can someone please explain the term tax breaks or revenue foregone? Corporate tax was reduced during the last government's tenure, right? Since the tax rate is reduced it won't be considered as a tax break, right? More specifically the individuals are Adani and Ambani 😂 Modi ki sazish /s Yes.. or else tax break to corporates would have shown much more... So, that's it. This article is just a statistical gymnastics. 🤦🏽‍♂️ No, I am saying that corporate taxes being reduced are not taken into these consideration as they do not come under Tax cutbacks/Tax rebates. They will come under tax reduction (read laffere curve for that) My Yes meant, Yes Tax rate reduction will not count as tax break.. otherwise these numbers would have shown higher tax break to corporates which is not applicable here/.. I understand your point. But this article in the print is a hit job. TCA is someone who hits both.. abd print is more neutral than either side I see.. Maybe, but this piece is misleading. It's in The Print. A right wing mouthpiece. What else do we expect?"
}