{
    "id": "135ccf5",
    "title": "Revised Kerala story: from '32000 women' to three young girls'",
    "url": "https://i.redd.it/w234mpz5cexa1.jpg",
    "selftext": "https://twitter.com/Advaidism/status/1653268106553479170?t=ar001M01XsD1mudvKG2zyg&s=19",
    "flair": "Politics",
    "score": 1800,
    "num_comments": 158,
    "created_utc": 1683005747.0,
    "convurl": "https://i.redd.it/w234mpz5cexa1.jpg",
    "comments": [
        "'Heartbreaking and gut-wrenching stories of 32,000 women from Kerala' has now become 'stories of three young girls from Kerala'.\n\nhttps://twitter.com/Advaidism/status/1653271248758255616?t=C7o-EhJw9i67-_G9TWowxw&s=19",
        "The damage is done. Now they are just covering up.",
        "I recently watched Lord Emraan starrer Selfiee.\n\nAdah Sharma's role in it is to fart in face of Canada Kumar, lolz",
        "\"females\" lmao",
        "For those who believe one Muslim is too many, this is still going to work sadly.",
        "it was propaganda film.  Supreme court had ordered NIA probe in kerala to check love jihad .  NIA found nothing.\n\n[https://www.hindustantimes.com/india-news/nia-ends-kerala-probe-says-there-s-love-but-no-jihad/story-wlpWR7BMNcdJHkb1MUso4J.html](https://www.hindustantimes.com/india-news/nia-ends-kerala-probe-says-there-s-love-but-no-jihad/story-wlpWR7BMNcdJHkb1MUso4J.html)\n\nLater kerala hc allowed interfaith marriage and dismissed love jihad claims.\n\n[https://www.hindustantimes.com/india-news/kerala-hc-dismisses-love-jihad-charge-allows-interfaith-couple-to-stay-together-101650395238999.html](https://www.hindustantimes.com/india-news/kerala-hc-dismisses-love-jihad-charge-allows-interfaith-couple-to-stay-together-101650395238999.html)\n\nThen, centre (amit shah) told there are no cases of love jihad in kerala in written reply.\n\n[https://www.hindustantimes.com/india-news/no-case-of-love-jihad-in-kerala-centre-tells-parliament/story-dQHAMLCBvkBcgoQJbtxF1L.html](https://www.hindustantimes.com/india-news/no-case-of-love-jihad-in-kerala-centre-tells-parliament/story-dQHAMLCBvkBcgoQJbtxF1L.html)\n\nAlso, total indians joining ISIS is 66. This is from whole india. Still director used 32000 number and blamed kerala . No action taken over this misinformation, that he spread earlier.\n\n[https://timesofindia.indiatimes.com/world/us/is-has-66-known-indian-origin-fighters-us-report/articleshow/88351122.cms](https://timesofindia.indiatimes.com/world/us/is-has-66-known-indian-origin-fighters-us-report/articleshow/88351122.cms)",
        "Very sus indeed",
        "I was watching the India today interview of these nincompoops with that closet RW gaurav sawant even there they were just saying we met these women and couldn't show any proof.",
        "Please share a link",
        "Producer were looking for cheap gimmick to fuel organic demand for film, they achieved that, thanks for viglantis of social media they were able to garner enough attention.\n\nNow even if film is shifty they will be able to recoup their investments, 3, 3000, 30000 its just a figure, they don't care.",
        "Its not uploaded yet.",
        "Ok",
        "'sensor'",
        "\"Numbers are not important, but the topic is important\" in this case, is the most delusional crap I've heard lately. I feel everyone should have psychology as mandatory in higher grade schools to spot these tumors.",
        "Thank you for compiling these links",
        "https://preview.redd.it/pxkt98u0sexa1.jpeg?width=1079&format=pjpg&auto=webp&v=enabled&s=db9f47dbb8ad4e470b4d514d5aba22b0ed764957\n\nLink to trailer [https://youtu.be/3Jk3vquJDGs](https://youtu.be/3Jk3vquJDGs)\n\nUpdate\n\nThe description on YouTube link was again changed after the screenshots went viral yesterday.\n\n[https://twitter.com/zoo\\_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH\\_9DA&s=19](https://twitter.com/zoo_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH_9DA&s=19)",
        "That's what they exactly said. All they want to do is make sure muslims who want to put food on the table should be troubled. TKF formula will be used everywhere now.",
        "no need to link that video here. Why to give these videos more views? We know no action will be taken against him.",
        "Important to give source while making claims about facts on social media. SS are not enough sometimes\n\nUpdate\n\nThe description on YouTube link was again changed after the screenshots went viral yesterday.  \n\nhttps://twitter.com/zoo_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH_9DA&s=19",
        ">no need to link that video here\n\ncan this be called censorship ? curious",
        "Good work",
        "not censorship. but these people earn money from the views. And director openly spread misinformation. What is the use of changing it after getting so many views.",
        "YouTube Channel run by an average r/sham_sharma_show subscriber.",
        "She is one really bad actress. I was watching this movie on Netflix, had Neil Nitin mukhesh and Adah in lead role.. her acting was pathetic and the movie was unwatchable. Turned it off within 20 mins. A",
        "Why did they change the description though? It's not that 'their viewers' would care at all.",
        "Sue them for defamation of the state, the people, and their way of life.",
        "Absolutely",
        "So the 1 crore bounty is working. Wow, I didn’t know the radicalism was in effect even in Kerala too.",
        "So that people can't really sue their ass for misinformation",
        "She was bad even there lol",
        "I am surprised that there hasn't been a movie on the pulwama attack showing modi as the supreme protector who took revenge for the deceased",
        "You know what surprises me no one called this an intelligence failure and asks the home and the defence minister to resign",
        "Unfortunately damage is done",
        "At this point, many Indian movies are for background noise. Just turn them on, do your work or chore, glance occasionally to see what's happening. You don't need any brain energy to follow the story at all",
        ">Then, centre (amit shah) told there are no cases of love jihad in kerala in written reply.\n\nAmit Shah also begrudgingly admitted the same on Bangladeshi immigration in parliament back in 2015-16. He didn't stop peddling on Twitter though.",
        "Whoever that actress is she was looking damn hot in this scene.",
        "What is the context around this? I'm out of the loop.",
        "This should catch you up\n\nhttps://indianexpress.com/article/explained/how-accurate-are-the-claims-made-by-the-kerala-story-8586042/",
        "Bro...",
        "I saw this on my parents WhatsApp. I regular clean their phones from this filth and that's how I got to know about this news. I was intrigued but didn't think of anything. I thought maybe. Cut to now and I realised how wrong the news is and the damage is done. People like my parents strongly believe in love jihad as we had a situation like this in our family where the girl married a Muslim guy who was their driver. So it was out forward as love jihad. Though it could be anything tbh.",
        "Lagta hai election paas hai.",
        "Lol they missed 1e-4 alongside the 32000",
        "She's a failed actor. She's trying to resurrect her career with this movie.",
        "Tapsee is decent, just repeats herself.",
        "Noone is a failed actor these days. Everyone is getting work left and right, thanks to streaming. Trust me, they are not going anywhere - this includes your beloved Arjun Kapoor ;)",
        "Sue them in Gujarat court. If Rahul Gandhi can be punished for criminal defamation for insulting all Patels, they can as well do the same for insulting the whole of Kerala state..",
        "Thanks, so the filmmaker seems to have found a way to get press attention, as I see his last movies, monk and asma weren't able to get mainstream attention. The subject material I think, isn't far from the asma movie. \n\nI had heard about the isis story on NL Let's Talk About \n([Link for free(non paywalled) video](https://youtu.be/OUKnYOyd0aw)) but didn't know it would get so popular. \n\nHere's the full list to LTA (https://www.newslaundry.com/podcast/lets-talk-about)",
        "what is this about?",
        "See links shared below",
        "I don’t understand the issue behind this live jihad stuff. Like good or bad it’s her decision to make why are others bothered by it. Whatever happens after that is her responsibility. Why are people so adamant in choosing for others.",
        "'Tis but a rounding error.",
        "Chaddis are the most radicalized species in India.",
        "Zero has no value people. Please enjoy the movie and then give rating of 10 on imdb, even if you don't watch it, still rate the movie 10 since Hindu khatre mein hai",
        "Not a fan certainly, I avoid her movies, and only watched a handful few (Dobara, Manmarziyan, that’s it). But she knows how to act, has facial expressions and body language to the act/scene. I have an issue with her repeating herself in every movie and is predictive. I can’t stand that. Besides, she doesn’t care about the movies she signs and in for money only (nothing wrong). I simply can’t waste my 2 hrs on her. But I do maintain that she is a good actor.",
        "This is edited. The video still says 32,000 females. They can still be sued for misinformation\n\nhttps://youtu.be/udoCRDjqxv8",
        "Truth is we always saw that coming...",
        "Thank you for your contribution",
        "Modi might make it tax-free. Propaganda works in India as people are gullible.",
        "Update\n\nThe description on YouTube link was again changed after the screenshots went viral yesterday.  \n\nhttps://twitter.com/zoo_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH_9DA&s=19",
        "Update\n\nThe description on YouTube link was again changed after the screenshots went viral yesterday.  \n\nhttps://twitter.com/zoo_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH_9DA&s=19",
        "Tapsee is decent. Not great but decent. I loved her in Mulk and Baby. Adah was just bad. Her voice is weird. She sounds like bhojpuri female singers. It's strange because she sounds okay in her reels. She is pretty but damn, her acting was off.",
        "Where is the censorboard now? They fucking ban shinchan and let this shit slide. I demand a peak into the internet history of censor board directors, i bet we will find \"girl cow\" instead of \"cow girl\"",
        "Have you ever heard any bhojpuri actress? Amrapali , Akshara they are so good looking and have such a nice voice which is 1000 times better than your monster looking Tapsee Pannu. I change my TV channel when I see her movie or I feel like breaking my TV",
        "Read completely. I said Bhojpuri singers."
    ],
    "cleaned_text": "revised kerala story women three young girls  ",
    "cleaned_title": "revised kerala story women three young girls",
    "cleaned_selftext": "",
    "cleaned_comments": "heartbreaking gutwrenching stories women kerala become stories three young girls kerala damage done covering recently watched lord emraan starrer selfiee adah sharmas role fart face canada kumar lolz females lmao believe one muslim many still going work sadly propaganda film supreme court ordered nia probe kerala check love jihad nia found nothing httpswwwhindustantimescomindianewsniaendskeralaprobesaysthereslovebutnojihadstorywlpwrbmncdjhkbmusojhtmlhttpswwwhindustantimescomindianewsniaendskeralaprobesaysthereslovebutnojihadstorywlpwrbmncdjhkbmusojhtml later kerala hc allowed interfaith marriage dismissed love jihad claims httpswwwhindustantimescomindianewskeralahcdismisseslovejihadchargeallowsinterfaithcoupletostaytogetherhtmlhttpswwwhindustantimescomindianewskeralahcdismisseslovejihadchargeallowsinterfaithcoupletostaytogetherhtml centre amit shah told cases love jihad kerala written reply httpswwwhindustantimescomindianewsnocaseoflovejihadinkeralacentretellsparliamentstorydqhamlcbvkbcgoqjbtxflhtmlhttpswwwhindustantimescomindianewsnocaseoflovejihadinkeralacentretellsparliamentstorydqhamlcbvkbcgoqjbtxflhtml also total indians joining isis whole india still director used number blamed kerala action taken misinformation spread earlier httpstimesofindiaindiatimescomworldusishasknownindianoriginfightersusreportarticleshowcmshttpstimesofindiaindiatimescomworldusishasknownindianoriginfightersusreportarticleshowcms sus indeed watching india today interview nincompoops closet rw gaurav sawant even saying met women couldnt show proof please share link producer looking cheap gimmick fuel organic demand film achieved thanks viglantis social media able garner enough attention even film shifty able recoup investments figure dont care uploaded yet ok sensor numbers important topic important case delusional crap ive heard lately feel everyone psychology mandatory higher grade schools spot tumors thank compiling links link trailer httpsyoutubejkvqujdgshttpsyoutubejkvqujdgs update description youtube link changed screenshots went viral yesterday httpstwittercomzoobearstatustkwppcwoprudhdashttpstwittercomzoobearstatustkwppcwoprudhdas thats exactly said want make sure muslims want put food table troubled tkf formula used everywhere need link video give videos views know action taken important give source making claims facts social media ss enough sometimes update description youtube link changed screenshots went viral yesterday need link video called censorship curious good work censorship people earn money views director openly spread misinformation use changing getting many views youtube channel run average rshamsharmashow subscriber one really bad actress watching movie netflix neil nitin mukhesh adah lead role acting pathetic movie unwatchable turned within mins change description though viewers would care sue defamation state people way life absolutely crore bounty working wow didnt know radicalism effect even kerala people cant really sue ass misinformation bad even lol surprised hasnt movie pulwama attack showing modi supreme protector took revenge deceased know surprises one called intelligence failure asks home defence minister resign unfortunately damage done point many indian movies background noise turn work chore glance occasionally see whats happening dont need brain energy follow story centre amit shah told cases love jihad kerala written reply amit shah also begrudgingly admitted bangladeshi immigration parliament back didnt stop peddling twitter though whoever actress looking damn hot scene context around im loop catch bro saw parents whatsapp regular clean phones filth thats got know news intrigued didnt think anything thought maybe cut realised wrong news damage done people like parents strongly believe love jihad situation like family girl married muslim guy driver forward love jihad though could anything tbh lagta hai election paas hai lol missed e alongside shes failed actor shes trying resurrect career movie tapsee decent repeats noone failed actor days everyone getting work left right thanks streaming trust going anywhere includes beloved arjun kapoor sue gujarat court rahul gandhi punished criminal defamation insulting patels well insulting whole kerala state thanks filmmaker seems found way get press attention see last movies monk asma werent able get mainstream attention subject material think isnt far asma movie heard isis story nl lets talk link freenon paywalled videohttpsyoutubeouknyoydaw didnt know would get popular heres full list lta httpswwwnewslaundrycompodcastletstalkabout see links shared dont understand issue behind live jihad stuff like good bad decision make others bothered whatever happens responsibility people adamant choosing others tis rounding error chaddis radicalized species india zero value people please enjoy movie give rating imdb even dont watch still rate movie since hindu khatre mein hai fan certainly avoid movies watched handful dobara manmarziyan thats knows act facial expressions body language actscene issue repeating every movie predictive cant stand besides doesnt care movies signs money nothing wrong simply cant waste hrs maintain good actor edited video still says females still sued misinformation truth always saw coming thank contribution modi might make taxfree propaganda works india people gullible update description youtube link changed screenshots went viral yesterday update description youtube link changed screenshots went viral yesterday tapsee decent great decent loved mulk baby adah bad voice weird sounds like bhojpuri female singers strange sounds okay reels pretty damn acting censorboard fucking ban shinchan let shit slide demand peak internet history censor board directors bet find girl cow instead cow girl ever heard bhojpuri actress amrapali akshara good looking nice voice times better monster looking tapsee pannu change tv channel see movie feel like breaking tv read completely said bhojpuri singers",
    "light_cleaned_title": "Revised Kerala story: from '32000 women' to three young girls'",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "'Heartbreaking and gut-wrenching stories of 32,000 women from Kerala' has now become 'stories of three young girls from Kerala'. The damage is done. Now they are just covering up. I recently watched Lord Emraan starrer Selfiee. Adah Sharma's role in it is to fart in face of Canada Kumar, lolz \"females\" lmao For those who believe one Muslim is too many, this is still going to work sadly. it was propaganda film. Supreme court had ordered NIA probe in kerala to check love jihad . NIA found nothing. [https://www.hindustantimes.com/india-news/nia-ends-kerala-probe-says-there-s-love-but-no-jihad/story-wlpWR7BMNcdJHkb1MUso4J.html](https://www.hindustantimes.com/india-news/nia-ends-kerala-probe-says-there-s-love-but-no-jihad/story-wlpWR7BMNcdJHkb1MUso4J.html) Later kerala hc allowed interfaith marriage and dismissed love jihad claims. [https://www.hindustantimes.com/india-news/kerala-hc-dismisses-love-jihad-charge-allows-interfaith-couple-to-stay-together-101650395238999.html](https://www.hindustantimes.com/india-news/kerala-hc-dismisses-love-jihad-charge-allows-interfaith-couple-to-stay-together-101650395238999.html) Then, centre (amit shah) told there are no cases of love jihad in kerala in written reply. [https://www.hindustantimes.com/india-news/no-case-of-love-jihad-in-kerala-centre-tells-parliament/story-dQHAMLCBvkBcgoQJbtxF1L.html](https://www.hindustantimes.com/india-news/no-case-of-love-jihad-in-kerala-centre-tells-parliament/story-dQHAMLCBvkBcgoQJbtxF1L.html) Also, total indians joining ISIS is 66. This is from whole india. Still director used 32000 number and blamed kerala . No action taken over this misinformation, that he spread earlier. [https://timesofindia.indiatimes.com/world/us/is-has-66-known-indian-origin-fighters-us-report/articleshow/88351122.cms](https://timesofindia.indiatimes.com/world/us/is-has-66-known-indian-origin-fighters-us-report/articleshow/88351122.cms) Very sus indeed I was watching the India today interview of these nincompoops with that closet RW gaurav sawant even there they were just saying we met these women and couldn't show any proof. Please share a link Producer were looking for cheap gimmick to fuel organic demand for film, they achieved that, thanks for viglantis of social media they were able to garner enough attention. Now even if film is shifty they will be able to recoup their investments, 3, 3000, 30000 its just a figure, they don't care. Its not uploaded yet. Ok 'sensor' \"Numbers are not important, but the topic is important\" in this case, is the most delusional crap I've heard lately. I feel everyone should have psychology as mandatory in higher grade schools to spot these tumors. Thank you for compiling these links Link to trailer [https://youtu.be/3Jk3vquJDGs](https://youtu.be/3Jk3vquJDGs) Update The description on YouTube link was again changed after the screenshots went viral yesterday. [https://twitter.com/zoo\\_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH\\_9DA&s=19](https://twitter.com/zoo_bear/status/1653741277442351105?t=K3W8ppc40WopR0u1dH_9DA&s=19) That's what they exactly said. All they want to do is make sure muslims who want to put food on the table should be troubled. TKF formula will be used everywhere now. no need to link that video here. Why to give these videos more views? We know no action will be taken against him. Important to give source while making claims about facts on social media. SS are not enough sometimes Update The description on YouTube link was again changed after the screenshots went viral yesterday. >no need to link that video here can this be called censorship ? curious Good work not censorship. but these people earn money from the views. And director openly spread misinformation. What is the use of changing it after getting so many views. YouTube Channel run by an average r/sham_sharma_show subscriber. She is one really bad actress. I was watching this movie on Netflix, had Neil Nitin mukhesh and Adah in lead role.. her acting was pathetic and the movie was unwatchable. Turned it off within 20 mins. A Why did they change the description though? It's not that 'their viewers' would care at all. Sue them for defamation of the state, the people, and their way of life. Absolutely So the 1 crore bounty is working. Wow, I didn’t know the radicalism was in effect even in Kerala too. So that people can't really sue their ass for misinformation She was bad even there lol I am surprised that there hasn't been a movie on the pulwama attack showing modi as the supreme protector who took revenge for the deceased You know what surprises me no one called this an intelligence failure and asks the home and the defence minister to resign Unfortunately damage is done At this point, many Indian movies are for background noise. Just turn them on, do your work or chore, glance occasionally to see what's happening. You don't need any brain energy to follow the story at all >Then, centre (amit shah) told there are no cases of love jihad in kerala in written reply. Amit Shah also begrudgingly admitted the same on Bangladeshi immigration in parliament back in 2015-16. He didn't stop peddling on Twitter though. Whoever that actress is she was looking damn hot in this scene. What is the context around this? I'm out of the loop. This should catch you up Bro... I saw this on my parents WhatsApp. I regular clean their phones from this filth and that's how I got to know about this news. I was intrigued but didn't think of anything. I thought maybe. Cut to now and I realised how wrong the news is and the damage is done. People like my parents strongly believe in love jihad as we had a situation like this in our family where the girl married a Muslim guy who was their driver. So it was out forward as love jihad. Though it could be anything tbh. Lagta hai election paas hai. Lol they missed 1e-4 alongside the 32000 She's a failed actor. She's trying to resurrect her career with this movie. Tapsee is decent, just repeats herself. Noone is a failed actor these days. Everyone is getting work left and right, thanks to streaming. Trust me, they are not going anywhere - this includes your beloved Arjun Kapoor ;) Sue them in Gujarat court. If Rahul Gandhi can be punished for criminal defamation for insulting all Patels, they can as well do the same for insulting the whole of Kerala state.. Thanks, so the filmmaker seems to have found a way to get press attention, as I see his last movies, monk and asma weren't able to get mainstream attention. The subject material I think, isn't far from the asma movie. I had heard about the isis story on NL Let's Talk About ([Link for free(non paywalled) video](https://youtu.be/OUKnYOyd0aw)) but didn't know it would get so popular. Here's the full list to LTA (https://www.newslaundry.com/podcast/lets-talk-about) what is this about? See links shared below I don’t understand the issue behind this live jihad stuff. Like good or bad it’s her decision to make why are others bothered by it. Whatever happens after that is her responsibility. Why are people so adamant in choosing for others. 'Tis but a rounding error. Chaddis are the most radicalized species in India. Zero has no value people. Please enjoy the movie and then give rating of 10 on imdb, even if you don't watch it, still rate the movie 10 since Hindu khatre mein hai Not a fan certainly, I avoid her movies, and only watched a handful few (Dobara, Manmarziyan, that’s it). But she knows how to act, has facial expressions and body language to the act/scene. I have an issue with her repeating herself in every movie and is predictive. I can’t stand that. Besides, she doesn’t care about the movies she signs and in for money only (nothing wrong). I simply can’t waste my 2 hrs on her. But I do maintain that she is a good actor. This is edited. The video still says 32,000 females. They can still be sued for misinformation Truth is we always saw that coming... Thank you for your contribution Modi might make it tax-free. Propaganda works in India as people are gullible. Update The description on YouTube link was again changed after the screenshots went viral yesterday. Update The description on YouTube link was again changed after the screenshots went viral yesterday. Tapsee is decent. Not great but decent. I loved her in Mulk and Baby. Adah was just bad. Her voice is weird. She sounds like bhojpuri female singers. It's strange because she sounds okay in her reels. She is pretty but damn, her acting was off. Where is the censorboard now? They fucking ban shinchan and let this shit slide. I demand a peak into the internet history of censor board directors, i bet we will find \"girl cow\" instead of \"cow girl\" Have you ever heard any bhojpuri actress? Amrapali , Akshara they are so good looking and have such a nice voice which is 1000 times better than your monster looking Tapsee Pannu. I change my TV channel when I see her movie or I feel like breaking my TV Read completely. I said Bhojpuri singers."
}