{
    "id": "1g79wjd",
    "title": "Going Abroad is new disease - By Vice president ",
    "url": "https://www.reddit.com/r/india/comments/1g79wjd/going_abroad_is_new_disease_by_vice_president/",
    "selftext": "https://www.ndtv.com/india-news/going-abroad-new-disease-among-children-vice-presidents-lament-6826122#pfrom=home-ndtv_topscroll\n\nGoing abroad, that's the new disease afflicting the children of the country, Vice President Jagdeep Dhankhar said Saturday, lamenting what he called is both a \"forex drain and brain drain\".\nThe commercialisation of education, said the Vice President, is adversely impacting its quality which is not good for the future of the nation.\n\n\"There is another new disease among children - that of going abroad. The child enthusiastically wants to go abroad, he sees a new dream; but there is no assessment of which institution he is going to, which country he is going to,\" said Mr Dhankhar \n\n\"It is estimated that in 2024, about 13 lakh students went abroad. An assessment is being made about what will happen to their future, people are now understanding how bright their future would have been if they had studied here,\" said Mr Dhankhar.\n\nThis drain, said the Vice President has created a \"hole of $6 billion in our foreign exchange\".\n\nThe Vice President called upon industry leaders to make students aware and help stop the brain drain and loss of foreign exchange.\n\n\"Imagine: if 6 billion US dollars are funneled into improving infrastructure of educational institutions, where we will stand! I call this a forex drain and brain drain. This should not happen. It is the responsibility of the institutions to make their students aware of the foreign situation,\" he said further.\n\nEducation morphing into a business is not good for the future of the nation, underscored the Vice President.\n\n\"In some cases, it is even taking the shape of extortion. This is a matter of concern,\" he said, calling for optimum use of technology to give quality education to the students.\n\nThe Vice President also praised the National Education Policy which he called a \"game changer\".",
    "flair": "Rant / Vent",
    "score": 3,
    "num_comments": 13,
    "created_utc": 1729347487.0,
    "convurl": "https://external-preview.redd.it/OOSKvJky18aXzcyZHqEUFvyMAFZqIyabibVehxtEv80.jpg?auto=webp&s=222fe535914dc7bc8643a0ce2fafa9d82a0c2a57",
    "comments": [
        "One can make any comment when is vice president",
        "Been abroad 7+ years, not in a western country. I can only see how my and my family’s life would have been far far worse if we were in India.",
        "Suspend all international flights so that the disease is eliminated 🤡",
        "Lol make India liveable first",
        "Wow, the politicians of this country have skin as thick as a rhinoceros. It feels like all the crooks in the world are being born in this country.\n\nThese politicians keep preaching that children shouldn’t go abroad, while their own families are settled in Europe, the USA, or some other stable and developed country.\n\nNot a single politician has children who rely on India’s education or healthcare system. Their kids benefit from Europe and the USA, while the rest are pushed to embrace extreme nationalism.\n\nHow shameless! When you fail to develop the nation and the youth’s potential is wasted, why wouldn’t they seek opportunities abroad?\n\nNobody wants to leave their homeland by choice. When they don’t see a future and safety here, that’s why they move elsewhere.",
        "Don't give them ideas",
        "How dare they choose a better life for themselves!!\nThey must sacrifice their goals for our country. The government is not at fault, it's their aspirations. /s",
        "If going Abroad is a disease and all the politican kids are its patients. Railways and Commerce Minister Piyush Goyal’s daughter Radhika graduated from Harvard University in May 2019, while his son Dhruv has done BA in Economics from there and is now pursuing MBA from the varsity. Information and Broadcasting Minister Prakash Javadekar’s son Apoorva has completed his PhD in Economics from Boston University.\n\nChildren of all the three prominent ministers in the Cabinet  — Defence Minister Rajnath Singh, Union Finance Minister Nirmala Sitharaman and Foreign Minister S. Jaishankar — have got their degrees from foreign universities.\n\nJaishankar’s son Dhruva completed his MA from the US’ Georgetown University and daughter Medha did her BA in cinema from Denison University.\n\nVice president keeps visiting religious functions and keeps giving weird statements.\n\n\"The Vice President also praised the National Education Policy which he called a \"game changer\".\"- Truly a game changer, they are teaching pseudoscience in IIT Mandi.",
        "Dude yaps every now and then",
        "I intended to write same thing, so true.",
        "I don't think there is much brain drain. However the forex drain is real. \n\nThere should be a better way to utilise these funds efficiently. Like requesting top universities of the world for establishment of offshore universities in India and Indian govt funding these institutions. \n\nOf course the research capabilities will not be available for offshore students. However this may enable more students to get jobs abroad and may generate local secondary economy.",
        "Here, If an gov bus without insurance or PUC hits a scooter rider and he survives, his attempt for a case will result in his scooter spending 6 months in a yard. Doctors working for less than a swiggy guy and nurses for less than a waiter. VP should promise shit like this won't happen to the fools like me who stay back.",
        "Our Honourable Vice President has failed to notice the privatisation and commercialisation of Education in India. \n\nHe has neglected the fact that research and education in India is a joke. With each year the budget for education is reduced, there is no skill training, the so called Skill India has failed. From 2015 the faculty members in Educational Institution is busy doing administrative and clerical work (ask any) other than teaching. They are hired on recommendation of politicians. \n\nThese children who go, they find their own way abroad, the might go for not so famous programmes but still manage to make a good life is abroad. Some return but majority of them stay there. If possible many other would also leave this country but do not due to many challenges."
    ],
    "cleaned_text": "going abroad new disease vice president going abroad thats new disease afflicting children country vice president jagdeep dhankhar said saturday lamenting called forex drain brain drain commercialisation education said vice president adversely impacting quality good future nation another new disease among children going abroad child enthusiastically wants go abroad sees new dream assessment institution going country going said mr dhankhar estimated lakh students went abroad assessment made happen future people understanding bright future would studied said mr dhankhar drain said vice president created hole billion foreign exchange vice president called upon industry leaders make students aware help stop brain drain loss foreign exchange imagine billion us dollars funneled improving infrastructure educational institutions stand call forex drain brain drain happen responsibility institutions make students aware foreign situation said education morphing business good future nation underscored vice president cases even taking shape extortion matter concern said calling optimum use technology give quality education students vice president also praised national education policy called game changer ",
    "cleaned_title": "going abroad new disease vice president",
    "cleaned_selftext": "going abroad thats new disease afflicting children country vice president jagdeep dhankhar said saturday lamenting called forex drain brain drain commercialisation education said vice president adversely impacting quality good future nation another new disease among children going abroad child enthusiastically wants go abroad sees new dream assessment institution going country going said mr dhankhar estimated lakh students went abroad assessment made happen future people understanding bright future would studied said mr dhankhar drain said vice president created hole billion foreign exchange vice president called upon industry leaders make students aware help stop brain drain loss foreign exchange imagine billion us dollars funneled improving infrastructure educational institutions stand call forex drain brain drain happen responsibility institutions make students aware foreign situation said education morphing business good future nation underscored vice president cases even taking shape extortion matter concern said calling optimum use technology give quality education students vice president also praised national education policy called game changer",
    "cleaned_comments": "one make comment vice president abroad years western country see familys life would far far worse india suspend international flights disease eliminated lol make india liveable first wow politicians country skin thick rhinoceros feels like crooks world born country politicians keep preaching children shouldnt go abroad families settled europe usa stable developed country single politician children rely indias education healthcare system kids benefit europe usa rest pushed embrace extreme nationalism shameless fail develop nation youths potential wasted wouldnt seek opportunities abroad nobody wants leave homeland choice dont see future safety thats move elsewhere dont give ideas dare choose better life must sacrifice goals country government fault aspirations going abroad disease politican kids patients railways commerce minister piyush goyals daughter radhika graduated harvard university may son dhruv done ba economics pursuing mba varsity information broadcasting minister prakash javadekars son apoorva completed phd economics boston university children three prominent ministers cabinet defence minister rajnath singh union finance minister nirmala sitharaman foreign minister jaishankar got degrees foreign universities jaishankars son dhruva completed us georgetown university daughter medha ba cinema denison university vice president keeps visiting religious functions keeps giving weird statements vice president also praised national education policy called game changer truly game changer teaching pseudoscience iit mandi dude yaps every intended write thing true dont think much brain drain however forex drain real better way utilise funds efficiently like requesting top universities world establishment offshore universities india indian govt funding institutions course research capabilities available offshore students however may enable students get jobs abroad may generate local secondary economy gov bus without insurance puc hits scooter rider survives attempt case result scooter spending months yard doctors working less swiggy guy nurses less waiter vp promise shit like wont happen fools like stay back honourable vice president failed notice privatisation commercialisation education india neglected fact research education india joke year budget education reduced skill training called skill india failed faculty members educational institution busy administrative clerical work ask teaching hired recommendation politicians children go find way abroad might go famous programmes still manage make good life abroad return majority stay possible many would also leave country due many challenges",
    "light_cleaned_title": "Going Abroad is new disease - By Vice president",
    "light_cleaned_selftext": "Going abroad, that's the new disease afflicting the children of the country, Vice President Jagdeep Dhankhar said Saturday, lamenting what he called is both a \"forex drain and brain drain\". The commercialisation of education, said the Vice President, is adversely impacting its quality which is not good for the future of the nation. \"There is another new disease among children - that of going abroad. The child enthusiastically wants to go abroad, he sees a new dream; but there is no assessment of which institution he is going to, which country he is going to,\" said Mr Dhankhar \"It is estimated that in 2024, about 13 lakh students went abroad. An assessment is being made about what will happen to their future, people are now understanding how bright their future would have been if they had studied here,\" said Mr Dhankhar. This drain, said the Vice President has created a \"hole of $6 billion in our foreign exchange\". The Vice President called upon industry leaders to make students aware and help stop the brain drain and loss of foreign exchange. \"Imagine: if 6 billion US dollars are funneled into improving infrastructure of educational institutions, where we will stand! I call this a forex drain and brain drain. This should not happen. It is the responsibility of the institutions to make their students aware of the foreign situation,\" he said further. Education morphing into a business is not good for the future of the nation, underscored the Vice President. \"In some cases, it is even taking the shape of extortion. This is a matter of concern,\" he said, calling for optimum use of technology to give quality education to the students. The Vice President also praised the National Education Policy which he called a \"game changer\".",
    "light_cleaned_comments": "One can make any comment when is vice president Been abroad 7+ years, not in a western country. I can only see how my and my family’s life would have been far far worse if we were in India. Suspend all international flights so that the disease is eliminated 🤡 Lol make India liveable first Wow, the politicians of this country have skin as thick as a rhinoceros. It feels like all the crooks in the world are being born in this country. These politicians keep preaching that children shouldn’t go abroad, while their own families are settled in Europe, the USA, or some other stable and developed country. Not a single politician has children who rely on India’s education or healthcare system. Their kids benefit from Europe and the USA, while the rest are pushed to embrace extreme nationalism. How shameless! When you fail to develop the nation and the youth’s potential is wasted, why wouldn’t they seek opportunities abroad? Nobody wants to leave their homeland by choice. When they don’t see a future and safety here, that’s why they move elsewhere. Don't give them ideas How dare they choose a better life for themselves!! They must sacrifice their goals for our country. The government is not at fault, it's their aspirations. /s If going Abroad is a disease and all the politican kids are its patients. Railways and Commerce Minister Piyush Goyal’s daughter Radhika graduated from Harvard University in May 2019, while his son Dhruv has done BA in Economics from there and is now pursuing MBA from the varsity. Information and Broadcasting Minister Prakash Javadekar’s son Apoorva has completed his PhD in Economics from Boston University. Children of all the three prominent ministers in the Cabinet — Defence Minister Rajnath Singh, Union Finance Minister Nirmala Sitharaman and Foreign Minister S. Jaishankar — have got their degrees from foreign universities. Jaishankar’s son Dhruva completed his MA from the US’ Georgetown University and daughter Medha did her BA in cinema from Denison University. Vice president keeps visiting religious functions and keeps giving weird statements. \"The Vice President also praised the National Education Policy which he called a \"game changer\".\"- Truly a game changer, they are teaching pseudoscience in IIT Mandi. Dude yaps every now and then I intended to write same thing, so true. I don't think there is much brain drain. However the forex drain is real. There should be a better way to utilise these funds efficiently. Like requesting top universities of the world for establishment of offshore universities in India and Indian govt funding these institutions. Of course the research capabilities will not be available for offshore students. However this may enable more students to get jobs abroad and may generate local secondary economy. Here, If an gov bus without insurance or PUC hits a scooter rider and he survives, his attempt for a case will result in his scooter spending 6 months in a yard. Doctors working for less than a swiggy guy and nurses for less than a waiter. VP should promise shit like this won't happen to the fools like me who stay back. Our Honourable Vice President has failed to notice the privatisation and commercialisation of Education in India. He has neglected the fact that research and education in India is a joke. With each year the budget for education is reduced, there is no skill training, the so called Skill India has failed. From 2015 the faculty members in Educational Institution is busy doing administrative and clerical work (ask any) other than teaching. They are hired on recommendation of politicians. These children who go, they find their own way abroad, the might go for not so famous programmes but still manage to make a good life is abroad. Some return but majority of them stay there. If possible many other would also leave this country but do not due to many challenges."
}