{
    "id": "1f5x4wr",
    "title": "Went to Chandni chowk today and this creepy uncle started explaining his fantasies.",
    "url": "https://v.redd.it/ca0kuhyqa2md1",
    "selftext": "Hi guys, do I went to Chandni chowk today and was trying to park my scooter, suddenly this old uncle who was standing infront of his shop looked at me and asked me to park infront of his shop, I was greatful for that. After that he called me inside his shop (he owned a jewelery shop) as I wear studs in my ear I went inside to start exploring stuff. \n\nSuddenly he started saying weird things like I can't discuss a few things with my children and said do you talk to girls and stuff like that after that he said \"ek aadmi 3 cheezen nahi chor sakta khana, hagna mutna aur chodna\" after this I was a little scared so started to record whatever I can, here it is.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1725137258.0,
    "convurl": "https://external-preview.redd.it/cW02d3Jic3FhMm1kMS-mWEiUJ7sc1Wp2XtuvEGDz7saqPrQdYzN58qvjWPua.png?format=pjpg&auto=webp&s=a5d43ec9ca05dbb9c9dae5ba2821093a54406110",
    "comments": [],
    "cleaned_text": "went chandni chowk today creepy uncle started explaining fantasies hi guys went chandni chowk today trying park scooter suddenly old uncle standing infront shop looked asked park infront shop greatful called inside shop owned jewelery shop wear studs ear went inside start exploring stuff suddenly started saying weird things like cant discuss things children said talk girls stuff like said ek aadmi cheezen nahi chor sakta khana hagna mutna aur chodna little scared started record whatever ",
    "cleaned_title": "went chandni chowk today creepy uncle started explaining fantasies",
    "cleaned_selftext": "hi guys went chandni chowk today trying park scooter suddenly old uncle standing infront shop looked asked park infront shop greatful called inside shop owned jewelery shop wear studs ear went inside start exploring stuff suddenly started saying weird things like cant discuss things children said talk girls stuff like said ek aadmi cheezen nahi chor sakta khana hagna mutna aur chodna little scared started record whatever",
    "cleaned_comments": "",
    "light_cleaned_title": "Went to Chandni chowk today and this creepy uncle started explaining his fantasies.",
    "light_cleaned_selftext": "Hi guys, do I went to Chandni chowk today and was trying to park my scooter, suddenly this old uncle who was standing infront of his shop looked at me and asked me to park infront of his shop, I was greatful for that. After that he called me inside his shop (he owned a jewelery shop) as I wear studs in my ear I went inside to start exploring stuff. Suddenly he started saying weird things like I can't discuss a few things with my children and said do you talk to girls and stuff like that after that he said \"ek aadmi 3 cheezen nahi chor sakta khana, hagna mutna aur chodna\" after this I was a little scared so started to record whatever I can, here it is.",
    "light_cleaned_comments": ""
}