{
    "id": "19c4dvp",
    "title": "How the Modi Govt facilitates ,promotes Corruption by killing safguards like RTI and CAG interference",
    "url": "https://www.reddit.com/r/india/comments/19c4dvp/how_the_modi_govt_facilitates_promotes_corruption/",
    "selftext": "&#x200B;\n\n[https:\\/\\/qz.com\\/india\\/1516380\\/how-indias-modi-government-is-killing-the-rti-law](https://preview.redd.it/8t9ar3n7rsdc1.png?width=800&format=png&auto=webp&s=328c91af9fc2a3e5656c53c3751d02008e47715e)\n\n[ https:\\/\\/thediplomat.com\\/2023\\/08\\/modi-government-acts-to-hasten-the-slow-death-of-indias-right-to-information-act\\/ ](https://preview.redd.it/opn5xfd3rsdc1.png?width=751&format=png&auto=webp&s=f386ec7e244b2ae838416a8fd6815ca8e79fe3c3)\n\n&#x200B;\n\n[https:\\/\\/www.forbes.com\\/sites\\/panosmourdoukoutas\\/2019\\/01\\/31\\/corruption-is-still-thriving-in-modis-india\\/](https://preview.redd.it/4ggus9vcrsdc1.png?width=703&format=png&auto=webp&s=feb607615ec91f96faf205af5fa3a4a9048f6586)\n\n&#x200B;\n\n[https:\\/\\/thewire.in\\/government\\/corruption-free-india-modi-government-sham-reveals-study-transperancy-international ](https://preview.redd.it/7o3dh62grsdc1.png?width=731&format=png&auto=webp&s=1cb861ac3f3dff78ba86265482e210604a545eff)\n\n&#x200B;\n\n**A 2011 study by Yale University in India showed that using the RTI Act is as effective as paying a bribe in ensuring service delivery!** .**Instead of strengthening the RTI regime, the last six years have seen a systematic attack on people’s right to information**.**Since May 2014,** [**not a single commissioner of the central information commission (CIC) has been appointed**](https://theprint.in/pageturner/excerpt/since-2014-no-cic-appointed-without-citizens-going-to-court/487177/) **without citizens having to approach courts**.\n\n**The** [**Grievance Redress Bill**](https://www.prsindia.org/sites/default/files/bill_files/Right_of_Citizens_for_Time_Bound_Delivery_of_Goods_and_Services_and_Redressal_of_their_Grievances_Bil%2C_2011.pdf) **introduced in Parliament in 2011 created an architecture for receiving and dealing with complaints close to people’s place of residence It sought to make the supervisory structure accountable for resolving complaints in a stipulated timeframe, with penal consequences for failure to do so.espite its poll promise to reintroduce the Bill in parliament if it came to power, the** [**BJP has failed to do the needful**](https://thewire.in/politics/grievance-redress-law)**.**\n\n**Even the Lokpal law passed after a long and arduous struggle in 2014, has been subverted.** **In 2016, key provisions regarding mandatory public disclosure of assets and liabilities of public servants were** [**whittled down**](https://thewire.in/law/lokpal-and-lokayuktas-amendment-act) **through amendments.** **For over five years after the law was passed, the chairperson and members of the Lokpal were not appointed.the manner in which appointments were made raised serious doubts about the independence of the Lokpal** even before it became operational. **Subsequently, for nearly a year the govt did not make the requisite rules, prompting** [**one of the Lokpal members to tender his resignation**](https://economictimes.indiatimes.com/news/politics-and-nation/lokpal-member-d-b-bhosale-resigns/articleshow/73169268.cms)**.** \n\n**Brutal attacks on whistleblowers and RTI users in the country have highlighted the vulnerability of those who dare to show the truth to power.**I**n 2018 alone, 18 people were killed for blowing the whistle on corruption on the basis of information accessed under the RTI Act.** Despite this, **the government has failed to frame rules and operationalise the** [**Whistle Blowers Protection**](https://economictimes.indiatimes.com/news/company/corporate-trends/where-the-law-stands-on-whistleblowers-in-india/indias-whistleblower-law-not-operational-yet/slideshow/71770810.cms) **law enacted in 2014 to provide a statutory framework for concealing the identity of whistleblowers and protecting them**\n\n**In the last six and a half years, however, critical anti-corruption legislations have languished and the government, despite widespread opposition, has pushed ill-conceived programmes like demonetisation and electoral bonds as the definitive solutions to the problem of corruption.**\n\n&#x200B;\n\n[https:\\/\\/thewire.in\\/government\\/officers-cag-reports-ayushman-bharat-bharatmala-transferred ](https://preview.redd.it/eg3qwei7usdc1.png?width=749&format=png&auto=webp&s=f7fd51543699951dd4fcb546a5c1def8f7e25148)\n\n**The Comptroller and Auditor General  (CAG) has transferred officers, including three who were coincidentally  involved with and in charge of two of the twelve key audit reports that  were presented in parliament during the monsoon session.**\n\n**These twelve CAG reports revealed corruption and irregularities  in the functioning of several Union government ministries and  departments.The audit report revealed corruption in insurance settlement  claims. The report, among other findings, said that lakhs of claims  continued to be made against some who had been shown as ‘deceased’ in  the database.**\n\n**The CAG** [**report**](https://thewire.in/government/cag-report-nhai-toll-collection-railway-bharatmala-udan) on highway projects **found huge overrun costs in the Dwarka Expressway project**.The **report also found irregularities in the award of projects.**\n\n“Instances of **irregularities in award of projects** by  implementing agencies were observed in **clear violation of the prescribed  processes of tendering**, viz., **successful bidder not fulfilling tender  condition or bidder selected on the basis of falsified documents, award  of works without there being approved detailed project reports or based  on faulty detailed project report**,” it said.\n\n**Apart from these two reports, the ten other CAG reports also  highlighted several other irregularities in Union government ministries.The CAG report** conducted **on 41 randomly selected toll plazas across** the five  southern states **found that in five toll plazas, a total amount of Rs  132.05 crore was collected from commuters** in violation of toll plaza  rules.The report **also found that the NHAI collected excess toll fees of  Rs 22.10 crore from road users** during 2017-2018 to 2020-2021 at the  Paranur public-funded toll plaza.\n\n**The CAG report** on the financial audit of the accounts of the  Union government found that **the Ministry of Railways had incurred  unsanctioned expenditure.**In the 2021-22 financial year (FY), the ministry had an  **unsanctioned expenditure of Rs 23,885.47 crore, encompassing 1,937  cases**. **In FY 2020-21 unsanctioned expenditure of Rs 8,127.97 crore was  incurred by Indian Railways in 2,775 cases.**\n\nAt present, t**he CAG is Girish Chandra Murmu  believed to be a trusted aide of both Modi and Union home minister Amit Shah.**\n\n**CAG Report Finds Glaring Holes, Violation of Cardinal Rules in Centre's Accounting Practices**\n\nThe  Telegraph conducted an analysis of a 27-page chapter within Report 21  called ‘Quality of Accounts and Financial Reporting Practices’, finding  that i**t “shines a light on  accounting shenanigans that will leave any private conglomerate and its  auditors aghast at the sheer audacity of the sharp practices in central  government accounts “A total of 258 footnotes had been included for  disclosing additional information in \\[the finance accounts\\] for FY  2021-22.**\n\n**Apart from these, The Telegraph reported that the government underreported some of its liabilities by over Rs 21,000 crore.**\n\n[https://thewire.in/government/cag-finds-tardy-performance-by-gujarat-and-kerala-govts-and-holes-in-centres-accounting](https://thewire.in/government/cag-finds-tardy-performance-by-gujarat-and-kerala-govts-and-holes-in-centres-accounting) \n\n&#x200B;\n\n[https:\\/\\/thewire.in\\/government\\/very-low-number-of-cag-reports-tables-in-parliament-in-2023  ](https://preview.redd.it/vt6n2h8hwsdc1.png?width=731&format=png&auto=webp&s=94beb58ad9697ca8d826649fa776d8b1f9f4757d)\n\n**The Wire has also reported that  in the aftermath of these audit reports, “verbal orders” were passed by  the CAG’s office in New Delhi to “stop all fieldwork”**\n\nThese revelation came from **BVR  Subrahmanyam, the CEO** of the government think-tank **NITI Aayog. As a  joint secretary in the prime minister’s office**, This is **arguably the first time a top government official in the  current Indian government has admitted publicly** that the prime minister  and his team had tried from the start to squeeze the states’ finances, a  concern now repeatedly raised by the states.\n\n&#x200B;\n\n[https:\\/\\/www.reporters-collective.in\\/projects\\/eng-bvr-finance](https://preview.redd.it/nh13ms9fxsdc1.png?width=760&format=png&auto=webp&s=27f3768b01adb4b77002ba5b60bc67ed37335148)\n\n**Subrahmanyam shared the information while speaking as a panelist at a  seminar on financial reporting in India,** which had been organised last  year by the **non-governmental think-tank the Centre for Social and  Economic Progress (CSEP).**\n\nIn **his remarks – another first by a government official – he revealed  how the federal budgets are “covered in layers and layers of attempt to  cover the truth”**. He added that he was **“sure you will have a Hindenburg  who will open up the \\[Indian government’s\\] accounts if they are  transparent”**.\n\nHe meant, **if the accounts were transparent,** **the truth of the  government’s fiscal condition** would become evident**, similar to how the  Adani Group’s questionable accounting practices were highlighted by  US-based short seller Hindenburg Research** .",
    "flair": "Policy/Economy",
    "score": 340,
    "num_comments": 32,
    "created_utc": 1705846785.0,
    "convurl": "https://external-preview.redd.it/PrzLjdR-wHfhu3XpY_SZZwkOJ9-UDu8GJiMUVzkkJVo.jpg?auto=webp&s=56919bd9720f6785fe136394dc209bd8faba36ae",
    "comments": [
        "It's daylight robbery..everything Modi and team does is done in broad daylight.. They are Goons not leaders..",
        "The only reason we don't hear about scams like under UPA is because those who may report the scams have been silenced. \n\nCorruption will continue irrespective of who is in power, but the fact that Modi has managed to create an illusion of complete honesty and transparency among his followers while stealing from the public is something quite incredible.",
        "Lmao",
        "JSR!!",
        "Where is that old turd Anna Hazare now?",
        "Riders don't like speed breakers",
        "Arre, kya matlab ram mandir se zayda important toh kuch hai hi nahi",
        "it's basically every political party. Everybody goes for personal profit, abhi bjp hai kabhi congress hua karti thi. Times change, the goal doesn't.",
        "It cell go brrrrrrr.",
        "Publish on Substack. Great research",
        "Modi creates such a big and successful illusion convincing the majority. Either this will be a fake it till you make it moment or a bubble which will burst although tbh we are not having extreme double digit growth like Asian tigers and our economy is resilient so it won't be like a Japan bubble",
        "Every political does it, it’s organised crime syndicate but there used be balance he literally tipped that balance completely off its floor \n\nYou can’t have single person be this powerful it creates a imbalance and starts a slow series downfall\n\nAnd tbh we a live in world where idealists get killed so way in hell will there ever be a government in world anywhere that is completely works for the people but sure as hell we as people have ensure they do cause now we see product of how manipulating the upper middle class works in favour of Modi. I mean he already pulled wool over folks with saying our GDP has increase 3x when in reality are per capita is ass \n\nFunny thing he can literally kill off population of poor folk and say he eradicated poverty it’s easy way out.",
        "Why you gotta do a dying old man like that dude?",
        "> The only reason we don't hear about scams like under UPA is because those who may report the scams have been silenced.   \n\nAnd this is a top voted comment? The silencing part applies more to Modi/BJP Govt than the UPA govt.\n\n[Bribes, Lies & Radia Tapes: The Full Rundown on 2G Spectrum ‘Scam’](https://www.thequint.com/explainers/2g-spectrum-scam-a-short-history)    \n\n> The trial in the 2G spectrum scam, which cost the-then Manmohan Singh-led UPA government heavily, began in 2011 after the court had framed charges against the 17 accused.    \n\n> “I have absolutely no hesitation in holding that prosecution has miserably failed to prove any charge against any accused,” said CBI Judge OP Saini, acquitting former telecom minister A Raja, Rajya Sabha MP Kanimozhi and 15 other accused.   \n\nThis fake case and Nirbhaya is how Modi came to power. And Nirbhaya is the reason for BJP treating rape cases in such ways like [UP Police cremated Hathras victim without giving it to family at 2:40 AM. Sources in Description](https://old.reddit.com/r/india/comments/j2bog6/up_police_cremated_hathras_victim_without_giving/)",
        "Half chaddi ko trigger mat kar re",
        "There are Ethical concerns with aggregating excerpts from Journalists reports and asking someone to pay me for it.If anyone has liked the content and would like to contribute please consider donating to your local homeless shelter or contributing to the delhi homeless dying in winter cold or education for children of farmers who committed suicide due to debt",
        "No need to paywall it. Just collate and post on twitter so more people can see it",
        "Reading comprehension 100",
        "Not into building twitter following because I dont use twitter if anyone has a high enough following and wants to amplify the message please feel free to do so",
        "Average Centrist: I hate BJP for their politics but they aren’t as corrupt as Congress bro.",
        "More like jumping to conclusions.   \n\nI wouldn't have known it, if somebody hadn't posted this link today."
    ],
    "cleaned_text": "modi govt facilitates promotes corruption killing safguards like rti cag interference xb httpsqzcomindiahowindiasmodigovernmentiskillingthertilawhttpspreviewreddittarnrsdcpngwidthformatpngautowebpscaffcaeccdee httpspreviewredditopnxfdrsdcpngwidthformatpngautowebpsfecebaeafdcaefec xb httpswwwforbescomsitespanosmourdoukoutascorruptionisstillthrivinginmodisindiahttpspreviewredditggusvcrsdcpngwidthformatpngautowebpsfebecffafaffaaaf xb httpsthewireingovernmentcorruptionfreeindiamodigovernmentshamrevealsstudytransperancyinternational httpspreviewredditodhgrsdcpngwidthformatpngautowebpscbacfdffbaeaeff xb study yale university india showed using rti act effective paying bribe ensuring service delivery instead strengthening rti regime last six years seen systematic attack peoples right informationsince may single commissioner central information commission cic appointedhttpstheprintinpageturnerexcerptsincenocicappointedwithoutcitizensgoingtocourt without citizens approach courts grievance redress billhttpswwwprsindiaorgsitesdefaultfilesbillfilesrightofcitizensfortimebounddeliveryofgoodsandservicesandredressaloftheirgrievancesbilcpdf introduced parliament created architecture receiving dealing complaints close peoples place residence sought make supervisory structure accountable resolving complaints stipulated timeframe penal consequences failure soespite poll promise reintroduce bill parliament came power bjp failed needfulhttpsthewireinpoliticsgrievanceredresslaw even lokpal law passed long arduous struggle subverted key provisions regarding mandatory public disclosure assets liabilities public servants whittled downhttpsthewireinlawlokpalandlokayuktasamendmentact amendments five years law passed chairperson members lokpal appointedthe manner appointments made raised serious doubts independence lokpal even became operational subsequently nearly year govt make requisite rules prompting one lokpal members tender resignationhttpseconomictimesindiatimescomnewspoliticsandnationlokpalmemberdbbhosaleresignsarticleshowcms brutal attacks whistleblowers rti users country highlighted vulnerability dare show truth powerin alone people killed blowing whistle corruption basis information accessed rti act despite government failed frame rules operationalise whistle blowers protectionhttpseconomictimesindiatimescomnewscompanycorporatetrendswherethelawstandsonwhistleblowersinindiaindiaswhistleblowerlawnotoperationalyetslideshowcms law enacted provide statutory framework concealing identity whistleblowers protecting last six half years however critical anticorruption legislations languished government despite widespread opposition pushed illconceived programmes like demonetisation electoral bonds definitive solutions problem corruption xb httpsthewireingovernmentofficerscagreportsayushmanbharatbharatmalatransferred httpspreviewredditegqweiusdcpngwidthformatpngautowebpsffdddfcbacdeffe comptroller auditor general cag transferred officers including three coincidentally involved charge two twelve key audit reports presented parliament monsoon session twelve cag reports revealed corruption irregularities functioning several union government ministries departmentsthe audit report revealed corruption insurance settlement claims report among findings said lakhs claims continued made shown deceased database cag reporthttpsthewireingovernmentcagreportnhaitollcollectionrailwaybharatmalaudan highway projects found huge overrun costs dwarka expressway projectthe report also found irregularities award projects instances irregularities award projects implementing agencies observed clear violation prescribed processes tendering viz successful bidder fulfilling tender condition bidder selected basis falsified documents award works without approved detailed project reports based faulty detailed project report said apart two reports ten cag reports also highlighted several irregularities union government ministriesthe cag report conducted randomly selected toll plazas across five southern states found five toll plazas total amount rs crore collected commuters violation toll plaza rulesthe report also found nhai collected excess toll fees rs crore road users paranur publicfunded toll plaza cag report financial audit accounts union government found ministry railways incurred unsanctioned expenditurein financial year fy ministry unsanctioned expenditure rs crore encompassing cases fy unsanctioned expenditure rs crore incurred indian railways cases present cag girish chandra murmu believed trusted aide modi union home minister amit shah cag report finds glaring holes violation cardinal rules centres accounting practices telegraph conducted analysis page chapter within report called quality accounts financial reporting practices finding shines light accounting shenanigans leave private conglomerate auditors aghast sheer audacity sharp practices central government accounts total footnotes included disclosing additional information finance accounts fy apart telegraph reported government underreported liabilities rs crore httpsthewireingovernmentcagfindstardyperformancebygujaratandkeralagovtsandholesincentresaccountinghttpsthewireingovernmentcagfindstardyperformancebygujaratandkeralagovtsandholesincentresaccounting xb httpsthewireingovernmentverylownumberofcagreportstablesinparliamentin httpspreviewredditvtnhhwsdcpngwidthformatpngautowebpsbebadcadfadbffd wire also reported aftermath audit reports verbal orders passed cags office new delhi stop fieldwork revelation came bvr subrahmanyam ceo government thinktank niti aayog joint secretary prime ministers office arguably first time top government official current indian government admitted publicly prime minister team tried start squeeze states finances concern repeatedly raised states xb httpswwwreporterscollectiveinprojectsengbvrfinancehttpspreviewredditnhmsfxsdcpngwidthformatpngautowebpsfbadbbbabbced subrahmanyam shared information speaking panelist seminar financial reporting india organised last year nongovernmental thinktank centre social economic progress csep remarks another first government official revealed federal budgets covered layers layers attempt cover truth added sure hindenburg open indian governments accounts transparent meant accounts transparent truth governments fiscal condition would become evident similar adani groups questionable accounting practices highlighted usbased short seller hindenburg research ",
    "cleaned_title": "modi govt facilitates promotes corruption killing safguards like rti cag interference",
    "cleaned_selftext": "xb httpsqzcomindiahowindiasmodigovernmentiskillingthertilawhttpspreviewreddittarnrsdcpngwidthformatpngautowebpscaffcaeccdee httpspreviewredditopnxfdrsdcpngwidthformatpngautowebpsfecebaeafdcaefec xb httpswwwforbescomsitespanosmourdoukoutascorruptionisstillthrivinginmodisindiahttpspreviewredditggusvcrsdcpngwidthformatpngautowebpsfebecffafaffaaaf xb httpsthewireingovernmentcorruptionfreeindiamodigovernmentshamrevealsstudytransperancyinternational httpspreviewredditodhgrsdcpngwidthformatpngautowebpscbacfdffbaeaeff xb study yale university india showed using rti act effective paying bribe ensuring service delivery instead strengthening rti regime last six years seen systematic attack peoples right informationsince may single commissioner central information commission cic appointedhttpstheprintinpageturnerexcerptsincenocicappointedwithoutcitizensgoingtocourt without citizens approach courts grievance redress billhttpswwwprsindiaorgsitesdefaultfilesbillfilesrightofcitizensfortimebounddeliveryofgoodsandservicesandredressaloftheirgrievancesbilcpdf introduced parliament created architecture receiving dealing complaints close peoples place residence sought make supervisory structure accountable resolving complaints stipulated timeframe penal consequences failure soespite poll promise reintroduce bill parliament came power bjp failed needfulhttpsthewireinpoliticsgrievanceredresslaw even lokpal law passed long arduous struggle subverted key provisions regarding mandatory public disclosure assets liabilities public servants whittled downhttpsthewireinlawlokpalandlokayuktasamendmentact amendments five years law passed chairperson members lokpal appointedthe manner appointments made raised serious doubts independence lokpal even became operational subsequently nearly year govt make requisite rules prompting one lokpal members tender resignationhttpseconomictimesindiatimescomnewspoliticsandnationlokpalmemberdbbhosaleresignsarticleshowcms brutal attacks whistleblowers rti users country highlighted vulnerability dare show truth powerin alone people killed blowing whistle corruption basis information accessed rti act despite government failed frame rules operationalise whistle blowers protectionhttpseconomictimesindiatimescomnewscompanycorporatetrendswherethelawstandsonwhistleblowersinindiaindiaswhistleblowerlawnotoperationalyetslideshowcms law enacted provide statutory framework concealing identity whistleblowers protecting last six half years however critical anticorruption legislations languished government despite widespread opposition pushed illconceived programmes like demonetisation electoral bonds definitive solutions problem corruption xb httpsthewireingovernmentofficerscagreportsayushmanbharatbharatmalatransferred httpspreviewredditegqweiusdcpngwidthformatpngautowebpsffdddfcbacdeffe comptroller auditor general cag transferred officers including three coincidentally involved charge two twelve key audit reports presented parliament monsoon session twelve cag reports revealed corruption irregularities functioning several union government ministries departmentsthe audit report revealed corruption insurance settlement claims report among findings said lakhs claims continued made shown deceased database cag reporthttpsthewireingovernmentcagreportnhaitollcollectionrailwaybharatmalaudan highway projects found huge overrun costs dwarka expressway projectthe report also found irregularities award projects instances irregularities award projects implementing agencies observed clear violation prescribed processes tendering viz successful bidder fulfilling tender condition bidder selected basis falsified documents award works without approved detailed project reports based faulty detailed project report said apart two reports ten cag reports also highlighted several irregularities union government ministriesthe cag report conducted randomly selected toll plazas across five southern states found five toll plazas total amount rs crore collected commuters violation toll plaza rulesthe report also found nhai collected excess toll fees rs crore road users paranur publicfunded toll plaza cag report financial audit accounts union government found ministry railways incurred unsanctioned expenditurein financial year fy ministry unsanctioned expenditure rs crore encompassing cases fy unsanctioned expenditure rs crore incurred indian railways cases present cag girish chandra murmu believed trusted aide modi union home minister amit shah cag report finds glaring holes violation cardinal rules centres accounting practices telegraph conducted analysis page chapter within report called quality accounts financial reporting practices finding shines light accounting shenanigans leave private conglomerate auditors aghast sheer audacity sharp practices central government accounts total footnotes included disclosing additional information finance accounts fy apart telegraph reported government underreported liabilities rs crore httpsthewireingovernmentcagfindstardyperformancebygujaratandkeralagovtsandholesincentresaccountinghttpsthewireingovernmentcagfindstardyperformancebygujaratandkeralagovtsandholesincentresaccounting xb httpsthewireingovernmentverylownumberofcagreportstablesinparliamentin httpspreviewredditvtnhhwsdcpngwidthformatpngautowebpsbebadcadfadbffd wire also reported aftermath audit reports verbal orders passed cags office new delhi stop fieldwork revelation came bvr subrahmanyam ceo government thinktank niti aayog joint secretary prime ministers office arguably first time top government official current indian government admitted publicly prime minister team tried start squeeze states finances concern repeatedly raised states xb httpswwwreporterscollectiveinprojectsengbvrfinancehttpspreviewredditnhmsfxsdcpngwidthformatpngautowebpsfbadbbbabbced subrahmanyam shared information speaking panelist seminar financial reporting india organised last year nongovernmental thinktank centre social economic progress csep remarks another first government official revealed federal budgets covered layers layers attempt cover truth added sure hindenburg open indian governments accounts transparent meant accounts transparent truth governments fiscal condition would become evident similar adani groups questionable accounting practices highlighted usbased short seller hindenburg research",
    "cleaned_comments": "daylight robberyeverything modi team done broad daylight goons leaders reason dont hear scams like upa may report scams silenced corruption continue irrespective power fact modi managed create illusion complete honesty transparency among followers stealing public something quite incredible lmao jsr old turd anna hazare riders dont like speed breakers arre kya matlab ram mandir se zayda important toh kuch hai hi nahi basically every political party everybody goes personal profit abhi bjp hai kabhi congress hua karti thi times change goal doesnt cell go brrrrrrr publish substack great research modi creates big successful illusion convincing majority either fake till make moment bubble burst although tbh extreme double digit growth like asian tigers economy resilient wont like japan bubble every political organised crime syndicate used balance literally tipped balance completely floor cant single person powerful creates imbalance starts slow series downfall tbh live world idealists get killed way hell ever government world anywhere completely works people sure hell people ensure cause see product manipulating upper middle class works favour modi mean already pulled wool folks saying gdp increase x reality per capita ass funny thing literally kill population poor folk say eradicated poverty easy way got ta dying old man like dude reason dont hear scams like upa may report scams silenced top voted comment silencing part applies modibjp govt upa govt bribes lies radia tapes full rundown g spectrum scamhttpswwwthequintcomexplainersgspectrumscamashorthistory trial g spectrum scam cost thethen manmohan singhled upa government heavily began court framed charges accused absolutely hesitation holding prosecution miserably failed prove charge accused said cbi judge op saini acquitting former telecom minister raja rajya sabha mp kanimozhi accused fake case nirbhaya modi came power nirbhaya reason bjp treating rape cases ways like police cremated hathras victim without giving family sources descriptionhttpsoldredditcomrindiacommentsjboguppolicecrematedhathrasvictimwithoutgiving half chaddi ko trigger mat kar ethical concerns aggregating excerpts journalists reports asking someone pay itif anyone liked content would like contribute please consider donating local homeless shelter contributing delhi homeless dying winter cold education children farmers committed suicide due debt need paywall collate post twitter people see reading comprehension building twitter following dont use twitter anyone high enough following wants amplify message please feel free average centrist hate bjp politics arent corrupt congress bro like jumping conclusions wouldnt known somebody hadnt posted link today",
    "light_cleaned_title": "How the Modi Govt facilitates ,promotes Corruption by killing safguards like RTI and CAG interference",
    "light_cleaned_selftext": "&#x200B; [https:\\/\\/qz.com\\/india\\/1516380\\/how-indias-modi-government-is-killing-the-rti-law](https://preview.redd.it/8t9ar3n7rsdc1.png?width=800&format=png&auto=webp&s=328c91af9fc2a3e5656c53c3751d02008e47715e) [ ](https://preview.redd.it/opn5xfd3rsdc1.png?width=751&format=png&auto=webp&s=f386ec7e244b2ae838416a8fd6815ca8e79fe3c3) &#x200B; [https:\\/\\/www.forbes.com\\/sites\\/panosmourdoukoutas\\/2019\\/01\\/31\\/corruption-is-still-thriving-in-modis-india\\/](https://preview.redd.it/4ggus9vcrsdc1.png?width=703&format=png&auto=webp&s=feb607615ec91f96faf205af5fa3a4a9048f6586) &#x200B; [https:\\/\\/thewire.in\\/government\\/corruption-free-india-modi-government-sham-reveals-study-transperancy-international ](https://preview.redd.it/7o3dh62grsdc1.png?width=731&format=png&auto=webp&s=1cb861ac3f3dff78ba86265482e210604a545eff) &#x200B; **A 2011 study by Yale University in India showed that using the RTI Act is as effective as paying a bribe in ensuring service delivery!** .**Instead of strengthening the RTI regime, the last six years have seen a systematic attack on people’s right to information**.**Since May 2014,** [**not a single commissioner of the central information commission (CIC) has been appointed**](https://theprint.in/pageturner/excerpt/since-2014-no-cic-appointed-without-citizens-going-to-court/487177/) **without citizens having to approach courts**. **The** [**Grievance Redress Bill**](https://www.prsindia.org/sites/default/files/bill_files/Right_of_Citizens_for_Time_Bound_Delivery_of_Goods_and_Services_and_Redressal_of_their_Grievances_Bil%2C_2011.pdf) **introduced in Parliament in 2011 created an architecture for receiving and dealing with complaints close to people’s place of residence It sought to make the supervisory structure accountable for resolving complaints in a stipulated timeframe, with penal consequences for failure to do so.espite its poll promise to reintroduce the Bill in parliament if it came to power, the** [**BJP has failed to do the needful**](https://thewire.in/politics/grievance-redress-law)**.** **Even the Lokpal law passed after a long and arduous struggle in 2014, has been subverted.** **In 2016, key provisions regarding mandatory public disclosure of assets and liabilities of public servants were** [**whittled down**](https://thewire.in/law/lokpal-and-lokayuktas-amendment-act) **through amendments.** **For over five years after the law was passed, the chairperson and members of the Lokpal were not appointed.the manner in which appointments were made raised serious doubts about the independence of the Lokpal** even before it became operational. **Subsequently, for nearly a year the govt did not make the requisite rules, prompting** [**one of the Lokpal members to tender his resignation**](https://economictimes.indiatimes.com/news/politics-and-nation/lokpal-member-d-b-bhosale-resigns/articleshow/73169268.cms)**.** **Brutal attacks on whistleblowers and RTI users in the country have highlighted the vulnerability of those who dare to show the truth to power.**I**n 2018 alone, 18 people were killed for blowing the whistle on corruption on the basis of information accessed under the RTI Act.** Despite this, **the government has failed to frame rules and operationalise the** [**Whistle Blowers Protection**](https://economictimes.indiatimes.com/news/company/corporate-trends/where-the-law-stands-on-whistleblowers-in-india/indias-whistleblower-law-not-operational-yet/slideshow/71770810.cms) **law enacted in 2014 to provide a statutory framework for concealing the identity of whistleblowers and protecting them** **In the last six and a half years, however, critical anti-corruption legislations have languished and the government, despite widespread opposition, has pushed ill-conceived programmes like demonetisation and electoral bonds as the definitive solutions to the problem of corruption.** &#x200B; [https:\\/\\/thewire.in\\/government\\/officers-cag-reports-ayushman-bharat-bharatmala-transferred ](https://preview.redd.it/eg3qwei7usdc1.png?width=749&format=png&auto=webp&s=f7fd51543699951dd4fcb546a5c1def8f7e25148) **The Comptroller and Auditor General (CAG) has transferred officers, including three who were coincidentally involved with and in charge of two of the twelve key audit reports that were presented in parliament during the monsoon session.** **These twelve CAG reports revealed corruption and irregularities in the functioning of several Union government ministries and departments.The audit report revealed corruption in insurance settlement claims. The report, among other findings, said that lakhs of claims continued to be made against some who had been shown as ‘deceased’ in the database.** **The CAG** [**report**](https://thewire.in/government/cag-report-nhai-toll-collection-railway-bharatmala-udan) on highway projects **found huge overrun costs in the Dwarka Expressway project**.The **report also found irregularities in the award of projects.** “Instances of **irregularities in award of projects** by implementing agencies were observed in **clear violation of the prescribed processes of tendering**, viz., **successful bidder not fulfilling tender condition or bidder selected on the basis of falsified documents, award of works without there being approved detailed project reports or based on faulty detailed project report**,” it said. **Apart from these two reports, the ten other CAG reports also highlighted several other irregularities in Union government ministries.The CAG report** conducted **on 41 randomly selected toll plazas across** the five southern states **found that in five toll plazas, a total amount of Rs 132.05 crore was collected from commuters** in violation of toll plaza rules.The report **also found that the NHAI collected excess toll fees of Rs 22.10 crore from road users** during 2017-2018 to 2020-2021 at the Paranur public-funded toll plaza. **The CAG report** on the financial audit of the accounts of the Union government found that **the Ministry of Railways had incurred unsanctioned expenditure.**In the 2021-22 financial year (FY), the ministry had an **unsanctioned expenditure of Rs 23,885.47 crore, encompassing 1,937 cases**. **In FY 2020-21 unsanctioned expenditure of Rs 8,127.97 crore was incurred by Indian Railways in 2,775 cases.** At present, t**he CAG is Girish Chandra Murmu believed to be a trusted aide of both Modi and Union home minister Amit Shah.** **CAG Report Finds Glaring Holes, Violation of Cardinal Rules in Centre's Accounting Practices** The Telegraph conducted an analysis of a 27-page chapter within Report 21 called ‘Quality of Accounts and Financial Reporting Practices’, finding that i**t “shines a light on accounting shenanigans that will leave any private conglomerate and its auditors aghast at the sheer audacity of the sharp practices in central government accounts “A total of 258 footnotes had been included for disclosing additional information in \\[the finance accounts\\] for FY 2021-22.** **Apart from these, The Telegraph reported that the government underreported some of its liabilities by over Rs 21,000 crore.** [https://thewire.in/government/cag-finds-tardy-performance-by-gujarat-and-kerala-govts-and-holes-in-centres-accounting](https://thewire.in/government/cag-finds-tardy-performance-by-gujarat-and-kerala-govts-and-holes-in-centres-accounting) &#x200B; [https:\\/\\/thewire.in\\/government\\/very-low-number-of-cag-reports-tables-in-parliament-in-2023 ](https://preview.redd.it/vt6n2h8hwsdc1.png?width=731&format=png&auto=webp&s=94beb58ad9697ca8d826649fa776d8b1f9f4757d) **The Wire has also reported that in the aftermath of these audit reports, “verbal orders” were passed by the CAG’s office in New Delhi to “stop all fieldwork”** These revelation came from **BVR Subrahmanyam, the CEO** of the government think-tank **NITI Aayog. As a joint secretary in the prime minister’s office**, This is **arguably the first time a top government official in the current Indian government has admitted publicly** that the prime minister and his team had tried from the start to squeeze the states’ finances, a concern now repeatedly raised by the states. &#x200B; [https:\\/\\/www.reporters-collective.in\\/projects\\/eng-bvr-finance](https://preview.redd.it/nh13ms9fxsdc1.png?width=760&format=png&auto=webp&s=27f3768b01adb4b77002ba5b60bc67ed37335148) **Subrahmanyam shared the information while speaking as a panelist at a seminar on financial reporting in India,** which had been organised last year by the **non-governmental think-tank the Centre for Social and Economic Progress (CSEP).** In **his remarks – another first by a government official – he revealed how the federal budgets are “covered in layers and layers of attempt to cover the truth”**. He added that he was **“sure you will have a Hindenburg who will open up the \\[Indian government’s\\] accounts if they are transparent”**. He meant, **if the accounts were transparent,** **the truth of the government’s fiscal condition** would become evident**, similar to how the Adani Group’s questionable accounting practices were highlighted by US-based short seller Hindenburg Research** .",
    "light_cleaned_comments": "It's daylight robbery..everything Modi and team does is done in broad daylight.. They are Goons not leaders.. The only reason we don't hear about scams like under UPA is because those who may report the scams have been silenced. Corruption will continue irrespective of who is in power, but the fact that Modi has managed to create an illusion of complete honesty and transparency among his followers while stealing from the public is something quite incredible. Lmao JSR!! Where is that old turd Anna Hazare now? Riders don't like speed breakers Arre, kya matlab ram mandir se zayda important toh kuch hai hi nahi it's basically every political party. Everybody goes for personal profit, abhi bjp hai kabhi congress hua karti thi. Times change, the goal doesn't. It cell go brrrrrrr. Publish on Substack. Great research Modi creates such a big and successful illusion convincing the majority. Either this will be a fake it till you make it moment or a bubble which will burst although tbh we are not having extreme double digit growth like Asian tigers and our economy is resilient so it won't be like a Japan bubble Every political does it, it’s organised crime syndicate but there used be balance he literally tipped that balance completely off its floor You can’t have single person be this powerful it creates a imbalance and starts a slow series downfall And tbh we a live in world where idealists get killed so way in hell will there ever be a government in world anywhere that is completely works for the people but sure as hell we as people have ensure they do cause now we see product of how manipulating the upper middle class works in favour of Modi. I mean he already pulled wool over folks with saying our GDP has increase 3x when in reality are per capita is ass Funny thing he can literally kill off population of poor folk and say he eradicated poverty it’s easy way out. Why you gotta do a dying old man like that dude? > The only reason we don't hear about scams like under UPA is because those who may report the scams have been silenced. And this is a top voted comment? The silencing part applies more to Modi/BJP Govt than the UPA govt. [Bribes, Lies & Radia Tapes: The Full Rundown on 2G Spectrum ‘Scam’](https://www.thequint.com/explainers/2g-spectrum-scam-a-short-history) > The trial in the 2G spectrum scam, which cost the-then Manmohan Singh-led UPA government heavily, began in 2011 after the court had framed charges against the 17 accused. > “I have absolutely no hesitation in holding that prosecution has miserably failed to prove any charge against any accused,” said CBI Judge OP Saini, acquitting former telecom minister A Raja, Rajya Sabha MP Kanimozhi and 15 other accused. This fake case and Nirbhaya is how Modi came to power. And Nirbhaya is the reason for BJP treating rape cases in such ways like [UP Police cremated Hathras victim without giving it to family at 2:40 AM. Sources in Description](https://old.reddit.com/r/india/comments/j2bog6/up_police_cremated_hathras_victim_without_giving/) Half chaddi ko trigger mat kar re There are Ethical concerns with aggregating excerpts from Journalists reports and asking someone to pay me for it.If anyone has liked the content and would like to contribute please consider donating to your local homeless shelter or contributing to the delhi homeless dying in winter cold or education for children of farmers who committed suicide due to debt No need to paywall it. Just collate and post on twitter so more people can see it Reading comprehension 100 Not into building twitter following because I dont use twitter if anyone has a high enough following and wants to amplify the message please feel free to do so Average Centrist: I hate BJP for their politics but they aren’t as corrupt as Congress bro. More like jumping to conclusions. I wouldn't have known it, if somebody hadn't posted this link today."
}