{
    "id": "15j1z68",
    "title": "Amazon India ... It is a fair policy ?",
    "url": "https://www.reddit.com/r/india/comments/15j1z68/amazon_india_it_is_a_fair_policy/",
    "selftext": "In one statement ,  Amazon India says GST credit is not available,  on the other hand Amazon India claims that the price is including GST.\n\nWhat is true ??????    How come Amazon India is allowing sellers to sale without  GST ?    Is there a case of tax evasion ?\n\nJust for Information I logged in Amazon as business account  with proper GST number.    \n\nhttps://preview.redd.it/ho3mefi0xbgb1.png?width=769&format=png&auto=webp&s=47f6aa20a745113f62c47921e89b27d32709757a",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691257788.0,
    "convurl": "https://b.thumbs.redditmedia.com/riZYrZAordLKKQaE_gbrPDm82mCqJ82AGgIuzhBh31A.jpg",
    "comments": [
        "I think when a seller adds products to their inventory, they should mention the tax. If they forget or don't include it, it will show as not applicable. Not a problem in regular amazon, just business.",
        "Pathetic warranty services of newly purchased laptop - I had dell service centre say warranty expired. In fact it was less than 6 months I purchased. \n\nThe invoice dates and warranty service doesnt match up also.\n\nThen I came to know. ''I orded new laptop  and recieved  used laptop.''"
    ],
    "cleaned_text": "amazon india fair policy one statement amazon india says gst credit available hand amazon india claims price including gst true come amazon india allowing sellers sale without gst case tax evasion information logged amazon business account proper gst number ",
    "cleaned_title": "amazon india fair policy",
    "cleaned_selftext": "one statement amazon india says gst credit available hand amazon india claims price including gst true come amazon india allowing sellers sale without gst case tax evasion information logged amazon business account proper gst number",
    "cleaned_comments": "think seller adds products inventory mention tax forget dont include show applicable problem regular amazon business pathetic warranty services newly purchased laptop dell service centre say warranty expired fact less months purchased invoice dates warranty service doesnt match also came know orded new laptop recieved used laptop",
    "light_cleaned_title": "Amazon India ... It is a fair policy ?",
    "light_cleaned_selftext": "In one statement , Amazon India says GST credit is not available, on the other hand Amazon India claims that the price is including GST. What is true ?????? How come Amazon India is allowing sellers to sale without GST ? Is there a case of tax evasion ? Just for Information I logged in Amazon as business account with proper GST number.",
    "light_cleaned_comments": "I think when a seller adds products to their inventory, they should mention the tax. If they forget or don't include it, it will show as not applicable. Not a problem in regular amazon, just business. Pathetic warranty services of newly purchased laptop - I had dell service centre say warranty expired. In fact it was less than 6 months I purchased. The invoice dates and warranty service doesnt match up also. Then I came to know. ''I orded new laptop and recieved used laptop.''"
}