{
    "id": "142de77",
    "title": "Milk for family, tuitions for children: What saving on bus fare could mean to women in Karnataka",
    "url": "https://thesouthfirst.com/karnataka/milk-for-family-tuitions-for-children-what-saving-on-bus-fare-could-mean-to-women-in-karnataka/",
    "selftext": "> As debate rages on 'financial burden' over welfare schemes deemed as 'freebies', studies and activists insist Shakti scheme will improve women's participation in social, economic and political activities.\n\nFor a certain section of the society, saving Rs 2000/- per month translates to buying milk for the family or being able to afford tuition classes for their kids.",
    "flair": "Politics",
    "score": 218,
    "num_comments": 47,
    "created_utc": 1686051970.0,
    "convurl": "https://external-preview.redd.it/3wwO7RcYoVilRsYdnx_9awfXBBCxcPU1jX8id6KptMg.jpg?auto=webp&v=enabled&s=c6f27b2bcad370e5c1e4c9a2860449429cf9e03d",
    "comments": [
        "All civilised countries promote healthy living by giving welfare. America, Canada have food stamps for poor, China also has midday meal scheme and welfare, only in India do these Brahmin baniya scums mock the poor for getting welfare.",
        "Welfare as a concept is mocked by RW in other countries too. This is not an exclusively Indian behavior. I have noted similar behavior among supporters of Republican party in the US and supporters of Conservative party in the UK. \n\nWhile we are on this topic, I will urge all the armchair economists to watch the video linked below. Warning: this is not a lunch table politics grade video, it's lengthy, dense with data -- \n\nhttps://youtu.be/LQIxbwfMVlM",
        "Petrol prices have been increased by 2, diesel by 1.\nProperty tax will be raised by 17%.\nElectricity rates are already raised by and will be in effect from 1 April (in retrospection)\n\nAll that money saved from free bus ride will be spent on rising bills.",
        "It can be a burden or an empowering scheme for women. It depend on how much the government can spend without burdening the budget. If government have enough money to spend on welfare than it should definitely do so.",
        "mard : mai madarchod hu jo yaha aaya",
        "BTW for food stamps u need to wait in line. For people trying to come out of poverty, this is often a collosal waste of time that could have otherwise been spent on productive endeavours.   Direct or indirect cash transfers on the other hand also gives the added benefit of time management to the targeted group.",
        "That's what freebies do. It's always damage the pockets of middle class.",
        "I wish there was some of this both genders. Why the fuck should I pay for bus rides when my friends can go for free and pay the same fucking taxes that I do?",
        "India also give free food rashan. But you give 200 unit free and and even one unit more than 200 and pay even more unit than pay full bill. And add to that now per unit charges has been increased by 2 rupees. So whom does this freebies benefited. \nGet your vote and than take even more money out of your pockets. \n\nGive free buses to women and than increase price of petrol by 2",
        "I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride?  They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation..\n\nThe MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. \n\nNo MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right.\n\nIt’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed.",
        "I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride?  They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation..\n\nThe MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. \n\nNo MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right.\n\nIt’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed.",
        "I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride?  They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation..\n\nThe MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. \n\nNo MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right.\n\nIt’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed.",
        "I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride?  They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation..\n\nThe MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. \n\nNo MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right.\n\nIt’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed.",
        "That's( the fact that most of the right is against social welfare across the world) true, but certain polices like the NHS are supported by both the left and right in the UK afaik.",
        "You are talking as if the rates were not already rising and its purely because of freebies.\n\nIt’s okay to criticise but come with at least a valid point so that people take you seriously",
        "[Approved by BJP in March, implemented by Congress in June](https://thesouthfirst.com/karnataka/approved-by-bjp-in-march-implemented-by-congress-in-june-electricity-to-cost-more-in-karnataka/)\n\nBJP raised the electricity bill, you should’ve questioned them when they signed and approved the bill.\n\n>All that money saved from free bus ride will be spent on rising bill.\n\nHow do you figure? Unless you’re using more than 200 unites of electricity per month you won’t be charged for domestic use.",
        "Why won’t you question the freebies that are being enjoyed by our MPs/MLAs? They get free transportation, accommodation, private staff etc. A single rally by Modi costs crores. All this is paid via tax payers money. The luxury tent that Modi used while visiting the Odisha accident site was paid via tax payers money. Nobody questions that but everyone’s outraged when the tax money benefits the tax payers.\n\nDid you know that well developed nations provide free universal healthcare for their citizens via their tax money, they don’t call it freebies. It’s considered a fundamental right. \n\nQuestion the freebies given to the Babus.",
        "Consider it like this, among a married couple the husband has to pay only his fare or a father of two daughters doesn’t have to worry about transportation charges for his daughters education. Men will indirectly save money as well.",
        "> civilised\n\nDeveloped rich countries.\n\nFTFY.",
        "Nah bhau, it's only you.",
        "But still, that’s just a few men who are the heads and sole providers of their families. What about the men who aren’t, the bachelors interning at a startup or college students who’ll be using the same transport as their female counterparts. Still pretty unfair.",
        "What are your thoughts about OPS?",
        "That's NOT how this works... India ALREADY has very big welfare schemes that dwarf most western schemes in scale and reach.\n\nHowever that's the EXACT reason why this country has to have these schemes, these schemes snatch money away from infra and other important things which would DIRECTLY benefit poor people by ACTUALLY giving them jobs rather than making them leech off the state.\n\nAlso not to mention that the CULTURAL tendency there is to NOT accept state help, rather than what is here that every one thinks they're entitled to welfare.",
        ">This is not an exclusively Indian behavior.\n\nLol Indian RW even if that's a thing LOVES welfarism more than any of these people",
        ">They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride?\n\nSo by the same token why shouldn't men get one too?\n\n>They can utilize the money saved for other essential needs, which ultimately circulates back to the government.\n\nThat's kinda what's called broken window economics \n\n>which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation..\n\nTransportation (as far as the money aspect of transportation is concerned) has NEVER been the primary cause for women dropping off from education or employment, it's a more social phenomenon. Also most lower income household have women working it's much more of a middle class issue.\n\n>The MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff.\n\nRescind them.\n\n>It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right.\n\nExactly and we deserve BETTER than some random scheme which is seems only intuitively beneficial and no one knows how it'll fair in the grand scheme of things.\n\nAlso India has WAAAY bigger welfare scheme than ANY country in the west has, given that 800 million people are just living off of free ration (and that's just one big example) when you compare it to developed nations where the ACTUAL destitute people are negligible and most of it is people paying taxes which gets BACK TO THEM.\n\n>The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed.\n\nAnd the only thing THESE schemes does is to replace that lord with the state",
        "Stop lying. India spends way too less on welfare compared to even China and Japan, and these countries also don't spend much on welfare. Read up economics instead of showing off your ignorance here. \n\n\nYou are either a victim of Brahmin bania propaganda or you are also a malicious businessman. No wonder these people are hated everywhere in India.\n\n\n\nIt is a myth that welfare takes money away from \n\n\nYes, everyone is entitled to welfare. The state exists for taking care of its population. Deal with it.",
        ">Stop lying.\n\nLying? \n\n\n>India spends way too less on welfare compared to even China and Japan, and these countries also don't spend much on welfare\n\nLol what a joke...these are mid income and high income economies respectively, also none of them have programs that are as ubiquitous as India's which is a low income economy.\nIndia gives direct benefits to 800 million people which is like more than 50% of the population which is supported by whom?\n\n\n>Read up economics instead of showing off your ignorance here. \n\nThat's something you should do first. \n\n>You are either a victim of Brahmin bania propaganda or you are also a malicious businessman. No wonder these people are hated everywhere in India.\n\nHow about well informed?\n\n>Yes, everyone is entitled to welfare\n\nNo no one's ENTITLED to welfare, you aren't ENTITLED to anyone's money\n\n>The state exists for taking care of its population. Deal with it.\n\nLol taking care by using the money that someone else earns to give it to someone else? That's making leeches not helping.",
        "> That's what freebies do. It's always damage the pockets of middle class.\n\nMiddle class is happy with ancient culture and superpowerdom.",
        "It is under attack by right wing parties in UK too iirc. It is just it has proven itself to be better than alternative to a degree that even right wing voters support it and right wing parties can't directly go after this so they are trying to go after it indirectly. \n\nhttps://amp.theguardian.com/society/2022/oct/06/nhs-england-health-budget-shortfall-extra-costs\n\nIf you are wealthy and want best return on your investment then housing and health care are the best option. Demand is never going down and increases prices just directly increases your profit.",
        "100%. There is no public accounting for the govt spending for ruling class. \n\nThe Japanese PM's son had a party at the official residence, and the son had to resign from his job to save his father's career.",
        "Yeah, that's unfortunate. Hopefully the British will somehow find a way to save the NHS",
        ">Rescind them\n\nMaybe you should direct your energy towards that cause instead of focusing all your energy fighting against schemes that benefit the poor.",
        ">against schemes that benefit the poor.\n\nLol coddling and throwing freebies isn't BENEFITTING the poor, had it been we'd be definitely not be in the shit show we're right now.\n\nAlso calling this a pro poor scheme seems so disingenuous....like aren't men poor too?",
        "You got your math wrong, few men are bachelors while the majority are heads and sole providers of the family.\n\nAlso except the free bus rides the other schemes like free electricity, monthly allowance for unemployed graduates and free rations benefit the men directly. While the bus rides may not benefit men directly it still benefits them indirectly, so it’s not like men are being neglected.",
        "Let me guess, you watch a lot of Godi media right? All nations have schemes that benefit the poor, they don’t call them freebies, it’s a fundamental right. \n\nWill you dare to question the freebies enjoyed by the politicians? You will also bend over backwards to explain the tax benefits given to the billionaires.\n\nMen do benefit from the free bus rides - the husband doesn’t have to worry about the bus charges of his wife, a father doesn’t have to worry about the transportation charges for his daughters, a wife who earlier couldn’t go to work because of the transport expenses can now do so and help provide for the family which in turn will reduce the burden on the men.\n\nAlso the govt has introduced other schemes as well, like free electricity, free rations, unemployment benefits for graduates etc which will directly benefit the men.\n\nGet rid of your misogynistic views and get your news from sources other than Godi media, maybe your perceive things differently then.\n\nSo long, buddy.",
        ">Let me guess, you watch a lot of Godi media right?\n\nIndians and their black and white narrative lol. Does the godi media not praise the freebies given by the Modi govt? \n\nAlso it's ironic you thinking I'm brainwashed by media when you'd probably be supporting most of the policies that Modi govt has brought in but you can't praise them since you hate them....NOT their policies. I am not a supporter of either.\n\n>All nations have schemes that benefit the poor, they don’t call them freebies, it’s a fundamental right. \n\nNo they DON'T consider it a fundamental right in fact it's considered one in India only which is why this country is still a poor economy, also those countries DON'T have it for poor people, it's more of an investment they PAY taxes, they get benefits that's all. It's not like more than 50% of the population LITERALLY depends on their basic meals on less than 50% of the population.\n\n>Will you dare to question the freebies enjoyed by the politicians?\n\nWhat makes you think I won't? I literally said they should be rescinded to which you also replied to.\n\n>You will also bend over backwards to explain the tax benefits given to the billionaires.\n\nOk? So? Tax benefits to corporation is literally the LEAST this country can do to attract investments coz other things don't seem to be anywhere near resolution, it's THOSE tax benefits that are able to generate jobs which in turn pay for the welfare schemes you so eagerly want. So instead of cursing them you should be praising them.\n\n>Men do benefit from the free bus rides - the husband doesn’t have to worry about the bus charges of his wife\n\nWhat about his OWN bus fare? And what makes you think women don't have their own money? Infact on lower income households MOST women are also employed, so they mostly have their own money with them so no that's NOT a benefit.\n\n>a father doesn’t have to worry about the transportation charges for his daughters\n\nThat's NOT a reason why many don't go to school also it would have been more helpful if there was BETTER infrastructure so that they can go to school with lesser fare coz there would be more buses.\n\n>a wife who earlier couldn’t go to work because of the transport expenses can now do so and help provide for the family which in turn will reduce the burden on the men.\n\nYou surely aren't aware why women are underrepresented in the work force do you? Never ever has transportation cost been the issue for employment.\n\nAlso what about a poor person who's not married? \nThere's plenty of them too aren't there?\n\n>Also the govt has introduced other schemes as well, like free electricity, free rations, unemployment benefits for graduates etc which will directly benefit the men.\n\nNot the women? Also by counting these ridiculous freebies you're not helping the case. Who's gonna support these freebies? \n\nAnd till when would someone pay for you? People need tangible infrastructure and changes that ACTUALLY reflect the amount of taxes they're paying not these pacifier style freebies to shut up the babies from crying.\n\n>Get rid of your misogynistic views and get your news from sources other than Godi media, maybe your perceive things differently then.\n\n>So long, buddy.\n\nMY mysogynistic views lol. Just coz I don't agree with this facade of \"helping women by coddling them\" I'm a mysogynist? So a person should SPECIFICALLY agree with you to be a real social justice warrior?\n\nIronically YOU'RE the one who's ACTUALLY mysogynist by supporting schemes that patronises women instead of ACTUALLY empowering them. \n\nAlso NO country that has ACTUALLY empowered women has ever done something this stupid and shameful to empower women.\n\nAnd also get rid of your dumb support for a political part and rather have your OWN ideology."
    ],
    "cleaned_text": "milk family tuitions children saving bus fare could mean women karnataka debate rages financial burden welfare schemes deemed freebies studies activists insist shakti scheme improve womens participation social economic political activities certain section society saving rs per month translates buying milk family able afford tuition classes kids ",
    "cleaned_title": "milk family tuitions children saving bus fare could mean women karnataka",
    "cleaned_selftext": "debate rages financial burden welfare schemes deemed freebies studies activists insist shakti scheme improve womens participation social economic political activities certain section society saving rs per month translates buying milk family able afford tuition classes kids",
    "cleaned_comments": "civilised countries promote healthy living giving welfare america canada food stamps poor china also midday meal scheme welfare india brahmin baniya scums mock poor getting welfare welfare concept mocked rw countries exclusively indian behavior noted similar behavior among supporters republican party us supporters conservative party uk topic urge armchair economists watch video linked warning lunch table politics grade video lengthy dense data petrol prices increased diesel property tax raised electricity rates already raised effect april retrospection money saved free bus ride spent rising bills burden empowering scheme women depend much government spend without burdening budget government enough money spend welfare definitely mard mai madarchod hu jo yaha aaya btw food stamps u need wait line people trying come poverty often collosal waste time could otherwise spent productive endeavours direct indirect cash transfers hand also gives added benefit time management targeted group thats freebies always damage pockets middle class wish genders fuck pay bus rides friends go free pay fucking taxes india also give free food rashan give unit free even one unit pay even unit pay full bill add per unit charges increased rupees freebies benefited get vote take even money pockets give free buses women increase price petrol dont get outrage buses run schedule run routes regardless passengers present whats issue women get free ride utilize money saved essential needs ultimately circulates back government moreover policy create opportunities employment education previously unable access couldnt afford transportation mlas mps enjoy various complimentary luxuries including luxurious transportation lavish accommodations personal staff additionally prices legislative canteens significantly lower compared market rates expenses incurred single visit election rally prominent figure like prime minister modi amount crores rupees paid tax money mlamp giving privileges save money govt get really pissed poor citizen gets privileges tax money ffs well developed nations provide free healthcare via tax payers money hear denouncing free healthcare freebies right like olden days landlords upper caste brahmins owned lands enjoyed luxuries got really pissed one poor people ever dared ask basic needs poor person whose hard work resulted luxuries feudal lords enjoyed dont get outrage buses run schedule run routes regardless passengers present whats issue women get free ride utilize money saved essential needs ultimately circulates back government moreover policy create opportunities employment education previously unable access couldnt afford transportation mlas mps enjoy various complimentary luxuries including luxurious transportation lavish accommodations personal staff additionally prices legislative canteens significantly lower compared market rates expenses incurred single visit election rally prominent figure like prime minister modi amount crores rupees paid tax money mlamp giving privileges save money govt get really pissed poor citizen gets privileges tax money ffs well developed nations provide free healthcare via tax payers money hear denouncing free healthcare freebies right like olden days landlords upper caste brahmins owned lands enjoyed luxuries got really pissed one poor people ever dared ask basic needs poor person whose hard work resulted luxuries feudal lords enjoyed dont get outrage buses run schedule run routes regardless passengers present whats issue women get free ride utilize money saved essential needs ultimately circulates back government moreover policy create opportunities employment education previously unable access couldnt afford transportation mlas mps enjoy various complimentary luxuries including luxurious transportation lavish accommodations personal staff additionally prices legislative canteens significantly lower compared market rates expenses incurred single visit election rally prominent figure like prime minister modi amount crores rupees paid tax money mlamp giving privileges save money govt get really pissed poor citizen gets privileges tax money ffs well developed nations provide free healthcare via tax payers money hear denouncing free healthcare freebies right like olden days landlords upper caste brahmins owned lands enjoyed luxuries got really pissed one poor people ever dared ask basic needs poor person whose hard work resulted luxuries feudal lords enjoyed dont get outrage buses run schedule run routes regardless passengers present whats issue women get free ride utilize money saved essential needs ultimately circulates back government moreover policy create opportunities employment education previously unable access couldnt afford transportation mlas mps enjoy various complimentary luxuries including luxurious transportation lavish accommodations personal staff additionally prices legislative canteens significantly lower compared market rates expenses incurred single visit election rally prominent figure like prime minister modi amount crores rupees paid tax money mlamp giving privileges save money govt get really pissed poor citizen gets privileges tax money ffs well developed nations provide free healthcare via tax payers money hear denouncing free healthcare freebies right like olden days landlords upper caste brahmins owned lands enjoyed luxuries got really pissed one poor people ever dared ask basic needs poor person whose hard work resulted luxuries feudal lords enjoyed thats fact right social welfare across world true certain polices like nhs supported left right uk afaik talking rates already rising purely freebies okay criticise come least valid point people take seriously approved bjp march implemented congress junehttpsthesouthfirstcomkarnatakaapprovedbybjpinmarchimplementedbycongressinjuneelectricitytocostmoreinkarnataka bjp raised electricity bill shouldve questioned signed approved bill money saved free bus ride spent rising bill figure unless youre using unites electricity per month wont charged domestic use wont question freebies enjoyed mpsmlas get free transportation accommodation private staff etc single rally modi costs crores paid via tax payers money luxury tent modi used visiting odisha accident site paid via tax payers money nobody questions everyones outraged tax money benefits tax payers know well developed nations provide free universal healthcare citizens via tax money dont call freebies considered fundamental right question freebies given babus consider like among married couple husband pay fare father two daughters doesnt worry transportation charges daughters education men indirectly save money well civilised developed rich countries ftfy nah bhau still thats men heads sole providers families men arent bachelors interning startup college students wholl using transport female counterparts still pretty unfair thoughts ops thats works india already big welfare schemes dwarf western schemes scale reach however thats exact reason country schemes schemes snatch money away infra important things would directly benefit poor people actually giving jobs rather making leech state also mention cultural tendency accept state help rather every one thinks theyre entitled welfare exclusively indian behavior lol indian rw even thats thing loves welfarism people run routes regardless passengers present whats issue women get free ride token shouldnt men get one utilize money saved essential needs ultimately circulates back government thats kinda whats called broken window economics ultimately circulates back government moreover policy create opportunities employment education previously unable access couldnt afford transportation transportation far money aspect transportation concerned never primary cause women dropping education employment social phenomenon also lower income household women working much middle class issue mlas mps enjoy various complimentary luxuries including luxurious transportation lavish accommodations personal staff rescind tax money ffs well developed nations provide free healthcare via tax payers money hear denouncing free healthcare freebies right exactly deserve better random scheme seems intuitively beneficial one knows itll fair grand scheme things also india waaay bigger welfare scheme country west given million people living free ration thats one big example compare developed nations actual destitute people negligible people paying taxes gets back poor person whose hard work resulted luxuries feudal lords enjoyed thing schemes replace lord state stop lying india spends way less welfare compared even china japan countries also dont spend much welfare read economics instead showing ignorance either victim brahmin bania propaganda also malicious businessman wonder people hated everywhere india myth welfare takes money away yes everyone entitled welfare state exists taking care population deal stop lying lying india spends way less welfare compared even china japan countries also dont spend much welfare lol jokethese mid income high income economies respectively also none programs ubiquitous indias low income economy india gives direct benefits million people like population supported read economics instead showing ignorance thats something first either victim brahmin bania propaganda also malicious businessman wonder people hated everywhere india well informed yes everyone entitled welfare ones entitled welfare arent entitled anyones money state exists taking care population deal lol taking care using money someone else earns give someone else thats making leeches helping thats freebies always damage pockets middle class middle class happy ancient culture superpowerdom attack right wing parties uk iirc proven better alternative degree even right wing voters support right wing parties cant directly go trying go indirectly wealthy want best return investment housing health care best option demand never going increases prices directly increases profit public accounting govt spending ruling class japanese pms son party official residence son resign job save fathers career yeah thats unfortunate hopefully british somehow find way save nhs rescind maybe direct energy towards cause instead focusing energy fighting schemes benefit poor schemes benefit poor lol coddling throwing freebies isnt benefitting poor wed definitely shit show right also calling pro poor scheme seems disingenuouslike arent men poor got math wrong men bachelors majority heads sole providers family also except free bus rides schemes like free electricity monthly allowance unemployed graduates free rations benefit men directly bus rides may benefit men directly still benefits indirectly like men neglected let guess watch lot godi media right nations schemes benefit poor dont call freebies fundamental right dare question freebies enjoyed politicians also bend backwards explain tax benefits given billionaires men benefit free bus rides husband doesnt worry bus charges wife father doesnt worry transportation charges daughters wife earlier couldnt go work transport expenses help provide family turn reduce burden men also govt introduced schemes well like free electricity free rations unemployment benefits graduates etc directly benefit men get rid misogynistic views get news sources godi media maybe perceive things differently long buddy let guess watch lot godi media right indians black white narrative lol godi media praise freebies given modi govt also ironic thinking im brainwashed media youd probably supporting policies modi govt brought cant praise since hate themnot policies supporter either nations schemes benefit poor dont call freebies fundamental right dont consider fundamental right fact considered one india country still poor economy also countries dont poor people investment pay taxes get benefits thats like population literally depends basic meals less population dare question freebies enjoyed politicians makes think wont literally said rescinded also replied also bend backwards explain tax benefits given billionaires ok tax benefits corporation literally least country attract investments coz things dont seem anywhere near resolution tax benefits able generate jobs turn pay welfare schemes eagerly want instead cursing praising men benefit free bus rides husband doesnt worry bus charges wife bus fare makes think women dont money infact lower income households women also employed mostly money thats benefit father doesnt worry transportation charges daughters thats reason many dont go school also would helpful better infrastructure go school lesser fare coz would buses wife earlier couldnt go work transport expenses help provide family turn reduce burden men surely arent aware women underrepresented work force never ever transportation cost issue employment also poor person whos married theres plenty arent also govt introduced schemes well like free electricity free rations unemployment benefits graduates etc directly benefit men women also counting ridiculous freebies youre helping case whos gon na support freebies till would someone pay people need tangible infrastructure changes actually reflect amount taxes theyre paying pacifier style freebies shut babies crying get rid misogynistic views get news sources godi media maybe perceive things differently long buddy mysogynistic views lol coz dont agree facade helping women coddling im mysogynist person specifically agree real social justice warrior ironically youre one whos actually mysogynist supporting schemes patronises women instead actually empowering also country actually empowered women ever done something stupid shameful empower women also get rid dumb support political part rather ideology",
    "light_cleaned_title": "Milk for family, tuitions for children: What saving on bus fare could mean to women in Karnataka",
    "light_cleaned_selftext": "> As debate rages on 'financial burden' over welfare schemes deemed as 'freebies', studies and activists insist Shakti scheme will improve women's participation in social, economic and political activities. For a certain section of the society, saving Rs 2000/- per month translates to buying milk for the family or being able to afford tuition classes for their kids.",
    "light_cleaned_comments": "All civilised countries promote healthy living by giving welfare. America, Canada have food stamps for poor, China also has midday meal scheme and welfare, only in India do these Brahmin baniya scums mock the poor for getting welfare. Welfare as a concept is mocked by RW in other countries too. This is not an exclusively Indian behavior. I have noted similar behavior among supporters of Republican party in the US and supporters of Conservative party in the UK. While we are on this topic, I will urge all the armchair economists to watch the video linked below. Warning: this is not a lunch table politics grade video, it's lengthy, dense with data -- Petrol prices have been increased by 2, diesel by 1. Property tax will be raised by 17%. Electricity rates are already raised by and will be in effect from 1 April (in retrospection) All that money saved from free bus ride will be spent on rising bills. It can be a burden or an empowering scheme for women. It depend on how much the government can spend without burdening the budget. If government have enough money to spend on welfare than it should definitely do so. mard : mai madarchod hu jo yaha aaya BTW for food stamps u need to wait in line. For people trying to come out of poverty, this is often a collosal waste of time that could have otherwise been spent on productive endeavours. Direct or indirect cash transfers on the other hand also gives the added benefit of time management to the targeted group. That's what freebies do. It's always damage the pockets of middle class. I wish there was some of this both genders. Why the fuck should I pay for bus rides when my friends can go for free and pay the same fucking taxes that I do? India also give free food rashan. But you give 200 unit free and and even one unit more than 200 and pay even more unit than pay full bill. And add to that now per unit charges has been increased by 2 rupees. So whom does this freebies benefited. Get your vote and than take even more money out of your pockets. Give free buses to women and than increase price of petrol by 2 I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride? They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation.. The MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. No MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right. It’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed. I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride? They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation.. The MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. No MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right. It’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed. I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride? They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation.. The MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. No MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right. It’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed. I don’t get the outrage, these buses run on schedule. They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride? They can utilize the money saved for other essential needs, which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation.. The MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Additionally, the prices at legislative canteens are significantly lower compared to market rates. The expenses incurred during a single visit or election rally by a prominent figure like Prime Minister Modi amount to crores of rupees. All of which are paid through by our tax money. No MLA/MP is giving up on these privileges to save money for the Govt, but they all get really pissed when the poor citizen gets some privileges. It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right. It’s like in the olden days when the landlords and upper caste Brahmins owned all the lands and enjoyed the all the luxuries but got really pissed if one of the poor people ever dared to ask for some basic needs. The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed. That's( the fact that most of the right is against social welfare across the world) true, but certain polices like the NHS are supported by both the left and right in the UK afaik. You are talking as if the rates were not already rising and its purely because of freebies. It’s okay to criticise but come with at least a valid point so that people take you seriously [Approved by BJP in March, implemented by Congress in June](https://thesouthfirst.com/karnataka/approved-by-bjp-in-march-implemented-by-congress-in-june-electricity-to-cost-more-in-karnataka/) BJP raised the electricity bill, you should’ve questioned them when they signed and approved the bill. >All that money saved from free bus ride will be spent on rising bill. How do you figure? Unless you’re using more than 200 unites of electricity per month you won’t be charged for domestic use. Why won’t you question the freebies that are being enjoyed by our MPs/MLAs? They get free transportation, accommodation, private staff etc. A single rally by Modi costs crores. All this is paid via tax payers money. The luxury tent that Modi used while visiting the Odisha accident site was paid via tax payers money. Nobody questions that but everyone’s outraged when the tax money benefits the tax payers. Did you know that well developed nations provide free universal healthcare for their citizens via their tax money, they don’t call it freebies. It’s considered a fundamental right. Question the freebies given to the Babus. Consider it like this, among a married couple the husband has to pay only his fare or a father of two daughters doesn’t have to worry about transportation charges for his daughters education. Men will indirectly save money as well. > civilised Developed rich countries. FTFY. Nah bhau, it's only you. But still, that’s just a few men who are the heads and sole providers of their families. What about the men who aren’t, the bachelors interning at a startup or college students who’ll be using the same transport as their female counterparts. Still pretty unfair. What are your thoughts about OPS? That's NOT how this works... India ALREADY has very big welfare schemes that dwarf most western schemes in scale and reach. However that's the EXACT reason why this country has to have these schemes, these schemes snatch money away from infra and other important things which would DIRECTLY benefit poor people by ACTUALLY giving them jobs rather than making them leech off the state. Also not to mention that the CULTURAL tendency there is to NOT accept state help, rather than what is here that every one thinks they're entitled to welfare. >This is not an exclusively Indian behavior. Lol Indian RW even if that's a thing LOVES welfarism more than any of these people >They run their routes regardless of passengers being present or not, so what’s the issue if women get a free ride? So by the same token why shouldn't men get one too? >They can utilize the money saved for other essential needs, which ultimately circulates back to the government. That's kinda what's called broken window economics >which ultimately circulates back to the government. Moreover, such a policy can create opportunities for employment and education for those who were previously unable to access them because they couldn’t afford transportation.. Transportation (as far as the money aspect of transportation is concerned) has NEVER been the primary cause for women dropping off from education or employment, it's a more social phenomenon. Also most lower income household have women working it's much more of a middle class issue. >The MLAs and MPs enjoy various complimentary luxuries, including luxurious transportation, lavish accommodations, and personal staff. Rescind them. >It’s our tax money ffs, well developed nations provide free healthcare for all via tax payers money, do you hear them denouncing the free healthcare as “freebies”, it’s their right. Exactly and we deserve BETTER than some random scheme which is seems only intuitively beneficial and no one knows how it'll fair in the grand scheme of things. Also India has WAAAY bigger welfare scheme than ANY country in the west has, given that 800 million people are just living off of free ration (and that's just one big example) when you compare it to developed nations where the ACTUAL destitute people are negligible and most of it is people paying taxes which gets BACK TO THEM. >The same poor person whose hard work resulted in the luxuries these feudal lords enjoyed. And the only thing THESE schemes does is to replace that lord with the state Stop lying. India spends way too less on welfare compared to even China and Japan, and these countries also don't spend much on welfare. Read up economics instead of showing off your ignorance here. You are either a victim of Brahmin bania propaganda or you are also a malicious businessman. No wonder these people are hated everywhere in India. It is a myth that welfare takes money away from Yes, everyone is entitled to welfare. The state exists for taking care of its population. Deal with it. >Stop lying. Lying? >India spends way too less on welfare compared to even China and Japan, and these countries also don't spend much on welfare Lol what a joke...these are mid income and high income economies respectively, also none of them have programs that are as ubiquitous as India's which is a low income economy. India gives direct benefits to 800 million people which is like more than 50% of the population which is supported by whom? >Read up economics instead of showing off your ignorance here. That's something you should do first. >You are either a victim of Brahmin bania propaganda or you are also a malicious businessman. No wonder these people are hated everywhere in India. How about well informed? >Yes, everyone is entitled to welfare No no one's ENTITLED to welfare, you aren't ENTITLED to anyone's money >The state exists for taking care of its population. Deal with it. Lol taking care by using the money that someone else earns to give it to someone else? That's making leeches not helping. > That's what freebies do. It's always damage the pockets of middle class. Middle class is happy with ancient culture and superpowerdom. It is under attack by right wing parties in UK too iirc. It is just it has proven itself to be better than alternative to a degree that even right wing voters support it and right wing parties can't directly go after this so they are trying to go after it indirectly. If you are wealthy and want best return on your investment then housing and health care are the best option. Demand is never going down and increases prices just directly increases your profit. 100%. There is no public accounting for the govt spending for ruling class. The Japanese PM's son had a party at the official residence, and the son had to resign from his job to save his father's career. Yeah, that's unfortunate. Hopefully the British will somehow find a way to save the NHS >Rescind them Maybe you should direct your energy towards that cause instead of focusing all your energy fighting against schemes that benefit the poor. >against schemes that benefit the poor. Lol coddling and throwing freebies isn't BENEFITTING the poor, had it been we'd be definitely not be in the shit show we're right now. Also calling this a pro poor scheme seems so disingenuous....like aren't men poor too? You got your math wrong, few men are bachelors while the majority are heads and sole providers of the family. Also except the free bus rides the other schemes like free electricity, monthly allowance for unemployed graduates and free rations benefit the men directly. While the bus rides may not benefit men directly it still benefits them indirectly, so it’s not like men are being neglected. Let me guess, you watch a lot of Godi media right? All nations have schemes that benefit the poor, they don’t call them freebies, it’s a fundamental right. Will you dare to question the freebies enjoyed by the politicians? You will also bend over backwards to explain the tax benefits given to the billionaires. Men do benefit from the free bus rides - the husband doesn’t have to worry about the bus charges of his wife, a father doesn’t have to worry about the transportation charges for his daughters, a wife who earlier couldn’t go to work because of the transport expenses can now do so and help provide for the family which in turn will reduce the burden on the men. Also the govt has introduced other schemes as well, like free electricity, free rations, unemployment benefits for graduates etc which will directly benefit the men. Get rid of your misogynistic views and get your news from sources other than Godi media, maybe your perceive things differently then. So long, buddy. >Let me guess, you watch a lot of Godi media right? Indians and their black and white narrative lol. Does the godi media not praise the freebies given by the Modi govt? Also it's ironic you thinking I'm brainwashed by media when you'd probably be supporting most of the policies that Modi govt has brought in but you can't praise them since you hate them....NOT their policies. I am not a supporter of either. >All nations have schemes that benefit the poor, they don’t call them freebies, it’s a fundamental right. No they DON'T consider it a fundamental right in fact it's considered one in India only which is why this country is still a poor economy, also those countries DON'T have it for poor people, it's more of an investment they PAY taxes, they get benefits that's all. It's not like more than 50% of the population LITERALLY depends on their basic meals on less than 50% of the population. >Will you dare to question the freebies enjoyed by the politicians? What makes you think I won't? I literally said they should be rescinded to which you also replied to. >You will also bend over backwards to explain the tax benefits given to the billionaires. Ok? So? Tax benefits to corporation is literally the LEAST this country can do to attract investments coz other things don't seem to be anywhere near resolution, it's THOSE tax benefits that are able to generate jobs which in turn pay for the welfare schemes you so eagerly want. So instead of cursing them you should be praising them. >Men do benefit from the free bus rides - the husband doesn’t have to worry about the bus charges of his wife What about his OWN bus fare? And what makes you think women don't have their own money? Infact on lower income households MOST women are also employed, so they mostly have their own money with them so no that's NOT a benefit. >a father doesn’t have to worry about the transportation charges for his daughters That's NOT a reason why many don't go to school also it would have been more helpful if there was BETTER infrastructure so that they can go to school with lesser fare coz there would be more buses. >a wife who earlier couldn’t go to work because of the transport expenses can now do so and help provide for the family which in turn will reduce the burden on the men. You surely aren't aware why women are underrepresented in the work force do you? Never ever has transportation cost been the issue for employment. Also what about a poor person who's not married? There's plenty of them too aren't there? >Also the govt has introduced other schemes as well, like free electricity, free rations, unemployment benefits for graduates etc which will directly benefit the men. Not the women? Also by counting these ridiculous freebies you're not helping the case. Who's gonna support these freebies? And till when would someone pay for you? People need tangible infrastructure and changes that ACTUALLY reflect the amount of taxes they're paying not these pacifier style freebies to shut up the babies from crying. >Get rid of your misogynistic views and get your news from sources other than Godi media, maybe your perceive things differently then. >So long, buddy. MY mysogynistic views lol. Just coz I don't agree with this facade of \"helping women by coddling them\" I'm a mysogynist? So a person should SPECIFICALLY agree with you to be a real social justice warrior? Ironically YOU'RE the one who's ACTUALLY mysogynist by supporting schemes that patronises women instead of ACTUALLY empowering them. Also NO country that has ACTUALLY empowered women has ever done something this stupid and shameful to empower women. And also get rid of your dumb support for a political part and rather have your OWN ideology."
}