{
    "id": "17637k5",
    "title": "First ship arrives at Vizhinjam port in Trivandrum carrying mammoth cranes from China",
    "url": "https://www.telegraphindia.com/business/first-ship-berths-at-keralas-deep-sea-vizhinjam-port/cid/1972859",
    "selftext": "News: The first ship that arrived at Vizhinjam port here carrying cranes was given a water salute by the tug boats which pulled the vessel into the Rs 7,700 crore deep-water international port on Thursday, official sources said.\n\nAdani is building India’s first and largest container transshipment terminal in Trivandrum, the capital of Kerala. This port is predicted to transform India’s maritime trade and economy.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1697104573.0,
    "convurl": "https://external-preview.redd.it/cKN6s5gMNWJVhQ3DuHXaCQ1zIZEtCDvZQKgk0yvb33A.jpg?auto=webp&s=8db585a0ac7ba3d9da98f1edfaab2c7064a1942d",
    "comments": [],
    "cleaned_text": "first ship arrives vizhinjam port trivandrum carrying mammoth cranes china news first ship arrived vizhinjam port carrying cranes given water salute tug boats pulled vessel rs crore deepwater international port thursday official sources said adani building indias first largest container transshipment terminal trivandrum capital kerala port predicted transform indias maritime trade economy ",
    "cleaned_title": "first ship arrives vizhinjam port trivandrum carrying mammoth cranes china",
    "cleaned_selftext": "news first ship arrived vizhinjam port carrying cranes given water salute tug boats pulled vessel rs crore deepwater international port thursday official sources said adani building indias first largest container transshipment terminal trivandrum capital kerala port predicted transform indias maritime trade economy",
    "cleaned_comments": "",
    "light_cleaned_title": "First ship arrives at Vizhinjam port in Trivandrum carrying mammoth cranes from China",
    "light_cleaned_selftext": "News: The first ship that arrived at Vizhinjam port here carrying cranes was given a water salute by the tug boats which pulled the vessel into the Rs 7,700 crore deep-water international port on Thursday, official sources said. Adani is building India’s first and largest container transshipment terminal in Trivandrum, the capital of Kerala. This port is predicted to transform India’s maritime trade and economy.",
    "light_cleaned_comments": ""
}