{
    "id": "1401390",
    "title": "The NDA government has become experts in superficial development which attracts headlines. Kavach system that might have prevented the accident required 1L crore investment to be installed in all the Locos, tracks of our country. A mere 500 crore was spent on Kavach system.",
    "url": "https://www.reddit.com/r/india/comments/1401390/the_nda_government_has_become_experts_in/",
    "selftext": "Vaishnav Rail minister said that “the PM inspired the engineers of India to create a Anti- Collision system” . He failed to mention that it needs 1lakh crore investment before the the entire system becomes protected. \n\nVaishnav has been advertising (Train 18) Vande Bharat and Gobhi went to flag off each Vande Bharat. \n\nThe thing is Vande Bharat ticket is almost identical to the flight cost and it’s a niche product that only a small set of the population can use. \n\nThey failed to upgrade the other trains while focussing exclusively on Vande Bharat while 99% of the people use the older trains. \n\nLoco pilots were made to operate trains for more than 12 hours at a time. Most of the locos in India except the WAG-12 made by Alstom and WDG-6G have toilets . Some of the WAP-7 Locos have urinals. \n\nhttps://www.timesnownews.com/business-economy/industry/indian-railways-plans-big-infra-push-rs-1-lakh-crore-investment-on-developing-procuring-assets-says-report-article-90131975/amp\n\nhttps://m.timesofindia.com/city/agra/over-3-lakh-posts-lying-vacant-in-indian-railways-rti/amp_articleshow/98344988.cms\n\nOther sources: Ravish Kumar - Senior Journalist",
    "flair": "Politics",
    "score": 910,
    "num_comments": 141,
    "created_utc": 1685853197.0,
    "convurl": "https://external-preview.redd.it/RUGGqTYbjxeflelgGjfYHUvQr1Ym-NDp_7SBOvITfxU.jpg?auto=webp&v=enabled&s=e011923e60cc391c4653c4eba7f4d838ffe08a9f",
    "comments": [
        "Kavach could not have prevented this accident. Kavach is for locomotives i.e. it adds safety features like collision avoidance,  signal passed at danger, dead man switch, in cab signalling etc. However, this applies to trains on same track. Fouling of adjacent track cannot be signalled by Kavach. \n\nThe current accident was according to reports caused by the circumstances as under:-\n\n1. There is a feature called interlocking which synchronizes points and signals.\n\n2. This relies on a complex arrangement of track and signal circuitry. The display is seen by the local station master on his panel and on his order and his actions on the panel, the points are set. \n\n3. It is disabled at times for maintenance and repair. At this time a Caution Order (CO) is issued to loco pilots to slow down and be aware. Speeds are low such that trains can halt easily if required. \n\n4. Once maintenance is complete, the CO is removed, the interlocking enabled  . \n\n5. In the specific case, some work was carried out. While enabling the interlocking some connections were wrongly given. \n\n6. This resulted in the signal indicating that the train should proceed on the main line but point was set to the loop line. \n\n7. Since there was no CO and point indicated run through the Coromandel was at full speed (128 kmph).\n\n8. The point set made the train cross over to the loop line. There was a goods train on the loop line.\n\n9. Switching at 128 kmph into a loop line where the switch speed  is meant to be around 15-30 kmph will result in derailment. The Coromandel derailed and also hit the goods train.\n\n10. At that speed and due to the impact derailed coaches fell on the adjoining tracks.\n\n11. The Howrah bound train was passing by at MPS at the same time. The derailed coaches hit the train and also caused a few coaches of the Howrah train to also derail. \n\n12. Deaths were higher on account of the impact. \n\nNothing is fool proof, fools are ingenious",
        "Just like they inaugurate incomplete projects .",
        "That is a lot of conclusions before the investigation has even begun.",
        "And the best part is people will believe his shit.\n\nCladestine government apologists, now kavach system wouldn't prevent collision.",
        "Remember gas cylinders? Everything these guys do is for PR and newspaper headlines. Nothing after that.",
        "Kavach or no kavach, are you saying there was no way this could have been prevented?",
        "India should have built this system long ago. I don't know what they have been doing for this many years. We still got the majority of those shit trains. The infrastructure this government is doing should have been done 10-20 years ago.",
        "Any source? Or trust me bro?",
        "source: r/trustmebro \n\nPlus Collision avoidance system wouldn't have prevented a collision.\nThe chaddi infestation here is complete.",
        "Event jivi",
        "What reports?",
        "I mean he is correct till pt 3.\n4th and after is semi bro science.",
        "[RDSO Specification](https://www.google.com/url?sa=t&source=web&rct=j&url=https://rdso.indianrailways.gov.in/uploads/File/System%2520Requirement%2520specification%2520of%2520KAVACH.pdf&ved=2ahUKEwjW24aziKn_AhWA8jgGHfKuDXYQFnoECA4QAQ&usg=AOvVaw0nbxk4e7wijS4Wtdzuk2uo)\n\n\nIf you actually bothered to read before spouting invective,  you would have understood the sequence of events and why Kavach wouldn't have worked in this case. \n\nAlso for your disbelief in current dispensation, you seem to have a childlike belief in the statement of the same minister who spouted nonsense in the media about kavach. Kavach is not a magic bullet that can guard against every eventuality.",
        "Source for what ? The [sequence of events](https://www.dtnext.in/amp/news/tamilnadu/coromandel-express-took-loop-instead-of-main-line-hit-goods-train-716534) ? [Kavach](https://www.google.com/url?sa=t&source=web&rct=j&url=https://rdso.indianrailways.gov.in/uploads/File/System%2520Requirement%2520specification%2520of%2520KAVACH.pdf&ved=2ahUKEwjW24aziKn_AhWA8jgGHfKuDXYQFnoECA4QAQ&usg=AOvVaw0nbxk4e7wijS4Wtdzuk2uo) ?",
        "[Newspaper](https://www.dtnext.in/amp/news/tamilnadu/coromandel-express-took-loop-instead-of-main-line-hit-goods-train-716534) reports, [tweets](https://twitter.com/KunalGhoshAgain/status/1664971117088620544?s=20)\n\nJust listed two of the list. I'm not writing a position paper.",
        "The source you shared talks about \n\n1. Train travelled on loop line when it was expected to go on main line.\n\n2. They don’t know why.\n\n3. None of the safety measures trialed in other parts of the country was active in this route.\n\nSo is this article dated? Where did you find the rest of the details ?",
        "Any source for this BS comment ? Are you aware of facts of signalling or loco operation ? I am because I am an enthusiast , please visit this [site](www.irfca.org) and read the faq and discussions and then debate with me. \n\nThe facts are that Coro crossed into the loop line at 128 kmph. No sane loco pilot will attempt a loop line switch at that speed. Turnout speeds are 15-30 kmph. If signal was red, the LP would have hit his brake. If X signal is red, prior signal would be yellow, there is an LP, ALP and guard , were they all asleep ? The track geometry at the station had two loop lines to the side and the two main lines running parallel to each other. Derailment will foul the adjoining track. The other train could not see the derailed train because it happened too near, otherwise the other LP would have hit the brake. Please read the RDSO specification of Kavach before spouting theories.\n\nAlso read my other comments on IR and decide whether I do possess any knowledge.",
        "Read the literature and debate. Please visit this comment after 6 months and see if anything needs to change.",
        "Although the answer is nicely composed. I don't think conclusively such things can be said as of now.",
        "But kavach can't be portrayed, flaunted or inaugurated. So what's the value proposition for the supreme leader to spend on it?",
        "No, he is correct about Kavach, it isn’t designed for such a scenario. Kavach is primarily designed to stop collisions between 2 trains on the same track. In this case, the 2 passenger trains were never technically on the same track. \n\nA hypothetical situation where Kavach would have been effective is if Coromandel Express was switched to the wrong track, on to the path of the oncoming Yesvantpur Exp. then Kavach would have detected 2 trains on the same track and automatically stopped both trains before they could collide. \n\nBut here, the bogies of Coromandel Express fell on the path of the oncoming Yesvantpur Exp, Kavach couldn’t do anything about that.\n\nThe rest of OP’s post is plausible speculation, but he is absolutely correct about Kavach.",
        "So if we make it simple then a analogous example would be: You go to a bike garage to get your turn indicators repaired. The mechanic repairs it but when connecting the wires he interchanges the right with left and vice versa. So when you signal for a right turn the left one blinks.  Something like that happened in the relay control system that night. Some one made a mistake and connected the wires to the wrong relay so it was indicating one thing in the control room but switching some thnge else. My worry is, if this is that critical then they must have multiple checks and balances to ensure galti-se-mistake does not happen.",
        "There is  always a way in electronics. You cannot put hundreds of lives on risk and make thousands of kilogram of flesh and steel with no surety of safety.",
        "I mean even this is true, it begs the question who allowed such a huge risk to remain? How are we operating trains with the risk that hundreds could die due to routine system failure or maintenance?",
        ">needs 1lakh crore investment \n\nModi will only inaugurate. The government never allocates funds to go to the next step. He inaugurated AIIMS in Madurai 2 times and still they don't have a building. Now they are running AIIMS in government medical colleges until the building is completed.\n\nI can inaugurate a mission to Pluto, take pictures and advertise in the news. But don't do anything after that... People forget anyway.",
        "Yeah, fuck physics am I right. No matter what kind of fictional electronics you can't stop a train that goes 130kmph with little to no time. At the moment leading theory is exp went on to loop line which is inevitable derailment and then there are 10 different theories going on, until official report comes no one knows what the issue it is.",
        "I had just learnt about Kavach system, as I was preparing for exams",
        "Where are you getting this 20 minute? Eyewitnesses have said that the collision happened within minutes of the first derailment.\n\nThe accident happened right next to BNBR Station, so the station master would have had enough time to send a signal to all trains in the vicinity if the gap was 20 minutes!",
        "Well, you are misinformed then. Initially it felt that Kavach could’ve prevented it, but the trains were never even on the same line until the collision took place.",
        "You are right about the physics that a train going at 130 cannot be stopped in a short distance without causing injuries. \nBut, that does not mean electronics won't help. From what I understand the issue here is the incorrect diversion of the train to the loop line. Electronics can help eliminate this error, human or not",
        "The problem of India’s signaling system which is primitive compared to international standards. A big problem, given the unprecedented size of our railway network.\n\nIf all the Vande Bharat money was invested in upgrading the signaling infrastructure then it would have improved the railways for everyone using the service. Less delays and tighter frequencies would let us add more trains and scale the system more safely and affordably. And of course, we wouldn’t have had to see this day.",
        "By the end of the day humans are the ones decide how electronics work. In short shit happens.",
        "So, we let hundreds of people die just because shit happens? \n\nMy thoughts may be influenced by my line of work where I see 400 deaths each day, most of them due to human errors. That is why we work on systems with the basic assumption that humans make mistakes and it's the system that should protect humans from themselves. I am sorry,  but 'Shit happens' is never an acceptable answer to me.",
        "One can technically build the accident proof machine but the issue lies mainly is it's price, availability and ability to operate. Shit happens is the answer when the solutions doesn't meet the three requirements.",
        "Kavach is effective only in stopping head-on collisions. This was a signal failure.",
        "Wasn't there a preliminary on-site report report released by the railway ministry? Could you link to that?\n\nThank you for your detailed answer.\n\n\"preliminary inspection report by five Railways supervisors\" as referenced [here](https://theprint.in/india/governance/preliminary-inquiry-into-odisha-train-crash-points-to-possible-signalling-error/1610210/) and [here](https://www.livemint.com/news/india/odisha-train-accident-mistaken-signal-likely-to-be-reason-behind-mishap-reveals-probe-11685788650787.html)",
        "If the loco pilot sees an obstruction he would brake. Also the first few coaches would have the impact otherwise since the other train was in the opposing direction.  Logically, this 20 minutes statement is factually wrong and impossible",
        "You are generally correct. \n\nThis was already flagged in an earlier [report by a SWR official.](https://m.timesofindia.com/india/odisha-train-accident-official-flagged-flaws-in-system-warned-of-disaster/articleshow/100736368.cms)\n\nI don't know the SOP for the disconnection and reconnection so don't know whether it was systemic failure (possibility not accounted for in system) or a human error (checking was faulty).",
        "It's not a \"who\". It's a \"what made the system fail\", and blaming it on individuals is the wrong way to go about fixing things.",
        "Two things can be true at the same time. You have valid points but so does OP.\n\nMaybe Kavach wouldn’t have helped in this instance (even likely assuming the sequence of events you’ve talked about is true. Kavach deals with a very specific type of risk), but OP’s points are also pretty accurate.\n\nThe government has been prioritising fast trains over safety and even necessary upgrades. Most Railways senior officers and even politicians will agree, indeed they’re saying this quite openly on TV.\n\nSafety also costs money. Kavach is expensive but weirdly it’s also one of the cheapest & most basic systems out there. Does Railways want to spend more? Can they spend more? \n\nIndia needs a proper debate on the value of Indian lives, and how much money the Railways needs to modernise. And yes, how much passengers should pay — the old trick of using freight rates to subsidise passenger traffic has limitations beyond a certain point.\n\nAnd in an inflation-heavy time, raising freight prices will be unpopular.\n\nAnyhow, the odd showpiece train aside, most of the Railways network is in desperate need of new investment and maintenance. Again, speak to senior Railways officers — this isn’t a new thing by any means.",
        "The risk was [flagged](https://m.timesofindia.com/india/odisha-train-accident-official-flagged-flaws-in-system-warned-of-disaster/articleshow/100736368.cms) by an official. But , without knowing the SOP I won't comment .",
        "I was commenting only on two things, Kavach and timeline of the accident. \n\nHowever , without the politics (which drives the agenda), railway officials are safety conscious and do take safety seriously. It's the current dispensation's proclivity   to announce grand schemes without further ground work that is a problem.",
        "It's not yet in public domain officially.",
        "There is a way. Invest in more modern train and track control equipment.\n\nWhat no one says about Railways in India is that the fundamentals are very weak: track upgrades have not been done in decades in some routes. The control equipment is decades old.\n\nThe government’s priority is glitzy trains. So even less money is going to the fundamentals.",
        "“Fictional electronics” … you don’t need fictional electronics to have redundant control circuitry.\n\nAnd you don’t need to fight physics — you remove the need for fighting physics by using electronics and signals to warn the train / controllers well in time. And even shut down trains / tracks as necessary.\n\nRedundancy is a well known design principle in control systems, electronics and computers. Eg if maintenance is being done on one control circuit, don’t touch the other and it’ll work as designed. The key is, you never touch both systems at the same time.\n\nBased on reports of what caused the error, redundant controls might have helped here, by ensuring that maintenance on a switch didn’t cause a catastrophic misrouting of trains.\n\nThe problem for Railways is that redundancy is expensive. Especially at IR’s scale.",
        "You’re right, the knowledge & professionalism of senior IR officers is really something— you can tell how much depth they have if you’re lucky enough to speak to some.\n\nI’m fully conscious that the budget & direction-setting isn’t in their hands — they can do little when their bosses are in cloud cuckoo land. It’s sad.",
        "We still don't know the full picture, there are all kinds of conflicting reports flying around and even after 36hrs they can't build timeline. We have to wait investigation report to make any kind of statements.",
        "i just read now on twitter that now the minister is blaming someone did 'this'",
        "You may want to inform our railway minister and his toadies. Because they are planning to bring the perpetrators to justice.",
        "Ha ha.",
        "We are living in the information and digital age and yet the govt can't be bothered to buy a production ready collision avoidance system.\n\nThis can be easily built even by a colleg grad ffs. We are a country of morons whose priorities are fucked up. \n\nIt's a simple optimization problem from operations theory. We can build an AI system for facial recog and do many other amazing things with AI tools and we can't install a 3000rs GPS chip in a train. That's fucked up on so many levels. If you know the position of every train at every single time, you can solve the optimization problem very easily. This all could be very easily done.\n\nSo annoying. Poor lives don't matter in this country. Fucking showoffs. Assholes.",
        "SOP for what? The same report said the warnings were ignored because Mr Minister wanted to focus on revenue increase and Vande Bharat launches. \n\nThis is not some classified military intel. It is and should be public record.",
        "Then it's a shit system , if your system can't identify a fucking boggy on railway track in this age , it's shit",
        "Sure. But many tv channels are reporting that the government’s saying the root cause has been identified — an issue with electronic interlocking.\n\nAgain this could be wrong or a premature conclusion, but if it turns out to be an electronic issue, it’s worth noting that redundant systems do help **reduce** the risk of catastrophic failures.",
        "SOP for bypassing the interlocking and reinstating it. There will be one, but though not a secret won't also be public knowledge. Nothing in railways is done without a comprehensive rulebook. \n\nAn accident occured due to a set of actions taken by n persons. Were the actions exactly as per the SOP ? If yes, then the SOP is faulty, if no then it's a human error.\n\nI dont have the SOP so I can't conclude either way. I'm not an apologist for the government. I have commented based on my knowledge and understanding of facts.",
        "Stopping a train with little to no time is mechanical. I said electronics.",
        ">Vaishnav Rail minister said that “the PM inspired the engineers of India to create a Anti- Collision system” \n\n\nGreat that he appreciated mms. Kavach development started in 2012 and deployment in 2016.",
        ">While enabling the interlocking some connections were wrongly given.\n\n\n>Nothing is fool proof, fools are ingenious\n\n\nWhat you're arguing for is a distemper that verifies proper working,  including sensors that report whether mechanical switching of tracks has actually happened as designed. \n\nThere are simple ways to deal with these things, but they need to be baked into the system, not implemented locally by someone not trained to engineer such systems.",
        "Exactly. It's funny how people eager to defend the government end up pretending as if we're in the 16th century, not 21st.",
        "Why are you so eager to make excuses? Are you trying to defend the government? Yes, humans make errors. And therefore when putting together critical systems, you make them redundant, and you have multiple levels of checking and cross checking. \n\n\"Shit happens\" is an excuse for design and implementation flaw.",
        ">the issue lies mainly is it's price, availability and ability to operate.\n\nHow much did the bullet train, the statues, and the luxury trains competing with airplanes (for ticket costs, not speed or convenience) cost, again?",
        ">The government’s priority is glitzy trains. So even less money is going to the fundamentals.\n\nExactly. Criminal negligence of this government running behind publicity is costing lives. And yet, there still are idiots even in this thread making excuses.",
        "The goverment has already declared the cause without waiting for investigations.",
        ">But here, the bogies of Coromandel Express fell on the path of the oncoming Yesvantpur Exp,\n\nAnd why did that happen?",
        "Do follow your own advice.",
        "The main perpetrators that need to be brought to justice are the railway minister and his boss. Executive sets the priorities, and their priority was luxury trains, not safety.",
        "Are you saying that you think the man who flashed the problem is a liar? Surely, he knows the SOP when saying it wasn't followed?\n\n>In his report after the February 8 incident, then PCOM Hari Shankar Verma wrote: “The Hosadurga station incident indicates that there are serious flaws in the system and contravenes the essence and basic principles of interlocking. **The electronic signal maintainer (SEM) attempted to rectify the signal error after bypassing rules and procedures**. ”\n\nThis sounds like a jugaadu way of fixing problems in safety systems by bypassing them to keep the trains running on time to help the fuhrer get publicity.\n\nThis is not human error. This is deliberate, criminal sabotage orchard from the top.\n\nIndividuals at local levels can do stupid shit like this on their own, but once the issue is flagged, it has to be treated like a three alarm fire right from the top. The fact that the leadership was busy inaugurating luxury trains instead of dealing with this danger indicates that they have no interest in fixing the problem.",
        "I agree with first part of your comment. \n\n>And yes, how much passengers should pay — the old trick of using freight rates to subsidise passenger traffic has limitations beyond a certain point.\n\nThis kind of thought process comes from thinking that government should run for profit business, rather than act a a provider of services. Railways need to facilitate transport, and through that, boost the economy. When people can afford to travel, they earn more (by getting to their place of work), spend more (by visiting their hometowns, friends, families, or going out on vacations). Freight rates don't need to subsidise entirety of human transport. Our taxes can bear the rest of the burden. That is money spent better than bullet trains that the idiot narcissist admitted no one will take after the novelty wears off, and the fugly statues that will never generate enough business to justify their existence.",
        "it would have prevented collision of coromandel express with goods one, which in turn would have prevented YPR express train collision.\n\nGod, this accident is hitting me hard considering I used to travel quite often in coromandel express.",
        "You can run public transport, including trains, on a no-profit basis including subsidies. Many countries do. Eg France and Germany have fairly well run, safe, networks. Even Chinese Rail — it’s quite something. It’s the extent of subsidy and extent of overall funding that’s the issue. \n\nThe issue all railway systems have to deal with is: railway workers need raises. Equipment needs upgrading. Tracks need maintenance. All this costs money. So now you must ask, can we afford to increase subsidies? Or should passengers pay more? Note that many do both. Indian Railways hasn’t increased prices commensurately though.\n\nAnd Indian Railways isn’t adequately funded from a safety perspective. No fare rises, not enough subsidies = recipe for disaster.\n\n> Railways need to facilitate transport\n\nThe issue in India is that this “railways is for the common man” has been used as an excuse to justify terrible infrastructure. Read that again, this time between the lines. Railways is for the **common man.** That allows ministers to ignore safety. Because hey, if people die, we’ll just pay them 10 lakhs and move on. Better than spending lakh-crores on actual safety improvements. Think of all the bullet trains and statues we can build with that.\n\nNote: I’m not against helping the poor. But perhaps targeted subsidies might be better, eg an online system for 100% cash back if you have a validated job interview offer. Or a programme that helps migrant labourers.\n\nPS. Many railway officials have noted that there’s a different (but related) area that Railways need to act upon: it’s too easy to board a train and “grab” reserved seats. Check out [these Coromandel photos from *before* this accident](https://twitter.com/zoo_bear/status/1664880215820992515). Massively overcrowded compartments are a massive safety risk *and* and injustice to paying passengers.\n.",
        "The fact kavach wouldn’t have worked for this is irrelevant. They need to spend money on making it safe: doesn’t matter if it’s kavach or armour 2.0. \n\nIn fact they should spend the bulk of their budget on ensuring the tracks and systems are safe and upgraded, before more exciting things like high speed and bullet trains.",
        "Where have I commented on the veracity of the SWR official ? In fact he's telling the truth to the best of my knowledge. But , we only have a few newspaper reports. The letter would have listed out the exact issue which I haven't seen.\n\nAlso you are attributing to malice what should actually be attributed to stupidity. When a signal is faulty it turns red and until it's rectified no LP will cross it automatically. However , the station master can give written authority to proceed. This is a lot of paperwork which some idiots are short circuiting . I would agree that this is serious and must be acted upon, but would not call it a conspiracy. \n\nShould this have been acted upon ? Undoubtedly yes. But the current dispensation wants grandiose achievements and not simple successes. They neither know nor care about the actual issues. Even the pet project VB is in shambles. The QC of the out turned rakes is partial. So far fortunately, the failing items are interiors so it's not caught attention.",
        "No [need](https://indianexpress.com/article/india/odisha-train-accident-coromandel-entered-loop-line-after-green-signal-railway-board-explains-8645302/) to wait that long.",
        "Can we detect what path will be taken - yes\nCan we detect any vehicle coming towards the section of path above - yes\nCan we detect speed of above vehicle - yes\nCan  we force change in oath taken -yes\nCan decide out of the two possible paths (1st q) is going to be a less dangerous option -yes\n\n\nWhat I'm trying to say is that it is possible to automate what you feel is going against physics. Physics came into play when the train started changing tracks. Automation will come before that and stop that from happening. Of course there always will be scenario where even with automation in place death will happen, but that automation will still be better than not having one.. \nIn today's date anything can be automated. It is just about need and return of investment on the solution(plus develop ment n testing etc).",
        "\"Shit happens\" is the excuse of lazy and corrupt. Indian Railways can definitely design and implement a system which can detect trains in the vicinity of say a few kilometers and if something is off like say a stationary train or a derailment can warn the loco pilot and the traffic controller.\nIf someone very rich and powerful were to die in such a horrible accident,I am sure such a system will be implemented with lightning priority.",
        "Considering the cost involved, i agree with you..",
        "I'm not arguing anything. I'm simply stating the facts. The interlocking system should not be bypassed but it was . The point about fools is simply that mess ups are always possible.",
        "Kavach or not, this is a grave accident and the railway minister should quit taking moral responsibility for it like how it used to happen in the past.  \n\nInstead we have them passing the buck to various reasons and avoiding the responsibility of the problem and we have bhakts who behave as experts on why it happened!",
        "You write it hasn't been done in decades, which I assume are several decades, and you still blame the current government.  As I understand, the rail budget to improve infra has been increased continuously in the current regime. \nIn general, we , as citizens, have failed to ask for exactly what we want for years now, which has many reasons, such as poverty, lack of education, ignorance, etc.",
        "The focus on statues and showpiece trains is new, and completely on the current government. This is a 2nd term government and cannot go about saying “we inherited problems” forever.\n\nYes, underspending on safety isn’t confined to this government. But previous governments had excuses — they were much poorer and a lot of safety technology was not available or very new in the 1990s and early 2000s. Doesn’t absolve them, but *we can only hold the present accountable until someone invents a Time Machine.*\n\nThis government loves flashy inaugurations and doesn’t prioritise the deep infrastructure work that India (even with its current economy) can feasibly do. Let’s see if this accident wakes them up. I’ll put money on “no”.",
        "What? Trains dont even have gps on them to indicate where they are on the track?",
        "It does not make sense that an anti collision system does no work to prevent collision. It's still the same point that this government is all gas and no content if the anticollision system that is touted so much would not prevent this tragedy",
        "Because physics...?",
        "Exactly. And leaving optimization aside, the \"two trains on one track\" situation can be handled through basic software with 100% guarantee. To be doubly safe, (or save money,) they can install a detector at switches that registers a train going through.",
        "That train did not have enough time to break. It was signaled onto the wrong track at the speed of 128 km/s. It takes a 4-5 kms to stop a train moving that fast anyways. Breaking also has to be properly too, as breaking too hard can cause slack to derail the train in the first place.",
        "Absolutely correct!!!\n\nThe system goal must be collision avoidance .\n\nNot like if this , if this , if unknown then system will not work blah blah...\n\nThe system design must include all possible things which can go wrong .",
        "The kavach system is useless if 1 lakh crore is being spent but still cant meet its goal.  \n**The system goal must be collision avoidance .**\n\nNot like if this , if this , if unknown then system will not work blah blah...\n\nYou are fkn building 1 lakh crore system . The same track thing can also be achieved by a simple GPS based system.\n\n&#x200B;\n\nThink of it as a collision system , it must take into account everything which can cause a collision. If you make a system which works on several conditions for 1 Lakh Crore but it will only work if blah blah condition than its a useless BS system . Stop spending money and make something better. Simulate the rail condition and determine if current conditions could cause collision.\n\nDo not sleep , Continuously make the system 'fool' proof\n\nEverytime I have to book a ticket I only get via tatkal and I have to cancel main ticket which means I have to pay 200% of fare . And in return my sleeper coach if double crowded.\n\nWhere is the money going?  \nFull mis management and loot",
        "I am absolutely sure these fkn morons will bring a Pakistan angle, blame a muslim scapegoat.\n\nThe first step is CBI inquiry, morons this must be done by railway team not CBI.\n\nCBI is just a caged parrot ( as per SC), it will do what its master tell it",
        "It is the govt of mediocre ppl, supported by mediocre citizen who are angry at others for their own failures. \n\nImagine the guy who used to bullshit in project assignment interview. The govt is made of those ppl. Nothing against those students, but they should not be handed over the administration of the govt. \n\nBs about 5 trillion, 20 smart cities, bullet trains, gujrat model, corruption gone by banning notes etc etc. All bs.",
        "Right. I am reading reports that many of the safety inspectors posts are vacant. \n\nA rail minister should be pursuing budget for filling those posts and working on those things and not be bootlicking by saying the guy who doesnt know how the radars work, 'inspired engineers to build a system to avoid collision'.",
        "This is a great analysis. And more and more details should come out for why this happened.\n\nThat being said, it still begs to be asked while the system has so many issues, the one that you pointed, CAG report says there are many issues, many of the safety inspectors posts are vacant, despite all that, why was the rosy picture being painted that everything is super safe, and kavach as the advertisement, especially if its not even installed in most of the trains. Its fair to ask that question, and press on all safety points of the rail system and not just the one that caused this accident.",
        ">Indian Railways hasn’t increased prices commensurately though.\n\nAre you claiming that they haven't increased commensurate with the median earnings?\n\n>And Indian Railways isn’t adequately funded from a safety perspective. No fare rises, not enough subsidies = recipe for disaster.\n\nCorrection: demanding that railways start making profit or get privatised has led to massive reduction in subsidy in real terms while increasing higher paying seats: general compartments getting replaced with ac compartments in existing trains, vande bharat trains competing with airlines (for fare, not for time taken or convenience), no regards for safety. \n\n>The issue in India is that this “railways is for the common man” has been used as an excuse to justify terrible infrastructure. \n\nAnd the solution is not to price the common man out of travelling and hand railways over to for profit corporations. The solution is to hold the government accountable for its failures to do the bare minimum. Lakhs of vacancies leading to people having to work dangerous jobs more than 12hrs at a stretch, lack of allocation of funding for safety: kavach, an inadequate collision avoidance system costs lakh crore (that's only 3 fucking statues), and the government says the best it can do is 500 crore.  \n\nCommon man can choose to remind the government of the value of human life by getting out and protesting now to demand accountability. Failure to do so is the biggest bane of this country. \n\n>Note: I’m not against helping the poor. But perhaps targeted subsidies might be better, eg an online system for 100% cash back if you have a validated job interview offer. Or a programme that helps migrant labourers.\n\nNot this bullshit again. There's plenty of research showing that adding barriers wastes resources on verification and prevents those who need help from accessing it for utterly bureaucratic reasons. You'll do much better keeping the ticket prices low and posting qr codes with patriotic jingles asking to help make railways better. The best thing to do is cut the subsidy to mega corporations, and use it for necessities like railways, healthcare, and education. \n\n>PS. Many railway officials have noted that there’s a different (but related) area that Railways need to act upon: it’s too easy to board a train and “grab” reserved seats. Check out these Coromandel photos from before this accident. Massively overcrowded compartments are a massive safety risk and and injustice to paying passengers.\n\nMany railways officials are missing the woods for the trees. The reason for people to travel like cattle is unmet demand at affordable prices. People are desperate to travel. It's a matter of life and death for many: getting to work;  getting back to their loved ones; having some semblance of dignity after living like cattle stashed in sardine cans to earn a living in a crowded city.\n\nWe need increased carrying capacity at affordable prices. That'll keep people from encroaching into your precious  reserved compartments better than wating money and effort on keeping the masses out after reducing carrying capacity.",
        "The train tracks are too close to be resolved by free use GPS .",
        ">  It was signaled onto the wrong track at the speed of 128 km/s. \n\nyou mean 128 kmph\n\n> It takes a 4-5 kms to stop a train moving that fast anyways. \n\nThis is when a train is approaching a station as it is more energy efficient. I am fairly certain Emergency braking distance is fairly low. Probably somewhere around 1000m. Anyone who has been in train when a chain has pulled can vouch for it. The eery screeching sound and a sudden decelaration as train comes to a full stop\n\nBesides even if it was detected a mere 500m away and train could not fully stop, it would still have slowed down considerably. KE is proportional to square of speed. A collision at half the speed has only one fourth the impact. \n\nSo every little bit would have helped.",
        "The moment the tracks switched to loop line when the train was moving at 128 km/h, the derailment happened. This would have been true regardless of whether or not the goods train was on that track. \n\nThe derailed train then collided with rear end of the goods train and also the last 3 coaches of the other train which was moving simultaneously on the parallel track. \n\nBreaking would not have been engaged as the other train was not on the same track.",
        "I am not disputing that fact. I just clarified that 4-5 km braking distance is only when train is slowing down for a station. Emergency stopping distance is much smaller and that it doesn't even have to fully stop, just slow down as much to minimize damage. \n\n>Breaking would not have been engaged as the other train was not on the same track.\n\nMaybe not with current technology( I don't know how 'kavach' works ) but it is not impossible to track. send some electric pulses from the engine and if there is a metal obstruction lying on rails, it will create a path and be detected. As an engineering problem it isn't impossible to implement\n\nAnyways, I think we are focusing on wrong things. The train should have never jumped tracks, there should be triple/quad redundancy such that if the tracks are not setup correctly and a train is approaching at 125kmph, alarms should ring in the train, nearest guard cabin, nearest station, HQ, approaching trains, everywhere. if the track is electrified, kill power in that segment. We need that many redudancies to avoid this.\n\nIt feels excessive but in my first job we were building some health systems which were critical. It literally had 5 levels of failsafe to prevent anything unintentional. 5 stages would have to explicitly pass before anything even happened. It also live streamed system data to a data center which analyzed for discrepancy and capable of raising alarm at hospital IT, hospital admin and IT company. A 100 tonne machine trundling down at 125 kmph is no joke. It needs even more paranoia",
        "> Send some electric pulses from the engine and if there is a metal obstruction lying on rails, it will create a path and be detected. As an engineering problem it isn't impossible to implement\n\nWouldn't electrical pulses immediately be shorted by the metallic wheels connected via a metallic axel? Also this wouldn't be able to detect whether the obstruction is in front of the train or behind the train.",
        "“Rise commensurate with median earnings” is a red herring. The cost of upgrading the system to a modern standard is X. You need a national conversation about what fraction of X is subsidy and what fraction is paid by passengers, and also, does India want world class safety or a compromised, reduced level of safety.\n\nIf the country wants 100% subsidy (free at the point of use, maybe for “basic” coaches) that’s fine, make sure the railways are funded adequately via subsidy. Because right now, it’s not adequately funded, either via subsidies or fares.\n\n> precious reserved seats\n\nSorry, this just prioritises bad / unsafe behaviour over safety.\n\nI fully agree IR needs more capacity. But extra capacity when it’s underfunded … do you see where railway ministers and top managers will compromise? Yes, it’s safety.\n\nSo your “chalta hai” attitude towards encroachers and is going to get them and their co-passengers killed.\n\nAnd also — capacity is a perennial problem in India. Overcrowded buses turn over. Overcrowded trains fall into bridges (in one famous case). And you can’t magically get capacity for India’s poor. Even with the best will in the world, it’ll take 10+ years.\n\nIn the meantime, while that capacity is not yet in place, you have a choice:\n\n* opt for safety and control overcrowding on trains\n* or be honest with the public and tell them to not cry if there’s a mishap\n* or don’t say / do anything and pretend all is well.\n\ntl;dr — There is no free lunch. Safety costs money and I don’t give a sh*t if it comes via subsidy or fares. It needs to come."
    ],
    "cleaned_text": "nda government become experts superficial development attracts headlines kavach system might prevented accident required l crore investment installed locos tracks country mere crore spent kavach system vaishnav rail minister said pm inspired engineers india create anti collision system failed mention needs lakh crore investment entire system becomes protected vaishnav advertising train vande bharat gobhi went flag vande bharat thing vande bharat ticket almost identical flight cost niche product small set population use failed upgrade trains focussing exclusively vande bharat people use older trains loco pilots made operate trains hours time locos india except wag made alstom wdgg toilets wap locos urinals sources ravish kumar senior journalist ",
    "cleaned_title": "nda government become experts superficial development attracts headlines kavach system might prevented accident required l crore investment installed locos tracks country mere crore spent kavach system",
    "cleaned_selftext": "vaishnav rail minister said pm inspired engineers india create anti collision system failed mention needs lakh crore investment entire system becomes protected vaishnav advertising train vande bharat gobhi went flag vande bharat thing vande bharat ticket almost identical flight cost niche product small set population use failed upgrade trains focussing exclusively vande bharat people use older trains loco pilots made operate trains hours time locos india except wag made alstom wdgg toilets wap locos urinals sources ravish kumar senior journalist",
    "cleaned_comments": "kavach could prevented accident kavach locomotives ie adds safety features like collision avoidance signal passed danger dead man switch cab signalling etc however applies trains track fouling adjacent track signalled kavach current accident according reports caused circumstances feature called interlocking synchronizes points signals relies complex arrangement track signal circuitry display seen local station master panel order actions panel points set disabled times maintenance repair time caution order co issued loco pilots slow aware speeds low trains halt easily required maintenance complete co removed interlocking enabled specific case work carried enabling interlocking connections wrongly given resulted signal indicating train proceed main line point set loop line since co point indicated run coromandel full speed kmph point set made train cross loop line goods train loop line switching kmph loop line switch speed meant around kmph result derailment coromandel derailed also hit goods train speed due impact derailed coaches fell adjoining tracks howrah bound train passing mps time derailed coaches hit train also caused coaches howrah train also derail deaths higher account impact nothing fool proof fools ingenious like inaugurate incomplete projects lot conclusions investigation even begun best part people believe shit cladestine government apologists kavach system wouldnt prevent collision remember gas cylinders everything guys pr newspaper headlines nothing kavach kavach saying way could prevented india built system long ago dont know many years still got majority shit trains infrastructure government done years ago source trust bro source rtrustmebro plus collision avoidance system wouldnt prevented collision chaddi infestation complete event jivi reports mean correct till pt th semi bro science rdso specificationhttpswwwgooglecomurlsatsourcewebrctjurlhttpsrdsoindianrailwaysgovinuploadsfilesystemrequirementspecificationofkavachpdfvedahukewjwaziknahwajgghfkudxyqfnoecaqaqusgaovvawnbxkewijswtdzukuo actually bothered read spouting invective would understood sequence events kavach wouldnt worked case also disbelief current dispensation seem childlike belief statement minister spouted nonsense media kavach kavach magic bullet guard every eventuality source sequence eventshttpswwwdtnextinampnewstamilnaducoromandelexpresstookloopinsteadofmainlinehitgoodstrain kavachhttpswwwgooglecomurlsatsourcewebrctjurlhttpsrdsoindianrailwaysgovinuploadsfilesystemrequirementspecificationofkavachpdfvedahukewjwaziknahwajgghfkudxyqfnoecaqaqusgaovvawnbxkewijswtdzukuo newspaperhttpswwwdtnextinampnewstamilnaducoromandelexpresstookloopinsteadofmainlinehitgoodstrain reports tweetshttpstwittercomkunalghoshagainstatuss listed two list im writing position paper source shared talks train travelled loop line expected go main line dont know none safety measures trialed parts country active route article dated find rest details source bs comment aware facts signalling loco operation enthusiast please visit sitewwwirfcaorg read faq discussions debate facts coro crossed loop line kmph sane loco pilot attempt loop line switch speed turnout speeds kmph signal red lp would hit brake x signal red prior signal would yellow lp alp guard asleep track geometry station two loop lines side two main lines running parallel derailment foul adjoining track train could see derailed train happened near otherwise lp would hit brake please read rdso specification kavach spouting theories also read comments ir decide whether possess knowledge read literature debate please visit comment months see anything needs change although answer nicely composed dont think conclusively things said kavach cant portrayed flaunted inaugurated whats value proposition supreme leader spend correct kavach isnt designed scenario kavach primarily designed stop collisions trains track case passenger trains never technically track hypothetical situation kavach would effective coromandel express switched wrong track path oncoming yesvantpur exp kavach would detected trains track automatically stopped trains could collide bogies coromandel express fell path oncoming yesvantpur exp kavach couldnt anything rest ops post plausible speculation absolutely correct kavach make simple analogous example would go bike garage get turn indicators repaired mechanic repairs connecting wires interchanges right left vice versa signal right turn left one blinks something like happened relay control system night one made mistake connected wires wrong relay indicating one thing control room switching thnge else worry critical must multiple checks balances ensure galtisemistake happen always way electronics put hundreds lives risk make thousands kilogram flesh steel surety safety mean even true begs question allowed huge risk remain operating trains risk hundreds could die due routine system failure maintenance needs lakh crore investment modi inaugurate government never allocates funds go next step inaugurated aiims madurai times still dont building running aiims government medical colleges building completed inaugurate mission pluto take pictures advertise news dont anything people forget anyway yeah fuck physics right matter kind fictional electronics cant stop train goes kmph little time moment leading theory exp went loop line inevitable derailment different theories going official report comes one knows issue learnt kavach system preparing exams getting minute eyewitnesses said collision happened within minutes first derailment accident happened right next bnbr station station master would enough time send signal trains vicinity gap minutes well misinformed initially felt kavach couldve prevented trains never even line collision took place right physics train going stopped short distance without causing injuries mean electronics wont help understand issue incorrect diversion train loop line electronics help eliminate error human problem indias signaling system primitive compared international standards big problem given unprecedented size railway network vande bharat money invested upgrading signaling infrastructure would improved railways everyone using service less delays tighter frequencies would let us add trains scale system safely affordably course wouldnt see day end day humans ones decide electronics work short shit happens let hundreds people die shit happens thoughts may influenced line work see deaths day due human errors work systems basic assumption humans make mistakes system protect humans sorry shit happens never acceptable answer one technically build accident proof machine issue lies mainly price availability ability operate shit happens answer solutions doesnt meet three requirements kavach effective stopping headon collisions signal failure wasnt preliminary onsite report report released railway ministry could link thank detailed answer preliminary inspection report five railways supervisors referenced herehttpstheprintinindiagovernancepreliminaryinquiryintoodishatraincrashpointstopossiblesignallingerror herehttpswwwlivemintcomnewsindiaodishatrainaccidentmistakensignallikelytobereasonbehindmishaprevealsprobehtml loco pilot sees obstruction would brake also first coaches would impact otherwise since train opposing direction logically minutes statement factually wrong impossible generally correct already flagged earlier report swr officialhttpsmtimesofindiacomindiaodishatrainaccidentofficialflaggedflawsinsystemwarnedofdisasterarticleshowcms dont know sop disconnection reconnection dont know whether systemic failure possibility accounted system human error checking faulty made system fail blaming individuals wrong way go fixing things two things true time valid points op maybe kavach wouldnt helped instance even likely assuming sequence events youve talked true kavach deals specific type risk ops points also pretty accurate government prioritising fast trains safety even necessary upgrades railways senior officers even politicians agree indeed theyre saying quite openly tv safety also costs money kavach expensive weirdly also one cheapest basic systems railways want spend spend india needs proper debate value indian lives much money railways needs modernise yes much passengers pay old trick using freight rates subsidise passenger traffic limitations beyond certain point inflationheavy time raising freight prices unpopular anyhow odd showpiece train aside railways network desperate need new investment maintenance speak senior railways officers isnt new thing means risk flaggedhttpsmtimesofindiacomindiaodishatrainaccidentofficialflaggedflawsinsystemwarnedofdisasterarticleshowcms official without knowing sop wont comment commenting two things kavach timeline accident however without politics drives agenda railway officials safety conscious take safety seriously current dispensations proclivity announce grand schemes without ground work problem yet public domain officially way invest modern train track control equipment one says railways india fundamentals weak track upgrades done decades routes control equipment decades old governments priority glitzy trains even less money going fundamentals fictional electronics dont need fictional electronics redundant control circuitry dont need fight physics remove need fighting physics using electronics signals warn train controllers well time even shut trains tracks necessary redundancy well known design principle control systems electronics computers eg maintenance done one control circuit dont touch itll work designed key never touch systems time based reports caused error redundant controls might helped ensuring maintenance switch didnt cause catastrophic misrouting trains problem railways redundancy expensive especially irs scale youre right knowledge professionalism senior ir officers really something tell much depth youre lucky enough speak im fully conscious budget directionsetting isnt hands little bosses cloud cuckoo land sad still dont know full picture kinds conflicting reports flying around even hrs cant build timeline wait investigation report make kind statements read twitter minister blaming someone may want inform railway minister toadies planning bring perpetrators justice ha ha living information digital age yet govt cant bothered buy production ready collision avoidance system easily built even colleg grad ffs country morons whose priorities fucked simple optimization problem operations theory build ai system facial recog many amazing things ai tools cant install rs gps chip train thats fucked many levels know position every train every single time solve optimization problem easily could easily done annoying poor lives dont matter country fucking showoffs assholes sop report said warnings ignored mr minister wanted focus revenue increase vande bharat launches classified military intel public record shit system system cant identify fucking boggy railway track age shit sure many tv channels reporting governments saying root cause identified issue electronic interlocking could wrong premature conclusion turns electronic issue worth noting redundant systems help reduce risk catastrophic failures sop bypassing interlocking reinstating one though secret wont also public knowledge nothing railways done without comprehensive rulebook accident occured due set actions taken n persons actions exactly per sop yes sop faulty human error dont sop cant conclude either way im apologist government commented based knowledge understanding facts stopping train little time mechanical said electronics vaishnav rail minister said pm inspired engineers india create anti collision system great appreciated mms kavach development started deployment enabling interlocking connections wrongly given nothing fool proof fools ingenious youre arguing distemper verifies proper working including sensors report whether mechanical switching tracks actually happened designed simple ways deal things need baked system implemented locally someone trained engineer systems exactly funny people eager defend government end pretending th century st eager make excuses trying defend government yes humans make errors therefore putting together critical systems make redundant multiple levels checking cross checking shit happens excuse design implementation flaw issue lies mainly price availability ability operate much bullet train statues luxury trains competing airplanes ticket costs speed convenience cost governments priority glitzy trains even less money going fundamentals exactly criminal negligence government running behind publicity costing lives yet still idiots even thread making excuses goverment already declared cause without waiting investigations bogies coromandel express fell path oncoming yesvantpur exp happen follow advice main perpetrators need brought justice railway minister boss executive sets priorities priority luxury trains safety saying think man flashed problem liar surely knows sop saying wasnt followed report february incident pcom hari shankar verma wrote hosadurga station incident indicates serious flaws system contravenes essence basic principles interlocking electronic signal maintainer sem attempted rectify signal error bypassing rules procedures sounds like jugaadu way fixing problems safety systems bypassing keep trains running time help fuhrer get publicity human error deliberate criminal sabotage orchard top individuals local levels stupid shit like issue flagged treated like three alarm fire right top fact leadership busy inaugurating luxury trains instead dealing danger indicates interest fixing problem agree first part comment yes much passengers pay old trick using freight rates subsidise passenger traffic limitations beyond certain point kind thought process comes thinking government run profit business rather act provider services railways need facilitate transport boost economy people afford travel earn getting place work spend visiting hometowns friends families going vacations freight rates dont need subsidise entirety human transport taxes bear rest burden money spent better bullet trains idiot narcissist admitted one take novelty wears fugly statues never generate enough business justify existence would prevented collision coromandel express goods one turn would prevented ypr express train collision god accident hitting hard considering used travel quite often coromandel express run public transport including trains noprofit basis including subsidies many countries eg france germany fairly well run safe networks even chinese rail quite something extent subsidy extent overall funding thats issue issue railway systems deal railway workers need raises equipment needs upgrading tracks need maintenance costs money must ask afford increase subsidies passengers pay note many indian railways hasnt increased prices commensurately though indian railways isnt adequately funded safety perspective fare rises enough subsidies recipe disaster railways need facilitate transport issue india railways common man used excuse justify terrible infrastructure read time lines railways common man allows ministers ignore safety hey people die well pay lakhs move better spending lakhcrores actual safety improvements think bullet trains statues build note im helping poor perhaps targeted subsidies might better eg online system cash back validated job interview offer programme helps migrant labourers ps many railway officials noted theres different related area railways need act upon easy board train grab reserved seats check coromandel photos accidenthttpstwittercomzoobearstatus massively overcrowded compartments massive safety risk injustice paying passengers fact kavach wouldnt worked irrelevant need spend money making safe doesnt matter kavach armour fact spend bulk budget ensuring tracks systems safe upgraded exciting things like high speed bullet trains commented veracity swr official fact hes telling truth best knowledge newspaper reports letter would listed exact issue havent seen also attributing malice actually attributed stupidity signal faulty turns red rectified lp cross automatically however station master give written authority proceed lot paperwork idiots short circuiting would agree serious must acted upon would call conspiracy acted upon undoubtedly yes current dispensation wants grandiose achievements simple successes neither know care actual issues even pet project vb shambles qc turned rakes partial far fortunately failing items interiors caught attention needhttpsindianexpresscomarticleindiaodishatrainaccidentcoromandelenteredlooplineaftergreensignalrailwayboardexplains wait long detect path taken yes detect vehicle coming towards section path yes detect speed vehicle yes force change oath taken yes decide two possible paths st q going less dangerous option yes im trying say possible automate feel going physics physics came play train started changing tracks automation come stop happening course always scenario even automation place death happen automation still better one todays date anything automated need return investment solutionplus develop ment n testing etc shit happens excuse lazy corrupt indian railways definitely design implement system detect trains vicinity say kilometers something like say stationary train derailment warn loco pilot traffic controller someone rich powerful die horrible accidenti sure system implemented lightning priority considering cost involved agree im arguing anything im simply stating facts interlocking system bypassed point fools simply mess ups always possible kavach grave accident railway minister quit taking moral responsibility like used happen past instead passing buck various reasons avoiding responsibility problem bhakts behave experts happened write hasnt done decades assume several decades still blame current government understand rail budget improve infra increased continuously current regime general citizens failed ask exactly want years many reasons poverty lack education ignorance etc focus statues showpiece trains new completely current government nd term government go saying inherited problems forever yes underspending safety isnt confined government previous governments excuses much poorer lot safety technology available new early doesnt absolve hold present accountable someone invents time machine government loves flashy inaugurations doesnt prioritise deep infrastructure work india even current economy feasibly lets see accident wakes ill put money trains dont even gps indicate track make sense anti collision system work prevent collision still point government gas content anticollision system touted much would prevent tragedy physics exactly leaving optimization aside two trains one track situation handled basic software guarantee doubly safe save money install detector switches registers train going train enough time break signaled onto wrong track speed kms takes kms stop train moving fast anyways breaking also properly breaking hard cause slack derail train first place absolutely correct system goal must collision avoidance like unknown system work blah blah system design must include possible things go wrong kavach system useless lakh crore spent still cant meet goal system goal must collision avoidance like unknown system work blah blah fkn building lakh crore system track thing also achieved simple gps based system xb think collision system must take account everything cause collision make system works several conditions lakh crore work blah blah condition useless bs system stop spending money make something better simulate rail condition determine current conditions could cause collision sleep continuously make system fool proof everytime book ticket get via tatkal cancel main ticket means pay fare return sleeper coach double crowded money going full mis management loot absolutely sure fkn morons bring pakistan angle blame muslim scapegoat first step cbi inquiry morons must done railway team cbi cbi caged parrot per sc master tell govt mediocre ppl supported mediocre citizen angry others failures imagine guy used bullshit project assignment interview govt made ppl nothing students handed administration govt bs trillion smart cities bullet trains gujrat model corruption gone banning notes etc etc bs right reading reports many safety inspectors posts vacant rail minister pursuing budget filling posts working things bootlicking saying guy doesnt know radars work inspired engineers build system avoid collision great analysis details come happened said still begs asked system many issues one pointed cag report says many issues many safety inspectors posts vacant despite rosy picture painted everything super safe kavach advertisement especially even installed trains fair ask question press safety points rail system one caused accident indian railways hasnt increased prices commensurately though claiming havent increased commensurate median earnings indian railways isnt adequately funded safety perspective fare rises enough subsidies recipe disaster correction demanding railways start making profit get privatised led massive reduction subsidy real terms increasing higher paying seats general compartments getting replaced ac compartments existing trains vande bharat trains competing airlines fare time taken convenience regards safety issue india railways common man used excuse justify terrible infrastructure solution price common man travelling hand railways profit corporations solution hold government accountable failures bare minimum lakhs vacancies leading people work dangerous jobs hrs stretch lack allocation funding safety kavach inadequate collision avoidance system costs lakh crore thats fucking statues government says best crore common man choose remind government value human life getting protesting demand accountability failure biggest bane country note im helping poor perhaps targeted subsidies might better eg online system cash back validated job interview offer programme helps migrant labourers bullshit theres plenty research showing adding barriers wastes resources verification prevents need help accessing utterly bureaucratic reasons youll much better keeping ticket prices low posting qr codes patriotic jingles asking help make railways better best thing cut subsidy mega corporations use necessities like railways healthcare education ps many railway officials noted theres different related area railways need act upon easy board train grab reserved seats check coromandel photos accident massively overcrowded compartments massive safety risk injustice paying passengers many railways officials missing woods trees reason people travel like cattle unmet demand affordable prices people desperate travel matter life death many getting work getting back loved ones semblance dignity living like cattle stashed sardine cans earn living crowded city need increased carrying capacity affordable prices thatll keep people encroaching precious reserved compartments better wating money effort keeping masses reducing carrying capacity train tracks close resolved free use gps signaled onto wrong track speed kms mean kmph takes kms stop train moving fast anyways train approaching station energy efficient fairly certain emergency braking distance fairly low probably somewhere around anyone train chain pulled vouch eery screeching sound sudden decelaration train comes full stop besides even detected mere away train could fully stop would still slowed considerably ke proportional square speed collision half speed one fourth impact every little bit would helped moment tracks switched loop line train moving kmh derailment happened would true regardless whether goods train track derailed train collided rear end goods train also last coaches train moving simultaneously parallel track breaking would engaged train track disputing fact clarified km braking distance train slowing station emergency stopping distance much smaller doesnt even fully stop slow much minimize damage breaking would engaged train track maybe current technology dont know kavach works impossible track send electric pulses engine metal obstruction lying rails create path detected engineering problem isnt impossible implement anyways think focusing wrong things train never jumped tracks triplequad redundancy tracks setup correctly train approaching kmph alarms ring train nearest guard cabin nearest station hq approaching trains everywhere track electrified kill power segment need many redudancies avoid feels excessive first job building health systems critical literally levels failsafe prevent anything unintentional stages would explicitly pass anything even happened also live streamed system data data center analyzed discrepancy capable raising alarm hospital hospital admin company tonne machine trundling kmph joke needs even paranoia send electric pulses engine metal obstruction lying rails create path detected engineering problem isnt impossible implement wouldnt electrical pulses immediately shorted metallic wheels connected via metallic axel also wouldnt able detect whether obstruction front train behind train rise commensurate median earnings red herring cost upgrading system modern standard x need national conversation fraction x subsidy fraction paid passengers also india want world class safety compromised reduced level safety country wants subsidy free point use maybe basic coaches thats fine make sure railways funded adequately via subsidy right adequately funded either via subsidies fares precious reserved seats sorry prioritises bad unsafe behaviour safety fully agree ir needs capacity extra capacity underfunded see railway ministers top managers compromise yes safety chalta hai attitude towards encroachers going get copassengers killed also capacity perennial problem india overcrowded buses turn overcrowded trains fall bridges one famous case cant magically get capacity indias poor even best world itll take years meantime capacity yet place choice opt safety control overcrowding trains honest public tell cry theres mishap dont say anything pretend well tldr free lunch safety costs money dont give sht comes via subsidy fares needs come",
    "light_cleaned_title": "The NDA government has become experts in superficial development which attracts headlines. Kavach system that might have prevented the accident required 1L crore investment to be installed in all the Locos, tracks of our country. A mere 500 crore was spent on Kavach system.",
    "light_cleaned_selftext": "Vaishnav Rail minister said that “the PM inspired the engineers of India to create a Anti- Collision system” . He failed to mention that it needs 1lakh crore investment before the the entire system becomes protected. Vaishnav has been advertising (Train 18) Vande Bharat and Gobhi went to flag off each Vande Bharat. The thing is Vande Bharat ticket is almost identical to the flight cost and it’s a niche product that only a small set of the population can use. They failed to upgrade the other trains while focussing exclusively on Vande Bharat while 99% of the people use the older trains. Loco pilots were made to operate trains for more than 12 hours at a time. Most of the locos in India except the WAG-12 made by Alstom and WDG-6G have toilets . Some of the WAP-7 Locos have urinals. Other sources: Ravish Kumar - Senior Journalist",
    "light_cleaned_comments": "Kavach could not have prevented this accident. Kavach is for locomotives i.e. it adds safety features like collision avoidance, signal passed at danger, dead man switch, in cab signalling etc. However, this applies to trains on same track. Fouling of adjacent track cannot be signalled by Kavach. The current accident was according to reports caused by the circumstances as under:- 1. There is a feature called interlocking which synchronizes points and signals. 2. This relies on a complex arrangement of track and signal circuitry. The display is seen by the local station master on his panel and on his order and his actions on the panel, the points are set. 3. It is disabled at times for maintenance and repair. At this time a Caution Order (CO) is issued to loco pilots to slow down and be aware. Speeds are low such that trains can halt easily if required. 4. Once maintenance is complete, the CO is removed, the interlocking enabled . 5. In the specific case, some work was carried out. While enabling the interlocking some connections were wrongly given. 6. This resulted in the signal indicating that the train should proceed on the main line but point was set to the loop line. 7. Since there was no CO and point indicated run through the Coromandel was at full speed (128 kmph). 8. The point set made the train cross over to the loop line. There was a goods train on the loop line. 9. Switching at 128 kmph into a loop line where the switch speed is meant to be around 15-30 kmph will result in derailment. The Coromandel derailed and also hit the goods train. 10. At that speed and due to the impact derailed coaches fell on the adjoining tracks. 11. The Howrah bound train was passing by at MPS at the same time. The derailed coaches hit the train and also caused a few coaches of the Howrah train to also derail. 12. Deaths were higher on account of the impact. Nothing is fool proof, fools are ingenious Just like they inaugurate incomplete projects . That is a lot of conclusions before the investigation has even begun. And the best part is people will believe his shit. Cladestine government apologists, now kavach system wouldn't prevent collision. Remember gas cylinders? Everything these guys do is for PR and newspaper headlines. Nothing after that. Kavach or no kavach, are you saying there was no way this could have been prevented? India should have built this system long ago. I don't know what they have been doing for this many years. We still got the majority of those shit trains. The infrastructure this government is doing should have been done 10-20 years ago. Any source? Or trust me bro? source: r/trustmebro Plus Collision avoidance system wouldn't have prevented a collision. The chaddi infestation here is complete. Event jivi What reports? I mean he is correct till pt 3. 4th and after is semi bro science. [RDSO Specification](https://www.google.com/url?sa=t&source=web&rct=j&url=https://rdso.indianrailways.gov.in/uploads/File/System%2520Requirement%2520specification%2520of%2520KAVACH.pdf&ved=2ahUKEwjW24aziKn_AhWA8jgGHfKuDXYQFnoECA4QAQ&usg=AOvVaw0nbxk4e7wijS4Wtdzuk2uo) If you actually bothered to read before spouting invective, you would have understood the sequence of events and why Kavach wouldn't have worked in this case. Also for your disbelief in current dispensation, you seem to have a childlike belief in the statement of the same minister who spouted nonsense in the media about kavach. Kavach is not a magic bullet that can guard against every eventuality. Source for what ? The [sequence of events](https://www.dtnext.in/amp/news/tamilnadu/coromandel-express-took-loop-instead-of-main-line-hit-goods-train-716534) ? [Kavach](https://www.google.com/url?sa=t&source=web&rct=j&url=https://rdso.indianrailways.gov.in/uploads/File/System%2520Requirement%2520specification%2520of%2520KAVACH.pdf&ved=2ahUKEwjW24aziKn_AhWA8jgGHfKuDXYQFnoECA4QAQ&usg=AOvVaw0nbxk4e7wijS4Wtdzuk2uo) ? [Newspaper](https://www.dtnext.in/amp/news/tamilnadu/coromandel-express-took-loop-instead-of-main-line-hit-goods-train-716534) reports, [tweets](https://twitter.com/KunalGhoshAgain/status/1664971117088620544?s=20) Just listed two of the list. I'm not writing a position paper. The source you shared talks about 1. Train travelled on loop line when it was expected to go on main line. 2. They don’t know why. 3. None of the safety measures trialed in other parts of the country was active in this route. So is this article dated? Where did you find the rest of the details ? Any source for this BS comment ? Are you aware of facts of signalling or loco operation ? I am because I am an enthusiast , please visit this [site](www.irfca.org) and read the faq and discussions and then debate with me. The facts are that Coro crossed into the loop line at 128 kmph. No sane loco pilot will attempt a loop line switch at that speed. Turnout speeds are 15-30 kmph. If signal was red, the LP would have hit his brake. If X signal is red, prior signal would be yellow, there is an LP, ALP and guard , were they all asleep ? The track geometry at the station had two loop lines to the side and the two main lines running parallel to each other. Derailment will foul the adjoining track. The other train could not see the derailed train because it happened too near, otherwise the other LP would have hit the brake. Please read the RDSO specification of Kavach before spouting theories. Also read my other comments on IR and decide whether I do possess any knowledge. Read the literature and debate. Please visit this comment after 6 months and see if anything needs to change. Although the answer is nicely composed. I don't think conclusively such things can be said as of now. But kavach can't be portrayed, flaunted or inaugurated. So what's the value proposition for the supreme leader to spend on it? No, he is correct about Kavach, it isn’t designed for such a scenario. Kavach is primarily designed to stop collisions between 2 trains on the same track. In this case, the 2 passenger trains were never technically on the same track. A hypothetical situation where Kavach would have been effective is if Coromandel Express was switched to the wrong track, on to the path of the oncoming Yesvantpur Exp. then Kavach would have detected 2 trains on the same track and automatically stopped both trains before they could collide. But here, the bogies of Coromandel Express fell on the path of the oncoming Yesvantpur Exp, Kavach couldn’t do anything about that. The rest of OP’s post is plausible speculation, but he is absolutely correct about Kavach. So if we make it simple then a analogous example would be: You go to a bike garage to get your turn indicators repaired. The mechanic repairs it but when connecting the wires he interchanges the right with left and vice versa. So when you signal for a right turn the left one blinks. Something like that happened in the relay control system that night. Some one made a mistake and connected the wires to the wrong relay so it was indicating one thing in the control room but switching some thnge else. My worry is, if this is that critical then they must have multiple checks and balances to ensure galti-se-mistake does not happen. There is always a way in electronics. You cannot put hundreds of lives on risk and make thousands of kilogram of flesh and steel with no surety of safety. I mean even this is true, it begs the question who allowed such a huge risk to remain? How are we operating trains with the risk that hundreds could die due to routine system failure or maintenance? >needs 1lakh crore investment Modi will only inaugurate. The government never allocates funds to go to the next step. He inaugurated AIIMS in Madurai 2 times and still they don't have a building. Now they are running AIIMS in government medical colleges until the building is completed. I can inaugurate a mission to Pluto, take pictures and advertise in the news. But don't do anything after that... People forget anyway. Yeah, fuck physics am I right. No matter what kind of fictional electronics you can't stop a train that goes 130kmph with little to no time. At the moment leading theory is exp went on to loop line which is inevitable derailment and then there are 10 different theories going on, until official report comes no one knows what the issue it is. I had just learnt about Kavach system, as I was preparing for exams Where are you getting this 20 minute? Eyewitnesses have said that the collision happened within minutes of the first derailment. The accident happened right next to BNBR Station, so the station master would have had enough time to send a signal to all trains in the vicinity if the gap was 20 minutes! Well, you are misinformed then. Initially it felt that Kavach could’ve prevented it, but the trains were never even on the same line until the collision took place. You are right about the physics that a train going at 130 cannot be stopped in a short distance without causing injuries. But, that does not mean electronics won't help. From what I understand the issue here is the incorrect diversion of the train to the loop line. Electronics can help eliminate this error, human or not The problem of India’s signaling system which is primitive compared to international standards. A big problem, given the unprecedented size of our railway network. If all the Vande Bharat money was invested in upgrading the signaling infrastructure then it would have improved the railways for everyone using the service. Less delays and tighter frequencies would let us add more trains and scale the system more safely and affordably. And of course, we wouldn’t have had to see this day. By the end of the day humans are the ones decide how electronics work. In short shit happens. So, we let hundreds of people die just because shit happens? My thoughts may be influenced by my line of work where I see 400 deaths each day, most of them due to human errors. That is why we work on systems with the basic assumption that humans make mistakes and it's the system that should protect humans from themselves. I am sorry, but 'Shit happens' is never an acceptable answer to me. One can technically build the accident proof machine but the issue lies mainly is it's price, availability and ability to operate. Shit happens is the answer when the solutions doesn't meet the three requirements. Kavach is effective only in stopping head-on collisions. This was a signal failure. Wasn't there a preliminary on-site report report released by the railway ministry? Could you link to that? Thank you for your detailed answer. \"preliminary inspection report by five Railways supervisors\" as referenced [here](https://theprint.in/india/governance/preliminary-inquiry-into-odisha-train-crash-points-to-possible-signalling-error/1610210/) and [here](https://www.livemint.com/news/india/odisha-train-accident-mistaken-signal-likely-to-be-reason-behind-mishap-reveals-probe-11685788650787.html) If the loco pilot sees an obstruction he would brake. Also the first few coaches would have the impact otherwise since the other train was in the opposing direction. Logically, this 20 minutes statement is factually wrong and impossible You are generally correct. This was already flagged in an earlier [report by a SWR official.](https://m.timesofindia.com/india/odisha-train-accident-official-flagged-flaws-in-system-warned-of-disaster/articleshow/100736368.cms) I don't know the SOP for the disconnection and reconnection so don't know whether it was systemic failure (possibility not accounted for in system) or a human error (checking was faulty). It's not a \"who\". It's a \"what made the system fail\", and blaming it on individuals is the wrong way to go about fixing things. Two things can be true at the same time. You have valid points but so does OP. Maybe Kavach wouldn’t have helped in this instance (even likely assuming the sequence of events you’ve talked about is true. Kavach deals with a very specific type of risk), but OP’s points are also pretty accurate. The government has been prioritising fast trains over safety and even necessary upgrades. Most Railways senior officers and even politicians will agree, indeed they’re saying this quite openly on TV. Safety also costs money. Kavach is expensive but weirdly it’s also one of the cheapest & most basic systems out there. Does Railways want to spend more? Can they spend more? India needs a proper debate on the value of Indian lives, and how much money the Railways needs to modernise. And yes, how much passengers should pay — the old trick of using freight rates to subsidise passenger traffic has limitations beyond a certain point. And in an inflation-heavy time, raising freight prices will be unpopular. Anyhow, the odd showpiece train aside, most of the Railways network is in desperate need of new investment and maintenance. Again, speak to senior Railways officers — this isn’t a new thing by any means. The risk was [flagged](https://m.timesofindia.com/india/odisha-train-accident-official-flagged-flaws-in-system-warned-of-disaster/articleshow/100736368.cms) by an official. But , without knowing the SOP I won't comment . I was commenting only on two things, Kavach and timeline of the accident. However , without the politics (which drives the agenda), railway officials are safety conscious and do take safety seriously. It's the current dispensation's proclivity to announce grand schemes without further ground work that is a problem. It's not yet in public domain officially. There is a way. Invest in more modern train and track control equipment. What no one says about Railways in India is that the fundamentals are very weak: track upgrades have not been done in decades in some routes. The control equipment is decades old. The government’s priority is glitzy trains. So even less money is going to the fundamentals. “Fictional electronics” … you don’t need fictional electronics to have redundant control circuitry. And you don’t need to fight physics — you remove the need for fighting physics by using electronics and signals to warn the train / controllers well in time. And even shut down trains / tracks as necessary. Redundancy is a well known design principle in control systems, electronics and computers. Eg if maintenance is being done on one control circuit, don’t touch the other and it’ll work as designed. The key is, you never touch both systems at the same time. Based on reports of what caused the error, redundant controls might have helped here, by ensuring that maintenance on a switch didn’t cause a catastrophic misrouting of trains. The problem for Railways is that redundancy is expensive. Especially at IR’s scale. You’re right, the knowledge & professionalism of senior IR officers is really something— you can tell how much depth they have if you’re lucky enough to speak to some. I’m fully conscious that the budget & direction-setting isn’t in their hands — they can do little when their bosses are in cloud cuckoo land. It’s sad. We still don't know the full picture, there are all kinds of conflicting reports flying around and even after 36hrs they can't build timeline. We have to wait investigation report to make any kind of statements. i just read now on twitter that now the minister is blaming someone did 'this' You may want to inform our railway minister and his toadies. Because they are planning to bring the perpetrators to justice. Ha ha. We are living in the information and digital age and yet the govt can't be bothered to buy a production ready collision avoidance system. This can be easily built even by a colleg grad ffs. We are a country of morons whose priorities are fucked up. It's a simple optimization problem from operations theory. We can build an AI system for facial recog and do many other amazing things with AI tools and we can't install a 3000rs GPS chip in a train. That's fucked up on so many levels. If you know the position of every train at every single time, you can solve the optimization problem very easily. This all could be very easily done. So annoying. Poor lives don't matter in this country. Fucking showoffs. Assholes. SOP for what? The same report said the warnings were ignored because Mr Minister wanted to focus on revenue increase and Vande Bharat launches. This is not some classified military intel. It is and should be public record. Then it's a shit system , if your system can't identify a fucking boggy on railway track in this age , it's shit Sure. But many tv channels are reporting that the government’s saying the root cause has been identified — an issue with electronic interlocking. Again this could be wrong or a premature conclusion, but if it turns out to be an electronic issue, it’s worth noting that redundant systems do help **reduce** the risk of catastrophic failures. SOP for bypassing the interlocking and reinstating it. There will be one, but though not a secret won't also be public knowledge. Nothing in railways is done without a comprehensive rulebook. An accident occured due to a set of actions taken by n persons. Were the actions exactly as per the SOP ? If yes, then the SOP is faulty, if no then it's a human error. I dont have the SOP so I can't conclude either way. I'm not an apologist for the government. I have commented based on my knowledge and understanding of facts. Stopping a train with little to no time is mechanical. I said electronics. >Vaishnav Rail minister said that “the PM inspired the engineers of India to create a Anti- Collision system” Great that he appreciated mms. Kavach development started in 2012 and deployment in 2016. >While enabling the interlocking some connections were wrongly given. >Nothing is fool proof, fools are ingenious What you're arguing for is a distemper that verifies proper working, including sensors that report whether mechanical switching of tracks has actually happened as designed. There are simple ways to deal with these things, but they need to be baked into the system, not implemented locally by someone not trained to engineer such systems. Exactly. It's funny how people eager to defend the government end up pretending as if we're in the 16th century, not 21st. Why are you so eager to make excuses? Are you trying to defend the government? Yes, humans make errors. And therefore when putting together critical systems, you make them redundant, and you have multiple levels of checking and cross checking. \"Shit happens\" is an excuse for design and implementation flaw. >the issue lies mainly is it's price, availability and ability to operate. How much did the bullet train, the statues, and the luxury trains competing with airplanes (for ticket costs, not speed or convenience) cost, again? >The government’s priority is glitzy trains. So even less money is going to the fundamentals. Exactly. Criminal negligence of this government running behind publicity is costing lives. And yet, there still are idiots even in this thread making excuses. The goverment has already declared the cause without waiting for investigations. >But here, the bogies of Coromandel Express fell on the path of the oncoming Yesvantpur Exp, And why did that happen? Do follow your own advice. The main perpetrators that need to be brought to justice are the railway minister and his boss. Executive sets the priorities, and their priority was luxury trains, not safety. Are you saying that you think the man who flashed the problem is a liar? Surely, he knows the SOP when saying it wasn't followed? >In his report after the February 8 incident, then PCOM Hari Shankar Verma wrote: “The Hosadurga station incident indicates that there are serious flaws in the system and contravenes the essence and basic principles of interlocking. **The electronic signal maintainer (SEM) attempted to rectify the signal error after bypassing rules and procedures**. ” This sounds like a jugaadu way of fixing problems in safety systems by bypassing them to keep the trains running on time to help the fuhrer get publicity. This is not human error. This is deliberate, criminal sabotage orchard from the top. Individuals at local levels can do stupid shit like this on their own, but once the issue is flagged, it has to be treated like a three alarm fire right from the top. The fact that the leadership was busy inaugurating luxury trains instead of dealing with this danger indicates that they have no interest in fixing the problem. I agree with first part of your comment. >And yes, how much passengers should pay — the old trick of using freight rates to subsidise passenger traffic has limitations beyond a certain point. This kind of thought process comes from thinking that government should run for profit business, rather than act a a provider of services. Railways need to facilitate transport, and through that, boost the economy. When people can afford to travel, they earn more (by getting to their place of work), spend more (by visiting their hometowns, friends, families, or going out on vacations). Freight rates don't need to subsidise entirety of human transport. Our taxes can bear the rest of the burden. That is money spent better than bullet trains that the idiot narcissist admitted no one will take after the novelty wears off, and the fugly statues that will never generate enough business to justify their existence. it would have prevented collision of coromandel express with goods one, which in turn would have prevented YPR express train collision. God, this accident is hitting me hard considering I used to travel quite often in coromandel express. You can run public transport, including trains, on a no-profit basis including subsidies. Many countries do. Eg France and Germany have fairly well run, safe, networks. Even Chinese Rail — it’s quite something. It’s the extent of subsidy and extent of overall funding that’s the issue. The issue all railway systems have to deal with is: railway workers need raises. Equipment needs upgrading. Tracks need maintenance. All this costs money. So now you must ask, can we afford to increase subsidies? Or should passengers pay more? Note that many do both. Indian Railways hasn’t increased prices commensurately though. And Indian Railways isn’t adequately funded from a safety perspective. No fare rises, not enough subsidies = recipe for disaster. > Railways need to facilitate transport The issue in India is that this “railways is for the common man” has been used as an excuse to justify terrible infrastructure. Read that again, this time between the lines. Railways is for the **common man.** That allows ministers to ignore safety. Because hey, if people die, we’ll just pay them 10 lakhs and move on. Better than spending lakh-crores on actual safety improvements. Think of all the bullet trains and statues we can build with that. Note: I’m not against helping the poor. But perhaps targeted subsidies might be better, eg an online system for 100% cash back if you have a validated job interview offer. Or a programme that helps migrant labourers. PS. Many railway officials have noted that there’s a different (but related) area that Railways need to act upon: it’s too easy to board a train and “grab” reserved seats. Check out [these Coromandel photos from *before* this accident](https://twitter.com/zoo_bear/status/1664880215820992515). Massively overcrowded compartments are a massive safety risk *and* and injustice to paying passengers. . The fact kavach wouldn’t have worked for this is irrelevant. They need to spend money on making it safe: doesn’t matter if it’s kavach or armour 2.0. In fact they should spend the bulk of their budget on ensuring the tracks and systems are safe and upgraded, before more exciting things like high speed and bullet trains. Where have I commented on the veracity of the SWR official ? In fact he's telling the truth to the best of my knowledge. But , we only have a few newspaper reports. The letter would have listed out the exact issue which I haven't seen. Also you are attributing to malice what should actually be attributed to stupidity. When a signal is faulty it turns red and until it's rectified no LP will cross it automatically. However , the station master can give written authority to proceed. This is a lot of paperwork which some idiots are short circuiting . I would agree that this is serious and must be acted upon, but would not call it a conspiracy. Should this have been acted upon ? Undoubtedly yes. But the current dispensation wants grandiose achievements and not simple successes. They neither know nor care about the actual issues. Even the pet project VB is in shambles. The QC of the out turned rakes is partial. So far fortunately, the failing items are interiors so it's not caught attention. No [need](https://indianexpress.com/article/india/odisha-train-accident-coromandel-entered-loop-line-after-green-signal-railway-board-explains-8645302/) to wait that long. Can we detect what path will be taken - yes Can we detect any vehicle coming towards the section of path above - yes Can we detect speed of above vehicle - yes Can we force change in oath taken -yes Can decide out of the two possible paths (1st q) is going to be a less dangerous option -yes What I'm trying to say is that it is possible to automate what you feel is going against physics. Physics came into play when the train started changing tracks. Automation will come before that and stop that from happening. Of course there always will be scenario where even with automation in place death will happen, but that automation will still be better than not having one.. In today's date anything can be automated. It is just about need and return of investment on the solution(plus develop ment n testing etc). \"Shit happens\" is the excuse of lazy and corrupt. Indian Railways can definitely design and implement a system which can detect trains in the vicinity of say a few kilometers and if something is off like say a stationary train or a derailment can warn the loco pilot and the traffic controller. If someone very rich and powerful were to die in such a horrible accident,I am sure such a system will be implemented with lightning priority. Considering the cost involved, i agree with you.. I'm not arguing anything. I'm simply stating the facts. The interlocking system should not be bypassed but it was . The point about fools is simply that mess ups are always possible. Kavach or not, this is a grave accident and the railway minister should quit taking moral responsibility for it like how it used to happen in the past. Instead we have them passing the buck to various reasons and avoiding the responsibility of the problem and we have bhakts who behave as experts on why it happened! You write it hasn't been done in decades, which I assume are several decades, and you still blame the current government. As I understand, the rail budget to improve infra has been increased continuously in the current regime. In general, we , as citizens, have failed to ask for exactly what we want for years now, which has many reasons, such as poverty, lack of education, ignorance, etc. The focus on statues and showpiece trains is new, and completely on the current government. This is a 2nd term government and cannot go about saying “we inherited problems” forever. Yes, underspending on safety isn’t confined to this government. But previous governments had excuses — they were much poorer and a lot of safety technology was not available or very new in the 1990s and early 2000s. Doesn’t absolve them, but *we can only hold the present accountable until someone invents a Time Machine.* This government loves flashy inaugurations and doesn’t prioritise the deep infrastructure work that India (even with its current economy) can feasibly do. Let’s see if this accident wakes them up. I’ll put money on “no”. What? Trains dont even have gps on them to indicate where they are on the track? It does not make sense that an anti collision system does no work to prevent collision. It's still the same point that this government is all gas and no content if the anticollision system that is touted so much would not prevent this tragedy Because physics...? Exactly. And leaving optimization aside, the \"two trains on one track\" situation can be handled through basic software with 100% guarantee. To be doubly safe, (or save money,) they can install a detector at switches that registers a train going through. That train did not have enough time to break. It was signaled onto the wrong track at the speed of 128 km/s. It takes a 4-5 kms to stop a train moving that fast anyways. Breaking also has to be properly too, as breaking too hard can cause slack to derail the train in the first place. Absolutely correct!!! The system goal must be collision avoidance . Not like if this , if this , if unknown then system will not work blah blah... The system design must include all possible things which can go wrong . The kavach system is useless if 1 lakh crore is being spent but still cant meet its goal. **The system goal must be collision avoidance .** Not like if this , if this , if unknown then system will not work blah blah... You are fkn building 1 lakh crore system . The same track thing can also be achieved by a simple GPS based system. &#x200B; Think of it as a collision system , it must take into account everything which can cause a collision. If you make a system which works on several conditions for 1 Lakh Crore but it will only work if blah blah condition than its a useless BS system . Stop spending money and make something better. Simulate the rail condition and determine if current conditions could cause collision. Do not sleep , Continuously make the system 'fool' proof Everytime I have to book a ticket I only get via tatkal and I have to cancel main ticket which means I have to pay 200% of fare . And in return my sleeper coach if double crowded. Where is the money going? Full mis management and loot I am absolutely sure these fkn morons will bring a Pakistan angle, blame a muslim scapegoat. The first step is CBI inquiry, morons this must be done by railway team not CBI. CBI is just a caged parrot ( as per SC), it will do what its master tell it It is the govt of mediocre ppl, supported by mediocre citizen who are angry at others for their own failures. Imagine the guy who used to bullshit in project assignment interview. The govt is made of those ppl. Nothing against those students, but they should not be handed over the administration of the govt. Bs about 5 trillion, 20 smart cities, bullet trains, gujrat model, corruption gone by banning notes etc etc. All bs. Right. I am reading reports that many of the safety inspectors posts are vacant. A rail minister should be pursuing budget for filling those posts and working on those things and not be bootlicking by saying the guy who doesnt know how the radars work, 'inspired engineers to build a system to avoid collision'. This is a great analysis. And more and more details should come out for why this happened. That being said, it still begs to be asked while the system has so many issues, the one that you pointed, CAG report says there are many issues, many of the safety inspectors posts are vacant, despite all that, why was the rosy picture being painted that everything is super safe, and kavach as the advertisement, especially if its not even installed in most of the trains. Its fair to ask that question, and press on all safety points of the rail system and not just the one that caused this accident. >Indian Railways hasn’t increased prices commensurately though. Are you claiming that they haven't increased commensurate with the median earnings? >And Indian Railways isn’t adequately funded from a safety perspective. No fare rises, not enough subsidies = recipe for disaster. Correction: demanding that railways start making profit or get privatised has led to massive reduction in subsidy in real terms while increasing higher paying seats: general compartments getting replaced with ac compartments in existing trains, vande bharat trains competing with airlines (for fare, not for time taken or convenience), no regards for safety. >The issue in India is that this “railways is for the common man” has been used as an excuse to justify terrible infrastructure. And the solution is not to price the common man out of travelling and hand railways over to for profit corporations. The solution is to hold the government accountable for its failures to do the bare minimum. Lakhs of vacancies leading to people having to work dangerous jobs more than 12hrs at a stretch, lack of allocation of funding for safety: kavach, an inadequate collision avoidance system costs lakh crore (that's only 3 fucking statues), and the government says the best it can do is 500 crore. Common man can choose to remind the government of the value of human life by getting out and protesting now to demand accountability. Failure to do so is the biggest bane of this country. >Note: I’m not against helping the poor. But perhaps targeted subsidies might be better, eg an online system for 100% cash back if you have a validated job interview offer. Or a programme that helps migrant labourers. Not this bullshit again. There's plenty of research showing that adding barriers wastes resources on verification and prevents those who need help from accessing it for utterly bureaucratic reasons. You'll do much better keeping the ticket prices low and posting qr codes with patriotic jingles asking to help make railways better. The best thing to do is cut the subsidy to mega corporations, and use it for necessities like railways, healthcare, and education. >PS. Many railway officials have noted that there’s a different (but related) area that Railways need to act upon: it’s too easy to board a train and “grab” reserved seats. Check out these Coromandel photos from before this accident. Massively overcrowded compartments are a massive safety risk and and injustice to paying passengers. Many railways officials are missing the woods for the trees. The reason for people to travel like cattle is unmet demand at affordable prices. People are desperate to travel. It's a matter of life and death for many: getting to work; getting back to their loved ones; having some semblance of dignity after living like cattle stashed in sardine cans to earn a living in a crowded city. We need increased carrying capacity at affordable prices. That'll keep people from encroaching into your precious reserved compartments better than wating money and effort on keeping the masses out after reducing carrying capacity. The train tracks are too close to be resolved by free use GPS . > It was signaled onto the wrong track at the speed of 128 km/s. you mean 128 kmph > It takes a 4-5 kms to stop a train moving that fast anyways. This is when a train is approaching a station as it is more energy efficient. I am fairly certain Emergency braking distance is fairly low. Probably somewhere around 1000m. Anyone who has been in train when a chain has pulled can vouch for it. The eery screeching sound and a sudden decelaration as train comes to a full stop Besides even if it was detected a mere 500m away and train could not fully stop, it would still have slowed down considerably. KE is proportional to square of speed. A collision at half the speed has only one fourth the impact. So every little bit would have helped. The moment the tracks switched to loop line when the train was moving at 128 km/h, the derailment happened. This would have been true regardless of whether or not the goods train was on that track. The derailed train then collided with rear end of the goods train and also the last 3 coaches of the other train which was moving simultaneously on the parallel track. Breaking would not have been engaged as the other train was not on the same track. I am not disputing that fact. I just clarified that 4-5 km braking distance is only when train is slowing down for a station. Emergency stopping distance is much smaller and that it doesn't even have to fully stop, just slow down as much to minimize damage. >Breaking would not have been engaged as the other train was not on the same track. Maybe not with current technology( I don't know how 'kavach' works ) but it is not impossible to track. send some electric pulses from the engine and if there is a metal obstruction lying on rails, it will create a path and be detected. As an engineering problem it isn't impossible to implement Anyways, I think we are focusing on wrong things. The train should have never jumped tracks, there should be triple/quad redundancy such that if the tracks are not setup correctly and a train is approaching at 125kmph, alarms should ring in the train, nearest guard cabin, nearest station, HQ, approaching trains, everywhere. if the track is electrified, kill power in that segment. We need that many redudancies to avoid this. It feels excessive but in my first job we were building some health systems which were critical. It literally had 5 levels of failsafe to prevent anything unintentional. 5 stages would have to explicitly pass before anything even happened. It also live streamed system data to a data center which analyzed for discrepancy and capable of raising alarm at hospital IT, hospital admin and IT company. A 100 tonne machine trundling down at 125 kmph is no joke. It needs even more paranoia > Send some electric pulses from the engine and if there is a metal obstruction lying on rails, it will create a path and be detected. As an engineering problem it isn't impossible to implement Wouldn't electrical pulses immediately be shorted by the metallic wheels connected via a metallic axel? Also this wouldn't be able to detect whether the obstruction is in front of the train or behind the train. “Rise commensurate with median earnings” is a red herring. The cost of upgrading the system to a modern standard is X. You need a national conversation about what fraction of X is subsidy and what fraction is paid by passengers, and also, does India want world class safety or a compromised, reduced level of safety. If the country wants 100% subsidy (free at the point of use, maybe for “basic” coaches) that’s fine, make sure the railways are funded adequately via subsidy. Because right now, it’s not adequately funded, either via subsidies or fares. > precious reserved seats Sorry, this just prioritises bad / unsafe behaviour over safety. I fully agree IR needs more capacity. But extra capacity when it’s underfunded … do you see where railway ministers and top managers will compromise? Yes, it’s safety. So your “chalta hai” attitude towards encroachers and is going to get them and their co-passengers killed. And also — capacity is a perennial problem in India. Overcrowded buses turn over. Overcrowded trains fall into bridges (in one famous case). And you can’t magically get capacity for India’s poor. Even with the best will in the world, it’ll take 10+ years. In the meantime, while that capacity is not yet in place, you have a choice: * opt for safety and control overcrowding on trains * or be honest with the public and tell them to not cry if there’s a mishap * or don’t say / do anything and pretend all is well. tl;dr — There is no free lunch. Safety costs money and I don’t give a sh*t if it comes via subsidy or fares. It needs to come."
}