{
    "id": "14qz8s3",
    "title": "Unrest grows in Sena, CM Eknath Shinde calls party meet today",
    "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-mlas-express-displeasure-over-inclusion-of-ncp-legislators-in-government-8749044/",
    "selftext": "Growing instances of displeasure within the party legislators over the induction of Ajit Pawar led NCP legislators in cabinet has in turn forced Shinde to call for a meeting of legislators and other party leaders on Wednesday.",
    "flair": "Politics",
    "score": 2,
    "num_comments": 5,
    "created_utc": 1688528549.0,
    "convurl": "https://external-preview.redd.it/vtJUc_BCmdDsl_-JpXjWLR-W-Wdkq9bRkX4bu8ggR8k.jpg?auto=webp&s=52dd3d4ca93d3e1918ebbf6a4419894a395e128e",
    "comments": [
        ">Two days after nine NCP legislators including Ajit Pawar joined the Chief Minister Eknath Shinde-led government, a Sena minister and several Sena MLAs publicly expressed their displeasure over the development and questioned the need for inducting the Ajit Pawar-led NCP into the government.\n\n>Shiv Sena minister Shambhujraje Desai on Tuesday even went ahead to say that if Shiv Sena UBT president gives any proposal or reaches out to them, then Shinde led Sena would also respond positively.\n\n\n>Desai said, “These all are hypothetical questions. But if anyone from Uddhav Ji’s side reaches out to us then we will reciprocate. We will give a response positively, if we get any proposal,”Desai said.\n\n>Expressing the displeasure, Shirsat said that owing to the Cabinet expansion, the people from Shinde Sena have so many questions about to how the things would work now.\n\n>“The answers are with Shinde and Fadnavis. But if we have to give up everything, then what is the point of being in power? Why should we in power if everything has to be sacrificed? These compromises are being made now but the CM will have to do justice. If there is no justice then things won’t work. Everyone has to be pacified,” Shirsat said.",
        "Well, BJP has formed government by deliberately collected the most power hungry MLAs. They will have to reward them or risk them returning to their former masters.",
        "Could this be the time for Shinde and co to go back to the MVA and form a government with uddhav as the CM?",
        "Might depend on today's whips and the disqualification petition in sc",
        "BWAAHAHAHAHAHAHAHAHAHAHAHAHA"
    ],
    "cleaned_text": "unrest grows sena cm eknath shinde calls party meet today growing instances displeasure within party legislators induction ajit pawar led ncp legislators cabinet turn forced shinde call meeting legislators party leaders wednesday ",
    "cleaned_title": "unrest grows sena cm eknath shinde calls party meet today",
    "cleaned_selftext": "growing instances displeasure within party legislators induction ajit pawar led ncp legislators cabinet turn forced shinde call meeting legislators party leaders wednesday",
    "cleaned_comments": "two days nine ncp legislators including ajit pawar joined chief minister eknath shindeled government sena minister several sena mlas publicly expressed displeasure development questioned need inducting ajit pawarled ncp government shiv sena minister shambhujraje desai tuesday even went ahead say shiv sena ubt president gives proposal reaches shinde led sena would also respond positively desai said hypothetical questions anyone uddhav jis side reaches us reciprocate give response positively get proposaldesai said expressing displeasure shirsat said owing cabinet expansion people shinde sena many questions things would work answers shinde fadnavis give everything point power power everything sacrificed compromises made cm justice justice things wont work everyone pacified shirsat said well bjp formed government deliberately collected power hungry mlas reward risk returning former masters could time shinde co go back mva form government uddhav cm might depend todays whips disqualification petition sc bwaahahahahahahahahahahahaha",
    "light_cleaned_title": "Unrest grows in Sena, CM Eknath Shinde calls party meet today",
    "light_cleaned_selftext": "Growing instances of displeasure within the party legislators over the induction of Ajit Pawar led NCP legislators in cabinet has in turn forced Shinde to call for a meeting of legislators and other party leaders on Wednesday.",
    "light_cleaned_comments": ">Two days after nine NCP legislators including Ajit Pawar joined the Chief Minister Eknath Shinde-led government, a Sena minister and several Sena MLAs publicly expressed their displeasure over the development and questioned the need for inducting the Ajit Pawar-led NCP into the government. >Shiv Sena minister Shambhujraje Desai on Tuesday even went ahead to say that if Shiv Sena UBT president gives any proposal or reaches out to them, then Shinde led Sena would also respond positively. >Desai said, “These all are hypothetical questions. But if anyone from Uddhav Ji’s side reaches out to us then we will reciprocate. We will give a response positively, if we get any proposal,”Desai said. >Expressing the displeasure, Shirsat said that owing to the Cabinet expansion, the people from Shinde Sena have so many questions about to how the things would work now. >“The answers are with Shinde and Fadnavis. But if we have to give up everything, then what is the point of being in power? Why should we in power if everything has to be sacrificed? These compromises are being made now but the CM will have to do justice. If there is no justice then things won’t work. Everyone has to be pacified,” Shirsat said. Well, BJP has formed government by deliberately collected the most power hungry MLAs. They will have to reward them or risk them returning to their former masters. Could this be the time for Shinde and co to go back to the MVA and form a government with uddhav as the CM? Might depend on today's whips and the disqualification petition in sc BWAAHAHAHAHAHAHAHAHAHAHAHAHA"
}