{
    "id": "159uucu",
    "title": "Railways, roads and highways sector to get the largest chunk of investment in Modi 2.0",
    "url": "https://m.economictimes.com/news/economy/infrastructure/railways-roads-and-highways-sector-to-get-the-largest-chunk-of-investment-in-modi-2-0-icra/articleshow/69586137.cms",
    "selftext": "The devil is in the details. Major emphasis is on new roads and highways, with most of the railways investment going into metros and dedicated freight corridors. \nBasically Modi 2.0 is about ignoring the poor and underserved people in all ways and means possible while claiming massive growth. Growth which favours big companies by lowering their logistics costs while travel costs for common people keep increasing massively",
    "flair": "Policy/Economy",
    "score": 3,
    "num_comments": 0,
    "created_utc": 1690343953.0,
    "convurl": "https://external-preview.redd.it/j1gne9NARpH3Pr_Ai3kxJzmABcgB-MkSIBj0mLGRNFU.jpg?auto=webp&amp;s=54a594ade6cbb2ff81848d88d8b098ef5ed6a9d0",
    "comments": [],
    "cleaned_text": "railways roads highways sector get largest chunk investment modi devil details major emphasis new roads highways railways investment going metros dedicated freight corridors basically modi ignoring poor underserved people ways means possible claiming massive growth growth favours big companies lowering logistics costs travel costs common people keep increasing massively ",
    "cleaned_title": "railways roads highways sector get largest chunk investment modi",
    "cleaned_selftext": "devil details major emphasis new roads highways railways investment going metros dedicated freight corridors basically modi ignoring poor underserved people ways means possible claiming massive growth growth favours big companies lowering logistics costs travel costs common people keep increasing massively",
    "cleaned_comments": "",
    "light_cleaned_title": "Railways, roads and highways sector to get the largest chunk of investment in Modi 2.0",
    "light_cleaned_selftext": "The devil is in the details. Major emphasis is on new roads and highways, with most of the railways investment going into metros and dedicated freight corridors. Basically Modi 2.0 is about ignoring the poor and underserved people in all ways and means possible while claiming massive growth. Growth which favours big companies by lowering their logistics costs while travel costs for common people keep increasing massively",
    "light_cleaned_comments": ""
}