{
    "id": "129ipnr",
    "title": "Thoughts on woman in bikini in Delhi Metro",
    "url": "https://www.reddit.com/r/india/comments/129ipnr/thoughts_on_woman_in_bikini_in_delhi_metro/",
    "selftext": "Recently a post is going viral where a woman is wearing a bikini in delhi metro [https://mobile.twitter.com/Hotstuffvibe/status/1642405635563339778](https://mobile.twitter.com/Hotstuffvibe/status/1642405635563339778)\n\nPersonally I do find it uncomfortable in front of woman who is in bikini as a straight man but this is because I was raised in family and environment where no one wore bikini.\n\nTechnically no logical man should have problem with what dress a person is wearing as long as that person do not troubles them physically or verbally. I shouldn't have any problem with her if she is minding her own business.\n\nBut twitter community is bashing that woman saying its not modest and are being typical Indian aunty. Now they are the same women who get irritated when Indian aunties refrain their daughters from wearing tight short jeans or tank tops. \n\nSo my question is where one is supposed to draw the line? I kind of do agree with twitterati but that's because I was raised in similar environment. I hate burkha and at the same time I hate bikini but it should be my personal choice. I do feel uncomfortable but its my personal problem right?",
    "flair": "Rant / Vent",
    "score": 17,
    "num_comments": 254,
    "created_utc": 1680435630.0,
    "convurl": "https://external-preview.redd.it/wkrrNVANvuRbRpNec-_onCSl7CvZXj7FtR1MEJyIMAY.jpg?auto=webp&v=enabled&s=797d1322fc094a80aabef004120650e685798f71",
    "comments": [
        "I have no problem with it, and likewise people should not have problem with it, otherwise they should just drink gau mutra.",
        "I have no problem as a gym-rat I should be allowed to show my juiced up physique as well, and should not get accused of harassment..",
        "Exactly. I do show my biceps (though they are not great :p).",
        "There needs to be a law against people making videos of others without their consent. This shouldn't be allowed.",
        "True. Clicking photo is only illegal thing I see in this post.",
        "There are clothes for every occasion. They are not at the beach, not in a club pool, then why that kind of clothes. It's only normal or people find this weird. It's like going to my wedding with a tshirt and flipflop: it's not forbidden, but I can't expect people to find normal.\n\nWith that in mind, they can wear whatever they want and I'm not entitled to say anything to the person if not asked. Especially take a picture without their acknowledge and approval.",
        "Again what if they are even nude? Nudism is a thing. Now don't say laws are there to prevent it. We are not talking about laws but about morality.",
        "Seen more in UK , absolutely  fine with whatever  one chooses  to wear as long as they're  not Naked ..",
        "What's your personal opinion on someone naked in public. Not talking about laws.",
        "No thoughts",
        "Won't be comfortable  ,have been to nude beaches nd  was super  awkward for obvious  reasons .",
        "Obscenity and nudity in public place is illegal (Section 294, IPC). If a man walks in an underwear, I’d be uncomfortable.",
        "You be like -  Why to waste my brain power on random post over internet.",
        "She maybe part of some kind of social experiment.",
        "Mentally she's in Los Angeles.",
        "Yup I would feel uncomfortable too but that's because I wasn't raised in such a environment. And we are not talking about laws but morality. Laws can be changed.",
        "Or maybe she is doing publicity stunt as people are saying. But its fine because this gave a opportunity for people to express their opinion.",
        "Dials the AC down to seventy ✋️🍆",
        "So can morals. They are subjective too. But it is an unsaid rule that order is to be maintained. Freedom of choice is not absolute, it is restrictive, and should be, otherwise even a murder is justified, it could be moral for someone, who are we to judge?",
        "\"juiced up\" I mean not entirely natural Lol \n\nI used to take MK677 for faster recovery with creatine and bulked up pretty hard then dropped mk completely and maintaining it naturally..\n\nYou can get pretty big if you bulk naturally with creatine alone tho..",
        "No. Clicking photograph is not illegal in public place as there is no reasonable expectation of privacy in this case.",
        "That's preposterous\n\nWhich station was she last seen? So I can avoid her",
        "Ok got it. Will focus on muscle building as soon as I start working in 6 months.",
        "People who wear inappropriate clothes for respective place or occasion should understand that they're absolutely being idiots. You don't wear shorts for interview, you don't wear stylish clothes inplace of uniform, you don't wear suit on the beach. \n\nHence if anyone find you or your clothes unusual or out of place then you are in no position to complain for their uncomfortable way of treating you. You chose that.",
        "If you ask me, that's not even a bikini. The only way she can reveal more b**bs is by putting cellotape on nipples.\n\nIt's not illegal, everyone should have freedom of choice. But that being said, having sense of dressing appropriately according to occasion is also important.",
        "Murder is affecting others so murder is not synonyms with way people dress. Thing is there are few communities asking women to cover themselves from top to bottom. Now they might get uncomfortable seeing a woman who is wearing short jeans. So by this logic woman should cover themselves fully as some or other person would feel uncomfortable.",
        "extremely hard to implement. what if someone goes on top of a beautiful mountain but there are lot of people around. it would be impossible to even click landscapes",
        "She may have lost a bet and doing her obligation. Gotta man up sometimes 😉",
        "There was another video a few days back, same kind of bikini in beige colour. That girl had a huge black bag & was seated in the Delhi metro.\n\nThis is not one off occurrence.",
        "You do have a point here, it is difficult to draw a line because one can’t please everyone ever. I guess, it is best that when in Rome, do what the Romans do.",
        "That's the thing: people don't usually wear bikinis far from the beach in LA. Only at the beach and touristic places.",
        "guess me bhi  underwear me metro me jauga",
        "> having sense of dressing appropriately according to occasion  \n\nThis is what whole post is about. If you show woman in tank top or even normal jeans pant to people 100 years back in India they would feel disgusted. They expected women in sarees only. Now a average woman wears jeans so we don't have problem with it but we have problem with bikini or nude. So what exactly is appropriate or we should just do whatever person wish to do",
        "If people can wear whatever they want, why aren't they allowed to not wear anything?\n\nWhat is the justification behind drawing the line at nudity?",
        "It's a public place, nothing illegal in taking pictures.",
        "Agreed.",
        "Why does it suddenly matter if they're nude? According to your logic, we shouldn't care what other people are wearing or not wearing.",
        "You can anything, but in a society there is unspoken rule which governs what is deemed appropriate to wear in certain places. Such clothes shouldn't be used in family friendly places. If i am with small kids in a metro i will be visibly uncomfortable if someone sits wearing that.",
        "Have been to nude beaches nd it draws glares nd unwanted attention, and unfortunately  in a country like India it wont be limited to glares or  attention.   I mean some comments below the above tweet have literally  tweeted \" And then they complain when women get raped \"",
        "A person raised in burkha/pallu environment would feel uncomfortable in front of woman wearing jeans. Few years back in my extended family girls were not allowed to wear shorts. And now teenagers are wearing shorts as staple. Small kids do not find anything wrong its elders who teach that this is wrong and then it becomes taboo.",
        "I guess this is a direct reply to all those Indian aunties who wear saree at the beach.",
        "That looked some kind of dare. It doesn't look like a regular bikini.",
        "Abe doofus, no one was raised in such an environment. Tell me which family conditions their women to wear bikini in a crowded metro train?\n\nThis was a stunt done clearly to get publicity or to make a statement. \n\nOnly idiots will take it seriously. Looks like you are one of those.",
        "What???? Why does burkha/pallu matters here? That's just stereotyping others. Most people would be uncomfortable if someone wears that.  It would have been different case if she wore it in a beach 😅 but not there.",
        "Just cheap publicity stunt",
        "Uske kapde nahi Tumhaari soch choti hai /",
        "You hate women in burkha, I hate women in burkha but I personally know people in my society who wear pallu when their in-laws visit their place.",
        "This might be true.",
        "Wearing bikini in metro rail makes no sense unless done for fighting against the prevalent sexism. I have seen enough women in bikini and so I am comfortable with it. Modesty is a cunning way of imposing patriarchy.",
        "Now if anybody catches or pinpoints her, all the feminists will come out with protests of Her Life Her choice and insta wokes will start calling Indian society regressive preaching dirt n vulgarity is in another's eyes kind of lessons 💩💩",
        "I will be uncomfortable if a man walks without an underwear.",
        "I don't hate women in burkha. If they want to wear it they can none of my buisness, as for pallu it's still their choice although in-laws shouldn't force it. \nWe are no one to govern what they wear. Especially when our country is so famous for women safety if u know what i mean",
        "Would you find it weird if you see a man on a metro in his underwear? I would. And for the same reason this too is uncomfortable for me. There is a time and a place to wear what you wear. She can also show up like this at her office and bash people for not letting her wear what she wants. Technically no one is wrong in this situation but from a social point of view it is not acceptable.",
        "This could mean people video taping stuff like police violence or crimes can get into trouble for it.",
        "Those flats are atrocious and the whole look is not that coherent. Like your choice but payal with flats and then something random on top. Another thing i don't think this is  a bikini just a verrry short skirt. That's all. I m a big fan of wearing something that is appropriate for the occasion in this case metro. And if this is a publicity stunt then they should have chosen something better.",
        "If people think how come Indian males have such a bad reputation in the entire world. Just go through the comment section where the small dick energy of these misogynists is in full display. It is tatti people like these who come to our Delhi and rape women.",
        "I don't want someone's bare ass cheeks touching the seats on buses/trains. If they're wearing shorts, at least there's still a cloth barrier. I don't care if they're showing their breasts/chest.",
        "Down to 70°C, how do you live? You should move to someplace metric, we have better weather",
        "Nah i think more like blood is diverted somewhere else",
        "Exactly. Though they wear a little revealing clothes but not bikini",
        "I don't want someone's bare ass cheeks touching the seats on buses/trains. If they're wearing shorts, at least there's still a cloth barrier. I don't care if they're showing their breasts/chest.",
        "It could be considered wrong clothes at the wrong place. You don't wear a suit and uniform while swimming on the beach, you don't wear bikinis while visiting family shrines or graves or temples. So its normal for people to find it weird wearing a bikini in public transport.",
        "Where do you draw the line though? What would one objectively define obscenity as? \n\nI honestly don't care but I want to know what you think about it OP.",
        "![gif](giphy|jtm3wo9YEvMwU)",
        "Tbh with u, I have no problem with nudity, to each their own",
        "U know what, she shouldn't care",
        "I see uncovered men all the time. She can wear whatever the hell she wants.",
        "Pahile paragraph me tum bol rahe ho k tum khud uncomfortable ho,\nDoosre paragraph me tum khud logic bata kar ghoshit kar rahe ho k koi farak nahi padta\nFir Teesre paragraph me fir se bol rahe ho are ye twitter k log hi galat hai, hypocrite.\nAur last paragraph me to tumne hadd hi kar di, tumhe Burkha pasand nahi hai, bikini bhi pasand nahi hai, upar se tum ye bhi bol gaye k mai twitter k logo se sehmat hu.\n\nYe kya hai OP? Tum downvote se darte ho kya? Tum safe play kar to rahe ho par wo jam nahi raha.",
        "You know if you only see a picture of a nipple with everything else cropped out it's often impossible to tell if it's a man's or a woman's?",
        ">I can avoid her\n\nAre you sure you're gonna avoid her💀",
        "Where do you see uncovered men though?",
        "Trashy.",
        "Me uncomfortable feel karta hu par iska matlab ye nhi hai ki me logon ko apne khud ke principles follow karne keliye lagau. Agar me bikini friendly environment me hota toh mujhe fark nhi padta. Isiliye me logon se thoughts puch raha hu ki tum log kya sochte ho.",
        "Younger me would have said that woman should wear tshirts and jeans (till knees). And this is what I wear too. Now if you ask me I would say I do not have problem with nudism and if I build nice abs I would go shirtless in public.",
        "But seriously want to know what is going on? Twice in a week, there has to be some logic behind this. Pata karo Abhijeet!\n\n![gif](giphy|jqNIs68roiCW2bNePc|downsized)",
        "Tbh ppl would definitely come at me for this but imo there is a decorum and discipline with respect to clothes also, there is a reason why we wear school uniforms and why we don’t roam naked in public places or wear a wedding dress in parks or wear a full shirt and jeans playing football or any other such sports or wear a tuxedo going to theatres to watch a movie, now ppl have their freedom they can wear whatever they want but with that freedom they also have to use their braincells of what to wear or what not to wear at certain places, its not about being woke or progressive, its about being sensible.",
        "That and there would always be those scum of our society who'd point at something like this and then go ahead and justify rape in the same breath.",
        "If a man walks in with underwear, he gets to face the police...",
        "I'm all in for dressing up the way you want to. People should have the freedom. But public nudity or borderline nudity is where I draw the line. There are plenty of underage people being exposed to this stuff and that is actually vile, disgusting and predatory behaviour. Again it's not just women but men as well.",
        "Agreed.",
        "Yes this is double standards of our judicial system.",
        "Surprised she did not get arrested. This is why I have more respect for Muslim girls/women.",
        "Even without creatine. Creatine helps, but isn’t something magical",
        "You respect them because they are submissive?",
        "And you just did.",
        "No I meant inside Delhi Metro.",
        "Yes, that's a point to think about.. 🤔",
        "ok i deleted",
        "Where is the NSFW tag?",
        "I kinda disagree with the 1st point though, its in a public place, there are no dress codes for public places, secondly its not uncommon to see people in bikini in public places in the western world, even in countries of south america its common to wear swim wear in public and lastly she could have come from a swimming pool so she just kept wearing that its not that crazy in my opinion, she's also covering the bottom part with a skirt so I don't think its a big deal",
        "Let people wear whatever they want.\nFree the nipples ? Sure go ahead.\n\n\nKids as low as 10 knows what these are and as long as its not outright nudity n they r not trying to shove it down my throat, in my eyes its ok.\n\nAlso please let me know where you found her. I need more info on this so i can avoid her. I need information For Research Purposes.",
        "walk into the elevator and stand facing the opposite side ...",
        "I wish people gave a crap about actual problems instead of some moron with a terrible sense of fashion. I mean, if you're gonna dress provocatively, at least do a good job at it...that outfit is utterly tragic. Let's move on from this and focus on shit that matters.",
        "No one should have a say in how you can dress and how you cannot.\n\nThat is, the law shouldn't say anything and the person , whatever they're wearing, are entitled to legal protection from harassment and likes.\n\nThat said, we do have the right to judge them as \"not decent people\" and avoid them as much as possible.",
        "I am wondering how was she even allowed to enter the metro ,the security stopped me once when my shoes were a little muddy",
        "I mean she is on a train with only a bikini on, she is definitely asking for that attention.",
        "looks like a PR stunt \n\nthats not even a bikini \n\nalso one question is not she feelimg the chills",
        "So you are moral police to decide what she should wear or not?",
        "Balls of steel on that woman. A woman. In Delhi. Bikini.",
        "That's a spoken dress code. Wearing cowboy on the streets of Chennai is not immoral, but no-one does, so it's a unspoken code.\n\nAnd if you go to cities like Barcelona, Rio, LA etc, metro cities with beachfront, you not gonna see people walking far from the beach in bikinis.",
        "No I respect them because they have self respect and don’t dress like a ho and copy trashy movie clowns",
        "So this is the first thing i see on internet on a nice sunday morning.",
        "Yeah than you meant to say one can be nakedness metro.",
        "Gonna check the post now 😋",
        "And who said that isn’t uncomfortable to look at?",
        "I think you should we wearing whatever is considered normal in a country. Bikini is swim wear. And doesn't make sense to be used in metros or buses. Having said that, there is no need to involve law or new rules to take care of that.",
        "There is a section of our society that would get uncomfortable looking at a scantly clad female. That section includes both male and female members. Given the reaction to this photo, she definitely made that section uncomfortable. I genuinely wish she takes more rides in the metro in a similar attire.",
        "So butt naked uncle with a towel in hand is ok. He can put it on seat and sit.",
        "Probably publicity stunt. Looks like she is carrying something to cover up like a gown.",
        "🤣\nAnd if anyone dresses up like the ho you mentioned she is declared not to be Muslim or worse killed.\n\nSo that's convenient.",
        "Kya hi bolu ab.",
        "Ye kya baat hui? Tum khud k thoughts logo par nahi laadna chahte par tum khud logo se unke thoughts puch rahe ho? Khud soch kar dekho.",
        "attention seeking wannabe American. Europe mein bhi essa qtiyapa dekhne nahi milta",
        "No i am not, nor did i ever say if what she did was right or wrong. I just said that it was intentional but it seems that you \"Assume\" a lot of things.",
        "Nah. We no thoughts people would simply look at our mobiles or turn around in this case. Not hurting me.",
        "Yes, it's annoying that there's even a debate on this because it's no one else's business.",
        "We'd be safer as a country if we just let everyone wear what they want. Seeing this as a top rated comment justifies why India is a backward country and even the youth or tech savvy are backward idiots who deserve everything they complain about.",
        "Let me tell you as a straight man I HAVE NOOOOO PROBLEM WITH WOMEN WEARING BIKINIS IN DELHI METRO OR ANY OTHER METRO.",
        "Yea I've never seen a man in an underwear/ swimming trunks in a metro if he was then he's get beaten up",
        "Maybe she got inside the train and then wore it",
        "Is it a ladyboy from Thailand?",
        "I think those people who thinks that she wants attention assumes lot of things.",
        "Whatever it is.. it's none of our business.",
        "Don't care.",
        "one man went for jail i guess",
        "You know that kids travel in metro too right?",
        "Hear me out..... What if her friends pranked her and made her do this?? And maybe she had no choice but to just face the issue.",
        "Wow, it has a built-in condom",
        "This is the same person",
        "Photography is not permitted in Delhi Metro. https://www.delhimetrorail.com/faq-miscellaneous",
        "Let people wear what they want. Judging them for it is small pp energy.",
        "Is this some brand doing some attention seeking campaign, the other girl was wearing a similar bikini but in white who was called out on Delhi metro. This girl is wearing a blue and black one.",
        "It's our business. If a man goes in metro wearing only  shorts,  woman would file  complaint against him in police. Same standards should be applied for women. India should be egalitarian society, niether feministic nor chauvinistic one.",
        "Fair enough. So, cctv are in contradiction to their own rules? Just curious. Why a rule is different for establishment and customers in a public place? Also, is this rule enforceable in court?",
        "Imagine a man travelling in metro who is wearing clothes similar to her. Will that be objectionable? Why? Why not?",
        "This is from twitter,\n“Hi. Photography in public areas of Metro station & train is permitted for bonafide passenger for personal use only and prohibited for commercial use or publication by any means. The act of photography should not infringe the privacy of co- passengers at any time.”\n\nhttps://twitter.com/OfficialDMRC/status/1205026087874351104?s=20",
        "Infringement of privacy is complex matter to prove. A person can be naked at home because it’s private but he can’t expect privacy when he is naked in public. Some exceptions would be breast feeding or upskirt situations where a Person can expect privacy from people around them. I still think this lady can be photographed normally without any repercussions for the photographer. Not a legal expert though",
        "I wouldn't be comfortable around a woman wearing a bikini in a metro. They are not on the beach or pool.   \nThese wannabe feminists doing such dumbsh\\*ts. Imagine a man wearing only underwear traveling on a metro. Don't you feel uncomfortable?",
        "How do women feel if all men started wearing underwear in the metro? Wouldn't it be uncomfortable for them?",
        "Hmm.... If that was a dude in just tight short swim trunks in the metro would he be even allowed past the first security check in a metro?",
        "And you're being downvoted for asking a fact. Why though?",
        "Personal liberty ke naam pe launde c-string pehnkar metro mein chadhne lage to sabse pehle ye hi shor machayenge.\n\nSad part is ki young women think this is women empowerment, they are not far from being very wrong.",
        "Your discomfort is your problem. In a free society, you should be able to wear whatever you want. I find overt displays of religion very uncomfortable but I don’t go around demanding we ban/stop that.",
        "Noone will file a complaint if man wears shorts.",
        "I am fine with whatever people wear, even if they wear nothing.",
        "It is a tangential question but what decides the etiquette of dressing? I do understand that you don't wear suit in beach, it would be generally too hot, uniform is used to reduce the difference between the people, but why can't you wear shorts to interview. Wonder how that came to be so.",
        "India ke 60% log aise hain jinko Agar ye cheezein buri bhi lagti hain na tab bhi wo public ke saamne insult feel karte hain ye bolna ki ye galat hai. Lol. Sabko yahaan western kapde pehenne hain. Baaki development jaaye tel lene. dumbass log",
        "Funny you mentioning this, because I was born in a country where people have really small clothes, due to the weather.\n\nI'm not even have a Indian origin.",
        "I'm think she's a sex worker. Literally nobody else can do this in the metro. She's also wearing payals. This is what sex workers look like in the red light areas.",
        "Sex is sexual, women's bodies existing is not.",
        "Because it demonstrates the same backward thinking. Let me clear it up.\n\nSex is sexual, women's bodies existing is not.",
        "Ok",
        "What if he doesn't wear anything on upper body.",
        "Feminism to the max",
        "Is her clothing causing you any harm? Defend individual liberty or you’ll soon see someone having a problem with something you’re doing for no reason.\n\nhttps://en.m.wikipedia.org/wiki/Harm_principle",
        "Lol I wonder why some beaches are adult only if that is your argument. It's not even about women bodies. It's about male bodies too. If there are kids around, maintain some modesty",
        "Backward thinking? Last I read we had to travel a lot in our past to reach this point in time to be able to cloth ourselves to shield us from the elements.\n\nCave men walked around in rags. Not modern people living in a civilized society. And to make it more clear to you, children of all sex's and gender expressions use a metro which is a public platform and these children come from varying socio-cultural and economic backgrounds. So they will be disturbed by this, find it uncomfortable, curious or arousing. That's why we have a law against indecent exposure. \n\nNow perform the flip test. A test used in such scenarios which is very common when confronting such foolish delusions. What if it was a man in tight short swimming trunks? Would he have made it past the security clearance in a metro?\n\nBackwards thinking my ass. This is just creating a spectacle to attract attention and validation against the patriarchy in its shittiest form.",
        "\\> Be a man\n\n\\> Only wear a short boxer\n\n\\> Try and board the metro\n\n\\> Get arrested and locked up with S.assault charges\n\n\\> Keep yelling \"where is equality\" (There isn't) and \"it's no one else's business what i wear\" in vain\n\nThis shit she is doing is not cool.",
        "Clearly reading is not your strong suit. Do get to the second line of what I wrote",
        "The second line is irrelevant in this scenario. You would understand that if you had read what I had jotted down instead of trying and miserably failing to sound condescending.",
        "More progressive countries don’t have this distinction",
        "It's allowed as long as you are in public as it should be.",
        "Yep, moral policing is sometimes necessary.",
        "nothing wrong with it.",
        "\\*/s",
        "I see your comprehension is too low for you to understand why you’re backward",
        "Bhai mujhe lagta hai it's more about our culture and values which India is known for... Aisa chalta rha na to West or India me jo difference h culture and values ka wo jyada time nhi rh payega no wonder girls r moving towards no child no marriage lawda lasun.",
        "Well..., please do enlighten me. I'm open to suggestion, debate and discussion and willing to lend an ear if you are able to speak without sounding condescending, all high and mighty from the pedestal you stand on and look down to dictate to the rest of us.",
        "Isn't what you just said called body shaming.",
        "Nope we discussed everything question everything",
        "Exactly bruh",
        "No she was in public that not punishable",
        "That was my point",
        "Ye samaz ke saath kiya jane wala badtamizi hai jise kisi ko bhi bardast nahi karna chaiye samaz aur kanoon dono ka farz hai ki logon ko tamiz aur sabhyata ke daiyre main rakhe isse samaz ka image khrab hota hai dusre desh main to jail main dal dete bikni sirf beach main allow hai na ki sab jagah.",
        "Whose morality? Yours? Why should your morality be applicable to anyone?",
        "She is wearing something on upper body, tho.",
        "I think it's disgusting that someone took a picture to argue about clothing and it's disgusting that you are sharing this picture here to argue the same thing.\n\nThe person in the picture has a upper body and a lower body garment. They obviously got in through the metro entrance and through the frisking of the guards. Once one is allowed entry, it isn't anyone else's business. \n\nAlso, the 'if I...' hypothetical is ridiculous. If you want to make a comparison, go through the frisking wearing a upper body and a lower body garment like this and then comment. Hypotheticals are hypotheticals.\n\nOn the other hand, I do like it when misogynists expose their biases openly so people in their life can be careful with them in the future so maybe something good is coming out of this post.",
        "What is difference between wearing that thing and not wearing anything. when women wears bikini , Man only wears shorts.",
        "The difference, which is clear to sane people who are not moral policing is in this case, there is no public nudity. If there were nothing, it'd be public nudity. Simple! Doing ifs and buts, doesn't change that the person has a upper body and a lower body garment. If you want to go in the metro wearing a similar upper body and a lower body garment, be my guest. Anything other than that is just word vomit. We are not comparing beach wear. There are two garments in the picture. Wear two garments and go in a metro if you want. Why doing ifs and buts? The person in the picture boarded the metro from the entry gate. You have my full support in boarding a metro wearing exact outfit if you can make it through frisking which they did.",
        "Moral policing , huh . Even if I am doing moral policing,  I am better than what she is or you are doing. It is ruining the cultural environment of place. There is time and place for everything. Can you go nude on metro , you can certainly go nude on nude beaches or voyeur club.",
        "apparently photography is prohibited on delhi metro so according to the rules the “person behind the camera” is at fault not the girl",
        "I am not going in circles. This is the second time you have brought up nudity. I responded in simple words earlier too that this is not nudity. Nipples and genitals are both covered. Your argument whether you like it or not, is on the length of fabric. Length of fabric is not how nudity is defined. If a woman had a full length gown with holes cut in it for nipples and genitals, it'd still be nudity despite the size of the outfit. \n\n\"Even if I am doing moral policing\", maybe the fact that your arguments about environment of place are the same arguments Bajrang Dal uses to harass women should make you think a little.\n\nThere's an Indian mythological story in which multiple men mention that since the woman has already done X (married 5 people), then there is no problem in her being nude in the assembly. Your argument of \"if she is wearing X, she might as well as be nude\" is a lot like that.",
        "Mujhe lagta hai.. ki iske bf ne iski khoob li hogi... Aur fir kisi dusri ke liye isko dump kar diya.. to ab ye usko jallaane konaise nangi ghoom rahi hai .",
        "Can somebody tell me why were they wearing those clothes? Like is it a viral stunt or were they trying to create outrage?",
        "Chalo thik h\nMe bhi underwear me ghumta hu bhar 😋",
        "I totally support this behaviour...more should follow it. Her choice is not killing anyone it will only increase the revenue of the metro and more people will use public transport ..",
        "Why wear the anklets? Weird fashion choice",
        "Damn. Good point of view. Traffic will be less.",
        "He should have atleast blurred the face before sharing. Just because someone is wearing clothes like doesn't give anyone rights to record them. People are just sick. They want some fun and gossip in their life and this is how they gets it.",
        "Hey it is not even going about marriage. Thier marriage was approved by thier family and society. Same thing is currently being practiced in certain parts of india. So I am not even talking about polygamy. It is illegal in India and most of part of world ,whether it is for man or woman. The poeple who had seen her naked in assembly,  most of them got annihilated alongside thier extended family and mahabharata war was fought. Don't bring mythology into present circumstances.  You are type of poeple who would cheat on thier spouses and tell him on face that it is feminism and allowed. While I don't agree with what Bajrang Dal is doing , I also don't agree with your fake feminism.",
        "She needs new friends asap if that's the case",
        "Lol,70 °F AC (USA metric)",
        "The projection of power and respect is a very real thing and everyone judges everyone else on sight alone. You've been conditioned to believe Shorts are something \"casual\" or relaxing. Why the fuck would I want someone like that when I have a similar person \"looking\" much more productive and willing to work? In the end its all a matter of perspective. As long as society views things in a certain way, you using them will associate you to it.",
        "False equivalence.",
        "Yup! For sure.",
        "Feminist tyranny",
        "I think she went a little overboard wearing those kind of clothes. While I do agree that women and girls have full right to wear whatever they want to, going vulgar is not acceptable. There is difference between being classy an going vulgar just for seeking attention. For instance, if a man roams around in his undies in the same train, he would defined be penalised for the very same reason. . I believe people can go to any extent in their zest to seek attention. This is my personal opinion.",
        "Tyranny would be if something were being imposed on you. You are the one who is looking to impose and then getting offended that people are not agreeing with you.",
        "If you’re in a public space? Really?",
        "Like you are imposing you pov on me.",
        "How does one impose poverty? 🤣",
        "It's point of view (pov).",
        "Well, skimpy outfit is not an undearwear",
        "Hahah\nNice.\nTrue didi.\n\nYou missed the whole point.\nBut true.",
        "Nope\nYou can't judge .\nShe's free to wear anything she wants.\n\nDon't call a murderer a murderer \nYou stupid.\nUske kapde nai Teri soch choti hai.",
        "No they don't they would say.\nYou can't win man.",
        "True.\nA human found a knife.\nHe kills his neighbours with the knife.\n\nPolice came in to arrest him saying you did a crime by breaking a law.\nHe said your laws are your problems.in a free society I am not restrained.\nNeighbours children came said he did a bad that ng by killing their parents and children miss their parents now.\nHe says you miss your parents it's your problems.\nThey were your parents\nNot mine.\nSo your problems.\n\n\nThank you my friend to give me this awesome idea.",
        "Hahaha\nNice.\nNipples no issues.\nBut also give me her location.\n\nNice brother.",
        "Arey doston yeh 2 takke ki ra*nd hai , publicity stunt hai , viral hone ka naya tarika , don’t give  attention to such kind of people , marne do saalon ko",
        "Lmao, bitch get back to the kitchen",
        "Bitch stfu, you have a 2 digit IQ.",
        "Not sure what to think but I don't think that she should be arrested as many people are saying, neither should she be harassed for her choice of clothes. With that aside, people have the choice of not liking her fashion choices as long as they remain civil about it.",
        "Here's a good way to analyse/judge any situation/people:\nFocus on the intent, not on the act itself or \nकर्ता को देखो कर्म को नहीं\n\nSo for dressing etiquette, if we see someone wearing bikini in a metro we should be asking \"why\" would that person even wear it? The answer is mostly mental health issues, entitlement, insecurity, seeking validation or simply some cheap publicity.\nSo it's not the bikini/shorts that's problematic, it's the inherent motives of such people. If there is a justified intent behind breaking social convention, please do so",
        "Thanks for the explanation! I am not defending wearing bikini in metro. It has too many people, metal surfaces, may cause injury to skin etc.\n\nI am asking why some social convention are made around dressing? Like wearing shorts to interview is bad. Somedays ago there was an add where a man went to a party in a dhoti. It was probably shown as a break of convention but still you will not find people wearing a dhoti in party. Why is this convention. How to judge which convention to break?",
        "Go suck down some gomutra that should help",
        "Its okay as long as it’s in every generic bollywood films but not in the public 🗿",
        "Naaa gaand na chuchii ,, paetreee uchii uchiiii",
        "Exactly! Fashion and vulgarity are mutually exclusive",
        "Maybe no but the point is, she is not even wearing a underwear 😭",
        "True and why we are comparing with other countries? All these things depend on society and culture.\n\nShorts are okay in metro cities but if u will wear the same in a village people will treat you differently bcz they are not accustomed to see women in shorts. Hence it can lead to rapes and molestation. \n\nBcz for those men a women wearing shorts is so arousing. They never saw anything that revealing before.",
        "No man, clothes has nothing to do with rape. You can be aroused however you want, but you only force a person to have sex with you because you think you can make them.\n\nRape is about power, not about sex. So there's nothing to do with clothes.",
        "That’s the biggest myth of society. If a man is having bad sex life or r single than he can be aroused really easily. Depends on person to person.\n\nThan comes moral values. If a person have good morals than he will control the urge and if not and the situation is appropriate than they can lead up to molestation or even rape.\n\nI myself feel so aroused when I see girls in short or revealing dresses. It’s just my moral value’s which is stopping me to do anything wrong.",
        "I have no issue with her but at least wear a proper bra that doesn't look like it's gonna fall off. The bra looks like it was made by someone who doesn't know how to sew clothes and has never seen an actual bra before.😭 And the skirt too. It just looks bad. Wear a proper miniskirt that doesn't look like it's been torn by my dog. It looks like a rag .\nThis will not even get her message across. She could have worn a sports bra and shorts. Instead of an outfit that looks like it's stitched by my cat.\nI understand she says celebs wear these things . But where do they wear it? On red carpets and events. Not while traveling. Noone wears that when they travel because\n 1) it's uncomfortable for yourself\n 2) it's not a beach it's a public transport \n3) germs. The seats have germs. I don't want my bare skin to touch the seat. \n4) AC. It's cold if you wear this\n5) did I say how many germs are there?",
        "I'm a woman and even i would feel uncomfortable. If it's a beach I'm fine but this isn't even a proper bikini. It looks like a diy bikini and the whole outfit doesn't match well and looks like it's stitched by my cat",
        "It looks like two masks stitched together to make a bra to me..I can give her a proper bra to wear if she wants to. I have a lot that look nice 😭",
        "Yes pls police people’s clothing, we all should heed to the words of joamsneto whenever we step outside 🙏",
        "Wtf u on about lmao\nPlentyyyy of adult only beaches in USA where people where skimpy or no clothes",
        "Enjoy your primitive society dumbfuck. Your thoughts are making it that way.",
        "Why thank you very much, i will enjoy a society in which borderline nudity is not allowed in public places",
        "Women deserve whatever delhi is famous for",
        "Based based based.",
        "Yes i am ;))))",
        "India will go through the similar fate America is going through when some people collapsed the entire culture of decency. I don't give Fs to what you wear but would it be okay if I wear lose pajamas and have boners in public, on purpose?",
        "Hmm I don't understand what's wrong in what he's asking. He's just asking for your opinions, what's wrong in that ? He's already given his opinion, he's saying that he's not comfortable with women in bikinis, etc. but he's not going to ask those women to wear differently or anything.\nHe's said the most harmless thing, I don't know why he's getting so much downvotes.",
        "I think he's saying that he finds uncomfortable seeing women in bikinis in general, and that his close people are more conservatives who never wear bikini even in beaches, maybe don't even wear less revealing clothes.\nIt's not about \"conditioning\", but some families are more open to their women wearing revealing clothes like crop top, shorts etc., some or not.",
        "...Except that's exactly what he's saying so I don't know why you are lecturing him.",
        "Sorry to break it to you, but even most of USA prohibits things like \"indecent exposure\", \"public lewdness\", \"public indecency\", \"disorderly conduct\" in most states.\nI don't know where you got that information from, maybe from watching movies or something, or maybe it's just ignorant speculation on your part to sound cool & modern.",
        "kaun se station se chadhti hai ye maadam",
        "also u can enjoy your modern progressive society but only in dreams.",
        "this is wrong if people are having trouble with what you are wearing then it should not be allowed imagine families sitting there the parents trying hard to not let their children see that   \nit's all fucked up and i dont support this   \nthis is not beach",
        "lmao as long as the kitchen is *away* from you 😆 we'll gladly go. Seriously, you're a woman repellant 😆",
        "American here, we wear whatever we want, as long as your genitals aren't showing 😂 Nowadays in Miami you see things bikinis. I'm not that brave lol, but a lot of women wear them. \n\nI'm from a poor part of the US & in my neighborhood you could wear literally anything. You see club clothes being worn in daylight 😆 However you do have men who will sexually assault you, with this same backwards mindset. 🤮\n\nThat being said, I'm looking for a bikini right now, that's how I found this thread. I didn't realize it was such a polarizing topic here 😅 Obvs I'm just wearing it on the beach. But I figure I'd get a long beach skirt to wear with it while not swimming. That's my compromise lol. Hubby is Tamil & he doesn't care. I def started covering more since I've been living in South India. Just bc I don't want the stares. \n\nSorry for the long comment, just figured I'd add some more context to the convo 🙏🏻",
        "hello sir, I am just asking you, will you wear dhoti in your office, will you wear suit at your home on a casual day or at dinner time?\n\nif yes, then wearing bikini anywear is fine\n\nIf no, then it should be worn on beeches or while swimming or at a proper place.\n\n  \nWearing anything is not wrong when you wear a particular cloth according to the setting of the place.\n\nNo matter how much we say that society doesn't matters, but sorry, it does, not every time but sometimes it does, specially when your act makes someone uncomfortable then it surely does, society mei chahe vo boy ho yaa girl, behave karne kaa ek tareeka hota hai.\n\nIf everything is everyone's choice then being a girl I am saying ki chalo boys, kal se start boarding in metro just in unds, then lets see how many pseudo feminist will support you.\n\n  \nIn fact even I should start walking with a snotty nose, or just snot coming out of my noce or just dandruff falling all around the place from my hair.\n\nafter all its my body my choice whatever I wanna do with it let me do, if you don't like then just stay away.\n\n  \nkar do downvote jisko bhi karna hai, I don't care.",
        "These are pseudo feminists, I mean they want their rights but see how they are body shaming other people."
    ],
    "cleaned_text": "thoughts woman bikini delhi metro recently post going viral woman wearing bikini delhi metro httpsmobiletwittercomhotstuffvibestatushttpsmobiletwittercomhotstuffvibestatus personally find uncomfortable front woman bikini straight man raised family environment one wore bikini technically logical man problem dress person wearing long person troubles physically verbally shouldnt problem minding business twitter community bashing woman saying modest typical indian aunty women get irritated indian aunties refrain daughters wearing tight short jeans tank tops question one supposed draw line kind agree twitterati thats raised similar environment hate burkha time hate bikini personal choice feel uncomfortable personal problem right ",
    "cleaned_title": "thoughts woman bikini delhi metro",
    "cleaned_selftext": "recently post going viral woman wearing bikini delhi metro httpsmobiletwittercomhotstuffvibestatushttpsmobiletwittercomhotstuffvibestatus personally find uncomfortable front woman bikini straight man raised family environment one wore bikini technically logical man problem dress person wearing long person troubles physically verbally shouldnt problem minding business twitter community bashing woman saying modest typical indian aunty women get irritated indian aunties refrain daughters wearing tight short jeans tank tops question one supposed draw line kind agree twitterati thats raised similar environment hate burkha time hate bikini personal choice feel uncomfortable personal problem right",
    "cleaned_comments": "problem likewise people problem otherwise drink gau mutra problem gymrat allowed show juiced physique well get accused harassment exactly show biceps though great p needs law people making videos others without consent shouldnt allowed true clicking photo illegal thing see post clothes every occasion beach club pool kind clothes normal people find weird like going wedding tshirt flipflop forbidden cant expect people find normal mind wear whatever want im entitled say anything person asked especially take picture without acknowledge approval even nude nudism thing dont say laws prevent talking laws morality seen uk absolutely fine whatever one chooses wear long theyre naked whats personal opinion someone naked public talking laws thoughts wont comfortable nude beaches nd super awkward obvious reasons obscenity nudity public place illegal section ipc man walks underwear id uncomfortable like waste brain power random post internet maybe part kind social experiment mentally shes los angeles yup would feel uncomfortable thats wasnt raised environment talking laws morality laws changed maybe publicity stunt people saying fine gave opportunity people express opinion dials ac seventy morals subjective unsaid rule order maintained freedom choice absolute restrictive otherwise even murder justified could moral someone judge juiced mean entirely natural lol used take mk faster recovery creatine bulked pretty hard dropped mk completely maintaining naturally get pretty big bulk naturally creatine alone tho clicking photograph illegal public place reasonable expectation privacy case thats preposterous station last seen avoid ok got focus muscle building soon start working months people wear inappropriate clothes respective place occasion understand theyre absolutely idiots dont wear shorts interview dont wear stylish clothes inplace uniform dont wear suit beach hence anyone find clothes unusual place position complain uncomfortable way treating chose ask thats even bikini way reveal bbs putting cellotape nipples illegal everyone freedom choice said sense dressing appropriately according occasion also important murder affecting others murder synonyms way people dress thing communities asking women cover top bottom might get uncomfortable seeing woman wearing short jeans logic woman cover fully person would feel uncomfortable extremely hard implement someone goes top beautiful mountain lot people around would impossible even click landscapes may lost bet obligation got ta man sometimes another video days back kind bikini beige colour girl huge black bag seated delhi metro one occurrence point difficult draw line one cant please everyone ever guess best rome romans thats thing people dont usually wear bikinis far beach la beach touristic places guess bhi underwear metro jauga sense dressing appropriately according occasion whole post show woman tank top even normal jeans pant people years back india would feel disgusted expected women sarees average woman wears jeans dont problem problem bikini nude exactly appropriate whatever person wish people wear whatever want arent allowed wear anything justification behind drawing line nudity public place nothing illegal taking pictures agreed suddenly matter theyre nude according logic shouldnt care people wearing wearing anything society unspoken rule governs deemed appropriate wear certain places clothes shouldnt used family friendly places small kids metro visibly uncomfortable someone sits wearing nude beaches nd draws glares nd unwanted attention unfortunately country like india wont limited glares attention mean comments tweet literally tweeted complain women get raped person raised burkhapallu environment would feel uncomfortable front woman wearing jeans years back extended family girls allowed wear shorts teenagers wearing shorts staple small kids find anything wrong elders teach wrong becomes taboo guess direct reply indian aunties wear saree beach looked kind dare doesnt look like regular bikini abe doofus one raised environment tell family conditions women wear bikini crowded metro train stunt done clearly get publicity make statement idiots take seriously looks like one burkhapallu matters thats stereotyping others people would uncomfortable someone wears would different case wore beach cheap publicity stunt uske kapde nahi tumhaari soch choti hai hate women burkha hate women burkha personally know people society wear pallu inlaws visit place might true wearing bikini metro rail makes sense unless done fighting prevalent sexism seen enough women bikini comfortable modesty cunning way imposing patriarchy anybody catches pinpoints feminists come protests life choice insta wokes start calling indian society regressive preaching dirt n vulgarity anothers eyes kind lessons uncomfortable man walks without underwear dont hate women burkha want wear none buisness pallu still choice although inlaws shouldnt force one govern wear especially country famous women safety u know mean would find weird see man metro underwear would reason uncomfortable time place wear wear also show like office bash people letting wear wants technically one wrong situation social point view acceptable could mean people video taping stuff like police violence crimes get trouble flats atrocious whole look coherent like choice payal flats something random top another thing dont think bikini verrry short skirt thats big fan wearing something appropriate occasion case metro publicity stunt chosen something better people think come indian males bad reputation entire world go comment section small dick energy misogynists full display tatti people like come delhi rape women dont want someones bare ass cheeks touching seats busestrains theyre wearing shorts least theres still cloth barrier dont care theyre showing breastschest c live move someplace metric better weather nah think like blood diverted somewhere else exactly though wear little revealing clothes bikini dont want someones bare ass cheeks touching seats busestrains theyre wearing shorts least theres still cloth barrier dont care theyre showing breastschest could considered wrong clothes wrong place dont wear suit uniform swimming beach dont wear bikinis visiting family shrines graves temples normal people find weird wearing bikini public transport draw line though would one objectively define obscenity honestly dont care want know think op gifgiphyjtmwoyevmwu tbh u problem nudity u know shouldnt care see uncovered men time wear whatever hell wants pahile paragraph tum bol rahe ho k tum khud uncomfortable ho doosre paragraph tum khud logic bata kar ghoshit kar rahe ho k koi farak nahi padta fir teesre paragraph fir se bol rahe ho ye twitter k log hi galat hai hypocrite aur last paragraph tumne hadd hi kar di tumhe burkha pasand nahi hai bikini bhi pasand nahi hai upar se tum ye bhi bol gaye k mai twitter k logo se sehmat hu ye kya hai op tum downvote se darte ho kya tum safe play kar rahe ho par wo jam nahi raha know see picture nipple everything else cropped often impossible tell mans womans avoid sure youre gon na avoid see uncovered men though trashy uncomfortable feel karta hu par iska matlab ye nhi hai ki logon ko apne khud ke principles follow karne keliye lagau agar bikini friendly environment hota toh mujhe fark nhi padta isiliye logon se thoughts puch raha hu ki tum log kya sochte ho younger would said woman wear tshirts jeans till knees wear ask would say problem nudism build nice abs would go shirtless public seriously want know going twice week logic behind pata karo abhijeet gifgiphyjqnisroicwbnepcdownsized tbh ppl would definitely come imo decorum discipline respect clothes also reason wear school uniforms dont roam naked public places wear wedding dress parks wear full shirt jeans playing football sports wear tuxedo going theatres watch movie ppl freedom wear whatever want freedom also use braincells wear wear certain places woke progressive sensible would always scum society whod point something like go ahead justify rape breath man walks underwear gets face police im dressing way want people freedom public nudity borderline nudity draw line plenty underage people exposed stuff actually vile disgusting predatory behaviour women men well agreed yes double standards judicial system surprised get arrested respect muslim girlswomen even without creatine creatine helps isnt something magical respect submissive meant inside delhi metro yes thats point think ok deleted nsfw tag kinda disagree st point though public place dress codes public places secondly uncommon see people bikini public places western world even countries south america common wear swim wear public lastly could come swimming pool kept wearing crazy opinion shes also covering bottom part skirt dont think big deal let people wear whatever want free nipples sure go ahead kids low knows long outright nudity n r trying shove throat eyes ok also please let know found need info avoid need information research purposes walk elevator stand facing opposite side wish people gave crap actual problems instead moron terrible sense fashion mean youre gon na dress provocatively least good job itthat outfit utterly tragic lets move focus shit matters one say dress law shouldnt say anything person whatever theyre wearing entitled legal protection harassment likes said right judge decent people avoid much possible wondering even allowed enter metro security stopped shoes little muddy mean train bikini definitely asking attention looks like pr stunt thats even bikini also one question feelimg chills moral police decide wear balls steel woman woman delhi bikini thats spoken dress code wearing cowboy streets chennai immoral noone unspoken code go cities like barcelona rio la etc metro cities beachfront gon na see people walking far beach bikinis respect self respect dont dress like ho copy trashy movie clowns first thing see internet nice sunday morning yeah meant say one nakedness metro gon na check post said isnt uncomfortable look think wearing whatever considered normal country bikini swim wear doesnt make sense used metros buses said need involve law new rules take care section society would get uncomfortable looking scantly clad female section includes male female members given reaction photo definitely made section uncomfortable genuinely wish takes rides metro similar attire butt naked uncle towel hand ok put seat sit probably publicity stunt looks like carrying something cover like gown anyone dresses like ho mentioned declared muslim worse killed thats convenient kya hi bolu ab ye kya baat hui tum khud k thoughts logo par nahi laadna chahte par tum khud logo se unke thoughts puch rahe ho khud soch kar dekho attention seeking wannabe american europe mein bhi essa qtiyapa dekhne nahi milta ever say right wrong said intentional seems assume lot things nah thoughts people would simply look mobiles turn around case hurting yes annoying theres even debate one elses business wed safer country let everyone wear want seeing top rated comment justifies india backward country even youth tech savvy backward idiots deserve everything complain let tell straight man nooooo problem women wearing bikinis delhi metro metro yea ive never seen man underwear swimming trunks metro hes get beaten maybe got inside train wore ladyboy thailand think people thinks wants attention assumes lot things whatever none business dont care one man went jail guess know kids travel metro right hear friends pranked made maybe choice face issue wow builtin condom person photography permitted delhi metro let people wear want judging small pp energy brand attention seeking campaign girl wearing similar bikini white called delhi metro girl wearing blue black one business man goes metro wearing shorts woman would file complaint police standards applied women india egalitarian society niether feministic chauvinistic one fair enough cctv contradiction rules curious rule different establishment customers public place also rule enforceable court imagine man travelling metro wearing clothes similar objectionable twitter hi photography public areas metro station train permitted bonafide passenger personal use prohibited commercial use publication means act photography infringe privacy co passengers time infringement privacy complex matter prove person naked home private cant expect privacy naked public exceptions would breast feeding upskirt situations person expect privacy people around still think lady photographed normally without repercussions photographer legal expert though wouldnt comfortable around woman wearing bikini metro beach pool wannabe feminists dumbshts imagine man wearing underwear traveling metro dont feel uncomfortable women feel men started wearing underwear metro wouldnt uncomfortable hmm dude tight short swim trunks metro would even allowed past first security check metro youre downvoted asking fact though personal liberty ke naam pe launde cstring pehnkar metro mein chadhne lage sabse pehle ye hi shor machayenge sad part ki young women think women empowerment far wrong discomfort problem free society able wear whatever want find overt displays religion uncomfortable dont go around demanding banstop noone file complaint man wears shorts fine whatever people wear even wear nothing tangential question decides etiquette dressing understand dont wear suit beach would generally hot uniform used reduce difference people cant wear shorts interview wonder came india ke log aise hain jinko agar ye cheezein buri bhi lagti hain na tab bhi wo public ke saamne insult feel karte hain ye bolna ki ye galat hai lol sabko yahaan western kapde pehenne hain baaki development jaaye tel lene dumbass log funny mentioning born country people really small clothes due weather im even indian origin im think shes sex worker literally nobody else metro shes also wearing payals sex workers look like red light areas sex sexual womens bodies existing demonstrates backward thinking let clear sex sexual womens bodies existing ok doesnt wear anything upper body feminism max clothing causing harm defend individual liberty youll soon see someone problem something youre reason lol wonder beaches adult argument even women bodies male bodies kids around maintain modesty backward thinking last read travel lot past reach point time able cloth shield us elements cave men walked around rags modern people living civilized society make clear children sexs gender expressions use metro public platform children come varying sociocultural economic backgrounds disturbed find uncomfortable curious arousing thats law indecent exposure perform flip test test used scenarios common confronting foolish delusions man tight short swimming trunks would made past security clearance metro backwards thinking ass creating spectacle attract attention validation patriarchy shittiest form man wear short boxer try board metro get arrested locked sassault charges keep yelling equality isnt one elses business wear vain shit cool clearly reading strong suit get second line wrote second line irrelevant scenario would understand read jotted instead trying miserably failing sound condescending progressive countries dont distinction allowed long public yep moral policing sometimes necessary nothing wrong see comprehension low understand youre backward bhai mujhe lagta hai culture values india known aisa chalta rha na west india jo difference h culture values ka wo jyada time nhi rh payega wonder girls r moving towards child marriage lawda lasun well please enlighten im open suggestion debate discussion willing lend ear able speak without sounding condescending high mighty pedestal stand look dictate rest us isnt said called body shaming nope discussed everything question everything exactly bruh public punishable point ye samaz ke saath kiya jane wala badtamizi hai jise kisi ko bhi bardast nahi karna chaiye samaz aur kanoon dono ka farz hai ki logon ko tamiz aur sabhyata ke daiyre main rakhe isse samaz ka image khrab hota hai dusre desh main jail main dal dete bikni sirf beach main allow hai na ki sab jagah whose morality morality applicable anyone wearing something upper body tho think disgusting someone took picture argue clothing disgusting sharing picture argue thing person picture upper body lower body garment obviously got metro entrance frisking guards one allowed entry isnt anyone elses business also hypothetical ridiculous want make comparison go frisking wearing upper body lower body garment like comment hypotheticals hypotheticals hand like misogynists expose biases openly people life careful future maybe something good coming post difference wearing thing wearing anything women wears bikini man wears shorts difference clear sane people moral policing case public nudity nothing itd public nudity simple ifs buts doesnt change person upper body lower body garment want go metro wearing similar upper body lower body garment guest anything word vomit comparing beach wear two garments picture wear two garments go metro want ifs buts person picture boarded metro entry gate full support boarding metro wearing exact outfit make frisking moral policing huh even moral policing better ruining cultural environment place time place everything go nude metro certainly go nude nude beaches voyeur club apparently photography prohibited delhi metro according rules person behind camera fault girl going circles second time brought nudity responded simple words earlier nudity nipples genitals covered argument whether like length fabric length fabric nudity defined woman full length gown holes cut nipples genitals itd still nudity despite size outfit even moral policing maybe fact arguments environment place arguments bajrang dal uses harass women make think little theres indian mythological story multiple men mention since woman already done x married people problem nude assembly argument wearing x might well nude lot like mujhe lagta hai ki iske bf ne iski khoob li hogi aur fir kisi dusri ke liye isko dump kar diya ab ye usko jallaane konaise nangi ghoom rahi hai somebody tell wearing clothes like viral stunt trying create outrage chalo thik h bhi underwear ghumta hu bhar totally support behaviourmore follow choice killing anyone increase revenue metro people use public transport wear anklets weird fashion choice damn good point view traffic less atleast blurred face sharing someone wearing clothes like doesnt give anyone rights record people sick want fun gossip life gets hey even going marriage thier marriage approved thier family society thing currently practiced certain parts india even talking polygamy illegal india part world whether man woman poeple seen naked assembly got annihilated alongside thier extended family mahabharata war fought dont bring mythology present circumstances type poeple would cheat thier spouses tell face feminism allowed dont agree bajrang dal also dont agree fake feminism needs new friends asap thats case lol f ac usa metric projection power respect real thing everyone judges everyone else sight alone youve conditioned believe shorts something casual relaxing fuck would want someone like similar person looking much productive willing work end matter perspective long society views things certain way using associate false equivalence yup sure feminist tyranny think went little overboard wearing kind clothes agree women girls full right wear whatever want going vulgar acceptable difference classy going vulgar seeking attention instance man roams around undies train would defined penalised reason believe people go extent zest seek attention personal opinion tyranny would something imposed one looking impose getting offended people agreeing youre public space really like imposing pov one impose poverty point view pov well skimpy outfit undearwear hahah nice true didi missed whole point true nope cant judge shes free wear anything wants dont call murderer murderer stupid uske kapde nai teri soch choti hai dont would say cant win man true human found knife kills neighbours knife police came arrest saying crime breaking law said laws problemsin free society restrained neighbours children came said bad ng killing parents children miss parents says miss parents problems parents mine problems thank friend give awesome idea hahaha nice nipples issues also give location nice brother arey doston yeh takke ki rand hai publicity stunt hai viral hone ka naya tarika dont give attention kind people marne saalon ko lmao bitch get back kitchen bitch stfu digit iq sure think dont think arrested many people saying neither harassed choice clothes aside people choice liking fashion choices long remain civil heres good way analysejudge situationpeople focus intent act dressing etiquette see someone wearing bikini metro asking would person even wear answer mostly mental health issues entitlement insecurity seeking validation simply cheap publicity bikinishorts thats problematic inherent motives people justified intent behind breaking social convention please thanks explanation defending wearing bikini metro many people metal surfaces may cause injury skin etc asking social convention made around dressing like wearing shorts interview bad somedays ago add man went party dhoti probably shown break convention still find people wearing dhoti party convention judge convention break go suck gomutra help okay long every generic bollywood films public naaa gaand na chuchii paetreee uchii uchiiii exactly fashion vulgarity mutually exclusive maybe point even wearing underwear true comparing countries things depend society culture shorts okay metro cities u wear village people treat differently bcz accustomed see women shorts hence lead rapes molestation bcz men women wearing shorts arousing never saw anything revealing man clothes nothing rape aroused however want force person sex think make rape power sex theres nothing clothes thats biggest myth society man bad sex life r single aroused really easily depends person person comes moral values person good morals control urge situation appropriate lead molestation even rape feel aroused see girls short revealing dresses moral values stopping anything wrong issue least wear proper bra doesnt look like gon na fall bra looks like made someone doesnt know sew clothes never seen actual bra skirt looks bad wear proper miniskirt doesnt look like torn dog looks like rag even get message across could worn sports bra shorts instead outfit looks like stitched cat understand says celebs wear things wear red carpets events traveling noone wears travel uncomfortable beach public transport germs seats germs dont want bare skin touch seat ac cold wear say many germs im woman even would feel uncomfortable beach im fine isnt even proper bikini looks like diy bikini whole outfit doesnt match well looks like stitched cat looks like two masks stitched together make bra mei give proper bra wear wants lot look nice yes pls police peoples clothing heed words joamsneto whenever step outside wtf u lmao plentyyyy adult beaches usa people skimpy clothes enjoy primitive society dumbfuck thoughts making way thank much enjoy society borderline nudity allowed public places women deserve whatever delhi famous based based based yes india go similar fate america going people collapsed entire culture decency dont give fs wear would okay wear lose pajamas boners public purpose hmm dont understand whats wrong hes asking hes asking opinions whats wrong hes already given opinion hes saying hes comfortable women bikinis etc hes going ask women wear differently anything hes said harmless thing dont know hes getting much downvotes think hes saying finds uncomfortable seeing women bikinis general close people conservatives never wear bikini even beaches maybe dont even wear less revealing clothes conditioning families open women wearing revealing clothes like crop top shorts etc except thats exactly hes saying dont know lecturing sorry break even usa prohibits things like indecent exposure public lewdness public indecency disorderly conduct states dont know got information maybe watching movies something maybe ignorant speculation part sound cool modern kaun se station se chadhti hai ye maadam also u enjoy modern progressive society dreams wrong people trouble wearing allowed imagine families sitting parents trying hard let children see fucked dont support beach lmao long kitchen away well gladly go seriously youre woman repellant american wear whatever want long genitals arent showing nowadays miami see things bikinis im brave lol lot women wear im poor part us neighborhood could wear literally anything see club clothes worn daylight however men sexually assault backwards mindset said im looking bikini right thats found thread didnt realize polarizing topic obvs im wearing beach figure id get long beach skirt wear swimming thats compromise lol hubby tamil doesnt care def started covering since ive living south india bc dont want stares sorry long comment figured id add context convo hello sir asking wear dhoti office wear suit home casual day dinner time yes wearing bikini anywear fine worn beeches swimming proper place wearing anything wrong wear particular cloth according setting place matter much say society doesnt matters sorry every time sometimes specially act makes someone uncomfortable surely society mei chahe vo boy ho yaa girl behave karne kaa ek tareeka hota hai everything everyones choice girl saying ki chalo boys kal se start boarding metro unds lets see many pseudo feminist support fact even start walking snotty nose snot coming noce dandruff falling around place hair body choice whatever wan na let dont like stay away kar downvote jisko bhi karna hai dont care pseudo feminists mean want rights see body shaming people",
    "light_cleaned_title": "Thoughts on woman in bikini in Delhi Metro",
    "light_cleaned_selftext": "Recently a post is going viral where a woman is wearing a bikini in delhi metro [https://mobile.twitter.com/Hotstuffvibe/status/1642405635563339778](https://mobile.twitter.com/Hotstuffvibe/status/1642405635563339778) Personally I do find it uncomfortable in front of woman who is in bikini as a straight man but this is because I was raised in family and environment where no one wore bikini. Technically no logical man should have problem with what dress a person is wearing as long as that person do not troubles them physically or verbally. I shouldn't have any problem with her if she is minding her own business. But twitter community is bashing that woman saying its not modest and are being typical Indian aunty. Now they are the same women who get irritated when Indian aunties refrain their daughters from wearing tight short jeans or tank tops. So my question is where one is supposed to draw the line? I kind of do agree with twitterati but that's because I was raised in similar environment. I hate burkha and at the same time I hate bikini but it should be my personal choice. I do feel uncomfortable but its my personal problem right?",
    "light_cleaned_comments": "I have no problem with it, and likewise people should not have problem with it, otherwise they should just drink gau mutra. I have no problem as a gym-rat I should be allowed to show my juiced up physique as well, and should not get accused of harassment.. Exactly. I do show my biceps (though they are not great :p). There needs to be a law against people making videos of others without their consent. This shouldn't be allowed. True. Clicking photo is only illegal thing I see in this post. There are clothes for every occasion. They are not at the beach, not in a club pool, then why that kind of clothes. It's only normal or people find this weird. It's like going to my wedding with a tshirt and flipflop: it's not forbidden, but I can't expect people to find normal. With that in mind, they can wear whatever they want and I'm not entitled to say anything to the person if not asked. Especially take a picture without their acknowledge and approval. Again what if they are even nude? Nudism is a thing. Now don't say laws are there to prevent it. We are not talking about laws but about morality. Seen more in UK , absolutely fine with whatever one chooses to wear as long as they're not Naked .. What's your personal opinion on someone naked in public. Not talking about laws. No thoughts Won't be comfortable ,have been to nude beaches nd was super awkward for obvious reasons . Obscenity and nudity in public place is illegal (Section 294, IPC). If a man walks in an underwear, I’d be uncomfortable. You be like - Why to waste my brain power on random post over internet. She maybe part of some kind of social experiment. Mentally she's in Los Angeles. Yup I would feel uncomfortable too but that's because I wasn't raised in such a environment. And we are not talking about laws but morality. Laws can be changed. Or maybe she is doing publicity stunt as people are saying. But its fine because this gave a opportunity for people to express their opinion. Dials the AC down to seventy ✋️🍆 So can morals. They are subjective too. But it is an unsaid rule that order is to be maintained. Freedom of choice is not absolute, it is restrictive, and should be, otherwise even a murder is justified, it could be moral for someone, who are we to judge? \"juiced up\" I mean not entirely natural Lol I used to take MK677 for faster recovery with creatine and bulked up pretty hard then dropped mk completely and maintaining it naturally.. You can get pretty big if you bulk naturally with creatine alone tho.. No. Clicking photograph is not illegal in public place as there is no reasonable expectation of privacy in this case. That's preposterous Which station was she last seen? So I can avoid her Ok got it. Will focus on muscle building as soon as I start working in 6 months. People who wear inappropriate clothes for respective place or occasion should understand that they're absolutely being idiots. You don't wear shorts for interview, you don't wear stylish clothes inplace of uniform, you don't wear suit on the beach. Hence if anyone find you or your clothes unusual or out of place then you are in no position to complain for their uncomfortable way of treating you. You chose that. If you ask me, that's not even a bikini. The only way she can reveal more b**bs is by putting cellotape on nipples. It's not illegal, everyone should have freedom of choice. But that being said, having sense of dressing appropriately according to occasion is also important. Murder is affecting others so murder is not synonyms with way people dress. Thing is there are few communities asking women to cover themselves from top to bottom. Now they might get uncomfortable seeing a woman who is wearing short jeans. So by this logic woman should cover themselves fully as some or other person would feel uncomfortable. extremely hard to implement. what if someone goes on top of a beautiful mountain but there are lot of people around. it would be impossible to even click landscapes She may have lost a bet and doing her obligation. Gotta man up sometimes 😉 There was another video a few days back, same kind of bikini in beige colour. That girl had a huge black bag & was seated in the Delhi metro. This is not one off occurrence. You do have a point here, it is difficult to draw a line because one can’t please everyone ever. I guess, it is best that when in Rome, do what the Romans do. That's the thing: people don't usually wear bikinis far from the beach in LA. Only at the beach and touristic places. guess me bhi underwear me metro me jauga > having sense of dressing appropriately according to occasion This is what whole post is about. If you show woman in tank top or even normal jeans pant to people 100 years back in India they would feel disgusted. They expected women in sarees only. Now a average woman wears jeans so we don't have problem with it but we have problem with bikini or nude. So what exactly is appropriate or we should just do whatever person wish to do If people can wear whatever they want, why aren't they allowed to not wear anything? What is the justification behind drawing the line at nudity? It's a public place, nothing illegal in taking pictures. Agreed. Why does it suddenly matter if they're nude? According to your logic, we shouldn't care what other people are wearing or not wearing. You can anything, but in a society there is unspoken rule which governs what is deemed appropriate to wear in certain places. Such clothes shouldn't be used in family friendly places. If i am with small kids in a metro i will be visibly uncomfortable if someone sits wearing that. Have been to nude beaches nd it draws glares nd unwanted attention, and unfortunately in a country like India it wont be limited to glares or attention. I mean some comments below the above tweet have literally tweeted \" And then they complain when women get raped \" A person raised in burkha/pallu environment would feel uncomfortable in front of woman wearing jeans. Few years back in my extended family girls were not allowed to wear shorts. And now teenagers are wearing shorts as staple. Small kids do not find anything wrong its elders who teach that this is wrong and then it becomes taboo. I guess this is a direct reply to all those Indian aunties who wear saree at the beach. That looked some kind of dare. It doesn't look like a regular bikini. Abe doofus, no one was raised in such an environment. Tell me which family conditions their women to wear bikini in a crowded metro train? This was a stunt done clearly to get publicity or to make a statement. Only idiots will take it seriously. Looks like you are one of those. What???? Why does burkha/pallu matters here? That's just stereotyping others. Most people would be uncomfortable if someone wears that. It would have been different case if she wore it in a beach 😅 but not there. Just cheap publicity stunt Uske kapde nahi Tumhaari soch choti hai / You hate women in burkha, I hate women in burkha but I personally know people in my society who wear pallu when their in-laws visit their place. This might be true. Wearing bikini in metro rail makes no sense unless done for fighting against the prevalent sexism. I have seen enough women in bikini and so I am comfortable with it. Modesty is a cunning way of imposing patriarchy. Now if anybody catches or pinpoints her, all the feminists will come out with protests of Her Life Her choice and insta wokes will start calling Indian society regressive preaching dirt n vulgarity is in another's eyes kind of lessons 💩💩 I will be uncomfortable if a man walks without an underwear. I don't hate women in burkha. If they want to wear it they can none of my buisness, as for pallu it's still their choice although in-laws shouldn't force it. We are no one to govern what they wear. Especially when our country is so famous for women safety if u know what i mean Would you find it weird if you see a man on a metro in his underwear? I would. And for the same reason this too is uncomfortable for me. There is a time and a place to wear what you wear. She can also show up like this at her office and bash people for not letting her wear what she wants. Technically no one is wrong in this situation but from a social point of view it is not acceptable. This could mean people video taping stuff like police violence or crimes can get into trouble for it. Those flats are atrocious and the whole look is not that coherent. Like your choice but payal with flats and then something random on top. Another thing i don't think this is a bikini just a verrry short skirt. That's all. I m a big fan of wearing something that is appropriate for the occasion in this case metro. And if this is a publicity stunt then they should have chosen something better. If people think how come Indian males have such a bad reputation in the entire world. Just go through the comment section where the small dick energy of these misogynists is in full display. It is tatti people like these who come to our Delhi and rape women. I don't want someone's bare ass cheeks touching the seats on buses/trains. If they're wearing shorts, at least there's still a cloth barrier. I don't care if they're showing their breasts/chest. Down to 70°C, how do you live? You should move to someplace metric, we have better weather Nah i think more like blood is diverted somewhere else Exactly. Though they wear a little revealing clothes but not bikini I don't want someone's bare ass cheeks touching the seats on buses/trains. If they're wearing shorts, at least there's still a cloth barrier. I don't care if they're showing their breasts/chest. It could be considered wrong clothes at the wrong place. You don't wear a suit and uniform while swimming on the beach, you don't wear bikinis while visiting family shrines or graves or temples. So its normal for people to find it weird wearing a bikini in public transport. Where do you draw the line though? What would one objectively define obscenity as? I honestly don't care but I want to know what you think about it OP. ![gif](giphy|jtm3wo9YEvMwU) Tbh with u, I have no problem with nudity, to each their own U know what, she shouldn't care I see uncovered men all the time. She can wear whatever the hell she wants. Pahile paragraph me tum bol rahe ho k tum khud uncomfortable ho, Doosre paragraph me tum khud logic bata kar ghoshit kar rahe ho k koi farak nahi padta Fir Teesre paragraph me fir se bol rahe ho are ye twitter k log hi galat hai, hypocrite. Aur last paragraph me to tumne hadd hi kar di, tumhe Burkha pasand nahi hai, bikini bhi pasand nahi hai, upar se tum ye bhi bol gaye k mai twitter k logo se sehmat hu. Ye kya hai OP? Tum downvote se darte ho kya? Tum safe play kar to rahe ho par wo jam nahi raha. You know if you only see a picture of a nipple with everything else cropped out it's often impossible to tell if it's a man's or a woman's? >I can avoid her Are you sure you're gonna avoid her💀 Where do you see uncovered men though? Trashy. Me uncomfortable feel karta hu par iska matlab ye nhi hai ki me logon ko apne khud ke principles follow karne keliye lagau. Agar me bikini friendly environment me hota toh mujhe fark nhi padta. Isiliye me logon se thoughts puch raha hu ki tum log kya sochte ho. Younger me would have said that woman should wear tshirts and jeans (till knees). And this is what I wear too. Now if you ask me I would say I do not have problem with nudism and if I build nice abs I would go shirtless in public. But seriously want to know what is going on? Twice in a week, there has to be some logic behind this. Pata karo Abhijeet! ![gif](giphy|jqNIs68roiCW2bNePc|downsized) Tbh ppl would definitely come at me for this but imo there is a decorum and discipline with respect to clothes also, there is a reason why we wear school uniforms and why we don’t roam naked in public places or wear a wedding dress in parks or wear a full shirt and jeans playing football or any other such sports or wear a tuxedo going to theatres to watch a movie, now ppl have their freedom they can wear whatever they want but with that freedom they also have to use their braincells of what to wear or what not to wear at certain places, its not about being woke or progressive, its about being sensible. That and there would always be those scum of our society who'd point at something like this and then go ahead and justify rape in the same breath. If a man walks in with underwear, he gets to face the police... I'm all in for dressing up the way you want to. People should have the freedom. But public nudity or borderline nudity is where I draw the line. There are plenty of underage people being exposed to this stuff and that is actually vile, disgusting and predatory behaviour. Again it's not just women but men as well. Agreed. Yes this is double standards of our judicial system. Surprised she did not get arrested. This is why I have more respect for Muslim girls/women. Even without creatine. Creatine helps, but isn’t something magical You respect them because they are submissive? And you just did. No I meant inside Delhi Metro. Yes, that's a point to think about.. 🤔 ok i deleted Where is the NSFW tag? I kinda disagree with the 1st point though, its in a public place, there are no dress codes for public places, secondly its not uncommon to see people in bikini in public places in the western world, even in countries of south america its common to wear swim wear in public and lastly she could have come from a swimming pool so she just kept wearing that its not that crazy in my opinion, she's also covering the bottom part with a skirt so I don't think its a big deal Let people wear whatever they want. Free the nipples ? Sure go ahead. Kids as low as 10 knows what these are and as long as its not outright nudity n they r not trying to shove it down my throat, in my eyes its ok. Also please let me know where you found her. I need more info on this so i can avoid her. I need information For Research Purposes. walk into the elevator and stand facing the opposite side ... I wish people gave a crap about actual problems instead of some moron with a terrible sense of fashion. I mean, if you're gonna dress provocatively, at least do a good job at it...that outfit is utterly tragic. Let's move on from this and focus on shit that matters. No one should have a say in how you can dress and how you cannot. That is, the law shouldn't say anything and the person , whatever they're wearing, are entitled to legal protection from harassment and likes. That said, we do have the right to judge them as \"not decent people\" and avoid them as much as possible. I am wondering how was she even allowed to enter the metro ,the security stopped me once when my shoes were a little muddy I mean she is on a train with only a bikini on, she is definitely asking for that attention. looks like a PR stunt thats not even a bikini also one question is not she feelimg the chills So you are moral police to decide what she should wear or not? Balls of steel on that woman. A woman. In Delhi. Bikini. That's a spoken dress code. Wearing cowboy on the streets of Chennai is not immoral, but no-one does, so it's a unspoken code. And if you go to cities like Barcelona, Rio, LA etc, metro cities with beachfront, you not gonna see people walking far from the beach in bikinis. No I respect them because they have self respect and don’t dress like a ho and copy trashy movie clowns So this is the first thing i see on internet on a nice sunday morning. Yeah than you meant to say one can be nakedness metro. Gonna check the post now 😋 And who said that isn’t uncomfortable to look at? I think you should we wearing whatever is considered normal in a country. Bikini is swim wear. And doesn't make sense to be used in metros or buses. Having said that, there is no need to involve law or new rules to take care of that. There is a section of our society that would get uncomfortable looking at a scantly clad female. That section includes both male and female members. Given the reaction to this photo, she definitely made that section uncomfortable. I genuinely wish she takes more rides in the metro in a similar attire. So butt naked uncle with a towel in hand is ok. He can put it on seat and sit. Probably publicity stunt. Looks like she is carrying something to cover up like a gown. 🤣 And if anyone dresses up like the ho you mentioned she is declared not to be Muslim or worse killed. So that's convenient. Kya hi bolu ab. Ye kya baat hui? Tum khud k thoughts logo par nahi laadna chahte par tum khud logo se unke thoughts puch rahe ho? Khud soch kar dekho. attention seeking wannabe American. Europe mein bhi essa qtiyapa dekhne nahi milta No i am not, nor did i ever say if what she did was right or wrong. I just said that it was intentional but it seems that you \"Assume\" a lot of things. Nah. We no thoughts people would simply look at our mobiles or turn around in this case. Not hurting me. Yes, it's annoying that there's even a debate on this because it's no one else's business. We'd be safer as a country if we just let everyone wear what they want. Seeing this as a top rated comment justifies why India is a backward country and even the youth or tech savvy are backward idiots who deserve everything they complain about. Let me tell you as a straight man I HAVE NOOOOO PROBLEM WITH WOMEN WEARING BIKINIS IN DELHI METRO OR ANY OTHER METRO. Yea I've never seen a man in an underwear/ swimming trunks in a metro if he was then he's get beaten up Maybe she got inside the train and then wore it Is it a ladyboy from Thailand? I think those people who thinks that she wants attention assumes lot of things. Whatever it is.. it's none of our business. Don't care. one man went for jail i guess You know that kids travel in metro too right? Hear me out..... What if her friends pranked her and made her do this?? And maybe she had no choice but to just face the issue. Wow, it has a built-in condom This is the same person Photography is not permitted in Delhi Metro. Let people wear what they want. Judging them for it is small pp energy. Is this some brand doing some attention seeking campaign, the other girl was wearing a similar bikini but in white who was called out on Delhi metro. This girl is wearing a blue and black one. It's our business. If a man goes in metro wearing only shorts, woman would file complaint against him in police. Same standards should be applied for women. India should be egalitarian society, niether feministic nor chauvinistic one. Fair enough. So, cctv are in contradiction to their own rules? Just curious. Why a rule is different for establishment and customers in a public place? Also, is this rule enforceable in court? Imagine a man travelling in metro who is wearing clothes similar to her. Will that be objectionable? Why? Why not? This is from twitter, “Hi. Photography in public areas of Metro station & train is permitted for bonafide passenger for personal use only and prohibited for commercial use or publication by any means. The act of photography should not infringe the privacy of co- passengers at any time.” Infringement of privacy is complex matter to prove. A person can be naked at home because it’s private but he can’t expect privacy when he is naked in public. Some exceptions would be breast feeding or upskirt situations where a Person can expect privacy from people around them. I still think this lady can be photographed normally without any repercussions for the photographer. Not a legal expert though I wouldn't be comfortable around a woman wearing a bikini in a metro. They are not on the beach or pool. These wannabe feminists doing such dumbsh\\*ts. Imagine a man wearing only underwear traveling on a metro. Don't you feel uncomfortable? How do women feel if all men started wearing underwear in the metro? Wouldn't it be uncomfortable for them? Hmm.... If that was a dude in just tight short swim trunks in the metro would he be even allowed past the first security check in a metro? And you're being downvoted for asking a fact. Why though? Personal liberty ke naam pe launde c-string pehnkar metro mein chadhne lage to sabse pehle ye hi shor machayenge. Sad part is ki young women think this is women empowerment, they are not far from being very wrong. Your discomfort is your problem. In a free society, you should be able to wear whatever you want. I find overt displays of religion very uncomfortable but I don’t go around demanding we ban/stop that. Noone will file a complaint if man wears shorts. I am fine with whatever people wear, even if they wear nothing. It is a tangential question but what decides the etiquette of dressing? I do understand that you don't wear suit in beach, it would be generally too hot, uniform is used to reduce the difference between the people, but why can't you wear shorts to interview. Wonder how that came to be so. India ke 60% log aise hain jinko Agar ye cheezein buri bhi lagti hain na tab bhi wo public ke saamne insult feel karte hain ye bolna ki ye galat hai. Lol. Sabko yahaan western kapde pehenne hain. Baaki development jaaye tel lene. dumbass log Funny you mentioning this, because I was born in a country where people have really small clothes, due to the weather. I'm not even have a Indian origin. I'm think she's a sex worker. Literally nobody else can do this in the metro. She's also wearing payals. This is what sex workers look like in the red light areas. Sex is sexual, women's bodies existing is not. Because it demonstrates the same backward thinking. Let me clear it up. Sex is sexual, women's bodies existing is not. Ok What if he doesn't wear anything on upper body. Feminism to the max Is her clothing causing you any harm? Defend individual liberty or you’ll soon see someone having a problem with something you’re doing for no reason. Lol I wonder why some beaches are adult only if that is your argument. It's not even about women bodies. It's about male bodies too. If there are kids around, maintain some modesty Backward thinking? Last I read we had to travel a lot in our past to reach this point in time to be able to cloth ourselves to shield us from the elements. Cave men walked around in rags. Not modern people living in a civilized society. And to make it more clear to you, children of all sex's and gender expressions use a metro which is a public platform and these children come from varying socio-cultural and economic backgrounds. So they will be disturbed by this, find it uncomfortable, curious or arousing. That's why we have a law against indecent exposure. Now perform the flip test. A test used in such scenarios which is very common when confronting such foolish delusions. What if it was a man in tight short swimming trunks? Would he have made it past the security clearance in a metro? Backwards thinking my ass. This is just creating a spectacle to attract attention and validation against the patriarchy in its shittiest form. \\> Be a man \\> Only wear a short boxer \\> Try and board the metro \\> Get arrested and locked up with S.assault charges \\> Keep yelling \"where is equality\" (There isn't) and \"it's no one else's business what i wear\" in vain This shit she is doing is not cool. Clearly reading is not your strong suit. Do get to the second line of what I wrote The second line is irrelevant in this scenario. You would understand that if you had read what I had jotted down instead of trying and miserably failing to sound condescending. More progressive countries don’t have this distinction It's allowed as long as you are in public as it should be. Yep, moral policing is sometimes necessary. nothing wrong with it. \\*/s I see your comprehension is too low for you to understand why you’re backward Bhai mujhe lagta hai it's more about our culture and values which India is known for... Aisa chalta rha na to West or India me jo difference h culture and values ka wo jyada time nhi rh payega no wonder girls r moving towards no child no marriage lawda lasun. Well..., please do enlighten me. I'm open to suggestion, debate and discussion and willing to lend an ear if you are able to speak without sounding condescending, all high and mighty from the pedestal you stand on and look down to dictate to the rest of us. Isn't what you just said called body shaming. Nope we discussed everything question everything Exactly bruh No she was in public that not punishable That was my point Ye samaz ke saath kiya jane wala badtamizi hai jise kisi ko bhi bardast nahi karna chaiye samaz aur kanoon dono ka farz hai ki logon ko tamiz aur sabhyata ke daiyre main rakhe isse samaz ka image khrab hota hai dusre desh main to jail main dal dete bikni sirf beach main allow hai na ki sab jagah. Whose morality? Yours? Why should your morality be applicable to anyone? She is wearing something on upper body, tho. I think it's disgusting that someone took a picture to argue about clothing and it's disgusting that you are sharing this picture here to argue the same thing. The person in the picture has a upper body and a lower body garment. They obviously got in through the metro entrance and through the frisking of the guards. Once one is allowed entry, it isn't anyone else's business. Also, the 'if I...' hypothetical is ridiculous. If you want to make a comparison, go through the frisking wearing a upper body and a lower body garment like this and then comment. Hypotheticals are hypotheticals. On the other hand, I do like it when misogynists expose their biases openly so people in their life can be careful with them in the future so maybe something good is coming out of this post. What is difference between wearing that thing and not wearing anything. when women wears bikini , Man only wears shorts. The difference, which is clear to sane people who are not moral policing is in this case, there is no public nudity. If there were nothing, it'd be public nudity. Simple! Doing ifs and buts, doesn't change that the person has a upper body and a lower body garment. If you want to go in the metro wearing a similar upper body and a lower body garment, be my guest. Anything other than that is just word vomit. We are not comparing beach wear. There are two garments in the picture. Wear two garments and go in a metro if you want. Why doing ifs and buts? The person in the picture boarded the metro from the entry gate. You have my full support in boarding a metro wearing exact outfit if you can make it through frisking which they did. Moral policing , huh . Even if I am doing moral policing, I am better than what she is or you are doing. It is ruining the cultural environment of place. There is time and place for everything. Can you go nude on metro , you can certainly go nude on nude beaches or voyeur club. apparently photography is prohibited on delhi metro so according to the rules the “person behind the camera” is at fault not the girl I am not going in circles. This is the second time you have brought up nudity. I responded in simple words earlier too that this is not nudity. Nipples and genitals are both covered. Your argument whether you like it or not, is on the length of fabric. Length of fabric is not how nudity is defined. If a woman had a full length gown with holes cut in it for nipples and genitals, it'd still be nudity despite the size of the outfit. \"Even if I am doing moral policing\", maybe the fact that your arguments about environment of place are the same arguments Bajrang Dal uses to harass women should make you think a little. There's an Indian mythological story in which multiple men mention that since the woman has already done X (married 5 people), then there is no problem in her being nude in the assembly. Your argument of \"if she is wearing X, she might as well as be nude\" is a lot like that. Mujhe lagta hai.. ki iske bf ne iski khoob li hogi... Aur fir kisi dusri ke liye isko dump kar diya.. to ab ye usko jallaane konaise nangi ghoom rahi hai . Can somebody tell me why were they wearing those clothes? Like is it a viral stunt or were they trying to create outrage? Chalo thik h Me bhi underwear me ghumta hu bhar 😋 I totally support this behaviour...more should follow it. Her choice is not killing anyone it will only increase the revenue of the metro and more people will use public transport .. Why wear the anklets? Weird fashion choice Damn. Good point of view. Traffic will be less. He should have atleast blurred the face before sharing. Just because someone is wearing clothes like doesn't give anyone rights to record them. People are just sick. They want some fun and gossip in their life and this is how they gets it. Hey it is not even going about marriage. Thier marriage was approved by thier family and society. Same thing is currently being practiced in certain parts of india. So I am not even talking about polygamy. It is illegal in India and most of part of world ,whether it is for man or woman. The poeple who had seen her naked in assembly, most of them got annihilated alongside thier extended family and mahabharata war was fought. Don't bring mythology into present circumstances. You are type of poeple who would cheat on thier spouses and tell him on face that it is feminism and allowed. While I don't agree with what Bajrang Dal is doing , I also don't agree with your fake feminism. She needs new friends asap if that's the case Lol,70 °F AC (USA metric) The projection of power and respect is a very real thing and everyone judges everyone else on sight alone. You've been conditioned to believe Shorts are something \"casual\" or relaxing. Why the fuck would I want someone like that when I have a similar person \"looking\" much more productive and willing to work? In the end its all a matter of perspective. As long as society views things in a certain way, you using them will associate you to it. False equivalence. Yup! For sure. Feminist tyranny I think she went a little overboard wearing those kind of clothes. While I do agree that women and girls have full right to wear whatever they want to, going vulgar is not acceptable. There is difference between being classy an going vulgar just for seeking attention. For instance, if a man roams around in his undies in the same train, he would defined be penalised for the very same reason. . I believe people can go to any extent in their zest to seek attention. This is my personal opinion. Tyranny would be if something were being imposed on you. You are the one who is looking to impose and then getting offended that people are not agreeing with you. If you’re in a public space? Really? Like you are imposing you pov on me. How does one impose poverty? 🤣 It's point of view (pov). Well, skimpy outfit is not an undearwear Hahah Nice. True didi. You missed the whole point. But true. Nope You can't judge . She's free to wear anything she wants. Don't call a murderer a murderer You stupid. Uske kapde nai Teri soch choti hai. No they don't they would say. You can't win man. True. A human found a knife. He kills his neighbours with the knife. Police came in to arrest him saying you did a crime by breaking a law. He said your laws are your problems.in a free society I am not restrained. Neighbours children came said he did a bad that ng by killing their parents and children miss their parents now. He says you miss your parents it's your problems. They were your parents Not mine. So your problems. Thank you my friend to give me this awesome idea. Hahaha Nice. Nipples no issues. But also give me her location. Nice brother. Arey doston yeh 2 takke ki ra*nd hai , publicity stunt hai , viral hone ka naya tarika , don’t give attention to such kind of people , marne do saalon ko Lmao, bitch get back to the kitchen Bitch stfu, you have a 2 digit IQ. Not sure what to think but I don't think that she should be arrested as many people are saying, neither should she be harassed for her choice of clothes. With that aside, people have the choice of not liking her fashion choices as long as they remain civil about it. Here's a good way to analyse/judge any situation/people: Focus on the intent, not on the act itself or कर्ता को देखो कर्म को नहीं So for dressing etiquette, if we see someone wearing bikini in a metro we should be asking \"why\" would that person even wear it? The answer is mostly mental health issues, entitlement, insecurity, seeking validation or simply some cheap publicity. So it's not the bikini/shorts that's problematic, it's the inherent motives of such people. If there is a justified intent behind breaking social convention, please do so Thanks for the explanation! I am not defending wearing bikini in metro. It has too many people, metal surfaces, may cause injury to skin etc. I am asking why some social convention are made around dressing? Like wearing shorts to interview is bad. Somedays ago there was an add where a man went to a party in a dhoti. It was probably shown as a break of convention but still you will not find people wearing a dhoti in party. Why is this convention. How to judge which convention to break? Go suck down some gomutra that should help Its okay as long as it’s in every generic bollywood films but not in the public 🗿 Naaa gaand na chuchii ,, paetreee uchii uchiiii Exactly! Fashion and vulgarity are mutually exclusive Maybe no but the point is, she is not even wearing a underwear 😭 True and why we are comparing with other countries? All these things depend on society and culture. Shorts are okay in metro cities but if u will wear the same in a village people will treat you differently bcz they are not accustomed to see women in shorts. Hence it can lead to rapes and molestation. Bcz for those men a women wearing shorts is so arousing. They never saw anything that revealing before. No man, clothes has nothing to do with rape. You can be aroused however you want, but you only force a person to have sex with you because you think you can make them. Rape is about power, not about sex. So there's nothing to do with clothes. That’s the biggest myth of society. If a man is having bad sex life or r single than he can be aroused really easily. Depends on person to person. Than comes moral values. If a person have good morals than he will control the urge and if not and the situation is appropriate than they can lead up to molestation or even rape. I myself feel so aroused when I see girls in short or revealing dresses. It’s just my moral value’s which is stopping me to do anything wrong. I have no issue with her but at least wear a proper bra that doesn't look like it's gonna fall off. The bra looks like it was made by someone who doesn't know how to sew clothes and has never seen an actual bra before.😭 And the skirt too. It just looks bad. Wear a proper miniskirt that doesn't look like it's been torn by my dog. It looks like a rag . This will not even get her message across. She could have worn a sports bra and shorts. Instead of an outfit that looks like it's stitched by my cat. I understand she says celebs wear these things . But where do they wear it? On red carpets and events. Not while traveling. Noone wears that when they travel because 1) it's uncomfortable for yourself 2) it's not a beach it's a public transport 3) germs. The seats have germs. I don't want my bare skin to touch the seat. 4) AC. It's cold if you wear this 5) did I say how many germs are there? I'm a woman and even i would feel uncomfortable. If it's a beach I'm fine but this isn't even a proper bikini. It looks like a diy bikini and the whole outfit doesn't match well and looks like it's stitched by my cat It looks like two masks stitched together to make a bra to me..I can give her a proper bra to wear if she wants to. I have a lot that look nice 😭 Yes pls police people’s clothing, we all should heed to the words of joamsneto whenever we step outside 🙏 Wtf u on about lmao Plentyyyy of adult only beaches in USA where people where skimpy or no clothes Enjoy your primitive society dumbfuck. Your thoughts are making it that way. Why thank you very much, i will enjoy a society in which borderline nudity is not allowed in public places Women deserve whatever delhi is famous for Based based based. Yes i am ;)))) India will go through the similar fate America is going through when some people collapsed the entire culture of decency. I don't give Fs to what you wear but would it be okay if I wear lose pajamas and have boners in public, on purpose? Hmm I don't understand what's wrong in what he's asking. He's just asking for your opinions, what's wrong in that ? He's already given his opinion, he's saying that he's not comfortable with women in bikinis, etc. but he's not going to ask those women to wear differently or anything. He's said the most harmless thing, I don't know why he's getting so much downvotes. I think he's saying that he finds uncomfortable seeing women in bikinis in general, and that his close people are more conservatives who never wear bikini even in beaches, maybe don't even wear less revealing clothes. It's not about \"conditioning\", but some families are more open to their women wearing revealing clothes like crop top, shorts etc., some or not. ...Except that's exactly what he's saying so I don't know why you are lecturing him. Sorry to break it to you, but even most of USA prohibits things like \"indecent exposure\", \"public lewdness\", \"public indecency\", \"disorderly conduct\" in most states. I don't know where you got that information from, maybe from watching movies or something, or maybe it's just ignorant speculation on your part to sound cool & modern. kaun se station se chadhti hai ye maadam also u can enjoy your modern progressive society but only in dreams. this is wrong if people are having trouble with what you are wearing then it should not be allowed imagine families sitting there the parents trying hard to not let their children see that it's all fucked up and i dont support this this is not beach lmao as long as the kitchen is *away* from you 😆 we'll gladly go. Seriously, you're a woman repellant 😆 American here, we wear whatever we want, as long as your genitals aren't showing 😂 Nowadays in Miami you see things bikinis. I'm not that brave lol, but a lot of women wear them. I'm from a poor part of the US & in my neighborhood you could wear literally anything. You see club clothes being worn in daylight 😆 However you do have men who will sexually assault you, with this same backwards mindset. 🤮 That being said, I'm looking for a bikini right now, that's how I found this thread. I didn't realize it was such a polarizing topic here 😅 Obvs I'm just wearing it on the beach. But I figure I'd get a long beach skirt to wear with it while not swimming. That's my compromise lol. Hubby is Tamil & he doesn't care. I def started covering more since I've been living in South India. Just bc I don't want the stares. Sorry for the long comment, just figured I'd add some more context to the convo 🙏🏻 hello sir, I am just asking you, will you wear dhoti in your office, will you wear suit at your home on a casual day or at dinner time? if yes, then wearing bikini anywear is fine If no, then it should be worn on beeches or while swimming or at a proper place. Wearing anything is not wrong when you wear a particular cloth according to the setting of the place. No matter how much we say that society doesn't matters, but sorry, it does, not every time but sometimes it does, specially when your act makes someone uncomfortable then it surely does, society mei chahe vo boy ho yaa girl, behave karne kaa ek tareeka hota hai. If everything is everyone's choice then being a girl I am saying ki chalo boys, kal se start boarding in metro just in unds, then lets see how many pseudo feminist will support you. In fact even I should start walking with a snotty nose, or just snot coming out of my noce or just dandruff falling all around the place from my hair. after all its my body my choice whatever I wanna do with it let me do, if you don't like then just stay away. kar do downvote jisko bhi karna hai, I don't care. These are pseudo feminists, I mean they want their rights but see how they are body shaming other people."
}