{
    "id": "1ckrlxk",
    "title": "Fear Mongering Regarding Pesticides: A Rant",
    "url": "https://www.reddit.com/r/india/comments/1ckrlxk/fear_mongering_regarding_pesticides_a_rant/",
    "selftext": "First of all this is a post in response to this post \n\n[https://www.reddit.com/r/india/s/Ir09shUtnK](https://www.reddit.com/r/india/s/Ir09shUtnK)\n\nThe post insinuates the \"relaxation of pesticide norms\" done by FSSAI is something bad.\n\nThis is BLATANLY wrong. I will be going point by point on why this is the case and the OP should have researched about the topic. Also if you encounter such sensational headlines you should not take them at face value and what you should do with them.\n\n# CLAIMS\n\nThe main claim of the article is as follows:\n\n>In an order issued on April 8, the Food Safety and Standards Authority of India (FSSAI) raised the MRL for a pesticide in herbs and spices to 0.1mg/kg from the previous 0.01mg/kg. The regulator cited “various representations” as the reason for this upward revision.\n\nOkay so FSSAI has raised the MRL from 0.1mg/kg to 0.01mg/kg. We don't get any citation from any third party regulator that this is harmful (spoiler warning: it was not given because it doesn't exist). We don't get any specific names of the spices and pesticide. This should be red flag. Right now you don't have any clue if this is a bad decision or not. \n\nThis incredibly vague claim is then supported by the following:\n\n>.......activists had warned that this relaxation may lead to increased rejections of Indian spices in large export markets, as well as heightened pesticide consumption among domestic consumers. The Pesticide Action Network of India, a non-profit organisation, had also expressed concern over the potential health risks posed by higher pesticide levels in spices and the cumulative effects of multiple pesticides.\n\nBy reading this I call into the credibility of The Pesticide Action Network of India because either they don't know anything about pesticides and are just spewing bullshit or they just made claims without getting the full details of the regulation changes which is equally as harmful, even more so as an organization.\n\n# REFUTATION\n\nI will be relying on [this ](https://www.livemint.com/industry/agriculture/india-has-one-of-the-most-stringent-standards-of-maximum-residue-limits-in-the-world-fssai-11714898152420.html)article for refuting the claims.\n\nFirst of is 0.1mg/kg of pesticide harmful for you.... not talking any particular pesticide or spice\n\n>For example, flubendiamide is used in brinjal with an MRL of 0.1mg/kg whereas for Bengal gram the MRL is 1.0mg/kg, \n\nHuh.... not so surprisingly seems like if we just look at raw number 0.1mg/kg tells us fuck all..... My point here is just mentioning dumb shit like 0.01mg/kg to 0.1mg/kg means literally nothing. Sometimes even 1.0mg/kg is permissible.\n\nNow moving on to the specifics. What are the safe residue limits for spices around the world\n\n>“The new Codex MRLs for Dithiocarbamates, Phorate, Triazophos and Profenophos for Fennel is 0.1mg/kg. FSSAI aligns with the updated standards of MRLs set by Codex Alimentarius Commission and International Food Safety and Quality Standard setting body created by WHO and FAO of UN and the European Union,\" the FSSAI statement said. \n\nSeems like there are spices which have the accepted MRL of 0.1mg/kg...... So the article was just blatant fear mongering and misleading bullcrap.\n\nAnother claim was the 10x increase. Surely a 10x increase of  pesticide must be harmful and out of the norm.\n\n>The MRLs fixed by Codex for myclobutanil used for chilli is 20mg/kg whereas limit set by FSSAI is 2mg/kg. For spiromesifen, used for chilli, Codex limit is 5mg/kg while FSSAI limit is 1mg/kg. Similarly, Codex standards for metalaxyl and metalaxyl-M used for black pepper is 2mg/kg whereas the limit set by FSSAI is 0.5mg/kg.\n\nThis shows that some of the current regulation could be increased by 10x and still be within the limits of the international guideline.\n\nAlso please go through the article i have mentioned above. It contains the full response of FSSAI on this pesticide fiasco.\n\n# CALL OUT\n\n\n\nhttps://preview.redd.it/wyt69uvd0myc1.png?width=726&format=png&auto=webp&s=26b29d35d7ac5cda9c96a6c68aa568d253d1ed56\n\nJust to preface I hate Adani as much as the next guy but....... this guys brain is conspiracy infested...... they don't know jack shit about the safe limit of the product but are confidently claiming that the raising of this pesticide limit was done to benefit Adani..... mate you literally have zero evidence don't go around making absurd claims like this because if in the future there are substantial and true claims in the future people will hesitate in believing them.\n\nhttps://preview.redd.it/lb800kle1myc1.png?width=653&format=png&auto=webp&s=b7fa382181510fa1a81855d8398c4850b2fd1f7e\n\nHere we see the deadly combination of ignorance and confidence lmao.\n\nhttps://preview.redd.it/2l46223o1myc1.png?width=691&format=png&auto=webp&s=6f18c5143829bb288f945a13221813df38dfbee0\n\n  \nHere we have the big brained OP telling us that we should make this a political issue..... here is a suggestion, we should make critical thinking in education a political issue so we have less dumb fucks like the OP\n\n# Conclusion\n\nThe main conclusion of this is that we should not blindly believe that every institution out there is just a big bad evil organization hell bent on fucking us up and destroying our live. You should acknowledge this bias you have towards these organizations and control your responses to these sensational headlines that are just made so that you click on them.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1714916702.0,
    "convurl": "https://a.thumbs.redditmedia.com/3bfPStBJ-jmNcYXa5jShOXlS8auTUiGRtxQDYTJ9TE0.jpg",
    "comments": [],
    "cleaned_text": "fear mongering regarding pesticides rant first post response post httpswwwredditcomrindiasirshutnkhttpswwwredditcomrindiasirshutnk post insinuates relaxation pesticide norms done fssai something bad blatanly wrong going point point case op researched topic also encounter sensational headlines take face value claims main claim article follows order issued april food safety standards authority india fssai raised mrl pesticide herbs spices mgkg previous mgkg regulator cited various representations reason upward revision okay fssai raised mrl mgkg mgkg dont get citation third party regulator harmful spoiler warning given doesnt exist dont get specific names spices pesticide red flag right dont clue bad decision incredibly vague claim supported following activists warned relaxation may lead increased rejections indian spices large export markets well heightened pesticide consumption among domestic consumers pesticide action network india nonprofit organisation also expressed concern potential health risks posed higher pesticide levels spices cumulative effects multiple pesticides reading call credibility pesticide action network india either dont know anything pesticides spewing bullshit made claims without getting full details regulation changes equally harmful even organization refutation relying httpswwwlivemintcomindustryagricultureindiahasoneofthemoststringentstandardsofmaximumresiduelimitsintheworldfssaihtmlarticle refuting claims first mgkg pesticide harmful talking particular pesticide spice example flubendiamide used brinjal mrl mgkg whereas bengal gram mrl mgkg huh surprisingly seems like look raw number mgkg tells us fuck point mentioning dumb shit like mgkg mgkg means literally nothing sometimes even mgkg permissible moving specifics safe residue limits spices around world new codex mrls dithiocarbamates phorate triazophos profenophos fennel mgkg fssai aligns updated standards mrls set codex alimentarius commission international food safety quality standard setting body created fao un european union fssai statement said seems like spices accepted mrl mgkg article blatant fear mongering misleading bullcrap another claim x increase surely x increase pesticide must harmful norm mrls fixed codex myclobutanil used chilli mgkg whereas limit set fssai mgkg spiromesifen used chilli codex limit mgkg fssai limit mgkg similarly codex standards metalaxyl metalaxylm used black pepper mgkg whereas limit set fssai mgkg shows current regulation could increased x still within limits international guideline also please go article mentioned contains full response fssai pesticide fiasco call preface hate adani much next guy guys brain conspiracy infested dont know jack shit safe limit product confidently claiming raising pesticide limit done benefit adani mate literally zero evidence dont go around making absurd claims like future substantial true claims future people hesitate believing see deadly combination ignorance confidence lmao big brained op telling us make political issue suggestion make critical thinking education political issue less dumb fucks like op conclusion main conclusion blindly believe every institution big bad evil organization hell bent fucking us destroying live acknowledge bias towards organizations control responses sensational headlines made click ",
    "cleaned_title": "fear mongering regarding pesticides rant",
    "cleaned_selftext": "first post response post httpswwwredditcomrindiasirshutnkhttpswwwredditcomrindiasirshutnk post insinuates relaxation pesticide norms done fssai something bad blatanly wrong going point point case op researched topic also encounter sensational headlines take face value claims main claim article follows order issued april food safety standards authority india fssai raised mrl pesticide herbs spices mgkg previous mgkg regulator cited various representations reason upward revision okay fssai raised mrl mgkg mgkg dont get citation third party regulator harmful spoiler warning given doesnt exist dont get specific names spices pesticide red flag right dont clue bad decision incredibly vague claim supported following activists warned relaxation may lead increased rejections indian spices large export markets well heightened pesticide consumption among domestic consumers pesticide action network india nonprofit organisation also expressed concern potential health risks posed higher pesticide levels spices cumulative effects multiple pesticides reading call credibility pesticide action network india either dont know anything pesticides spewing bullshit made claims without getting full details regulation changes equally harmful even organization refutation relying httpswwwlivemintcomindustryagricultureindiahasoneofthemoststringentstandardsofmaximumresiduelimitsintheworldfssaihtmlarticle refuting claims first mgkg pesticide harmful talking particular pesticide spice example flubendiamide used brinjal mrl mgkg whereas bengal gram mrl mgkg huh surprisingly seems like look raw number mgkg tells us fuck point mentioning dumb shit like mgkg mgkg means literally nothing sometimes even mgkg permissible moving specifics safe residue limits spices around world new codex mrls dithiocarbamates phorate triazophos profenophos fennel mgkg fssai aligns updated standards mrls set codex alimentarius commission international food safety quality standard setting body created fao un european union fssai statement said seems like spices accepted mrl mgkg article blatant fear mongering misleading bullcrap another claim x increase surely x increase pesticide must harmful norm mrls fixed codex myclobutanil used chilli mgkg whereas limit set fssai mgkg spiromesifen used chilli codex limit mgkg fssai limit mgkg similarly codex standards metalaxyl metalaxylm used black pepper mgkg whereas limit set fssai mgkg shows current regulation could increased x still within limits international guideline also please go article mentioned contains full response fssai pesticide fiasco call preface hate adani much next guy guys brain conspiracy infested dont know jack shit safe limit product confidently claiming raising pesticide limit done benefit adani mate literally zero evidence dont go around making absurd claims like future substantial true claims future people hesitate believing see deadly combination ignorance confidence lmao big brained op telling us make political issue suggestion make critical thinking education political issue less dumb fucks like op conclusion main conclusion blindly believe every institution big bad evil organization hell bent fucking us destroying live acknowledge bias towards organizations control responses sensational headlines made click",
    "cleaned_comments": "",
    "light_cleaned_title": "Fear Mongering Regarding Pesticides: A Rant",
    "light_cleaned_selftext": "First of all this is a post in response to this post [https://www.reddit.com/r/india/s/Ir09shUtnK](https://www.reddit.com/r/india/s/Ir09shUtnK) The post insinuates the \"relaxation of pesticide norms\" done by FSSAI is something bad. This is BLATANLY wrong. I will be going point by point on why this is the case and the OP should have researched about the topic. Also if you encounter such sensational headlines you should not take them at face value and what you should do with them. # CLAIMS The main claim of the article is as follows: >In an order issued on April 8, the Food Safety and Standards Authority of India (FSSAI) raised the MRL for a pesticide in herbs and spices to 0.1mg/kg from the previous 0.01mg/kg. The regulator cited “various representations” as the reason for this upward revision. Okay so FSSAI has raised the MRL from 0.1mg/kg to 0.01mg/kg. We don't get any citation from any third party regulator that this is harmful (spoiler warning: it was not given because it doesn't exist). We don't get any specific names of the spices and pesticide. This should be red flag. Right now you don't have any clue if this is a bad decision or not. This incredibly vague claim is then supported by the following: >.......activists had warned that this relaxation may lead to increased rejections of Indian spices in large export markets, as well as heightened pesticide consumption among domestic consumers. The Pesticide Action Network of India, a non-profit organisation, had also expressed concern over the potential health risks posed by higher pesticide levels in spices and the cumulative effects of multiple pesticides. By reading this I call into the credibility of The Pesticide Action Network of India because either they don't know anything about pesticides and are just spewing bullshit or they just made claims without getting the full details of the regulation changes which is equally as harmful, even more so as an organization. # REFUTATION I will be relying on [this ](https://www.livemint.com/industry/agriculture/india-has-one-of-the-most-stringent-standards-of-maximum-residue-limits-in-the-world-fssai-11714898152420.html)article for refuting the claims. First of is 0.1mg/kg of pesticide harmful for you.... not talking any particular pesticide or spice >For example, flubendiamide is used in brinjal with an MRL of 0.1mg/kg whereas for Bengal gram the MRL is 1.0mg/kg, Huh.... not so surprisingly seems like if we just look at raw number 0.1mg/kg tells us fuck all..... My point here is just mentioning dumb shit like 0.01mg/kg to 0.1mg/kg means literally nothing. Sometimes even 1.0mg/kg is permissible. Now moving on to the specifics. What are the safe residue limits for spices around the world >“The new Codex MRLs for Dithiocarbamates, Phorate, Triazophos and Profenophos for Fennel is 0.1mg/kg. FSSAI aligns with the updated standards of MRLs set by Codex Alimentarius Commission and International Food Safety and Quality Standard setting body created by WHO and FAO of UN and the European Union,\" the FSSAI statement said. Seems like there are spices which have the accepted MRL of 0.1mg/kg...... So the article was just blatant fear mongering and misleading bullcrap. Another claim was the 10x increase. Surely a 10x increase of pesticide must be harmful and out of the norm. >The MRLs fixed by Codex for myclobutanil used for chilli is 20mg/kg whereas limit set by FSSAI is 2mg/kg. For spiromesifen, used for chilli, Codex limit is 5mg/kg while FSSAI limit is 1mg/kg. Similarly, Codex standards for metalaxyl and metalaxyl-M used for black pepper is 2mg/kg whereas the limit set by FSSAI is 0.5mg/kg. This shows that some of the current regulation could be increased by 10x and still be within the limits of the international guideline. Also please go through the article i have mentioned above. It contains the full response of FSSAI on this pesticide fiasco. # CALL OUT Just to preface I hate Adani as much as the next guy but....... this guys brain is conspiracy infested...... they don't know jack shit about the safe limit of the product but are confidently claiming that the raising of this pesticide limit was done to benefit Adani..... mate you literally have zero evidence don't go around making absurd claims like this because if in the future there are substantial and true claims in the future people will hesitate in believing them. Here we see the deadly combination of ignorance and confidence lmao. Here we have the big brained OP telling us that we should make this a political issue..... here is a suggestion, we should make critical thinking in education a political issue so we have less dumb fucks like the OP # Conclusion The main conclusion of this is that we should not blindly believe that every institution out there is just a big bad evil organization hell bent on fucking us up and destroying our live. You should acknowledge this bias you have towards these organizations and control your responses to these sensational headlines that are just made so that you click on them.",
    "light_cleaned_comments": ""
}