{
    "id": "136fb5l",
    "title": "Toll Mafia Fraud in NH 44",
    "url": "https://www.reddit.com/r/india/comments/136fb5l/toll_mafia_fraud_in_nh_44/",
    "selftext": "While driving on NH 44, we were stopped at the Panipat Toll Plaza. The booth operator asked us to pay in cash because our FASTag didn't seem to work and upon questioning, we didn't get a clear answer as the display popped up \"blacklisted\" text on the screen.\n\nAs per the guidelines, vehicles that do not have a valid or functional FASTag must pay double the toll charge as a penalty. Oblivious to the balance amount, we were prompted to pay double as per the rules.\n\nWhen we followed up on the credit details, I found out that the fastag card had enough balance but the operator still refused to let me go because of the technical difficulties. \n\nThis incident repeated again while coming back from Himachal at the same toll booth and this time we refused to pay. The toll guys used scare tactics, assembled people around to pay and ridiculed us for not paying 90 rs (doubled amount) but did not give a reason for deducting the amount from our card. It was clear they are scamming people. I decided to pull out my phone to record and they got away and removed the barricades. I have tweeted about this incident  tagging NHAI and Nitin Gadkari to take cognizance into this matter. \n\nThis mafia works effortlessly because they work in groups to distract and pressurize people into paying, the cars honking in the queue create urgency, and if you do not have technical information on how FASTag works, people will pretty much submit to their demands.\n\nTLDR: As per the guidelines, vehicles that do not have a valid or functional FASTag must pay double the toll charge as a penalty. This rule is being abused by operators who maliciously mark vehicles as \"BLACKLISTED\" on the user fare display for unsuspecting drivers to extort ₹\n\nHas anyone else faced anything similar to this on toll plazas on GT road?\n\nTweet: https://twitter.com/rahulkaulvakil/status/1653670322179039232?s=19\n\nEDIT: Thank you for hearing me out. I was not expecting a response. The Internet gives me hope. Some of the measures suggested by users if you face a similar situation:\n\n1) Call helpline 1033 to report faulty reading from the operator if you feel the balance is appropriate and the card is worked in previous tolls. \n\n2) Report complaint on pgportal.gov.in \n\n3) Record them if they force you to pay in cash.",
    "flair": "Crime",
    "score": 270,
    "num_comments": 38,
    "created_utc": 1683105177.0,
    "convurl": "https://external-preview.redd.it/8A5II-SMRbN4aERdA0OHjVcyj0yrwwOCFp7q_A2_dUc.jpg?auto=webp&v=enabled&s=c698d7f32115bcdc5f4347e1376eb3011e0b63c4",
    "comments": [
        "Some toll plazas are certainly run by mafia.",
        "I remember a (probably) illegal toll booth in this area around 10 years ago. They were running a toll booth on their own, without any authorization. Probably the same guys.",
        "This is from a legit toll plaza. They are employees but evading the authorized process of no cash and generating their own fake invoices by charging double amount because apparently their system is not working. No one should pay any fee is the toll system is not working it's not the problem of the people.",
        "Fastags do get blacklisted!!!! Kindly contact your Fastag's issuing bank/vendor. Fastags get blacklisted due to various reasons like unpaid penalties, expired registeration, borrower absconding with financed vehicle, stolen vehicle, KYC found invalid etc. Ask your bank/vendor for reason for which it was blacklisted.",
        "Yes I do have the same question if it is really toll Mafia or op fasttag had some issue cause I cross same toll about 4 times a week never had that issue but once or twice had an issue they brought another machine and scanned the fasttag without any problem",
        "Everyone is trying to scam. Last month I visited an authorised service centre for my water damaged phone. They told me they will need to replace 4-5 parts but when I went back to collect the phone they gave me an invoice of display only. But they asked me to pay 1000 extra for other parts as well saying it wasn't in their system so they can't give an invoice for those.",
        "Can you list the reasons for FASTag to be blacklisted. In my case the card was neither tampered with nor low on balance. The guy rather tried to ridicule me for fussing over a small payment and did not give me a categorical reason why I was not allowed. \n\n>I cross same toll about 4 times a week never had that issue but once or twice had an issue they brought another machine and scanned the fasttag\n\nIt is fairly possible to not have a similar experience. They can't target every second car passing through there, it would bring unwanted attention. However considering the traffic, we can see the sample space is too big so even 100 cars a day could generate 3 lakhs per month from a single booth as a side income",
        "Where is your car registered? Wondering if they target people who aren’t from this side?",
        "If the FASTag is blacklisted for any of the aforementioned reasons, I believe it would not work at any toll. My experience of having a blacklisted text only seem to have appeared on the panipat toll TWICE. It worked everywhere else. \n\n>Ask your bank/vendor for reason for which it was blacklisted.\n\nIt is connected to Paytm wallet and I ensure the wallet has enough money to get through the tolls.",
        "Car is registered in HR and I was traveling with my brother. No idea how they choose their victims.",
        "If you are facing the issue only at a particular toll booth, then they are having a faulty reader. Raise your complaint at the Fastag helpline number 1033.\n\nhttps://ihmcl.co.in/fastag-user/#:~:text=You%20may%20call%20our%20customer%20care%201860%20210%208887%20for%20assistance.\n\nSee the last FAQ",
        "Thanks for sharing the helpline. I will be better equipped next time, if I find myself in this situation again.",
        "There is a rule if the toll booth has a fast tag but is not working, then they have to let you go for free. If anyone can verify please do correct me.",
        "I am aware about this but when you have a queue of cars honking behind you and a group of people huddled around your car waiting for you to pay then reasoning doesnt work, I pulled out my phone and threatened to start recording them and thankfully it worked.",
        "Agreed. It's a pressuring situation. I too faced it some months ago",
        "The whole country is being run by the mafia, are you concerned only about tolls?",
        "We were waiting in line in the toll plaza in Tamil Nadu. When they realised that the toll was not working, they just opened it and asked us to go.",
        "by any chance HR-26 ?",
        "File a complaint with the toll booth details to NHAI on pgportal.gov.in. They will take immediate action.\n\nIt works much better.",
        "File complaint in pgportal.gov.in",
        "Same! Happened twice on the new Mys-Blr expressway. Both ways, somehow the message showed “Blacklisted”. And the toll people were acting all sus and were trying to hurry our driver. He was adamant and showed them that he had enough balance. And behold, they magically deducted it! Some major scam",
        "This used to happen in Bangalore Nice road toll plaza as well. Just call NHAI helpline infront of the operator and see him shitting his pants.",
        "Did you get a receipt when you paid the double amount that first time? It happened to me too once and I did get a receipt, so I'm wondering if they still could have scammed me despite that.",
        "You think Nitin Gadkari will help you. He is the leader of the toll mafia.",
        "Yes I did get it for the first time when I paid it. I gave them the benefit of doubt for the first time around but with a group huddling up around in no time for cash it seemed fishy and premeditated.",
        "He might be but still ministers take to Twitter to score quick browny points or wipe eggs from their face. Either way, if this doesn't wake him up for his promise of unmanned tolls then nothing will.",
        "OHMYGOD EXACTLY THE SAME THING HAPPENED TO ME ON NH44 TRAVELING TO AND FROM DELHI-PUNJAB. \n\nI being the idiot I am was ready to pay the money but my father insisted that we dont. The only tip I have for everyone is to stand your ground and not give in to these goons when your card \"magically\" stops working. Its their machines fault, they are set up to not work so they can make you pay cash. Eventually someone is going to come with a working machine and let you through.",
        "I think what he is saying is , mark the vehicle blacklisted by visually scanning few vehicles ahead and blacklisting temporarily\n\nSo they can collect the extra by generating manual bill\n\n\nAny manual process in place of automation is for loopholes.",
        "Yeah, that one. Last year, they said your fast tag is not working etc etc, paid double in pressure. Drive 10km ahead, my sister called and said the amount was deducted from fast tag too. We were pissed, drove back and got the money back. That's how it has to be done with these idiots.",
        "or maybe your fasttag was just faulty that could not be read by the device",
        "Same thing happened with me too. But it was my mom's state government authorized vehicle.. so they let me go. I was also taken aback as to how Fastag could be blacklisted.",
        "Same happened to me, just 6 months ago, I paid around 250, the trick is to stay calm, as I have learned",
        "Just don't carry cash when driving, it's an open invitation to be scammed in India in 2023 by police or mafia goons.\n\nIf they offer to accept UPI say you're Canadian or some nonsense and so can't use UPI... Go to Wise.com (formerly Transferwise) and get a free foreign Debit card, they'll be confused as fuck. Even if they have a card payment terminal it wont allow them to take money in USD or CAD.\n\nI've done this many times myself, when the police or goons realise they can't get blood from a stone they'll want you to get lost ASAP so they can move onto scamming the next person.",
        "I am from haryana and today I crossed toll with Punjab number plate usually I cross with HR  plate still nothing and you are saying you got stopped twice did you cross any other tolls were they fine?",
        "I was going from the manesar side. There were probably 2 tolls before the panipat toll if I remember correctly and the card had no issues. For the first time, I gave them the benefit of doubt but while returning having the same issue at the same toll made it apparent it was hideous and done forcefully.",
        "MAFIA:\n\nM for .. moji\n\nA for adani\n\nF for fk\n\nI for I and you who else..\n\nA for ambani\n\n\"sare milke humko pagal bana rahe madhav chor ke bachhe\""
    ],
    "cleaned_text": "toll mafia fraud nh driving nh stopped panipat toll plaza booth operator asked us pay cash fastag didnt seem work upon questioning didnt get clear answer display popped blacklisted text screen per guidelines vehicles valid functional fastag must pay double toll charge penalty oblivious balance amount prompted pay double per rules followed credit details found fastag card enough balance operator still refused let go technical difficulties incident repeated coming back himachal toll booth time refused pay toll guys used scare tactics assembled people around pay ridiculed us paying rs doubled amount give reason deducting amount card clear scamming people decided pull phone record got away removed barricades tweeted incident tagging nhai nitin gadkari take cognizance matter mafia works effortlessly work groups distract pressurize people paying cars honking queue create urgency technical information fastag works people pretty much submit demands tldr per guidelines vehicles valid functional fastag must pay double toll charge penalty rule abused operators maliciously mark vehicles blacklisted user fare display unsuspecting drivers extort anyone else faced anything similar toll plazas gt road tweet edit thank hearing expecting response internet gives hope measures suggested users face similar situation call helpline report faulty reading operator feel balance appropriate card worked previous tolls report complaint pgportalgovin record force pay cash ",
    "cleaned_title": "toll mafia fraud nh",
    "cleaned_selftext": "driving nh stopped panipat toll plaza booth operator asked us pay cash fastag didnt seem work upon questioning didnt get clear answer display popped blacklisted text screen per guidelines vehicles valid functional fastag must pay double toll charge penalty oblivious balance amount prompted pay double per rules followed credit details found fastag card enough balance operator still refused let go technical difficulties incident repeated coming back himachal toll booth time refused pay toll guys used scare tactics assembled people around pay ridiculed us paying rs doubled amount give reason deducting amount card clear scamming people decided pull phone record got away removed barricades tweeted incident tagging nhai nitin gadkari take cognizance matter mafia works effortlessly work groups distract pressurize people paying cars honking queue create urgency technical information fastag works people pretty much submit demands tldr per guidelines vehicles valid functional fastag must pay double toll charge penalty rule abused operators maliciously mark vehicles blacklisted user fare display unsuspecting drivers extort anyone else faced anything similar toll plazas gt road tweet edit thank hearing expecting response internet gives hope measures suggested users face similar situation call helpline report faulty reading operator feel balance appropriate card worked previous tolls report complaint pgportalgovin record force pay cash",
    "cleaned_comments": "toll plazas certainly run mafia remember probably illegal toll booth area around years ago running toll booth without authorization probably guys legit toll plaza employees evading authorized process cash generating fake invoices charging double amount apparently system working one pay fee toll system working problem people fastags get blacklisted kindly contact fastags issuing bankvendor fastags get blacklisted due various reasons like unpaid penalties expired registeration borrower absconding financed vehicle stolen vehicle kyc found invalid etc ask bankvendor reason blacklisted yes question really toll mafia op fasttag issue cause cross toll times week never issue twice issue brought another machine scanned fasttag without problem everyone trying scam last month visited authorised service centre water damaged phone told need replace parts went back collect phone gave invoice display asked pay extra parts well saying wasnt system cant give invoice list reasons fastag blacklisted case card neither tampered low balance guy rather tried ridicule fussing small payment give categorical reason allowed cross toll times week never issue twice issue brought another machine scanned fasttag fairly possible similar experience cant target every second car passing would bring unwanted attention however considering traffic see sample space big even cars day could generate lakhs per month single booth side income car registered wondering target people arent side fastag blacklisted aforementioned reasons believe would work toll experience blacklisted text seem appeared panipat toll twice worked everywhere else ask bankvendor reason blacklisted connected paytm wallet ensure wallet enough money get tolls car registered hr traveling brother idea choose victims facing issue particular toll booth faulty reader raise complaint fastag helpline number see last faq thanks sharing helpline better equipped next time find situation rule toll booth fast tag working let go free anyone verify please correct aware queue cars honking behind group people huddled around car waiting pay reasoning doesnt work pulled phone threatened start recording thankfully worked agreed pressuring situation faced months ago whole country run mafia concerned tolls waiting line toll plaza tamil nadu realised toll working opened asked us go chance hr file complaint toll booth details nhai pgportalgovin take immediate action works much better file complaint pgportalgovin happened twice new mysblr expressway ways somehow message showed blacklisted toll people acting sus trying hurry driver adamant showed enough balance behold magically deducted major scam used happen bangalore nice road toll plaza well call nhai helpline infront operator see shitting pants get receipt paid double amount first time happened get receipt im wondering still could scammed despite think nitin gadkari help leader toll mafia yes get first time paid gave benefit doubt first time around group huddling around time cash seemed fishy premeditated might still ministers take twitter score quick browny points wipe eggs face either way doesnt wake promise unmanned tolls nothing ohmygod exactly thing happened nh traveling delhipunjab idiot ready pay money father insisted dont tip everyone stand ground give goons card magically stops working machines fault set work make pay cash eventually someone going come working machine let think saying mark vehicle blacklisted visually scanning vehicles ahead blacklisting temporarily collect extra generating manual bill manual process place automation loopholes yeah one last year said fast tag working etc etc paid double pressure drive km ahead sister called said amount deducted fast tag pissed drove back got money back thats done idiots maybe fasttag faulty could read device thing happened moms state government authorized vehicle let go also taken aback fastag could blacklisted happened months ago paid around trick stay calm learned dont carry cash driving open invitation scammed india police mafia goons offer accept upi say youre canadian nonsense cant use upi go wisecom formerly transferwise get free foreign debit card theyll confused fuck even card payment terminal wont allow take money usd cad ive done many times police goons realise cant get blood stone theyll want get lost asap move onto scamming next person haryana today crossed toll punjab number plate usually cross hr plate still nothing saying got stopped twice cross tolls fine going manesar side probably tolls panipat toll remember correctly card issues first time gave benefit doubt returning issue toll made apparent hideous done forcefully mafia moji adani f fk else ambani sare milke humko pagal bana rahe madhav chor ke bachhe",
    "light_cleaned_title": "Toll Mafia Fraud in NH 44",
    "light_cleaned_selftext": "While driving on NH 44, we were stopped at the Panipat Toll Plaza. The booth operator asked us to pay in cash because our FASTag didn't seem to work and upon questioning, we didn't get a clear answer as the display popped up \"blacklisted\" text on the screen. As per the guidelines, vehicles that do not have a valid or functional FASTag must pay double the toll charge as a penalty. Oblivious to the balance amount, we were prompted to pay double as per the rules. When we followed up on the credit details, I found out that the fastag card had enough balance but the operator still refused to let me go because of the technical difficulties. This incident repeated again while coming back from Himachal at the same toll booth and this time we refused to pay. The toll guys used scare tactics, assembled people around to pay and ridiculed us for not paying 90 rs (doubled amount) but did not give a reason for deducting the amount from our card. It was clear they are scamming people. I decided to pull out my phone to record and they got away and removed the barricades. I have tweeted about this incident tagging NHAI and Nitin Gadkari to take cognizance into this matter. This mafia works effortlessly because they work in groups to distract and pressurize people into paying, the cars honking in the queue create urgency, and if you do not have technical information on how FASTag works, people will pretty much submit to their demands. TLDR: As per the guidelines, vehicles that do not have a valid or functional FASTag must pay double the toll charge as a penalty. This rule is being abused by operators who maliciously mark vehicles as \"BLACKLISTED\" on the user fare display for unsuspecting drivers to extort ₹ Has anyone else faced anything similar to this on toll plazas on GT road? Tweet: EDIT: Thank you for hearing me out. I was not expecting a response. The Internet gives me hope. Some of the measures suggested by users if you face a similar situation: 1) Call helpline 1033 to report faulty reading from the operator if you feel the balance is appropriate and the card is worked in previous tolls. 2) Report complaint on pgportal.gov.in 3) Record them if they force you to pay in cash.",
    "light_cleaned_comments": "Some toll plazas are certainly run by mafia. I remember a (probably) illegal toll booth in this area around 10 years ago. They were running a toll booth on their own, without any authorization. Probably the same guys. This is from a legit toll plaza. They are employees but evading the authorized process of no cash and generating their own fake invoices by charging double amount because apparently their system is not working. No one should pay any fee is the toll system is not working it's not the problem of the people. Fastags do get blacklisted!!!! Kindly contact your Fastag's issuing bank/vendor. Fastags get blacklisted due to various reasons like unpaid penalties, expired registeration, borrower absconding with financed vehicle, stolen vehicle, KYC found invalid etc. Ask your bank/vendor for reason for which it was blacklisted. Yes I do have the same question if it is really toll Mafia or op fasttag had some issue cause I cross same toll about 4 times a week never had that issue but once or twice had an issue they brought another machine and scanned the fasttag without any problem Everyone is trying to scam. Last month I visited an authorised service centre for my water damaged phone. They told me they will need to replace 4-5 parts but when I went back to collect the phone they gave me an invoice of display only. But they asked me to pay 1000 extra for other parts as well saying it wasn't in their system so they can't give an invoice for those. Can you list the reasons for FASTag to be blacklisted. In my case the card was neither tampered with nor low on balance. The guy rather tried to ridicule me for fussing over a small payment and did not give me a categorical reason why I was not allowed. >I cross same toll about 4 times a week never had that issue but once or twice had an issue they brought another machine and scanned the fasttag It is fairly possible to not have a similar experience. They can't target every second car passing through there, it would bring unwanted attention. However considering the traffic, we can see the sample space is too big so even 100 cars a day could generate 3 lakhs per month from a single booth as a side income Where is your car registered? Wondering if they target people who aren’t from this side? If the FASTag is blacklisted for any of the aforementioned reasons, I believe it would not work at any toll. My experience of having a blacklisted text only seem to have appeared on the panipat toll TWICE. It worked everywhere else. >Ask your bank/vendor for reason for which it was blacklisted. It is connected to Paytm wallet and I ensure the wallet has enough money to get through the tolls. Car is registered in HR and I was traveling with my brother. No idea how they choose their victims. If you are facing the issue only at a particular toll booth, then they are having a faulty reader. Raise your complaint at the Fastag helpline number 1033. See the last FAQ Thanks for sharing the helpline. I will be better equipped next time, if I find myself in this situation again. There is a rule if the toll booth has a fast tag but is not working, then they have to let you go for free. If anyone can verify please do correct me. I am aware about this but when you have a queue of cars honking behind you and a group of people huddled around your car waiting for you to pay then reasoning doesnt work, I pulled out my phone and threatened to start recording them and thankfully it worked. Agreed. It's a pressuring situation. I too faced it some months ago The whole country is being run by the mafia, are you concerned only about tolls? We were waiting in line in the toll plaza in Tamil Nadu. When they realised that the toll was not working, they just opened it and asked us to go. by any chance HR-26 ? File a complaint with the toll booth details to NHAI on pgportal.gov.in. They will take immediate action. It works much better. File complaint in pgportal.gov.in Same! Happened twice on the new Mys-Blr expressway. Both ways, somehow the message showed “Blacklisted”. And the toll people were acting all sus and were trying to hurry our driver. He was adamant and showed them that he had enough balance. And behold, they magically deducted it! Some major scam This used to happen in Bangalore Nice road toll plaza as well. Just call NHAI helpline infront of the operator and see him shitting his pants. Did you get a receipt when you paid the double amount that first time? It happened to me too once and I did get a receipt, so I'm wondering if they still could have scammed me despite that. You think Nitin Gadkari will help you. He is the leader of the toll mafia. Yes I did get it for the first time when I paid it. I gave them the benefit of doubt for the first time around but with a group huddling up around in no time for cash it seemed fishy and premeditated. He might be but still ministers take to Twitter to score quick browny points or wipe eggs from their face. Either way, if this doesn't wake him up for his promise of unmanned tolls then nothing will. OHMYGOD EXACTLY THE SAME THING HAPPENED TO ME ON NH44 TRAVELING TO AND FROM DELHI-PUNJAB. I being the idiot I am was ready to pay the money but my father insisted that we dont. The only tip I have for everyone is to stand your ground and not give in to these goons when your card \"magically\" stops working. Its their machines fault, they are set up to not work so they can make you pay cash. Eventually someone is going to come with a working machine and let you through. I think what he is saying is , mark the vehicle blacklisted by visually scanning few vehicles ahead and blacklisting temporarily So they can collect the extra by generating manual bill Any manual process in place of automation is for loopholes. Yeah, that one. Last year, they said your fast tag is not working etc etc, paid double in pressure. Drive 10km ahead, my sister called and said the amount was deducted from fast tag too. We were pissed, drove back and got the money back. That's how it has to be done with these idiots. or maybe your fasttag was just faulty that could not be read by the device Same thing happened with me too. But it was my mom's state government authorized vehicle.. so they let me go. I was also taken aback as to how Fastag could be blacklisted. Same happened to me, just 6 months ago, I paid around 250, the trick is to stay calm, as I have learned Just don't carry cash when driving, it's an open invitation to be scammed in India in 2023 by police or mafia goons. If they offer to accept UPI say you're Canadian or some nonsense and so can't use UPI... Go to Wise.com (formerly Transferwise) and get a free foreign Debit card, they'll be confused as fuck. Even if they have a card payment terminal it wont allow them to take money in USD or CAD. I've done this many times myself, when the police or goons realise they can't get blood from a stone they'll want you to get lost ASAP so they can move onto scamming the next person. I am from haryana and today I crossed toll with Punjab number plate usually I cross with HR plate still nothing and you are saying you got stopped twice did you cross any other tolls were they fine? I was going from the manesar side. There were probably 2 tolls before the panipat toll if I remember correctly and the card had no issues. For the first time, I gave them the benefit of doubt but while returning having the same issue at the same toll made it apparent it was hideous and done forcefully. MAFIA: M for .. moji A for adani F for fk I for I and you who else.. A for ambani \"sare milke humko pagal bana rahe madhav chor ke bachhe\""
}