{
    "id": "16mpln9",
    "title": "Places to visit in India",
    "url": "https://www.reddit.com/r/india/comments/16mpln9/places_to_visit_in_india/",
    "selftext": "Hey guys, I am looking for some suggestions for travelling to places in India. I want mostly places which can be covered over a duration of 3-4 days (basically long weekends).\n\nIt would be really helpful if you can fill in this simple form: [https://forms.gle/Qajeid5uiD9QkJj88](https://forms.gle/Qajeid5uiD9QkJj88) (30 seconds max.) so, I can have a structured data which can be referred every time I want to plan for my trip.\n\nThanks",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695126384.0,
    "convurl": "https://external-preview.redd.it/bPUHrozKO1l1RLkwN7LJZOCmFxb03WPfD_kppIaPkwQ.jpg?auto=webp&s=b39770938db59a6f34b4afdb52a16ba5d33694b2",
    "comments": [
        "Not going to fill out the form but go to munnar and alleppey. I am visiting munnar for the 3rd time and I am left awestruck by how beautiful it is always. If you do end up going, I recommend taking the battery car at the eravikulam national park. It's a bit pricey but so worth"
    ],
    "cleaned_text": "places visit india hey guys looking suggestions travelling places india want mostly places covered duration days basically long weekends would really helpful fill simple form httpsformsgleqajeiduidqkjjhttpsformsgleqajeiduidqkjj seconds max structured data referred every time want plan trip thanks ",
    "cleaned_title": "places visit india",
    "cleaned_selftext": "hey guys looking suggestions travelling places india want mostly places covered duration days basically long weekends would really helpful fill simple form httpsformsgleqajeiduidqkjjhttpsformsgleqajeiduidqkjj seconds max structured data referred every time want plan trip thanks",
    "cleaned_comments": "going fill form go munnar alleppey visiting munnar rd time left awestruck beautiful always end going recommend taking battery car eravikulam national park bit pricey worth",
    "light_cleaned_title": "Places to visit in India",
    "light_cleaned_selftext": "Hey guys, I am looking for some suggestions for travelling to places in India. I want mostly places which can be covered over a duration of 3-4 days (basically long weekends). It would be really helpful if you can fill in this simple form: [https://forms.gle/Qajeid5uiD9QkJj88](https://forms.gle/Qajeid5uiD9QkJj88) (30 seconds max.) so, I can have a structured data which can be referred every time I want to plan for my trip. Thanks",
    "light_cleaned_comments": "Not going to fill out the form but go to munnar and alleppey. I am visiting munnar for the 3rd time and I am left awestruck by how beautiful it is always. If you do end up going, I recommend taking the battery car at the eravikulam national park. It's a bit pricey but so worth"
}