{
    "id": "16my8ab",
    "title": "On Quantum Of Quota For Women, States Should...: MK Stalin",
    "url": "https://www.ndtv.com/india-news/on-quantum-of-quota-for-women-states-should-mk-stalin-4405437",
    "selftext": "Thoughts on this ?",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1695147435.0,
    "convurl": "https://external-preview.redd.it/y87QYwXxoG79z0j6O335QEkPBC0e-V_2O8p4uWCD7Nk.jpg?auto=webp&v=enabled&s=ea758714a435d12110f9a302f1391af5b4efe6ef",
    "comments": [
        "Giving reservation to women in a country when women are considered lower than men but men need them is an insult. Women don’t need reservations. They are more powerful than men. And why aren’t people talking about Trans Horizontal Reservation.",
        " We need sub reservation, Hindu, Christian, Muslim, Jain, Buddhist, Parsi, Atheist woman and further SC/ST, MBC, BC as well.",
        "Isn't Stalin trying to become the next PM? How many support Stalin for PM?",
        "I wish he was, problem with Dravidian parties have always been their insular focus on Tamil issues only. If it was say at least trying to expand just to southern states for now, a better representative of southern Indian issues could emerge."
    ],
    "cleaned_text": "quantum quota women states mk stalin thoughts ",
    "cleaned_title": "quantum quota women states mk stalin",
    "cleaned_selftext": "thoughts",
    "cleaned_comments": "giving reservation women country women considered lower men men need insult women dont need reservations powerful men arent people talking trans horizontal reservation need sub reservation hindu christian muslim jain buddhist parsi atheist woman scst mbc bc well isnt stalin trying become next pm many support stalin pm wish problem dravidian parties always insular focus tamil issues say least trying expand southern states better representative southern indian issues could emerge",
    "light_cleaned_title": "On Quantum Of Quota For Women, States Should...: MK Stalin",
    "light_cleaned_selftext": "Thoughts on this ?",
    "light_cleaned_comments": "Giving reservation to women in a country when women are considered lower than men but men need them is an insult. Women don’t need reservations. They are more powerful than men. And why aren’t people talking about Trans Horizontal Reservation. We need sub reservation, Hindu, Christian, Muslim, Jain, Buddhist, Parsi, Atheist woman and further SC/ST, MBC, BC as well. Isn't Stalin trying to become the next PM? How many support Stalin for PM? I wish he was, problem with Dravidian parties have always been their insular focus on Tamil issues only. If it was say at least trying to expand just to southern states for now, a better representative of southern Indian issues could emerge."
}