{
    "id": "1c15zk1",
    "title": "Supreme Court says Delhi Metro not obliged to pay ₹8,000 crore to Anil Ambani's firm | Mint",
    "url": "https://www.livemint.com/companies/news/delhi-metro-not-to-pay-rs-8-000-crore-to-reliance-infra-shares-anil-ambani-delhi-airport-metro-express-private-ltd-11712737279300.html",
    "selftext": "Some interesting facts:\n\n1. An arbitral tribunal (out of court body in layman language that adjudicates disputes) gave a 2000 cr award in favor of Anil Ambani's DAMEPL (Reliance);\n\n2. The award was against Delhi Metro (practically the taxpayer's money in the context);\n\n3. The amount ballooned to 8000 cr in 2024 due to interest;\n\n4. Delhi Metro appealed before Delhi High Court;\n\n5. Single Judge of Delhi HC dismissed Delhi Metro case and upheld award in favor of Reliance;\n\n5. Delhi Metro appealed before Division Bench of Delhi HC (basically a bench of 2 judges);\n\n6. The 2 judges (one of which was Sanjiv Khanna, now a SC judge) held the award to be perverse and allowed appeal in favor of Delhi Metro;\n\n7. Reliance appealed to Supreme Court, which in 2021 overturned the Delhi HC judgment. Basically SC ordered in favor of Reliance;\n\n8. A curative petition was filed by Delhi Metro (basically an appeal against an appeal in SC in rare cases) which was heard by CJI led bench also comprising judges Gavai and Surya Kant;\n\n9. Delhi Metro was represented by PS Narsimha (now an SC judge) before Delhi HC and by KK Venugopal (former Attorney General), Venkatramani (current Attorney General) before the Supreme Court amongst other lawyers.\n\n10. Reliance was represented by P. Chidamabram before the High Court and \nBy Harish Salve, Kapil Sibal before the Supreme Court amongst others. \n\nBasically the award saves 8000cr of taxpayer money that would have otherwise benefited Reliance, it seems. \n",
    "flair": "Law & Courts",
    "score": 569,
    "num_comments": 46,
    "created_utc": 1712809208.0,
    "convurl": "https://external-preview.redd.it/6oiwkZ-BLoh8XMy3mp63x91m6GJ24dbgB40RW3IXT9Y.jpg?auto=webp&s=12cdd558a2c9f0e899f429b750efcfdd53ed34fd",
    "comments": [
        "The current SC judges are God sent",
        "Some sense still prevails…",
        "Valid till Oct ?",
        "Between the Delhi HC and Supreme Court the decision flipped each time on new filing. The courts should be looking at the process, because Delhi Metro and Ambani can funded multi year battles in High Court and Supreme Court, but average person can't. Why were the judgement flaky? \n\nDelhi Metro has operated the line without issues after Reliance cancelled, while Reliance wanted to not pay contract fees and then filed to cancel arguing line wasn't safe enough and getting penalty amount from Delhi Metro. Seems a lot like Reliance wanted to fleece public body and Delhi metro didn't bend.",
        "These representative advocates must be earning so much. This salve guy also represents SBI in the electoral bond scam.",
        "Khanna would be proud.  \nStill the only judge with a painting in the Supreme Court.  \nHe's the reason why the BJP aren't trying to meddle in judiciary much.  \nCongress rule taught politicians that trying something like that will result in a mutiny from the entirety of the bar.",
        "Can you elaborate a little more? Sounds interesting",
        "Surprised to see Sibal representing Reliance.",
        "How come Harish salve always represents bjp friends 🤔🤔 has the dude ever represented any public interest appeal?",
        "How I was seething at BJP for this before I finally read the lawyer names 🥲",
        "Game is game",
        "Read the wiki   \n[https://en.wikipedia.org/wiki/Hans\\_Raj\\_Khanna](https://en.wikipedia.org/wiki/Hans_Raj_Khanna)",
        "Ohhh. I remember. Love this guy. The Constitution is a little safer because of this guy. Basic Structure - the idea of secularism can't be changed. Isn't Justice Sanjiv Khanna his nephew? Do you think our next CJI Sanjiv Khanna would be this honest?\n\nHe's usually sitting with Bela Trivedi",
        "Good. Now someone as MH government to pay bare minimum to overtake Line 1 metro in Mumbai and we're good.",
        "I honestly cannot predict whether he would rise to the iron morality shown by his uncle. What is for sure is that **y**ou can see the effects of growing up and ascending in a post-Khanna age in Chandrachud, maybe he would be ballsy enough to forego seniority in his recommendation to the  ministry of law and justice",
        "Salve is a menace fr. court ko circus banake rakhta hai",
        "he needs rokda to have lavish weddings and live comfortably in the UK. /s",
        "You need to pay several lakhs for a single meeting with Salve. He’s top dog.",
        "I'm curious what the actual dispute was though.. article is a bit sparse on that\n\nPoint being, is it a case of Reliance trying to extract taxpayer money for its profit, or is it a case of DMRC not living up to commitments and getting a free pass for being a pseudo govt body",
        "Second case.",
        "Recently Kapil SIbbal's per hearing fee memo was leaked and it was massive.",
        "From what I could gather, while reading about it, was the fact that the termination by Reliance entity of the 30 year contract after just few months of operation was held to be without sufficient cause. They had alleged certain damages all of which were cured by DMRC much prior to the termination notice. Also, separately u remember when the termination had actually happened some outlets had reported that Reliance did not find it viable as footfall was below expectations. Reliance also  wanted to shirk its share of risk sharing in the venture.",
        "Haha, I do get why you say that. However, in this case you'll have to appreciate that the government took the right legal steps and did not step back despite the initial setback at SC. Also, DMRC has equal equity participation from central and Delhi govt.",
        "I must also appreciate how you looked at it objectively.",
        "I must also appreciate how you looked at it objectively.",
        "> Reliance was represented by P. Chidamabram before the High Court and By Harish Salve, Kapil Sibal before the Supreme Court amongst others.\n\nwat tha fack",
        "Readers not that this is related to the Orange line.\n\nAs a delhite, let me say that this was such a big scam. The orange line was built totally by reliance infra, unlike the other 8-9 metro lines which is built by DMRC and outsourced partners. It connected New delhi railway station with IGI airport, which is great, but it had a seperate ticket that was 10x more costly than a normal ticket, it had a different train model, it ran once every 20 minutes unlike the normal 5-6 minute average. And it was a big fail. Maybe they thought it would earn them a lot of money, but its ridership was low. They soon offloaded it on the DMRC.\n\nIt was a bad idea with bad execution and it should never have been built the way it had. Delhi needs metro connectivity to the airport, but it doesnt need a special train. \n\nI'm glad SC resolved matters because RelInfra was getting free money for a fuck up of their own. I'm sure they greased a lot of palms to get the contract, and they are not solely to blame for this mess, but I'm glad they arent getting paid for this botched job",
        "Now who gets 8000cr loan and leave the country?",
        "They are lawyers for a reason. Their job IS to be a menace in courts.",
        "Lives in London, with Ambanis as friends, several fugitive Indian businessmen attended his third wedding recently. Defended CAA, Salman Khan, etc. You get the man, right?",
        "He was forced to represent Bilkis Bano, I think.",
        "Ah yes, free 1 billion dollars why not",
        "Now say goodbye to any private company taking up metro projects.",
        "I think they should pay Ambani the money he is due. Aise gareebmaar nahi karte. Poor Anil is on page 3 holidaying in discount resorts of Thailand while his brother is bringing Rihanna for ladies sangeet. He has no money left. On top of that, when the poor guy gets some contract after hard work people say Adani Ambani.",
        "How much is it?",
        "see for yourself [https://imgur.com/a/kcrT9D9](https://imgur.com/a/kcrT9D9)",
        "*For Limited time",
        "that's the modus operandi of anil ambani, bc har baar govt se paisa chahiye isko. sara loss tax payers se recover karega",
        "This Salve guy is also named in Panama Papers Scandal: https://en.m.wikipedia.org/wiki/List_of_people_named_in_the_Panama_Papers",
        "Then it will be some bank, it will become an NPA and the taxpayers money will wipe it off because the govt will favour the Uber rich",
        "I don't get why people are celebrating as if it's not a convulated decesion, court gave no justification for it's reasoning of why exactly Reliance Infra isn't owed some money. \n\nThe agreement was that between Reliance and DMRC for operations, there was an agreed upon termination fee  which had to be paid irrespective of reasnoning behind the termination. The contract itself should haven't been made but that's not what the case is about. The supreme court itself agreed on the compensation. \n\nCurative plea is supposed to be for *grave injustice.* The only grave injustice here seems to be the contract dispute going against a public utility but contract law isn't supposed to be taking sides. \n\nSupreme in this decesion overturned; Itself, Orignal Delhi high court decesion and three court arbitrators who decided on the penalty. No wonder foreign investors choose singapore as arbitration localility not that it matters, one can ask Amazon. This only enahances distrust of Indian justice system.",
        "How is supreme court overtuning itself sense prevailing ?",
        "Taalis lakh",
        "Don't worry OP, no matter what happens, the taxpayer money will be in the wrong hands. Since they don't have to pay back this, they can let all the Delhi folks travel for free this entire year😂",
        "Reliance has also dug up roads for jio fibre and the roads were dug and reinstated by TAX payers money ."
    ],
    "cleaned_text": "supreme court says delhi metro obliged pay crore anil ambanis firm mint interesting facts arbitral tribunal court body layman language adjudicates disputes gave cr award favor anil ambanis damepl reliance award delhi metro practically taxpayers money context amount ballooned cr due interest delhi metro appealed delhi high court single judge delhi hc dismissed delhi metro case upheld award favor reliance delhi metro appealed division bench delhi hc basically bench judges judges one sanjiv khanna sc judge held award perverse allowed appeal favor delhi metro reliance appealed supreme court overturned delhi hc judgment basically sc ordered favor reliance curative petition filed delhi metro basically appeal appeal sc rare cases heard cji led bench also comprising judges gavai surya kant delhi metro represented ps narsimha sc judge delhi hc kk venugopal former attorney general venkatramani current attorney general supreme court amongst lawyers reliance represented p chidamabram high court harish salve kapil sibal supreme court amongst others basically award saves cr taxpayer money would otherwise benefited reliance seems ",
    "cleaned_title": "supreme court says delhi metro obliged pay crore anil ambanis firm mint",
    "cleaned_selftext": "interesting facts arbitral tribunal court body layman language adjudicates disputes gave cr award favor anil ambanis damepl reliance award delhi metro practically taxpayers money context amount ballooned cr due interest delhi metro appealed delhi high court single judge delhi hc dismissed delhi metro case upheld award favor reliance delhi metro appealed division bench delhi hc basically bench judges judges one sanjiv khanna sc judge held award perverse allowed appeal favor delhi metro reliance appealed supreme court overturned delhi hc judgment basically sc ordered favor reliance curative petition filed delhi metro basically appeal appeal sc rare cases heard cji led bench also comprising judges gavai surya kant delhi metro represented ps narsimha sc judge delhi hc kk venugopal former attorney general venkatramani current attorney general supreme court amongst lawyers reliance represented p chidamabram high court harish salve kapil sibal supreme court amongst others basically award saves cr taxpayer money would otherwise benefited reliance seems",
    "cleaned_comments": "current sc judges god sent sense still prevails valid till oct delhi hc supreme court decision flipped time new filing courts looking process delhi metro ambani funded multi year battles high court supreme court average person cant judgement flaky delhi metro operated line without issues reliance cancelled reliance wanted pay contract fees filed cancel arguing line wasnt safe enough getting penalty amount delhi metro seems lot like reliance wanted fleece public body delhi metro didnt bend representative advocates must earning much salve guy also represents sbi electoral bond scam khanna would proud still judge painting supreme court hes reason bjp arent trying meddle judiciary much congress rule taught politicians trying something like result mutiny entirety bar elaborate little sounds interesting surprised see sibal representing reliance come harish salve always represents bjp friends dude ever represented public interest appeal seething bjp finally read lawyer names game game read wiki httpsenwikipediaorgwikihansrajkhannahttpsenwikipediaorgwikihansrajkhanna ohhh remember love guy constitution little safer guy basic structure idea secularism cant changed isnt justice sanjiv khanna nephew think next cji sanjiv khanna would honest hes usually sitting bela trivedi good someone mh government pay bare minimum overtake line metro mumbai good honestly predict whether would rise iron morality shown uncle sure see effects growing ascending postkhanna age chandrachud maybe would ballsy enough forego seniority recommendation ministry law justice salve menace fr court ko circus banake rakhta hai needs rokda lavish weddings live comfortably uk need pay several lakhs single meeting salve hes top dog im curious actual dispute though article bit sparse point case reliance trying extract taxpayer money profit case dmrc living commitments getting free pass pseudo govt body second case recently kapil sibbals per hearing fee memo leaked massive could gather reading fact termination reliance entity year contract months operation held without sufficient cause alleged certain damages cured dmrc much prior termination notice also separately u remember termination actually happened outlets reported reliance find viable footfall expectations reliance also wanted shirk share risk sharing venture haha get say however case youll appreciate government took right legal steps step back despite initial setback sc also dmrc equal equity participation central delhi govt must also appreciate looked objectively must also appreciate looked objectively reliance represented p chidamabram high court harish salve kapil sibal supreme court amongst others wat tha fack readers related orange line delhite let say big scam orange line built totally reliance infra unlike metro lines built dmrc outsourced partners connected new delhi railway station igi airport great seperate ticket x costly normal ticket different train model ran every minutes unlike normal minute average big fail maybe thought would earn lot money ridership low soon offloaded dmrc bad idea bad execution never built way delhi needs metro connectivity airport doesnt need special train im glad sc resolved matters relinfra getting free money fuck im sure greased lot palms get contract solely blame mess im glad arent getting paid botched job gets cr loan leave country lawyers reason job menace courts lives london ambanis friends several fugitive indian businessmen attended third wedding recently defended caa salman khan etc get man right forced represent bilkis bano think ah yes free billion dollars say goodbye private company taking metro projects think pay ambani money due aise gareebmaar nahi karte poor anil page holidaying discount resorts thailand brother bringing rihanna ladies sangeet money left top poor guy gets contract hard work people say adani ambani much see httpsimgurcomakcrtdhttpsimgurcomakcrtd limited time thats modus operandi anil ambani bc har baar govt se paisa chahiye isko sara loss tax payers se recover karega salve guy also named panama papers scandal bank become npa taxpayers money wipe govt favour uber rich dont get people celebrating convulated decesion court gave justification reasoning exactly reliance infra isnt owed money agreement reliance dmrc operations agreed upon termination fee paid irrespective reasnoning behind termination contract havent made thats case supreme court agreed compensation curative plea supposed grave injustice grave injustice seems contract dispute going public utility contract law isnt supposed taking sides supreme decesion overturned orignal delhi high court decesion three court arbitrators decided penalty wonder foreign investors choose singapore arbitration localility matters one ask amazon enahances distrust indian justice system supreme court overtuning sense prevailing taalis lakh dont worry op matter happens taxpayer money wrong hands since dont pay back let delhi folks travel free entire year reliance also dug roads jio fibre roads dug reinstated tax payers money",
    "light_cleaned_title": "Supreme Court says Delhi Metro not obliged to pay ₹8,000 crore to Anil Ambani's firm | Mint",
    "light_cleaned_selftext": "Some interesting facts: 1. An arbitral tribunal (out of court body in layman language that adjudicates disputes) gave a 2000 cr award in favor of Anil Ambani's DAMEPL (Reliance); 2. The award was against Delhi Metro (practically the taxpayer's money in the context); 3. The amount ballooned to 8000 cr in 2024 due to interest; 4. Delhi Metro appealed before Delhi High Court; 5. Single Judge of Delhi HC dismissed Delhi Metro case and upheld award in favor of Reliance; 5. Delhi Metro appealed before Division Bench of Delhi HC (basically a bench of 2 judges); 6. The 2 judges (one of which was Sanjiv Khanna, now a SC judge) held the award to be perverse and allowed appeal in favor of Delhi Metro; 7. Reliance appealed to Supreme Court, which in 2021 overturned the Delhi HC judgment. Basically SC ordered in favor of Reliance; 8. A curative petition was filed by Delhi Metro (basically an appeal against an appeal in SC in rare cases) which was heard by CJI led bench also comprising judges Gavai and Surya Kant; 9. Delhi Metro was represented by PS Narsimha (now an SC judge) before Delhi HC and by KK Venugopal (former Attorney General), Venkatramani (current Attorney General) before the Supreme Court amongst other lawyers. 10. Reliance was represented by P. Chidamabram before the High Court and By Harish Salve, Kapil Sibal before the Supreme Court amongst others. Basically the award saves 8000cr of taxpayer money that would have otherwise benefited Reliance, it seems.",
    "light_cleaned_comments": "The current SC judges are God sent Some sense still prevails… Valid till Oct ? Between the Delhi HC and Supreme Court the decision flipped each time on new filing. The courts should be looking at the process, because Delhi Metro and Ambani can funded multi year battles in High Court and Supreme Court, but average person can't. Why were the judgement flaky? Delhi Metro has operated the line without issues after Reliance cancelled, while Reliance wanted to not pay contract fees and then filed to cancel arguing line wasn't safe enough and getting penalty amount from Delhi Metro. Seems a lot like Reliance wanted to fleece public body and Delhi metro didn't bend. These representative advocates must be earning so much. This salve guy also represents SBI in the electoral bond scam. Khanna would be proud. Still the only judge with a painting in the Supreme Court. He's the reason why the BJP aren't trying to meddle in judiciary much. Congress rule taught politicians that trying something like that will result in a mutiny from the entirety of the bar. Can you elaborate a little more? Sounds interesting Surprised to see Sibal representing Reliance. How come Harish salve always represents bjp friends 🤔🤔 has the dude ever represented any public interest appeal? How I was seething at BJP for this before I finally read the lawyer names 🥲 Game is game Read the wiki [https://en.wikipedia.org/wiki/Hans\\_Raj\\_Khanna](https://en.wikipedia.org/wiki/Hans_Raj_Khanna) Ohhh. I remember. Love this guy. The Constitution is a little safer because of this guy. Basic Structure - the idea of secularism can't be changed. Isn't Justice Sanjiv Khanna his nephew? Do you think our next CJI Sanjiv Khanna would be this honest? He's usually sitting with Bela Trivedi Good. Now someone as MH government to pay bare minimum to overtake Line 1 metro in Mumbai and we're good. I honestly cannot predict whether he would rise to the iron morality shown by his uncle. What is for sure is that **y**ou can see the effects of growing up and ascending in a post-Khanna age in Chandrachud, maybe he would be ballsy enough to forego seniority in his recommendation to the ministry of law and justice Salve is a menace fr. court ko circus banake rakhta hai he needs rokda to have lavish weddings and live comfortably in the UK. /s You need to pay several lakhs for a single meeting with Salve. He’s top dog. I'm curious what the actual dispute was though.. article is a bit sparse on that Point being, is it a case of Reliance trying to extract taxpayer money for its profit, or is it a case of DMRC not living up to commitments and getting a free pass for being a pseudo govt body Second case. Recently Kapil SIbbal's per hearing fee memo was leaked and it was massive. From what I could gather, while reading about it, was the fact that the termination by Reliance entity of the 30 year contract after just few months of operation was held to be without sufficient cause. They had alleged certain damages all of which were cured by DMRC much prior to the termination notice. Also, separately u remember when the termination had actually happened some outlets had reported that Reliance did not find it viable as footfall was below expectations. Reliance also wanted to shirk its share of risk sharing in the venture. Haha, I do get why you say that. However, in this case you'll have to appreciate that the government took the right legal steps and did not step back despite the initial setback at SC. Also, DMRC has equal equity participation from central and Delhi govt. I must also appreciate how you looked at it objectively. I must also appreciate how you looked at it objectively. > Reliance was represented by P. Chidamabram before the High Court and By Harish Salve, Kapil Sibal before the Supreme Court amongst others. wat tha fack Readers not that this is related to the Orange line. As a delhite, let me say that this was such a big scam. The orange line was built totally by reliance infra, unlike the other 8-9 metro lines which is built by DMRC and outsourced partners. It connected New delhi railway station with IGI airport, which is great, but it had a seperate ticket that was 10x more costly than a normal ticket, it had a different train model, it ran once every 20 minutes unlike the normal 5-6 minute average. And it was a big fail. Maybe they thought it would earn them a lot of money, but its ridership was low. They soon offloaded it on the DMRC. It was a bad idea with bad execution and it should never have been built the way it had. Delhi needs metro connectivity to the airport, but it doesnt need a special train. I'm glad SC resolved matters because RelInfra was getting free money for a fuck up of their own. I'm sure they greased a lot of palms to get the contract, and they are not solely to blame for this mess, but I'm glad they arent getting paid for this botched job Now who gets 8000cr loan and leave the country? They are lawyers for a reason. Their job IS to be a menace in courts. Lives in London, with Ambanis as friends, several fugitive Indian businessmen attended his third wedding recently. Defended CAA, Salman Khan, etc. You get the man, right? He was forced to represent Bilkis Bano, I think. Ah yes, free 1 billion dollars why not Now say goodbye to any private company taking up metro projects. I think they should pay Ambani the money he is due. Aise gareebmaar nahi karte. Poor Anil is on page 3 holidaying in discount resorts of Thailand while his brother is bringing Rihanna for ladies sangeet. He has no money left. On top of that, when the poor guy gets some contract after hard work people say Adani Ambani. How much is it? see for yourself [https://imgur.com/a/kcrT9D9](https://imgur.com/a/kcrT9D9) *For Limited time that's the modus operandi of anil ambani, bc har baar govt se paisa chahiye isko. sara loss tax payers se recover karega This Salve guy is also named in Panama Papers Scandal: Then it will be some bank, it will become an NPA and the taxpayers money will wipe it off because the govt will favour the Uber rich I don't get why people are celebrating as if it's not a convulated decesion, court gave no justification for it's reasoning of why exactly Reliance Infra isn't owed some money. The agreement was that between Reliance and DMRC for operations, there was an agreed upon termination fee which had to be paid irrespective of reasnoning behind the termination. The contract itself should haven't been made but that's not what the case is about. The supreme court itself agreed on the compensation. Curative plea is supposed to be for *grave injustice.* The only grave injustice here seems to be the contract dispute going against a public utility but contract law isn't supposed to be taking sides. Supreme in this decesion overturned; Itself, Orignal Delhi high court decesion and three court arbitrators who decided on the penalty. No wonder foreign investors choose singapore as arbitration localility not that it matters, one can ask Amazon. This only enahances distrust of Indian justice system. How is supreme court overtuning itself sense prevailing ? Taalis lakh Don't worry OP, no matter what happens, the taxpayer money will be in the wrong hands. Since they don't have to pay back this, they can let all the Delhi folks travel for free this entire year😂 Reliance has also dug up roads for jio fibre and the roads were dug and reinstated by TAX payers money ."
}