{
    "id": "14e4iou",
    "title": "is there anyone else here who doesn't watch anything regional?",
    "url": "https://www.reddit.com/r/india/comments/14e4iou/is_there_anyone_else_here_who_doesnt_watch/",
    "selftext": "if you were to scroll through my youtube homepage, or any other social media platform for that matter, you'd be hard pressed to find a single recommendation featuring any indian personality, local news, anything related to bollywood, cricket, or indian politics.\n\nhere's a video of me spending two minutes browsing my  personalized youtube looks like lol  for reference >< https://youtu.be/NJ3TCYkWYYk\n\nwondering how common this is ;-;",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1687247237.0,
    "convurl": "https://external-preview.redd.it/qOzWHPs2OfWHHMg6Q0FduGn8SoIzXqnOMk354ViF51Y.jpg?auto=webp&v=enabled&s=7a1d9377b199ab2e307e82da75a0c7382f1ea453",
    "comments": [
        "Mine shows 0 Indian stuff. Turn off watching history.",
        "Apart from tech related channels like Gyan Therapy and such I only watch Qurious Mango and Nitish Rajput."
    ],
    "cleaned_text": "anyone else doesnt watch anything regional scroll youtube homepage social media platform matter youd hard pressed find single recommendation featuring indian personality local news anything related bollywood cricket indian politics heres video spending two minutes browsing personalized youtube looks like lol reference wondering common ",
    "cleaned_title": "anyone else doesnt watch anything regional",
    "cleaned_selftext": "scroll youtube homepage social media platform matter youd hard pressed find single recommendation featuring indian personality local news anything related bollywood cricket indian politics heres video spending two minutes browsing personalized youtube looks like lol reference wondering common",
    "cleaned_comments": "mine shows indian stuff turn watching history apart tech related channels like gyan therapy watch qurious mango nitish rajput",
    "light_cleaned_title": "is there anyone else here who doesn't watch anything regional?",
    "light_cleaned_selftext": "if you were to scroll through my youtube homepage, or any other social media platform for that matter, you'd be hard pressed to find a single recommendation featuring any indian personality, local news, anything related to bollywood, cricket, or indian politics. here's a video of me spending two minutes browsing my personalized youtube looks like lol for reference >< wondering how common this is ;-;",
    "light_cleaned_comments": "Mine shows 0 Indian stuff. Turn off watching history. Apart from tech related channels like Gyan Therapy and such I only watch Qurious Mango and Nitish Rajput."
}