{
    "id": "1g5kipa",
    "title": "Delhi High Court to begin hearing Petitioners’ arguments in the IT Rules, 2021 constitutional challenges\n",
    "url": "https://www.reddit.com/r/india/comments/1g5kipa/delhi_high_court_to_begin_hearing_petitioners/",
    "selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/6ozsg7f9f9vd1.png?width=1600&format=png&auto=webp&s=eb9941fa8d4ddbf9e828a4f1f044742838d99314)\n\nThe Delhi High Court began hearing petitions challenging the IT Rules, 2021. The Court has ordered issue-wise categorisation of cases into two parts - Part II and Part III of the IT Rules, 2021. The Petitioners will commence arguments on November 11, 2024. \n\n**tl;dr**\n\nDelhi High Court has begun hearing the consolidated petitions challenging the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“**IT Rules, 2021**”), which were transferred from the Supreme Court following the Transfer Petitions filed by the Union of India. On August 14, 2024, the Delhi High Court directed that the cases be segregated issue-wise and appointed Advocates Mr. Shashank Mishra and Mr. Kirtiman Singh as nodal counsels for the petitioners and respondents, respectively. Parties were also directed to conclude pleadings within 4 weeks and file written submissions. In the October 14, 2024 hearing, the Bench decided with the consensus of the counsels in all the petitions, that the IT Rules, 2021 hearing will be divided into 2 parts – firstly challenges to Part III of the IT Rules, 2021 will be argued, and subsequently challenges to Part II of the IT Rules, 2021. The IT Rules, 2021, which impact online privacy and freedom of expression by granting extensive government control over digital platforms, face constitutional challenges. IFF is assisting LiveLaw and Carnatic classical vocalist T.M. Krishna in these cases.\n\n**Important documents** \n\n1. Order dated October 14, 2024. \\[[Link](https://drive.google.com/file/d/1J3TPBWBHlFIXw4RxuvHfe-MSulneWM6y/view?usp=drive_link)\\]\n2. Order dated August 14, 2024. \\[[Link](https://drive.google.com/file/d/17F_NUVRtrs1s-5qv9UD4AG0yzLy82qGM/view?usp=drive_link)\\]\n3. Order dated March 22, 2024. \\[[Link](https://drive.google.com/file/d/1clhLi7yXXAtGX2Ye0v46ogImRyD5eip5/view?usp=drive_link)\\]\n4. Order dated May 9, 2022. \\[[Link](https://drive.google.com/file/d/1oTHjPSXe4pkRJ5Ce4OJujLR8R0aMMdCm/view?usp=drive_link)\\]\n5. IFF’s deep dive into how the IT Rules 2021. \\[[Link](https://internetfreedom.in/intermediaries-rules-2021/?ref=static.internetfreedom.in)\\]\n\n**Why should you care?**\n\nThe IT Rules, 2021, have far-reaching consequences for online privacy and freedom of speech and expression, as we have discussed before[ here](https://internetfreedom.in/intermediaries-rules-2021/?ref=static.internetfreedom.in). These rules give the government substantial control over social media platforms, digital news outlets, and video streaming services, making them vulnerable to unbridled censorship.\n\n\n\n**Background**\n\nOn February 25, 2021, the Ministry of Electronics and Information Technology and the Ministry of Information and Broadcasting introduced the IT Rules, 2021. These regulations expand governmental authority over social media intermediaries, including the content users share on these platforms. Additionally, the IT Rules, 2021, impose oversight on online content and digital news media, placing them under the purview of a committee comprising government officials.\n\nFollowing the government's notification of the IT Rules, 2021, at least[ 17 separate challenges](https://docs.google.com/document/d/1kmq-AlRO1XpPaThvesl5xQq2nVkZv6UdmaKFAJ8AMTk/edit?ref=static.internetfreedom.in) to their constitutionality were filed in various High Courts across India by individuals, associations, and organizations. Internet Freedom Foundation has provided legal aid in two such petitions. One petition, filed by LiveLaw before the Kerala High Court, resulted in the Union of India being prohibited from taking any coercive measures against LiveLaw under Part III of the IT Rules, 2021. The other petition, filed by Mr. T.M. Krishna before the Madras High Court, led to a stay on the implementation of Rules 9(1) and 9(3) of the IT Rules, 2021, along with the issuance of a clarification that any actions taken under Rules 3 and 7 of the IT Rules, 2021, would be subject to the final decision of the court.\n\n**IT Rules transferred from the Supreme Court of India**\n\nThe Union of India filed Transfer Petitions in the Supreme Court to consolidate all challenges to the IT Rules, 2021, pending in various High Courts. The petitions were grouped with other cases, including those challenging the constitutionality of Cable Television Networks (Amendment) Rules, 2021, seeking regulation of social and news media platforms.\n\nOn May 9, 2022, a Supreme Court Bench led by Justice A.M. Khanwilkar and Justice Abhay S. Oka indicated that while all related cases would be categorised, the IT Rules, 2021 challenges would be heard separately. The Bench issued notices for all petitions and stayed proceedings in the High Courts, except for interim protections against specific provisions of the IT Rules, 2021, which remained in effect. The next hearing, scheduled for May 19, 2022, was postponed.\n\nSubsequently, the matter was brought before a Bench headed by Justice Hrishikesh Roy on March 22, 2024, nearly two years after the issuance of the stay order on May 9, 2022. The Union of India, which had previously sought the transfer of the petitions to the Supreme Court, submitted a request for the matters to be adjudicated by the Delhi High Court. Consequently, the Supreme Court directed that all petitions be transferred to the Delhi High Court and that all relevant court records from High Courts across the country be submitted to the Delhi High Court within four weeks.\n\n**What has happened in the Delhi High Court so far?**\n\nThe batch of challenges to the IT Rules, 2021, has been listed before a Division Bench comprising Chief Justice Manmohan and Justice Tushar Rao Gedela of the Delhi High Court. During the first hearing on August 14, 2024, the Hon'ble Court directed the segregation of the cases by issue and appointed Mr. Shashank Mishra and Mr. Kirtiman Singh as nodal counsels for coordination. Parties were ordered to complete pleadings within four weeks and file written submissions. The Cable Television Rules matters were instructed to be listed as separate matters. \n\nOn October 14, 2024, the Bench encouraged the counsels to reach a consensus on segregating the challenges to the IT Rules, 2021. It was agreed that the proceedings will be divided into two - arguments against Part II (Due Diligence by Intermediaries and Grievance Redressal Mechanism) and arguments against Part III (Code Of Ethics and Procedure and Safeguards in Relation to Digital Media) of the IT Rules, 2021. The Petitioners will commence their arguments with  Part III, starting on November 11, 2024. Senior Advocate Darius Khambata will be commencing the arguments, followed by others. Part II of the Rules will be taken up subsequently. We are incredibly grateful to represent LiveLaw and Mr. T.M. Krishna through IFF’s legal team, composed of Advocates Vrinda Bhandari, Gautam Bhatia, Abhinav Sekhri, and Gayatri Malhotra, along with Advocates Anandita Rana, and Pragya Barsaiyan. \n\nWe will keep you updated on what happens next!\n\nHelp us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)\n\n",
    "flair": "Law & Courts",
    "score": 20,
    "num_comments": 0,
    "created_utc": 1729146319.0,
    "convurl": "https://b.thumbs.redditmedia.com/3gWJUH_OzE3AS6deIlS8rgqJ0uSvXVDEj1KdRbfN-pc.jpg",
    "comments": [],
    "cleaned_text": "delhi high court begin hearing petitioners arguments rules constitutional challenges iff needs support ever details end posthttpspreviewredditozsgffvdpngwidthformatpngautowebpsebfadddbfeaffd delhi high court began hearing petitions challenging rules court ordered issuewise categorisation cases two parts part ii part iii rules petitioners commence arguments november tldr delhi high court begun hearing consolidated petitions challenging information technology intermediary guidelines digital media ethics code rules rules transferred supreme court following transfer petitions filed union india august delhi high court directed cases segregated issuewise appointed advocates mr shashank mishra mr kirtiman singh nodal counsels petitioners respondents respectively parties also directed conclude pleadings within weeks file written submissions october hearing bench decided consensus counsels petitions rules hearing divided parts firstly challenges part iii rules argued subsequently challenges part ii rules rules impact online privacy freedom expression granting extensive government control digital platforms face constitutional challenges iff assisting livelaw carnatic classical vocalist tm krishna cases important documents order dated october linkhttpsdrivegooglecomfiledjtpbwbhlfixwrxuvhfemsulnewmyviewuspdrivelink order dated august linkhttpsdrivegooglecomfiledfnuvrtrssqvudagyzlyqgmviewuspdrivelink order dated march linkhttpsdrivegooglecomfiledclhliyxxatgxyevogimrydeipviewuspdrivelink order dated may linkhttpsdrivegooglecomfiledothjpsxepkrjceojujlrrammdcmviewuspdrivelink iffs deep dive rules linkhttpsinternetfreedominintermediariesrulesrefstaticinternetfreedomin care rules farreaching consequences online privacy freedom speech expression discussed herehttpsinternetfreedominintermediariesrulesrefstaticinternetfreedomin rules give government substantial control social media platforms digital news outlets video streaming services making vulnerable unbridled censorship background february ministry electronics information technology ministry information broadcasting introduced rules regulations expand governmental authority social media intermediaries including content users share platforms additionally rules impose oversight online content digital news media placing purview committee comprising government officials following governments notification rules least separate challengeshttpsdocsgooglecomdocumentdkmqalroxppathveslxqqnvkzvudmakfajamtkeditrefstaticinternetfreedomin constitutionality filed various high courts across india individuals associations organizations internet freedom foundation provided legal aid two petitions one petition filed livelaw kerala high court resulted union india prohibited taking coercive measures livelaw part iii rules petition filed mr tm krishna madras high court led stay implementation rules rules along issuance clarification actions taken rules rules would subject final decision court rules transferred supreme court india union india filed transfer petitions supreme court consolidate challenges rules pending various high courts petitions grouped cases including challenging constitutionality cable television networks amendment rules seeking regulation social news media platforms may supreme court bench led justice khanwilkar justice abhay oka indicated related cases would categorised rules challenges would heard separately bench issued notices petitions stayed proceedings high courts except interim protections specific provisions rules remained effect next hearing scheduled may postponed subsequently matter brought bench headed justice hrishikesh roy march nearly two years issuance stay order may union india previously sought transfer petitions supreme court submitted request matters adjudicated delhi high court consequently supreme court directed petitions transferred delhi high court relevant court records high courts across country submitted delhi high court within four weeks happened delhi high court far batch challenges rules listed division bench comprising chief justice manmohan justice tushar rao gedela delhi high court first hearing august honble court directed segregation cases issue appointed mr shashank mishra mr kirtiman singh nodal counsels coordination parties ordered complete pleadings within four weeks file written submissions cable television rules matters instructed listed separate matters october bench encouraged counsels reach consensus segregating challenges rules agreed proceedings divided two arguments part ii due diligence intermediaries grievance redressal mechanism arguments part iii code ethics procedure safeguards relation digital media rules petitioners commence arguments part iii starting november senior advocate darius khambata commencing arguments followed others part ii rules taken subsequently incredibly grateful represent livelaw mr tm krishna iffs legal team composed advocates vrinda bhandari gautam bhatia abhinav sekhri gayatri malhotra along advocates anandita rana pragya barsaiyan keep updated happens next help us watch watchmen become iff memberhttpsinternetfreedomindonate ",
    "cleaned_title": "delhi high court begin hearing petitioners arguments rules constitutional challenges",
    "cleaned_selftext": "iff needs support ever details end posthttpspreviewredditozsgffvdpngwidthformatpngautowebpsebfadddbfeaffd delhi high court began hearing petitions challenging rules court ordered issuewise categorisation cases two parts part ii part iii rules petitioners commence arguments november tldr delhi high court begun hearing consolidated petitions challenging information technology intermediary guidelines digital media ethics code rules rules transferred supreme court following transfer petitions filed union india august delhi high court directed cases segregated issuewise appointed advocates mr shashank mishra mr kirtiman singh nodal counsels petitioners respondents respectively parties also directed conclude pleadings within weeks file written submissions october hearing bench decided consensus counsels petitions rules hearing divided parts firstly challenges part iii rules argued subsequently challenges part ii rules rules impact online privacy freedom expression granting extensive government control digital platforms face constitutional challenges iff assisting livelaw carnatic classical vocalist tm krishna cases important documents order dated october linkhttpsdrivegooglecomfiledjtpbwbhlfixwrxuvhfemsulnewmyviewuspdrivelink order dated august linkhttpsdrivegooglecomfiledfnuvrtrssqvudagyzlyqgmviewuspdrivelink order dated march linkhttpsdrivegooglecomfiledclhliyxxatgxyevogimrydeipviewuspdrivelink order dated may linkhttpsdrivegooglecomfiledothjpsxepkrjceojujlrrammdcmviewuspdrivelink iffs deep dive rules linkhttpsinternetfreedominintermediariesrulesrefstaticinternetfreedomin care rules farreaching consequences online privacy freedom speech expression discussed herehttpsinternetfreedominintermediariesrulesrefstaticinternetfreedomin rules give government substantial control social media platforms digital news outlets video streaming services making vulnerable unbridled censorship background february ministry electronics information technology ministry information broadcasting introduced rules regulations expand governmental authority social media intermediaries including content users share platforms additionally rules impose oversight online content digital news media placing purview committee comprising government officials following governments notification rules least separate challengeshttpsdocsgooglecomdocumentdkmqalroxppathveslxqqnvkzvudmakfajamtkeditrefstaticinternetfreedomin constitutionality filed various high courts across india individuals associations organizations internet freedom foundation provided legal aid two petitions one petition filed livelaw kerala high court resulted union india prohibited taking coercive measures livelaw part iii rules petition filed mr tm krishna madras high court led stay implementation rules rules along issuance clarification actions taken rules rules would subject final decision court rules transferred supreme court india union india filed transfer petitions supreme court consolidate challenges rules pending various high courts petitions grouped cases including challenging constitutionality cable television networks amendment rules seeking regulation social news media platforms may supreme court bench led justice khanwilkar justice abhay oka indicated related cases would categorised rules challenges would heard separately bench issued notices petitions stayed proceedings high courts except interim protections specific provisions rules remained effect next hearing scheduled may postponed subsequently matter brought bench headed justice hrishikesh roy march nearly two years issuance stay order may union india previously sought transfer petitions supreme court submitted request matters adjudicated delhi high court consequently supreme court directed petitions transferred delhi high court relevant court records high courts across country submitted delhi high court within four weeks happened delhi high court far batch challenges rules listed division bench comprising chief justice manmohan justice tushar rao gedela delhi high court first hearing august honble court directed segregation cases issue appointed mr shashank mishra mr kirtiman singh nodal counsels coordination parties ordered complete pleadings within four weeks file written submissions cable television rules matters instructed listed separate matters october bench encouraged counsels reach consensus segregating challenges rules agreed proceedings divided two arguments part ii due diligence intermediaries grievance redressal mechanism arguments part iii code ethics procedure safeguards relation digital media rules petitioners commence arguments part iii starting november senior advocate darius khambata commencing arguments followed others part ii rules taken subsequently incredibly grateful represent livelaw mr tm krishna iffs legal team composed advocates vrinda bhandari gautam bhatia abhinav sekhri gayatri malhotra along advocates anandita rana pragya barsaiyan keep updated happens next help us watch watchmen become iff memberhttpsinternetfreedomindonate",
    "cleaned_comments": "",
    "light_cleaned_title": "Delhi High Court to begin hearing Petitioners’ arguments in the IT Rules, 2021 constitutional challenges",
    "light_cleaned_selftext": "[IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/6ozsg7f9f9vd1.png?width=1600&format=png&auto=webp&s=eb9941fa8d4ddbf9e828a4f1f044742838d99314) The Delhi High Court began hearing petitions challenging the IT Rules, 2021. The Court has ordered issue-wise categorisation of cases into two parts - Part II and Part III of the IT Rules, 2021. The Petitioners will commence arguments on November 11, 2024. **tl;dr** Delhi High Court has begun hearing the consolidated petitions challenging the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (“**IT Rules, 2021**”), which were transferred from the Supreme Court following the Transfer Petitions filed by the Union of India. On August 14, 2024, the Delhi High Court directed that the cases be segregated issue-wise and appointed Advocates Mr. Shashank Mishra and Mr. Kirtiman Singh as nodal counsels for the petitioners and respondents, respectively. Parties were also directed to conclude pleadings within 4 weeks and file written submissions. In the October 14, 2024 hearing, the Bench decided with the consensus of the counsels in all the petitions, that the IT Rules, 2021 hearing will be divided into 2 parts – firstly challenges to Part III of the IT Rules, 2021 will be argued, and subsequently challenges to Part II of the IT Rules, 2021. The IT Rules, 2021, which impact online privacy and freedom of expression by granting extensive government control over digital platforms, face constitutional challenges. IFF is assisting LiveLaw and Carnatic classical vocalist T.M. Krishna in these cases. **Important documents** 1. Order dated October 14, 2024. \\[[Link](https://drive.google.com/file/d/1J3TPBWBHlFIXw4RxuvHfe-MSulneWM6y/view?usp=drive_link)\\] 2. Order dated August 14, 2024. \\[[Link](https://drive.google.com/file/d/17F_NUVRtrs1s-5qv9UD4AG0yzLy82qGM/view?usp=drive_link)\\] 3. Order dated March 22, 2024. \\[[Link](https://drive.google.com/file/d/1clhLi7yXXAtGX2Ye0v46ogImRyD5eip5/view?usp=drive_link)\\] 4. Order dated May 9, 2022. \\[[Link](https://drive.google.com/file/d/1oTHjPSXe4pkRJ5Ce4OJujLR8R0aMMdCm/view?usp=drive_link)\\] 5. IFF’s deep dive into how the IT Rules 2021. \\[[Link](https://internetfreedom.in/intermediaries-rules-2021/?ref=static.internetfreedom.in)\\] **Why should you care?** The IT Rules, 2021, have far-reaching consequences for online privacy and freedom of speech and expression, as we have discussed before[ here](https://internetfreedom.in/intermediaries-rules-2021/?ref=static.internetfreedom.in). These rules give the government substantial control over social media platforms, digital news outlets, and video streaming services, making them vulnerable to unbridled censorship. **Background** On February 25, 2021, the Ministry of Electronics and Information Technology and the Ministry of Information and Broadcasting introduced the IT Rules, 2021. These regulations expand governmental authority over social media intermediaries, including the content users share on these platforms. Additionally, the IT Rules, 2021, impose oversight on online content and digital news media, placing them under the purview of a committee comprising government officials. Following the government's notification of the IT Rules, 2021, at least[ 17 separate challenges](https://docs.google.com/document/d/1kmq-AlRO1XpPaThvesl5xQq2nVkZv6UdmaKFAJ8AMTk/edit?ref=static.internetfreedom.in) to their constitutionality were filed in various High Courts across India by individuals, associations, and organizations. Internet Freedom Foundation has provided legal aid in two such petitions. One petition, filed by LiveLaw before the Kerala High Court, resulted in the Union of India being prohibited from taking any coercive measures against LiveLaw under Part III of the IT Rules, 2021. The other petition, filed by Mr. T.M. Krishna before the Madras High Court, led to a stay on the implementation of Rules 9(1) and 9(3) of the IT Rules, 2021, along with the issuance of a clarification that any actions taken under Rules 3 and 7 of the IT Rules, 2021, would be subject to the final decision of the court. **IT Rules transferred from the Supreme Court of India** The Union of India filed Transfer Petitions in the Supreme Court to consolidate all challenges to the IT Rules, 2021, pending in various High Courts. The petitions were grouped with other cases, including those challenging the constitutionality of Cable Television Networks (Amendment) Rules, 2021, seeking regulation of social and news media platforms. On May 9, 2022, a Supreme Court Bench led by Justice A.M. Khanwilkar and Justice Abhay S. Oka indicated that while all related cases would be categorised, the IT Rules, 2021 challenges would be heard separately. The Bench issued notices for all petitions and stayed proceedings in the High Courts, except for interim protections against specific provisions of the IT Rules, 2021, which remained in effect. The next hearing, scheduled for May 19, 2022, was postponed. Subsequently, the matter was brought before a Bench headed by Justice Hrishikesh Roy on March 22, 2024, nearly two years after the issuance of the stay order on May 9, 2022. The Union of India, which had previously sought the transfer of the petitions to the Supreme Court, submitted a request for the matters to be adjudicated by the Delhi High Court. Consequently, the Supreme Court directed that all petitions be transferred to the Delhi High Court and that all relevant court records from High Courts across the country be submitted to the Delhi High Court within four weeks. **What has happened in the Delhi High Court so far?** The batch of challenges to the IT Rules, 2021, has been listed before a Division Bench comprising Chief Justice Manmohan and Justice Tushar Rao Gedela of the Delhi High Court. During the first hearing on August 14, 2024, the Hon'ble Court directed the segregation of the cases by issue and appointed Mr. Shashank Mishra and Mr. Kirtiman Singh as nodal counsels for coordination. Parties were ordered to complete pleadings within four weeks and file written submissions. The Cable Television Rules matters were instructed to be listed as separate matters. On October 14, 2024, the Bench encouraged the counsels to reach a consensus on segregating the challenges to the IT Rules, 2021. It was agreed that the proceedings will be divided into two - arguments against Part II (Due Diligence by Intermediaries and Grievance Redressal Mechanism) and arguments against Part III (Code Of Ethics and Procedure and Safeguards in Relation to Digital Media) of the IT Rules, 2021. The Petitioners will commence their arguments with Part III, starting on November 11, 2024. Senior Advocate Darius Khambata will be commencing the arguments, followed by others. Part II of the Rules will be taken up subsequently. We are incredibly grateful to represent LiveLaw and Mr. T.M. Krishna through IFF’s legal team, composed of Advocates Vrinda Bhandari, Gautam Bhatia, Abhinav Sekhri, and Gayatri Malhotra, along with Advocates Anandita Rana, and Pragya Barsaiyan. We will keep you updated on what happens next! Help us watch the watchmen. Become an [IFF member](https://internetfreedom.in/donate/)",
    "light_cleaned_comments": ""
}