{
    "id": "1608n9h",
    "title": "Donation for Kaju",
    "url": "https://www.reddit.com/gallery/1608n9h",
    "selftext": "Hello everyone this is Kaju, a 2 month old stray kitten that i recentky took in. Kaju's 2 siblings passed away by a bike accident and dog attack very recently. I have been feeding them for some time and it broke my heart and I could no more let Kaju fight for it's life on the streets. I took Kaju in yesterday and kept it in this cage as Kaju is unfortunately running away and a bit unfriendly. I want to adopt Kaju and take care of this baby.\n\nNow I am a college student and from my previous posts you can see I inquired about free vaccination for cats. Unfortunately Kaju is too small and restless to travel to be taken to a government hospital which is why I have to take Kaju to a private vet here which is considerably expensive for me. As I am still not earning I would like to ask for help for Kaju's veterinary expenses(vet visit, vaccination, deworming) through your donations. I will be providing my UPI where you can donate any small amount. Even if you cannot donate please wish well for Kaju\n\nUPI: rinas80173789@barodampay\n\nMerchant name: Rina Saha\n\nWhile donating for Kaju please mention in note \"For Kaju\". I will be grateful if you could donate even a small amount. It would help me out with Kaju's veterinary expenses a lot. Thank you in advance ☺️",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692898653.0,
    "convurl": "https://i.redd.it/znk1lcpug3kb1.jpg",
    "comments": [
        "The pictures were taken from my phone camera samsung m32 from my house in kolkata and dimensions are 720x1280 and 1080x1920",
        "Wishing a good life for Kaju! If you're on a tight budget, you can still provide a balanced diet for your cat. Look for affordable yet decent-quality cat food that lists meat as a primary ingredient. You might also consider making homemade cat food using recipes that include lean meats like chicken or turkey. Just make sure to avoid feeding them human foods that can be harmful. Your cat's health is important, so consult with your veterinarian for guidance on providing the best possible diet within your budget constraints. Additionally, reaching out to your friends for help can also be a great idea.",
        "Depending on the city you can contact local animal welfare organization. They'll help kaju rehab & train you on basics of pet parenting & even might help in vaccination & medication",
        "Hello first of all thank you for the advice 🫶🏼I am feeding Kaju boiled fish or chicken with rice for now. I will get in touch with a vet soon as soon as I can arrange the finances and will make sure to provide Kaju with a better diet😊",
        "Unfortunately I haven't been able to contact a decent one in kolkata which is why I took it on myself to take care of Kaju",
        "I know it's quite challenging to raise a cat in an environment dominated by dogs, which might explain the scarcity of cats in India. People attempting to care for them often overlook the fact that cats are carnivorous animals, unable to process dairy products and human food. As a result, many cats suffer from either malnutrition or dog attacks, leading to their unfortunate demise. I appreciate your efforts, and I wish I could contribute, but I'm not currently using UPI.",
        "Hey its alright. I appreciate the well wishes and advice. I would love to hear any advice on how to take care of Kaju better as it's my first time taking in a 🐈",
        "Here [animal welfare locations ](https://lbb.in/kolkata/volunteer-at-animal-welfare-ngo-in-kolkata/)\nPfa is well known & pan india but many local orgs are also good as sometimes some places have to give priority to serious & life threatening cases so they might turn you down for the moment but you can always try the next door. :)",
        "Hey buddy.  \n1. Find a vet and ask them if you can bring in a stray for checkup and you don't have money.\n\nMost vets are nice and will say that's okay",
        "2. how much are you in general looking for?",
        "I am not sure if they will so for now I am arranging finances in case I do need the money",
        "I am not entirely sure about the expenses but consultation charges of the vet is 500 Rs and considering the vaccination, deworming and meds I am considering 3-4k might be needed",
        "I will contact them but looks like most are for dogs or critical conditions. I will still try to get in touch. Thank you so much💓"
    ],
    "cleaned_text": "donation kaju hello everyone kaju month old stray kitten recentky took kajus siblings passed away bike accident dog attack recently feeding time broke heart could let kaju fight life streets took kaju yesterday kept cage kaju unfortunately running away bit unfriendly want adopt kaju take care baby college student previous posts see inquired free vaccination cats unfortunately kaju small restless travel taken government hospital take kaju private vet considerably expensive still earning would like ask help kajus veterinary expensesvet visit vaccination deworming donations providing upi donate small amount even donate please wish well kaju upi rinasbarodampay merchant name rina saha donating kaju please mention note kaju grateful could donate even small amount would help kajus veterinary expenses lot thank advance ",
    "cleaned_title": "donation kaju",
    "cleaned_selftext": "hello everyone kaju month old stray kitten recentky took kajus siblings passed away bike accident dog attack recently feeding time broke heart could let kaju fight life streets took kaju yesterday kept cage kaju unfortunately running away bit unfriendly want adopt kaju take care baby college student previous posts see inquired free vaccination cats unfortunately kaju small restless travel taken government hospital take kaju private vet considerably expensive still earning would like ask help kajus veterinary expensesvet visit vaccination deworming donations providing upi donate small amount even donate please wish well kaju upi rinasbarodampay merchant name rina saha donating kaju please mention note kaju grateful could donate even small amount would help kajus veterinary expenses lot thank advance",
    "cleaned_comments": "pictures taken phone camera samsung house kolkata dimensions x x wishing good life kaju youre tight budget still provide balanced diet cat look affordable yet decentquality cat food lists meat primary ingredient might also consider making homemade cat food using recipes include lean meats like chicken turkey make sure avoid feeding human foods harmful cats health important consult veterinarian guidance providing best possible diet within budget constraints additionally reaching friends help also great idea depending city contact local animal welfare organization theyll help kaju rehab train basics pet parenting even might help vaccination medication hello first thank advice feeding kaju boiled fish chicken rice get touch vet soon soon arrange finances make sure provide kaju better diet unfortunately havent able contact decent one kolkata took take care kaju know quite challenging raise cat environment dominated dogs might explain scarcity cats india people attempting care often overlook fact cats carnivorous animals unable process dairy products human food result many cats suffer either malnutrition dog attacks leading unfortunate demise appreciate efforts wish could contribute im currently using upi hey alright appreciate well wishes advice would love hear advice take care kaju better first time taking animal welfare locations httpslbbinkolkatavolunteeratanimalwelfarengoinkolkata pfa well known pan india many local orgs also good sometimes places give priority serious life threatening cases might turn moment always try next door hey buddy find vet ask bring stray checkup dont money vets nice say thats okay much general looking sure arranging finances case need money entirely sure expenses consultation charges vet rs considering vaccination deworming meds considering k might needed contact looks like dogs critical conditions still try get touch thank much",
    "light_cleaned_title": "Donation for Kaju",
    "light_cleaned_selftext": "Hello everyone this is Kaju, a 2 month old stray kitten that i recentky took in. Kaju's 2 siblings passed away by a bike accident and dog attack very recently. I have been feeding them for some time and it broke my heart and I could no more let Kaju fight for it's life on the streets. I took Kaju in yesterday and kept it in this cage as Kaju is unfortunately running away and a bit unfriendly. I want to adopt Kaju and take care of this baby. Now I am a college student and from my previous posts you can see I inquired about free vaccination for cats. Unfortunately Kaju is too small and restless to travel to be taken to a government hospital which is why I have to take Kaju to a private vet here which is considerably expensive for me. As I am still not earning I would like to ask for help for Kaju's veterinary expenses(vet visit, vaccination, deworming) through your donations. I will be providing my UPI where you can donate any small amount. Even if you cannot donate please wish well for Kaju UPI: rinas80173789@barodampay Merchant name: Rina Saha While donating for Kaju please mention in note \"For Kaju\". I will be grateful if you could donate even a small amount. It would help me out with Kaju's veterinary expenses a lot. Thank you in advance ☺️",
    "light_cleaned_comments": "The pictures were taken from my phone camera samsung m32 from my house in kolkata and dimensions are 720x1280 and 1080x1920 Wishing a good life for Kaju! If you're on a tight budget, you can still provide a balanced diet for your cat. Look for affordable yet decent-quality cat food that lists meat as a primary ingredient. You might also consider making homemade cat food using recipes that include lean meats like chicken or turkey. Just make sure to avoid feeding them human foods that can be harmful. Your cat's health is important, so consult with your veterinarian for guidance on providing the best possible diet within your budget constraints. Additionally, reaching out to your friends for help can also be a great idea. Depending on the city you can contact local animal welfare organization. They'll help kaju rehab & train you on basics of pet parenting & even might help in vaccination & medication Hello first of all thank you for the advice 🫶🏼I am feeding Kaju boiled fish or chicken with rice for now. I will get in touch with a vet soon as soon as I can arrange the finances and will make sure to provide Kaju with a better diet😊 Unfortunately I haven't been able to contact a decent one in kolkata which is why I took it on myself to take care of Kaju I know it's quite challenging to raise a cat in an environment dominated by dogs, which might explain the scarcity of cats in India. People attempting to care for them often overlook the fact that cats are carnivorous animals, unable to process dairy products and human food. As a result, many cats suffer from either malnutrition or dog attacks, leading to their unfortunate demise. I appreciate your efforts, and I wish I could contribute, but I'm not currently using UPI. Hey its alright. I appreciate the well wishes and advice. I would love to hear any advice on how to take care of Kaju better as it's my first time taking in a 🐈 Here [animal welfare locations ](https://lbb.in/kolkata/volunteer-at-animal-welfare-ngo-in-kolkata/) Pfa is well known & pan india but many local orgs are also good as sometimes some places have to give priority to serious & life threatening cases so they might turn you down for the moment but you can always try the next door. :) Hey buddy. 1. Find a vet and ask them if you can bring in a stray for checkup and you don't have money. Most vets are nice and will say that's okay 2. how much are you in general looking for? I am not sure if they will so for now I am arranging finances in case I do need the money I am not entirely sure about the expenses but consultation charges of the vet is 500 Rs and considering the vaccination, deworming and meds I am considering 3-4k might be needed I will contact them but looks like most are for dogs or critical conditions. I will still try to get in touch. Thank you so much💓"
}