{
    "id": "ll9kja",
    "title": "Farm Laws- My evolving opinion",
    "url": "https://www.reddit.com/r/india/comments/ll9kja/farm_laws_my_evolving_opinion/",
    "selftext": "For the last 3 months, my opinion on the farm laws has been constantly evolving. I have been trying to look at all the perspectives and make sense of what could be the best option for the farmers. One thing that is for certain is that agriculture cannot survive without Govt intervention. The major decision area is the kind of intervention we chose.\n\nFirst, let's start by looking at the most extreme scenario i.e no role of Govt with the example of Bihar. Contrary to what pro-neo lib journalists like Gupta Ji claim, Bihar hasn't really benefitted from repealing APMC and allowing private traders without any kind of protection. An argument can be made that the situation has even worsened over the last 14 years\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fjbq6hfuqvh61.jpg?width=981&amp;format=pjpg&amp;auto=webp&amp;s=55b2dba8f1374d2dc1346b4e4832f69713f7833a\n\n&gt;During the period of the first agriculture road map, the growth rate accelerated to 3.1 per cent,which was almost equal to the national average agricultural growth. However, this higher growthin agriculture did not sustain in the long run. In fact, the average annual growth rate declined to1.28 per cent during the period of the second agriculture road map. During the overall period 2001-02 to 2016-17, average growth was only 2.0 per cent, which was much below the national averageagricultural growth of 3.1 per cent.\n\nAlso, look at the net income over the same period\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3haaivnvqvh61.jpg?width=988&amp;format=pjpg&amp;auto=webp&amp;s=6e7bcd5b18c81c13d419232fec1f71e445a2784e\n\n&amp;#x200B;\n\n[Source](https://www.ncaer.org/publication_details.php?pID=311#:~:text=To%20answer%20these%20and%20related,what%20it%20should%20do%20to)\n\nFrom the same report\n\n&gt;Growth diagnostics through Minot-Hausmann Hybrid framework has revealed that poorfunctioning of agricultural markets indicated by instability in the prices of agriculturalproduces and low level of crop diversification are the reasons for slow or lower agriculturalgrowth in Bihar. The abolition of APMC Act in 2006 did not usher in private investment forcreating new markets or strengthening facilities in the existing ones leading to low market density.The participation of government agencies in procurement and scale of procurement of grainscontinues to be low. Thus, farmers are left to the mercy of traders who unscrupulously fix lowerprice for agricultural produce that they buy from farmers. Inadequate market facilities andinstitutional arrangements are responsible for low price realisation and instability in prices. Twofactors constraining the crop diversification are weak market linkages and poor institutionalarrangements such as producer collectives at the village level.\n\nAlso, go through the recommendations mentioned in the report. They can be useful for other regions as well.\n\nIt is time to look at the critical issues in agriculture and what can be their possible solution\n\n**1) Volatility in prices of agricultural produce**\n\nThis is the core issue and one of the major reasons for farmer suicides, dumping of produce, etc. Now let's look at various mitigation techniques that can be adopted\n\n**a) Price floors:** This is what the farmers are demanding and what the [Swaminathan Commission](https://www.prsindia.org/report-summaries/swaminathan-report-national-commission-farmers) recommended. It has also been adopted by various Govts around the world, notably the EU through its [CAP](https://ec.europa.eu/info/food-farming-fisheries/key-policies/common-agricultural-policy_en), Canada through its [Supply Management](https://lop.parl.ca/sites/PublicWebsite/default/en_CA/ResearchPublications/201842E), India through [FRP](https://economictimes.indiatimes.com/news/economy/agriculture/cabinet-okays-increase-in-sugarcane-frp-by-rs-10-to-rs-285/qtl-for-2020-21/articleshow/77636635.cms) for Sugarcane, and many more.\n\nAlthough it has its fair share of advantages, one of the major problems with this is the rising surpluses. This can be mitigated by Govt buying the extra produce and adding it to the PDS but that wouldn't work for other crops.\n\nEven EU has let go this policy and adopted a DBT scheme in the form of [Single Farm Payments](https://en.wikipedia.org/wiki/Single_Farm_Payment)\n\n**b) Price deficiency support:** MP Govt experimented with it but the downside is that it basically encourages buyers to pay as low as possible as the Govt will be there to bear the difference\n\n**c) Contract Farming:** This is a step in the right direction but its overall impact is widely overestimated. Corporations will prefer large farmers simply due to economics of scale and a single point of contact over many. FPO's can be encouraged to pass on this benefit to small farmers.\n\n**d) Direct Income support:** This is what every country in the world has currently adopted but the GOI lacks funds to adopt it on a wider scale which will help increase farmers' incomes.\n\nFor now, I am only going to touch upon this first issue, will make an edit in the morning and discuss other critical problems then\n\nLet's look at other critical issues\n\n**2) Average landholding:** India currently has an average landholding of [1.1 Hectares](https://www.thehindubusinessline.com/economy/agri-business/average-farm-landholding-size-shrinks-to-11-ha/article24719240.ece), 86% of the farmers are small and marginal ( &lt;2 hectares). This is mainly due to the employment of a large workforce in agriculture, our large population, and the fragmentation of land with passing generations.\n\nThe solution to this has to come from job creation in other sectors and it has been happening organically according to an [NSSO Survey](https://www.financialexpress.com/economy/surplus-rural-workforce-shifting-from-agriculture-to-services-plfs-jobs-report-reveals-positive-switch/1600637/). The US took almost a century to bring down the share of the agriculture workforce from [41% to 1.7%](https://www.ers.usda.gov/webdocs/publications/44197/13566_eib3_1_.pdf) on the back of rapid industrialization and technological advancements\n\n**3)Land use restrictions:** Farmers in many states can only sell their land to agriculturists which deflates the value of their land. This restricts them from moving out of agriculture and also getting loans by keeping land as collateral.\n\nSome states like [Tamil Nadu and Kerala](https://www.thehindu.com/features/homes-and-gardens/Land-laws-across-India/article14414630.ece) have already amended these and allowed industrialists to use them for non-agricultural purposes.\n\nAn anecdote here, my family owns around 16 acres of land near Moga in Punjab with a value of 30 Lakh per acre while the same land without those restrictions would fetch anywhere close to 1-2 crore in Moga.\n\n**4) Ease of Credit:** Farmers usually have to rely on the middlemen for getting loans, they charge around 20-25% interest rate. Banks usually arent of help as the land titles are not always clear hence leading to rejection of collateral. PM-Kisan and Kisan credit card are a good measure for providing credit for input costs, Pvt players like Mahindra finance have also made it easier to get loans for agricultural equipment.",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 13,
    "created_utc": 1613498480,
    "convurl": "https://a.thumbs.redditmedia.com/k0tYumEPu1pecvncyqpTFToy5xo-SsWtA4Y7HFi8H70.jpg",
    "comments": [
        "&gt; This is what every country in the world has currently adopted but the GOI lacks funds to adopt it on a wider scale which will help increase farmers' incomes.\n\nThere is one. But, it is only 6k per year.\n\n&gt; Contract Farming: This is a step in the right direction but its overall impact is widely overestimated. Corporations will prefer large farmers simply due to economics of scale and a single point of contact over many. FPO's can be encouraged to pass on this benefit to small farmers.\n\nCooperatives can be a solution, but when they were implemented just after independence, they failed because how they were exploited by big farmers.\n\n&gt; Bihar hasn't really benefitted from repealing APMC and allowing private traders without any kind of protection. An argument can be made that the situation has even worsened over the last 14 years\n\nBihar Govt thought opening the market to private traders would mean they would invest in the market and then the state won't. Bihar lacks infrastructure that brings in investors and then it is only one of biggest beneficiary of PDS. So, market prices will be lower there. Bihar should have invested in more roads to villages and trains for farmers, reducing transport costs. \n\n&gt; Farmers in many states can only sell their land to agriculturists which deflates the value of their land. This restricts them from moving out of agriculture and also getting loans by keeping land as collateral.\n\nThe second part isn't something you can do in India, due to how farming economics work. Because, farmers aren't getting loans from banks, so generally they pay a very high rate of interest.  Also, it is going to lead to a bigger protest than the current one, if farm land can be bought by industrialist directly. It already happens with cities and towns, but farmers have been made to fear that their land will be snatched so that isn't happening. Even, I don't prefer land as collateral as it leads to accumulation.\n\n&gt; Although it has its fair share of advantages, one of the major problems with this is the rising surpluses. This can be mitigated by Govt buying the extra produce and adding it to the PDS but that wouldn't work for other crops.\n\nOne could say MSP is one. But, there is a massive issue with how much it is being relied upon and is becoming a single point of failure with FCI (govt not giving subsidies). Price floors are good, but we really need to reduce burden on it.",
        "&gt; There is one. But, it is only 6k per year. \n\nI mention PM-Kisaan in the post \n\n&gt; Because, farmers aren't getting loans from banks, so generally they pay a very high rate of interest. \n\nI mention this as well \n\n&gt; Also, it is going to lead to a bigger protest than the current one, if farm land can be bought by industrialist directly.  \n\nAs I mentioned, it's already allowed in many states with a cap to prevent accumulation.\n\n&gt; One could say MSP is one. But, there is a massive issue with how much it is being relied upon and is becoming a single point of failure with FCI (govt not giving subsidies). Price floors are good, but we really need to reduce burden on it. \n\nOf course, MSP is one but the problem here is that it is only guaranteed on two crops, and that too for not all farmers. If it was legalized for other 21 crops, farmers would have incentives to diversify",
        "&gt; I mention PM-Kisaan in the post\n\n&gt; I mention this as well\n\nThey were in Ease of Credit I didn't read it. I believe PM-Kisaan should have been included in Direct Income support\n\n&gt; Of course, MSP is one but the problem here is that it is only guaranteed on two crops, and that too for not all farmers. If it was legalized for other 21 crops, farmers would have incentives to diversify\n\nMSP is guaranteed on 23 crops. Issue isn't the guarantee but procurement by the state govt. MSP is only guaranteed in APMC markets and then state govt need to do encouraged to do more procurement. The reason why states don't procure enough is because FCI mostly just deals with wheat and rice. Unless, FCI or someone Govt body stores it,  states won't procure enough and farmers would mainly sell in the market.",
        "&gt; I believe PM-Kisaan should have been included in Direct Income support \n\nagree\n\n&gt; MSP is guaranteed on 23 crops. Issue isn't the guarantee but procurement by the state govt. MSP is only guaranteed in APMC markets and then state govt need to do encouraged to do more procurement. The reason why states don't procure enough is because FCI mostly just deals with wheat and rice. Unless, FCI or someone Govt body stores it, states won't procure enough and farmers would mainly sell in the market. \n\nMSP isn't guaranteed on 23 crops, it just acts as a price indicator it isn't enforced. Farmers are asking for it to be legalized so that Pvt buyers are also forced to buy at it once the markets open up. This is what the EU did with CAP",
        "&gt; MSP isn't guaranteed on 23 crops, it just acts as a price indicator it isn't enforced.\n\nIt isn't guaranteed on Rice or Wheat as well. MSP is guaranteed only on govt procurement, but if state aren't procuring it, it won't be guaranteed. Why aren't states procuring it enough? Because they don't have a buyer which is Centre/FCI for wheat and rice.\n\n&gt; https://www.hindustantimes.com/india-news/paddy-purchase-up-other-crops-sell-below-msp/story-N8TGqQ0DmXiyAWZhPDj7vN.html\n\n&gt;  Farmers are asking for it to be legalized so that Pvt buyers are also forced to buy at it once the markets open up\n\nWhich is very unlikely to happen, given that MSP prices are generally higher than what a buyer can sell at, even abroad.",
        "&gt; Which is very unlikely to happen, given that MSP prices are generally higher than what a buyer can sell at, even abroad. \n\nThat's the whole point of this agitation, farmers realize they are not going to get fair prices for their produce once the markets open up ( most farmers already don't, many are forced to sell at losses or dump their produce) . MSP is just a 50% margin over the total input cost. If even that isn't realized what's the point of even sowing those crops. \n\nLet's take a scenario. MSP for maize is rs 18/kg, the market price last year was 8 rs/kg( way lower than input cost). Maize flour after addition of value is sold at Rs 80/kg. Keeping all things constant let's assume MSP is guaranteed and the farmer gets Rs 18. That is more than a 100% increase in his income while the price of FG increases to Rs 90/kg an increase of around 12.5% to the end consumer. Of course, this is a really simplistic take of the whole scenario but imagine the growth we can achieve if we can double the farmer's income as it employs close to 41% of our workforce.",
        "Why should consumers get hosed on that deal. If farmer margin is fixed, then trader margin to sell to end consumer should be fixed. Also government should never restrict import. If cheaper goods are available internationally, why should consumers pay for higher prices. Suddenly nobody cares about the poor laborer and their well being. Screw them right \n\nAlso you can't increase how much and what is procured by government. It's just wasteful. We will end up farmers producing wheat and rice, government procuring it and most of it rotting in godowns.",
        "Poor labourers have acess to PDS. \n\nGovt restricts imports because in the long run syrenghthig local industries and in this case farmers is better. If govt removes import restrictions on Automobiles , most of the companies except for 1 or 2 will be royally fucked. \n\nAnd if you are still bringing up surplus of wheat and rice after going through the whole thread ( which I am sure you didn't) then you need to improve your comprehension skills. Where tf did I ask for increase in procurement by Govt?",
        "The reason I am making all these conditions is because you can't bow down to one stakeholder in an issue and end up essentially screwing up all others. I don't believe farmers will agree to any restrictions in terms of crop rotation, stubble burning et all. They want their pound of flesh. Legalizing MSP will be disastrous. \n\nYou stated that the government should procure surplus production. If sales is guaranteed with price fixed regardless of market condition, then it leads to perverse incentive.\nWould you be in favor of single price of Product regardless of market condition. Farmers are not allowed to sell at higher price during low yield seasons. Else it would be like the petrol prices right now. Consumers getting hosed both ways."
    ],
    "cleaned_text": "farm laws evolving opinion last months opinion farm laws constantly evolving trying look perspectives make sense could best option farmers one thing certain agriculture survive without govt intervention major decision area kind intervention chose first lets start looking extreme scenario ie role govt example bihar contrary proneo lib journalists like gupta ji claim bihar hasnt really benefitted repealing apmc allowing private traders without kind protection argument made situation even worsened last years ampxb gtduring period first agriculture road map growth rate accelerated per centwhich almost equal national average agricultural growth however higher growthin agriculture sustain long run fact average annual growth rate declined per cent period second agriculture road map overall period average growth per cent much national averageagricultural growth per cent also look net income period ampxb ampxb sourcehttpswwwncaerorgpublicationdetailsphppidtexttoanswertheseandrelatedwhatitshoulddoto report gtgrowth diagnostics minothausmann hybrid framework revealed poorfunctioning agricultural markets indicated instability prices agriculturalproduces low level crop diversification reasons slow lower agriculturalgrowth bihar abolition apmc act usher private investment forcreating new markets strengthening facilities existing ones leading low market densitythe participation government agencies procurement scale procurement grainscontinues low thus farmers left mercy traders unscrupulously fix lowerprice agricultural produce buy farmers inadequate market facilities andinstitutional arrangements responsible low price realisation instability prices twofactors constraining crop diversification weak market linkages poor institutionalarrangements producer collectives village level also go recommendations mentioned report useful regions well time look critical issues agriculture possible solution volatility prices agricultural produce core issue one major reasons farmer suicides dumping produce etc lets look various mitigation techniques adopted price floors farmers demanding swaminathan commissionhttpswwwprsindiaorgreportsummariesswaminathanreportnationalcommissionfarmers recommended also adopted various govts around world notably eu caphttpseceuropaeuinfofoodfarmingfisherieskeypoliciescommonagriculturalpolicyen canada supply managementhttpslopparlcasitespublicwebsitedefaultencaresearchpublicationse india frphttpseconomictimesindiatimescomnewseconomyagriculturecabinetokaysincreaseinsugarcanefrpbyrstorsqtlforarticleshowcms sugarcane many although fair share advantages one major problems rising surpluses mitigated govt buying extra produce adding pds wouldnt work crops even eu let go policy adopted dbt scheme form single farm paymentshttpsenwikipediaorgwikisinglefarmpayment b price deficiency support mp govt experimented downside basically encourages buyers pay low possible govt bear difference c contract farming step right direction overall impact widely overestimated corporations prefer large farmers simply due economics scale single point contact many fpos encouraged pass benefit small farmers direct income support every country world currently adopted goi lacks funds adopt wider scale help increase farmers incomes going touch upon first issue make edit morning discuss critical problems lets look critical issues average landholding india currently average landholding hectareshttpswwwthehindubusinesslinecomeconomyagribusinessaveragefarmlandholdingsizeshrinkstohaarticleece farmers small marginal lt hectares mainly due employment large workforce agriculture large population fragmentation land passing generations solution come job creation sectors happening organically according nsso surveyhttpswwwfinancialexpresscomeconomysurplusruralworkforceshiftingfromagriculturetoservicesplfsjobsreportrevealspositiveswitch us took almost century bring share agriculture workforce httpswwwersusdagovwebdocspublicationseibpdf back rapid industrialization technological advancements land use restrictions farmers many states sell land agriculturists deflates value land restricts moving agriculture also getting loans keeping land collateral states like tamil nadu keralahttpswwwthehinducomfeatureshomesandgardenslandlawsacrossindiaarticleece already amended allowed industrialists use nonagricultural purposes anecdote family owns around acres land near moga punjab value lakh per acre land without restrictions would fetch anywhere close crore moga ease credit farmers usually rely middlemen getting loans charge around interest rate banks usually arent help land titles always clear hence leading rejection collateral pmkisan kisan credit card good measure providing credit input costs pvt players like mahindra finance also made easier get loans agricultural equipment ",
    "cleaned_title": "farm laws evolving opinion",
    "cleaned_selftext": "last months opinion farm laws constantly evolving trying look perspectives make sense could best option farmers one thing certain agriculture survive without govt intervention major decision area kind intervention chose first lets start looking extreme scenario ie role govt example bihar contrary proneo lib journalists like gupta ji claim bihar hasnt really benefitted repealing apmc allowing private traders without kind protection argument made situation even worsened last years ampxb gtduring period first agriculture road map growth rate accelerated per centwhich almost equal national average agricultural growth however higher growthin agriculture sustain long run fact average annual growth rate declined per cent period second agriculture road map overall period average growth per cent much national averageagricultural growth per cent also look net income period ampxb ampxb sourcehttpswwwncaerorgpublicationdetailsphppidtexttoanswertheseandrelatedwhatitshoulddoto report gtgrowth diagnostics minothausmann hybrid framework revealed poorfunctioning agricultural markets indicated instability prices agriculturalproduces low level crop diversification reasons slow lower agriculturalgrowth bihar abolition apmc act usher private investment forcreating new markets strengthening facilities existing ones leading low market densitythe participation government agencies procurement scale procurement grainscontinues low thus farmers left mercy traders unscrupulously fix lowerprice agricultural produce buy farmers inadequate market facilities andinstitutional arrangements responsible low price realisation instability prices twofactors constraining crop diversification weak market linkages poor institutionalarrangements producer collectives village level also go recommendations mentioned report useful regions well time look critical issues agriculture possible solution volatility prices agricultural produce core issue one major reasons farmer suicides dumping produce etc lets look various mitigation techniques adopted price floors farmers demanding swaminathan commissionhttpswwwprsindiaorgreportsummariesswaminathanreportnationalcommissionfarmers recommended also adopted various govts around world notably eu caphttpseceuropaeuinfofoodfarmingfisherieskeypoliciescommonagriculturalpolicyen canada supply managementhttpslopparlcasitespublicwebsitedefaultencaresearchpublicationse india frphttpseconomictimesindiatimescomnewseconomyagriculturecabinetokaysincreaseinsugarcanefrpbyrstorsqtlforarticleshowcms sugarcane many although fair share advantages one major problems rising surpluses mitigated govt buying extra produce adding pds wouldnt work crops even eu let go policy adopted dbt scheme form single farm paymentshttpsenwikipediaorgwikisinglefarmpayment b price deficiency support mp govt experimented downside basically encourages buyers pay low possible govt bear difference c contract farming step right direction overall impact widely overestimated corporations prefer large farmers simply due economics scale single point contact many fpos encouraged pass benefit small farmers direct income support every country world currently adopted goi lacks funds adopt wider scale help increase farmers incomes going touch upon first issue make edit morning discuss critical problems lets look critical issues average landholding india currently average landholding hectareshttpswwwthehindubusinesslinecomeconomyagribusinessaveragefarmlandholdingsizeshrinkstohaarticleece farmers small marginal lt hectares mainly due employment large workforce agriculture large population fragmentation land passing generations solution come job creation sectors happening organically according nsso surveyhttpswwwfinancialexpresscomeconomysurplusruralworkforceshiftingfromagriculturetoservicesplfsjobsreportrevealspositiveswitch us took almost century bring share agriculture workforce httpswwwersusdagovwebdocspublicationseibpdf back rapid industrialization technological advancements land use restrictions farmers many states sell land agriculturists deflates value land restricts moving agriculture also getting loans keeping land collateral states like tamil nadu keralahttpswwwthehinducomfeatureshomesandgardenslandlawsacrossindiaarticleece already amended allowed industrialists use nonagricultural purposes anecdote family owns around acres land near moga punjab value lakh per acre land without restrictions would fetch anywhere close crore moga ease credit farmers usually rely middlemen getting loans charge around interest rate banks usually arent help land titles always clear hence leading rejection collateral pmkisan kisan credit card good measure providing credit input costs pvt players like mahindra finance also made easier get loans agricultural equipment",
    "cleaned_comments": "gt every country world currently adopted goi lacks funds adopt wider scale help increase farmers incomes one k per year gt contract farming step right direction overall impact widely overestimated corporations prefer large farmers simply due economics scale single point contact many fpos encouraged pass benefit small farmers cooperatives solution implemented independence failed exploited big farmers gt bihar hasnt really benefitted repealing apmc allowing private traders without kind protection argument made situation even worsened last years bihar govt thought opening market private traders would mean would invest market state wont bihar lacks infrastructure brings investors one biggest beneficiary pds market prices lower bihar invested roads villages trains farmers reducing transport costs gt farmers many states sell land agriculturists deflates value land restricts moving agriculture also getting loans keeping land collateral second part isnt something india due farming economics work farmers arent getting loans banks generally pay high rate interest also going lead bigger protest current one farm land bought industrialist directly already happens cities towns farmers made fear land snatched isnt happening even dont prefer land collateral leads accumulation gt although fair share advantages one major problems rising surpluses mitigated govt buying extra produce adding pds wouldnt work crops one could say msp one massive issue much relied upon becoming single point failure fci govt giving subsidies price floors good really need reduce burden gt one k per year mention pmkisaan post gt farmers arent getting loans banks generally pay high rate interest mention well gt also going lead bigger protest current one farm land bought industrialist directly mentioned already allowed many states cap prevent accumulation gt one could say msp one massive issue much relied upon becoming single point failure fci govt giving subsidies price floors good really need reduce burden course msp one problem guaranteed two crops farmers legalized crops farmers would incentives diversify gt mention pmkisaan post gt mention well ease credit didnt read believe pmkisaan included direct income support gt course msp one problem guaranteed two crops farmers legalized crops farmers would incentives diversify msp guaranteed crops issue isnt guarantee procurement state govt msp guaranteed apmc markets state govt need encouraged procurement reason states dont procure enough fci mostly deals wheat rice unless fci someone govt body stores states wont procure enough farmers would mainly sell market gt believe pmkisaan included direct income support agree gt msp guaranteed crops issue isnt guarantee procurement state govt msp guaranteed apmc markets state govt need encouraged procurement reason states dont procure enough fci mostly deals wheat rice unless fci someone govt body stores states wont procure enough farmers would mainly sell market msp isnt guaranteed crops acts price indicator isnt enforced farmers asking legalized pvt buyers also forced buy markets open eu cap gt msp isnt guaranteed crops acts price indicator isnt enforced isnt guaranteed rice wheat well msp guaranteed govt procurement state arent procuring wont guaranteed arent states procuring enough dont buyer centrefci wheat rice gt gt farmers asking legalized pvt buyers also forced buy markets open unlikely happen given msp prices generally higher buyer sell even abroad gt unlikely happen given msp prices generally higher buyer sell even abroad thats whole point agitation farmers realize going get fair prices produce markets open farmers already dont many forced sell losses dump produce msp margin total input cost even isnt realized whats point even sowing crops lets take scenario msp maize rs kg market price last year rskg way lower input cost maize flour addition value sold rs kg keeping things constant lets assume msp guaranteed farmer gets rs increase income price fg increases rs kg increase around end consumer course really simplistic take whole scenario imagine growth achieve double farmers income employs close workforce consumers get hosed deal farmer margin fixed trader margin sell end consumer fixed also government never restrict import cheaper goods available internationally consumers pay higher prices suddenly nobody cares poor laborer well screw right also cant increase much procured government wasteful end farmers producing wheat rice government procuring rotting godowns poor labourers acess pds govt restricts imports long run syrenghthig local industries case farmers better govt removes import restrictions automobiles companies except royally fucked still bringing surplus wheat rice going whole thread sure didnt need improve comprehension skills tf ask increase procurement govt reason making conditions cant bow one stakeholder issue end essentially screwing others dont believe farmers agree restrictions terms crop rotation stubble burning et want pound flesh legalizing msp disastrous stated government procure surplus production sales guaranteed price fixed regardless market condition leads perverse incentive would favor single price product regardless market condition farmers allowed sell higher price low yield seasons else would like petrol prices right consumers getting hosed ways",
    "light_cleaned_title": "Farm Laws- My evolving opinion",
    "light_cleaned_selftext": "For the last 3 months, my opinion on the farm laws has been constantly evolving. I have been trying to look at all the perspectives and make sense of what could be the best option for the farmers. One thing that is for certain is that agriculture cannot survive without Govt intervention. The major decision area is the kind of intervention we chose. First, let's start by looking at the most extreme scenario i.e no role of Govt with the example of Bihar. Contrary to what pro-neo lib journalists like Gupta Ji claim, Bihar hasn't really benefitted from repealing APMC and allowing private traders without any kind of protection. An argument can be made that the situation has even worsened over the last 14 years  &gt;During the period of the first agriculture road map, the growth rate accelerated to 3.1 per cent,which was almost equal to the national average agricultural growth. However, this higher growthin agriculture did not sustain in the long run. In fact, the average annual growth rate declined to1.28 per cent during the period of the second agriculture road map. During the overall period 2001-02 to 2016-17, average growth was only 2.0 per cent, which was much below the national averageagricultural growth of 3.1 per cent. Also, look at the net income over the same period   [Source](https://www.ncaer.org/publication_details.php?pID=311#:~:text=To%20answer%20these%20and%20related,what%20it%20should%20do%20to) From the same report &gt;Growth diagnostics through Minot-Hausmann Hybrid framework has revealed that poorfunctioning of agricultural markets indicated by instability in the prices of agriculturalproduces and low level of crop diversification are the reasons for slow or lower agriculturalgrowth in Bihar. The abolition of APMC Act in 2006 did not usher in private investment forcreating new markets or strengthening facilities in the existing ones leading to low market density.The participation of government agencies in procurement and scale of procurement of grainscontinues to be low. Thus, farmers are left to the mercy of traders who unscrupulously fix lowerprice for agricultural produce that they buy from farmers. Inadequate market facilities andinstitutional arrangements are responsible for low price realisation and instability in prices. Twofactors constraining the crop diversification are weak market linkages and poor institutionalarrangements such as producer collectives at the village level. Also, go through the recommendations mentioned in the report. They can be useful for other regions as well. It is time to look at the critical issues in agriculture and what can be their possible solution **1) Volatility in prices of agricultural produce** This is the core issue and one of the major reasons for farmer suicides, dumping of produce, etc. Now let's look at various mitigation techniques that can be adopted **a) Price floors:** This is what the farmers are demanding and what the [Swaminathan Commission](https://www.prsindia.org/report-summaries/swaminathan-report-national-commission-farmers) recommended. It has also been adopted by various Govts around the world, notably the EU through its [CAP](https://ec.europa.eu/info/food-farming-fisheries/key-policies/common-agricultural-policy_en), Canada through its [Supply Management](https://lop.parl.ca/sites/PublicWebsite/default/en_CA/ResearchPublications/201842E), India through [FRP](https://economictimes.indiatimes.com/news/economy/agriculture/cabinet-okays-increase-in-sugarcane-frp-by-rs-10-to-rs-285/qtl-for-2020-21/articleshow/77636635.cms) for Sugarcane, and many more. Although it has its fair share of advantages, one of the major problems with this is the rising surpluses. This can be mitigated by Govt buying the extra produce and adding it to the PDS but that wouldn't work for other crops. Even EU has let go this policy and adopted a DBT scheme in the form of [Single Farm Payments](https://en.wikipedia.org/wiki/Single_Farm_Payment) **b) Price deficiency support:** MP Govt experimented with it but the downside is that it basically encourages buyers to pay as low as possible as the Govt will be there to bear the difference **c) Contract Farming:** This is a step in the right direction but its overall impact is widely overestimated. Corporations will prefer large farmers simply due to economics of scale and a single point of contact over many. FPO's can be encouraged to pass on this benefit to small farmers. **d) Direct Income support:** This is what every country in the world has currently adopted but the GOI lacks funds to adopt it on a wider scale which will help increase farmers' incomes. For now, I am only going to touch upon this first issue, will make an edit in the morning and discuss other critical problems then Let's look at other critical issues **2) Average landholding:** India currently has an average landholding of [1.1 Hectares](https://www.thehindubusinessline.com/economy/agri-business/average-farm-landholding-size-shrinks-to-11-ha/article24719240.ece), 86% of the farmers are small and marginal ( &lt;2 hectares). This is mainly due to the employment of a large workforce in agriculture, our large population, and the fragmentation of land with passing generations. The solution to this has to come from job creation in other sectors and it has been happening organically according to an [NSSO Survey](https://www.financialexpress.com/economy/surplus-rural-workforce-shifting-from-agriculture-to-services-plfs-jobs-report-reveals-positive-switch/1600637/). The US took almost a century to bring down the share of the agriculture workforce from [41% to 1.7%](https://www.ers.usda.gov/webdocs/publications/44197/13566_eib3_1_.pdf) on the back of rapid industrialization and technological advancements **3)Land use restrictions:** Farmers in many states can only sell their land to agriculturists which deflates the value of their land. This restricts them from moving out of agriculture and also getting loans by keeping land as collateral. Some states like [Tamil Nadu and Kerala](https://www.thehindu.com/features/homes-and-gardens/Land-laws-across-India/article14414630.ece) have already amended these and allowed industrialists to use them for non-agricultural purposes. An anecdote here, my family owns around 16 acres of land near Moga in Punjab with a value of 30 Lakh per acre while the same land without those restrictions would fetch anywhere close to 1-2 crore in Moga. **4) Ease of Credit:** Farmers usually have to rely on the middlemen for getting loans, they charge around 20-25% interest rate. Banks usually arent of help as the land titles are not always clear hence leading to rejection of collateral. PM-Kisan and Kisan credit card are a good measure for providing credit for input costs, Pvt players like Mahindra finance have also made it easier to get loans for agricultural equipment.",
    "light_cleaned_comments": "&gt; This is what every country in the world has currently adopted but the GOI lacks funds to adopt it on a wider scale which will help increase farmers' incomes. There is one. But, it is only 6k per year. &gt; Contract Farming: This is a step in the right direction but its overall impact is widely overestimated. Corporations will prefer large farmers simply due to economics of scale and a single point of contact over many. FPO's can be encouraged to pass on this benefit to small farmers. Cooperatives can be a solution, but when they were implemented just after independence, they failed because how they were exploited by big farmers. &gt; Bihar hasn't really benefitted from repealing APMC and allowing private traders without any kind of protection. An argument can be made that the situation has even worsened over the last 14 years Bihar Govt thought opening the market to private traders would mean they would invest in the market and then the state won't. Bihar lacks infrastructure that brings in investors and then it is only one of biggest beneficiary of PDS. So, market prices will be lower there. Bihar should have invested in more roads to villages and trains for farmers, reducing transport costs. &gt; Farmers in many states can only sell their land to agriculturists which deflates the value of their land. This restricts them from moving out of agriculture and also getting loans by keeping land as collateral. The second part isn't something you can do in India, due to how farming economics work. Because, farmers aren't getting loans from banks, so generally they pay a very high rate of interest. Also, it is going to lead to a bigger protest than the current one, if farm land can be bought by industrialist directly. It already happens with cities and towns, but farmers have been made to fear that their land will be snatched so that isn't happening. Even, I don't prefer land as collateral as it leads to accumulation. &gt; Although it has its fair share of advantages, one of the major problems with this is the rising surpluses. This can be mitigated by Govt buying the extra produce and adding it to the PDS but that wouldn't work for other crops. One could say MSP is one. But, there is a massive issue with how much it is being relied upon and is becoming a single point of failure with FCI (govt not giving subsidies). Price floors are good, but we really need to reduce burden on it. &gt; There is one. But, it is only 6k per year. I mention PM-Kisaan in the post &gt; Because, farmers aren't getting loans from banks, so generally they pay a very high rate of interest. I mention this as well &gt; Also, it is going to lead to a bigger protest than the current one, if farm land can be bought by industrialist directly. As I mentioned, it's already allowed in many states with a cap to prevent accumulation. &gt; One could say MSP is one. But, there is a massive issue with how much it is being relied upon and is becoming a single point of failure with FCI (govt not giving subsidies). Price floors are good, but we really need to reduce burden on it. Of course, MSP is one but the problem here is that it is only guaranteed on two crops, and that too for not all farmers. If it was legalized for other 21 crops, farmers would have incentives to diversify &gt; I mention PM-Kisaan in the post &gt; I mention this as well They were in Ease of Credit I didn't read it. I believe PM-Kisaan should have been included in Direct Income support &gt; Of course, MSP is one but the problem here is that it is only guaranteed on two crops, and that too for not all farmers. If it was legalized for other 21 crops, farmers would have incentives to diversify MSP is guaranteed on 23 crops. Issue isn't the guarantee but procurement by the state govt. MSP is only guaranteed in APMC markets and then state govt need to do encouraged to do more procurement. The reason why states don't procure enough is because FCI mostly just deals with wheat and rice. Unless, FCI or someone Govt body stores it, states won't procure enough and farmers would mainly sell in the market. &gt; I believe PM-Kisaan should have been included in Direct Income support agree &gt; MSP is guaranteed on 23 crops. Issue isn't the guarantee but procurement by the state govt. MSP is only guaranteed in APMC markets and then state govt need to do encouraged to do more procurement. The reason why states don't procure enough is because FCI mostly just deals with wheat and rice. Unless, FCI or someone Govt body stores it, states won't procure enough and farmers would mainly sell in the market. MSP isn't guaranteed on 23 crops, it just acts as a price indicator it isn't enforced. Farmers are asking for it to be legalized so that Pvt buyers are also forced to buy at it once the markets open up. This is what the EU did with CAP &gt; MSP isn't guaranteed on 23 crops, it just acts as a price indicator it isn't enforced. It isn't guaranteed on Rice or Wheat as well. MSP is guaranteed only on govt procurement, but if state aren't procuring it, it won't be guaranteed. Why aren't states procuring it enough? Because they don't have a buyer which is Centre/FCI for wheat and rice. &gt; &gt; Farmers are asking for it to be legalized so that Pvt buyers are also forced to buy at it once the markets open up Which is very unlikely to happen, given that MSP prices are generally higher than what a buyer can sell at, even abroad. &gt; Which is very unlikely to happen, given that MSP prices are generally higher than what a buyer can sell at, even abroad. That's the whole point of this agitation, farmers realize they are not going to get fair prices for their produce once the markets open up ( most farmers already don't, many are forced to sell at losses or dump their produce) . MSP is just a 50% margin over the total input cost. If even that isn't realized what's the point of even sowing those crops. Let's take a scenario. MSP for maize is rs 18/kg, the market price last year was 8 rs/kg( way lower than input cost). Maize flour after addition of value is sold at Rs 80/kg. Keeping all things constant let's assume MSP is guaranteed and the farmer gets Rs 18. That is more than a 100% increase in his income while the price of FG increases to Rs 90/kg an increase of around 12.5% to the end consumer. Of course, this is a really simplistic take of the whole scenario but imagine the growth we can achieve if we can double the farmer's income as it employs close to 41% of our workforce. Why should consumers get hosed on that deal. If farmer margin is fixed, then trader margin to sell to end consumer should be fixed. Also government should never restrict import. If cheaper goods are available internationally, why should consumers pay for higher prices. Suddenly nobody cares about the poor laborer and their well being. Screw them right Also you can't increase how much and what is procured by government. It's just wasteful. We will end up farmers producing wheat and rice, government procuring it and most of it rotting in godowns. Poor labourers have acess to PDS. Govt restricts imports because in the long run syrenghthig local industries and in this case farmers is better. If govt removes import restrictions on Automobiles , most of the companies except for 1 or 2 will be royally fucked. And if you are still bringing up surplus of wheat and rice after going through the whole thread ( which I am sure you didn't) then you need to improve your comprehension skills. Where tf did I ask for increase in procurement by Govt? The reason I am making all these conditions is because you can't bow down to one stakeholder in an issue and end up essentially screwing up all others. I don't believe farmers will agree to any restrictions in terms of crop rotation, stubble burning et all. They want their pound of flesh. Legalizing MSP will be disastrous. You stated that the government should procure surplus production. If sales is guaranteed with price fixed regardless of market condition, then it leads to perverse incentive. Would you be in favor of single price of Product regardless of market condition. Farmers are not allowed to sell at higher price during low yield seasons. Else it would be like the petrol prices right now. Consumers getting hosed both ways."
}