{
    "id": "1hg9dut",
    "title": "amazon order scam need helppp",
    "url": "https://www.reddit.com/gallery/1hg9dut",
    "selftext": "\nSo i recently ordered a Sony PS5 controller from amazon and to my shock I recieved a faulty controller and even that was brokenWhen I contacted amazon support they told me they have started an \"INVESTIGATION\" for it and will be resolved in 4 daysNow when I call them after 4 days they say that its my fault and the item that was sent was perfectly fineWhen I told them I have proof they said we can't do anything !!!Now they have told me that they will launch another investigation to solve this issue dunno if this will  be solved or notBeen a prime member for god knows how long and this is what I get Dunno if they will replace it or not!!!\n\nTL;DR: Ordered a PS5 controller from Amazon, got a faulty, broken one. Amazon investigated, blamed me despite my proof, and now they’re starting another investigation. Still no resolution.",
    "flair": "Rant / Vent",
    "score": 126,
    "num_comments": 64,
    "created_utc": 1734437855.0,
    "convurl": "https://i.redd.it/4g0kb0v7ie7e1.jpg",
    "comments": [
        "What the heck are you talking about? That's not PS5 controller, let alone a faulty one.",
        "Did you check the reviews properly this Electronic Bazaar Store has scammed some of people.",
        "Yes I received it like this",
        "Yea but the recent orders were fine so I decided to give it a shot\nGot scammed instead 🫠",
        "Where's the PS5 controller at?\n\n\nAnyway lodge a complain here https://consumerhelpline.gov.in/public/",
        "😂",
        "Recieved the sony box with a fake controller \nAnd the funny part is it was all sealed \nAnyways thanks will do so",
        "Did you record the video while opening the parcel from the begining? If yes then you may get refund. If not then Amazon may decline to refund. Write on Twitter/X which might help. Thanks",
        "Quite obviously that is a fake.",
        "Yes i have the complete video proof as well as the call recording proof of the talk I had with amazon\nOkay will surely go to twitter",
        "Always order online products with a credit card so that you can file a chargeback. The bank will force Amazon to give a refund.",
        "Someone did u dirty",
        "No open box check by delivery person?",
        "I have ordered it from credit card\nCan you please tell me how to file a chargeback??",
        "Bagal ke croma se lelete",
        "Call up your bank or your relationship manager from that bank and tell that there has been a case of fraud",
        "Okay thanks",
        "No croma nearby mann 💔",
        "That is NOT a PS5 controller.",
        "Mention the seller while lodging a complain as well not just Amazon ",
        "Its ps4 dual shock if u have a return or cancel do it",
        "I only have a replace option and it ain't helping",
        "Amazon will always help.\nI have never faced issues in return or exchange.\nYou can just call their customer care and explain the issue.\nThey will facilitate a return or exchange.\n\nI hope you had made a video while opening the package.",
        "That's great bro. I hope you soon receive either a new controller or refund.",
        "Bhai tekko PS6 ka prototype dia h. YT pr video bna kr dalde aur views dena critics.",
        "Yeah buddy",
        "Ask for a replacement. I don't understand why you didn't go for it. Also if you get wrong product even after replacement, you can get a refund.",
        "chuna laga diya moment. \n\nBro contact Amazon on insta, twitter and make a post",
        "There was a site which mentioned some of the legit suppliers in Amazon (and Flipkart), and it also mentioned some scam ones too. I, unfortunately, do not remember the site now. If anyone does, please mention it here. It'd be very helpful.",
        "No shit.",
        "simply replacing didn't help right??",
        "I have already told them to replace it but as you can see they won't they just say its ok from their end",
        "Ur cooked call them",
        "Must be delivery boy scam",
        "Was there a replacement within x days option for the product when you buy if so you don't even need to talk, you can directly go to orders and select it",
        "Hey, escalate the issue, normal customer support won't do shit, ask them for an escalation",
        "I ordered same controller from same seller and recieved 2 days ago. controller is perfectly fine.\n\nwait for few days. In case if they dont help you out after few days. Get ready with all the proof and Raise a complain at consumer court portal against amazon.",
        "Check the national consumer [helpline ](https://consumerhelpline.gov.in/user/signup.php)Have all the details with you , Add all the details , but most importantly, the webpage has a timer , it expires after some time , so for the description part of the complaint in the notes app, and copy paste it. write a formal complaint with all the details. \nOnce done. Search for nch track grievance, enter your details , once opened , save that page as pdf (there is an option) sent to their grievance email id. And post the whole incident on twitter , in the form of a thread. Hope this helps. Email them & take the matter to Twitter",
        "Yeah just hit them up. Had a similiar issue but it was a transfer not card payment....",
        "Thanks a lott dude I have registered the complaint just now and will do the twitter part",
        "Never ever buy from a shady seller. Idk if Amazon has changed some rules. But recently there are shit load of scams going on",
        "Call the amazon toll free number starting with 1800 something; has worked for me and opt for a pickup in the website",
        "Same experience I faced",
        "Dualsense nahi, nonsense hai..",
        "try to get refund from amazon first. chargeback should be your last resort with amazon. they might block your amazon account forever.",
        "Yaar logo ne flipkart se lena band kar dia kya??",
        "Is flipkart better for electronics??",
        "Arey i meant udhar se scammers ab amazon me aa gaye!! 🙈 sorry!! 😓",
        "Write to Jeff@amazon.com. Keep your email respectful, concise and in a bullet point format. I’ve written several times for genuinely delayed issues, and the CEOs office has resolved it in the next few days. Good luck.",
        "Why didn't you order the red one from the same store?\n\nhttps://preview.redd.it/h16wx87cuf7e1.png?width=1062&format=pjpg&auto=webp&s=1783a7a2504febcb41b6cc620447f0b6bf93184b\n\nAlso record the video when opening electronics items.",
        "Sorry to hear that. That is one of the reason why I been recording my opening of any amazon so I got evident. sad that this happened. if you have credit card that has purchase protection that could help you cover for the purchase. Also, Amazon doesn't allow you to return instead of replacement?",
        "I ordered it on 11th at that time it was out of stock \nAlso I have the video proof",
        "Why don’t you apply for a replacement?",
        "If you have video proof of unboxing, then you can easily return or replace it. \n\nHonestly I never had an issue with Amazon so far. But yeah I can understand it, it happens to many. \n\nAlso buying an expensive item online is a lucky draw. I have many failed controllers in the past but that was more of Microsoft's bad hardware design. Buy from reliance digital or croma which has a sealed box.",
        "Contact Amazon customer care and ask to escalate to a senior. I ordered a sleepycat mattress on Amazon (I talked with the sleepy cat customer service before ordering to see of the 100 days trail still applies to Amazon orders and the guy said yes) when it arrived it was a bit too hard for me and the size was small ( my fault) but I was told I could replace, exchange or return it within 100 days. Then when I went to exchange it I was told by the Amazon Cs that they won't replace, return or exchange it, called the sleepy cat customer service and was told that if Amazon sends me a mail citing that they won't return it then they can handle it or work something out then again I called Amazon and somehow this guy accepted the return request but the next day the pickup guy canceled my pickup without any prior call or text and I immediately called Amazon the Cs rep told me to wait while he connects me to a senior and the senior handled it in 10 mins I was told they would pick it up within 72 hours. The pickup was done the next day and I got the refund in 1 fucking hour.",
        "visit pgportal and file complaint there. it will go in PMO office department",
        "No it's not.\n\nhttps://preview.redd.it/lvoluo5o1g7e1.jpeg?width=2268&format=pjpg&auto=webp&s=7eb32e77c827df6e2723905f7c9c4322650454a7",
        "this is india bro. no one will believe you. sucks but it is what it is.",
        "They sent you the gayatation controller.",
        "Bhai ye aise product ka unboxing ke time he videos bana liya karo",
        "Same happened with me just contact amazon customer care services",
        "Contact Amazon. Should be quick refund since you have proof. If they try doing some delays and drama then resort to consumer helpline or credit card chargeback. Second one may result in Amazon banning your account so do it only if they are not cooperative with refund",
        "Email a written complaint with strong words written using chat gpt and mail it on this email ID\n\ngrievance-officer@amazon.in\n\nI got my problem resolved in past within good 2 days of emailing the complaint, hope it works for you too.",
        "Happened same to me,  with dualsense controller but on Flipkart.  After mailing, making a post on twitter,  calling them multiple times,  return and refund was issued.  Since then I prefer buying offline only for itmes more than 1000."
    ],
    "cleaned_text": "amazon order scam need helppp recently ordered sony ps controller amazon shock recieved faulty controller even brokenwhen contacted amazon support told started investigation resolved daysnow call days say fault item sent perfectly finewhen told proof said cant anything told launch another investigation solve issue dunno solved notbeen prime member god knows long get dunno replace tldr ordered ps controller amazon got faulty broken one amazon investigated blamed despite proof theyre starting another investigation still resolution ",
    "cleaned_title": "amazon order scam need helppp",
    "cleaned_selftext": "recently ordered sony ps controller amazon shock recieved faulty controller even brokenwhen contacted amazon support told started investigation resolved daysnow call days say fault item sent perfectly finewhen told proof said cant anything told launch another investigation solve issue dunno solved notbeen prime member god knows long get dunno replace tldr ordered ps controller amazon got faulty broken one amazon investigated blamed despite proof theyre starting another investigation still resolution",
    "cleaned_comments": "heck talking thats ps controller let alone faulty one check reviews properly electronic bazaar store scammed people yes received like yea recent orders fine decided give shot got scammed instead wheres ps controller anyway lodge complain recieved sony box fake controller funny part sealed anyways thanks record video opening parcel begining yes may get refund amazon may decline refund write twitterx might help thanks quite obviously fake yes complete video proof well call recording proof talk amazon okay surely go twitter always order online products credit card file chargeback bank force amazon give refund someone u dirty open box check delivery person ordered credit card please tell file chargeback bagal ke croma se lelete call bank relationship manager bank tell case fraud okay thanks croma nearby mann ps controller mention seller lodging complain well amazon ps dual shock u return cancel replace option aint helping amazon always help never faced issues return exchange call customer care explain issue facilitate return exchange hope made video opening package thats great bro hope soon receive either new controller refund bhai tekko ps ka prototype dia h yt pr video bna kr dalde aur views dena critics yeah buddy ask replacement dont understand didnt go also get wrong product even replacement get refund chuna laga diya moment bro contact amazon insta twitter make post site mentioned legit suppliers amazon flipkart also mentioned scam ones unfortunately remember site anyone please mention itd helpful shit simply replacing didnt help right already told replace see wont say ok end ur cooked call must delivery boy scam replacement within x days option product buy dont even need talk directly go orders select hey escalate issue normal customer support wont shit ask escalation ordered controller seller recieved days ago controller perfectly fine wait days case dont help days get ready proof raise complain consumer court portal amazon check national consumer helpline httpsconsumerhelplinegovinusersignupphphave details add details importantly webpage timer expires time description part complaint notes app copy paste write formal complaint details done search nch track grievance enter details opened save page pdf option sent grievance email id post whole incident twitter form thread hope helps email take matter twitter yeah hit similiar issue transfer card payment thanks lott dude registered complaint twitter part never ever buy shady seller idk amazon changed rules recently shit load scams going call amazon toll free number starting something worked opt pickup website experience faced dualsense nahi nonsense hai try get refund amazon first chargeback last resort amazon might block amazon account forever yaar logo ne flipkart se lena band kar dia kya flipkart better electronics arey meant udhar se scammers ab amazon aa gaye sorry write jeffamazoncom keep email respectful concise bullet point format ive written several times genuinely delayed issues ceos office resolved next days good luck didnt order red one store also record video opening electronics items sorry hear one reason recording opening amazon got evident sad happened credit card purchase protection could help cover purchase also amazon doesnt allow return instead replacement ordered th time stock also video proof dont apply replacement video proof unboxing easily return replace honestly never issue amazon far yeah understand happens many also buying expensive item online lucky draw many failed controllers past microsofts bad hardware design buy reliance digital croma sealed box contact amazon customer care ask escalate senior ordered sleepycat mattress amazon talked sleepy cat customer service ordering see days trail still applies amazon orders guy said yes arrived bit hard size small fault told could replace exchange return within days went exchange told amazon cs wont replace return exchange called sleepy cat customer service told amazon sends mail citing wont return handle work something called amazon somehow guy accepted return request next day pickup guy canceled pickup without prior call text immediately called amazon cs rep told wait connects senior senior handled mins told would pick within hours pickup done next day got refund fucking hour visit pgportal file complaint go pmo office department india bro one believe sucks sent gayatation controller bhai ye aise product ka unboxing ke time videos bana liya karo happened contact amazon customer care services contact amazon quick refund since proof try delays drama resort consumer helpline credit card chargeback second one may result amazon banning account cooperative refund email written complaint strong words written using chat gpt mail email id grievanceofficeramazonin got problem resolved past within good days emailing complaint hope works happened dualsense controller flipkart mailing making post twitter calling multiple times return refund issued since prefer buying offline itmes",
    "light_cleaned_title": "amazon order scam need helppp",
    "light_cleaned_selftext": "So i recently ordered a Sony PS5 controller from amazon and to my shock I recieved a faulty controller and even that was brokenWhen I contacted amazon support they told me they have started an \"INVESTIGATION\" for it and will be resolved in 4 daysNow when I call them after 4 days they say that its my fault and the item that was sent was perfectly fineWhen I told them I have proof they said we can't do anything !!!Now they have told me that they will launch another investigation to solve this issue dunno if this will be solved or notBeen a prime member for god knows how long and this is what I get Dunno if they will replace it or not!!! TL;DR: Ordered a PS5 controller from Amazon, got a faulty, broken one. Amazon investigated, blamed me despite my proof, and now they’re starting another investigation. Still no resolution.",
    "light_cleaned_comments": "What the heck are you talking about? That's not PS5 controller, let alone a faulty one. Did you check the reviews properly this Electronic Bazaar Store has scammed some of people. Yes I received it like this Yea but the recent orders were fine so I decided to give it a shot Got scammed instead 🫠 Where's the PS5 controller at? Anyway lodge a complain here 😂 Recieved the sony box with a fake controller And the funny part is it was all sealed Anyways thanks will do so Did you record the video while opening the parcel from the begining? If yes then you may get refund. If not then Amazon may decline to refund. Write on Twitter/X which might help. Thanks Quite obviously that is a fake. Yes i have the complete video proof as well as the call recording proof of the talk I had with amazon Okay will surely go to twitter Always order online products with a credit card so that you can file a chargeback. The bank will force Amazon to give a refund. Someone did u dirty No open box check by delivery person? I have ordered it from credit card Can you please tell me how to file a chargeback?? Bagal ke croma se lelete Call up your bank or your relationship manager from that bank and tell that there has been a case of fraud Okay thanks No croma nearby mann 💔 That is NOT a PS5 controller. Mention the seller while lodging a complain as well not just Amazon Its ps4 dual shock if u have a return or cancel do it I only have a replace option and it ain't helping Amazon will always help. I have never faced issues in return or exchange. You can just call their customer care and explain the issue. They will facilitate a return or exchange. I hope you had made a video while opening the package. That's great bro. I hope you soon receive either a new controller or refund. Bhai tekko PS6 ka prototype dia h. YT pr video bna kr dalde aur views dena critics. Yeah buddy Ask for a replacement. I don't understand why you didn't go for it. Also if you get wrong product even after replacement, you can get a refund. chuna laga diya moment. Bro contact Amazon on insta, twitter and make a post There was a site which mentioned some of the legit suppliers in Amazon (and Flipkart), and it also mentioned some scam ones too. I, unfortunately, do not remember the site now. If anyone does, please mention it here. It'd be very helpful. No shit. simply replacing didn't help right?? I have already told them to replace it but as you can see they won't they just say its ok from their end Ur cooked call them Must be delivery boy scam Was there a replacement within x days option for the product when you buy if so you don't even need to talk, you can directly go to orders and select it Hey, escalate the issue, normal customer support won't do shit, ask them for an escalation I ordered same controller from same seller and recieved 2 days ago. controller is perfectly fine. wait for few days. In case if they dont help you out after few days. Get ready with all the proof and Raise a complain at consumer court portal against amazon. Check the national consumer [helpline ](https://consumerhelpline.gov.in/user/signup.php)Have all the details with you , Add all the details , but most importantly, the webpage has a timer , it expires after some time , so for the description part of the complaint in the notes app, and copy paste it. write a formal complaint with all the details. Once done. Search for nch track grievance, enter your details , once opened , save that page as pdf (there is an option) sent to their grievance email id. And post the whole incident on twitter , in the form of a thread. Hope this helps. Email them & take the matter to Twitter Yeah just hit them up. Had a similiar issue but it was a transfer not card payment.... Thanks a lott dude I have registered the complaint just now and will do the twitter part Never ever buy from a shady seller. Idk if Amazon has changed some rules. But recently there are shit load of scams going on Call the amazon toll free number starting with 1800 something; has worked for me and opt for a pickup in the website Same experience I faced Dualsense nahi, nonsense hai.. try to get refund from amazon first. chargeback should be your last resort with amazon. they might block your amazon account forever. Yaar logo ne flipkart se lena band kar dia kya?? Is flipkart better for electronics?? Arey i meant udhar se scammers ab amazon me aa gaye!! 🙈 sorry!! 😓 Write to Jeff@amazon.com. Keep your email respectful, concise and in a bullet point format. I’ve written several times for genuinely delayed issues, and the CEOs office has resolved it in the next few days. Good luck. Why didn't you order the red one from the same store? Also record the video when opening electronics items. Sorry to hear that. That is one of the reason why I been recording my opening of any amazon so I got evident. sad that this happened. if you have credit card that has purchase protection that could help you cover for the purchase. Also, Amazon doesn't allow you to return instead of replacement? I ordered it on 11th at that time it was out of stock Also I have the video proof Why don’t you apply for a replacement? If you have video proof of unboxing, then you can easily return or replace it. Honestly I never had an issue with Amazon so far. But yeah I can understand it, it happens to many. Also buying an expensive item online is a lucky draw. I have many failed controllers in the past but that was more of Microsoft's bad hardware design. Buy from reliance digital or croma which has a sealed box. Contact Amazon customer care and ask to escalate to a senior. I ordered a sleepycat mattress on Amazon (I talked with the sleepy cat customer service before ordering to see of the 100 days trail still applies to Amazon orders and the guy said yes) when it arrived it was a bit too hard for me and the size was small ( my fault) but I was told I could replace, exchange or return it within 100 days. Then when I went to exchange it I was told by the Amazon Cs that they won't replace, return or exchange it, called the sleepy cat customer service and was told that if Amazon sends me a mail citing that they won't return it then they can handle it or work something out then again I called Amazon and somehow this guy accepted the return request but the next day the pickup guy canceled my pickup without any prior call or text and I immediately called Amazon the Cs rep told me to wait while he connects me to a senior and the senior handled it in 10 mins I was told they would pick it up within 72 hours. The pickup was done the next day and I got the refund in 1 fucking hour. visit pgportal and file complaint there. it will go in PMO office department No it's not. this is india bro. no one will believe you. sucks but it is what it is. They sent you the gayatation controller. Bhai ye aise product ka unboxing ke time he videos bana liya karo Same happened with me just contact amazon customer care services Contact Amazon. Should be quick refund since you have proof. If they try doing some delays and drama then resort to consumer helpline or credit card chargeback. Second one may result in Amazon banning your account so do it only if they are not cooperative with refund Email a written complaint with strong words written using chat gpt and mail it on this email ID grievance-officer@amazon.in I got my problem resolved in past within good 2 days of emailing the complaint, hope it works for you too. Happened same to me, with dualsense controller but on Flipkart. After mailing, making a post on twitter, calling them multiple times, return and refund was issued. Since then I prefer buying offline only for itmes more than 1000."
}