{
    "id": "10w4629",
    "title": "Blind Dating",
    "url": "https://www.reddit.com/gallery/10w4629",
    "selftext": "So, basically was looking up Paytm Insider to view the events which are gonna happen in my city and suddenly stumbled upon this blind dating thingy \n\nDid anyone ever try this and what’s your opinion ?\n\nP.S. I’m a single and thinking to give a shot",
    "flair": "AskIndia",
    "score": 178,
    "num_comments": 66,
    "created_utc": 1675782631,
    "convurl": "https://i.redd.it/7qwv47yl8sga1.jpg",
    "comments": [
        "The image is a screenshot from my phone",
        "Tumhe lagta hai waha pe girls honge?",
        "Fake event",
        "There is an option for female participants as well \nThey will randomise the female and male pairs",
        "But bro wo register hongi Aisa lagta hai kya udhar means Register karegi kya imo no (although take other opinions)",
        "Reason ?",
        "Aka sausage fest",
        "Bhai ladki aise nahi milti.\n\nArrange marriage kar lo fir uske sath date hi date par jana",
        "Acha",
        "Arre mammi ji apko bola to hai shadi nahi karni abhi",
        "aye frappe ash ki album cover as dp nice",
        "https://preview.redd.it/02wedtpw8uga1.png?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=8814ce06d6fbb1d70d6fe1b2b8b915a61a1ec83e\n\nYe le bookmyshow pe bhi hai, iska meme banaane vaala tha but iss baar karma tu leja",
        "Is it for the blind people",
        "The last time I saw something close to this blind data event was in my Village, where the Village community was trying to match people based on their caste. They had this fucking register to note down your name and caste. Fucking disgusting.",
        "Love is blind",
        "The concept is flawed, because it is incredibly easy for young women to find a partner if they want to, so they won't register for something like this unless they get paid or are desperate for some reason. \n\nIt's the same problem as with the paid matchmaking services for middle aged and older women: the majority of men in that age group don't need to pay to meet someone willing to date them, so the few that sign up are bound to have 'something wrong' with them, and the women will end up disappointed and waste money and time.",
        "It's better to skip this then",
        "I don't wanna get backfired by a fake event :)",
        "Better utilise the same Rs 300 for a good meal somewhere 😀",
        "Agreed",
        "I think you can get a McDonald’s or a Burger King meal for less than that price. A better use of cash any day",
        "Wow. I want t to try it",
        "Some event like this happened in dubai later it was found out receptionists and waitresses of that hotel were paid to talk to guys as their blind dates . Organizer still end up in profit even after paying gals coz of decent lads turnout . Most of lads who turned up were mallus and pathans from afghan for dream blind date lol 😂…it short it was a scam",
        "Lmao",
        "Modern problems require ancient solutions, but modern.",
        "That explains why it can't find me",
        "That explains why it can't find me",
        "That makes perfect sense. I can't see why any women in their twenties would sign up for this, especially in India. I guess it's still good dating practice for men that need that, but the marketing is misleading.",
        "Sounds super sexist. Why do the boys have to impress the girls? \n\nLol",
        "exactly 😂",
        "Itne mein ek hafte ka metro return travel ho jata hai",
        "umar nikli ja Rahi hai,bete!",
        "iiitd once organised blind date thingy in their 2020 fest. It was nice",
        "Instructions: worth it.",
        "Yeah that’s so wily I would say and deceiving us for a scam",
        "But it was on spot right ? \nNot like this virtual online gimmick",
        "yep. it was free//they made sure if registered people were coming or not//had games and stuff to break the ice as well.",
        "Nice one",
        "I would milk it up here though",
        "That’s right but I can hopefully find my together forever on this though ;)",
        "I'm surprised that bengalis didnt show up along with it",
        "Yo... Wtf? Why single out a community?",
        "probably because the ratio is going to be terrible :P",
        "So, not LGBT inclusive. A red flag.\n\nStill, in the era of Boys will impress girls(from the desc).\n\nNo information on how you will get a chance or anything.\nOne thing which is obvious is girls will be less and how they will manage it and what if you are not assigned anyone.\n\nI would give it a pass.\n\nAnyways, I am a queer, so no use of this regressive mentality peeps. 🐣",
        "Naah",
        "Are there that many desperate middle aged women?",
        "And here you can see a \"What's my personality? My sexuality is my personality\" person",
        "Boys be impressive.\nGirls let’s see if boys can impress you.\n\nThese 2 lines explain everything that’s stupidly wrong with entire Indian dating system",
        "I shared opinion based on hetero couples and would have passed it still for the reasons given above. \n\nThen I added that I am a queer so I don't want to indulge with organisers who couldn't be inclusive in today's era.\n\nSorry, if I given this impression \"my sexuality is my personality\", coz I don't like that trait either. I will rephrase if something sounds like that.\n\nThanks. Hoping for a constructive feedback.",
        "True. Today's era. One where the opinions of a negligible minority mostly mentally sick are forced upon the majority to seem \"inclusive\" and if they don't, get \"cancelled\" and called out for being transphobic.",
        "I called out the nature of \"boys to impress girls\" as regressive too.\nAnd, you won't understand how exclusive a person feels with such things taking place in today's era.\nI am proud to be a part of such an IT company where there is everyone's restroom. Inclusivity is a part of culture.",
        "I would go just for fun but then I have a boyfriend will tell him to go too 🤣",
        "Ohh, so you would neglect rights and needs of a minority?\n\"Mentally sick\"?\nShows you are actually a queerphobic.",
        "I asked to pinpoint question. Could you reply to that pls?\n\nLooking for a feedback pls.",
        "There we go with the name calling. \nOnly if you broke the stereotype in this discussion rather than proving it.",
        "You called queer community as \"negligible and mentally sick\".",
        "Do you even comprehend the percentage of people who fall under LGBTQ category against the total human population? That my dear friend no matter how you want to twist people's words,  is what's meant by negligible. \nAlso, i have a simple philosophy wherein a cow should be called a cow even if it feels bad thinking that it identifies itself as a fish or a bird.",
        "The reason is hotel where the event held had high concentration mallus / afghan bachelors living in singles accommodation so maybe coz of proximity. Organizer was smart he knew that if hold a event in area where there are lot of bachelors living in hostels the turn out would be high …cheaper hotels and high turnout innit so they can make profit",
        "I don't think they should be described as 'desperate' just because they're looking for a partner. There are a lot of middle aged women that are financially secure and single, and they are often looking for a partner close to them in age that is on a similar income level and presentable etc. \n\nThe problem is, presentable looking middle aged men who are educated and well to do have many women to choose from, so they're extremely unlikely to pay to use a matchmaking service. Some women pay, then they feel scammed by the agency.",
        "Okay.\n\nYour (absurd ) analogy is for trans people. \n\nWhat about sexuality? Your views on gay and lesbians? As the event is for hetero couples only and I called out that only.\n\nPlease stick to one point.\n\nStill you haven't pointed out a line which says \"sexuality is my personality\" shows the shallowness of your arguments.",
        "Shallowness of argument? The whole fuss you've made (and make over every random thing) is about sexuality. \n\nBy all means, go like anyone you want male/female whoever you want, but stop trying to change the rest of the people's beliefs/lifestyle just because YOU wish so. That's all.",
        "I talked about homosexual relationships and not gender identity.\n\nThe event does not have any option for gay/lesbians.",
        "They made a heterosexual event, it's MEANT for heterosexuals, not for you to call them out. You wish a similar event, GO to an LGBTQ specific event..?",
        "Because they didn't intend to make one so?  Join/Organise an LGBTQ event , rather than feeling so priveleged to be sitting in your room and name calling and deciding how companies (who have zero relation to you) should be operating. Again, to be clear to you if you still didn't get it, I have nothing against your choice of lifestyle, I'm pointing out the poor reaction you publically make over something unrelated to you.",
        "I hear you. I used the word 'desperate' only because you used that word. I agree. No one needs to be desperate. If there is a genuine need for companionship, there shouldn't be a problem seeking it, whether you are a man or woman. Women shouldn't have to feel that seeking companionship is improper.",
        "Age kya hua Bhai"
    ],
    "cleaned_text": "blind dating basically looking paytm insider view events gon na happen city suddenly stumbled upon blind dating thingy anyone ever try whats opinion ps im single thinking give shot ",
    "cleaned_title": "blind dating",
    "cleaned_selftext": "basically looking paytm insider view events gon na happen city suddenly stumbled upon blind dating thingy anyone ever try whats opinion ps im single thinking give shot",
    "cleaned_comments": "image screenshot phone tumhe lagta hai waha pe girls honge fake event option female participants well randomise female male pairs bro wo register hongi aisa lagta hai kya udhar means register karegi kya imo although take opinions reason aka sausage fest bhai ladki aise nahi milti arrange marriage kar lo fir uske sath date hi date par jana acha arre mammi ji apko bola hai shadi nahi karni abhi aye frappe ash ki album cover dp nice ye le bookmyshow pe bhi hai iska meme banaane vaala tha iss baar karma tu leja blind people last time saw something close blind data event village village community trying match people based caste fucking register note name caste fucking disgusting love blind concept flawed incredibly easy young women find partner want wont register something like unless get paid desperate reason problem paid matchmaking services middle aged older women majority men age group dont need pay meet someone willing date sign bound something wrong women end disappointed waste money time better skip dont wan na get backfired fake event better utilise rs good meal somewhere agreed think get mcdonalds burger king meal less price better use cash day wow want try event like happened dubai later found receptionists waitresses hotel paid talk guys blind dates organizer still end profit even paying gals coz decent lads turnout lads turned mallus pathans afghan dream blind date lol short scam lmao modern problems require ancient solutions modern explains cant find explains cant find makes perfect sense cant see women twenties would sign especially india guess still good dating practice men need marketing misleading sounds super sexist boys impress girls lol exactly itne mein ek hafte ka metro return travel ho jata hai umar nikli ja rahi haibete iiitd organised blind date thingy fest nice instructions worth yeah thats wily would say deceiving us scam spot right like virtual online gimmick yep freethey made sure registered people coming nothad games stuff break ice well nice one would milk though thats right hopefully find together forever though im surprised bengalis didnt show along yo wtf single community probably ratio going terrible p lgbt inclusive red flag still era boys impress girlsfrom desc information get chance anything one thing obvious girls less manage assigned anyone would give pass anyways queer use regressive mentality peeps naah many desperate middle aged women see whats personality sexuality personality person boys impressive girls lets see boys impress lines explain everything thats stupidly wrong entire indian dating system shared opinion based hetero couples would passed still reasons given added queer dont want indulge organisers couldnt inclusive todays era sorry given impression sexuality personality coz dont like trait either rephrase something sounds like thanks hoping constructive feedback true todays era one opinions negligible minority mostly mentally sick forced upon majority seem inclusive dont get cancelled called transphobic called nature boys impress girls regressive wont understand exclusive person feels things taking place todays era proud part company everyones restroom inclusivity part culture would go fun boyfriend tell go ohh would neglect rights needs minority mentally sick shows actually queerphobic asked pinpoint question could reply pls looking feedback pls go name calling broke stereotype discussion rather proving called queer community negligible mentally sick even comprehend percentage people fall lgbtq category total human population dear friend matter want twist peoples words whats meant negligible also simple philosophy wherein cow called cow even feels bad thinking identifies fish bird reason hotel event held high concentration mallus afghan bachelors living singles accommodation maybe coz proximity organizer smart knew hold event area lot bachelors living hostels turn would high cheaper hotels high turnout innit make profit dont think described desperate theyre looking partner lot middle aged women financially secure single often looking partner close age similar income level presentable etc problem presentable looking middle aged men educated well many women choose theyre extremely unlikely pay use matchmaking service women pay feel scammed agency okay absurd analogy trans people sexuality views gay lesbians event hetero couples called please stick one point still havent pointed line says sexuality personality shows shallowness arguments shallowness argument whole fuss youve made make every random thing sexuality means go like anyone want malefemale whoever want stop trying change rest peoples beliefslifestyle wish thats talked homosexual relationships gender identity event option gaylesbians made heterosexual event meant heterosexuals call wish similar event go lgbtq specific event didnt intend make one joinorganise lgbtq event rather feeling priveleged sitting room name calling deciding companies zero relation operating clear still didnt get nothing choice lifestyle im pointing poor reaction publically make something unrelated hear used word desperate used word agree one needs desperate genuine need companionship shouldnt problem seeking whether man woman women shouldnt feel seeking companionship improper age kya hua bhai",
    "light_cleaned_title": "Blind Dating",
    "light_cleaned_selftext": "So, basically was looking up Paytm Insider to view the events which are gonna happen in my city and suddenly stumbled upon this blind dating thingy Did anyone ever try this and what’s your opinion ? P.S. I’m a single and thinking to give a shot",
    "light_cleaned_comments": "The image is a screenshot from my phone Tumhe lagta hai waha pe girls honge? Fake event There is an option for female participants as well They will randomise the female and male pairs But bro wo register hongi Aisa lagta hai kya udhar means Register karegi kya imo no (although take other opinions) Reason ? Aka sausage fest Bhai ladki aise nahi milti. Arrange marriage kar lo fir uske sath date hi date par jana Acha Arre mammi ji apko bola to hai shadi nahi karni abhi aye frappe ash ki album cover as dp nice Ye le bookmyshow pe bhi hai, iska meme banaane vaala tha but iss baar karma tu leja Is it for the blind people The last time I saw something close to this blind data event was in my Village, where the Village community was trying to match people based on their caste. They had this fucking register to note down your name and caste. Fucking disgusting. Love is blind The concept is flawed, because it is incredibly easy for young women to find a partner if they want to, so they won't register for something like this unless they get paid or are desperate for some reason. It's the same problem as with the paid matchmaking services for middle aged and older women: the majority of men in that age group don't need to pay to meet someone willing to date them, so the few that sign up are bound to have 'something wrong' with them, and the women will end up disappointed and waste money and time. It's better to skip this then I don't wanna get backfired by a fake event :) Better utilise the same Rs 300 for a good meal somewhere 😀 Agreed I think you can get a McDonald’s or a Burger King meal for less than that price. A better use of cash any day Wow. I want t to try it Some event like this happened in dubai later it was found out receptionists and waitresses of that hotel were paid to talk to guys as their blind dates . Organizer still end up in profit even after paying gals coz of decent lads turnout . Most of lads who turned up were mallus and pathans from afghan for dream blind date lol 😂…it short it was a scam Lmao Modern problems require ancient solutions, but modern. That explains why it can't find me That explains why it can't find me That makes perfect sense. I can't see why any women in their twenties would sign up for this, especially in India. I guess it's still good dating practice for men that need that, but the marketing is misleading. Sounds super sexist. Why do the boys have to impress the girls? Lol exactly 😂 Itne mein ek hafte ka metro return travel ho jata hai umar nikli ja Rahi hai,bete! iiitd once organised blind date thingy in their 2020 fest. It was nice Instructions: worth it. Yeah that’s so wily I would say and deceiving us for a scam But it was on spot right ? Not like this virtual online gimmick yep. it was free//they made sure if registered people were coming or not//had games and stuff to break the ice as well. Nice one I would milk it up here though That’s right but I can hopefully find my together forever on this though ;) I'm surprised that bengalis didnt show up along with it Yo... Wtf? Why single out a community? probably because the ratio is going to be terrible :P So, not LGBT inclusive. A red flag. Still, in the era of Boys will impress girls(from the desc). No information on how you will get a chance or anything. One thing which is obvious is girls will be less and how they will manage it and what if you are not assigned anyone. I would give it a pass. Anyways, I am a queer, so no use of this regressive mentality peeps. 🐣 Naah Are there that many desperate middle aged women? And here you can see a \"What's my personality? My sexuality is my personality\" person Boys be impressive. Girls let’s see if boys can impress you. These 2 lines explain everything that’s stupidly wrong with entire Indian dating system I shared opinion based on hetero couples and would have passed it still for the reasons given above. Then I added that I am a queer so I don't want to indulge with organisers who couldn't be inclusive in today's era. Sorry, if I given this impression \"my sexuality is my personality\", coz I don't like that trait either. I will rephrase if something sounds like that. Thanks. Hoping for a constructive feedback. True. Today's era. One where the opinions of a negligible minority mostly mentally sick are forced upon the majority to seem \"inclusive\" and if they don't, get \"cancelled\" and called out for being transphobic. I called out the nature of \"boys to impress girls\" as regressive too. And, you won't understand how exclusive a person feels with such things taking place in today's era. I am proud to be a part of such an IT company where there is everyone's restroom. Inclusivity is a part of culture. I would go just for fun but then I have a boyfriend will tell him to go too 🤣 Ohh, so you would neglect rights and needs of a minority? \"Mentally sick\"? Shows you are actually a queerphobic. I asked to pinpoint question. Could you reply to that pls? Looking for a feedback pls. There we go with the name calling. Only if you broke the stereotype in this discussion rather than proving it. You called queer community as \"negligible and mentally sick\". Do you even comprehend the percentage of people who fall under LGBTQ category against the total human population? That my dear friend no matter how you want to twist people's words, is what's meant by negligible. Also, i have a simple philosophy wherein a cow should be called a cow even if it feels bad thinking that it identifies itself as a fish or a bird. The reason is hotel where the event held had high concentration mallus / afghan bachelors living in singles accommodation so maybe coz of proximity. Organizer was smart he knew that if hold a event in area where there are lot of bachelors living in hostels the turn out would be high …cheaper hotels and high turnout innit so they can make profit I don't think they should be described as 'desperate' just because they're looking for a partner. There are a lot of middle aged women that are financially secure and single, and they are often looking for a partner close to them in age that is on a similar income level and presentable etc. The problem is, presentable looking middle aged men who are educated and well to do have many women to choose from, so they're extremely unlikely to pay to use a matchmaking service. Some women pay, then they feel scammed by the agency. Okay. Your (absurd ) analogy is for trans people. What about sexuality? Your views on gay and lesbians? As the event is for hetero couples only and I called out that only. Please stick to one point. Still you haven't pointed out a line which says \"sexuality is my personality\" shows the shallowness of your arguments. Shallowness of argument? The whole fuss you've made (and make over every random thing) is about sexuality. By all means, go like anyone you want male/female whoever you want, but stop trying to change the rest of the people's beliefs/lifestyle just because YOU wish so. That's all. I talked about homosexual relationships and not gender identity. The event does not have any option for gay/lesbians. They made a heterosexual event, it's MEANT for heterosexuals, not for you to call them out. You wish a similar event, GO to an LGBTQ specific event..? Because they didn't intend to make one so? Join/Organise an LGBTQ event , rather than feeling so priveleged to be sitting in your room and name calling and deciding how companies (who have zero relation to you) should be operating. Again, to be clear to you if you still didn't get it, I have nothing against your choice of lifestyle, I'm pointing out the poor reaction you publically make over something unrelated to you. I hear you. I used the word 'desperate' only because you used that word. I agree. No one needs to be desperate. If there is a genuine need for companionship, there shouldn't be a problem seeking it, whether you are a man or woman. Women shouldn't have to feel that seeking companionship is improper. Age kya hua Bhai"
}