{
    "id": "kqqp0n",
    "title": "Indian Kanoon defends the right to provide access to court records",
    "url": "https://www.reddit.com/r/india/comments/kqqp0n/indian_kanoon_defends_the_right_to_provide_access/",
    "selftext": "https://preview.redd.it/lwd909d30g961.png?width=1600&amp;format=png&amp;auto=webp&amp;s=cdcae3e13787009de225b06b9051b3ba8303aef0\n\n## Tl;dr\n\nA writ petition filed before the Kerala High Court seeks removal of a court order available on the Indian Kanoon website by claiming a right to be forgotten. In its response to the petition, Indian Kanoon has clarified that such a right cannot be judicially created without a law being enacted by Parliament and emphasized that court records are public documents whose reproduction cannot be prohibited by citing the right to privacy.\n\n## Background\n\nIndian Kanoon is a popular website which provides the general public access to court judgements and legislations in an easily searchable format free of cost. The website celebrated its 13th birthday yesterday and it has democratised access to the law in India. The court orders  which are available on Indian Kanoon are automatically scrapped and reproduced from the websites of the Supreme Court, High Courts, district courts and tribunals. Indian Kanoon does not edit or remove any court orders from its website except for redaction of personally identifiable details of victims of sexual violence. You can read Indian Kanoon's case removal policy [**here.**](https://indiankanoon.org/court_case_online.html)\n\nIn October 2020, a writ petition was filed before the Kerala High Court seeking removal of a court order available on the Indian Kanoon website by claiming a right to be forgotten. The Petitioner has objected to reproduction of the bail order by claiming that he was subsequently acquitted in the case, and therefore, the bail order has become *\"outdated, irrelevant, inadequate and excessive.\"* The Petitioner has also claimed that the bail order incorrectly states the crime number of the case filed against him at the police station.\n\nThe writ petition attempts to draw its legal basis from the landmark 2017 judgement of the Supreme Court in [***K.S. Puttaswamy v. Union of India***](https://indiankanoon.org/doc/91938676/) which recognized a fundamental right to privacy under the Indian Constitution. It also references the 2014 judgement of the Court of Justice of the European Union in [***Google Spain v. AEPD and Mario Costeja Gonzalez***](http://curia.europa.eu/juris/document/document.jsf;jsessionid=0981A654FAC5FD0562DF190F0E33FAF5?text=&amp;docid=152065&amp;pageIndex=0&amp;doclang=EN&amp;mode=lst&amp;dir=&amp;occ=first&amp;part=1&amp;cid=22011009) which held that citizens of member states of the European Union could seek removal of links containing their personal information from search results if such search results are inadequate, irrelevant or no longer relevant or excessive in the light of the time that had elapsed.\n\n## Indian Kanoon's Response\n\nIn its counter-affidavit, Indian Kanoon has explained that there is no legal basis for the reliefs being sought by the Petitioner for the following reasons.\n\nFirst, court records are public documents and in [***R. Rajagopal v. State of Tamil Nadu***](https://indiankanoon.org/doc/501107/), the Supreme Court clearly held that the fundamental right to privacy cannot be used to prevent publication of court records. The Petitioner's assertion that the decision in *R. Rajagopal* requires re-examination after the judgement in *K.S. Puttaswamy*  is misconceived because the latter explicitly refers to and endorses the former in several paragraphs. Therefore, it is settled law that the right to privacy cannot be used to prevent publication of court orders.\n\nSecond, the only situations when the publication of a court order can be prevented are if the court specifically passes such an order itself or if there is a statutory prohibition against publication of certain types of orders. For instance, Section 228A of the Indian Penal Code prohibits disclosure of the identity of victims of sexual violence, and in light of this, Indian Kanoon redacts any personally identifiable details of victims of sexual violence which may be present in court orders published on its website.\n\n## Threat to Freedom of Information\n\nBy seeking judicial recognition of a right to be forgotten which is disconnected from any law enacted by Parliament, this Petition could open a can of worms and undermine freedom of speech and expression and the right to receive information guaranteed under Article 19(1)(a) of the Constitution. The presence of a statutory framework ensures that censorship takes place only for legitimate reasons and with adherence to procedural safeguards. In its judgement in *K.S. Puttaswamy*, the Supreme Court also emphasized that it is the legislature which must create a statutory framework for data protection after carefully balancing the right to privacy with other rights such as free speech.\n\nIn fact, Clause 20 of the Personal Data Protection Bill, 2019 deals with the right to be forgotten but till this issue is properly considered by Parliament, any judicial declaration of a right to be forgotten would be premature. It is important to appreciate that a right to be forgotten cannot be recognized in isolation and it requires the existence of a regulatory authority as well. For instance, the CJEU's judgement in *Google Spain* was based on the 1995 EU Data Protection Directive and relied on the presence of a Data Protection Authority.\n\nIndian Kanoon is being represented in this case by Advocates Santhosh Mathew and Anil Sebastian Pulickel. IFF associated counsels, Vrinda Bhandari, Sanjana Srikumar and Devdutta Mukhopadhyay have also provided drafting assistance to the legal team in this case.\n\n&amp;#x200B;",
    "flair": "Policy/Economy",
    "score": 134,
    "num_comments": 2,
    "created_utc": 1609821526,
    "convurl": "https://b.thumbs.redditmedia.com/nYqKVMJ5QXIg8Sj5Ub_fFk4gejnFhync2tqilR3TjEw.jpg",
    "comments": [
        "Wow so you can do anything and demand to be forgotten. I found cases against a shitty company I had joined which was mentally harassing me and such red flags wouldn't at all be possible if this happened.",
        "So all the cases of women falsely accusing men of rape are legal to share and quote? Interesting."
    ],
    "cleaned_text": "indian kanoon defends right provide access court records tldr writ petition filed kerala high court seeks removal court order available indian kanoon website claiming right forgotten response petition indian kanoon clarified right judicially created without law enacted parliament emphasized court records public documents whose reproduction prohibited citing right privacy background indian kanoon popular website provides general public access court judgements legislations easily searchable format free cost website celebrated th birthday yesterday democratised access law india court orders available indian kanoon automatically scrapped reproduced websites supreme court high courts district courts tribunals indian kanoon edit remove court orders website except redaction personally identifiable details victims sexual violence read indian kanoons case removal policy herehttpsindiankanoonorgcourtcaseonlinehtml october writ petition filed kerala high court seeking removal court order available indian kanoon website claiming right forgotten petitioner objected reproduction bail order claiming subsequently acquitted case therefore bail order become outdated irrelevant inadequate excessive petitioner also claimed bail order incorrectly states crime number case filed police station writ petition attempts draw legal basis landmark judgement supreme court ks puttaswamy v union indiahttpsindiankanoonorgdoc recognized fundamental right privacy indian constitution also references judgement court justice european union google spain v aepd mario costeja gonzalezhttpcuriaeuropaeujurisdocumentdocumentjsfjsessionidafacfddffefaftextampdocidamppageindexampdoclangenampmodelstampdirampoccfirstamppartampcid held citizens member states european union could seek removal links containing personal information search results search results inadequate irrelevant longer relevant excessive light time elapsed indian kanoons response counteraffidavit indian kanoon explained legal basis reliefs sought petitioner following reasons first court records public documents r rajagopal v state tamil naduhttpsindiankanoonorgdoc supreme court clearly held fundamental right privacy used prevent publication court records petitioners assertion decision r rajagopal requires reexamination judgement ks puttaswamy misconceived latter explicitly refers endorses former several paragraphs therefore settled law right privacy used prevent publication court orders second situations publication court order prevented court specifically passes order statutory prohibition publication certain types orders instance section indian penal code prohibits disclosure identity victims sexual violence light indian kanoon redacts personally identifiable details victims sexual violence may present court orders published website threat freedom information seeking judicial recognition right forgotten disconnected law enacted parliament petition could open worms undermine freedom speech expression right receive information guaranteed article constitution presence statutory framework ensures censorship takes place legitimate reasons adherence procedural safeguards judgement ks puttaswamy supreme court also emphasized legislature must create statutory framework data protection carefully balancing right privacy rights free speech fact clause personal data protection bill deals right forgotten till issue properly considered parliament judicial declaration right forgotten would premature important appreciate right forgotten recognized isolation requires existence regulatory authority well instance cjeus judgement google spain based eu data protection directive relied presence data protection authority indian kanoon represented case advocates santhosh mathew anil sebastian pulickel iff associated counsels vrinda bhandari sanjana srikumar devdutta mukhopadhyay also provided drafting assistance legal team case ampxb ",
    "cleaned_title": "indian kanoon defends right provide access court records",
    "cleaned_selftext": "tldr writ petition filed kerala high court seeks removal court order available indian kanoon website claiming right forgotten response petition indian kanoon clarified right judicially created without law enacted parliament emphasized court records public documents whose reproduction prohibited citing right privacy background indian kanoon popular website provides general public access court judgements legislations easily searchable format free cost website celebrated th birthday yesterday democratised access law india court orders available indian kanoon automatically scrapped reproduced websites supreme court high courts district courts tribunals indian kanoon edit remove court orders website except redaction personally identifiable details victims sexual violence read indian kanoons case removal policy herehttpsindiankanoonorgcourtcaseonlinehtml october writ petition filed kerala high court seeking removal court order available indian kanoon website claiming right forgotten petitioner objected reproduction bail order claiming subsequently acquitted case therefore bail order become outdated irrelevant inadequate excessive petitioner also claimed bail order incorrectly states crime number case filed police station writ petition attempts draw legal basis landmark judgement supreme court ks puttaswamy v union indiahttpsindiankanoonorgdoc recognized fundamental right privacy indian constitution also references judgement court justice european union google spain v aepd mario costeja gonzalezhttpcuriaeuropaeujurisdocumentdocumentjsfjsessionidafacfddffefaftextampdocidamppageindexampdoclangenampmodelstampdirampoccfirstamppartampcid held citizens member states european union could seek removal links containing personal information search results search results inadequate irrelevant longer relevant excessive light time elapsed indian kanoons response counteraffidavit indian kanoon explained legal basis reliefs sought petitioner following reasons first court records public documents r rajagopal v state tamil naduhttpsindiankanoonorgdoc supreme court clearly held fundamental right privacy used prevent publication court records petitioners assertion decision r rajagopal requires reexamination judgement ks puttaswamy misconceived latter explicitly refers endorses former several paragraphs therefore settled law right privacy used prevent publication court orders second situations publication court order prevented court specifically passes order statutory prohibition publication certain types orders instance section indian penal code prohibits disclosure identity victims sexual violence light indian kanoon redacts personally identifiable details victims sexual violence may present court orders published website threat freedom information seeking judicial recognition right forgotten disconnected law enacted parliament petition could open worms undermine freedom speech expression right receive information guaranteed article constitution presence statutory framework ensures censorship takes place legitimate reasons adherence procedural safeguards judgement ks puttaswamy supreme court also emphasized legislature must create statutory framework data protection carefully balancing right privacy rights free speech fact clause personal data protection bill deals right forgotten till issue properly considered parliament judicial declaration right forgotten would premature important appreciate right forgotten recognized isolation requires existence regulatory authority well instance cjeus judgement google spain based eu data protection directive relied presence data protection authority indian kanoon represented case advocates santhosh mathew anil sebastian pulickel iff associated counsels vrinda bhandari sanjana srikumar devdutta mukhopadhyay also provided drafting assistance legal team case ampxb",
    "cleaned_comments": "wow anything demand forgotten found cases shitty company joined mentally harassing red flags wouldnt possible happened cases women falsely accusing men rape legal share quote interesting",
    "light_cleaned_title": "Indian Kanoon defends the right to provide access to court records",
    "light_cleaned_selftext": "## Tl;dr A writ petition filed before the Kerala High Court seeks removal of a court order available on the Indian Kanoon website by claiming a right to be forgotten. In its response to the petition, Indian Kanoon has clarified that such a right cannot be judicially created without a law being enacted by Parliament and emphasized that court records are public documents whose reproduction cannot be prohibited by citing the right to privacy. ## Background Indian Kanoon is a popular website which provides the general public access to court judgements and legislations in an easily searchable format free of cost. The website celebrated its 13th birthday yesterday and it has democratised access to the law in India. The court orders which are available on Indian Kanoon are automatically scrapped and reproduced from the websites of the Supreme Court, High Courts, district courts and tribunals. Indian Kanoon does not edit or remove any court orders from its website except for redaction of personally identifiable details of victims of sexual violence. You can read Indian Kanoon's case removal policy [**here.**](https://indiankanoon.org/court_case_online.html) In October 2020, a writ petition was filed before the Kerala High Court seeking removal of a court order available on the Indian Kanoon website by claiming a right to be forgotten. The Petitioner has objected to reproduction of the bail order by claiming that he was subsequently acquitted in the case, and therefore, the bail order has become *\"outdated, irrelevant, inadequate and excessive.\"* The Petitioner has also claimed that the bail order incorrectly states the crime number of the case filed against him at the police station. The writ petition attempts to draw its legal basis from the landmark 2017 judgement of the Supreme Court in [***K.S. Puttaswamy v. Union of India***](https://indiankanoon.org/doc/91938676/) which recognized a fundamental right to privacy under the Indian Constitution. It also references the 2014 judgement of the Court of Justice of the European Union in [***Google Spain v. AEPD and Mario Costeja Gonzalez***](http://curia.europa.eu/juris/document/document.jsf;jsessionid=0981A654FAC5FD0562DF190F0E33FAF5?text=&amp;docid=152065&amp;pageIndex=0&amp;doclang=EN&amp;mode=lst&amp;dir=&amp;occ=first&amp;part=1&amp;cid=22011009) which held that citizens of member states of the European Union could seek removal of links containing their personal information from search results if such search results are inadequate, irrelevant or no longer relevant or excessive in the light of the time that had elapsed. ## Indian Kanoon's Response In its counter-affidavit, Indian Kanoon has explained that there is no legal basis for the reliefs being sought by the Petitioner for the following reasons. First, court records are public documents and in [***R. Rajagopal v. State of Tamil Nadu***](https://indiankanoon.org/doc/501107/), the Supreme Court clearly held that the fundamental right to privacy cannot be used to prevent publication of court records. The Petitioner's assertion that the decision in *R. Rajagopal* requires re-examination after the judgement in *K.S. Puttaswamy* is misconceived because the latter explicitly refers to and endorses the former in several paragraphs. Therefore, it is settled law that the right to privacy cannot be used to prevent publication of court orders. Second, the only situations when the publication of a court order can be prevented are if the court specifically passes such an order itself or if there is a statutory prohibition against publication of certain types of orders. For instance, Section 228A of the Indian Penal Code prohibits disclosure of the identity of victims of sexual violence, and in light of this, Indian Kanoon redacts any personally identifiable details of victims of sexual violence which may be present in court orders published on its website. ## Threat to Freedom of Information By seeking judicial recognition of a right to be forgotten which is disconnected from any law enacted by Parliament, this Petition could open a can of worms and undermine freedom of speech and expression and the right to receive information guaranteed under Article 19(1)(a) of the Constitution. The presence of a statutory framework ensures that censorship takes place only for legitimate reasons and with adherence to procedural safeguards. In its judgement in *K.S. Puttaswamy*, the Supreme Court also emphasized that it is the legislature which must create a statutory framework for data protection after carefully balancing the right to privacy with other rights such as free speech. In fact, Clause 20 of the Personal Data Protection Bill, 2019 deals with the right to be forgotten but till this issue is properly considered by Parliament, any judicial declaration of a right to be forgotten would be premature. It is important to appreciate that a right to be forgotten cannot be recognized in isolation and it requires the existence of a regulatory authority as well. For instance, the CJEU's judgement in *Google Spain* was based on the 1995 EU Data Protection Directive and relied on the presence of a Data Protection Authority. Indian Kanoon is being represented in this case by Advocates Santhosh Mathew and Anil Sebastian Pulickel. IFF associated counsels, Vrinda Bhandari, Sanjana Srikumar and Devdutta Mukhopadhyay have also provided drafting assistance to the legal team in this case.",
    "light_cleaned_comments": "Wow so you can do anything and demand to be forgotten. I found cases against a shitty company I had joined which was mentally harassing me and such red flags wouldn't at all be possible if this happened. So all the cases of women falsely accusing men of rape are legal to share and quote? Interesting."
}