{
    "id": "14rjnwd",
    "title": "[Shaadi.com]Custom shortlist page not accessible anymore , any clues?",
    "url": "https://www.reddit.com/r/india/comments/14rjnwd/shaadicomcustom_shortlist_page_not_accessible/",
    "selftext": " \n\nHi,\n\nI  couldn't find a specific reddit for shaadi.com so I am sorry for  posting it here, if someone is having this similar issue and can help.  I've been using this shaadi since a while but for like 2 weeks I notice  that the index page where I created my own lists has disappeared and is  not accessible anymore.\n\n Page doesn't work anymore even if I try directly  copy-paste  /index page, it's just redirects to default list(all mixed up) but the  custom ones I created are gone.\n\nIt's  really frustrating for me  :( cause I took my time to classify those profiles by creating a custom list. Their technical team  including escalation are useless and have no clue.\n\nHere's the page that's not working anymore [image](https://imgur.com/a/i0GLpNc)",
    "flair": "AskIndia",
    "score": 2,
    "num_comments": 1,
    "created_utc": 1688582994.0,
    "convurl": "https://external-preview.redd.it/k5l3GMmPU7Xs09IPtUW3tpjCcWdllFX_tLfai8LizM0.jpg?auto=webp&v=enabled&s=7dd5fc567c1beb70b1138edaff98172579a2244e",
    "comments": [],
    "cleaned_text": "shaadicomcustom shortlist page accessible anymore clues hi couldnt find specific reddit shaadicom sorry posting someone similar issue help ive using shaadi since like weeks notice index page created lists disappeared accessible anymore page doesnt work anymore even try directly copypaste index page redirects default listall mixed custom ones created gone really frustrating cause took time classify profiles creating custom list technical team including escalation useless clue heres page thats working anymore imagehttpsimgurcomaiglpnc ",
    "cleaned_title": "shaadicomcustom shortlist page accessible anymore clues",
    "cleaned_selftext": "hi couldnt find specific reddit shaadicom sorry posting someone similar issue help ive using shaadi since like weeks notice index page created lists disappeared accessible anymore page doesnt work anymore even try directly copypaste index page redirects default listall mixed custom ones created gone really frustrating cause took time classify profiles creating custom list technical team including escalation useless clue heres page thats working anymore imagehttpsimgurcomaiglpnc",
    "cleaned_comments": "",
    "light_cleaned_title": "[Shaadi.com]Custom shortlist page not accessible anymore , any clues?",
    "light_cleaned_selftext": "Hi, I couldn't find a specific reddit for shaadi.com so I am sorry for posting it here, if someone is having this similar issue and can help. I've been using this shaadi since a while but for like 2 weeks I notice that the index page where I created my own lists has disappeared and is not accessible anymore. Page doesn't work anymore even if I try directly copy-paste /index page, it's just redirects to default list(all mixed up) but the custom ones I created are gone. It's really frustrating for me :( cause I took my time to classify those profiles by creating a custom list. Their technical team including escalation are useless and have no clue. Here's the page that's not working anymore [image](https://imgur.com/a/i0GLpNc)",
    "light_cleaned_comments": ""
}