{
    "id": "14a1a0q",
    "title": "HP Monitor Dead Pixels",
    "url": "https://www.reddit.com/gallery/14a1a0q",
    "selftext": "Bought an HP M22F monitor yesterday after lots of research for work at home. The monitor has apparently dead pixels (which I'm quite sure of) and possible bleeding too. \nHP WhatsApp Support has completely denied the existence of any issue whatsoever. Kindly help me in this issue.\n\nImage 1 - With HDMI cable removed.\nImage 2 - With HDMI cable plugged in.",
    "flair": "AskIndia",
    "score": 6,
    "num_comments": 5,
    "created_utc": 1686832436.0,
    "convurl": "https://i.redd.it/7miou8ave66b1.jpg",
    "comments": [
        "Definitely wouldn't accept if it's supposed to be new.\nThere's a fault in multiple pixels... Not just one.",
        "Thanks. This is my first such screen and the dead pixel test I performed was not in a dark environment over a black screen. Could you list out the issues that you saw?\nI noticed the following:\n\n1. A line of red/pink bright sub-pixels being dead - definitely around 4-5 bigger dots.\n2. Light bleeding that the customer care denied as \"light leak\" through an HP article.\n\nA visit is scheduled for an on-site engineer to inspect. What can I do moving forward?",
        "Can't see any dead ones from the pictures.\nThe one I spotted as dead was actually the mouse cursor icon.\n\nThere's a lot of faulty/defective pixels. That line of pinkish dots. There's much much more than 5-6 pixels that are faulty. \n\nSweet talk the engineer when he comes to inspect. As a consumer, I would definitely not accept this one and ask for a replacement. \n\nMake a note of the serial number of the monitor just in case. You don't want them sending you the same monitor after some repair work.",
        "That was a good heads up! Thanks."
    ],
    "cleaned_text": "hp monitor dead pixels bought hp mf monitor yesterday lots research work home monitor apparently dead pixels im quite sure possible bleeding hp whatsapp support completely denied existence issue whatsoever kindly help issue image hdmi cable removed image hdmi cable plugged ",
    "cleaned_title": "hp monitor dead pixels",
    "cleaned_selftext": "bought hp mf monitor yesterday lots research work home monitor apparently dead pixels im quite sure possible bleeding hp whatsapp support completely denied existence issue whatsoever kindly help issue image hdmi cable removed image hdmi cable plugged",
    "cleaned_comments": "definitely wouldnt accept supposed new theres fault multiple pixels one thanks first screen dead pixel test performed dark environment black screen could list issues saw noticed following line redpink bright subpixels dead definitely around bigger dots light bleeding customer care denied light leak hp article visit scheduled onsite engineer inspect moving forward cant see dead ones pictures one spotted dead actually mouse cursor icon theres lot faultydefective pixels line pinkish dots theres much much pixels faulty sweet talk engineer comes inspect consumer would definitely accept one ask replacement make note serial number monitor case dont want sending monitor repair work good heads thanks",
    "light_cleaned_title": "HP Monitor Dead Pixels",
    "light_cleaned_selftext": "Bought an HP M22F monitor yesterday after lots of research for work at home. The monitor has apparently dead pixels (which I'm quite sure of) and possible bleeding too. HP WhatsApp Support has completely denied the existence of any issue whatsoever. Kindly help me in this issue. Image 1 - With HDMI cable removed. Image 2 - With HDMI cable plugged in.",
    "light_cleaned_comments": "Definitely wouldn't accept if it's supposed to be new. There's a fault in multiple pixels... Not just one. Thanks. This is my first such screen and the dead pixel test I performed was not in a dark environment over a black screen. Could you list out the issues that you saw? I noticed the following: 1. A line of red/pink bright sub-pixels being dead - definitely around 4-5 bigger dots. 2. Light bleeding that the customer care denied as \"light leak\" through an HP article. A visit is scheduled for an on-site engineer to inspect. What can I do moving forward? Can't see any dead ones from the pictures. The one I spotted as dead was actually the mouse cursor icon. There's a lot of faulty/defective pixels. That line of pinkish dots. There's much much more than 5-6 pixels that are faulty. Sweet talk the engineer when he comes to inspect. As a consumer, I would definitely not accept this one and ask for a replacement. Make a note of the serial number of the monitor just in case. You don't want them sending you the same monitor after some repair work. That was a good heads up! Thanks."
}