{
    "id": "13ywacf",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/13ywacf/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&v=enabled&s=26bc0642916d86c8e02a80ae0eb06417f74c209f",
    "flair": "Scheduled",
    "score": 15,
    "num_comments": 12,
    "created_utc": 1685755809.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg",
    "comments": [
        "Currently reading The World for Sale: Money, Power, and the Traders Who Barter the Earth's Resources by Jack Farchy and Javier Blas.\n\nA very eye-opening, albeit depressing read about how commodity traders are doing whatever they want with little to no consequences.",
        "Started on The Shock Doctrine: The Rise of Disaster Capitalism by Naomi Klein\n\nInteresting read but deeply disturbing. The first chapters talk about massacres and disappearances just because some corporations wanted to make some money.\n\nIt also talks about how the torture methods used now, in places like Guantanamo, was based off the unethical research done by the Canadians in the 50s and 60s",
        "This sounds interesting. I might give it a read.",
        "have you read Jason Hickel's books?",
        "I do not generally read non-fiction. Just started it this year and probably will read less than 10 this year. But I will check his books out and add them to my list.",
        "I'm half way through Vajpayee: The Ascent of the Hindu Right by Abhishek Chaoudhary. Must read for everyone interested in politics, especially the opposition leaders. Though it's about events which occured decades ago, it feels very contemporary. Those issues are repeating themselves even now.\n\nYou might hate sanghis or love them, but there's one thing you can't deny: they work hard, and how. Vajpayee kept questioning Nehru, he kept going to parliament. Speech after speech, attack after attack; but he was civil and democratic enough to change his opinion in view of new experiences and facts. Nothing like Modi, who also worked and works hard, by the way, but is not very kind to his opponents.",
        "Completed Malevolent Republic by KS Komireddi. It evenly underscores the accomplishments and failures of each Prime Minister of post-independence India. It's section on Modi takes up more than half the book, and it explains how he has played an active role in worsening almost all major institutions of our country. It's a gutting book, and made me deeply disheartened about the state of this beautiful country. That said, a small part of me knows that we the people of India can never be underestimated. We have shown time and again that we rise to the occasion to defeat tyrants when the time comes. I hope that our collective consciousness will triumph over Modi and Shah's evil designs.",
        "I started with American Kingpin by Nick Bolton. Very interesting so far.",
        "Currently reading Conan Blood of the Serpent by SM Stirling.",
        "That's an interesting book.",
        "The Great War for Civilisation by Robert Fisk, probably the biggest book I ever read, and also one of the most difficult.\n\nThe amount of violence, treachery, and absolute disdain for west Asia and how it is being extend to present day was hard to get through. I haven't read this much heartbreaking painful things even in fiction.",
        "The last book of the Cradle series, Waybound, is already out since today morning! It is available on Kindle Unlimited.\n\nEdit: It was a great ending to the series!"
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "currently reading world sale money power traders barter earths resources jack farchy javier blas eyeopening albeit depressing read commodity traders whatever want little consequences started shock doctrine rise disaster capitalism naomi klein interesting read deeply disturbing first chapters talk massacres disappearances corporations wanted make money also talks torture methods used places like guantanamo based unethical research done canadians sounds interesting might give read read jason hickels books generally read nonfiction started year probably read less year check books add list im half way vajpayee ascent hindu right abhishek chaoudhary must read everyone interested politics especially opposition leaders though events occured decades ago feels contemporary issues repeating even might hate sanghis love theres one thing cant deny work hard vajpayee kept questioning nehru kept going parliament speech speech attack attack civil democratic enough change opinion view new experiences facts nothing like modi also worked works hard way kind opponents completed malevolent republic ks komireddi evenly underscores accomplishments failures prime minister postindependence india section modi takes half book explains played active role worsening almost major institutions country gutting book made deeply disheartened state beautiful country said small part knows people india never underestimated shown time rise occasion defeat tyrants time comes hope collective consciousness triumph modi shahs evil designs started american kingpin nick bolton interesting far currently reading conan blood serpent sm stirling thats interesting book great war civilisation robert fisk probably biggest book ever read also one difficult amount violence treachery absolute disdain west asia extend present day hard get havent read much heartbreaking painful things even fiction last book cradle series waybound already since today morning available kindle unlimited edit great ending series",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Currently reading The World for Sale: Money, Power, and the Traders Who Barter the Earth's Resources by Jack Farchy and Javier Blas. A very eye-opening, albeit depressing read about how commodity traders are doing whatever they want with little to no consequences. Started on The Shock Doctrine: The Rise of Disaster Capitalism by Naomi Klein Interesting read but deeply disturbing. The first chapters talk about massacres and disappearances just because some corporations wanted to make some money. It also talks about how the torture methods used now, in places like Guantanamo, was based off the unethical research done by the Canadians in the 50s and 60s This sounds interesting. I might give it a read. have you read Jason Hickel's books? I do not generally read non-fiction. Just started it this year and probably will read less than 10 this year. But I will check his books out and add them to my list. I'm half way through Vajpayee: The Ascent of the Hindu Right by Abhishek Chaoudhary. Must read for everyone interested in politics, especially the opposition leaders. Though it's about events which occured decades ago, it feels very contemporary. Those issues are repeating themselves even now. You might hate sanghis or love them, but there's one thing you can't deny: they work hard, and how. Vajpayee kept questioning Nehru, he kept going to parliament. Speech after speech, attack after attack; but he was civil and democratic enough to change his opinion in view of new experiences and facts. Nothing like Modi, who also worked and works hard, by the way, but is not very kind to his opponents. Completed Malevolent Republic by KS Komireddi. It evenly underscores the accomplishments and failures of each Prime Minister of post-independence India. It's section on Modi takes up more than half the book, and it explains how he has played an active role in worsening almost all major institutions of our country. It's a gutting book, and made me deeply disheartened about the state of this beautiful country. That said, a small part of me knows that we the people of India can never be underestimated. We have shown time and again that we rise to the occasion to defeat tyrants when the time comes. I hope that our collective consciousness will triumph over Modi and Shah's evil designs. I started with American Kingpin by Nick Bolton. Very interesting so far. Currently reading Conan Blood of the Serpent by SM Stirling. That's an interesting book. The Great War for Civilisation by Robert Fisk, probably the biggest book I ever read, and also one of the most difficult. The amount of violence, treachery, and absolute disdain for west Asia and how it is being extend to present day was hard to get through. I haven't read this much heartbreaking painful things even in fiction. The last book of the Cradle series, Waybound, is already out since today morning! It is available on Kindle Unlimited. Edit: It was a great ending to the series!"
}