{
    "id": "15p1wb9",
    "title": "Canadian here , can anyone tell me who this is ,",
    "url": "https://www.reddit.com/gallery/15p1wb9",
    "selftext": "Apologies for my ignorance, what's this stuff on the bottom",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1691838821.0,
    "convurl": "https://i.redd.it/qh55qyo6xnhb1.jpg",
    "comments": [
        "just ask the indians around you, theres a lot of indians in canada",
        "Yeah I'll be the crazy white dude walking around with a statue asking what it is , did I ask an offense question?",
        "nah, if they get offensive, tell them to go back to india",
        "I love India are you some bot trying to bait me ? Have a good day buddy",
        "nah not bot, just an indian who knows theres a fuckton of indians in canada",
        "Enjoy yourself today, legitimately asking about this statue I have .",
        "Goddess Kali i guess",
        "no idea about the drink",
        "Ohh thanks , interesting thank you !",
        "Welcome",
        "To me it looks like a version of Avalokiteśvara. Buddhist deity.",
        "Looks like rice and vermilion stuck to some glue",
        "Some stupid idol which the idol worshipers(idiotic Hindus )pray and devote their life to",
        "F u",
        "Interesting, my mom left me her , it says goddess of darkness ,death and destruction , but also creation circle of life  or something. Hey thanks! Have a great day",
        "Yeah by that description that's definitely Goddess Kali.",
        "At least we don't worship pedos😂",
        "Yeah pretty much same can be said about your black stone. Which you must visit and Circle around. Pray in its direction. \n\nIdolatory much?",
        "Wtf is wrong with you?",
        "Ignore the turnip.",
        "yes exactly,  must be some ghee from long time",
        "never even stated that though so quite wild to assume that, but theres a good amount of hindus in canada so just ask those also go back to india ahem immigrant/migrant whatever the name you want to call yourself ahem ahem",
        "At least I made it out. People like you will stay in the shithole you were raised in with those opinions.",
        "Mf had to poop in a simple discussion!",
        "Natyarani",
        "Real id se aao BJP IT CELL..",
        "This guy got two brain cells, both fighting for third position.",
        "Godess Durga, we call Maa(mother) Durga",
        "Looks like safe for work goddess kaali without the decapitated head. Don't know what the other thing is.",
        "im so confused, can you give some context for this",
        "From the description in your comment, seems like Kali but I don't see any weapons so I really doubt it. \nMost probably some other deity.",
        "Goddess Kali",
        "At least we don't worship pedophile and a suicide bomber with no body he died b4 his face reveal",
        "Avg terrorist",
        "Maa durga",
        "The goddess has ten different forms as a part of Mahashakti. Some are common like goddess Durga, Goddess Kali, Goddess Laxmi. My guess is this a statue of Goddess Bhairavi. This may be a Buddhist depiction of a goddess too as a part of Buddhism practices tantra and has their own depiction of Mahavidyas (the goddesses).",
        "Avalokitesvara",
        "man if you're gonna troll find a better username",
        "Well we don't shove our religion to someone else by loudspeakers...",
        "Typical pedo worshipers, blah blah blah!!",
        "Haha, you make these joke coz this is the only religion you can joke about.",
        "Yeah, it's my religion, and I can joke about it. You don't own it. \n\nThat's why we're better.",
        "Sorry what's the joke here?",
        "Well said!",
        "Lateer Buddhist, not Hindu, hence the confusion here. \n\nYou're better off asking r/Thailand - they do late Buddhism that is all about political monks, badly imitated Hindu deities, and little about the Middle Path, which is essentially non-deist.",
        "Yup, make fun of other religions and get stoned.",
        "I get stoned while making fun of my own religion. Shaivites who smoke chillums are literally this. So chill.",
        "i think that's poorly prepared teeka because there is rice oil and kumkum someone didn't follow directions right",
        "oh what's the joke you insecure duckling.",
        "Bro go watch Indiana Jones 😂",
        "Adi Shakti",
        "😁Good One.",
        "It's like some people are just wanting to invite radicalism in their religion as they don't like some of the only things that are better in their religion. It has become dick measuring contest at this point... contesting which of them can actually come out as the worst.",
        "And do it with your religion get lynched or beaten to death.",
        "As the dearly departed Hitchens said - they read 1984 thinking it was an instruction manual instead of a cautionary tale.",
        "Are these story's parables ? I've looked this up now, thanks for all the help peoples! It's pretty confusing and extremely interesting.",
        "I don’t really know about the Idol itself but the second Picture has ‘Rosary pea’ (the seeds) in it.\n\nNow as far as I am aware Rosary Pea is mostly associated with Lord Vishnu/Krishna and often used in Religious Practices/rituals.",
        "Have you heard about Google lens? I'd suggest you to check it out if you haven't",
        "Mythology would be more fitting than parables.",
        "She seems to be Goddess Durga - worshipped for power . She usually rides a Lion and each of their 8 to 16 or more hands - depending upon which puran or story , parable to go for has weapons of destruction ( to destroy demon Asura) and weapons of creation  .",
        "Imo it is a statue of dancing Shiva.",
        "That’s Justin Trudeau’s mother",
        "Nope its maa durga dancing shiva natraja pose is different and he doesn't have multiple hands equipping different weapons.",
        "Why adi and not puri?",
        "That’s yo mama!\n\nAlso, the universal mama!😂",
        "Hoping your comment was sarcasm/joke. Plissss man.",
        "Yep I sorry I got broken humour",
        "Hahahaha. Have fun brother!",
        "Brother I definitely tried that ,  it gave me 5 different answers, I'd suggest having a nice day ...",
        "Adi(आदि) means 'first' or 'the beginning'. Aadhi(आधि) means half.",
        "What book can I read to learn about all this , super interesting",
        "That could be Tara maa too ( goddess Tara devi) she is oftenly worshipped in western parts of India . You can know more if you search TRS on YouTube and watch the Rajarshi nandy sir",
        "Bro Sidha bol ki akhay kumar hun.",
        "Ok thank you . Appreciate it :)",
        "This idol has eight arms. Godess Durga is depicted with 8 or 10 arms. So that matches. \n\nNext  identifier is - what does she carry in each of her hands? \n\nWhat she carries is not cast in stone - these are the common ones - chakra, trident, mace, spear, bow and arrow, sword, lotus , conch\n\nI don't see any arms in this picture - I can see the conch and the lotus. \n\nThis is why the most popular answer says it's a buddhist incarnation of Godess Durga. Buddhism has a tantric sect. Godess Durga is a Tantric Godess. \n\nGodess Durga is not worshipped in a domestic altar because of tantric methods of worship. \n\nIn this picture someone bought a tantric buddhist idol of Durga and lit a lamp in front of it.",
        "That is the boss villian of The Black Company.",
        "Takes just about a lifetime to get into all Hindu gods and mythology",
        "I know bro. It was just a stupid joke in a similar sense to [this](https://youtube.com/shorts/hzTvsdxZ7_0?feature=share)",
        "I think it’s the same I saw at Angkor wat\n\nhttps://preview.redd.it/0mlzgyeq0phb1.jpeg?width=3024&format=pjpg&auto=webp&s=5fc6f8ca8568e657969301a853d4d1c7bc833151",
        "I was confused as well , the nice people from r/india did a nice job of answering my questions",
        "I have better pics , I have candles lit around it because it's beautiful",
        "Possibly, also known as Guanyin.",
        "Just some black magic stuff nothing harmful",
        "In West Bengal state of India, we call her Maa Durga (Mother = Maa)",
        "Vajrayan bodhisattava .",
        "A well lit picture would help understand more what he/she holds in hand and that can be very helpful",
        "avg nri",
        "I don't know how to post another pic .",
        "Maa durga",
        "Have a good day , enjoy every moment",
        "Is this some type of inside joke lol",
        "That's hastar",
        "Tum badhiya insaan ho, sorry I judged you .",
        "The closest analogy is ancient Egyptian and Greek gods. Every god has multiple different names and origin story (avatar) depending on period, region and local culture. Hinduism like other polytheistic beliefs have elaborate myths surrounding each god and it is hard even for a Hindu to completely know each and every myth. The 10 mile view from above is that there are major gods and minor gods, this god depicted here *could* be a major goddess. The role of each god in the Hindu pantheon is fluid so nobody can tell you with certainty what is the role of this god particularly. \n\nTLDR: it is very complicated like other polytheistic beliefs to understand each and every god. The consensus seems to be she is avatar or form of a major Hindu goddess mahashakthi.",
        "Yeah I searched it up and I'm even more confused. Is this why the Buddhist meditate , it's a lot to process",
        "Start with Devi by devdutt patnaik . Its a great book .",
        "Thank you , I just opened up to a new world , I'm excited to explore.",
        "no im genuinely saying ive no idea about the drink \n\nPic 1 is of goddess kali",
        "You're welcome. I would recommend you explore hinduism from books rather than asking practitioners. There study of hinduism from western scholars perspective might be less overwhelming to non-practitioner.",
        "Bro decapitated head goddess is Chinnamasta.",
        "Agreed devdutt patnaik have whole series of books related to Indian mythology he also had a tv show in EPIC now I don't exactly remember the language it was presented.",
        "Nahh the Buddhist meditate to take their minds off this convoluted mess, all of it is staggeringly hard to make heads and tails of",
        "This makes the old testament 1+1 lol . Thanks for you're insight, I appreciate it .",
        "Its looks like devil",
        "Guanyin Bodhisattva",
        "Correction! Not myth or mythology it's our history.",
        "wrong sub",
        "Looks like just some black magic stuff going on. Nothing serious /s",
        "It was in hindi . It was called devlok with devdutt pattnaik .",
        "I meant in hand. \n\nChinnamasta with Shiv paintings are raunchy though. 😂",
        "white guy couldn't follow the recipe it seems",
        "The second one is paayasam i think.",
        " No, it's not history; it's knowledge. The dasho maha vidya represents the 10 different knowledges of tantra and each comprises different methods to attain enlightenment, some methods are considered tougher than others. The sages like Shree Ramakrishna, Bamdev, or any sage, so to speak, had followed one of these 10 methods in their whole spiritual journey, so I won't classify it as either history or mythology, but just as knowledge, methods, manuals, or whatever fits this particular basis. Now the question is whether the methods are authentic or not. I don't have any proof except to refer to the sages and rishis like Shree Ramakrishna, Vivekananda, Vamdev, Ramprasad, etc.",
        "While you are not wrong that Shiva is the God of Dance (Nataraaj), he is a primordial God of many attributes, and many of his attributes like his beauty and love of art are described as very graceful and feminine. \"Bhairavi\" is the female embodiment of \"Bhairav.\"  \n\nIn Hindu mythology, Shiva is often genderfluid because he came into being before Brahma even began creating the universe. As such, even though Shiva embodies strong masculine aspects and is a symbol of masculine fertility, he himself is not of either gender because he came into being before the concept of gender was created.  \n\nSo you are not wrong: this is indeed a statue of dancing Shiva, represented as Bhairavi. Just as a statue of Krishna is also a statue of warrior Vishnu.",
        "Not the western but the eastern part of India.",
        "> Not myth or mythology it's our history.\n\nCorrection! it's not history it's definitely mythology and folklore\n\nWords have meanings",
        "Goddess Kali, derived from word Kaal . Kaali symbolises Time as a force of universe",
        "Exactly! Every religion, and society likes to call myths history. There are several [books](https://books.google.com/books?id=CaIUAAAAQBAJ) written on this very topic. Goes to show how blinded are by our own stories.",
        "Lol this comment wouldn't be out of place in a Douglas Adams book",
        "Try giving this goddess food as offering aka Bhog, everyday.",
        "I would love if you give a explanation when downvoting.",
        "You've just stumbled upon an ancient Canadian deity - the Goddess of Maple Syrup! 🍁🥞",
        "First Pic - Hindu Goddess\nSecond Pic - Ghee, vermillion, rice and moong beans (Materials used for worshipping or arti/pooja)",
        "Lord \"SHIVA \"\n\nUpon Close Observation.... Definitely it's 'Mahakaal'",
        "Sorry bud don't know",
        "This is BUDDHA",
        "🤣🤣",
        "I guess this a previously used idol. So when you place idols in the temple of your home, you do a ritual before placing it. Seems like dried kumkum powder, rice and maybe it was stuck down with industrial glue",
        "Tim",
        "Durga is commonly depicted with three eyes, and commonly is riding a lion. Don't see either of those features here, but that doesn't mean it isn't her",
        "Is this Chris must list YouTube guy?",
        "I will not call it stories as it is an active part of religion or Dharma for some people. It can be called mythology though if you want to give a name. Hindu literature/scripture is huge. There is actually no end if you want to learn in depth. Every single thing has doble and triple underlying meaning. Like the concept of Mahavidya or Goddesses, some may say they are actual deities but for some it is the manifestation of outcome of certain type of human nature, for some different form of energy or shakti. I only know a little. I read about these as the philosophies are very interesting.",
        "There are different sects of Buddhism - keep in mind that they have different ways of understanding the world",
        "In the beginning the universe was made by who knows which god, this has made many people very angry and is widely regarded as a controversial move.",
        "That is not a drink , it's just the bottom part of the idol",
        "#2 Looks like someone made an undercooked omelette to offer the Goddess.",
        "Yes, I agree.",
        "I'm assuming it's the Godsess Annapoorna, a form of goddess Parvati. Annapoorna is the goddess of food and nourishment. We in South India, keep the idol on a small saucer like thing filled with rice.",
        "This is Goddess Durga who has different avatars like in Kali etc.",
        "There are also Family Clan deities (this is how that often mentioned figure of India having like 3 Million or was it 33 Million Gods comes from, no one knows exactly how many there are).\n\n\nBasically nearly every Indian has (had for those who converted to another religion) a Family God (that can be from among the Major God's or it's Avatars but often isn't either). \n\nBut many Indians (depending on class, urban-rural, generational dynamic) don't even know their own Family/Clan dieties. And most if not basically super majority of these are undocumented so there's no Wikipedia pages, heck they likely won't even be known to other Indians in other parts of the same State, let alone region of India.\n\nThis is South Asia's memetic (original meaning) contribution to human species. Only peer South Asia would have is entire Africa as whole. No other society has a quicker dynamic to creating God's than South Asia/India.\n\nEven Mahatma Gandhi is an example of this, that's not his real name, he just got semi-deified. Give it another century or so it could be more than just Semi.",
        "idk but that feel like lord Vishnu.\n(Hardcore Hindu)",
        "To me it seems like a non-classical form of Nataraja, or possibly Shiva in one of his \"Nrittamurti\" or dancing forms. However, the figure certainly has some Buddhist iconographical elements—seemingly from Hevajra, but I could be wrong. \nThe only iconographical elements I can spot are the khatvanga, vajra, sutra, the halo of fire, legs in the araimandi pose, and a fruit that's possibly shreephal or a pomegranate. \nIt's a really interesting sculpture, and I'm sure that a clearer image would make it easier to unpack its iconography.",
        "If I'm not wrong I'm pretty sure that is the destroyer of worlds Shiva himself",
        "Yes I don't think it is Durga, but maybe it was made by someone non-Hindu",
        "You should give a read to devi bhagavatam or devi mahatmya.\n\nAlso,if you are a convert/trying to practice Hinduism/please do naam jaap(chanting the name of lord), whatever deity you believe in.\n\nAt last,if you are trying to learn about my religion,please definitely read these 3 books:-\n\nRamayana, Mahabharata (not a religious scripture, but you will enjoy it's story definitely) and bhagvat geeta(not to forget mentioning that every diety has also it's geeta such as Shiva geeta,Parvati geeta etc.)",
        "Might be,  mother of hastar",
        "Hinduism is an amoral, perverse, and degenerate religion. Once you see it, you can't unsee it. OP, I highly encourage you to research it to better appreciate your own Western heritage. Start with the book \"Mysticism and morality\" by Arthur Danto. He was an analytical philosopher best known for his theories on art, and he did a fantastic job picking apart the worldview of Hinduism, as well it's very questionable ethical framework. RIP Danto (2013).",
        "Nah bro, no trishul",
        "Can u send a normal picture, cos most of the details are not clear due to darkness and picture quality\n\nLooks like ma Durga or kali (cos there is a skull on one hand)",
        "Hinduism is a woven set of cultures, practices and religion from multiple regionswhich makes it very difficult to know the complete idea of each and every practice.   \n\n\nA female goddess holding a unblommed lotus, skull, conch and weapons? She is more like a offshoot of a Kali Deity although in a buddhist form.   \n\n\nBuddhism is an mixed offshoot from Hinduism, it incorporates the practices of Far-eastern religions/cultures hence you will find a lot of things similar, for example : meditation. In both cultures meditation acts as a medium for transcendence, Detachment, Enlightenment etc but Buddhism is more like Hindusim without the woven tribal practices (Which is what Siddhartha Gautama wanted to renounce and found barbaric).\n\nLong story short: Its a far-eastern way of depiction of a a goddess who is an offshoot of Kali. What it defines: Motherly figure. I would put it in line of China/Nepal or a wild guess at Thailand. I may be wrong of the Land of Origin.  \n\n\nFeel free to correct me, I find all this very interesting!",
        "Google Sinbad vs Kali. Good scrap!",
        "Why'd you look at her bottom",
        "Hi op. Fellow non-Indian & non Hindu here.. [This here video](https://youtu.be/czN0fzK1LVI) might be of interest. India and Hinduism are amazingly immersive if you’re interested in them. I can only speak from my outsider perspective but I have travelled the country for many years and her religion is as vast and diverse as the country and people themselves. \n\n    It was the British Empire as I understand it , for the sake of classifying the spoils in its plunder-house, who tried to ringfence it as a single spiritual philosophy (“the religion of the Hindoo”) but that didn’t end too well lol. If you think it’ll be something you might enjoy maybe research and practice a little [basic yoga](https://www.youtube.com/live/Ds9-mtL6Bdo?feature=share) You might find places like [Varanasi](https://youtu.be/cxBuiWE5OsI) very interesting too. I’m heading out for trip number 12 in a few days!",
        "Bhadrakali I believe",
        "Where did you find/buy it? Did someone give it to you?",
        "Okay \n\nHope that made you feel better.",
        "Text me on tg - onelifeonelegacy, I will share you complete material to understand hindusim, it's quite interesting and logical once you start reading. You can easily understand everything and nothing is complicated as these other people in comment section says.",
        "how many gods do you have?",
        "Stinky",
        "Hinduism isn't an Abrahamic religion it's more like combined collection of different faiths and beliefs in india every clan,family,region,caste has different beliefs and over the years more beliefs are being added about same deity but afaik this is a statue of ma durga",
        "If you are atheist then ok but if not then don't call it mythology",
        "The deity is shown in abhaya mudra I guess",
        "Thanks for not answering the question.",
        "It is Vishnu, The Hindu God.",
        "Oh just stfu.",
        "33 million is a little bit too much. I guess you were talking about \"33 koti\" Gods and Goddesses we hear so frequently. But here 'koti' means 'types of' not 'crore'.",
        "Get lost bitch. No one's giving out bones here. Drool somewhere else",
        "Happens when you are inconsistent about the stories you tell across a millennia.",
        "The Dude from overwatch",
        "In our family we have a tradition of worshipping Devi Durga with 18 arms. But your probably correct it does seems like a Buddhist incarnation.",
        "Dude.  Studying comparative religions is awesome.  Regardless of your background, learning about other faiths is eye-opening.  There are Catholic experts on Buddhism, atheists teaching biblical history, christians who are experts in islam.  None of them are weak-minded snowflakes whose own beliefs wither in the light of day",
        "fck im blind",
        "Oh yeah I didnt notice. My bad , sry",
        "That's Avalokeshwara bodhisattva",
        "Cancel God on social media ?",
        "Envisaged by shamans of yore. You might identify it as paganism.",
        "It is beautiful! Where did you find it?",
        "In any case don’t call it a mythology 🤷‍♀️",
        "I can’t find any better matching term to describe different versions of religious epics, folklore and gods.",
        "Idk bro argue kya hi krun inseh",
        "You should ask in Indonesian or Thailand subs. You may find the exact answer there. It might be associated with Balinese hinduism or Buddhism.",
        "It's an whole story,if you want, I can tell you.",
        "Devi",
        "/u/Better-Mud-6023 is a spammer!  **Do not click any links they share or reply to**.  Please downvote their comment and click the `report` button, selecting `Spam` then `Harmful bots`.  \n\nWith enough reports, the reddit algorithm will suspend this spammer.",
        "A lot of people in this comment section have given the wrong answers.",
        "Bodhisattva Tara Devi",
        "Not able to find a better term and having no interest in finding out more about your culture does not imply you would reduce it down to calling it mythical.",
        "You were free to help out finding another term but you  just didn’t.",
        "I am fine to call it my culture/religion. But not a myth.\nAnd I would rather be more interested in finding out why it is so at the first place rather than disregarding it completely :)",
        "Only one disregarding is you.",
        "Well, I would rather be amazed by finding out how a tale with so many available historic evidences spanning regions would have been built up. Must be an interesting thing to explore. Hence for now, I don’t think it I would reduce it down to a term like that, neither I need to explain who is disregarding what.",
        "The wide spread and diversity is truely amazing."
    ],
    "cleaned_text": "canadian anyone tell apologies ignorance whats stuff bottom ",
    "cleaned_title": "canadian anyone tell",
    "cleaned_selftext": "apologies ignorance whats stuff bottom",
    "cleaned_comments": "ask indians around theres lot indians canada yeah ill crazy white dude walking around statue asking ask offense question nah get offensive tell go back india love india bot trying bait good day buddy nah bot indian knows theres fuckton indians canada enjoy today legitimately asking statue goddess kali guess idea drink ohh thanks interesting thank welcome looks like version avalokitevara buddhist deity looks like rice vermilion stuck glue stupid idol idol worshipersidiotic hindus pray devote life f u interesting mom left says goddess darkness death destruction also creation circle life something hey thanks great day yeah description thats definitely goddess kali least dont worship pedos yeah pretty much said black stone must visit circle around pray direction idolatory much wtf wrong ignore turnip yes exactly must ghee long time never even stated though quite wild assume theres good amount hindus canada ask also go back india ahem immigrantmigrant whatever name want call ahem ahem least made people like stay shithole raised opinions mf poop simple discussion natyarani real id se aao bjp cell guy got two brain cells fighting third position godess durga call maamother durga looks like safe work goddess kaali without decapitated head dont know thing im confused give context description comment seems like kali dont see weapons really doubt probably deity goddess kali least dont worship pedophile suicide bomber body died b face reveal avg terrorist maa durga goddess ten different forms part mahashakti common like goddess durga goddess kali goddess laxmi guess statue goddess bhairavi may buddhist depiction goddess part buddhism practices tantra depiction mahavidyas goddesses avalokitesvara man youre gon na troll find better username well dont shove religion someone else loudspeakers typical pedo worshipers blah blah blah haha make joke coz religion joke yeah religion joke dont thats better sorry whats joke well said lateer buddhist hindu hence confusion youre better asking rthailand late buddhism political monks badly imitated hindu deities little middle path essentially nondeist yup make fun religions get stoned get stoned making fun religion shaivites smoke chillums literally chill think thats poorly prepared teeka rice oil kumkum someone didnt follow directions right oh whats joke insecure duckling bro go watch indiana jones adi shakti good one like people wanting invite radicalism religion dont like things better religion become dick measuring contest point contesting actually come worst religion get lynched beaten death dearly departed hitchens said read thinking instruction manual instead cautionary tale storys parables ive looked thanks help peoples pretty confusing extremely interesting dont really know idol second picture rosary pea seeds far aware rosary pea mostly associated lord vishnukrishna often used religious practicesrituals heard google lens id suggest check havent mythology would fitting parables seems goddess durga worshipped power usually rides lion hands depending upon puran story parable go weapons destruction destroy demon asura weapons creation imo statue dancing shiva thats justin trudeaus mother nope maa durga dancing shiva natraja pose different doesnt multiple hands equipping different weapons adi puri thats yo mama also universal mama hoping comment sarcasmjoke plissss man yep sorry got broken humour hahahaha fun brother brother definitely tried gave different answers id suggest nice day adi means first beginning aadhi means half book read learn super interesting could tara maa goddess tara devi oftenly worshipped western parts india know search trs youtube watch rajarshi nandy sir bro sidha bol ki akhay kumar hun ok thank appreciate idol eight arms godess durga depicted arms matches next identifier carry hands carries cast stone common ones chakra trident mace spear bow arrow sword lotus conch dont see arms picture see conch lotus popular answer says buddhist incarnation godess durga buddhism tantric sect godess durga tantric godess godess durga worshipped domestic altar tantric methods worship picture someone bought tantric buddhist idol durga lit lamp front boss villian black company takes lifetime get hindu gods mythology know bro stupid joke similar sense thishttpsyoutubecomshortshztvsdxzfeatureshare think saw angkor wat confused well nice people rindia nice job answering questions better pics candles lit around beautiful possibly also known guanyin black magic stuff nothing harmful west bengal state india call maa durga mother maa vajrayan bodhisattava well lit picture would help understand heshe holds hand helpful avg nri dont know post another pic maa durga good day enjoy every moment type inside joke lol thats hastar tum badhiya insaan ho sorry judged closest analogy ancient egyptian greek gods every god multiple different names origin story avatar depending period region local culture hinduism like polytheistic beliefs elaborate myths surrounding god hard even hindu completely know every myth mile view major gods minor gods god depicted could major goddess role god hindu pantheon fluid nobody tell certainty role god particularly tldr complicated like polytheistic beliefs understand every god consensus seems avatar form major hindu goddess mahashakthi yeah searched im even confused buddhist meditate lot process start devi devdutt patnaik great book thank opened new world im excited explore im genuinely saying ive idea drink pic goddess kali youre welcome would recommend explore hinduism books rather asking practitioners study hinduism western scholars perspective might less overwhelming nonpractitioner bro decapitated head goddess chinnamasta agreed devdutt patnaik whole series books related indian mythology also tv show epic dont exactly remember language presented nahh buddhist meditate take minds convoluted mess staggeringly hard make heads tails makes old testament lol thanks youre insight appreciate looks like devil guanyin bodhisattva correction myth mythology history wrong sub looks like black magic stuff going nothing serious hindi called devlok devdutt pattnaik meant hand chinnamasta shiv paintings raunchy though white guy couldnt follow recipe seems second one paayasam think history knowledge dasho maha vidya represents different knowledges tantra comprises different methods attain enlightenment methods considered tougher others sages like shree ramakrishna bamdev sage speak followed one methods whole spiritual journey wont classify either history mythology knowledge methods manuals whatever fits particular basis question whether methods authentic dont proof except refer sages rishis like shree ramakrishna vivekananda vamdev ramprasad etc wrong shiva god dance nataraaj primordial god many attributes many attributes like beauty love art described graceful feminine bhairavi female embodiment bhairav hindu mythology shiva often genderfluid came brahma even began creating universe even though shiva embodies strong masculine aspects symbol masculine fertility either gender came concept gender created wrong indeed statue dancing shiva represented bhairavi statue krishna also statue warrior vishnu western eastern part india myth mythology history correction history definitely mythology folklore words meanings goddess kali derived word kaal kaali symbolises time force universe exactly every religion society likes call myths history several bookshttpsbooksgooglecombooksidcaiuaaaaqbaj written topic goes show blinded stories lol comment wouldnt place douglas adams book try giving goddess food offering aka bhog everyday would love give explanation downvoting youve stumbled upon ancient canadian deity goddess maple syrup first pic hindu goddess second pic ghee vermillion rice moong beans materials used worshipping artipooja lord shiva upon close observation definitely mahakaal sorry bud dont know buddha guess previously used idol place idols temple home ritual placing seems like dried kumkum powder rice maybe stuck industrial glue tim durga commonly depicted three eyes commonly riding lion dont see either features doesnt mean isnt chris must list youtube guy call stories active part religion dharma people called mythology though want give name hindu literaturescripture huge actually end want learn depth every single thing doble triple underlying meaning like concept mahavidya goddesses may say actual deities manifestation outcome certain type human nature different form energy shakti know little read philosophies interesting different sects buddhism keep mind different ways understanding world beginning universe made knows god made many people angry widely regarded controversial move drink bottom part idol looks like someone made undercooked omelette offer goddess yes agree im assuming godsess annapoorna form goddess parvati annapoorna goddess food nourishment south india keep idol small saucer like thing filled rice goddess durga different avatars like kali etc also family clan deities often mentioned figure india like million million gods comes one knows exactly many basically nearly every indian converted another religion family god among major gods avatars often isnt either many indians depending class urbanrural generational dynamic dont even know familyclan dieties basically super majority undocumented theres wikipedia pages heck likely wont even known indians parts state let alone region india south asias memetic original meaning contribution human species peer south asia would entire africa whole society quicker dynamic creating gods south asiaindia even mahatma gandhi example thats real name got semideified give another century could semi idk feel like lord vishnu hardcore hindu seems like nonclassical form nataraja possibly shiva one nrittamurti dancing forms however figure certainly buddhist iconographical elementsseemingly hevajra could wrong iconographical elements spot khatvanga vajra sutra halo fire legs araimandi pose fruit thats possibly shreephal pomegranate really interesting sculpture im sure clearer image would make easier unpack iconography im wrong im pretty sure destroyer worlds shiva yes dont think durga maybe made someone nonhindu give read devi bhagavatam devi mahatmya alsoif converttrying practice hinduismplease naam jaapchanting name lord whatever deity believe lastif trying learn religionplease definitely read books ramayana mahabharata religious scripture enjoy story definitely bhagvat geetanot forget mentioning every diety also geeta shiva geetaparvati geeta etc might mother hastar hinduism amoral perverse degenerate religion see cant unsee op highly encourage research better appreciate western heritage start book mysticism morality arthur danto analytical philosopher best known theories art fantastic job picking apart worldview hinduism well questionable ethical framework rip danto nah bro trishul u send normal picture cos details clear due darkness picture quality looks like durga kali cos skull one hand hinduism woven set cultures practices religion multiple regionswhich makes difficult know complete idea every practice female goddess holding unblommed lotus skull conch weapons like offshoot kali deity although buddhist form buddhism mixed offshoot hinduism incorporates practices fareastern religionscultures hence find lot things similar example meditation cultures meditation acts medium transcendence detachment enlightenment etc buddhism like hindusim without woven tribal practices siddhartha gautama wanted renounce found barbaric long story short fareastern way depiction goddess offshoot kali defines motherly figure would put line chinanepal wild guess thailand may wrong land origin feel free correct find interesting google sinbad vs kali good scrap whyd look bottom hi op fellow nonindian non hindu videohttpsyoutubecznfzklvi might interest india hinduism amazingly immersive youre interested speak outsider perspective travelled country many years religion vast diverse country people british empire understand sake classifying spoils plunderhouse tried ringfence single spiritual philosophy religion hindoo didnt end well lol think itll something might enjoy maybe research practice little basic yogahttpswwwyoutubecomlivedsmtlbdofeatureshare might find places like varanasihttpsyoutubecxbuiweosi interesting im heading trip number days bhadrakali believe findbuy someone give okay hope made feel better text tg onelifeonelegacy share complete material understand hindusim quite interesting logical start reading easily understand everything nothing complicated people comment section says many gods stinky hinduism isnt abrahamic religion like combined collection different faiths beliefs india every clanfamilyregioncaste different beliefs years beliefs added deity afaik statue durga atheist ok dont call mythology deity shown abhaya mudra guess thanks answering question vishnu hindu god oh stfu million little bit much guess talking koti gods goddesses hear frequently koti means types crore get lost bitch ones giving bones drool somewhere else happens inconsistent stories tell across millennia dude overwatch family tradition worshipping devi durga arms probably correct seems like buddhist incarnation dude studying comparative religions awesome regardless background learning faiths eyeopening catholic experts buddhism atheists teaching biblical history christians experts islam none weakminded snowflakes whose beliefs wither light day fck im blind oh yeah didnt notice bad sry thats avalokeshwara bodhisattva cancel god social media envisaged shamans yore might identify paganism beautiful find case dont call mythology cant find better matching term describe different versions religious epics folklore gods idk bro argue kya hi krun inseh ask indonesian thailand subs may find exact answer might associated balinese hinduism buddhism whole storyif want tell devi ubettermud spammer click links share reply please downvote comment click report button selecting spam harmful bots enough reports reddit algorithm suspend spammer lot people comment section given wrong answers bodhisattva tara devi able find better term interest finding culture imply would reduce calling mythical free help finding another term didnt fine call culturereligion myth would rather interested finding first place rather disregarding completely one disregarding well would rather amazed finding tale many available historic evidences spanning regions would built must interesting thing explore hence dont think would reduce term like neither need explain disregarding wide spread diversity truely amazing",
    "light_cleaned_title": "Canadian here , can anyone tell me who this is ,",
    "light_cleaned_selftext": "Apologies for my ignorance, what's this stuff on the bottom",
    "light_cleaned_comments": "just ask the indians around you, theres a lot of indians in canada Yeah I'll be the crazy white dude walking around with a statue asking what it is , did I ask an offense question? nah, if they get offensive, tell them to go back to india I love India are you some bot trying to bait me ? Have a good day buddy nah not bot, just an indian who knows theres a fuckton of indians in canada Enjoy yourself today, legitimately asking about this statue I have . Goddess Kali i guess no idea about the drink Ohh thanks , interesting thank you ! Welcome To me it looks like a version of Avalokiteśvara. Buddhist deity. Looks like rice and vermilion stuck to some glue Some stupid idol which the idol worshipers(idiotic Hindus )pray and devote their life to F u Interesting, my mom left me her , it says goddess of darkness ,death and destruction , but also creation circle of life or something. Hey thanks! Have a great day Yeah by that description that's definitely Goddess Kali. At least we don't worship pedos😂 Yeah pretty much same can be said about your black stone. Which you must visit and Circle around. Pray in its direction. Idolatory much? Wtf is wrong with you? Ignore the turnip. yes exactly, must be some ghee from long time never even stated that though so quite wild to assume that, but theres a good amount of hindus in canada so just ask those also go back to india ahem immigrant/migrant whatever the name you want to call yourself ahem ahem At least I made it out. People like you will stay in the shithole you were raised in with those opinions. Mf had to poop in a simple discussion! Natyarani Real id se aao BJP IT CELL.. This guy got two brain cells, both fighting for third position. Godess Durga, we call Maa(mother) Durga Looks like safe for work goddess kaali without the decapitated head. Don't know what the other thing is. im so confused, can you give some context for this From the description in your comment, seems like Kali but I don't see any weapons so I really doubt it. Most probably some other deity. Goddess Kali At least we don't worship pedophile and a suicide bomber with no body he died b4 his face reveal Avg terrorist Maa durga The goddess has ten different forms as a part of Mahashakti. Some are common like goddess Durga, Goddess Kali, Goddess Laxmi. My guess is this a statue of Goddess Bhairavi. This may be a Buddhist depiction of a goddess too as a part of Buddhism practices tantra and has their own depiction of Mahavidyas (the goddesses). Avalokitesvara man if you're gonna troll find a better username Well we don't shove our religion to someone else by loudspeakers... Typical pedo worshipers, blah blah blah!! Haha, you make these joke coz this is the only religion you can joke about. Yeah, it's my religion, and I can joke about it. You don't own it. That's why we're better. Sorry what's the joke here? Well said! Lateer Buddhist, not Hindu, hence the confusion here. You're better off asking r/Thailand - they do late Buddhism that is all about political monks, badly imitated Hindu deities, and little about the Middle Path, which is essentially non-deist. Yup, make fun of other religions and get stoned. I get stoned while making fun of my own religion. Shaivites who smoke chillums are literally this. So chill. i think that's poorly prepared teeka because there is rice oil and kumkum someone didn't follow directions right oh what's the joke you insecure duckling. Bro go watch Indiana Jones 😂 Adi Shakti 😁Good One. It's like some people are just wanting to invite radicalism in their religion as they don't like some of the only things that are better in their religion. It has become dick measuring contest at this point... contesting which of them can actually come out as the worst. And do it with your religion get lynched or beaten to death. As the dearly departed Hitchens said - they read 1984 thinking it was an instruction manual instead of a cautionary tale. Are these story's parables ? I've looked this up now, thanks for all the help peoples! It's pretty confusing and extremely interesting. I don’t really know about the Idol itself but the second Picture has ‘Rosary pea’ (the seeds) in it. Now as far as I am aware Rosary Pea is mostly associated with Lord Vishnu/Krishna and often used in Religious Practices/rituals. Have you heard about Google lens? I'd suggest you to check it out if you haven't Mythology would be more fitting than parables. She seems to be Goddess Durga - worshipped for power . She usually rides a Lion and each of their 8 to 16 or more hands - depending upon which puran or story , parable to go for has weapons of destruction ( to destroy demon Asura) and weapons of creation . Imo it is a statue of dancing Shiva. That’s Justin Trudeau’s mother Nope its maa durga dancing shiva natraja pose is different and he doesn't have multiple hands equipping different weapons. Why adi and not puri? That’s yo mama! Also, the universal mama!😂 Hoping your comment was sarcasm/joke. Plissss man. Yep I sorry I got broken humour Hahahaha. Have fun brother! Brother I definitely tried that , it gave me 5 different answers, I'd suggest having a nice day ... Adi(आदि) means 'first' or 'the beginning'. Aadhi(आधि) means half. What book can I read to learn about all this , super interesting That could be Tara maa too ( goddess Tara devi) she is oftenly worshipped in western parts of India . You can know more if you search TRS on YouTube and watch the Rajarshi nandy sir Bro Sidha bol ki akhay kumar hun. Ok thank you . Appreciate it :) This idol has eight arms. Godess Durga is depicted with 8 or 10 arms. So that matches. Next identifier is - what does she carry in each of her hands? What she carries is not cast in stone - these are the common ones - chakra, trident, mace, spear, bow and arrow, sword, lotus , conch I don't see any arms in this picture - I can see the conch and the lotus. This is why the most popular answer says it's a buddhist incarnation of Godess Durga. Buddhism has a tantric sect. Godess Durga is a Tantric Godess. Godess Durga is not worshipped in a domestic altar because of tantric methods of worship. In this picture someone bought a tantric buddhist idol of Durga and lit a lamp in front of it. That is the boss villian of The Black Company. Takes just about a lifetime to get into all Hindu gods and mythology I know bro. It was just a stupid joke in a similar sense to [this](https://youtube.com/shorts/hzTvsdxZ7_0?feature=share) I think it’s the same I saw at Angkor wat I was confused as well , the nice people from r/india did a nice job of answering my questions I have better pics , I have candles lit around it because it's beautiful Possibly, also known as Guanyin. Just some black magic stuff nothing harmful In West Bengal state of India, we call her Maa Durga (Mother = Maa) Vajrayan bodhisattava . A well lit picture would help understand more what he/she holds in hand and that can be very helpful avg nri I don't know how to post another pic . Maa durga Have a good day , enjoy every moment Is this some type of inside joke lol That's hastar Tum badhiya insaan ho, sorry I judged you . The closest analogy is ancient Egyptian and Greek gods. Every god has multiple different names and origin story (avatar) depending on period, region and local culture. Hinduism like other polytheistic beliefs have elaborate myths surrounding each god and it is hard even for a Hindu to completely know each and every myth. The 10 mile view from above is that there are major gods and minor gods, this god depicted here *could* be a major goddess. The role of each god in the Hindu pantheon is fluid so nobody can tell you with certainty what is the role of this god particularly. TLDR: it is very complicated like other polytheistic beliefs to understand each and every god. The consensus seems to be she is avatar or form of a major Hindu goddess mahashakthi. Yeah I searched it up and I'm even more confused. Is this why the Buddhist meditate , it's a lot to process Start with Devi by devdutt patnaik . Its a great book . Thank you , I just opened up to a new world , I'm excited to explore. no im genuinely saying ive no idea about the drink Pic 1 is of goddess kali You're welcome. I would recommend you explore hinduism from books rather than asking practitioners. There study of hinduism from western scholars perspective might be less overwhelming to non-practitioner. Bro decapitated head goddess is Chinnamasta. Agreed devdutt patnaik have whole series of books related to Indian mythology he also had a tv show in EPIC now I don't exactly remember the language it was presented. Nahh the Buddhist meditate to take their minds off this convoluted mess, all of it is staggeringly hard to make heads and tails of This makes the old testament 1+1 lol . Thanks for you're insight, I appreciate it . Its looks like devil Guanyin Bodhisattva Correction! Not myth or mythology it's our history. wrong sub Looks like just some black magic stuff going on. Nothing serious /s It was in hindi . It was called devlok with devdutt pattnaik . I meant in hand. Chinnamasta with Shiv paintings are raunchy though. 😂 white guy couldn't follow the recipe it seems The second one is paayasam i think. No, it's not history; it's knowledge. The dasho maha vidya represents the 10 different knowledges of tantra and each comprises different methods to attain enlightenment, some methods are considered tougher than others. The sages like Shree Ramakrishna, Bamdev, or any sage, so to speak, had followed one of these 10 methods in their whole spiritual journey, so I won't classify it as either history or mythology, but just as knowledge, methods, manuals, or whatever fits this particular basis. Now the question is whether the methods are authentic or not. I don't have any proof except to refer to the sages and rishis like Shree Ramakrishna, Vivekananda, Vamdev, Ramprasad, etc. While you are not wrong that Shiva is the God of Dance (Nataraaj), he is a primordial God of many attributes, and many of his attributes like his beauty and love of art are described as very graceful and feminine. \"Bhairavi\" is the female embodiment of \"Bhairav.\" In Hindu mythology, Shiva is often genderfluid because he came into being before Brahma even began creating the universe. As such, even though Shiva embodies strong masculine aspects and is a symbol of masculine fertility, he himself is not of either gender because he came into being before the concept of gender was created. So you are not wrong: this is indeed a statue of dancing Shiva, represented as Bhairavi. Just as a statue of Krishna is also a statue of warrior Vishnu. Not the western but the eastern part of India. > Not myth or mythology it's our history. Correction! it's not history it's definitely mythology and folklore Words have meanings Goddess Kali, derived from word Kaal . Kaali symbolises Time as a force of universe Exactly! Every religion, and society likes to call myths history. There are several [books](https://books.google.com/books?id=CaIUAAAAQBAJ) written on this very topic. Goes to show how blinded are by our own stories. Lol this comment wouldn't be out of place in a Douglas Adams book Try giving this goddess food as offering aka Bhog, everyday. I would love if you give a explanation when downvoting. You've just stumbled upon an ancient Canadian deity - the Goddess of Maple Syrup! 🍁🥞 First Pic - Hindu Goddess Second Pic - Ghee, vermillion, rice and moong beans (Materials used for worshipping or arti/pooja) Lord \"SHIVA \" Upon Close Observation.... Definitely it's 'Mahakaal' Sorry bud don't know This is BUDDHA 🤣🤣 I guess this a previously used idol. So when you place idols in the temple of your home, you do a ritual before placing it. Seems like dried kumkum powder, rice and maybe it was stuck down with industrial glue Tim Durga is commonly depicted with three eyes, and commonly is riding a lion. Don't see either of those features here, but that doesn't mean it isn't her Is this Chris must list YouTube guy? I will not call it stories as it is an active part of religion or Dharma for some people. It can be called mythology though if you want to give a name. Hindu literature/scripture is huge. There is actually no end if you want to learn in depth. Every single thing has doble and triple underlying meaning. Like the concept of Mahavidya or Goddesses, some may say they are actual deities but for some it is the manifestation of outcome of certain type of human nature, for some different form of energy or shakti. I only know a little. I read about these as the philosophies are very interesting. There are different sects of Buddhism - keep in mind that they have different ways of understanding the world In the beginning the universe was made by who knows which god, this has made many people very angry and is widely regarded as a controversial move. That is not a drink , it's just the bottom part of the idol #2 Looks like someone made an undercooked omelette to offer the Goddess. Yes, I agree. I'm assuming it's the Godsess Annapoorna, a form of goddess Parvati. Annapoorna is the goddess of food and nourishment. We in South India, keep the idol on a small saucer like thing filled with rice. This is Goddess Durga who has different avatars like in Kali etc. There are also Family Clan deities (this is how that often mentioned figure of India having like 3 Million or was it 33 Million Gods comes from, no one knows exactly how many there are). Basically nearly every Indian has (had for those who converted to another religion) a Family God (that can be from among the Major God's or it's Avatars but often isn't either). But many Indians (depending on class, urban-rural, generational dynamic) don't even know their own Family/Clan dieties. And most if not basically super majority of these are undocumented so there's no Wikipedia pages, heck they likely won't even be known to other Indians in other parts of the same State, let alone region of India. This is South Asia's memetic (original meaning) contribution to human species. Only peer South Asia would have is entire Africa as whole. No other society has a quicker dynamic to creating God's than South Asia/India. Even Mahatma Gandhi is an example of this, that's not his real name, he just got semi-deified. Give it another century or so it could be more than just Semi. idk but that feel like lord Vishnu. (Hardcore Hindu) To me it seems like a non-classical form of Nataraja, or possibly Shiva in one of his \"Nrittamurti\" or dancing forms. However, the figure certainly has some Buddhist iconographical elements—seemingly from Hevajra, but I could be wrong. The only iconographical elements I can spot are the khatvanga, vajra, sutra, the halo of fire, legs in the araimandi pose, and a fruit that's possibly shreephal or a pomegranate. It's a really interesting sculpture, and I'm sure that a clearer image would make it easier to unpack its iconography. If I'm not wrong I'm pretty sure that is the destroyer of worlds Shiva himself Yes I don't think it is Durga, but maybe it was made by someone non-Hindu You should give a read to devi bhagavatam or devi mahatmya. Also,if you are a convert/trying to practice Hinduism/please do naam jaap(chanting the name of lord), whatever deity you believe in. At last,if you are trying to learn about my religion,please definitely read these 3 books:- Ramayana, Mahabharata (not a religious scripture, but you will enjoy it's story definitely) and bhagvat geeta(not to forget mentioning that every diety has also it's geeta such as Shiva geeta,Parvati geeta etc.) Might be, mother of hastar Hinduism is an amoral, perverse, and degenerate religion. Once you see it, you can't unsee it. OP, I highly encourage you to research it to better appreciate your own Western heritage. Start with the book \"Mysticism and morality\" by Arthur Danto. He was an analytical philosopher best known for his theories on art, and he did a fantastic job picking apart the worldview of Hinduism, as well it's very questionable ethical framework. RIP Danto (2013). Nah bro, no trishul Can u send a normal picture, cos most of the details are not clear due to darkness and picture quality Looks like ma Durga or kali (cos there is a skull on one hand) Hinduism is a woven set of cultures, practices and religion from multiple regionswhich makes it very difficult to know the complete idea of each and every practice. A female goddess holding a unblommed lotus, skull, conch and weapons? She is more like a offshoot of a Kali Deity although in a buddhist form. Buddhism is an mixed offshoot from Hinduism, it incorporates the practices of Far-eastern religions/cultures hence you will find a lot of things similar, for example : meditation. In both cultures meditation acts as a medium for transcendence, Detachment, Enlightenment etc but Buddhism is more like Hindusim without the woven tribal practices (Which is what Siddhartha Gautama wanted to renounce and found barbaric). Long story short: Its a far-eastern way of depiction of a a goddess who is an offshoot of Kali. What it defines: Motherly figure. I would put it in line of China/Nepal or a wild guess at Thailand. I may be wrong of the Land of Origin. Feel free to correct me, I find all this very interesting! Google Sinbad vs Kali. Good scrap! Why'd you look at her bottom Hi op. Fellow non-Indian & non Hindu here.. [This here video](https://youtu.be/czN0fzK1LVI) might be of interest. India and Hinduism are amazingly immersive if you’re interested in them. I can only speak from my outsider perspective but I have travelled the country for many years and her religion is as vast and diverse as the country and people themselves. It was the British Empire as I understand it , for the sake of classifying the spoils in its plunder-house, who tried to ringfence it as a single spiritual philosophy (“the religion of the Hindoo”) but that didn’t end too well lol. If you think it’ll be something you might enjoy maybe research and practice a little [basic yoga](https://www.youtube.com/live/Ds9-mtL6Bdo?feature=share) You might find places like [Varanasi](https://youtu.be/cxBuiWE5OsI) very interesting too. I’m heading out for trip number 12 in a few days! Bhadrakali I believe Where did you find/buy it? Did someone give it to you? Okay Hope that made you feel better. Text me on tg - onelifeonelegacy, I will share you complete material to understand hindusim, it's quite interesting and logical once you start reading. You can easily understand everything and nothing is complicated as these other people in comment section says. how many gods do you have? Stinky Hinduism isn't an Abrahamic religion it's more like combined collection of different faiths and beliefs in india every clan,family,region,caste has different beliefs and over the years more beliefs are being added about same deity but afaik this is a statue of ma durga If you are atheist then ok but if not then don't call it mythology The deity is shown in abhaya mudra I guess Thanks for not answering the question. It is Vishnu, The Hindu God. Oh just stfu. 33 million is a little bit too much. I guess you were talking about \"33 koti\" Gods and Goddesses we hear so frequently. But here 'koti' means 'types of' not 'crore'. Get lost bitch. No one's giving out bones here. Drool somewhere else Happens when you are inconsistent about the stories you tell across a millennia. The Dude from overwatch In our family we have a tradition of worshipping Devi Durga with 18 arms. But your probably correct it does seems like a Buddhist incarnation. Dude. Studying comparative religions is awesome. Regardless of your background, learning about other faiths is eye-opening. There are Catholic experts on Buddhism, atheists teaching biblical history, christians who are experts in islam. None of them are weak-minded snowflakes whose own beliefs wither in the light of day fck im blind Oh yeah I didnt notice. My bad , sry That's Avalokeshwara bodhisattva Cancel God on social media ? Envisaged by shamans of yore. You might identify it as paganism. It is beautiful! Where did you find it? In any case don’t call it a mythology 🤷‍♀️ I can’t find any better matching term to describe different versions of religious epics, folklore and gods. Idk bro argue kya hi krun inseh You should ask in Indonesian or Thailand subs. You may find the exact answer there. It might be associated with Balinese hinduism or Buddhism. It's an whole story,if you want, I can tell you. Devi /u/Better-Mud-6023 is a spammer! **Do not click any links they share or reply to**. Please downvote their comment and click the `report` button, selecting `Spam` then `Harmful bots`. With enough reports, the reddit algorithm will suspend this spammer. A lot of people in this comment section have given the wrong answers. Bodhisattva Tara Devi Not able to find a better term and having no interest in finding out more about your culture does not imply you would reduce it down to calling it mythical. You were free to help out finding another term but you just didn’t. I am fine to call it my culture/religion. But not a myth. And I would rather be more interested in finding out why it is so at the first place rather than disregarding it completely :) Only one disregarding is you. Well, I would rather be amazed by finding out how a tale with so many available historic evidences spanning regions would have been built up. Must be an interesting thing to explore. Hence for now, I don’t think it I would reduce it down to a term like that, neither I need to explain who is disregarding what. The wide spread and diversity is truely amazing."
}