{
    "id": "1cqlsm8",
    "title": "Integrated commands structure plan looks at Vice CDS, Dy CDS with clear roles",
    "url": "https://indianexpress.com/article/india/integrated-commands-structure-plan-looks-at-vice-cds-dy-cds-with-clear-roles-9324441/",
    "selftext": "Jaipur, Lucknow, Coimbatore likely homes for theatre commands.\n\nReady with the organisational structure for the creation of integrated theatre commands, the Armed Forces are looking at the appointment of a Vice Chief of Defence Staff and a Deputy Chief of Defence Staff.",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 2,
    "created_utc": 1715558544.0,
    "convurl": "https://external-preview.redd.it/BlQZRGIfISMrxuABIkoj_tH4S7Zb2--52yNs48s3eW0.jpg?auto=webp&s=8d3032cd0c211390be37fefbd3572bbce889b0dd",
    "comments": [
        "Nehru and Vallabhbhai Patel went a long way to ensure that the Armed Forces remain under civilian command are unable to fraternize and organize internally in such a way that a group is formed within the Armed Forces that can mount a coup. \n\nAmong other things, it involved strict separation of the three services and internal police, multiple Defence academies and rotation of instructors etc. While many countries that become independent around the same time as India have witnessed military coups, India has never had to face the issue. \n\nTheater commands are absolutely necessary from a strategic point of view to enable local level coordination and preventing friendly fire instances. (India has faced this issue before). But at the same time care must be taken to also have a civilian theatre command. Along with the deployment of the Corps of Military Police under civilian command and not the Defence Theatre Command. Since there have been no Parliamentary debates about this, we have no way of knowing whether such steps have been taken.",
        "Any move from bjp is guaranteed to simulate a presidential scheme. Absolutely catastrophic for our federal structure"
    ],
    "cleaned_text": "integrated commands structure plan looks vice cds dy cds clear roles jaipur lucknow coimbatore likely homes theatre commands ready organisational structure creation integrated theatre commands armed forces looking appointment vice chief defence staff deputy chief defence staff ",
    "cleaned_title": "integrated commands structure plan looks vice cds dy cds clear roles",
    "cleaned_selftext": "jaipur lucknow coimbatore likely homes theatre commands ready organisational structure creation integrated theatre commands armed forces looking appointment vice chief defence staff deputy chief defence staff",
    "cleaned_comments": "nehru vallabhbhai patel went long way ensure armed forces remain civilian command unable fraternize organize internally way group formed within armed forces mount coup among things involved strict separation three services internal police multiple defence academies rotation instructors etc many countries become independent around time india witnessed military coups india never face issue theater commands absolutely necessary strategic point view enable local level coordination preventing friendly fire instances india faced issue time care must taken also civilian theatre command along deployment corps military police civilian command defence theatre command since parliamentary debates way knowing whether steps taken move bjp guaranteed simulate presidential scheme absolutely catastrophic federal structure",
    "light_cleaned_title": "Integrated commands structure plan looks at Vice CDS, Dy CDS with clear roles",
    "light_cleaned_selftext": "Jaipur, Lucknow, Coimbatore likely homes for theatre commands. Ready with the organisational structure for the creation of integrated theatre commands, the Armed Forces are looking at the appointment of a Vice Chief of Defence Staff and a Deputy Chief of Defence Staff.",
    "light_cleaned_comments": "Nehru and Vallabhbhai Patel went a long way to ensure that the Armed Forces remain under civilian command are unable to fraternize and organize internally in such a way that a group is formed within the Armed Forces that can mount a coup. Among other things, it involved strict separation of the three services and internal police, multiple Defence academies and rotation of instructors etc. While many countries that become independent around the same time as India have witnessed military coups, India has never had to face the issue. Theater commands are absolutely necessary from a strategic point of view to enable local level coordination and preventing friendly fire instances. (India has faced this issue before). But at the same time care must be taken to also have a civilian theatre command. Along with the deployment of the Corps of Military Police under civilian command and not the Defence Theatre Command. Since there have been no Parliamentary debates about this, we have no way of knowing whether such steps have been taken. Any move from bjp is guaranteed to simulate a presidential scheme. Absolutely catastrophic for our federal structure"
}