{
    "id": "1cifjqf",
    "title": "From spices to steel to drugs, India's exports are being hammered! Even more worrying is the fact that instead of Increasing our standards, we are campaigning in WTO reduce the food and safety standards including increase of permissible pesticide levels.  Sad!",
    "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/from-spices-to-steel-to-drugs-indias-exports-are-being-hammered/articleshow/109781450.cms",
    "selftext": "India has made a strong pitch at the World Trade Organization (WTO) for the formulation of guidelines to determine default maximum residue limits (MRL) in the absence of international standards. The traces pesticides leave in treated products are called residues and MRL is the highest level of a pesticide residue that is legally tolerated in food or feed. In a recent submission to the WTO, India said that stringent MRLs can be trade-restrictive and act as non-tariff barriers to international trade, disproportionately affecting exporters from developing countries. At present there are no uniform international standards.",
    "flair": "Policy/Economy",
    "score": 38,
    "num_comments": 3,
    "created_utc": 1714656152.0,
    "convurl": "https://external-preview.redd.it/CFoU-LBmm4oFcOJu5SZd6FhgS8HO1NQAX1CRVZwP6RQ.jpg?auto=webp&s=bc2074e9e71df85f53e8e174aefaa39e9ea138a9",
    "comments": [
        "Generally as a culture we have shit-tier standards. Nothing much can be done domestically, but thankfully, the export issue is a problem that will solve itself. If India wants exports, it will have to up its standards, or not export.",
        "Apart from shoet tem measures, a solid countrywide public education system will have to be put in place where excellence and quality are promoted - not rote learning. The mindset of mediocrity, chalta hai, and jugaad needs to be eliminated from day one of education."
    ],
    "cleaned_text": "spices steel drugs indias exports hammered even worrying fact instead increasing standards campaigning wto reduce food safety standards including increase permissible pesticide levels sad india made strong pitch world trade organization wto formulation guidelines determine default maximum residue limits mrl absence international standards traces pesticides leave treated products called residues mrl highest level pesticide residue legally tolerated food feed recent submission wto india said stringent mrls traderestrictive act nontariff barriers international trade disproportionately affecting exporters developing countries present uniform international standards ",
    "cleaned_title": "spices steel drugs indias exports hammered even worrying fact instead increasing standards campaigning wto reduce food safety standards including increase permissible pesticide levels sad",
    "cleaned_selftext": "india made strong pitch world trade organization wto formulation guidelines determine default maximum residue limits mrl absence international standards traces pesticides leave treated products called residues mrl highest level pesticide residue legally tolerated food feed recent submission wto india said stringent mrls traderestrictive act nontariff barriers international trade disproportionately affecting exporters developing countries present uniform international standards",
    "cleaned_comments": "generally culture shittier standards nothing much done domestically thankfully export issue problem solve india wants exports standards export apart shoet tem measures solid countrywide public education system put place excellence quality promoted rote learning mindset mediocrity chalta hai jugaad needs eliminated day one education",
    "light_cleaned_title": "From spices to steel to drugs, India's exports are being hammered! Even more worrying is the fact that instead of Increasing our standards, we are campaigning in WTO reduce the food and safety standards including increase of permissible pesticide levels. Sad!",
    "light_cleaned_selftext": "India has made a strong pitch at the World Trade Organization (WTO) for the formulation of guidelines to determine default maximum residue limits (MRL) in the absence of international standards. The traces pesticides leave in treated products are called residues and MRL is the highest level of a pesticide residue that is legally tolerated in food or feed. In a recent submission to the WTO, India said that stringent MRLs can be trade-restrictive and act as non-tariff barriers to international trade, disproportionately affecting exporters from developing countries. At present there are no uniform international standards.",
    "light_cleaned_comments": "Generally as a culture we have shit-tier standards. Nothing much can be done domestically, but thankfully, the export issue is a problem that will solve itself. If India wants exports, it will have to up its standards, or not export. Apart from shoet tem measures, a solid countrywide public education system will have to be put in place where excellence and quality are promoted - not rote learning. The mindset of mediocrity, chalta hai, and jugaad needs to be eliminated from day one of education."
}