{
    "id": "1agg7gw",
    "title": "Wealth inequality got worse between 2000-2021. India most unequal countries in the world.",
    "url": "https://i.redd.it/682abprcc0gc1.jpeg",
    "selftext": "https://www.businesstoday.in/latest/economy/story/india-very-unequal-top-1-own-33-of-the-countrys-wealth-world-inequality-report-314802-2021-12-08\n\n>India is one of the most unequal countries in the world, according to the World Inequality Report\n\nhttps://wir2022.wid.world",
    "flair": "Policy/Economy",
    "score": 566,
    "num_comments": 103,
    "created_utc": 1706807956.0,
    "convurl": "https://i.redd.it/682abprcc0gc1.jpeg",
    "comments": [
        "Sources: \n\nhttps://www.businesstoday.in/latest/economy/story/india-very-unequal-top-1-own-33-of-the-countrys-wealth-world-inequality-report-314802-2021-12-08\n\nhttps://wir2022.wid.world",
        "We're not commies. /s",
        "Even capitalism will collapse if the gap between haves and have nots gets too big.\n\nThat's what happened in the USA during the great depression.\n\nThat's why even the US has a social security system.",
        "Markonikov's rule lag gaya",
        "Bottom 50% share declined from 8.6% to 6.9% during 2005-2010. Maybe its because of 2008 crisis",
        "Whatever you people say about me by this time I'm convinced we need communism. I don't see any other solution for our country having too many problems which are unsolvable in democracy.",
        "Communism isn't gonna work in India . Indians don't work for betterment of societies and communities . Government employees are a great example , how they don't care about doing thier jobs . There's a reason a British power with a max 10k population ruled over for centuries . Indians work for greed and money . So more of capitalism filled with socialist policies . Communism would be the worse",
        "The chart header says wealth inequality and then shows percent of income as the metric. Just seems to be either wrongly worded or bad sourcing.",
        "Why do you think communism is more likely to produce better results than capitalism when it has usually bankrupted countries in the past? India is pretty socialist anyway, it is not a free market in any sense.",
        "Capitalism did not collapse in the US after the Great Depression.",
        "What do you expect when all the industrialists in India are super close to the current party in power and anyone who goes against the policies of the party cannot get rich. The corruption is the nexus in the causal link leading to wealth inequality in India.",
        "\"₹500 ka petrol badhwayenge tab na amiri ka pata chalega logo ko\"",
        "True because govt bailed out the companies",
        "Yeah, capitalism for the common man and socialism for the rich. They did the same in ‘08.",
        "title says wealth, legend says income, and the clarification at the bottom goes back to saying it's wealth and then defines it as total financial and non-financial assets held by households.",
        "Think they meant wealth only as they've defined it down.\nI think Gini does a lot better job due to its pop invariance properties than income share tbh \nIdk feel like measures like these are too archaic and economists should take each country into account",
        "Indians are not a special breed of people, that’s an overt generalization of an entire country. \n\nEveryone works for greed and money, with no exception. The UK was motivated by greed and money too when they colonized half the world. They were able to control India easily because India had no structure or societal governance at the time so it proved to be rather easy. There was also a lot of infighting. \n\nThe exact fact that everyone works for greed and money is why communism has always failed and will always fail. It goes against human nature. If everyone recognized that, the world would be a lot more peaceful.",
        "Rural.india does farming.We will not let you export.Rural india joins army.We will make you agniveer.Rural India joins railway.We will bring private housekeeping services for railways.They are just forcing migration from rural to urban",
        "capitalism is the reason many of the countries around the world are unstable or in civil war pipe ur shit down kid… socialism believes in living in a society where u take down rich elites and give it to the poor and middle class",
        "thats not possible how did the elites get a large 7 pervent increase then?",
        "The legend says income inequality while it actually shows wealth inequality.",
        "communism with hard hands would bring much progress on this chart but yeah if its socialist policies we need an even bigger hand",
        "You misunderstood me, sir. \n\nThe reply meant when government bailed out big corporations in 1929 and 2008, it was socialism for the rich because they should have been allowed to go bankrupt but instead got help from the State. And it was capitalism for the poor and the working class because they did go bankrupt and received no financial help from the US Government. My reply was pointing out that hypocrisy, so agreeing with you in a way. \n\nSeparately, the world was in disarray long before capitalism became a conceptualized thing. If anything, conflicts worldwide have done down since the end of WW2 and increase in global trade. If you disagree, feel free to research statistics relating to that. And about taking money from rich and giving it to the poor, that is communism not socialism. Socialism is traditionally associated with state control over key industries nor redistribution of wealth from “elites.”",
        "North Korea jaega ?",
        "The biggest factor is certain sectors that employs a large amount of people never got modernized. The public is partly to blame for that. Indians have a weird tendency to tolerate bad quality products.\n\nFor example agriculture. How is it still not modernized? It employs more than 50% of the population, yes of course it will reduce the number of people involved with its advancement but the farmers who do embrace it will have more income. The resources are there, most state governments have subsidies and major incentives. My dad is gonna retire in a few years, he recently started polyhouse farming in around 1 acre of his land along with my uncle. The govt is giving 50% of the construction cost and rest if anyone wants can be financed by 0 interest loans. Same incentives are there for fisheries and others. How are these things not happening? This is not govts fault no matter who is in power imo.\n\nSimilar issue with other sectors like textiles, tourism, forestry. How did we let Australia be the biggest exporter of mangoes and sandalwood oil which are super expensive and earn a pretty penny? Same thing is happening with dairy right now. Like how? There are already incentives in these things...do people just want freebies?",
        "So total state control with an iron fist is what you recommend, especially to the current government that fetishizes mistreatment of minority groups. That should end well.",
        "u must delusional if u never read of the programs FDR set up during the wall street crash… they recieved plenty of support and funding from the government… there is a reason why he was elected as president 4 consecutive times and even his oponents stood 0 chance… capitalism was the main reason for the instability lmao… colonization export import trade exploitation ‘freedom wars’ iraq sudan and many nations… ever heard of the word ‘banana republic’?? check it up… capitalism only means to entich themselves and their wealthy elites… socialism does believe in some sort of money collection from the rich to be subsidised to poor while communism believes in direct distribution to the masses… capitalism was always a curse to society and the only reason why they are alive is because they have powerful armies to ‘defend’ their interests (check what happened in the aftermath of the iraq war libya civil warthe famous ‘liberation movements’ i’ll give a clue ‘black gold’)",
        "i believe in a proper government that handles ‘strongly’ against the rich elites and the tax break schemes",
        "India doesn't need communism. It needs modernization. Its similar to france in a lot of ways in how the govt and systems are bogged down with beurocracy. The sectors that emply a large amount of low income groups like agriculture, textiles, tourism, fisheries, forestry etc never got modernized. These people do not have disposable income to invest in high end things that India wants to produce like electronics. You cannot even blame the govt for it because they have massive incentives for these sectors. Indians have a weird infatuation of tolerating low quality products and inefficiency.",
        "Since you’re really big on FDR, I’ll remind you that he’s the same person who imprisoned the Japanese in US during WW2, instigated violent and risky escapades with warring countries before US had officially entered the war, all while maintaining “neutrality.” He also sanctioned the production and usage of nuclear bomb, so that must go against your philosophy? His economic policies were good but fit perfectly well in a capitalist system. He was not a communist or socialist, was he?\n\nSo capitalism was the main reason for instability? Fine. But it was also the reason for wealth creation. Without capitalism you wouldn’t have the same amount of wealth and you wouldn’t have the wealthy to redistribute wealthy from. You see the circular logic there? On one hand you’re saying capitalism generates wealth only for the rich and on the other hand saying redistribute wealth from the rich to the poor or middle-class. What do you do when the rich no longer have money? You haven’t thought about that, have you?\n\nThere needs to be some historical evidence that the major systematic change you propose has worked in the pat. Where has it worked? But there are multiple examples of where it has failed catastrophically. Nothing you’re saying is new or unique, it’s the same arguments people use for Marxist policies but don’t have an answer when asked these questions. Maybe I’ll get one from you. \n\nI get it, you’re a very knowledgeable guy. I know about all that stuff too. I too know about Abu Gharib, Libya, 1953 coup d'état and other instances of western imperialism. Never denied that. But you’re talking as if communist and socialist countries have never done that. North Korea, Soviets, Congo, China, not the prettiest bunch in the angelic pocket, you know? Stalin killed a lot of people, you know… The Soviets were brutal in the Cold War.",
        "You’re exactly right. 100% agreed.  \n\nIndia is very inefficient and ineffective. I think that’s because it’s a very conformist society where doing something in a novel manner is looked down on, even if the new ways is more effective and efficient. Crazy.",
        "I believe in having a proper government too. But since we don’t have one right now or will are expected to have one in the foreseeable future, maybe putting a strategy aside, which will result in targeting of rich minorities in favour of rich majorities, is prudent.",
        "I live in Australia, and agricultural goods are of very high quality.   \nIndia has this strange obsession with \"Kisaan\" that I don't see here in Australia. Govt here too is quite protective of Farmers and people love Farmers. Less than 3% of the Australian workforce works in Agriculture,  yet agriculture is the second biggest export after mining. Any reforms in Agriculture will be shot down as \"Kisan Virodhi\" and there be riots and blood baths.  Agricultural reforms in India are a dead cause.",
        ">the industrialists in India are super close to the current party\n\nIndustrialists are always close to the ruling party.  There was a time when people said Ambani was Congress's stooge.",
        "But average line go up...I don't understand!!! /s",
        "2015, 2020 and 2021 add up to > 100%, nice source they got there",
        "It could be that a correction allowed the wealthy to acquire more assets at discount while the bottom 50% lost more assets to pay for subsistence.",
        "The numbers are top 10% and top 1% (which will probably be a subset of 10%), so that overlap is why it's crossing 100, I guess.",
        "Let's use the 2 numbers in this comment string. 50% of population is employed in the Ag sector. It goes to 3%. What are 47% of Indians supposed to do instead?",
        "apologize for what?? misunderstanding the delusional shit u just spat?? and secondly im not dome big FDR guy i mentioned his social programs and policies because u were the guy who was delusionally barking ‘government did nothing for the poor in 1929’ his social programs were one of the aleviating factors of the great depression… we are not talking about his policies or decisions here… we are talking about the fake shit u are barking here… idc whether he was a socialist or a communist… all im saying is he did for the poor which is the reason why they elected him 4 times…\ncapitalism was the reason for wealth creation?? yeah by robbing other countries sure and taking their natural resources… and secondly look at the us… capitalist greed is what led to the rise of rich elites… and secondly socialism and communism believes in redistributing the wealth of the rich to the masses… so as to maintain a proper social and economic system with fair and equality… once there is no rich people there wouldn’t be any prejudice against any common man, nor would there be heavy bills or fines for small issues, there wouldn’t be the need for higher taxes on the populace, everyone will grow together in a better enviroment with social programs funded off by taxpayer money… \nwhy isn’t there a nation with such policies?? ever heard of Muammar Gaddafi?? or Thomas sankara?? do u know what they got in common?? CIA meddling and death… they had maintained strong policies to uplift the masses but clearly some systems hate those… they redistributed wealth and resources to masses and what they got in return?? capitalist american bullets in their head… not a nice answer for why it failed huh?\n And again wow the whataboutism… what about china, what about ussr… nobody said their were angels and these were devils… all im saying is USA meddled in many nations affairs so as to maintain their ‘sphere of influence’ and obtain or exploit their natural resources in the guise of ‘freedom’ was the societ union present when america was meddling in iraq? libya? and just check the procurement of us oil companies like exxon shell in iraq once us declared ‘iraqi freedom’. capitalism will obtain nothing but a rich social class governing and misusing their wealth to enrich themselves more and protect their interests from being attacked by ‘liberals or socialists’ aka the commies in rightie eyes",
        "tagretting rich minorities in favour of rich majorities?? are u stating making a plan to tackle the wealth of the top 1%? yeah thats impossible without such a government… no strategy would win when these giant industries have been rolling gandhis into the party funds",
        "could be true… they would have procurred more to stabilize the system…",
        "Why is the math not mathing?",
        "I have no idea what that means, I’m sorry, read it five times. You yap like a rambling madman, with your passion it should be easy to take over a tiny island like Tuvalu. Let’s start the revolution there. 👊",
        "first make sense of what u meant by  ‘tagretting rich minorites in favour of rich majorities’?? there isn’t a rich majority to be developed here only a equal system of wealth distribution",
        "Let me explain it to you in the most basic manner possible. Ok?\n\n- you said “communism with hard hands would bring much progress”\n\n- i replied saying the current government which is probably going to be in power for the foreseeable future is too nationalistic and fetishizes persecuting minorities, so that will not end well. what won’t? giving them more power\n\n- you ignored what i said and made an unrelated point that you believe in “a proper government” that “handles the rich” \n\n- i replied saying that who doesn’t want a proper government, AND:\n\nIF current government gets power to “handle the rich”\n\n   - what rich are they going to go after? the rich people belonging to privileged classes or religions OR rich minorities belonging to oppressed and persecuted classes to consolidate support? of course, there are a few rich minorities, too.\n\nthat simple enough for you? \n\nnow make a completely unrelated point like you’ve been doing so far.",
        "geez man, you really are an obnoxious person and worse, an idiot. \n\nyou know how your brain works? read some stuff late at night - think i’m so so cool - encode it in the subconscious - repeat said stuff verbatim without engaging with subject matter - repeat the ritual \n\nmy point was specific to bailouts, or are you too thick to get that? i’m not a choir boy interested in your rants, grow up. i made a historical point which you then flipped and grasped on like a complete moron. i didn’t even express any opinions on FDR in my original reply. it was merely an observation that in 1929, like in 2008, big corporations got bailed out when the regular folks got very little if not nothing. you seriously arguing with that given your own socialistic leanings? so weird\n\nread some books or wikipedia, FDR got his third and fourth term became US was in a war. do you not know that? why am i even engaging with an NPC like you. arghhhh. \n\nyea, yea, yeah, now “whataboutism”\n\ngrow up, man. no one is buying what you’re saying. there’s nothing to buy to be honest, because you have no idea what even it is that you’re selling. \n\n\n\nhey, grab a loudspeaker and preach your sermon, man. you went fully numb when i bought up chuna, soviets, etc\n\nlike i said, you’re nothing new, same old arguments, cia bad usa bad gaddafi good \n\nlet me ask you a question: if the CIA is so ruthless, how does any country that follows your system have a chance succeeding against the US? you yourself name heads of states that US killed.",
        "It’s not a thing in the UK, either. I don’t understand why that’s the way it is in India with farming reforms, if anyone has any insights? Surely, it is in both government’s and farmers’ best interest to improve efficiency in farming. They’ll make more money and live better lives. Doesn’t make sense.",
        "We are all equal if you dont consider the richie rich of  Modi, Adani, Ambani and the guys in parliament.",
        "Service sector and manufacturing.",
        "More like rural vs urban",
        "You've got job openings for 47% of India's population?",
        "Jobs will turn up and people will be ready to embrace change. If people wait for \"Gourmint\" job, then tough luck.",
        "So if the top goes to a village with majority from the bottom category she can buy the whole and it won't make a dent.",
        "Still the gap between top 10% and bottom 50% is huge.\n\nYou should understand 1% of population is 13 million people.\n\nAdani, Ambani belong to the top 0.00000001%",
        "Because it inequalities",
        "Top 10% also include top 1% \n\nIt quite simple",
        "Top 10% also include top 1% therefore it goes more than 100",
        "In the last bit \n64+33=97\n97+6=103\nSo is the 33 included in the 64?",
        "Yeah that makes sense.",
        "There is no average line 😂",
        "Financial crisis make the rich, richer\n\nhttps://www.forbes.com/sites/teresaghilarducci/2020/05/25/who-wins-in-recessions-the-rich-and-lucky/\n\nhttps://www.reuters.com/article/idUSTRE65L36T/\n\nhttps://hbr.org/2018/09/research-how-the-financial-crisis-drastically-increased-wealth-inequality-in-the-u-s",
        "As I said it's because top 10% also include top 1%",
        ">For example agriculture. How is it still not modernized?\n\nThat's a very good point.\n\nEvery developed country has modernized agriculture before becoming developed.\n\nChina is using drones for planting and harvesting.",
        "Inflation will skyrocket if that happens",
        "Ambani goes Both ways. Adani is a BJP loyalist. \n\nSome industrialists support whoever is in power\n\nWhile others are loyalists. \n\nThere are pros and cons for both",
        "That happened in the recession in 2008.\n\nThe great depression happened in 1929-39\n\nAnd nobody bailed anyone out.",
        "You are mistaking the great depression of 1930s with 2008 recession",
        "When a protic acid (HX) is added to an asymmetric alkene, the acidic hydrogen attaches itself to the carbon having a greater number of hydrogen substituents whereas the halide group attaches itself to the carbon atom which has a greater number of alkyl substituents.",
        "If that happens price of village will increase ",
        "Only after the villagers are homeless.",
        "Selling  is voluntary you wouldn't sell your village if you will become homeless and your standard of living will reduce. Supply and demand will correct the price ",
        "It's not when most of the rural areas in BJP ruled states are still governed by land mafia.\n\nGoogle Nand gopal nandi\n\nThanks to BJP he controls all unoccupied land in East UP. Such people will become mediators in above mentioned transactions and eat away most profit. \n\nOr Pradhan will take some advance from the multi-millionaire and takeover all homes for cheap then sell it to him for good profit.\n\nVillagers will remain poor homeless and whatever little they make from sale will be evaporated by inflation.\n\nYou don't know how things work in Indian villages. Pradhan takes the biggest share of everything because he controls information. That's why BJP was so riled up about having their own corrupt pradhan rather than opposition. It's the same guy. \n\nhttps://www.outlookindia.com/national/allahabad-hc-suspends-1-year-jail-term-awarded-to-up-minister-nandi-in-assault-case-news-271746",
        "For India it won't decrease like that. It will gradually put more money into farmers, after a generation their children will have more capital and they will start working in other sectors.",
        "Yup. It took my dad and uncle just a week to get close to 70% subsidy to start polyhouse farming and half of the process was even online. The govt at least in Odisha has been trying to encourage more and more farmers by giving out freebies but they don't want to do anything just want to get loans and default on it. This is not a congress, BJP issue either...each govt had incentives.",
        "That is the issue isn't it, people want to sit on their asses and somehow expect jobs will come to their villages. Modernization creates more jobs, both BJP and Congress have given plenty incentives at this point.",
        "Yup. Its a human issue, both Congress and BJP have provided plenty of incentives. Not just agriculture either, textiles, apparel and tourism. These are low cost and low end jobs but they create biggest value chains and gives the workers much needed capital which they can use to educate their children and spend on things which would further create demand. India is a 1.4 billion counry, you do not even need to export much, just internal consumption could give you at least a 6-8 trillion economy.",
        "Some wisemen said, India is poor country but Indians",
        "Didn't Adani and the likes represent average Indian\n\nWhile the poorest 75% are making less than 33 rupees per day\n\nThat's after a decade of the Modi government.",
        "We don't have to export if we don't import.\n\nAs of right now we are importing oil and gas worth a few hundred billion dollars from the gulf and Russia and another few hundred billion dollars of goods and intermediate products from China. \n\nIf we domestically produce all that stuff then we don't need to export to balance that.\n\nRight now we are importing more than exports. That's one of the reasons for the rupee falling. \n\nThe more the rupee falls the more we have to pay for the same oil and gas \n\nInstead of synthesizing butane and octane or biodiesel from solar power(photochemical production) or biotechnology.",
        "Nope Adani isn’t representing averages even BJP supporters won’t support Adani",
        "I was being sarcastic",
        "I got you bro",
        "How many times have you quit your job with the hope that a new job will turn up, in a wildly different industry and location?",
        "Agriculture is over-employed. They aren't making much returns unless you are big farmers. And with modernization the need for people will decrease and new sectors within it can be opened. It won't go from 50 to 3 within a year. It will be a slow process taking up to a decade in which time we will need to find new sources.",
        "what are you talking about? they literally bailed out railroads\n\nhttps://cepr.org/system/files/2022-11/Railroad%20Bailouts.pdf\n\nthey didn’t bail out banks, which was very stupid. in the end, around 25% of US banks failed, and took their depositors down with them (no FDIC back then). \n\n$180 billion of private citizens’ money was lost",
        "I didn’t conflate the two and my point was a reply to you saying US capitalism collapsed after 1929 which it obviously didn’t.",
        "I didn't say it permanently collapsed. It recovered later on. But that took 30 years\n\nBut the American economy was ruined for at least 10 years. The after effects were visible up to 1950.\n\nWhat do you think a collapsed system looks like?\n\nHow can you say it didn't? What is your explanation?",
        "True but to invest in those ecosystems you need capital, and that capital comes from people.",
        "What's the real income inequality, wealth can be inflated even if you don't have real cash for it",
        "Yeah real income inequality would be worse for the bottom 50% because they don't have any assets. They are too busy with liabilities.",
        "My 10th standard small shop owner-parents couldn't afford to send me and my brother to a private school. We did our education in a Govt-aided Kannada medium school, where the fee was Rs 500/year. I did my engineering by borrowing Rs 9000/year from a relative and after I got my job, I took a personal loan for my brother's education. Today, both of us are doing really well. All my classmates in the government-aided schools who were in similar or far worse situations are doing well too. There is always a way out for people looking. People in India need to focus on themselves first and then worry about other things.",
        "Congrats man! Glad you made it out."
    ],
    "cleaned_text": "wealth inequality got worse india unequal countries world india one unequal countries world according world inequality report ",
    "cleaned_title": "wealth inequality got worse india unequal countries world",
    "cleaned_selftext": "india one unequal countries world according world inequality report",
    "cleaned_comments": "sources commies even capitalism collapse gap haves nots gets big thats happened usa great depression thats even us social security system markonikovs rule lag gaya bottom share declined maybe crisis whatever people say time im convinced need communism dont see solution country many problems unsolvable democracy communism isnt gon na work india indians dont work betterment societies communities government employees great example dont care thier jobs theres reason british power max k population ruled centuries indians work greed money capitalism filled socialist policies communism would worse chart header says wealth inequality shows percent income metric seems either wrongly worded bad sourcing think communism likely produce better results capitalism usually bankrupted countries past india pretty socialist anyway free market sense capitalism collapse us great depression expect industrialists india super close current party power anyone goes policies party get rich corruption nexus causal link leading wealth inequality india ka petrol badhwayenge tab na amiri ka pata chalega logo ko true govt bailed companies yeah capitalism common man socialism rich title says wealth legend says income clarification bottom goes back saying wealth defines total financial nonfinancial assets held households think meant wealth theyve defined think gini lot better job due pop invariance properties income share tbh idk feel like measures like archaic economists take country account indians special breed people thats overt generalization entire country everyone works greed money exception uk motivated greed money colonized half world able control india easily india structure societal governance time proved rather easy also lot infighting exact fact everyone works greed money communism always failed always fail goes human nature everyone recognized world would lot peaceful ruralindia farmingwe let exportrural india joins armywe make agniveerrural india joins railwaywe bring private housekeeping services railwaysthey forcing migration rural urban capitalism reason many countries around world unstable civil war pipe ur shit kid socialism believes living society u take rich elites give poor middle class thats possible elites get large pervent increase legend says income inequality actually shows wealth inequality communism hard hands would bring much progress chart yeah socialist policies need even bigger hand misunderstood sir reply meant government bailed big corporations socialism rich allowed go bankrupt instead got help state capitalism poor working class go bankrupt received financial help us government reply pointing hypocrisy agreeing way separately world disarray long capitalism became conceptualized thing anything conflicts worldwide done since end ww increase global trade disagree feel free research statistics relating taking money rich giving poor communism socialism socialism traditionally associated state control key industries redistribution wealth elites north korea jaega biggest factor certain sectors employs large amount people never got modernized public partly blame indians weird tendency tolerate bad quality products example agriculture still modernized employs population yes course reduce number people involved advancement farmers embrace income resources state governments subsidies major incentives dad gon na retire years recently started polyhouse farming around acre land along uncle govt giving construction cost rest anyone wants financed interest loans incentives fisheries others things happening govts fault matter power imo similar issue sectors like textiles tourism forestry let australia biggest exporter mangoes sandalwood oil super expensive earn pretty penny thing happening dairy right like already incentives thingsdo people want freebies total state control iron fist recommend especially current government fetishizes mistreatment minority groups end well u must delusional u never read programs fdr set wall street crash recieved plenty support funding government reason elected president consecutive times even oponents stood chance capitalism main reason instability lmao colonization export import trade exploitation freedom wars iraq sudan many nations ever heard word banana republic check capitalism means entich wealthy elites socialism believe sort money collection rich subsidised poor communism believes direct distribution masses capitalism always curse society reason alive powerful armies defend interests check happened aftermath iraq war libya civil warthe famous liberation movements ill give clue black gold believe proper government handles strongly rich elites tax break schemes india doesnt need communism needs modernization similar france lot ways govt systems bogged beurocracy sectors emply large amount low income groups like agriculture textiles tourism fisheries forestry etc never got modernized people disposable income invest high end things india wants produce like electronics even blame govt massive incentives sectors indians weird infatuation tolerating low quality products inefficiency since youre really big fdr ill remind hes person imprisoned japanese us ww instigated violent risky escapades warring countries us officially entered war maintaining neutrality also sanctioned production usage nuclear bomb must go philosophy economic policies good fit perfectly well capitalist system communist socialist capitalism main reason instability fine also reason wealth creation without capitalism wouldnt amount wealth wouldnt wealthy redistribute wealthy see circular logic one hand youre saying capitalism generates wealth rich hand saying redistribute wealth rich poor middleclass rich longer money havent thought needs historical evidence major systematic change propose worked pat worked multiple examples failed catastrophically nothing youre saying new unique arguments people use marxist policies dont answer asked questions maybe ill get one get youre knowledgeable guy know stuff know abu gharib libya coup dtat instances western imperialism never denied youre talking communist socialist countries never done north korea soviets congo china prettiest bunch angelic pocket know stalin killed lot people know soviets brutal cold war youre exactly right agreed india inefficient ineffective think thats conformist society something novel manner looked even new ways effective efficient crazy believe proper government since dont one right expected one foreseeable future maybe putting strategy aside result targeting rich minorities favour rich majorities prudent live australia agricultural goods high quality india strange obsession kisaan dont see australia govt quite protective farmers people love farmers less australian workforce works agriculture yet agriculture second biggest export mining reforms agriculture shot kisan virodhi riots blood baths agricultural reforms india dead cause industrialists india super close current party industrialists always close ruling party time people said ambani congresss stooge average line go upi dont understand add nice source got could correction allowed wealthy acquire assets discount bottom lost assets pay subsistence numbers top top probably subset overlap crossing guess lets use numbers comment string population employed ag sector goes indians supposed instead apologize misunderstanding delusional shit u spat secondly im dome big fdr guy mentioned social programs policies u guy delusionally barking government nothing poor social programs one aleviating factors great depression talking policies decisions talking fake shit u barking idc whether socialist communist im saying poor reason elected times capitalism reason wealth creation yeah robbing countries sure taking natural resources secondly look us capitalist greed led rise rich elites secondly socialism communism believes redistributing wealth rich masses maintain proper social economic system fair equality rich people wouldnt prejudice common man would heavy bills fines small issues wouldnt need higher taxes populace everyone grow together better enviroment social programs funded taxpayer money isnt nation policies ever heard muammar gaddafi thomas sankara u know got common cia meddling death maintained strong policies uplift masses clearly systems hate redistributed wealth resources masses got return capitalist american bullets head nice answer failed huh wow whataboutism china ussr nobody said angels devils im saying usa meddled many nations affairs maintain sphere influence obtain exploit natural resources guise freedom societ union present america meddling iraq libya check procurement us oil companies like exxon shell iraq us declared iraqi freedom capitalism obtain nothing rich social class governing misusing wealth enrich protect interests attacked liberals socialists aka commies rightie eyes tagretting rich minorities favour rich majorities u stating making plan tackle wealth top yeah thats impossible without government strategy would win giant industries rolling gandhis party funds could true would procurred stabilize system math mathing idea means im sorry read five times yap like rambling madman passion easy take tiny island like tuvalu lets start revolution first make sense u meant tagretting rich minorites favour rich majorities isnt rich majority developed equal system wealth distribution let explain basic manner possible ok said communism hard hands would bring much progress replied saying current government probably going power foreseeable future nationalistic fetishizes persecuting minorities end well wont giving power ignored said made unrelated point believe proper government handles rich replied saying doesnt want proper government current government gets power handle rich rich going go rich people belonging privileged classes religions rich minorities belonging oppressed persecuted classes consolidate support course rich minorities simple enough make completely unrelated point like youve far geez man really obnoxious person worse idiot know brain works read stuff late night think im cool encode subconscious repeat said stuff verbatim without engaging subject matter repeat ritual point specific bailouts thick get im choir boy interested rants grow made historical point flipped grasped like complete moron didnt even express opinions fdr original reply merely observation like big corporations got bailed regular folks got little nothing seriously arguing given socialistic leanings weird read books wikipedia fdr got third fourth term became us war know even engaging npc like arghhhh yea yea yeah whataboutism grow man one buying youre saying theres nothing buy honest idea even youre selling hey grab loudspeaker preach sermon man went fully numb bought chuna soviets etc like said youre nothing new old arguments cia bad usa bad gaddafi good let ask question cia ruthless country follows system chance succeeding us name heads states us killed thing uk either dont understand thats way india farming reforms anyone insights surely governments farmers best interest improve efficiency farming theyll make money live better lives doesnt make sense equal dont consider richie rich modi adani ambani guys parliament service sector manufacturing like rural vs urban youve got job openings indias population jobs turn people ready embrace change people wait gourmint job tough luck top goes village majority bottom category buy whole wont make dent still gap top bottom huge understand population million people adani ambani belong top inequalities top also include top quite simple top also include top therefore goes last bit included yeah makes sense average line financial crisis make rich richer said top also include top example agriculture still modernized thats good point every developed country modernized agriculture becoming developed china using drones planting harvesting inflation skyrocket happens ambani goes ways adani bjp loyalist industrialists support whoever power others loyalists pros cons happened recession great depression happened nobody bailed anyone mistaking great depression recession protic acid hx added asymmetric alkene acidic hydrogen attaches carbon greater number hydrogen substituents whereas halide group attaches carbon atom greater number alkyl substituents happens price village increase villagers homeless selling voluntary wouldnt sell village become homeless standard living reduce supply demand correct price rural areas bjp ruled states still governed land mafia google nand gopal nandi thanks bjp controls unoccupied land east people become mediators mentioned transactions eat away profit pradhan take advance multimillionaire takeover homes cheap sell good profit villagers remain poor homeless whatever little make sale evaporated inflation dont know things work indian villages pradhan takes biggest share everything controls information thats bjp riled corrupt pradhan rather opposition guy india wont decrease like gradually put money farmers generation children capital start working sectors yup took dad uncle week get close subsidy start polyhouse farming half process even online govt least odisha trying encourage farmers giving freebies dont want anything want get loans default congress bjp issue eithereach govt incentives issue isnt people want sit asses somehow expect jobs come villages modernization creates jobs bjp congress given plenty incentives point yup human issue congress bjp provided plenty incentives agriculture either textiles apparel tourism low cost low end jobs create biggest value chains gives workers much needed capital use educate children spend things would create demand india billion counry even need export much internal consumption could give least trillion economy wisemen said india poor country indians didnt adani likes represent average indian poorest making less rupees per day thats decade modi government dont export dont import right importing oil gas worth hundred billion dollars gulf russia another hundred billion dollars goods intermediate products china domestically produce stuff dont need export balance right importing exports thats one reasons rupee falling rupee falls pay oil gas instead synthesizing butane octane biodiesel solar powerphotochemical production biotechnology nope adani isnt representing averages even bjp supporters wont support adani sarcastic got bro many times quit job hope new job turn wildly different industry location agriculture overemployed arent making much returns unless big farmers modernization need people decrease new sectors within opened wont go within year slow process taking decade time need find new sources talking literally bailed railroads didnt bail banks stupid end around us banks failed took depositors fdic back billion private citizens money lost didnt conflate two point reply saying us capitalism collapsed obviously didnt didnt say permanently collapsed recovered later took years american economy ruined least years effects visible think collapsed system looks like say didnt explanation true invest ecosystems need capital capital comes people whats real income inequality wealth inflated even dont real cash yeah real income inequality would worse bottom dont assets busy liabilities th standard small shop ownerparents couldnt afford send brother private school education govtaided kannada medium school fee rs year engineering borrowing rs year relative got job took personal loan brothers education today us really well classmates governmentaided schools similar far worse situations well always way people looking people india need focus first worry things congrats man glad made",
    "light_cleaned_title": "Wealth inequality got worse between 2000-2021. India most unequal countries in the world.",
    "light_cleaned_selftext": ">India is one of the most unequal countries in the world, according to the World Inequality Report",
    "light_cleaned_comments": "Sources: We're not commies. /s Even capitalism will collapse if the gap between haves and have nots gets too big. That's what happened in the USA during the great depression. That's why even the US has a social security system. Markonikov's rule lag gaya Bottom 50% share declined from 8.6% to 6.9% during 2005-2010. Maybe its because of 2008 crisis Whatever you people say about me by this time I'm convinced we need communism. I don't see any other solution for our country having too many problems which are unsolvable in democracy. Communism isn't gonna work in India . Indians don't work for betterment of societies and communities . Government employees are a great example , how they don't care about doing thier jobs . There's a reason a British power with a max 10k population ruled over for centuries . Indians work for greed and money . So more of capitalism filled with socialist policies . Communism would be the worse The chart header says wealth inequality and then shows percent of income as the metric. Just seems to be either wrongly worded or bad sourcing. Why do you think communism is more likely to produce better results than capitalism when it has usually bankrupted countries in the past? India is pretty socialist anyway, it is not a free market in any sense. Capitalism did not collapse in the US after the Great Depression. What do you expect when all the industrialists in India are super close to the current party in power and anyone who goes against the policies of the party cannot get rich. The corruption is the nexus in the causal link leading to wealth inequality in India. \"₹500 ka petrol badhwayenge tab na amiri ka pata chalega logo ko\" True because govt bailed out the companies Yeah, capitalism for the common man and socialism for the rich. They did the same in ‘08. title says wealth, legend says income, and the clarification at the bottom goes back to saying it's wealth and then defines it as total financial and non-financial assets held by households. Think they meant wealth only as they've defined it down. I think Gini does a lot better job due to its pop invariance properties than income share tbh Idk feel like measures like these are too archaic and economists should take each country into account Indians are not a special breed of people, that’s an overt generalization of an entire country. Everyone works for greed and money, with no exception. The UK was motivated by greed and money too when they colonized half the world. They were able to control India easily because India had no structure or societal governance at the time so it proved to be rather easy. There was also a lot of infighting. The exact fact that everyone works for greed and money is why communism has always failed and will always fail. It goes against human nature. If everyone recognized that, the world would be a lot more peaceful. Rural.india does farming.We will not let you export.Rural india joins army.We will make you agniveer.Rural India joins railway.We will bring private housekeeping services for railways.They are just forcing migration from rural to urban capitalism is the reason many of the countries around the world are unstable or in civil war pipe ur shit down kid… socialism believes in living in a society where u take down rich elites and give it to the poor and middle class thats not possible how did the elites get a large 7 pervent increase then? The legend says income inequality while it actually shows wealth inequality. communism with hard hands would bring much progress on this chart but yeah if its socialist policies we need an even bigger hand You misunderstood me, sir. The reply meant when government bailed out big corporations in 1929 and 2008, it was socialism for the rich because they should have been allowed to go bankrupt but instead got help from the State. And it was capitalism for the poor and the working class because they did go bankrupt and received no financial help from the US Government. My reply was pointing out that hypocrisy, so agreeing with you in a way. Separately, the world was in disarray long before capitalism became a conceptualized thing. If anything, conflicts worldwide have done down since the end of WW2 and increase in global trade. If you disagree, feel free to research statistics relating to that. And about taking money from rich and giving it to the poor, that is communism not socialism. Socialism is traditionally associated with state control over key industries nor redistribution of wealth from “elites.” North Korea jaega ? The biggest factor is certain sectors that employs a large amount of people never got modernized. The public is partly to blame for that. Indians have a weird tendency to tolerate bad quality products. For example agriculture. How is it still not modernized? It employs more than 50% of the population, yes of course it will reduce the number of people involved with its advancement but the farmers who do embrace it will have more income. The resources are there, most state governments have subsidies and major incentives. My dad is gonna retire in a few years, he recently started polyhouse farming in around 1 acre of his land along with my uncle. The govt is giving 50% of the construction cost and rest if anyone wants can be financed by 0 interest loans. Same incentives are there for fisheries and others. How are these things not happening? This is not govts fault no matter who is in power imo. Similar issue with other sectors like textiles, tourism, forestry. How did we let Australia be the biggest exporter of mangoes and sandalwood oil which are super expensive and earn a pretty penny? Same thing is happening with dairy right now. Like how? There are already incentives in these things...do people just want freebies? So total state control with an iron fist is what you recommend, especially to the current government that fetishizes mistreatment of minority groups. That should end well. u must delusional if u never read of the programs FDR set up during the wall street crash… they recieved plenty of support and funding from the government… there is a reason why he was elected as president 4 consecutive times and even his oponents stood 0 chance… capitalism was the main reason for the instability lmao… colonization export import trade exploitation ‘freedom wars’ iraq sudan and many nations… ever heard of the word ‘banana republic’?? check it up… capitalism only means to entich themselves and their wealthy elites… socialism does believe in some sort of money collection from the rich to be subsidised to poor while communism believes in direct distribution to the masses… capitalism was always a curse to society and the only reason why they are alive is because they have powerful armies to ‘defend’ their interests (check what happened in the aftermath of the iraq war libya civil warthe famous ‘liberation movements’ i’ll give a clue ‘black gold’) i believe in a proper government that handles ‘strongly’ against the rich elites and the tax break schemes India doesn't need communism. It needs modernization. Its similar to france in a lot of ways in how the govt and systems are bogged down with beurocracy. The sectors that emply a large amount of low income groups like agriculture, textiles, tourism, fisheries, forestry etc never got modernized. These people do not have disposable income to invest in high end things that India wants to produce like electronics. You cannot even blame the govt for it because they have massive incentives for these sectors. Indians have a weird infatuation of tolerating low quality products and inefficiency. Since you’re really big on FDR, I’ll remind you that he’s the same person who imprisoned the Japanese in US during WW2, instigated violent and risky escapades with warring countries before US had officially entered the war, all while maintaining “neutrality.” He also sanctioned the production and usage of nuclear bomb, so that must go against your philosophy? His economic policies were good but fit perfectly well in a capitalist system. He was not a communist or socialist, was he? So capitalism was the main reason for instability? Fine. But it was also the reason for wealth creation. Without capitalism you wouldn’t have the same amount of wealth and you wouldn’t have the wealthy to redistribute wealthy from. You see the circular logic there? On one hand you’re saying capitalism generates wealth only for the rich and on the other hand saying redistribute wealth from the rich to the poor or middle-class. What do you do when the rich no longer have money? You haven’t thought about that, have you? There needs to be some historical evidence that the major systematic change you propose has worked in the pat. Where has it worked? But there are multiple examples of where it has failed catastrophically. Nothing you’re saying is new or unique, it’s the same arguments people use for Marxist policies but don’t have an answer when asked these questions. Maybe I’ll get one from you. I get it, you’re a very knowledgeable guy. I know about all that stuff too. I too know about Abu Gharib, Libya, 1953 coup d'état and other instances of western imperialism. Never denied that. But you’re talking as if communist and socialist countries have never done that. North Korea, Soviets, Congo, China, not the prettiest bunch in the angelic pocket, you know? Stalin killed a lot of people, you know… The Soviets were brutal in the Cold War. You’re exactly right. 100% agreed. India is very inefficient and ineffective. I think that’s because it’s a very conformist society where doing something in a novel manner is looked down on, even if the new ways is more effective and efficient. Crazy. I believe in having a proper government too. But since we don’t have one right now or will are expected to have one in the foreseeable future, maybe putting a strategy aside, which will result in targeting of rich minorities in favour of rich majorities, is prudent. I live in Australia, and agricultural goods are of very high quality. India has this strange obsession with \"Kisaan\" that I don't see here in Australia. Govt here too is quite protective of Farmers and people love Farmers. Less than 3% of the Australian workforce works in Agriculture, yet agriculture is the second biggest export after mining. Any reforms in Agriculture will be shot down as \"Kisan Virodhi\" and there be riots and blood baths. Agricultural reforms in India are a dead cause. >the industrialists in India are super close to the current party Industrialists are always close to the ruling party. There was a time when people said Ambani was Congress's stooge. But average line go up...I don't understand!!! /s 2015, 2020 and 2021 add up to > 100%, nice source they got there It could be that a correction allowed the wealthy to acquire more assets at discount while the bottom 50% lost more assets to pay for subsistence. The numbers are top 10% and top 1% (which will probably be a subset of 10%), so that overlap is why it's crossing 100, I guess. Let's use the 2 numbers in this comment string. 50% of population is employed in the Ag sector. It goes to 3%. What are 47% of Indians supposed to do instead? apologize for what?? misunderstanding the delusional shit u just spat?? and secondly im not dome big FDR guy i mentioned his social programs and policies because u were the guy who was delusionally barking ‘government did nothing for the poor in 1929’ his social programs were one of the aleviating factors of the great depression… we are not talking about his policies or decisions here… we are talking about the fake shit u are barking here… idc whether he was a socialist or a communist… all im saying is he did for the poor which is the reason why they elected him 4 times… capitalism was the reason for wealth creation?? yeah by robbing other countries sure and taking their natural resources… and secondly look at the us… capitalist greed is what led to the rise of rich elites… and secondly socialism and communism believes in redistributing the wealth of the rich to the masses… so as to maintain a proper social and economic system with fair and equality… once there is no rich people there wouldn’t be any prejudice against any common man, nor would there be heavy bills or fines for small issues, there wouldn’t be the need for higher taxes on the populace, everyone will grow together in a better enviroment with social programs funded off by taxpayer money… why isn’t there a nation with such policies?? ever heard of Muammar Gaddafi?? or Thomas sankara?? do u know what they got in common?? CIA meddling and death… they had maintained strong policies to uplift the masses but clearly some systems hate those… they redistributed wealth and resources to masses and what they got in return?? capitalist american bullets in their head… not a nice answer for why it failed huh? And again wow the whataboutism… what about china, what about ussr… nobody said their were angels and these were devils… all im saying is USA meddled in many nations affairs so as to maintain their ‘sphere of influence’ and obtain or exploit their natural resources in the guise of ‘freedom’ was the societ union present when america was meddling in iraq? libya? and just check the procurement of us oil companies like exxon shell in iraq once us declared ‘iraqi freedom’. capitalism will obtain nothing but a rich social class governing and misusing their wealth to enrich themselves more and protect their interests from being attacked by ‘liberals or socialists’ aka the commies in rightie eyes tagretting rich minorities in favour of rich majorities?? are u stating making a plan to tackle the wealth of the top 1%? yeah thats impossible without such a government… no strategy would win when these giant industries have been rolling gandhis into the party funds could be true… they would have procurred more to stabilize the system… Why is the math not mathing? I have no idea what that means, I’m sorry, read it five times. You yap like a rambling madman, with your passion it should be easy to take over a tiny island like Tuvalu. Let’s start the revolution there. 👊 first make sense of what u meant by ‘tagretting rich minorites in favour of rich majorities’?? there isn’t a rich majority to be developed here only a equal system of wealth distribution Let me explain it to you in the most basic manner possible. Ok? - you said “communism with hard hands would bring much progress” - i replied saying the current government which is probably going to be in power for the foreseeable future is too nationalistic and fetishizes persecuting minorities, so that will not end well. what won’t? giving them more power - you ignored what i said and made an unrelated point that you believe in “a proper government” that “handles the rich” - i replied saying that who doesn’t want a proper government, AND: IF current government gets power to “handle the rich” - what rich are they going to go after? the rich people belonging to privileged classes or religions OR rich minorities belonging to oppressed and persecuted classes to consolidate support? of course, there are a few rich minorities, too. that simple enough for you? now make a completely unrelated point like you’ve been doing so far. geez man, you really are an obnoxious person and worse, an idiot. you know how your brain works? read some stuff late at night - think i’m so so cool - encode it in the subconscious - repeat said stuff verbatim without engaging with subject matter - repeat the ritual my point was specific to bailouts, or are you too thick to get that? i’m not a choir boy interested in your rants, grow up. i made a historical point which you then flipped and grasped on like a complete moron. i didn’t even express any opinions on FDR in my original reply. it was merely an observation that in 1929, like in 2008, big corporations got bailed out when the regular folks got very little if not nothing. you seriously arguing with that given your own socialistic leanings? so weird read some books or wikipedia, FDR got his third and fourth term became US was in a war. do you not know that? why am i even engaging with an NPC like you. arghhhh. yea, yea, yeah, now “whataboutism” grow up, man. no one is buying what you’re saying. there’s nothing to buy to be honest, because you have no idea what even it is that you’re selling. hey, grab a loudspeaker and preach your sermon, man. you went fully numb when i bought up chuna, soviets, etc like i said, you’re nothing new, same old arguments, cia bad usa bad gaddafi good let me ask you a question: if the CIA is so ruthless, how does any country that follows your system have a chance succeeding against the US? you yourself name heads of states that US killed. It’s not a thing in the UK, either. I don’t understand why that’s the way it is in India with farming reforms, if anyone has any insights? Surely, it is in both government’s and farmers’ best interest to improve efficiency in farming. They’ll make more money and live better lives. Doesn’t make sense. We are all equal if you dont consider the richie rich of Modi, Adani, Ambani and the guys in parliament. Service sector and manufacturing. More like rural vs urban You've got job openings for 47% of India's population? Jobs will turn up and people will be ready to embrace change. If people wait for \"Gourmint\" job, then tough luck. So if the top goes to a village with majority from the bottom category she can buy the whole and it won't make a dent. Still the gap between top 10% and bottom 50% is huge. You should understand 1% of population is 13 million people. Adani, Ambani belong to the top 0.00000001% Because it inequalities Top 10% also include top 1% It quite simple Top 10% also include top 1% therefore it goes more than 100 In the last bit 64+33=97 97+6=103 So is the 33 included in the 64? Yeah that makes sense. There is no average line 😂 Financial crisis make the rich, richer As I said it's because top 10% also include top 1% >For example agriculture. How is it still not modernized? That's a very good point. Every developed country has modernized agriculture before becoming developed. China is using drones for planting and harvesting. Inflation will skyrocket if that happens Ambani goes Both ways. Adani is a BJP loyalist. Some industrialists support whoever is in power While others are loyalists. There are pros and cons for both That happened in the recession in 2008. The great depression happened in 1929-39 And nobody bailed anyone out. You are mistaking the great depression of 1930s with 2008 recession When a protic acid (HX) is added to an asymmetric alkene, the acidic hydrogen attaches itself to the carbon having a greater number of hydrogen substituents whereas the halide group attaches itself to the carbon atom which has a greater number of alkyl substituents. If that happens price of village will increase Only after the villagers are homeless. Selling is voluntary you wouldn't sell your village if you will become homeless and your standard of living will reduce. Supply and demand will correct the price It's not when most of the rural areas in BJP ruled states are still governed by land mafia. Google Nand gopal nandi Thanks to BJP he controls all unoccupied land in East UP. Such people will become mediators in above mentioned transactions and eat away most profit. Or Pradhan will take some advance from the multi-millionaire and takeover all homes for cheap then sell it to him for good profit. Villagers will remain poor homeless and whatever little they make from sale will be evaporated by inflation. You don't know how things work in Indian villages. Pradhan takes the biggest share of everything because he controls information. That's why BJP was so riled up about having their own corrupt pradhan rather than opposition. It's the same guy. For India it won't decrease like that. It will gradually put more money into farmers, after a generation their children will have more capital and they will start working in other sectors. Yup. It took my dad and uncle just a week to get close to 70% subsidy to start polyhouse farming and half of the process was even online. The govt at least in Odisha has been trying to encourage more and more farmers by giving out freebies but they don't want to do anything just want to get loans and default on it. This is not a congress, BJP issue either...each govt had incentives. That is the issue isn't it, people want to sit on their asses and somehow expect jobs will come to their villages. Modernization creates more jobs, both BJP and Congress have given plenty incentives at this point. Yup. Its a human issue, both Congress and BJP have provided plenty of incentives. Not just agriculture either, textiles, apparel and tourism. These are low cost and low end jobs but they create biggest value chains and gives the workers much needed capital which they can use to educate their children and spend on things which would further create demand. India is a 1.4 billion counry, you do not even need to export much, just internal consumption could give you at least a 6-8 trillion economy. Some wisemen said, India is poor country but Indians Didn't Adani and the likes represent average Indian While the poorest 75% are making less than 33 rupees per day That's after a decade of the Modi government. We don't have to export if we don't import. As of right now we are importing oil and gas worth a few hundred billion dollars from the gulf and Russia and another few hundred billion dollars of goods and intermediate products from China. If we domestically produce all that stuff then we don't need to export to balance that. Right now we are importing more than exports. That's one of the reasons for the rupee falling. The more the rupee falls the more we have to pay for the same oil and gas Instead of synthesizing butane and octane or biodiesel from solar power(photochemical production) or biotechnology. Nope Adani isn’t representing averages even BJP supporters won’t support Adani I was being sarcastic I got you bro How many times have you quit your job with the hope that a new job will turn up, in a wildly different industry and location? Agriculture is over-employed. They aren't making much returns unless you are big farmers. And with modernization the need for people will decrease and new sectors within it can be opened. It won't go from 50 to 3 within a year. It will be a slow process taking up to a decade in which time we will need to find new sources. what are you talking about? they literally bailed out railroads they didn’t bail out banks, which was very stupid. in the end, around 25% of US banks failed, and took their depositors down with them (no FDIC back then). $180 billion of private citizens’ money was lost I didn’t conflate the two and my point was a reply to you saying US capitalism collapsed after 1929 which it obviously didn’t. I didn't say it permanently collapsed. It recovered later on. But that took 30 years But the American economy was ruined for at least 10 years. The after effects were visible up to 1950. What do you think a collapsed system looks like? How can you say it didn't? What is your explanation? True but to invest in those ecosystems you need capital, and that capital comes from people. What's the real income inequality, wealth can be inflated even if you don't have real cash for it Yeah real income inequality would be worse for the bottom 50% because they don't have any assets. They are too busy with liabilities. My 10th standard small shop owner-parents couldn't afford to send me and my brother to a private school. We did our education in a Govt-aided Kannada medium school, where the fee was Rs 500/year. I did my engineering by borrowing Rs 9000/year from a relative and after I got my job, I took a personal loan for my brother's education. Today, both of us are doing really well. All my classmates in the government-aided schools who were in similar or far worse situations are doing well too. There is always a way out for people looking. People in India need to focus on themselves first and then worry about other things. Congrats man! Glad you made it out."
}