{
    "id": "1526f6e",
    "title": "Scammed by Swiggy. Support gives me copy paste answers.",
    "url": "https://www.reddit.com/r/india/comments/1526f6e/scammed_by_swiggy_support_gives_me_copy_paste/",
    "selftext": "I made an order on swiggy on 12th July, the delivery partner arrived and told me that the food was all spilled on his bike and left, attaching this picture of just tiles near my aparment complex. I called swiggy support immediately but they kept asking me for pictures even though I didn't even receive even a packet of food. I tried calling the delivery partner but they were not picking up.   \n\n\nI have been sending emails to swiggy since then and have only received copy paste responses, bearing no correlation to anything I said. I requested multiple times to talk to someone on a call but I just get ignored.   \n\n\nI would like to contact swiggy in some other way or file a complaint against them. If anyone knows how to move forward with this it would be of great help.   \n\n\nEven if I spend more money on this than the order of food itself I don't care. It's bizzare how easy it was for me to lose money whilst support just ignores any messages I write. \n\nhttps://preview.redd.it/fqc1uw0tvjcb1.png?width=439&format=png&auto=webp&s=5b18f1cae9ca989456b76a2bc1a4ae95e4584e48",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689610671.0,
    "convurl": "https://b.thumbs.redditmedia.com/59JJ-FrWr24aDdljUl65qDEEMj5V8OX13STvuIPxDNA.jpg",
    "comments": [
        "They do not care even an ounce. Let me tell you my experience. I ordered a full meal from a nearby restaurant. They sent a person who was looking aloof/distracted. I took my food and paid him in cash. He pocketed the money and never entered the delivery successful in app. I ate the food and rechecked my phone, it showed the delivery has failed and you need to pay additional charges, i.e. the complete amount of food which you ordered, which I already paid to delivery person. Around 850-900 bucks. I contacted customer support and explained it multiple times and they refused to do anything about it. Whenever I opened the app to order anything, the total amount added +950 additional charges of previous bill. I was tired of explaining again and again and again so I stopped using it. Did not pay them again because I honestly have paid for the meal and the guy pocketed the money and did not went back. Started using my mother's account to order anything I want. They mailed me 2 years later - 'Congratulations, your pending amount has been struck off, please come back'. Seriously this was the message. Haven't used the app since then. Been more than 2 years.",
        "Good to hear you didn't have to pay anything. I've been getting the same treatment from support but sadly I'm the one who has to get paid. \n\nIt's crazy how robotic their support is.",
        "Update: They gave me a refund after a 1 star review on the Google Play store, they finally looked at the blatant evidence."
    ],
    "cleaned_text": "scammed swiggy support gives copy paste answers made order swiggy th july delivery partner arrived told food spilled bike left attaching picture tiles near aparment complex called swiggy support immediately kept asking pictures even though didnt even receive even packet food tried calling delivery partner picking sending emails swiggy since received copy paste responses bearing correlation anything said requested multiple times talk someone call get ignored would like contact swiggy way file complaint anyone knows move forward would great help even spend money order food dont care bizzare easy lose money whilst support ignores messages write ",
    "cleaned_title": "scammed swiggy support gives copy paste answers",
    "cleaned_selftext": "made order swiggy th july delivery partner arrived told food spilled bike left attaching picture tiles near aparment complex called swiggy support immediately kept asking pictures even though didnt even receive even packet food tried calling delivery partner picking sending emails swiggy since received copy paste responses bearing correlation anything said requested multiple times talk someone call get ignored would like contact swiggy way file complaint anyone knows move forward would great help even spend money order food dont care bizzare easy lose money whilst support ignores messages write",
    "cleaned_comments": "care even ounce let tell experience ordered full meal nearby restaurant sent person looking aloofdistracted took food paid cash pocketed money never entered delivery successful app ate food rechecked phone showed delivery failed need pay additional charges ie complete amount food ordered already paid delivery person around bucks contacted customer support explained multiple times refused anything whenever opened app order anything total amount added additional charges previous bill tired explaining stopped using pay honestly paid meal guy pocketed money went back started using mothers account order anything want mailed years later congratulations pending amount struck please come back seriously message havent used app since years good hear didnt pay anything ive getting treatment support sadly im one get paid crazy robotic support update gave refund star review google play store finally looked blatant evidence",
    "light_cleaned_title": "Scammed by Swiggy. Support gives me copy paste answers.",
    "light_cleaned_selftext": "I made an order on swiggy on 12th July, the delivery partner arrived and told me that the food was all spilled on his bike and left, attaching this picture of just tiles near my aparment complex. I called swiggy support immediately but they kept asking me for pictures even though I didn't even receive even a packet of food. I tried calling the delivery partner but they were not picking up. I have been sending emails to swiggy since then and have only received copy paste responses, bearing no correlation to anything I said. I requested multiple times to talk to someone on a call but I just get ignored. I would like to contact swiggy in some other way or file a complaint against them. If anyone knows how to move forward with this it would be of great help. Even if I spend more money on this than the order of food itself I don't care. It's bizzare how easy it was for me to lose money whilst support just ignores any messages I write.",
    "light_cleaned_comments": "They do not care even an ounce. Let me tell you my experience. I ordered a full meal from a nearby restaurant. They sent a person who was looking aloof/distracted. I took my food and paid him in cash. He pocketed the money and never entered the delivery successful in app. I ate the food and rechecked my phone, it showed the delivery has failed and you need to pay additional charges, i.e. the complete amount of food which you ordered, which I already paid to delivery person. Around 850-900 bucks. I contacted customer support and explained it multiple times and they refused to do anything about it. Whenever I opened the app to order anything, the total amount added +950 additional charges of previous bill. I was tired of explaining again and again and again so I stopped using it. Did not pay them again because I honestly have paid for the meal and the guy pocketed the money and did not went back. Started using my mother's account to order anything I want. They mailed me 2 years later - 'Congratulations, your pending amount has been struck off, please come back'. Seriously this was the message. Haven't used the app since then. Been more than 2 years. Good to hear you didn't have to pay anything. I've been getting the same treatment from support but sadly I'm the one who has to get paid. It's crazy how robotic their support is. Update: They gave me a refund after a 1 star review on the Google Play store, they finally looked at the blatant evidence."
}