{
    "id": "185qcwg",
    "title": "The Broadcasting Bill 2023 wants to regulate OTT platforms, independent news publishers and content creators | MIB is bringing the old censorship engine of Cable TV to the digital realm",
    "url": "https://www.reddit.com/r/india/comments/185qcwg/the_broadcasting_bill_2023_wants_to_regulate_ott/",
    "selftext": "Hello!\n\nThe Ministry of Information and Broadcasting (MIB) recently released the Broadcasting Services (Regulation) Bill, 2023. The short version is that it is alarming. The long version is that it raises severe apprehensions about censorship in the realm of \"OTT\" broadcasting services, independent news publishers, and content creators. The bill [overhauls](https://www.thehindu.com/opinion/lead/old-censorship-on-a-new-medium/article67576676.ece) the old censorship engine for the digital age. \n\nFor a longer version,[ join us today at **05 PM IST**](https://us06web.zoom.us/meeting/register/tZcqdO2trjoqGN2CpptQ_PnxZj36gKdm1Zem#/registration) with Pallavi Sondhi (Advisor, Ikigai Law), Smith Mehta (Researcher, Professor University of Groningen) and IFF’s Associate Policy Counsel, Tejasi Panjiar, as they delve into the history of online content censorship, implications of including \"OTT\" broadcasting services under government regulation, threats to online free speech, and journalistic expression. \n\nHere’s a quick reading list for you before the call. Come with questions and join us in asking MIB to please #LetUsChill.\n\n1. IFF’s [First Read](https://internetfreedom.in/broadcast-services-bill-first-read/) of the Bill\n2. [*Old censorship on a new medium* ](https://www.thehindu.com/opinion/lead/old-censorship-on-a-new-medium/article67576676.ece)by Apar Gupta\n3. [*Regulating OTT: Draft Broadcasting Regulation Bill may be an attempt to control digital infrastructure*](https://indianexpress.com/article/opinion/columns/ease-of-control-9028225/) by Smith Mehta\n4. [*Here’s How The Broadcasting Services Regulation Bill, 2023, Impacts Streaming Services*](https://www.medianama.com/2023/11/223-broadcasting-services-regulation-bill-2023-streaming-services/) by Kamya Pandey \n5. [*India’s digital economy isn’t broken. What is I&B ministry fixing by bringing OTT under it?*](https://theprint.in/opinion/indias-digital-economy-isnt-broken-what-is-ib-ministry-fixing-by-bringing-ott-under-it/1855448/) by Varun Ramdas and Srishti Joshi\n\nIn case you are seeing this email post 5 PM today, check out and bookmark the live stream recordings on [Youtube](https://youtube.com/live/_OttnH7r-Xw?feature=share), [Twitter ](https://twitter.com/i/broadcasts/1YpKkwbpyqwKj)or [LinkedIn](https://www.linkedin.com/events/implicationsofthebroadcastingse7133788641494990848/theater/). This call is open to all! \n\nWe hope to see you there! ",
    "flair": "Policy/Economy",
    "score": 95,
    "num_comments": 7,
    "created_utc": 1701156244.0,
    "convurl": "https://external-preview.redd.it/pSC7PMw_1leUUe4I0VaYDHjwkXGoo1OvuvYxufVes8M.jpg?auto=webp&s=9e03353cae11c8ffe13684e6d11148f575dc1a92",
    "comments": [
        "Lol. 😂 What a shit show.",
        "It's just an authoritarian regime trying to be a wannabe-china. They'd make thoughtcrimes an actual thing if they could.",
        "Oh wow, to all the hyperglobalists out there, did globalisation really erode state sovereignty? I doubt. With every step towards technological advancement, Foucault's Panopticon is just becoming bigger and bigger!",
        "It's coming..... After erupee",
        "This is basically the govt simping to become another China.\n\nAt least China brought economic prosperity."
    ],
    "cleaned_text": "broadcasting bill wants regulate ott platforms independent news publishers content creators mib bringing old censorship engine cable tv digital realm hello ministry information broadcasting mib recently released broadcasting services regulation bill short version alarming long version raises severe apprehensions censorship realm ott broadcasting services independent news publishers content creators bill overhaulshttpswwwthehinducomopinionleadoldcensorshiponanewmediumarticleece old censorship engine digital age longer version join us today pm isthttpsuswebzoomusmeetingregistertzcqdotrjoqgncpptqpnxzjgkdmzemregistration pallavi sondhi advisor ikigai law smith mehta researcher professor university groningen iffs associate policy counsel tejasi panjiar delve history online content censorship implications including ott broadcasting services government regulation threats online free speech journalistic expression heres quick reading list call come questions join us asking mib please letuschill iffs first readhttpsinternetfreedominbroadcastservicesbillfirstread bill old censorship new medium httpswwwthehinducomopinionleadoldcensorshiponanewmediumarticleeceby apar gupta regulating ott draft broadcasting regulation bill may attempt control digital infrastructurehttpsindianexpresscomarticleopinioncolumnseaseofcontrol smith mehta heres broadcasting services regulation bill impacts streaming serviceshttpswwwmedianamacombroadcastingservicesregulationbillstreamingservices kamya pandey indias digital economy isnt broken ib ministry fixing bringing ott ithttpstheprintinopinionindiasdigitaleconomyisntbrokenwhatisibministryfixingbybringingottunderit varun ramdas srishti joshi case seeing email post pm today check bookmark live stream recordings youtubehttpsyoutubecomliveottnhrxwfeatureshare twitter httpstwittercomibroadcastsypkkwbpyqwkjor linkedinhttpswwwlinkedincomeventsimplicationsofthebroadcastingsetheater call open hope see ",
    "cleaned_title": "broadcasting bill wants regulate ott platforms independent news publishers content creators mib bringing old censorship engine cable tv digital realm",
    "cleaned_selftext": "hello ministry information broadcasting mib recently released broadcasting services regulation bill short version alarming long version raises severe apprehensions censorship realm ott broadcasting services independent news publishers content creators bill overhaulshttpswwwthehinducomopinionleadoldcensorshiponanewmediumarticleece old censorship engine digital age longer version join us today pm isthttpsuswebzoomusmeetingregistertzcqdotrjoqgncpptqpnxzjgkdmzemregistration pallavi sondhi advisor ikigai law smith mehta researcher professor university groningen iffs associate policy counsel tejasi panjiar delve history online content censorship implications including ott broadcasting services government regulation threats online free speech journalistic expression heres quick reading list call come questions join us asking mib please letuschill iffs first readhttpsinternetfreedominbroadcastservicesbillfirstread bill old censorship new medium httpswwwthehinducomopinionleadoldcensorshiponanewmediumarticleeceby apar gupta regulating ott draft broadcasting regulation bill may attempt control digital infrastructurehttpsindianexpresscomarticleopinioncolumnseaseofcontrol smith mehta heres broadcasting services regulation bill impacts streaming serviceshttpswwwmedianamacombroadcastingservicesregulationbillstreamingservices kamya pandey indias digital economy isnt broken ib ministry fixing bringing ott ithttpstheprintinopinionindiasdigitaleconomyisntbrokenwhatisibministryfixingbybringingottunderit varun ramdas srishti joshi case seeing email post pm today check bookmark live stream recordings youtubehttpsyoutubecomliveottnhrxwfeatureshare twitter httpstwittercomibroadcastsypkkwbpyqwkjor linkedinhttpswwwlinkedincomeventsimplicationsofthebroadcastingsetheater call open hope see",
    "cleaned_comments": "lol shit show authoritarian regime trying wannabechina theyd make thoughtcrimes actual thing could oh wow hyperglobalists globalisation really erode state sovereignty doubt every step towards technological advancement foucaults panopticon becoming bigger bigger coming erupee basically govt simping become another china least china brought economic prosperity",
    "light_cleaned_title": "The Broadcasting Bill 2023 wants to regulate OTT platforms, independent news publishers and content creators | MIB is bringing the old censorship engine of Cable TV to the digital realm",
    "light_cleaned_selftext": "Hello! The Ministry of Information and Broadcasting (MIB) recently released the Broadcasting Services (Regulation) Bill, 2023. The short version is that it is alarming. The long version is that it raises severe apprehensions about censorship in the realm of \"OTT\" broadcasting services, independent news publishers, and content creators. The bill [overhauls](https://www.thehindu.com/opinion/lead/old-censorship-on-a-new-medium/article67576676.ece) the old censorship engine for the digital age. For a longer version,[ join us today at **05 PM IST**](https://us06web.zoom.us/meeting/register/tZcqdO2trjoqGN2CpptQ_PnxZj36gKdm1Zem#/registration) with Pallavi Sondhi (Advisor, Ikigai Law), Smith Mehta (Researcher, Professor University of Groningen) and IFF’s Associate Policy Counsel, Tejasi Panjiar, as they delve into the history of online content censorship, implications of including \"OTT\" broadcasting services under government regulation, threats to online free speech, and journalistic expression. Here’s a quick reading list for you before the call. Come with questions and join us in asking MIB to please #LetUsChill. 1. IFF’s [First Read](https://internetfreedom.in/broadcast-services-bill-first-read/) of the Bill 2. [*Old censorship on a new medium* ](https://www.thehindu.com/opinion/lead/old-censorship-on-a-new-medium/article67576676.ece)by Apar Gupta 3. [*Regulating OTT: Draft Broadcasting Regulation Bill may be an attempt to control digital infrastructure*](https://indianexpress.com/article/opinion/columns/ease-of-control-9028225/) by Smith Mehta 4. [*Here’s How The Broadcasting Services Regulation Bill, 2023, Impacts Streaming Services*](https://www.medianama.com/2023/11/223-broadcasting-services-regulation-bill-2023-streaming-services/) by Kamya Pandey 5. [*India’s digital economy isn’t broken. What is I&B ministry fixing by bringing OTT under it?*](https://theprint.in/opinion/indias-digital-economy-isnt-broken-what-is-ib-ministry-fixing-by-bringing-ott-under-it/1855448/) by Varun Ramdas and Srishti Joshi In case you are seeing this email post 5 PM today, check out and bookmark the live stream recordings on [Youtube](https://youtube.com/live/_OttnH7r-Xw?feature=share), [Twitter ](https://twitter.com/i/broadcasts/1YpKkwbpyqwKj)or [LinkedIn](https://www.linkedin.com/events/implicationsofthebroadcastingse7133788641494990848/theater/). This call is open to all! We hope to see you there!",
    "light_cleaned_comments": "Lol. 😂 What a shit show. It's just an authoritarian regime trying to be a wannabe-china. They'd make thoughtcrimes an actual thing if they could. Oh wow, to all the hyperglobalists out there, did globalisation really erode state sovereignty? I doubt. With every step towards technological advancement, Foucault's Panopticon is just becoming bigger and bigger! It's coming..... After erupee This is basically the govt simping to become another China. At least China brought economic prosperity."
}