{
    "id": "13wfhi7",
    "title": "User manual or instructions needed",
    "url": "https://www.reddit.com/gallery/13wfhi7",
    "selftext": "Hey all,\n\nI recently rented this washing machine but got no user manual with it. It's a Kelvinator 6 kg front load model. The rental company just sent a YouTube video which is pretty useless. I tried doing one load of clothes but the spin only option did not dry the clothes as expected. Does anyone have the user manual or instructions for this machine? Please comment/DM as its usage and functions are very unclear. Specifically, how does one dry clothes in this machine?\n\nThanks in advance :)",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 4,
    "created_utc": 1685518605.0,
    "convurl": "https://i.redd.it/g3nsum26w53b1.jpg",
    "comments": [
        "Spin option in such models is supposed to squeeze water from clothes. You then dry it in the sun or shade, resulting in faster drying."
    ],
    "cleaned_text": "user manual instructions needed hey recently rented washing machine got user manual kelvinator kg front load model rental company sent youtube video pretty useless tried one load clothes spin option dry clothes expected anyone user manual instructions machine please commentdm usage functions unclear specifically one dry clothes machine thanks advance ",
    "cleaned_title": "user manual instructions needed",
    "cleaned_selftext": "hey recently rented washing machine got user manual kelvinator kg front load model rental company sent youtube video pretty useless tried one load clothes spin option dry clothes expected anyone user manual instructions machine please commentdm usage functions unclear specifically one dry clothes machine thanks advance",
    "cleaned_comments": "spin option models supposed squeeze water clothes dry sun shade resulting faster drying",
    "light_cleaned_title": "User manual or instructions needed",
    "light_cleaned_selftext": "Hey all, I recently rented this washing machine but got no user manual with it. It's a Kelvinator 6 kg front load model. The rental company just sent a YouTube video which is pretty useless. I tried doing one load of clothes but the spin only option did not dry the clothes as expected. Does anyone have the user manual or instructions for this machine? Please comment/DM as its usage and functions are very unclear. Specifically, how does one dry clothes in this machine? Thanks in advance :)",
    "light_cleaned_comments": "Spin option in such models is supposed to squeeze water from clothes. You then dry it in the sun or shade, resulting in faster drying."
}