{
    "id": "161m3fd",
    "title": "In Muzaffarnagar school, teacher gets kids to beat Muslim student, one by one",
    "url": "https://indianexpress.com/article/india/muzaffarnagar-school-teacher-makes-children-slap-muslim-student-class-8909734/lite/",
    "selftext": "What's happening in India? Reading the article makes me horrified for the innocent students who just want to study.",
    "flair": "Crime",
    "score": 500,
    "num_comments": 42,
    "created_utc": 1693027315.0,
    "convurl": "https://external-preview.redd.it/nd3Ed16uR7iK_mvb7isnfBt7DOaiFngn5t2drWGLMY4.jpg?auto=webp&s=e4b009a285762934c8aed3a0244a7cbd201951ad",
    "comments": [
        "We've seen how a small set of muslims have tarnished the name of the whole community. I dont know how hindus can prevent the same from happening to their community.",
        "Calling out the criminals from their wrongdoings constantly can help minimize damage and this apploes to all parties concerned. \n\nYes, no innocent person of a religion is responsible for a subset doing wrong, but that also means turning a blind eye to the crime committed, for it's only the innocent who get caught in between such things at the end of the day and nobody thinks or empathizes about them.",
        "The problem is also political isnt it. Political parties are shielding criminals.",
        "It may well be the case, but the moment you start associating such heinous acts directly with a political party even after knowing it could well be the case, but with no firm evidence, what happens is those who are supporters of such parties and were willing to sympathize with the poor boy may feel villainized and will then justify it saying whatever that was done was right.\n\nIn this context, as long as you keep it within religion, it's fine since there apparently seems to be proof that the teacher used a slur against the poor boy, thereby encouraging the innocent kids to slap him.\n\nI'm not saying that there's no involvement of any party at all. What I'm basically trying to explain is that whenever in such sensitive cases you make use of a pain point and associate the situation with it, those from who are unexpectef to, but are willing to sympathize will not and will justify the act.",
        "How can you even hit kids man? What kind of demon is she?",
        "A small subset does and a large subset sits quite initially and then starts looking the other way.",
        "And the way she did it and the dialogues she used, I feel petrified.",
        "She didn’t hit … kids hit each other ..",
        "She made the kids hit one kid",
        "The people in power (to save face) just say that criminals do not religion or religious intents, while cultivating the same intention in their followers. Amazing thing is, most people buy it. I think on some level they subscribe to the leaders' ideologies as well. Like when some RSS supporters were asked of their opinion on Godse and Gandhi's assassination, they simply said \"Hume kya? Hum to they hee ni waha\".",
        "It's the silence of large group that will snowball into a outright communal riots. This is the same style of silence usually seen among Muslims when their fellow members do hate crime in name of their religion. It's terrifying to see Hindus becoming the same.",
        "The difference between these kinda dumbfcuk teachers and the teachers on unacademy for example.",
        "Each other? No. This makes it sound like an altercation. It is literally teacher sanctioned bullying",
        "We might have reached the moon, but our minds are still in the gutter.",
        "Typical. Impossible to criticize Hindus without assigning blame to Muslims.",
        "Don't compare the mind with the asshole, although they belong to the same \"body\", one is always lower than the other. They are at the same level when the body is sleeping.",
        "Why you are so surprised",
        "Came across [this 3-minute clip](https://twitter.com/Joydas/status/1695073783743152228) referencing/contextualizing this situation. It's quite relevant/informative/educational.",
        "Because islam is the catalyst RSS and hindutva is betting on to flourish their hatred. If Muslims were to become liberal like how Hindus were 10 or 15 years ago, the right wing now wouldn't have reached this level.",
        "Aagaya chaddi yahaa bhi",
        "Dont be under the impression that this is something new post 2014. Hatred against minorities is imbibed in our society. Around 2008, when we were students in a city in Karnataka, we were having fun and being a little louder. Cops happened to be passing by and came upto investigate. Once they came to know we were Muslims, they started hurling abuses and said you don't come here to study, you come to become terrorists and many such hurtful things. Ofcourse, like many other ppl in India, their real God is money and once given the money, they scurried off.\n\n\nIts just all out in the open more now coz the perpetrators are being supported and indirectly and directly emcouraged by the Govt.",
        "Prime example of chaddis pretending to be liberal.",
        "> the moment you start associating such heinous acts directly with a political party even after knowing it could well be the case, but with no firm evidence, what happens is those who are supporters of such parties and were willing to sympathize with the poor boy may feel villainized and will then justify it saying whatever that was done was right.\n\nThose bastards can go fuck themselves",
        "Imagine the kinda loser one has to be in real life to publicly make comments like this.!",
        "I knew it was bad but so bad to beat up a Muslim student by his OWN classmates just for not knowing tables is ridiculous!!",
        "Wrong analogy.\n\nAssholes perform an exceptionally important function. They expel waste products from your system. Don't hate your asshole.\n\nThis is different. This is a cancer that is spreading everywhere. Your own cells, but mutated into something that is growing at the expense of the health and normal functioning of the whole organism.",
        "Hindus were liberal? Tell me you don't know history or society. Hindus were dragged into modernity by Ambedkar while all the hindus literally bayed for his blood. Dude had to resign from his post as law minister, despite the fact there's nobody more eligible than him, will never be, all for HINDU CODE BILL. And he despised Hinduism. Hindus were liberal? IS that why liberal intellectuals gang rape SC ST women? Is that why 2002 riots happened, and liberal hindus gangraped a pregnant woman? If not for British and anti caste movements which also dragged UC hindu women from hellhole misery only to be turned into brown karens of subcontinent, hindus are one of the most regressive people in world.",
        "Well it’s what happens when you bully others enough. They fight back. It sucks but it’s also reactive. Who can even turn Buddhists aggressive?",
        "Next BJP MP",
        "All jokes aside, this is a serious issue.",
        "You guys are disgusting! Stop with the \"small subset\" bs. Your country has been hell for minorities that have contributed to you past and present. I feel so bad for Muslims stuck in that hellhole.",
        "It's not for 'not knowing tables'. \n\nIt's for the other thing: being born into a Muslim family.",
        "Man this gotta stop. If it begins at such grassroot levels, what's gonna be the case in the next 10-20 years?",
        "The hate against Muslims has always been there, it's not new. \nChildren at a young age have been taught to hate muslims.\nCurrent dispensation is liked because it lets them get this hate out openly and now they are free to talk and act against Muslims.\nAny govt which does not allow them to vent out hate are appeasers of muslims.",
        "She will be let go, as she is a Brahmin and BJP govt wants to give a message that they stand with them.\n\nActs against Muslims are encouraged, promoted, promised protection and freedom to vent out the hate.\n\nAnyone who opposes is an appeaser, anti-national, pro pakistani.",
        "Bro, we know this to be the new norm in the country and I'm just hopeless about it.\n\nBut instilling these dangerous ideologies into innocent children is what pains me the most.",
        "About a week old news, nowadays she's being hailed as a champion by BJP for bringing glory to India.",
        "Wow, what has our country gone down to",
        "Country is still great, it's just our countrymen have gone cuckoo. I remember the old times when politicians were forced to keep a clean image. Nowadays, the more criminal background you have, the more you're supported.",
        "I'm just worried about the next-gen Indians"
    ],
    "cleaned_text": "muzaffarnagar school teacher gets kids beat muslim student one one whats happening india reading article makes horrified innocent students want study ",
    "cleaned_title": "muzaffarnagar school teacher gets kids beat muslim student one one",
    "cleaned_selftext": "whats happening india reading article makes horrified innocent students want study",
    "cleaned_comments": "weve seen small set muslims tarnished name whole community dont know hindus prevent happening community calling criminals wrongdoings constantly help minimize damage apploes parties concerned yes innocent person religion responsible subset wrong also means turning blind eye crime committed innocent get caught things end day nobody thinks empathizes problem also political isnt political parties shielding criminals may well case moment start associating heinous acts directly political party even knowing could well case firm evidence happens supporters parties willing sympathize poor boy may feel villainized justify saying whatever done right context long keep within religion fine since apparently seems proof teacher used slur poor boy thereby encouraging innocent kids slap im saying theres involvement party im basically trying explain whenever sensitive cases make use pain point associate situation unexpectef willing sympathize justify act even hit kids man kind demon small subset large subset sits quite initially starts looking way way dialogues used feel petrified didnt hit kids hit made kids hit one kid people power save face say criminals religion religious intents cultivating intention followers amazing thing people buy think level subscribe leaders ideologies well like rss supporters asked opinion godse gandhis assassination simply said hume kya hum hee ni waha silence large group snowball outright communal riots style silence usually seen among muslims fellow members hate crime name religion terrifying see hindus becoming difference kinda dumbfcuk teachers teachers unacademy example makes sound like altercation literally teacher sanctioned bullying might reached moon minds still gutter typical impossible criticize hindus without assigning blame muslims dont compare mind asshole although belong body one always lower level body sleeping surprised came across minute cliphttpstwittercomjoydasstatus referencingcontextualizing situation quite relevantinformativeeducational islam catalyst rss hindutva betting flourish hatred muslims become liberal like hindus years ago right wing wouldnt reached level aagaya chaddi yahaa bhi dont impression something new post hatred minorities imbibed society around students city karnataka fun little louder cops happened passing came upto investigate came know muslims started hurling abuses said dont come study come become terrorists many hurtful things ofcourse like many ppl india real god money given money scurried open coz perpetrators supported indirectly directly emcouraged govt prime example chaddis pretending liberal moment start associating heinous acts directly political party even knowing could well case firm evidence happens supporters parties willing sympathize poor boy may feel villainized justify saying whatever done right bastards go fuck imagine kinda loser one real life publicly make comments like knew bad bad beat muslim student classmates knowing tables ridiculous wrong analogy assholes perform exceptionally important function expel waste products system dont hate asshole different cancer spreading everywhere cells mutated something growing expense health normal functioning whole organism hindus liberal tell dont know history society hindus dragged modernity ambedkar hindus literally bayed blood dude resign post law minister despite fact theres nobody eligible never hindu code bill despised hinduism hindus liberal liberal intellectuals gang rape sc st women riots happened liberal hindus gangraped pregnant woman british anti caste movements also dragged uc hindu women hellhole misery turned brown karens subcontinent hindus one regressive people world well happens bully others enough fight back sucks also reactive even turn buddhists aggressive next bjp mp jokes aside serious issue guys disgusting stop small subset bs country hell minorities contributed past present feel bad muslims stuck hellhole knowing tables thing born muslim family man got ta stop begins grassroot levels whats gon na case next years hate muslims always new children young age taught hate muslims current dispensation liked lets get hate openly free talk act muslims govt allow vent hate appeasers muslims let go brahmin bjp govt wants give message stand acts muslims encouraged promoted promised protection freedom vent hate anyone opposes appeaser antinational pro pakistani bro know new norm country im hopeless instilling dangerous ideologies innocent children pains week old news nowadays shes hailed champion bjp bringing glory india wow country gone country still great countrymen gone cuckoo remember old times politicians forced keep clean image nowadays criminal background youre supported im worried nextgen indians",
    "light_cleaned_title": "In Muzaffarnagar school, teacher gets kids to beat Muslim student, one by one",
    "light_cleaned_selftext": "What's happening in India? Reading the article makes me horrified for the innocent students who just want to study.",
    "light_cleaned_comments": "We've seen how a small set of muslims have tarnished the name of the whole community. I dont know how hindus can prevent the same from happening to their community. Calling out the criminals from their wrongdoings constantly can help minimize damage and this apploes to all parties concerned. Yes, no innocent person of a religion is responsible for a subset doing wrong, but that also means turning a blind eye to the crime committed, for it's only the innocent who get caught in between such things at the end of the day and nobody thinks or empathizes about them. The problem is also political isnt it. Political parties are shielding criminals. It may well be the case, but the moment you start associating such heinous acts directly with a political party even after knowing it could well be the case, but with no firm evidence, what happens is those who are supporters of such parties and were willing to sympathize with the poor boy may feel villainized and will then justify it saying whatever that was done was right. In this context, as long as you keep it within religion, it's fine since there apparently seems to be proof that the teacher used a slur against the poor boy, thereby encouraging the innocent kids to slap him. I'm not saying that there's no involvement of any party at all. What I'm basically trying to explain is that whenever in such sensitive cases you make use of a pain point and associate the situation with it, those from who are unexpectef to, but are willing to sympathize will not and will justify the act. How can you even hit kids man? What kind of demon is she? A small subset does and a large subset sits quite initially and then starts looking the other way. And the way she did it and the dialogues she used, I feel petrified. She didn’t hit … kids hit each other .. She made the kids hit one kid The people in power (to save face) just say that criminals do not religion or religious intents, while cultivating the same intention in their followers. Amazing thing is, most people buy it. I think on some level they subscribe to the leaders' ideologies as well. Like when some RSS supporters were asked of their opinion on Godse and Gandhi's assassination, they simply said \"Hume kya? Hum to they hee ni waha\". It's the silence of large group that will snowball into a outright communal riots. This is the same style of silence usually seen among Muslims when their fellow members do hate crime in name of their religion. It's terrifying to see Hindus becoming the same. The difference between these kinda dumbfcuk teachers and the teachers on unacademy for example. Each other? No. This makes it sound like an altercation. It is literally teacher sanctioned bullying We might have reached the moon, but our minds are still in the gutter. Typical. Impossible to criticize Hindus without assigning blame to Muslims. Don't compare the mind with the asshole, although they belong to the same \"body\", one is always lower than the other. They are at the same level when the body is sleeping. Why you are so surprised Came across [this 3-minute clip](https://twitter.com/Joydas/status/1695073783743152228) referencing/contextualizing this situation. It's quite relevant/informative/educational. Because islam is the catalyst RSS and hindutva is betting on to flourish their hatred. If Muslims were to become liberal like how Hindus were 10 or 15 years ago, the right wing now wouldn't have reached this level. Aagaya chaddi yahaa bhi Dont be under the impression that this is something new post 2014. Hatred against minorities is imbibed in our society. Around 2008, when we were students in a city in Karnataka, we were having fun and being a little louder. Cops happened to be passing by and came upto investigate. Once they came to know we were Muslims, they started hurling abuses and said you don't come here to study, you come to become terrorists and many such hurtful things. Ofcourse, like many other ppl in India, their real God is money and once given the money, they scurried off. Its just all out in the open more now coz the perpetrators are being supported and indirectly and directly emcouraged by the Govt. Prime example of chaddis pretending to be liberal. > the moment you start associating such heinous acts directly with a political party even after knowing it could well be the case, but with no firm evidence, what happens is those who are supporters of such parties and were willing to sympathize with the poor boy may feel villainized and will then justify it saying whatever that was done was right. Those bastards can go fuck themselves Imagine the kinda loser one has to be in real life to publicly make comments like this.! I knew it was bad but so bad to beat up a Muslim student by his OWN classmates just for not knowing tables is ridiculous!! Wrong analogy. Assholes perform an exceptionally important function. They expel waste products from your system. Don't hate your asshole. This is different. This is a cancer that is spreading everywhere. Your own cells, but mutated into something that is growing at the expense of the health and normal functioning of the whole organism. Hindus were liberal? Tell me you don't know history or society. Hindus were dragged into modernity by Ambedkar while all the hindus literally bayed for his blood. Dude had to resign from his post as law minister, despite the fact there's nobody more eligible than him, will never be, all for HINDU CODE BILL. And he despised Hinduism. Hindus were liberal? IS that why liberal intellectuals gang rape SC ST women? Is that why 2002 riots happened, and liberal hindus gangraped a pregnant woman? If not for British and anti caste movements which also dragged UC hindu women from hellhole misery only to be turned into brown karens of subcontinent, hindus are one of the most regressive people in world. Well it’s what happens when you bully others enough. They fight back. It sucks but it’s also reactive. Who can even turn Buddhists aggressive? Next BJP MP All jokes aside, this is a serious issue. You guys are disgusting! Stop with the \"small subset\" bs. Your country has been hell for minorities that have contributed to you past and present. I feel so bad for Muslims stuck in that hellhole. It's not for 'not knowing tables'. It's for the other thing: being born into a Muslim family. Man this gotta stop. If it begins at such grassroot levels, what's gonna be the case in the next 10-20 years? The hate against Muslims has always been there, it's not new. Children at a young age have been taught to hate muslims. Current dispensation is liked because it lets them get this hate out openly and now they are free to talk and act against Muslims. Any govt which does not allow them to vent out hate are appeasers of muslims. She will be let go, as she is a Brahmin and BJP govt wants to give a message that they stand with them. Acts against Muslims are encouraged, promoted, promised protection and freedom to vent out the hate. Anyone who opposes is an appeaser, anti-national, pro pakistani. Bro, we know this to be the new norm in the country and I'm just hopeless about it. But instilling these dangerous ideologies into innocent children is what pains me the most. About a week old news, nowadays she's being hailed as a champion by BJP for bringing glory to India. Wow, what has our country gone down to Country is still great, it's just our countrymen have gone cuckoo. I remember the old times when politicians were forced to keep a clean image. Nowadays, the more criminal background you have, the more you're supported. I'm just worried about the next-gen Indians"
}