{
    "id": "16d2qil",
    "title": "My 2 cents on sanatan dharma row",
    "url": "https://www.reddit.com/r/india/comments/16d2qil/my_2_cents_on_sanatan_dharma_row/",
    "selftext": "I don't think they are dumb enough to make such statements so suddenly just before crucial elections. They are worried about their victory in 2024 even more than we are.\n\nI think they are using the same strategy what advani used in the late 1980s and 90s. In late 1970s and early 80s, when hindutva was still a fringe idea and secularism was the norm, advani was unsure if hindutva will have any appeal, so bjp adopted soft hindutva, but that strategy proved ineffective. \n\nSo by late 1980s they adopted the \"hard hindutva between elections, soft hindutva during elections\" strategy, where they would saturate the air with hard hindutva (Ram mandir issue) and then fight elections on soft hindutva. They were effectively shifting overton window towards the right.\n\n(Mohak made a beautiful video on this: https://youtu.be/YbPTf0UbRFY?si=KnUu68aSjWVjmzlr)\n\nAnd even tho it might sound counterintuitive, this strategy worked, bjp's tally kept climbing and climbing since 1984.\n\nAnd I think INDIA alliance is doing the same with Indian version of wokeism and social justice: saturate the air with hardcore Indian version of wokeism between elections and then fight on secularism during elections. \n\nBy Indian version of wokeism I mean \"Brahmans are oppressors and have been oppressing Dalits and minorities and women for thousands of years and sanatana Dharma must be eradicated\".\n\nReplace brahman with whites, Dalits with blacks and sanatana Dharma with Christianity and see how similar it is to American wokeism. And American wokeism is very populist !!!\n\nHowever there is a limit to how hard you can go without shooting yourself on the foot: talking about demolition of Babri mosque isn't electorally suicidal but assassinating Gandhi was. \n\nIt might explain why all the extreme statements are being made in South India but up in the north, politicians distanced themselves and are talking about Sarva dharma sama bhava [all religions are equal] which itself is a very extreme statement given the religious fanaticism in North India.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694154162.0,
    "convurl": "https://external-preview.redd.it/6HK8Yor7NSAojwo90mlKsg5_VJl4MD-1-cbooOiVUM8.jpg?auto=webp&s=31d9d92257c9da6dd78e87e0b436c38f8d63ca62",
    "comments": [
        "I don't think this has anything to do with INDIA's views, and it's all on DMK. I dont even think Stalin even planned all this. Junior Stalin made comments and it went viral and out of control",
        "I don't think this has anything to do with INDIA's campaign strategy, and it's all on DMK. I dont even think MK Stalin planned all this. Junior Stalin made comments and it went viral and out of control",
        "If saying ever religion is equal or every person is equal to be considered taboo, i have no words for the future of India. Why does one vote to these morons is beyond my comprehension. These last 10 years had really demotivated me about the concept of India when one part of India is dragging the gains made all these years. South India is far peaceful n developed than North India due to these ideologies of equality. Why is that such a difficult concept in North?",
        "wokeism is a retarded term right-wing losers have come up with to refer to social justice. Also there is no market for the superficial liberal \"wokeism\" in India. \n\nWe have seen Mandal politics in India. Stalin has been championing Social Justice politics since he got into power. Nitish is hard on the caste census. And INC has a Dalit as president. I think they are pushing towards that angle now.\n\nIMO Mandal politics is the only counter to Kamandal politics. And caste census is the key to this, but even INC isnt as dedicated to it."
    ],
    "cleaned_text": "cents sanatan dharma row dont think dumb enough make statements suddenly crucial elections worried victory even think using strategy advani used late late early hindutva still fringe idea secularism norm advani unsure hindutva appeal bjp adopted soft hindutva strategy proved ineffective late adopted hard hindutva elections soft hindutva elections strategy would saturate air hard hindutva ram mandir issue fight elections soft hindutva effectively shifting overton window towards right mohak made beautiful video even tho might sound counterintuitive strategy worked bjps tally kept climbing climbing since think india alliance indian version wokeism social justice saturate air hardcore indian version wokeism elections fight secularism elections indian version wokeism mean brahmans oppressors oppressing dalits minorities women thousands years sanatana dharma must eradicated replace brahman whites dalits blacks sanatana dharma christianity see similar american wokeism american wokeism populist however limit hard go without shooting foot talking demolition babri mosque isnt electorally suicidal assassinating gandhi might explain extreme statements made south india north politicians distanced talking sarva dharma sama bhava religions equal extreme statement given religious fanaticism north india ",
    "cleaned_title": "cents sanatan dharma row",
    "cleaned_selftext": "dont think dumb enough make statements suddenly crucial elections worried victory even think using strategy advani used late late early hindutva still fringe idea secularism norm advani unsure hindutva appeal bjp adopted soft hindutva strategy proved ineffective late adopted hard hindutva elections soft hindutva elections strategy would saturate air hard hindutva ram mandir issue fight elections soft hindutva effectively shifting overton window towards right mohak made beautiful video even tho might sound counterintuitive strategy worked bjps tally kept climbing climbing since think india alliance indian version wokeism social justice saturate air hardcore indian version wokeism elections fight secularism elections indian version wokeism mean brahmans oppressors oppressing dalits minorities women thousands years sanatana dharma must eradicated replace brahman whites dalits blacks sanatana dharma christianity see similar american wokeism american wokeism populist however limit hard go without shooting foot talking demolition babri mosque isnt electorally suicidal assassinating gandhi might explain extreme statements made south india north politicians distanced talking sarva dharma sama bhava religions equal extreme statement given religious fanaticism north india",
    "cleaned_comments": "dont think anything indias views dmk dont even think stalin even planned junior stalin made comments went viral control dont think anything indias campaign strategy dmk dont even think mk stalin planned junior stalin made comments went viral control saying ever religion equal every person equal considered taboo words future india one vote morons beyond comprehension last years really demotivated concept india one part india dragging gains made years south india far peaceful n developed north india due ideologies equality difficult concept north wokeism retarded term rightwing losers come refer social justice also market superficial liberal wokeism india seen mandal politics india stalin championing social justice politics since got power nitish hard caste census inc dalit president think pushing towards angle imo mandal politics counter kamandal politics caste census key even inc isnt dedicated",
    "light_cleaned_title": "My 2 cents on sanatan dharma row",
    "light_cleaned_selftext": "I don't think they are dumb enough to make such statements so suddenly just before crucial elections. They are worried about their victory in 2024 even more than we are. I think they are using the same strategy what advani used in the late 1980s and 90s. In late 1970s and early 80s, when hindutva was still a fringe idea and secularism was the norm, advani was unsure if hindutva will have any appeal, so bjp adopted soft hindutva, but that strategy proved ineffective. So by late 1980s they adopted the \"hard hindutva between elections, soft hindutva during elections\" strategy, where they would saturate the air with hard hindutva (Ram mandir issue) and then fight elections on soft hindutva. They were effectively shifting overton window towards the right. (Mohak made a beautiful video on this: And even tho it might sound counterintuitive, this strategy worked, bjp's tally kept climbing and climbing since 1984. And I think INDIA alliance is doing the same with Indian version of wokeism and social justice: saturate the air with hardcore Indian version of wokeism between elections and then fight on secularism during elections. By Indian version of wokeism I mean \"Brahmans are oppressors and have been oppressing Dalits and minorities and women for thousands of years and sanatana Dharma must be eradicated\". Replace brahman with whites, Dalits with blacks and sanatana Dharma with Christianity and see how similar it is to American wokeism. And American wokeism is very populist !!! However there is a limit to how hard you can go without shooting yourself on the foot: talking about demolition of Babri mosque isn't electorally suicidal but assassinating Gandhi was. It might explain why all the extreme statements are being made in South India but up in the north, politicians distanced themselves and are talking about Sarva dharma sama bhava [all religions are equal] which itself is a very extreme statement given the religious fanaticism in North India.",
    "light_cleaned_comments": "I don't think this has anything to do with INDIA's views, and it's all on DMK. I dont even think Stalin even planned all this. Junior Stalin made comments and it went viral and out of control I don't think this has anything to do with INDIA's campaign strategy, and it's all on DMK. I dont even think MK Stalin planned all this. Junior Stalin made comments and it went viral and out of control If saying ever religion is equal or every person is equal to be considered taboo, i have no words for the future of India. Why does one vote to these morons is beyond my comprehension. These last 10 years had really demotivated me about the concept of India when one part of India is dragging the gains made all these years. South India is far peaceful n developed than North India due to these ideologies of equality. Why is that such a difficult concept in North? wokeism is a retarded term right-wing losers have come up with to refer to social justice. Also there is no market for the superficial liberal \"wokeism\" in India. We have seen Mandal politics in India. Stalin has been championing Social Justice politics since he got into power. Nitish is hard on the caste census. And INC has a Dalit as president. I think they are pushing towards that angle now. IMO Mandal politics is the only counter to Kamandal politics. And caste census is the key to this, but even INC isnt as dedicated to it."
}