{
    "id": "vtynpt",
    "title": "Bi-Weekly Food and Recipes Thread",
    "url": "https://www.reddit.com/r/india/comments/vtynpt/biweekly_food_and_recipes_thread/",
    "selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here!\n\nFeel free to share recipes, eating places, pictures, experiences etc.\n\n**Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/tti3fyiqw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=899972afbc4bab665798a0f5917960a98ec4f4d5",
    "flair": "Scheduled",
    "score": 7,
    "num_comments": 8,
    "created_utc": 1657243809,
    "convurl": "https://b.thumbs.redditmedia.com/WcdevDgQq9IkSeWWQ9t6-KoTaVUzv88FYBi0lFnj8mc.jpg",
    "comments": [
        "Hello, I am an American with an Indian girlfriend.  I'm interested in learning to make authentic (not completely bastardized by English or Americans) curry dishes (vegetarian for her,  any for me). Is anyone able to supply me with an amazing recipe or two? I'm learning that timing is just as,  if not more,  imposter as ingredient freshness and selection. I welcome all advice and am hoping to surprise her and her family with a good meal.",
        "Is she a north indian or south indian?",
        "Matar-paneer, potato curry.",
        "Bro it's Aloo ki sabzi not patato curry",
        "Try local YT channels like Kavita's Kitchen etc., There are plenty. Ranveer Brar also has a few good ones.",
        "They're from Northern India, a city in Punjab.",
        "Thanks",
        "Make chick pea curry. ( Chana masala / Punjabi chhole)  look for Sanjeev Kapoor, or  Tarla dalal's recipe on you tube. They usually have English subtitles. Or there are many other recipes of chana masala on you tube. The recipe is easy to follow , even more if you can get readymade blend of chana masala spice from Indian store ."
    ],
    "cleaned_text": "biweekly food recipes thread foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly food recipes thread",
    "cleaned_selftext": "foodies rindia tried new dish experimented cooking lived tell story share feel free share recipes eating places pictures experiences etc food recipes thread posted every two weeks friday mornings old threadshttpsredditcomrindiasearchqbiweeklyfoodandrecipesthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "hello american indian girlfriend im interested learning make authentic completely bastardized english americans curry dishes vegetarian anyone able supply amazing recipe two im learning timing imposter ingredient freshness selection welcome advice hoping surprise family good meal north indian south indian matarpaneer potato curry bro aloo ki sabzi patato curry try local yt channels like kavitas kitchen etc plenty ranveer brar also good ones theyre northern india city punjab thanks make chick pea curry chana masala punjabi chhole look sanjeev kapoor tarla dalals recipe tube usually english subtitles many recipes chana masala tube recipe easy follow even get readymade blend chana masala spice indian store",
    "light_cleaned_title": "Bi-Weekly Food and Recipes Thread",
    "light_cleaned_selftext": "Foodies of r/India, tried out a new dish? Experimented with cooking yourself and lived to tell the story? Share here! Feel free to share recipes, eating places, pictures, experiences etc. **Food and Recipes Thread is posted every two weeks on Friday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Food+and+Recipes+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Hello, I am an American with an Indian girlfriend. I'm interested in learning to make authentic (not completely bastardized by English or Americans) curry dishes (vegetarian for her, any for me). Is anyone able to supply me with an amazing recipe or two? I'm learning that timing is just as, if not more, imposter as ingredient freshness and selection. I welcome all advice and am hoping to surprise her and her family with a good meal. Is she a north indian or south indian? Matar-paneer, potato curry. Bro it's Aloo ki sabzi not patato curry Try local YT channels like Kavita's Kitchen etc., There are plenty. Ranveer Brar also has a few good ones. They're from Northern India, a city in Punjab. Thanks Make chick pea curry. ( Chana masala / Punjabi chhole) look for Sanjeev Kapoor, or Tarla dalal's recipe on you tube. They usually have English subtitles. Or there are many other recipes of chana masala on you tube. The recipe is easy to follow , even more if you can get readymade blend of chana masala spice from Indian store ."
}