{
    "id": "1f78bfv",
    "title": "2024 is a wild year.",
    "url": "https://i.redd.it/9bt5vrbiqemd1.jpeg",
    "selftext": "Himachal is facing a financial crisis. State employees' salaries are delayed. The CM announced that neither he nor the cabinet will take any salary for the next two months, requesting the MLAs to do the same.\n\nIG it's thier way to convey to govt employees that, \"Look, even we aren't taking salaries, so don't complain if yours are delayed.\"",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1725287834.0,
    "convurl": "https://i.redd.it/9bt5vrbiqemd1.jpeg",
    "comments": [
        "This is the governance model everyone wants for the nation though, right? While they all go to a capitalist paradise like Germany? The reason we will never become a developed country is not because of the politicians, but rather because of the people. We don’t want to become a developed country. We are happy living in a feudal society where we bootlick politicians and expect them to throw us a few crumbs each month in return.",
        "There needs to be a law to check the amount of freebies govts dole out. Every party is guilty of this.",
        "We voted them to power (I personally did not vote for them), we deserve it - everyone fell for OPS, no one did not ask for once where will the money come from\n\nNow we have electricity subsidies gone, reduced number of jobs, I even read on twitter (from MBBS doc in HP) that they reduced stipend from 20k to 17k (info needs to be verified). Im sure they would be cutting costs from other essentials too\n\nPeople don't understand that there is no such thing as free money, the next generation will have to pay the price , the govt. will go out in 5 years",
        "Omg how will they survive? Thoughts and prayers 🙏😔",
        "This!!!"
    ],
    "cleaned_text": "wild year himachal facing financial crisis state employees salaries delayed cm announced neither cabinet take salary next two months requesting mlas ig thier way convey govt employees look even arent taking salaries dont complain delayed ",
    "cleaned_title": "wild year",
    "cleaned_selftext": "himachal facing financial crisis state employees salaries delayed cm announced neither cabinet take salary next two months requesting mlas ig thier way convey govt employees look even arent taking salaries dont complain delayed",
    "cleaned_comments": "governance model everyone wants nation though right go capitalist paradise like germany reason never become developed country politicians rather people dont want become developed country happy living feudal society bootlick politicians expect throw us crumbs month return needs law check amount freebies govts dole every party guilty voted power personally vote deserve everyone fell ops one ask money come electricity subsidies gone reduced number jobs even read twitter mbbs doc hp reduced stipend k k info needs verified im sure would cutting costs essentials people dont understand thing free money next generation pay price govt go years omg survive thoughts prayers",
    "light_cleaned_title": "2024 is a wild year.",
    "light_cleaned_selftext": "Himachal is facing a financial crisis. State employees' salaries are delayed. The CM announced that neither he nor the cabinet will take any salary for the next two months, requesting the MLAs to do the same. IG it's thier way to convey to govt employees that, \"Look, even we aren't taking salaries, so don't complain if yours are delayed.\"",
    "light_cleaned_comments": "This is the governance model everyone wants for the nation though, right? While they all go to a capitalist paradise like Germany? The reason we will never become a developed country is not because of the politicians, but rather because of the people. We don’t want to become a developed country. We are happy living in a feudal society where we bootlick politicians and expect them to throw us a few crumbs each month in return. There needs to be a law to check the amount of freebies govts dole out. Every party is guilty of this. We voted them to power (I personally did not vote for them), we deserve it - everyone fell for OPS, no one did not ask for once where will the money come from Now we have electricity subsidies gone, reduced number of jobs, I even read on twitter (from MBBS doc in HP) that they reduced stipend from 20k to 17k (info needs to be verified). Im sure they would be cutting costs from other essentials too People don't understand that there is no such thing as free money, the next generation will have to pay the price , the govt. will go out in 5 years Omg how will they survive? Thoughts and prayers 🙏😔 This!!!"
}