{
    "id": "wnxhvs",
    "title": "There is this thing about Indian traffic that really messes with your head after you live abroad for a while.",
    "url": "https://www.reddit.com/r/india/comments/wnxhvs/there_is_this_thing_about_indian_traffic_that/",
    "selftext": "[Traffic lanes](https://preview.redd.it/c57xm0wlylh91.jpg?width=300&amp;format=pjpg&amp;auto=webp&amp;s=2a7534f5607c7167c267b7bf76fa8be2c8496043)\n\nI was born and brought up in India. I spent 23 years of my life in India. I think I drove a bike for 7 years of those 23 years in India(you can get a gearless driver's license at the age of 16).\n\nI assure you, I am not one of those annoying NRIs who acts out of touch with reality when they returns back to India. I am about as Desi as the next person :)\n\nNow, I have been driving a car in America for the past 5 years. So I am used to driving in America and I am used to American traffic. I don't travel to India that often. So I often forget how Indian traffic works till I come back to India.\n\nHere in America when a car in the lane next to yours wants to merge into your lane, they turn on its indicator and wait for 5 to 15 seconds for you to notice. You have two options at this point, you either accelerate and go past that car or you slow down a bit. If you accelerate they merge behind you. If you slow down they merge in front of you. If you don't do anything and travel at the same speed in parallel to that other car or worse, if you match their speed, they will yell at you a lot of times. They flip you off. Basically, it's a dick move to do. It's like asking for trouble. Plenty of people do this shit in traffic in America. But they do it consciously, willfully out of spite. Accelerating ahead of the car that wants to merge into your lane is also a dick move, but it is not as bad as not changing your speed or matching the speed of the car that wants to merge into your lane.\n\nNow in India, nobody cares about lanes. When I used to drive in India before I left for the US, I used to not care about lanes too. When I say lanes, I don't mean the two lanes on the road for traffic going in opposite directions. I mean the lanes for vehicles going in the same direction. There is a broken white line in the middle of the road which marks these lanes. People in India literally travel on top of that white line. Half of their vehicle is in one lane and the other half is in the other lane. And people drive on that white line for hours on end.\n\n[The problem I am describing](https://preview.redd.it/96annvtm0mh91.png?width=1264&amp;format=png&amp;auto=webp&amp;s=0ff06d2a9df0e0bcbba2eb2e3d4bb1183cdcfb13)\n\nIf you are used to the way US traffic works, this really really fucks with your brain. Cause you think the person in front of you is trying to merge in and you slow down for them and they don't merge into your lane. Because you slowed down, the distance between your vehicle and the vehicle behind you decreases. That leads to a situation where you would collide with the vehicle behind you if they are not anticipating that you would slow down. Most of the time, since you are the only person who hasn't driven in India for a long time, you will be the only person slowing down. The person behind you won't slow down.  I came very close, to having an accident because of this in 2019. It scared the living shit out of me back then. It took a lot of effort to adjust my brain to the way Indian traffic works. And it took a lot of conscious effort when I went back to America to start driving according to the lane system there.\n\nI understand that we have plenty of bikes on the road. In America, 99% of the traffic is non-two-wheeler traffic. But people here in America pretend bikes are cars and they give them as much space as a car. People might stay that is a waste of space, but bikes typically go through the gaps between cars and other big vehicles, and the space that all the car drivers give them, they relinquish it back frequently. But in India, the problem is the opposite of that. Even cars behave like they are motorbikes and try to squeeze in the gap between two vehicles. But cars are not as nimble as bikes, once a car gets into the space between two cars in two separate lanes, it has to sit there till it reaches its destination. So the space in which 2 cars could fit is entirely taken up by a single car.",
    "flair": "Rant / Vent",
    "score": 76,
    "num_comments": 53,
    "created_utc": 1660451524,
    "convurl": "https://b.thumbs.redditmedia.com/AorJ0oenmGc20gcRwMkIPLgZAqYhFrPlAYzqvzWScuw.jpg",
    "comments": [
        "People say that if you learn to drive in India, you can drive anywhere else in the world :p I belive we are very versatile drivers.",
        "For Indians, the lane markings are just road decorations.",
        "Or suggestions like \"hey, you could be within these lines. But you do you\"",
        "Spot on my friend.\n\nThe first time i came back from NL to India after emigrating, even the uber ride from airport to home made me nervous. Nobody uses turn indicators, bikes autos come out of nowhere and my uber was driving like a demon on wheels.\n\nIt took me a week to get back to my usual driving rhythm here but for a week i felt so overwhelmed.\n\nlearning to drive in india is basically like a super power.",
        "We are made to practice driving in the case of an apocalypse",
        "We're not. We just get away with stupid shit like OP mentioned because there are no enforcement of any driving rules. In fact, you're considered a shithead if you actually follow the rules and it is actively in your own interest not to do so.\n\nA bunch of folks who do the same shenanigans in the US end up with a wondrous set of traffic tickets.",
        "There is a reason for this. The right corner or median is from where surprise cows jump on the road. Do you know what happens when you hit a cow in India? Villagers have made it a sport. Let cows loose, collect money if it gets hit. If you are the wrong name or caste, prison time. The left is where the asshole drivers go the opposite way with headlights on. Stay safe, drive on the line.",
        "try teaching the lane concept to ola drivers and auto drivers. they are not educated, they don't care. also there's no penalizing factor for flouting traffic rules. so wat u get is uneducated / anmialistic traffic. if you can block, squeeze ur vehicle and get ahead, you can do that. survival of the fittest is very visible in the roads. \n\nalso, the sooner u understand this, the sooner u will feel at peace (while driving).",
        "NL?",
        "This is completely wrong. I am a seasoned driver in India, but I shit bricks when driving in the US. The reason is that in the US there are tons of rules that simply don't exist here, and you have to be acutely aware of them all the time. The merge protocol that OP mentioned is one of them. There are rules around who gets right of way at a 4-way intersection where there is no signal. There are rules around not blocking intersections (that is even if the signal is green for you, you CANNOT move until you're sure you'll make it to the other side without blocking the perpendicular traffic). There are rules around what happens when a school bus stops in front of you. A million rules like this.  \n\nAnd worst of all, you are screwed if you make a mistake. You cannot give 200 rupees chai-pani money to the traffic cop and move on as if nothing happened.",
        "Agree to that, but once you're used to chaos, it's easier to get used to being disciplined. Also it's easier for you to react faster if someone goes wrong",
        "Nobody follows lane discipline in India",
        "Netherlands",
        "I drove in India for years and then have been driving for years in the US and I don't think apart from vehicle control like steering and breaking, almost nothing else is transferable to American driving. \n\nIf they were, Indians would have way less accidents than Americans. While reaction times might be a factor in emergencies, all the bad habits learnt while driving in India would increase the chance for an accident so. \n\nHonestly I don't think I'm brave enough to drive in India again after being so used to American driving. And I drive almost 30k miles or 50k km per year in the US.\n\nIt's just way way more sensible way of driving in the US, even with it's quirks and rules and etiquette.",
        "Which village are you talking about? Having driven over 2.5 lakh kms across the country i have had only one incident of a sudden animal appearance on the road, and even that was a neel gaay on an under construction highway in the middle of the night with no scammer or person around. So you are advising people to drive incorrectly on the line, but curious if this is driven by hearsay or first hand experience.",
        "*Tu chala le thik se lane ke andar*. I will drive where I feel safe.",
        "There is an old quote: “If you can drive in India, you can drive anywhere”.\n\nI think the corrected version should be “If you can drive in India, you shouldn’t be allowed to drive anywhere else”.",
        "I understand that many of us don’t follow even common sense while driving in India. I fully support that we need better policing and driving courses for drivers in India, maybe start training in school?. \n\nThat being said, have you been to Cali? In Arizona, people call Cali drivers as FCB (Foking California Bass turds). Wisconsin has FIBs for Illinois drivers. In the past decade or so I drove through most of the 50 states (for work) and to my surprise I found that Texans follow speed limit.",
        ":)) go ahead buddy",
        "Haha..For a sec I was thinking which fucking American state the guy was referring to.",
        "Get on the golden triangle highway between Thane and Ahmedabad - you will see dozens of dead dogs lying on the side of the road. It's heartbreaking 😢",
        "Once you're used to the chaos of being a chaiwala, it's easier to get used to being a aerospace engineer. FTFY",
        "That's relatable.\nBut surprisingly I didn't find it hard at all to re-learn bike riding in India.\nLiving in Europe, so didn't drive a vehicle here. I think that's what kept my brain from really getting reprogrammed. Desi to the bones. The first 10seconds after coming out onto the streets were confusing due to hand drive difference lol🤣",
        "In india the indicators are for weddings and the sorts.",
        "Remember that snake game which used to be in keypad phones. Guess we played a lot of that 👀",
        "In the words of Russel Peters, Indians drive on the basis of \"create a lane\".",
        "The insurance industry has a good grip on car safety in the United States. For the average person, a bad driving record can be a death sentence if they take your licence away and you can't get to work. If you have alot of points on your licence, your car insurance premiums might be so high you can't afford to drive.\n\nHere, in bangalore, paying 10k to a cop to look the other way after hitting a person in traffic is just the cost of doing business for lots of car owners. \n\nIf you have people that can't be incentivised to drive safely, they won't.",
        "You say you are not that NRI but you are that NRI lol. Comparing Indian traffic to US doesn't make sense - that's how it is and won't change. Yes it's hard to adjust when your are visiting, use Uber.",
        "Well do you happen to know the zipping software 'WinRar'?\n\nEverytime you launch it, it will tell you the package is trial version and ask you to buy it. But you can just skip/ignore it and use the complete software for eternity. No problems. \n\nIndian roads to similar. The road is Winrar. \nThe lane markings are buy option. You can skip/ignore them for eternity.",
        "Wrong it's for boasting to your relatives from a lower tier town how you have 'x' lane roads in the big city you're from.",
        "Haha.. true.. i kept wondering what American state it is!!",
        "Lol, I lived in Cali a long time. While traffic is bad, it’s not anything that would come close to even resembling Indian traffic.",
        "If you leave your house and stick to lanes (when they are present only in major roads), for the traffic density in India, you would go nowhere, if the line extends all the way from your workplace, through main roads and by lanes, right to the front of your house. If you can't make 5 lanes out of the 3 present, you aren't going anywhere. Shouldn't be that way, but that's what it is.\n\n&gt;Now in India, nobody cares about lanes. \n\nWhat are you talking about? After a stretch of road, another stretch of broken mud path dug up by authorities make people adapt to a road again after that bad patch. Some more road, then no road. Repeat. Pfft, lanes.",
        "Fr that asshole who drives on the white line is THE most annoying person on highway, tho for me it has been really rare.",
        "Few months ago I had a little accident where my car hit some kids on bike - when I asked them why did you guys not see the indicator - they genuinely told me they are not used to of looking indicator at day time and think indicators are made for night \n\nI gave up",
        "Come drive in the bay area!   \n\nPost lockdown people seem to have forgotten how to drive here and there’s road rage if you mildly horn at someone…",
        "Is there any hope whatsoever of things improving?  \n  \nI remember noticing all this the first time I returned to Mumbai, I was was struck by the thought, that even though this is a rich city with billionaires and crazy real estate, the traffic is like an equalizer for all, almost no one can escape it. Even if someone were to try and throw money at the problem, there’s only so much space on the road. Can’t extend lanes beyond that.",
        "OP, before you visit India every time, try driving in Brampton, ON (a city on your northern neighbour) for few days. You will do good when you drive in India.",
        "Newfoundland and Labrador",
        "New driver here. That day i was on 3rd lane from left on 3 lane highway road . And another car was speeding up behind me on same lane. I gave left indicator to go on second to allow it go ahead and moved to 2nd. That mfer came to 1st lane and overtook me from 1st lane on left. I was just speechless for a second. Wtf is wrong with people"
    ],
    "cleaned_text": "thing indian traffic really messes head live abroad traffic laneshttpspreviewredditcxmwlylhjpgwidthampformatpjpgampautowebpampsafccbbffabec born brought india spent years life india think drove bike years years indiayou get gearless drivers license age assure one annoying nris acts touch reality returns back india desi next person driving car america past years used driving america used american traffic dont travel india often often forget indian traffic works till come back india america car lane next wants merge lane turn indicator wait seconds notice two options point either accelerate go past car slow bit accelerate merge behind slow merge front dont anything travel speed parallel car worse match speed yell lot times flip basically dick move like asking trouble plenty people shit traffic america consciously willfully spite accelerating ahead car wants merge lane also dick move bad changing speed matching speed car wants merge lane india nobody cares lanes used drive india left us used care lanes say lanes dont mean two lanes road traffic going opposite directions mean lanes vehicles going direction broken white line middle road marks lanes people india literally travel top white line half vehicle one lane half lane people drive white line hours end problem describinghttpspreviewredditannvtmmhpngwidthampformatpngampautowebpampsffdadfebcbbaebedbbcdcfb used way us traffic works really really fucks brain cause think person front trying merge slow dont merge lane slowed distance vehicle vehicle behind decreases leads situation would collide vehicle behind anticipating would slow time since person hasnt driven india long time person slowing person behind wont slow came close accident scared living shit back took lot effort adjust brain way indian traffic works took lot conscious effort went back america start driving according lane system understand plenty bikes road america traffic nontwowheeler traffic people america pretend bikes cars give much space car people might stay waste space bikes typically go gaps cars big vehicles space car drivers give relinquish back frequently india problem opposite even cars behave like motorbikes try squeeze gap two vehicles cars nimble bikes car gets space two cars two separate lanes sit till reaches destination space cars could fit entirely taken single car ",
    "cleaned_title": "thing indian traffic really messes head live abroad",
    "cleaned_selftext": "traffic laneshttpspreviewredditcxmwlylhjpgwidthampformatpjpgampautowebpampsafccbbffabec born brought india spent years life india think drove bike years years indiayou get gearless drivers license age assure one annoying nris acts touch reality returns back india desi next person driving car america past years used driving america used american traffic dont travel india often often forget indian traffic works till come back india america car lane next wants merge lane turn indicator wait seconds notice two options point either accelerate go past car slow bit accelerate merge behind slow merge front dont anything travel speed parallel car worse match speed yell lot times flip basically dick move like asking trouble plenty people shit traffic america consciously willfully spite accelerating ahead car wants merge lane also dick move bad changing speed matching speed car wants merge lane india nobody cares lanes used drive india left us used care lanes say lanes dont mean two lanes road traffic going opposite directions mean lanes vehicles going direction broken white line middle road marks lanes people india literally travel top white line half vehicle one lane half lane people drive white line hours end problem describinghttpspreviewredditannvtmmhpngwidthampformatpngampautowebpampsffdadfebcbbaebedbbcdcfb used way us traffic works really really fucks brain cause think person front trying merge slow dont merge lane slowed distance vehicle vehicle behind decreases leads situation would collide vehicle behind anticipating would slow time since person hasnt driven india long time person slowing person behind wont slow came close accident scared living shit back took lot effort adjust brain way indian traffic works took lot conscious effort went back america start driving according lane system understand plenty bikes road america traffic nontwowheeler traffic people america pretend bikes cars give much space car people might stay waste space bikes typically go gaps cars big vehicles space car drivers give relinquish back frequently india problem opposite even cars behave like motorbikes try squeeze gap two vehicles cars nimble bikes car gets space two cars two separate lanes sit till reaches destination space cars could fit entirely taken single car",
    "cleaned_comments": "people say learn drive india drive anywhere else world p belive versatile drivers indians lane markings road decorations suggestions like hey could within lines spot friend first time came back nl india emigrating even uber ride airport home made nervous nobody uses turn indicators bikes autos come nowhere uber driving like demon wheels took week get back usual driving rhythm week felt overwhelmed learning drive india basically like super power made practice driving case apocalypse get away stupid shit like op mentioned enforcement driving rules fact youre considered shithead actually follow rules actively interest bunch folks shenanigans us end wondrous set traffic tickets reason right corner median surprise cows jump road know happens hit cow india villagers made sport let cows loose collect money gets hit wrong name caste prison time left asshole drivers go opposite way headlights stay safe drive line try teaching lane concept ola drivers auto drivers educated dont care also theres penalizing factor flouting traffic rules wat u get uneducated anmialistic traffic block squeeze ur vehicle get ahead survival fittest visible roads also sooner u understand sooner u feel peace driving nl completely wrong seasoned driver india shit bricks driving us reason us tons rules simply dont exist acutely aware time merge protocol op mentioned one rules around gets right way way intersection signal rules around blocking intersections even signal green move youre sure youll make side without blocking perpendicular traffic rules around happens school bus stops front million rules like worst screwed make mistake give rupees chaipani money traffic cop move nothing happened agree youre used chaos easier get used disciplined also easier react faster someone goes wrong nobody follows lane discipline india netherlands drove india years driving years us dont think apart vehicle control like steering breaking almost nothing else transferable american driving indians would way less accidents americans reaction times might factor emergencies bad habits learnt driving india would increase chance accident honestly dont think im brave enough drive india used american driving drive almost k miles k km per year us way way sensible way driving us even quirks rules etiquette village talking driven lakh kms across country one incident sudden animal appearance road even neel gaay construction highway middle night scammer person around advising people drive incorrectly line curious driven hearsay first hand experience tu chala le thik se lane ke andar drive feel safe old quote drive india drive anywhere think corrected version drive india shouldnt allowed drive anywhere else understand many us dont follow even common sense driving india fully support need better policing driving courses drivers india maybe start training school said cali arizona people call cali drivers fcb foking california bass turds wisconsin fibs illinois drivers past decade drove states work surprise found texans follow speed limit go ahead buddy hahafor sec thinking fucking american state guy referring get golden triangle highway thane ahmedabad see dozens dead dogs lying side road heartbreaking youre used chaos chaiwala easier get used aerospace engineer ftfy thats relatable surprisingly didnt find hard relearn bike riding india living europe didnt drive vehicle think thats kept brain really getting reprogrammed desi bones first seconds coming onto streets confusing due hand drive difference lol india indicators weddings sorts remember snake game used keypad phones guess played lot words russel peters indians drive basis create lane insurance industry good grip car safety united states average person bad driving record death sentence take licence away cant get work alot points licence car insurance premiums might high cant afford drive bangalore paying k cop look way hitting person traffic cost business lots car owners people cant incentivised drive safely wont say nri nri lol comparing indian traffic us doesnt make sense thats wont change yes hard adjust visiting use uber well happen know zipping software winrar everytime launch tell package trial version ask buy skipignore use complete software eternity problems indian roads similar road winrar lane markings buy option skipignore eternity wrong boasting relatives lower tier town x lane roads big city youre haha true kept wondering american state lol lived cali long time traffic bad anything would come close even resembling indian traffic leave house stick lanes present major roads traffic density india would go nowhere line extends way workplace main roads lanes right front house cant make lanes present arent going anywhere shouldnt way thats gtnow india nobody cares lanes talking stretch road another stretch broken mud path dug authorities make people adapt road bad patch road road repeat pfft lanes fr asshole drives white line annoying person highway tho really rare months ago little accident car hit kids bike asked guys see indicator genuinely told used looking indicator day time think indicators made night gave come drive bay area post lockdown people seem forgotten drive theres road rage mildly horn someone hope whatsoever things improving remember noticing first time returned mumbai struck thought even though rich city billionaires crazy real estate traffic like equalizer almost one escape even someone try throw money problem theres much space road cant extend lanes beyond op visit india every time try driving brampton city northern neighbour days good drive india newfoundland labrador new driver day rd lane left lane highway road another car speeding behind lane gave left indicator go second allow go ahead moved nd mfer came st lane overtook st lane left speechless second wtf wrong people",
    "light_cleaned_title": "There is this thing about Indian traffic that really messes with your head after you live abroad for a while.",
    "light_cleaned_selftext": "[Traffic lanes](https://preview.redd.it/c57xm0wlylh91.jpg?width=300&amp;format=pjpg&amp;auto=webp&amp;s=2a7534f5607c7167c267b7bf76fa8be2c8496043) I was born and brought up in India. I spent 23 years of my life in India. I think I drove a bike for 7 years of those 23 years in India(you can get a gearless driver's license at the age of 16). I assure you, I am not one of those annoying NRIs who acts out of touch with reality when they returns back to India. I am about as Desi as the next person :) Now, I have been driving a car in America for the past 5 years. So I am used to driving in America and I am used to American traffic. I don't travel to India that often. So I often forget how Indian traffic works till I come back to India. Here in America when a car in the lane next to yours wants to merge into your lane, they turn on its indicator and wait for 5 to 15 seconds for you to notice. You have two options at this point, you either accelerate and go past that car or you slow down a bit. If you accelerate they merge behind you. If you slow down they merge in front of you. If you don't do anything and travel at the same speed in parallel to that other car or worse, if you match their speed, they will yell at you a lot of times. They flip you off. Basically, it's a dick move to do. It's like asking for trouble. Plenty of people do this shit in traffic in America. But they do it consciously, willfully out of spite. Accelerating ahead of the car that wants to merge into your lane is also a dick move, but it is not as bad as not changing your speed or matching the speed of the car that wants to merge into your lane. Now in India, nobody cares about lanes. When I used to drive in India before I left for the US, I used to not care about lanes too. When I say lanes, I don't mean the two lanes on the road for traffic going in opposite directions. I mean the lanes for vehicles going in the same direction. There is a broken white line in the middle of the road which marks these lanes. People in India literally travel on top of that white line. Half of their vehicle is in one lane and the other half is in the other lane. And people drive on that white line for hours on end. [The problem I am describing](https://preview.redd.it/96annvtm0mh91.png?width=1264&amp;format=png&amp;auto=webp&amp;s=0ff06d2a9df0e0bcbba2eb2e3d4bb1183cdcfb13) If you are used to the way US traffic works, this really really fucks with your brain. Cause you think the person in front of you is trying to merge in and you slow down for them and they don't merge into your lane. Because you slowed down, the distance between your vehicle and the vehicle behind you decreases. That leads to a situation where you would collide with the vehicle behind you if they are not anticipating that you would slow down. Most of the time, since you are the only person who hasn't driven in India for a long time, you will be the only person slowing down. The person behind you won't slow down. I came very close, to having an accident because of this in 2019. It scared the living shit out of me back then. It took a lot of effort to adjust my brain to the way Indian traffic works. And it took a lot of conscious effort when I went back to America to start driving according to the lane system there. I understand that we have plenty of bikes on the road. In America, 99% of the traffic is non-two-wheeler traffic. But people here in America pretend bikes are cars and they give them as much space as a car. People might stay that is a waste of space, but bikes typically go through the gaps between cars and other big vehicles, and the space that all the car drivers give them, they relinquish it back frequently. But in India, the problem is the opposite of that. Even cars behave like they are motorbikes and try to squeeze in the gap between two vehicles. But cars are not as nimble as bikes, once a car gets into the space between two cars in two separate lanes, it has to sit there till it reaches its destination. So the space in which 2 cars could fit is entirely taken up by a single car.",
    "light_cleaned_comments": "People say that if you learn to drive in India, you can drive anywhere else in the world :p I belive we are very versatile drivers. For Indians, the lane markings are just road decorations. Or suggestions like \"hey, you could be within these lines. But you do you\" Spot on my friend. The first time i came back from NL to India after emigrating, even the uber ride from airport to home made me nervous. Nobody uses turn indicators, bikes autos come out of nowhere and my uber was driving like a demon on wheels. It took me a week to get back to my usual driving rhythm here but for a week i felt so overwhelmed. learning to drive in india is basically like a super power. We are made to practice driving in the case of an apocalypse We're not. We just get away with stupid shit like OP mentioned because there are no enforcement of any driving rules. In fact, you're considered a shithead if you actually follow the rules and it is actively in your own interest not to do so. A bunch of folks who do the same shenanigans in the US end up with a wondrous set of traffic tickets. There is a reason for this. The right corner or median is from where surprise cows jump on the road. Do you know what happens when you hit a cow in India? Villagers have made it a sport. Let cows loose, collect money if it gets hit. If you are the wrong name or caste, prison time. The left is where the asshole drivers go the opposite way with headlights on. Stay safe, drive on the line. try teaching the lane concept to ola drivers and auto drivers. they are not educated, they don't care. also there's no penalizing factor for flouting traffic rules. so wat u get is uneducated / anmialistic traffic. if you can block, squeeze ur vehicle and get ahead, you can do that. survival of the fittest is very visible in the roads. also, the sooner u understand this, the sooner u will feel at peace (while driving). NL? This is completely wrong. I am a seasoned driver in India, but I shit bricks when driving in the US. The reason is that in the US there are tons of rules that simply don't exist here, and you have to be acutely aware of them all the time. The merge protocol that OP mentioned is one of them. There are rules around who gets right of way at a 4-way intersection where there is no signal. There are rules around not blocking intersections (that is even if the signal is green for you, you CANNOT move until you're sure you'll make it to the other side without blocking the perpendicular traffic). There are rules around what happens when a school bus stops in front of you. A million rules like this. And worst of all, you are screwed if you make a mistake. You cannot give 200 rupees chai-pani money to the traffic cop and move on as if nothing happened. Agree to that, but once you're used to chaos, it's easier to get used to being disciplined. Also it's easier for you to react faster if someone goes wrong Nobody follows lane discipline in India Netherlands I drove in India for years and then have been driving for years in the US and I don't think apart from vehicle control like steering and breaking, almost nothing else is transferable to American driving. If they were, Indians would have way less accidents than Americans. While reaction times might be a factor in emergencies, all the bad habits learnt while driving in India would increase the chance for an accident so. Honestly I don't think I'm brave enough to drive in India again after being so used to American driving. And I drive almost 30k miles or 50k km per year in the US. It's just way way more sensible way of driving in the US, even with it's quirks and rules and etiquette. Which village are you talking about? Having driven over 2.5 lakh kms across the country i have had only one incident of a sudden animal appearance on the road, and even that was a neel gaay on an under construction highway in the middle of the night with no scammer or person around. So you are advising people to drive incorrectly on the line, but curious if this is driven by hearsay or first hand experience. *Tu chala le thik se lane ke andar*. I will drive where I feel safe. There is an old quote: “If you can drive in India, you can drive anywhere”. I think the corrected version should be “If you can drive in India, you shouldn’t be allowed to drive anywhere else”. I understand that many of us don’t follow even common sense while driving in India. I fully support that we need better policing and driving courses for drivers in India, maybe start training in school?. That being said, have you been to Cali? In Arizona, people call Cali drivers as FCB (Foking California Bass turds). Wisconsin has FIBs for Illinois drivers. In the past decade or so I drove through most of the 50 states (for work) and to my surprise I found that Texans follow speed limit. :)) go ahead buddy Haha..For a sec I was thinking which fucking American state the guy was referring to. Get on the golden triangle highway between Thane and Ahmedabad - you will see dozens of dead dogs lying on the side of the road. It's heartbreaking 😢 Once you're used to the chaos of being a chaiwala, it's easier to get used to being a aerospace engineer. FTFY That's relatable. But surprisingly I didn't find it hard at all to re-learn bike riding in India. Living in Europe, so didn't drive a vehicle here. I think that's what kept my brain from really getting reprogrammed. Desi to the bones. The first 10seconds after coming out onto the streets were confusing due to hand drive difference lol🤣 In india the indicators are for weddings and the sorts. Remember that snake game which used to be in keypad phones. Guess we played a lot of that 👀 In the words of Russel Peters, Indians drive on the basis of \"create a lane\". The insurance industry has a good grip on car safety in the United States. For the average person, a bad driving record can be a death sentence if they take your licence away and you can't get to work. If you have alot of points on your licence, your car insurance premiums might be so high you can't afford to drive. Here, in bangalore, paying 10k to a cop to look the other way after hitting a person in traffic is just the cost of doing business for lots of car owners. If you have people that can't be incentivised to drive safely, they won't. You say you are not that NRI but you are that NRI lol. Comparing Indian traffic to US doesn't make sense - that's how it is and won't change. Yes it's hard to adjust when your are visiting, use Uber. Well do you happen to know the zipping software 'WinRar'? Everytime you launch it, it will tell you the package is trial version and ask you to buy it. But you can just skip/ignore it and use the complete software for eternity. No problems. Indian roads to similar. The road is Winrar. The lane markings are buy option. You can skip/ignore them for eternity. Wrong it's for boasting to your relatives from a lower tier town how you have 'x' lane roads in the big city you're from. Haha.. true.. i kept wondering what American state it is!! Lol, I lived in Cali a long time. While traffic is bad, it’s not anything that would come close to even resembling Indian traffic. If you leave your house and stick to lanes (when they are present only in major roads), for the traffic density in India, you would go nowhere, if the line extends all the way from your workplace, through main roads and by lanes, right to the front of your house. If you can't make 5 lanes out of the 3 present, you aren't going anywhere. Shouldn't be that way, but that's what it is. &gt;Now in India, nobody cares about lanes. What are you talking about? After a stretch of road, another stretch of broken mud path dug up by authorities make people adapt to a road again after that bad patch. Some more road, then no road. Repeat. Pfft, lanes. Fr that asshole who drives on the white line is THE most annoying person on highway, tho for me it has been really rare. Few months ago I had a little accident where my car hit some kids on bike - when I asked them why did you guys not see the indicator - they genuinely told me they are not used to of looking indicator at day time and think indicators are made for night I gave up Come drive in the bay area! Post lockdown people seem to have forgotten how to drive here and there’s road rage if you mildly horn at someone… Is there any hope whatsoever of things improving? I remember noticing all this the first time I returned to Mumbai, I was was struck by the thought, that even though this is a rich city with billionaires and crazy real estate, the traffic is like an equalizer for all, almost no one can escape it. Even if someone were to try and throw money at the problem, there’s only so much space on the road. Can’t extend lanes beyond that. OP, before you visit India every time, try driving in Brampton, ON (a city on your northern neighbour) for few days. You will do good when you drive in India. Newfoundland and Labrador New driver here. That day i was on 3rd lane from left on 3 lane highway road . And another car was speeding up behind me on same lane. I gave left indicator to go on second to allow it go ahead and moved to 2nd. That mfer came to 1st lane and overtook me from 1st lane on left. I was just speechless for a second. Wtf is wrong with people"
}