{
    "id": "1ah160p",
    "title": "Distribution of Net Proceeds of Taxes and Duties from Centre to the States in FY2024-2025",
    "url": "https://www.reddit.com/gallery/1ah160p",
    "selftext": "https://x.com/indiainpixels/status/1753061731272671247?s=20\n\nhttps://x.com/indiainpixels/status/1753067712694436156?s=20",
    "flair": "Policy/Economy",
    "score": 27,
    "num_comments": 2,
    "created_utc": 1706871782.0,
    "convurl": "https://i.redd.it/2j4zlb85m5gc1.jpg",
    "comments": [
        "All that money to MP and it still has nothing to show for it. Fucking disgrace. It isn't even suffering from over population or anything like say UP, Bihar, WB. There's hardly any political instability. What is wrong with that state. Almost always on top of the worst socio-economic indicators of this country.",
        "I would suggest you go through state factsheets of MP of NFHS 4 and NFHS 5. And 6 is underway too. The results are improving at far higher percentage than most other regions. \n\nWhat is wrong? Geographical and Logistical Challenges.\nMP still has a very high tribal population which is migrating."
    ],
    "cleaned_text": "distribution net proceeds taxes duties centre states fy  ",
    "cleaned_title": "distribution net proceeds taxes duties centre states fy",
    "cleaned_selftext": "",
    "cleaned_comments": "money mp still nothing show fucking disgrace isnt even suffering population anything like say bihar wb theres hardly political instability wrong state almost always top worst socioeconomic indicators country would suggest go state factsheets mp nfhs nfhs underway results improving far higher percentage regions wrong geographical logistical challenges mp still high tribal population migrating",
    "light_cleaned_title": "Distribution of Net Proceeds of Taxes and Duties from Centre to the States in FY2024-2025",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "All that money to MP and it still has nothing to show for it. Fucking disgrace. It isn't even suffering from over population or anything like say UP, Bihar, WB. There's hardly any political instability. What is wrong with that state. Almost always on top of the worst socio-economic indicators of this country. I would suggest you go through state factsheets of MP of NFHS 4 and NFHS 5. And 6 is underway too. The results are improving at far higher percentage than most other regions. What is wrong? Geographical and Logistical Challenges. MP still has a very high tribal population which is migrating."
}