{
    "id": "1erhgys",
    "title": "Kolkata doctor rape-murder case: All you need to know",
    "url": "https://www.deccanherald.com/india/west-bengal/kolkata-doctor-rape-murder-case-all-you-need-to-know-3148176",
    "selftext": "This is an issue that the whole country should be aware of, it's Nirbhaya 2.0 but for some reason only doctors are aware of this incident. Please share it with everyone you know ",
    "flair": "Crime",
    "score": 60,
    "num_comments": 3,
    "created_utc": 1723578886.0,
    "convurl": "https://external-preview.redd.it/QBto9w1AhqQZ_MpKjGepJEvevnSO3TeLZV78di28BtI.jpg?auto=webp&s=b3f80be442a91dd0cc4d0ef3519484c8361f7b2a",
    "comments": [
        "What's the heck is this civics volunteer? What do they do who recruit them on what basis? Are these the so called hospital agents skimming ignorant patients and their families?",
        "This country is sooo fucked , These basterds need to be beheaded on Red fort every 15th of August .\nWe need some Saudi Arabia type system here , fear of getting killed on live telivision is the only thing that can keep these animals under control.",
        "At this point this country's citizens have absolutely zero unity and respect. This country needs a revolution in many cases and the main concern is safety. We've ignored trafficking successfully for a decade and now even when our women are getting raped, tormented and then brutally killed by torture worse than death, we're trying to ignore it too. \n\nWe failed as a society, we failed as humans, we are much worse than the monsters we've read about."
    ],
    "cleaned_text": "kolkata doctor rapemurder case need know issue whole country aware nirbhaya reason doctors aware incident please share everyone know ",
    "cleaned_title": "kolkata doctor rapemurder case need know",
    "cleaned_selftext": "issue whole country aware nirbhaya reason doctors aware incident please share everyone know",
    "cleaned_comments": "whats heck civics volunteer recruit basis called hospital agents skimming ignorant patients families country sooo fucked basterds need beheaded red fort every th august need saudi arabia type system fear getting killed live telivision thing keep animals control point countrys citizens absolutely zero unity respect country needs revolution many cases main concern safety weve ignored trafficking successfully decade even women getting raped tormented brutally killed torture worse death trying ignore failed society failed humans much worse monsters weve read",
    "light_cleaned_title": "Kolkata doctor rape-murder case: All you need to know",
    "light_cleaned_selftext": "This is an issue that the whole country should be aware of, it's Nirbhaya 2.0 but for some reason only doctors are aware of this incident. Please share it with everyone you know",
    "light_cleaned_comments": "What's the heck is this civics volunteer? What do they do who recruit them on what basis? Are these the so called hospital agents skimming ignorant patients and their families? This country is sooo fucked , These basterds need to be beheaded on Red fort every 15th of August . We need some Saudi Arabia type system here , fear of getting killed on live telivision is the only thing that can keep these animals under control. At this point this country's citizens have absolutely zero unity and respect. This country needs a revolution in many cases and the main concern is safety. We've ignored trafficking successfully for a decade and now even when our women are getting raped, tormented and then brutally killed by torture worse than death, we're trying to ignore it too. We failed as a society, we failed as humans, we are much worse than the monsters we've read about."
}