{
    "id": "1dsl3rl",
    "title": "While there are so many grave issues with the new criminal laws, here’s one of them. Everyone & Everything is one data breach & leak away + what about integrity of data?",
    "url": "https://i.redd.it/lyp0axwddu9d1.jpeg",
    "selftext": "\n\nA provision has also been made to digitise the entire process from FIR to case diary, case diary to chargesheet and from chargesheet to judgement.\n\nAlso now electronic evidence is considered with same weightage as traditional evidence, while it makes sense but what does not give confidence is this govt has history of “planting digital evidence”, \n\nIt is going to be hell because I don’t trust this govt and its police as well as citizens to know their rights, like before seizure of a digital device for example hard-disk, a cryptographic hash code needs to be generated using a secure has algorithm like SHA 256/512 (it also has a extremely small risk of birthday paradox collision too however you can safely ignore it)\n\nAnd then they have to store the electronic device in safe and secure conditions like not near a magnetic field and in anti static bags among other things…\n\nNaive people especially (and ofc everyone in general) will be at the receiving end of this. Not knowing the procedures easily gives them the ability to tamper data and easily implicate you.\n\nAnd Finally like I said in my title, all the data and sensitive info is JUST ONE DATA BREACH AWAY. And Indian govts anywhere are not trustworthy given so many massive data breaches in the past.\n\nGood luck to everyone including me because no one is coming out unf%#*#* and if you think opposition will protest against these laws and will fight to the end, then I have a bridge to sell you. Opposition will be more than happy to use these draconian laws in the states they govern :)",
    "flair": "Law & Courts",
    "score": 35,
    "num_comments": 3,
    "created_utc": 1719811103.0,
    "convurl": "https://i.redd.it/lyp0axwddu9d1.jpeg",
    "comments": [
        "Isn't it a good thing?  \n\nWhat data would 'common people' have that is too important to safeguard?  \nDo we have real privacy anyway?   \n\nNow there is a lack of trust in the present govt- no one can trust these crony capitalists who actually like ultra nationalists. I share your views but am not afraid of it.",
        "I agree with the evidence planting stuff. People would bribe the police to add e-evidence or remove it. \n\nBut, that was the case in paper based files as well. Atleast if they have to remove it, a trace of changes will be left or if they hack it traces of hacking will be present. Rendering the whole thing back to square one, cause none of the evidence is now trustworthy. \n\nChances are there this will happen, but thats the risk of going online, nothing wrong here to fight against it. We will solve it when we come to that bridge. \n\nHell IT website gets hacked, it will cause more trouble for 5.5 cr taxpayers and 1 cr+ PAN holders. Its chances are low but not negligible but the rewards for digitisation are high.\n\nI don't think that factor should discourage us from changing systems and trying new stuff.",
        "This has more good to come out of it than bad."
    ],
    "cleaned_text": "many grave issues new criminal laws heres one everyone everything one data breach leak away integrity data provision also made digitise entire process fir case diary case diary chargesheet chargesheet judgement also electronic evidence considered weightage traditional evidence makes sense give confidence govt history planting digital evidence going hell dont trust govt police well citizens know rights like seizure digital device example harddisk cryptographic hash code needs generated using secure algorithm like sha also extremely small risk birthday paradox collision however safely ignore store electronic device safe secure conditions like near magnetic field anti static bags among things naive people especially ofc everyone general receiving end knowing procedures easily gives ability tamper data easily implicate finally like said title data sensitive info one data breach away indian govts anywhere trustworthy given many massive data breaches past good luck everyone including one coming unf think opposition protest laws fight end bridge sell opposition happy use draconian laws states govern ",
    "cleaned_title": "many grave issues new criminal laws heres one everyone everything one data breach leak away integrity data",
    "cleaned_selftext": "provision also made digitise entire process fir case diary case diary chargesheet chargesheet judgement also electronic evidence considered weightage traditional evidence makes sense give confidence govt history planting digital evidence going hell dont trust govt police well citizens know rights like seizure digital device example harddisk cryptographic hash code needs generated using secure algorithm like sha also extremely small risk birthday paradox collision however safely ignore store electronic device safe secure conditions like near magnetic field anti static bags among things naive people especially ofc everyone general receiving end knowing procedures easily gives ability tamper data easily implicate finally like said title data sensitive info one data breach away indian govts anywhere trustworthy given many massive data breaches past good luck everyone including one coming unf think opposition protest laws fight end bridge sell opposition happy use draconian laws states govern",
    "cleaned_comments": "isnt good thing data would common people important safeguard real privacy anyway lack trust present govt one trust crony capitalists actually like ultra nationalists share views afraid agree evidence planting stuff people would bribe police add eevidence remove case paper based files well atleast remove trace changes left hack traces hacking present rendering whole thing back square one cause none evidence trustworthy chances happen thats risk going online nothing wrong fight solve come bridge hell website gets hacked cause trouble cr taxpayers cr pan holders chances low negligible rewards digitisation high dont think factor discourage us changing systems trying new stuff good come bad",
    "light_cleaned_title": "While there are so many grave issues with the new criminal laws, here’s one of them. Everyone & Everything is one data breach & leak away + what about integrity of data?",
    "light_cleaned_selftext": "A provision has also been made to digitise the entire process from FIR to case diary, case diary to chargesheet and from chargesheet to judgement. Also now electronic evidence is considered with same weightage as traditional evidence, while it makes sense but what does not give confidence is this govt has history of “planting digital evidence”, It is going to be hell because I don’t trust this govt and its police as well as citizens to know their rights, like before seizure of a digital device for example hard-disk, a cryptographic hash code needs to be generated using a secure has algorithm like SHA 256/512 (it also has a extremely small risk of birthday paradox collision too however you can safely ignore it) And then they have to store the electronic device in safe and secure conditions like not near a magnetic field and in anti static bags among other things… Naive people especially (and ofc everyone in general) will be at the receiving end of this. Not knowing the procedures easily gives them the ability to tamper data and easily implicate you. And Finally like I said in my title, all the data and sensitive info is JUST ONE DATA BREACH AWAY. And Indian govts anywhere are not trustworthy given so many massive data breaches in the past. Good luck to everyone including me because no one is coming out unf%#*#* and if you think opposition will protest against these laws and will fight to the end, then I have a bridge to sell you. Opposition will be more than happy to use these draconian laws in the states they govern :)",
    "light_cleaned_comments": "Isn't it a good thing? What data would 'common people' have that is too important to safeguard? Do we have real privacy anyway? Now there is a lack of trust in the present govt- no one can trust these crony capitalists who actually like ultra nationalists. I share your views but am not afraid of it. I agree with the evidence planting stuff. People would bribe the police to add e-evidence or remove it. But, that was the case in paper based files as well. Atleast if they have to remove it, a trace of changes will be left or if they hack it traces of hacking will be present. Rendering the whole thing back to square one, cause none of the evidence is now trustworthy. Chances are there this will happen, but thats the risk of going online, nothing wrong here to fight against it. We will solve it when we come to that bridge. Hell IT website gets hacked, it will cause more trouble for 5.5 cr taxpayers and 1 cr+ PAN holders. Its chances are low but not negligible but the rewards for digitisation are high. I don't think that factor should discourage us from changing systems and trying new stuff. This has more good to come out of it than bad."
}