{
    "id": "17g15z2",
    "title": "Panel on new NCERT social science curriculum wants ‘Bharat’, not India, in books — ‘unanimous view’",
    "url": "https://theprint.in/india/education/panel-on-new-ncert-social-science-curriculum-wants-bharat-not-india-in-books-unanimous-view/1817281/",
    "selftext": "Someone could ask if it must always be about choosing one over another.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 10,
    "created_utc": 1698227634.0,
    "convurl": "https://external-preview.redd.it/N_i4moJuv7768aVx564PEpxdmNz9YHq7Yu_rv-SK6v4.jpg?auto=webp&s=2eb5cd7a4eac7232462110c9c3128cd4d7d78d87",
    "comments": [
        "Polarizing dumbfucks",
        "Bjp is now trying to massively deploy its strategy of diversion tactics to deviate people from our country's actual & critical issues at hand due to the upcoming elections",
        "> Bharat, not India, should be the country’s name in school textbooks, from primary to high-school level, a high-level committee set up by the NCERT to revise school curriculum has recommended, according to its chairman **Prof C.I. Issac (Retd), a historian and RSS ideologue**.    \n>  \n>The committee has also suggested toning down the focus on “Hindu defeats” in the curriculum, Issac told ThePrint. \n\nWe elected a clown, we should expect nothing less than a circus.",
        "No. We elected a circus. The clown came along with the circus.",
        "What Hindu defeats? I thought they were all \"tactical retreats\"",
        "You know what, it’s astounding about how we’ve basically allowed ideologues to take over the entire system.",
        "good. Need more positive changes"
    ],
    "cleaned_text": "panel new ncert social science curriculum wants bharat india books unanimous view someone could ask must always choosing one another ",
    "cleaned_title": "panel new ncert social science curriculum wants bharat india books unanimous view",
    "cleaned_selftext": "someone could ask must always choosing one another",
    "cleaned_comments": "polarizing dumbfucks bjp trying massively deploy strategy diversion tactics deviate people countrys actual critical issues hand due upcoming elections bharat india countrys name school textbooks primary highschool level highlevel committee set ncert revise school curriculum recommended according chairman prof ci issac retd historian rss ideologue committee also suggested toning focus hindu defeats curriculum issac told theprint elected clown expect nothing less circus elected circus clown came along circus hindu defeats thought tactical retreats know astounding weve basically allowed ideologues take entire system good need positive changes",
    "light_cleaned_title": "Panel on new NCERT social science curriculum wants ‘Bharat’, not India, in books — ‘unanimous view’",
    "light_cleaned_selftext": "Someone could ask if it must always be about choosing one over another.",
    "light_cleaned_comments": "Polarizing dumbfucks Bjp is now trying to massively deploy its strategy of diversion tactics to deviate people from our country's actual & critical issues at hand due to the upcoming elections > Bharat, not India, should be the country’s name in school textbooks, from primary to high-school level, a high-level committee set up by the NCERT to revise school curriculum has recommended, according to its chairman **Prof C.I. Issac (Retd), a historian and RSS ideologue**. > >The committee has also suggested toning down the focus on “Hindu defeats” in the curriculum, Issac told ThePrint. We elected a clown, we should expect nothing less than a circus. No. We elected a circus. The clown came along with the circus. What Hindu defeats? I thought they were all \"tactical retreats\" You know what, it’s astounding about how we’ve basically allowed ideologues to take over the entire system. good. Need more positive changes"
}