{
    "id": "1hiemh2",
    "title": "Indian Work Culture is down the drain!!",
    "url": "https://www.reddit.com/gallery/1hiemh2",
    "selftext": "I work at an MNC, and recently we got our calendar for 2025 public holidays, and I observed we are considered as 3rd class laborers.\nBoth Bangladesh & Sri Lanka have 20 days public holidays while ours is just 12. On top of that Bangladesh holiday’s consists of 2 week long holidays. Even China has holiday weeks multiple times per year (Dragon festival, Chinese New Year)\nWhile we in India get a grand total of 1 Holiday for Diwali navaratri & Durga puja combined. ",
    "flair": "Rant / Vent",
    "score": 57,
    "num_comments": 26,
    "created_utc": 1734679633.0,
    "convurl": "https://i.redd.it/br0iqym5hy7e1.jpg",
    "comments": [
        "Bangladesh increased the holidays by 8 more days. 3 more days off for Puja and 5 more days off for Eid.\n\nSo, that's a total of 33 days off.",
        "Indian working system has work and no life. Infact, when I was working in India, they paid sh*t, on top of that, no to low holidays. You cannot take a saturday or sunday off since it will be bridge and hence it will become unpaid holiday. Indian working system is a joke!",
        "I live in a European country known for its good work life balance. I get 26 leave days and 8 public holidays a year.\n\nThere's a lot more to work life balance than just public holidays.",
        "While ur busy finding temples under mosques or something \n\nThe so called global superpower 2020 has banned work life balance lol",
        "Japan is going do introduce a 4 day week . I know it is to boost population but still . Japan was the only country that was working more than us but not anymore. Japanese genz is not not listening to their boss' illogical demands anymore and the culture of drinking with colleagues ( nomikai ) is also dying. In 7-8 years their work life balance will be same as western Europe.",
        "Welcome to IBM India OP",
        "Like fr bruh, why isn't the government making new temples. Don't they have the craftsmen or the land. These people are so desperate. I agree, it's true during many conquests, temples have fallen, and so did mosques and Buddhist temples. \n\nWhy destroy the present day buildings instead of making new ones. Unless, there's some specific reason, like the ram mandir had that it was the birth place of Ram.",
        "You must mention that you don't really 'ask' for leaves, at least in my experience. It is more of me informing that I will be taking time off instead of having to negotiate like I had to with Indian bosses.",
        "The problem is in Indian work culture people who bootlick get priority. Now when these people come on higher positions, they really don’t have skills, ability or charisma to work at that position. So just being available at all times becomes their productivity. Now once they do it they expect their subordinates to do so too. Thus the cycle continues without any empathy & improvement.\n\nAnother problem is that we Indians lack empathy. So in many people the tendency is that of something bad has happened to me it should happen to others too. For example, if at workplace boss shits on me, than when someone else comes with that problem; instead of handling it compassionately the answer given is, “I got shit upon, everyone gets shit upon you too should bear it”. This ultimately translates to, I have to work late & thus you should too. The problem is the people advocating this mostly have higher pay scale & higher position. They expect the same from subordinates who earn probably 1/4th their salary & are 2-3 levels down the hierarchy.\n\nI worked in an org whose VP at that time was a dick on both of these points. One of the Project Managers was a really good person. She would make her team members leave for home if their work was done. If mandatory 8 hours were not done for that day, she would ask them to chill around. It was noticed by this VP, he made her life hell. Goving her work beyond her role just to make her work 24x7. Adding her to meetings across timezones. Many of us saw her crying in corner many times. But least we could do was just be with her. She is now a bigshot in one of India’s top company. One of the great person I have worked with.\n\nIn another case, a new project required a new server setup. A lead who was supposed to set it, spent 48 hours straight to make it running. It wasn’t even his project, but still did it. Now when it was all done, he went to VP and told him he is going home. VP was like Why? What if something comes up? Lead was like I haven’t seen much family for 2 days. Kids are asking for me. VP was like, “I get divorce threats from my wife every week, nothing happens. Chill”.\n\nThat VP is nowadays trying to be a LinkedIn Influencer.",
        "By your logic, US is 6th class laborers. In US you get only 7 public holidays",
        "You’re getting 13, in my company we have 11 public holidays",
        "damn didnt know bangladesh had that many holidays",
        "We have 10. And 2 optional holidays. So 12.",
        "I will believe it when I see it being implemented. Japans work culture is notorious for not adapting and I doubt this will happen anytime soon",
        "Japan work culture is notorious for not adapting \" that was a decade ago. Go to linkedin and ask an indian the same question, who has been working there for atleast 7- 8 years.",
        "So practical experience i have had \n\n- india tends to officially start wokeing at 9.30 but actual working starts at 10.30 / 11.30 \n\n- indian bureaucracy is slow as hell . For reasons i dont understand like we dont automate because we need to give employment but also leave vacancy on so many positions \nAlso the positions that are filled have power trips and comes in the form of come to my office and wait for me for a couple of hours this is expected of the md . If the md doesnt do this you wont get certain approvals \n\n- officially work ends at 6 but unofficially people start preparing at 5.30 \n\n- outside office issues like traffic waste alot of peoples time that they could spend living a life \n\n- noise pollution,  bad roads , road rage and lack of civic sense lead to lowered quality of life \n\n- some employers are predatory and stockhome syndrome sets in . Leading to exploitation.  \n\n- low pay , living beyong our means ( this feels like a recent development) going into debt causes most people to work in places that they shouldnt be working .\n\nSome recommendations \n\nIf you management is good , then support them . Dont think of it as an opportunity to screw over your boss \n\nIf you start at 9.30 then start at 9.30 and if your done at 4 dont sit around till 7 to show you you've been working late . \n\nKnow what adds value . Do what adds value . Inform your management that you added xyz value \n\nVote for politicians who build good road , schools , hospitals and create a safe society literally your right \n\nIf a boss is toxis be in a position to say fuck you and leave . Cant emphasise how important it is for employers to have employees that add value and expect the fair pay in return .\n\nBe clear with your expectations if the management is clear with theirs . ( if your management isnt clear about it thats a red flag ) \n\nTake everything in writing and give everything in writing . ( email)",
        "I was actually happy when Ram mandir was built. But this constant creating Ruckus around non issues disgusts me.",
        "Bruh, The government wants this instability. They want people to fight within each other by creating non-existing problems. Ppl don't need new temples, rather they want to destroy existing mosques, is what this whole situation has come to.",
        "True literally on a degenerate spree to destroy all Muslim religious spaces in uttar pradesh. \n\nI've not heard a single important politician talking about garbage management, climate change, pollution reaching to a poisonous level. We will actually face the most instability India has ever seen in the coming decades because of these three reasons.",
        "Dude what’re you even saying??? They have holidays for a week prior to Christmas, all the way till new year, also after thanksgiving barely any US offices work",
        "No they don’t. I work there. Holidays come out of vacation balance. It’s not free holidays. I am working the entire Christmas week except Christmas Day. Also ‘barely any work done’ not sure bro what you are smoking or what companies you are working with.",
        "Public holidays is a horrible measure of measuring work life balance",
        "I cannot name the company, but it’s a tier 1 tech company and this is the trend I’ve observed with all other US based companies, maybe contract employees work throughout idk",
        "lol 👍",
        "Indeed. I meant, as /u/sg291188 points out, that public holidays are a terrible measure of work life balance. Being able to take the leaves you have, and being able to shut off work and live your life beyond working hours is what makes good work life balance. Next to no boundaries on working hours wouldn't be compensated by a couple of extra public holidays a year"
    ],
    "cleaned_text": "indian work culture drain work mnc recently got calendar public holidays observed considered rd class laborers bangladesh sri lanka days public holidays top bangladesh holidays consists week long holidays even china holiday weeks multiple times per year dragon festival chinese new year india get grand total holiday diwali navaratri durga puja combined ",
    "cleaned_title": "indian work culture drain",
    "cleaned_selftext": "work mnc recently got calendar public holidays observed considered rd class laborers bangladesh sri lanka days public holidays top bangladesh holidays consists week long holidays even china holiday weeks multiple times per year dragon festival chinese new year india get grand total holiday diwali navaratri durga puja combined",
    "cleaned_comments": "bangladesh increased holidays days days puja days eid thats total days indian working system work life infact working india paid sht top low holidays take saturday sunday since bridge hence become unpaid holiday indian working system joke live european country known good work life balance get leave days public holidays year theres lot work life balance public holidays ur busy finding temples mosques something called global superpower banned work life balance lol japan going introduce day week know boost population still japan country working us anymore japanese genz listening boss illogical demands anymore culture drinking colleagues nomikai also dying years work life balance western europe welcome ibm india op like fr bruh isnt government making new temples dont craftsmen land people desperate agree true many conquests temples fallen mosques buddhist temples destroy present day buildings instead making new ones unless theres specific reason like ram mandir birth place ram must mention dont really ask leaves least experience informing taking time instead negotiate like indian bosses problem indian work culture people bootlick get priority people come higher positions really dont skills ability charisma work position available times becomes productivity expect subordinates thus cycle continues without empathy improvement another problem indians lack empathy many people tendency something bad happened happen others example workplace boss shits someone else comes problem instead handling compassionately answer given got shit upon everyone gets shit upon bear ultimately translates work late thus problem people advocating mostly higher pay scale higher position expect subordinates earn probably th salary levels hierarchy worked org whose vp time dick points one project managers really good person would make team members leave home work done mandatory hours done day would ask chill around noticed vp made life hell goving work beyond role make work x adding meetings across timezones many us saw crying corner many times least could bigshot one indias top company one great person worked another case new project required new server setup lead supposed set spent hours straight make running wasnt even project still done went vp told going home vp like something comes lead like havent seen much family days kids asking vp like get divorce threats wife every week nothing happens chill vp nowadays trying linkedin influencer logic us th class laborers us get public holidays youre getting company public holidays damn didnt know bangladesh many holidays optional holidays believe see implemented japans work culture notorious adapting doubt happen anytime soon japan work culture notorious adapting decade ago go linkedin ask indian question working atleast years practical experience india tends officially start wokeing actual working starts indian bureaucracy slow hell reasons dont understand like dont automate need give employment also leave vacancy many positions also positions filled power trips comes form come office wait couple hours expected md md doesnt wont get certain approvals officially work ends unofficially people start preparing outside office issues like traffic waste alot peoples time could spend living life noise pollution bad roads road rage lack civic sense lead lowered quality life employers predatory stockhome syndrome sets leading exploitation low pay living beyong means feels like recent development going debt causes people work places shouldnt working recommendations management good support dont think opportunity screw boss start start done dont sit around till show youve working late know adds value adds value inform management added xyz value vote politicians build good road schools hospitals create safe society literally right boss toxis position say fuck leave cant emphasise important employers employees add value expect fair pay return clear expectations management clear management isnt clear thats red flag take everything writing give everything writing email actually happy ram mandir built constant creating ruckus around non issues disgusts bruh government wants instability want people fight within creating nonexisting problems ppl dont need new temples rather want destroy existing mosques whole situation come true literally degenerate spree destroy muslim religious spaces uttar pradesh ive heard single important politician talking garbage management climate change pollution reaching poisonous level actually face instability india ever seen coming decades three reasons dude whatre even saying holidays week prior christmas way till new year also thanksgiving barely us offices work dont work holidays come vacation balance free holidays working entire christmas week except christmas day also barely work done sure bro smoking companies working public holidays horrible measure measuring work life balance name company tier tech company trend ive observed us based companies maybe contract employees work throughout idk lol indeed meant usg points public holidays terrible measure work life balance able take leaves able shut work live life beyond working hours makes good work life balance next boundaries working hours wouldnt compensated couple extra public holidays year",
    "light_cleaned_title": "Indian Work Culture is down the drain!!",
    "light_cleaned_selftext": "I work at an MNC, and recently we got our calendar for 2025 public holidays, and I observed we are considered as 3rd class laborers. Both Bangladesh & Sri Lanka have 20 days public holidays while ours is just 12. On top of that Bangladesh holiday’s consists of 2 week long holidays. Even China has holiday weeks multiple times per year (Dragon festival, Chinese New Year) While we in India get a grand total of 1 Holiday for Diwali navaratri & Durga puja combined.",
    "light_cleaned_comments": "Bangladesh increased the holidays by 8 more days. 3 more days off for Puja and 5 more days off for Eid. So, that's a total of 33 days off. Indian working system has work and no life. Infact, when I was working in India, they paid sh*t, on top of that, no to low holidays. You cannot take a saturday or sunday off since it will be bridge and hence it will become unpaid holiday. Indian working system is a joke! I live in a European country known for its good work life balance. I get 26 leave days and 8 public holidays a year. There's a lot more to work life balance than just public holidays. While ur busy finding temples under mosques or something The so called global superpower 2020 has banned work life balance lol Japan is going do introduce a 4 day week . I know it is to boost population but still . Japan was the only country that was working more than us but not anymore. Japanese genz is not not listening to their boss' illogical demands anymore and the culture of drinking with colleagues ( nomikai ) is also dying. In 7-8 years their work life balance will be same as western Europe. Welcome to IBM India OP Like fr bruh, why isn't the government making new temples. Don't they have the craftsmen or the land. These people are so desperate. I agree, it's true during many conquests, temples have fallen, and so did mosques and Buddhist temples. Why destroy the present day buildings instead of making new ones. Unless, there's some specific reason, like the ram mandir had that it was the birth place of Ram. You must mention that you don't really 'ask' for leaves, at least in my experience. It is more of me informing that I will be taking time off instead of having to negotiate like I had to with Indian bosses. The problem is in Indian work culture people who bootlick get priority. Now when these people come on higher positions, they really don’t have skills, ability or charisma to work at that position. So just being available at all times becomes their productivity. Now once they do it they expect their subordinates to do so too. Thus the cycle continues without any empathy & improvement. Another problem is that we Indians lack empathy. So in many people the tendency is that of something bad has happened to me it should happen to others too. For example, if at workplace boss shits on me, than when someone else comes with that problem; instead of handling it compassionately the answer given is, “I got shit upon, everyone gets shit upon you too should bear it”. This ultimately translates to, I have to work late & thus you should too. The problem is the people advocating this mostly have higher pay scale & higher position. They expect the same from subordinates who earn probably 1/4th their salary & are 2-3 levels down the hierarchy. I worked in an org whose VP at that time was a dick on both of these points. One of the Project Managers was a really good person. She would make her team members leave for home if their work was done. If mandatory 8 hours were not done for that day, she would ask them to chill around. It was noticed by this VP, he made her life hell. Goving her work beyond her role just to make her work 24x7. Adding her to meetings across timezones. Many of us saw her crying in corner many times. But least we could do was just be with her. She is now a bigshot in one of India’s top company. One of the great person I have worked with. In another case, a new project required a new server setup. A lead who was supposed to set it, spent 48 hours straight to make it running. It wasn’t even his project, but still did it. Now when it was all done, he went to VP and told him he is going home. VP was like Why? What if something comes up? Lead was like I haven’t seen much family for 2 days. Kids are asking for me. VP was like, “I get divorce threats from my wife every week, nothing happens. Chill”. That VP is nowadays trying to be a LinkedIn Influencer. By your logic, US is 6th class laborers. In US you get only 7 public holidays You’re getting 13, in my company we have 11 public holidays damn didnt know bangladesh had that many holidays We have 10. And 2 optional holidays. So 12. I will believe it when I see it being implemented. Japans work culture is notorious for not adapting and I doubt this will happen anytime soon Japan work culture is notorious for not adapting \" that was a decade ago. Go to linkedin and ask an indian the same question, who has been working there for atleast 7- 8 years. So practical experience i have had - india tends to officially start wokeing at 9.30 but actual working starts at 10.30 / 11.30 - indian bureaucracy is slow as hell . For reasons i dont understand like we dont automate because we need to give employment but also leave vacancy on so many positions Also the positions that are filled have power trips and comes in the form of come to my office and wait for me for a couple of hours this is expected of the md . If the md doesnt do this you wont get certain approvals - officially work ends at 6 but unofficially people start preparing at 5.30 - outside office issues like traffic waste alot of peoples time that they could spend living a life - noise pollution, bad roads , road rage and lack of civic sense lead to lowered quality of life - some employers are predatory and stockhome syndrome sets in . Leading to exploitation. - low pay , living beyong our means ( this feels like a recent development) going into debt causes most people to work in places that they shouldnt be working . Some recommendations If you management is good , then support them . Dont think of it as an opportunity to screw over your boss If you start at 9.30 then start at 9.30 and if your done at 4 dont sit around till 7 to show you you've been working late . Know what adds value . Do what adds value . Inform your management that you added xyz value Vote for politicians who build good road , schools , hospitals and create a safe society literally your right If a boss is toxis be in a position to say fuck you and leave . Cant emphasise how important it is for employers to have employees that add value and expect the fair pay in return . Be clear with your expectations if the management is clear with theirs . ( if your management isnt clear about it thats a red flag ) Take everything in writing and give everything in writing . ( email) I was actually happy when Ram mandir was built. But this constant creating Ruckus around non issues disgusts me. Bruh, The government wants this instability. They want people to fight within each other by creating non-existing problems. Ppl don't need new temples, rather they want to destroy existing mosques, is what this whole situation has come to. True literally on a degenerate spree to destroy all Muslim religious spaces in uttar pradesh. I've not heard a single important politician talking about garbage management, climate change, pollution reaching to a poisonous level. We will actually face the most instability India has ever seen in the coming decades because of these three reasons. Dude what’re you even saying??? They have holidays for a week prior to Christmas, all the way till new year, also after thanksgiving barely any US offices work No they don’t. I work there. Holidays come out of vacation balance. It’s not free holidays. I am working the entire Christmas week except Christmas Day. Also ‘barely any work done’ not sure bro what you are smoking or what companies you are working with. Public holidays is a horrible measure of measuring work life balance I cannot name the company, but it’s a tier 1 tech company and this is the trend I’ve observed with all other US based companies, maybe contract employees work throughout idk lol 👍 Indeed. I meant, as /u/sg291188 points out, that public holidays are a terrible measure of work life balance. Being able to take the leaves you have, and being able to shut off work and live your life beyond working hours is what makes good work life balance. Next to no boundaries on working hours wouldn't be compensated by a couple of extra public holidays a year"
}