{
    "id": "1faddzg",
    "title": "Forgotten in his homeland: Laawaris Laashan Da Waaris",
    "url": "https://indianexpress.com/article/cities/chandigarh/forgotten-in-his-homeland-laawaris-laashan-da-waaris-6584845/",
    "selftext": "25 years after he blew the whistle on forced disappearances and extra-judicial killings in Punjab that eventually led to his own forced disappearence and murder, Jaswant Singh Khalra is yet to get the credit due to him.",
    "flair": "Law & Courts",
    "score": 51,
    "num_comments": 5,
    "created_utc": 1725624018.0,
    "convurl": "https://external-preview.redd.it/qULE1xtXxECK1qB8jtRK1l4eKm5KA8QNh5kE6B1bYyw.jpg?auto=webp&s=6e1f57adb7198eeff235877446c73879edd6b499",
    "comments": [
        "###From the article:\n\n>For a man who waged a battle against the disappearance of thousands of Sikh youths who would later be found killed in fake encounters during the militancy before he himself became a victim of one such forced disappearance and was killed by the Punjab Police, Jaswant Singh Khalra remains a forgotten icon in his home state.\n\n>It was on September 6, 1995 that Khalra, whose probe into the extrajudicial killings had by then caught the United Nations’ attention, was kidnapped by the Punjab Police personnel. He was killed on October 27 and his body disposed of in Harike. A Patiala court in 2005 convicted six policemen of his murder. The verdict was upheld by the Supreme Court in 2011.\n\n>Now, 25 years later, following a push from the local Sikh populace, four cities in Canada — Regina, Burnaby, Brampton and Westminster – and one in the US – Manteca — have announced to observe ‘Jaswant Singh Khalra Day’ on September 6. The UK-based Sikh Press Association is also observing Khalra week beginning August 30.\n\n###Forgotten in Punjab\n\n>In contrast, however, there is no official or political recognition to Khalra’s contribution in the field of human rights in Punjab, where only an YouTube song hails him as ‘Laawaris Laashan Da Waaris’ (Guardian of the unclaimed bodies).\n\n> Even the Shiromani Akali Dal has no plans to commemorate the day. About a year before his kidnapping, then Shiromani Gurudwara Parbandhak Committee (SGPC) president Gurcharan Singh Tohra had appointment Khalra as general secretary of party’s human rights wings. The SAD had created the wing specially for the Cooperative Bank director-turned human right activist so that he could continue expose the extra-judicial killings in the name of tackling militancy in Punjab. Following Khalra’s death, the wing was disbanded and could never be revived.\n\n> “(You can’t have a) Human rights wing just for formality’s sake. You need dedicated people. One cannot find a person like Khalra everyday,” says Maheshinder Singh Grewal, the SAD spokesperson.\n\n> Grewal says the 90s was a time when militancy was at its peak and large-scale forced disappearance and fake encounters of the youth were being carried out. “Now party has no human rights wing, but raises human rights raises on appropriate platform,” adds Grewal.\n\n>Journalist and political commentator Gurbachan Singh remembers that Khalra had attended a seminar on human rights in Jalandhar. “I had advised him to go out of Punjab for few days till things cool down but he refused. In the meantime, former chief minister Beant Singh was assassinated on August 31, 1995. There was political uncertainty in Punjab and six days later Khalra was kidnapped”.\n\n>“The next day there was a meeting of SAD working committee at Jalandhar’s Skylark Hotel. I went there and requested Prakash Singh Badal to pass a resolution for Khalra’s release, but he didn’t take note of it. I asked a senior journalist to write an editorial to save Khalra’s life, but he too decided to not take it seriously,” recalls Jalandhar-based Gurbachan.\n\n>He says that Tohra knew Khalra’s life was in danger and that’s why he had appointed him the general secretary of SAD’s human rights wing. “In September second week, Tohra and I met Harcharan Singh, the new CM, at Chandigarh. While we were leaving his office, he informed Tohra that we were late in approaching him,” says Gurbachan.\n\n>Khalra’s wife, Paramjit Kaur, who has converted their home into headquarters for the Khalra Mission Organisation, a human rights body, rues the fact that Akali Dal didn’t extend any help to her after husband’s murder. “SAD came to power in 1997 on the promise that they would prosecute the police officers responsible for large-scale human rights violations. But soon they forgot their promises. I met then CM Prakash Badal many times seeking justice for my husband. But he told me to forget what happened. He said the same thing from the public stage to all the families, whose members were killed in fake encounters or were missing,” says Paramjit Kaur.\n\n###The big question \n\n>Though court held six policemen guity, Kaur asks why “no big fish” was convicted. “Former DGP KPS Gill was alive when case was being contested in the court. How was he not responsible when the entire police force was working directly under him?”\n\n>“All the political parties in Punjab have given shelter to such police officers who committed gross human rights violation during the militancy. It had come as a shock when Akali Dal decided to appoint Sumedh Singh Saini as DGP,” she adds.\n\n>Responding to allegations, Grewal says, “Saini has been named as an accused in the alleged kidnapping and murder of Balwant Singh Multani. But it often happens that complainants do not come forward against such officers”.\n\n>At a little distance from Khalras’ residence is the Guru Nanak Dev University, Amritsar where courses in human rights are offered with no mention of Jaswant Singh Khalra.\n\n>“Not only Khalra, in fact human rights courses in our universities do not talk about any practical movement on human rights in any part of India. The idea of human rights in our syllabus is conceived from the West,” says Associate Professor Dr Satnam Singh.\n\n###Activist or hero?\n\n>He also points out the dilemma over Khalra. “Before calling him a hero, we must ask the society what they perceive about Khalra’s works. If society ready to believe that the (unidentified and unclaimed) dead counted by Khalra were executed illegally, then only we can call Khalra a hero. Otherwise KPS Gill and then CM Beant Singh would remain heroes. There is a disagreement on the reason behind those killings. There was no political initiative to create awareness around human rights,” says Dr Satnam.\n\n>Human rights activist Sarabjit Singh Verka considers Punjab as a special case. “There would be very few activists in India who would celebrate Khalra. It is complicated… but the human rights activists should understand that Khalra’s is the story of fight back. We have an opportunity to realise the importance of his legacy”.\n\n>For Paramjit Kaur, however, the struggle is far from over and the 25-year long fight to get justice for Khalra and many others continues.\n\n>“We got much better response when I contested elections from Khadoor Sahib Assembly constituency in 2019. Our main issue was human rights and large number of people came in our support and voted for me even though I was not successful in winning the election. You should compare this response with when my husband was kidnapped and killed by police, there was no one to stand with us to seek the justice,” says Paramjit Kaur.\n\n>She is also excited about a new book – The Valiant Jaswant Singh Khalra – written by Gurmeet kaur and set to be released on September 6.\n\n>On her part Gurmeet Kaur say that she has written the book keeping youngsters aged 12 and and above in mind. “What we know about Khalra is just his work in last years of his life. But there is lot more about Khalra like his contrasting political ideologies and how he also stood for human rights of not only Sikhs but also Hindus, who were killed by militants or police blackcats,” says Gurmeet Kaur.",
        "Jaswant Singh Khalra [last speech](https://youtu.be/6wGpWd9UUAQ)\n\n###And a famous quote:\n\n>”There is a fable that when the sun was setting down for the first time, light was decreasing and the signs of darkness were appearing. Darkness set its foot on earth. It is said - far away, in a hut one little lamp lifted his head. It proclaimed, I challenge the darkness. If nothing else, then at least around myself, I will not let it settle. Around myself I will establish light. And watching that one lamp, in other huts, other lamps arose. And the world was amazed to see that these lamps stopped darkness from expanding, so that people could see.”",
        ">Extrajudicial killings in Punjab documented and mapped by [Ensaaf](https://ensaaf.org/#trigger-modal-4401), a nonprofit organization working to end impunity and achieve justice for crimes against humanity in India, with a special focus on Punjab.\n\nThey have mapped the killings, you can see interactive data and profiling of [5300+ victims](https://data.ensaaf.org/).\n\nIn data collection, Ensaaf excluded cases of:\n\n* Genuine encounters;\n\n* Victims killed by militants;\n\n* Disappearances with no appearance of state action;\n\n* Families who expressed hesitation or fear of retribution; and\n\n* Families who expressed fear over the withdrawal of government benefits.\n\nContext of the Abuses:\n\n>For three decades, the architects of crimes against humanity in Punjab have escaped accountability and justice. While families have searched for their disappeared loved ones and lived with lies and partial-truths, the government of India has rewarded and promoted the perpetrators. We believe that survivors of gross human rights violations cannot live as free and respected citizens of a country until impunity ends.\n\n>During the 1980s and 1990s, India’s security forces engaged in widespread and systematic human rights violations in the state of Punjab, as part of counterinsurgency operations aimed at crushing a violent self-determination movement. Special counterinsurgency laws, and a system of rewards and incentives for security forces, led to an increase in enforced disappearances and extrajudicial executions of civilians and militants alike. By the end of the “Decade of Disappearances” in 1995, security forces had disappeared or extrajudicially executed thousands of Sikhs. To conceal their crimes, security forces killed human rights defenders such as Jaswant Singh Khalra and Sukhwinder Singh Bhatti, as well as destroyed their victims’ bodies through mass cremations or by dumping them in rivers. \n\n>Hundreds of perpetrators remain unaccountable. Further, the architects of these crimes remain in positions of power, and have traveled to other regions of India to advise on counterinsurgency operations. As demonstrated in Ensaaf’s joint report with Human Rights Watch, Protecting the Killers: A Policy of Impunity in Punjab, India (Oct. 2007), India’s institutions have failed to acknowledge the systematic and widespread nature of the abuses, and accordingly have not provided truth, justice, and reparations to the victims and survivors.\n\n>Prior to this project by Ensaaf, no government institution or civil society organization had documented the full-scale of enforced disappearances or extrajudicial executions during the Punjab counterinsurgency.\n\n>In the full-scale data collection phase, Ensaaf used the official 2001 census of Punjab, India, with census codes for each village, town, or city, to identify over 12,000 villages and urban areas. Field researchers approached each village and identified victim families by canvasing the village, relying on several consistently present sources of information in each village: past and current village heads (Sarpanch), past and present village council members, the births and deaths registrar (Chownkidar), and groups of village elders (Bazurg) that typically gather in public sitting areas. After all of these referral sources were consulted and consensus was reached on the identity of the victim families present in the village, Ensaaf field researchers then interviewed the identified families using both a standardized survey instrument built as a database, plus a free text form, allowing them to collect both quantitative and qualitative data on each incident. Field researchers further solicited information on other affected families in the village from those they interviewed, acting as yet another corroborating referral source. \n\n>Ensaaf subjected each case to data consistency checks, and further clarified details with families over the phone or through subsequent visits. Because over two decades had passed, and evidence had been withheld or destroyed by security forces, families shared their experiences to the best of their abilities. Often, on subsequent returns, Ensaaf found that the original respondents had deceased because of the age of elderly parents. We also identified villages that did not exist on the Indian census.\n\nRecently, CBI told Punjab & Haryana High Court that [extra judicial killings (custodial & encounters) of 6733 victims](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) is not feasible, even we know the number is way higher.",
        "Everyone wants to play politics in Punjab, but what Punjab needs is justice and reconciliation"
    ],
    "cleaned_text": "forgotten homeland laawaris laashan da waaris years blew whistle forced disappearances extrajudicial killings punjab eventually led forced disappearence murder jaswant singh khalra yet get credit due ",
    "cleaned_title": "forgotten homeland laawaris laashan da waaris",
    "cleaned_selftext": "years blew whistle forced disappearances extrajudicial killings punjab eventually led forced disappearence murder jaswant singh khalra yet get credit due",
    "cleaned_comments": "article man waged battle disappearance thousands sikh youths would later found killed fake encounters militancy became victim one forced disappearance killed punjab police jaswant singh khalra remains forgotten icon home state september khalra whose probe extrajudicial killings caught united nations attention kidnapped punjab police personnel killed october body disposed harike patiala court convicted six policemen murder verdict upheld supreme court years later following push local sikh populace four cities canada regina burnaby brampton westminster one us manteca announced observe jaswant singh khalra day september ukbased sikh press association also observing khalra week beginning august forgotten punjab contrast however official political recognition khalras contribution field human rights punjab youtube song hails laawaris laashan da waaris guardian unclaimed bodies even shiromani akali dal plans commemorate day year kidnapping shiromani gurudwara parbandhak committee sgpc president gurcharan singh tohra appointment khalra general secretary partys human rights wings sad created wing specially cooperative bank directorturned human right activist could continue expose extrajudicial killings name tackling militancy punjab following khalras death wing disbanded could never revived cant human rights wing formalitys sake need dedicated people one find person like khalra everyday says maheshinder singh grewal sad spokesperson grewal says time militancy peak largescale forced disappearance fake encounters youth carried party human rights wing raises human rights raises appropriate platform adds grewal journalist political commentator gurbachan singh remembers khalra attended seminar human rights jalandhar advised go punjab days till things cool refused meantime former chief minister beant singh assassinated august political uncertainty punjab six days later khalra kidnapped next day meeting sad working committee jalandhars skylark hotel went requested prakash singh badal pass resolution khalras release didnt take note asked senior journalist write editorial save khalras life decided take seriously recalls jalandharbased gurbachan says tohra knew khalras life danger thats appointed general secretary sads human rights wing september second week tohra met harcharan singh new cm chandigarh leaving office informed tohra late approaching says gurbachan khalras wife paramjit kaur converted home headquarters khalra mission organisation human rights body rues fact akali dal didnt extend help husbands murder sad came power promise would prosecute police officers responsible largescale human rights violations soon forgot promises met cm prakash badal many times seeking justice husband told forget happened said thing public stage families whose members killed fake encounters missing says paramjit kaur big question though court held six policemen guity kaur asks big fish convicted former dgp kps gill alive case contested court responsible entire police force working directly political parties punjab given shelter police officers committed gross human rights violation militancy come shock akali dal decided appoint sumedh singh saini dgp adds responding allegations grewal says saini named accused alleged kidnapping murder balwant singh multani often happens complainants come forward officers little distance khalras residence guru nanak dev university amritsar courses human rights offered mention jaswant singh khalra khalra fact human rights courses universities talk practical movement human rights part india idea human rights syllabus conceived west says associate professor dr satnam singh activist hero also points dilemma khalra calling hero must ask society perceive khalras works society ready believe unidentified unclaimed dead counted khalra executed illegally call khalra hero otherwise kps gill cm beant singh would remain heroes disagreement reason behind killings political initiative create awareness around human rights says dr satnam human rights activist sarabjit singh verka considers punjab special case would activists india would celebrate khalra complicated human rights activists understand khalras story fight back opportunity realise importance legacy paramjit kaur however struggle far year long fight get justice khalra many others continues got much better response contested elections khadoor sahib assembly constituency main issue human rights large number people came support voted even though successful winning election compare response husband kidnapped killed police one stand us seek justice says paramjit kaur also excited new book valiant jaswant singh khalra written gurmeet kaur set released september part gurmeet kaur say written book keeping youngsters aged mind know khalra work last years life lot khalra like contrasting political ideologies also stood human rights sikhs also hindus killed militants police blackcats says gurmeet kaur jaswant singh khalra last speechhttpsyoutubewgpwduuaq famous quote fable sun setting first time light decreasing signs darkness appearing darkness set foot earth said far away hut one little lamp lifted head proclaimed challenge darkness nothing else least around let settle around establish light watching one lamp huts lamps arose world amazed see lamps stopped darkness expanding people could see extrajudicial killings punjab documented mapped ensaafhttpsensaaforgtriggermodal nonprofit organization working end impunity achieve justice crimes humanity india special focus punjab mapped killings see interactive data profiling victimshttpsdataensaaforg data collection ensaaf excluded cases genuine encounters victims killed militants disappearances appearance state action families expressed hesitation fear retribution families expressed fear withdrawal government benefits context abuses three decades architects crimes humanity punjab escaped accountability justice families searched disappeared loved ones lived lies partialtruths government india rewarded promoted perpetrators believe survivors gross human rights violations live free respected citizens country impunity ends indias security forces engaged widespread systematic human rights violations state punjab part counterinsurgency operations aimed crushing violent selfdetermination movement special counterinsurgency laws system rewards incentives security forces led increase enforced disappearances extrajudicial executions civilians militants alike end decade disappearances security forces disappeared extrajudicially executed thousands sikhs conceal crimes security forces killed human rights defenders jaswant singh khalra sukhwinder singh bhatti well destroyed victims bodies mass cremations dumping rivers hundreds perpetrators remain unaccountable architects crimes remain positions power traveled regions india advise counterinsurgency operations demonstrated ensaafs joint report human rights watch protecting killers policy impunity punjab india oct indias institutions failed acknowledge systematic widespread nature abuses accordingly provided truth justice reparations victims survivors prior project ensaaf government institution civil society organization documented fullscale enforced disappearances extrajudicial executions punjab counterinsurgency fullscale data collection phase ensaaf used official census punjab india census codes village town city identify villages urban areas field researchers approached village identified victim families canvasing village relying several consistently present sources information village past current village heads sarpanch past present village council members births deaths registrar chownkidar groups village elders bazurg typically gather public sitting areas referral sources consulted consensus reached identity victim families present village ensaaf field researchers interviewed identified families using standardized survey instrument built database plus free text form allowing collect quantitative qualitative data incident field researchers solicited information affected families village interviewed acting yet another corroborating referral source ensaaf subjected case data consistency checks clarified details families phone subsequent visits two decades passed evidence withheld destroyed security forces families shared experiences best abilities often subsequent returns ensaaf found original respondents deceased age elderly parents also identified villages exist indian census recently cbi told punjab haryana high court extra judicial killings custodial encounters victimshttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible feasible even know number way higher everyone wants play politics punjab punjab needs justice reconciliation",
    "light_cleaned_title": "Forgotten in his homeland: Laawaris Laashan Da Waaris",
    "light_cleaned_selftext": "25 years after he blew the whistle on forced disappearances and extra-judicial killings in Punjab that eventually led to his own forced disappearence and murder, Jaswant Singh Khalra is yet to get the credit due to him.",
    "light_cleaned_comments": "###From the article: >For a man who waged a battle against the disappearance of thousands of Sikh youths who would later be found killed in fake encounters during the militancy before he himself became a victim of one such forced disappearance and was killed by the Punjab Police, Jaswant Singh Khalra remains a forgotten icon in his home state. >It was on September 6, 1995 that Khalra, whose probe into the extrajudicial killings had by then caught the United Nations’ attention, was kidnapped by the Punjab Police personnel. He was killed on October 27 and his body disposed of in Harike. A Patiala court in 2005 convicted six policemen of his murder. The verdict was upheld by the Supreme Court in 2011. >Now, 25 years later, following a push from the local Sikh populace, four cities in Canada — Regina, Burnaby, Brampton and Westminster – and one in the US – Manteca — have announced to observe ‘Jaswant Singh Khalra Day’ on September 6. The UK-based Sikh Press Association is also observing Khalra week beginning August 30. ###Forgotten in Punjab >In contrast, however, there is no official or political recognition to Khalra’s contribution in the field of human rights in Punjab, where only an YouTube song hails him as ‘Laawaris Laashan Da Waaris’ (Guardian of the unclaimed bodies). > Even the Shiromani Akali Dal has no plans to commemorate the day. About a year before his kidnapping, then Shiromani Gurudwara Parbandhak Committee (SGPC) president Gurcharan Singh Tohra had appointment Khalra as general secretary of party’s human rights wings. The SAD had created the wing specially for the Cooperative Bank director-turned human right activist so that he could continue expose the extra-judicial killings in the name of tackling militancy in Punjab. Following Khalra’s death, the wing was disbanded and could never be revived. > “(You can’t have a) Human rights wing just for formality’s sake. You need dedicated people. One cannot find a person like Khalra everyday,” says Maheshinder Singh Grewal, the SAD spokesperson. > Grewal says the 90s was a time when militancy was at its peak and large-scale forced disappearance and fake encounters of the youth were being carried out. “Now party has no human rights wing, but raises human rights raises on appropriate platform,” adds Grewal. >Journalist and political commentator Gurbachan Singh remembers that Khalra had attended a seminar on human rights in Jalandhar. “I had advised him to go out of Punjab for few days till things cool down but he refused. In the meantime, former chief minister Beant Singh was assassinated on August 31, 1995. There was political uncertainty in Punjab and six days later Khalra was kidnapped”. >“The next day there was a meeting of SAD working committee at Jalandhar’s Skylark Hotel. I went there and requested Prakash Singh Badal to pass a resolution for Khalra’s release, but he didn’t take note of it. I asked a senior journalist to write an editorial to save Khalra’s life, but he too decided to not take it seriously,” recalls Jalandhar-based Gurbachan. >He says that Tohra knew Khalra’s life was in danger and that’s why he had appointed him the general secretary of SAD’s human rights wing. “In September second week, Tohra and I met Harcharan Singh, the new CM, at Chandigarh. While we were leaving his office, he informed Tohra that we were late in approaching him,” says Gurbachan. >Khalra’s wife, Paramjit Kaur, who has converted their home into headquarters for the Khalra Mission Organisation, a human rights body, rues the fact that Akali Dal didn’t extend any help to her after husband’s murder. “SAD came to power in 1997 on the promise that they would prosecute the police officers responsible for large-scale human rights violations. But soon they forgot their promises. I met then CM Prakash Badal many times seeking justice for my husband. But he told me to forget what happened. He said the same thing from the public stage to all the families, whose members were killed in fake encounters or were missing,” says Paramjit Kaur. ###The big question >Though court held six policemen guity, Kaur asks why “no big fish” was convicted. “Former DGP KPS Gill was alive when case was being contested in the court. How was he not responsible when the entire police force was working directly under him?” >“All the political parties in Punjab have given shelter to such police officers who committed gross human rights violation during the militancy. It had come as a shock when Akali Dal decided to appoint Sumedh Singh Saini as DGP,” she adds. >Responding to allegations, Grewal says, “Saini has been named as an accused in the alleged kidnapping and murder of Balwant Singh Multani. But it often happens that complainants do not come forward against such officers”. >At a little distance from Khalras’ residence is the Guru Nanak Dev University, Amritsar where courses in human rights are offered with no mention of Jaswant Singh Khalra. >“Not only Khalra, in fact human rights courses in our universities do not talk about any practical movement on human rights in any part of India. The idea of human rights in our syllabus is conceived from the West,” says Associate Professor Dr Satnam Singh. ###Activist or hero? >He also points out the dilemma over Khalra. “Before calling him a hero, we must ask the society what they perceive about Khalra’s works. If society ready to believe that the (unidentified and unclaimed) dead counted by Khalra were executed illegally, then only we can call Khalra a hero. Otherwise KPS Gill and then CM Beant Singh would remain heroes. There is a disagreement on the reason behind those killings. There was no political initiative to create awareness around human rights,” says Dr Satnam. >Human rights activist Sarabjit Singh Verka considers Punjab as a special case. “There would be very few activists in India who would celebrate Khalra. It is complicated… but the human rights activists should understand that Khalra’s is the story of fight back. We have an opportunity to realise the importance of his legacy”. >For Paramjit Kaur, however, the struggle is far from over and the 25-year long fight to get justice for Khalra and many others continues. >“We got much better response when I contested elections from Khadoor Sahib Assembly constituency in 2019. Our main issue was human rights and large number of people came in our support and voted for me even though I was not successful in winning the election. You should compare this response with when my husband was kidnapped and killed by police, there was no one to stand with us to seek the justice,” says Paramjit Kaur. >She is also excited about a new book – The Valiant Jaswant Singh Khalra – written by Gurmeet kaur and set to be released on September 6. >On her part Gurmeet Kaur say that she has written the book keeping youngsters aged 12 and and above in mind. “What we know about Khalra is just his work in last years of his life. But there is lot more about Khalra like his contrasting political ideologies and how he also stood for human rights of not only Sikhs but also Hindus, who were killed by militants or police blackcats,” says Gurmeet Kaur. Jaswant Singh Khalra [last speech](https://youtu.be/6wGpWd9UUAQ) ###And a famous quote: >”There is a fable that when the sun was setting down for the first time, light was decreasing and the signs of darkness were appearing. Darkness set its foot on earth. It is said - far away, in a hut one little lamp lifted his head. It proclaimed, I challenge the darkness. If nothing else, then at least around myself, I will not let it settle. Around myself I will establish light. And watching that one lamp, in other huts, other lamps arose. And the world was amazed to see that these lamps stopped darkness from expanding, so that people could see.” >Extrajudicial killings in Punjab documented and mapped by [Ensaaf](https://ensaaf.org/#trigger-modal-4401), a nonprofit organization working to end impunity and achieve justice for crimes against humanity in India, with a special focus on Punjab. They have mapped the killings, you can see interactive data and profiling of [5300+ victims](https://data.ensaaf.org/). In data collection, Ensaaf excluded cases of: * Genuine encounters; * Victims killed by militants; * Disappearances with no appearance of state action; * Families who expressed hesitation or fear of retribution; and * Families who expressed fear over the withdrawal of government benefits. Context of the Abuses: >For three decades, the architects of crimes against humanity in Punjab have escaped accountability and justice. While families have searched for their disappeared loved ones and lived with lies and partial-truths, the government of India has rewarded and promoted the perpetrators. We believe that survivors of gross human rights violations cannot live as free and respected citizens of a country until impunity ends. >During the 1980s and 1990s, India’s security forces engaged in widespread and systematic human rights violations in the state of Punjab, as part of counterinsurgency operations aimed at crushing a violent self-determination movement. Special counterinsurgency laws, and a system of rewards and incentives for security forces, led to an increase in enforced disappearances and extrajudicial executions of civilians and militants alike. By the end of the “Decade of Disappearances” in 1995, security forces had disappeared or extrajudicially executed thousands of Sikhs. To conceal their crimes, security forces killed human rights defenders such as Jaswant Singh Khalra and Sukhwinder Singh Bhatti, as well as destroyed their victims’ bodies through mass cremations or by dumping them in rivers. >Hundreds of perpetrators remain unaccountable. Further, the architects of these crimes remain in positions of power, and have traveled to other regions of India to advise on counterinsurgency operations. As demonstrated in Ensaaf’s joint report with Human Rights Watch, Protecting the Killers: A Policy of Impunity in Punjab, India (Oct. 2007), India’s institutions have failed to acknowledge the systematic and widespread nature of the abuses, and accordingly have not provided truth, justice, and reparations to the victims and survivors. >Prior to this project by Ensaaf, no government institution or civil society organization had documented the full-scale of enforced disappearances or extrajudicial executions during the Punjab counterinsurgency. >In the full-scale data collection phase, Ensaaf used the official 2001 census of Punjab, India, with census codes for each village, town, or city, to identify over 12,000 villages and urban areas. Field researchers approached each village and identified victim families by canvasing the village, relying on several consistently present sources of information in each village: past and current village heads (Sarpanch), past and present village council members, the births and deaths registrar (Chownkidar), and groups of village elders (Bazurg) that typically gather in public sitting areas. After all of these referral sources were consulted and consensus was reached on the identity of the victim families present in the village, Ensaaf field researchers then interviewed the identified families using both a standardized survey instrument built as a database, plus a free text form, allowing them to collect both quantitative and qualitative data on each incident. Field researchers further solicited information on other affected families in the village from those they interviewed, acting as yet another corroborating referral source. >Ensaaf subjected each case to data consistency checks, and further clarified details with families over the phone or through subsequent visits. Because over two decades had passed, and evidence had been withheld or destroyed by security forces, families shared their experiences to the best of their abilities. Often, on subsequent returns, Ensaaf found that the original respondents had deceased because of the age of elderly parents. We also identified villages that did not exist on the Indian census. Recently, CBI told Punjab & Haryana High Court that [extra judicial killings (custodial & encounters) of 6733 victims](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) is not feasible, even we know the number is way higher. Everyone wants to play politics in Punjab, but what Punjab needs is justice and reconciliation"
}