{
    "id": "16ag1oo",
    "title": "Can RavishKumarOfficial cross the youtube subscriber base of NDTV ? What are your thoughts kindly comment",
    "url": "https://www.reddit.com/r/india/comments/16ag1oo/can_ravishkumarofficial_cross_the_youtube/",
    "selftext": "Not saying subscribers cant be bought or anything but i guess viewership can give an idea whether the youtube channel is hot or not\n\nLets look at the comparison of these 2 youtube channels\n\n[Currently RavishKumarOfficial has 7.02 Million subscriber and an average viewership of 1.2 Million + on each video Meanwhile NDTV which used to have good youtube viewership dont have any views look at the latest video views of RavishKumar](https://preview.redd.it/cgpr73vomdmb1.jpg?width=807&format=pjpg&auto=webp&s=2c5f21dd5a0b8fa155484614545c5458dd3dbccb)\n\n[Latest video view - 1.2 Million 16 hours ago,Highest 2.8 Million views 12 days ago, Lowest 914k 14 days ago](https://preview.redd.it/890y3dpymdmb1.jpg?width=1273&format=pjpg&auto=webp&s=d96317367685e574811c71ead65dda396346006c)\n\nNow Lets look at the video views of star anchors of NDTV \n\n[Highest View 4.9k views 12 hours ago ](https://preview.redd.it/u6dev0n9ndmb1.jpg?width=1279&format=pjpg&auto=webp&s=dae8c689ce715cb76d8f404ef316b999caabc004)\n\nJust glanced through last 30 days of NDTV video and barely any video is touching 50k views\n\nI still remember NDTv used to have atleast 500k views on all main anchors videos i guess after adani sellout no one is watching it anymore  atleast on youtube and mostly TV media is watched by 50+ Oldies at home.\n\nJust saying it will be fun to watch RavishKumarOfficial crossing NDTV subscriber base and if that happen will Modi/Adanis plan to buy NDTV will be futile ?",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693894083.0,
    "convurl": "https://a.thumbs.redditmedia.com/p-rMF3U-ZUUOtQ3HnUTe4G8pLisxeqf7y7LiwVxBPK8.jpg",
    "comments": [
        "Video views from last 30 days\n\nRavish: 57M\n\nNDTV: 39M\n\nThis is with NDTV uploading way more videos that him.\n\nHis channel has already crossed NDTV.\n\nWhy would subscribers matter, if they are not even watching the videos.",
        "Yeah i got your point\n\nBut just saying how it would look if one single man crosses the subscriber base of an entire Network on youtube \n\nIt will be symbolic irony for NDTV lol",
        "We often talk about Disruptors in different industries and we know that such people/events/companies don't happen regularly.\n\nRavish's YT/Online-only venture is an experiment on this question. It has the potential to be something much bigger and \"Newer\", i.e. domain Disruption Event. It's not there yet but it has the potential. Plus we often don't know what the Post-Disruption reality is, just that it's dramatically and significantly different.",
        "I would say Dhruv Rathee is pioneer in this in India. He was first one to become such big, alone. He has changed the youtube news industry.\n\nAlso, youtube is not something new. It can't be disruptor for people who only watch television, either cause of it's legacy, not having access to youtube.\n\n&#x200B;\n\nAlso, Fast Internet is still available in a lot of areas, there are even areas where reliable internet isn't available. In such places too Tv news is only option, and the need of Ravish the most, according to me.\n\nInternet already had many independent/reliable voices. Now, TV don't even have one. Yes, Ravish don't owe anything to us, I was just telling what would have been better for us as a country, according to me.",
        "Lets do it",
        "Ravish Kumar is not only a journalist but a brand himself which is much better than NDTV and all other godi media channels.",
        "NDTV is now a propaganda channel just like most of the media.",
        "> . I wish he won't have left NDTV, and should have worked as he used to, and make the administration remove him\n\nEhh... He was forced to quit. His shows were taken off air, censored mid way...he was literally squeezd to a point of suffocating. He made a video about why he quite NDTV.",
        "Apart from Ravish, all the impactful reporters have also left - Pranoy Roy, Vishnu Som, Nidhi Razdan etc. Used to watch NDTV regularly, now barely tune in",
        "> Vishnu Som\n\nHe's still around.",
        "The govt will somehow arm-twist YouTube to pull down his channel.",
        ">He was forced to quit. His shows were taken off air, censored mid way\n\nWhat? No, that was punya prasun bajpai, not Ravish.\n\nDid I miss something?",
        "Sorry I meant srinivasan Jain..Vishnu Som is still around yeah",
        "Yes that's true.\n\nActually NDTV has started it's expansion. It has/will start NDTV Rajasthan. Money can allow one to do anything, whether the person/organization is worthy or not.",
        "https://youtu.be/G9K9vpGTofo?feature=shared",
        "Sarah Jacob too\n\nSame here, stopped watching it altogether",
        "I watched them when he uploaded them, and now too. He hasn't said anything like what you said.\n\nHe has only said one thing, not in these videos, which was about what Adani said in his public comment.",
        "Ravish is already a winner. Subscribers means nothing in YT, as the cake is taken by channels who have active viewership and cna make more money."
    ],
    "cleaned_text": "ravishkumarofficial cross youtube subscriber base ndtv thoughts kindly comment saying subscribers cant bought anything guess viewership give idea whether youtube channel hot lets look comparison youtube channels currently ravishkumarofficial million subscriber average viewership million video meanwhile ndtv used good youtube viewership dont views look latest video views ravishkumarhttpspreviewredditcgprvomdmbjpgwidthformatpjpgautowebpscfddabfacdddbccb latest video view million hours agohighest million views days ago lowest k days agohttpspreviewredditydpymdmbjpgwidthformatpjpgautowebpsdeceadddac lets look video views star anchors ndtv highest view k views hours ago httpspreviewredditudevnndmbjpgwidthformatpjpgautowebpsdaeccecbdfefbcaabc glanced last days ndtv video barely video touching k views still remember ndtv used atleast k views main anchors videos guess adani sellout one watching anymore atleast youtube mostly tv media watched oldies home saying fun watch ravishkumarofficial crossing ndtv subscriber base happen modiadanis plan buy ndtv futile ",
    "cleaned_title": "ravishkumarofficial cross youtube subscriber base ndtv thoughts kindly comment",
    "cleaned_selftext": "saying subscribers cant bought anything guess viewership give idea whether youtube channel hot lets look comparison youtube channels currently ravishkumarofficial million subscriber average viewership million video meanwhile ndtv used good youtube viewership dont views look latest video views ravishkumarhttpspreviewredditcgprvomdmbjpgwidthformatpjpgautowebpscfddabfacdddbccb latest video view million hours agohighest million views days ago lowest k days agohttpspreviewredditydpymdmbjpgwidthformatpjpgautowebpsdeceadddac lets look video views star anchors ndtv highest view k views hours ago httpspreviewredditudevnndmbjpgwidthformatpjpgautowebpsdaeccecbdfefbcaabc glanced last days ndtv video barely video touching k views still remember ndtv used atleast k views main anchors videos guess adani sellout one watching anymore atleast youtube mostly tv media watched oldies home saying fun watch ravishkumarofficial crossing ndtv subscriber base happen modiadanis plan buy ndtv futile",
    "cleaned_comments": "video views last days ravish ndtv ndtv uploading way videos channel already crossed ndtv would subscribers matter even watching videos yeah got point saying would look one single man crosses subscriber base entire network youtube symbolic irony ndtv lol often talk disruptors different industries know peopleeventscompanies dont happen regularly ravishs ytonlineonly venture experiment question potential something much bigger newer ie domain disruption event yet potential plus often dont know postdisruption reality dramatically significantly different would say dhruv rathee pioneer india first one become big alone changed youtube news industry also youtube something new cant disruptor people watch television either cause legacy access youtube xb also fast internet still available lot areas even areas reliable internet isnt available places tv news option need ravish according internet already many independentreliable voices tv dont even one yes ravish dont owe anything us telling would better us country according lets ravish kumar journalist brand much better ndtv godi media channels ndtv propaganda channel like media wish wont left ndtv worked used make administration remove ehh forced quit shows taken air censored mid wayhe literally squeezd point suffocating made video quite ndtv apart ravish impactful reporters also left pranoy roy vishnu som nidhi razdan etc used watch ndtv regularly barely tune vishnu som hes still around govt somehow armtwist youtube pull channel forced quit shows taken air censored mid way punya prasun bajpai ravish miss something sorry meant srinivasan jainvishnu som still around yeah yes thats true actually ndtv started expansion haswill start ndtv rajasthan money allow one anything whether personorganization worthy sarah jacob stopped watching altogether watched uploaded hasnt said anything like said said one thing videos adani said public comment ravish already winner subscribers means nothing yt cake taken channels active viewership cna make money",
    "light_cleaned_title": "Can RavishKumarOfficial cross the youtube subscriber base of NDTV ? What are your thoughts kindly comment",
    "light_cleaned_selftext": "Not saying subscribers cant be bought or anything but i guess viewership can give an idea whether the youtube channel is hot or not Lets look at the comparison of these 2 youtube channels [Currently RavishKumarOfficial has 7.02 Million subscriber and an average viewership of 1.2 Million + on each video Meanwhile NDTV which used to have good youtube viewership dont have any views look at the latest video views of RavishKumar](https://preview.redd.it/cgpr73vomdmb1.jpg?width=807&format=pjpg&auto=webp&s=2c5f21dd5a0b8fa155484614545c5458dd3dbccb) [Latest video view - 1.2 Million 16 hours ago,Highest 2.8 Million views 12 days ago, Lowest 914k 14 days ago](https://preview.redd.it/890y3dpymdmb1.jpg?width=1273&format=pjpg&auto=webp&s=d96317367685e574811c71ead65dda396346006c) Now Lets look at the video views of star anchors of NDTV [Highest View 4.9k views 12 hours ago ](https://preview.redd.it/u6dev0n9ndmb1.jpg?width=1279&format=pjpg&auto=webp&s=dae8c689ce715cb76d8f404ef316b999caabc004) Just glanced through last 30 days of NDTV video and barely any video is touching 50k views I still remember NDTv used to have atleast 500k views on all main anchors videos i guess after adani sellout no one is watching it anymore atleast on youtube and mostly TV media is watched by 50+ Oldies at home. Just saying it will be fun to watch RavishKumarOfficial crossing NDTV subscriber base and if that happen will Modi/Adanis plan to buy NDTV will be futile ?",
    "light_cleaned_comments": "Video views from last 30 days Ravish: 57M NDTV: 39M This is with NDTV uploading way more videos that him. His channel has already crossed NDTV. Why would subscribers matter, if they are not even watching the videos. Yeah i got your point But just saying how it would look if one single man crosses the subscriber base of an entire Network on youtube It will be symbolic irony for NDTV lol We often talk about Disruptors in different industries and we know that such people/events/companies don't happen regularly. Ravish's YT/Online-only venture is an experiment on this question. It has the potential to be something much bigger and \"Newer\", i.e. domain Disruption Event. It's not there yet but it has the potential. Plus we often don't know what the Post-Disruption reality is, just that it's dramatically and significantly different. I would say Dhruv Rathee is pioneer in this in India. He was first one to become such big, alone. He has changed the youtube news industry. Also, youtube is not something new. It can't be disruptor for people who only watch television, either cause of it's legacy, not having access to youtube. &#x200B; Also, Fast Internet is still available in a lot of areas, there are even areas where reliable internet isn't available. In such places too Tv news is only option, and the need of Ravish the most, according to me. Internet already had many independent/reliable voices. Now, TV don't even have one. Yes, Ravish don't owe anything to us, I was just telling what would have been better for us as a country, according to me. Lets do it Ravish Kumar is not only a journalist but a brand himself which is much better than NDTV and all other godi media channels. NDTV is now a propaganda channel just like most of the media. > . I wish he won't have left NDTV, and should have worked as he used to, and make the administration remove him Ehh... He was forced to quit. His shows were taken off air, censored mid way...he was literally squeezd to a point of suffocating. He made a video about why he quite NDTV. Apart from Ravish, all the impactful reporters have also left - Pranoy Roy, Vishnu Som, Nidhi Razdan etc. Used to watch NDTV regularly, now barely tune in > Vishnu Som He's still around. The govt will somehow arm-twist YouTube to pull down his channel. >He was forced to quit. His shows were taken off air, censored mid way What? No, that was punya prasun bajpai, not Ravish. Did I miss something? Sorry I meant srinivasan Jain..Vishnu Som is still around yeah Yes that's true. Actually NDTV has started it's expansion. It has/will start NDTV Rajasthan. Money can allow one to do anything, whether the person/organization is worthy or not. Sarah Jacob too Same here, stopped watching it altogether I watched them when he uploaded them, and now too. He hasn't said anything like what you said. He has only said one thing, not in these videos, which was about what Adani said in his public comment. Ravish is already a winner. Subscribers means nothing in YT, as the cake is taken by channels who have active viewership and cna make more money."
}