{
    "id": "1hb4t7u",
    "title": "NGO writes to CJI Sanjiv Khanna seeking probe against Allahabad high court judge over ‘anti-Muslim slurs' | Latest News India - Hindustan Times",
    "url": "https://www.hindustantimes.com/india-news/ngo-writes-to-cji-sanjiv-khanna-seeking-probe-against-allahabad-high-court-judge-over-anti-muslim-slurs-101733815015002.html",
    "selftext": "An NGO headed by senior Supreme Court lawyer Prashant Bhushan has written to Chief Justice of India (CJI) Sanjiv Khanna seeking a probe against Allahabad high court judge, Justice Shekhar Kumar Yadav, who attended a meeting of the right-wing Vishva Hindu Parishad (VHP) and made alleged anti-Muslim remarks at the event.\n\n>The letter read, “Justice Yadav used unpardonable and unconscionable slurs against the Muslim community, bringing shame and disrepute to the High Office of a Judge of the Allahabad High Court and the Judiciary as a whole, besides undermining the rule of law he is meant to uphold.A strong institutional response is needed to restore public faith in the judiciary,” \nit added, and urged the CJI to immediately suspend the judicial work assigned to the high court judge and set up a time-bound, in-house committee to investigate him.",
    "flair": "Law & Courts",
    "score": 233,
    "num_comments": 9,
    "created_utc": 1733845866.0,
    "convurl": "https://external-preview.redd.it/pSbyR0I07R75hzBPo-I_jHqBAI7Gm5d2IL1yHh-M-HU.jpg?auto=webp&s=3f49d24ed4803cdaf8db5840631c5b102b5196d6",
    "comments": [
        "Such incidents are becoming now norms in India. How many petitions we file? Do you even think SC going to give a heed? I doubt. We are really interested a great shiiiit.",
        "Yes that judge needs to be sacked",
        "allahabad high court seems to be like the mos corrupt and rotten court in india.",
        "Allahabad high court not for beginners. Seriously!",
        "The real criminal in this case was the judge. Judges like these are what allow such cases to happen in a systemic manner. The fact that nothing can be done to her, is what enables people like her to create a system wherein laws can be flouted, distorted and even weaponized just for some bribe.",
        "Instructions unclear. So offered him an RS seat",
        "PB name itself is enough for second thoughts."
    ],
    "cleaned_text": "ngo writes cji sanjiv khanna seeking probe allahabad high court judge antimuslim slurs latest news india hindustan times ngo headed senior supreme court lawyer prashant bhushan written chief justice india cji sanjiv khanna seeking probe allahabad high court judge justice shekhar kumar yadav attended meeting rightwing vishva hindu parishad vhp made alleged antimuslim remarks event letter read justice yadav used unpardonable unconscionable slurs muslim community bringing shame disrepute high office judge allahabad high court judiciary whole besides undermining rule law meant upholda strong institutional response needed restore public faith judiciary added urged cji immediately suspend judicial work assigned high court judge set timebound inhouse committee investigate ",
    "cleaned_title": "ngo writes cji sanjiv khanna seeking probe allahabad high court judge antimuslim slurs latest news india hindustan times",
    "cleaned_selftext": "ngo headed senior supreme court lawyer prashant bhushan written chief justice india cji sanjiv khanna seeking probe allahabad high court judge justice shekhar kumar yadav attended meeting rightwing vishva hindu parishad vhp made alleged antimuslim remarks event letter read justice yadav used unpardonable unconscionable slurs muslim community bringing shame disrepute high office judge allahabad high court judiciary whole besides undermining rule law meant upholda strong institutional response needed restore public faith judiciary added urged cji immediately suspend judicial work assigned high court judge set timebound inhouse committee investigate",
    "cleaned_comments": "incidents becoming norms india many petitions file even think sc going give heed doubt really interested great shiiiit yes judge needs sacked allahabad high court seems like mos corrupt rotten court india allahabad high court beginners seriously real criminal case judge judges like allow cases happen systemic manner fact nothing done enables people like create system wherein laws flouted distorted even weaponized bribe instructions unclear offered rs seat pb name enough second thoughts",
    "light_cleaned_title": "NGO writes to CJI Sanjiv Khanna seeking probe against Allahabad high court judge over ‘anti-Muslim slurs' | Latest News India - Hindustan Times",
    "light_cleaned_selftext": "An NGO headed by senior Supreme Court lawyer Prashant Bhushan has written to Chief Justice of India (CJI) Sanjiv Khanna seeking a probe against Allahabad high court judge, Justice Shekhar Kumar Yadav, who attended a meeting of the right-wing Vishva Hindu Parishad (VHP) and made alleged anti-Muslim remarks at the event. >The letter read, “Justice Yadav used unpardonable and unconscionable slurs against the Muslim community, bringing shame and disrepute to the High Office of a Judge of the Allahabad High Court and the Judiciary as a whole, besides undermining the rule of law he is meant to uphold.A strong institutional response is needed to restore public faith in the judiciary,” it added, and urged the CJI to immediately suspend the judicial work assigned to the high court judge and set up a time-bound, in-house committee to investigate him.",
    "light_cleaned_comments": "Such incidents are becoming now norms in India. How many petitions we file? Do you even think SC going to give a heed? I doubt. We are really interested a great shiiiit. Yes that judge needs to be sacked allahabad high court seems to be like the mos corrupt and rotten court in india. Allahabad high court not for beginners. Seriously! The real criminal in this case was the judge. Judges like these are what allow such cases to happen in a systemic manner. The fact that nothing can be done to her, is what enables people like her to create a system wherein laws can be flouted, distorted and even weaponized just for some bribe. Instructions unclear. So offered him an RS seat PB name itself is enough for second thoughts."
}