{
    "id": "1bhxuan",
    "title": "Citizenship has been known as an internal affair of a country. But Indian citizenship law has drawn criticism from across the globe. See what the new amendment in Citizenship law implies and how Indian citizenship has evolved since Independence.",
    "url": "https://youtu.be/LzQ29HhV_9Q",
    "selftext": "Understand how Indian Citizenship has evolved since independence to be more inclusive and open to Indian across the globe, specifically towards the undivided India \n\nWatch this video to learn more.\n",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1710786253.0,
    "convurl": "https://external-preview.redd.it/BQ6lJQyd7vBuxJyMk2ZaguYeAI4ExzZcM93OQCXkmSg.jpg?auto=webp&s=684a8447c52722c60dec5ea284487497be81f217",
    "comments": [
        "CAA will be implemented in 2024. And it's only for those people who came to India before 2014 Dec 30. But my point is even if you landed in India on 29th Dec 2014, you are still eligible to apply for Indian citizenship through naturalization as you have been living in the country for almost 10 years! So what's the point of CAA?"
    ],
    "cleaned_text": "citizenship known internal affair country indian citizenship law drawn criticism across globe see new amendment citizenship law implies indian citizenship evolved since independence understand indian citizenship evolved since independence inclusive open indian across globe specifically towards undivided india watch video learn ",
    "cleaned_title": "citizenship known internal affair country indian citizenship law drawn criticism across globe see new amendment citizenship law implies indian citizenship evolved since independence",
    "cleaned_selftext": "understand indian citizenship evolved since independence inclusive open indian across globe specifically towards undivided india watch video learn",
    "cleaned_comments": "caa implemented people came india dec point even landed india th dec still eligible apply indian citizenship naturalization living country almost years whats point caa",
    "light_cleaned_title": "Citizenship has been known as an internal affair of a country. But Indian citizenship law has drawn criticism from across the globe. See what the new amendment in Citizenship law implies and how Indian citizenship has evolved since Independence.",
    "light_cleaned_selftext": "Understand how Indian Citizenship has evolved since independence to be more inclusive and open to Indian across the globe, specifically towards the undivided India Watch this video to learn more.",
    "light_cleaned_comments": "CAA will be implemented in 2024. And it's only for those people who came to India before 2014 Dec 30. But my point is even if you landed in India on 29th Dec 2014, you are still eligible to apply for Indian citizenship through naturalization as you have been living in the country for almost 10 years! So what's the point of CAA?"
}