{
    "id": "1dtm9jb",
    "title": "No scientific study to blame Punjab farm fires for Delhi's pollution, says NGT member",
    "url": "https://www.telegraphindia.com/india/no-scientific-study-to-blame-punjab-farm-fires-for-delhis-pollution-says-ngt-member/cid/2031059",
    "selftext": "Was there any scientific study conducted before alleging so?\" Justice Agarwal asked, adding that the Delhi air had oily content and it not possible that crop residues, which are biodegradable in nature, can have these",
    "flair": "Law & Courts",
    "score": 65,
    "num_comments": 13,
    "created_utc": 1719928048.0,
    "convurl": "https://external-preview.redd.it/hRZgqBYv32thDNchxUp9rX_hmrbjf2sjAlunYPKSkHE.jpg?auto=webp&s=043417be7d2ddab0255a3f184d1e38cf856bc8a1",
    "comments": [
        "Chalo ji bhadwo… bahut bura bhala bolte ho ounjab ko har baar",
        "Great to hear!",
        "Ab sardiyo meh NCR ki janta kidr RR kregi",
        "So NGT doesn't know the reason either.  Ridiculous.",
        "true,,   \nPeople blame cows for climate change,, while roaming around in their cars,,\n\nthere are no airplane in punjab farms  \nif punjab farm contribute 5% to delhi pollution\n\ndelhi people contribute 95% to delhi pollution",
        "The air always has a constant leaves/plants burning smell in October. Where does that smell come from?",
        "Haryana's paad",
        "I’m sorry, as someone with feet in both mudpiles, punjab absolutely fucks ncr over every smog season. It’s not a. Coincidence that crop burning coincides with my throat burning.",
        "NCR-- we will do pollution and blame punjab  \nPunjab- we agree that Crop affects climate and we are ready to reduce burning the waste,, but NCR needs to stop it's haphazard development  \nNCR- we are the versatile city who can handle city car pollution  \nbut we cannot handle punjab crop burn...  \nNCR- we will burn our lungs with Cigerrate but,, punjab should stop it's crop burn  \nStupid,, NCR privileged kids",
        "Up, haryana, and Punjab. There are official claims of there being hardly any farm fires in up and haryana, but a single highway ride in the season shows more farm fires than the reported numbers for the whole state. ",
        "I live in Punjab, the smoke of crops is not oily but makes your eyes dry and pain.",
        "So where does that smoke from farm fires go?",
        "Toh karo scientific study, kiska kaam hai ye?"
    ],
    "cleaned_text": "scientific study blame punjab farm fires delhis pollution says ngt member scientific study conducted alleging justice agarwal asked adding delhi air oily content possible crop residues biodegradable nature ",
    "cleaned_title": "scientific study blame punjab farm fires delhis pollution says ngt member",
    "cleaned_selftext": "scientific study conducted alleging justice agarwal asked adding delhi air oily content possible crop residues biodegradable nature",
    "cleaned_comments": "chalo ji bhadwo bahut bura bhala bolte ho ounjab ko har baar great hear ab sardiyo meh ncr ki janta kidr rr kregi ngt doesnt know reason either ridiculous true people blame cows climate change roaming around cars airplane punjab farms punjab farm contribute delhi pollution delhi people contribute delhi pollution air always constant leavesplants burning smell october smell come haryanas paad im sorry someone feet mudpiles punjab absolutely fucks ncr every smog season coincidence crop burning coincides throat burning ncr pollution blame punjab punjab agree crop affects climate ready reduce burning waste ncr needs stop haphazard development ncr versatile city handle city car pollution handle punjab crop burn ncr burn lungs cigerrate punjab stop crop burn stupid ncr privileged kids haryana punjab official claims hardly farm fires haryana single highway ride season shows farm fires reported numbers whole state live punjab smoke crops oily makes eyes dry pain smoke farm fires go toh karo scientific study kiska kaam hai ye",
    "light_cleaned_title": "No scientific study to blame Punjab farm fires for Delhi's pollution, says NGT member",
    "light_cleaned_selftext": "Was there any scientific study conducted before alleging so?\" Justice Agarwal asked, adding that the Delhi air had oily content and it not possible that crop residues, which are biodegradable in nature, can have these",
    "light_cleaned_comments": "Chalo ji bhadwo… bahut bura bhala bolte ho ounjab ko har baar Great to hear! Ab sardiyo meh NCR ki janta kidr RR kregi So NGT doesn't know the reason either. Ridiculous. true,, People blame cows for climate change,, while roaming around in their cars,, there are no airplane in punjab farms if punjab farm contribute 5% to delhi pollution delhi people contribute 95% to delhi pollution The air always has a constant leaves/plants burning smell in October. Where does that smell come from? Haryana's paad I’m sorry, as someone with feet in both mudpiles, punjab absolutely fucks ncr over every smog season. It’s not a. Coincidence that crop burning coincides with my throat burning. NCR-- we will do pollution and blame punjab Punjab- we agree that Crop affects climate and we are ready to reduce burning the waste,, but NCR needs to stop it's haphazard development NCR- we are the versatile city who can handle city car pollution but we cannot handle punjab crop burn... NCR- we will burn our lungs with Cigerrate but,, punjab should stop it's crop burn Stupid,, NCR privileged kids Up, haryana, and Punjab. There are official claims of there being hardly any farm fires in up and haryana, but a single highway ride in the season shows more farm fires than the reported numbers for the whole state. I live in Punjab, the smoke of crops is not oily but makes your eyes dry and pain. So where does that smoke from farm fires go? Toh karo scientific study, kiska kaam hai ye?"
}