{
    "id": "15gcmhk",
    "title": "This? When the nation is burning.",
    "url": "https://www.reddit.com/r/india/comments/15gcmhk/this_when_the_nation_is_burning/",
    "selftext": "PM conferred with Lokmanya Tilak National Award. \n\n\nhttps://www.mid-day.com/mumbai/mumbai-news/photo/in-photos-in-pune-pm-modi-conferred-with-lokmanya-tilak-national-award-96658/1",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690991751.0,
    "convurl": "https://external-preview.redd.it/scNQDy5hlodAbXbyR82yys9KIsR3oPE-vdVwubJyApY.jpg?auto=webp&s=279c3e989ac11eb4ac45ddd042d23bbe877d352a",
    "comments": [
        "If’s like a Bollywood award. Those that attend get it automatically. Here, the PM must have announced he would go for a pure photoshoot, and being a PM he would get it.\n\nAward shward sab sham show.",
        "Some people are incapable of shame.",
        "Pre election gimmick",
        "and people will eat it up. soon we will see tweets saying Mo*i ji the great and only savior of India is best thing to ever happen.",
        "PR JEEVI",
        "I this point do you think this fakir even has any shame or guilt left",
        "Modi is the ultimate influencer. He can make you ignore all the shit and brainwash you to believe that he is the one for India.  People are debating on baseless issues because he and his followers are hyping them. Please look beyond them and try to see the real picture."
    ],
    "cleaned_text": "nation burning pm conferred lokmanya tilak national award ",
    "cleaned_title": "nation burning",
    "cleaned_selftext": "pm conferred lokmanya tilak national award",
    "cleaned_comments": "ifs like bollywood award attend get automatically pm must announced would go pure photoshoot pm would get award shward sab sham show people incapable shame pre election gimmick people eat soon see tweets saying moi ji great savior india best thing ever happen pr jeevi point think fakir even shame guilt left modi ultimate influencer make ignore shit brainwash believe one india people debating baseless issues followers hyping please look beyond try see real picture",
    "light_cleaned_title": "This? When the nation is burning.",
    "light_cleaned_selftext": "PM conferred with Lokmanya Tilak National Award.",
    "light_cleaned_comments": "If’s like a Bollywood award. Those that attend get it automatically. Here, the PM must have announced he would go for a pure photoshoot, and being a PM he would get it. Award shward sab sham show. Some people are incapable of shame. Pre election gimmick and people will eat it up. soon we will see tweets saying Mo*i ji the great and only savior of India is best thing to ever happen. PR JEEVI I this point do you think this fakir even has any shame or guilt left Modi is the ultimate influencer. He can make you ignore all the shit and brainwash you to believe that he is the one for India. People are debating on baseless issues because he and his followers are hyping them. Please look beyond them and try to see the real picture."
}