{
    "id": "1f65b1j",
    "title": "PM Modi highlights India’s 90% growth in over a decade, promises dynamic policies",
    "url": "https://indianexpress.com/article/business/pm-modi-highlights-indias-90-growth-in-over-a-decade-promises-dynamic-policies-9543689/lite/",
    "selftext": "Reading this article makes me question my own mental capacity and exactly how delusional and disconnected he has become from the ground reality. With each year, the economic struggles which the country has to endure stating with unemployment, high tariff rate, etc., these kinds of statements feel like adding salt to the already growing wound of the middle-class. I challenge anyone to read this article without atleast once questioning exactly what he had in mind while speaking.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1725162059,
    "convurl": "https://external-preview.redd.it/ln1w4TCgA7hX6-Ty1yMDo9TmCQEZmhUsfQ820kEbwQ0.jpg",
    "comments": [],
    "cleaned_text": "pm modi highlights indias growth decade promises dynamic policies reading article makes question mental capacity exactly delusional disconnected become ground reality year economic struggles country endure stating unemployment high tariff rate etc kinds statements feel like adding salt already growing wound middleclass challenge anyone read article without atleast questioning exactly mind speaking ",
    "cleaned_title": "pm modi highlights indias growth decade promises dynamic policies",
    "cleaned_selftext": "reading article makes question mental capacity exactly delusional disconnected become ground reality year economic struggles country endure stating unemployment high tariff rate etc kinds statements feel like adding salt already growing wound middleclass challenge anyone read article without atleast questioning exactly mind speaking",
    "cleaned_comments": "",
    "light_cleaned_title": "PM Modi highlights India’s 90% growth in over a decade, promises dynamic policies",
    "light_cleaned_selftext": "Reading this article makes me question my own mental capacity and exactly how delusional and disconnected he has become from the ground reality. With each year, the economic struggles which the country has to endure stating with unemployment, high tariff rate, etc., these kinds of statements feel like adding salt to the already growing wound of the middle-class. I challenge anyone to read this article without atleast once questioning exactly what he had in mind while speaking.",
    "light_cleaned_comments": ""
}