{
    "id": "pwvjeo",
    "title": "Bi-Weekly Gaming Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/pwvjeo/biweekly_gaming_discussion_thread/",
    "selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!)\n\nWhat game are you looking forward to? Are you a developer? Show us your wares!\n\nPlease don't just list the names of games, make sure to write a word or two about them as well.\n\nCheck out r/IndianGaming! They are an active community and also host a few co-op sessions.\n\n**Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/xagdqefyv8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;s=f975f1c3093a3d9598a1da39854b03d1250bd55d",
    "flair": "Scheduled",
    "score": 8,
    "num_comments": 18,
    "created_utc": 1632792614,
    "convurl": "https://b.thumbs.redditmedia.com/1yW1vnOXXLbj7GjIDC4BNEociU_mAxBuQABJNbaBbBc.jpg",
    "comments": [
        "Finished Mortal Shell last night. \n\nFor a team of a little over ten people it's a fantastic effort.",
        "Been playing Hades. Awesome rogue lite by a small studio. It's available on Gamepass and on Steam.",
        "Idk if this is the right thread but anyone know the best option for a tablet at around 20K ( can increase to 25k if the option is really good) to play cod mobile? I'm not a fan of iPad as I've never used apple and I like to pirate stuff too so having lots of storage with SD card would be nice, so if the file system is restrictive ( correct me if I'm wrong)",
        "Playing \"The Artful Escape\". It has stunning visuals, but the gameplay gets boring quickly.",
        "Playing stardew valley. Seems interesting but right now most of the items are locked and it's too tedious to water my crops with a water cane.",
        "If I were you I'd just buy a used PS4.",
        "Deltarune Ch 1 and 2 are free on steam so playing right now",
        "Indians don't really understand how bad mobile gaming is as compared to console and that's sad.",
        "I don't want consoles, i dont spend time at home enough to have a big screen tv, console, sit down and play peacefully being in a medical internship with 12+ hours in the hospital sometimes \n\n\nPlus the tablet has other uses like reading and studying, watching lectures etc on the go",
        "Excuse me, did you just start judging an entire country and it's people over their choice of gaming ? \n\n\nI was an avid pc gamer and know that console / pc games are obviously better but I don't have the time or resources to sit down and play in front of a big screen tv and console / pc in life being in a hectic medical residency. \n\n\n\nCod mobile is as good content wise as the console cods Btw, some may argue its even better than the current cold War.",
        "The game is a fricking gem. Music, voice acting, everything is top tier",
        "rainbow six siege",
        "does anyone play minecraft",
        "Bro don’t care what these people have to say. I have a 2080Ti and played a lot on many consoles before and I spent the second half of 2020 playing a lot of Codm arena. It’s genuinely a good FPS. \n\nI used to play on iPad Air 3 with gyroscope on had a blast playing search and destroy and other modes on arena. A bit more expensive but so far has been worth it since I’ve used it a lot even apart from gaming (Apart from having a touch issue which was solved under warranty which was fortunate). I would suggest one of Samsung tabs with a decent processor(S5e had sd670 and others that have sd8XX processors) or any ipad (A12 and up).\n\nI too don’t like Apple but for 25-30k even the base iPad with A12 would be a good deal if you mainly want some major games and proper use like Netflix,study etc. although it doesn’t have that good a screen and can’t do pirated shit on it. (Even transferring files with windows you need to jump through hoops) \n\nYou can take a chance with Samsung’s tabs around 20-25k range, should still be playable with high or at least medium graphics but no clue how long they will be supported and other issues that crop up. There’s very few options in a decent tab market, specially for android",
        "Pokemon emerald is the best for gba, great soundtrack too, I suggest you try that if you finish fire red(let’s be honest they’re a bit dated lol)",
        "Thank you so much for the reply :)",
        "Yea"
    ],
    "cleaned_text": "biweekly gaming discussion thread playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly gaming discussion thread",
    "cleaned_selftext": "playing rindia let us use thread discuss games youre playing played going play mobile board games included game looking forward developer show us wares please dont list names games make sure write word two well check rindiangaming active community also host coop sessions gaming thread posted every two weeks tuesday mornings old threadshttpsredditcomrindiasearchqbiweeklygamingdiscussionthreadamprestrictsronampsortnewamptall",
    "cleaned_comments": "finished mortal shell last night team little ten people fantastic effort playing hades awesome rogue lite small studio available gamepass steam idk right thread anyone know best option tablet around k increase k option really good play cod mobile im fan ipad ive never used apple like pirate stuff lots storage sd card would nice file system restrictive correct im wrong playing artful escape stunning visuals gameplay gets boring quickly playing stardew valley seems interesting right items locked tedious water crops water cane id buy used ps deltarune ch free steam playing right indians dont really understand bad mobile gaming compared console thats sad dont want consoles dont spend time home enough big screen tv console sit play peacefully medical internship hours hospital sometimes plus tablet uses like reading studying watching lectures etc go excuse start judging entire country people choice gaming avid pc gamer know console pc games obviously better dont time resources sit play front big screen tv console pc life hectic medical residency cod mobile good content wise console cods btw may argue even better current cold war game fricking gem music voice acting everything top tier rainbow six siege anyone play minecraft bro dont care people say ti played lot many consoles spent second half playing lot codm arena genuinely good fps used play ipad air gyroscope blast playing search destroy modes arena bit expensive far worth since ive used lot even apart gaming apart touch issue solved warranty fortunate would suggest one samsung tabs decent processorse sd others sdxx processors ipad dont like apple k even base ipad would good deal mainly want major games proper use like netflixstudy etc although doesnt good screen cant pirated shit even transferring files windows need jump hoops take chance samsungs tabs around k range still playable high least medium graphics clue long supported issues crop theres options decent tab market specially android pokemon emerald best gba great soundtrack suggest try finish fire redlets honest theyre bit dated lol thank much reply yea",
    "light_cleaned_title": "Bi-Weekly Gaming Discussion Thread",
    "light_cleaned_selftext": "What are you playing, r/India? Let us use this thread to discuss any games you're playing, have played or are going to play. (Mobile and board games included!) What game are you looking forward to? Are you a developer? Show us your wares! Please don't just list the names of games, make sure to write a word or two about them as well. Check out r/IndianGaming! They are an active community and also host a few co-op sessions. **Gaming Thread is posted every two weeks on Tuesday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Gaming+Discussion+Thread&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Finished Mortal Shell last night. For a team of a little over ten people it's a fantastic effort. Been playing Hades. Awesome rogue lite by a small studio. It's available on Gamepass and on Steam. Idk if this is the right thread but anyone know the best option for a tablet at around 20K ( can increase to 25k if the option is really good) to play cod mobile? I'm not a fan of iPad as I've never used apple and I like to pirate stuff too so having lots of storage with SD card would be nice, so if the file system is restrictive ( correct me if I'm wrong) Playing \"The Artful Escape\". It has stunning visuals, but the gameplay gets boring quickly. Playing stardew valley. Seems interesting but right now most of the items are locked and it's too tedious to water my crops with a water cane. If I were you I'd just buy a used PS4. Deltarune Ch 1 and 2 are free on steam so playing right now Indians don't really understand how bad mobile gaming is as compared to console and that's sad. I don't want consoles, i dont spend time at home enough to have a big screen tv, console, sit down and play peacefully being in a medical internship with 12+ hours in the hospital sometimes Plus the tablet has other uses like reading and studying, watching lectures etc on the go Excuse me, did you just start judging an entire country and it's people over their choice of gaming ? I was an avid pc gamer and know that console / pc games are obviously better but I don't have the time or resources to sit down and play in front of a big screen tv and console / pc in life being in a hectic medical residency. Cod mobile is as good content wise as the console cods Btw, some may argue its even better than the current cold War. The game is a fricking gem. Music, voice acting, everything is top tier rainbow six siege does anyone play minecraft Bro don’t care what these people have to say. I have a 2080Ti and played a lot on many consoles before and I spent the second half of 2020 playing a lot of Codm arena. It’s genuinely a good FPS. I used to play on iPad Air 3 with gyroscope on had a blast playing search and destroy and other modes on arena. A bit more expensive but so far has been worth it since I’ve used it a lot even apart from gaming (Apart from having a touch issue which was solved under warranty which was fortunate). I would suggest one of Samsung tabs with a decent processor(S5e had sd670 and others that have sd8XX processors) or any ipad (A12 and up). I too don’t like Apple but for 25-30k even the base iPad with A12 would be a good deal if you mainly want some major games and proper use like Netflix,study etc. although it doesn’t have that good a screen and can’t do pirated shit on it. (Even transferring files with windows you need to jump through hoops) You can take a chance with Samsung’s tabs around 20-25k range, should still be playable with high or at least medium graphics but no clue how long they will be supported and other issues that crop up. There’s very few options in a decent tab market, specially for android Pokemon emerald is the best for gba, great soundtrack too, I suggest you try that if you finish fire red(let’s be honest they’re a bit dated lol) Thank you so much for the reply :) Yea"
}