{
    "id": "174gus3",
    "title": "Akshay Kumar's sycophancy knows no bounds",
    "url": "https://i.redd.it/79kr0voofctb1.jpg",
    "selftext": "This man got his Indian passport on August 15th and is yet to travel to any country beyond Nepal. And yet feels no shame in making such outlandish statements to please the PM.\n\nAnother gem from a man who portrays himself as a preacher of social change and yet promotes ads for Pan Masala. \n\nWe need to start openly calling out celebrities who are bending over backwards to support the government at every step.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1696929855.0,
    "convurl": "https://i.redd.it/79kr0voofctb1.jpg",
    "comments": [
        "LOL. Can't laugh enough on this shit statement from a godi wala.",
        ">Land of Modi\n\nLMAO WTF",
        "What a worst way to insult 😒",
        "He probably said, \" Oh, you come from the lund of Modi\" but Ex Canadian misheard it.",
        "He knows, he will notbe counter questioned.. He can say whatever he want. Any journalist worth their salt would have asked about it. But expecting that from Navika is far fetched",
        "Spitting that Vimal Pan Masala straight up Gobijis ass.",
        "I am an Indian living in Germany and this never happened with me. \n\nVery few people know Modi and among those who do know him, most have mixed feelings about him at best.",
        "Obviously it's utter BS...just shocked at seeing the levels of nonsense some people will spout to remain in the good books of the government",
        "Kim Jong Un probably has better recall value",
        "Facts",
        "The things people do when their movies are flopping one after the other ..",
        "Did he say land or lund",
        "Politicians can make actors their puppets because they work for money. \n\nOld akshay is already gone. A great comedy and action star died long ago.",
        "/r/thatHappened",
        "The fellow is desperate to get attention and success for movies by using Modi's name",
        "Any country that is known by its chief functionary is doing well.  😄",
        "r/thingsthatdidnthappen",
        "Did he actually say this? How much is BJP paying him ? Or in what way are they threatening him? \n\n🤣",
        "Yeah for example Kim jong un.",
        "Land of the very first civilization, land of buddha, land of kingdoms, land of diversity, land of culture, but this man decided to say the worst shit",
        "I think the officer was trying to be sarcastic and Akshay took it as a compliment. So naive of him.",
        "Sad part is people actually believe this crap.",
        "\nHahahahah cracked me up.",
        "..and everyone clapped!",
        "Ghar wapsi mein Akki ne bhang pi liya",
        " Just wait what they say when our Rahul Gandhi becomes PM.",
        "nice dream bro",
        "Dekho bhai kutta dusre ki katega lekin apne malik ki hamesha chatega.",
        "Aray yeh toh Canadian passport wala hai na ?",
        "WTF is this man smoking lol",
        "yeah they mean neerav modi",
        "Is Akshay just the nationalist spokesperson of the BJP in media now? Do you guys think people pay him?",
        "A grade lund chuswa in a show with A grade gaand chatwi.",
        "What’s wrong with this guy",
        "Hahaha, what bs",
        "Asli deshdrohi to ye log hain."
    ],
    "cleaned_text": "akshay kumars sycophancy knows bounds man got indian passport august th yet travel country beyond nepal yet feels shame making outlandish statements please pm another gem man portrays preacher social change yet promotes ads pan masala need start openly calling celebrities bending backwards support government every step ",
    "cleaned_title": "akshay kumars sycophancy knows bounds",
    "cleaned_selftext": "man got indian passport august th yet travel country beyond nepal yet feels shame making outlandish statements please pm another gem man portrays preacher social change yet promotes ads pan masala need start openly calling celebrities bending backwards support government every step",
    "cleaned_comments": "lol cant laugh enough shit statement godi wala land modi lmao wtf worst way insult probably said oh come lund modi ex canadian misheard knows notbe counter questioned say whatever want journalist worth salt would asked expecting navika far fetched spitting vimal pan masala straight gobijis ass indian living germany never happened people know modi among know mixed feelings best obviously utter bsjust shocked seeing levels nonsense people spout remain good books government kim jong un probably better recall value facts things people movies flopping one say land lund politicians make actors puppets work money old akshay already gone great comedy action star died long ago rthathappened fellow desperate get attention success movies using modis name country known chief functionary well rthingsthatdidnthappen actually say much bjp paying way threatening yeah example kim jong un land first civilization land buddha land kingdoms land diversity land culture man decided say worst shit think officer trying sarcastic akshay took compliment naive sad part people actually believe crap hahahahah cracked everyone clapped ghar wapsi mein akki ne bhang pi liya wait say rahul gandhi becomes pm nice dream bro dekho bhai kutta dusre ki katega lekin apne malik ki hamesha chatega aray yeh toh canadian passport wala hai na wtf man smoking lol yeah mean neerav modi akshay nationalist spokesperson bjp media guys think people pay grade lund chuswa show grade gaand chatwi whats wrong guy hahaha bs asli deshdrohi ye log hain",
    "light_cleaned_title": "Akshay Kumar's sycophancy knows no bounds",
    "light_cleaned_selftext": "This man got his Indian passport on August 15th and is yet to travel to any country beyond Nepal. And yet feels no shame in making such outlandish statements to please the PM. Another gem from a man who portrays himself as a preacher of social change and yet promotes ads for Pan Masala. We need to start openly calling out celebrities who are bending over backwards to support the government at every step.",
    "light_cleaned_comments": "LOL. Can't laugh enough on this shit statement from a godi wala. >Land of Modi LMAO WTF What a worst way to insult 😒 He probably said, \" Oh, you come from the lund of Modi\" but Ex Canadian misheard it. He knows, he will notbe counter questioned.. He can say whatever he want. Any journalist worth their salt would have asked about it. But expecting that from Navika is far fetched Spitting that Vimal Pan Masala straight up Gobijis ass. I am an Indian living in Germany and this never happened with me. Very few people know Modi and among those who do know him, most have mixed feelings about him at best. Obviously it's utter BS...just shocked at seeing the levels of nonsense some people will spout to remain in the good books of the government Kim Jong Un probably has better recall value Facts The things people do when their movies are flopping one after the other .. Did he say land or lund Politicians can make actors their puppets because they work for money. Old akshay is already gone. A great comedy and action star died long ago. /r/thatHappened The fellow is desperate to get attention and success for movies by using Modi's name Any country that is known by its chief functionary is doing well. 😄 r/thingsthatdidnthappen Did he actually say this? How much is BJP paying him ? Or in what way are they threatening him? 🤣 Yeah for example Kim jong un. Land of the very first civilization, land of buddha, land of kingdoms, land of diversity, land of culture, but this man decided to say the worst shit I think the officer was trying to be sarcastic and Akshay took it as a compliment. So naive of him. Sad part is people actually believe this crap. Hahahahah cracked me up. ..and everyone clapped! Ghar wapsi mein Akki ne bhang pi liya Just wait what they say when our Rahul Gandhi becomes PM. nice dream bro Dekho bhai kutta dusre ki katega lekin apne malik ki hamesha chatega. Aray yeh toh Canadian passport wala hai na ? WTF is this man smoking lol yeah they mean neerav modi Is Akshay just the nationalist spokesperson of the BJP in media now? Do you guys think people pay him? A grade lund chuswa in a show with A grade gaand chatwi. What’s wrong with this guy Hahaha, what bs Asli deshdrohi to ye log hain."
}