{
    "id": "1ea6sif",
    "title": "NTA NEET UG 2024 Supreme Court Hearing Live Updates: No re-test, says Supreme Court | Education News - The Indian Express",
    "url": "https://indianexpress.com/article/education/nta-neet-ug-2024-supreme-court-hearing-live-updates-reneet-decision-on-paper-leak-9463530/",
    "selftext": "NTA NEET UG 2024 Supreme Court Hearing Live: The Supreme Court today commenced hearing on a batch of petitions related to the controversy-ridden medical entrance exam, NEET-UG 2024. Meanwhile, IIT-Delhi's report stated option 4 is the correct answer for the physics question.",
    "flair": "Law & Courts",
    "score": 7,
    "num_comments": 2,
    "created_utc": 1721738310.0,
    "convurl": "https://external-preview.redd.it/dwdDeuiF4keVt0a3dFm6Sm8DnrHF7mr1r9BPlT5qnaE.jpg?auto=webp&s=d75e6392eadef19dad886559fba942581c11eedd",
    "comments": [
        "I followed the entire hearing(since I am a NEET UG aspirant). I and infact most of us knew that  the chances of retest are very low.\n\nWhat hurt the most was that NTA was not held accountable for all its misconduct and mismanagement.\n\nWe were hoping that the agency would be dissolved or at least the apex court would order the Government for some serious changes in the organisation but nothing of that sort happened. That is what hurts the most.",
        "Yeah this has surprised me too honestly. The loopholes in the whole NTA system needed to be addressed. Especially for how they give private tenders for management."
    ],
    "cleaned_text": "nta neet ug supreme court hearing live updates retest says supreme court education news indian express nta neet ug supreme court hearing live supreme court today commenced hearing batch petitions related controversyridden medical entrance exam neetug meanwhile iitdelhis report stated option correct answer physics question ",
    "cleaned_title": "nta neet ug supreme court hearing live updates retest says supreme court education news indian express",
    "cleaned_selftext": "nta neet ug supreme court hearing live supreme court today commenced hearing batch petitions related controversyridden medical entrance exam neetug meanwhile iitdelhis report stated option correct answer physics question",
    "cleaned_comments": "followed entire hearingsince neet ug aspirant infact us knew chances retest low hurt nta held accountable misconduct mismanagement hoping agency would dissolved least apex court would order government serious changes organisation nothing sort happened hurts yeah surprised honestly loopholes whole nta system needed addressed especially give private tenders management",
    "light_cleaned_title": "NTA NEET UG 2024 Supreme Court Hearing Live Updates: No re-test, says Supreme Court | Education News - The Indian Express",
    "light_cleaned_selftext": "NTA NEET UG 2024 Supreme Court Hearing Live: The Supreme Court today commenced hearing on a batch of petitions related to the controversy-ridden medical entrance exam, NEET-UG 2024. Meanwhile, IIT-Delhi's report stated option 4 is the correct answer for the physics question.",
    "light_cleaned_comments": "I followed the entire hearing(since I am a NEET UG aspirant). I and infact most of us knew that the chances of retest are very low. What hurt the most was that NTA was not held accountable for all its misconduct and mismanagement. We were hoping that the agency would be dissolved or at least the apex court would order the Government for some serious changes in the organisation but nothing of that sort happened. That is what hurts the most. Yeah this has surprised me too honestly. The loopholes in the whole NTA system needed to be addressed. Especially for how they give private tenders for management."
}