{
    "id": "16edgf1",
    "title": "How to remove this",
    "url": "https://i.redd.it/1inh1jua0anb1.jpg",
    "selftext": "PS - I paid for it, it seems they forgot to remove this.",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694285380.0,
    "convurl": "https://i.redd.it/1inh1jua0anb1.jpg",
    "comments": [
        "Go to the reliance store where you bought it from, they'll take it out for you.",
        "What if they say you stole it 😭",
        "Nice try police!",
        "Chor!!!!",
        "Receipt?",
        "Need a strong magnet for this. Just search on youtube, plenty of tutorials on how to remove security tags.",
        "Fenk diya",
        "No 😭😭😭",
        "They can’t ‘forget’ to remove it, that’s weird. The store security barriers would raise alarm if anyone walks out of the store with an article of clothing with the security tag still on it. Try to see if you can show bank statements with your transaction if you don’t have a receipt, I guess.",
        "I had removed a similar one by cutting the outer plastic and removing the pin & spring inside it. But if you have a strong magnet like neodymium try with it first.",
        "Nope this happened to me twice",
        "They should be able to pull it up based on the date you purchased",
        "Strange. Were you able to resolve the issue?",
        "Chor chor churi korecho chor\n\nMagnetic eta erom bhabhe khulbena \nBhangte hobe... atleast amio tai korechilam",
        "Nai bhai paisa diya tha Pura 600 😭",
        "Chorri Kari hai tumne 😡",
        "use a strong magnet and place it near that elevated part",
        "Pull it with your teeth",
        "It happened to me also. In US.",
        "I have had it happen to me once, they actually did forgot. I used magnets to remove them",
        "Go to a store different from the brand that you purchased and ask them to remove it.\n\nProblem solved.",
        "How did you pay? Cash or upi or card?",
        "Return it to my store please 💀",
        "Pay for it.",
        "Pay for it",
        "Lock picking lawyer had a video on this\n\nhttps://youtu.be/pji33MoJ5Z4?feature=shared",
        "I did 😭",
        "Card",
        "This is fucking strong honestly",
        "Hammer.",
        "Pay",
        "That's not true at all lol. I've had this happen many times to me.",
        "Happened to me once and saw it happen to others at two different stores. Thankfully we found out the very same day so we went to with our bill and got it",
        "Take print out of transaction just limit your statement to include only few transactions. Should work ig. They can match it with their timings if you go to same counter maybe?",
        "What is this (I am sorry I am a fucking Idiot)",
        "Magnet 🧲 🧲",
        "Use a heavy magnet, youtube pe video dekhlo",
        "If you are saying you've thrown the receipt already then that means you stole it. The scanners at the gate would have sounded the alarm if this wasn't removed while you left the store. Stop lying and just go return it.",
        "Pay!",
        "YT",
        "By paying up for it.",
        "**By paying for it**",
        "A strong magnet like neodymium will work",
        "Cast it into the fire!",
        "Idk why you all think this is impossible, I frequently buy from Monte Carlo factory outlet and because of so much rush they forget to remove it so many times in my case, even happened once at Levi's too.",
        "Just use a strong magnet",
        "Next time instead of making a reddit post, try paying for the product. \n\nHow convenient that you immediately threw the receipt after buying it.",
        "Use a magnet on the metal side, it should pull out the pin.",
        "Use two forks and open it",
        "Bro YouTube dekh le.",
        "Cutting Plier",
        "Happens all the time when you have lot of clothes. They will try to remove it but then sometimes it doesn’t come off. Happened to me once. Just smash it with a hammer. The ball bearings will fall out. Guess they just keep the security gates turned off to save power.",
        "Hammer, saw, soldering to melt the plastic, teeth etc",
        "buy it lol",
        "Yes i did ,i took pliers and cut them out but it will damage somepart of cloth i would recommend going to store",
        "My wife had a similar situation with our son's t-shirt. We didn't want to go to the store thinking they would say we stole it (we did not have the receipt) \n\nI looked for some YouTube clips but was not successful in removing it. \n\nAfter a few days, we just went to the store, and they removed it, no questions asked.",
        "Pay",
        "Are ekta hammer niye jor jor se maro agar nehi tuta toh yehi pehen lo kya hi hoga",
        "Happens a lot of times nowadays, just go to store you don't need to buy anything too. We need a magnet to remove it. That's it.",
        "By paying for it😂",
        "To remove this you’ve to buy clothes not steal them. CHOR!",
        "Pay for it",
        "even if he stole it, scanners at the gate should have sounded alarm.",
        "Care to explain what is that thing?",
        "There are tons of ways to steal them without going through the scanners. I have friends in the retail industry and I have heard all types of crazy stories from them",
        "This is tag which turn in the alarm when someone try to sneak thing out of the store but you managed it successfully",
        "Thanks",
        "I used to work in zara before \n\nThere was one customer who said the same thing \nWe couldn’t do anything since he didn’t have bill \n\nLmao he was so furious",
        "Go to the store they will remove it.\nIf you do not have the bill then you can do the following\n1 If paid online by card,UPI show them the transaction Id they will retrieve the bill\n2 If paid by cash if you have given your mobile number then they will retrieve the bill\nIf nothing works ask them to check the cctv for proof",
        "They do forget sometimes. Also the barrier can miss too, else how come OP came out. Certainly he didn't do a money heist for Rs 600.",
        "Just go to the store, you paid with card so you have that and even if they don’t acknowledge it, they will have cameras on the billing counter, just ask them to check those.",
        "Get one hammer and crush it with that",
        "Atleast you have a store to go to. I ordered trousers from Myntra and they fucking sent it to me with the security tag on 😭 I only saw it a few days later since it was at the end towards the feet and by the time the exchange period ended and they said to fuck off. Sala itna poweful magnet hai, ek saal ho gaya hai nahi nikal raha.",
        "By paying for it ?",
        "If its digital payment you can show as proof and they can pull up the receipt",
        "https://amzn.eu/d/fEOBxHc\nBuy this. U can regularly to do shoplifting after buying this.",
        "How to remove this\n\nPay",
        "I too faced the same issue.\nJust go to the store and ask them to remove it and they will do it.",
        "Once I ordered a garment online and it came with it still attached. \nBurn it with a candle until the outer plastic melts and then use a knife and try not to damage the garment. \nThat's how I did it.",
        "I recently got many items from Ajio withsecurity tags. Stupid Ajio didn't even bothered to remove it.\n\nIf you have hammer 🔨 just two good hits are required. Do it away from your living rooms and children as it has a needle and small steel balls. Infants can swallow those if left around.",
        "What if the magnet costs more than the thing he bought/stole?",
        "Don't ask reddit, ask YouTube, ask chatGPT",
        "By paying for it.",
        "Hammer it",
        "Hatoda maar ke kopdi todd",
        "This exact same sh*t happened to me once but it was online shopping so didn't really face any problem later while exchanging",
        "he should steal a magnet",
        "Only if he gets attracted to it.",
        "Reliance stores generally send you an online receipt on your mobile nom if you provided at the time of transaction. Download and then go to their store.\n\nIf not you'll need something magnetic to remove that.",
        "no this happen to me also",
        "Bhai hathoda le or maar de toot jayega",
        "They have it in the system . Just give them ur phone number.",
        "Lol this worked, thanks",
        "World's biggest magnet is the Earth itself!",
        "Itne ka to chadda bhi nhi hai 😂",
        "Then they'll start sending unsolicited SMSs.",
        "Aur shoplifting karo jab Tak paisa wasool nai hota simple 😜",
        "These ones usually only blow up when you remove them forcefully.",
        "Pay.",
        "Bhai churaya hai tune 💀💀",
        "Hammer it till it breaks",
        "Security tag on cloths..",
        "Yes broke it with hammer 🛠",
        "Bro this is funny 😭😂😂, I removed it, crushing from hammer worked",
        "thank you gonna do the same now!",
        ">😂\n\nBhai hathoda le  sunny paaji ( sunny deol ) ka naam le  daayi kilo ka haat se maar de toot jayega . \n\n reliance store ye tara singh pakistan phir se nahi jayega .",
        "Bro regrets posting this ,the comments lmao 😭 (I feel sorry for you)",
        "What is that ?",
        "Security tag on cloths",
        "😭😭",
        "Use a hammer",
        "can remove it by using a magnet",
        "use magnet",
        "Easiest option - pay 🤪.\nIf that's done, don't bother walking to the store. Just use a hammer and smash it.",
        "I ordered few max t-shirts from flipkart, one of them came up with that tag. Sadly I ended up screwing the t-shirt lol. \nIf you have payment proof any then go to the shop show them the transaction details and they will take it out.\nEven if you paid by card or cash they will find out.\nJust show the article id to them they will check their database and if found, they will remove it.\n\nIf you cannot go through above process, I highly doubt the intention of this post.",
        "Chal Jhootha! Security Alarm Baj Baj kr Kaan se khoon Nikal dete...nahi diye na paise ? :P",
        "Dude get a magnet and it will come right off",
        "Same thing happened with me, just go to the store and tell them the date you bought that or give them your phone number. They'll remove it"
    ],
    "cleaned_text": "remove ps paid seems forgot remove ",
    "cleaned_title": "remove",
    "cleaned_selftext": "ps paid seems forgot remove",
    "cleaned_comments": "go reliance store bought theyll take say stole nice try police chor receipt need strong magnet search youtube plenty tutorials remove security tags fenk diya cant forget remove thats weird store security barriers would raise alarm anyone walks store article clothing security tag still try see show bank statements transaction dont receipt guess removed similar one cutting outer plastic removing pin spring inside strong magnet like neodymium try first nope happened twice able pull based date purchased strange able resolve issue chor chor churi korecho chor magnetic eta erom bhabhe khulbena bhangte hobe atleast amio tai korechilam nai bhai paisa diya tha pura chorri kari hai tumne use strong magnet place near elevated part pull teeth happened also us happen actually forgot used magnets remove go store different brand purchased ask remove problem solved pay cash upi card return store please pay pay lock picking lawyer video card fucking strong honestly hammer pay thats true lol ive happen many times happened saw happen others two different stores thankfully found day went bill got take print transaction limit statement include transactions work ig match timings go counter maybe sorry fucking idiot magnet use heavy magnet youtube pe video dekhlo saying youve thrown receipt already means stole scanners gate would sounded alarm wasnt removed left store stop lying go return pay yt paying paying strong magnet like neodymium work cast fire idk think impossible frequently buy monte carlo factory outlet much rush forget remove many times case even happened levis use strong magnet next time instead making reddit post try paying product convenient immediately threw receipt buying use magnet metal side pull pin use two forks open bro youtube dekh le cutting plier happens time lot clothes try remove sometimes doesnt come happened smash hammer ball bearings fall guess keep security gates turned save power hammer saw soldering melt plastic teeth etc buy lol yes took pliers cut damage somepart cloth would recommend going store wife similar situation sons tshirt didnt want go store thinking would say stole receipt looked youtube clips successful removing days went store removed questions asked pay ekta hammer niye jor jor se maro agar nehi tuta toh yehi pehen lo kya hi hoga happens lot times nowadays go store dont need buy anything need magnet remove thats paying remove youve buy clothes steal chor pay even stole scanners gate sounded alarm care explain thing tons ways steal without going scanners friends retail industry heard types crazy stories tag turn alarm someone try sneak thing store managed successfully thanks used work zara one customer said thing couldnt anything since didnt bill lmao furious go store remove bill following paid online cardupi show transaction id retrieve bill paid cash given mobile number retrieve bill nothing works ask check cctv proof forget sometimes also barrier miss else come op came certainly didnt money heist rs go store paid card even dont acknowledge cameras billing counter ask check get one hammer crush atleast store go ordered trousers myntra fucking sent security tag saw days later since end towards feet time exchange period ended said fuck sala itna poweful magnet hai ek saal ho gaya hai nahi nikal raha paying digital payment show proof pull receipt buy u regularly shoplifting buying remove pay faced issue go store ask remove ordered garment online came still attached burn candle outer plastic melts use knife try damage garment thats recently got many items ajio withsecurity tags stupid ajio didnt even bothered remove hammer two good hits required away living rooms children needle small steel balls infants swallow left around magnet costs thing boughtstole dont ask reddit ask youtube ask chatgpt paying hammer hatoda maar ke kopdi todd exact sht happened online shopping didnt really face problem later exchanging steal magnet gets attracted reliance stores generally send online receipt mobile nom provided time transaction download go store youll need something magnetic remove happen also bhai hathoda le maar de toot jayega system give ur phone number lol worked thanks worlds biggest magnet earth itne ka chadda bhi nhi hai theyll start sending unsolicited smss aur shoplifting karo jab tak paisa wasool nai hota simple ones usually blow remove forcefully pay bhai churaya hai tune hammer till breaks security tag cloths yes broke hammer bro funny removed crushing hammer worked thank gon na bhai hathoda le sunny paaji sunny deol ka naam le daayi kilo ka haat se maar de toot jayega reliance store ye tara singh pakistan phir se nahi jayega bro regrets posting comments lmao feel sorry security tag cloths use hammer remove using magnet use magnet easiest option pay thats done dont bother walking store use hammer smash ordered max tshirts flipkart one came tag sadly ended screwing tshirt lol payment proof go shop show transaction details take even paid card cash find show article id check database found remove go process highly doubt intention post chal jhootha security alarm baj baj kr kaan se khoon nikal detenahi diye na paise p dude get magnet come right thing happened go store tell date bought give phone number theyll remove",
    "light_cleaned_title": "How to remove this",
    "light_cleaned_selftext": "PS - I paid for it, it seems they forgot to remove this.",
    "light_cleaned_comments": "Go to the reliance store where you bought it from, they'll take it out for you. What if they say you stole it 😭 Nice try police! Chor!!!! Receipt? Need a strong magnet for this. Just search on youtube, plenty of tutorials on how to remove security tags. Fenk diya No 😭😭😭 They can’t ‘forget’ to remove it, that’s weird. The store security barriers would raise alarm if anyone walks out of the store with an article of clothing with the security tag still on it. Try to see if you can show bank statements with your transaction if you don’t have a receipt, I guess. I had removed a similar one by cutting the outer plastic and removing the pin & spring inside it. But if you have a strong magnet like neodymium try with it first. Nope this happened to me twice They should be able to pull it up based on the date you purchased Strange. Were you able to resolve the issue? Chor chor churi korecho chor Magnetic eta erom bhabhe khulbena Bhangte hobe... atleast amio tai korechilam Nai bhai paisa diya tha Pura 600 😭 Chorri Kari hai tumne 😡 use a strong magnet and place it near that elevated part Pull it with your teeth It happened to me also. In US. I have had it happen to me once, they actually did forgot. I used magnets to remove them Go to a store different from the brand that you purchased and ask them to remove it. Problem solved. How did you pay? Cash or upi or card? Return it to my store please 💀 Pay for it. Pay for it Lock picking lawyer had a video on this I did 😭 Card This is fucking strong honestly Hammer. Pay That's not true at all lol. I've had this happen many times to me. Happened to me once and saw it happen to others at two different stores. Thankfully we found out the very same day so we went to with our bill and got it Take print out of transaction just limit your statement to include only few transactions. Should work ig. They can match it with their timings if you go to same counter maybe? What is this (I am sorry I am a fucking Idiot) Magnet 🧲 🧲 Use a heavy magnet, youtube pe video dekhlo If you are saying you've thrown the receipt already then that means you stole it. The scanners at the gate would have sounded the alarm if this wasn't removed while you left the store. Stop lying and just go return it. Pay! YT By paying up for it. **By paying for it** A strong magnet like neodymium will work Cast it into the fire! Idk why you all think this is impossible, I frequently buy from Monte Carlo factory outlet and because of so much rush they forget to remove it so many times in my case, even happened once at Levi's too. Just use a strong magnet Next time instead of making a reddit post, try paying for the product. How convenient that you immediately threw the receipt after buying it. Use a magnet on the metal side, it should pull out the pin. Use two forks and open it Bro YouTube dekh le. Cutting Plier Happens all the time when you have lot of clothes. They will try to remove it but then sometimes it doesn’t come off. Happened to me once. Just smash it with a hammer. The ball bearings will fall out. Guess they just keep the security gates turned off to save power. Hammer, saw, soldering to melt the plastic, teeth etc buy it lol Yes i did ,i took pliers and cut them out but it will damage somepart of cloth i would recommend going to store My wife had a similar situation with our son's t-shirt. We didn't want to go to the store thinking they would say we stole it (we did not have the receipt) I looked for some YouTube clips but was not successful in removing it. After a few days, we just went to the store, and they removed it, no questions asked. Pay Are ekta hammer niye jor jor se maro agar nehi tuta toh yehi pehen lo kya hi hoga Happens a lot of times nowadays, just go to store you don't need to buy anything too. We need a magnet to remove it. That's it. By paying for it😂 To remove this you’ve to buy clothes not steal them. CHOR! Pay for it even if he stole it, scanners at the gate should have sounded alarm. Care to explain what is that thing? There are tons of ways to steal them without going through the scanners. I have friends in the retail industry and I have heard all types of crazy stories from them This is tag which turn in the alarm when someone try to sneak thing out of the store but you managed it successfully Thanks I used to work in zara before There was one customer who said the same thing We couldn’t do anything since he didn’t have bill Lmao he was so furious Go to the store they will remove it. If you do not have the bill then you can do the following 1 If paid online by card,UPI show them the transaction Id they will retrieve the bill 2 If paid by cash if you have given your mobile number then they will retrieve the bill If nothing works ask them to check the cctv for proof They do forget sometimes. Also the barrier can miss too, else how come OP came out. Certainly he didn't do a money heist for Rs 600. Just go to the store, you paid with card so you have that and even if they don’t acknowledge it, they will have cameras on the billing counter, just ask them to check those. Get one hammer and crush it with that Atleast you have a store to go to. I ordered trousers from Myntra and they fucking sent it to me with the security tag on 😭 I only saw it a few days later since it was at the end towards the feet and by the time the exchange period ended and they said to fuck off. Sala itna poweful magnet hai, ek saal ho gaya hai nahi nikal raha. By paying for it ? If its digital payment you can show as proof and they can pull up the receipt Buy this. U can regularly to do shoplifting after buying this. How to remove this Pay I too faced the same issue. Just go to the store and ask them to remove it and they will do it. Once I ordered a garment online and it came with it still attached. Burn it with a candle until the outer plastic melts and then use a knife and try not to damage the garment. That's how I did it. I recently got many items from Ajio withsecurity tags. Stupid Ajio didn't even bothered to remove it. If you have hammer 🔨 just two good hits are required. Do it away from your living rooms and children as it has a needle and small steel balls. Infants can swallow those if left around. What if the magnet costs more than the thing he bought/stole? Don't ask reddit, ask YouTube, ask chatGPT By paying for it. Hammer it Hatoda maar ke kopdi todd This exact same sh*t happened to me once but it was online shopping so didn't really face any problem later while exchanging he should steal a magnet Only if he gets attracted to it. Reliance stores generally send you an online receipt on your mobile nom if you provided at the time of transaction. Download and then go to their store. If not you'll need something magnetic to remove that. no this happen to me also Bhai hathoda le or maar de toot jayega They have it in the system . Just give them ur phone number. Lol this worked, thanks World's biggest magnet is the Earth itself! Itne ka to chadda bhi nhi hai 😂 Then they'll start sending unsolicited SMSs. Aur shoplifting karo jab Tak paisa wasool nai hota simple 😜 These ones usually only blow up when you remove them forcefully. Pay. Bhai churaya hai tune 💀💀 Hammer it till it breaks Security tag on cloths.. Yes broke it with hammer 🛠 Bro this is funny 😭😂😂, I removed it, crushing from hammer worked thank you gonna do the same now! >😂 Bhai hathoda le sunny paaji ( sunny deol ) ka naam le daayi kilo ka haat se maar de toot jayega . reliance store ye tara singh pakistan phir se nahi jayega . Bro regrets posting this ,the comments lmao 😭 (I feel sorry for you) What is that ? Security tag on cloths 😭😭 Use a hammer can remove it by using a magnet use magnet Easiest option - pay 🤪. If that's done, don't bother walking to the store. Just use a hammer and smash it. I ordered few max t-shirts from flipkart, one of them came up with that tag. Sadly I ended up screwing the t-shirt lol. If you have payment proof any then go to the shop show them the transaction details and they will take it out. Even if you paid by card or cash they will find out. Just show the article id to them they will check their database and if found, they will remove it. If you cannot go through above process, I highly doubt the intention of this post. Chal Jhootha! Security Alarm Baj Baj kr Kaan se khoon Nikal dete...nahi diye na paise ? :P Dude get a magnet and it will come right off Same thing happened with me, just go to the store and tell them the date you bought that or give them your phone number. They'll remove it"
}