{
    "id": "18zvqu3",
    "title": "Why I'm not able to pay for this challan?",
    "url": "https://www.reddit.com/gallery/18zvqu3",
    "selftext": "I crossed a red light when it was at yellow near AIIMS coming from JLN stadium side. Police stopped me to fine challan, they were saying 5000 for red light violation. But I somehow managed to get seat belt violation for 1k. But I checked it now and I'm not able to pay for it and when clicking on status it is saying sent to court? Is it because it is too soon.\n\n\nAlso is it a violation if we crossed at yellow light?",
    "flair": "Law & Courts",
    "score": 3,
    "num_comments": 17,
    "created_utc": 1704531006.0,
    "convurl": "https://i.redd.it/mu7cv4zs9sac1.jpg",
    "comments": [
        "\"Sent to the court\" generally means the challan has been sent to court, and you will have to appear in your civil court to contest this. I am not a lawyer, so my legal knowledge may not be accurate.",
        "But the police officer said the payment link will come.",
        "Correct up to sent to court.      \nThe challan is (generally) sent to a virtual court. Trying searching the challan on vcourts website.     \nThe payment link will be assigned here after processing.\nMy challan took about 4 months to get processed in vcourt.           \n        \nOnly contest if you have legit proof to attain yourself. But still keep in mind, judges deal with the same police frequently, than alleged offender.",
        "This payment link is available on the e-challan website until the officer transfers the challan to vcourt.      \nBeing in India, its officer's will to transfer when.",
        "You have to do payment on virtual court website.\n\nSearch in Google, and then select your state traffic department. And then proceed ahead with payment.",
        "It is showing no challan.",
        "Wtf. Ye kya chutiyapa h",
        "Bro, don't worry.. Wait for a few days and it'll be sent to a virtual court, they'll decrease the fine and then just go to the concerned local court and pay it",
        "Naah, I'll pay it. I know it's my fault. \nSo should I expect payment link to arrive in months?",
        "Can't I pay it online?",
        "The link will be available after it is passed through the virtual court. Don't worry bro, give it a month",
        "Ohh okay cool. Mujhe laga court mein jaake hi settle hoga.",
        ">they'll decrease the fine.\n\nReally? And why do they do so?",
        "It's never a violation to jump a yellow light. Just police mafia in action - they wanted a quick chai paani.",
        "Or, you can physically go to the court mentioned in vcourts details of your challan and pay offline there. Be sure to get a legit receipt. There are _policemen_ and others that claim they can collect the fine and give you the payment receipt."
    ],
    "cleaned_text": "im able pay challan crossed red light yellow near aiims coming jln stadium side police stopped fine challan saying red light violation somehow managed get seat belt violation k checked im able pay clicking status saying sent court soon also violation crossed yellow light ",
    "cleaned_title": "im able pay challan",
    "cleaned_selftext": "crossed red light yellow near aiims coming jln stadium side police stopped fine challan saying red light violation somehow managed get seat belt violation k checked im able pay clicking status saying sent court soon also violation crossed yellow light",
    "cleaned_comments": "sent court generally means challan sent court appear civil court contest lawyer legal knowledge may accurate police officer said payment link come correct sent court challan generally sent virtual court trying searching challan vcourts website payment link assigned processing challan took months get processed vcourt contest legit proof attain still keep mind judges deal police frequently alleged offender payment link available echallan website officer transfers challan vcourt india officers transfer payment virtual court website search google select state traffic department proceed ahead payment showing challan wtf ye kya chutiyapa h bro dont worry wait days itll sent virtual court theyll decrease fine go concerned local court pay naah ill pay know fault expect payment link arrive months cant pay online link available passed virtual court dont worry bro give month ohh okay cool mujhe laga court mein jaake hi settle hoga theyll decrease fine really never violation jump yellow light police mafia action wanted quick chai paani physically go court mentioned vcourts details challan pay offline sure get legit receipt policemen others claim collect fine give payment receipt",
    "light_cleaned_title": "Why I'm not able to pay for this challan?",
    "light_cleaned_selftext": "I crossed a red light when it was at yellow near AIIMS coming from JLN stadium side. Police stopped me to fine challan, they were saying 5000 for red light violation. But I somehow managed to get seat belt violation for 1k. But I checked it now and I'm not able to pay for it and when clicking on status it is saying sent to court? Is it because it is too soon. Also is it a violation if we crossed at yellow light?",
    "light_cleaned_comments": "\"Sent to the court\" generally means the challan has been sent to court, and you will have to appear in your civil court to contest this. I am not a lawyer, so my legal knowledge may not be accurate. But the police officer said the payment link will come. Correct up to sent to court. The challan is (generally) sent to a virtual court. Trying searching the challan on vcourts website. The payment link will be assigned here after processing. My challan took about 4 months to get processed in vcourt. Only contest if you have legit proof to attain yourself. But still keep in mind, judges deal with the same police frequently, than alleged offender. This payment link is available on the e-challan website until the officer transfers the challan to vcourt. Being in India, its officer's will to transfer when. You have to do payment on virtual court website. Search in Google, and then select your state traffic department. And then proceed ahead with payment. It is showing no challan. Wtf. Ye kya chutiyapa h Bro, don't worry.. Wait for a few days and it'll be sent to a virtual court, they'll decrease the fine and then just go to the concerned local court and pay it Naah, I'll pay it. I know it's my fault. So should I expect payment link to arrive in months? Can't I pay it online? The link will be available after it is passed through the virtual court. Don't worry bro, give it a month Ohh okay cool. Mujhe laga court mein jaake hi settle hoga. >they'll decrease the fine. Really? And why do they do so? It's never a violation to jump a yellow light. Just police mafia in action - they wanted a quick chai paani. Or, you can physically go to the court mentioned in vcourts details of your challan and pay offline there. Be sure to get a legit receipt. There are _policemen_ and others that claim they can collect the fine and give you the payment receipt."
}