{
    "id": "1aj7wpo",
    "title": "RBI's ban on Paytm Payment Bank - Let's get to ge bottom, but don't throw the baby with the bathwater",
    "url": "https://www.reddit.com/r/india/comments/1aj7wpo/rbis_ban_on_paytm_payment_bank_lets_get_to_ge/",
    "selftext": "Like it or not, Paytm is among the largest homegrown Mobile Payment gateways in India. \n\n* It is widely accepted, especially in urban India where even small kiosks and kirana shops have a payTm enabled mike that has revolutionized electronic payments\n\n* An innovative make-India story founded in 2010 by Vijay Shekhar Sharma, \n\n* Paytm Karo has become a verb - just like many other iconic Indian brands \n\nNot many of us really understand the impact of RBI ban on Paytm Payment Bank, and that Payment Bank is a distinct entity, different from PayTM Gateway. However, the recent headlines are making customers and small business review their love for PayTm.\n\nIn a business dealing with people's money, trust is the cornerstone. Any whiff of impropriety and people will not wait to flee to competitors and the gateway will implode\n\nIt will be a shame if the regulators throw the baby out with the bathwater. ***[Just my2cents](https://www.youtube.com/shorts/3B1ncM65mnY)*** Don't shoot the messenger. \n\n---------\nEdit: I see a lot of valid points about the role of regulators and the warnings issue. What we see is what media is portraying. We don't know what's going on behind closed doors.",
    "flair": "Policy/Economy",
    "score": 6,
    "num_comments": 22,
    "created_utc": 1707107258.0,
    "convurl": "https://external-preview.redd.it/ek49jsUUlYBGr-v7LvQg6LF92hPJWGZ3Hx7GJSLbPPY.jpg?auto=webp&s=171b62b9e4566ead71ee9ecac0a61aec3b25b751",
    "comments": [
        "You don’t need to use hashtags on reddit. They don’t work here.",
        "So what's your point? Regulators should just let Paytm keep making mistakes even after repeated warnings? The regulator's job is to ensure all rules are followed and not give them warnings after warnings because the company is big. \n\nI like that they have taken some action on this shit company called Paytm. If you think they are good, try contacting their customer support for anything. You will go mental trying to resolve even the smallest of issue.",
        "A close buddy of mine works at PayTM and he says the security of everyone’s personal and financial information is a laughing stock. They pay off regulators to look the other way. It’s just a matter of time before the house of cards collapses.",
        "Any good alternative to paytm wallet?",
        "So what you are saying is PayTM is too big to fail.. If regulators were to look the other way just because of the size of the company then there will economic chaos.",
        ">It will be a shame if the regulators throw the baby out with the bathwater. \n\nThe regulators aren't responsible for PayTM's wallet and banking services sharing the same name and thus being synonymous in the minds of consumers. And its not the regulator's job to worry about secondary incidentals while doing their job. Imagine if the police were like \"Well we cannot arrest the person who attacked you because it might make the neighbors question his whole family.\"\n\nBy all accounts PayTM's bank has repeatedly violated important and fundamental banking regulations. And now they're reaping the consequences. RBI gave them years to get their act straight, and has been escalating their penalties with PayTM refusing. If PayTM as a whole fails, its because of *their* fault. Not because the RBI did their job.",
        "Same energy as -\n\nAdani's too big to fall, he should be let to continue whatever alleged manipulation he's doing, it's good for the country and shareholders. It's unfortunate so many people are attacking the business class like this.\n\nWe shouldn't increase corporate taxes, see, they are giving us employment and running a portion of our economy, workers should take the L.",
        "Kick out the existing management for this fiasco and the RBI/Govt should appoint a new management to oversee the clean-up and adherence to regulations.",
        "TLDR: \"THROW THE BABY WITH OUT THE BATHWATER\" /s",
        "PayTm is big but isn’t too big to fail. There are enough alternatives for the payment gateway function in the form of Gpay, PhonePe. Even Cred and other new platforms keep coming. \n\nWe will have enough alternatives.\n\nAbout the PPB, if they are not following the rules especially KYC which as per reports been taken advantage of to indulge in money laundering, then its a serious violation of economic laws.\n\nIt’s possible that there is a whole culture which has led to this rot in the company. Just changing the management may not be enough.\n\nIMO RBI should make an example of what happens if Laws, rules and regulations are not followed. This way the next set of fintech’s will be more careful.",
        "I think we should kill this monster before it get any bigger.\n\nLet us say you got scammed and sent money to an online job scammer. You go to your bank and complain. The bank finds out that the funds went to a PayTM Payment Bank a/c. The banks guides you, you file a FIR, provide call/chat logs and then your bank files a chargeback. PayTM employees would reject the chargeback by saying the stupidest stuff like that they checked the invoice and the product was delivered. I mean what product? There are chat logs showing it was a job scam.\n\nThe bank would be then forced to report this to the RBI. The RBI would get similar reports from other banks too. On investigation, RBI would find that PayTM allowed scammers to clear out the A/cs even after receiving FIRs. They allowed the same scammer to open multiple a/cs even after knowing this person was using the a/cs to route funds from scams. I mean this is because they have a/c targets. But still, this is willfully ignoring money laundering laws. And KYC verification as someone else mentioned were a joke.\n\nIf this is allowed to continue, it will ruin the reputation of the FinTech sector. We are already gaining a global reputation for online scams. I feel like for every PayTM QR I see, there is an equal number of scam a/cs. It is that bad.",
        "But why should the government intervene in this case? RBI intervened for Yes Bank because it had a major impact on the economy. Is there a similar impact with PayTM?",
        "On the flip side. What did Paytm do? This response is so drastic, for something we don’t even know what they did. We do know there’s nothing related to money laundering which is the riskiest issue. \n\nThey didn’t ban payments bank because of customer service. They seemingly did it because the seperate entities were not using different apps. Which is fucking absurd. I work directly in the industry, and trust me - this is unprecedented levels of overreach by RBI. \n\nThis is not the first time RBI has done crazy decisions. They’ve basically broken Indian cards outside India and vice versa. \n\nRead this please, there’s more to it than it looks. https://m.economictimes.com/opinion/et-commentary/action-against-paytm-by-rbi-which-has-failed-as-a-digital-payments-regulator-is-arbitrary/articleshow/107370085.cms",
        "ROFL",
        "I read somewhere that Paytm had close to 1000 accounts linked to one Pan Card. If that's true, how is it not a serious issue? The customer support issue is my personal experience. \n\nI had a payment gateway account with them and I lost the number that was linked to it. For months, I wrote to them that the number is lost, I cannot login so please close the damn account. I tried phone, email, twitter everything- the retards in the company just ask me to login and send a screenshot. I explained to them a dozen times, Im not able to login- what is the next step. They just respond, Sir please share screenshot and then close the ticket. After a year, they send me two invoices saying that I owe then Rs.4000/month for using the gateway.   \n\n\nIMO, a company with such shit customer support cannot be trusted with 8000Cr in transactions. I don't work in the industry, but my experience with them as a customer has been nothing but pathetic.",
        "In a 2018 sting operation, Paytm admitted to sharing user data and \"doing stuff\" for RSS\n\nhttps://www.cobrapost.com/blog/Paytm/1046\n\nPaytm has been hacked several times. In fact, this Sunday I met a guy who lost Rs. 6 lakhs through Paytm hack. He never got his money back.\n\nPaytm needs to upgrade or go.",
        "I don’t disagree with any of this. What I disagree is the fact of the action taken. \n\nThere is so much collateral damage with the merchants, loan auto debits, PoS systems, automated payments etc etc. RBI acts and then thinks. \n\nThis has happened in a million international banks, you know what regulators do? They give a PUBLIC statement with the issues, a deadline for compliance which would be at least 2 quarters, and if the issue still persists, you do this. And the issue has to be materially significant. \n\nAnd the PAN Card thing is not the reason, the reason is One97 and Payments bank having seperate entities and they didn’t like cross selling.",
        "Paytm has been repeatedly warned, fined in the past 2 years, to decouple Paytm and Paytm Bank. They paid no heed to it. They're actually fortunate that RBI didn't outright cancel the bank licence.( But this is as bad as that).\n\nThe irony is playing the nationalism card, in reality they're actually enabled money laundering by flouting kyc norms, which harms national interests.",
        "This in my opinion is all in preparation for the Jio launch, rbi has cancelled bajaj’ lending licence for emi card and than this paytm thing.after Jio’s/Reliance payment& emi card starts you will notice these things bajaj and the paytm thing will go away",
        "I think the issue was materially significant. Paytm has been issued several warnings and fines (in crores) in the past. Apparently, crores of transactions happened through dubious Paytm accounts without proper KYC. If they chose to ignore all of that and then expect RBI to keep issuing warnings because they are big- that is asking for trouble. \n\nAs a business owner and personal user of Paytm think its a very appropriate move from RBI. People will find other wallets or service providers that are compliant and at least have a branch or a customer care-its not like they have some major monopoly-other players are equally good.",
        "His point is that \"PayTM Payments Bank\" is banned. Why is the media crucifying PayTM, a super app of which the banned Bank was just an \"optional\" part."
    ],
    "cleaned_text": "rbis ban paytm payment bank lets get ge bottom dont throw baby bathwater like paytm among largest homegrown mobile payment gateways india widely accepted especially urban india even small kiosks kirana shops paytm enabled mike revolutionized electronic payments innovative makeindia story founded vijay shekhar sharma paytm karo become verb like many iconic indian brands many us really understand impact rbi ban paytm payment bank payment bank distinct entity different paytm gateway however recent headlines making customers small business review love paytm business dealing peoples money trust cornerstone whiff impropriety people wait flee competitors gateway implode shame regulators throw baby bathwater mycentshttpswwwyoutubecomshortsbncmmny dont shoot messenger edit see lot valid points role regulators warnings issue see media portraying dont know whats going behind closed doors ",
    "cleaned_title": "rbis ban paytm payment bank lets get ge bottom dont throw baby bathwater",
    "cleaned_selftext": "like paytm among largest homegrown mobile payment gateways india widely accepted especially urban india even small kiosks kirana shops paytm enabled mike revolutionized electronic payments innovative makeindia story founded vijay shekhar sharma paytm karo become verb like many iconic indian brands many us really understand impact rbi ban paytm payment bank payment bank distinct entity different paytm gateway however recent headlines making customers small business review love paytm business dealing peoples money trust cornerstone whiff impropriety people wait flee competitors gateway implode shame regulators throw baby bathwater mycentshttpswwwyoutubecomshortsbncmmny dont shoot messenger edit see lot valid points role regulators warnings issue see media portraying dont know whats going behind closed doors",
    "cleaned_comments": "dont need use hashtags reddit dont work whats point regulators let paytm keep making mistakes even repeated warnings regulators job ensure rules followed give warnings warnings company big like taken action shit company called paytm think good try contacting customer support anything go mental trying resolve even smallest issue close buddy mine works paytm says security everyones personal financial information laughing stock pay regulators look way matter time house cards collapses good alternative paytm wallet saying paytm big fail regulators look way size company economic chaos shame regulators throw baby bathwater regulators arent responsible paytms wallet banking services sharing name thus synonymous minds consumers regulators job worry secondary incidentals job imagine police like well arrest person attacked might make neighbors question whole family accounts paytms bank repeatedly violated important fundamental banking regulations theyre reaping consequences rbi gave years get act straight escalating penalties paytm refusing paytm whole fails fault rbi job energy adanis big fall let continue whatever alleged manipulation hes good country shareholders unfortunate many people attacking business class like shouldnt increase corporate taxes see giving us employment running portion economy workers take l kick existing management fiasco rbigovt appoint new management oversee cleanup adherence regulations tldr throw baby bathwater paytm big isnt big fail enough alternatives payment gateway function form gpay phonepe even cred new platforms keep coming enough alternatives ppb following rules especially kyc per reports taken advantage indulge money laundering serious violation economic laws possible whole culture led rot company changing management may enough imo rbi make example happens laws rules regulations followed way next set fintechs careful think kill monster get bigger let us say got scammed sent money online job scammer go bank complain bank finds funds went paytm payment bank ac banks guides file fir provide callchat logs bank files chargeback paytm employees would reject chargeback saying stupidest stuff like checked invoice product delivered mean product chat logs showing job scam bank would forced report rbi rbi would get similar reports banks investigation rbi would find paytm allowed scammers clear acs even receiving firs allowed scammer open multiple acs even knowing person using acs route funds scams mean ac targets still willfully ignoring money laundering laws kyc verification someone else mentioned joke allowed continue ruin reputation fintech sector already gaining global reputation online scams feel like every paytm qr see equal number scam acs bad government intervene case rbi intervened yes bank major impact economy similar impact paytm flip side paytm response drastic something dont even know know theres nothing related money laundering riskiest issue didnt ban payments bank customer service seemingly seperate entities using different apps fucking absurd work directly industry trust unprecedented levels overreach rbi first time rbi done crazy decisions theyve basically broken indian cards outside india vice versa read please theres looks rofl read somewhere paytm close accounts linked one pan card thats true serious issue customer support issue personal experience payment gateway account lost number linked months wrote number lost login please close damn account tried phone email twitter everything retards company ask login send screenshot explained dozen times im able login next step respond sir please share screenshot close ticket year send two invoices saying owe rsmonth using gateway imo company shit customer support trusted cr transactions dont work industry experience customer nothing pathetic sting operation paytm admitted sharing user data stuff rss paytm hacked several times fact sunday met guy lost rs lakhs paytm hack never got money back paytm needs upgrade go dont disagree disagree fact action taken much collateral damage merchants loan auto debits pos systems automated payments etc etc rbi acts thinks happened million international banks know regulators give public statement issues deadline compliance would least quarters issue still persists issue materially significant pan card thing reason reason one payments bank seperate entities didnt like cross selling paytm repeatedly warned fined past years decouple paytm paytm bank paid heed theyre actually fortunate rbi didnt outright cancel bank licence bad irony playing nationalism card reality theyre actually enabled money laundering flouting kyc norms harms national interests opinion preparation jio launch rbi cancelled bajaj lending licence emi card paytm thingafter jiosreliance payment emi card starts notice things bajaj paytm thing go away think issue materially significant paytm issued several warnings fines crores past apparently crores transactions happened dubious paytm accounts without proper kyc chose ignore expect rbi keep issuing warnings big asking trouble business owner personal user paytm think appropriate move rbi people find wallets service providers compliant least branch customer careits like major monopolyother players equally good point paytm payments bank banned media crucifying paytm super app banned bank optional part",
    "light_cleaned_title": "RBI's ban on Paytm Payment Bank - Let's get to ge bottom, but don't throw the baby with the bathwater",
    "light_cleaned_selftext": "Like it or not, Paytm is among the largest homegrown Mobile Payment gateways in India. * It is widely accepted, especially in urban India where even small kiosks and kirana shops have a payTm enabled mike that has revolutionized electronic payments * An innovative make-India story founded in 2010 by Vijay Shekhar Sharma, * Paytm Karo has become a verb - just like many other iconic Indian brands Not many of us really understand the impact of RBI ban on Paytm Payment Bank, and that Payment Bank is a distinct entity, different from PayTM Gateway. However, the recent headlines are making customers and small business review their love for PayTm. In a business dealing with people's money, trust is the cornerstone. Any whiff of impropriety and people will not wait to flee to competitors and the gateway will implode It will be a shame if the regulators throw the baby out with the bathwater. ***[Just my2cents](https://www.youtube.com/shorts/3B1ncM65mnY)*** Don't shoot the messenger. --------- Edit: I see a lot of valid points about the role of regulators and the warnings issue. What we see is what media is portraying. We don't know what's going on behind closed doors.",
    "light_cleaned_comments": "You don’t need to use hashtags on reddit. They don’t work here. So what's your point? Regulators should just let Paytm keep making mistakes even after repeated warnings? The regulator's job is to ensure all rules are followed and not give them warnings after warnings because the company is big. I like that they have taken some action on this shit company called Paytm. If you think they are good, try contacting their customer support for anything. You will go mental trying to resolve even the smallest of issue. A close buddy of mine works at PayTM and he says the security of everyone’s personal and financial information is a laughing stock. They pay off regulators to look the other way. It’s just a matter of time before the house of cards collapses. Any good alternative to paytm wallet? So what you are saying is PayTM is too big to fail.. If regulators were to look the other way just because of the size of the company then there will economic chaos. >It will be a shame if the regulators throw the baby out with the bathwater. The regulators aren't responsible for PayTM's wallet and banking services sharing the same name and thus being synonymous in the minds of consumers. And its not the regulator's job to worry about secondary incidentals while doing their job. Imagine if the police were like \"Well we cannot arrest the person who attacked you because it might make the neighbors question his whole family.\" By all accounts PayTM's bank has repeatedly violated important and fundamental banking regulations. And now they're reaping the consequences. RBI gave them years to get their act straight, and has been escalating their penalties with PayTM refusing. If PayTM as a whole fails, its because of *their* fault. Not because the RBI did their job. Same energy as - Adani's too big to fall, he should be let to continue whatever alleged manipulation he's doing, it's good for the country and shareholders. It's unfortunate so many people are attacking the business class like this. We shouldn't increase corporate taxes, see, they are giving us employment and running a portion of our economy, workers should take the L. Kick out the existing management for this fiasco and the RBI/Govt should appoint a new management to oversee the clean-up and adherence to regulations. TLDR: \"THROW THE BABY WITH OUT THE BATHWATER\" /s PayTm is big but isn’t too big to fail. There are enough alternatives for the payment gateway function in the form of Gpay, PhonePe. Even Cred and other new platforms keep coming. We will have enough alternatives. About the PPB, if they are not following the rules especially KYC which as per reports been taken advantage of to indulge in money laundering, then its a serious violation of economic laws. It’s possible that there is a whole culture which has led to this rot in the company. Just changing the management may not be enough. IMO RBI should make an example of what happens if Laws, rules and regulations are not followed. This way the next set of fintech’s will be more careful. I think we should kill this monster before it get any bigger. Let us say you got scammed and sent money to an online job scammer. You go to your bank and complain. The bank finds out that the funds went to a PayTM Payment Bank a/c. The banks guides you, you file a FIR, provide call/chat logs and then your bank files a chargeback. PayTM employees would reject the chargeback by saying the stupidest stuff like that they checked the invoice and the product was delivered. I mean what product? There are chat logs showing it was a job scam. The bank would be then forced to report this to the RBI. The RBI would get similar reports from other banks too. On investigation, RBI would find that PayTM allowed scammers to clear out the A/cs even after receiving FIRs. They allowed the same scammer to open multiple a/cs even after knowing this person was using the a/cs to route funds from scams. I mean this is because they have a/c targets. But still, this is willfully ignoring money laundering laws. And KYC verification as someone else mentioned were a joke. If this is allowed to continue, it will ruin the reputation of the FinTech sector. We are already gaining a global reputation for online scams. I feel like for every PayTM QR I see, there is an equal number of scam a/cs. It is that bad. But why should the government intervene in this case? RBI intervened for Yes Bank because it had a major impact on the economy. Is there a similar impact with PayTM? On the flip side. What did Paytm do? This response is so drastic, for something we don’t even know what they did. We do know there’s nothing related to money laundering which is the riskiest issue. They didn’t ban payments bank because of customer service. They seemingly did it because the seperate entities were not using different apps. Which is fucking absurd. I work directly in the industry, and trust me - this is unprecedented levels of overreach by RBI. This is not the first time RBI has done crazy decisions. They’ve basically broken Indian cards outside India and vice versa. Read this please, there’s more to it than it looks. ROFL I read somewhere that Paytm had close to 1000 accounts linked to one Pan Card. If that's true, how is it not a serious issue? The customer support issue is my personal experience. I had a payment gateway account with them and I lost the number that was linked to it. For months, I wrote to them that the number is lost, I cannot login so please close the damn account. I tried phone, email, twitter everything- the retards in the company just ask me to login and send a screenshot. I explained to them a dozen times, Im not able to login- what is the next step. They just respond, Sir please share screenshot and then close the ticket. After a year, they send me two invoices saying that I owe then Rs.4000/month for using the gateway. IMO, a company with such shit customer support cannot be trusted with 8000Cr in transactions. I don't work in the industry, but my experience with them as a customer has been nothing but pathetic. In a 2018 sting operation, Paytm admitted to sharing user data and \"doing stuff\" for RSS Paytm has been hacked several times. In fact, this Sunday I met a guy who lost Rs. 6 lakhs through Paytm hack. He never got his money back. Paytm needs to upgrade or go. I don’t disagree with any of this. What I disagree is the fact of the action taken. There is so much collateral damage with the merchants, loan auto debits, PoS systems, automated payments etc etc. RBI acts and then thinks. This has happened in a million international banks, you know what regulators do? They give a PUBLIC statement with the issues, a deadline for compliance which would be at least 2 quarters, and if the issue still persists, you do this. And the issue has to be materially significant. And the PAN Card thing is not the reason, the reason is One97 and Payments bank having seperate entities and they didn’t like cross selling. Paytm has been repeatedly warned, fined in the past 2 years, to decouple Paytm and Paytm Bank. They paid no heed to it. They're actually fortunate that RBI didn't outright cancel the bank licence.( But this is as bad as that). The irony is playing the nationalism card, in reality they're actually enabled money laundering by flouting kyc norms, which harms national interests. This in my opinion is all in preparation for the Jio launch, rbi has cancelled bajaj’ lending licence for emi card and than this paytm thing.after Jio’s/Reliance payment& emi card starts you will notice these things bajaj and the paytm thing will go away I think the issue was materially significant. Paytm has been issued several warnings and fines (in crores) in the past. Apparently, crores of transactions happened through dubious Paytm accounts without proper KYC. If they chose to ignore all of that and then expect RBI to keep issuing warnings because they are big- that is asking for trouble. As a business owner and personal user of Paytm think its a very appropriate move from RBI. People will find other wallets or service providers that are compliant and at least have a branch or a customer care-its not like they have some major monopoly-other players are equally good. His point is that \"PayTM Payments Bank\" is banned. Why is the media crucifying PayTM, a super app of which the banned Bank was just an \"optional\" part."
}