{
    "id": "17e23eg",
    "title": "Huge shoutout for calling out things said on Ranveer's Podcast",
    "url": "https://www.reddit.com/r/india/comments/17e23eg/huge_shoutout_for_calling_out_things_said_on/",
    "selftext": "Vent or Discussion  \nSee I was one of the Ranveer haters and I still don't like him at all but I started watching his podcas because of the paranormal Sarbjeet's interview and eventually started listening to soldiers etc. and I liked that (minus Ranveer and his behaviour) because it was a knowledge I haven't had before.   \n\n\nLast week I came across NewsLaundry through this [video](https://youtu.be/Nu8B5Jjy1is?si=OdNou_eZnO2RofZr) and have been listening to them since past week which opened me up to a lot of things in our country that I didn't have any opinion on earlier.   \n\n\nComing to the video linked, this is Vimoh and Meghnerd on YouTube. Sometimes there's also a guy called Pranav. They discuss political issues and man when they speak you know that they know what they say. Ranveer's video that they are reacting to had already put a few questions in my mind but the way these guys explained who the guest is and his background's relevance to the things he said (which Ranveer didn't) put me in a place to think what I honestly am not able to put in words. I'm open to your interpretation of the [video linked](https://www.youtube.com/watch?v=qrXvLKenmjk), PLEASE have a look.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1698005524.0,
    "convurl": "https://external-preview.redd.it/H-ly8IRsETzR7rCNp_QFST9EebRV1pJzJ51aSJWxLgA.jpg?auto=webp&s=2f73727a999cd2d2c507fdd2ad0bb61a1db5b779",
    "comments": [
        "[https://youtu.be/qrXvLKenmjk?si=IX4XCifIBKTImC4x](https://youtu.be/qrXvLKenmjk?si=IX4XCifIBKTImC4x)",
        "Everyday i wake up wondering how ranveer has a career and a platform that je provides to every tom dick and harry to spew up and conspiracy theory they want without even trying to prepare for the interview or the topic and asking counter question.",
        "Newslaundry team is really a smart bunch of people. Do watch them. Meghnad too used to be on that channel. And they really know their shit. If you can, subscribe to them and support their channel",
        "Is this the same ranveer allahabadia who used to make fitness videos?",
        "Yes, the purely run on subscriptions",
        "Lol yes",
        "He still does some cameos but has his own channel/podcast now. He used to have a really good topic called Get to know your parliament or something on those lines with NL before. I miss that.",
        "He sees who is trending  and latches on - no real thought or depth so it's not driven by any ideology except getting views.",
        "Someone on X said, he first needs to change his surname as its no longer relevant. lmao",
        "Can you put a timestamped video?",
        "he moved into a space which was untapped & then made a lot of right moves. \n\nhe may not be right - but he's first & he's heavily followed. \n\ncorrecting him & then spreading the factual / correct data - will be a mammoth task.",
        "Vimoh is really good.. follow him on insta also.",
        "How do u think Joe Rogan made a career?",
        "Ranveer himself doesn't know half the things that are going on in his podcast.He knows the formula that whosoever makes content  that attracts hindu population will eventually get more reach and publicity.He brings some intellectual people just so he can maintain balance and make people believe that his platforms entertains views from everyone.But you can clearly see all the charlatans that come to his podcast and all the people associated with right wing conservative hindu ideology.",
        "I wanted to, how to do that?",
        "Beer belly will start to grow on you if you watch enough episodes. Has some kind of forest grump appeal.",
        "For all his faults, Rogan started off as an interesting podcaster who leveraged his TV stardom to bring interesting people on board to talk before he went off to the deep end.   \n\n\nRanveer is just good at marketing.",
        "I agree",
        "Bro ranveer is shit in podcasting too. Rogan intial podcasts where full of conspiracy theories like aliens and fake moon landing etc etc",
        "Prayagrajya"
    ],
    "cleaned_text": "huge shoutout calling things said ranveers podcast vent discussion see one ranveer haters still dont like started watching podcas paranormal sarbjeets interview eventually started listening soldiers etc liked minus ranveer behaviour knowledge havent last week came across newslaundry videohttpsyoutubenubjjyissiodnoueznorofzr listening since past week opened lot things country didnt opinion earlier coming video linked vimoh meghnerd youtube sometimes theres also guy called pranav discuss political issues man speak know know say ranveers video reacting already put questions mind way guys explained guest backgrounds relevance things said ranveer didnt put place think honestly able put words im open interpretation video linkedhttpswwwyoutubecomwatchvqrxvlkenmjk please look ",
    "cleaned_title": "huge shoutout calling things said ranveers podcast",
    "cleaned_selftext": "vent discussion see one ranveer haters still dont like started watching podcas paranormal sarbjeets interview eventually started listening soldiers etc liked minus ranveer behaviour knowledge havent last week came across newslaundry videohttpsyoutubenubjjyissiodnoueznorofzr listening since past week opened lot things country didnt opinion earlier coming video linked vimoh meghnerd youtube sometimes theres also guy called pranav discuss political issues man speak know know say ranveers video reacting already put questions mind way guys explained guest backgrounds relevance things said ranveer didnt put place think honestly able put words im open interpretation video linkedhttpswwwyoutubecomwatchvqrxvlkenmjk please look",
    "cleaned_comments": "httpsyoutubeqrxvlkenmjksiixxcifibktimcxhttpsyoutubeqrxvlkenmjksiixxcifibktimcx everyday wake wondering ranveer career platform je provides every tom dick harry spew conspiracy theory want without even trying prepare interview topic asking counter question newslaundry team really smart bunch people watch meghnad used channel really know shit subscribe support channel ranveer allahabadia used make fitness videos yes purely run subscriptions lol yes still cameos channelpodcast used really good topic called get know parliament something lines nl miss sees trending latches real thought depth driven ideology except getting views someone x said first needs change surname longer relevant lmao put timestamped video moved space untapped made lot right moves may right hes first hes heavily followed correcting spreading factual correct data mammoth task vimoh really good follow insta also u think joe rogan made career ranveer doesnt know half things going podcasthe knows formula whosoever makes content attracts hindu population eventually get reach publicityhe brings intellectual people maintain balance make people believe platforms entertains views everyonebut clearly see charlatans come podcast people associated right wing conservative hindu ideology wanted beer belly start grow watch enough episodes kind forest grump appeal faults rogan started interesting podcaster leveraged tv stardom bring interesting people board talk went deep end ranveer good marketing agree bro ranveer shit podcasting rogan intial podcasts full conspiracy theories like aliens fake moon landing etc etc prayagrajya",
    "light_cleaned_title": "Huge shoutout for calling out things said on Ranveer's Podcast",
    "light_cleaned_selftext": "Vent or Discussion See I was one of the Ranveer haters and I still don't like him at all but I started watching his podcas because of the paranormal Sarbjeet's interview and eventually started listening to soldiers etc. and I liked that (minus Ranveer and his behaviour) because it was a knowledge I haven't had before. Last week I came across NewsLaundry through this [video](https://youtu.be/Nu8B5Jjy1is?si=OdNou_eZnO2RofZr) and have been listening to them since past week which opened me up to a lot of things in our country that I didn't have any opinion on earlier. Coming to the video linked, this is Vimoh and Meghnerd on YouTube. Sometimes there's also a guy called Pranav. They discuss political issues and man when they speak you know that they know what they say. Ranveer's video that they are reacting to had already put a few questions in my mind but the way these guys explained who the guest is and his background's relevance to the things he said (which Ranveer didn't) put me in a place to think what I honestly am not able to put in words. I'm open to your interpretation of the [video linked](https://www.youtube.com/watch?v=qrXvLKenmjk), PLEASE have a look.",
    "light_cleaned_comments": "[https://youtu.be/qrXvLKenmjk?si=IX4XCifIBKTImC4x](https://youtu.be/qrXvLKenmjk?si=IX4XCifIBKTImC4x) Everyday i wake up wondering how ranveer has a career and a platform that je provides to every tom dick and harry to spew up and conspiracy theory they want without even trying to prepare for the interview or the topic and asking counter question. Newslaundry team is really a smart bunch of people. Do watch them. Meghnad too used to be on that channel. And they really know their shit. If you can, subscribe to them and support their channel Is this the same ranveer allahabadia who used to make fitness videos? Yes, the purely run on subscriptions Lol yes He still does some cameos but has his own channel/podcast now. He used to have a really good topic called Get to know your parliament or something on those lines with NL before. I miss that. He sees who is trending and latches on - no real thought or depth so it's not driven by any ideology except getting views. Someone on X said, he first needs to change his surname as its no longer relevant. lmao Can you put a timestamped video? he moved into a space which was untapped & then made a lot of right moves. he may not be right - but he's first & he's heavily followed. correcting him & then spreading the factual / correct data - will be a mammoth task. Vimoh is really good.. follow him on insta also. How do u think Joe Rogan made a career? Ranveer himself doesn't know half the things that are going on in his podcast.He knows the formula that whosoever makes content that attracts hindu population will eventually get more reach and publicity.He brings some intellectual people just so he can maintain balance and make people believe that his platforms entertains views from everyone.But you can clearly see all the charlatans that come to his podcast and all the people associated with right wing conservative hindu ideology. I wanted to, how to do that? Beer belly will start to grow on you if you watch enough episodes. Has some kind of forest grump appeal. For all his faults, Rogan started off as an interesting podcaster who leveraged his TV stardom to bring interesting people on board to talk before he went off to the deep end. Ranveer is just good at marketing. I agree Bro ranveer is shit in podcasting too. Rogan intial podcasts where full of conspiracy theories like aliens and fake moon landing etc etc Prayagrajya"
}