{
    "id": "1dnxa84",
    "title": "A new low for Women empowerment in India - Women were asked to evacuate on guest speaker's demand (OC)",
    "url": "https://v.redd.it/oeaz3bv09n8d1",
    "selftext": "At a recently concluded Internation Conference for CA STUDENTS at Kolkata, where the ICAI president Mr Ranjeet Kumar Agarwal talked about the increasing number of Women CAs in India, one of the chief guests was Swami Gyanvatsalya from BAPS Swaninarayan Mandir.\n\nThe first and foremost requirement for Swamiji was that no woman or girl should be seated in the first five rows or Swamiji would promptly walk out at the first sight of them( I wish he did). Following this requirement, even the women event organisers working backstage were asked to vacate the area and sit at the back of the hall. \n\nAs per the announcer on stage, \"No ladies, no girls, no girl volunteer should even stand during the session, please hurry up as he can come anytime\".\n\nSwamiji talked about making India 'Vikasit' and a 'Vishwaguru' by 2047 but his actions on the other hand, well.... It certainly isn't happening with your mindset guruji. \n\nIt's shocking that in such progressive times, ICAI which calls itself a leading accounting body in the world would invite a guest like Gyanvatsalya to a conference where young and impressionable minds come to gain insights about how leaders think and operate. \n\nI wonder what would happen if CM Mamta Banerjee was also present at the event ?",
    "flair": "Rant / Vent",
    "score": 2044,
    "num_comments": 205,
    "created_utc": 1719289052.0,
    "convurl": "https://external-preview.redd.it/NWJ2bDRwajA5bjhkMVu2gTvxP7BMKCpScErjbeFZUoJbL2EXgQIUFhfy3f8g.png?format=pjpg&auto=webp&s=42c75c8f1ce19774aef0875c9a17a4b3c1a88fb9",
    "comments": [
        "Can't say I'm shocked. \n\nMiddle-aged middle class male professionals -- particularly doctors, lawyers, teachers, bankers, CAs, tech managers -- are some of the most orthodox, narrow-minded, unempathetic people I've come across, especially if they're religious. \n\nCarrying a web of poor takes like cultural superiority, misogyny, casteism, xenophobia. \n\nEducation and wealth don't seem to have any positive impacts on religious minds.",
        "Post this on the CA subreddit",
        "BAPS is anyway a racist bigoted org like ISKCON what to expect from gujju preachers check you tube you find many such screwheads but how are they allowed to operate and lot of gullible followers",
        "Baba was unusually horned, can't help it is occupational hazard.",
        "ICAI should be ashamed they called a BAPS guy for the event.\n\nWould have loved if people stood up and emptied the hall.",
        "So he couldn't keep it in his pants and demanded women to be removed from his eyesight",
        "What do you guys think, in case of an emergency will he choose to be operated by a female doctor or choose death?\n/S",
        "Unfortunately they have too much power and authority in this so-called largest liberal democracy.",
        "what the fapck is wrong with this country\n\nwhy was a religious guy even called to the conference, what relevance does he have there",
        "Calling a BAPS guy...this is expected",
        "Everyone should've walked out I feel",
        "We used to be a liberal democracy.",
        "Did anyone say anything or all spineless there",
        "When your \"education\" amounts to your pathetic values being reinforced, there's not much that can be done. It's a culture problem, gotta attack it at it's roots.",
        "We are evolving backwards ↘️",
        "Post it in Kolkata sub also",
        "Why tf are you degrading an entire society of successful people when you yourself are not capable to even work under them.",
        "Let's take our nation back from them. Join our subreddit. I'll send you the invite.",
        "This kind of stuff never makes it to mainstream news, does it? He has done it before, only VICE reported it.\n\n[https://www.vice.com/en/article/9kx733/indian-motivational-speaker-refuses-to-give-speech-after-seeing-women-seated-in-the-front-row](https://www.vice.com/en/article/9kx733/indian-motivational-speaker-refuses-to-give-speech-after-seeing-women-seated-in-the-front-row)",
        "Wtf is a swamiji doing in an international conference?! Who the hell invites one?!",
        "This is beyond insulting- sure enough these people would want separate education centres, rooms and public places for women soon enough- smh",
        "Whats the problem? Will he have an erection on stage?",
        "Interesting. When companies ban males from participating in placement drives, Nobody seems to have any problem. When seminars are conducted where men are not allowed, Nobody seems to having any problem.",
        "He has been edging for centuries. And at the first sight of a woman he would explode.",
        "Because these Swamis practice Brahmacharya and are celibate, they cannot have women around them.\n\nWe have invited these BAPS Swamis to our home many times, and each time they request us that women in our home should not be around them.\n\nIt was the organizers' mistake to invite these Swamijis as a chief guest to a situation where women were also present. Blame the organizers, not the Swamijis, as they strictly follow the rule of not being around women.",
        "New low for icai.",
        "I have a terrible memory, but didn't we have the whole \"beti bachao, beti padhao\" shenanigan a while back? Yet another example of sexism BEING NORMALISED.",
        "We are all blaming the organizers and the spineless guests. No one can fix these backwards swamijis, they don't belong in such an event. ",
        "I can't believe no women or none of the male guests protested. How can everyone in such a large audience be so spineless? ",
        "Whats BAPS?",
        "even the Buddha was celibate but he has female disciples. this just seems like a sad, outdated excuse to hide your inability to control your boner ffs. saare swami baba ek jaise hi hote hai. successful conmen. and unke bhakt Jo unke naam par charity donations karte hai, wo lallu.",
        "Isn’t BAPS the same as ISKCON ? I guess they are connected.",
        "So even ICAI is also right wing now?. WOW\n\nCan't say i m surprised. \n\nFeel disgusted.",
        "Weird comment but yeah, it's silly what he's demanding.",
        "To maintain public mental health",
        "They are CAs.  /s",
        "They might have money but not character.",
        "Says who?\nThat's like saying the entire gen z is spoiled.",
        "This has always been the case. I have met a lot of them. They're misogynists and homophobic.",
        "As a male even I would have left the conference. What's the point of listening to narrow minded people.",
        "They should then confine themselves to places where there are no women why move around and then expect others to adjust to their personal issues,  these people aren't that imp individuals that people need to adjust.\n\nSwami is dumb and the people licking his boots are even dumber",
        "Most CAs are spineless and are easily exploited their courage are bent and broken during their articleship and only come back once they’re successful’",
        "You say that , but I know a lot of 20s and 30s , who keeps thinking like caste, and what not. And these are the so-called educated people.",
        "That Swamiji is from BAPS. Ever heard of BAPS and Swaminarayans ?\n\n>Swami is dumb and the people licking his boots are even dumber.\n\nSo these all world leaders who follow them are dumbs ? I personally know many many very rich buisnessmens (1000cr+ NW) who are die hard devotees of swaminarayans.\n\nhttps://preview.redd.it/slkvxfrw3p8d1.jpeg?width=678&format=pjpg&auto=webp&s=2aa7dc31c49bf8ca40dede0edb0d4ffb32c0ea74",
        "https://preview.redd.it/bin9mojy3p8d1.jpeg?width=739&format=pjpg&auto=webp&s=fb4a15fc9cfa300efca411732ff031d61d695cf3",
        "https://preview.redd.it/civf1sy04p8d1.jpeg?width=677&format=pjpg&auto=webp&s=dbfef38561d3a76104e2e8a20f4a6be1818e2aeb",
        "https://preview.redd.it/z9rzasp24p8d1.jpeg?width=739&format=pjpg&auto=webp&s=2fec82015e80579db779764b490a7b6302dc69fb",
        "Let's take our nation back from them. Join our subreddit. I'll send you the invite.",
        "Never heard of baps and couldn't care less about an organisation of swamis lol.\n\nThese so called world leaders dont follow them, they just took a photo with them as a courtesy lol.\n\nAs for the ur said buisness men who have 1000cr net worth and u know them personally yes they are also dumb for falling for the whole spirituality bullshit,  shit like that seems to very common when u have so much money that u dont really need to work and have a lot of free time.\n\nNot to mention many of these business men also give donations to the organisations of swami to evade tax",
        "The whole point of being celibate is to learn to discipline yourself and control yourself EVEN in the presence of a tempting woman. \n\nTo be celibate when there is not a single woman around you is nothing. Anybody can do that. Incels do it everyday. \nTo control yourself when there are thousands of apsaras dancing around you is the real thing.",
        "Boris, sunakh and the Saudi prince ? Yes. Yes they're dumb (and,more importantly for these pictures, corrupt to the bone)",
        ">Swami is dumb and the people licking his boots are even dumber.\n\nSo according to you he is also dumber, right?\n\nhttps://preview.redd.it/3oq7aacm6p8d1.jpeg?width=640&format=pjpg&auto=webp&s=5498e4099d5e8864c61500cb4f66889274e4ae15",
        "https://preview.redd.it/w1u19tqn6p8d1.jpeg?width=600&format=pjpg&auto=webp&s=cff363ef9c0d262d11313c59a7332cc809647f30",
        "Lol. You naive, sweet, summer child. \n\nThey are not die-hard devotees, they just use each other. It's just symbiosis. You think Boris Johnson gives a flying f*ck about your \"swamiji\" ? Lol, he just uses him to get the Indian diaspora's support. Swamiji uses Boris to get more attention and credibility.",
        ">the ur said buisness men who have 1000cr net worth and u know them personally yes they are also dumb for falling for the whole spirituality bullshit,\n\nSo he is also dumber according to you, right ?\n\nhttps://preview.redd.it/vwcz18h27p8d1.jpeg?width=1080&format=pjpg&auto=webp&s=72556ab52ca14cd4cc6f6a2194dd19944cad1b99",
        "I would be literally opposite of this  i would encourage if women sat in front of me instead of some boomers haha 🤣. Jokes aside he literally as a video on yt titled Greatest speech ever llike wtf, Hightime we remove all religious pseudoscientific elements from our institutions.",
        "APJ is also dumb according to you ?\n\nhttps://preview.redd.it/ocdenz8b7p8d1.jpeg?width=1080&format=pjpg&auto=webp&s=cc23049ce2d89c0260825022d93d2e10051a110e",
        "This is violation of Article 14 , Article 15, Article 18 and Article 23 and of the Indian constitution. I don't know why the senior female faculty and women organise and take a stand against such sick and raging misogynists! Had He done this in a university of a developed Country, He would have been criticised and thrown out of the campus. Disgusting.",
        "At my convocation ceremony my dean also invited some guru of Swainarayan we declined after few days and invited one of most prestigious doctor of our city",
        "Another non-biological specimen? Can't keep it in his pants at the sight of a woman? Does he have some mental disorder? \n\nWere all the women there spineless to confront this? Were all the other men present there equally spineless? \n\nAnd this was an international conference organised by ICAI. Is this what their education and qualifications are all about?",
        "Is that a rhetorical question? If not, take it as an exercise: what do you think? Try to answer your own question",
        "Stop with the ad hominen, you don't even know the guy.",
        "That's relevant when people become too happy all of a sudden so he's there to maintain the equilibrium.",
        "And he knows every middle aged lawyer, doctor. The double standards.",
        "\"edging for centuries\" was NOT in Bible.",
        "\"I've come across\" ...He never said 'everyone' is.",
        "That still doesn't change the fact that he is talking about an entire section of society.",
        "Why was a BAPS guy invited to an educational event? What correlation does it have. Shame on the organisers for doing this! No wonder we are still backward nation.",
        "Oh so you're not allowed to talk about a section of the society?? He didn't make crude judgment he just said that , it's what he comes across. Make use of your brain dude.",
        "Ye Andrew Tate ka student hai kya? Matlab hum Arab countries jaise kyu act kar rahe (Unse bhi bure ab toh) Kaunsa \"Guruji\" hai ye, Galat Hinduism padh ke Aya hai kya, usne toh women ko aise treat nahi karna sikhaya tha",
        "Ye Andrew Tate ka student hai kya? Matlab hum Arab countries jaise kyu act kar rahe (Unse bhi bure ab toh) Kaunsa \"Guruji\" hai ye, Galat Hinduism padh ke Aya hai kya, usne toh women ko aise treat nahi karna sikhaya tha",
        "They are so brainwashed to blindly obey.The women en masse should have refused to move out.",
        "I have never seen such discrimination done by catholic priests or Buddhist monks who also practice celibacy. Is it because BAPS guys are more horny than everyone else?",
        "Hmm, I guess I'll try to explain it to you in a crude way, what if I say that trans people are the most gaslit individuals who have no idea of reality and are living in a delusional world who act rudely to everyone else and demand most respect which they haven't earned and the stupidest individual I have ever met.\nDo you see how this can be rude to trans people.\nEven tho I wrote \"I have ever met\" I am still addressing the entire community.\nBtw that's just an example and not my actual opinion.",
        "BAPS is the shittiest society. They've done weird shit around the globe.",
        "That's the reality of my experiences. Just because you don't like that reality (or perhaps you just don't like anyone exposing that reality) doesn't mean I should turn a blind eye to years of experiences.\n\nAlso, you're mistakenly assuming I'm not in the same demographic myself and never worked with/under such people.",
        "What kind of a celibate are you if you have no control over your urges? And need women to be removed?",
        "Seriously? Boris Johnson?",
        "I didn't mean it in the sense other age demographics are much better.\n\nI meant that I tended to assume some things about the characters of such people...\n\neducated => perhaps somewhat reformed, humble, empathetic thinking due to more knowledge and information\n\nmiddle-aged / older => perhaps wiser thanks to more years and varieties of experience compared to younger people\n\nmiddle-class => not born rich or bratty; probably led humbler lives at some point and undergone some hardships themselves (this is actually true about many of them in my circles)\n\nprofessionals => expectation that the typical quality of thinking will be above par, even if it's a put-on mask, because many of them were/are in responsible positions that involved interacting with a diverse set of people\n\npleasant demeanour => a nice amicable person outwordly must also be a nice person in general\n\nOne or more of these assumptions turned out wrong too often to make me think how tf did this person end up like this!",
        "What he did is just silly but commenting on it is weird to you. OK.",
        "[A lot of fun](https://www.urbandictionary.com/define.php?term=baps)",
        "What the frick...",
        "You've wrote 'ive ever met' and that should signal to any rational person who agrees/disagrees with you to respect your experiences . Because that's not about the group but the people in your experience and you can't disregard anyone else's experience .",
        "WTF why was this person even invited to the event.",
        "Bhaiyya the category you defined can be equated to white men in western countries, they are the ones who have benefitted from the system the most and are comfortable wherever they go, they don't or don't want to acknowledge the inequality.",
        "Damn bro why you gotta expose him like that lmao 🤣",
        "true",
        "Why is a religious leader presenting at a ICAI conference?",
        "See his profile.. he's got such a Prajwal revanna vibe. Lol. I hope this guy isn't a politician otherwise he'll have own r@pehub. Every comment and post is about either his sex addiction or making disgusting comments about women.",
        "really? quite strange as many sane people would actually lose their mind seeing this \n\nmy 2 cents.. if you mean that Swami Gyanvatsalya is there as a psychologist to help these students with their mental issue, do you mean these students are suffering mentally\n\nfurthermore i would say no 2 minds are alike so this mental therapy might work on someone and might drive others crazy",
        "I do apologise for being rude.",
        "> Because these Swamis practice Brahmacharya and are celibate, they cannot have women around them.\n\nThen those swamis can go fuck themselves.",
        "Guess so",
        "Religious speakers are perceived as mental health experts in our country",
        "Just Tanatani things ",
        "https://www.baps.org/About-BAPS/WhoWeAre.aspx",
        "Isn't the entire purpose of Brahmacharya, having self control. Thks feels dude is cheatiny",
        "No not really. It's just people don't wanna think",
        "So? Is he god? If if he is, he shouldn't impose his beliefs on people. I thought people who are english speaking, educated , affluent, working and on reddit would be sensible.",
        "Nope",
        "Why the heck does this guruji have such an affinity for women??? Sick mindset indeed",
        "We still don't understand mental health that's why .",
        "Do you think anyone in Indian organisation has spine to question higher authority without risking their career?",
        "Put it on twitter. \n\n\nThis is crazy!!!",
        "This is so fucked up. The fact that nobody called him out at the moment is even more shocking.",
        "Talent sees talent. Spineless people see spineless leader (who's afraid to speak in front of girls).",
        "And how is a BAPS guy who can’t control his hormones give a lecture on mental health?",
        "So apparently this guy's done this before? In front of female Doctors and Lawyers at that too??? \n\n[https://www.indiatimes.com/trending/wtf/seeing-women-seated-in-front-row-upset-swami-leaves-without-delivering-speech-370526.html](https://www.indiatimes.com/trending/wtf/seeing-women-seated-in-front-row-upset-swami-leaves-without-delivering-speech-370526.html)\n\nHow is there even a single person left in the audience??! This is what I mean when I say Indians have very little civic duty. When someone who practices active sexism comes and demands that others adhere to his \"rules\" nobody protests? As a former med student I understand the risk that comes with protesting(from Admin) but this is beyond the pale... Not even 5 years back during surgery rotations in TN I've heard older surgeons talking about how they don't think women can be surgeons.... and that was TN....",
        "Fucking hell man this is just straight up sexism like he should be behind bars or atleast suspended from his post",
        "u/Metheunpredictable 🤔",
        "Taliban shit",
        "I want to curse so bad.. such a regressive man",
        "CELIBACY ka naam suna h ?",
        "Modern slavers [https://www.nytimes.com/2021/05/11/nyregion/nj-hindu-temple-india-baps.html](https://www.nytimes.com/2021/05/11/nyregion/nj-hindu-temple-india-baps.html)",
        "I'm in the US and a well-educated coworker from TN was telling me how it's actually good that they don't let women into some of the temples, it's for our own safety. (I'd mentioned something about never going to BAPS)\n\nSince it was at work I didn't give her an earful.",
        "Islamic chartered accountants of West Bengal",
        "this was my thought... he is so horny and even the sight of women might make him do embarrassing things in front of the crowd.",
        "I dont mind the BAPS guy doing in his own home or institution or any hindu institution.\n\nHowever, once he goes outside, he should be allowed to dictate such terms. Plus, the college shouldn't have invited him in the first place or shouldn't agree to his terms.",
        "Who is this guy?",
        "That bhangi swami will most likely be dead by 2047…he is just grifting off till then..",
        "As a CA can confirm",
        "It means controlling your own di*k, not asking someone to inconvenience themselves to compensate the lack of control",
        "ICAI",
        "Hindutva Chaddis will come to defend this shitty sexist discrimination too.",
        "Celibacy means abstinence from SEX, not from mere presence of any women.",
        "Among all professionals CAs are the most far right wing.",
        "Idk about all women, but Mamta Banerjee definitely should sit in the back",
        "What a shame. Really shameful and then they laugh at other religions for being misogynistic.",
        "Fuck this Swami. What an asshole.",
        "The guests ICAI call upon are always those kind of fake gurus and babas. I feel there's more to come..",
        "should have asked him \"English or Spanish?\"",
        "Do not blame the guy because he showed us that the society itself is corrupt, he says and asks for something but the others are happy to oblige. If I were there and most I know were there we would have walked out too. Everyone should have walked out.",
        "That's quite hard to believe! I've seen them on both sides of the spectrum.",
        "And everyday, the perception of Indians being viewed as sexist pigs by the foreign countries reigns true little by little.",
        "If the mere presence of women challenges your self established celibacy then that’s concerning.",
        "Ridiculous",
        "Horseshit excuses. Celibacy = abstaining from sex. Something that is very difficult to do for most people, it is an act of self control. If you really are Hindu, read up on the history and lore. There are so many stories of saints being tempted by Apasars, some of them succeeded in resisting, some of them did not. Those who controlled themselves were deemed virtuous.\n\nIf instead of displaying self control, you take the option of getting the woman to leave, that is putting your chosen burden of celibacy on them. There's really not much power in saying \"I'm celibate, wow bramacharya oohh aahh\" if there are only men there.\n\nIn short: If you cannot control your dick around women, then instead of telling women to leave, you should leave instead. Trust me, you will not be missed.",
        "Firstly, a swami who needs women to be away from his sight for his own self control cannot accept such requests for being a guest speaker . He needs to go away to Himalayas and meditate and have a stronger mind. Don’t think he is a real swamiji.",
        "Swamijii not allowed to wear underwear due to culture and his big vishwaguru energy.",
        "nope celibacy means not even see women thats why males go to ashram in older times",
        "Then go to some remote place and don't come back, don't hang around in public places.",
        "I will be more concerned that the women in the crowd complied, if they did. Defiance and protest is what makes progress in society. Nothing changes on its own and nobody will consider you as equal one fine morning until YOU demand it.",
        "The same group that used underpaid and exploited indian  labor to build the largest temple in the US and then claimed that the labourers were doing it out of devotion and not actually employed.",
        "It is pathetic for two reasons:\n\n1 The so called professional body has chosen to invite a person with such a mentality for the meeting.\n\n2 The qualified CAs, including women, have not protested and boycotted the event, in spite of the misogynistic attitude of the speaker.",
        "Yeah lawyers",
        "Why is he allergic to women? The organizers should have asked Misogynist-Swamiji need not bother to come. We don't need your kind in any event anyhow. The audacity the fat-pig has to demand this. How high is his Ego!?",
        "The BAPs guy can go get treatment for his mental health and insecurities about girls on his own time. Why waste time of everyone here?",
        "Imagine being that old but still unable to keep an eye contact in a room filled with women? Who's at fault here then. This is absolutely pathetic",
        "Yes these women know their place\n/S",
        "Politics and fear of being outsed is why useless male guests did not protest.",
        "What does CA got to do with swamijis?\nHave some sense guys",
        "Yes. In my field at least which is quite a small one people are very principled. ",
        "What can we expect from these so called “Sant”? They go to their devotee’s house for giving ashirvad, expects to be fed but requires all the females to be locked up in a room in their own home! Home which is cleaned by females, food which is prepared by females btw.\nWhy don’t they blindfold themselves if they have so much problem with seeing faces of women?",
        "इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ। तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ।।",
        "I got no clue. \n\nEverything is weird in this country.",
        "OK,I already asked this in 2 other subs with no reply.\n\nWhy did he have a problem with women sitting in front? What's the logic?",
        "He was invited he didn't comes on his own",
        "Find out why on u r own im not a paragraph guy",
        "bro is committed to his edging streak",
        "Imagine the amount of respect icai would've gained if they took a stand for the women present in the hall. Stupid move from an event organised by \"chartered accountants\".",
        "What a disgrace.\n\nWalking out is definitely the right move in such circumstances.\n\nReminds me of another instance where I encountered casual misogyny in the public sphere, though perhaps a lighter version of it. I was at the Red Fort in Delhi, with my then-girlfriend. They were doing a \"light and sound\" show, which consisted of an audio recording of this guy narrating the history of the Red Fort to a seated audience in the open, with the Red Fort lit up in different colored lights. The show itself was very mediocre. But what caught my attention was in the middle, the narrator was describing the reign of (I think, drawing from memory) Muhammad Shah \"Rangeela\" and mentioned one of his concubines as a **\"common slut\"** (those are the only words I can remember from the entirety of the lecture) who brought (paraphrasing) \"dark times to the Mughal rule\".\n\nI felt so awkward hearing that kind of language in this day and age in a setting that's supposed to be inclusive. Should have talked to my gf then and just walked away. But I stayed. I hope the students in this auditorium similarly regretted staying through the lecture.",
        "Yes, because he can't say no right.",
        "Why is that guy invited to such conferences in the first place???",
        "Nah, I’d have walked out. Fuck them.",
        "BAPS is notorious for slavery.",
        "Well you don't know what all shit gets invited to  IITs, this is still a non-scientific body.",
        "Wrong with entire country?",
        "A developed country wouldn't have called a BAPS guy in the first place.",
        "Not really, Harrison Butker controversy proved otherwise.",
        "All the chapters of ICAI call some or the other BAPS person for their events. The yt is littered with it",
        "Are vo gay hoga .. usko ladke dekhne honge .. ky problem he yarr",
        "If the speaker had been Muslim then this would have been national news."
    ],
    "cleaned_text": "new low women empowerment india women asked evacuate guest speakers demand oc recently concluded internation conference ca students kolkata icai president mr ranjeet kumar agarwal talked increasing number women cas india one chief guests swami gyanvatsalya baps swaninarayan mandir first foremost requirement swamiji woman girl seated first five rows swamiji would promptly walk first sight wish following requirement even women event organisers working backstage asked vacate area sit back hall per announcer stage ladies girls girl volunteer even stand session please hurry come anytime swamiji talked making india vikasit vishwaguru actions hand well certainly isnt happening mindset guruji shocking progressive times icai calls leading accounting body world would invite guest like gyanvatsalya conference young impressionable minds come gain insights leaders think operate wonder would happen cm mamta banerjee also present event ",
    "cleaned_title": "new low women empowerment india women asked evacuate guest speakers demand oc",
    "cleaned_selftext": "recently concluded internation conference ca students kolkata icai president mr ranjeet kumar agarwal talked increasing number women cas india one chief guests swami gyanvatsalya baps swaninarayan mandir first foremost requirement swamiji woman girl seated first five rows swamiji would promptly walk first sight wish following requirement even women event organisers working backstage asked vacate area sit back hall per announcer stage ladies girls girl volunteer even stand session please hurry come anytime swamiji talked making india vikasit vishwaguru actions hand well certainly isnt happening mindset guruji shocking progressive times icai calls leading accounting body world would invite guest like gyanvatsalya conference young impressionable minds come gain insights leaders think operate wonder would happen cm mamta banerjee also present event",
    "cleaned_comments": "cant say im shocked middleaged middle class male professionals particularly doctors lawyers teachers bankers cas tech managers orthodox narrowminded unempathetic people ive come across especially theyre religious carrying web poor takes like cultural superiority misogyny casteism xenophobia education wealth dont seem positive impacts religious minds post ca subreddit baps anyway racist bigoted org like iskcon expect gujju preachers check tube find many screwheads allowed operate lot gullible followers baba unusually horned cant help occupational hazard icai ashamed called baps guy event would loved people stood emptied hall couldnt keep pants demanded women removed eyesight guys think case emergency choose operated female doctor choose death unfortunately much power authority socalled largest liberal democracy fapck wrong country religious guy even called conference relevance calling baps guythis expected everyone shouldve walked feel used liberal democracy anyone say anything spineless education amounts pathetic values reinforced theres much done culture problem got ta attack roots evolving backwards post kolkata sub also tf degrading entire society successful people capable even work lets take nation back join subreddit ill send invite kind stuff never makes mainstream news done vice reported httpswwwvicecomenarticlekxindianmotivationalspeakerrefusestogivespeechafterseeingwomenseatedinthefrontrowhttpswwwvicecomenarticlekxindianmotivationalspeakerrefusestogivespeechafterseeingwomenseatedinthefrontrow wtf swamiji international conference hell invites one beyond insulting sure enough people would want separate education centres rooms public places women soon enough smh whats problem erection stage interesting companies ban males participating placement drives nobody seems problem seminars conducted men allowed nobody seems problem edging centuries first sight woman would explode swamis practice brahmacharya celibate women around invited baps swamis home many times time request us women home around organizers mistake invite swamijis chief guest situation women also present blame organizers swamijis strictly follow rule around women new low icai terrible memory didnt whole beti bachao beti padhao shenanigan back yet another example sexism normalised blaming organizers spineless guests one fix backwards swamijis dont belong event cant believe women none male guests protested everyone large audience spineless whats baps even buddha celibate female disciples seems like sad outdated excuse hide inability control boner ffs saare swami baba ek jaise hi hote hai successful conmen unke bhakt jo unke naam par charity donations karte hai wo lallu isnt baps iskcon guess connected even icai also right wing wow cant say surprised feel disgusted weird comment yeah silly hes demanding maintain public mental health cas might money character says thats like saying entire gen z spoiled always case met lot theyre misogynists homophobic male even would left conference whats point listening narrow minded people confine places women move around expect others adjust personal issues people arent imp individuals people need adjust swami dumb people licking boots even dumber cas spineless easily exploited courage bent broken articleship come back theyre successful say know lot keeps thinking like caste socalled educated people swamiji baps ever heard baps swaminarayans swami dumb people licking boots even dumber world leaders follow dumbs personally know many many rich buisnessmens cr nw die hard devotees swaminarayans lets take nation back join subreddit ill send invite never heard baps couldnt care less organisation swamis lol called world leaders dont follow took photo courtesy lol ur said buisness men cr net worth u know personally yes also dumb falling whole spirituality bullshit shit like seems common u much money u dont really need work lot free time mention many business men also give donations organisations swami evade tax whole point celibate learn discipline control even presence tempting woman celibate single woman around nothing anybody incels everyday control thousands apsaras dancing around real thing boris sunakh saudi prince yes yes theyre dumb andmore importantly pictures corrupt bone swami dumb people licking boots even dumber according also dumber right lol naive sweet summer child diehard devotees use symbiosis think boris johnson gives flying fck swamiji lol uses get indian diasporas support swamiji uses boris get attention credibility ur said buisness men cr net worth u know personally yes also dumb falling whole spirituality bullshit also dumber according right would literally opposite would encourage women sat front instead boomers haha jokes aside literally video yt titled greatest speech ever llike wtf hightime remove religious pseudoscientific elements institutions apj also dumb according violation article article article article indian constitution dont know senior female faculty women organise take stand sick raging misogynists done university developed country would criticised thrown campus disgusting convocation ceremony dean also invited guru swainarayan declined days invited one prestigious doctor city another nonbiological specimen cant keep pants sight woman mental disorder women spineless confront men present equally spineless international conference organised icai education qualifications rhetorical question take exercise think try answer question stop ad hominen dont even know guy thats relevant people become happy sudden hes maintain equilibrium knows every middle aged lawyer doctor double standards edging centuries bible ive come across never said everyone still doesnt change fact talking entire section society baps guy invited educational event correlation shame organisers wonder still backward nation oh youre allowed talk section society didnt make crude judgment said comes across make use brain dude ye andrew tate ka student hai kya matlab hum arab countries jaise kyu act kar rahe unse bhi bure ab toh kaunsa guruji hai ye galat hinduism padh ke aya hai kya usne toh women ko aise treat nahi karna sikhaya tha ye andrew tate ka student hai kya matlab hum arab countries jaise kyu act kar rahe unse bhi bure ab toh kaunsa guruji hai ye galat hinduism padh ke aya hai kya usne toh women ko aise treat nahi karna sikhaya tha brainwashed blindly obeythe women en masse refused move never seen discrimination done catholic priests buddhist monks also practice celibacy baps guys horny everyone else hmm guess ill try explain crude way say trans people gaslit individuals idea reality living delusional world act rudely everyone else demand respect havent earned stupidest individual ever met see rude trans people even tho wrote ever met still addressing entire community btw thats example actual opinion baps shittiest society theyve done weird shit around globe thats reality experiences dont like reality perhaps dont like anyone exposing reality doesnt mean turn blind eye years experiences also youre mistakenly assuming im demographic never worked withunder people kind celibate control urges need women removed seriously boris johnson didnt mean sense age demographics much better meant tended assume things characters people educated perhaps somewhat reformed humble empathetic thinking due knowledge information middleaged older perhaps wiser thanks years varieties experience compared younger people middleclass born rich bratty probably led humbler lives point undergone hardships actually true many circles professionals expectation typical quality thinking par even puton mask many wereare responsible positions involved interacting diverse set people pleasant demeanour nice amicable person outwordly must also nice person general one assumptions turned wrong often make think tf person end like silly commenting weird ok lot funhttpswwwurbandictionarycomdefinephptermbaps frick youve wrote ive ever met signal rational person agreesdisagrees respect experiences thats group people experience cant disregard anyone elses experience wtf person even invited event bhaiyya category defined equated white men western countries ones benefitted system comfortable wherever go dont dont want acknowledge inequality damn bro got ta expose like lmao true religious leader presenting icai conference see profile hes got prajwal revanna vibe lol hope guy isnt politician otherwise hell rpehub every comment post either sex addiction making disgusting comments women really quite strange many sane people would actually lose mind seeing cents mean swami gyanvatsalya psychologist help students mental issue mean students suffering mentally furthermore would say minds alike mental therapy might work someone might drive others crazy apologise rude swamis practice brahmacharya celibate women around swamis go fuck guess religious speakers perceived mental health experts country tanatani things isnt entire purpose brahmacharya self control thks feels dude cheatiny really people dont wan na think god shouldnt impose beliefs people thought people english speaking educated affluent working reddit would sensible nope heck guruji affinity women sick mindset indeed still dont understand mental health thats think anyone indian organisation spine question higher authority without risking career put twitter crazy fucked fact nobody called moment even shocking talent sees talent spineless people see spineless leader whos afraid speak front girls baps guy cant control hormones give lecture mental health apparently guys done front female doctors lawyers httpswwwindiatimescomtrendingwtfseeingwomenseatedinfrontrowupsetswamileaveswithoutdeliveringspeechhtmlhttpswwwindiatimescomtrendingwtfseeingwomenseatedinfrontrowupsetswamileaveswithoutdeliveringspeechhtml even single person left audience mean say indians little civic duty someone practices active sexism comes demands others adhere rules nobody protests former med student understand risk comes protestingfrom admin beyond pale even years back surgery rotations tn ive heard older surgeons talking dont think women surgeons tn fucking hell man straight sexism like behind bars atleast suspended post umetheunpredictable taliban shit want curse bad regressive man celibacy ka naam suna h modern slavers httpswwwnytimescomnyregionnjhindutempleindiabapshtmlhttpswwwnytimescomnyregionnjhindutempleindiabapshtml im us welleducated coworker tn telling actually good dont let women temples safety id mentioned something never going baps since work didnt give earful islamic chartered accountants west bengal thought horny even sight women might make embarrassing things front crowd dont mind baps guy home institution hindu institution however goes outside allowed dictate terms plus college shouldnt invited first place shouldnt agree terms guy bhangi swami likely dead grifting till ca confirm means controlling dik asking someone inconvenience compensate lack control icai hindutva chaddis come defend shitty sexist discrimination celibacy means abstinence sex mere presence women among professionals cas far right wing idk women mamta banerjee definitely sit back shame really shameful laugh religions misogynistic fuck swami asshole guests icai call upon always kind fake gurus babas feel theres come asked english spanish blame guy showed us society corrupt says asks something others happy oblige know would walked everyone walked thats quite hard believe ive seen sides spectrum everyday perception indians viewed sexist pigs foreign countries reigns true little little mere presence women challenges self established celibacy thats concerning ridiculous horseshit excuses celibacy abstaining sex something difficult people act self control really hindu read history lore many stories saints tempted apasars succeeded resisting controlled deemed virtuous instead displaying self control take option getting woman leave putting chosen burden celibacy theres really much power saying im celibate wow bramacharya oohh aahh men short control dick around women instead telling women leave leave instead trust missed firstly swami needs women away sight self control accept requests guest speaker needs go away himalayas meditate stronger mind dont think real swamiji swamijii allowed wear underwear due culture big vishwaguru energy nope celibacy means even see women thats males go ashram older times go remote place dont come back dont hang around public places concerned women crowd complied defiance protest makes progress society nothing changes nobody consider equal one fine morning demand group used underpaid exploited indian labor build largest temple us claimed labourers devotion actually employed pathetic two reasons called professional body chosen invite person mentality meeting qualified cas including women protested boycotted event spite misogynistic attitude speaker yeah lawyers allergic women organizers asked misogynistswamiji need bother come dont need kind event anyhow audacity fatpig demand high ego baps guy go get treatment mental health insecurities girls time waste time everyone imagine old still unable keep eye contact room filled women whos fault absolutely pathetic yes women know place politics fear outsed useless male guests protest ca got swamijis sense guys yes field least quite small one people principled expect called sant go devotees house giving ashirvad expects fed requires females locked room home home cleaned females food prepared females btw dont blindfold much problem seeing faces women got clue everything weird country oki already asked subs reply problem women sitting front whats logic invited didnt comes find u r im paragraph guy bro committed edging streak imagine amount respect icai wouldve gained took stand women present hall stupid move event organised chartered accountants disgrace walking definitely right move circumstances reminds another instance encountered casual misogyny public sphere though perhaps lighter version red fort delhi thengirlfriend light sound show consisted audio recording guy narrating history red fort seated audience open red fort lit different colored lights show mediocre caught attention middle narrator describing reign think drawing memory muhammad shah rangeela mentioned one concubines common slut words remember entirety lecture brought paraphrasing dark times mughal rule felt awkward hearing kind language day age setting thats supposed inclusive talked gf walked away stayed hope students auditorium similarly regretted staying lecture yes cant say right guy invited conferences first place nah id walked fuck baps notorious slavery well dont know shit gets invited iits still nonscientific body wrong entire country developed country wouldnt called baps guy first place really harrison butker controversy proved otherwise chapters icai call baps person events yt littered vo gay hoga usko ladke dekhne honge ky problem yarr speaker muslim would national news",
    "light_cleaned_title": "A new low for Women empowerment in India - Women were asked to evacuate on guest speaker's demand (OC)",
    "light_cleaned_selftext": "At a recently concluded Internation Conference for CA STUDENTS at Kolkata, where the ICAI president Mr Ranjeet Kumar Agarwal talked about the increasing number of Women CAs in India, one of the chief guests was Swami Gyanvatsalya from BAPS Swaninarayan Mandir. The first and foremost requirement for Swamiji was that no woman or girl should be seated in the first five rows or Swamiji would promptly walk out at the first sight of them( I wish he did). Following this requirement, even the women event organisers working backstage were asked to vacate the area and sit at the back of the hall. As per the announcer on stage, \"No ladies, no girls, no girl volunteer should even stand during the session, please hurry up as he can come anytime\". Swamiji talked about making India 'Vikasit' and a 'Vishwaguru' by 2047 but his actions on the other hand, well.... It certainly isn't happening with your mindset guruji. It's shocking that in such progressive times, ICAI which calls itself a leading accounting body in the world would invite a guest like Gyanvatsalya to a conference where young and impressionable minds come to gain insights about how leaders think and operate. I wonder what would happen if CM Mamta Banerjee was also present at the event ?",
    "light_cleaned_comments": "Can't say I'm shocked. Middle-aged middle class male professionals -- particularly doctors, lawyers, teachers, bankers, CAs, tech managers -- are some of the most orthodox, narrow-minded, unempathetic people I've come across, especially if they're religious. Carrying a web of poor takes like cultural superiority, misogyny, casteism, xenophobia. Education and wealth don't seem to have any positive impacts on religious minds. Post this on the CA subreddit BAPS is anyway a racist bigoted org like ISKCON what to expect from gujju preachers check you tube you find many such screwheads but how are they allowed to operate and lot of gullible followers Baba was unusually horned, can't help it is occupational hazard. ICAI should be ashamed they called a BAPS guy for the event. Would have loved if people stood up and emptied the hall. So he couldn't keep it in his pants and demanded women to be removed from his eyesight What do you guys think, in case of an emergency will he choose to be operated by a female doctor or choose death? /S Unfortunately they have too much power and authority in this so-called largest liberal democracy. what the fapck is wrong with this country why was a religious guy even called to the conference, what relevance does he have there Calling a BAPS guy...this is expected Everyone should've walked out I feel We used to be a liberal democracy. Did anyone say anything or all spineless there When your \"education\" amounts to your pathetic values being reinforced, there's not much that can be done. It's a culture problem, gotta attack it at it's roots. We are evolving backwards ↘️ Post it in Kolkata sub also Why tf are you degrading an entire society of successful people when you yourself are not capable to even work under them. Let's take our nation back from them. Join our subreddit. I'll send you the invite. This kind of stuff never makes it to mainstream news, does it? He has done it before, only VICE reported it. [https://www.vice.com/en/article/9kx733/indian-motivational-speaker-refuses-to-give-speech-after-seeing-women-seated-in-the-front-row](https://www.vice.com/en/article/9kx733/indian-motivational-speaker-refuses-to-give-speech-after-seeing-women-seated-in-the-front-row) Wtf is a swamiji doing in an international conference?! Who the hell invites one?! This is beyond insulting- sure enough these people would want separate education centres, rooms and public places for women soon enough- smh Whats the problem? Will he have an erection on stage? Interesting. When companies ban males from participating in placement drives, Nobody seems to have any problem. When seminars are conducted where men are not allowed, Nobody seems to having any problem. He has been edging for centuries. And at the first sight of a woman he would explode. Because these Swamis practice Brahmacharya and are celibate, they cannot have women around them. We have invited these BAPS Swamis to our home many times, and each time they request us that women in our home should not be around them. It was the organizers' mistake to invite these Swamijis as a chief guest to a situation where women were also present. Blame the organizers, not the Swamijis, as they strictly follow the rule of not being around women. New low for icai. I have a terrible memory, but didn't we have the whole \"beti bachao, beti padhao\" shenanigan a while back? Yet another example of sexism BEING NORMALISED. We are all blaming the organizers and the spineless guests. No one can fix these backwards swamijis, they don't belong in such an event. I can't believe no women or none of the male guests protested. How can everyone in such a large audience be so spineless? Whats BAPS? even the Buddha was celibate but he has female disciples. this just seems like a sad, outdated excuse to hide your inability to control your boner ffs. saare swami baba ek jaise hi hote hai. successful conmen. and unke bhakt Jo unke naam par charity donations karte hai, wo lallu. Isn’t BAPS the same as ISKCON ? I guess they are connected. So even ICAI is also right wing now?. WOW Can't say i m surprised. Feel disgusted. Weird comment but yeah, it's silly what he's demanding. To maintain public mental health They are CAs. /s They might have money but not character. Says who? That's like saying the entire gen z is spoiled. This has always been the case. I have met a lot of them. They're misogynists and homophobic. As a male even I would have left the conference. What's the point of listening to narrow minded people. They should then confine themselves to places where there are no women why move around and then expect others to adjust to their personal issues, these people aren't that imp individuals that people need to adjust. Swami is dumb and the people licking his boots are even dumber Most CAs are spineless and are easily exploited their courage are bent and broken during their articleship and only come back once they’re successful’ You say that , but I know a lot of 20s and 30s , who keeps thinking like caste, and what not. And these are the so-called educated people. That Swamiji is from BAPS. Ever heard of BAPS and Swaminarayans ? >Swami is dumb and the people licking his boots are even dumber. So these all world leaders who follow them are dumbs ? I personally know many many very rich buisnessmens (1000cr+ NW) who are die hard devotees of swaminarayans. Let's take our nation back from them. Join our subreddit. I'll send you the invite. Never heard of baps and couldn't care less about an organisation of swamis lol. These so called world leaders dont follow them, they just took a photo with them as a courtesy lol. As for the ur said buisness men who have 1000cr net worth and u know them personally yes they are also dumb for falling for the whole spirituality bullshit, shit like that seems to very common when u have so much money that u dont really need to work and have a lot of free time. Not to mention many of these business men also give donations to the organisations of swami to evade tax The whole point of being celibate is to learn to discipline yourself and control yourself EVEN in the presence of a tempting woman. To be celibate when there is not a single woman around you is nothing. Anybody can do that. Incels do it everyday. To control yourself when there are thousands of apsaras dancing around you is the real thing. Boris, sunakh and the Saudi prince ? Yes. Yes they're dumb (and,more importantly for these pictures, corrupt to the bone) >Swami is dumb and the people licking his boots are even dumber. So according to you he is also dumber, right? Lol. You naive, sweet, summer child. They are not die-hard devotees, they just use each other. It's just symbiosis. You think Boris Johnson gives a flying f*ck about your \"swamiji\" ? Lol, he just uses him to get the Indian diaspora's support. Swamiji uses Boris to get more attention and credibility. >the ur said buisness men who have 1000cr net worth and u know them personally yes they are also dumb for falling for the whole spirituality bullshit, So he is also dumber according to you, right ? I would be literally opposite of this i would encourage if women sat in front of me instead of some boomers haha 🤣. Jokes aside he literally as a video on yt titled Greatest speech ever llike wtf, Hightime we remove all religious pseudoscientific elements from our institutions. APJ is also dumb according to you ? This is violation of Article 14 , Article 15, Article 18 and Article 23 and of the Indian constitution. I don't know why the senior female faculty and women organise and take a stand against such sick and raging misogynists! Had He done this in a university of a developed Country, He would have been criticised and thrown out of the campus. Disgusting. At my convocation ceremony my dean also invited some guru of Swainarayan we declined after few days and invited one of most prestigious doctor of our city Another non-biological specimen? Can't keep it in his pants at the sight of a woman? Does he have some mental disorder? Were all the women there spineless to confront this? Were all the other men present there equally spineless? And this was an international conference organised by ICAI. Is this what their education and qualifications are all about? Is that a rhetorical question? If not, take it as an exercise: what do you think? Try to answer your own question Stop with the ad hominen, you don't even know the guy. That's relevant when people become too happy all of a sudden so he's there to maintain the equilibrium. And he knows every middle aged lawyer, doctor. The double standards. \"edging for centuries\" was NOT in Bible. \"I've come across\" ...He never said 'everyone' is. That still doesn't change the fact that he is talking about an entire section of society. Why was a BAPS guy invited to an educational event? What correlation does it have. Shame on the organisers for doing this! No wonder we are still backward nation. Oh so you're not allowed to talk about a section of the society?? He didn't make crude judgment he just said that , it's what he comes across. Make use of your brain dude. Ye Andrew Tate ka student hai kya? Matlab hum Arab countries jaise kyu act kar rahe (Unse bhi bure ab toh) Kaunsa \"Guruji\" hai ye, Galat Hinduism padh ke Aya hai kya, usne toh women ko aise treat nahi karna sikhaya tha Ye Andrew Tate ka student hai kya? Matlab hum Arab countries jaise kyu act kar rahe (Unse bhi bure ab toh) Kaunsa \"Guruji\" hai ye, Galat Hinduism padh ke Aya hai kya, usne toh women ko aise treat nahi karna sikhaya tha They are so brainwashed to blindly obey.The women en masse should have refused to move out. I have never seen such discrimination done by catholic priests or Buddhist monks who also practice celibacy. Is it because BAPS guys are more horny than everyone else? Hmm, I guess I'll try to explain it to you in a crude way, what if I say that trans people are the most gaslit individuals who have no idea of reality and are living in a delusional world who act rudely to everyone else and demand most respect which they haven't earned and the stupidest individual I have ever met. Do you see how this can be rude to trans people. Even tho I wrote \"I have ever met\" I am still addressing the entire community. Btw that's just an example and not my actual opinion. BAPS is the shittiest society. They've done weird shit around the globe. That's the reality of my experiences. Just because you don't like that reality (or perhaps you just don't like anyone exposing that reality) doesn't mean I should turn a blind eye to years of experiences. Also, you're mistakenly assuming I'm not in the same demographic myself and never worked with/under such people. What kind of a celibate are you if you have no control over your urges? And need women to be removed? Seriously? Boris Johnson? I didn't mean it in the sense other age demographics are much better. I meant that I tended to assume some things about the characters of such people... educated => perhaps somewhat reformed, humble, empathetic thinking due to more knowledge and information middle-aged / older => perhaps wiser thanks to more years and varieties of experience compared to younger people middle-class => not born rich or bratty; probably led humbler lives at some point and undergone some hardships themselves (this is actually true about many of them in my circles) professionals => expectation that the typical quality of thinking will be above par, even if it's a put-on mask, because many of them were/are in responsible positions that involved interacting with a diverse set of people pleasant demeanour => a nice amicable person outwordly must also be a nice person in general One or more of these assumptions turned out wrong too often to make me think how tf did this person end up like this! What he did is just silly but commenting on it is weird to you. OK. [A lot of fun](https://www.urbandictionary.com/define.php?term=baps) What the frick... You've wrote 'ive ever met' and that should signal to any rational person who agrees/disagrees with you to respect your experiences . Because that's not about the group but the people in your experience and you can't disregard anyone else's experience . WTF why was this person even invited to the event. Bhaiyya the category you defined can be equated to white men in western countries, they are the ones who have benefitted from the system the most and are comfortable wherever they go, they don't or don't want to acknowledge the inequality. Damn bro why you gotta expose him like that lmao 🤣 true Why is a religious leader presenting at a ICAI conference? See his profile.. he's got such a Prajwal revanna vibe. Lol. I hope this guy isn't a politician otherwise he'll have own r@pehub. Every comment and post is about either his sex addiction or making disgusting comments about women. really? quite strange as many sane people would actually lose their mind seeing this my 2 cents.. if you mean that Swami Gyanvatsalya is there as a psychologist to help these students with their mental issue, do you mean these students are suffering mentally furthermore i would say no 2 minds are alike so this mental therapy might work on someone and might drive others crazy I do apologise for being rude. > Because these Swamis practice Brahmacharya and are celibate, they cannot have women around them. Then those swamis can go fuck themselves. Guess so Religious speakers are perceived as mental health experts in our country Just Tanatani things Isn't the entire purpose of Brahmacharya, having self control. Thks feels dude is cheatiny No not really. It's just people don't wanna think So? Is he god? If if he is, he shouldn't impose his beliefs on people. I thought people who are english speaking, educated , affluent, working and on reddit would be sensible. Nope Why the heck does this guruji have such an affinity for women??? Sick mindset indeed We still don't understand mental health that's why . Do you think anyone in Indian organisation has spine to question higher authority without risking their career? Put it on twitter. This is crazy!!! This is so fucked up. The fact that nobody called him out at the moment is even more shocking. Talent sees talent. Spineless people see spineless leader (who's afraid to speak in front of girls). And how is a BAPS guy who can’t control his hormones give a lecture on mental health? So apparently this guy's done this before? In front of female Doctors and Lawyers at that too??? [https://www.indiatimes.com/trending/wtf/seeing-women-seated-in-front-row-upset-swami-leaves-without-delivering-speech-370526.html](https://www.indiatimes.com/trending/wtf/seeing-women-seated-in-front-row-upset-swami-leaves-without-delivering-speech-370526.html) How is there even a single person left in the audience??! This is what I mean when I say Indians have very little civic duty. When someone who practices active sexism comes and demands that others adhere to his \"rules\" nobody protests? As a former med student I understand the risk that comes with protesting(from Admin) but this is beyond the pale... Not even 5 years back during surgery rotations in TN I've heard older surgeons talking about how they don't think women can be surgeons.... and that was TN.... Fucking hell man this is just straight up sexism like he should be behind bars or atleast suspended from his post u/Metheunpredictable 🤔 Taliban shit I want to curse so bad.. such a regressive man CELIBACY ka naam suna h ? Modern slavers [https://www.nytimes.com/2021/05/11/nyregion/nj-hindu-temple-india-baps.html](https://www.nytimes.com/2021/05/11/nyregion/nj-hindu-temple-india-baps.html) I'm in the US and a well-educated coworker from TN was telling me how it's actually good that they don't let women into some of the temples, it's for our own safety. (I'd mentioned something about never going to BAPS) Since it was at work I didn't give her an earful. Islamic chartered accountants of West Bengal this was my thought... he is so horny and even the sight of women might make him do embarrassing things in front of the crowd. I dont mind the BAPS guy doing in his own home or institution or any hindu institution. However, once he goes outside, he should be allowed to dictate such terms. Plus, the college shouldn't have invited him in the first place or shouldn't agree to his terms. Who is this guy? That bhangi swami will most likely be dead by 2047…he is just grifting off till then.. As a CA can confirm It means controlling your own di*k, not asking someone to inconvenience themselves to compensate the lack of control ICAI Hindutva Chaddis will come to defend this shitty sexist discrimination too. Celibacy means abstinence from SEX, not from mere presence of any women. Among all professionals CAs are the most far right wing. Idk about all women, but Mamta Banerjee definitely should sit in the back What a shame. Really shameful and then they laugh at other religions for being misogynistic. Fuck this Swami. What an asshole. The guests ICAI call upon are always those kind of fake gurus and babas. I feel there's more to come.. should have asked him \"English or Spanish?\" Do not blame the guy because he showed us that the society itself is corrupt, he says and asks for something but the others are happy to oblige. If I were there and most I know were there we would have walked out too. Everyone should have walked out. That's quite hard to believe! I've seen them on both sides of the spectrum. And everyday, the perception of Indians being viewed as sexist pigs by the foreign countries reigns true little by little. If the mere presence of women challenges your self established celibacy then that’s concerning. Ridiculous Horseshit excuses. Celibacy = abstaining from sex. Something that is very difficult to do for most people, it is an act of self control. If you really are Hindu, read up on the history and lore. There are so many stories of saints being tempted by Apasars, some of them succeeded in resisting, some of them did not. Those who controlled themselves were deemed virtuous. If instead of displaying self control, you take the option of getting the woman to leave, that is putting your chosen burden of celibacy on them. There's really not much power in saying \"I'm celibate, wow bramacharya oohh aahh\" if there are only men there. In short: If you cannot control your dick around women, then instead of telling women to leave, you should leave instead. Trust me, you will not be missed. Firstly, a swami who needs women to be away from his sight for his own self control cannot accept such requests for being a guest speaker . He needs to go away to Himalayas and meditate and have a stronger mind. Don’t think he is a real swamiji. Swamijii not allowed to wear underwear due to culture and his big vishwaguru energy. nope celibacy means not even see women thats why males go to ashram in older times Then go to some remote place and don't come back, don't hang around in public places. I will be more concerned that the women in the crowd complied, if they did. Defiance and protest is what makes progress in society. Nothing changes on its own and nobody will consider you as equal one fine morning until YOU demand it. The same group that used underpaid and exploited indian labor to build the largest temple in the US and then claimed that the labourers were doing it out of devotion and not actually employed. It is pathetic for two reasons: 1 The so called professional body has chosen to invite a person with such a mentality for the meeting. 2 The qualified CAs, including women, have not protested and boycotted the event, in spite of the misogynistic attitude of the speaker. Yeah lawyers Why is he allergic to women? The organizers should have asked Misogynist-Swamiji need not bother to come. We don't need your kind in any event anyhow. The audacity the fat-pig has to demand this. How high is his Ego!? The BAPs guy can go get treatment for his mental health and insecurities about girls on his own time. Why waste time of everyone here? Imagine being that old but still unable to keep an eye contact in a room filled with women? Who's at fault here then. This is absolutely pathetic Yes these women know their place /S Politics and fear of being outsed is why useless male guests did not protest. What does CA got to do with swamijis? Have some sense guys Yes. In my field at least which is quite a small one people are very principled. What can we expect from these so called “Sant”? They go to their devotee’s house for giving ashirvad, expects to be fed but requires all the females to be locked up in a room in their own home! Home which is cleaned by females, food which is prepared by females btw. Why don’t they blindfold themselves if they have so much problem with seeing faces of women? इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ। तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ।। I got no clue. Everything is weird in this country. OK,I already asked this in 2 other subs with no reply. Why did he have a problem with women sitting in front? What's the logic? He was invited he didn't comes on his own Find out why on u r own im not a paragraph guy bro is committed to his edging streak Imagine the amount of respect icai would've gained if they took a stand for the women present in the hall. Stupid move from an event organised by \"chartered accountants\". What a disgrace. Walking out is definitely the right move in such circumstances. Reminds me of another instance where I encountered casual misogyny in the public sphere, though perhaps a lighter version of it. I was at the Red Fort in Delhi, with my then-girlfriend. They were doing a \"light and sound\" show, which consisted of an audio recording of this guy narrating the history of the Red Fort to a seated audience in the open, with the Red Fort lit up in different colored lights. The show itself was very mediocre. But what caught my attention was in the middle, the narrator was describing the reign of (I think, drawing from memory) Muhammad Shah \"Rangeela\" and mentioned one of his concubines as a **\"common slut\"** (those are the only words I can remember from the entirety of the lecture) who brought (paraphrasing) \"dark times to the Mughal rule\". I felt so awkward hearing that kind of language in this day and age in a setting that's supposed to be inclusive. Should have talked to my gf then and just walked away. But I stayed. I hope the students in this auditorium similarly regretted staying through the lecture. Yes, because he can't say no right. Why is that guy invited to such conferences in the first place??? Nah, I’d have walked out. Fuck them. BAPS is notorious for slavery. Well you don't know what all shit gets invited to IITs, this is still a non-scientific body. Wrong with entire country? A developed country wouldn't have called a BAPS guy in the first place. Not really, Harrison Butker controversy proved otherwise. All the chapters of ICAI call some or the other BAPS person for their events. The yt is littered with it Are vo gay hoga .. usko ladke dekhne honge .. ky problem he yarr If the speaker had been Muslim then this would have been national news."
}