{
    "id": "10yrg48",
    "title": "Hint for why the South rightfully should continue to worry about Modi and his party?",
    "url": "https://www.reddit.com/r/india/comments/10yrg48/hint_for_why_the_south_rightfully_should_continue/",
    "selftext": "Probably crores of Indian citizens received a mail from the \"**Prime Minister's Office**\" &lt;[no-reply@sampark.gov.in](mailto:no-reply@sampark.gov.in)\\&gt;  today about 'Pariksha Pe Charcha in their own language'!\n\nAnd for Kannada and Telugu, names of the languages themselves are written incorrectly in the local script - a hint to how caring Modi and his party are towards non-Hindi languages?\n\nInb4 bhakts queue up to talk about intricacies with Indic script fonts, would an email from the PMO get sent with Hindi written as \"**ह‌​िन्​दी**\"?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/khktp83avcha1.jpg?width=1006&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=3f892aab66a1da4a651c9abd01399ba4912e3720",
    "flair": "Politics",
    "score": 15,
    "num_comments": 5,
    "created_utc": 1676034154,
    "convurl": "https://b.thumbs.redditmedia.com/GbZzQxINlk2UtMZ9slZMLqffnTHlgdY0kuFXeJqRHiw.jpg",
    "comments": [
        "Lol . Image not checking how the language is written in native script",
        "Also Kashmiri is largely written in the Nastaliq script.",
        "It’s actually ಕನ್ನಡ. Who writes these?? \nI didn’t even know what “Pariksha Pe Charcha” meant until one year of this program."
    ],
    "cleaned_text": "hint south rightfully continue worry modi party probably crores indian citizens received mail prime ministers office ltnoreplysamparkgovinmailtonoreplysamparkgovingt today pariksha pe charcha language kannada telugu names languages written incorrectly local script hint caring modi party towards nonhindi languages inb bhakts queue talk intricacies indic script fonts would email pmo get sent hindi written ampxb ",
    "cleaned_title": "hint south rightfully continue worry modi party",
    "cleaned_selftext": "probably crores indian citizens received mail prime ministers office ltnoreplysamparkgovinmailtonoreplysamparkgovingt today pariksha pe charcha language kannada telugu names languages written incorrectly local script hint caring modi party towards nonhindi languages inb bhakts queue talk intricacies indic script fonts would email pmo get sent hindi written ampxb",
    "cleaned_comments": "lol image checking language written native script also kashmiri largely written nastaliq script actually writes didnt even know pariksha pe charcha meant one year program",
    "light_cleaned_title": "Hint for why the South rightfully should continue to worry about Modi and his party?",
    "light_cleaned_selftext": "Probably crores of Indian citizens received a mail from the \"**Prime Minister's Office**\" &lt;[no-reply@sampark.gov.in](mailto:no-reply@sampark.gov.in)\\&gt; today about 'Pariksha Pe Charcha in their own language'! And for Kannada and Telugu, names of the languages themselves are written incorrectly in the local script - a hint to how caring Modi and his party are towards non-Hindi languages? Inb4 bhakts queue up to talk about intricacies with Indic script fonts, would an email from the PMO get sent with Hindi written as \"**ह‌​िन्​दी**\"?",
    "light_cleaned_comments": "Lol . Image not checking how the language is written in native script Also Kashmiri is largely written in the Nastaliq script. It’s actually ಕನ್ನಡ. Who writes these?? I didn’t even know what “Pariksha Pe Charcha” meant until one year of this program."
}