{
    "id": "15t7kdb",
    "title": "Jaipur-Mumbai Train incident | ‘He killed out of hatred’: RPF says delaying action will cause damage",
    "url": "https://indianexpress.com/article/cities/mumbai/jaipur-mumbai-train-killings-rpf-dismisses-constable-chetansinh-chaudhary-terming-his-act-a-heinous-crime-8895837/lite/",
    "selftext": "' The court observed that assistant sub-inspector Tika Ram Meena might have been killed by Chetan in a fit of rage, but it is well established that the remaining three innocent passengers were killed one by one, very selectively, out of hatred. '\n\nNo wonder he and many like him were constantly being exposed to hate speeches like\n\n\"Inke kapde se pehchaan ho jaati hai\"\n\n\"Desh ke gaddaro ko, goli maaro saalo ko \"",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1692232798.0,
    "convurl": "https://external-preview.redd.it/lZkHGW_dbne5S7THMw05lyD42qZ8IBY-5YsbYXUiSU4.jpg",
    "comments": [
        "When BJP will come into power next year again he will be out of jail and celebrated with garlands. He did what RSS and other right wing Hindu parties like Bajrang dal etc ..  have been preaching year after year. He did them proud. \nThere will be a definitely rise of Hindu terrorism in future whether BJP comes in power or not. The decade long poison they have been preaching have become part of Hindu ideology. India will never be same again."
    ],
    "cleaned_text": "jaipurmumbai train incident killed hatred rpf says delaying action cause damage court observed assistant subinspector tika ram meena might killed chetan fit rage well established remaining three innocent passengers killed one one selectively hatred wonder many like constantly exposed hate speeches like inke kapde se pehchaan ho jaati hai desh ke gaddaro ko goli maaro saalo ko ",
    "cleaned_title": "jaipurmumbai train incident killed hatred rpf says delaying action cause damage",
    "cleaned_selftext": "court observed assistant subinspector tika ram meena might killed chetan fit rage well established remaining three innocent passengers killed one one selectively hatred wonder many like constantly exposed hate speeches like inke kapde se pehchaan ho jaati hai desh ke gaddaro ko goli maaro saalo ko",
    "cleaned_comments": "bjp come power next year jail celebrated garlands rss right wing hindu parties like bajrang dal etc preaching year year proud definitely rise hindu terrorism future whether bjp comes power decade long poison preaching become part hindu ideology india never",
    "light_cleaned_title": "Jaipur-Mumbai Train incident | ‘He killed out of hatred’: RPF says delaying action will cause damage",
    "light_cleaned_selftext": "' The court observed that assistant sub-inspector Tika Ram Meena might have been killed by Chetan in a fit of rage, but it is well established that the remaining three innocent passengers were killed one by one, very selectively, out of hatred. ' No wonder he and many like him were constantly being exposed to hate speeches like \"Inke kapde se pehchaan ho jaati hai\" \"Desh ke gaddaro ko, goli maaro saalo ko \"",
    "light_cleaned_comments": "When BJP will come into power next year again he will be out of jail and celebrated with garlands. He did what RSS and other right wing Hindu parties like Bajrang dal etc .. have been preaching year after year. He did them proud. There will be a definitely rise of Hindu terrorism in future whether BJP comes in power or not. The decade long poison they have been preaching have become part of Hindu ideology. India will never be same again."
}