{
    "id": "1h71ki6",
    "title": "Delhi High Court to examine limits of free speech by social media influencers",
    "url": "https://www.barandbench.com/news/litigation/delhi-high-court-to-examine-limits-free-speech-social-media-influencers",
    "selftext": "Our courts a bunch of fucking clowns ",
    "flair": "Law & Courts",
    "score": 10,
    "num_comments": 3,
    "created_utc": 1733375304.0,
    "convurl": "https://external-preview.redd.it/g4clnWk3g9AzIZSkPoqLWI8v-NzIu76IiP13ncqa1_k.jpg?auto=webp&s=9f1215a0659e9fa8438bd636f49aa758c2f6f5af",
    "comments": [
        "What crap...i thought this must be something related to false claims or advertising or something. But this is about limiting free speech aka telling facts about products",
        "*reasonable limitations on free speech for the sake of public order, decency, morality, and other factors*\n\nWow. All to protect big companies who lie to their customers. Right now I am feeling very good that I've never had bournvita but I am now deeply suspicious about all the packaged foods in my pantry although I feel I've spent half my life reading labels off these jars",
        "No wonder.\n\nReasons:\n\n1. Sci-Hub case verdict \n\n2. ANI vs Wikipedia verdict"
    ],
    "cleaned_text": "delhi high court examine limits free speech social media influencers courts bunch fucking clowns ",
    "cleaned_title": "delhi high court examine limits free speech social media influencers",
    "cleaned_selftext": "courts bunch fucking clowns",
    "cleaned_comments": "crapi thought must something related false claims advertising something limiting free speech aka telling facts products reasonable limitations free speech sake public order decency morality factors wow protect big companies lie customers right feeling good ive never bournvita deeply suspicious packaged foods pantry although feel ive spent half life reading labels jars wonder reasons scihub case verdict ani vs wikipedia verdict",
    "light_cleaned_title": "Delhi High Court to examine limits of free speech by social media influencers",
    "light_cleaned_selftext": "Our courts a bunch of fucking clowns",
    "light_cleaned_comments": "What crap...i thought this must be something related to false claims or advertising or something. But this is about limiting free speech aka telling facts about products *reasonable limitations on free speech for the sake of public order, decency, morality, and other factors* Wow. All to protect big companies who lie to their customers. Right now I am feeling very good that I've never had bournvita but I am now deeply suspicious about all the packaged foods in my pantry although I feel I've spent half my life reading labels off these jars No wonder. Reasons: 1. Sci-Hub case verdict 2. ANI vs Wikipedia verdict"
}