{
    "id": "168vh6h",
    "title": "Prayagraj: 16 Y/O Satyam Beaten To Death For Opposing Sister's Harassment, Mohd Yusuf, Mohsin Among 5 Accused",
    "url": "https://www.reddit.com/r/india/comments/168vh6h/prayagraj_16_yo_satyam_beaten_to_death_for/",
    "selftext": "In Prayagraj, a 10th-grade student Satyam Sharma was brutally beaten to death by Muslim youths for opposing harassment of his sister. The assailants cornered him on the road and beat him relentlessly with a stick. No media no ravish no activists?\n\nhttps://swarajyamag.com/news-brief/prayagraj-16-yo-satyam-beaten-to-death-for-opposing-sisters-harassment-mohd-yusuf-mohsin-among-5-accused",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1693743301.0,
    "convurl": "https://external-preview.redd.it/fGoakugncRK_xoUKDdjY6871MzN4foJWslcDzzH1_KI.jpg?auto=webp&s=417bd1a03133d0657cd54f1d17bd0a7247f16a66",
    "comments": [
        "Don’t worry, they will be caught and jailed asap. How confident are you that same would be done if the religions were reversed?",
        "No activists are needed because:\n\n1) The Muslim culprits will be caught promptly by UP police.\n\n2) FIR will be promptly filed without the victim's parents having to run from pillar to post. FIR will be accurate without missing any important details.\n\n3) The FIR will include the appropriate IPC section charges rather than watered down.\n\n4) No Muslim organization, Dal, or Parishad will come and protest against their arrests.\n\n5) No Muslim civil society member will support them with comments like \"Ye darr accha he lolol\".",
        "Op..there are hundreds of such on stories either side. But your hate mongering ideology likes to focus on one side only.",
        "Op there are many such cases on either side. But maybe your hate filled ideology can focus only on the minority.",
        "And they should be tried in court and punished according to the law instead of sending bulldozers to their home and making their entire family homeless who have nothing to do with this crime.",
        "At least quote a credible media who does true journalism. The culprits as well as the perpetrators are not like Brijbhushan whose name is needed except if the intention is highlighting the difference of religions. These types of unacceptable crimes are being done in India irrespective of castes/religions.",
        "**\"He struggled in agony for about half an hour on the road. His sister, lying on the ground nearby, pleaded with everyone to save him, but people watched as mere spectators.\"**",
        "OP, if you want to say names as a hint hint wink wink, you should openly say \"Muslims arrested.\" Coz that seems to be the only point of your \"news.\"\n\nDumb rightwingers whipping up outrage trying to be \"subtle.\"",
        "[https://indianexpress.com/article/india/dalit-teenager-in-mp-beaten-to-death-by-men-accused-by-his-sister-of-harassment-8911089/](https://indianexpress.com/article/india/dalit-teenager-in-mp-beaten-to-death-by-men-accused-by-his-sister-of-harassment-8911089/)",
        "[https://news.abplive.com/videos/news/india-brother-to-death-while-standing-up-against-sister-s-eve-teasing-in-prayagraj-abp-news-1626182](https://news.abplive.com/videos/news/india-brother-to-death-while-standing-up-against-sister-s-eve-teasing-in-prayagraj-abp-news-1626182)",
        "Fucking hell"
    ],
    "cleaned_text": "prayagraj yo satyam beaten death opposing sisters harassment mohd yusuf mohsin among accused prayagraj thgrade student satyam sharma brutally beaten death muslim youths opposing harassment sister assailants cornered road beat relentlessly stick media ravish activists ",
    "cleaned_title": "prayagraj yo satyam beaten death opposing sisters harassment mohd yusuf mohsin among accused",
    "cleaned_selftext": "prayagraj thgrade student satyam sharma brutally beaten death muslim youths opposing harassment sister assailants cornered road beat relentlessly stick media ravish activists",
    "cleaned_comments": "dont worry caught jailed asap confident would done religions reversed activists needed muslim culprits caught promptly police fir promptly filed without victims parents run pillar post fir accurate without missing important details fir include appropriate ipc section charges rather watered muslim organization dal parishad come protest arrests muslim civil society member support comments like ye darr accha lolol opthere hundreds stories either side hate mongering ideology likes focus one side op many cases either side maybe hate filled ideology focus minority tried court punished according law instead sending bulldozers home making entire family homeless nothing crime least quote credible media true journalism culprits well perpetrators like brijbhushan whose name needed except intention highlighting difference religions types unacceptable crimes done india irrespective castesreligions struggled agony half hour road sister lying ground nearby pleaded everyone save people watched mere spectators op want say names hint hint wink wink openly say muslims arrested coz seems point news dumb rightwingers whipping outrage trying subtle httpsindianexpresscomarticleindiadalitteenagerinmpbeatentodeathbymenaccusedbyhissisterofharassmenthttpsindianexpresscomarticleindiadalitteenagerinmpbeatentodeathbymenaccusedbyhissisterofharassment httpsnewsabplivecomvideosnewsindiabrothertodeathwhilestandingupagainstsisterseveteasinginprayagrajabpnewshttpsnewsabplivecomvideosnewsindiabrothertodeathwhilestandingupagainstsisterseveteasinginprayagrajabpnews fucking hell",
    "light_cleaned_title": "Prayagraj: 16 Y/O Satyam Beaten To Death For Opposing Sister's Harassment, Mohd Yusuf, Mohsin Among 5 Accused",
    "light_cleaned_selftext": "In Prayagraj, a 10th-grade student Satyam Sharma was brutally beaten to death by Muslim youths for opposing harassment of his sister. The assailants cornered him on the road and beat him relentlessly with a stick. No media no ravish no activists?",
    "light_cleaned_comments": "Don’t worry, they will be caught and jailed asap. How confident are you that same would be done if the religions were reversed? No activists are needed because: 1) The Muslim culprits will be caught promptly by UP police. 2) FIR will be promptly filed without the victim's parents having to run from pillar to post. FIR will be accurate without missing any important details. 3) The FIR will include the appropriate IPC section charges rather than watered down. 4) No Muslim organization, Dal, or Parishad will come and protest against their arrests. 5) No Muslim civil society member will support them with comments like \"Ye darr accha he lolol\". Op..there are hundreds of such on stories either side. But your hate mongering ideology likes to focus on one side only. Op there are many such cases on either side. But maybe your hate filled ideology can focus only on the minority. And they should be tried in court and punished according to the law instead of sending bulldozers to their home and making their entire family homeless who have nothing to do with this crime. At least quote a credible media who does true journalism. The culprits as well as the perpetrators are not like Brijbhushan whose name is needed except if the intention is highlighting the difference of religions. These types of unacceptable crimes are being done in India irrespective of castes/religions. **\"He struggled in agony for about half an hour on the road. His sister, lying on the ground nearby, pleaded with everyone to save him, but people watched as mere spectators.\"** OP, if you want to say names as a hint hint wink wink, you should openly say \"Muslims arrested.\" Coz that seems to be the only point of your \"news.\" Dumb rightwingers whipping up outrage trying to be \"subtle.\" [https://indianexpress.com/article/india/dalit-teenager-in-mp-beaten-to-death-by-men-accused-by-his-sister-of-harassment-8911089/](https://indianexpress.com/article/india/dalit-teenager-in-mp-beaten-to-death-by-men-accused-by-his-sister-of-harassment-8911089/) [https://news.abplive.com/videos/news/india-brother-to-death-while-standing-up-against-sister-s-eve-teasing-in-prayagraj-abp-news-1626182](https://news.abplive.com/videos/news/india-brother-to-death-while-standing-up-against-sister-s-eve-teasing-in-prayagraj-abp-news-1626182) Fucking hell"
}