{
    "id": "14aslls",
    "title": "Muslim woman alleges railway staff asked her religion, served stale, unsanitary food",
    "url": "https://maktoobmedia.com/latest-news/muslim-woman-alleges-railway-staff-asked-her-religion-served-stale-unsanitary-food/",
    "selftext": "A Muslim family traveling on the Rajdhani Express from Panvel to Kozhikode on 9 June has alleged that they were subjected to Islamophobic treatment by railway staff.\n\nThe complainant, who has asked to remain anonymous, [said to MediaOne TV on Wednesday](https://youtu.be/NpWnpTjj4Nc) that the incident began when two members of railway staff asked her about her religion. After she confirmed that she was Muslim, the staff’s behavior towards her and her family became visibly different.\n\nThe complainant said that the staff members refused to provide them with a change of blanket, and that they were served stale and unsanitary food. She also alleged that the staff members tried to dissuade her from filing a formal complaint, saying that it would be “inconvenient” for them.\n\nShe said that the rest of the bogey she was travelling had received their breakfast except for them. Upon inquiry, the pantry staff responded by stating that their breakfast was delayed as it was “being specially prepared for them.” The complainant found that the breakfast they eventually received was stale and unfit for consumption.\n\nIt was when they got their lunch, which was also delayed, that confirmed their doubts that they were singled out in the bogey. Further examination of the food they received confirmed that it was seriously unclean. “The entire carriage looked at us when we opened the food. It smelt so bad,” she said.\n\nA video captured by the Muslim woman during the incident reveals the unsanitary condition of the food provided, along with an informal interrogation of the railway staff conducted by the railway police.\n\nAstonishingly, the staff member responsible for distributing the food admitted that it had been retrieved from the garbage.\n\nThe complainant then raises an important question, expressing, “What if we had suffered from severe food poisoning? It is true that we had vomited after we received our breakfast, but the damage could have been worse.”\n\nThe complainant’s allegations have sparked discussions about the importance of ensuring equal treatment and respect for passengers, regardless of their religious background.",
    "flair": "Crime",
    "score": 63,
    "num_comments": 9,
    "created_utc": 1686909075.0,
    "convurl": "https://external-preview.redd.it/eS5wqfZ3A18Vaz9yNiGtOMraTBprPAVFBEZFJvs_fPA.jpg?auto=webp&v=enabled&s=677b0572b78198cfd6489e4841c4aebbd2322399",
    "comments": [
        "Gobi hai to manchurian hai.",
        "All of these asshats will lose their jobs. Probably some North Indians if I have to guess",
        "It might be a Maharashtrian Chaddi. \n\nIn the past 12 months or so you can see the how radicalization has accelerated among the Maharashtrian BJP supporters.",
        "Sad",
        "Kerala too has Chaddis, except they aren't in election winning mode yet. The second highest in South after Karnataka.",
        "Amrit Kaal",
        "Nagpur is the headquarters of the terrorist organisation RSS so the support for them in Maharashtra is pretty long-standing.",
        ">Astonishingly, the staff member responsible for distributing the food admitted that it had been retrieved from the garbage.\n\nSala fatherchod Haraami log."
    ],
    "cleaned_text": "muslim woman alleges railway staff asked religion served stale unsanitary food muslim family traveling rajdhani express panvel kozhikode june alleged subjected islamophobic treatment railway staff complainant asked remain anonymous said mediaone tv wednesdayhttpsyoutubenpwnptjjnc incident began two members railway staff asked religion confirmed muslim staffs behavior towards family became visibly different complainant said staff members refused provide change blanket served stale unsanitary food also alleged staff members tried dissuade filing formal complaint saying would inconvenient said rest bogey travelling received breakfast except upon inquiry pantry staff responded stating breakfast delayed specially prepared complainant found breakfast eventually received stale unfit consumption got lunch also delayed confirmed doubts singled bogey examination food received confirmed seriously unclean entire carriage looked us opened food smelt bad said video captured muslim woman incident reveals unsanitary condition food provided along informal interrogation railway staff conducted railway police astonishingly staff member responsible distributing food admitted retrieved garbage complainant raises important question expressing suffered severe food poisoning true vomited received breakfast damage could worse complainants allegations sparked discussions importance ensuring equal treatment respect passengers regardless religious background ",
    "cleaned_title": "muslim woman alleges railway staff asked religion served stale unsanitary food",
    "cleaned_selftext": "muslim family traveling rajdhani express panvel kozhikode june alleged subjected islamophobic treatment railway staff complainant asked remain anonymous said mediaone tv wednesdayhttpsyoutubenpwnptjjnc incident began two members railway staff asked religion confirmed muslim staffs behavior towards family became visibly different complainant said staff members refused provide change blanket served stale unsanitary food also alleged staff members tried dissuade filing formal complaint saying would inconvenient said rest bogey travelling received breakfast except upon inquiry pantry staff responded stating breakfast delayed specially prepared complainant found breakfast eventually received stale unfit consumption got lunch also delayed confirmed doubts singled bogey examination food received confirmed seriously unclean entire carriage looked us opened food smelt bad said video captured muslim woman incident reveals unsanitary condition food provided along informal interrogation railway staff conducted railway police astonishingly staff member responsible distributing food admitted retrieved garbage complainant raises important question expressing suffered severe food poisoning true vomited received breakfast damage could worse complainants allegations sparked discussions importance ensuring equal treatment respect passengers regardless religious background",
    "cleaned_comments": "gobi hai manchurian hai asshats lose jobs probably north indians guess might maharashtrian chaddi past months see radicalization accelerated among maharashtrian bjp supporters sad kerala chaddis except arent election winning mode yet second highest south karnataka amrit kaal nagpur headquarters terrorist organisation rss support maharashtra pretty longstanding astonishingly staff member responsible distributing food admitted retrieved garbage sala fatherchod haraami log",
    "light_cleaned_title": "Muslim woman alleges railway staff asked her religion, served stale, unsanitary food",
    "light_cleaned_selftext": "A Muslim family traveling on the Rajdhani Express from Panvel to Kozhikode on 9 June has alleged that they were subjected to Islamophobic treatment by railway staff. The complainant, who has asked to remain anonymous, [said to MediaOne TV on Wednesday](https://youtu.be/NpWnpTjj4Nc) that the incident began when two members of railway staff asked her about her religion. After she confirmed that she was Muslim, the staff’s behavior towards her and her family became visibly different. The complainant said that the staff members refused to provide them with a change of blanket, and that they were served stale and unsanitary food. She also alleged that the staff members tried to dissuade her from filing a formal complaint, saying that it would be “inconvenient” for them. She said that the rest of the bogey she was travelling had received their breakfast except for them. Upon inquiry, the pantry staff responded by stating that their breakfast was delayed as it was “being specially prepared for them.” The complainant found that the breakfast they eventually received was stale and unfit for consumption. It was when they got their lunch, which was also delayed, that confirmed their doubts that they were singled out in the bogey. Further examination of the food they received confirmed that it was seriously unclean. “The entire carriage looked at us when we opened the food. It smelt so bad,” she said. A video captured by the Muslim woman during the incident reveals the unsanitary condition of the food provided, along with an informal interrogation of the railway staff conducted by the railway police. Astonishingly, the staff member responsible for distributing the food admitted that it had been retrieved from the garbage. The complainant then raises an important question, expressing, “What if we had suffered from severe food poisoning? It is true that we had vomited after we received our breakfast, but the damage could have been worse.” The complainant’s allegations have sparked discussions about the importance of ensuring equal treatment and respect for passengers, regardless of their religious background.",
    "light_cleaned_comments": "Gobi hai to manchurian hai. All of these asshats will lose their jobs. Probably some North Indians if I have to guess It might be a Maharashtrian Chaddi. In the past 12 months or so you can see the how radicalization has accelerated among the Maharashtrian BJP supporters. Sad Kerala too has Chaddis, except they aren't in election winning mode yet. The second highest in South after Karnataka. Amrit Kaal Nagpur is the headquarters of the terrorist organisation RSS so the support for them in Maharashtra is pretty long-standing. >Astonishingly, the staff member responsible for distributing the food admitted that it had been retrieved from the garbage. Sala fatherchod Haraami log."
}