{
    "id": "17l1n81",
    "title": "Any way I can stop these fraud requests?",
    "url": "https://i.redd.it/cazfd3349nxb1.jpg",
    "selftext": "\nI'm getting these messages so much lately. I don't know how to report them as we don't get any identifiers of who made the request except vendor. I think govt should start including some identifiers in the requests like this.",
    "flair": "Rant / Vent",
    "score": 423,
    "num_comments": 67,
    "created_utc": 1698804212.0,
    "convurl": "https://i.redd.it/cazfd3349nxb1.jpg",
    "comments": [
        "Probably due to the latest aadhar leak, aadhar can be used to get your vpa",
        "Does blocking your aadhar biometric works. ??",
        "I got similar thing a month ago.",
        "Disable your current VPA. \n\nDon't use phone number based VPA.\n\nCreate a new VPA which is hard to guess.\n\nI used to get a lot of these requests when my VPA was firstname@provider. Then I changed it to *firstname+random string* and the random requests stopped.\n\nAlso, you can disable BHIM app entirely and use Gpay or PhonePe. These companies have much better security than government run apps.",
        "How do you create new VPA/disable VPA",
        "Just open whichever app you're using and look around, it's not that difficult.",
        "Ok.",
        "Goes to show how little the general public gets enraged when major data breaches happen. Years ago, my email address got revealed in Big Basket data leak and I have been getting all kinds of spam ever since.",
        "1) Dont use government crap. \n2) Use GPay\n2) Change your VA. Mine is name+numbers@provider\n\nYours probably is phone@provider or name@provider.",
        ">Create a new VPA which is hard to guess.\n\nThanks for this, I also created a new VPA-ID for all my accounts.",
        "The breach attempts being carried out since Feb",
        ">Create a new VPA which is hard to guess.\n\nExcept Amazon pay, it creates its own UPI ID based on mobile number@apl,yabl etc",
        "Uninstall",
        "I hadn't noticed. Now I am going to disable Amazon Pay UPI. Haven't used it in ages anyway",
        "Change the upi ID..it will stop",
        "No. Why would it? UPI has nothing to do with Aadhar biometrics.\n\nBut you should lock adhaar biometrics anyways.",
        "As a banker , let me tell you few things \n1 please try to send only qr code to recive payment \n2 only tell your vpa to trusted people \n3 dont use your phone as vpa \nChange your vpa , upi pin every 60 days",
        "What is VA?",
        "For someone who has reversed BHIM application they have fairly decent security. A lot of logic in these UPI application lies in the NPCI library which they all use.",
        "Virtual address",
        "Damn these scamsters work fast",
        "How to permanently disable UPI as i want migrating from him app to paytm",
        "App should have option to disable",
        "THAT AIN'T A GODDAUMN REQUEST.\n\nIT'S A FUCKIN RANSOM",
        "How do you customize the VA? Mine is email@provider and there is no way I see to change it",
        "how do i do that? lock my adhaar biometric?",
        "I am able to create new VA, but thr format is the same. Email@provider, on gpay. Do you mind sharing a link which shows how to create customized ids?",
        "You taken any postpaid emi from Flipkart and they are asking you to payback?",
        "lol no, after hearing the experiences of people here I’m not even using flipkart. \n\nbut this happened to me few months ago, those requests come at midnight I don’t know why, it comes this way when you set upi in checkout. It means someone made a bill of 90k and kept payment method of my upi thinking I would accept unknowingly.\n\n govt should step in to solve this I’m sure so many people are being scammed like this as not many people know tech, like if the samething came to one of my family I’m sure they would be panicked and to know what’s going on, would have clicked on the notification",
        "This is not someone random, you have been most probably a victim of upi fraud, someone has misused your financial data and most probably have taken loan, my advice check your cibil report immediately\n\nAlso if you have any siblings or kids ek baar unko bhi khurak do may be they have done some adventure with your data.",
        "Gpay is biggest fraud, unnecessarily collecting location info for payments.",
        "Goto adhaar app and look for lock biometric option. Remember that whenever a Biometric KYC is required you need to unlock biometric for few minutes. Lock it again once KYC is done.",
        "Location information is made mandatory by the government btw.\n\nAlso google doesn't need your location from Gpay dude, you are using their search engine or phone or their browser. Almost all your apps sell your data.",
        "https://support.google.com/pay/india/answer/10434187?hl=en#zippy=%2Chow-does-an-additional-upi-id-work%2Chow-can-i-create-a-vpa-or-upi-id",
        "Actually Google Pay creates one by default for each of the bank accounts. I do not think it gives an option to customise the same.",
        "I tried this. My primary id is email@provider format. If I try to add ID, it takes the same format email@provider2. But I am not able to change email (first part of the UPI ID)",
        "You can create an alternative UPI ID on Amazon. On any payments your alternate ID shall be shown.",
        "Ok, I'll try, thanks",
        "No, I checked. You gave me a little heart attack. If loan or end is taken on my account I will get the message. The message in the original post is something I see everyday when putting order with upi payment. We need to confirm fir the money to be debited, moreover I don’t have that much in my account lol",
        "You can block such request or temporary force upi app so you won't open them by mistake. They will get tired and then you can open again.",
        "BHIM app doesn't ask for location",
        "https://preview.redd.it/hff9lcswpqxb1.jpeg?width=1004&format=pjpg&auto=webp&s=3a34688ad4d9fc70058201c6ae52781c40a8d83d",
        "lol, you don't even understand the issue here. Try paying keeping your location off. you won't be able to pay on Gpay. All other apps have not made it mandatory to keep location on for UPI payment. this is pure evil from google. God bless your naive soul.",
        "Maybe a not a great advice. But try not to link your main A/C with any payments app. Try to keep a different A/C and keep a min amount that you need to use.",
        "That’s actually a good advice thanks I will follow",
        "I advise you to either use a new UPI app or maintain a small amount in the account that is connected to your UPI app.",
        "I stand corrected but your comment is absolutely wrong. You can turn off location access.\n\n\nLocation access was made mandatory by the government.  But as of Dec 1 2022, the location access was made optional. \n\nGooglePay DOES WORK WITHOUT USER LOCATION ACCESS.",
        "Get an iphone.",
        "Indian govt is trash, they always make shit more complicated for public instead of fixing it.",
        "I don't know at present about Gpay as i had deleted it because of this mandatory location reason only. Having all information regarding location and payment leads to market capture and targeting customers for specific ads.",
        "https://uidai.gov.in/en/925-faqs/aadhaar-online-services/biometric-lock-unlock.html",
        "change upi id, disable old upi number and generate a new one.",
        "Until Dec 1 of 2022 it was mandatory. Now its opt in.\nAlthough I would recommend keeping it turned ON incase you need to dispute an unauthorized transfer.",
        "Paytm shows you where the UPI payment was done with location, gpay won't show that .\n\n\nAlso location permission on Android isn't just for location it's also for verifying wifi and nearby Bluetooth devices.",
        "For this very reason I've made a Paytm bank account.\n\nI use this for all online transactions and for other online payments.\nNever received a single scam on this.\n\n\nWhereas I've received a couple on gpay.",
        "Have you subscribed for any groceries or some recurring purchase item on Flipkart?\n\nWith  UPI auto-pay on?",
        "That scammer's prolly to desperate.",
        "Seriously I’m also received msg many times and calls also",
        "GPay doesn't seem to allow custom VPAs. It's based on the gmail ID.",
        "Old issue? I don't see it happening right now",
        "One more day, one more Flipkart fraudulent activity 😕",
        "Phonepe let's you customise",
        "This reply should be at the top",
        "This. Never have all your savings in an account with UPI enabled. Keep a separate account for savings. In your regular salary account have limited funds and use UPI on that.",
        "There are so many scams going on via UPI. I'd suggest to stop using UPI entirely and use credit cards instead. Atleast on credit card you can report fraud transactions and won't be liable to pay. Plus a good credit history is always beneficial to have.  If someone loots you via UPI, your money is gone for good! If you HAVE to use UPI anyway, use Google pay. Why do you want to use a government owned app 😅",
        "I never opted for making phone number - just needed to find me in UPI world.\nSaves a lot of trouble. Folks who know me can't pay me anything unless they ask my UPI ID.",
        "Fully explore and understand how to unlock biometrics if you lose your phone. No one explains this.",
        "So is there documentation available on the aadhar Website ?",
        "Already posted by u/shezadaa: https://uidai.gov.in/en/925-faqs/aadhaar-online-services/biometric-lock-unlock.html\n\nFor AEPS fraud prevention, better to delink bank account from Aadhar number rather than relying on locking biometrics. Banks have forms for those or just write an application.",
        "Would you mind elaborating on that? Do you mean that I should not have fixed deposits in an account where UPI is enabled? \n\nShould I make another bank account at the same bank where I keep only fixed deposits?\n\n so should I have one account only for FDs and another only for UPI and the UPI account is just a savings account with not much money in it?"
    ],
    "cleaned_text": "way stop fraud requests im getting messages much lately dont know report dont get identifiers made request except vendor think govt start including identifiers requests like ",
    "cleaned_title": "way stop fraud requests",
    "cleaned_selftext": "im getting messages much lately dont know report dont get identifiers made request except vendor think govt start including identifiers requests like",
    "cleaned_comments": "probably due latest aadhar leak aadhar used get vpa blocking aadhar biometric works got similar thing month ago disable current vpa dont use phone number based vpa create new vpa hard guess used get lot requests vpa firstnameprovider changed firstnamerandom string random requests stopped also disable bhim app entirely use gpay phonepe companies much better security government run apps create new vpadisable vpa open whichever app youre using look around difficult ok goes show little general public gets enraged major data breaches happen years ago email address got revealed big basket data leak getting kinds spam ever since dont use government crap use gpay change va mine namenumbersprovider probably phoneprovider nameprovider create new vpa hard guess thanks also created new vpaid accounts breach attempts carried since feb create new vpa hard guess except amazon pay creates upi id based mobile numberaplyabl etc uninstall hadnt noticed going disable amazon pay upi havent used ages anyway change upi idit stop would upi nothing aadhar biometrics lock adhaar biometrics anyways banker let tell things please try send qr code recive payment tell vpa trusted people dont use phone vpa change vpa upi pin every days va someone reversed bhim application fairly decent security lot logic upi application lies npci library use virtual address damn scamsters work fast permanently disable upi want migrating app paytm app option disable aint goddaumn request fuckin ransom customize va mine emailprovider way see change lock adhaar biometric able create new va thr format emailprovider gpay mind sharing link shows create customized ids taken postpaid emi flipkart asking payback lol hearing experiences people im even using flipkart happened months ago requests come midnight dont know comes way set upi checkout means someone made bill k kept payment method upi thinking would accept unknowingly govt step solve im sure many people scammed like many people know tech like samething came one family im sure would panicked know whats going would clicked notification someone random probably victim upi fraud someone misused financial data probably taken loan advice check cibil report immediately also siblings kids ek baar unko bhi khurak may done adventure data gpay biggest fraud unnecessarily collecting location info payments goto adhaar app look lock biometric option remember whenever biometric kyc required need unlock biometric minutes lock kyc done location information made mandatory government btw also google doesnt need location gpay dude using search engine phone browser almost apps sell data actually google pay creates one default bank accounts think gives option customise tried primary id emailprovider format try add id takes format emailprovider able change email first part upi id create alternative upi id amazon payments alternate id shall shown ok ill try thanks checked gave little heart attack loan end taken account get message message original post something see everyday putting order upi payment need confirm fir money debited moreover dont much account lol block request temporary force upi app wont open mistake get tired open bhim app doesnt ask location lol dont even understand issue try paying keeping location wont able pay gpay apps made mandatory keep location upi payment pure evil google god bless naive soul maybe great advice try link main ac payments app try keep different ac keep min amount need use thats actually good advice thanks follow advise either use new upi app maintain small amount account connected upi app stand corrected comment absolutely wrong turn location access location access made mandatory government dec location access made optional googlepay work without user location access get iphone indian govt trash always make shit complicated public instead fixing dont know present gpay deleted mandatory location reason information regarding location payment leads market capture targeting customers specific ads change upi id disable old upi number generate new one dec mandatory opt although would recommend keeping turned incase need dispute unauthorized transfer paytm shows upi payment done location gpay wont show also location permission android isnt location also verifying wifi nearby bluetooth devices reason ive made paytm bank account use online transactions online payments never received single scam whereas ive received couple gpay subscribed groceries recurring purchase item flipkart upi autopay scammers prolly desperate seriously im also received msg many times calls also gpay doesnt seem allow custom vpas based gmail id old issue dont see happening right one day one flipkart fraudulent activity phonepe lets customise reply top never savings account upi enabled keep separate account savings regular salary account limited funds use upi many scams going via upi id suggest stop using upi entirely use credit cards instead atleast credit card report fraud transactions wont liable pay plus good credit history always beneficial someone loots via upi money gone good use upi anyway use google pay want use government owned app never opted making phone number needed find upi world saves lot trouble folks know cant pay anything unless ask upi id fully explore understand unlock biometrics lose phone one explains documentation available aadhar website already posted ushezadaa aeps fraud prevention better delink bank account aadhar number rather relying locking biometrics banks forms write application would mind elaborating mean fixed deposits account upi enabled make another bank account bank keep fixed deposits one account fds another upi upi account savings account much money",
    "light_cleaned_title": "Any way I can stop these fraud requests?",
    "light_cleaned_selftext": "I'm getting these messages so much lately. I don't know how to report them as we don't get any identifiers of who made the request except vendor. I think govt should start including some identifiers in the requests like this.",
    "light_cleaned_comments": "Probably due to the latest aadhar leak, aadhar can be used to get your vpa Does blocking your aadhar biometric works. ?? I got similar thing a month ago. Disable your current VPA. Don't use phone number based VPA. Create a new VPA which is hard to guess. I used to get a lot of these requests when my VPA was firstname@provider. Then I changed it to *firstname+random string* and the random requests stopped. Also, you can disable BHIM app entirely and use Gpay or PhonePe. These companies have much better security than government run apps. How do you create new VPA/disable VPA Just open whichever app you're using and look around, it's not that difficult. Ok. Goes to show how little the general public gets enraged when major data breaches happen. Years ago, my email address got revealed in Big Basket data leak and I have been getting all kinds of spam ever since. 1) Dont use government crap. 2) Use GPay 2) Change your VA. Mine is name+numbers@provider Yours probably is phone@provider or name@provider. >Create a new VPA which is hard to guess. Thanks for this, I also created a new VPA-ID for all my accounts. The breach attempts being carried out since Feb >Create a new VPA which is hard to guess. Except Amazon pay, it creates its own UPI ID based on mobile number@apl,yabl etc Uninstall I hadn't noticed. Now I am going to disable Amazon Pay UPI. Haven't used it in ages anyway Change the upi ID..it will stop No. Why would it? UPI has nothing to do with Aadhar biometrics. But you should lock adhaar biometrics anyways. As a banker , let me tell you few things 1 please try to send only qr code to recive payment 2 only tell your vpa to trusted people 3 dont use your phone as vpa Change your vpa , upi pin every 60 days What is VA? For someone who has reversed BHIM application they have fairly decent security. A lot of logic in these UPI application lies in the NPCI library which they all use. Virtual address Damn these scamsters work fast How to permanently disable UPI as i want migrating from him app to paytm App should have option to disable THAT AIN'T A GODDAUMN REQUEST. IT'S A FUCKIN RANSOM How do you customize the VA? Mine is email@provider and there is no way I see to change it how do i do that? lock my adhaar biometric? I am able to create new VA, but thr format is the same. Email@provider, on gpay. Do you mind sharing a link which shows how to create customized ids? You taken any postpaid emi from Flipkart and they are asking you to payback? lol no, after hearing the experiences of people here I’m not even using flipkart. but this happened to me few months ago, those requests come at midnight I don’t know why, it comes this way when you set upi in checkout. It means someone made a bill of 90k and kept payment method of my upi thinking I would accept unknowingly. govt should step in to solve this I’m sure so many people are being scammed like this as not many people know tech, like if the samething came to one of my family I’m sure they would be panicked and to know what’s going on, would have clicked on the notification This is not someone random, you have been most probably a victim of upi fraud, someone has misused your financial data and most probably have taken loan, my advice check your cibil report immediately Also if you have any siblings or kids ek baar unko bhi khurak do may be they have done some adventure with your data. Gpay is biggest fraud, unnecessarily collecting location info for payments. Goto adhaar app and look for lock biometric option. Remember that whenever a Biometric KYC is required you need to unlock biometric for few minutes. Lock it again once KYC is done. Location information is made mandatory by the government btw. Also google doesn't need your location from Gpay dude, you are using their search engine or phone or their browser. Almost all your apps sell your data. Actually Google Pay creates one by default for each of the bank accounts. I do not think it gives an option to customise the same. I tried this. My primary id is email@provider format. If I try to add ID, it takes the same format email@provider2. But I am not able to change email (first part of the UPI ID) You can create an alternative UPI ID on Amazon. On any payments your alternate ID shall be shown. Ok, I'll try, thanks No, I checked. You gave me a little heart attack. If loan or end is taken on my account I will get the message. The message in the original post is something I see everyday when putting order with upi payment. We need to confirm fir the money to be debited, moreover I don’t have that much in my account lol You can block such request or temporary force upi app so you won't open them by mistake. They will get tired and then you can open again. BHIM app doesn't ask for location lol, you don't even understand the issue here. Try paying keeping your location off. you won't be able to pay on Gpay. All other apps have not made it mandatory to keep location on for UPI payment. this is pure evil from google. God bless your naive soul. Maybe a not a great advice. But try not to link your main A/C with any payments app. Try to keep a different A/C and keep a min amount that you need to use. That’s actually a good advice thanks I will follow I advise you to either use a new UPI app or maintain a small amount in the account that is connected to your UPI app. I stand corrected but your comment is absolutely wrong. You can turn off location access. Location access was made mandatory by the government. But as of Dec 1 2022, the location access was made optional. GooglePay DOES WORK WITHOUT USER LOCATION ACCESS. Get an iphone. Indian govt is trash, they always make shit more complicated for public instead of fixing it. I don't know at present about Gpay as i had deleted it because of this mandatory location reason only. Having all information regarding location and payment leads to market capture and targeting customers for specific ads. change upi id, disable old upi number and generate a new one. Until Dec 1 of 2022 it was mandatory. Now its opt in. Although I would recommend keeping it turned ON incase you need to dispute an unauthorized transfer. Paytm shows you where the UPI payment was done with location, gpay won't show that . Also location permission on Android isn't just for location it's also for verifying wifi and nearby Bluetooth devices. For this very reason I've made a Paytm bank account. I use this for all online transactions and for other online payments. Never received a single scam on this. Whereas I've received a couple on gpay. Have you subscribed for any groceries or some recurring purchase item on Flipkart? With UPI auto-pay on? That scammer's prolly to desperate. Seriously I’m also received msg many times and calls also GPay doesn't seem to allow custom VPAs. It's based on the gmail ID. Old issue? I don't see it happening right now One more day, one more Flipkart fraudulent activity 😕 Phonepe let's you customise This reply should be at the top This. Never have all your savings in an account with UPI enabled. Keep a separate account for savings. In your regular salary account have limited funds and use UPI on that. There are so many scams going on via UPI. I'd suggest to stop using UPI entirely and use credit cards instead. Atleast on credit card you can report fraud transactions and won't be liable to pay. Plus a good credit history is always beneficial to have. If someone loots you via UPI, your money is gone for good! If you HAVE to use UPI anyway, use Google pay. Why do you want to use a government owned app 😅 I never opted for making phone number - just needed to find me in UPI world. Saves a lot of trouble. Folks who know me can't pay me anything unless they ask my UPI ID. Fully explore and understand how to unlock biometrics if you lose your phone. No one explains this. So is there documentation available on the aadhar Website ? Already posted by u/shezadaa: For AEPS fraud prevention, better to delink bank account from Aadhar number rather than relying on locking biometrics. Banks have forms for those or just write an application. Would you mind elaborating on that? Do you mean that I should not have fixed deposits in an account where UPI is enabled? Should I make another bank account at the same bank where I keep only fixed deposits? so should I have one account only for FDs and another only for UPI and the UPI account is just a savings account with not much money in it?"
}