{
    "id": "1eijcsx",
    "title": "Meghalaya tightens migrant worker rules Increased penalties thorough antecedent checks - The Week",
    "url": "https://www.theweek.in/wire-updates/national/2024/08/02/cal24-mg-cabinet-labourers.html",
    "selftext": "The amendment increases the penalty for violations from Rs 5,000 to Rs 1 lakh and introduces a provision for simple imprisonment of up to three months for repeat offenders, he added.\n    A key component of the amendment is the implementation of a central database management system to check the antecedents of migrant workers, the minister said.\n    This system will allow the verification of criminal records, ensuring that only those without criminal backgrounds can join the workforce in Meghalaya. The labour department will coordinate with local police to ensure proper verification, he added.",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 0,
    "created_utc": 1722628073.0,
    "convurl": "https://external-preview.redd.it/hejSv0oybz5FS0tBpLwrj9Y2-g9-zmHS0YGfniJM6hI.jpg?auto=webp&s=0b0231a62482bf836af15ba191c2aa368a782df8",
    "comments": [],
    "cleaned_text": "meghalaya tightens migrant worker rules increased penalties thorough antecedent checks week amendment increases penalty violations rs rs lakh introduces provision simple imprisonment three months repeat offenders added key component amendment implementation central database management system check antecedents migrant workers minister said system allow verification criminal records ensuring without criminal backgrounds join workforce meghalaya labour department coordinate local police ensure proper verification added ",
    "cleaned_title": "meghalaya tightens migrant worker rules increased penalties thorough antecedent checks week",
    "cleaned_selftext": "amendment increases penalty violations rs rs lakh introduces provision simple imprisonment three months repeat offenders added key component amendment implementation central database management system check antecedents migrant workers minister said system allow verification criminal records ensuring without criminal backgrounds join workforce meghalaya labour department coordinate local police ensure proper verification added",
    "cleaned_comments": "",
    "light_cleaned_title": "Meghalaya tightens migrant worker rules Increased penalties thorough antecedent checks - The Week",
    "light_cleaned_selftext": "The amendment increases the penalty for violations from Rs 5,000 to Rs 1 lakh and introduces a provision for simple imprisonment of up to three months for repeat offenders, he added. A key component of the amendment is the implementation of a central database management system to check the antecedents of migrant workers, the minister said. This system will allow the verification of criminal records, ensuring that only those without criminal backgrounds can join the workforce in Meghalaya. The labour department will coordinate with local police to ensure proper verification, he added.",
    "light_cleaned_comments": ""
}