{
    "id": "nbbrwr",
    "title": "Indore Collector repeals provision banning COVID-19 content on social media on the basis of our representation",
    "url": "https://www.reddit.com/r/india/comments/nbbrwr/indore_collector_repeals_provision_banning/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/702dr9hhluy61.png?width=4800&amp;format=png&amp;auto=webp&amp;s=9f6bfcaabb45db6f968b95f98c2e9befd3266155\n\n### Tl;dr\n\nWe came across an [**Order**](https://drive.google.com/file/d/1aQMZesPtleqeS7QPuSeBvqfc0kDcc16H/view?usp=sharing) issued by the Collector for the district of Indore, Madhya Pradesh under Section 144(1) of Code of Criminal Procedure, 1973 (**CrPC**). The Order under paragraph 7 prohibited “comments made on Social Media platforms related to breaking of Corona transmission chain in an unrestrained manner” and threatened prosecution for non-compliance.  We filed an [**application**](https://drive.google.com/file/d/1a_xhE5TYqbTslOdT7exwQA8jSbAfiU2z/view?usp=sharing) under Section 144(5) of CrPC to the Collector seeking withdrawal of this overbroad Order given that it stifles freedom of speech over the internet. Today, in a major victory for constitutional values and free speech in the pandemic, the Collector, Indore issued another order under S.144(6) CrPC repealing paragraph 7 of the previous order, and replacing it with clearer and more specific language, limiting the prohibition only to \"messages or posts on social media that pose a danger to public peace, law and order, and health of the public, and which violate existing covid protocols”\n\n### Background\n\nOver the past two months, the country has been experiencing a rapid surge in COVID-19 cases. It has been a difficult time for everyone and it has been distressing to see that the Central and State Governments have been busy ordering social media posts to be taken down - including those posts which seek help on social media platforms. On April 23, 2021, at the behest of the Central Government, Twitter [**blocked**](https://www.medianama.com/2021/04/223-twitter-mp-minister-censor/) over 50 tweets from politicians (including those of a sitting Member of Parliament and a state minister), filmmakers, actors and others critical of the Government’s handling of the pandemic. In response to the clampdown on social media, the Supreme Court, in its [**order**](https://www.livelaw.in/pdf_upload/in-re-distribution-of-essential-supplies-and-services-during-pandemic-april-30-392778.pdf) dated April 30, 2021 in ***Suo Moto Writ Petition (Civil) No. 3 of 2021***, directed the Central Government and State Governments to “*ensure that they immediately cease any direct or indirect threats of prosecution and arrest to citizens who air grievances or those that are attempting to help fellow citizens receive medical aid”.* (Paragraph 61)\n\nWe released a [**statement**](https://twitter.com/internetfreedom/status/1386177547294044164) condemning social media censorship and also created video explainers ([**here**](https://www.youtube.com/watch?v=8qa8_NtZZYc) and [**here**](https://www.youtube.com/watch?v=GuE39la75Lk&amp;t=196s)) discussing the legality of prosecuting individuals for their activities on social media.\n\n### Our May 10 Representation to Collector, Indore\n\nIn this background, we came across [**the Order**](https://drive.google.com/file/d/1aQMZesPtleqeS7QPuSeBvqfc0kDcc16H/view?usp=sharing) (an English version of the Order follows the original Order) issued by the Collector of the district of Indore, Madhya Pradesh under Section 144(1) of the Code of Criminal Procedure, 1973 (**CrPC**) dated April 20, 2021.  The Order imposed a range of directions to tackle the spread of COVID-19. We were particularly concerned with Paragraph 7 of the Order which stated -\n\n“*7. That the restriction is imposed on the comments made on Social Media platform related to breaking of Corona transmission chain in an unrestrained manner and if any such post will be forwarded/extended forward on social media, then the proceedings will be initiated for violation of The Epidemic Disease Act, 1897, National Disaster Management Act, 2005 and violation of this Order*…”\n\nWe filed an application under Section 144(5) of the CrPC before the Collector, Indore stating the following:\n\n1. **The order is overbroad**: The order prohibits commenting, in an unrestrained manner, on the efforts to tackle COVID-19. ‘Unrestrained manner’ or अनर्गल रूप is a vague, overbroad, and arbitrary standard which is unrecognised in law. By failing to define the ambit clearly, the Order restricts the freedom of speech, and violates the directions of the Supreme Court in *Shreya Singhal v. Union of India,* (2015) 5 SCC 1.\n2. **The order has a chilling effect on speech:** Individuals in Indore will choose not to express themselves for fear of being prosecuted under this overbroad restriction. As a result of this, information such as those related to availability of life-saving resources may be culled from the public discourse. Thus, the Order violates the right to freedom of speech and expression guaranteed under Article 19(1)(a) of the Constitution.\n3. **The order is an irregular exercise of the power conferred by Section 144(1), CrPC:** [**Section 144(1)**](https://indiankanoon.org/doc/930621/) confers upon magistrates the power to impose directions to prevent danger to human life. However, Section 144(1) also requires magistrates to provide material facts based upon which such directions are imposed. The order does not refer to any material which would suggest that the comments on social media have adversely affected the public at large or the battle against COVID-19.\n4. **The order does not comply with the directions of the Supreme Court’s decision in** ***Anuradha Bhasin vs Union of India,*** **(2020) 3 SCC 637:** The Order does not employ the least intrusive measure as it disproportionately curbs speech which is otherwise permissible and threatens prosecution, as required by the directions of the Supreme Court in *Anuradha Bhasin*.\n5. **The order is contrary to observations of the Supreme Court in Suo Motu Writ Petition (Civil) No. 3 of 2021:** The Supreme Court on April 30, 2021 [**directed**](https://www.livelaw.in/pdf_upload/in-re-distribution-of-essential-supplies-and-services-during-pandemic-april-30-392778.pdf) governments to cease any threats of prosecution against citizens who air their grievances on social media (Paragraph 61). Additionally, the Supreme Court also observed that clamping down on the sharing of information pertaining to COVID-19 by private persons is against the interest of the nation and without such information, it is possible that COVID-19 may turn into a tragedy worse that what it already is (Paragraph 63). Comments on the efforts to tackle COVID-19 ensure that the public at large is made aware of any lacunae in the ongoing battle and thus, the administration in turn is able to address those lacunae. The Order, however, prevents individuals from making such *bona fide* comments because of fear of prosecution and thus has the propensity to adversely impact the battle against COVID-19.\n\nAccordingly, we called upon the Collector, Indore to\n\n* Rescind the order under Section 144(5) of the CrPC by appropriately modifying Paragraph 7 therein; and\n* Publish the rescission order on the website of the district administration (http:/indore.nic.in/).\n\n### A welcome reply from the Collector!\n\nToday, the Collector, Indore issued another [**order**](https://drive.google.com/file/d/189uCsbgyMC_Pdzm8gYxacb2pQlffXCNq/view?usp=sharing) (the translated version follows the order) under Section 144(6) CrPC, in response to our application under Section 144(5) CrPC. In the revised order, the Collector, Indore referred to our representation to him dated May 10, 2021 and stated that on the basis of IFF’s representation, paragraph 7 of the previous S.144 order is hereby repealed, and replaced with the following paragraph (translated from Hindi):\n\n*\"That such messages or posts, posted on Social Media which present danger towards public peace, law and order and health of the general public at large and which become the reason for violation of prevailing Covid Protocol, will remain restrained”*.\n\nThis is a major victory for the constitutional rights of all residents of Indore, since the revised order is clearer, more specific and limited in its scope only to issues of law and order and the health of the public, whereas the previous order prohibited any and all comments made in an “unrestrained manner” in relation to Covid-19. The revised order has removed vague and arbitrary phrases such as “provoking the public” and “unrestrained commenting”.\n\nNotably, the revised order also removes the threat of prosecution under the Epidemic Disease Act, 1897 and the National Disaster Management Act, 2005, as was contained in paragraph 7 of the previous order. The direction to group admins to immediately expel group members for “posting wrong messages” has also been removed.\n\nThe revised order has not yet been uploaded to the official website of the administration of the Indore district. We will update you once it is.\n\nWe are grateful to the Collector, Indore for his swift action to ensure that measures to tackle Covid-19 do not violate or compromise the fundamental rights of the residents of Indore. This will allow us not only to use social media to coordinate vital help and assistance to patients, but also to exercise our constitutional right to express our views and opinions on all matters relating to the ongoing pandemic, including the government’s response to it.  \n\nWe also call upon our community to share similar orders that may violate your fundamental right of speech online from your home districts with us.\n\n### Important Documents\n\n1. Order dated May 12, 2021 issued by Collector, Indore replacing paragraph 7 of the previous order under S. 144(1) CrPC ([**link**](https://drive.google.com/file/d/1z3MXwt66qtS1QsFvOQ1YJZUKchEGSVWR/view?usp=sharing))\n2. Application under Section 144(5), CrPC addressed to Collector, Indore dated  May 10, 2021 ([**link**](https://drive.google.com/file/d/1a_xhE5TYqbTslOdT7exwQA8jSbAfiU2z/view?usp=sharing))\n3. Order issued by the Collector, District of Indore under Section 144(1) CrPC dated April 20, 2021 ([**link**](https://drive.google.com/file/d/1aQMZesPtleqeS7QPuSeBvqfc0kDcc16H/view?usp=sharing))\n4. Supreme Court order in Suo Moto Writ Petition (Civil) No. 3 of 2021 dated April 30, 2021 ([**link**](https://www.livelaw.in/pdf_upload/in-re-distribution-of-essential-supplies-and-services-during-pandemic-april-30-392778.pdf))\n5. IFF’s statement condemning social media censorship of posts seeking or providing COVID-19 relief April 25, 2021  ([**link**](https://twitter.com/internetfreedom/status/1386177547294044164))\n6. IFF’s video discussing the legality of orders taking down COVID-19 relief work dated April 26, 2021 ([**link**](https://www.youtube.com/watch?v=8qa8_NtZZYc))\n7. IFF’s video discussing the liability of WhatsApp group administrators for content posted by others dated May 5, 2021 ([**link**](https://www.youtube.com/watch?v=GuE39la75Lk&amp;t=196s))",
    "flair": "Policy/Economy",
    "score": 73,
    "num_comments": 4,
    "created_utc": 1620894350,
    "convurl": "https://b.thumbs.redditmedia.com/CoK2cVObkRd_gcTnYQetfcMcA4ojY8_7frhFDIgKkqk.jpg",
    "comments": [
        "You guys rock. Kudos to you folks!",
        "Please whoever can afford it and willing please [donate](https://internetfreedom.in/donate/) to this foundation. We need free internet and these guys have the tools necessary to make it an organized movement.\n\nMost authoritative system of governance are a product of accute human suffering, like this pandemic.",
        "Thank you, we appreciate it and require all the help we can get! We are funded by regular Indians, and maintain complete transparency so that we can continue holding the people in power accountable.",
        "Thank you!"
    ],
    "cleaned_text": "indore collector repeals provision banning covid content social media basis representation ampxb tldr came across orderhttpsdrivegooglecomfiledaqmzesptleqesqpusebvqfckdcchviewuspsharing issued collector district indore madhya pradesh section code criminal procedure crpc order paragraph prohibited comments made social media platforms related breaking corona transmission chain unrestrained manner threatened prosecution noncompliance filed applicationhttpsdrivegooglecomfiledaxhetyqbtslodtexwqajsbafiuzviewuspsharing section crpc collector seeking withdrawal overbroad order given stifles freedom speech internet today major victory constitutional values free speech pandemic collector indore issued another order crpc repealing paragraph previous order replacing clearer specific language limiting prohibition messages posts social media pose danger public peace law order health public violate existing covid protocols background past two months country experiencing rapid surge covid cases difficult time everyone distressing see central state governments busy ordering social media posts taken including posts seek help social media platforms april behest central government twitter blockedhttpswwwmedianamacomtwittermpministercensor tweets politicians including sitting member parliament state minister filmmakers actors others critical governments handling pandemic response clampdown social media supreme court orderhttpswwwlivelawinpdfuploadinredistributionofessentialsuppliesandservicesduringpandemicaprilpdf dated april suo moto writ petition civil directed central government state governments ensure immediately cease direct indirect threats prosecution arrest citizens air grievances attempting help fellow citizens receive medical aid paragraph released statementhttpstwittercominternetfreedomstatus condemning social media censorship also created video explainers herehttpswwwyoutubecomwatchvqantzzyc herehttpswwwyoutubecomwatchvguelalkampts discussing legality prosecuting individuals activities social media may representation collector indore background came across orderhttpsdrivegooglecomfiledaqmzesptleqesqpusebvqfckdcchviewuspsharing english version order follows original order issued collector district indore madhya pradesh section code criminal procedure crpc dated april order imposed range directions tackle spread covid particularly concerned paragraph order stated restriction imposed comments made social media platform related breaking corona transmission chain unrestrained manner post forwardedextended forward social media proceedings initiated violation epidemic disease act national disaster management act violation order filed application section crpc collector indore stating following order overbroad order prohibits commenting unrestrained manner efforts tackle covid unrestrained manner vague overbroad arbitrary standard unrecognised law failing define ambit clearly order restricts freedom speech violates directions supreme court shreya singhal v union india scc order chilling effect speech individuals indore choose express fear prosecuted overbroad restriction result information related availability lifesaving resources may culled public discourse thus order violates right freedom speech expression guaranteed article constitution order irregular exercise power conferred section crpc section httpsindiankanoonorgdoc confers upon magistrates power impose directions prevent danger human life however section also requires magistrates provide material facts based upon directions imposed order refer material would suggest comments social media adversely affected public large battle covid order comply directions supreme courts decision anuradha bhasin vs union india scc order employ least intrusive measure disproportionately curbs speech otherwise permissible threatens prosecution required directions supreme court anuradha bhasin order contrary observations supreme court suo motu writ petition civil supreme court april directedhttpswwwlivelawinpdfuploadinredistributionofessentialsuppliesandservicesduringpandemicaprilpdf governments cease threats prosecution citizens air grievances social media paragraph additionally supreme court also observed clamping sharing information pertaining covid private persons interest nation without information possible covid may turn tragedy worse already paragraph comments efforts tackle covid ensure public large made aware lacunae ongoing battle thus administration turn able address lacunae order however prevents individuals making bona fide comments fear prosecution thus propensity adversely impact battle covid accordingly called upon collector indore rescind order section crpc appropriately modifying paragraph therein publish rescission order website district administration httpindorenicin welcome reply collector today collector indore issued another orderhttpsdrivegooglecomfileducsbgymcpdzmgyxacbpqlffxcnqviewuspsharing translated version follows order section crpc response application section crpc revised order collector indore referred representation dated may stated basis iffs representation paragraph previous order hereby repealed replaced following paragraph translated hindi messages posts posted social media present danger towards public peace law order health general public large become reason violation prevailing covid protocol remain restrained major victory constitutional rights residents indore since revised order clearer specific limited scope issues law order health public whereas previous order prohibited comments made unrestrained manner relation covid revised order removed vague arbitrary phrases provoking public unrestrained commenting notably revised order also removes threat prosecution epidemic disease act national disaster management act contained paragraph previous order direction group admins immediately expel group members posting wrong messages also removed revised order yet uploaded official website administration indore district update grateful collector indore swift action ensure measures tackle covid violate compromise fundamental rights residents indore allow us use social media coordinate vital help assistance patients also exercise constitutional right express views opinions matters relating ongoing pandemic including governments response also call upon community share similar orders may violate fundamental right speech online home districts us important documents order dated may issued collector indore replacing paragraph previous order crpc linkhttpsdrivegooglecomfiledzmxwtqtsqsfvoqyjzukchegsvwrviewuspsharing application section crpc addressed collector indore dated may linkhttpsdrivegooglecomfiledaxhetyqbtslodtexwqajsbafiuzviewuspsharing order issued collector district indore section crpc dated april linkhttpsdrivegooglecomfiledaqmzesptleqesqpusebvqfckdcchviewuspsharing supreme court order suo moto writ petition civil dated april linkhttpswwwlivelawinpdfuploadinredistributionofessentialsuppliesandservicesduringpandemicaprilpdf iffs statement condemning social media censorship posts seeking providing covid relief april linkhttpstwittercominternetfreedomstatus iffs video discussing legality orders taking covid relief work dated april linkhttpswwwyoutubecomwatchvqantzzyc iffs video discussing liability whatsapp group administrators content posted others dated may linkhttpswwwyoutubecomwatchvguelalkampts ",
    "cleaned_title": "indore collector repeals provision banning covid content social media basis representation",
    "cleaned_selftext": "ampxb tldr came across orderhttpsdrivegooglecomfiledaqmzesptleqesqpusebvqfckdcchviewuspsharing issued collector district indore madhya pradesh section code criminal procedure crpc order paragraph prohibited comments made social media platforms related breaking corona transmission chain unrestrained manner threatened prosecution noncompliance filed applicationhttpsdrivegooglecomfiledaxhetyqbtslodtexwqajsbafiuzviewuspsharing section crpc collector seeking withdrawal overbroad order given stifles freedom speech internet today major victory constitutional values free speech pandemic collector indore issued another order crpc repealing paragraph previous order replacing clearer specific language limiting prohibition messages posts social media pose danger public peace law order health public violate existing covid protocols background past two months country experiencing rapid surge covid cases difficult time everyone distressing see central state governments busy ordering social media posts taken including posts seek help social media platforms april behest central government twitter blockedhttpswwwmedianamacomtwittermpministercensor tweets politicians including sitting member parliament state minister filmmakers actors others critical governments handling pandemic response clampdown social media supreme court orderhttpswwwlivelawinpdfuploadinredistributionofessentialsuppliesandservicesduringpandemicaprilpdf dated april suo moto writ petition civil directed central government state governments ensure immediately cease direct indirect threats prosecution arrest citizens air grievances attempting help fellow citizens receive medical aid paragraph released statementhttpstwittercominternetfreedomstatus condemning social media censorship also created video explainers herehttpswwwyoutubecomwatchvqantzzyc herehttpswwwyoutubecomwatchvguelalkampts discussing legality prosecuting individuals activities social media may representation collector indore background came across orderhttpsdrivegooglecomfiledaqmzesptleqesqpusebvqfckdcchviewuspsharing english version order follows original order issued collector district indore madhya pradesh section code criminal procedure crpc dated april order imposed range directions tackle spread covid particularly concerned paragraph order stated restriction imposed comments made social media platform related breaking corona transmission chain unrestrained manner post forwardedextended forward social media proceedings initiated violation epidemic disease act national disaster management act violation order filed application section crpc collector indore stating following order overbroad order prohibits commenting unrestrained manner efforts tackle covid unrestrained manner vague overbroad arbitrary standard unrecognised law failing define ambit clearly order restricts freedom speech violates directions supreme court shreya singhal v union india scc order chilling effect speech individuals indore choose express fear prosecuted overbroad restriction result information related availability lifesaving resources may culled public discourse thus order violates right freedom speech expression guaranteed article constitution order irregular exercise power conferred section crpc section httpsindiankanoonorgdoc confers upon magistrates power impose directions prevent danger human life however section also requires magistrates provide material facts based upon directions imposed order refer material would suggest comments social media adversely affected public large battle covid order comply directions supreme courts decision anuradha bhasin vs union india scc order employ least intrusive measure disproportionately curbs speech otherwise permissible threatens prosecution required directions supreme court anuradha bhasin order contrary observations supreme court suo motu writ petition civil supreme court april directedhttpswwwlivelawinpdfuploadinredistributionofessentialsuppliesandservicesduringpandemicaprilpdf governments cease threats prosecution citizens air grievances social media paragraph additionally supreme court also observed clamping sharing information pertaining covid private persons interest nation without information possible covid may turn tragedy worse already paragraph comments efforts tackle covid ensure public large made aware lacunae ongoing battle thus administration turn able address lacunae order however prevents individuals making bona fide comments fear prosecution thus propensity adversely impact battle covid accordingly called upon collector indore rescind order section crpc appropriately modifying paragraph therein publish rescission order website district administration httpindorenicin welcome reply collector today collector indore issued another orderhttpsdrivegooglecomfileducsbgymcpdzmgyxacbpqlffxcnqviewuspsharing translated version follows order section crpc response application section crpc revised order collector indore referred representation dated may stated basis iffs representation paragraph previous order hereby repealed replaced following paragraph translated hindi messages posts posted social media present danger towards public peace law order health general public large become reason violation prevailing covid protocol remain restrained major victory constitutional rights residents indore since revised order clearer specific limited scope issues law order health public whereas previous order prohibited comments made unrestrained manner relation covid revised order removed vague arbitrary phrases provoking public unrestrained commenting notably revised order also removes threat prosecution epidemic disease act national disaster management act contained paragraph previous order direction group admins immediately expel group members posting wrong messages also removed revised order yet uploaded official website administration indore district update grateful collector indore swift action ensure measures tackle covid violate compromise fundamental rights residents indore allow us use social media coordinate vital help assistance patients also exercise constitutional right express views opinions matters relating ongoing pandemic including governments response also call upon community share similar orders may violate fundamental right speech online home districts us important documents order dated may issued collector indore replacing paragraph previous order crpc linkhttpsdrivegooglecomfiledzmxwtqtsqsfvoqyjzukchegsvwrviewuspsharing application section crpc addressed collector indore dated may linkhttpsdrivegooglecomfiledaxhetyqbtslodtexwqajsbafiuzviewuspsharing order issued collector district indore section crpc dated april linkhttpsdrivegooglecomfiledaqmzesptleqesqpusebvqfckdcchviewuspsharing supreme court order suo moto writ petition civil dated april linkhttpswwwlivelawinpdfuploadinredistributionofessentialsuppliesandservicesduringpandemicaprilpdf iffs statement condemning social media censorship posts seeking providing covid relief april linkhttpstwittercominternetfreedomstatus iffs video discussing legality orders taking covid relief work dated april linkhttpswwwyoutubecomwatchvqantzzyc iffs video discussing liability whatsapp group administrators content posted others dated may linkhttpswwwyoutubecomwatchvguelalkampts",
    "cleaned_comments": "guys rock kudos folks please whoever afford willing please donatehttpsinternetfreedomindonate foundation need free internet guys tools necessary make organized movement authoritative system governance product accute human suffering like pandemic thank appreciate require help get funded regular indians maintain complete transparency continue holding people power accountable thank",
    "light_cleaned_title": "Indore Collector repeals provision banning COVID-19 content on social media on the basis of our representation",
    "light_cleaned_selftext": "### Tl;dr We came across an [**Order**](https://drive.google.com/file/d/1aQMZesPtleqeS7QPuSeBvqfc0kDcc16H/view?usp=sharing) issued by the Collector for the district of Indore, Madhya Pradesh under Section 144(1) of Code of Criminal Procedure, 1973 (**CrPC**). The Order under paragraph 7 prohibited “comments made on Social Media platforms related to breaking of Corona transmission chain in an unrestrained manner” and threatened prosecution for non-compliance. We filed an [**application**](https://drive.google.com/file/d/1a_xhE5TYqbTslOdT7exwQA8jSbAfiU2z/view?usp=sharing) under Section 144(5) of CrPC to the Collector seeking withdrawal of this overbroad Order given that it stifles freedom of speech over the internet. Today, in a major victory for constitutional values and free speech in the pandemic, the Collector, Indore issued another order under S.144(6) CrPC repealing paragraph 7 of the previous order, and replacing it with clearer and more specific language, limiting the prohibition only to \"messages or posts on social media that pose a danger to public peace, law and order, and health of the public, and which violate existing covid protocols” ### Background Over the past two months, the country has been experiencing a rapid surge in COVID-19 cases. It has been a difficult time for everyone and it has been distressing to see that the Central and State Governments have been busy ordering social media posts to be taken down - including those posts which seek help on social media platforms. On April 23, 2021, at the behest of the Central Government, Twitter [**blocked**](https://www.medianama.com/2021/04/223-twitter-mp-minister-censor/) over 50 tweets from politicians (including those of a sitting Member of Parliament and a state minister), filmmakers, actors and others critical of the Government’s handling of the pandemic. In response to the clampdown on social media, the Supreme Court, in its [**order**](https://www.livelaw.in/pdf_upload/in-re-distribution-of-essential-supplies-and-services-during-pandemic-april-30-392778.pdf) dated April 30, 2021 in ***Suo Moto Writ Petition (Civil) No. 3 of 2021***, directed the Central Government and State Governments to “*ensure that they immediately cease any direct or indirect threats of prosecution and arrest to citizens who air grievances or those that are attempting to help fellow citizens receive medical aid”.* (Paragraph 61) We released a [**statement**](https://twitter.com/internetfreedom/status/1386177547294044164) condemning social media censorship and also created video explainers ([**here**](https://www.youtube.com/watch?v=8qa8_NtZZYc) and [**here**](https://www.youtube.com/watch?v=GuE39la75Lk&amp;t=196s)) discussing the legality of prosecuting individuals for their activities on social media. ### Our May 10 Representation to Collector, Indore In this background, we came across [**the Order**](https://drive.google.com/file/d/1aQMZesPtleqeS7QPuSeBvqfc0kDcc16H/view?usp=sharing) (an English version of the Order follows the original Order) issued by the Collector of the district of Indore, Madhya Pradesh under Section 144(1) of the Code of Criminal Procedure, 1973 (**CrPC**) dated April 20, 2021. The Order imposed a range of directions to tackle the spread of COVID-19. We were particularly concerned with Paragraph 7 of the Order which stated - “*7. That the restriction is imposed on the comments made on Social Media platform related to breaking of Corona transmission chain in an unrestrained manner and if any such post will be forwarded/extended forward on social media, then the proceedings will be initiated for violation of The Epidemic Disease Act, 1897, National Disaster Management Act, 2005 and violation of this Order*…” We filed an application under Section 144(5) of the CrPC before the Collector, Indore stating the following: 1. **The order is overbroad**: The order prohibits commenting, in an unrestrained manner, on the efforts to tackle COVID-19. ‘Unrestrained manner’ or अनर्गल रूप is a vague, overbroad, and arbitrary standard which is unrecognised in law. By failing to define the ambit clearly, the Order restricts the freedom of speech, and violates the directions of the Supreme Court in *Shreya Singhal v. Union of India,* (2015) 5 SCC 1. 2. **The order has a chilling effect on speech:** Individuals in Indore will choose not to express themselves for fear of being prosecuted under this overbroad restriction. As a result of this, information such as those related to availability of life-saving resources may be culled from the public discourse. Thus, the Order violates the right to freedom of speech and expression guaranteed under Article 19(1)(a) of the Constitution. 3. **The order is an irregular exercise of the power conferred by Section 144(1), CrPC:** [**Section 144(1)**](https://indiankanoon.org/doc/930621/) confers upon magistrates the power to impose directions to prevent danger to human life. However, Section 144(1) also requires magistrates to provide material facts based upon which such directions are imposed. The order does not refer to any material which would suggest that the comments on social media have adversely affected the public at large or the battle against COVID-19. 4. **The order does not comply with the directions of the Supreme Court’s decision in** ***Anuradha Bhasin vs Union of India,*** **(2020) 3 SCC 637:** The Order does not employ the least intrusive measure as it disproportionately curbs speech which is otherwise permissible and threatens prosecution, as required by the directions of the Supreme Court in *Anuradha Bhasin*. 5. **The order is contrary to observations of the Supreme Court in Suo Motu Writ Petition (Civil) No. 3 of 2021:** The Supreme Court on April 30, 2021 [**directed**](https://www.livelaw.in/pdf_upload/in-re-distribution-of-essential-supplies-and-services-during-pandemic-april-30-392778.pdf) governments to cease any threats of prosecution against citizens who air their grievances on social media (Paragraph 61). Additionally, the Supreme Court also observed that clamping down on the sharing of information pertaining to COVID-19 by private persons is against the interest of the nation and without such information, it is possible that COVID-19 may turn into a tragedy worse that what it already is (Paragraph 63). Comments on the efforts to tackle COVID-19 ensure that the public at large is made aware of any lacunae in the ongoing battle and thus, the administration in turn is able to address those lacunae. The Order, however, prevents individuals from making such *bona fide* comments because of fear of prosecution and thus has the propensity to adversely impact the battle against COVID-19. Accordingly, we called upon the Collector, Indore to * Rescind the order under Section 144(5) of the CrPC by appropriately modifying Paragraph 7 therein; and * Publish the rescission order on the website of the district administration (http:/indore.nic.in/). ### A welcome reply from the Collector! Today, the Collector, Indore issued another [**order**](https://drive.google.com/file/d/189uCsbgyMC_Pdzm8gYxacb2pQlffXCNq/view?usp=sharing) (the translated version follows the order) under Section 144(6) CrPC, in response to our application under Section 144(5) CrPC. In the revised order, the Collector, Indore referred to our representation to him dated May 10, 2021 and stated that on the basis of IFF’s representation, paragraph 7 of the previous S.144 order is hereby repealed, and replaced with the following paragraph (translated from Hindi): *\"That such messages or posts, posted on Social Media which present danger towards public peace, law and order and health of the general public at large and which become the reason for violation of prevailing Covid Protocol, will remain restrained”*. This is a major victory for the constitutional rights of all residents of Indore, since the revised order is clearer, more specific and limited in its scope only to issues of law and order and the health of the public, whereas the previous order prohibited any and all comments made in an “unrestrained manner” in relation to Covid-19. The revised order has removed vague and arbitrary phrases such as “provoking the public” and “unrestrained commenting”. Notably, the revised order also removes the threat of prosecution under the Epidemic Disease Act, 1897 and the National Disaster Management Act, 2005, as was contained in paragraph 7 of the previous order. The direction to group admins to immediately expel group members for “posting wrong messages” has also been removed. The revised order has not yet been uploaded to the official website of the administration of the Indore district. We will update you once it is. We are grateful to the Collector, Indore for his swift action to ensure that measures to tackle Covid-19 do not violate or compromise the fundamental rights of the residents of Indore. This will allow us not only to use social media to coordinate vital help and assistance to patients, but also to exercise our constitutional right to express our views and opinions on all matters relating to the ongoing pandemic, including the government’s response to it. We also call upon our community to share similar orders that may violate your fundamental right of speech online from your home districts with us. ### Important Documents 1. Order dated May 12, 2021 issued by Collector, Indore replacing paragraph 7 of the previous order under S. 144(1) CrPC ([**link**](https://drive.google.com/file/d/1z3MXwt66qtS1QsFvOQ1YJZUKchEGSVWR/view?usp=sharing)) 2. Application under Section 144(5), CrPC addressed to Collector, Indore dated May 10, 2021 ([**link**](https://drive.google.com/file/d/1a_xhE5TYqbTslOdT7exwQA8jSbAfiU2z/view?usp=sharing)) 3. Order issued by the Collector, District of Indore under Section 144(1) CrPC dated April 20, 2021 ([**link**](https://drive.google.com/file/d/1aQMZesPtleqeS7QPuSeBvqfc0kDcc16H/view?usp=sharing)) 4. Supreme Court order in Suo Moto Writ Petition (Civil) No. 3 of 2021 dated April 30, 2021 ([**link**](https://www.livelaw.in/pdf_upload/in-re-distribution-of-essential-supplies-and-services-during-pandemic-april-30-392778.pdf)) 5. IFF’s statement condemning social media censorship of posts seeking or providing COVID-19 relief April 25, 2021 ([**link**](https://twitter.com/internetfreedom/status/1386177547294044164)) 6. IFF’s video discussing the legality of orders taking down COVID-19 relief work dated April 26, 2021 ([**link**](https://www.youtube.com/watch?v=8qa8_NtZZYc)) 7. IFF’s video discussing the liability of WhatsApp group administrators for content posted by others dated May 5, 2021 ([**link**](https://www.youtube.com/watch?v=GuE39la75Lk&amp;t=196s))",
    "light_cleaned_comments": "You guys rock. Kudos to you folks! Please whoever can afford it and willing please [donate](https://internetfreedom.in/donate/) to this foundation. We need free internet and these guys have the tools necessary to make it an organized movement. Most authoritative system of governance are a product of accute human suffering, like this pandemic. Thank you, we appreciate it and require all the help we can get! We are funded by regular Indians, and maintain complete transparency so that we can continue holding the people in power accountable. Thank you!"
}