{
    "id": "1561p1l",
    "title": "Apparently Central Government, PM and HM were aware of whole situation in Manipur.",
    "url": "https://youtu.be/hNu-Cubz0uY",
    "selftext": "Briefly explained the interaction between Centre and Manipur Government with timelines.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1689976959.0,
    "convurl": "https://external-preview.redd.it/2P4urSQgT62yxkA1gTUhDV5PChxjJuXS-cFEWFnPcgA.jpg?auto=webp&s=c987a485f3c752880678d7cdc1c8d695b661dcbd",
    "comments": [
        "Of course, the chain of command was aware. When the day comes that the PM, HM and CM get their news from viral Twitter videos we can all just call ourselves a failed state and get on with life.",
        "Of course they were aware, its just that they conveniently chose to ignore or take any concrete action.",
        "How can they be unaware when they're the ones perpetrating the rapes and violence, like Godhra? Modi and Shah are the prime rapists of this country.",
        "They are worse than useless if they weren't. It would be failure of intelligence and governance on so many levels if he didn't even know what's happening in Manipur."
    ],
    "cleaned_text": "apparently central government pm hm aware whole situation manipur briefly explained interaction centre manipur government timelines ",
    "cleaned_title": "apparently central government pm hm aware whole situation manipur",
    "cleaned_selftext": "briefly explained interaction centre manipur government timelines",
    "cleaned_comments": "course chain command aware day comes pm hm cm get news viral twitter videos call failed state get life course aware conveniently chose ignore take concrete action unaware theyre ones perpetrating rapes violence like godhra modi shah prime rapists country worse useless werent would failure intelligence governance many levels didnt even know whats happening manipur",
    "light_cleaned_title": "Apparently Central Government, PM and HM were aware of whole situation in Manipur.",
    "light_cleaned_selftext": "Briefly explained the interaction between Centre and Manipur Government with timelines.",
    "light_cleaned_comments": "Of course, the chain of command was aware. When the day comes that the PM, HM and CM get their news from viral Twitter videos we can all just call ourselves a failed state and get on with life. Of course they were aware, its just that they conveniently chose to ignore or take any concrete action. How can they be unaware when they're the ones perpetrating the rapes and violence, like Godhra? Modi and Shah are the prime rapists of this country. They are worse than useless if they weren't. It would be failure of intelligence and governance on so many levels if he didn't even know what's happening in Manipur."
}