{
    "id": "136gdlm",
    "title": "Can I use this Surge Protection?",
    "url": "https://www.reddit.com/gallery/136gdlm",
    "selftext": "\nHi all,\n\nCan I use that GM Adapter with Laptop adapter for surge protection ?\n\n👉Picture 1: GM Adapter with Surge protector \n\nSpecs of Surge Protector: Current: 6A \nSupports universal voltage 110V-240V\n*Safety instruction- Never exceed the maximum load capacity of 10A.\n———————————-\n👉Picture 2: Laptop’s Adapter \n\nLaptop’s Adapter Specs: check pic 2\n\n\nThank you all",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 6,
    "created_utc": 1683108895.0,
    "convurl": "https://i.redd.it/8biys8lcdlxa1.jpg",
    "comments": [
        "Yes, ratings look okay.",
        "It violates two fundamental rules for safety.  It (apparently) has no 6 amp circuit breaker.  And it has some tiny joule protector parts that can cause a fire and can sometimes compromise (bypass) what is superior protection inside electronics.",
        "This is how it looks from the back.\n\nhttps://preview.redd.it/yzhmdlcuznxa1.jpeg?width=3024&format=pjpg&auto=webp&v=enabled&s=f51bed3d126d7a44f925291c4e44852e6fb36717\n\nBut is it good for charging mobile or should I just avoid  it? Thanks 😊",
        "See that tiny joule, 4 rupee part?  Its tiniest joules are why fires are created. Part also must connect through a less than 1 amp thermal fuse.  To also avert fires.  Two reasons why it is unsafe.\n\n And no 6 amp circuit breaker. Another threat.  Don't leave it unsupervised.",
        "Thank you very much bro. 😊"
    ],
    "cleaned_text": "use surge protection hi use gm adapter laptop adapter surge protection picture gm adapter surge protector specs surge protector current supports universal voltage vv safety instruction never exceed maximum load capacity picture laptops adapter laptops adapter specs check pic thank ",
    "cleaned_title": "use surge protection",
    "cleaned_selftext": "hi use gm adapter laptop adapter surge protection picture gm adapter surge protector specs surge protector current supports universal voltage vv safety instruction never exceed maximum load capacity picture laptops adapter laptops adapter specs check pic thank",
    "cleaned_comments": "yes ratings look okay violates two fundamental rules safety apparently amp circuit breaker tiny joule protector parts cause fire sometimes compromise bypass superior protection inside electronics looks back good charging mobile avoid thanks see tiny joule rupee part tiniest joules fires created part also must connect less amp thermal fuse also avert fires two reasons unsafe amp circuit breaker another threat dont leave unsupervised thank much bro",
    "light_cleaned_title": "Can I use this Surge Protection?",
    "light_cleaned_selftext": "Hi all, Can I use that GM Adapter with Laptop adapter for surge protection ? 👉Picture 1: GM Adapter with Surge protector Specs of Surge Protector: Current: 6A Supports universal voltage 110V-240V *Safety instruction- Never exceed the maximum load capacity of 10A. ———————————- 👉Picture 2: Laptop’s Adapter Laptop’s Adapter Specs: check pic 2 Thank you all",
    "light_cleaned_comments": "Yes, ratings look okay. It violates two fundamental rules for safety. It (apparently) has no 6 amp circuit breaker. And it has some tiny joule protector parts that can cause a fire and can sometimes compromise (bypass) what is superior protection inside electronics. This is how it looks from the back. But is it good for charging mobile or should I just avoid it? Thanks 😊 See that tiny joule, 4 rupee part? Its tiniest joules are why fires are created. Part also must connect through a less than 1 amp thermal fuse. To also avert fires. Two reasons why it is unsafe. And no 6 amp circuit breaker. Another threat. Don't leave it unsupervised. Thank you very much bro. 😊"
}