{
    "id": "m3btmq",
    "title": "IT Rules update: We sent the Standing Committee on IT some constitutional questions against unconstitutional Rules",
    "url": "https://www.reddit.com/r/india/comments/m3btmq/it_rules_update_we_sent_the_standing_committee_on/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/daxq3dafljm61.png?width=2000&amp;format=png&amp;auto=webp&amp;s=92080c47b7feb9fa620043687aa2e1fd6a306af0\n\n## Tl;dr\n\nThe Standing Committee on IT will conducting meetings with representatives from the Ministry of Information and Broadcasting and the Ministry of Electronics and Information Technology. In light of concerns about the Information Technology Rules, 2021, we wrote to the Committee, detailing the list of issues and recommendations we have and asking the Committee to put the same before the representatives of the ministries.\n\n## Background\n\nThe Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 were [**notified on February 25th, 2021**](http://egazette.nic.in/WriteReadData/2021/225464.pdf). The Rules lay down a new and stringent framework for the regulation of online content. Though categorised as ‘soft-touch’, the Rules contain provisions that range from the claustrophobic to the downright stifling, with several implications for free speech, journalistic freedom, and artistic creativity. That these Rules have been notified in the aftermath of the [**debacle involving Twitter and the Government of India**](https://internetfreedom.in/government-censorship-and-the-dire-need-for-transparency/) has only exacerbated concerns that they are an attempt to clamp down on dissent. We have written extensively about the Rules before through our [**deep dive into the Rules**](https://internetfreedom.in/intermediaries-rules-2021/) as well as our more [**historical and contextual analysis**](https://internetfreedom.in/latest-draft-intermediary-rules-fixing-big-tech-by-breaking-our-digital-rights/). We have also provided an [**explainer on the Self-regulatory Code**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/) of the Internet and Mobile Association of India to provide an instance of how self-censorship would work under the Rules.\n\nThe deleterious effects of these Rules can already be seen: two journalists from Manipur, who have been hounded for their work by the police before, were served [**a notice under the new Rules**](https://www.thehindu.com/news/national/other-states/2-manipur-scribes-get-notices-under-new-digital-media-rules/article33974085.ece), asking them to furnish details attesting to their compliance with the new Rules. Though the notice was subsequently retracted, this incident may be a precursor to future such events in which journalists are intimidated and harangued in such a manner. Meanwhile, self-regulation has already given way to self-censorship for OTT platforms, with on-demand video streaming platforms already exercising caution and discretion. Several completed [**TV shows and movies have already been cancelled**](https://www.livemint.com/industry/media/otts-tread-on-cautious-ground-axe-shows/amp-11615188592226.html) for fear of government censure.\n\nNow, the [**list of subjects**](http://164.100.47.194/Loksabha/Committee/CommitteeInformation.aspx?comm_code=18&amp;tab=1) under consideration of the Committee includes both ‘Citizens data security and privacy' and ‘Ethical standards in media coverage’, two subjects which will be directly impacted by these Rules. Additionally, the [**agenda**](http://164.100.47.193/lsscommittee/Information%20Technology/Meeting_notice/Notice%20of%20%20the%2022%20and%2023%20sitting%20on%2015%20and%2016%20March,%202021.pdf) for the Committee lists upcoming meetings with representatives of the Ministry of Information and Broadcasting and the Ministry of Electronics and Information Technology, on the issues of ‘Review of functioning of Central Board of Film Certification (CBFC)’ and ‘Review of Cyber Security Scenario in India’. Thus, through the letter, we wanted to provide the Committee with an illustrative list of concerns and questions that may be put before the representatives of the Ministries. We describe these issues and the recommendations thereof  in detail below.\n\n## Provisions and Issues\n\nThe Rules consist of three parts. Part I of the Rules is preliminary and provides definitions. Part II empowers the Government to exercise control over intermediaries such as Facebook, Twitter, Google and Whatsapp. Lastly, Part III regulates publishers of news and current affairs (“Digital News Media”) and publishers of online curated content (“OTT platforms”).\n\nWe believe that the Government should not have notified these far-reaching rules without parliamentary approval and the Rules should have been placed before the Hon’ble Parliamentary Standing Committee on Information Technology. In law, a rule-making authority must not traverse beyond the powers conferred by the Parliament. In this case, the Central Government has notified the Rules under Section 87 of the Information Technology Act, 2000 which does not permit the Central Government to regulate Digital News Media and OTT Platforms.\n\nWhile, in general we do not dispute the need to regulate the internet, the Rules raise grave civil liberty concerns. Part II of the Rules has serious implications on the freedom of speech and expression and the right to privacy of users of the internet:\n\n* Rules 3(1)(b) and 3(1)(c) permit social media intermediaries (such as Facebook) to decide whether any content uploaded by a user violates any law in force and if it does, the entity can terminate the access or usage rights of the user. This enables private entities such as Facebook, to be an arbiter of permissible speech and is in violation of the directions of the Hon’ble Supreme Court in Shreya Singhal vs Union of India. In that case, the Court held that intermediaries cannot decide permissibility of any content without an order of a court or an order by the Government.\n* Rule 3(2) requires social media intermediaries to establish a grievance redressal mechanism by which users may complain against any content and a grievance officer has to dispose of such complaints within 15 days. An [**empirical study**](https://cis-india.org/internet-governance/chilling-effects-on-free-expression-on-internet) conducted by the Centre for Internet Society points out that intermediaries tend to over-comply with such takedown requests to limit their liability and this has a chilling effect on free speech and expression of all users.\n* Rule 4(2) requires significant social media intermediaries which provide messaging services (such as Whatsapp) to enable identification of the “first originator” of a message. To implement this rule, entities will have to “fingerprint” each message and this may defeat end-to-end encryption. As a consequence, privacy of every user will be compromised to investigate crimes committed by a miniscule-minority.\n* Rule 4(4) requires significant social media intermediaries to develop automated tools to censor content. While the [**efficacy**](https://www.newamerica.org/oti/reports/everything-moderation-analysis-how-internet-platforms-are-using-artificial-intelligence-moderate-user-generated-content/the-limitations-of-automated-tools-in-content-moderation/) of such tools is itself doubtful, intermediaries will collect large amounts of data of users to develop these tools in violation of the Right to Privacy of users.\n\nPart III of the Rules has serious implications on freedom of speech and expression of Digital News Media and OTT Platforms, and the right of citizens to have access to information:\n\n* The Rules establish a Code of Ethics which is enforced by an Inter-Departmental Committee which consists only of officers of the Government. The Inter-Departmental Committee may recommend the Ministry of Information and Broadcasting to block, delete or modify content published by Digital News Media and OTT platforms. Thus, the Central Government is now the sole arbiter of permissible speech. This affects the publisher’s Fundamental Right to Expression and the citizen’s right to access differing points of view because publishers will be compelled to only produce content which is palatable to the Central Government\n* Notably, Rule 14(1)(b) r/w Rule 14(1)(6) permits the Ministry of Information and Broadcasting to refer complaints to an Inter-Departmental Committee and also decide upon those complaints after taking into consideration the recommendations of the Inter-Departmental Committee. This is arbitrary as the Ministry of Information and Broadcasting becomes a ‘judge in its own cause’, and has a chilling effect on speech of the publishers.\n* The Code of Ethics mandates OTT Platforms to “take into consideration India’s multi-racial and multi-religious context” and exercise “due caution” when portraying any racial or religious group. If they do not exercise “due caution” their content may be blocked by the Inter-Departmental Committee. This obligation on OTT Platforms is vague and has a “chilling effect” because vague laws by their very nature, are overbroad and cover within their ambit both unlawful and legitimate speech.\n\n## What can be done?\n\nThe above mentioned issues deserve further scrutiny, and so we request firstly that these Rules be denotified and put through the public consultation process in line with the [**Pre-Legislative Consultation Policy**](https://legislative.gov.in/documents/pre-legislative-consultation-policy) adopted on February 5th, 2014. Given the significant and wide-ranging implications of these Rules, we believe the government must first publish a white paper underlining the government’s intent with respect to intermediary liability and online content regulation. To this extent, we believe the Ministry of Electronics and Information Technology must revive the erstwhile Cyber Regulations Advisory Committee under Section 88 of the Information Technology Act, 2000. Furthermore, we request that the Committee contain an adequate amount of representation from experts, academics, technologists and civil society organisations. We stress this aspect only because earlier constitutions of the committee [**witnessed low amounts of participation from the aforementioned groups**](https://cis-india.org/internet-governance/blog/cyber-regulations-advisory-committee-no-civil-society).\n\nWe further ask that any future version of the Rules substantially engage with the recommendations put forth by the Standing Committee on Subordinate Legislation’s [**report**](https://www.prsindia.org/sites/default/files/bill_files/IT_Rules_Subordinate_committee_Report.pdf) on the The Information Technology (Intermediaries Guidelines) Rules, 2011, which too had recommended making the Cyber Regulation Advisory Committee functional again. These recommendation also included:\n\n* Removing any definitional vagueness to prevent misuse\n* Providing procedural safeguards for content takedown orders\n* Such provisions would provide a basic level of operational transparency, and as such constitute a minimum requirement for any forthcoming regulatory framework.\n\nThe regulatory paradigm for digital news media and OTT platforms has also raised grave cause for concern. We believe that here that the first point of departure must be the principles laid down in the [**report**](https://mib.gov.in/sites/default/files/Shyam_Benegal_committee_Report_compressed.pdf)  of the Ministry of Information and Broadcasting’s Report of the Committee of Experts chaired by Shyam Benegal that recommended broad guidelines/procedures for certification of films by the central board of film certification. The report of the Ministry of Information and Broadcasting’s Expert Committee on Film Certification recommended a more liberalised regime even for film certification, arguing that the Central Board of Film Certification should not act as a ‘moral compass’, and instead limit itself purely to certification (and not dictate modifications and withdrawals).\n\nThe committee also stated that film viewing is a consensual act, and so regulation should limit itself to a statutory warning, noting that the artistic expression and creative freedom of filmmakers should be protected and any certification should be responsive to social change. Such arguments apply even more to the realm of online content, where the viewer directly chooses the content they wish to consume. Thus, we believe that the Ministry must put the findings of the Committee of the public consultation process, and ensure that its recommendations are implemented in the next version of the Rules.\n\n### Important Documents\n\n1. IFF's letter to the Standing Committee regarding the Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1dbi9HoYfMC3heGYkMOd_i0cwadT3W1PB/view?usp=sharing))\n2. The Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1XwWIs_26FRXkK6qkB193ajxfOP620iyx/view?usp=sharing))\n3. Latest Draft Intermediary Rules: Fixing big tech, by breaking our digital rights? dated February 25th, 2021 ([**link**](https://internetfreedom.in/latest-draft-intermediary-rules-fixing-big-tech-by-breaking-our-digital-rights/))\n4. Deep dive : How the intermediaries rules are anti-democratic and unconstitutional dated February 27th, 2021 ([**link**](https://internetfreedom.in/intermediaries-rules-2021/))\n5. Coming to streaming services near you: Self-censorship! dated March 4th, 2021 ([**link**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/))",
    "flair": "Policy/Economy",
    "score": 185,
    "num_comments": 9,
    "created_utc": 1615530956,
    "convurl": "https://b.thumbs.redditmedia.com/v_HleWS85aekKq8_2g9fvI1Mx3IWuxgJL9RJ8D6z0YE.jpg",
    "comments": [
        "Crasad is behaving like Himler's nephew.\n\nWho needs BJ Pee gobarment to enjoy royal luxuries and security at taxpayer's expense, if they can not uphold fundamental rights and constituion.\n\nFodi hai to freedom namumkin hai.",
        "I have immense respect for your work guys!!! At least someone is keen on keeping our freedoms intact.",
        "This is what Joseph Goebbels did for the Nazi Germany. Propaganda and shifting public to be sympathetic for their evil cause.\n\nAnyone who really finds dictatorship better or appealing then they should know that money and resources are spent on propoganda , suppressing people , keeping a watch on citizen etc which could be better spent on infrastructure, education etc. Its a wastage of resources",
        "It's worth it, give it a shot.",
        "Thank you. TBH some days, it's getting more challenging every day. But we must carry on our mission, constitutionally and with faith!"
    ],
    "cleaned_text": "rules update sent standing committee constitutional questions unconstitutional rules ampxb tldr standing committee conducting meetings representatives ministry information broadcasting ministry electronics information technology light concerns information technology rules wrote committee detailing list issues recommendations asking committee put representatives ministries background information technology guidelines intermediaries digital media ethics code rules notified february th httpegazettenicinwritereaddatapdf rules lay new stringent framework regulation online content though categorised softtouch rules contain provisions range claustrophobic downright stifling several implications free speech journalistic freedom artistic creativity rules notified aftermath debacle involving twitter government indiahttpsinternetfreedomingovernmentcensorshipandthedireneedfortransparency exacerbated concerns attempt clamp dissent written extensively rules deep dive ruleshttpsinternetfreedominintermediariesrules well historical contextual analysishttpsinternetfreedominlatestdraftintermediaryrulesfixingbigtechbybreakingourdigitalrights also provided explainer selfregulatory codehttpsinternetfreedominselfcensorshipandtheendofgoodcontent internet mobile association india provide instance selfcensorship would work rules deleterious effects rules already seen two journalists manipur hounded work police served notice new ruleshttpswwwthehinducomnewsnationalotherstatesmanipurscribesgetnoticesundernewdigitalmediarulesarticleece asking furnish details attesting compliance new rules though notice subsequently retracted incident may precursor future events journalists intimidated harangued manner meanwhile selfregulation already given way selfcensorship ott platforms ondemand video streaming platforms already exercising caution discretion several completed tv shows movies already cancelledhttpswwwlivemintcomindustrymediaottstreadoncautiousgroundaxeshowsamphtml fear government censure list subjectshttploksabhacommitteecommitteeinformationaspxcommcodeamptab consideration committee includes citizens data security privacy ethical standards media coverage two subjects directly impacted rules additionally agendahttplsscommitteeinformationtechnologymeetingnoticenoticeoftheandsittingonandmarchpdf committee lists upcoming meetings representatives ministry information broadcasting ministry electronics information technology issues review functioning central board film certification cbfc review cyber security scenario india thus letter wanted provide committee illustrative list concerns questions may put representatives ministries describe issues recommendations thereof detail provisions issues rules consist three parts part rules preliminary provides definitions part ii empowers government exercise control intermediaries facebook twitter google whatsapp lastly part iii regulates publishers news current affairs digital news media publishers online curated content ott platforms believe government notified farreaching rules without parliamentary approval rules placed honble parliamentary standing committee information technology law rulemaking authority must traverse beyond powers conferred parliament case central government notified rules section information technology act permit central government regulate digital news media ott platforms general dispute need regulate internet rules raise grave civil liberty concerns part ii rules serious implications freedom speech expression right privacy users internet rules b c permit social media intermediaries facebook decide whether content uploaded user violates law force entity terminate access usage rights user enables private entities facebook arbiter permissible speech violation directions honble supreme court shreya singhal vs union india case court held intermediaries decide permissibility content without order court order government rule requires social media intermediaries establish grievance redressal mechanism users may complain content grievance officer dispose complaints within days empirical studyhttpscisindiaorginternetgovernancechillingeffectsonfreeexpressiononinternet conducted centre internet society points intermediaries tend overcomply takedown requests limit liability chilling effect free speech expression users rule requires significant social media intermediaries provide messaging services whatsapp enable identification first originator message implement rule entities fingerprint message may defeat endtoend encryption consequence privacy every user compromised investigate crimes committed minisculeminority rule requires significant social media intermediaries develop automated tools censor content efficacyhttpswwwnewamericaorgotireportseverythingmoderationanalysishowinternetplatformsareusingartificialintelligencemoderateusergeneratedcontentthelimitationsofautomatedtoolsincontentmoderation tools doubtful intermediaries collect large amounts data users develop tools violation right privacy users part iii rules serious implications freedom speech expression digital news media ott platforms right citizens access information rules establish code ethics enforced interdepartmental committee consists officers government interdepartmental committee may recommend ministry information broadcasting block delete modify content published digital news media ott platforms thus central government sole arbiter permissible speech affects publishers fundamental right expression citizens right access differing points view publishers compelled produce content palatable central government notably rule b rw rule permits ministry information broadcasting refer complaints interdepartmental committee also decide upon complaints taking consideration recommendations interdepartmental committee arbitrary ministry information broadcasting becomes judge cause chilling effect speech publishers code ethics mandates ott platforms take consideration indias multiracial multireligious context exercise due caution portraying racial religious group exercise due caution content may blocked interdepartmental committee obligation ott platforms vague chilling effect vague laws nature overbroad cover within ambit unlawful legitimate speech done mentioned issues deserve scrutiny request firstly rules denotified put public consultation process line prelegislative consultation policyhttpslegislativegovindocumentsprelegislativeconsultationpolicy adopted february th given significant wideranging implications rules believe government must first publish white paper underlining governments intent respect intermediary liability online content regulation extent believe ministry electronics information technology must revive erstwhile cyber regulations advisory committee section information technology act furthermore request committee contain adequate amount representation experts academics technologists civil society organisations stress aspect earlier constitutions committee witnessed low amounts participation aforementioned groupshttpscisindiaorginternetgovernanceblogcyberregulationsadvisorycommitteenocivilsociety ask future version rules substantially engage recommendations put forth standing committee subordinate legislations reporthttpswwwprsindiaorgsitesdefaultfilesbillfilesitrulessubordinatecommitteereportpdf information technology intermediaries guidelines rules recommended making cyber regulation advisory committee functional recommendation also included removing definitional vagueness prevent misuse providing procedural safeguards content takedown orders provisions would provide basic level operational transparency constitute minimum requirement forthcoming regulatory framework regulatory paradigm digital news media ott platforms also raised grave cause concern believe first point departure must principles laid reporthttpsmibgovinsitesdefaultfilesshyambenegalcommitteereportcompressedpdf ministry information broadcastings report committee experts chaired shyam benegal recommended broad guidelinesprocedures certification films central board film certification report ministry information broadcastings expert committee film certification recommended liberalised regime even film certification arguing central board film certification act moral compass instead limit purely certification dictate modifications withdrawals committee also stated film viewing consensual act regulation limit statutory warning noting artistic expression creative freedom filmmakers protected certification responsive social change arguments apply even realm online content viewer directly chooses content wish consume thus believe ministry must put findings committee public consultation process ensure recommendations implemented next version rules important documents iffs letter standing committee regarding information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfileddbihoyfmchegykmodicwadtwpbviewuspsharing information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfiledxwwisfrxkkqkbajxfopiyxviewuspsharing latest draft intermediary rules fixing big tech breaking digital rights dated february th linkhttpsinternetfreedominlatestdraftintermediaryrulesfixingbigtechbybreakingourdigitalrights deep dive intermediaries rules antidemocratic unconstitutional dated february th linkhttpsinternetfreedominintermediariesrules coming streaming services near selfcensorship dated march th linkhttpsinternetfreedominselfcensorshipandtheendofgoodcontent ",
    "cleaned_title": "rules update sent standing committee constitutional questions unconstitutional rules",
    "cleaned_selftext": "ampxb tldr standing committee conducting meetings representatives ministry information broadcasting ministry electronics information technology light concerns information technology rules wrote committee detailing list issues recommendations asking committee put representatives ministries background information technology guidelines intermediaries digital media ethics code rules notified february th httpegazettenicinwritereaddatapdf rules lay new stringent framework regulation online content though categorised softtouch rules contain provisions range claustrophobic downright stifling several implications free speech journalistic freedom artistic creativity rules notified aftermath debacle involving twitter government indiahttpsinternetfreedomingovernmentcensorshipandthedireneedfortransparency exacerbated concerns attempt clamp dissent written extensively rules deep dive ruleshttpsinternetfreedominintermediariesrules well historical contextual analysishttpsinternetfreedominlatestdraftintermediaryrulesfixingbigtechbybreakingourdigitalrights also provided explainer selfregulatory codehttpsinternetfreedominselfcensorshipandtheendofgoodcontent internet mobile association india provide instance selfcensorship would work rules deleterious effects rules already seen two journalists manipur hounded work police served notice new ruleshttpswwwthehinducomnewsnationalotherstatesmanipurscribesgetnoticesundernewdigitalmediarulesarticleece asking furnish details attesting compliance new rules though notice subsequently retracted incident may precursor future events journalists intimidated harangued manner meanwhile selfregulation already given way selfcensorship ott platforms ondemand video streaming platforms already exercising caution discretion several completed tv shows movies already cancelledhttpswwwlivemintcomindustrymediaottstreadoncautiousgroundaxeshowsamphtml fear government censure list subjectshttploksabhacommitteecommitteeinformationaspxcommcodeamptab consideration committee includes citizens data security privacy ethical standards media coverage two subjects directly impacted rules additionally agendahttplsscommitteeinformationtechnologymeetingnoticenoticeoftheandsittingonandmarchpdf committee lists upcoming meetings representatives ministry information broadcasting ministry electronics information technology issues review functioning central board film certification cbfc review cyber security scenario india thus letter wanted provide committee illustrative list concerns questions may put representatives ministries describe issues recommendations thereof detail provisions issues rules consist three parts part rules preliminary provides definitions part ii empowers government exercise control intermediaries facebook twitter google whatsapp lastly part iii regulates publishers news current affairs digital news media publishers online curated content ott platforms believe government notified farreaching rules without parliamentary approval rules placed honble parliamentary standing committee information technology law rulemaking authority must traverse beyond powers conferred parliament case central government notified rules section information technology act permit central government regulate digital news media ott platforms general dispute need regulate internet rules raise grave civil liberty concerns part ii rules serious implications freedom speech expression right privacy users internet rules b c permit social media intermediaries facebook decide whether content uploaded user violates law force entity terminate access usage rights user enables private entities facebook arbiter permissible speech violation directions honble supreme court shreya singhal vs union india case court held intermediaries decide permissibility content without order court order government rule requires social media intermediaries establish grievance redressal mechanism users may complain content grievance officer dispose complaints within days empirical studyhttpscisindiaorginternetgovernancechillingeffectsonfreeexpressiononinternet conducted centre internet society points intermediaries tend overcomply takedown requests limit liability chilling effect free speech expression users rule requires significant social media intermediaries provide messaging services whatsapp enable identification first originator message implement rule entities fingerprint message may defeat endtoend encryption consequence privacy every user compromised investigate crimes committed minisculeminority rule requires significant social media intermediaries develop automated tools censor content efficacyhttpswwwnewamericaorgotireportseverythingmoderationanalysishowinternetplatformsareusingartificialintelligencemoderateusergeneratedcontentthelimitationsofautomatedtoolsincontentmoderation tools doubtful intermediaries collect large amounts data users develop tools violation right privacy users part iii rules serious implications freedom speech expression digital news media ott platforms right citizens access information rules establish code ethics enforced interdepartmental committee consists officers government interdepartmental committee may recommend ministry information broadcasting block delete modify content published digital news media ott platforms thus central government sole arbiter permissible speech affects publishers fundamental right expression citizens right access differing points view publishers compelled produce content palatable central government notably rule b rw rule permits ministry information broadcasting refer complaints interdepartmental committee also decide upon complaints taking consideration recommendations interdepartmental committee arbitrary ministry information broadcasting becomes judge cause chilling effect speech publishers code ethics mandates ott platforms take consideration indias multiracial multireligious context exercise due caution portraying racial religious group exercise due caution content may blocked interdepartmental committee obligation ott platforms vague chilling effect vague laws nature overbroad cover within ambit unlawful legitimate speech done mentioned issues deserve scrutiny request firstly rules denotified put public consultation process line prelegislative consultation policyhttpslegislativegovindocumentsprelegislativeconsultationpolicy adopted february th given significant wideranging implications rules believe government must first publish white paper underlining governments intent respect intermediary liability online content regulation extent believe ministry electronics information technology must revive erstwhile cyber regulations advisory committee section information technology act furthermore request committee contain adequate amount representation experts academics technologists civil society organisations stress aspect earlier constitutions committee witnessed low amounts participation aforementioned groupshttpscisindiaorginternetgovernanceblogcyberregulationsadvisorycommitteenocivilsociety ask future version rules substantially engage recommendations put forth standing committee subordinate legislations reporthttpswwwprsindiaorgsitesdefaultfilesbillfilesitrulessubordinatecommitteereportpdf information technology intermediaries guidelines rules recommended making cyber regulation advisory committee functional recommendation also included removing definitional vagueness prevent misuse providing procedural safeguards content takedown orders provisions would provide basic level operational transparency constitute minimum requirement forthcoming regulatory framework regulatory paradigm digital news media ott platforms also raised grave cause concern believe first point departure must principles laid reporthttpsmibgovinsitesdefaultfilesshyambenegalcommitteereportcompressedpdf ministry information broadcastings report committee experts chaired shyam benegal recommended broad guidelinesprocedures certification films central board film certification report ministry information broadcastings expert committee film certification recommended liberalised regime even film certification arguing central board film certification act moral compass instead limit purely certification dictate modifications withdrawals committee also stated film viewing consensual act regulation limit statutory warning noting artistic expression creative freedom filmmakers protected certification responsive social change arguments apply even realm online content viewer directly chooses content wish consume thus believe ministry must put findings committee public consultation process ensure recommendations implemented next version rules important documents iffs letter standing committee regarding information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfileddbihoyfmchegykmodicwadtwpbviewuspsharing information technology guidelines intermediaries digital media ethics code rules linkhttpsdrivegooglecomfiledxwwisfrxkkqkbajxfopiyxviewuspsharing latest draft intermediary rules fixing big tech breaking digital rights dated february th linkhttpsinternetfreedominlatestdraftintermediaryrulesfixingbigtechbybreakingourdigitalrights deep dive intermediaries rules antidemocratic unconstitutional dated february th linkhttpsinternetfreedominintermediariesrules coming streaming services near selfcensorship dated march th linkhttpsinternetfreedominselfcensorshipandtheendofgoodcontent",
    "cleaned_comments": "crasad behaving like himlers nephew needs bj pee gobarment enjoy royal luxuries security taxpayers expense uphold fundamental rights constituion fodi hai freedom namumkin hai immense respect work guys least someone keen keeping freedoms intact joseph goebbels nazi germany propaganda shifting public sympathetic evil cause anyone really finds dictatorship better appealing know money resources spent propoganda suppressing people keeping watch citizen etc could better spent infrastructure education etc wastage resources worth give shot thank tbh days getting challenging every day must carry mission constitutionally faith",
    "light_cleaned_title": "IT Rules update: We sent the Standing Committee on IT some constitutional questions against unconstitutional Rules",
    "light_cleaned_selftext": "## Tl;dr The Standing Committee on IT will conducting meetings with representatives from the Ministry of Information and Broadcasting and the Ministry of Electronics and Information Technology. In light of concerns about the Information Technology Rules, 2021, we wrote to the Committee, detailing the list of issues and recommendations we have and asking the Committee to put the same before the representatives of the ministries. ## Background The Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 were [**notified on February 25th, 2021**](http://egazette.nic.in/WriteReadData/2021/225464.pdf). The Rules lay down a new and stringent framework for the regulation of online content. Though categorised as ‘soft-touch’, the Rules contain provisions that range from the claustrophobic to the downright stifling, with several implications for free speech, journalistic freedom, and artistic creativity. That these Rules have been notified in the aftermath of the [**debacle involving Twitter and the Government of India**](https://internetfreedom.in/government-censorship-and-the-dire-need-for-transparency/) has only exacerbated concerns that they are an attempt to clamp down on dissent. We have written extensively about the Rules before through our [**deep dive into the Rules**](https://internetfreedom.in/intermediaries-rules-2021/) as well as our more [**historical and contextual analysis**](https://internetfreedom.in/latest-draft-intermediary-rules-fixing-big-tech-by-breaking-our-digital-rights/). We have also provided an [**explainer on the Self-regulatory Code**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/) of the Internet and Mobile Association of India to provide an instance of how self-censorship would work under the Rules. The deleterious effects of these Rules can already be seen: two journalists from Manipur, who have been hounded for their work by the police before, were served [**a notice under the new Rules**](https://www.thehindu.com/news/national/other-states/2-manipur-scribes-get-notices-under-new-digital-media-rules/article33974085.ece), asking them to furnish details attesting to their compliance with the new Rules. Though the notice was subsequently retracted, this incident may be a precursor to future such events in which journalists are intimidated and harangued in such a manner. Meanwhile, self-regulation has already given way to self-censorship for OTT platforms, with on-demand video streaming platforms already exercising caution and discretion. Several completed [**TV shows and movies have already been cancelled**](https://www.livemint.com/industry/media/otts-tread-on-cautious-ground-axe-shows/amp-11615188592226.html) for fear of government censure. Now, the [**list of subjects**](http://164.100.47.194/Loksabha/Committee/CommitteeInformation.aspx?comm_code=18&amp;tab=1) under consideration of the Committee includes both ‘Citizens data security and privacy' and ‘Ethical standards in media coverage’, two subjects which will be directly impacted by these Rules. Additionally, the [**agenda**](http://164.100.47.193/lsscommittee/Information%20Technology/Meeting_notice/Notice%20of%20%20the%2022%20and%2023%20sitting%20on%2015%20and%2016%20March,%202021.pdf) for the Committee lists upcoming meetings with representatives of the Ministry of Information and Broadcasting and the Ministry of Electronics and Information Technology, on the issues of ‘Review of functioning of Central Board of Film Certification (CBFC)’ and ‘Review of Cyber Security Scenario in India’. Thus, through the letter, we wanted to provide the Committee with an illustrative list of concerns and questions that may be put before the representatives of the Ministries. We describe these issues and the recommendations thereof in detail below. ## Provisions and Issues The Rules consist of three parts. Part I of the Rules is preliminary and provides definitions. Part II empowers the Government to exercise control over intermediaries such as Facebook, Twitter, Google and Whatsapp. Lastly, Part III regulates publishers of news and current affairs (“Digital News Media”) and publishers of online curated content (“OTT platforms”). We believe that the Government should not have notified these far-reaching rules without parliamentary approval and the Rules should have been placed before the Hon’ble Parliamentary Standing Committee on Information Technology. In law, a rule-making authority must not traverse beyond the powers conferred by the Parliament. In this case, the Central Government has notified the Rules under Section 87 of the Information Technology Act, 2000 which does not permit the Central Government to regulate Digital News Media and OTT Platforms. While, in general we do not dispute the need to regulate the internet, the Rules raise grave civil liberty concerns. Part II of the Rules has serious implications on the freedom of speech and expression and the right to privacy of users of the internet: * Rules 3(1)(b) and 3(1)(c) permit social media intermediaries (such as Facebook) to decide whether any content uploaded by a user violates any law in force and if it does, the entity can terminate the access or usage rights of the user. This enables private entities such as Facebook, to be an arbiter of permissible speech and is in violation of the directions of the Hon’ble Supreme Court in Shreya Singhal vs Union of India. In that case, the Court held that intermediaries cannot decide permissibility of any content without an order of a court or an order by the Government. * Rule 3(2) requires social media intermediaries to establish a grievance redressal mechanism by which users may complain against any content and a grievance officer has to dispose of such complaints within 15 days. An [**empirical study**](https://cis-india.org/internet-governance/chilling-effects-on-free-expression-on-internet) conducted by the Centre for Internet Society points out that intermediaries tend to over-comply with such takedown requests to limit their liability and this has a chilling effect on free speech and expression of all users. * Rule 4(2) requires significant social media intermediaries which provide messaging services (such as Whatsapp) to enable identification of the “first originator” of a message. To implement this rule, entities will have to “fingerprint” each message and this may defeat end-to-end encryption. As a consequence, privacy of every user will be compromised to investigate crimes committed by a miniscule-minority. * Rule 4(4) requires significant social media intermediaries to develop automated tools to censor content. While the [**efficacy**](https://www.newamerica.org/oti/reports/everything-moderation-analysis-how-internet-platforms-are-using-artificial-intelligence-moderate-user-generated-content/the-limitations-of-automated-tools-in-content-moderation/) of such tools is itself doubtful, intermediaries will collect large amounts of data of users to develop these tools in violation of the Right to Privacy of users. Part III of the Rules has serious implications on freedom of speech and expression of Digital News Media and OTT Platforms, and the right of citizens to have access to information: * The Rules establish a Code of Ethics which is enforced by an Inter-Departmental Committee which consists only of officers of the Government. The Inter-Departmental Committee may recommend the Ministry of Information and Broadcasting to block, delete or modify content published by Digital News Media and OTT platforms. Thus, the Central Government is now the sole arbiter of permissible speech. This affects the publisher’s Fundamental Right to Expression and the citizen’s right to access differing points of view because publishers will be compelled to only produce content which is palatable to the Central Government * Notably, Rule 14(1)(b) r/w Rule 14(1)(6) permits the Ministry of Information and Broadcasting to refer complaints to an Inter-Departmental Committee and also decide upon those complaints after taking into consideration the recommendations of the Inter-Departmental Committee. This is arbitrary as the Ministry of Information and Broadcasting becomes a ‘judge in its own cause’, and has a chilling effect on speech of the publishers. * The Code of Ethics mandates OTT Platforms to “take into consideration India’s multi-racial and multi-religious context” and exercise “due caution” when portraying any racial or religious group. If they do not exercise “due caution” their content may be blocked by the Inter-Departmental Committee. This obligation on OTT Platforms is vague and has a “chilling effect” because vague laws by their very nature, are overbroad and cover within their ambit both unlawful and legitimate speech. ## What can be done? The above mentioned issues deserve further scrutiny, and so we request firstly that these Rules be denotified and put through the public consultation process in line with the [**Pre-Legislative Consultation Policy**](https://legislative.gov.in/documents/pre-legislative-consultation-policy) adopted on February 5th, 2014. Given the significant and wide-ranging implications of these Rules, we believe the government must first publish a white paper underlining the government’s intent with respect to intermediary liability and online content regulation. To this extent, we believe the Ministry of Electronics and Information Technology must revive the erstwhile Cyber Regulations Advisory Committee under Section 88 of the Information Technology Act, 2000. Furthermore, we request that the Committee contain an adequate amount of representation from experts, academics, technologists and civil society organisations. We stress this aspect only because earlier constitutions of the committee [**witnessed low amounts of participation from the aforementioned groups**](https://cis-india.org/internet-governance/blog/cyber-regulations-advisory-committee-no-civil-society). We further ask that any future version of the Rules substantially engage with the recommendations put forth by the Standing Committee on Subordinate Legislation’s [**report**](https://www.prsindia.org/sites/default/files/bill_files/IT_Rules_Subordinate_committee_Report.pdf) on the The Information Technology (Intermediaries Guidelines) Rules, 2011, which too had recommended making the Cyber Regulation Advisory Committee functional again. These recommendation also included: * Removing any definitional vagueness to prevent misuse * Providing procedural safeguards for content takedown orders * Such provisions would provide a basic level of operational transparency, and as such constitute a minimum requirement for any forthcoming regulatory framework. The regulatory paradigm for digital news media and OTT platforms has also raised grave cause for concern. We believe that here that the first point of departure must be the principles laid down in the [**report**](https://mib.gov.in/sites/default/files/Shyam_Benegal_committee_Report_compressed.pdf) of the Ministry of Information and Broadcasting’s Report of the Committee of Experts chaired by Shyam Benegal that recommended broad guidelines/procedures for certification of films by the central board of film certification. The report of the Ministry of Information and Broadcasting’s Expert Committee on Film Certification recommended a more liberalised regime even for film certification, arguing that the Central Board of Film Certification should not act as a ‘moral compass’, and instead limit itself purely to certification (and not dictate modifications and withdrawals). The committee also stated that film viewing is a consensual act, and so regulation should limit itself to a statutory warning, noting that the artistic expression and creative freedom of filmmakers should be protected and any certification should be responsive to social change. Such arguments apply even more to the realm of online content, where the viewer directly chooses the content they wish to consume. Thus, we believe that the Ministry must put the findings of the Committee of the public consultation process, and ensure that its recommendations are implemented in the next version of the Rules. ### Important Documents 1. IFF's letter to the Standing Committee regarding the Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1dbi9HoYfMC3heGYkMOd_i0cwadT3W1PB/view?usp=sharing)) 2. The Information Technology (Guidelines For Intermediaries And Digital Media Ethics Code) Rules, 2021 ([**link**](https://drive.google.com/file/d/1XwWIs_26FRXkK6qkB193ajxfOP620iyx/view?usp=sharing)) 3. Latest Draft Intermediary Rules: Fixing big tech, by breaking our digital rights? dated February 25th, 2021 ([**link**](https://internetfreedom.in/latest-draft-intermediary-rules-fixing-big-tech-by-breaking-our-digital-rights/)) 4. Deep dive : How the intermediaries rules are anti-democratic and unconstitutional dated February 27th, 2021 ([**link**](https://internetfreedom.in/intermediaries-rules-2021/)) 5. Coming to streaming services near you: Self-censorship! dated March 4th, 2021 ([**link**](https://internetfreedom.in/self-censorship-and-the-end-of-good-content/))",
    "light_cleaned_comments": "Crasad is behaving like Himler's nephew. Who needs BJ Pee gobarment to enjoy royal luxuries and security at taxpayer's expense, if they can not uphold fundamental rights and constituion. Fodi hai to freedom namumkin hai. I have immense respect for your work guys!!! At least someone is keen on keeping our freedoms intact. This is what Joseph Goebbels did for the Nazi Germany. Propaganda and shifting public to be sympathetic for their evil cause. Anyone who really finds dictatorship better or appealing then they should know that money and resources are spent on propoganda , suppressing people , keeping a watch on citizen etc which could be better spent on infrastructure, education etc. Its a wastage of resources It's worth it, give it a shot. Thank you. TBH some days, it's getting more challenging every day. But we must carry on our mission, constitutionally and with faith!"
}