{
    "id": "1af20ki",
    "title": "Is this slow death of democracy?",
    "url": "https://i.redd.it/xsumbfw3qnfc1.jpeg",
    "selftext": "> In this digital world, why voting in small group is so difficult?\n\n> A WhatsApp poll can replace this Desh Drohi/ traitor person. \n\n> Have we lost our basic sense? Instead of making things simpler why small group voting is this much complex?\n\n> All bureaucrats who made this voting system studied hard just to elect a 7th Grade passout!! Wasn't Britishers better at least they did tell yes there is no democracy? \n\n> Please share his doctor contact because this traitor had spine issue but when court ordered he became healthy?",
    "flair": "Rant / Vent",
    "score": 88,
    "num_comments": 29,
    "created_utc": 1706655192.0,
    "convurl": "https://i.redd.it/xsumbfw3qnfc1.jpeg",
    "comments": [
        "What's the context, who is this dude ..",
        "Yes. Who dafuq is this guy?",
        "We know nothing about him man. Who is this fellow? Give us some context bro",
        "[Chandigarh mayor polls: AAP-Congress accuse BJP of manipulating votes](https://newsable.asianetnews.com/india/chandigarh-mayor-polls-aap-congress-accuse-bjp-of-manipulating-votes-share-video-watch-ajr-s82kex) - fuck, Google lens does a better job than lazy OP ..",
        "Chandigarh mayor poll guy, he scratched off votes of AAP and Congress and so they were declared invalid, BJP won",
        "He is doing it for the Nation and Ram Rajiya.\nBanana Republic.\n\n>!/S!<",
        "Sorry man, such news should be trending i thought people know about this and not talking much. \n\nComplete news : https://www.livemint.com/politics/news/aaps-kuldeep-kumar-breaks-down-after-losing-chandigarh-mayors-post-bjp-manoj-sonkar-congress-watch-video-11706618496313.html",
        "Sorry man, i thought everyone knows since it is a big news.\nIn brief : he cancelled 8 votes of people representative so that a 7th grade pass can win Mayor post despite having no votes. \n\nComplete news : https://www.livemint.com/politics/news/aaps-kuldeep-kumar-breaks-down-after-losing-chandigarh-mayors-post-bjp-manoj-sonkar-congress-watch-video-11706618496313.html",
        "Its sad that  this still hasnt made it to mainstream media/ Primetime debates.",
        "Add this link to your post please.",
        "Context: https://www.livemint.com/politics/news/aaps-kuldeep-kumar-breaks-down-after-losing-chandigarh-mayors-post-bjp-manoj-sonkar-congress-watch-video-11706618496313.html",
        "I understand that the context has been posted, but these two thumbnails don't make an initial impression on the viewer about the message you are conveying.\n\nIs there a video from which these stills are taken?",
        "Because its anti BJP. Those media are sellouts for 10 years now, making atmosphere for Modi only. And when he wins after all these means, these corrupts label him as undefeatable.",
        "The real shame is everyone knows its a corrupt act but hey guess what? Hindus are going to get a lot of temples while muslims are being razed off. Pretty much matching to what they votes for starting 2014.",
        "Everyone would know if BJP was denied a victory",
        "Wasn't Britishers better at least they did tell yes there is no democracy? > Isn't bjp better than congress at least? \n\nChoose a better example next time.",
        "That ain't slow at all\nIt has already started\nThe autocracy is not far",
        "LOL, the guy looks the part.",
        "I don't see edit option now.",
        "Nah, Britishers era was better in terms of having clarity that they are our enemies. Nowadays people are not realising that this is straightforward threat to democracy, people are making it BJP vs Cong or AAP, if people think logically it is BJP vs Democracy not congress. \n\nIt is punishment to those 60% of chandigarh people who voted for a party but still they lost and people are not realising this breach in very fundamental right ie democracy.",
        "Yeah it doesn’t appear in image posts. Try to add sources in your posts next time onwards. Helps in more informed discussion.",
        "Thanks for pinning the link man",
        "Prostitution profession has more dignity than this bj bastards",
        "Forces in power don't want your opinion, they want your legitimation for their deeds, burry your voice in an urn and keep your mouth shut...",
        "What democracy  ?",
        "Nah, the British were not enemies and Churchill was ultimately proven right about his assessment of Indian leadership post-independence.",
        "how can it? arnab still has to talk about how irrelevant rahul gandhi is",
        "This is just shameful, see this is just a small poll for mayor, just imagine how much rigging they could have done in state and general elections. I used to think that they won't rigg evms, but after watching this video Its pretty clear BJPeeian can go any low to win and stay in power, and there chaddibhakts will still keep defending. Also no godimedia was talking about this.",
        "It is more than just corruption. \n\nIt's against democracy, the most fundamental quality of democracy that is fair election.\n\nPeople should see this from this perspective, temple and all are still fine as that was kind of election promise and had archeological backing etc.\n\nFor me more than any other city 2024 general election of Chandigarh city will be more important. Chandigarh people need to realise this thing what has been done with their freedom, including people who voted for BJP should see this as threat. \n\nBJP had exactly 50% votes in 2019 general election from Chandigarh, i would like to see a major drop in this. If chandigarh people cannot see this then this will become unstoppable.",
        "Whatever, at least they are from us only. Rest is not acceptable. \n\nThere is always chance of improvement. In British era there was no hope, they had to feedback their own nation.",
        "Hey Man, I posted one more post on same issue may I know why its its views are not even 50 in the first 48 hours? \nIt it removed from sub?",
        "Looks like you added Instagram link and automod removed the post. We do not allow direct linking of social media to protect real identity of users.",
        "Today I am glad I raised my voice and was able to think without political bias. I would be more happy to see this person behind the bars or the mastermind.",
        "Fairness is a mysterious thing.\nHope we find peace. Best wishes dude."
    ],
    "cleaned_text": "slow death democracy digital world voting small group difficult whatsapp poll replace desh drohi traitor person lost basic sense instead making things simpler small group voting much complex bureaucrats made voting system studied hard elect th grade passout wasnt britishers better least tell yes democracy please share doctor contact traitor spine issue court ordered became healthy ",
    "cleaned_title": "slow death democracy",
    "cleaned_selftext": "digital world voting small group difficult whatsapp poll replace desh drohi traitor person lost basic sense instead making things simpler small group voting much complex bureaucrats made voting system studied hard elect th grade passout wasnt britishers better least tell yes democracy please share doctor contact traitor spine issue court ordered became healthy",
    "cleaned_comments": "whats context dude yes dafuq guy know nothing man fellow give us context bro chandigarh mayor polls aapcongress accuse bjp manipulating voteshttpsnewsableasianetnewscomindiachandigarhmayorpollsaapcongressaccusebjpofmanipulatingvotessharevideowatchajrskex fuck google lens better job lazy op chandigarh mayor poll guy scratched votes aap congress declared invalid bjp nation ram rajiya banana republic sorry man news trending thought people know talking much complete news sorry man thought everyone knows since big news brief cancelled votes people representative th grade pass win mayor post despite votes complete news sad still hasnt made mainstream media primetime debates add link post please context understand context posted two thumbnails dont make initial impression viewer message conveying video stills taken anti bjp media sellouts years making atmosphere modi wins means corrupts label undefeatable real shame everyone knows corrupt act hey guess hindus going get lot temples muslims razed pretty much matching votes starting everyone would know bjp denied victory wasnt britishers better least tell yes democracy isnt bjp better congress least choose better example next time aint slow already started autocracy far lol guy looks part dont see edit option nah britishers era better terms clarity enemies nowadays people realising straightforward threat democracy people making bjp vs cong aap people think logically bjp vs democracy congress punishment chandigarh people voted party still lost people realising breach fundamental right ie democracy yeah doesnt appear image posts try add sources posts next time onwards helps informed discussion thanks pinning link man prostitution profession dignity bj bastards forces power dont want opinion want legitimation deeds burry voice urn keep mouth shut democracy nah british enemies churchill ultimately proven right assessment indian leadership postindependence arnab still talk irrelevant rahul gandhi shameful see small poll mayor imagine much rigging could done state general elections used think wont rigg evms watching video pretty clear bjpeeian go low win stay power chaddibhakts still keep defending also godimedia talking corruption democracy fundamental quality democracy fair election people see perspective temple still fine kind election promise archeological backing etc city general election chandigarh city important chandigarh people need realise thing done freedom including people voted bjp see threat bjp exactly votes general election chandigarh would like see major drop chandigarh people see become unstoppable whatever least us rest acceptable always chance improvement british era hope feedback nation hey man posted one post issue may know views even first hours removed sub looks like added instagram link automod removed post allow direct linking social media protect real identity users today glad raised voice able think without political bias would happy see person behind bars mastermind fairness mysterious thing hope find peace best wishes dude",
    "light_cleaned_title": "Is this slow death of democracy?",
    "light_cleaned_selftext": "> In this digital world, why voting in small group is so difficult? > A WhatsApp poll can replace this Desh Drohi/ traitor person. > Have we lost our basic sense? Instead of making things simpler why small group voting is this much complex? > All bureaucrats who made this voting system studied hard just to elect a 7th Grade passout!! Wasn't Britishers better at least they did tell yes there is no democracy? > Please share his doctor contact because this traitor had spine issue but when court ordered he became healthy?",
    "light_cleaned_comments": "What's the context, who is this dude .. Yes. Who dafuq is this guy? We know nothing about him man. Who is this fellow? Give us some context bro [Chandigarh mayor polls: AAP-Congress accuse BJP of manipulating votes](https://newsable.asianetnews.com/india/chandigarh-mayor-polls-aap-congress-accuse-bjp-of-manipulating-votes-share-video-watch-ajr-s82kex) - fuck, Google lens does a better job than lazy OP .. Chandigarh mayor poll guy, he scratched off votes of AAP and Congress and so they were declared invalid, BJP won He is doing it for the Nation and Ram Rajiya. Banana Republic. >!/S!< Sorry man, such news should be trending i thought people know about this and not talking much. Complete news : Sorry man, i thought everyone knows since it is a big news. In brief : he cancelled 8 votes of people representative so that a 7th grade pass can win Mayor post despite having no votes. Complete news : Its sad that this still hasnt made it to mainstream media/ Primetime debates. Add this link to your post please. Context: I understand that the context has been posted, but these two thumbnails don't make an initial impression on the viewer about the message you are conveying. Is there a video from which these stills are taken? Because its anti BJP. Those media are sellouts for 10 years now, making atmosphere for Modi only. And when he wins after all these means, these corrupts label him as undefeatable. The real shame is everyone knows its a corrupt act but hey guess what? Hindus are going to get a lot of temples while muslims are being razed off. Pretty much matching to what they votes for starting 2014. Everyone would know if BJP was denied a victory Wasn't Britishers better at least they did tell yes there is no democracy? > Isn't bjp better than congress at least? Choose a better example next time. That ain't slow at all It has already started The autocracy is not far LOL, the guy looks the part. I don't see edit option now. Nah, Britishers era was better in terms of having clarity that they are our enemies. Nowadays people are not realising that this is straightforward threat to democracy, people are making it BJP vs Cong or AAP, if people think logically it is BJP vs Democracy not congress. It is punishment to those 60% of chandigarh people who voted for a party but still they lost and people are not realising this breach in very fundamental right ie democracy. Yeah it doesn’t appear in image posts. Try to add sources in your posts next time onwards. Helps in more informed discussion. Thanks for pinning the link man Prostitution profession has more dignity than this bj bastards Forces in power don't want your opinion, they want your legitimation for their deeds, burry your voice in an urn and keep your mouth shut... What democracy ? Nah, the British were not enemies and Churchill was ultimately proven right about his assessment of Indian leadership post-independence. how can it? arnab still has to talk about how irrelevant rahul gandhi is This is just shameful, see this is just a small poll for mayor, just imagine how much rigging they could have done in state and general elections. I used to think that they won't rigg evms, but after watching this video Its pretty clear BJPeeian can go any low to win and stay in power, and there chaddibhakts will still keep defending. Also no godimedia was talking about this. It is more than just corruption. It's against democracy, the most fundamental quality of democracy that is fair election. People should see this from this perspective, temple and all are still fine as that was kind of election promise and had archeological backing etc. For me more than any other city 2024 general election of Chandigarh city will be more important. Chandigarh people need to realise this thing what has been done with their freedom, including people who voted for BJP should see this as threat. BJP had exactly 50% votes in 2019 general election from Chandigarh, i would like to see a major drop in this. If chandigarh people cannot see this then this will become unstoppable. Whatever, at least they are from us only. Rest is not acceptable. There is always chance of improvement. In British era there was no hope, they had to feedback their own nation. Hey Man, I posted one more post on same issue may I know why its its views are not even 50 in the first 48 hours? It it removed from sub? Looks like you added Instagram link and automod removed the post. We do not allow direct linking of social media to protect real identity of users. Today I am glad I raised my voice and was able to think without political bias. I would be more happy to see this person behind the bars or the mastermind. Fairness is a mysterious thing. Hope we find peace. Best wishes dude."
}