{
    "id": "1ejlgq6",
    "title": "Beware of that Foreign Job offer: Thousands of Indians are powering global scam hubs. It’s not out of choice",
    "url": "http://timesofindia.indiatimes.com/india/thousands-of-indians-are-powering-global-scam-hubs-its-not-out-of-choice/articleshow/112245733.cms",
    "selftext": "Many unsuspecting software developers are getting conned only to land up in Myanmar in these scam compounds….",
    "flair": "Crime",
    "score": 161,
    "num_comments": 17,
    "created_utc": 1722741206.0,
    "convurl": "https://external-preview.redd.it/ckc3hDe8dkBheDS9S7cwe_Yc_U8_1WiZU5hHGafqOaY.jpg?auto=webp&s=e0d69235e0309848c6cf291573ccd8fe2ccf9bc2",
    "comments": [
        "Indian is going to be scam hub",
        ">Indian is ~~going to be~~ the scam hub\n\nYou're already known for it in the US.",
        "This is happening due to innocent people being smuggled and coerced to Myanmar.",
        "Seems to be paid article. Can you share more details on how they operate?",
        "hardly, very few but majority of them are running these scams out of india. check FBI advisaries",
        "Bro I live in Delhi and I personally know 10 people who are into these scam call centres based in Delhi making 10s of crores every few months.",
        "This is called Pig Butchering. \n\n[John Oliver did a story on this few months back](https://youtu.be/pLPpl2ISKTg?si=dgJxWrCCMEMl62hQ)",
        "Major issue - cybercrime and scam on the rise. Govt should try to crack this down seriously.",
        "Can you give a link where we can actually read the article...",
        "There’s a global demand for skilled scammers from india. 😂",
        "Link is in the pic on top right of the post.",
        "And oh, the scammers are not just scamming foreigners. Plenty of Indians are being scammed every day. I personally know a few in my family circles who lost money in these scams.",
        "DO NOT REDEEEEEMMMMM!!",
        "My accountant lost 70K to a scam just 2 days back. Electricity bill will be disconnected tonight scam.",
        "There are a variety of scams.  Most of them are fairly obviously scams to average+ intelligent, upright, non-elderly people.  They aren't trying very hard on those people, they're looking for people that aren't entirely together.\n\nSo, in the US:\n\n\"We're from the IRS, and we're gonna <do something nasty> if you don't pay us right now!\"\n\n\"I'm from Microsoft, and we've detected a virus on your computer.  Give me access so I can fix it!\"\n\n\"This is the <some jail>.  Your <relative> is in jail and needs bail money!\"\n\nand innumerable variations along those lines.  If you operate on the legal edge (not paying your taxes, etc) you can be vulnerable to such things as you may not know if you really are ok or not, and paying a bit of money to make the problem go away might seem like the best option.  Or, elderly people are just fundamentally more vulnerable due to declining faculties - may not know who they owe money to, etc.\n\nThey're not after \"regular\" people for the most part, they're fishing for vulnerable people.  Once in a while, they get a regular person that wasn't paying close enough attention for whatever reason.\n\nThere are YouTube videos out there of smart people playing the scammers for entertainment and a sense of justice, if you want to look into it more.",
        "I'm aware of the IRS and Microsoft scams. I was asking about the job scam that OP is talking about."
    ],
    "cleaned_text": "beware foreign job offer thousands indians powering global scam hubs choice many unsuspecting software developers getting conned land myanmar scam compounds ",
    "cleaned_title": "beware foreign job offer thousands indians powering global scam hubs choice",
    "cleaned_selftext": "many unsuspecting software developers getting conned land myanmar scam compounds",
    "cleaned_comments": "indian going scam hub indian going scam hub youre already known us happening due innocent people smuggled coerced myanmar seems paid article share details operate hardly majority running scams india check fbi advisaries bro live delhi personally know people scam call centres based delhi making crores every months called pig butchering john oliver story months backhttpsyoutubeplpplisktgsidgjxwrccmemlhq major issue cybercrime scam rise govt try crack seriously give link actually read article theres global demand skilled scammers india link pic top right post oh scammers scamming foreigners plenty indians scammed every day personally know family circles lost money scams redeeeeemmmmm accountant lost k scam days back electricity bill disconnected tonight scam variety scams fairly obviously scams average intelligent upright nonelderly people arent trying hard people theyre looking people arent entirely together us irs gon na something nasty dont pay us right im microsoft weve detected virus computer give access fix jail relative jail needs bail money innumerable variations along lines operate legal edge paying taxes etc vulnerable things may know really ok paying bit money make problem go away might seem like best option elderly people fundamentally vulnerable due declining faculties may know owe money etc theyre regular people part theyre fishing vulnerable people get regular person wasnt paying close enough attention whatever reason youtube videos smart people playing scammers entertainment sense justice want look im aware irs microsoft scams asking job scam op talking",
    "light_cleaned_title": "Beware of that Foreign Job offer: Thousands of Indians are powering global scam hubs. It’s not out of choice",
    "light_cleaned_selftext": "Many unsuspecting software developers are getting conned only to land up in Myanmar in these scam compounds….",
    "light_cleaned_comments": "Indian is going to be scam hub >Indian is ~~going to be~~ the scam hub You're already known for it in the US. This is happening due to innocent people being smuggled and coerced to Myanmar. Seems to be paid article. Can you share more details on how they operate? hardly, very few but majority of them are running these scams out of india. check FBI advisaries Bro I live in Delhi and I personally know 10 people who are into these scam call centres based in Delhi making 10s of crores every few months. This is called Pig Butchering. [John Oliver did a story on this few months back](https://youtu.be/pLPpl2ISKTg?si=dgJxWrCCMEMl62hQ) Major issue - cybercrime and scam on the rise. Govt should try to crack this down seriously. Can you give a link where we can actually read the article... There’s a global demand for skilled scammers from india. 😂 Link is in the pic on top right of the post. And oh, the scammers are not just scamming foreigners. Plenty of Indians are being scammed every day. I personally know a few in my family circles who lost money in these scams. DO NOT REDEEEEEMMMMM!! My accountant lost 70K to a scam just 2 days back. Electricity bill will be disconnected tonight scam. There are a variety of scams. Most of them are fairly obviously scams to average+ intelligent, upright, non-elderly people. They aren't trying very hard on those people, they're looking for people that aren't entirely together. So, in the US: \"We're from the IRS, and we're gonna <do something nasty> if you don't pay us right now!\" \"I'm from Microsoft, and we've detected a virus on your computer. Give me access so I can fix it!\" \"This is the <some jail>. Your <relative> is in jail and needs bail money!\" and innumerable variations along those lines. If you operate on the legal edge (not paying your taxes, etc) you can be vulnerable to such things as you may not know if you really are ok or not, and paying a bit of money to make the problem go away might seem like the best option. Or, elderly people are just fundamentally more vulnerable due to declining faculties - may not know who they owe money to, etc. They're not after \"regular\" people for the most part, they're fishing for vulnerable people. Once in a while, they get a regular person that wasn't paying close enough attention for whatever reason. There are YouTube videos out there of smart people playing the scammers for entertainment and a sense of justice, if you want to look into it more. I'm aware of the IRS and Microsoft scams. I was asking about the job scam that OP is talking about."
}