{
    "id": "15so18f",
    "title": "Swiggy offered me compensation for late delivery and then denies it",
    "url": "https://www.reddit.com/gallery/15so18f",
    "selftext": "The order took way more than an hour to deliver and when I raised an issue about where it is they offered me a 100 rupee coupon and I accepted it. He said once the order is delivered he'd add it to my account but after it was delivered he closed the conversation. I raised an issue again and when asked about it they say there's nothing they can do.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692187544.0,
    "convurl": "https://i.redd.it/umhyxnybqgib1.png",
    "comments": [
        "Probably some newbie lol, they don’t offer coupons or refund for delivery delay unless you have their subscription that promises on time delivery.",
        "whose fault is that? i never asked for a coupon",
        "I agree. Rahul shouldn’t have offered you the coupon in the first place if you weren’t eligible.\n\nSwiggy chats are excruciating. In fact, customers chat support is painful on almost all platforms.",
        ">their subscription that promises on time delivery.\n\nI have their subscription but I don't get a refund for late deliveries either.",
        "At times, they provide coupons as compensation for delays. This happened on my previous delayed order as well. However, due to my hunger, I began eating immediately and consequently forgot about the chat, I didn't confirm the coupon offer and support closed the chat when they didn't receive any answer from me.",
        "I have recieved many coupons in past. Don't be jealous tho -- there are only two outcomes -\n\n- you cannot use coupon as coupon code is invalid or expired\n\n- SWIGGIT  (discount ₹120), your coupon (discount ₹100)",
        "I have too and they work. Not all restaurants offer 120 off, most have none at all.",
        "It's not all about only Swiggy, infact all food delivery companies have same attitude. I had also faced same issues with Domino's where they promise with 30 minutes delivery in your area. After all they delivered cold pizza in 1 hour and no compensation from that too. \n\nIt was so scary experience for me!!",
        "happened with me on a dominoes order. had some issues and the agent assured me of a full refund. suddenly the agent backtracked and said couldn't offer me one as dominoes take responsibility of it's orders. I argues with 4-5 agents after that to get me my refund as i had order through zomato so they should be responsible and to file a complaint against first and 2nd agent as they were rude and cut me off. none of the agents even acknowledged my second request and kept giving automated replies",
        "Don’t know, but specifically in Zomato gold membership , if your order gets late, you automatically gets a coupon of good value. Not sure about swiggy though",
        "Uninstalled zomato, Flipkart and amazon. Swiggys days are numbered in my phone. None of them have a good business model.",
        "Put this on their Twitter handle",
        "These look like Chatgpt replies 😂",
        "he called later to say the same thing again lol",
        "Typical strategy of every big corporate.\nInundate the client with empty words and time consuming that they give up on refunds and coupons. \nI used to get full refunds, then just quit it and stayed on Zomato. \nAll the online scamming leads to one healthy thing: Going out and eating fresh, preparing groceries etc.",
        "They are scammy bitches. Don’t forget to scam them back whenever possible.",
        "I never got one and I have zomato gold membership",
        "Can I know what went wrong with amazon? Out of all the apps you mentioned I think amazon is better than the rest.",
        "My 2 cents- Rahul was probably wrong in giving the coupon. It's just 100 bucks, and you got your food. Don't waste your time over something so measly.",
        "it's a tactic bud. if he had to offer the coupon he would've right then but he wanted to wait till it was delivered and close it. it's not about the code but a swiggy scam.",
        "Turns out Anjali was right all these years. Rahul is a cheater afterall.",
        "Give this man an award.",
        "Doubt it's an elaborate scam. High probability that one guy fucked up.",
        "Swiggy sucks monkey Dicks. I thought about ordering a Mc Chicken meal for my sick daughter from swiggy and saw it was 304 rs. My daughter insisted to go out and eat so took her there and surprise surprise it was for 170 rs.",
        "First of all, you are not chatting with any person named Rahul or Aditya. These names are common and they use this name only short and easy to remember and common name.\n\nAnd you were chatting with the Chat Bot. If they offer you a coupon they will find how much you type back in your case you said 100, so now the chatbot will say they will give a ₹100 coupon. And the same goes for another.\n\nSend a photo with text and tell them to type the message back. They are not going to type back messages.",
        "Then you might have received all your orders within time, but I have received at least 4-5 coupons due to late delivery as a Zomato Gold member. After you place the order, on the tracking screen, you get to see the exact time by when the delivery must reach you.",
        "Tweet with 3 screenshots. 1 where coupon was offered and 2 of them denying.\n\nAsk for an executive to call you as the automated responses are irrelevant",
        "Same with zomato. Delivers on time my ass.",
        "I guess it would be better if you just let it go. These businesses will cost you your cognitive enery, time, and of course money. I almost never use such services. I find it better to just buy the food myself from the nearby hotels. \nAlso, I quite literally have no faith in the privacy protection policies of these apps. You see, I came across a dataset of Zomato costumers some years ago. It had everything that shouldn't be available to public: name, address, phone number, email and order details of its customers from a certain region. And guess what, the dataset was also available on the app itself. That was the moment when I decided to never trust these Zomato and Swiggy and what not.",
        "It doesn't work with all restaurants and they just need to be within 100m of your location. Once the order is delivered after that predefined time, you're notified to collect the coupon and use within a week.",
        "I know u are all angry with swiggy, zomato other food servicing apps.. But one thing friends delivery partners working in these companies are working more than 12 hours a day. If u received food late do not blame or scream at delivery partners. Most of the time the restaurant will not prepare the food on time. They are one most ignorant. Delivery parteners alwasy try to reach food before time become time is money for them.",
        ">If u received food late do not blame or scream at delivery partners.\n\nyou're drifting off topic",
        "Email Swiggy CEO. I literally did that when they refused to refund an undelivered order with template response. Someone from management called, apologized, refunded me my money and said they're taking action on the delivery agent.",
        "i don't really want any action on the delivery agent.\n\nhow do you email the CEO directly like that tho? that's new to me. you have his email id with you already?",
        "Twice had issues with Swiggy. Once the delivery guy never reached the restaurant albeit accepting the order. Had a call with Swiggy support. Support too was unable to get in touch with delivery guy and she ended cancelling the order and I got my refund within minutes. \n\nOther time the delivery guy picked up two orders and mine was second on the queue. The tracker showed he was stationery in a location. Calling him he said he couldn't get hold of the first guy and until his order gets delivered he can't deliver mine. The app won't let him. Raised a complaint and support cancelled the order and issued a refund. Though I went hungry to bed that night. Also it irked me why the first guy would not get his order. When I see the rider near my location and not phoning me I often call him if he's unable to find the location",
        "I find all online platforms manipulative and all of them have bad business models",
        "Yeah. If they started offering coupons for late deliveries especially in a country like India where traffic can kick your ass then Swiggy would go belly up lol.",
        "I'll give a \"hypothetical\" example of how things work in the background. When you place an order, the estimated delivery time shown to you(customer) is logged as the SLA. If the delivery takes SLA+1hr, then the customer reps have freedom to give refund. During surge hours, it can change to SLA+90/120mins. \nAlso, a heads up, there's a 'fraudometer' system present which keeps an eye on how often you order, how often you raise an issue about the order and how often you get refunds/coupon. Based on this, everyone is rated on this 'fraudometer'. If you're on the red side of this 'fraudometer', no matter how genuine the issue is, the customer reps cannot generate a coupon/refund. The coupon/refund options are system generated based on this 'fraudometer' and the scenario. If you're on the red side, no matter what scenario the customer rep uses, the system doesn't generate a compensation option. That's usually when you get these outright denials and scripted messages in a loop.",
        "That’s why Zomato Gold is best, even 1 minute of delay means coupon. Often times due to delay or some f***up by the delivery partner, I had full refund.",
        "Swiggy is downright scam these days. They changed something with their wallet recently and some money I had previously disappeared. \n\nWorst customer service and shady practices.",
        "Aapke saath chota sa prank hua hai..🥲🥲",
        "\"it's just a prank\" lol",
        "Wo dekhiye camera waha hai.🥲",
        "💀",
        "They do give coupons if they get the order wrong even without subscription.",
        "They do. Not always though.",
        "You got scammed by AI Rahul 😆😆 lol",
        "Okay I'm a swiggy and zomato expert. I can tell you a few things.",
        "1. Amazon doesn't keep separate inventory by sellers. It's possible to order from authentic seller and still receive fake product because they're stored in same place in warehouse. \n\n2. Amazon's UI and navigation sucks. \n\n3. There are way too many crappy products on Amazon.",
        "They do. When there is an issue from their end, i.e. the delivery valet doesn't respond or they fail to assign one for a long time. Alternatively if it gets really late and you raise your concern, they prioritise your orders and at times offer a coupon to compensate. Swiggy has it for everyone.",
        "Swiggy doesn't have that. No on time guarantee. But if the delay is long enough, and you raise your concern, they do offer you coupons.",
        "That's wrong. I have gotten a coupon from a restaurant 10kms away from me.",
        "Only applies on online payment. Not on cash. Once your order is placed and accepted, they start a timer. If your order is even a minute late compared to the timer, you get a coupon. But you have to check the order immediately after you receive it. You get the coupon exactly where the timer was. Scratch card type coupon.",
        "Should've said that something is missing from the items you ordered and get the compensation",
        "Correction: The timer will stop once the delivery guy enters the 100m radius",
        "Sorry I meant the rider needs to be within 100m of your location to be considered \"on time\". But yes I think the restaurant can't be over 10km away.",
        "Bro, Domino's orders are handled by Domino's. Ofc they can't offer you refunds. They don't even apply their own delivery fees and stuff there. It is clearly mentioned when you order from Domino's that the delivery won't be handled by zomato/swiggy.",
        "Yea my bad, my comment was confusing.",
        "The second case happened to me once. The agent refunded the full balance as well as gave me a coupon worth half the amount of the order as an apology. And since it was really late, he also helped me connect to a few restaurants that were still open, but normally would not have serviced me due to being a fair bit far away (8km ish iirc). That was a good support agent.",
        "My funniest experience with zomato gold was this. \nI got an order late. Got a 91 rupees coupon. Used it on Wow momo's every item for 99 offer. Got that for 16 rupees. That order was also late. Got a 96 rupees coupon. Literally got another plate of the same momos for 8 rupees. Still have the fucking screenshots. That was memorable lol.",
        "I want to avoid pasting the email here but you can get it from [here](https://www.ceoemail.com/s.php?id=ceo-8433747).\n\nYes, in my case the delivery agent falsely marked the order delivered and stopped answering calls and it was very expensive group order, so the delivery agent was at fault and right deserved to be taken action on.\n\nIn your case, it's probably not worth complaining to the CEO since it's a petty mistake for a coupon.",
        "Swiggy’s and Zomato’s customer services are a pile of shit",
        "Its ok i once ordered and it got cancelled in the morning because there is no restaurant sadly",
        "I think Rahul is chatgpt he knows to calm you down",
        "I have a zomato gold subscription. This has happened multiple times when the order is eligible for late delivery coupon but if the delivery partner delays, the time either stops or extends.",
        "\"don't send me templates\" 😆. \n\nAI agent is probably sad",
        "I did that for almost 3 months 😂 my office shared a wall with a hotel making it an open google maps pin for every delivery partner. Being it in Gurugram, just to take a u-turn it was an additional 7-8KM including 3 minutes red light. I saved around ₹4000-4500 on Zomato Gold. Often ate for like ₹10-11 only.",
        "Doesn't work for all restaurants. Just today I ordered something and there was no tooltip on ETA at all. No idea what determines it.",
        "There is some other factor at play here. Also when they started doing this guarantee thing, they had to remove sorting restaurants by distance(descending order) because people intentionally ordered from far off to increase the chances of late delivery.",
        "I understand you're annoyed you didn't get hundred rupees, but you sound so rude throughout this conversation. There's no need to be rude to these people, they're doing a thankless, low paid job. It's not their fault your order is late. It costs nothing to be polite to people.",
        "Comparing the cart order from same restaurant on both the apps is better. Often I've observed the delay coupon eligible restaurants have a higher final cart amount on zomato than on swiggy. That extra amount on every order is like insurance against occasional late deliveries.",
        "Won't stack either, thats why always refund to original payment source",
        "Both Zomato and Swiggy began 2rs platform fee lmao. Their times are getting tough",
        "I have gotten coupons even when the order is late by 2-3 mins",
        "Rahul - Naam to yaad rahega na ;)",
        "Should’ve asked for a manager or supervisor. They would have granted you that coupon for sure.",
        "During rush hours and during the rainy season they don't mention on time",
        "I use swiggy one and I’ve always gotten a refund if the order is delayed beyond estimated delivery. But you ah e to contact them and have them cancel with refund. \n\nOnce you get the food, you don’t get a refund for late delivery. You can raise a complaint if food is too cold or something but it’s annoying and requires emailing them.",
        "Vishwaguru is not in favor of  freebies. But revdi is allowed so you should fight with swiggy and send them a piggy",
        "All of them are loss making.",
        "Add your post on Twitter tagging swiggy",
        "They’ve started reducing the coupon value as well. When they relaunched zomato gold it was a standard 100₹ but now it’s some algorithm generated value based on how late it was. Also if you would’ve noticed they’ve started increasing the duration the order is supposed to be delivered gradually to reduce the payouts.",
        "Swifgy are the greatest scammers in India. If you tell a restaurant that you're allergic to nuts, and they add nuts there by making the food un edible, swiggy will support the restaurant and not you. No refund. No questions asked to the restaurant. Even if I provided evidence of there being a lot of nuts.",
        "We have recently started a cloud kitchen. We have been selling food at very less price by giving customers so much discounts and we also have to pay swiggy and zomato to run ads. Since two months we have been feeding people for nothing, since we are not even getting our investment back. And the problem is that we have give these discounts to grow order numbers and ratings but there are few people who ordered ₹500 worth of food at ₹200 gave us 1\\* rating because their delivery was delayed by 10-15 mins. We know our food is good and fresh every time and we understood when the delivery guy told us that his bike broke down, we even called to apologise and her first reaction was cancel and refund me. Like all our hard work doesn’t matter because you paid ₹200. You don’t deserve services like swiggy and zomato coz u can never appreciate anything that you get without doing anything. Who do you is going to get penalised for that ₹100 coupon? These food apps are going to get double or tripple value from these hard working people you don’t care about.\n\nhttps://preview.redd.it/zsyv5yz36lib1.jpeg?width=1120&format=pjpg&auto=webp&s=1b52d9fc0730cdcfea4d0637e505680c6dff1087",
        "Yeah true. When I took the subscription, it was too cheap, like Rs.45 for 3 months, so definitely worth it",
        "not immediately but within 3 days",
        "it still is. i got it for 45rs last week and scratch card was like 77rs. worth it overall",
        "why were you scared lol",
        "You need to claim the coupon the same day. You can use it in the next 3 days.",
        "Zomato is slightly more expensive but in someways better overall",
        "Damn, I have been paying 399 every quarter.",
        "It’s still Rs.45 for a quarter for me.",
        "Thanks for the tip, will try cancellation next time"
    ],
    "cleaned_text": "swiggy offered compensation late delivery denies order took way hour deliver raised issue offered rupee coupon accepted said order delivered hed add account delivered closed conversation raised issue asked say theres nothing ",
    "cleaned_title": "swiggy offered compensation late delivery denies",
    "cleaned_selftext": "order took way hour deliver raised issue offered rupee coupon accepted said order delivered hed add account delivered closed conversation raised issue asked say theres nothing",
    "cleaned_comments": "probably newbie lol dont offer coupons refund delivery delay unless subscription promises time delivery whose fault never asked coupon agree rahul shouldnt offered coupon first place werent eligible swiggy chats excruciating fact customers chat support painful almost platforms subscription promises time delivery subscription dont get refund late deliveries either times provide coupons compensation delays happened previous delayed order well however due hunger began eating immediately consequently forgot chat didnt confirm coupon offer support closed chat didnt receive answer recieved many coupons past dont jealous tho two outcomes use coupon coupon code invalid expired swiggit discount coupon discount work restaurants offer none swiggy infact food delivery companies attitude also faced issues dominos promise minutes delivery area delivered cold pizza hour compensation scary experience happened dominoes order issues agent assured full refund suddenly agent backtracked said couldnt offer one dominoes take responsibility orders argues agents get refund order zomato responsible file complaint first nd agent rude cut none agents even acknowledged second request kept giving automated replies dont know specifically zomato gold membership order gets late automatically gets coupon good value sure swiggy though uninstalled zomato flipkart amazon swiggys days numbered phone none good business model put twitter handle look like chatgpt replies called later say thing lol typical strategy every big corporate inundate client empty words time consuming give refunds coupons used get full refunds quit stayed zomato online scamming leads one healthy thing going eating fresh preparing groceries etc scammy bitches dont forget scam back whenever possible never got one zomato gold membership know went wrong amazon apps mentioned think amazon better rest cents rahul probably wrong giving coupon bucks got food dont waste time something measly tactic bud offer coupon wouldve right wanted wait till delivered close code swiggy scam turns anjali right years rahul cheater afterall give man award doubt elaborate scam high probability one guy fucked swiggy sucks monkey dicks thought ordering mc chicken meal sick daughter swiggy saw rs daughter insisted go eat took surprise surprise rs first chatting person named rahul aditya names common use name short easy remember common name chatting chat bot offer coupon find much type back case said chatbot say give coupon goes another send photo text tell type message back going type back messages might received orders within time received least coupons due late delivery zomato gold member place order tracking screen get see exact time delivery must reach tweet screenshots coupon offered denying ask executive call automated responses irrelevant zomato delivers time ass guess would better let go businesses cost cognitive enery time course money almost never use services find better buy food nearby hotels also quite literally faith privacy protection policies apps see came across dataset zomato costumers years ago everything shouldnt available public name address phone number email order details customers certain region guess dataset also available app moment decided never trust zomato swiggy doesnt work restaurants need within location order delivered predefined time youre notified collect coupon use within week know u angry swiggy zomato food servicing apps one thing friends delivery partners working companies working hours day u received food late blame scream delivery partners time restaurant prepare food time one ignorant delivery parteners alwasy try reach food time become time money u received food late blame scream delivery partners youre drifting topic email swiggy ceo literally refused refund undelivered order template response someone management called apologized refunded money said theyre taking action delivery agent dont really want action delivery agent email ceo directly like tho thats new email id already twice issues swiggy delivery guy never reached restaurant albeit accepting order call swiggy support support unable get touch delivery guy ended cancelling order got refund within minutes time delivery guy picked two orders mine second queue tracker showed stationery location calling said couldnt get hold first guy order gets delivered cant deliver mine app wont let raised complaint support cancelled order issued refund though went hungry bed night also irked first guy would get order see rider near location phoning often call hes unable find location find online platforms manipulative bad business models yeah started offering coupons late deliveries especially country like india traffic kick ass swiggy would go belly lol ill give hypothetical example things work background place order estimated delivery time shown youcustomer logged sla delivery takes slahr customer reps freedom give refund surge hours change slamins also heads theres fraudometer system present keeps eye often order often raise issue order often get refundscoupon based everyone rated fraudometer youre red side fraudometer matter genuine issue customer reps generate couponrefund couponrefund options system generated based fraudometer scenario youre red side matter scenario customer rep uses system doesnt generate compensation option thats usually get outright denials scripted messages loop thats zomato gold best even minute delay means coupon often times due delay fup delivery partner full refund swiggy downright scam days changed something wallet recently money previously disappeared worst customer service shady practices aapke saath chota sa prank hua hai prank lol wo dekhiye camera waha hai give coupons get order wrong even without subscription always though got scammed ai rahul lol okay im swiggy zomato expert tell things amazon doesnt keep separate inventory sellers possible order authentic seller still receive fake product theyre stored place warehouse amazons ui navigation sucks way many crappy products amazon issue end ie delivery valet doesnt respond fail assign one long time alternatively gets really late raise concern prioritise orders times offer coupon compensate swiggy everyone swiggy doesnt time guarantee delay long enough raise concern offer coupons thats wrong gotten coupon restaurant kms away applies online payment cash order placed accepted start timer order even minute late compared timer get coupon check order immediately receive get coupon exactly timer scratch card type coupon shouldve said something missing items ordered get compensation correction timer stop delivery guy enters radius sorry meant rider needs within location considered time yes think restaurant cant km away bro dominos orders handled dominos ofc cant offer refunds dont even apply delivery fees stuff clearly mentioned order dominos delivery wont handled zomatoswiggy yea bad comment confusing second case happened agent refunded full balance well gave coupon worth half amount order apology since really late also helped connect restaurants still open normally would serviced due fair bit far away km ish iirc good support agent funniest experience zomato gold got order late got rupees coupon used wow momos every item offer got rupees order also late got rupees coupon literally got another plate momos rupees still fucking screenshots memorable lol want avoid pasting email get herehttpswwwceoemailcomsphpidceo yes case delivery agent falsely marked order delivered stopped answering calls expensive group order delivery agent fault right deserved taken action case probably worth complaining ceo since petty mistake coupon swiggys zomatos customer services pile shit ok ordered got cancelled morning restaurant sadly think rahul chatgpt knows calm zomato gold subscription happened multiple times order eligible late delivery coupon delivery partner delays time either stops extends dont send templates ai agent probably sad almost months office shared wall hotel making open google maps pin every delivery partner gurugram take uturn additional km including minutes red light saved around zomato gold often ate like doesnt work restaurants today ordered something tooltip eta idea determines factor play also started guarantee thing remove sorting restaurants distancedescending order people intentionally ordered far increase chances late delivery understand youre annoyed didnt get hundred rupees sound rude throughout conversation theres need rude people theyre thankless low paid job fault order late costs nothing polite people comparing cart order restaurant apps better often ive observed delay coupon eligible restaurants higher final cart amount zomato swiggy extra amount every order like insurance occasional late deliveries wont stack either thats always refund original payment source zomato swiggy began rs platform fee lmao times getting tough gotten coupons even order late mins rahul naam yaad rahega na shouldve asked manager supervisor would granted coupon sure rush hours rainy season dont mention time use swiggy one ive always gotten refund order delayed beyond estimated delivery ah e contact cancel refund get food dont get refund late delivery raise complaint food cold something annoying requires emailing vishwaguru favor freebies revdi allowed fight swiggy send piggy loss making add post twitter tagging swiggy theyve started reducing coupon value well relaunched zomato gold standard algorithm generated value based late also wouldve noticed theyve started increasing duration order supposed delivered gradually reduce payouts swifgy greatest scammers india tell restaurant youre allergic nuts add nuts making food un edible swiggy support restaurant refund questions asked restaurant even provided evidence lot nuts recently started cloud kitchen selling food less price giving customers much discounts also pay swiggy zomato run ads since two months feeding people nothing since even getting investment back problem give discounts grow order numbers ratings people ordered worth food gave us rating delivery delayed mins know food good fresh every time understood delivery guy told us bike broke even called apologise first reaction cancel refund like hard work doesnt matter paid dont deserve services like swiggy zomato coz u never appreciate anything get without anything going get penalised coupon food apps going get double tripple value hard working people dont care yeah true took subscription cheap like rs months definitely worth immediately within days still got rs last week scratch card like rs worth overall scared lol need claim coupon day use next days zomato slightly expensive someways better overall damn paying every quarter still rs quarter thanks tip try cancellation next time",
    "light_cleaned_title": "Swiggy offered me compensation for late delivery and then denies it",
    "light_cleaned_selftext": "The order took way more than an hour to deliver and when I raised an issue about where it is they offered me a 100 rupee coupon and I accepted it. He said once the order is delivered he'd add it to my account but after it was delivered he closed the conversation. I raised an issue again and when asked about it they say there's nothing they can do.",
    "light_cleaned_comments": "Probably some newbie lol, they don’t offer coupons or refund for delivery delay unless you have their subscription that promises on time delivery. whose fault is that? i never asked for a coupon I agree. Rahul shouldn’t have offered you the coupon in the first place if you weren’t eligible. Swiggy chats are excruciating. In fact, customers chat support is painful on almost all platforms. >their subscription that promises on time delivery. I have their subscription but I don't get a refund for late deliveries either. At times, they provide coupons as compensation for delays. This happened on my previous delayed order as well. However, due to my hunger, I began eating immediately and consequently forgot about the chat, I didn't confirm the coupon offer and support closed the chat when they didn't receive any answer from me. I have recieved many coupons in past. Don't be jealous tho -- there are only two outcomes - - you cannot use coupon as coupon code is invalid or expired - SWIGGIT (discount ₹120), your coupon (discount ₹100) I have too and they work. Not all restaurants offer 120 off, most have none at all. It's not all about only Swiggy, infact all food delivery companies have same attitude. I had also faced same issues with Domino's where they promise with 30 minutes delivery in your area. After all they delivered cold pizza in 1 hour and no compensation from that too. It was so scary experience for me!! happened with me on a dominoes order. had some issues and the agent assured me of a full refund. suddenly the agent backtracked and said couldn't offer me one as dominoes take responsibility of it's orders. I argues with 4-5 agents after that to get me my refund as i had order through zomato so they should be responsible and to file a complaint against first and 2nd agent as they were rude and cut me off. none of the agents even acknowledged my second request and kept giving automated replies Don’t know, but specifically in Zomato gold membership , if your order gets late, you automatically gets a coupon of good value. Not sure about swiggy though Uninstalled zomato, Flipkart and amazon. Swiggys days are numbered in my phone. None of them have a good business model. Put this on their Twitter handle These look like Chatgpt replies 😂 he called later to say the same thing again lol Typical strategy of every big corporate. Inundate the client with empty words and time consuming that they give up on refunds and coupons. I used to get full refunds, then just quit it and stayed on Zomato. All the online scamming leads to one healthy thing: Going out and eating fresh, preparing groceries etc. They are scammy bitches. Don’t forget to scam them back whenever possible. I never got one and I have zomato gold membership Can I know what went wrong with amazon? Out of all the apps you mentioned I think amazon is better than the rest. My 2 cents- Rahul was probably wrong in giving the coupon. It's just 100 bucks, and you got your food. Don't waste your time over something so measly. it's a tactic bud. if he had to offer the coupon he would've right then but he wanted to wait till it was delivered and close it. it's not about the code but a swiggy scam. Turns out Anjali was right all these years. Rahul is a cheater afterall. Give this man an award. Doubt it's an elaborate scam. High probability that one guy fucked up. Swiggy sucks monkey Dicks. I thought about ordering a Mc Chicken meal for my sick daughter from swiggy and saw it was 304 rs. My daughter insisted to go out and eat so took her there and surprise surprise it was for 170 rs. First of all, you are not chatting with any person named Rahul or Aditya. These names are common and they use this name only short and easy to remember and common name. And you were chatting with the Chat Bot. If they offer you a coupon they will find how much you type back in your case you said 100, so now the chatbot will say they will give a ₹100 coupon. And the same goes for another. Send a photo with text and tell them to type the message back. They are not going to type back messages. Then you might have received all your orders within time, but I have received at least 4-5 coupons due to late delivery as a Zomato Gold member. After you place the order, on the tracking screen, you get to see the exact time by when the delivery must reach you. Tweet with 3 screenshots. 1 where coupon was offered and 2 of them denying. Ask for an executive to call you as the automated responses are irrelevant Same with zomato. Delivers on time my ass. I guess it would be better if you just let it go. These businesses will cost you your cognitive enery, time, and of course money. I almost never use such services. I find it better to just buy the food myself from the nearby hotels. Also, I quite literally have no faith in the privacy protection policies of these apps. You see, I came across a dataset of Zomato costumers some years ago. It had everything that shouldn't be available to public: name, address, phone number, email and order details of its customers from a certain region. And guess what, the dataset was also available on the app itself. That was the moment when I decided to never trust these Zomato and Swiggy and what not. It doesn't work with all restaurants and they just need to be within 100m of your location. Once the order is delivered after that predefined time, you're notified to collect the coupon and use within a week. I know u are all angry with swiggy, zomato other food servicing apps.. But one thing friends delivery partners working in these companies are working more than 12 hours a day. If u received food late do not blame or scream at delivery partners. Most of the time the restaurant will not prepare the food on time. They are one most ignorant. Delivery parteners alwasy try to reach food before time become time is money for them. >If u received food late do not blame or scream at delivery partners. you're drifting off topic Email Swiggy CEO. I literally did that when they refused to refund an undelivered order with template response. Someone from management called, apologized, refunded me my money and said they're taking action on the delivery agent. i don't really want any action on the delivery agent. how do you email the CEO directly like that tho? that's new to me. you have his email id with you already? Twice had issues with Swiggy. Once the delivery guy never reached the restaurant albeit accepting the order. Had a call with Swiggy support. Support too was unable to get in touch with delivery guy and she ended cancelling the order and I got my refund within minutes. Other time the delivery guy picked up two orders and mine was second on the queue. The tracker showed he was stationery in a location. Calling him he said he couldn't get hold of the first guy and until his order gets delivered he can't deliver mine. The app won't let him. Raised a complaint and support cancelled the order and issued a refund. Though I went hungry to bed that night. Also it irked me why the first guy would not get his order. When I see the rider near my location and not phoning me I often call him if he's unable to find the location I find all online platforms manipulative and all of them have bad business models Yeah. If they started offering coupons for late deliveries especially in a country like India where traffic can kick your ass then Swiggy would go belly up lol. I'll give a \"hypothetical\" example of how things work in the background. When you place an order, the estimated delivery time shown to you(customer) is logged as the SLA. If the delivery takes SLA+1hr, then the customer reps have freedom to give refund. During surge hours, it can change to SLA+90/120mins. Also, a heads up, there's a 'fraudometer' system present which keeps an eye on how often you order, how often you raise an issue about the order and how often you get refunds/coupon. Based on this, everyone is rated on this 'fraudometer'. If you're on the red side of this 'fraudometer', no matter how genuine the issue is, the customer reps cannot generate a coupon/refund. The coupon/refund options are system generated based on this 'fraudometer' and the scenario. If you're on the red side, no matter what scenario the customer rep uses, the system doesn't generate a compensation option. That's usually when you get these outright denials and scripted messages in a loop. That’s why Zomato Gold is best, even 1 minute of delay means coupon. Often times due to delay or some f***up by the delivery partner, I had full refund. Swiggy is downright scam these days. They changed something with their wallet recently and some money I had previously disappeared. Worst customer service and shady practices. Aapke saath chota sa prank hua hai..🥲🥲 \"it's just a prank\" lol Wo dekhiye camera waha hai.🥲 💀 They do give coupons if they get the order wrong even without subscription. They do. Not always though. You got scammed by AI Rahul 😆😆 lol Okay I'm a swiggy and zomato expert. I can tell you a few things. 1. Amazon doesn't keep separate inventory by sellers. It's possible to order from authentic seller and still receive fake product because they're stored in same place in warehouse. 2. Amazon's UI and navigation sucks. 3. There are way too many crappy products on Amazon. They do. When there is an issue from their end, i.e. the delivery valet doesn't respond or they fail to assign one for a long time. Alternatively if it gets really late and you raise your concern, they prioritise your orders and at times offer a coupon to compensate. Swiggy has it for everyone. Swiggy doesn't have that. No on time guarantee. But if the delay is long enough, and you raise your concern, they do offer you coupons. That's wrong. I have gotten a coupon from a restaurant 10kms away from me. Only applies on online payment. Not on cash. Once your order is placed and accepted, they start a timer. If your order is even a minute late compared to the timer, you get a coupon. But you have to check the order immediately after you receive it. You get the coupon exactly where the timer was. Scratch card type coupon. Should've said that something is missing from the items you ordered and get the compensation Correction: The timer will stop once the delivery guy enters the 100m radius Sorry I meant the rider needs to be within 100m of your location to be considered \"on time\". But yes I think the restaurant can't be over 10km away. Bro, Domino's orders are handled by Domino's. Ofc they can't offer you refunds. They don't even apply their own delivery fees and stuff there. It is clearly mentioned when you order from Domino's that the delivery won't be handled by zomato/swiggy. Yea my bad, my comment was confusing. The second case happened to me once. The agent refunded the full balance as well as gave me a coupon worth half the amount of the order as an apology. And since it was really late, he also helped me connect to a few restaurants that were still open, but normally would not have serviced me due to being a fair bit far away (8km ish iirc). That was a good support agent. My funniest experience with zomato gold was this. I got an order late. Got a 91 rupees coupon. Used it on Wow momo's every item for 99 offer. Got that for 16 rupees. That order was also late. Got a 96 rupees coupon. Literally got another plate of the same momos for 8 rupees. Still have the fucking screenshots. That was memorable lol. I want to avoid pasting the email here but you can get it from [here](https://www.ceoemail.com/s.php?id=ceo-8433747). Yes, in my case the delivery agent falsely marked the order delivered and stopped answering calls and it was very expensive group order, so the delivery agent was at fault and right deserved to be taken action on. In your case, it's probably not worth complaining to the CEO since it's a petty mistake for a coupon. Swiggy’s and Zomato’s customer services are a pile of shit Its ok i once ordered and it got cancelled in the morning because there is no restaurant sadly I think Rahul is chatgpt he knows to calm you down I have a zomato gold subscription. This has happened multiple times when the order is eligible for late delivery coupon but if the delivery partner delays, the time either stops or extends. \"don't send me templates\" 😆. AI agent is probably sad I did that for almost 3 months 😂 my office shared a wall with a hotel making it an open google maps pin for every delivery partner. Being it in Gurugram, just to take a u-turn it was an additional 7-8KM including 3 minutes red light. I saved around ₹4000-4500 on Zomato Gold. Often ate for like ₹10-11 only. Doesn't work for all restaurants. Just today I ordered something and there was no tooltip on ETA at all. No idea what determines it. There is some other factor at play here. Also when they started doing this guarantee thing, they had to remove sorting restaurants by distance(descending order) because people intentionally ordered from far off to increase the chances of late delivery. I understand you're annoyed you didn't get hundred rupees, but you sound so rude throughout this conversation. There's no need to be rude to these people, they're doing a thankless, low paid job. It's not their fault your order is late. It costs nothing to be polite to people. Comparing the cart order from same restaurant on both the apps is better. Often I've observed the delay coupon eligible restaurants have a higher final cart amount on zomato than on swiggy. That extra amount on every order is like insurance against occasional late deliveries. Won't stack either, thats why always refund to original payment source Both Zomato and Swiggy began 2rs platform fee lmao. Their times are getting tough I have gotten coupons even when the order is late by 2-3 mins Rahul - Naam to yaad rahega na ;) Should’ve asked for a manager or supervisor. They would have granted you that coupon for sure. During rush hours and during the rainy season they don't mention on time I use swiggy one and I’ve always gotten a refund if the order is delayed beyond estimated delivery. But you ah e to contact them and have them cancel with refund. Once you get the food, you don’t get a refund for late delivery. You can raise a complaint if food is too cold or something but it’s annoying and requires emailing them. Vishwaguru is not in favor of freebies. But revdi is allowed so you should fight with swiggy and send them a piggy All of them are loss making. Add your post on Twitter tagging swiggy They’ve started reducing the coupon value as well. When they relaunched zomato gold it was a standard 100₹ but now it’s some algorithm generated value based on how late it was. Also if you would’ve noticed they’ve started increasing the duration the order is supposed to be delivered gradually to reduce the payouts. Swifgy are the greatest scammers in India. If you tell a restaurant that you're allergic to nuts, and they add nuts there by making the food un edible, swiggy will support the restaurant and not you. No refund. No questions asked to the restaurant. Even if I provided evidence of there being a lot of nuts. We have recently started a cloud kitchen. We have been selling food at very less price by giving customers so much discounts and we also have to pay swiggy and zomato to run ads. Since two months we have been feeding people for nothing, since we are not even getting our investment back. And the problem is that we have give these discounts to grow order numbers and ratings but there are few people who ordered ₹500 worth of food at ₹200 gave us 1\\* rating because their delivery was delayed by 10-15 mins. We know our food is good and fresh every time and we understood when the delivery guy told us that his bike broke down, we even called to apologise and her first reaction was cancel and refund me. Like all our hard work doesn’t matter because you paid ₹200. You don’t deserve services like swiggy and zomato coz u can never appreciate anything that you get without doing anything. Who do you is going to get penalised for that ₹100 coupon? These food apps are going to get double or tripple value from these hard working people you don’t care about. Yeah true. When I took the subscription, it was too cheap, like Rs.45 for 3 months, so definitely worth it not immediately but within 3 days it still is. i got it for 45rs last week and scratch card was like 77rs. worth it overall why were you scared lol You need to claim the coupon the same day. You can use it in the next 3 days. Zomato is slightly more expensive but in someways better overall Damn, I have been paying 399 every quarter. It’s still Rs.45 for a quarter for me. Thanks for the tip, will try cancellation next time"
}