{
    "id": "14ymeue",
    "title": "Psychology Survey Help",
    "url": "https://www.reddit.com/r/india/comments/14ymeue/psychology_survey_help/",
    "selftext": "My friend is doing a psychology survey on the mentality of indian people in accordance to same sex marriage. It'll be of great help if you can fill up the google form [here.](https://forms.gle/EpRCKCrCzoz4VQoaA)  It'll take only 2 minutes so please share your opinion. Thankyou! ",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1689258609.0,
    "convurl": "https://external-preview.redd.it/bLaKdHZz8-dNdJGrgolSkMnVKn9K5W34tjWVsIi-RrU.jpg?auto=webp&s=412bb2d9cba6b2a50f2fe281d3b4435a7e042843",
    "comments": [
        "Even after working in market research for 6 years, I still don't understand the point of 5 point scales. Also changing levels of action like the would/do questions are going to generate bad data.\n\nThat being said I filled this out except the last three questions because they are too loaded to be dropped on someone as they are."
    ],
    "cleaned_text": "psychology survey help friend psychology survey mentality indian people accordance sex marriage itll great help fill google form herehttpsformsgleeprckcrczozvqoaa itll take minutes please share opinion thankyou ",
    "cleaned_title": "psychology survey help",
    "cleaned_selftext": "friend psychology survey mentality indian people accordance sex marriage itll great help fill google form herehttpsformsgleeprckcrczozvqoaa itll take minutes please share opinion thankyou",
    "cleaned_comments": "even working market research years still dont understand point point scales also changing levels action like woulddo questions going generate bad data said filled except last three questions loaded dropped someone",
    "light_cleaned_title": "Psychology Survey Help",
    "light_cleaned_selftext": "My friend is doing a psychology survey on the mentality of indian people in accordance to same sex marriage. It'll be of great help if you can fill up the google form [here.](https://forms.gle/EpRCKCrCzoz4VQoaA) It'll take only 2 minutes so please share your opinion. Thankyou!",
    "light_cleaned_comments": "Even after working in market research for 6 years, I still don't understand the point of 5 point scales. Also changing levels of action like the would/do questions are going to generate bad data. That being said I filled this out except the last three questions because they are too loaded to be dropped on someone as they are."
}