{
    "id": "1bjyew3",
    "title": "My Experience with Online Fraud: Dealing with Cyber Police in Delhi, India",
    "url": "https://www.reddit.com/gallery/1bjyew3",
    "selftext": "So last Thursday (14.3.2024)came across an Instagram page through ads, selling Converse shoes. It looked genuine and even offered cash on delivery (COD) as well as the address for the shop. So I didn’t bother much, and paid him 200 in advance, with the remaining amount supposed to be paid at the time of delivery (the product was priced at 1300). At the time of delivery, I insisted on checking the product before paying the remaining amount, but the person declined and said the product is eligible for returns since it’s shipped through Amazon’s shipping network. I was satisfied and went ahead with opening the package, only to find out it was a fraud. I was given duplicate shoes barely costing 200-400 rupees in the local market. When I reached out to the seller, he blocked me.\nThat was a shock for me, considering I have been cautious most of the time. I tried to reach out to him on the given number, but it was switched, only used for either accepting payments or texting through WhatsApp. The audacity of cybercriminals running business accounts on WhatsApp & Instagram, and running ads to lure victims, is appalling. I wasted no time and filed an e-complaint with @cybercrimebranch. I tried calling 1930, a helpline number for cyber police, at least 15 times, but either the call was dropped or they picked up and hung up on me. I was not satisfied with the actions I took, so I went to the normal police station. They were rude and didn’t even bother to talk, just said, “Formality ke liye ek application likh do, baaki cyber wale hi dekhenge.” I left with disappointment. The next day, I went to the Cybercrime East Delhi branch’s station, asked them about the status of the investigation. Again, the unprofessional behavior, showing me a pile of papers (complaints) that had come in a single day, convincing me that there are bigger cases than these. Nobody does anything because the resources spent behind such cases are not deemed worth it. I still insisted and requested them to look into it. I left again with disappointment, knowing that I was not going to get my money back.\nIn today’s era, where India is taking big initiatives to promote Digital Bharat and become a global power in the digital world, cybersecurity is still left out on a really big scale.\nScammer’s Instagram page: bootscience_56",
    "flair": "Crime",
    "score": 3,
    "num_comments": 5,
    "created_utc": 1710996170.0,
    "convurl": "https://i.redd.it/2kjhm3b2ampc1.jpg",
    "comments": [
        "Police in India are shit, they have shitty process and often times they will disappoint you. That being aside, who buys branded shoes from Instagram? Converse literally says they have partnered with select few websites in india like myntra to sell their stuff online. Why would you go for some random instagram account ?",
        "Other than lack of resources , the police force was setup in colonial times to serve the Govt of the day , this still continues to be their attitude .Common people can take a hike.. While there are genuine and good police officers , they very few.\n\nSo you have no options but to always be on the alert and ensure you do not get into situations which require their help."
    ],
    "cleaned_text": "experience online fraud dealing cyber police delhi india last thursday came across instagram page ads selling converse shoes looked genuine even offered cash delivery cod well address shop didnt bother much paid advance remaining amount supposed paid time delivery product priced time delivery insisted checking product paying remaining amount person declined said product eligible returns since shipped amazons shipping network satisfied went ahead opening package find fraud given duplicate shoes barely costing rupees local market reached seller blocked shock considering cautious time tried reach given number switched used either accepting payments texting whatsapp audacity cybercriminals running business accounts whatsapp instagram running ads lure victims appalling wasted time filed ecomplaint cybercrimebranch tried calling helpline number cyber police least times either call dropped picked hung satisfied actions took went normal police station rude didnt even bother talk said formality ke liye ek application likh baaki cyber wale hi dekhenge left disappointment next day went cybercrime east delhi branchs station asked status investigation unprofessional behavior showing pile papers complaints come single day convincing bigger cases nobody anything resources spent behind cases deemed worth still insisted requested look left disappointment knowing going get money back todays era india taking big initiatives promote digital bharat become global power digital world cybersecurity still left really big scale scammers instagram page bootscience ",
    "cleaned_title": "experience online fraud dealing cyber police delhi india",
    "cleaned_selftext": "last thursday came across instagram page ads selling converse shoes looked genuine even offered cash delivery cod well address shop didnt bother much paid advance remaining amount supposed paid time delivery product priced time delivery insisted checking product paying remaining amount person declined said product eligible returns since shipped amazons shipping network satisfied went ahead opening package find fraud given duplicate shoes barely costing rupees local market reached seller blocked shock considering cautious time tried reach given number switched used either accepting payments texting whatsapp audacity cybercriminals running business accounts whatsapp instagram running ads lure victims appalling wasted time filed ecomplaint cybercrimebranch tried calling helpline number cyber police least times either call dropped picked hung satisfied actions took went normal police station rude didnt even bother talk said formality ke liye ek application likh baaki cyber wale hi dekhenge left disappointment next day went cybercrime east delhi branchs station asked status investigation unprofessional behavior showing pile papers complaints come single day convincing bigger cases nobody anything resources spent behind cases deemed worth still insisted requested look left disappointment knowing going get money back todays era india taking big initiatives promote digital bharat become global power digital world cybersecurity still left really big scale scammers instagram page bootscience",
    "cleaned_comments": "police india shit shitty process often times disappoint aside buys branded shoes instagram converse literally says partnered select websites india like myntra sell stuff online would go random instagram account lack resources police force setup colonial times serve govt day still continues attitude common people take hike genuine good police officers options always alert ensure get situations require help",
    "light_cleaned_title": "My Experience with Online Fraud: Dealing with Cyber Police in Delhi, India",
    "light_cleaned_selftext": "So last Thursday (14.3.2024)came across an Instagram page through ads, selling Converse shoes. It looked genuine and even offered cash on delivery (COD) as well as the address for the shop. So I didn’t bother much, and paid him 200 in advance, with the remaining amount supposed to be paid at the time of delivery (the product was priced at 1300). At the time of delivery, I insisted on checking the product before paying the remaining amount, but the person declined and said the product is eligible for returns since it’s shipped through Amazon’s shipping network. I was satisfied and went ahead with opening the package, only to find out it was a fraud. I was given duplicate shoes barely costing 200-400 rupees in the local market. When I reached out to the seller, he blocked me. That was a shock for me, considering I have been cautious most of the time. I tried to reach out to him on the given number, but it was switched, only used for either accepting payments or texting through WhatsApp. The audacity of cybercriminals running business accounts on WhatsApp & Instagram, and running ads to lure victims, is appalling. I wasted no time and filed an e-complaint with @cybercrimebranch. I tried calling 1930, a helpline number for cyber police, at least 15 times, but either the call was dropped or they picked up and hung up on me. I was not satisfied with the actions I took, so I went to the normal police station. They were rude and didn’t even bother to talk, just said, “Formality ke liye ek application likh do, baaki cyber wale hi dekhenge.” I left with disappointment. The next day, I went to the Cybercrime East Delhi branch’s station, asked them about the status of the investigation. Again, the unprofessional behavior, showing me a pile of papers (complaints) that had come in a single day, convincing me that there are bigger cases than these. Nobody does anything because the resources spent behind such cases are not deemed worth it. I still insisted and requested them to look into it. I left again with disappointment, knowing that I was not going to get my money back. In today’s era, where India is taking big initiatives to promote Digital Bharat and become a global power in the digital world, cybersecurity is still left out on a really big scale. Scammer’s Instagram page: bootscience_56",
    "light_cleaned_comments": "Police in India are shit, they have shitty process and often times they will disappoint you. That being aside, who buys branded shoes from Instagram? Converse literally says they have partnered with select few websites in india like myntra to sell their stuff online. Why would you go for some random instagram account ? Other than lack of resources , the police force was setup in colonial times to serve the Govt of the day , this still continues to be their attitude .Common people can take a hike.. While there are genuine and good police officers , they very few. So you have no options but to always be on the alert and ensure you do not get into situations which require their help."
}