{
    "id": "1dxgdg4",
    "title": "How brands cheat people. Now even reading the ingredients is not enough.",
    "url": "https://www.reddit.com/gallery/1dxgdg4",
    "selftext": "37% ADDED sugar but no mention of it in the ingredient list. How can this be legal.\n\nI know it's written in nutritional facts, but how can they exclude it from the ingredient list when it's the main ingredient!!\n\n",
    "flair": "Rant / Vent",
    "score": 1701,
    "num_comments": 213,
    "created_utc": 1720358452.0,
    "convurl": "https://i.redd.it/ojcpuidxk3bd1.jpg",
    "comments": [
        "Hello Foodpharmer",
        "Perhaps the dried fruits are dipped in sugary liquid and dried again.",
        "I think India should be stricter in food regulations. Need a revolution.",
        "[In an official statement, the Food Safety and Standards Authority of India (FSSAI) said it has approved \"a proposal to display nutritional information regarding total sugar, salt and saturated fat in bold letters and relatively increased font size on labels of packaged food items\".](https://indianexpress.com/article/india/fssai-mandatory-labelling-salt-sugar-fat-packaged-food-items-bold-letters-bigger-font-9437230/)",
        "Tbh, we are talking about India here, and I have lost hope anything will change here",
        "It will man.\n\nHorlicks had to remove \" health drink\" from ads.",
        "One can only hope",
        "Couldn't someone sue them for this?",
        "You think so?",
        "Armed revolution",
        "Whorelicks",
        "https://preview.redd.it/f3xdvjp6u3bd1.png?width=1080&format=pjpg&auto=webp&s=684207b3492425b7c3487777ba54a09863294771",
        "Bro thats the sugar from the dried fruits, not added. The fruits are dried in a sugar solution to increase their lifetime.",
        "\"Added sugar\"",
        "Need a revolution in people",
        "People are actually reading ingredients now. It's so good to see people trying to lead a healthy life and are asking right questions out in public. Thanks to foodpharmer ig. ",
        "Yeah. Makes sense. \nI guess their cheat is their interpretation of \"dried fruit\". But actually adding sugar.",
        "You are right. Nowadays, most people don't pay attention to these kinds of details, but food companies are very clever.",
        "> India should be stricter in food regulations \n\nBuhahahahahahahaha! Gaand mn danda vro...as if govt cares about common people's life here.",
        "Don't know about the second one tho the first one has dried strawberry, kiwi and dried mango. All of them which i have bought out of the market and they have grainy powder sugar coated over them. So this might be it...m",
        "No offense to anyone in the flesh trade, a far more noble profession than whatever these deceitful companies are doing.",
        "I will bring my star wars swords and SPD red ranger mask. Let’s do this",
        "We can neither increase quality of standards nor enforce them without increasing state capacity. Given how things are, awareness and bringing it up on social media (aka armchair activism) is the best thing. Also, the bottom up approach works very well especially in the longer term.",
        "We should adopt systems like in Spain, Germany and Netherlands that grades every packaged food from A to E, A being the healthiest, I just a reel about that. \nBut that would bring a lot of backlash from food companies.",
        "I bought the same thing a couple of days ago thinking it was just fruits, I looked at the ingredients and it had no mention of sugar so I got it, seeing the added sugar I was shocked. Tried returning it on zepto but couldn’t 😭 honestly sucks man",
        "Not gonna happen, they’ll buy bonds and case will shut",
        "They'll just buy the govt food inspectors and change the rating. \n\nJust like the article that says coke is better than milk by a so called expert.",
        "India is too far gone in government worship to have any sort of meaningful revolution.",
        "India needs a bureaucratic revolution. People hate red tape but it's the only thing keeping society in order.",
        "Half the people don't even know eating that much sugar is very very bad for their bodies. Eternal vigilance by informed and concerned people (like op), forcing fssai to control these elements seems to be the only way ahead",
        "Bro your statement is contradictory.",
        "The attitude of corporate brands is probably that the country has more people than land available, so it does not matter if certain percentage of people suffer from poison , Indian society will make more anyways lol.",
        "I belong to food processing industry, cranberry preservation needs little addition of sugar and it is inevitable. 5% to 8% of sugar is added to make it palatable otherwise it will be so tart and acidic.\n\nThe worst component in the shown photo is dried strawberry, dried mangoes, dried kiwis. Usually these are imported from Thailand and they contain very high percentage 10% to 25% of added sugar, colours and high ppm of sulfur or cocktail of preservatives.\n\nAlways consume preservatives colors and additives free naturally dried fruits, of course these dried fruits will be dull in colour.",
        "Are you with the corporate on this or people?",
        "I am from the food industry and this is my take:\n\n1. From the Food Safety Act 2006, Regulations 2011 and many more, FSSAI is progressing with food regulations. One should keep in mind that it is a science and always evolving with new risks etc. (So the law is there and nearly at par with world standards! FSSAI bases itself mostly on the Codex Alimentarious.)\n\n2. Enforcement of these regulations: that's the weak link where all food labels, recipes, etc can't be validated / checked by FSSAI and then we will be in a massive bureaucratic bottleneck. So there are some audits and checks but unfortunately companies can bribe the officials and get around it.\n\n3. The onus of being conform to the law therefore fall on each manufacturer, producer etc. I have worked inside many food companies and many take their task seriously and are confirm to the law but there are many that think only of the bottom line. The culture of food safety emanates from the top management of the company. (Sometimes it's just an honest mistake because its a very complex industry with complex laws)\n\n4. And the final responsibility to hold producers accountable is on the consumer. I will encourage you to shoot and email to the manufacturer with the picture of the product, the batch number and ask for a clarification. If you don't get a satisfactory answer then reach out to FSSAI. The authority has developed helplines for consumers. I encourage you all to voice your dissatisfaction directly with the company first. Maybe they have an explanation to your query. Maybe they will admit their mistake, give you a free exchange of your defective product... \n\nI hope this helps. :)",
        "These companies are very clever. I can assure you they are using some kind of technical loop hole. It's useless to sue them they have a huge amount of legal advisers and infact know what they are doing most of the times.",
        "Well, you all could NOT purchase or eat this cr*p, but who is willing to listen to advice that preaches austerity, lol",
        "I believe, using skill india , the government can train testing associates for fssai and provide them jobs. It’s about execution.",
        "andha hai kya lwde?",
        "[The Revolution](https://youtu.be/IiiiHwhPAU0?si=7WDV-7WFsnu-Qc1g) this country needs.",
        "Its not a fraud. Some of those ingredients have added sugar in them (mostly dried items). They haven't added sugar separately, so they shouldn't mention it in ingredients list",
        "This is how ads work on people..",
        "Just buy a damn plum. Why do you need things in plastic packs with bright colours",
        "Yes it's because they haven't added sugar in the ingredients list but since the product has added sugar they have to mention in the nutrition list. So they dip it in sugar syrup because sugar acts as a preservative. \n\nNow obviously they could have used less sugar but why they added 37g of sugar for 100g it's stupid. Now other brands also do this usually for fried berries and dried fruits for eg happilo also use the same thing in their products but their sugar content is much less than this they add 22g of sugar for 100g so it's actually better than this.",
        "how does it work?",
        "Most of the dried fruits is basically candy anyways. The process itself involves boiling them in sugar syrup and then drying them . Figs , kiwi, mango ,citrus fruits,plums  are the ones with the most sugar . No way they should be called/labelled as healthy at all .\n\nDehydrated fruits on the other hand with zero added ingredients is a whole different thing and something that you won't find easily .",
        "But this will increase the cost of food. Reality is we can't afford increased food regulations.",
        "Bro totally didn't get what you're trying to say. Sugar is supposed to be an ingredient right",
        "That's what I plan to do from now",
        "I mean this is probably legal which is why they are able to do it. We need stricter laws.",
        "Its not just in India. This problem is all over rhe world. Processed food always has high level of sugars no matter country",
        "Thanks for the info, will totally avoid all this packaged stuff now.",
        "Yes! I recently discovered this post foodpharmer’s podcast about reading labels. I was shocked! \nI used Farmley berries mix every morning with my oats.\nAfter reading the nutritional facts, I discontinued using the same.\nNow my oats taste really unhappy 😔 \n\nCan someone pleassseeeee suggest a berry mix with NO ADDED  SUGAR?",
        "I started reading labels religiously after coming across foodpharmer's reels. Now I try to make better, healthier choices.",
        "People simply should stop eating. I have left eating chocolates, biscuits, chips.",
        "Which dried fruits are comparatively healthier? Which brands to look for?",
        ">Perhaps the dried fruits are dipped in sugary liquid and dried again.\n\nThat's the issue, I buy dry fruits only from this particular shop in my area because ik they don't sugarcoat(literally) their dry fruits, the shopkeeper does keep some which have added sugar but he will tell you *himself* which has sugar and which doesn't even if you don't ask him\n\nThe brand should specify that the dry fruits are coated/dusted with sugar and mention that shit somewhere where an average consumer will see.",
        "Cranberries are extremely bitter so anything that has cranberries will have excess sugar to mask their taste.",
        "Yes but it's not an added sugar separately it's in the process of preservation.. \nThat's why it's not in the ingredients list but it's present in the nutrition list. \n\nI am not saying that they are not cheating obviously they are now think of someone who is avoiding sugar as a diet restriction or something now when they see the packet there's no mention of sugar initially so they would think it's okay and purchase it. \nNow if the brand wants they can clearly mention that this product contains sugar but they won't obviously because it will harm their business. \n\nA similar thing kwality walls did before there was no mention of oil or frozen dessert on their packaging but now they have started mentioning that this frozen dessert contains 10.2% of edible vegetable oil. \n\nSimilar thing should be done by these companies, anyway even I was like shocked to see this when I purchased it I still have 1 packet unopened.. it's difficult to find fresh berries in India it's rare for sure.. so this was the closest. \n\nI am not defending them at all just informed that why they didn't mention it on the ingredients list. It's better to avoid all this and stick with nuts only like cashews, almonds, walnuts etc.. or if u can find fresh berries that's better.",
        "For oats I go with seasonal fresh fruits. Mangoes, chiku, apples, bananas. Raisins sometimes.",
        "#LabelPadhegaIndia",
        "as long as bribe taking judges dont impose million dollar fines corporates will continue to fool people",
        "Maybe the sugar content is within the fruits. I am not an expert, but I guess the dried fruits are dipped in sugar. Hence, sugar is an indirect ingredient of this product. \n\nSince, it’s present in the ingredients, they have mentioned the total amount of sugar in the nutritional facts. Obviously they can’t claim it to be sugar free, so they have mentioned it in the nutritional facts instead of ingredients list.\n\nWe shouldn’t assume that 37% sugar is included apart from the sugar present in fruits. This is what I think and I am not an expert, so I might be wrong.",
        "I don’t know about several of these recent brands having been away for a while. However, it would appear the most common ingredient not listed is PE/VC” driven capital? I mean that is certainly not to say the established brands don’t do this. I don’t understand what regulations govern the list but how can you not list the sugar that’s part of the cranberry in the ingredient list?? In addition, *nearly* all cranberry is processed with added oil too. quite surprised not to see that listed either",
        "This is the way.",
        "Fried strawberries and dried kiwi are soaked in sugar... You can check that in any dry fruit shops... When you ask them they will say to us they are soaked in sugar. I guess that's how it makes it easy there.",
        "As someone currently trying a keto diet, the struggle is real. As someone who's just recently started reading nutritional information closely...added sugar and carbs are the two things to watch out for if you're trying to lose weight. Guess what most products are full of. ",
        "F*#king kids. I'll bring my Beyblade 💪",
        "need a revolution in food regulation, education, healthcare, infrastructure and what else?",
        "Well, yes and no. \n\nIt's not just about testing. That's just quality control, grassroot level of food safety. Quality Assurance is something else all together.\n\nLet's talk about food labels because this post is on labels. The country churns our lakhs of different products with lakhs of different food categories. There are many labels that do not meet the required food standard. If it was made mandatory for FSSAI to check and pass each label before they are launched in the market, it would not be physically possible. Therefore, the onus of conformity is on the manufacturer.\n\nLet's talk about training and education of food technologists. There are very prestigious institutes like CFTRI in Mysuru churning out very high quality technologists.",
        "FSSAI is a goddamn joke.",
        "What a scam, its a joke how easily when someone points these things out on the internet, these companies run to sue them",
        "Kwality had to mention on the label that they're selling you frozen dessert instead of ice cream.. I hope for some improvements but another loophole will fix that too",
        "The dried mango, strawberry and kiwi must have been coated with sugar. FYI for an adult male, the upper limit for sugar consumption (all forms of sugar including gud, jaggery, honey,  maply syrup, white, brown sugar and fructose that is naturally occurring in fruits etc) is 36 gms per day. This is not a recommended intake but a maximum limit. For the avg adult woman, the limit is 25gms according to the American Heart Association.",
        "What do the percentages of ingredients signify - because adding them all up gives 110%? 32+15+15+10+10+8+5+5 = 110",
        "Fssai is a complete crook\n\nRecently when the Indian masalas by banned by singapore for exceeding the permissible limit of carcinogenic ingredients, the fssai increased the domestic limit 10 times.... 10 times!!!! \n\n\nSo now domestically there is no contamination because the bar has been shifted... Sab changa si",
        "Ridiculous argument. Doesn't matter if they added or not, the ingredient list should mention sugar. Technically a layman will never read \"dried cranberries\" as \"dried cranberries with sugar\".\n\nMaggie was taken to task for heavy metal content not because they added it, but because the ingredients they sourced had heavy metals & they should've checked / declared it.\n\nIf someone has the bandwidth to take this company to court, I'm sure the person has a very strong case.",
        "That was after amul took them to court. Amul was the only big one using real milk so they made alot of effort to stop mislabelling by other companies\n\nThe authorities themselves didn't do anything to protect the public",
        "I had bought this same product few months back and was surprised to see the high sugar content. Never buying it again :)",
        ">Maybe the sugar content is within the fruits.\n\nAdded sugars mean they are externally added and don’t include the fruit sugars.",
        "This is a misunderstanding on your part, OP. Dried fruits are full of sugar, I thought that was common knowledge. They use sugar to preserve them. Obviously it is not fresh fruit in the bag, is it? It's dried fruit, so mostly sugar. They could have made it even more obvious, but yeah, dried fruits are like candy, they're unhealthy. In fact, even fresh fruit can be pretty high in sugar and calories (for example mango and banana).",
        "What are the reasons that dried-fruits are purchased from Thailand and not locally sourced?",
        "You're right but this is Reddit, so both me and you just get downvoted for pointing this out, lol.",
        "Exactly. What do people expect when they buy this type of snack?",
        "Yes, obviously, dried fruit is preserved in sugar. Otherwise how do you imagine it gets preserved?",
        "That was my doubt as well, as the above ingredients percentage add up to 100, but if cranberry has 5%-8% of added sugar, shouldn't they write 29.5% cranberry (92% of 32) and rest added sugar, and this for every ingredient.",
        "Are museli healthy to eat ..like the once from company (the whole truth or yogabar) who doesn't use any added sugar in their muselis ??",
        "Thank you for a explanatory answer.",
        "General guidance is to eat small and frequent meals. Health foods are no cure alls. Believing them to be so is naive.",
        "I've eaten tonnes of foxnuts from this brand and for the first few months, even though the front packaging literally said rock salt, it wasnt there in the ingredients at all. After a few months, they wrote something like \"only for marketing\" where they mentioned rock salt in the packaging. It took them a few more months to actually start putting rock salt in it. The only reason I eat it is because it is roasted in olive oil, but given that olive oil is heavily adulterated in the market, I really should consider stopping. ",
        "Naxalbari ❤️",
        "they are adding to 100 only.",
        "why not simply eat rolled oats and add fruits and nuts yourself ? it's cheaper , fresher and no preservatives nor any added sugars .",
        "Are you talking about cooked oats ?",
        "Rather than working for 84hrs a week. India needs a generation which fights for its rights and put system in place.",
        "rolled oats are a variant of raw oats , they are lightly processed and healthier than its counterparts",
        "Buy dried fruits from local brands who've been saling them for generations. Ive always avoided branded stuff atleast in dry fruits.",
        "Khatta meetha lmfao",
        "I assume you are talking about the nutriscore, which is just a marketing ploy. Nutriscore isn't any kind of valid or reliable ranking of true health food. It is merely marketing based on some compromise between people who want to make process food more healthy and food companies that don't want to change anything or be called out on how unhealthy their crap is. As a result, there are no changes made to products but \"nutriscore\" gets added to give people a false sense of healthy to foods that are otherwise not. You can buy chocolate milk that's full of sugar with a nutriscore of A, and buy natural yogurt with a nutriscore of D. It's a joke, you are better off reading the ingredients and nutrition facts to make an informed decision.",
        "Foodpharmer sided with Samantha in her recent controversy promoting dangerous alternative therapy bs when the Liver Doctor called her out. \n\nI think he's just an opportunist like Abhishek Asthana (Gabbar Singh on Twitter). He don't actually care about people's health.",
        "Liver doc is bully imo, Lots of article shared by him is really incredible but he loves to target others.",
        "We all have seen frustrated or irritated or \"lazy\" government officials. Humans from similar backgrounds are so much better in the private sectors. When private employees are stretched too thin, they burn out and either perform poorly or find a better job elsewhere.\n\nDeveloped countries have as much as 20%+ workforce in the public sector. US, which is so capitalist and fights to keep the government lean has 13%+ workforce working in public services. Now in contrast to that, India has around 3%+ workforce in the public sector. Good luck finding a better role(either inside or outside the government) if you are a government employee and are burnout, bored, ambitious, \"not fit\", etc \n\nBureaucrats and various services people write bills. Politicians/houses pass a bill. And then the bill needs to be executed and that's where most of the helping hands needed to get the policy/law/reform/plan implemented. We severely fall short of those hands. \n\nP.S: \n\n1. I am not saying that more parts of the government should be privatized because privatized sectors are not free markets in general. There are various ways to address the problem but the first step is to understand the issues and *acknowledge* it. \n2. I strongly believe that government employees are as good as any normal person can be. FWIW, I am not a government employee.",
        "Bullying fraudsters, misinformation merchants and pseudoscience promoters is the need of the hour especially in a country like India.",
        "You need not avoid packaged food but eat healthy packaged food that are free of added sugars (invert sugar, high fructose corn syrup, dextrose are more damaging compared to simple white sugar), with added colours, with added preservatives and unnecessary additives. My suggestion would be eat everything that's available fresh, look at label before eating a packaged or processed food",
        "No govt regulations for this ?",
        "Anyone has any insight about the whole truth brand?",
        "https://preview.redd.it/26avlg9h45bd1.jpeg?width=1080&format=pjpg&auto=webp&s=fd51beea3d50dc33d160c994b79faf9d7b7a8ea2\n\nLook for preservatives and additives free dried fruits. In photo is preservative (sulfur free) dried apricots. What you normally consume is bright in orange in colour. The natural bright orange colour is maintained through adding high ppm of sulfur based preservatives which in long run damage your digestive organs and pancreas / kidneys.",
        "https://preview.redd.it/te22gags45bd1.jpeg?width=893&format=pjpg&auto=webp&s=113a0dd41d25464ce7f33c1b177f9e4bc9682111\n\nIn photo preservatives free naturally dried fig. The light white colour figs get thier colour through sulfur bleaching or fuming which is bad for your gut and overall health",
        "I agree but as you said he is opportunist like gabbar.",
        "Carefully read the ingredients. Ensure no added sugar other than natural sugars.\n\nI can't recommend any specific brand. It's unethical.\nread the label before you eat",
        "Weak Food regulatory authority!!!",
        "👍",
        "You are absolutely right. Virgin and extra Virgin olive oil are the real ones. Most brands use so called olive oil.",
        "Regulations are weak implementation is so weak",
        "Try overnight oats. Add milk and chia seeds to oats at night in fridge. In the morning add cinnamon, honey and fruits. Great breakfast, no cooking required.",
        "Send this to foodpharmer. He can make it viral..",
        "Live in hostel ..don't have fridge facility",
        "I don't understand these products. If you want eat fruits, buy one.",
        "instant oats are you last options then , you would still require an electric kettle though , boil some water and pour it into oats let it sit for 3-4 minute add any topping",
        "That's why it's better to eat locally produced  alternatives like dates. Beneficial for locals and probably healthier than the imported ones.",
        "only whole truth pintola & alphino are good",
        "Silence can be bought",
        "Eat direct fruits, nuts, berries people. Spend some time in kitchen. Experiment in kitchen atleast die with ur own preparation not at the mercy of packaged foods….😂😂😂",
        "Do you have any research to back that dextrose is worse than simple white sugar if equated for calories? I looked and couldnt find any",
        "I've tried happilo in the past which had no added sugar (at least that's what it says on the label).  \n\nHad an offer on farmley, read the ingredient list and ordered it. But turns out it's 40% sugar!",
        "Ghar ka khana khaalo bc, stop having packaged foods.",
        "I came to the sub to ask suggestions about figs etc and then saw this post and feel helpless, i want to buy figs etc. Where should i purchase them? I mean shouldn’t government help in these things and allow good food for the people if they are willing to pay for it. I don’t understand this really if these are bad as per pictures why it is allowed even in first place.\nAny suggestions guys where should i go to purchase these things",
        "Agree, It should be mentioned as ingredients in BOLD.\n\n\nBut Again, I don't see anything wrong with sugar. It's the artificial sweetners and colouring I am more concerned about \n\nIdeally,just buy fruit",
        "Dried fruits have added sugar",
        "Unfortunately this statement can be said about so many things not only in India, but the world over. \n\nI'm not saying that I blame underpaid low level civil servants in developing nations for trying to get extra money where they can, especially with a family at home. I would probably do it too. I think most would to give their kids a better life. \n\nThat being said it becomes far less understandable for senior civil servants who already make a good living and are just being greedy.\n\nI wish I had an answer.",
        "Mostly related to increased inflammation.. cannot find source..",
        "Thank you for this. \n\nThere is no \"easy\" solution to this. Informed decisions through reading ingredients and being aware of what tricks these companies are using to provide the illusion of health is the only answer if you want to eat something that is as close to unprocessed as said good can get.",
        "That's the formula and they know it. Buy your way out of jail, wait until said scandal is out of the news, and then quietly strike a \"deal\" that lets them off the hook. Nothing gets done, the cycle continues.",
        "I just stopped eating altogether. No way I can eat unhealthy if I don't eat anything at all! \n\n/s",
        "If it’s wrapped, it’s probably trash",
        "it's technically slightly more calorie dense, but that's negligible. if you look up what sucrose breaks down into, it's 50:50 dextrose and fructose (like in fruits, or corns syrup). ",
        "no source because it's untrue, sucrose is made of 50:50 dextrose and fructose.",
        "I’m willing to bet the diced dried mango themselves have sugar on them",
        "Re: cranberries requiring sugar. I intentionally bought some cranberry juice recently that supposedly had zero added sugar. It was tart as fuck and I loved it. I've always wanted to try dried cranberries with no sugar added. Would they somehow be more inedible than the \"no sugar added\" cranberry juice?",
        "Hey, you sound knowledgeable about the topic. How much of the nutritional labels are correct in India? Especially the popular brands.",
        "“Full-stack brand” that provides “creative … r&d?” Is this a fruit and nuts company or a tech company?",
        "Not untrue.. it was in a recent research paper...",
        "let's see it then. because dextrose is literally the same thing as blood sugar and is half of sucrose, the other half being equivalent to high fructose corn syrup, that seems unlikely at best.",
        "It's difficult to find, I did read it.. it's how the body processes different molecular structures..",
        "You can check out glycaemic index. There would be plenty of research on it.\n\nDextrose is 100 in the GI index, normal sugar is 65.\nThe index maxes out at 100, so you can understand.\n\nFor reference: https://www.webmd.com/diabetes/glycemic-index-good-versus-bad-carbs",
        "I'm not sure you understood it correctly then. because as I've said numerous times now, dextrose is part of sucrose, and is also the exact same molecular structure the body uses to transport sugar through the blood.",
        "Well your chemistry is off..",
        "I've got a literal degree in Ochem lmao \n\n\nhttps://chem.libretexts.org/Bookshelves/Biological_Chemistry/Supplemental_Modules_(Biological_Chemistry)/Carbohydrates/Disaccharides/Sucrose\n\n\nglucose is equivalent to dextrose, because I know that'll be a point of contention, just a specific chiral form, where levo isn't typically found in nature \n\n\nhttps://chem.libretexts.org/Bookshelves/Biological_Chemistry/Supplemental_Modules_(Biological_Chemistry)/Carbohydrates/Monosaccharides/Glucose_(Dextrose)\n\n\nso let's see your credentials, or better yet, the source of your claim or the chemistry underlying how the body's main store of sugar is worse for you than something that is half glucose and half fructose.",
        "You can make easily at home and this is my Granola recipe\n\nRecipe  \n1. 1 tsp of coconut oil  \n2. 1 small cup of nuts of your choice: chopped into pieces  \na.  I have used the following  \n cashew nut  \n Almonds  \n pepita seeds  \n3. Add Tbsp of chopped raisins and coconut flakes  \n4. 1 small cup of rolled oats  \n5. Pinch of salt  \n6. ½ a Tsp of cinnamon powder.  \n7. 2 Tbsp of honey or any sweetener of your choice.  \n  \n  \nSteps:  \n1. Heat your pan and add coconut oil  \n2. Add your nuts and fry them until have roasted  \n3. Now add raisins, coconut flakes, oats and salt  \n4. Toast it until golden brown  \n5. Turn of the stove- necessary as the next step will just use the  heat of the pan.  \n6. Add your cinnamon and drizzle honey  \n7. Mix and let it cool down for 5-10 mins or you can use immediately.",
        ">Can't be consumed\n\nI eat fresh raw cranberries all the time. I love the sour.",
        "FSSAI should eat shit then probably they will start taking people seriously.",
        "Absolutely. So many irregularities have surfaced, yet the continue their corrupt nonchalant slumber. Kumbhkaran ki neend.",
        "Can you please tell me where it is even possible to get like this in India, preferably online?",
        "In addition to this, I’ve always wondered how much can we rely on these figures. One could easily buy their way through these numbers in India and then you could continue to get fooled even when you act like an aware consumer",
        "Source nuts and raisins locally and assemble your own mix",
        "this is quite an ignorant comment.  we’re talking about food here. regulations don’t always imply increase in costs. it involves not selling dirt to a billion people with clever marketing and fancy packaging.",
        "that's kind of misleading, because dextrose *is* glucose, no conversion needed.  it also doesn't explain the other guy's claim that dextrose is *damaging*, as opposed to \"has an effect on blood sugar\", which obviously, it's the same thing",
        "Even that’s becoming a problem these days. To compete with the taste of the ‘with sugar’ options, brands are now starting to use super concentrated levels of ‘natural’ sugars. So, yeah the source of sugar is natural in those products, but the total sugar quantity ends up way too high anyway. For example, fruit concentrate used in ‘no added sugar’ fruit juices.",
        "True Elements no added sugar muesli is pretty good",
        "Nutritional labels are almost reliable but you should read the ingredients. That's where the real culprit is. Try to avoid processed food products that contain too much of additives and stabilisers.\n\nSome brands are really good, some look like good but contain lots of additives.\n\nMore awareness is required among consumers.",
        "It's cheaper and the Thai candied fruit aka dried fruit industry is well established and organised. They are the leading global suppliers of many varieties of candied dry fruit.",
        "Kellog has one too and that’s very good too",
        "Lot of reserch papers are dumped in deep underground vaults by the ingredient manufacturing industry mafia.",
        "Serves us right to eat \"packaged/processed\" fruits instead of fresh ones. We are becoming too much like the west. Except cranberry, all these fruits are very very readily available here fresh, in season of course. Consume fresh fruits instead of juice or packaged candied ones, they are more CANDY than fruit",
        "Actually fruit concentrate is not used to sweeten the product except for grapes juice concentrate. Concentrate is used to bring down the cost of a particular fruit component especially if they are imported.\n\nLike you said high amounts of sugar or sugar derivatives are added.\n\nI would say - drink home made whole fruit juices, much better way is eat the whole fruits rather juice.",
        "Interesting, TIL. I hadn’t thought about the cost aspect. \n\nAre the colours used in India on par with international standards? Or are banned ones (banned in other countries) being used here in bulk?",
        "Which brand is this?",
        "We need to report this to food pharma right now. So that it could be brought to the attention of a wider audience. We may also succeed in forcing this scummy company into fixing it's label",
        "First tier, Natural flavours / natural colours / vegetable derived colours are the best... But expensive\n\nSecond tier is the nature identical flavours, nature identical colours - mostly derived synthetically but has very close molecular structure resemblance to their natural counterpart. Considered as safe. \n\nThird tier, synthetic flavors and colours - the real bad guys. \n\nDepending on the target market segment brands use either the best or safe or the bad guys. Decicided based on price sensitivity of the target market. \n\nFlavours and colours approved for use in India may not be allowed in EU / USA / Developed Far east. Country and regulatory dependent.",
        "Little difficult and expensive. If you are a traveller buy when you travel that's the best option. Stick to locally available fresh or minimally processed fruits.",
        "Everyone has different taste pallet,  try some to experience if it suits your taste master aka tounge 😉",
        "All berries are preserved with sugar. Even if you buy from a dry fruit shop in loose qty",
        "It may have a higher Glycaemic index which is more \"harmful\" for a diabetic person (although thats not true entirely, since what matters is the overall glycaemic load which depends on total calories). But for a healthy person, the difference really is immaterial.",
        "Sorry but what evidence do you have then. If we are going by personal opinions, i would put them all in the same category and just entirely avoid or just consume them in very small amounts.",
        "People have a weird love and affection for white sugar as compared to dextrose and fructose lol. It doesnt make sense why any one wi be better or worse equated for calories",
        "I haven't been able to find any store bough museli that doesn't use sugar and/or processed dried fruit. Both museli mix and bars are super easy to make on your own, that's the only way to control. I make bars weekly and keep them stored in fridge for a snack and can take out if not going to be in extreme heat for more than 30 mins. \n\n All you need is –  \n\n* Oats - 40 - 50 gm\n* Peanut butter - Two Spoon. Only use unsweetened ones.\n* 1 spoon coco powder. Again only use 100% cocoa without sugar. Hersheys sells one. \n* 1 or 2 spoon honey or melted jaggery. Can't be avoided as this works as binding factor. Dates pulp can work too, but they require a bit more quantity and effort.\n* Throw in roughly chopped or any nuts and seeds you like. I use Almonds and pumpkin \n* Sometimes I will add 15-20 gm of whey protein powder. \n* Tiny pinch of salt to balance it out.\n* Mix all of them for a while and set them a small tray with parchment paper, press from top and freeze for 2-3 hours. And they come out great.",
        "It's not my personal opinion.\n\nYou are right, avoid or consume in small amounts.",
        "Can you suggest any good brands for such berries and dried fruits?",
        "Sorry it is unethical to suggest in a public forum",
        "I mean, generally it's the naturalist fallacy; cane sugar seems less \"processed\", it's getting them to admit they don't have any real backing to that belief that's the struggle",
        "That’s the ideal way but then I’ve to cut fruits 😅\nDried berries are much more convenient when I’m getting late.",
        "Thanks will try it",
        "I'm glad that people of my country are becoming aware of such important things and having a discussion on this. ❤️🙏",
        "It’s not obligatory. Companies don’t need to put it",
        "I was about to order this from Blnkit but after seeing this post had to change my mind.",
        "even if that were true, you can't discredit all that he's done in trying to fight the misleading claims of the packaged food industry and more importantly, the amount of awareness he has brought to the common man when it comes to reading labels and ingredients and making informed choices",
        "very difficult to identify if the dates you buy are farmed in India or exported from somewhere.",
        "delmonte has this product in Amazon. They are called turkish sun dried apricots. I find it much more tastier than the bright orange version.",
        "Best solution never eat anything which is packed food",
        "Surely the volume of such technologists are less? Manufacturers wouldn’t be strict about quality until they are penalised. We can only penalise when we detect faults.\n\nMay be it’s just how the Indian automotive discipline and traffic situation is! People only start wearing helmets when you charge exorbitant amount and also catch them..\n\nYou are right about assurance!",
        "Do you have any recommendations for good brands?",
        "if you are trying to lose weight, no matter diabetic status, it is better to avoid high glycemic foods",
        "delmonte has this product in Amazon. They are called turkish sun dried apricots. I find it much more tastier than the bright orange version.",
        "Time to start pouring billions of rupees more into FSSAI",
        "I've noticed this as well. Not sure if it was Farmley or Bagrry's flavoured makhana, but one of them had listed their sodium level, and one had not. Same flavour too. I was shocked to know the one which had mentioned it, it had so much sodium. I could see why the other brand would have hidden it since the snack is sold as a 'healthy' alternative",
        "Wow that's really useful to know. Dried mango used to be my go to snack for when I'm craving something sweet but wanted to eat healthy,🤦",
        "i completely agree w the 1st para, ppl go to govt sector because \"i dont have to work a lot, ill get respect, life will be sorted, etc\"... mentality is such, there isnt any look for development. and its a peer mentality even if u get in the public sector.\ni dont get the point where u write ambitious among words like bored or burnout, also \"not fit\" word when u mentioned that in private sector, people can switch job when they are not fit. this might sound self explanatory but i have a feeling there is more to it...\n3rd para was pretty new to me. can u tell me something i can google to understand more? im really interested in the conversation",
        "There are very few brands in the market who dry mangoes without any additives or preservatives or added sugar / colour. Trust me on early part of my career i worked in Thailand and I know what all crap goes into making a dried / candied fruit.\n\nLot of people aren't trusting that fruits could be dried without adding sugars and other craps.\n\nFYI I am sharing a proof https://naturalhealthorganics.com.au/collections/mareeba-orchards?gad_source=1&gclid=CjwKCAjwnK60BhA9EiwAmpHZw8bCDIAb3EXZz4lUnT_IiZe-yO0Pjy36zc7FuTIp3_-ZNcYS9cp6wBoC6qAQAvD_BwE\n\nI am not related to this company / owner / promoting the brand. Sharing the information that good products exists, especially in the developed world. And it is not hard to process / manufacture them in India too. All it takes is a commitment to offer good food to consumers.",
        "This gave me constipation each time I had it.",
        "Just get regular dry fruits from wholesale shops..",
        "ever since i have left sugar and actively started checking the nutritional facts- everyday i am surprised by 'healthy brands', there's literally Sugar (in huge quantity in everything), using ingredients like palm oil and so o",
        "Wont be surprised if the brand responds with saying that it is as per the FSSAI guidelines. FSSAI is such a fraudulent government org and so much shit is just unchecked. Every now and then they will pretend to act in response to public anger but end of the day they will quietly return to 'normal' just like the common public who forgets about it.",
        "Incorrect.  There are literally studies which show people can lose weight even if they eat oreos. Glycaemic index has nothing to do with total calories. And weight loss is influenced by calories in - calories out",
        "this is what Food Pharmer has been telling us. we didnt pay attention... now everyone is waking up",
        "Dried berries almost always come with sugar. How can you not know that? They are not adding sugar from top, it's there in the processed berries. Stop eating processed food.\n\nAlso, you are shocked at this? Wait till you find about the hidden sodium in processed foods..",
        "What should we buy, any brands with pure dried nuts or dried fruits options 😭",
        "Dont eat high gi food.",
        "I highly doubt this claim, can you quote those studies?",
        "Bruh, do you even know what you're talking about? or just saying for the sake of saying it?\n\nPls read up then comment.",
        "Worked as a creative head for an \"organic\" food brand. I noticed that their labels did not seem right and asked their designers about how they got the info - they told me that it was just guess work 😬",
        "I've got a degree in o chem, as I explained to the other person, perhaps you should get an education bruh? I'll also point out you've not disputed anything particular I've said, so unlike with the other person, I can't cite sources. would you like to make any specific claims?",
        "Bruh wtf",
        "Ok my bad for assuming things, I take my words back.\n\nWhat my understanding is that, the body processes sugar till the time it is getting it, the moment there's a deficit, it'll tap into the fat stores. so fat starts burning, and that's how you loose weight.\n\nNow if, I start eating food with high glucose/sugar content in it, then body has more sugar to process, and if there's surplus it'll store it in the form of fat. So, a complete opposite of the above process happens.\n\nSo doesn't that make dexstrose something that should be avoided more than sugar?",
        "Sugar in any form is bad for pancreas. You are already getting it in rice fruits, and everything else. And not many people are exercising enough. GI is a very good indicator of how fast it hits blood stream",
        "for the first part, kinda sorta? dextrose is the form of sugar your body uses directly. that means upon consumption your blood sugar will peak fast and taper down quicker as well. this is bad for people with diabetes in sizable amounts, or at risk for same. however sucrose takes an additional half step where your body breaks it down into dextrose and fructose. this is not much better for diabetics, but marginally so. for the average person, it doesn't matter particularly unless you're eating an excessive amount, but in that case, neither is good for you. \n\n\nalso in the context of weight loss, avoid both? at least outside the presence of fiber, is my understanding. Just any amount of calories that are absorbed are working against your goals \n\n\n\n\nbut to specifically dispel what the guy up thread was saying; there is no danger posed by dextrose that sucrose would not also pose. additionally, being fearful of dextrose is foolish as that's what your body will ultimately break down most any carb into. it's not a poison, it's just very efficient for your body to consume directly.",
        "Only problem is i guess they use candied fruits which are coated by sugar - I used to be a big time user of Kellogs but after trying True Elements it is no more going back to kellogs",
        "Sugar in any form is bad for pancreas? Based on what exactly? And people not exercising is the problem, not sugar itself. You can get fat if you eat lots of fat too. Its easy to be in calorie surplus through fat as well.",
        "Its basic thermodynamics. If you are in a calorie deficit, you will lose fat. What part of that seems controviersial?\n\nHere you go about the oreo thing specifcally:\nhttps://edition.cnn.com/2010/HEALTH/11/08/twinkie.diet.professor/index.html",
        "No candied fruit in their 0 sugar muesli. That variant is the only one that does not have candied fruit.",
        "bro it's 'added' and not part the ingridient bro",
        "Yaha apne rights ke liye nahi lad rahe, food ke liye kya hi revolution ayega",
        "Stuff like this is why I’m OUTTA here",
        "Read about keto. Sugar causes inflammation which is the basis of all illness.",
        "Years ago there used to be inspections done on food products kinda similar to a CBI raid for corruption like spices and grains.. nowadays there's none of it why?"
    ],
    "cleaned_text": "brands cheat people even reading ingredients enough added sugar mention ingredient list legal know written nutritional facts exclude ingredient list main ingredient ",
    "cleaned_title": "brands cheat people even reading ingredients enough",
    "cleaned_selftext": "added sugar mention ingredient list legal know written nutritional facts exclude ingredient list main ingredient",
    "cleaned_comments": "hello foodpharmer perhaps dried fruits dipped sugary liquid dried think india stricter food regulations need revolution official statement food safety standards authority india fssai said approved proposal display nutritional information regarding total sugar salt saturated fat bold letters relatively increased font size labels packaged food itemshttpsindianexpresscomarticleindiafssaimandatorylabellingsaltsugarfatpackagedfooditemsboldlettersbiggerfont tbh talking india lost hope anything change man horlicks remove health drink ads one hope couldnt someone sue think armed revolution whorelicks bro thats sugar dried fruits added fruits dried sugar solution increase lifetime added sugar need revolution people people actually reading ingredients good see people trying lead healthy life asking right questions public thanks foodpharmer ig yeah makes sense guess cheat interpretation dried fruit actually adding sugar right nowadays people dont pay attention kinds details food companies clever india stricter food regulations buhahahahahahahaha gaand mn danda vroas govt cares common peoples life dont know second one tho first one dried strawberry kiwi dried mango bought market grainy powder sugar coated might itm offense anyone flesh trade far noble profession whatever deceitful companies bring star wars swords spd red ranger mask lets neither increase quality standards enforce without increasing state capacity given things awareness bringing social media aka armchair activism best thing also bottom approach works well especially longer term adopt systems like spain germany netherlands grades every packaged food e healthiest reel would bring lot backlash food companies bought thing couple days ago thinking fruits looked ingredients mention sugar got seeing added sugar shocked tried returning zepto couldnt honestly sucks man gon na happen theyll buy bonds case shut theyll buy govt food inspectors change rating like article says coke better milk called expert india far gone government worship sort meaningful revolution india needs bureaucratic revolution people hate red tape thing keeping society order half people dont even know eating much sugar bad bodies eternal vigilance informed concerned people like op forcing fssai control elements seems way ahead bro statement contradictory attitude corporate brands probably country people land available matter certain percentage people suffer poison indian society make anyways lol belong food processing industry cranberry preservation needs little addition sugar inevitable sugar added make palatable otherwise tart acidic worst component shown photo dried strawberry dried mangoes dried kiwis usually imported thailand contain high percentage added sugar colours high ppm sulfur cocktail preservatives always consume preservatives colors additives free naturally dried fruits course dried fruits dull colour corporate people food industry take food safety act regulations many fssai progressing food regulations one keep mind science always evolving new risks etc law nearly par world standards fssai bases mostly codex alimentarious enforcement regulations thats weak link food labels recipes etc cant validated checked fssai massive bureaucratic bottleneck audits checks unfortunately companies bribe officials get around onus conform law therefore fall manufacturer producer etc worked inside many food companies many take task seriously confirm law many think bottom line culture food safety emanates top management company sometimes honest mistake complex industry complex laws final responsibility hold producers accountable consumer encourage shoot email manufacturer picture product batch number ask clarification dont get satisfactory answer reach fssai authority developed helplines consumers encourage voice dissatisfaction directly company first maybe explanation query maybe admit mistake give free exchange defective product hope helps companies clever assure using kind technical loop hole useless sue huge amount legal advisers infact know times well could purchase eat crp willing listen advice preaches austerity lol believe using skill india government train testing associates fssai provide jobs execution andha hai kya lwde revolutionhttpsyoutubeiiiihwhpausiwdvwfsnuqcg country needs fraud ingredients added sugar mostly dried items havent added sugar separately shouldnt mention ingredients list ads work people buy damn plum need things plastic packs bright colours yes havent added sugar ingredients list since product added sugar mention nutrition list dip sugar syrup sugar acts preservative obviously could used less sugar added g sugar g stupid brands also usually fried berries dried fruits eg happilo also use thing products sugar content much less add g sugar g actually better work dried fruits basically candy anyways process involves boiling sugar syrup drying figs kiwi mango citrus fruitsplums ones sugar way calledlabelled healthy dehydrated fruits hand zero added ingredients whole different thing something wont find easily increase cost food reality cant afford increased food regulations bro totally didnt get youre trying say sugar supposed ingredient right thats plan mean probably legal able need stricter laws india problem rhe world processed food always high level sugars matter country thanks info totally avoid packaged stuff yes recently discovered post foodpharmers podcast reading labels shocked used farmley berries mix every morning oats reading nutritional facts discontinued using oats taste really unhappy someone pleassseeeee suggest berry mix added sugar started reading labels religiously coming across foodpharmers reels try make better healthier choices people simply stop eating left eating chocolates biscuits chips dried fruits comparatively healthier brands look perhaps dried fruits dipped sugary liquid dried thats issue buy dry fruits particular shop area ik dont sugarcoatliterally dry fruits shopkeeper keep added sugar tell sugar doesnt even dont ask brand specify dry fruits coateddusted sugar mention shit somewhere average consumer see cranberries extremely bitter anything cranberries excess sugar mask taste yes added sugar separately process preservation thats ingredients list present nutrition list saying cheating obviously think someone avoiding sugar diet restriction something see packet theres mention sugar initially would think okay purchase brand wants clearly mention product contains sugar wont obviously harm business similar thing kwality walls mention oil frozen dessert packaging started mentioning frozen dessert contains edible vegetable oil similar thing done companies anyway even like shocked see purchased still packet unopened difficult find fresh berries india rare sure closest defending informed didnt mention ingredients list better avoid stick nuts like cashews almonds walnuts etc u find fresh berries thats better oats go seasonal fresh fruits mangoes chiku apples bananas raisins sometimes labelpadhegaindia long bribe taking judges dont impose million dollar fines corporates continue fool people maybe sugar content within fruits expert guess dried fruits dipped sugar hence sugar indirect ingredient product since present ingredients mentioned total amount sugar nutritional facts obviously cant claim sugar free mentioned nutritional facts instead ingredients list shouldnt assume sugar included apart sugar present fruits think expert might wrong dont know several recent brands away however would appear common ingredient listed pevc driven capital mean certainly say established brands dont dont understand regulations govern list list sugar thats part cranberry ingredient list addition nearly cranberry processed added oil quite surprised see listed either way fried strawberries dried kiwi soaked sugar check dry fruit shops ask say us soaked sugar guess thats makes easy someone currently trying keto diet struggle real someone whos recently started reading nutritional information closelyadded sugar carbs two things watch youre trying lose weight guess products full fking kids ill bring beyblade need revolution food regulation education healthcare infrastructure else well yes testing thats quality control grassroot level food safety quality assurance something else together lets talk food labels post labels country churns lakhs different products lakhs different food categories many labels meet required food standard made mandatory fssai check pass label launched market would physically possible therefore onus conformity manufacturer lets talk training education food technologists prestigious institutes like cftri mysuru churning high quality technologists fssai goddamn joke scam joke easily someone points things internet companies run sue kwality mention label theyre selling frozen dessert instead ice cream hope improvements another loophole fix dried mango strawberry kiwi must coated sugar fyi adult male upper limit sugar consumption forms sugar including gud jaggery honey maply syrup white brown sugar fructose naturally occurring fruits etc gms per day recommended intake maximum limit avg adult woman limit gms according american heart association percentages ingredients signify adding gives fssai complete crook recently indian masalas banned singapore exceeding permissible limit carcinogenic ingredients fssai increased domestic limit times times domestically contamination bar shifted sab changa si ridiculous argument doesnt matter added ingredient list mention sugar technically layman never read dried cranberries dried cranberries sugar maggie taken task heavy metal content added ingredients sourced heavy metals shouldve checked declared someone bandwidth take company court im sure person strong case amul took court amul big one using real milk made alot effort stop mislabelling companies authorities didnt anything protect public bought product months back surprised see high sugar content never buying maybe sugar content within fruits added sugars mean externally added dont include fruit sugars misunderstanding part op dried fruits full sugar thought common knowledge use sugar preserve obviously fresh fruit bag dried fruit mostly sugar could made even obvious yeah dried fruits like candy theyre unhealthy fact even fresh fruit pretty high sugar calories example mango banana reasons driedfruits purchased thailand locally sourced youre right reddit get downvoted pointing lol exactly people expect buy type snack yes obviously dried fruit preserved sugar otherwise imagine gets preserved doubt well ingredients percentage add cranberry added sugar shouldnt write cranberry rest added sugar every ingredient museli healthy eat like company whole truth yogabar doesnt use added sugar muselis thank explanatory answer general guidance eat small frequent meals health foods cure alls believing naive ive eaten tonnes foxnuts brand first months even though front packaging literally said rock salt wasnt ingredients months wrote something like marketing mentioned rock salt packaging took months actually start putting rock salt reason eat roasted olive oil given olive oil heavily adulterated market really consider stopping naxalbari adding simply eat rolled oats add fruits nuts cheaper fresher preservatives added sugars talking cooked oats rather working hrs week india needs generation fights rights put system place rolled oats variant raw oats lightly processed healthier counterparts buy dried fruits local brands whove saling generations ive always avoided branded stuff atleast dry fruits khatta meetha lmfao assume talking nutriscore marketing ploy nutriscore isnt kind valid reliable ranking true health food merely marketing based compromise people want make process food healthy food companies dont want change anything called unhealthy crap result changes made products nutriscore gets added give people false sense healthy foods otherwise buy chocolate milk thats full sugar nutriscore buy natural yogurt nutriscore joke better reading ingredients nutrition facts make informed decision foodpharmer sided samantha recent controversy promoting dangerous alternative therapy bs liver doctor called think hes opportunist like abhishek asthana gabbar singh twitter dont actually care peoples health liver doc bully imo lots article shared really incredible loves target others seen frustrated irritated lazy government officials humans similar backgrounds much better private sectors private employees stretched thin burn either perform poorly find better job elsewhere developed countries much workforce public sector us capitalist fights keep government lean workforce working public services contrast india around workforce public sector good luck finding better roleeither inside outside government government employee burnout bored ambitious fit etc bureaucrats various services people write bills politicianshouses pass bill bill needs executed thats helping hands needed get policylawreformplan implemented severely fall short hands ps saying parts government privatized privatized sectors free markets general various ways address problem first step understand issues acknowledge strongly believe government employees good normal person fwiw government employee bullying fraudsters misinformation merchants pseudoscience promoters need hour especially country like india need avoid packaged food eat healthy packaged food free added sugars invert sugar high fructose corn syrup dextrose damaging compared simple white sugar added colours added preservatives unnecessary additives suggestion would eat everything thats available fresh look label eating packaged processed food govt regulations anyone insight whole truth brand look preservatives additives free dried fruits photo preservative sulfur free dried apricots normally consume bright orange colour natural bright orange colour maintained adding high ppm sulfur based preservatives long run damage digestive organs pancreas kidneys photo preservatives free naturally dried fig light white colour figs get thier colour sulfur bleaching fuming bad gut overall health agree said opportunist like gabbar carefully read ingredients ensure added sugar natural sugars cant recommend specific brand unethical read label eat weak food regulatory authority absolutely right virgin extra virgin olive oil real ones brands use called olive oil regulations weak implementation weak try overnight oats add milk chia seeds oats night fridge morning add cinnamon honey fruits great breakfast cooking required send foodpharmer make viral live hostel dont fridge facility dont understand products want eat fruits buy one instant oats last options would still require electric kettle though boil water pour oats let sit minute add topping thats better eat locally produced alternatives like dates beneficial locals probably healthier imported ones whole truth pintola alphino good silence bought eat direct fruits nuts berries people spend time kitchen experiment kitchen atleast die ur preparation mercy packaged foods research back dextrose worse simple white sugar equated calories looked couldnt find ive tried happilo past added sugar least thats says label offer farmley read ingredient list ordered turns sugar ghar ka khana khaalo bc stop packaged foods came sub ask suggestions figs etc saw post feel helpless want buy figs etc purchase mean shouldnt government help things allow good food people willing pay dont understand really bad per pictures allowed even first place suggestions guys go purchase things agree mentioned ingredients bold dont see anything wrong sugar artificial sweetners colouring concerned ideallyjust buy fruit dried fruits added sugar unfortunately statement said many things india world im saying blame underpaid low level civil servants developing nations trying get extra money especially family home would probably think would give kids better life said becomes far less understandable senior civil servants already make good living greedy wish answer mostly related increased inflammation find source thank easy solution informed decisions reading ingredients aware tricks companies using provide illusion health answer want eat something close unprocessed said good get thats formula know buy way jail wait said scandal news quietly strike deal lets hook nothing gets done cycle continues stopped eating altogether way eat unhealthy dont eat anything wrapped probably trash technically slightly calorie dense thats negligible look sucrose breaks dextrose fructose like fruits corns syrup source untrue sucrose made dextrose fructose im willing bet diced dried mango sugar cranberries requiring sugar intentionally bought cranberry juice recently supposedly zero added sugar tart fuck loved ive always wanted try dried cranberries sugar added would somehow inedible sugar added cranberry juice hey sound knowledgeable topic much nutritional labels correct india especially popular brands fullstack brand provides creative rd fruit nuts company tech company untrue recent research paper lets see dextrose literally thing blood sugar half sucrose half equivalent high fructose corn syrup seems unlikely best difficult find read body processes different molecular structures check glycaemic index would plenty research dextrose gi index normal sugar index maxes understand reference im sure understood correctly ive said numerous times dextrose part sucrose also exact molecular structure body uses transport sugar blood well chemistry ive got literal degree ochem lmao glucose equivalent dextrose know thatll point contention specific chiral form levo isnt typically found nature lets see credentials better yet source claim chemistry underlying bodys main store sugar worse something half glucose half fructose make easily home granola recipe recipe tsp coconut oil small cup nuts choice chopped pieces used following cashew nut almonds pepita seeds add tbsp chopped raisins coconut flakes small cup rolled oats pinch salt tsp cinnamon powder tbsp honey sweetener choice steps heat pan add coconut oil add nuts fry roasted add raisins coconut flakes oats salt toast golden brown turn stove necessary next step use heat pan add cinnamon drizzle honey mix let cool mins use immediately cant consumed eat fresh raw cranberries time love sour fssai eat shit probably start taking people seriously absolutely many irregularities surfaced yet continue corrupt nonchalant slumber kumbhkaran ki neend please tell even possible get like india preferably online addition ive always wondered much rely figures one could easily buy way numbers india could continue get fooled even act like aware consumer source nuts raisins locally assemble mix quite ignorant comment talking food regulations dont always imply increase costs involves selling dirt billion people clever marketing fancy packaging thats kind misleading dextrose glucose conversion needed also doesnt explain guys claim dextrose damaging opposed effect blood sugar obviously thing even thats becoming problem days compete taste sugar options brands starting use super concentrated levels natural sugars yeah source sugar natural products total sugar quantity ends way high anyway example fruit concentrate used added sugar fruit juices true elements added sugar muesli pretty good nutritional labels almost reliable read ingredients thats real culprit try avoid processed food products contain much additives stabilisers brands really good look like good contain lots additives awareness required among consumers cheaper thai candied fruit aka dried fruit industry well established organised leading global suppliers many varieties candied dry fruit kellog one thats good lot reserch papers dumped deep underground vaults ingredient manufacturing industry mafia serves us right eat packagedprocessed fruits instead fresh ones becoming much like west except cranberry fruits readily available fresh season course consume fresh fruits instead juice packaged candied ones candy fruit actually fruit concentrate used sweeten product except grapes juice concentrate concentrate used bring cost particular fruit component especially imported like said high amounts sugar sugar derivatives added would say drink home made whole fruit juices much better way eat whole fruits rather juice interesting til hadnt thought cost aspect colours used india par international standards banned ones banned countries used bulk brand need report food pharma right could brought attention wider audience may also succeed forcing scummy company fixing label first tier natural flavours natural colours vegetable derived colours best expensive second tier nature identical flavours nature identical colours mostly derived synthetically close molecular structure resemblance natural counterpart considered safe third tier synthetic flavors colours real bad guys depending target market segment brands use either best safe bad guys decicided based price sensitivity target market flavours colours approved use india may allowed eu usa developed far east country regulatory dependent little difficult expensive traveller buy travel thats best option stick locally available fresh minimally processed fruits everyone different taste pallet try experience suits taste master aka tounge berries preserved sugar even buy dry fruit shop loose qty may higher glycaemic index harmful diabetic person although thats true entirely since matters overall glycaemic load depends total calories healthy person difference really immaterial sorry evidence going personal opinions would put category entirely avoid consume small amounts people weird love affection white sugar compared dextrose fructose lol doesnt make sense one wi better worse equated calories havent able find store bough museli doesnt use sugar andor processed dried fruit museli mix bars super easy make thats way control make bars weekly keep stored fridge snack take going extreme heat mins need oats gm peanut butter two spoon use unsweetened ones spoon coco powder use cocoa without sugar hersheys sells one spoon honey melted jaggery cant avoided works binding factor dates pulp work require bit quantity effort throw roughly chopped nuts seeds like use almonds pumpkin sometimes add gm whey protein powder tiny pinch salt balance mix set small tray parchment paper press top freeze hours come great personal opinion right avoid consume small amounts suggest good brands berries dried fruits sorry unethical suggest public forum mean generally naturalist fallacy cane sugar seems less processed getting admit dont real backing belief thats struggle thats ideal way ive cut fruits dried berries much convenient im getting late thanks try im glad people country becoming aware important things discussion obligatory companies dont need put order blnkit seeing post change mind even true cant discredit hes done trying fight misleading claims packaged food industry importantly amount awareness brought common man comes reading labels ingredients making informed choices difficult identify dates buy farmed india exported somewhere delmonte product amazon called turkish sun dried apricots find much tastier bright orange version best solution never eat anything packed food surely volume technologists less manufacturers wouldnt strict quality penalised penalise detect faults may indian automotive discipline traffic situation people start wearing helmets charge exorbitant amount also catch right assurance recommendations good brands trying lose weight matter diabetic status better avoid high glycemic foods delmonte product amazon called turkish sun dried apricots find much tastier bright orange version time start pouring billions rupees fssai ive noticed well sure farmley bagrrys flavoured makhana one listed sodium level one flavour shocked know one mentioned much sodium could see brand would hidden since snack sold healthy alternative wow thats really useful know dried mango used go snack im craving something sweet wanted eat healthy completely agree w st para ppl go govt sector dont work lot ill get respect life sorted etc mentality isnt look development peer mentality even u get public sector dont get point u write ambitious among words like bored burnout also fit word u mentioned private sector people switch job fit might sound self explanatory feeling rd para pretty new u tell something google understand im really interested conversation brands market dry mangoes without additives preservatives added sugar colour trust early part career worked thailand know crap goes making dried candied fruit lot people arent trusting fruits could dried without adding sugars craps fyi sharing proof related company owner promoting brand sharing information good products exists especially developed world hard process manufacture india takes commitment offer good food consumers gave constipation time get regular dry fruits wholesale shops ever since left sugar actively started checking nutritional facts everyday surprised healthy brands theres literally sugar huge quantity everything using ingredients like palm oil wont surprised brand responds saying per fssai guidelines fssai fraudulent government org much shit unchecked every pretend act response public anger end day quietly return normal like common public forgets incorrect literally studies show people lose weight even eat oreos glycaemic index nothing total calories weight loss influenced calories calories food pharmer telling us didnt pay attention everyone waking dried berries almost always come sugar know adding sugar top processed berries stop eating processed food also shocked wait till find hidden sodium processed foods buy brands pure dried nuts dried fruits options dont eat high gi food highly doubt claim quote studies bruh even know youre talking saying sake saying pls read comment worked creative head organic food brand noticed labels seem right asked designers got info told guess work ive got degree chem explained person perhaps get education bruh ill also point youve disputed anything particular ive said unlike person cant cite sources would like make specific claims bruh wtf ok bad assuming things take words back understanding body processes sugar till time getting moment theres deficit itll tap fat stores fat starts burning thats loose weight start eating food high glucosesugar content body sugar process theres surplus itll store form fat complete opposite process happens doesnt make dexstrose something avoided sugar sugar form bad pancreas already getting rice fruits everything else many people exercising enough gi good indicator fast hits blood stream first part kinda sorta dextrose form sugar body uses directly means upon consumption blood sugar peak fast taper quicker well bad people diabetes sizable amounts risk however sucrose takes additional half step body breaks dextrose fructose much better diabetics marginally average person doesnt matter particularly unless youre eating excessive amount case neither good also context weight loss avoid least outside presence fiber understanding amount calories absorbed working goals specifically dispel guy thread saying danger posed dextrose sucrose would also pose additionally fearful dextrose foolish thats body ultimately break carb poison efficient body consume directly problem guess use candied fruits coated sugar used big time user kellogs trying true elements going back kellogs sugar form bad pancreas based exactly people exercising problem sugar get fat eat lots fat easy calorie surplus fat well basic thermodynamics calorie deficit lose fat part seems controviersial go oreo thing specifcally candied fruit sugar muesli variant one candied fruit bro added part ingridient bro yaha apne rights ke liye nahi lad rahe food ke liye kya hi revolution ayega stuff like im outta read keto sugar causes inflammation basis illness years ago used inspections done food products kinda similar cbi raid corruption like spices grains nowadays theres none",
    "light_cleaned_title": "How brands cheat people. Now even reading the ingredients is not enough.",
    "light_cleaned_selftext": "37% ADDED sugar but no mention of it in the ingredient list. How can this be legal. I know it's written in nutritional facts, but how can they exclude it from the ingredient list when it's the main ingredient!!",
    "light_cleaned_comments": "Hello Foodpharmer Perhaps the dried fruits are dipped in sugary liquid and dried again. I think India should be stricter in food regulations. Need a revolution. [In an official statement, the Food Safety and Standards Authority of India (FSSAI) said it has approved \"a proposal to display nutritional information regarding total sugar, salt and saturated fat in bold letters and relatively increased font size on labels of packaged food items\".](https://indianexpress.com/article/india/fssai-mandatory-labelling-salt-sugar-fat-packaged-food-items-bold-letters-bigger-font-9437230/) Tbh, we are talking about India here, and I have lost hope anything will change here It will man. Horlicks had to remove \" health drink\" from ads. One can only hope Couldn't someone sue them for this? You think so? Armed revolution Whorelicks Bro thats the sugar from the dried fruits, not added. The fruits are dried in a sugar solution to increase their lifetime. \"Added sugar\" Need a revolution in people People are actually reading ingredients now. It's so good to see people trying to lead a healthy life and are asking right questions out in public. Thanks to foodpharmer ig. Yeah. Makes sense. I guess their cheat is their interpretation of \"dried fruit\". But actually adding sugar. You are right. Nowadays, most people don't pay attention to these kinds of details, but food companies are very clever. > India should be stricter in food regulations Buhahahahahahahaha! Gaand mn danda vro...as if govt cares about common people's life here. Don't know about the second one tho the first one has dried strawberry, kiwi and dried mango. All of them which i have bought out of the market and they have grainy powder sugar coated over them. So this might be it...m No offense to anyone in the flesh trade, a far more noble profession than whatever these deceitful companies are doing. I will bring my star wars swords and SPD red ranger mask. Let’s do this We can neither increase quality of standards nor enforce them without increasing state capacity. Given how things are, awareness and bringing it up on social media (aka armchair activism) is the best thing. Also, the bottom up approach works very well especially in the longer term. We should adopt systems like in Spain, Germany and Netherlands that grades every packaged food from A to E, A being the healthiest, I just a reel about that. But that would bring a lot of backlash from food companies. I bought the same thing a couple of days ago thinking it was just fruits, I looked at the ingredients and it had no mention of sugar so I got it, seeing the added sugar I was shocked. Tried returning it on zepto but couldn’t 😭 honestly sucks man Not gonna happen, they’ll buy bonds and case will shut They'll just buy the govt food inspectors and change the rating. Just like the article that says coke is better than milk by a so called expert. India is too far gone in government worship to have any sort of meaningful revolution. India needs a bureaucratic revolution. People hate red tape but it's the only thing keeping society in order. Half the people don't even know eating that much sugar is very very bad for their bodies. Eternal vigilance by informed and concerned people (like op), forcing fssai to control these elements seems to be the only way ahead Bro your statement is contradictory. The attitude of corporate brands is probably that the country has more people than land available, so it does not matter if certain percentage of people suffer from poison , Indian society will make more anyways lol. I belong to food processing industry, cranberry preservation needs little addition of sugar and it is inevitable. 5% to 8% of sugar is added to make it palatable otherwise it will be so tart and acidic. The worst component in the shown photo is dried strawberry, dried mangoes, dried kiwis. Usually these are imported from Thailand and they contain very high percentage 10% to 25% of added sugar, colours and high ppm of sulfur or cocktail of preservatives. Always consume preservatives colors and additives free naturally dried fruits, of course these dried fruits will be dull in colour. Are you with the corporate on this or people? I am from the food industry and this is my take: 1. From the Food Safety Act 2006, Regulations 2011 and many more, FSSAI is progressing with food regulations. One should keep in mind that it is a science and always evolving with new risks etc. (So the law is there and nearly at par with world standards! FSSAI bases itself mostly on the Codex Alimentarious.) 2. Enforcement of these regulations: that's the weak link where all food labels, recipes, etc can't be validated / checked by FSSAI and then we will be in a massive bureaucratic bottleneck. So there are some audits and checks but unfortunately companies can bribe the officials and get around it. 3. The onus of being conform to the law therefore fall on each manufacturer, producer etc. I have worked inside many food companies and many take their task seriously and are confirm to the law but there are many that think only of the bottom line. The culture of food safety emanates from the top management of the company. (Sometimes it's just an honest mistake because its a very complex industry with complex laws) 4. And the final responsibility to hold producers accountable is on the consumer. I will encourage you to shoot and email to the manufacturer with the picture of the product, the batch number and ask for a clarification. If you don't get a satisfactory answer then reach out to FSSAI. The authority has developed helplines for consumers. I encourage you all to voice your dissatisfaction directly with the company first. Maybe they have an explanation to your query. Maybe they will admit their mistake, give you a free exchange of your defective product... I hope this helps. :) These companies are very clever. I can assure you they are using some kind of technical loop hole. It's useless to sue them they have a huge amount of legal advisers and infact know what they are doing most of the times. Well, you all could NOT purchase or eat this cr*p, but who is willing to listen to advice that preaches austerity, lol I believe, using skill india , the government can train testing associates for fssai and provide them jobs. It’s about execution. andha hai kya lwde? [The Revolution](https://youtu.be/IiiiHwhPAU0?si=7WDV-7WFsnu-Qc1g) this country needs. Its not a fraud. Some of those ingredients have added sugar in them (mostly dried items). They haven't added sugar separately, so they shouldn't mention it in ingredients list This is how ads work on people.. Just buy a damn plum. Why do you need things in plastic packs with bright colours Yes it's because they haven't added sugar in the ingredients list but since the product has added sugar they have to mention in the nutrition list. So they dip it in sugar syrup because sugar acts as a preservative. Now obviously they could have used less sugar but why they added 37g of sugar for 100g it's stupid. Now other brands also do this usually for fried berries and dried fruits for eg happilo also use the same thing in their products but their sugar content is much less than this they add 22g of sugar for 100g so it's actually better than this. how does it work? Most of the dried fruits is basically candy anyways. The process itself involves boiling them in sugar syrup and then drying them . Figs , kiwi, mango ,citrus fruits,plums are the ones with the most sugar . No way they should be called/labelled as healthy at all . Dehydrated fruits on the other hand with zero added ingredients is a whole different thing and something that you won't find easily . But this will increase the cost of food. Reality is we can't afford increased food regulations. Bro totally didn't get what you're trying to say. Sugar is supposed to be an ingredient right That's what I plan to do from now I mean this is probably legal which is why they are able to do it. We need stricter laws. Its not just in India. This problem is all over rhe world. Processed food always has high level of sugars no matter country Thanks for the info, will totally avoid all this packaged stuff now. Yes! I recently discovered this post foodpharmer’s podcast about reading labels. I was shocked! I used Farmley berries mix every morning with my oats. After reading the nutritional facts, I discontinued using the same. Now my oats taste really unhappy 😔 Can someone pleassseeeee suggest a berry mix with NO ADDED SUGAR? I started reading labels religiously after coming across foodpharmer's reels. Now I try to make better, healthier choices. People simply should stop eating. I have left eating chocolates, biscuits, chips. Which dried fruits are comparatively healthier? Which brands to look for? >Perhaps the dried fruits are dipped in sugary liquid and dried again. That's the issue, I buy dry fruits only from this particular shop in my area because ik they don't sugarcoat(literally) their dry fruits, the shopkeeper does keep some which have added sugar but he will tell you *himself* which has sugar and which doesn't even if you don't ask him The brand should specify that the dry fruits are coated/dusted with sugar and mention that shit somewhere where an average consumer will see. Cranberries are extremely bitter so anything that has cranberries will have excess sugar to mask their taste. Yes but it's not an added sugar separately it's in the process of preservation.. That's why it's not in the ingredients list but it's present in the nutrition list. I am not saying that they are not cheating obviously they are now think of someone who is avoiding sugar as a diet restriction or something now when they see the packet there's no mention of sugar initially so they would think it's okay and purchase it. Now if the brand wants they can clearly mention that this product contains sugar but they won't obviously because it will harm their business. A similar thing kwality walls did before there was no mention of oil or frozen dessert on their packaging but now they have started mentioning that this frozen dessert contains 10.2% of edible vegetable oil. Similar thing should be done by these companies, anyway even I was like shocked to see this when I purchased it I still have 1 packet unopened.. it's difficult to find fresh berries in India it's rare for sure.. so this was the closest. I am not defending them at all just informed that why they didn't mention it on the ingredients list. It's better to avoid all this and stick with nuts only like cashews, almonds, walnuts etc.. or if u can find fresh berries that's better. For oats I go with seasonal fresh fruits. Mangoes, chiku, apples, bananas. Raisins sometimes. #LabelPadhegaIndia as long as bribe taking judges dont impose million dollar fines corporates will continue to fool people Maybe the sugar content is within the fruits. I am not an expert, but I guess the dried fruits are dipped in sugar. Hence, sugar is an indirect ingredient of this product. Since, it’s present in the ingredients, they have mentioned the total amount of sugar in the nutritional facts. Obviously they can’t claim it to be sugar free, so they have mentioned it in the nutritional facts instead of ingredients list. We shouldn’t assume that 37% sugar is included apart from the sugar present in fruits. This is what I think and I am not an expert, so I might be wrong. I don’t know about several of these recent brands having been away for a while. However, it would appear the most common ingredient not listed is PE/VC” driven capital? I mean that is certainly not to say the established brands don’t do this. I don’t understand what regulations govern the list but how can you not list the sugar that’s part of the cranberry in the ingredient list?? In addition, *nearly* all cranberry is processed with added oil too. quite surprised not to see that listed either This is the way. Fried strawberries and dried kiwi are soaked in sugar... You can check that in any dry fruit shops... When you ask them they will say to us they are soaked in sugar. I guess that's how it makes it easy there. As someone currently trying a keto diet, the struggle is real. As someone who's just recently started reading nutritional information closely...added sugar and carbs are the two things to watch out for if you're trying to lose weight. Guess what most products are full of. F*#king kids. I'll bring my Beyblade 💪 need a revolution in food regulation, education, healthcare, infrastructure and what else? Well, yes and no. It's not just about testing. That's just quality control, grassroot level of food safety. Quality Assurance is something else all together. Let's talk about food labels because this post is on labels. The country churns our lakhs of different products with lakhs of different food categories. There are many labels that do not meet the required food standard. If it was made mandatory for FSSAI to check and pass each label before they are launched in the market, it would not be physically possible. Therefore, the onus of conformity is on the manufacturer. Let's talk about training and education of food technologists. There are very prestigious institutes like CFTRI in Mysuru churning out very high quality technologists. FSSAI is a goddamn joke. What a scam, its a joke how easily when someone points these things out on the internet, these companies run to sue them Kwality had to mention on the label that they're selling you frozen dessert instead of ice cream.. I hope for some improvements but another loophole will fix that too The dried mango, strawberry and kiwi must have been coated with sugar. FYI for an adult male, the upper limit for sugar consumption (all forms of sugar including gud, jaggery, honey, maply syrup, white, brown sugar and fructose that is naturally occurring in fruits etc) is 36 gms per day. This is not a recommended intake but a maximum limit. For the avg adult woman, the limit is 25gms according to the American Heart Association. What do the percentages of ingredients signify - because adding them all up gives 110%? 32+15+15+10+10+8+5+5 = 110 Fssai is a complete crook Recently when the Indian masalas by banned by singapore for exceeding the permissible limit of carcinogenic ingredients, the fssai increased the domestic limit 10 times.... 10 times!!!! So now domestically there is no contamination because the bar has been shifted... Sab changa si Ridiculous argument. Doesn't matter if they added or not, the ingredient list should mention sugar. Technically a layman will never read \"dried cranberries\" as \"dried cranberries with sugar\". Maggie was taken to task for heavy metal content not because they added it, but because the ingredients they sourced had heavy metals & they should've checked / declared it. If someone has the bandwidth to take this company to court, I'm sure the person has a very strong case. That was after amul took them to court. Amul was the only big one using real milk so they made alot of effort to stop mislabelling by other companies The authorities themselves didn't do anything to protect the public I had bought this same product few months back and was surprised to see the high sugar content. Never buying it again :) >Maybe the sugar content is within the fruits. Added sugars mean they are externally added and don’t include the fruit sugars. This is a misunderstanding on your part, OP. Dried fruits are full of sugar, I thought that was common knowledge. They use sugar to preserve them. Obviously it is not fresh fruit in the bag, is it? It's dried fruit, so mostly sugar. They could have made it even more obvious, but yeah, dried fruits are like candy, they're unhealthy. In fact, even fresh fruit can be pretty high in sugar and calories (for example mango and banana). What are the reasons that dried-fruits are purchased from Thailand and not locally sourced? You're right but this is Reddit, so both me and you just get downvoted for pointing this out, lol. Exactly. What do people expect when they buy this type of snack? Yes, obviously, dried fruit is preserved in sugar. Otherwise how do you imagine it gets preserved? That was my doubt as well, as the above ingredients percentage add up to 100, but if cranberry has 5%-8% of added sugar, shouldn't they write 29.5% cranberry (92% of 32) and rest added sugar, and this for every ingredient. Are museli healthy to eat ..like the once from company (the whole truth or yogabar) who doesn't use any added sugar in their muselis ?? Thank you for a explanatory answer. General guidance is to eat small and frequent meals. Health foods are no cure alls. Believing them to be so is naive. I've eaten tonnes of foxnuts from this brand and for the first few months, even though the front packaging literally said rock salt, it wasnt there in the ingredients at all. After a few months, they wrote something like \"only for marketing\" where they mentioned rock salt in the packaging. It took them a few more months to actually start putting rock salt in it. The only reason I eat it is because it is roasted in olive oil, but given that olive oil is heavily adulterated in the market, I really should consider stopping. Naxalbari ❤️ they are adding to 100 only. why not simply eat rolled oats and add fruits and nuts yourself ? it's cheaper , fresher and no preservatives nor any added sugars . Are you talking about cooked oats ? Rather than working for 84hrs a week. India needs a generation which fights for its rights and put system in place. rolled oats are a variant of raw oats , they are lightly processed and healthier than its counterparts Buy dried fruits from local brands who've been saling them for generations. Ive always avoided branded stuff atleast in dry fruits. Khatta meetha lmfao I assume you are talking about the nutriscore, which is just a marketing ploy. Nutriscore isn't any kind of valid or reliable ranking of true health food. It is merely marketing based on some compromise between people who want to make process food more healthy and food companies that don't want to change anything or be called out on how unhealthy their crap is. As a result, there are no changes made to products but \"nutriscore\" gets added to give people a false sense of healthy to foods that are otherwise not. You can buy chocolate milk that's full of sugar with a nutriscore of A, and buy natural yogurt with a nutriscore of D. It's a joke, you are better off reading the ingredients and nutrition facts to make an informed decision. Foodpharmer sided with Samantha in her recent controversy promoting dangerous alternative therapy bs when the Liver Doctor called her out. I think he's just an opportunist like Abhishek Asthana (Gabbar Singh on Twitter). He don't actually care about people's health. Liver doc is bully imo, Lots of article shared by him is really incredible but he loves to target others. We all have seen frustrated or irritated or \"lazy\" government officials. Humans from similar backgrounds are so much better in the private sectors. When private employees are stretched too thin, they burn out and either perform poorly or find a better job elsewhere. Developed countries have as much as 20%+ workforce in the public sector. US, which is so capitalist and fights to keep the government lean has 13%+ workforce working in public services. Now in contrast to that, India has around 3%+ workforce in the public sector. Good luck finding a better role(either inside or outside the government) if you are a government employee and are burnout, bored, ambitious, \"not fit\", etc Bureaucrats and various services people write bills. Politicians/houses pass a bill. And then the bill needs to be executed and that's where most of the helping hands needed to get the policy/law/reform/plan implemented. We severely fall short of those hands. P.S: 1. I am not saying that more parts of the government should be privatized because privatized sectors are not free markets in general. There are various ways to address the problem but the first step is to understand the issues and *acknowledge* it. 2. I strongly believe that government employees are as good as any normal person can be. FWIW, I am not a government employee. Bullying fraudsters, misinformation merchants and pseudoscience promoters is the need of the hour especially in a country like India. You need not avoid packaged food but eat healthy packaged food that are free of added sugars (invert sugar, high fructose corn syrup, dextrose are more damaging compared to simple white sugar), with added colours, with added preservatives and unnecessary additives. My suggestion would be eat everything that's available fresh, look at label before eating a packaged or processed food No govt regulations for this ? Anyone has any insight about the whole truth brand? Look for preservatives and additives free dried fruits. In photo is preservative (sulfur free) dried apricots. What you normally consume is bright in orange in colour. The natural bright orange colour is maintained through adding high ppm of sulfur based preservatives which in long run damage your digestive organs and pancreas / kidneys. In photo preservatives free naturally dried fig. The light white colour figs get thier colour through sulfur bleaching or fuming which is bad for your gut and overall health I agree but as you said he is opportunist like gabbar. Carefully read the ingredients. Ensure no added sugar other than natural sugars. I can't recommend any specific brand. It's unethical. read the label before you eat Weak Food regulatory authority!!! 👍 You are absolutely right. Virgin and extra Virgin olive oil are the real ones. Most brands use so called olive oil. Regulations are weak implementation is so weak Try overnight oats. Add milk and chia seeds to oats at night in fridge. In the morning add cinnamon, honey and fruits. Great breakfast, no cooking required. Send this to foodpharmer. He can make it viral.. Live in hostel ..don't have fridge facility I don't understand these products. If you want eat fruits, buy one. instant oats are you last options then , you would still require an electric kettle though , boil some water and pour it into oats let it sit for 3-4 minute add any topping That's why it's better to eat locally produced alternatives like dates. Beneficial for locals and probably healthier than the imported ones. only whole truth pintola & alphino are good Silence can be bought Eat direct fruits, nuts, berries people. Spend some time in kitchen. Experiment in kitchen atleast die with ur own preparation not at the mercy of packaged foods….😂😂😂 Do you have any research to back that dextrose is worse than simple white sugar if equated for calories? I looked and couldnt find any I've tried happilo in the past which had no added sugar (at least that's what it says on the label). Had an offer on farmley, read the ingredient list and ordered it. But turns out it's 40% sugar! Ghar ka khana khaalo bc, stop having packaged foods. I came to the sub to ask suggestions about figs etc and then saw this post and feel helpless, i want to buy figs etc. Where should i purchase them? I mean shouldn’t government help in these things and allow good food for the people if they are willing to pay for it. I don’t understand this really if these are bad as per pictures why it is allowed even in first place. Any suggestions guys where should i go to purchase these things Agree, It should be mentioned as ingredients in BOLD. But Again, I don't see anything wrong with sugar. It's the artificial sweetners and colouring I am more concerned about Ideally,just buy fruit Dried fruits have added sugar Unfortunately this statement can be said about so many things not only in India, but the world over. I'm not saying that I blame underpaid low level civil servants in developing nations for trying to get extra money where they can, especially with a family at home. I would probably do it too. I think most would to give their kids a better life. That being said it becomes far less understandable for senior civil servants who already make a good living and are just being greedy. I wish I had an answer. Mostly related to increased inflammation.. cannot find source.. Thank you for this. There is no \"easy\" solution to this. Informed decisions through reading ingredients and being aware of what tricks these companies are using to provide the illusion of health is the only answer if you want to eat something that is as close to unprocessed as said good can get. That's the formula and they know it. Buy your way out of jail, wait until said scandal is out of the news, and then quietly strike a \"deal\" that lets them off the hook. Nothing gets done, the cycle continues. I just stopped eating altogether. No way I can eat unhealthy if I don't eat anything at all! /s If it’s wrapped, it’s probably trash it's technically slightly more calorie dense, but that's negligible. if you look up what sucrose breaks down into, it's 50:50 dextrose and fructose (like in fruits, or corns syrup). no source because it's untrue, sucrose is made of 50:50 dextrose and fructose. I’m willing to bet the diced dried mango themselves have sugar on them Re: cranberries requiring sugar. I intentionally bought some cranberry juice recently that supposedly had zero added sugar. It was tart as fuck and I loved it. I've always wanted to try dried cranberries with no sugar added. Would they somehow be more inedible than the \"no sugar added\" cranberry juice? Hey, you sound knowledgeable about the topic. How much of the nutritional labels are correct in India? Especially the popular brands. “Full-stack brand” that provides “creative … r&d?” Is this a fruit and nuts company or a tech company? Not untrue.. it was in a recent research paper... let's see it then. because dextrose is literally the same thing as blood sugar and is half of sucrose, the other half being equivalent to high fructose corn syrup, that seems unlikely at best. It's difficult to find, I did read it.. it's how the body processes different molecular structures.. You can check out glycaemic index. There would be plenty of research on it. Dextrose is 100 in the GI index, normal sugar is 65. The index maxes out at 100, so you can understand. For reference: I'm not sure you understood it correctly then. because as I've said numerous times now, dextrose is part of sucrose, and is also the exact same molecular structure the body uses to transport sugar through the blood. Well your chemistry is off.. I've got a literal degree in Ochem lmao glucose is equivalent to dextrose, because I know that'll be a point of contention, just a specific chiral form, where levo isn't typically found in nature so let's see your credentials, or better yet, the source of your claim or the chemistry underlying how the body's main store of sugar is worse for you than something that is half glucose and half fructose. You can make easily at home and this is my Granola recipe Recipe 1. 1 tsp of coconut oil 2. 1 small cup of nuts of your choice: chopped into pieces a. I have used the following  cashew nut  Almonds  pepita seeds 3. Add Tbsp of chopped raisins and coconut flakes 4. 1 small cup of rolled oats 5. Pinch of salt 6. ½ a Tsp of cinnamon powder. 7. 2 Tbsp of honey or any sweetener of your choice. Steps: 1. Heat your pan and add coconut oil 2. Add your nuts and fry them until have roasted 3. Now add raisins, coconut flakes, oats and salt 4. Toast it until golden brown 5. Turn of the stove- necessary as the next step will just use the heat of the pan. 6. Add your cinnamon and drizzle honey 7. Mix and let it cool down for 5-10 mins or you can use immediately. >Can't be consumed I eat fresh raw cranberries all the time. I love the sour. FSSAI should eat shit then probably they will start taking people seriously. Absolutely. So many irregularities have surfaced, yet the continue their corrupt nonchalant slumber. Kumbhkaran ki neend. Can you please tell me where it is even possible to get like this in India, preferably online? In addition to this, I’ve always wondered how much can we rely on these figures. One could easily buy their way through these numbers in India and then you could continue to get fooled even when you act like an aware consumer Source nuts and raisins locally and assemble your own mix this is quite an ignorant comment. we’re talking about food here. regulations don’t always imply increase in costs. it involves not selling dirt to a billion people with clever marketing and fancy packaging. that's kind of misleading, because dextrose *is* glucose, no conversion needed. it also doesn't explain the other guy's claim that dextrose is *damaging*, as opposed to \"has an effect on blood sugar\", which obviously, it's the same thing Even that’s becoming a problem these days. To compete with the taste of the ‘with sugar’ options, brands are now starting to use super concentrated levels of ‘natural’ sugars. So, yeah the source of sugar is natural in those products, but the total sugar quantity ends up way too high anyway. For example, fruit concentrate used in ‘no added sugar’ fruit juices. True Elements no added sugar muesli is pretty good Nutritional labels are almost reliable but you should read the ingredients. That's where the real culprit is. Try to avoid processed food products that contain too much of additives and stabilisers. Some brands are really good, some look like good but contain lots of additives. More awareness is required among consumers. It's cheaper and the Thai candied fruit aka dried fruit industry is well established and organised. They are the leading global suppliers of many varieties of candied dry fruit. Kellog has one too and that’s very good too Lot of reserch papers are dumped in deep underground vaults by the ingredient manufacturing industry mafia. Serves us right to eat \"packaged/processed\" fruits instead of fresh ones. We are becoming too much like the west. Except cranberry, all these fruits are very very readily available here fresh, in season of course. Consume fresh fruits instead of juice or packaged candied ones, they are more CANDY than fruit Actually fruit concentrate is not used to sweeten the product except for grapes juice concentrate. Concentrate is used to bring down the cost of a particular fruit component especially if they are imported. Like you said high amounts of sugar or sugar derivatives are added. I would say - drink home made whole fruit juices, much better way is eat the whole fruits rather juice. Interesting, TIL. I hadn’t thought about the cost aspect. Are the colours used in India on par with international standards? Or are banned ones (banned in other countries) being used here in bulk? Which brand is this? We need to report this to food pharma right now. So that it could be brought to the attention of a wider audience. We may also succeed in forcing this scummy company into fixing it's label First tier, Natural flavours / natural colours / vegetable derived colours are the best... But expensive Second tier is the nature identical flavours, nature identical colours - mostly derived synthetically but has very close molecular structure resemblance to their natural counterpart. Considered as safe. Third tier, synthetic flavors and colours - the real bad guys. Depending on the target market segment brands use either the best or safe or the bad guys. Decicided based on price sensitivity of the target market. Flavours and colours approved for use in India may not be allowed in EU / USA / Developed Far east. Country and regulatory dependent. Little difficult and expensive. If you are a traveller buy when you travel that's the best option. Stick to locally available fresh or minimally processed fruits. Everyone has different taste pallet, try some to experience if it suits your taste master aka tounge 😉 All berries are preserved with sugar. Even if you buy from a dry fruit shop in loose qty It may have a higher Glycaemic index which is more \"harmful\" for a diabetic person (although thats not true entirely, since what matters is the overall glycaemic load which depends on total calories). But for a healthy person, the difference really is immaterial. Sorry but what evidence do you have then. If we are going by personal opinions, i would put them all in the same category and just entirely avoid or just consume them in very small amounts. People have a weird love and affection for white sugar as compared to dextrose and fructose lol. It doesnt make sense why any one wi be better or worse equated for calories I haven't been able to find any store bough museli that doesn't use sugar and/or processed dried fruit. Both museli mix and bars are super easy to make on your own, that's the only way to control. I make bars weekly and keep them stored in fridge for a snack and can take out if not going to be in extreme heat for more than 30 mins. All you need is – * Oats - 40 - 50 gm * Peanut butter - Two Spoon. Only use unsweetened ones. * 1 spoon coco powder. Again only use 100% cocoa without sugar. Hersheys sells one. * 1 or 2 spoon honey or melted jaggery. Can't be avoided as this works as binding factor. Dates pulp can work too, but they require a bit more quantity and effort. * Throw in roughly chopped or any nuts and seeds you like. I use Almonds and pumpkin * Sometimes I will add 15-20 gm of whey protein powder. * Tiny pinch of salt to balance it out. * Mix all of them for a while and set them a small tray with parchment paper, press from top and freeze for 2-3 hours. And they come out great. It's not my personal opinion. You are right, avoid or consume in small amounts. Can you suggest any good brands for such berries and dried fruits? Sorry it is unethical to suggest in a public forum I mean, generally it's the naturalist fallacy; cane sugar seems less \"processed\", it's getting them to admit they don't have any real backing to that belief that's the struggle That’s the ideal way but then I’ve to cut fruits 😅 Dried berries are much more convenient when I’m getting late. Thanks will try it I'm glad that people of my country are becoming aware of such important things and having a discussion on this. ❤️🙏 It’s not obligatory. Companies don’t need to put it I was about to order this from Blnkit but after seeing this post had to change my mind. even if that were true, you can't discredit all that he's done in trying to fight the misleading claims of the packaged food industry and more importantly, the amount of awareness he has brought to the common man when it comes to reading labels and ingredients and making informed choices very difficult to identify if the dates you buy are farmed in India or exported from somewhere. delmonte has this product in Amazon. They are called turkish sun dried apricots. I find it much more tastier than the bright orange version. Best solution never eat anything which is packed food Surely the volume of such technologists are less? Manufacturers wouldn’t be strict about quality until they are penalised. We can only penalise when we detect faults. May be it’s just how the Indian automotive discipline and traffic situation is! People only start wearing helmets when you charge exorbitant amount and also catch them.. You are right about assurance! Do you have any recommendations for good brands? if you are trying to lose weight, no matter diabetic status, it is better to avoid high glycemic foods delmonte has this product in Amazon. They are called turkish sun dried apricots. I find it much more tastier than the bright orange version. Time to start pouring billions of rupees more into FSSAI I've noticed this as well. Not sure if it was Farmley or Bagrry's flavoured makhana, but one of them had listed their sodium level, and one had not. Same flavour too. I was shocked to know the one which had mentioned it, it had so much sodium. I could see why the other brand would have hidden it since the snack is sold as a 'healthy' alternative Wow that's really useful to know. Dried mango used to be my go to snack for when I'm craving something sweet but wanted to eat healthy,🤦 i completely agree w the 1st para, ppl go to govt sector because \"i dont have to work a lot, ill get respect, life will be sorted, etc\"... mentality is such, there isnt any look for development. and its a peer mentality even if u get in the public sector. i dont get the point where u write ambitious among words like bored or burnout, also \"not fit\" word when u mentioned that in private sector, people can switch job when they are not fit. this might sound self explanatory but i have a feeling there is more to it... 3rd para was pretty new to me. can u tell me something i can google to understand more? im really interested in the conversation There are very few brands in the market who dry mangoes without any additives or preservatives or added sugar / colour. Trust me on early part of my career i worked in Thailand and I know what all crap goes into making a dried / candied fruit. Lot of people aren't trusting that fruits could be dried without adding sugars and other craps. FYI I am sharing a proof I am not related to this company / owner / promoting the brand. Sharing the information that good products exists, especially in the developed world. And it is not hard to process / manufacture them in India too. All it takes is a commitment to offer good food to consumers. This gave me constipation each time I had it. Just get regular dry fruits from wholesale shops.. ever since i have left sugar and actively started checking the nutritional facts- everyday i am surprised by 'healthy brands', there's literally Sugar (in huge quantity in everything), using ingredients like palm oil and so o Wont be surprised if the brand responds with saying that it is as per the FSSAI guidelines. FSSAI is such a fraudulent government org and so much shit is just unchecked. Every now and then they will pretend to act in response to public anger but end of the day they will quietly return to 'normal' just like the common public who forgets about it. Incorrect. There are literally studies which show people can lose weight even if they eat oreos. Glycaemic index has nothing to do with total calories. And weight loss is influenced by calories in - calories out this is what Food Pharmer has been telling us. we didnt pay attention... now everyone is waking up Dried berries almost always come with sugar. How can you not know that? They are not adding sugar from top, it's there in the processed berries. Stop eating processed food. Also, you are shocked at this? Wait till you find about the hidden sodium in processed foods.. What should we buy, any brands with pure dried nuts or dried fruits options 😭 Dont eat high gi food. I highly doubt this claim, can you quote those studies? Bruh, do you even know what you're talking about? or just saying for the sake of saying it? Pls read up then comment. Worked as a creative head for an \"organic\" food brand. I noticed that their labels did not seem right and asked their designers about how they got the info - they told me that it was just guess work 😬 I've got a degree in o chem, as I explained to the other person, perhaps you should get an education bruh? I'll also point out you've not disputed anything particular I've said, so unlike with the other person, I can't cite sources. would you like to make any specific claims? Bruh wtf Ok my bad for assuming things, I take my words back. What my understanding is that, the body processes sugar till the time it is getting it, the moment there's a deficit, it'll tap into the fat stores. so fat starts burning, and that's how you loose weight. Now if, I start eating food with high glucose/sugar content in it, then body has more sugar to process, and if there's surplus it'll store it in the form of fat. So, a complete opposite of the above process happens. So doesn't that make dexstrose something that should be avoided more than sugar? Sugar in any form is bad for pancreas. You are already getting it in rice fruits, and everything else. And not many people are exercising enough. GI is a very good indicator of how fast it hits blood stream for the first part, kinda sorta? dextrose is the form of sugar your body uses directly. that means upon consumption your blood sugar will peak fast and taper down quicker as well. this is bad for people with diabetes in sizable amounts, or at risk for same. however sucrose takes an additional half step where your body breaks it down into dextrose and fructose. this is not much better for diabetics, but marginally so. for the average person, it doesn't matter particularly unless you're eating an excessive amount, but in that case, neither is good for you. also in the context of weight loss, avoid both? at least outside the presence of fiber, is my understanding. Just any amount of calories that are absorbed are working against your goals but to specifically dispel what the guy up thread was saying; there is no danger posed by dextrose that sucrose would not also pose. additionally, being fearful of dextrose is foolish as that's what your body will ultimately break down most any carb into. it's not a poison, it's just very efficient for your body to consume directly. Only problem is i guess they use candied fruits which are coated by sugar - I used to be a big time user of Kellogs but after trying True Elements it is no more going back to kellogs Sugar in any form is bad for pancreas? Based on what exactly? And people not exercising is the problem, not sugar itself. You can get fat if you eat lots of fat too. Its easy to be in calorie surplus through fat as well. Its basic thermodynamics. If you are in a calorie deficit, you will lose fat. What part of that seems controviersial? Here you go about the oreo thing specifcally: No candied fruit in their 0 sugar muesli. That variant is the only one that does not have candied fruit. bro it's 'added' and not part the ingridient bro Yaha apne rights ke liye nahi lad rahe, food ke liye kya hi revolution ayega Stuff like this is why I’m OUTTA here Read about keto. Sugar causes inflammation which is the basis of all illness. Years ago there used to be inspections done on food products kinda similar to a CBI raid for corruption like spices and grains.. nowadays there's none of it why?"
}