{
    "id": "1d0m1kk",
    "title": "Boo Dating App Scam in Delhi",
    "url": "https://www.reddit.com/gallery/1d0m1kk",
    "selftext": "So this happened a week back. \nMy friend had downloaded this dating app called 'Boo'. I had never heard of it so I had no clue how genuine this was. \nHe got a match with a girl named 'Sonal Verma'. She instantly messaged him and after chatting for a while they both exchanged their numbers. She asked him to meet at R.K. Ashram Marg metro station. \nThe other day my friend went their and after talking for a while, she said she's hungry and asked to go a restaurant nearby. The restaurant's name was 'Bunon Bar n Lounge'. My friend, without doing any research of his own, went there. \nAs soon as he entered, they weren't given any menu card, and the girl ordered 5 gun-fire shot, a hookah, along with a plate of some starter snack. \nAfter a while the girl asked my friend to come to accompany her to the washroom to which he denied as he suspected something fishy with that pub. \nHe asked for the bill, and the waiter came up with a paper slip on which the amount of bill was written 'INR 22,000'. \nMy friend insisted the staff to give their menu card so as to check the amount to which they denied. He tried to go out but the staff didn't allow him. The girl said that she didn't have any money with her, but after insisting for a while she agreed to split the bill in half. \nStill my friend ended up paying 11k to that restaurant for something that he didn't even use. \nAs soon as I got to know about this, I looked up this resturant over Google and Instagram and found similar cases. I saw that people had shared their experiences of them getting scammed at the same place with the same girl, and having the same phone number as well. Few reviews even said that the victim had to pay 68k in some cases.\n\nIt is pretty obvious that this is a scam that is being run in sort of a partnership of both the restaurant and the girls. \n\nBut I am sharing this just so everyone is aware of this, and so that you make sure and do your own research before going on dates over such shady apps. \n\nP. S. I, along with my other friends, had suggested the guy to report the same to the nearest police station, but sadly my friend wasn't too keen on interacting with police on the same. \n\nAlso regarding the girl, she blocked him as soon as they left the place. ",
    "flair": "Crime",
    "score": 1,
    "num_comments": 14,
    "created_utc": 1716672566.0,
    "convurl": "https://i.redd.it/axke3dbw4n2d1.jpg",
    "comments": [
        "Before you go on date in Delhi, with someone you met online........... always check r/delhi   \nThese scams are very prevalent, and they have been reported in r/delhi since eternity.\n\nMy condolences to your friend.",
        "This is the most \"asking for a friend\" thing I've read in a while. Down to the details of what was ordered lol. It's ok, OP. We all make mistakes.",
        "I searched and saw so many fraud scam victims in reviews , why hasn't police taken action against them? Garbage delhi police!?",
        "Is this friend with us right now",
        "The friend is dead and his soul is present at this Reddit séance, warning us against this heinous treachery.",
        "I read about such scam almost every day. Is there even any guy who get lucky enough to get laid?\n\nAt this point, just go to some shady Spa/Massage shops, or hire some hookers.",
        "atleast he didn't get robbed /beaten or get his kidney stolen...\n\nkeep it as the ultimate learning experience and move on..",
        "No clue! \nMy thoughts on this was that the specific club might already be paying some kind of 'hafta' to their local police station.",
        "Yes, he's alive and doing well. \nJust coping up with his monetary loss.",
        "Hahahaha...😆 Tbh while writing the whole thing, I felt that this there would definitely be someone saying this.\nBut in this case the victim was my friend and not me. 😅",
        "I guess these apps really worked for individuals when they entered the Indian market, but I feel that they have sort of reached their saturation point at this day and age.",
        "Good for you!"
    ],
    "cleaned_text": "boo dating app scam delhi happened week back friend downloaded dating app called boo never heard clue genuine got match girl named sonal verma instantly messaged chatting exchanged numbers asked meet rk ashram marg metro station day friend went talking said shes hungry asked go restaurant nearby restaurants name bunon bar n lounge friend without research went soon entered werent given menu card girl ordered gunfire shot hookah along plate starter snack girl asked friend come accompany washroom denied suspected something fishy pub asked bill waiter came paper slip amount bill written inr friend insisted staff give menu card check amount denied tried go staff didnt allow girl said didnt money insisting agreed split bill half still friend ended paying k restaurant something didnt even use soon got know looked resturant google instagram found similar cases saw people shared experiences getting scammed place girl phone number well reviews even said victim pay k cases pretty obvious scam run sort partnership restaurant girls sharing everyone aware make sure research going dates shady apps p along friends suggested guy report nearest police station sadly friend wasnt keen interacting police also regarding girl blocked soon left place ",
    "cleaned_title": "boo dating app scam delhi",
    "cleaned_selftext": "happened week back friend downloaded dating app called boo never heard clue genuine got match girl named sonal verma instantly messaged chatting exchanged numbers asked meet rk ashram marg metro station day friend went talking said shes hungry asked go restaurant nearby restaurants name bunon bar n lounge friend without research went soon entered werent given menu card girl ordered gunfire shot hookah along plate starter snack girl asked friend come accompany washroom denied suspected something fishy pub asked bill waiter came paper slip amount bill written inr friend insisted staff give menu card check amount denied tried go staff didnt allow girl said didnt money insisting agreed split bill half still friend ended paying k restaurant something didnt even use soon got know looked resturant google instagram found similar cases saw people shared experiences getting scammed place girl phone number well reviews even said victim pay k cases pretty obvious scam run sort partnership restaurant girls sharing everyone aware make sure research going dates shady apps p along friends suggested guy report nearest police station sadly friend wasnt keen interacting police also regarding girl blocked soon left place",
    "cleaned_comments": "go date delhi someone met online always check rdelhi scams prevalent reported rdelhi since eternity condolences friend asking friend thing ive read details ordered lol ok op make mistakes searched saw many fraud scam victims reviews hasnt police taken action garbage delhi police friend us right friend dead soul present reddit sance warning us heinous treachery read scam almost every day even guy get lucky enough get laid point go shady spamassage shops hire hookers atleast didnt get robbed beaten get kidney stolen keep ultimate learning experience move clue thoughts specific club might already paying kind hafta local police station yes hes alive well coping monetary loss hahahaha tbh writing whole thing felt would definitely someone saying case victim friend guess apps really worked individuals entered indian market feel sort reached saturation point day age good",
    "light_cleaned_title": "Boo Dating App Scam in Delhi",
    "light_cleaned_selftext": "So this happened a week back. My friend had downloaded this dating app called 'Boo'. I had never heard of it so I had no clue how genuine this was. He got a match with a girl named 'Sonal Verma'. She instantly messaged him and after chatting for a while they both exchanged their numbers. She asked him to meet at R.K. Ashram Marg metro station. The other day my friend went their and after talking for a while, she said she's hungry and asked to go a restaurant nearby. The restaurant's name was 'Bunon Bar n Lounge'. My friend, without doing any research of his own, went there. As soon as he entered, they weren't given any menu card, and the girl ordered 5 gun-fire shot, a hookah, along with a plate of some starter snack. After a while the girl asked my friend to come to accompany her to the washroom to which he denied as he suspected something fishy with that pub. He asked for the bill, and the waiter came up with a paper slip on which the amount of bill was written 'INR 22,000'. My friend insisted the staff to give their menu card so as to check the amount to which they denied. He tried to go out but the staff didn't allow him. The girl said that she didn't have any money with her, but after insisting for a while she agreed to split the bill in half. Still my friend ended up paying 11k to that restaurant for something that he didn't even use. As soon as I got to know about this, I looked up this resturant over Google and Instagram and found similar cases. I saw that people had shared their experiences of them getting scammed at the same place with the same girl, and having the same phone number as well. Few reviews even said that the victim had to pay 68k in some cases. It is pretty obvious that this is a scam that is being run in sort of a partnership of both the restaurant and the girls. But I am sharing this just so everyone is aware of this, and so that you make sure and do your own research before going on dates over such shady apps. P. S. I, along with my other friends, had suggested the guy to report the same to the nearest police station, but sadly my friend wasn't too keen on interacting with police on the same. Also regarding the girl, she blocked him as soon as they left the place.",
    "light_cleaned_comments": "Before you go on date in Delhi, with someone you met online........... always check r/delhi These scams are very prevalent, and they have been reported in r/delhi since eternity. My condolences to your friend. This is the most \"asking for a friend\" thing I've read in a while. Down to the details of what was ordered lol. It's ok, OP. We all make mistakes. I searched and saw so many fraud scam victims in reviews , why hasn't police taken action against them? Garbage delhi police!? Is this friend with us right now The friend is dead and his soul is present at this Reddit séance, warning us against this heinous treachery. I read about such scam almost every day. Is there even any guy who get lucky enough to get laid? At this point, just go to some shady Spa/Massage shops, or hire some hookers. atleast he didn't get robbed /beaten or get his kidney stolen... keep it as the ultimate learning experience and move on.. No clue! My thoughts on this was that the specific club might already be paying some kind of 'hafta' to their local police station. Yes, he's alive and doing well. Just coping up with his monetary loss. Hahahaha...😆 Tbh while writing the whole thing, I felt that this there would definitely be someone saying this. But in this case the victim was my friend and not me. 😅 I guess these apps really worked for individuals when they entered the Indian market, but I feel that they have sort of reached their saturation point at this day and age. Good for you!"
}