{
    "id": "18hgrts",
    "title": "Swiggy Rs 570 order cost me Rs 6k, Swiggy delivery theft caught on cam",
    "url": "https://www.reddit.com/r/india/comments/18hgrts/swiggy_rs_570_order_cost_me_rs_6k_swiggy_delivery/",
    "selftext": "A swiggy delivery man delivered an order and in return stole a brand new reebok shoe from outside the flat.\n\nLink to the post- [https://twitter.com/risjain95/status/1734610529417838852?t=t5CKZY9TBbPQB\\_7HHzrktQ&s=19](https://twitter.com/risjain95/status/1734610529417838852?t=t5CKZY9TBbPQB_7HHzrktQ&s=19)\n\nGuys, please share this post and also express your views, I have reached out to swiggy and on telephonic conversations they are denying to compensate.\n\nThe person in the question is representing Swiggy and is on duty wherein he has stolen an item.\n\nThis incident happened in sector 76, please be aware and vigilant.\n\nPS- The above link has 4 videos in case it's unclear",
    "flair": "Crime",
    "score": 45,
    "num_comments": 5,
    "created_utc": 1702474042.0,
    "convurl": "https://external-preview.redd.it/0RA3LX8rnsnfSJUdEDUCmgxGNUsTCG5JsiZfbWgsS1E.jpg?auto=webp&s=d838871185dff22a3d4daeb9370a3f9983f39ba0",
    "comments": [
        "What happened was unfortunate. File a police complaint and provide all the details\n\nI don't see why swiggy will compensate for this.",
        "This is sad",
        "Swiggy will have that person's current address as well as Aadhar card copy. You can request for both through a police complaint."
    ],
    "cleaned_text": "swiggy rs order cost rs k swiggy delivery theft caught cam swiggy delivery man delivered order return stole brand new reebok shoe outside flat link post httpstwittercomrisjainstatusttckzytbbpqbhhzrktqshttpstwittercomrisjainstatusttckzytbbpqbhhzrktqs guys please share post also express views reached swiggy telephonic conversations denying compensate person question representing swiggy duty wherein stolen item incident happened sector please aware vigilant ps link videos case unclear ",
    "cleaned_title": "swiggy rs order cost rs k swiggy delivery theft caught cam",
    "cleaned_selftext": "swiggy delivery man delivered order return stole brand new reebok shoe outside flat link post httpstwittercomrisjainstatusttckzytbbpqbhhzrktqshttpstwittercomrisjainstatusttckzytbbpqbhhzrktqs guys please share post also express views reached swiggy telephonic conversations denying compensate person question representing swiggy duty wherein stolen item incident happened sector please aware vigilant ps link videos case unclear",
    "cleaned_comments": "happened unfortunate file police complaint provide details dont see swiggy compensate sad swiggy persons current address well aadhar card copy request police complaint",
    "light_cleaned_title": "Swiggy Rs 570 order cost me Rs 6k, Swiggy delivery theft caught on cam",
    "light_cleaned_selftext": "A swiggy delivery man delivered an order and in return stole a brand new reebok shoe from outside the flat. Link to the post- [https://twitter.com/risjain95/status/1734610529417838852?t=t5CKZY9TBbPQB\\_7HHzrktQ&s=19](https://twitter.com/risjain95/status/1734610529417838852?t=t5CKZY9TBbPQB_7HHzrktQ&s=19) Guys, please share this post and also express your views, I have reached out to swiggy and on telephonic conversations they are denying to compensate. The person in the question is representing Swiggy and is on duty wherein he has stolen an item. This incident happened in sector 76, please be aware and vigilant. PS- The above link has 4 videos in case it's unclear",
    "light_cleaned_comments": "What happened was unfortunate. File a police complaint and provide all the details I don't see why swiggy will compensate for this. This is sad Swiggy will have that person's current address as well as Aadhar card copy. You can request for both through a police complaint."
}