{
    "id": "137c3g1",
    "title": "India Today: 'Itni izzat giraoge kya?' Vinesh Phogat breaks down, says cops pushed protesting wrestlers",
    "url": "https://www.indiatoday.in/india/story/wrestlers-protest-vinesh-phogat-emotional-protesting-scuffle-delhi-police-jantar-mantar-wfi-chief-2368293-2023-05-04",
    "selftext": ".....and the high and mighty, the so-called leaders of our country who otherwise shout themselves hoarse are not-so-surprisingly silent.",
    "flair": "Law & Courts",
    "score": 1609,
    "num_comments": 163,
    "created_utc": 1683181383.0,
    "convurl": "https://external-preview.redd.it/6p-0iFwfP0_TsAY3BiFa_oDwLp9TaIifSsP--uJxjZU.jpg?auto=webp&v=enabled&s=390c2b3362826c218a2c01773210ad2fa6f9dd7b",
    "comments": [
        "If these celebrities have so difficulty in getting justice. Its hard to imagine any common person will get justice ever.",
        "long awaited icebreaker",
        "Just looking at the visuals from yesterday is heartbreaking, imagine winning all these medals for ur Country nd then be put through this.😔  Pehle Farmers koh target Kiya, phir bollywood nd now these Athletes..",
        "I hope other people who are on top of their field understand how their glory will be hogged by a person for their own gain but when time comes they will be ditched without a second thought by that same person.\n\nIf you can't criticize that person at least don't choose his side.",
        "Nazi modus operandi being repeated.",
        "If you are not aware then pls stop forming stupid opinions",
        "This govt is too arrogant to apologise and make a guy resign....no one resigns...",
        "Given Mudiji quikly jumps on the selfie with sportspersons bandwagon, this Brij Bhushan must have something pretty damning against someone pretty powerful if he is not even resigning from his post",
        "Aah the Epstein defence",
        "BJP and BJP andhbhakts doesn’t care about our nation or it’s people. They just want BJP to stay in power. They are the real anti nationals. Desh drohis.",
        "Laughable. I still remember all the hate they spewed against the women of Shaheen Bagh.",
        "Common man doesn't get justice, he gets juiced by [the juicer](https://youtu.be/0NuivJMFPkg).",
        "Kabhi Kabhi Lagta Hai...\n\n![gif](giphy|MRG6k5gsTfASjBzTQr)\n\n...Apun Hi Bhagwan Hai",
        "That clown likes campaigning for elections more than governing. Wish he kept PM post and continued with circus but appointed able men like Gadkari to govern. Gadkari is one exception. Rest are chest thumping clowns who know just arrogant talk and posturing.\nMy heart cries for this lost decade for India. With clear thumping majority, even sky wasn't a limit. But these clowns turned it into a pissing contest.",
        "Dangai aur mawalion se izzat ki baat?",
        "All the silent sportsperson earning millions should know that they could be next.",
        "Not before 2024. Nothing is more imp than that. Not even a completely \"for-show\" resignation",
        "people can be afraid. do not forget that.",
        "The problem with BJP is its arrogance and ego. How dare they make us apologise ?",
        "Phogat on people protesting against NRC are anti-national and Pakistani, and farmers protesting against farm bill are khalistani.\nAb ka huwi chori tane tu koun hai ?",
        "Maybe that's why they are silent . They don't want the spotlight of CBI , ED and IT cells.",
        "Yahan pe toh ye actually hai",
        "That Gujju is 73.",
        "https://preview.redd.it/0bwuiin4htxa1.jpeg?width=744&format=pjpg&auto=webp&v=enabled&s=cad4dc20902fbb691e3ec6c367a2b10b06be1afa",
        "Heard they are returning all their medals now. Soon they will all be part of Award Wapisi gang.",
        "Karma",
        "Against everyone from JNU, Tabliqi, Shaheen Bagh, all CAA protestors. I firmly believe they will still vote for BJP if bjp removes Bhushan even a day before elections.",
        "The sheer amount of effort being out to defend a gangster, what's the difference between him and ateeq. Shouldn't our blood thirsty media demand his encounter as well.\n\nInstead they are working hard to restore his image.",
        "Gadkari is not an exception. Right from changing the way road calculations are done (4-lane 1km stretch=4km development to show record breaking numbers), building while ignoring environmental studies (think of all the landslides in hilly areas) to straight up corruption (Scania luxury bus story) he's done it all.\nHe's just a hardcore RSS guy so he gets very sheltered.",
        "56 Inch ka seena h bhai. Aise hi thodi apni galti Maan lega. /s",
        "Absolutely love the stand up by Varun Grover. Waiting for his next gig",
        "&#x200B;\n\n![gif](giphy|1fuPzz0fWrCmEeqXi3)",
        "And the conversion of roads to concrete ones under the guise of green roads, just as that galactus swallows cement companies.",
        "Its a show of loyalty, you scratch my back I scratch yours.\n\nSaving (or not saving) sets a precdent and sends a message to the other party members, which, is this case is, \"Be loyal to us and no one can touch you\". Otoh, convicting him would send a different message, which a party full of criminals wouldn't find ideal.",
        "Everyone will realize now or later.. Even the Godhi Media will be thrown under the bus for the good of Modiji..",
        "They are not interfering because they know comom people will never give up their entertainment. \nI suggested, protest against this by giving up IPL viewing..i got downvoted to oblivion. \nWe all are very much.enraged, but only at our convenience, right...",
        "This is GOLD..!!",
        "These arent celebrities, they are regular people, hard working regular people, just as the rest of us.",
        "All the sports persons participating in various events throughout India, need to pull out, right NOW! \n\nSame goes for you guys watching IPL. STOP. RIGHT. NOW.",
        "If I am not wrong, that is Babita phogat not Vinesh phogat. Also Babita is phogat is not part of wrestlers protest.",
        "Are Babu Bhaiya Aap Idhar ku",
        "5.6 mm gobhi ji ki pp energy going strong",
        "True😂",
        "If all this was happening at any other time period, would have agreed to your point. But this is election time and the govt would be worried about it's image more than anything. Guy is running around Bangalore with circus show leaving God knows who to do the government work. So, obviously, Brij must have some hardcore dirt on something for them to risk their image in front of the whole nation. Especially, given that the ppl who are protesting now were (are still) their loyal supporters.",
        "Exactly.",
        "Babita has turned after yesterday's police struggle. Also the guy tweeted something about dogs being more grateful.",
        "एक कुत्ता भी एक दिन रोटी खाकर आपका वफादार बन जाता है पर कुछ इंसान देश का अनाज जन्म से खा रहे है फिर भी वफादार नहीं हो पाए ।।",
        "4x1 is global rule. This is the only thing this govt picked from global standards as it suited its narrative.",
        "Only Cricketers are celebrities here - other sports person are just like normal people barring a few exceptions here and there",
        "Whenever the Regime Changes, the first thing they should do is to formulate strict Sedition and Treason Laws, and prosecute all the goons today and their supporters.",
        "This isn't actually a right take tbh. If I am watching English football then that doesn't mean I am supporting  Ukraine in Russian war.\n\nThis is vague take. You can always watch what you like but the first part where everyone should start is actually on your social media accounts. People who aren't good at the art that they do are probably the most entitled ones barking just because they have followers.\n\nHow will boycotting ipl can directly help the case? And just like I said above even if you want to start a boycott start on social media because this is where it hurts.",
        "This is just a reminder as well that Coward Kohli still hasn't said anything about this, but was too quick to post some statuses about Naveen and Gambhir.",
        "This is exactly my thoughts as well",
        "You really think cricketers specially women, won't be facing similar issues?",
        "BJP bhagaao, desh bachaao.",
        "If you smile in his selfies then you are the gold medal winning athlete. If you protest then you will be punished by the police. This is the justice system of India.",
        "He is a locally-powerful politician, as well as a hindutva mascot and mafia don. He has boasted about his murders on TV, with no consequences. See e.g. [‘Don of all dons, murderer, wrestling reformer’ — WFI chief & MP Brij Bhushan’s colourful life](https://theprint.in/india/don-of-all-dons-murderer-wrestling-reformer-wfi-chief-mp-brij-bhushans-colourful-life/1323788/)",
        "The one's who voted for the clown wanted the circus",
        "What is opposition doing? Why is this not a national issue?",
        "usko bolna ki ye anaj tu baatne aya tha humko kya?",
        "The ruthlessness of the BJP shown by the fact that a few years ago her ~~father and sister~~  cousins were welcomed to the BJP with much fanfare. And now being crushed by the same party. Joins a long list of others. But our public continues to be under the impression that mudi knows best. Country is fucked.\n\nEdit: ~~I won't lie, I'm only human and felt a tinge of schadenfreude considering the phogats earnest demonization of Shaheen bagh protesters.~~  apparently the poghats who joined the BJP were her cousins. Apologies, and a good reminder to check ones facts before posting.",
        "This is not a political issue. Don’t make it political",
        "Imagine how the government is protecting an accused paedophile. He is no saint by any measure by the number of cases filled against him and his behaviour in public life. The number of criminals in our political system has progressively increased and police have become just a pawn to the party in power. Time has come and gone for police reforms, stricter criteria for accused criminals and independent institutions.",
        "It would backfire just like UAPA. We need laws to empower the common citizen not the system.",
        "While i see all this issues come up all of a sudden. Even I see many political parties involved too in making such issues. I mean many times so many things are just politically motivated and tool of other political parties too. I don't know how to trust anyone now a days.",
        "things went real bad real quick.\n\nsmall youtubers posting few videos - https://www.youtube.com/watch?v=ZyMbsMCb6_0 and these are very very disheartening. \n\n\nhow this doesn't upsets anyone who has a daughter/sister ??",
        "this one image sums-up the \"justice\" in India for anyone who dont have association with modi.\n https://images.news18.com/ibnlive/uploads/2020/09/1601444101_hathras.jpg",
        "The whole world stands with you.",
        "The unique thing about mafia is that no one is safe. If you go against anyone more powerful in the mafia, irrespective of your previous association with the group, you too will suffer same fate.\nYou can take any name associated with the govt. The moment they go or have to go against any part of government stronger than them, they'll be treated similarly.",
        ">  71-year-old Gujarati guy screaming Jai bajrang Bali and roaming around Bangalore\n\nwe from Karnataka provide employment for all short of people from all state, we dont alienate people based on their home state, and including elderly folks those were abandoned by their family.\n\nAnd i bet the per hour labour rate in bangalore is 5-6 times more then Gujarat. so let the poor fellow earn his daily wages in whatever task assigned by his master.",
        " Dangai aur mawalion se izzat ki baat?",
        "and dont forget the toll tax moolah helping inflation :)",
        "> That Gujju is 73.\n\nthis wil be considered as gaali number 92.",
        "https://twitter.com/Cryptic_Miind/status/1652260381237170176",
        "\nOfcourse, women face sexism on a daily basis but how many of them are speaking at the moment? That's the issue.\n\nThey all went haywire when Jay Shah announced WIPL but are mum now. Where are Harmanpreet, Shefali & Smriti? Of course it may threaten their career and fame, but that's what standing up is all about, and their words have power.\n\nHave no hopes from Kohli, Gambhir or anyone anyways.",
        "Make criteria for conviction very explicit, and these goons will satisfy even the most progressive and easy interpretation of law.",
        "Almost childish at how stubborn they are.\n\nThey feel the need to protect every last crook instead. I feel like joining BJP is the best insurance against any crime you have committed if they protect their own this much",
        "Who all remember famous sportspersons and bollywood actors tweeting about “Black lives matter”? Where are they now? Fucking clout chaser.",
        "It is meant to send a message. Commoners can't challenge BJP. \n\nIt is hubris that stops BJP from acting against Brij Bhushan. It sets a very dangerous precident, for them, that citizens can actually challenge authority if they are persistent.",
        "A complete anarchy and dictatorship in India.",
        "Although India is the largest democracy in the world, but still why does it seem that it is slowly moving away from the system.\n\nOnly yesterday the name came in the world's 30 worst countries in the Press Freedom Index and on the same day the police beat up the athletes.\n\nDoesn't it work like this?\n\nYou learn from Sweden that there is just one girl \"Greta Gunberg\" whose protest made the whole world talk about the matter of the environment.\n\nBut in India, The Govt. itself is running from those issues and trying it's best to divert the topic and it is better not to have any hope from the media which comes on number 161.",
        "anyone who speaks against  risks getting sidelined at best and Ed cbi, trolled, killed at worst.\n\nwho will have the courage to speak even?",
        "I genuinely hope the wrestlers get justice. When things were better they used to be very overt outlet of the BJP IT Cell. This is a classic example of leopard ate my face\n\nhttps://preview.redd.it/0lgnitvexuxa1.jpeg?width=960&format=pjpg&auto=webp&v=enabled&s=d60977fa76e0b206b08631da9edc1c27465ed995",
        "Where is Sachin Tendulkar now? isn’t this not an “internal matter”?",
        "are woh doosri phogat hai.",
        "once you join mafia you are protected as long as you remain with the mafia.",
        "not to mock the current misery but he himself will be termed the same sooner or later.\nreluctance of opposition to join this protest makes so much more sense.",
        "And then they came for me…..???",
        "just watch tweets by these current victims. they all followed bjp line in mocking the victims.",
        "caste",
        "These people clapped when other protestors were hit, and jailed. \n\nNot so fun when it’s you no?",
        "Already happening. Some BJP supporters are already trivializing their sporting achievements, and making other shitty remarks like this is some sort of \"made up drama\", whatever that means",
        "Any sportsperson other than a male cricketer is hardly a celebrity in India.",
        "yes, but they are equally vulnerable\n.\nthey face risk of Ed, cbi, getting lynched.\nit's an atmosphere of fear for everyone.",
        "I don't think you understood what I said. \n\nCelebrities are safe from most of that. Even if a case is filed against them, they have the means and resources to stay mostly safe. That includes sportspersons who have gone professional, like Sunil Chhetri or Vijender Singh.\n\nAmateur sportspersons, who represent India at an amateur level in the Olympics, Asian Games etc. don't have the means to protect themselves.",
        "> turned after yesterday's police struggle.\n\nmeans ?\n\ngoing against BJP will get the entire family thrown under the bus. \n\n\n-----\n\npeople need to know who is Brij Bhushan Sharan Singh. \n\nThis is the guy who has connection with dawood ibrahim, Atal Bihari sends him apology letter - tooks him out of tihar jail, he murdered people and accepts in TV, etc. \n\nHe is bigger then the Gujarati duo.\n\nif that toothless Teni's son is roaming free, this guy is untouchable.",
        "I understood but I disagree that celebrities are safe. they are equally if not more vulnerable.\nthe government has a habit of setting an example for any one dissenting.\neven top sports person speaking against government can face harassment and risk to life.",
        "I understood but I disagree that celebrities are safe. they are equally if not more vulnerable.\nthe government has a habit of setting an example for any one dissenting.\neven top sports person speaking against government can face harassment and risk to life.",
        "Such a great country and people are trying to stand for a crook like brij bhushan. A mafia who has so many cases and who have even accepted on live tv that he has done a murder . Entire 'bi ki pee' it cell has come forward to protect this goon. \nWhat a sad nation we are turning into .  Motichoor even didn't say a word . But was the first one to do the \"foto-ops\" when these wrestlers won medals.\n\"Mujhe 91 baar gali di \" magalomanic is busy crying on this issue",
        "Who are the dumb people upvoting this stupid comment? That was Vinesh Phogat's sister **Babita Phogat** who is a BJP worker.\n\nThere has always been disagreements in public between the two about politics, and Vinesh had even called out her sister on Twitter when she was going off during the Farm Laws  protests.",
        "I feel ashamed. What have they done to our country.",
        "Wasn't he jailed under TADA for links with D-company?",
        "Does the labour rate also include free cellphones thrown by mistake?",
        "What a mess man. Why is the BJP all so silent today? Why isn't the WFI chief resigning? Cause he's an MP in BJP. Blame games can be played but the truth is Gangsters get to become MPs no matter which government. \nNo wonder the officials who were so happy on Atiq's encounter are all silent today. Should another encounter happen today? Hypocrisy",
        "While some of their fellow wrestlers will just keep shut to save their jobs. Or hope to get tickets for parliamentary or state elections which they might still lose like the last time.",
        "He might have been scared of raids on the fantasy sports app in which he has some stake. Or other companies.",
        "The difference, as I said, lies in the fact that celebrities have the means to fight off the challenges thrown at them. These athletes do not.",
        "Still all labourers and farmers will vote bjp blindly -_-",
        "Just how congress was before their demise",
        "I think everyone should put this in their status, this can be turning point like Nirbhaya and people may realise who they are supporting are no god.\n\nAlso most of people don’t even know they are protesting, it should reach everyone.",
        "They earned this.",
        "This will bring BJPs downfall in the 24’ elections",
        "agreed.",
        "Babita Phogat is not her real sister. She is her cousin.",
        "What is that? Sorry if dumb question",
        "In UP, Caste matters too much. This Bhushan guy is a Thakur, same caste Yogi belongs to. Yogi rule has proven to be a paradise for Thakurs. They are being placed everywhere, from committies, associations, panchayats.. you see a seat, a thakur will be there. Brij Bhushan is one of the biggest faces of Thakur caste. It's said that he has an influence on 12 LS seats. He is not some small goon. He used to do Chai party with Vajpayee and has been an MP for 6 terms now. He has made countless schools and has shit tons of land on his name. His entire family is placed in various posts of several Wrestling federations. You saw Babita Phogat there? Bhushan was the one who made her director in Haryana women wrestling association. He can out her anytime he wants and for her it seems, that post matters more than her own sister. BJP will protect him at all costs. You just wait and watch. This party is all about vote politics only. It knows Thakurs are too loyal to it and they don't want Bhushan to go in jail. I have already seen many Rajput associations twitter accounts defending him and posting shit about these women protesters. Bjp has already compared their worth to Bhushan worth and as anyone can see,  Bhushan is more valuable to them. They gonna protect him no matter what shame it can bring to them because bjp knows the memory of this country is a short one. Once it will open Ram Mandir next year, all will be forgotten and even those protesting might end up voting for it just like Jats of UP did in last UP election despite them protesting against BJP for an year.",
        "I think they already hit the peak with aryan khan.",
        "Corrected.",
        "Literally every national party, no one knows how much money they earn, rallies take crosses before elections and there's no way a corporate company is willing to give that much funds, there are other channels for other parties.",
        "You don't know what they are doing unless you follow their media handles cause Godi media is avoiding this protest like the plague.\n\nAlso, as an ethically & morally responsible citizen,  what are you doing?  \n\nQuestioning the opposition,  when this question should be asked of the Govt?",
        "yes. also under gangster act in UP six times. He confessed to murder on live camera.\n\n[https://twitter.com/rohini\\_sgh/status/1616260381940518912?lang=en](https://twitter.com/rohini_sgh/status/1616260381940518912?lang=en)\n\nBut u wont see media demanding his encounter",
        "I am asking opposition why haven't they made it a national issue. Why isn't it on headlines everywhere?\n\n I know godi media wouldn't show it but where is anti godi media? Social media is soo cheap and easy to get mass support. Opposition is there to help in such situations.",
        "Unfortunately it has come to this that we're now fearing to speak against the Government - the thing which most concerned citizens are afraid of. \n\nI feel so sad looking at the constant decline of political climate of the country.",
        "It's not that. The BJP has always projected an image of strength and wants to cultivate this image that they do not give in to demands made by anybody (legitimate or otherwise). Making an exception and listening to the protesters this time does not align with BJP's self image.\n\nThey may also be afraid that if they give in once there would be many other similar protests cropping up against their other ministers. Pretty much everyone in the BJP has skeletons in their closets and they do not want to invite any kind of pressure that would make them have to deal with it.\n\n(On the other hand, it is interesting to note how much more pliable to pressure the previous Congress government was. Shashi Tharoor once had to resign because of a tweet in which he used the phrase \"cattle class.\" The only people protesting against it were other parliamentarians from the BJP.)",
        "Prompt action by the government was needed but they did not anything. May be BJP knows, their inaction will attract the Congress and Left, giving their entire event a anti BJP, anti Modi campaign. and they will churn the votes out of this before KA elections.\n\nI feel for the wrestlers, just imagine, these players have connections and still they are struggling to get justice on a serious allegation of sexual misconduct. Common people do not even stand a chance. This country was/is/will be run by the rich, mighty and goons. and then they complain we are getting low ranking in happiness index.",
        "Tell that to Joe Pesci",
        "No, it won't. These wrestlers will themselves vote for Modi in '24.",
        "BrijBhushan has immense clout in local UP politics - hence no reaction from BJP. BJP does not want to lose the votes he brings, period. It does not care about \\*minor\\* details like whether he is a criminal / sexual assaulter etc. \n\nIt is for the same reason that you dont see SP (Akhilesh Yadav) saying anything in support of the wrestlers, while all other parties have. SP sees a chance of getting BrijBhushan to join them, if BJP is forced to take action against him.",
        "Except the lady who called the Prophet a pedo..didn't she resign?..I guess it depends on who the govt official has offended.",
        "I want to save it but I'm afraid I'll be erased out of existence before I wake up.",
        "Shah Rukh Khan’s son needed 30 days. A common person is much lower down the rungs.",
        "Get in line. Us normies suffer this regularly",
        "This country is the mother of democracy if anyone forgets.",
        "Coz of international pressure,",
        "He is still the best. He gets the job done well no matter what. \n\nThere are no better leaders. People like MMS are extreme exception. But we abused him for not being a politician like others. We deserve to rot under a vishwa guru.",
        "I might be wrong but i think it's about hathras case,you can check it on Google if you want to know about it but it's a very disturbing case.",
        "Thank you modiji. Under congress rule, we could never imagine this.",
        "I bet they cheered when women at shaheen bag were harassed",
        "Technically he was killed before he was a made man",
        "Boycotting ipl will reduce the revenue money.. money is what people cares about. So they will also get \"enraged\" and may actually open their mouths in support of the actual athletes..",
        "[they will trust panchayat's judgement not HC or SC](https://twitter.com/priyankadeo/status/1654361970219548672) so much sympathy for these wrestlers",
        "There have already been 3 separate investigations from what I have read and nothing has been found to apportion guilt. Plus, these ‘dharnas’ are prone to regularly get hijacked by anti-* that Govt turns a deaf ear… shaheen bagh, farmers protests to name some. There seems to be more than what meets the eye. Add to this their shifting stance from resign to no confidence to no national but straight to olympics.",
        "Exactly. They have higher chances of winning when they go against the bullies but it's said : Vinaash Kaale Viprit Buddhi. They care more about present than their future."
    ],
    "cleaned_text": "india today itni izzat giraoge kya vinesh phogat breaks says cops pushed protesting wrestlers high mighty socalled leaders country otherwise shout hoarse notsosurprisingly silent ",
    "cleaned_title": "india today itni izzat giraoge kya vinesh phogat breaks says cops pushed protesting wrestlers",
    "cleaned_selftext": "high mighty socalled leaders country otherwise shout hoarse notsosurprisingly silent",
    "cleaned_comments": "celebrities difficulty getting justice hard imagine common person get justice ever long awaited icebreaker looking visuals yesterday heartbreaking imagine winning medals ur country nd put pehle farmers koh target kiya phir bollywood nd athletes hope people top field understand glory hogged person gain time comes ditched without second thought person cant criticize person least dont choose side nazi modus operandi repeated aware pls stop forming stupid opinions govt arrogant apologise make guy resignno one resigns given mudiji quikly jumps selfie sportspersons bandwagon brij bhushan must something pretty damning someone pretty powerful even resigning post aah epstein defence bjp bjp andhbhakts doesnt care nation people want bjp stay power real anti nationals desh drohis laughable still remember hate spewed women shaheen bagh common man doesnt get justice gets juiced juicerhttpsyoutubenuivjmfpkg kabhi kabhi lagta hai gifgiphymrgkgstfasjbztqr apun hi bhagwan hai clown likes campaigning elections governing wish kept pm post continued circus appointed able men like gadkari govern gadkari one exception rest chest thumping clowns know arrogant talk posturing heart cries lost decade india clear thumping majority even sky wasnt limit clowns turned pissing contest dangai aur mawalion se izzat ki baat silent sportsperson earning millions know could next nothing imp even completely forshow resignation people afraid forget problem bjp arrogance ego dare make us apologise phogat people protesting nrc antinational pakistani farmers protesting farm bill khalistani ab ka huwi chori tane tu koun hai maybe thats silent dont want spotlight cbi ed cells yahan pe toh ye actually hai gujju heard returning medals soon part award wapisi gang karma everyone jnu tabliqi shaheen bagh caa protestors firmly believe still vote bjp bjp removes bhushan even day elections sheer amount effort defend gangster whats difference ateeq shouldnt blood thirsty media demand encounter well instead working hard restore image gadkari exception right changing way road calculations done lane km stretchkm development show record breaking numbers building ignoring environmental studies think landslides hilly areas straight corruption scania luxury bus story hes done hes hardcore rss guy gets sheltered inch ka seena h bhai aise hi thodi apni galti maan lega absolutely love stand varun grover waiting next gig xb gifgiphyfupzzfwrcmeeqxi conversion roads concrete ones guise green roads galactus swallows cement companies show loyalty scratch back scratch saving saving sets precdent sends message party members case loyal us one touch otoh convicting would send different message party full criminals wouldnt find ideal everyone realize later even godhi media thrown bus good modiji interfering know comom people never give entertainment suggested protest giving ipl viewingi got downvoted oblivion muchenraged convenience right gold arent celebrities regular people hard working regular people rest us sports persons participating various events throughout india need pull right goes guys watching ipl stop right wrong babita phogat vinesh phogat also babita phogat part wrestlers protest babu bhaiya aap idhar ku mm gobhi ji ki pp energy going strong true happening time period would agreed point election time govt would worried image anything guy running around bangalore circus show leaving god knows government work obviously brij must hardcore dirt something risk image front whole nation especially given ppl protesting still loyal supporters exactly babita turned yesterdays police struggle also guy tweeted something dogs grateful x global rule thing govt picked global standards suited narrative cricketers celebrities sports person like normal people barring exceptions whenever regime changes first thing formulate strict sedition treason laws prosecute goons today supporters isnt actually right take tbh watching english football doesnt mean supporting ukraine russian war vague take always watch like first part everyone start actually social media accounts people arent good art probably entitled ones barking followers boycotting ipl directly help case like said even want start boycott start social media hurts reminder well coward kohli still hasnt said anything quick post statuses naveen gambhir exactly thoughts well really think cricketers specially women wont facing similar issues bjp bhagaao desh bachaao smile selfies gold medal winning athlete protest punished police justice system india locallypowerful politician well hindutva mascot mafia boasted murders tv consequences see eg dons murderer wrestling reformer wfi chief mp brij bhushans colourful lifehttpstheprintinindiadonofalldonsmurdererwrestlingreformerwfichiefmpbrijbhushanscolourfullife ones voted clown wanted circus opposition national issue usko bolna ki ye anaj tu baatne aya tha humko kya ruthlessness bjp shown fact years ago father sister cousins welcomed bjp much fanfare crushed party joins long list others public continues impression mudi knows best country fucked edit wont lie im human felt tinge schadenfreude considering phogats earnest demonization shaheen bagh protesters apparently poghats joined bjp cousins apologies good reminder check ones facts posting political issue dont make political imagine government protecting accused paedophile saint measure number cases filled behaviour public life number criminals political system progressively increased police become pawn party power time come gone police reforms stricter criteria accused criminals independent institutions would backfire like uapa need laws empower common citizen system see issues come sudden even see many political parties involved making issues mean many times many things politically motivated tool political parties dont know trust anyone days things went real bad real quick small youtubers posting videos disheartening doesnt upsets anyone daughtersister one image sumsup justice india anyone dont association modi whole world stands unique thing mafia one safe go anyone powerful mafia irrespective previous association group suffer fate take name associated govt moment go go part government stronger theyll treated similarly yearold gujarati guy screaming jai bajrang bali roaming around bangalore karnataka provide employment short people state dont alienate people based home state including elderly folks abandoned family bet per hour labour rate bangalore times gujarat let poor fellow earn daily wages whatever task assigned master dangai aur mawalion se izzat ki baat dont forget toll tax moolah helping inflation gujju wil considered gaali number ofcourse women face sexism daily basis many speaking moment thats issue went haywire jay shah announced wipl mum harmanpreet shefali smriti course may threaten career fame thats standing words power hopes kohli gambhir anyone anyways make criteria conviction explicit goons satisfy even progressive easy interpretation law almost childish stubborn feel need protect every last crook instead feel like joining bjp best insurance crime committed protect much remember famous sportspersons bollywood actors tweeting black lives matter fucking clout chaser meant send message commoners cant challenge bjp hubris stops bjp acting brij bhushan sets dangerous precident citizens actually challenge authority persistent complete anarchy dictatorship india although india largest democracy world still seem slowly moving away system yesterday name came worlds worst countries press freedom index day police beat athletes doesnt work like learn sweden one girl greta gunberg whose protest made whole world talk matter environment india govt running issues trying best divert topic better hope media comes number anyone speaks risks getting sidelined best ed cbi trolled killed worst courage speak even genuinely hope wrestlers get justice things better used overt outlet bjp cell classic example leopard ate face sachin tendulkar isnt internal matter woh doosri phogat hai join mafia protected long remain mafia mock current misery termed sooner later reluctance opposition join protest makes much sense came watch tweets current victims followed bjp line mocking victims caste people clapped protestors hit jailed fun already happening bjp supporters already trivializing sporting achievements making shitty remarks like sort made drama whatever means sportsperson male cricketer hardly celebrity india yes equally vulnerable face risk ed cbi getting lynched atmosphere fear everyone dont think understood said celebrities safe even case filed means resources stay mostly safe includes sportspersons gone professional like sunil chhetri vijender singh amateur sportspersons represent india amateur level olympics asian games etc dont means protect turned yesterdays police struggle means going bjp get entire family thrown bus people need know brij bhushan sharan singh guy connection dawood ibrahim atal bihari sends apology letter tooks tihar jail murdered people accepts tv etc bigger gujarati duo toothless tenis son roaming free guy untouchable understood disagree celebrities safe equally vulnerable government habit setting example one dissenting even top sports person speaking government face harassment risk life understood disagree celebrities safe equally vulnerable government habit setting example one dissenting even top sports person speaking government face harassment risk life great country people trying stand crook like brij bhushan mafia many cases even accepted live tv done murder entire bi ki pee cell come forward protect goon sad nation turning motichoor even didnt say word first one fotoops wrestlers medals mujhe baar gali di magalomanic busy crying issue dumb people upvoting stupid comment vinesh phogats sister babita phogat bjp worker always disagreements public two politics vinesh even called sister twitter going farm laws protests feel ashamed done country wasnt jailed tada links dcompany labour rate also include free cellphones thrown mistake mess man bjp silent today isnt wfi chief resigning cause hes mp bjp blame games played truth gangsters get become mps matter government wonder officials happy atiqs encounter silent today another encounter happen today hypocrisy fellow wrestlers keep shut save jobs hope get tickets parliamentary state elections might still lose like last time might scared raids fantasy sports app stake companies difference said lies fact celebrities means fight challenges thrown athletes still labourers farmers vote bjp blindly congress demise think everyone put status turning point like nirbhaya people may realise supporting god also people dont even know protesting reach everyone earned bring bjps downfall elections agreed babita phogat real sister cousin sorry dumb question caste matters much bhushan guy thakur caste yogi belongs yogi rule proven paradise thakurs placed everywhere committies associations panchayats see seat thakur brij bhushan one biggest faces thakur caste said influence ls seats small goon used chai party vajpayee mp terms made countless schools shit tons land name entire family placed various posts several wrestling federations saw babita phogat bhushan one made director haryana women wrestling association anytime wants seems post matters sister bjp protect costs wait watch party vote politics knows thakurs loyal dont want bhushan go jail already seen many rajput associations twitter accounts defending posting shit women protesters bjp already compared worth bhushan worth anyone see bhushan valuable gon na protect matter shame bring bjp knows memory country short one open ram mandir next year forgotten even protesting might end voting like jats last election despite protesting bjp year think already hit peak aryan khan corrected literally every national party one knows much money earn rallies take crosses elections theres way corporate company willing give much funds channels parties dont know unless follow media handles cause godi media avoiding protest like plague also ethically morally responsible citizen questioning opposition question asked govt yes also gangster act six times confessed murder live camera httpstwittercomrohinisghstatuslangenhttpstwittercomrohinisghstatuslangen u wont see media demanding encounter asking opposition havent made national issue isnt headlines everywhere know godi media wouldnt show anti godi media social media soo cheap easy get mass support opposition help situations unfortunately come fearing speak government thing concerned citizens afraid feel sad looking constant decline political climate country bjp always projected image strength wants cultivate image give demands made anybody legitimate otherwise making exception listening protesters time align bjps self image may also afraid give would many similar protests cropping ministers pretty much everyone bjp skeletons closets want invite kind pressure would make deal hand interesting note much pliable pressure previous congress government shashi tharoor resign tweet used phrase cattle class people protesting parliamentarians bjp prompt action government needed anything may bjp knows inaction attract congress left giving entire event anti bjp anti modi campaign churn votes ka elections feel wrestlers imagine players connections still struggling get justice serious allegation sexual misconduct common people even stand chance country wasiswill run rich mighty goons complain getting low ranking happiness index tell joe pesci wont wrestlers vote modi brijbhushan immense clout local politics hence reaction bjp bjp want lose votes brings period care minor details like whether criminal sexual assaulter etc reason dont see sp akhilesh yadav saying anything support wrestlers parties sp sees chance getting brijbhushan join bjp forced take action except lady called prophet pedodidnt resigni guess depends govt official offended want save im afraid ill erased existence wake shah rukh khans son needed days common person much lower rungs get line us normies suffer regularly country mother democracy anyone forgets coz international pressure still best gets job done well matter better leaders people like mms extreme exception abused politician like others deserve rot vishwa guru might wrong think hathras caseyou check google want know disturbing case thank modiji congress rule could never imagine bet cheered women shaheen bag harassed technically killed made man boycotting ipl reduce revenue money money people cares also get enraged may actually open mouths support actual athletes trust panchayats judgement hc schttpstwittercompriyankadeostatus much sympathy wrestlers already separate investigations read nothing found apportion guilt plus dharnas prone regularly get hijacked anti govt turns deaf ear shaheen bagh farmers protests name seems meets eye add shifting stance resign confidence national straight olympics exactly higher chances winning go bullies said vinaash kaale viprit buddhi care present future",
    "light_cleaned_title": "India Today: 'Itni izzat giraoge kya?' Vinesh Phogat breaks down, says cops pushed protesting wrestlers",
    "light_cleaned_selftext": ".....and the high and mighty, the so-called leaders of our country who otherwise shout themselves hoarse are not-so-surprisingly silent.",
    "light_cleaned_comments": "If these celebrities have so difficulty in getting justice. Its hard to imagine any common person will get justice ever. long awaited icebreaker Just looking at the visuals from yesterday is heartbreaking, imagine winning all these medals for ur Country nd then be put through this.😔 Pehle Farmers koh target Kiya, phir bollywood nd now these Athletes.. I hope other people who are on top of their field understand how their glory will be hogged by a person for their own gain but when time comes they will be ditched without a second thought by that same person. If you can't criticize that person at least don't choose his side. Nazi modus operandi being repeated. If you are not aware then pls stop forming stupid opinions This govt is too arrogant to apologise and make a guy resign....no one resigns... Given Mudiji quikly jumps on the selfie with sportspersons bandwagon, this Brij Bhushan must have something pretty damning against someone pretty powerful if he is not even resigning from his post Aah the Epstein defence BJP and BJP andhbhakts doesn’t care about our nation or it’s people. They just want BJP to stay in power. They are the real anti nationals. Desh drohis. Laughable. I still remember all the hate they spewed against the women of Shaheen Bagh. Common man doesn't get justice, he gets juiced by [the juicer](https://youtu.be/0NuivJMFPkg). Kabhi Kabhi Lagta Hai... ![gif](giphy|MRG6k5gsTfASjBzTQr) ...Apun Hi Bhagwan Hai That clown likes campaigning for elections more than governing. Wish he kept PM post and continued with circus but appointed able men like Gadkari to govern. Gadkari is one exception. Rest are chest thumping clowns who know just arrogant talk and posturing. My heart cries for this lost decade for India. With clear thumping majority, even sky wasn't a limit. But these clowns turned it into a pissing contest. Dangai aur mawalion se izzat ki baat? All the silent sportsperson earning millions should know that they could be next. Not before 2024. Nothing is more imp than that. Not even a completely \"for-show\" resignation people can be afraid. do not forget that. The problem with BJP is its arrogance and ego. How dare they make us apologise ? Phogat on people protesting against NRC are anti-national and Pakistani, and farmers protesting against farm bill are khalistani. Ab ka huwi chori tane tu koun hai ? Maybe that's why they are silent . They don't want the spotlight of CBI , ED and IT cells. Yahan pe toh ye actually hai That Gujju is 73. Heard they are returning all their medals now. Soon they will all be part of Award Wapisi gang. Karma Against everyone from JNU, Tabliqi, Shaheen Bagh, all CAA protestors. I firmly believe they will still vote for BJP if bjp removes Bhushan even a day before elections. The sheer amount of effort being out to defend a gangster, what's the difference between him and ateeq. Shouldn't our blood thirsty media demand his encounter as well. Instead they are working hard to restore his image. Gadkari is not an exception. Right from changing the way road calculations are done (4-lane 1km stretch=4km development to show record breaking numbers), building while ignoring environmental studies (think of all the landslides in hilly areas) to straight up corruption (Scania luxury bus story) he's done it all. He's just a hardcore RSS guy so he gets very sheltered. 56 Inch ka seena h bhai. Aise hi thodi apni galti Maan lega. /s Absolutely love the stand up by Varun Grover. Waiting for his next gig &#x200B; ![gif](giphy|1fuPzz0fWrCmEeqXi3) And the conversion of roads to concrete ones under the guise of green roads, just as that galactus swallows cement companies. Its a show of loyalty, you scratch my back I scratch yours. Saving (or not saving) sets a precdent and sends a message to the other party members, which, is this case is, \"Be loyal to us and no one can touch you\". Otoh, convicting him would send a different message, which a party full of criminals wouldn't find ideal. Everyone will realize now or later.. Even the Godhi Media will be thrown under the bus for the good of Modiji.. They are not interfering because they know comom people will never give up their entertainment. I suggested, protest against this by giving up IPL viewing..i got downvoted to oblivion. We all are very much.enraged, but only at our convenience, right... This is GOLD..!! These arent celebrities, they are regular people, hard working regular people, just as the rest of us. All the sports persons participating in various events throughout India, need to pull out, right NOW! Same goes for you guys watching IPL. STOP. RIGHT. NOW. If I am not wrong, that is Babita phogat not Vinesh phogat. Also Babita is phogat is not part of wrestlers protest. Are Babu Bhaiya Aap Idhar ku 5.6 mm gobhi ji ki pp energy going strong True😂 If all this was happening at any other time period, would have agreed to your point. But this is election time and the govt would be worried about it's image more than anything. Guy is running around Bangalore with circus show leaving God knows who to do the government work. So, obviously, Brij must have some hardcore dirt on something for them to risk their image in front of the whole nation. Especially, given that the ppl who are protesting now were (are still) their loyal supporters. Exactly. Babita has turned after yesterday's police struggle. Also the guy tweeted something about dogs being more grateful. एक कुत्ता भी एक दिन रोटी खाकर आपका वफादार बन जाता है पर कुछ इंसान देश का अनाज जन्म से खा रहे है फिर भी वफादार नहीं हो पाए ।। 4x1 is global rule. This is the only thing this govt picked from global standards as it suited its narrative. Only Cricketers are celebrities here - other sports person are just like normal people barring a few exceptions here and there Whenever the Regime Changes, the first thing they should do is to formulate strict Sedition and Treason Laws, and prosecute all the goons today and their supporters. This isn't actually a right take tbh. If I am watching English football then that doesn't mean I am supporting Ukraine in Russian war. This is vague take. You can always watch what you like but the first part where everyone should start is actually on your social media accounts. People who aren't good at the art that they do are probably the most entitled ones barking just because they have followers. How will boycotting ipl can directly help the case? And just like I said above even if you want to start a boycott start on social media because this is where it hurts. This is just a reminder as well that Coward Kohli still hasn't said anything about this, but was too quick to post some statuses about Naveen and Gambhir. This is exactly my thoughts as well You really think cricketers specially women, won't be facing similar issues? BJP bhagaao, desh bachaao. If you smile in his selfies then you are the gold medal winning athlete. If you protest then you will be punished by the police. This is the justice system of India. He is a locally-powerful politician, as well as a hindutva mascot and mafia don. He has boasted about his murders on TV, with no consequences. See e.g. [‘Don of all dons, murderer, wrestling reformer’ — WFI chief & MP Brij Bhushan’s colourful life](https://theprint.in/india/don-of-all-dons-murderer-wrestling-reformer-wfi-chief-mp-brij-bhushans-colourful-life/1323788/) The one's who voted for the clown wanted the circus What is opposition doing? Why is this not a national issue? usko bolna ki ye anaj tu baatne aya tha humko kya? The ruthlessness of the BJP shown by the fact that a few years ago her ~~father and sister~~ cousins were welcomed to the BJP with much fanfare. And now being crushed by the same party. Joins a long list of others. But our public continues to be under the impression that mudi knows best. Country is fucked. Edit: ~~I won't lie, I'm only human and felt a tinge of schadenfreude considering the phogats earnest demonization of Shaheen bagh protesters.~~ apparently the poghats who joined the BJP were her cousins. Apologies, and a good reminder to check ones facts before posting. This is not a political issue. Don’t make it political Imagine how the government is protecting an accused paedophile. He is no saint by any measure by the number of cases filled against him and his behaviour in public life. The number of criminals in our political system has progressively increased and police have become just a pawn to the party in power. Time has come and gone for police reforms, stricter criteria for accused criminals and independent institutions. It would backfire just like UAPA. We need laws to empower the common citizen not the system. While i see all this issues come up all of a sudden. Even I see many political parties involved too in making such issues. I mean many times so many things are just politically motivated and tool of other political parties too. I don't know how to trust anyone now a days. things went real bad real quick. small youtubers posting few videos - and these are very very disheartening. how this doesn't upsets anyone who has a daughter/sister ?? this one image sums-up the \"justice\" in India for anyone who dont have association with modi. The whole world stands with you. The unique thing about mafia is that no one is safe. If you go against anyone more powerful in the mafia, irrespective of your previous association with the group, you too will suffer same fate. You can take any name associated with the govt. The moment they go or have to go against any part of government stronger than them, they'll be treated similarly. > 71-year-old Gujarati guy screaming Jai bajrang Bali and roaming around Bangalore we from Karnataka provide employment for all short of people from all state, we dont alienate people based on their home state, and including elderly folks those were abandoned by their family. And i bet the per hour labour rate in bangalore is 5-6 times more then Gujarat. so let the poor fellow earn his daily wages in whatever task assigned by his master. Dangai aur mawalion se izzat ki baat? and dont forget the toll tax moolah helping inflation :) > That Gujju is 73. this wil be considered as gaali number 92. Ofcourse, women face sexism on a daily basis but how many of them are speaking at the moment? That's the issue. They all went haywire when Jay Shah announced WIPL but are mum now. Where are Harmanpreet, Shefali & Smriti? Of course it may threaten their career and fame, but that's what standing up is all about, and their words have power. Have no hopes from Kohli, Gambhir or anyone anyways. Make criteria for conviction very explicit, and these goons will satisfy even the most progressive and easy interpretation of law. Almost childish at how stubborn they are. They feel the need to protect every last crook instead. I feel like joining BJP is the best insurance against any crime you have committed if they protect their own this much Who all remember famous sportspersons and bollywood actors tweeting about “Black lives matter”? Where are they now? Fucking clout chaser. It is meant to send a message. Commoners can't challenge BJP. It is hubris that stops BJP from acting against Brij Bhushan. It sets a very dangerous precident, for them, that citizens can actually challenge authority if they are persistent. A complete anarchy and dictatorship in India. Although India is the largest democracy in the world, but still why does it seem that it is slowly moving away from the system. Only yesterday the name came in the world's 30 worst countries in the Press Freedom Index and on the same day the police beat up the athletes. Doesn't it work like this? You learn from Sweden that there is just one girl \"Greta Gunberg\" whose protest made the whole world talk about the matter of the environment. But in India, The Govt. itself is running from those issues and trying it's best to divert the topic and it is better not to have any hope from the media which comes on number 161. anyone who speaks against risks getting sidelined at best and Ed cbi, trolled, killed at worst. who will have the courage to speak even? I genuinely hope the wrestlers get justice. When things were better they used to be very overt outlet of the BJP IT Cell. This is a classic example of leopard ate my face Where is Sachin Tendulkar now? isn’t this not an “internal matter”? are woh doosri phogat hai. once you join mafia you are protected as long as you remain with the mafia. not to mock the current misery but he himself will be termed the same sooner or later. reluctance of opposition to join this protest makes so much more sense. And then they came for me…..??? just watch tweets by these current victims. they all followed bjp line in mocking the victims. caste These people clapped when other protestors were hit, and jailed. Not so fun when it’s you no? Already happening. Some BJP supporters are already trivializing their sporting achievements, and making other shitty remarks like this is some sort of \"made up drama\", whatever that means Any sportsperson other than a male cricketer is hardly a celebrity in India. yes, but they are equally vulnerable . they face risk of Ed, cbi, getting lynched. it's an atmosphere of fear for everyone. I don't think you understood what I said. Celebrities are safe from most of that. Even if a case is filed against them, they have the means and resources to stay mostly safe. That includes sportspersons who have gone professional, like Sunil Chhetri or Vijender Singh. Amateur sportspersons, who represent India at an amateur level in the Olympics, Asian Games etc. don't have the means to protect themselves. > turned after yesterday's police struggle. means ? going against BJP will get the entire family thrown under the bus. ----- people need to know who is Brij Bhushan Sharan Singh. This is the guy who has connection with dawood ibrahim, Atal Bihari sends him apology letter - tooks him out of tihar jail, he murdered people and accepts in TV, etc. He is bigger then the Gujarati duo. if that toothless Teni's son is roaming free, this guy is untouchable. I understood but I disagree that celebrities are safe. they are equally if not more vulnerable. the government has a habit of setting an example for any one dissenting. even top sports person speaking against government can face harassment and risk to life. I understood but I disagree that celebrities are safe. they are equally if not more vulnerable. the government has a habit of setting an example for any one dissenting. even top sports person speaking against government can face harassment and risk to life. Such a great country and people are trying to stand for a crook like brij bhushan. A mafia who has so many cases and who have even accepted on live tv that he has done a murder . Entire 'bi ki pee' it cell has come forward to protect this goon. What a sad nation we are turning into . Motichoor even didn't say a word . But was the first one to do the \"foto-ops\" when these wrestlers won medals. \"Mujhe 91 baar gali di \" magalomanic is busy crying on this issue Who are the dumb people upvoting this stupid comment? That was Vinesh Phogat's sister **Babita Phogat** who is a BJP worker. There has always been disagreements in public between the two about politics, and Vinesh had even called out her sister on Twitter when she was going off during the Farm Laws protests. I feel ashamed. What have they done to our country. Wasn't he jailed under TADA for links with D-company? Does the labour rate also include free cellphones thrown by mistake? What a mess man. Why is the BJP all so silent today? Why isn't the WFI chief resigning? Cause he's an MP in BJP. Blame games can be played but the truth is Gangsters get to become MPs no matter which government. No wonder the officials who were so happy on Atiq's encounter are all silent today. Should another encounter happen today? Hypocrisy While some of their fellow wrestlers will just keep shut to save their jobs. Or hope to get tickets for parliamentary or state elections which they might still lose like the last time. He might have been scared of raids on the fantasy sports app in which he has some stake. Or other companies. The difference, as I said, lies in the fact that celebrities have the means to fight off the challenges thrown at them. These athletes do not. Still all labourers and farmers will vote bjp blindly -_- Just how congress was before their demise I think everyone should put this in their status, this can be turning point like Nirbhaya and people may realise who they are supporting are no god. Also most of people don’t even know they are protesting, it should reach everyone. They earned this. This will bring BJPs downfall in the 24’ elections agreed. Babita Phogat is not her real sister. She is her cousin. What is that? Sorry if dumb question In UP, Caste matters too much. This Bhushan guy is a Thakur, same caste Yogi belongs to. Yogi rule has proven to be a paradise for Thakurs. They are being placed everywhere, from committies, associations, panchayats.. you see a seat, a thakur will be there. Brij Bhushan is one of the biggest faces of Thakur caste. It's said that he has an influence on 12 LS seats. He is not some small goon. He used to do Chai party with Vajpayee and has been an MP for 6 terms now. He has made countless schools and has shit tons of land on his name. His entire family is placed in various posts of several Wrestling federations. You saw Babita Phogat there? Bhushan was the one who made her director in Haryana women wrestling association. He can out her anytime he wants and for her it seems, that post matters more than her own sister. BJP will protect him at all costs. You just wait and watch. This party is all about vote politics only. It knows Thakurs are too loyal to it and they don't want Bhushan to go in jail. I have already seen many Rajput associations twitter accounts defending him and posting shit about these women protesters. Bjp has already compared their worth to Bhushan worth and as anyone can see, Bhushan is more valuable to them. They gonna protect him no matter what shame it can bring to them because bjp knows the memory of this country is a short one. Once it will open Ram Mandir next year, all will be forgotten and even those protesting might end up voting for it just like Jats of UP did in last UP election despite them protesting against BJP for an year. I think they already hit the peak with aryan khan. Corrected. Literally every national party, no one knows how much money they earn, rallies take crosses before elections and there's no way a corporate company is willing to give that much funds, there are other channels for other parties. You don't know what they are doing unless you follow their media handles cause Godi media is avoiding this protest like the plague. Also, as an ethically & morally responsible citizen, what are you doing? Questioning the opposition, when this question should be asked of the Govt? yes. also under gangster act in UP six times. He confessed to murder on live camera. [https://twitter.com/rohini\\_sgh/status/1616260381940518912?lang=en](https://twitter.com/rohini_sgh/status/1616260381940518912?lang=en) But u wont see media demanding his encounter I am asking opposition why haven't they made it a national issue. Why isn't it on headlines everywhere? I know godi media wouldn't show it but where is anti godi media? Social media is soo cheap and easy to get mass support. Opposition is there to help in such situations. Unfortunately it has come to this that we're now fearing to speak against the Government - the thing which most concerned citizens are afraid of. I feel so sad looking at the constant decline of political climate of the country. It's not that. The BJP has always projected an image of strength and wants to cultivate this image that they do not give in to demands made by anybody (legitimate or otherwise). Making an exception and listening to the protesters this time does not align with BJP's self image. They may also be afraid that if they give in once there would be many other similar protests cropping up against their other ministers. Pretty much everyone in the BJP has skeletons in their closets and they do not want to invite any kind of pressure that would make them have to deal with it. (On the other hand, it is interesting to note how much more pliable to pressure the previous Congress government was. Shashi Tharoor once had to resign because of a tweet in which he used the phrase \"cattle class.\" The only people protesting against it were other parliamentarians from the BJP.) Prompt action by the government was needed but they did not anything. May be BJP knows, their inaction will attract the Congress and Left, giving their entire event a anti BJP, anti Modi campaign. and they will churn the votes out of this before KA elections. I feel for the wrestlers, just imagine, these players have connections and still they are struggling to get justice on a serious allegation of sexual misconduct. Common people do not even stand a chance. This country was/is/will be run by the rich, mighty and goons. and then they complain we are getting low ranking in happiness index. Tell that to Joe Pesci No, it won't. These wrestlers will themselves vote for Modi in '24. BrijBhushan has immense clout in local UP politics - hence no reaction from BJP. BJP does not want to lose the votes he brings, period. It does not care about \\*minor\\* details like whether he is a criminal / sexual assaulter etc. It is for the same reason that you dont see SP (Akhilesh Yadav) saying anything in support of the wrestlers, while all other parties have. SP sees a chance of getting BrijBhushan to join them, if BJP is forced to take action against him. Except the lady who called the Prophet a pedo..didn't she resign?..I guess it depends on who the govt official has offended. I want to save it but I'm afraid I'll be erased out of existence before I wake up. Shah Rukh Khan’s son needed 30 days. A common person is much lower down the rungs. Get in line. Us normies suffer this regularly This country is the mother of democracy if anyone forgets. Coz of international pressure, He is still the best. He gets the job done well no matter what. There are no better leaders. People like MMS are extreme exception. But we abused him for not being a politician like others. We deserve to rot under a vishwa guru. I might be wrong but i think it's about hathras case,you can check it on Google if you want to know about it but it's a very disturbing case. Thank you modiji. Under congress rule, we could never imagine this. I bet they cheered when women at shaheen bag were harassed Technically he was killed before he was a made man Boycotting ipl will reduce the revenue money.. money is what people cares about. So they will also get \"enraged\" and may actually open their mouths in support of the actual athletes.. [they will trust panchayat's judgement not HC or SC](https://twitter.com/priyankadeo/status/1654361970219548672) so much sympathy for these wrestlers There have already been 3 separate investigations from what I have read and nothing has been found to apportion guilt. Plus, these ‘dharnas’ are prone to regularly get hijacked by anti-* that Govt turns a deaf ear… shaheen bagh, farmers protests to name some. There seems to be more than what meets the eye. Add to this their shifting stance from resign to no confidence to no national but straight to olympics. Exactly. They have higher chances of winning when they go against the bullies but it's said : Vinaash Kaale Viprit Buddhi. They care more about present than their future."
}