{
    "id": "1dun1gs",
    "title": "Flogged for ‘falling in love’, West Bengal woman says ‘let me live life on my terms now’",
    "url": "https://indianexpress.com/article/long-reads/flogged-for-falling-in-love-west-bengal-woman-says-let-me-live-life-on-my-terms-now-9429287/",
    "selftext": "The woman spoke to The Indian Express from a home where she is sequestered in Uttar Dinajpur. Outside, several policemen stand guard. The woman, who is married and has two children, said that five years ago, she fell in love with another man.",
    "flair": "Crime",
    "score": 84,
    "num_comments": 15,
    "created_utc": 1720035119,
    "convurl": "https://external-preview.redd.it/j7dtkvn1SuYgGnwwi0soNgJpEoRSN1fW_NgsM1XdHNU.jpg?auto=webp&s=ac3944aa1f66b7e0575d431e6f80d825c753cb5c",
    "comments": [
        "Prem ki bhebe chinte kora jaye (can you plan and fall in love)?”\n\nDays after a video came to light showing a Trinamool Congress functionary flogging a couple in public, the 38-year-old woman at the centre of the storm has told The Indian Express that she can put the ignominy of being beaten and humiliated in public behind her as long as she gets to “live life on her own terms.”\n\nThe woman spoke to The Indian Express from a home where she is sequestered in Uttar Dinajpur. Outside, several policemen stand guard. The woman, who is married and has two children, said that five years ago, she fell in love with another man.\n\nAt first, they would meet in secret, she said. When her husband eventually found out, he asked her to leave home, and on June 27, she said she moved in with the other man, who is 35 and also married.\n\nTo many in the village, she said, this was not acceptable. On June 28, a “salishi sabha” or kangaroo court was called, during which the main accused, TMC’s Tajimul Islam alias JCB, showed up. Clad in a black T-shirt and holding a weapon that seemed custom-made to mete out public justice, it was Islam who led the assault, she said. Surrounded by a crowd of dozens, the man and the woman were flogged relentlessly, even as they writhed in pain on the ground and begged for mercy. The incident took place a stone’s throw from the woman’s home.\n\nThe woman said she had feared such “punishment and assault” but she was not prepared for the video to go viral. “What happened here would have stayed here if the video didn’t spread,” she said.\n\nIt was in the wake of the video that police slapped an attempted murder charge and the case set off widespread outrage.\n\nIslam, arrested on Sunday, is now in police custody, also booked under charges of molestation and assault. “I don’t know him, I didn’t see him. Who hit me, I have no knowledge,” the woman said. She is trying to put up a brave face. “I am fine now. This (the 35-year-old’s house) is my home now, and I will not go back,” she said. “I was kicked, beaten up and abused for falling in love, but perhaps it was because I broke societal norms.”",
        "She said she has two children from her 18 years of marriage. “They are grown up. Let me live my life now,” she said. “I knew I would go through the insaaf (justice) and then live life on my terms.”\n\nAfter the incident, which has become a political flashpoint in the state, the administration has instructed police to increase patrolling in rural areas and keep a check on salishi sabhas, a senior official told The Indian Express.\n\nA woman in her 40s, who witnessed the flogging, said, “I wanted to stop the mob but you can’t just challenge the system. She was beaten up more than the man.”\n\nAnother villager said “internal matters such as family disputes are solved internally” and “we go to the police for bigger matters”.",
        "I refuse to believe that the administration didn't know about these \"kangaroo courts\" , it's appalling that they still turned a blind eye towards all thus until a video went viral. According to the victim, she already knew that something like this was going to happen and she was ready for it.",
        "I refuse to believe that the administration didn't know about these 'kangaroo courts'. It's appalling that they turned a blind eye to all this until a video went viral. According to the victim, she already knew something like this was going to happen, and she was prepared for it to occur and then move on.",
        "Clear cut case of adultery which is not a crime. People being judge jury and executioner",
        "Divorce and move ahead man, all this will help nobody.",
        "Varun Grover in stand up comedy mentioned \"mamata didi is same as modi\"... \n\n\nThats when i paid closer attention to her policies. Oh boy, she s worse than modi! Good thing she ll never be in the center on her own.",
        "In recent years, I have learnt that outside Kolkata WB is still ruled by parochial and patriarchal values. It shares the same issues of casteism that exist in the Hindi heartland.",
        "> Two children from 18 years of marriage\n\n>They are grown up\n\nAt most they are 16/17. Scarcely grown up",
        "Lamo, if congress+ alliance comes to power, our Bangladesh policy will be held hostage by her lol \n\n>Varun Grover in stand up comedy mentioned \"mamata didi is same as modi\"... \n\nObjectively wrong, political violence or violence by those associated with the ruling party in gujrat(BJP's strongest state) is nowhere that of west bengal",
        ">>Thing occurs in west bengal \n\n\n>>Bro still somehow manages to drag HiNdI HeARtLaND into it",
        "Our Bangladeshi policy is being held hostage in nda government also. Most of the projects there are going with china anyways and she has blocked the testa treaty. And how much violence bjp is capable of we have already seen in 2002.",
        "Are you saying that he's wrong.?",
        "There is political violence and the administrations too later turns a blind eye to it. Its same for both. ",
        "Plus we already saw what bjp is capable of in 2002.",
        "People need to understand that outside of Liberal stronghold of Kolkata, rest of Bengal is pretty backward, patriarchal and conservative as any other place in India. I live on the outskirts of Kolkata and the people living there are very conservative in nature.",
        "I mean whatever she wants to do is on her. But adultery is not a crime. Not even the law can do anything. So idk how these kangaroo courts are allowed to take matters in their hands.\n\nI mean I understand its bad for the other spouses and the children, but you can't go on flogging people like that"
    ],
    "cleaned_text": "flogged falling love west bengal woman says let live life terms woman spoke indian express home sequestered uttar dinajpur outside several policemen stand guard woman married two children said five years ago fell love another man ",
    "cleaned_title": "flogged falling love west bengal woman says let live life terms",
    "cleaned_selftext": "woman spoke indian express home sequestered uttar dinajpur outside several policemen stand guard woman married two children said five years ago fell love another man",
    "cleaned_comments": "prem ki bhebe chinte kora jaye plan fall love days video came light showing trinamool congress functionary flogging couple public yearold woman centre storm told indian express put ignominy beaten humiliated public behind long gets live life terms woman spoke indian express home sequestered uttar dinajpur outside several policemen stand guard woman married two children said five years ago fell love another man first would meet secret said husband eventually found asked leave home june said moved man also married many village said acceptable june salishi sabha kangaroo court called main accused tmcs tajimul islam alias jcb showed clad black tshirt holding weapon seemed custommade mete public justice islam led assault said surrounded crowd dozens man woman flogged relentlessly even writhed pain ground begged mercy incident took place stones throw womans home woman said feared punishment assault prepared video go viral happened would stayed video didnt spread said wake video police slapped attempted murder charge case set widespread outrage islam arrested sunday police custody also booked charges molestation assault dont know didnt see hit knowledge woman said trying put brave face fine yearolds house home go back said kicked beaten abused falling love perhaps broke societal norms said two children years marriage grown let live life said knew would go insaaf justice live life terms incident become political flashpoint state administration instructed police increase patrolling rural areas keep check salishi sabhas senior official told indian express woman witnessed flogging said wanted stop mob cant challenge system beaten man another villager said internal matters family disputes solved internally go police bigger matters refuse believe administration didnt know kangaroo courts appalling still turned blind eye towards thus video went viral according victim already knew something like going happen ready refuse believe administration didnt know kangaroo courts appalling turned blind eye video went viral according victim already knew something like going happen prepared occur move clear cut case adultery crime people judge jury executioner divorce move ahead man help nobody varun grover stand comedy mentioned mamata didi modi thats paid closer attention policies oh boy worse modi good thing never center recent years learnt outside kolkata wb still ruled parochial patriarchal values shares issues casteism exist hindi heartland two children years marriage grown scarcely grown lamo congress alliance comes power bangladesh policy held hostage lol varun grover stand comedy mentioned mamata didi modi objectively wrong political violence violence associated ruling party gujratbjps strongest state nowhere west bengal thing occurs west bengal bro still somehow manages drag hindi heartland bangladeshi policy held hostage nda government also projects going china anyways blocked testa treaty much violence bjp capable already seen saying hes wrong political violence administrations later turns blind eye plus already saw bjp capable people need understand outside liberal stronghold kolkata rest bengal pretty backward patriarchal conservative place india live outskirts kolkata people living conservative nature mean whatever wants adultery crime even law anything idk kangaroo courts allowed take matters hands mean understand bad spouses children cant go flogging people like",
    "light_cleaned_title": "Flogged for ‘falling in love’, West Bengal woman says ‘let me live life on my terms now’",
    "light_cleaned_selftext": "The woman spoke to The Indian Express from a home where she is sequestered in Uttar Dinajpur. Outside, several policemen stand guard. The woman, who is married and has two children, said that five years ago, she fell in love with another man.",
    "light_cleaned_comments": "Prem ki bhebe chinte kora jaye (can you plan and fall in love)?” Days after a video came to light showing a Trinamool Congress functionary flogging a couple in public, the 38-year-old woman at the centre of the storm has told The Indian Express that she can put the ignominy of being beaten and humiliated in public behind her as long as she gets to “live life on her own terms.” The woman spoke to The Indian Express from a home where she is sequestered in Uttar Dinajpur. Outside, several policemen stand guard. The woman, who is married and has two children, said that five years ago, she fell in love with another man. At first, they would meet in secret, she said. When her husband eventually found out, he asked her to leave home, and on June 27, she said she moved in with the other man, who is 35 and also married. To many in the village, she said, this was not acceptable. On June 28, a “salishi sabha” or kangaroo court was called, during which the main accused, TMC’s Tajimul Islam alias JCB, showed up. Clad in a black T-shirt and holding a weapon that seemed custom-made to mete out public justice, it was Islam who led the assault, she said. Surrounded by a crowd of dozens, the man and the woman were flogged relentlessly, even as they writhed in pain on the ground and begged for mercy. The incident took place a stone’s throw from the woman’s home. The woman said she had feared such “punishment and assault” but she was not prepared for the video to go viral. “What happened here would have stayed here if the video didn’t spread,” she said. It was in the wake of the video that police slapped an attempted murder charge and the case set off widespread outrage. Islam, arrested on Sunday, is now in police custody, also booked under charges of molestation and assault. “I don’t know him, I didn’t see him. Who hit me, I have no knowledge,” the woman said. She is trying to put up a brave face. “I am fine now. This (the 35-year-old’s house) is my home now, and I will not go back,” she said. “I was kicked, beaten up and abused for falling in love, but perhaps it was because I broke societal norms.” She said she has two children from her 18 years of marriage. “They are grown up. Let me live my life now,” she said. “I knew I would go through the insaaf (justice) and then live life on my terms.” After the incident, which has become a political flashpoint in the state, the administration has instructed police to increase patrolling in rural areas and keep a check on salishi sabhas, a senior official told The Indian Express. A woman in her 40s, who witnessed the flogging, said, “I wanted to stop the mob but you can’t just challenge the system. She was beaten up more than the man.” Another villager said “internal matters such as family disputes are solved internally” and “we go to the police for bigger matters”. I refuse to believe that the administration didn't know about these \"kangaroo courts\" , it's appalling that they still turned a blind eye towards all thus until a video went viral. According to the victim, she already knew that something like this was going to happen and she was ready for it. I refuse to believe that the administration didn't know about these 'kangaroo courts'. It's appalling that they turned a blind eye to all this until a video went viral. According to the victim, she already knew something like this was going to happen, and she was prepared for it to occur and then move on. Clear cut case of adultery which is not a crime. People being judge jury and executioner Divorce and move ahead man, all this will help nobody. Varun Grover in stand up comedy mentioned \"mamata didi is same as modi\"... Thats when i paid closer attention to her policies. Oh boy, she s worse than modi! Good thing she ll never be in the center on her own. In recent years, I have learnt that outside Kolkata WB is still ruled by parochial and patriarchal values. It shares the same issues of casteism that exist in the Hindi heartland. > Two children from 18 years of marriage >They are grown up At most they are 16/17. Scarcely grown up Lamo, if congress+ alliance comes to power, our Bangladesh policy will be held hostage by her lol >Varun Grover in stand up comedy mentioned \"mamata didi is same as modi\"... Objectively wrong, political violence or violence by those associated with the ruling party in gujrat(BJP's strongest state) is nowhere that of west bengal >>Thing occurs in west bengal >>Bro still somehow manages to drag HiNdI HeARtLaND into it Our Bangladeshi policy is being held hostage in nda government also. Most of the projects there are going with china anyways and she has blocked the testa treaty. And how much violence bjp is capable of we have already seen in 2002. Are you saying that he's wrong.? There is political violence and the administrations too later turns a blind eye to it. Its same for both. Plus we already saw what bjp is capable of in 2002. People need to understand that outside of Liberal stronghold of Kolkata, rest of Bengal is pretty backward, patriarchal and conservative as any other place in India. I live on the outskirts of Kolkata and the people living there are very conservative in nature. I mean whatever she wants to do is on her. But adultery is not a crime. Not even the law can do anything. So idk how these kangaroo courts are allowed to take matters in their hands. I mean I understand its bad for the other spouses and the children, but you can't go on flogging people like that"
}