{
    "id": "12z2h0j",
    "title": "Weekly Mental Health Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/12z2h0j/weekly_mental_health_discussion_thread/",
    "selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here.\n\nYou may find someone who has gone through a similar episode and might be able to help/guide you.\n\nPlease be civil and maintain Reddiquette while participating or replying/helping out someone.\n\nYou can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic.\n\n**If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**.\n\n* **Helplines**: AASRA: 91-22-27546669 (24 hours)\n* **Sneha Foundation**: 91-44-24640050 (24 hours)\n* **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours)\n* **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm)\n* **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm)\n\n**Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/1fqd80djw8n61.png?width=1487&format=png&auto=webp&v=enabled&s=184ead1efd5057f53cc3236ab564a2ce3ac8a7f6",
    "flair": "Scheduled",
    "score": 2,
    "num_comments": 9,
    "created_utc": 1682472610.0,
    "convurl": "https://external-preview.redd.it/FUATMZm8JLDTc_Im2P2hwXDebj9H8XTUE2E46u7I0hY.jpg",
    "comments": [
        "Really disappointed with my company. \n\nI joined as a graphic design intern for 10k pm; their offer for full-time was 25k pm. \n\nI was a professional photographer earlier so they also utilised my skills to do a corporate video shoot as well as edit it. \n\nI've made graphic design social media posts, shot these videos professionally and edited them as well, made some motion graphics storyboard changes, and some other inhouse works. \n\nAll this was in my intern time and this month they said they're making me full time. \n\nThe issue is, the offer from their side is 15k. Which is very  disrespectful.\n\nI moved out of my house and live alone and have pushed myself totally in these 3 months. I survived on 10k without any issue because I was looking forward to becoming full time. Their offer really surprised me. Who increases 5k and says it's full-time?\n\nAnd this underpay is very common in many of these art firms. \nThey try to undermine you, make you work more but pay less. \n\nTerms like, \"we're a team\", \"I'm providing you a system\". Is all bs. \n\n\nLuckily I've an offer from another company, which is paying me 30k minimum for only graphic design works. \n\nI'm really shifting to that place or will find other places rather than staying here for the underpay and being undermined subtly. \n\nWhat do you guys think? Let me know.",
        "Why would you stay at half the salary? Switch it mate. They are playing you.",
        "I am depressed AF",
        "Hila hila k so ja",
        "Switch it bro, best of luck.",
        "That's what I'm thinking bro, thank you 🙌",
        "Actually yeah, I'm gonna do that",
        "I feel like a looser, and I don't know how to get over it.\n\n&#x200B;\n\nA few years back in college, there was a girl I really liked (never felt for a girl like this before her or after), managed to ask her on a date, dated for a few months. Somehow I screwed it up, she said no and went out with another guy. Fast forward she just got married to that guy, **and joined my freaking company and the SAME FUCKING TEAM.** FUCK ME. JUST FUCK ME. I Hate it, I can't stand to see her laughing and smiling, I know its not her fault. Every time I think what could I possibly do different few years ago. My confidence is completely shattered. I can't even quit the job, because it's rare to get an equivalent job.\n\n&#x200B;\n\nI had to wish her the day she got married as the whole team wished her, one of the worst days in my life so far.\n\n&#x200B;\n\nBefore people say go to gym to boost confidence, I literally do, I am very athletic and also do gym, I ran a marathon recently as well. It doesn't work, it doesn't help. I don't even know what to do, don't have any siblings, parents are really old. I don't think I even have the confidence to ask out any other girl anymore.\n\n&#x200B;\n\nEveryone said time will fix it, but time just makes it worse, I don't even find any other girls attractive anymore.  It's been 4 months since she joined and I feel like puking every time I see her laughing.\n\n&#x200B;\n\nYaar me karo to kya karu...."
    ],
    "cleaned_text": "weekly mental health discussion thread anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall ",
    "cleaned_title": "weekly mental health discussion thread",
    "cleaned_selftext": "anything want get chest heartbreak abuse depression sorrow career education related behavioural changes share discuss may find someone gone similar episode might able helpguide please civil maintain reddiquette participating replyinghelping someone also join discordhttpsdiscordggvxf discuss separate channel wellness exclusively topic need support know someone please reach nearest mental health specialist helplines aasra hours sneha foundation hours vandrevala foundation mental health hours icall available monday saturday pm connecting ngo available pm pm mental health thread posted every wednesday morning old threadshttpswwwredditcomrindiasearchqmentaldiscussionrestrictsronsortnewtall",
    "cleaned_comments": "really disappointed company joined graphic design intern k pm offer fulltime k pm professional photographer earlier also utilised skills corporate video shoot well edit ive made graphic design social media posts shot videos professionally edited well made motion graphics storyboard changes inhouse works intern time month said theyre making full time issue offer side k disrespectful moved house live alone pushed totally months survived k without issue looking forward becoming full time offer really surprised increases k says fulltime underpay common many art firms try undermine make work pay less terms like team im providing system bs luckily ive offer another company paying k minimum graphic design works im really shifting place find places rather staying underpay undermined subtly guys think let know would stay half salary switch mate playing depressed af hila hila k ja switch bro best luck thats im thinking bro thank actually yeah im gon na feel like looser dont know get xb years back college girl really liked never felt girl like managed ask date dated months somehow screwed said went another guy fast forward got married guy joined freaking company fucking team fuck fuck hate cant stand see laughing smiling know fault every time think could possibly different years ago confidence completely shattered cant even quit job rare get equivalent job xb wish day got married whole team wished one worst days life far xb people say go gym boost confidence literally athletic also gym ran marathon recently well doesnt work doesnt help dont even know dont siblings parents really old dont think even confidence ask girl anymore xb everyone said time fix time makes worse dont even find girls attractive anymore months since joined feel like puking every time see laughing xb yaar karo kya karu",
    "light_cleaned_title": "Weekly Mental Health Discussion Thread",
    "light_cleaned_selftext": "Is there anything that you want to get off your chest? Heartbreak, abuse, depression, sorrow, career or education related, behavioural changes? Share it and discuss it here. You may find someone who has gone through a similar episode and might be able to help/guide you. Please be civil and maintain Reddiquette while participating or replying/helping out someone. You can also join our [Discord](https://discord.gg/6V29X7f) to discuss this, we have a separate channel (#wellness) exclusively for this topic. **If you need support or know someone who does, please Reach Out to Your Nearest Mental Health Specialist**. * **Helplines**: AASRA: 91-22-27546669 (24 hours) * **Sneha Foundation**: 91-44-24640050 (24 hours) * **Vandrevala Foundation for Mental Health**: 1860-2662-345 and 1800-2333-330 (24 hours) * **iCall**: 9152987821 (Available from Monday to Saturday: 8:00am to 10:00pm) * **Connecting NGO**: 18002094353 (Available from 12 pm - 8 pm) **Mental Health Thread is posted every Wednesday morning |** [**Old Threads**](https://www.reddit.com/r/india/search?q=Mental+Discussion&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Really disappointed with my company. I joined as a graphic design intern for 10k pm; their offer for full-time was 25k pm. I was a professional photographer earlier so they also utilised my skills to do a corporate video shoot as well as edit it. I've made graphic design social media posts, shot these videos professionally and edited them as well, made some motion graphics storyboard changes, and some other inhouse works. All this was in my intern time and this month they said they're making me full time. The issue is, the offer from their side is 15k. Which is very disrespectful. I moved out of my house and live alone and have pushed myself totally in these 3 months. I survived on 10k without any issue because I was looking forward to becoming full time. Their offer really surprised me. Who increases 5k and says it's full-time? And this underpay is very common in many of these art firms. They try to undermine you, make you work more but pay less. Terms like, \"we're a team\", \"I'm providing you a system\". Is all bs. Luckily I've an offer from another company, which is paying me 30k minimum for only graphic design works. I'm really shifting to that place or will find other places rather than staying here for the underpay and being undermined subtly. What do you guys think? Let me know. Why would you stay at half the salary? Switch it mate. They are playing you. I am depressed AF Hila hila k so ja Switch it bro, best of luck. That's what I'm thinking bro, thank you 🙌 Actually yeah, I'm gonna do that I feel like a looser, and I don't know how to get over it. &#x200B; A few years back in college, there was a girl I really liked (never felt for a girl like this before her or after), managed to ask her on a date, dated for a few months. Somehow I screwed it up, she said no and went out with another guy. Fast forward she just got married to that guy, **and joined my freaking company and the SAME FUCKING TEAM.** FUCK ME. JUST FUCK ME. I Hate it, I can't stand to see her laughing and smiling, I know its not her fault. Every time I think what could I possibly do different few years ago. My confidence is completely shattered. I can't even quit the job, because it's rare to get an equivalent job. &#x200B; I had to wish her the day she got married as the whole team wished her, one of the worst days in my life so far. &#x200B; Before people say go to gym to boost confidence, I literally do, I am very athletic and also do gym, I ran a marathon recently as well. It doesn't work, it doesn't help. I don't even know what to do, don't have any siblings, parents are really old. I don't think I even have the confidence to ask out any other girl anymore. &#x200B; Everyone said time will fix it, but time just makes it worse, I don't even find any other girls attractive anymore. It's been 4 months since she joined and I feel like puking every time I see her laughing. &#x200B; Yaar me karo to kya karu...."
}