{
    "id": "14g17vo",
    "title": "AAP warns to walk out of Opposition meeting if Congress does not support its fight against Centre’s ordinance",
    "url": "https://www.thehindu.com/news/cities/Delhi/aap-warns-to-walk-out-of-opposition-meeting-if-congress-does-not-support-its-fight-against-centres-ordinance/article66997079.ece",
    "selftext": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.thehindu.com%2Fnews%2Fcities%2FDelhi%2Faap-warns-to-walk-out-of-opposition-meeting-if-congress-does-not-support-its-fight-against-centres-ordinance%2Farticle66997079.ece",
    "flair": "Politics",
    "score": 47,
    "num_comments": 18,
    "created_utc": 1687434086.0,
    "convurl": "https://external-preview.redd.it/2EvvMwTWtJZV81wm2LC9xqWTil8FaDRb5yetZMI9Mxk.jpg?auto=webp&v=enabled&s=fa2470aff0aa977e6d8d9995525a103809029083",
    "comments": [
        "Maybe Congress should ask him to recant his support for the abrogation of Art. 370 first.",
        "Yes why not. This is the kind of tu tu main main that gifted BJP a second term in 2019.",
        "No hate par yaar ye rota kyu rehta hai hamesha?",
        "Okay. Walk out. The momentum is with them. Everybody knows you don't stand on your words. Get fucked then if you still want your thing to be the top one.",
        "INC should support AAP in the fight against the ordinance. To preach about democracy while defending that ordinance sounds terrible.",
        "Can someone please share a good article to understand the AAP vs ordinance thingy",
        "AAP behaving like \"AAP\"",
        "Isay rona nahin Politics kehtay hein. May be you try your hand for one day then realize. AAP is right in its stance. This fucking ordinance is parachuted from Centre to curb its power, as they always do. Fucking imbeciles, the BJP.",
        "Google karle.",
        "Just yesterday the LG rejected their choice for head of delhi electricity commission and installed one of his choice, so you can figure",
        "Congress was planning on the same, to walk out when the ordinance is tabled in the rajya sabha, obviously in protest",
        "I'm not saying about right or wrong. Im pissed like the hell threat is this. You have repeatedly threatened Congress, you have repeatedly rejected their outreach attempts. Now when we are having an Opposition coming together for 2024, shut the fuck up, attend the meet and then raise this issue. Why you showing that maybe there is a chance Opposition might not come together. Before the meet.",
        "Why does this fucker have Ambedkar's and bhagat Singh's photo when he doesn't even adhere to their ideologies? Larper",
        "No, BJP won handsomely in 2019 because of Pulwama and Balakot. Without that, the results would have been different.\n\nAlso, dismissing it as \"tu tu main main\" is dishonest. If the opposition parties are to come together, there must be ideological consistency and respect for India's democratic ethos. You can't have that if Kejriwal still continues to believe that whatever happened in Kashmir was correct."
    ],
    "cleaned_text": "aap warns walk opposition meeting congress support fight centres ordinance  ",
    "cleaned_title": "aap warns walk opposition meeting congress support fight centres ordinance",
    "cleaned_selftext": "",
    "cleaned_comments": "maybe congress ask recant support abrogation art first yes kind tu tu main main gifted bjp second term hate par yaar ye rota kyu rehta hai hamesha okay walk momentum everybody knows dont stand words get fucked still want thing top one inc support aap fight ordinance preach democracy defending ordinance sounds terrible someone please share good article understand aap vs ordinance thingy aap behaving like aap isay rona nahin politics kehtay hein may try hand one day realize aap right stance fucking ordinance parachuted centre curb power always fucking imbeciles bjp google karle yesterday lg rejected choice head delhi electricity commission installed one choice figure congress planning walk ordinance tabled rajya sabha obviously protest im saying right wrong im pissed like hell threat repeatedly threatened congress repeatedly rejected outreach attempts opposition coming together shut fuck attend meet raise issue showing maybe chance opposition might come together meet fucker ambedkars bhagat singhs photo doesnt even adhere ideologies larper bjp handsomely pulwama balakot without results would different also dismissing tu tu main main dishonest opposition parties come together must ideological consistency respect indias democratic ethos cant kejriwal still continues believe whatever happened kashmir correct",
    "light_cleaned_title": "AAP warns to walk out of Opposition meeting if Congress does not support its fight against Centre’s ordinance",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Maybe Congress should ask him to recant his support for the abrogation of Art. 370 first. Yes why not. This is the kind of tu tu main main that gifted BJP a second term in 2019. No hate par yaar ye rota kyu rehta hai hamesha? Okay. Walk out. The momentum is with them. Everybody knows you don't stand on your words. Get fucked then if you still want your thing to be the top one. INC should support AAP in the fight against the ordinance. To preach about democracy while defending that ordinance sounds terrible. Can someone please share a good article to understand the AAP vs ordinance thingy AAP behaving like \"AAP\" Isay rona nahin Politics kehtay hein. May be you try your hand for one day then realize. AAP is right in its stance. This fucking ordinance is parachuted from Centre to curb its power, as they always do. Fucking imbeciles, the BJP. Google karle. Just yesterday the LG rejected their choice for head of delhi electricity commission and installed one of his choice, so you can figure Congress was planning on the same, to walk out when the ordinance is tabled in the rajya sabha, obviously in protest I'm not saying about right or wrong. Im pissed like the hell threat is this. You have repeatedly threatened Congress, you have repeatedly rejected their outreach attempts. Now when we are having an Opposition coming together for 2024, shut the fuck up, attend the meet and then raise this issue. Why you showing that maybe there is a chance Opposition might not come together. Before the meet. Why does this fucker have Ambedkar's and bhagat Singh's photo when he doesn't even adhere to their ideologies? Larper No, BJP won handsomely in 2019 because of Pulwama and Balakot. Without that, the results would have been different. Also, dismissing it as \"tu tu main main\" is dishonest. If the opposition parties are to come together, there must be ideological consistency and respect for India's democratic ethos. You can't have that if Kejriwal still continues to believe that whatever happened in Kashmir was correct."
}