{
    "id": "177op0n",
    "title": "how small juice vendor reach 200/day to 200 cr/day",
    "url": "https://www.reddit.com/r/india/comments/177op0n/how_small_juice_vendor_reach_200day_to_200_crday/",
    "selftext": "  \n\nA Juice Stall guy from a small city in india Lavishly married (200 Crore) in Dubai booking 7-Star hotel, booked private jet Nagpur-Dubai, paid 110 cr to wedding planner, made A-List bollywood celeb perform( list attached as image) \n\nhttps://preview.redd.it/mu7q9fapy5ub1.png?width=1052&format=png&auto=webp&s=22d8f9bb3aa0489d48709c75e2a9eee3aedf2572\n\nSo whats happenning. Lets take a deep dive, shall we\n\nIt starts from Bhillai a small city in chattisgarh, Sourabh Chandrakar used to work as a small juice vendor in local market and has a friend named Ravi Uppal who had a small tire shop and every evening after work they used to do gambling at one point they got so addicted they begin to even bet with relatives money soon they lost near to 10-15 lakhs rupees each and fled to dubai with few savings amount. At dubai they worked as waiter in restaurant, driver, guard etc after few years with the money they saved they hire someone to make an app called Mahadev Book why Mahadev coz they stall name was Mahadev and also God they knew it will impact Indian the right way and oh boy it created such impact. In the beginning 2019 they started to promote this app via Instagram meme pages and influencer but very few traction but in 2020 when lockdown came people were desperate to earn more and they grew exponentially after lockdown LAKHS of people daily used this app where essential you can bet on cricket, poker or any game you think of, betting app. They did something very smart in the beginning if you win money is yours and even if you don’t they used to give return some money to user. This caught like wildfire and user started recommending to friends and family. After sometime the app started behaving as a gambling app always used to be now chances of wining was reduced and almost everyone begin loosing money. They had 41 call centers in India,Nepal,Bangladesh, call center why? Coz they used to very patiently and sweetly explain and entice people to bet more and more and were receiving a % commission for this and rest was transferred to Sourav and ravi via Havala.On top of that a lot of dubai big businessmen and Pakistan businessmen gave funding to them so it almost became an unstoppable machine. Fastrack to 2023 sourav did his marriage ceremony spending whooping 200 CRORES where even these A-list celebs were performing and this caught eye balls and traction like a spaceship and even from whom they might never wanted, Enter ED india and raided 39 locations and seized 417 Crore worth of assets and many A-list Bollywood stars are under investigation and soon a red notice may be isssed against Sourav and ravi and like dominos it all began to fall one by one and then none.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1697287355.0,
    "convurl": "https://b.thumbs.redditmedia.com/53NLevcGXYYFs_M1WUYjxEaYspxS75ORsnJIRnPMX4Q.jpg",
    "comments": [
        "Neighbour uncle's story's the same. He started off selling lotteries ig and now is into cricket betting. He is frequent traveller to dubai and man, his kids are splurging like crazy since 4-5 years lol."
    ],
    "cleaned_text": "small juice vendor reach day crday juice stall guy small city india lavishly married crore dubai booking star hotel booked private jet nagpurdubai paid cr wedding planner made alist bollywood celeb perform list attached image whats happenning lets take deep dive shall starts bhillai small city chattisgarh sourabh chandrakar used work small juice vendor local market friend named ravi uppal small tire shop every evening work used gambling one point got addicted begin even bet relatives money soon lost near lakhs rupees fled dubai savings amount dubai worked waiter restaurant driver guard etc years money saved hire someone make app called mahadev book mahadev coz stall name mahadev also god knew impact indian right way oh boy created impact beginning started promote app via instagram meme pages influencer traction lockdown came people desperate earn grew exponentially lockdown lakhs people daily used app essential bet cricket poker game think betting app something smart beginning win money even dont used give return money user caught like wildfire user started recommending friends family sometime app started behaving gambling app always used chances wining reduced almost everyone begin loosing money call centers indianepalbangladesh call center coz used patiently sweetly explain entice people bet receiving commission rest transferred sourav ravi via havalaon top lot dubai big businessmen pakistan businessmen gave funding almost became unstoppable machine fastrack sourav marriage ceremony spending whooping crores even alist celebs performing caught eye balls traction like spaceship even might never wanted enter ed india raided locations seized crore worth assets many alist bollywood stars investigation soon red notice may isssed sourav ravi like dominos began fall one one none ",
    "cleaned_title": "small juice vendor reach day crday",
    "cleaned_selftext": "juice stall guy small city india lavishly married crore dubai booking star hotel booked private jet nagpurdubai paid cr wedding planner made alist bollywood celeb perform list attached image whats happenning lets take deep dive shall starts bhillai small city chattisgarh sourabh chandrakar used work small juice vendor local market friend named ravi uppal small tire shop every evening work used gambling one point got addicted begin even bet relatives money soon lost near lakhs rupees fled dubai savings amount dubai worked waiter restaurant driver guard etc years money saved hire someone make app called mahadev book mahadev coz stall name mahadev also god knew impact indian right way oh boy created impact beginning started promote app via instagram meme pages influencer traction lockdown came people desperate earn grew exponentially lockdown lakhs people daily used app essential bet cricket poker game think betting app something smart beginning win money even dont used give return money user caught like wildfire user started recommending friends family sometime app started behaving gambling app always used chances wining reduced almost everyone begin loosing money call centers indianepalbangladesh call center coz used patiently sweetly explain entice people bet receiving commission rest transferred sourav ravi via havalaon top lot dubai big businessmen pakistan businessmen gave funding almost became unstoppable machine fastrack sourav marriage ceremony spending whooping crores even alist celebs performing caught eye balls traction like spaceship even might never wanted enter ed india raided locations seized crore worth assets many alist bollywood stars investigation soon red notice may isssed sourav ravi like dominos began fall one one none",
    "cleaned_comments": "neighbour uncles storys started selling lotteries ig cricket betting frequent traveller dubai man kids splurging like crazy since years lol",
    "light_cleaned_title": "how small juice vendor reach 200/day to 200 cr/day",
    "light_cleaned_selftext": "A Juice Stall guy from a small city in india Lavishly married (200 Crore) in Dubai booking 7-Star hotel, booked private jet Nagpur-Dubai, paid 110 cr to wedding planner, made A-List bollywood celeb perform( list attached as image) So whats happenning. Lets take a deep dive, shall we It starts from Bhillai a small city in chattisgarh, Sourabh Chandrakar used to work as a small juice vendor in local market and has a friend named Ravi Uppal who had a small tire shop and every evening after work they used to do gambling at one point they got so addicted they begin to even bet with relatives money soon they lost near to 10-15 lakhs rupees each and fled to dubai with few savings amount. At dubai they worked as waiter in restaurant, driver, guard etc after few years with the money they saved they hire someone to make an app called Mahadev Book why Mahadev coz they stall name was Mahadev and also God they knew it will impact Indian the right way and oh boy it created such impact. In the beginning 2019 they started to promote this app via Instagram meme pages and influencer but very few traction but in 2020 when lockdown came people were desperate to earn more and they grew exponentially after lockdown LAKHS of people daily used this app where essential you can bet on cricket, poker or any game you think of, betting app. They did something very smart in the beginning if you win money is yours and even if you don’t they used to give return some money to user. This caught like wildfire and user started recommending to friends and family. After sometime the app started behaving as a gambling app always used to be now chances of wining was reduced and almost everyone begin loosing money. They had 41 call centers in India,Nepal,Bangladesh, call center why? Coz they used to very patiently and sweetly explain and entice people to bet more and more and were receiving a % commission for this and rest was transferred to Sourav and ravi via Havala.On top of that a lot of dubai big businessmen and Pakistan businessmen gave funding to them so it almost became an unstoppable machine. Fastrack to 2023 sourav did his marriage ceremony spending whooping 200 CRORES where even these A-list celebs were performing and this caught eye balls and traction like a spaceship and even from whom they might never wanted, Enter ED india and raided 39 locations and seized 417 Crore worth of assets and many A-list Bollywood stars are under investigation and soon a red notice may be isssed against Sourav and ravi and like dominos it all began to fall one by one and then none.",
    "light_cleaned_comments": "Neighbour uncle's story's the same. He started off selling lotteries ig and now is into cricket betting. He is frequent traveller to dubai and man, his kids are splurging like crazy since 4-5 years lol."
}