{
    "id": "12hhsj6",
    "title": "Buyer Beware: My Experience with a Cloned iPhone 14 Pro Max from Amazon",
    "url": "https://www.reddit.com/r/india/comments/12hhsj6/buyer_beware_my_experience_with_a_cloned_iphone/",
    "selftext": "I have been an Amazon Prime customer since 2016 and have always trusted Amazon for my online purchases. However, my recent experience with buying an iPhone 14 Pro Max 128 GB Space Black color from the seller Appario Retail Private Ltd and Fulfilled by Amazon has left me disappointed and frustrated.\n\nOn April 8th, 2023, I ordered the iPhone 14 Pro Max, delivered on April 10th, 2023. The packaging looked good and was not opened. However, when I opened the iPhone box, I immediately noticed it was dirty, which raised suspicions. Despite my doubts, I decided to record the unboxing process, and the serial number on the iPhone box appeared to be valid. But, to my surprise, the phone was a deep purple color instead of the space black color I had ordered.\n\nWhen I booted up the phone for the first time, it skipped the face ID and Apple ID setup process, and there were pre-installed applications on the phone. I also noticed scratches on the camera lens, another sign that something was wrong. When I checked the storage capacity, it showed 1 TB, which is not even an option for the iPhone 14 Pro Max.\n\nImmediately after this discovery, I contacted Amazon customer care and shared images of the fake iPhone. They asked me to wait for five days for an investigation. As a loyal customer, I am disappointed that even a giant e-commerce company like Amazon still faces these problems.\n\nI have already filed a case with Amazon and the consumer court, and I have attached my unboxing video and images to support my claim. I am contacting the community for help and would appreciate any support in resolving this issue. This experience has shattered my trust in Amazon, and I hope that others can learn from my experience and be cautious when making online purchases.\n\n&#x200B;\n\n[The backside of received fake iPhone 14 Pro Max](https://preview.redd.it/j4fc2suay1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=a7421edb837801436e9929a9550826784d0e1b8f)\n\n&#x200B;\n\n[Accessories and Front Screen of iPhone 14 Pro Max](https://preview.redd.it/y69f5mify1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=05819f7607301ec4d2a511a40d6915cd688dd571)\n\n&#x200B;\n\n[The backside of the iPhone 14 Pro Max box](https://preview.redd.it/pbhwgnajy1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=45eccc98e7dfaf3fdf42fe3bbcfeb3609b758cc6)\n\n&#x200B;\n\n[The front side of the iPhone 14 Pro Max](https://preview.redd.it/1t1a87yly1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=8d1f9c5303df3da80815b1249c4ab4d572184f0b)",
    "flair": "Rant / Vent",
    "score": 4,
    "num_comments": 13,
    "created_utc": 1681130854.0,
    "convurl": "https://b.thumbs.redditmedia.com/oBjinOQUGbMTf6F1ZpoLJk5IMpf0JjI-LE8jCaoN4qU.jpg",
    "comments": [
        "[Similar incident happened back in feb](https://www.indiatoday.in/technology/news/story/man-orders-iphone-14-pro-max-worth-rs-132000-from-amazon-gets-fake-iphone-instead-2332549-2023-02-09)",
        "it is clone\n\ni can tell you just with the photos",
        "Wow, same seller too.. hope OP is able to get a refund",
        "I am waiting for their investigation",
        "Yes I am waiting for investigation. Can you suggest what should I do?",
        "Did u use a credit card?",
        "Yes. Why ?",
        "Filed a FIR and a chargeback. Which one did you use?",
        "I sent images to Amazon and Amazon doing investigation from their side. They mailed to wait for 3-5 days. If result are not in favour. I will send legal notice .",
        "I submitted service denial receipt to Amazon from apple authorised repair centre. Please guys help me out. Please share this post. Thank you for assistance.",
        "Did you hear back from them",
        "Yes after 10 days investigation they refused to return or replacement. I shared unboxing video also but they sent same mail.",
        "soooo any update in the end?"
    ],
    "cleaned_text": "buyer beware experience cloned iphone pro max amazon amazon prime customer since always trusted amazon online purchases however recent experience buying iphone pro max gb space black color seller appario retail private ltd fulfilled amazon left disappointed frustrated april th ordered iphone pro max delivered april th packaging looked good opened however opened iphone box immediately noticed dirty raised suspicions despite doubts decided record unboxing process serial number iphone box appeared valid surprise phone deep purple color instead space black color ordered booted phone first time skipped face id apple id setup process preinstalled applications phone also noticed scratches camera lens another sign something wrong checked storage capacity showed tb even option iphone pro max immediately discovery contacted amazon customer care shared images fake iphone asked wait five days investigation loyal customer disappointed even giant ecommerce company like amazon still faces problems already filed case amazon consumer court attached unboxing video images support claim contacting community help would appreciate support resolving issue experience shattered trust amazon hope others learn experience cautious making online purchases xb backside received fake iphone pro maxhttpspreviewredditjfcsuaytajpgwidthformatpjpgautowebpvenabledsaedbeadebf xb accessories front screen iphone pro maxhttpspreviewreddityfmifytajpgwidthformatpjpgautowebpvenabledsfecdaadcddd xb backside iphone pro max boxhttpspreviewredditpbhwgnajytajpgwidthformatpjpgautowebpvenabledsecccedfaffdffebbcfebbcc xb front side iphone pro maxhttpspreviewreddittaylytajpgwidthformatpjpgautowebpvenabledsdfcdfdabcabdfb ",
    "cleaned_title": "buyer beware experience cloned iphone pro max amazon",
    "cleaned_selftext": "amazon prime customer since always trusted amazon online purchases however recent experience buying iphone pro max gb space black color seller appario retail private ltd fulfilled amazon left disappointed frustrated april th ordered iphone pro max delivered april th packaging looked good opened however opened iphone box immediately noticed dirty raised suspicions despite doubts decided record unboxing process serial number iphone box appeared valid surprise phone deep purple color instead space black color ordered booted phone first time skipped face id apple id setup process preinstalled applications phone also noticed scratches camera lens another sign something wrong checked storage capacity showed tb even option iphone pro max immediately discovery contacted amazon customer care shared images fake iphone asked wait five days investigation loyal customer disappointed even giant ecommerce company like amazon still faces problems already filed case amazon consumer court attached unboxing video images support claim contacting community help would appreciate support resolving issue experience shattered trust amazon hope others learn experience cautious making online purchases xb backside received fake iphone pro maxhttpspreviewredditjfcsuaytajpgwidthformatpjpgautowebpvenabledsaedbeadebf xb accessories front screen iphone pro maxhttpspreviewreddityfmifytajpgwidthformatpjpgautowebpvenabledsfecdaadcddd xb backside iphone pro max boxhttpspreviewredditpbhwgnajytajpgwidthformatpjpgautowebpvenabledsecccedfaffdffebbcfebbcc xb front side iphone pro maxhttpspreviewreddittaylytajpgwidthformatpjpgautowebpvenabledsdfcdfdabcabdfb",
    "cleaned_comments": "similar incident happened back febhttpswwwindiatodayintechnologynewsstorymanordersiphonepromaxworthrsfromamazongetsfakeiphoneinstead clone tell photos wow seller hope op able get refund waiting investigation yes waiting investigation suggest u use credit card yes filed fir chargeback one use sent images amazon amazon investigation side mailed wait days result favour send legal notice submitted service denial receipt amazon apple authorised repair centre please guys help please share post thank assistance hear back yes days investigation refused return replacement shared unboxing video also sent mail soooo update end",
    "light_cleaned_title": "Buyer Beware: My Experience with a Cloned iPhone 14 Pro Max from Amazon",
    "light_cleaned_selftext": "I have been an Amazon Prime customer since 2016 and have always trusted Amazon for my online purchases. However, my recent experience with buying an iPhone 14 Pro Max 128 GB Space Black color from the seller Appario Retail Private Ltd and Fulfilled by Amazon has left me disappointed and frustrated. On April 8th, 2023, I ordered the iPhone 14 Pro Max, delivered on April 10th, 2023. The packaging looked good and was not opened. However, when I opened the iPhone box, I immediately noticed it was dirty, which raised suspicions. Despite my doubts, I decided to record the unboxing process, and the serial number on the iPhone box appeared to be valid. But, to my surprise, the phone was a deep purple color instead of the space black color I had ordered. When I booted up the phone for the first time, it skipped the face ID and Apple ID setup process, and there were pre-installed applications on the phone. I also noticed scratches on the camera lens, another sign that something was wrong. When I checked the storage capacity, it showed 1 TB, which is not even an option for the iPhone 14 Pro Max. Immediately after this discovery, I contacted Amazon customer care and shared images of the fake iPhone. They asked me to wait for five days for an investigation. As a loyal customer, I am disappointed that even a giant e-commerce company like Amazon still faces these problems. I have already filed a case with Amazon and the consumer court, and I have attached my unboxing video and images to support my claim. I am contacting the community for help and would appreciate any support in resolving this issue. This experience has shattered my trust in Amazon, and I hope that others can learn from my experience and be cautious when making online purchases. &#x200B; [The backside of received fake iPhone 14 Pro Max](https://preview.redd.it/j4fc2suay1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=a7421edb837801436e9929a9550826784d0e1b8f) &#x200B; [Accessories and Front Screen of iPhone 14 Pro Max](https://preview.redd.it/y69f5mify1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=05819f7607301ec4d2a511a40d6915cd688dd571) &#x200B; [The backside of the iPhone 14 Pro Max box](https://preview.redd.it/pbhwgnajy1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=45eccc98e7dfaf3fdf42fe3bbcfeb3609b758cc6) &#x200B; [The front side of the iPhone 14 Pro Max](https://preview.redd.it/1t1a87yly1ta1.jpg?width=3492&format=pjpg&auto=webp&v=enabled&s=8d1f9c5303df3da80815b1249c4ab4d572184f0b)",
    "light_cleaned_comments": "[Similar incident happened back in feb](https://www.indiatoday.in/technology/news/story/man-orders-iphone-14-pro-max-worth-rs-132000-from-amazon-gets-fake-iphone-instead-2332549-2023-02-09) it is clone i can tell you just with the photos Wow, same seller too.. hope OP is able to get a refund I am waiting for their investigation Yes I am waiting for investigation. Can you suggest what should I do? Did u use a credit card? Yes. Why ? Filed a FIR and a chargeback. Which one did you use? I sent images to Amazon and Amazon doing investigation from their side. They mailed to wait for 3-5 days. If result are not in favour. I will send legal notice . I submitted service denial receipt to Amazon from apple authorised repair centre. Please guys help me out. Please share this post. Thank you for assistance. Did you hear back from them Yes after 10 days investigation they refused to return or replacement. I shared unboxing video also but they sent same mail. soooo any update in the end?"
}