{
    "id": "1ev0ke4",
    "title": "Ensuring social justice in the bureaucracy",
    "url": "https://www.thehindu.com/opinion/op-ed/ensuring-social-justice-in-the-bureaucracy/article68533868.ece",
    "selftext": "During his parliamentary address on July 29, 2024, the Leader of the Opposition, Rahul Gandhi, regretted that there were no Scheduled Caste (SC) or Scheduled Tribe (ST) officers among the 20 who assisted in framing 2024 Budget proposals. He said that there was only one officer from the minorities and another from the Other Backward Classes (OBC) category involved in the exercise. His purpose in doing so was to highlight that those who originally belong to poor and deprived sections of society do not have a role in the framing of a crucial aspect of government’s economic policy. He couched his assertions in colourful political language. ",
    "flair": "Policy/Economy",
    "score": 4,
    "num_comments": 1,
    "created_utc": 1723954523.0,
    "convurl": "https://external-preview.redd.it/qKLvLpuMIu7xXL7W1Ujtq_lP2IfvmPOx5P0RiPkKCPI.jpg?auto=webp&s=399228edf1dad3869e9f63d9a0924650fc31fef8",
    "comments": [
        "The Union Finance Minister also responded to Mr. Gandhi’s charge by pointing to the absence of persons from these traditionally deprived backgrounds in the the Rajiv Gandhi Charitable Trust and the Rajiv Gandhi Foundation. A serious issue was converted into political tit for tat."
    ],
    "cleaned_text": "ensuring social justice bureaucracy parliamentary address july leader opposition rahul gandhi regretted scheduled caste sc scheduled tribe st officers among assisted framing budget proposals said one officer minorities another backward classes obc category involved exercise purpose highlight originally belong poor deprived sections society role framing crucial aspect governments economic policy couched assertions colourful political language ",
    "cleaned_title": "ensuring social justice bureaucracy",
    "cleaned_selftext": "parliamentary address july leader opposition rahul gandhi regretted scheduled caste sc scheduled tribe st officers among assisted framing budget proposals said one officer minorities another backward classes obc category involved exercise purpose highlight originally belong poor deprived sections society role framing crucial aspect governments economic policy couched assertions colourful political language",
    "cleaned_comments": "union finance minister also responded mr gandhis charge pointing absence persons traditionally deprived backgrounds rajiv gandhi charitable trust rajiv gandhi foundation serious issue converted political tit tat",
    "light_cleaned_title": "Ensuring social justice in the bureaucracy",
    "light_cleaned_selftext": "During his parliamentary address on July 29, 2024, the Leader of the Opposition, Rahul Gandhi, regretted that there were no Scheduled Caste (SC) or Scheduled Tribe (ST) officers among the 20 who assisted in framing 2024 Budget proposals. He said that there was only one officer from the minorities and another from the Other Backward Classes (OBC) category involved in the exercise. His purpose in doing so was to highlight that those who originally belong to poor and deprived sections of society do not have a role in the framing of a crucial aspect of government’s economic policy. He couched his assertions in colourful political language.",
    "light_cleaned_comments": "The Union Finance Minister also responded to Mr. Gandhi’s charge by pointing to the absence of persons from these traditionally deprived backgrounds in the the Rajiv Gandhi Charitable Trust and the Rajiv Gandhi Foundation. A serious issue was converted into political tit for tat."
}