{
    "id": "1d6frqg",
    "title": "Invested 2 Lakhs for solar connection in February but electricity metres are not available with REC.",
    "url": "https://www.reddit.com/gallery/1d6frqg",
    "selftext": "\nThis scheme looked so promising but there is no accountability if there is a delay.\n\nI have called local DISCOM they have told me call REC Hyderabad but REC people never responded positively.\n\nTo whomever want to apply for this scheme in TG please don't, it's so much pain the a**.",
    "flair": "Policy/Economy",
    "score": 41,
    "num_comments": 15,
    "created_utc": 1717341987.0,
    "convurl": "https://i.redd.it/d43pvsyef64d1.jpg",
    "comments": [
        "I'm still waiting for the NOC form them. Panels are eating dust for almost 2 months.",
        "What should we do? Sit outside REC gates?",
        "Less go BJP hatrick",
        "How to have this will you tell me ? I wanna have it too on my roof",
        "Step2 - Register on PMsuryaghar website, if you get OTP and if the OTP is valid, then you have reached 50% of the entire process.\n\nStep2, through the same website get redirected to local DISCOM for feasibility and pay 3000+ for a new meter.\n\nStep3 - after the feasibility report, you have to choose a vendor from the list of vendors from the PMsuryaghar website.\n\nStep4- call the vendor and make an agreement for the purchase of panels, structure, inverter and pay him the entire amount because subsidy is released into your account.\n\nStep5- after uploading the photos and agreement to the website, they come for inspection of the site, as well as installation of the meter which you have paid on step 2.\n\nStep6- you get your subsidy into your bank account in 30 days after installation of the meter.\n\n\nBeware that to complete the above steps you need to login into the website at least 20 times and believe me this website is like 100x worse than IRCTC.",
        "Step4 is very crucial because you not only have to choose a vendor but also components. At the moment Topcon bifocal is the best panel. Guess who is the monopoly in manufacturing panels? Adani. A lot of math is involved as well, according to the panel manufacturer my one panel generates 565W and I got 6 panels which means they all together produce about 3.3KW on a perfect sunny day. So my vendor demanded more money for that .3kw. i said FK off and told him to bring one 1 500W panel. \nI also asked him why he is not charging for Watts generated by the back side of the panel when it snows in Telangana as bifocal panels produce electricity from the back side too.\n\nYou have to choose the brand of Inverter (has to be made in India), 80% of the project, should be made in India companies.",
        "If the government stops working altogether, at least we won't have to worry about those pesky anti-incumbrance policies.",
        "Isn't this bad for energy producers like Ambani and Adani, and the revenues are redirected to Chinese industrialists (who manufacture the panels) instead of Indian ones?",
        "No subsidy for Chinese manufactured solar panels, they take panel serial number and company during step5",
        "OP you are a chaddi",
        "How much subsidy which we get ?",
        "Irrespective of the panel manufacturer the subsidy is static. Subsidy for 3kw is 78,000 and subsidy for 5kw is also 78,000. so, it's making more sense to choose 3kw.\n\nYou have to demand your vendor for Tata solar panels, he revises the quote according to your choice.\n\nIf Tata panels only genarate 320w per panel(according to there website) compared to 550(average) of Adani Topcon panel then its upto you."
    ],
    "cleaned_text": "invested lakhs solar connection february electricity metres available rec scheme looked promising accountability delay called local discom told call rec hyderabad rec people never responded positively whomever want apply scheme tg please dont much pain ",
    "cleaned_title": "invested lakhs solar connection february electricity metres available rec",
    "cleaned_selftext": "scheme looked promising accountability delay called local discom told call rec hyderabad rec people never responded positively whomever want apply scheme tg please dont much pain",
    "cleaned_comments": "im still waiting noc form panels eating dust almost months sit outside rec gates less go bjp hatrick tell wan na roof step register pmsuryaghar website get otp otp valid reached entire process step website get redirected local discom feasibility pay new meter step feasibility report choose vendor list vendors pmsuryaghar website step call vendor make agreement purchase panels structure inverter pay entire amount subsidy released account step uploading photos agreement website come inspection site well installation meter paid step step get subsidy bank account days installation meter beware complete steps need login website least times believe website like x worse irctc step crucial choose vendor also components moment topcon bifocal best panel guess monopoly manufacturing panels adani lot math involved well according panel manufacturer one panel generates w got panels means together produce kw perfect sunny day vendor demanded money kw said fk told bring one w panel also asked charging watts generated back side panel snows telangana bifocal panels produce electricity back side choose brand inverter made india project made india companies government stops working altogether least wont worry pesky antiincumbrance policies isnt bad energy producers like ambani adani revenues redirected chinese industrialists manufacture panels instead indian ones subsidy chinese manufactured solar panels take panel serial number company step op chaddi much subsidy get irrespective panel manufacturer subsidy static subsidy kw subsidy kw also making sense choose kw demand vendor tata solar panels revises quote according choice tata panels genarate w per panelaccording website compared average adani topcon panel upto",
    "light_cleaned_title": "Invested 2 Lakhs for solar connection in February but electricity metres are not available with REC.",
    "light_cleaned_selftext": "This scheme looked so promising but there is no accountability if there is a delay. I have called local DISCOM they have told me call REC Hyderabad but REC people never responded positively. To whomever want to apply for this scheme in TG please don't, it's so much pain the a**.",
    "light_cleaned_comments": "I'm still waiting for the NOC form them. Panels are eating dust for almost 2 months. What should we do? Sit outside REC gates? Less go BJP hatrick How to have this will you tell me ? I wanna have it too on my roof Step2 - Register on PMsuryaghar website, if you get OTP and if the OTP is valid, then you have reached 50% of the entire process. Step2, through the same website get redirected to local DISCOM for feasibility and pay 3000+ for a new meter. Step3 - after the feasibility report, you have to choose a vendor from the list of vendors from the PMsuryaghar website. Step4- call the vendor and make an agreement for the purchase of panels, structure, inverter and pay him the entire amount because subsidy is released into your account. Step5- after uploading the photos and agreement to the website, they come for inspection of the site, as well as installation of the meter which you have paid on step 2. Step6- you get your subsidy into your bank account in 30 days after installation of the meter. Beware that to complete the above steps you need to login into the website at least 20 times and believe me this website is like 100x worse than IRCTC. Step4 is very crucial because you not only have to choose a vendor but also components. At the moment Topcon bifocal is the best panel. Guess who is the monopoly in manufacturing panels? Adani. A lot of math is involved as well, according to the panel manufacturer my one panel generates 565W and I got 6 panels which means they all together produce about 3.3KW on a perfect sunny day. So my vendor demanded more money for that .3kw. i said FK off and told him to bring one 1 500W panel. I also asked him why he is not charging for Watts generated by the back side of the panel when it snows in Telangana as bifocal panels produce electricity from the back side too. You have to choose the brand of Inverter (has to be made in India), 80% of the project, should be made in India companies. If the government stops working altogether, at least we won't have to worry about those pesky anti-incumbrance policies. Isn't this bad for energy producers like Ambani and Adani, and the revenues are redirected to Chinese industrialists (who manufacture the panels) instead of Indian ones? No subsidy for Chinese manufactured solar panels, they take panel serial number and company during step5 OP you are a chaddi How much subsidy which we get ? Irrespective of the panel manufacturer the subsidy is static. Subsidy for 3kw is 78,000 and subsidy for 5kw is also 78,000. so, it's making more sense to choose 3kw. You have to demand your vendor for Tata solar panels, he revises the quote according to your choice. If Tata panels only genarate 320w per panel(according to there website) compared to 550(average) of Adani Topcon panel then its upto you."
}