{
    "id": "12x55fm",
    "title": "Is photography allowed in Golden temple premises in Amritsar?",
    "url": "https://www.reddit.com/r/india/comments/12x55fm/is_photography_allowed_in_golden_temple_premises/",
    "selftext": "I'm planning to visit Amritsar from Sri Lanka this October. I like to visit Amritsar and take pictures of Golden in temple premise for few days. I'm not shooting this professionally to make money but I want to document properly that mean i should able to shoot properly.\n\n* I will be using a mirrorless camera (Fuji one).\n* I have no intend to photograph inside the temple but outside for few days\n* I'm not taking selfies or videos.\n\nI can't get clear understanding whether this is possible or not. If that even slightly problematic I don't want to waste traveling there.  I don't want to get offended by temple guards.  I just don't want to do this if it's not allowed I will go some other part of India.\n\nThe photos i would be taking is like\n\n&#x200B;\n\nhttps://preview.redd.it/zjsaareiurva1.png?width=450&format=png&auto=webp&v=enabled&s=d887420c4ae1269d1fc5ab572580494e5d990256\n\nhttps://preview.redd.it/smh6ej8jurva1.png?width=3008&format=png&auto=webp&v=enabled&s=deedef53b0e613753fb6fc5cf3131274e5efe384\n\n&#x200B;\n\nhttps://preview.redd.it/o2xye15ourva1.png?width=440&format=png&auto=webp&v=enabled&s=80a2f23f13d0367df4e06166887ea954715d0a19\n\n&#x200B;",
    "flair": "AskIndia",
    "score": 10,
    "num_comments": 21,
    "created_utc": 1682315680.0,
    "convurl": "https://a.thumbs.redditmedia.com/_l3GC9Fz96mPt8f35O5ra34Ldvems2lXqYQmKt2aZ78.jpg",
    "comments": [
        "People do take picture like above with cell phones all the time.",
        "I intend to use dedicated mirrorless camera.  That's why i want to know. I have no other intention than than taking photographs. If that is difficult i wouldn't bother visiting. So better to know it in advance :D    \n\n\n&#x200B;\n\nhttps://preview.redd.it/bxfc3dieltva1.png?width=1000&format=png&auto=webp&v=enabled&s=c1792240ddcf7f86b68109a0eeb901577c8f3f74",
        "So, two things to remember :\n\n1) Yes, you are allowed to use the camera and click photos. In fact, when you come down the stairs in the beginning, the first thing you'll notice is people getting their photos clicked right next to the Amrit Sarovar.\nI saw the photos you've provided in the post, and people take such photos all the time. All good.\n\n2) However, you need to remember one thing. This is a religious site, a place of worship for millions. This is not a tourist hub. If you are gonna come here, then partake in Langar Seva (Free food) and try to listen and understand the prayers. \n\nThere are English translations provided on the last display as well. Try to understand the message that is being propagated. It's a fantastic religion. Full of love.\n\nI hope you have a great time here :)",
        "You will not be allowed to click pictures inside the main sanctum( the golden building that u have posted) but you will face no problem any where else.\n\nNo one will stop you to click pictures like the ones you have posted. Don’t worry. :)\n\nYou can DM, if you have any questions. :)",
        "I totally agree with you. I'll definitely do that. 🙏\n\nBut I I don't want to hide my primary intention and wanted to make sure I can take pictures. \n\nThank you for clarifying.  I was worried by seeing some reviews in Google map.\n\nThere are few temples where it clearly mentioned no photography is allowed. In golden temple it was bit vague. So thought it asking help here 😊",
        "Thank you so much! I would DM all my doubts when the days are near! \\_/\\\\\\_",
        "wow just come on man !! that's utterly bullshit !",
        "Sure! If I happen to miss your DMs, try replying me here. But don’t miss out visiting Golden temple. I miss visiting it so badly, Can’t even put it into words (may be soon, but as God wills) So I don’t want anyone to miss out what I’m missing😭\n\nSo many miss in this comment, you can see my level ‘missness’ from this 😭",
        "Hahaha i don't know from which year you have found this girl in shorts photo !!! I never saw any girl in short in gurudwara sahib by myself.. and about this second short skirt girl she just make fool like you guys by painting her face with Indian flag have you watched earlier video in which she haven't it on her face !! Stop watching too much news man !!",
        "Sure i'll keep this thread book marked. You will see it for sure as I will",
        "Just claim that you’re Punjabi and not an Indian, you’ll be fine.",
        "Can you elaborate?",
        "https://www.msn.com/en-in/entertainment/tv/it-isn-t-india-it-is-punjab-girl-with-indian-flag-painted-on-face-denied-entry-into-golden-temple/vi-AA19WMDt\n\nFor all downvoting me.",
        "Yeah and that girl came 1st and didn't even had tiranga painted on her face what a joke 😂",
        "She was just there to make controversy! Which she succeed."
    ],
    "cleaned_text": "photography allowed golden temple premises amritsar im planning visit amritsar sri lanka october like visit amritsar take pictures golden temple premise days im shooting professionally make money want document properly mean able shoot properly using mirrorless camera fuji one intend photograph inside temple outside days im taking selfies videos cant get clear understanding whether possible even slightly problematic dont want waste traveling dont want get offended temple guards dont want allowed go part india photos would taking like xb xb xb ",
    "cleaned_title": "photography allowed golden temple premises amritsar",
    "cleaned_selftext": "im planning visit amritsar sri lanka october like visit amritsar take pictures golden temple premise days im shooting professionally make money want document properly mean able shoot properly using mirrorless camera fuji one intend photograph inside temple outside days im taking selfies videos cant get clear understanding whether possible even slightly problematic dont want waste traveling dont want get offended temple guards dont want allowed go part india photos would taking like xb xb xb",
    "cleaned_comments": "people take picture like cell phones time intend use dedicated mirrorless camera thats want know intention taking photographs difficult wouldnt bother visiting better know advance xb two things remember yes allowed use camera click photos fact come stairs beginning first thing youll notice people getting photos clicked right next amrit sarovar saw photos youve provided post people take photos time good however need remember one thing religious site place worship millions tourist hub gon na come partake langar seva free food try listen understand prayers english translations provided last display well try understand message propagated fantastic religion full love hope great time allowed click pictures inside main sanctum golden building u posted face problem else one stop click pictures like ones posted dont worry dm questions totally agree ill definitely dont want hide primary intention wanted make sure take pictures thank clarifying worried seeing reviews google map temples clearly mentioned photography allowed golden temple bit vague thought asking help thank much would dm doubts days near wow come man thats utterly bullshit sure happen miss dms try replying dont miss visiting golden temple miss visiting badly cant even put words may soon god wills dont want anyone miss im missing many miss comment see level missness hahaha dont know year found girl shorts photo never saw girl short gurudwara sahib second short skirt girl make fool like guys painting face indian flag watched earlier video havent face stop watching much news man sure ill keep thread book marked see sure claim youre punjabi indian youll fine elaborate downvoting yeah girl came st didnt even tiranga painted face joke make controversy succeed",
    "light_cleaned_title": "Is photography allowed in Golden temple premises in Amritsar?",
    "light_cleaned_selftext": "I'm planning to visit Amritsar from Sri Lanka this October. I like to visit Amritsar and take pictures of Golden in temple premise for few days. I'm not shooting this professionally to make money but I want to document properly that mean i should able to shoot properly. * I will be using a mirrorless camera (Fuji one). * I have no intend to photograph inside the temple but outside for few days * I'm not taking selfies or videos. I can't get clear understanding whether this is possible or not. If that even slightly problematic I don't want to waste traveling there. I don't want to get offended by temple guards. I just don't want to do this if it's not allowed I will go some other part of India. The photos i would be taking is like &#x200B; &#x200B; &#x200B;",
    "light_cleaned_comments": "People do take picture like above with cell phones all the time. I intend to use dedicated mirrorless camera. That's why i want to know. I have no other intention than than taking photographs. If that is difficult i wouldn't bother visiting. So better to know it in advance :D &#x200B; So, two things to remember : 1) Yes, you are allowed to use the camera and click photos. In fact, when you come down the stairs in the beginning, the first thing you'll notice is people getting their photos clicked right next to the Amrit Sarovar. I saw the photos you've provided in the post, and people take such photos all the time. All good. 2) However, you need to remember one thing. This is a religious site, a place of worship for millions. This is not a tourist hub. If you are gonna come here, then partake in Langar Seva (Free food) and try to listen and understand the prayers. There are English translations provided on the last display as well. Try to understand the message that is being propagated. It's a fantastic religion. Full of love. I hope you have a great time here :) You will not be allowed to click pictures inside the main sanctum( the golden building that u have posted) but you will face no problem any where else. No one will stop you to click pictures like the ones you have posted. Don’t worry. :) You can DM, if you have any questions. :) I totally agree with you. I'll definitely do that. 🙏 But I I don't want to hide my primary intention and wanted to make sure I can take pictures. Thank you for clarifying. I was worried by seeing some reviews in Google map. There are few temples where it clearly mentioned no photography is allowed. In golden temple it was bit vague. So thought it asking help here 😊 Thank you so much! I would DM all my doubts when the days are near! \\_/\\\\\\_ wow just come on man !! that's utterly bullshit ! Sure! If I happen to miss your DMs, try replying me here. But don’t miss out visiting Golden temple. I miss visiting it so badly, Can’t even put it into words (may be soon, but as God wills) So I don’t want anyone to miss out what I’m missing😭 So many miss in this comment, you can see my level ‘missness’ from this 😭 Hahaha i don't know from which year you have found this girl in shorts photo !!! I never saw any girl in short in gurudwara sahib by myself.. and about this second short skirt girl she just make fool like you guys by painting her face with Indian flag have you watched earlier video in which she haven't it on her face !! Stop watching too much news man !! Sure i'll keep this thread book marked. You will see it for sure as I will Just claim that you’re Punjabi and not an Indian, you’ll be fine. Can you elaborate? For all downvoting me. Yeah and that girl came 1st and didn't even had tiranga painted on her face what a joke 😂 She was just there to make controversy! Which she succeed."
}