{
    "id": "13s2knt",
    "title": "How much custom duty I have to pay if ordered this product from Ebay.",
    "url": "https://www.reddit.com/r/india/comments/13s2knt/how_much_custom_duty_i_have_to_pay_if_ordered/",
    "selftext": "As the title says I want to buy this electronic [component](https://www.ebay.com/itm/142473925722#rpdCntId) of my old laptop from ebay but I have no idea how much custom duty I have pay. so please help me out I just want to know:\n\n1)What exact custom duty amount I have to pay on this product? is it offline or online? if online what is   \nthe procedure to pay? if offline than how?\n\n2)Is there any online website in India to track custom duty process of the product. \n\n3)This product will be shipped from china. Will there be any problem due to India-china relations.\n\nThank you in advance.",
    "flair": "AskIndia",
    "score": 3,
    "num_comments": 6,
    "created_utc": 1685073630.0,
    "convurl": "https://external-preview.redd.it/FbQOv3VVeCuGR6FfQzZUrPyZOtU-LUXqSqHwYpLixwE.jpg?auto=webp&v=enabled&s=dbbd92615885e2a69d284a3e3b8d10608d855dd0",
    "comments": [
        "I order cheap products from China all the time on amazon. No Customs, but may take a month or more.",
        "hi have you recieved your order, im in the same shoes as you were.",
        "Hey buddy, did you purchase from ebay?? I am in same shoe"
    ],
    "cleaned_text": "much custom duty pay ordered product ebay title says want buy electronic componenthttpswwwebaycomitmrpdcntid old laptop ebay idea much custom duty pay please help want know exact custom duty amount pay product offline online online procedure pay offline online website india track custom duty process product product shipped china problem due indiachina relations thank advance ",
    "cleaned_title": "much custom duty pay ordered product ebay",
    "cleaned_selftext": "title says want buy electronic componenthttpswwwebaycomitmrpdcntid old laptop ebay idea much custom duty pay please help want know exact custom duty amount pay product offline online online procedure pay offline online website india track custom duty process product product shipped china problem due indiachina relations thank advance",
    "cleaned_comments": "order cheap products china time amazon customs may take month hi recieved order im shoes hey buddy purchase ebay shoe",
    "light_cleaned_title": "How much custom duty I have to pay if ordered this product from Ebay.",
    "light_cleaned_selftext": "As the title says I want to buy this electronic [component](https://www.ebay.com/itm/142473925722#rpdCntId) of my old laptop from ebay but I have no idea how much custom duty I have pay. so please help me out I just want to know: 1)What exact custom duty amount I have to pay on this product? is it offline or online? if online what is the procedure to pay? if offline than how? 2)Is there any online website in India to track custom duty process of the product. 3)This product will be shipped from china. Will there be any problem due to India-china relations. Thank you in advance.",
    "light_cleaned_comments": "I order cheap products from China all the time on amazon. No Customs, but may take a month or more. hi have you recieved your order, im in the same shoes as you were. Hey buddy, did you purchase from ebay?? I am in same shoe"
}