{
    "id": "1h4sgdf",
    "title": "Received a tampered Optimum Nutrition Protein Powder from https://nutrabay.com/ ",
    "url": "https://www.reddit.com/r/india/comments/1h4sgdf/received_a_tampered_optimum_nutrition_protein/",
    "selftext": "Hi I have been ordering Optimum Nutrition Protein powder from [https://nutrabay.com/](https://nutrabay.com/) from past 2 years, and this time I received the product but I can see at the bottom, it looks like it is broken at bottom and resealed. When I contacted customer care, they are saying we have checked at our end and we see no tampering done at our end so we can't refund you. I am so disappointed with their customer service and this blame to be shift on customer rather than taking accountability. What should I do, I am afraid to consume this product as it might be fake.\n\nwhat should I do to get refund?\n\nhttps://preview.redd.it/v4f9jrvl2f4e1.jpg?width=2252&format=pjpg&auto=webp&s=733886c4c6370599d66c9473053d852f0d26ed5d\n\nhttps://preview.redd.it/p1cjmsvl2f4e1.jpg?width=2252&format=pjpg&auto=webp&s=594f98ebcad9fc32fdda7011cdabd8d1b077cc36\n\nhttps://preview.redd.it/w82xauvl2f4e1.jpg?width=2252&format=pjpg&auto=webp&s=cba0e6bfd4051c709d44716594bf59a7439459dc\n\nhttps://reddit.com/link/1h4sgdf/video/scss195n2f4e1/player\n\n[Nutraybay reply](https://preview.redd.it/4zn67xtp2f4e1.png?width=1980&format=png&auto=webp&s=a6cdcb7b833c6e7327c82861dd2aa11219888207)\n\n",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1733137228.0,
    "convurl": "https://b.thumbs.redditmedia.com/VVljtT4akswQ48VHaXmvW1RKsugf-xZljppgkvG38mc.jpg",
    "comments": [],
    "cleaned_text": "received tampered optimum nutrition protein powder hi ordering optimum nutrition protein powder httpsnutrabaycomhttpsnutrabaycom past years time received product see bottom looks like broken bottom resealed contacted customer care saying checked end see tampering done end cant refund disappointed customer service blame shift customer rather taking accountability afraid consume product might fake get refund nutraybay replyhttpspreviewredditznxtpfepngwidthformatpngautowebpsacdcbbcecddaa ",
    "cleaned_title": "received tampered optimum nutrition protein powder",
    "cleaned_selftext": "hi ordering optimum nutrition protein powder httpsnutrabaycomhttpsnutrabaycom past years time received product see bottom looks like broken bottom resealed contacted customer care saying checked end see tampering done end cant refund disappointed customer service blame shift customer rather taking accountability afraid consume product might fake get refund nutraybay replyhttpspreviewredditznxtpfepngwidthformatpngautowebpsacdcbbcecddaa",
    "cleaned_comments": "",
    "light_cleaned_title": "Received a tampered Optimum Nutrition Protein Powder from",
    "light_cleaned_selftext": "Hi I have been ordering Optimum Nutrition Protein powder from [https://nutrabay.com/](https://nutrabay.com/) from past 2 years, and this time I received the product but I can see at the bottom, it looks like it is broken at bottom and resealed. When I contacted customer care, they are saying we have checked at our end and we see no tampering done at our end so we can't refund you. I am so disappointed with their customer service and this blame to be shift on customer rather than taking accountability. What should I do, I am afraid to consume this product as it might be fake. what should I do to get refund? [Nutraybay reply](https://preview.redd.it/4zn67xtp2f4e1.png?width=1980&format=png&auto=webp&s=a6cdcb7b833c6e7327c82861dd2aa11219888207)",
    "light_cleaned_comments": ""
}