{
    "id": "f1pc0h",
    "title": "Online video streaming and TV are not the same. So why is the IAMAI trying to make it so?",
    "url": "https://www.reddit.com/r/india/comments/f1pc0h/online_video_streaming_and_tv_are_not_the_same_so/",
    "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/8eg115wm63g41.png?width=1024&amp;format=png&amp;auto=webp&amp;s=4d3f525378619929710e095120e911c67ca2ab5c\n\n## TL; DR:\n\nOn 5th February, 2020 the Internet and Mobile Association of India (IAMAI) announced the launch of its Code for Self Regulation of Online Curated Content Providers. Among other things it provides the basis for the creation of the Digital Content Complaint Council (along the lines of a similar system in place for TV) to oversee content creation and distribution in the online video streaming space. Although there are only four signatories (as opposed to nine in the case of a previous iteration), there are rumbling that the group is seeking government endorsement of this initiative. We have written to the IAMAI and copied the letter to both the Union Ministries of Information &amp; Broadcasting; and Electronics and Information Technology highlighting how this will lead to self-censorship to the detriment of internet users, creators, producers and competition within the market. Based on these grounds we have asked the industry body to roll back the code and asked government authorities to refrain from endorsing the framework.\n\n## Background\n\nThis post is to update everyone that there is a risk brewing in India’s online video streaming space. And said risk could see us sleep walk into a scenario where online content in India, mimics its formulaic television counterpart. On 5th February 2020, at its annual India Digital Summit, the Internet and Mobile Association of India (IAMAI) launched its *Code for Self-Regulation of Online Curated Content Providers*. It follows up an earlier *Code of Best Practices for Online Curated Content Providers* the industry body had  put out in January 2019.\n\nUnlike the previous code which had nine signatories, the latest iteration has just four signatories namely, Hotstar, Voot, Jio and SonyLiv. Prior signatories including Netflix, Zee5, AltBalaji, Arre and ErosNow were conspicuously absent at the new code’s launch. Other major players like Amazon (Prime) and Google (YouTube Premium) have stayed away from the process since its inception. Considering India has more than 35 online video streaming providers, the Code is not really representative of the entire industry’s position. So then why are we concerned if it is only being carried out by such a small number of players?\n\n## Our Take: This is a precursor to self-censorship and for online streaming to go down the path of TV\n\nSimply put it is the first step towards broad basing self-censorship as industry practice in India’s online video streaming space. If that is indeed the outcome, it would adversely impact internet users in India, creators, artists, production companies and so on. It is also likely to harm competition, innovation, investment and would facilitate industry capture by a few firms over the ecosystem.\n\nThe framework essentially builds on the original code of best practices through some key changes. First and most importantly, it seeks to establish an independent enforcement authority called the Digital Content Complaint Council (DCCC) to oversee a signatory’s content related practices. This DCCC mechanism is eerily similar and largely derivative of the [**Broadcast Content Complaints Council (BCCC)**](https://www.ibfindia.com/sites/default/files/Guidelines--Term%20of%20broadcas%20changes.pdf) (under the Indian Broadcasting Foundation) which essentially governs content on non-news and television channels in India.\n\nWe all know what that has meant to Indian television and how that has led to a largely homogenous content ecosystem, inundated by typical saas-bahu programming devoid of much creativity or pathos. Moreover, how often do we watch our favourite international content on TV and get bummed out that a large chunk of the programming has been edited out? In this context, the online video streaming space was a breadth of fresh air for Indian audiences who were fans of global and local storytelling. Further, it provided opportunities to local storytellers who had until then been rejected by traditional television, theatrical and radio media.\n\n## The legal basis and policy need for this effort is questionable at best\n\nIn this context, it is disconcerting that even though there is no legal mechanism which empowers the DCCC, its ties with the Government are undeniable. The proposed DCCC is meant to be chaired by a retired High Court or Supreme Court judge. Also, the DCCC is designed to include three members from national level statutory commissions like the National Commission for Women (NCW), the National Commission for Protection of Child Rights (NCPCR)  or the National Human Rights Commission (NHRC). Its composition would also facilitate incumbent business capture as the DCCC is meant to include three industry representatives and two online curated content providers (likely to be signatories to the Code). Considering the opaque manner (with no public/stakeholder inputs) in which the Code has been developed, and the public facing impact such a privately designed framework can have-- the legal validity of this effort remains dubious at best.\n\nSecond, such codified structures essentially provide the Government a parallel avenue with little to no legal accountability to apply pressure on businesses to censor people’s views and beliefs. It erodes channels for dissent and satire-- and is arguably incompatible with the fundamental right to freedom of speech and expression under the Constitution of India.\n\nThird, like the previous code on best practices, the new code for self-regulation talks about “prohibited content”. What is particularly dangerous is that the newest draft has been modified in a manner which makes the grounds for censorship vaguer. This would afford the DCCC with more discretion to remove certain speech/content which would otherwise be legal under the Constitution of India and also applicable laws like the Information Technology Act, 2000 and the Indian Penal Code, 1860.  This is compounded by the fact that the DCCC does not envision membership of stakeholders from research, academia or free speech backgrounds, to act as a safeguard for people’s right to receive and impart information. Therefore, it may be concluded that this Code is merely a liability reduction initiative which is being pushed through at the cost of plurality, diversity and creativity-- all cornerstone’s of the right to free speech and expression.\n\n## Our letter to IAMAI\n\nIn a [**letter dated 17th January, 2019**](https://drive.google.com/file/d/0B9LKE-1DkhtFY3ZWWXpRdnRuVEpwWmMzYW1kR21yejA3d2g0/view) we had previously written to the IAMAI voicing our objection to the initial Code for Best Practices. We argued it was a slippery slope which would act as a precursor towards self-censorship in the Indian online content space. Our beliefs are reinforced by the latest Code for Self-Regulation and we have [**sent a representation to the IAMAI**](https://drive.google.com/file/d/1b3eJQghsUwOJEYU1ri0ah2roO0BVSju0/view?usp=sharing) requesting them to roll back the effort. In addition, we have shared a copy with both the Ministry of Electronics and Information Technology (MeitY) and the Ministry of Information and Broadcasting (MIB), to brief them with the issues of endorsing the framework.\n\n## Important Documents\n\n1. The latest [**Code for Self-Regulation of Online Curated Content Providers**](https://www.medianama.com/wp-content/uploads/IAMAI-Digital-Content-Complaint-Council-NEW.pdf) released by IAMAI on 5th February, 2020.\n2. Our [**letter**](https://drive.google.com/file/d/1b3eJQghsUwOJEYU1ri0ah2roO0BVSju0/view?usp=sharing) sent to IAMAI, also copied to the Ministry of Information and Broadcasting (MIB) and the Ministry of Electronics and Information Technology (MeitY).\n3. The [**Code of Best Practices for Online Curated Content Providers**](https://www.viacom18.com/pdfs/Self-Regulation_of_Online_Curated_Content_Providers.pdf) released by IAMAI and signed by 9 players in January 2019.\n4. Our [**letter dated 17th January, 2019**](https://drive.google.com/file/d/0B9LKE-1DkhtFY3ZWWXpRdnRuVEpwWmMzYW1kR21yejA3d2g0/view) to the IAMAI outlining our concerns relating to the initial IAMAI Code of Best Practices.\n\n## Want India to produce its own South Park or BoJack Horseman? Want to have alternatives to your typical saas bahu soaps? Help us fight industry and government efforts to censor the internet by [becoming an IFF member today!](https://internetfreedom.in/donate/)\n\n&amp;#x200B;\n\nUPDATE : As part of our continuing advocacy on this issue yesterday we wrote an open letter to Justice AP Shah : [https://www.reddit.com/r/india/comments/f34zc2/an\\_open\\_letter\\_to\\_justice\\_ap\\_shah\\_on\\_the\\_online/](https://www.reddit.com/r/india/comments/f34zc2/an_open_letter_to_justice_ap_shah_on_the_online/)",
    "flair": "Policy/Economy",
    "score": 275,
    "num_comments": 40,
    "created_utc": 1581336163,
    "convurl": "https://b.thumbs.redditmedia.com/t4HiVEIsp7WuIYjoZa6lFL4AJRDVm2JtZENFx5551Is.jpg",
    "comments": [
        "🏴‍☠️🏴‍☠️🏴‍☠️",
        "Chaliye bachi kuchi azaadi ko vanakam",
        "Why?\n\nBecause they want to convert india into ISIS. Bhagwa ISIS.",
        "No hindu Pakistan",
        "This will kill Netflix in India. Prime might scrap by because of strong regional content options, but if Netflix dilutes their lineup to introduce sanitized version of their shows, piracy will skyrocket once again.",
        "So more censorship wrapped in some vague legalese. No matter what we can't have streaming services pushing that, shitty SaaS bahu, twisted sanskaari content on us. I was hoping this, was incompetence bit now it seems deliberate.. Obviously only goi favored production houses are going to be given stream advantage.\n\nU know what forget abt a fascist gov.. This is the thing that might wake up the people still believing goi is doing good. If nothing else ppl will fight for having good entertainment (I hope.. Maybe.. Crossed fingers)",
        "Please educate people around you. Idk about their political views, but I am pretty sure they would'nt wanna miss out on Indian Bojack Cowman. \n\nSorry.",
        "It's time online streaming is regulated.",
        "And, why would we want to live in a hell like that ?",
        "You touch Internet , Internet bhagwan will give you curse .",
        "Beta Sooryavansham aur Baghban ke alawa sab western filth hai \n\n/s",
        "Why do you wanna regulate something that is none of your business to do so?",
        "This will only mean I will have less subscriptions and will pirate more.",
        "A major point of online streaming is self-regulation. You have the freedom to create whatever you want (within the rules of the site) and you have the freedom to choose what you wish to see. I don't want a third party interfering in my choice to watch movies/TV shows online when I have paid for the subscription.",
        "He's from the Sanghi sub. No wonder.",
        "There is nothing Hindu about this.",
        "Netflix (hopefully) won't support this.",
        "Kyun mitr ? IFF pe thoda bharosa rakho.",
        "Go watch Sasural Simar ka then. Don't subscribe to Netflix or Prime.",
        "It will also kill a whole new format by itself. This is essentially bringing in TV style regulation to all online video streaming platforms. In effect even regional content options which often are not finding space on TV broadcast (which is becoming more censorial) are shifting to online formats. This is most visible in the, \"uncensored\" or, \"uncut\" versions of such movies.",
        "\"Keh do kee yeh jhooth hai\"",
        "It will also mean that more diverse forms of Indian language content will not get created. Specially around themes that are considered risky.",
        "Prime will unapologetically slide to the right and start making bhaktwank if there's the slightest risk to their bottomline.",
        "I just realized I would watch the hell out of Bojack Cowman if they do it right.",
        "There's option of VPN but it will still suck.",
        "VPN zindabad. Add a monthly charge for VPN to your budget.",
        "Hindu is what Hindu does.",
        "Please someone ELI5",
        "The solution is simple, stop voting for people who're promising you something which is just too good to be true.\n\nThese assholes just want to \"regulate\" or \"blanket ban\" things so they can impose a brand new set of taxes over the consumption of internet media just like what we currently have for television.\n\nThey did the same shit for everything which has evolved the regular medium of taxation like vaping or e-cigarettes and now it's television. Pretty sure you're going to get censored for playing video games under the \"toys\" category and you will have to pay their fucking retarded toy tax for video games in the future.\n\nThe BJP administration is broke as fuck, and they're willing to do anything and everything to milk every single paisa out of their constituents to even be relevant after fucking up so bad about the CAA and NRC bullshit.\n\nAbout 50-70% of the people I know are regretting the fact that they voted for BJP. It's a recursive cycle. In order to save their shit, they're destroying everything which even remotely stands a chance of getting them any kind of votes. They're literally shitting all over themselves  .",
        "So people won't fight when they see muslims getting lynched and women getting hit on their private parts but will react when someone brings censorship? They won't.",
        "China doesn't even have YouTube.",
        "Chutiyapa",
        "From what I understand, they're trying to make online streaming services like Netflix and Hotstar more like Cable TV. They want to create a board for the censorship of online content. So the creation and consumption of shows and movies will be restricted and censored.\n\nMore shows and movies will be blocked in paid services and the type of content created will have to be approved by the board which is run by the government.",
        "Ohhh shit\n\nFuck\n\nI thought those were just rumors but it does seem like they are all in",
        "I don't have any other mode of donation except cash... So sorry I can't donate but if there's any other way to support you guys... Count me in",
        "All in good time :) Whenever you can!",
        "And some other advocacy actions as well :) \n\n[https://www.reddit.com/r/india/comments/f34zc2/an\\_open\\_letter\\_to\\_justice\\_ap\\_shah\\_on\\_the\\_online/](https://www.reddit.com/r/india/comments/f34zc2/an_open_letter_to_justice_ap_shah_on_the_online/)"
    ],
    "cleaned_text": "online video streaming tv iamai trying make ampxb tl dr th february internet mobile association india iamai announced launch code self regulation online curated content providers among things provides basis creation digital content complaint council along lines similar system place tv oversee content creation distribution online video streaming space although four signatories opposed nine case previous iteration rumbling group seeking government endorsement initiative written iamai copied letter union ministries information amp broadcasting electronics information technology highlighting lead selfcensorship detriment internet users creators producers competition within market based grounds asked industry body roll back code asked government authorities refrain endorsing framework background post update everyone risk brewing indias online video streaming space said risk could see us sleep walk scenario online content india mimics formulaic television counterpart th february annual india digital summit internet mobile association india iamai launched code selfregulation online curated content providers follows earlier code best practices online curated content providers industry body put january unlike previous code nine signatories latest iteration four signatories namely hotstar voot jio sonyliv prior signatories including netflix zee altbalaji arre erosnow conspicuously absent new codes launch major players like amazon prime google youtube premium stayed away process since inception considering india online video streaming providers code really representative entire industrys position concerned carried small number players take precursor selfcensorship online streaming go path tv simply put first step towards broad basing selfcensorship industry practice indias online video streaming space indeed outcome would adversely impact internet users india creators artists production companies also likely harm competition innovation investment would facilitate industry capture firms ecosystem framework essentially builds original code best practices key changes first importantly seeks establish independent enforcement authority called digital content complaint council dccc oversee signatorys content related practices dccc mechanism eerily similar largely derivative broadcast content complaints council bccchttpswwwibfindiacomsitesdefaultfilesguidelinestermofbroadcaschangespdf indian broadcasting foundation essentially governs content nonnews television channels india know meant indian television led largely homogenous content ecosystem inundated typical saasbahu programming devoid much creativity pathos moreover often watch favourite international content tv get bummed large chunk programming edited context online video streaming space breadth fresh air indian audiences fans global local storytelling provided opportunities local storytellers rejected traditional television theatrical radio media legal basis policy need effort questionable best context disconcerting even though legal mechanism empowers dccc ties government undeniable proposed dccc meant chaired retired high court supreme court judge also dccc designed include three members national level statutory commissions like national commission women ncw national commission protection child rights ncpcr national human rights commission nhrc composition would also facilitate incumbent business capture dccc meant include three industry representatives two online curated content providers likely signatories code considering opaque manner publicstakeholder inputs code developed public facing impact privately designed framework legal validity effort remains dubious best second codified structures essentially provide government parallel avenue little legal accountability apply pressure businesses censor peoples views beliefs erodes channels dissent satire arguably incompatible fundamental right freedom speech expression constitution india third like previous code best practices new code selfregulation talks prohibited content particularly dangerous newest draft modified manner makes grounds censorship vaguer would afford dccc discretion remove certain speechcontent would otherwise legal constitution india also applicable laws like information technology act indian penal code compounded fact dccc envision membership stakeholders research academia free speech backgrounds act safeguard peoples right receive impart information therefore may concluded code merely liability reduction initiative pushed cost plurality diversity creativity cornerstones right free speech expression letter iamai letter dated th january httpsdrivegooglecomfiledblkedkhtfyzwwxprdnruvepwwmmzywkryejadgview previously written iamai voicing objection initial code best practices argued slippery slope would act precursor towards selfcensorship indian online content space beliefs reinforced latest code selfregulation sent representation iamaihttpsdrivegooglecomfiledbejqghsuwojeyuriahroobvsjuviewuspsharing requesting roll back effort addition shared copy ministry electronics information technology meity ministry information broadcasting mib brief issues endorsing framework important documents latest code selfregulation online curated content providershttpswwwmedianamacomwpcontentuploadsiamaidigitalcontentcomplaintcouncilnewpdf released iamai th february letterhttpsdrivegooglecomfiledbejqghsuwojeyuriahroobvsjuviewuspsharing sent iamai also copied ministry information broadcasting mib ministry electronics information technology meity code best practices online curated content providershttpswwwviacomcompdfsselfregulationofonlinecuratedcontentproviderspdf released iamai signed players january letter dated th january httpsdrivegooglecomfiledblkedkhtfyzwwxprdnruvepwwmmzywkryejadgview iamai outlining concerns relating initial iamai code best practices want india produce south park bojack horseman want alternatives typical saas bahu soaps help us fight industry government efforts censor internet becoming iff member todayhttpsinternetfreedomindonate ampxb update part continuing advocacy issue yesterday wrote open letter justice ap shah httpswwwredditcomrindiacommentsfzcanopenlettertojusticeapshahontheonlinehttpswwwredditcomrindiacommentsfzcanopenlettertojusticeapshahontheonline ",
    "cleaned_title": "online video streaming tv iamai trying make",
    "cleaned_selftext": "ampxb tl dr th february internet mobile association india iamai announced launch code self regulation online curated content providers among things provides basis creation digital content complaint council along lines similar system place tv oversee content creation distribution online video streaming space although four signatories opposed nine case previous iteration rumbling group seeking government endorsement initiative written iamai copied letter union ministries information amp broadcasting electronics information technology highlighting lead selfcensorship detriment internet users creators producers competition within market based grounds asked industry body roll back code asked government authorities refrain endorsing framework background post update everyone risk brewing indias online video streaming space said risk could see us sleep walk scenario online content india mimics formulaic television counterpart th february annual india digital summit internet mobile association india iamai launched code selfregulation online curated content providers follows earlier code best practices online curated content providers industry body put january unlike previous code nine signatories latest iteration four signatories namely hotstar voot jio sonyliv prior signatories including netflix zee altbalaji arre erosnow conspicuously absent new codes launch major players like amazon prime google youtube premium stayed away process since inception considering india online video streaming providers code really representative entire industrys position concerned carried small number players take precursor selfcensorship online streaming go path tv simply put first step towards broad basing selfcensorship industry practice indias online video streaming space indeed outcome would adversely impact internet users india creators artists production companies also likely harm competition innovation investment would facilitate industry capture firms ecosystem framework essentially builds original code best practices key changes first importantly seeks establish independent enforcement authority called digital content complaint council dccc oversee signatorys content related practices dccc mechanism eerily similar largely derivative broadcast content complaints council bccchttpswwwibfindiacomsitesdefaultfilesguidelinestermofbroadcaschangespdf indian broadcasting foundation essentially governs content nonnews television channels india know meant indian television led largely homogenous content ecosystem inundated typical saasbahu programming devoid much creativity pathos moreover often watch favourite international content tv get bummed large chunk programming edited context online video streaming space breadth fresh air indian audiences fans global local storytelling provided opportunities local storytellers rejected traditional television theatrical radio media legal basis policy need effort questionable best context disconcerting even though legal mechanism empowers dccc ties government undeniable proposed dccc meant chaired retired high court supreme court judge also dccc designed include three members national level statutory commissions like national commission women ncw national commission protection child rights ncpcr national human rights commission nhrc composition would also facilitate incumbent business capture dccc meant include three industry representatives two online curated content providers likely signatories code considering opaque manner publicstakeholder inputs code developed public facing impact privately designed framework legal validity effort remains dubious best second codified structures essentially provide government parallel avenue little legal accountability apply pressure businesses censor peoples views beliefs erodes channels dissent satire arguably incompatible fundamental right freedom speech expression constitution india third like previous code best practices new code selfregulation talks prohibited content particularly dangerous newest draft modified manner makes grounds censorship vaguer would afford dccc discretion remove certain speechcontent would otherwise legal constitution india also applicable laws like information technology act indian penal code compounded fact dccc envision membership stakeholders research academia free speech backgrounds act safeguard peoples right receive impart information therefore may concluded code merely liability reduction initiative pushed cost plurality diversity creativity cornerstones right free speech expression letter iamai letter dated th january httpsdrivegooglecomfiledblkedkhtfyzwwxprdnruvepwwmmzywkryejadgview previously written iamai voicing objection initial code best practices argued slippery slope would act precursor towards selfcensorship indian online content space beliefs reinforced latest code selfregulation sent representation iamaihttpsdrivegooglecomfiledbejqghsuwojeyuriahroobvsjuviewuspsharing requesting roll back effort addition shared copy ministry electronics information technology meity ministry information broadcasting mib brief issues endorsing framework important documents latest code selfregulation online curated content providershttpswwwmedianamacomwpcontentuploadsiamaidigitalcontentcomplaintcouncilnewpdf released iamai th february letterhttpsdrivegooglecomfiledbejqghsuwojeyuriahroobvsjuviewuspsharing sent iamai also copied ministry information broadcasting mib ministry electronics information technology meity code best practices online curated content providershttpswwwviacomcompdfsselfregulationofonlinecuratedcontentproviderspdf released iamai signed players january letter dated th january httpsdrivegooglecomfiledblkedkhtfyzwwxprdnruvepwwmmzywkryejadgview iamai outlining concerns relating initial iamai code best practices want india produce south park bojack horseman want alternatives typical saas bahu soaps help us fight industry government efforts censor internet becoming iff member todayhttpsinternetfreedomindonate ampxb update part continuing advocacy issue yesterday wrote open letter justice ap shah httpswwwredditcomrindiacommentsfzcanopenlettertojusticeapshahontheonlinehttpswwwredditcomrindiacommentsfzcanopenlettertojusticeapshahontheonline",
    "cleaned_comments": "chaliye bachi kuchi azaadi ko vanakam want convert india isis bhagwa isis hindu pakistan kill netflix india prime might scrap strong regional content options netflix dilutes lineup introduce sanitized version shows piracy skyrocket censorship wrapped vague legalese matter cant streaming services pushing shitty saas bahu twisted sanskaari content us hoping incompetence bit seems deliberate obviously goi favored production houses going given stream advantage u know forget abt fascist gov thing might wake people still believing goi good nothing else ppl fight good entertainment hope maybe crossed fingers please educate people around idk political views pretty sure wouldnt wan na miss indian bojack cowman sorry time online streaming regulated would want live hell like touch internet internet bhagwan give curse beta sooryavansham aur baghban ke alawa sab western filth hai wan na regulate something none business mean less subscriptions pirate major point online streaming selfregulation freedom create whatever want within rules site freedom choose wish see dont want third party interfering choice watch moviestv shows online paid subscription hes sanghi sub wonder nothing hindu netflix hopefully wont support kyun mitr iff pe thoda bharosa rakho go watch sasural simar ka dont subscribe netflix prime also kill whole new format essentially bringing tv style regulation online video streaming platforms effect even regional content options often finding space tv broadcast becoming censorial shifting online formats visible uncensored uncut versions movies keh kee yeh jhooth hai also mean diverse forms indian language content get created specially around themes considered risky prime unapologetically slide right start making bhaktwank theres slightest risk bottomline realized would watch hell bojack cowman right theres option vpn still suck vpn zindabad add monthly charge vpn budget hindu hindu please someone eli solution simple stop voting people whore promising something good true assholes want regulate blanket ban things impose brand new set taxes consumption internet media like currently television shit everything evolved regular medium taxation like vaping ecigarettes television pretty sure youre going get censored playing video games toys category pay fucking retarded toy tax video games future bjp administration broke fuck theyre willing anything everything milk every single paisa constituents even relevant fucking bad caa nrc bullshit people know regretting fact voted bjp recursive cycle order save shit theyre destroying everything even remotely stands chance getting kind votes theyre literally shitting people wont fight see muslims getting lynched women getting hit private parts react someone brings censorship wont china doesnt even youtube chutiyapa understand theyre trying make online streaming services like netflix hotstar like cable tv want create board censorship online content creation consumption shows movies restricted censored shows movies blocked paid services type content created approved board run government ohhh shit fuck thought rumors seem like dont mode donation except cash sorry cant donate theres way support guys count good time whenever advocacy actions well httpswwwredditcomrindiacommentsfzcanopenlettertojusticeapshahontheonlinehttpswwwredditcomrindiacommentsfzcanopenlettertojusticeapshahontheonline",
    "light_cleaned_title": "Online video streaming and TV are not the same. So why is the IAMAI trying to make it so?",
    "light_cleaned_selftext": "## TL; DR: On 5th February, 2020 the Internet and Mobile Association of India (IAMAI) announced the launch of its Code for Self Regulation of Online Curated Content Providers. Among other things it provides the basis for the creation of the Digital Content Complaint Council (along the lines of a similar system in place for TV) to oversee content creation and distribution in the online video streaming space. Although there are only four signatories (as opposed to nine in the case of a previous iteration), there are rumbling that the group is seeking government endorsement of this initiative. We have written to the IAMAI and copied the letter to both the Union Ministries of Information &amp; Broadcasting; and Electronics and Information Technology highlighting how this will lead to self-censorship to the detriment of internet users, creators, producers and competition within the market. Based on these grounds we have asked the industry body to roll back the code and asked government authorities to refrain from endorsing the framework. ## Background This post is to update everyone that there is a risk brewing in India’s online video streaming space. And said risk could see us sleep walk into a scenario where online content in India, mimics its formulaic television counterpart. On 5th February 2020, at its annual India Digital Summit, the Internet and Mobile Association of India (IAMAI) launched its *Code for Self-Regulation of Online Curated Content Providers*. It follows up an earlier *Code of Best Practices for Online Curated Content Providers* the industry body had put out in January 2019. Unlike the previous code which had nine signatories, the latest iteration has just four signatories namely, Hotstar, Voot, Jio and SonyLiv. Prior signatories including Netflix, Zee5, AltBalaji, Arre and ErosNow were conspicuously absent at the new code’s launch. Other major players like Amazon (Prime) and Google (YouTube Premium) have stayed away from the process since its inception. Considering India has more than 35 online video streaming providers, the Code is not really representative of the entire industry’s position. So then why are we concerned if it is only being carried out by such a small number of players? ## Our Take: This is a precursor to self-censorship and for online streaming to go down the path of TV Simply put it is the first step towards broad basing self-censorship as industry practice in India’s online video streaming space. If that is indeed the outcome, it would adversely impact internet users in India, creators, artists, production companies and so on. It is also likely to harm competition, innovation, investment and would facilitate industry capture by a few firms over the ecosystem. The framework essentially builds on the original code of best practices through some key changes. First and most importantly, it seeks to establish an independent enforcement authority called the Digital Content Complaint Council (DCCC) to oversee a signatory’s content related practices. This DCCC mechanism is eerily similar and largely derivative of the [**Broadcast Content Complaints Council (BCCC)**](https://www.ibfindia.com/sites/default/files/Guidelines--Term%20of%20broadcas%20changes.pdf) (under the Indian Broadcasting Foundation) which essentially governs content on non-news and television channels in India. We all know what that has meant to Indian television and how that has led to a largely homogenous content ecosystem, inundated by typical saas-bahu programming devoid of much creativity or pathos. Moreover, how often do we watch our favourite international content on TV and get bummed out that a large chunk of the programming has been edited out? In this context, the online video streaming space was a breadth of fresh air for Indian audiences who were fans of global and local storytelling. Further, it provided opportunities to local storytellers who had until then been rejected by traditional television, theatrical and radio media. ## The legal basis and policy need for this effort is questionable at best In this context, it is disconcerting that even though there is no legal mechanism which empowers the DCCC, its ties with the Government are undeniable. The proposed DCCC is meant to be chaired by a retired High Court or Supreme Court judge. Also, the DCCC is designed to include three members from national level statutory commissions like the National Commission for Women (NCW), the National Commission for Protection of Child Rights (NCPCR) or the National Human Rights Commission (NHRC). Its composition would also facilitate incumbent business capture as the DCCC is meant to include three industry representatives and two online curated content providers (likely to be signatories to the Code). Considering the opaque manner (with no public/stakeholder inputs) in which the Code has been developed, and the public facing impact such a privately designed framework can have-- the legal validity of this effort remains dubious at best. Second, such codified structures essentially provide the Government a parallel avenue with little to no legal accountability to apply pressure on businesses to censor people’s views and beliefs. It erodes channels for dissent and satire-- and is arguably incompatible with the fundamental right to freedom of speech and expression under the Constitution of India. Third, like the previous code on best practices, the new code for self-regulation talks about “prohibited content”. What is particularly dangerous is that the newest draft has been modified in a manner which makes the grounds for censorship vaguer. This would afford the DCCC with more discretion to remove certain speech/content which would otherwise be legal under the Constitution of India and also applicable laws like the Information Technology Act, 2000 and the Indian Penal Code, 1860. This is compounded by the fact that the DCCC does not envision membership of stakeholders from research, academia or free speech backgrounds, to act as a safeguard for people’s right to receive and impart information. Therefore, it may be concluded that this Code is merely a liability reduction initiative which is being pushed through at the cost of plurality, diversity and creativity-- all cornerstone’s of the right to free speech and expression. ## Our letter to IAMAI In a [**letter dated 17th January, 2019**](https://drive.google.com/file/d/0B9LKE-1DkhtFY3ZWWXpRdnRuVEpwWmMzYW1kR21yejA3d2g0/view) we had previously written to the IAMAI voicing our objection to the initial Code for Best Practices. We argued it was a slippery slope which would act as a precursor towards self-censorship in the Indian online content space. Our beliefs are reinforced by the latest Code for Self-Regulation and we have [**sent a representation to the IAMAI**](https://drive.google.com/file/d/1b3eJQghsUwOJEYU1ri0ah2roO0BVSju0/view?usp=sharing) requesting them to roll back the effort. In addition, we have shared a copy with both the Ministry of Electronics and Information Technology (MeitY) and the Ministry of Information and Broadcasting (MIB), to brief them with the issues of endorsing the framework. ## Important Documents 1. The latest [**Code for Self-Regulation of Online Curated Content Providers**](https://www.medianama.com/wp-content/uploads/IAMAI-Digital-Content-Complaint-Council-NEW.pdf) released by IAMAI on 5th February, 2020. 2. Our [**letter**](https://drive.google.com/file/d/1b3eJQghsUwOJEYU1ri0ah2roO0BVSju0/view?usp=sharing) sent to IAMAI, also copied to the Ministry of Information and Broadcasting (MIB) and the Ministry of Electronics and Information Technology (MeitY). 3. The [**Code of Best Practices for Online Curated Content Providers**](https://www.viacom18.com/pdfs/Self-Regulation_of_Online_Curated_Content_Providers.pdf) released by IAMAI and signed by 9 players in January 2019. 4. Our [**letter dated 17th January, 2019**](https://drive.google.com/file/d/0B9LKE-1DkhtFY3ZWWXpRdnRuVEpwWmMzYW1kR21yejA3d2g0/view) to the IAMAI outlining our concerns relating to the initial IAMAI Code of Best Practices. ## Want India to produce its own South Park or BoJack Horseman? Want to have alternatives to your typical saas bahu soaps? Help us fight industry and government efforts to censor the internet by [becoming an IFF member today!](https://internetfreedom.in/donate/)  UPDATE : As part of our continuing advocacy on this issue yesterday we wrote an open letter to Justice AP Shah : [https://www.reddit.com/r/india/comments/f34zc2/an\\_open\\_letter\\_to\\_justice\\_ap\\_shah\\_on\\_the\\_online/](https://www.reddit.com/r/india/comments/f34zc2/an_open_letter_to_justice_ap_shah_on_the_online/)",
    "light_cleaned_comments": "🏴‍☠️🏴‍☠️🏴‍☠️ Chaliye bachi kuchi azaadi ko vanakam Why? Because they want to convert india into ISIS. Bhagwa ISIS. No hindu Pakistan This will kill Netflix in India. Prime might scrap by because of strong regional content options, but if Netflix dilutes their lineup to introduce sanitized version of their shows, piracy will skyrocket once again. So more censorship wrapped in some vague legalese. No matter what we can't have streaming services pushing that, shitty SaaS bahu, twisted sanskaari content on us. I was hoping this, was incompetence bit now it seems deliberate.. Obviously only goi favored production houses are going to be given stream advantage. U know what forget abt a fascist gov.. This is the thing that might wake up the people still believing goi is doing good. If nothing else ppl will fight for having good entertainment (I hope.. Maybe.. Crossed fingers) Please educate people around you. Idk about their political views, but I am pretty sure they would'nt wanna miss out on Indian Bojack Cowman. Sorry. It's time online streaming is regulated. And, why would we want to live in a hell like that ? You touch Internet , Internet bhagwan will give you curse . Beta Sooryavansham aur Baghban ke alawa sab western filth hai /s Why do you wanna regulate something that is none of your business to do so? This will only mean I will have less subscriptions and will pirate more. A major point of online streaming is self-regulation. You have the freedom to create whatever you want (within the rules of the site) and you have the freedom to choose what you wish to see. I don't want a third party interfering in my choice to watch movies/TV shows online when I have paid for the subscription. He's from the Sanghi sub. No wonder. There is nothing Hindu about this. Netflix (hopefully) won't support this. Kyun mitr ? IFF pe thoda bharosa rakho. Go watch Sasural Simar ka then. Don't subscribe to Netflix or Prime. It will also kill a whole new format by itself. This is essentially bringing in TV style regulation to all online video streaming platforms. In effect even regional content options which often are not finding space on TV broadcast (which is becoming more censorial) are shifting to online formats. This is most visible in the, \"uncensored\" or, \"uncut\" versions of such movies. \"Keh do kee yeh jhooth hai\" It will also mean that more diverse forms of Indian language content will not get created. Specially around themes that are considered risky. Prime will unapologetically slide to the right and start making bhaktwank if there's the slightest risk to their bottomline. I just realized I would watch the hell out of Bojack Cowman if they do it right. There's option of VPN but it will still suck. VPN zindabad. Add a monthly charge for VPN to your budget. Hindu is what Hindu does. Please someone ELI5 The solution is simple, stop voting for people who're promising you something which is just too good to be true. These assholes just want to \"regulate\" or \"blanket ban\" things so they can impose a brand new set of taxes over the consumption of internet media just like what we currently have for television. They did the same shit for everything which has evolved the regular medium of taxation like vaping or e-cigarettes and now it's television. Pretty sure you're going to get censored for playing video games under the \"toys\" category and you will have to pay their fucking retarded toy tax for video games in the future. The BJP administration is broke as fuck, and they're willing to do anything and everything to milk every single paisa out of their constituents to even be relevant after fucking up so bad about the CAA and NRC bullshit. About 50-70% of the people I know are regretting the fact that they voted for BJP. It's a recursive cycle. In order to save their shit, they're destroying everything which even remotely stands a chance of getting them any kind of votes. They're literally shitting all over themselves . So people won't fight when they see muslims getting lynched and women getting hit on their private parts but will react when someone brings censorship? They won't. China doesn't even have YouTube. Chutiyapa From what I understand, they're trying to make online streaming services like Netflix and Hotstar more like Cable TV. They want to create a board for the censorship of online content. So the creation and consumption of shows and movies will be restricted and censored. More shows and movies will be blocked in paid services and the type of content created will have to be approved by the board which is run by the government. Ohhh shit Fuck I thought those were just rumors but it does seem like they are all in I don't have any other mode of donation except cash... So sorry I can't donate but if there's any other way to support you guys... Count me in All in good time :) Whenever you can! And some other advocacy actions as well :) [https://www.reddit.com/r/india/comments/f34zc2/an\\_open\\_letter\\_to\\_justice\\_ap\\_shah\\_on\\_the\\_online/](https://www.reddit.com/r/india/comments/f34zc2/an_open_letter_to_justice_ap_shah_on_the_online/)"
}