{
    "id": "129imj6",
    "title": "Kerala motor vehicle department fines a taxi/cab used by Maj Gen of Indian Army.",
    "url": "https://www.reddit.com/r/india/comments/129imj6/kerala_motor_vehicle_department_fines_a_taxicab/",
    "selftext": "Recently, KMVD official issued a challan, fined Rs 3000 to a vehicle used by a major general of #indianarmy for incorrect display of number plates. \nThere was a lot of hue and cry by both serving and retired officers, blaming thr communist government, crying about not respecting the indianarmy, sacrifices of soldiers... You can find the article below.\nhttps://indusscrolls.com/kerala-motor-vehicle-department-fines-army-generals-car-for-faulty-registration-marks\nThere has been a lot of noise on Twitter too. When I aired my opinion on one of the veteran colonel's tweet, he blocked me.\nMy point is - Nothing wrong in fine imposed. It's not army vehicle, but civil taxi. Registration number is not visible, is covered by star plate ⭐⭐ There's nothing wrong in displaying star plate, but the covering of vehicle registration number is an offense. \nEven army vehicle used by generals have star plate, which is fixed in such a manner that the vehicle number is clearly visible. In this case, it is not so. \nThe fine must be paid by the contractor/driver. Why are #Veterans making this ego issue? #IndianArmy should lead by example, follow law. \nWhat do you say?Should army make such a fuss about this issue, where the fine is legitimate, it hasn't been issued against the army, it need not be paid by the army.\nPlease share your opinion.",
    "flair": "Law & Courts",
    "score": 115,
    "num_comments": 26,
    "created_utc": 1680435392.0,
    "convurl": "https://external-preview.redd.it/MVRVZVVNtREgS2d4Srsx2p7seGvICq3iZHy87gKYn1c.jpg?auto=webp&v=enabled&s=8d3ccb61b964564a40479707255e9713b5773870",
    "comments": [
        "Army people and bureaucrats generally have a tendency to have sensitive egos. My theory is that for lower rank officers who recieve smaller salaries, they expect society to pay respect to them in lieu of the salary they deserve. Higher rank officials have inflated heads.",
        "So what's wrong with issuing fine for maj general?\n\nNothing \n\nRules are for everybody.",
        "This veneration of army is a very ugly thing that has been normalised in India. Worry not...I am from defense background, at least my father was. But I am not at all in favour of blind respect for army people. They do their job like anyone else and they get paid like anyone else. So, there is no reason to give them special treatment.",
        "That was indeed courageous of the motor vehicle department. If only they had this \"courage\" while dealing with their local politicians....",
        "Vardi waale gunde",
        "Why this is even an issue? Army vehicles themselves have number plates (Along with the stars if required) Hiding is wrong and they should be fined.",
        "Honestly, it’s such a stupid thing to fight over. I don’t really expect army folks to fight over this. Either there is more to the story or some people are just stupid. Nevertheless not an issue to target whole Indian army.",
        "Who is targetting the army?",
        "You are definitely not! I was just agreeing with you. Sorry if that wasn’t clear. Lol \n\nJust wanted to say don’t even know why is being discussed here. Generalizing veterans",
        "People should stop worshipping the army.",
        "I would never chose an army job for myself. My family itself is full of army folks, and maybe knowing them personally makes you realise how normal humans they are. But however they are, respect would be the minimum thing we as a society can give them, given how low their salaries and how harsh their jobs are.\n\nSaying that the job is like every other job and their pay like every other pay is highly inconsiderate of loss of personal aspect of life.",
        "Everyone deserves respect, not just army folks. A Bhangi deserves more respect than anyone. He puts his life in danger by entering septic tanks and sewers and gets paid almost nothing and gets no respect from us. In reality, we do not respect army for its sacrifices. We Indians have always bowed our heads in front of power. We Indians respect only power.",
        "Respect should be accorded to every member of the society irrespective of his/her profession. And coming from a family of Army folks, I would say that general public does not respect Army. They merely worship it as it suits them. Just like one worships a God without caring for his teachings. I am saying this because had the respect for Army been genuine then people would have at least criticised Agniveer scheme will not even accord status of ex-servicemen even after 4 years of service. Even in my state, where you will find many families with at least one relative serving in the Army, seem unbothered by this treachery.",
        "Given that they have raped an entire village I don't have any trust on them.",
        "What the, can you tell me about this?? No charges against them?",
        "https://en.m.wikipedia.org/wiki/Kunan_Poshpora_incident\n\nThere is a book written by the women as well."
    ],
    "cleaned_text": "kerala motor vehicle department fines taxicab used maj gen indian army recently kmvd official issued challan fined rs vehicle used major general indianarmy incorrect display number plates lot hue cry serving retired officers blaming thr communist government crying respecting indianarmy sacrifices soldiers find article lot noise twitter aired opinion one veteran colonels tweet blocked point nothing wrong fine imposed army vehicle civil taxi registration number visible covered star plate theres nothing wrong displaying star plate covering vehicle registration number offense even army vehicle used generals star plate fixed manner vehicle number clearly visible case fine must paid contractordriver veterans making ego issue indianarmy lead example follow law sayshould army make fuss issue fine legitimate hasnt issued army need paid army please share opinion ",
    "cleaned_title": "kerala motor vehicle department fines taxicab used maj gen indian army",
    "cleaned_selftext": "recently kmvd official issued challan fined rs vehicle used major general indianarmy incorrect display number plates lot hue cry serving retired officers blaming thr communist government crying respecting indianarmy sacrifices soldiers find article lot noise twitter aired opinion one veteran colonels tweet blocked point nothing wrong fine imposed army vehicle civil taxi registration number visible covered star plate theres nothing wrong displaying star plate covering vehicle registration number offense even army vehicle used generals star plate fixed manner vehicle number clearly visible case fine must paid contractordriver veterans making ego issue indianarmy lead example follow law sayshould army make fuss issue fine legitimate hasnt issued army need paid army please share opinion",
    "cleaned_comments": "army people bureaucrats generally tendency sensitive egos theory lower rank officers recieve smaller salaries expect society pay respect lieu salary deserve higher rank officials inflated heads whats wrong issuing fine maj general nothing rules everybody veneration army ugly thing normalised india worry noti defense background least father favour blind respect army people job like anyone else get paid like anyone else reason give special treatment indeed courageous motor vehicle department courage dealing local politicians vardi waale gunde even issue army vehicles number plates along stars required hiding wrong fined honestly stupid thing fight dont really expect army folks fight either story people stupid nevertheless issue target whole indian army targetting army definitely agreeing sorry wasnt clear lol wanted say dont even know discussed generalizing veterans people stop worshipping army would never chose army job family full army folks maybe knowing personally makes realise normal humans however respect would minimum thing society give given low salaries harsh jobs saying job like every job pay like every pay highly inconsiderate loss personal aspect life everyone deserves respect army folks bhangi deserves respect anyone puts life danger entering septic tanks sewers gets paid almost nothing gets respect us reality respect army sacrifices indians always bowed heads front power indians respect power respect accorded every member society irrespective hisher profession coming family army folks would say general public respect army merely worship suits like one worships god without caring teachings saying respect army genuine people would least criticised agniveer scheme even accord status exservicemen even years service even state find many families least one relative serving army seem unbothered treachery given raped entire village dont trust tell charges book written women well",
    "light_cleaned_title": "Kerala motor vehicle department fines a taxi/cab used by Maj Gen of Indian Army.",
    "light_cleaned_selftext": "Recently, KMVD official issued a challan, fined Rs 3000 to a vehicle used by a major general of #indianarmy for incorrect display of number plates. There was a lot of hue and cry by both serving and retired officers, blaming thr communist government, crying about not respecting the indianarmy, sacrifices of soldiers... You can find the article below. There has been a lot of noise on Twitter too. When I aired my opinion on one of the veteran colonel's tweet, he blocked me. My point is - Nothing wrong in fine imposed. It's not army vehicle, but civil taxi. Registration number is not visible, is covered by star plate ⭐⭐ There's nothing wrong in displaying star plate, but the covering of vehicle registration number is an offense. Even army vehicle used by generals have star plate, which is fixed in such a manner that the vehicle number is clearly visible. In this case, it is not so. The fine must be paid by the contractor/driver. Why are #Veterans making this ego issue? #IndianArmy should lead by example, follow law. What do you say?Should army make such a fuss about this issue, where the fine is legitimate, it hasn't been issued against the army, it need not be paid by the army. Please share your opinion.",
    "light_cleaned_comments": "Army people and bureaucrats generally have a tendency to have sensitive egos. My theory is that for lower rank officers who recieve smaller salaries, they expect society to pay respect to them in lieu of the salary they deserve. Higher rank officials have inflated heads. So what's wrong with issuing fine for maj general? Nothing Rules are for everybody. This veneration of army is a very ugly thing that has been normalised in India. Worry not...I am from defense background, at least my father was. But I am not at all in favour of blind respect for army people. They do their job like anyone else and they get paid like anyone else. So, there is no reason to give them special treatment. That was indeed courageous of the motor vehicle department. If only they had this \"courage\" while dealing with their local politicians.... Vardi waale gunde Why this is even an issue? Army vehicles themselves have number plates (Along with the stars if required) Hiding is wrong and they should be fined. Honestly, it’s such a stupid thing to fight over. I don’t really expect army folks to fight over this. Either there is more to the story or some people are just stupid. Nevertheless not an issue to target whole Indian army. Who is targetting the army? You are definitely not! I was just agreeing with you. Sorry if that wasn’t clear. Lol Just wanted to say don’t even know why is being discussed here. Generalizing veterans People should stop worshipping the army. I would never chose an army job for myself. My family itself is full of army folks, and maybe knowing them personally makes you realise how normal humans they are. But however they are, respect would be the minimum thing we as a society can give them, given how low their salaries and how harsh their jobs are. Saying that the job is like every other job and their pay like every other pay is highly inconsiderate of loss of personal aspect of life. Everyone deserves respect, not just army folks. A Bhangi deserves more respect than anyone. He puts his life in danger by entering septic tanks and sewers and gets paid almost nothing and gets no respect from us. In reality, we do not respect army for its sacrifices. We Indians have always bowed our heads in front of power. We Indians respect only power. Respect should be accorded to every member of the society irrespective of his/her profession. And coming from a family of Army folks, I would say that general public does not respect Army. They merely worship it as it suits them. Just like one worships a God without caring for his teachings. I am saying this because had the respect for Army been genuine then people would have at least criticised Agniveer scheme will not even accord status of ex-servicemen even after 4 years of service. Even in my state, where you will find many families with at least one relative serving in the Army, seem unbothered by this treachery. Given that they have raped an entire village I don't have any trust on them. What the, can you tell me about this?? No charges against them? There is a book written by the women as well."
}