{
    "id": "lp288s",
    "title": "Stagnation in UP's economy",
    "url": "https://www.reddit.com/r/india/comments/lp288s/stagnation_in_ups_economy/",
    "selftext": "UP's economy has been struggling for quite some time now, with growth slowing over the past 5 years ([https://www.hindustantimes.com/lucknow/gsdp-s-declining-growth-may-challenge-goal-of-making-uttar-pradesh-a-trillion-dollar-economy/story-30Fe6bfuFHecEnbNU8ts5K.html](https://www.hindustantimes.com/lucknow/gsdp-s-declining-growth-may-challenge-goal-of-making-uttar-pradesh-a-trillion-dollar-economy/story-30Fe6bfuFHecEnbNU8ts5K.html)). In current scenarios, even my comparatively tiny state (TS) will overtake them on 2025.\n\nThis year, its rank is estimated to slip from 3rd to 5th (KA and GJ overtake it). This is suggestive of a K shaped recovery, which would be disastrous for everyone (since your tax pays for this) ([https://www.nationalheraldindia.com/opinion/recovery-claimed-by-govt-based-on-second-quarter-gdp-estimates-is-dubious-and-fragile](https://www.nationalheraldindia.com/opinion/recovery-claimed-by-govt-based-on-second-quarter-gdp-estimates-is-dubious-and-fragile))\n\nThis is worrying because of its population and inequality. It's western districts are significantly richer than the poorer east, with Noida having a PCI over to 10x that of its poorest districts, and actually saw an increase over the past two years. To it's credit, it is investing in road infra, which, along with significant rail investment by the central government (such as the EDFC. ASEAN nations are also making use of the same formula for medium term growth ([https://thediplomat.com/2021/01/low-rates-are-pushing-us-capital-into-southeast-asia-what-happens-when-rates-go-up/](https://thediplomat.com/2021/01/low-rates-are-pushing-us-capital-into-southeast-asia-what-happens-when-rates-go-up/)).\n\n[UP's GDP according to IBEF](https://preview.redd.it/p3acm1512vi61.png?width=375&amp;format=png&amp;auto=webp&amp;s=8588d69914ab02d0e40133073cddb239a40aa850)\n\nSadly, commentary is usually politically tinted, such as [https://www.timesnownews.com/columns/article/yogis-economic-model-ensures-growth-with-more-jobs/701004](https://www.timesnownews.com/columns/article/yogis-economic-model-ensures-growth-with-more-jobs/701004). Investor opinion is pretty poor on account for infrastructure deficiencies and poor law and order ([https://www.livemint.com/Opinion/YEmTATLHyICNuNU0oVSuqL/Uttar-Pradesh-Indias-biggest-state-is-still-its-biggest-p.html](https://www.livemint.com/Opinion/YEmTATLHyICNuNU0oVSuqL/Uttar-Pradesh-Indias-biggest-state-is-still-its-biggest-p.html) [https://frontline.thehindu.com/cover-story/tall-claims/article32882389.ece](https://frontline.thehindu.com/cover-story/tall-claims/article32882389.ece)). This (obviously) translates to poor FDI ([https://dipp.gov.in/publications/fdi-statistics](https://dipp.gov.in/publications/fdi-statistics)).\n\n&amp;#x200B;\n\nIf anyone has some well written analysis or research papers which are 'neutral' let me know. I have looked into the aussie paper though.\n\n&amp;#x200B;\n\nSource : IBEF ([https://www.ibef.org/states/uttar-pradesh.aspx](https://www.ibef.org/states/uttar-pradesh.aspx))\n\nRBI [https://www.rbi.org.in/Scripts/AnnualPublications.aspx?head=Handbook+of+Statistics+on+Indian+States](https://www.rbi.org.in/Scripts/AnnualPublications.aspx?head=Handbook+of+Statistics+on+Indian+States)",
    "flair": "Policy/Economy",
    "score": 2,
    "num_comments": 0,
    "created_utc": 1613929319,
    "convurl": "https://b.thumbs.redditmedia.com/rFb6H_qQArUXJguvM7ML0F5KPuITf_WvnmTMShes5nM.jpg",
    "comments": [],
    "cleaned_text": "stagnation ups economy ups economy struggling quite time growth slowing past years httpswwwhindustantimescomlucknowgsdpsdeclininggrowthmaychallengegoalofmakinguttarpradeshatrilliondollareconomystoryfebfufhecenbnutskhtmlhttpswwwhindustantimescomlucknowgsdpsdeclininggrowthmaychallengegoalofmakinguttarpradeshatrilliondollareconomystoryfebfufhecenbnutskhtml current scenarios even comparatively tiny state ts overtake year rank estimated slip rd th ka gj overtake suggestive k shaped recovery would disastrous everyone since tax pays httpswwwnationalheraldindiacomopinionrecoveryclaimedbygovtbasedonsecondquartergdpestimatesisdubiousandfragilehttpswwwnationalheraldindiacomopinionrecoveryclaimedbygovtbasedonsecondquartergdpestimatesisdubiousandfragile worrying population inequality western districts significantly richer poorer east noida pci x poorest districts actually saw increase past two years credit investing road infra along significant rail investment central government edfc asean nations also making use formula medium term growth httpsthediplomatcomlowratesarepushinguscapitalintosoutheastasiawhathappenswhenratesgouphttpsthediplomatcomlowratesarepushinguscapitalintosoutheastasiawhathappenswhenratesgoup ups gdp according ibefhttpspreviewredditpacmvipngwidthampformatpngampautowebpampsdabdecddbaaa sadly commentary usually politically tinted httpswwwtimesnownewscomcolumnsarticleyogiseconomicmodelensuresgrowthwithmorejobshttpswwwtimesnownewscomcolumnsarticleyogiseconomicmodelensuresgrowthwithmorejobs investor opinion pretty poor account infrastructure deficiencies poor law order httpswwwlivemintcomopinionyemtatlhyicnunuovsuqluttarpradeshindiasbiggeststateisstillitsbiggestphtmlhttpswwwlivemintcomopinionyemtatlhyicnunuovsuqluttarpradeshindiasbiggeststateisstillitsbiggestphtml httpsfrontlinethehinducomcoverstorytallclaimsarticleecehttpsfrontlinethehinducomcoverstorytallclaimsarticleece obviously translates poor fdi httpsdippgovinpublicationsfdistatisticshttpsdippgovinpublicationsfdistatistics ampxb anyone well written analysis research papers neutral let know looked aussie paper though ampxb source ibef httpswwwibeforgstatesuttarpradeshaspxhttpswwwibeforgstatesuttarpradeshaspx rbi httpswwwrbiorginscriptsannualpublicationsaspxheadhandbookofstatisticsonindianstateshttpswwwrbiorginscriptsannualpublicationsaspxheadhandbookofstatisticsonindianstates ",
    "cleaned_title": "stagnation ups economy",
    "cleaned_selftext": "ups economy struggling quite time growth slowing past years httpswwwhindustantimescomlucknowgsdpsdeclininggrowthmaychallengegoalofmakinguttarpradeshatrilliondollareconomystoryfebfufhecenbnutskhtmlhttpswwwhindustantimescomlucknowgsdpsdeclininggrowthmaychallengegoalofmakinguttarpradeshatrilliondollareconomystoryfebfufhecenbnutskhtml current scenarios even comparatively tiny state ts overtake year rank estimated slip rd th ka gj overtake suggestive k shaped recovery would disastrous everyone since tax pays httpswwwnationalheraldindiacomopinionrecoveryclaimedbygovtbasedonsecondquartergdpestimatesisdubiousandfragilehttpswwwnationalheraldindiacomopinionrecoveryclaimedbygovtbasedonsecondquartergdpestimatesisdubiousandfragile worrying population inequality western districts significantly richer poorer east noida pci x poorest districts actually saw increase past two years credit investing road infra along significant rail investment central government edfc asean nations also making use formula medium term growth httpsthediplomatcomlowratesarepushinguscapitalintosoutheastasiawhathappenswhenratesgouphttpsthediplomatcomlowratesarepushinguscapitalintosoutheastasiawhathappenswhenratesgoup ups gdp according ibefhttpspreviewredditpacmvipngwidthampformatpngampautowebpampsdabdecddbaaa sadly commentary usually politically tinted httpswwwtimesnownewscomcolumnsarticleyogiseconomicmodelensuresgrowthwithmorejobshttpswwwtimesnownewscomcolumnsarticleyogiseconomicmodelensuresgrowthwithmorejobs investor opinion pretty poor account infrastructure deficiencies poor law order httpswwwlivemintcomopinionyemtatlhyicnunuovsuqluttarpradeshindiasbiggeststateisstillitsbiggestphtmlhttpswwwlivemintcomopinionyemtatlhyicnunuovsuqluttarpradeshindiasbiggeststateisstillitsbiggestphtml httpsfrontlinethehinducomcoverstorytallclaimsarticleecehttpsfrontlinethehinducomcoverstorytallclaimsarticleece obviously translates poor fdi httpsdippgovinpublicationsfdistatisticshttpsdippgovinpublicationsfdistatistics ampxb anyone well written analysis research papers neutral let know looked aussie paper though ampxb source ibef httpswwwibeforgstatesuttarpradeshaspxhttpswwwibeforgstatesuttarpradeshaspx rbi httpswwwrbiorginscriptsannualpublicationsaspxheadhandbookofstatisticsonindianstateshttpswwwrbiorginscriptsannualpublicationsaspxheadhandbookofstatisticsonindianstates",
    "cleaned_comments": "",
    "light_cleaned_title": "Stagnation in UP's economy",
    "light_cleaned_selftext": "UP's economy has been struggling for quite some time now, with growth slowing over the past 5 years ([https://www.hindustantimes.com/lucknow/gsdp-s-declining-growth-may-challenge-goal-of-making-uttar-pradesh-a-trillion-dollar-economy/story-30Fe6bfuFHecEnbNU8ts5K.html](https://www.hindustantimes.com/lucknow/gsdp-s-declining-growth-may-challenge-goal-of-making-uttar-pradesh-a-trillion-dollar-economy/story-30Fe6bfuFHecEnbNU8ts5K.html)). In current scenarios, even my comparatively tiny state (TS) will overtake them on 2025. This year, its rank is estimated to slip from 3rd to 5th (KA and GJ overtake it). This is suggestive of a K shaped recovery, which would be disastrous for everyone (since your tax pays for this) ([https://www.nationalheraldindia.com/opinion/recovery-claimed-by-govt-based-on-second-quarter-gdp-estimates-is-dubious-and-fragile](https://www.nationalheraldindia.com/opinion/recovery-claimed-by-govt-based-on-second-quarter-gdp-estimates-is-dubious-and-fragile)) This is worrying because of its population and inequality. It's western districts are significantly richer than the poorer east, with Noida having a PCI over to 10x that of its poorest districts, and actually saw an increase over the past two years. To it's credit, it is investing in road infra, which, along with significant rail investment by the central government (such as the EDFC. ASEAN nations are also making use of the same formula for medium term growth ([https://thediplomat.com/2021/01/low-rates-are-pushing-us-capital-into-southeast-asia-what-happens-when-rates-go-up/](https://thediplomat.com/2021/01/low-rates-are-pushing-us-capital-into-southeast-asia-what-happens-when-rates-go-up/)). [UP's GDP according to IBEF](https://preview.redd.it/p3acm1512vi61.png?width=375&amp;format=png&amp;auto=webp&amp;s=8588d69914ab02d0e40133073cddb239a40aa850) Sadly, commentary is usually politically tinted, such as [https://www.timesnownews.com/columns/article/yogis-economic-model-ensures-growth-with-more-jobs/701004](https://www.timesnownews.com/columns/article/yogis-economic-model-ensures-growth-with-more-jobs/701004). Investor opinion is pretty poor on account for infrastructure deficiencies and poor law and order ([https://www.livemint.com/Opinion/YEmTATLHyICNuNU0oVSuqL/Uttar-Pradesh-Indias-biggest-state-is-still-its-biggest-p.html](https://www.livemint.com/Opinion/YEmTATLHyICNuNU0oVSuqL/Uttar-Pradesh-Indias-biggest-state-is-still-its-biggest-p.html) [https://frontline.thehindu.com/cover-story/tall-claims/article32882389.ece](https://frontline.thehindu.com/cover-story/tall-claims/article32882389.ece)). This (obviously) translates to poor FDI ([https://dipp.gov.in/publications/fdi-statistics](https://dipp.gov.in/publications/fdi-statistics)).  If anyone has some well written analysis or research papers which are 'neutral' let me know. I have looked into the aussie paper though.  Source : IBEF ([https://www.ibef.org/states/uttar-pradesh.aspx](https://www.ibef.org/states/uttar-pradesh.aspx)) RBI [https://www.rbi.org.in/Scripts/AnnualPublications.aspx?head=Handbook+of+Statistics+on+Indian+States](https://www.rbi.org.in/Scripts/AnnualPublications.aspx?head=Handbook+of+Statistics+on+Indian+States)",
    "light_cleaned_comments": ""
}