{
    "id": "1b6uemy",
    "title": "Bengaluru Rameshwaram Cafe blast | Police probing networks of four absconding terror suspects ",
    "url": "https://www.thehindu.com/news/national/karnataka/bengaluru-rameshwaram-cafe-blast-police-probing-networks-of-four-absconding-terror/article67910294.ece",
    "selftext": "\nOwing to the similarities in the assembling of the explosive, the detonator, timer and the mechanism used to explode the bomb, between the recent explosion in the restaurant and the cooker bomb blast at Mangaluru on November 19, 2022, the police are now probing the networks of the absconding accused — Abdul Mateen Taha, 30, Musabir Hussain and ‘Colonel’ — in the Mangaluru case, the sources said. ",
    "flair": "Crime",
    "score": 38,
    "num_comments": 3,
    "created_utc": 1709607171.0,
    "convurl": "https://external-preview.redd.it/mKIDcTO_2lvql8lQ1NWs4eOeCZAE-1wpdF4wiFTXJTk.jpg?auto=webp&s=4fb5220b71d70e9c83bf50935b41180018c8143b",
    "comments": [
        "Why is this post not getting any interactions?",
        "Saying something will get me in trouble!",
        "People of the sub seem to be of a certain political bent is what I have gathered from a few days here.",
        "Police is probing suspects, what's to interact in that?\n\nEkyc is something people know about and can help the guy. \n\nWhat interaction do you expect when there's just probing and suspicion? Guilty on basis of suspicion?",
        "I'd like to quote Jose Mourinho at this moment",
        "Can anybody tell me where actually the blast took place . Like on the roof in first floor , under the table etc and how big the scale was . Kind of unclear from the videos ."
    ],
    "cleaned_text": "bengaluru rameshwaram cafe blast police probing networks four absconding terror suspects owing similarities assembling explosive detonator timer mechanism used explode bomb recent explosion restaurant cooker bomb blast mangaluru november police probing networks absconding accused abdul mateen taha musabir hussain colonel mangaluru case sources said ",
    "cleaned_title": "bengaluru rameshwaram cafe blast police probing networks four absconding terror suspects",
    "cleaned_selftext": "owing similarities assembling explosive detonator timer mechanism used explode bomb recent explosion restaurant cooker bomb blast mangaluru november police probing networks absconding accused abdul mateen taha musabir hussain colonel mangaluru case sources said",
    "cleaned_comments": "post getting interactions saying something get trouble people sub seem certain political bent gathered days police probing suspects whats interact ekyc something people know help guy interaction expect theres probing suspicion guilty basis suspicion id like quote jose mourinho moment anybody tell actually blast took place like roof first floor table etc big scale kind unclear videos",
    "light_cleaned_title": "Bengaluru Rameshwaram Cafe blast | Police probing networks of four absconding terror suspects",
    "light_cleaned_selftext": "Owing to the similarities in the assembling of the explosive, the detonator, timer and the mechanism used to explode the bomb, between the recent explosion in the restaurant and the cooker bomb blast at Mangaluru on November 19, 2022, the police are now probing the networks of the absconding accused — Abdul Mateen Taha, 30, Musabir Hussain and ‘Colonel’ — in the Mangaluru case, the sources said.",
    "light_cleaned_comments": "Why is this post not getting any interactions? Saying something will get me in trouble! People of the sub seem to be of a certain political bent is what I have gathered from a few days here. Police is probing suspects, what's to interact in that? Ekyc is something people know about and can help the guy. What interaction do you expect when there's just probing and suspicion? Guilty on basis of suspicion? I'd like to quote Jose Mourinho at this moment Can anybody tell me where actually the blast took place . Like on the roof in first floor , under the table etc and how big the scale was . Kind of unclear from the videos ."
}