{
    "id": "18r4t8b",
    "title": "Reforming (or deforming?) the criminal justice system: A digital rights overview of the three new criminal law Bills",
    "url": "https://www.reddit.com/r/india/comments/18r4t8b/reforming_or_deforming_the_criminal_justice/",
    "selftext": "&#x200B;\n\n[ IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/yvzujsjr2m8c1.png?width=1600&format=png&auto=webp&s=0339bf52c598d26d6b64a1a7c8e171a976af1912)\n\n## tl;dr\n\nLast week, three bills overhauling current Indian criminal laws were passed by both houses of the Parliament in the 2023 Winter Session, and now await Presidential assent. The bills contain several provisions that threaten our fundamental rights to privacy and free speech. They attempt to digitise many aspects of criminal procedure, and include ‘digital evidence’ under the ambit of the evidence law, without outlining procedural safeguards. Though the word ‘sedition’ has been deleted from the law, the concept is retained through vague provisions, which leaves room for arbitrary application. Executive powers pertaining to search and seizure of digital evidence have also been broadened. The review and recommendations of the Parliamentary Committee on Home Affairs did not adequately address these shortcomings.\n\n## Introduction\n\nThe Winter Session of the Indian Parliament commenced on December 04, 2023 and, in its course, took up [**18 bills**](https://www.hindustantimes.com/india-news/bills-to-replace-criminal-laws-listed-for-parliaments-winter-session-101701276878415.html?ref=static.internetfreedom.in) for consideration. The list included three bills, namely the Bharatiya Nyaya (Second) Sanhita, 2023 (**“**BNS”), Bharatiya Sakshya (Second) Bill, 2023 (**“**BSB**”**), and Bharatiya Nagarik Suraksha (Second) Sanhita, 2023 (**“**BNSS**”**) which were [**passed**](https://pib.gov.in/PressReleasePage.aspx?PRID=1989434&ref=static.internetfreedom.in) in the Lok Sabha on Wednesday, and the Rajya Sabha on Thursday. So, what’s on the line? Only all of the Indian criminal justice system as we know it. \n\nThe three bills are slated to reform three foundational legislations that propel criminal law and procedure in India – the Indian Penal Code, 1860 (now BNS), the Code of Criminal Procedure, 1973 (now BNSS), and the Indian Evidence Act, 1872 (now BSB). The bills were sprung on an unsuspecting Parliament in the 2023 Monsoon Session with the [**objective**](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=1988913&ref=static.internetfreedom.in) of “decolonising” British-era criminal laws and retaining “Indianness”, and were then referred to the Parliamentary Standing Committee on Home Affairs for review and recommendations. The Standing Committee published its reports annexed with expansive dissent notes from its members (see reports on [**BNS**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nyaya_Sanhita_2023.pdf?ref=static.internetfreedom.in), [**BSB**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Sakshya_Bill_2023.pdf?ref=static.internetfreedom.in) and [**BNSS**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nagarik_Suraksha_Sanhita_2023.pdf?ref=static.internetfreedom.in)), which failed to cast a critical eye on many concerning provisions. In this post, we briefly look at the “reform” brought in by the three criminal bills and its impact on digital rights and freedoms, assess the circumstances in which they were passed, and critically evaluate the role of the Standing Committee (or lack thereof) in shaping discussions around many of their glaringly concerning provisions. \n\n## So, what’s the 411?\n\nAfter the three bills were referred to the Parliamentary Committee on August 24, 2023, the Committee took 3 months to review them, and on November 6, 2023, released its Reports on the bills. First, we shall look at the “reforms” brought on by the initial drafts of the three bills, limiting ourselves to provisions affecting digital rights and privacy. Then, we study the reports of the Standing Committee on the drafts, and appraise their role in shaping pertinent discussions around provisions of the bill. Finally, we look at the bills in their final forms. \n\n### New sedition law, who dis?\n\nTouted as one of the most [**significant**](https://www.hindustantimes.com/india-news/sedition-under-the-new-bharatiya-nyaya-sanhita-bill-2023-what-s-changed-101691751947093.html?ref=static.internetfreedom.in) “reforms” to the Indian Penal Code, BNS repeals “sedition” as an offence. While true on paper, the Ministry of Home Affairs has simply removed the word “sedition” from the law (formerly Section 124A of the IPC), and replaced it with a much more vague and broad nomenclature in the BNS, through Clause 150 titled ‘Acts endangering sovereignty unity and integrity of India.’ The Clause criminalises acts “*endangering the sovereignty, unity, and integrity of India”* which include using electronic communications to “e*xcite armed rebellion, subversive activities, secession, separatism, or to endanger India’s unity, sovereignty and integrity*”. Actions similar to sedition will be penalised, but with a wider scope and application due to its vagueness, which will have catastrophic effects on free speech, dissent and journalistic freedom. What’s worse is that punishment under Clause 150 mandates imprisonment under all circumstances, unlike Section 124A, under which the penalty could be limited to a fine.\n\nMore worrying is the inclusion of ‘electronic communications’ as a means to commit “seditious” acts. Read with the Telecommunications Bill, 2023, this virtually opens doors for legal interception of electronic communications and thus, raises alarms for privacy. As we pointed out in our [**first read**](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in), if the Telecommunications Bill, 2023 becomes applicable to online communication services, service providers such as Whatsapp, Signal etc., which adopt the privacy protecting practice of end-to-end encryption, may also be required to intercept, detain, disclose, or suspend any message, wherein \"message\" is defined as “*any sign, signal, writing, text, image, sound, video, data stream, intelligence or information sent through telecommunication*”. \n\nThese changes have come into play in disregard of the Supreme Court’s ongoing deliberation on the current sedition law. On September 12, 2023, a 3-judge bench of the Supreme Court referred the petitions pertaining to the challenge to the constitutionality of sedition law to a bench of at least 5 judges (as we reported [**here**](https://internetfreedom.in/sc-sedition-update-larger-bench/?ref=static.internetfreedom.in)). Though the new Clause 150 will only apply prospectively, constructive jurisprudence of the Supreme Court on criminalising seditious or similar acts is pivotal to criminal justice reform. By passing the BNS post-haste, the legislative branch has diminished all possibility of holistic reform. \n\n### Evidence_final(1).docx\n\nThe BSB expands the definition of 'documents' to include electronic or digital records including online communications on various personal devices. The definition is broad, and covers any electronic communication such as messages, call recordings, and emails as well as electronic communication devices such as mobile phones, laptops, cameras, and any other electronic device that “may be specified by the government at a later time”. The bill attempts sizable reform, but provides no means to ensure the security or maintenance of a proper chain of custody for such digital evidence acquired in investigations. Without safeguards, private information or communication stored by the investigating officer may be vulnerable to tampering, leaks or breaches. Further, though like Section 65B of the Indian Evidence, BSB also requires a certification for admissibility of electronic evidence, there arises a contradiction by virtue of how BSB classifies electronic records as “documents” which may not need certification. It is also pertinent to note that as electronic records are classified as “documents”, there is a shift in its perception from secondary to primary evidence. Given how electronic records can be easily tampered, giving it the moniker of “primary evidence” is bound to be problematic.  \n\n### Take my hand, take my phone and laptop too…\n\nClause 94 of the BNSS further allows the Court to summon any document or material necessary for an investigation as ‘evidence’, and this includes digital evidence. Courts of law can also order search and seizure of such evidence for various reasons including if the person in possession of the evidence is “*not expected to produce the same*” or is not directly involved in the trial. Mobiles or laptops may contain a lot of information that may be irrelevant to the proceedings, but still be collected as evidence. The inclusion of digital records under BSB and BNSS may promote excessive invasions of privacy and violations of the constitutional right against self-incrimination. \n\nFurther, Clause 185 of the BSB allows a police officer to search for any material or document (including in digital devices) without a written order if they have “reasonable grounds” to believe that such material or document cannot be otherwise obtained without undue delay. This is a worrying provision that will legitimise and encourage rampant infringement of privacy by the executive. In recent years, there has been a [**noticeable increase**](https://www.thehindu.com/news/national/newsclick-raids-can-journalists-be-compelled-to-share-passwords-and-hand-over-electronic-devices-explained/article67383548.ece?ref=static.internetfreedom.in) in raids being conducted where there is a discernible overreach in powers of search and seizure. There have also been [**several incidents**](https://scroll.in/article/1009529/can-the-police-in-india-force-someone-to-hand-over-their-phone-and-check-their-messages?ref=static.internetfreedom.in) of the police stopping individuals on the street and forcing them to surrender their phones. Given that mobile devices have become integral extensions of our personal lives, laws like the BSB and BNSS legitimising their unfounded search and seizure will continue allowing the police to access extensive amounts of an individual's private information, infringing upon their right to privacy. Read our report on the ongoing deliberations on the issue at the Supreme Court [**here**](https://internetfreedom.in/sc-search-seizure-union-guidelines-cbi-manual-dec/?ref=static.internetfreedom.in).\n\n### CrPC goes online?\n\nThe bills were introduced with a clear objective of digitising most aspects of criminal procedure. From registering a first information report (FIR) to drawing the charge sheet and delivering judgement, every step of a criminal investigation is required to be recorded digitally. Under the BNSS, summons can be issued electronically, and testimonies from witnesses, experts, accused, and other parties may also be presented electronically/virtually. \n\nThere is no disputing the fact that, eventually, criminal processes will have to be digitised. The COVID-19 pandemic was testament to the need of connecting the moving parts of the criminal justice system remotely, as is widely being done through virtual courts and e-registries. However, two concerns emerge from this shift. First, complete digitisation may have the effect of excluding persons without internet access or technological know-how, which continues to be a large population of India. Second, due care must be given to digitising something as foundational to the machinery as lodging FIRs. As soon as this is operationalised, there may be an appetite to verify or authenticate the identity of the complainant (except in cases where they may be anonymously lodged). Additionally, encouraging SMS-based FIR services may maximise data collection, even where the complainant does not consent to the same. These are considerations that require discussion and impact assessment, especially for the privacy of complainants, who are often victims or survivors.\n\n### (Mis)organised crime\n\nThe BNS classifies financial scams and cyber crimes, *inter alia,* as ‘organised crime’. This is a significant change which will lead to stringent penalisation of such cyber crimes. While at the outset a positive step, the regulation of ‘organised crime’ in national and international contexts comes with large historic baggage and can be counter-intuitive. Such reform must not be brought about without consulting experts, relevant stakeholders, and civil society.\n\n## Where does the Standing Committee stand?\n\nThe provisions mentioned above, along with other mammoth changes that reform pivotal aspects of the Indian criminal justice system, were referred to the Parliamentary Standing Committee on Home Affairs for closer review and appraisal. After 3 months of deliberation, the Standing Committee released three separate reports on the bills. Let’s have a look at their conduct of business, and some of the pertinent recommendations that were issued.\n\n### Need4Speed, Standing Committee Edition\n\nWe crunched some numbers, and…\n\n1. In these 3 months, the Standing Committee sat for a total of 13 meetings, of which 10 were spent on discussions and queries by committee members, responses by the Home Minister, and views of domain experts. These were flanked by 3 procedural sessions, which were spent introducing the bills and then subsequently adopting the reports.\n2. The Standing Committee spent a total of 2595 minutes (or 43 hours, 15 minutes) discussing the three bills. Coming at a total of 1062 provisions (1059 Sections, two BNSS Schedules spanning over 300 penalty clauses and 56 forms, and one BSB Schedule), the Committee allocated, on average, just shy of 2.45 minutes per provision. This number discounts any overarching discussions on the bills.\n3. The review and recommendations issued by the Standing Committee span only a fraction of their reports. The [**BNS report**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nyaya_Sanhita_2023.pdf?ref=static.internetfreedom.in) spans 342 pages, but only 42 pages contain the Committee’s review and clause-by-clause recommendations on the bill. In the [**BNSS report**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nagarik_Suraksha_Sanhita_2023.pdf?ref=static.internetfreedom.in) this number is 35 out of 518 pages, and in the[ **BSB report**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Sakshya_Bill_2023.pdf?ref=static.internetfreedom.in),15 out of 243 pages.\n4. The quality of the reviews and recommendations must also be assessed. Of the 15 recommendations issued on the BSB, 10 pertained to typos and preferred language, and 5 were substantive. For the BNS, of the 33 recommendations issued, 13 are substantive recommendations (largely on penalties), 9 commend the Ministry of Home Affairs on adding certain provisions and lend support to them, 18 were preferred language changes, and 3 pointed out typos. For the BNSS, of the 43 recommendations issued, 17 are substantive, 3 commendations, 11 preferred language changes, and 12 typos.\n5. All three reports contain a general recommendation, stating, “*\\[T\\]he \\[bill\\] contains many typographical, cross-referencing and grammatical errors. The Committee is of the view that even a single typographical, cross-referencing or grammatical error has the potential to be misinterpreted and dilute the intent of the provision. The Committee, therefore, recommends the Ministry to rectify such errors.*” \n\n### And they said…\n\nSo, what were the Standing Committee’s handful of substantive recommendations? \n\nFirst, it lauded the deletion of Section 124A of the Indian Penal Code that criminalises sedition from the BNS, but noted that the sedition law provisions are \"*somehow retained in clause 150 \\[of the Bill\\] in mild form*.\" The Committee failed to issue any strong recommendations on this front, or consider Supreme Court’s observations on the misuse of Section 124A in the ongoing case where sedition law has been stayed, and deliberation upon its constitutionality has been referred to a five-Judge Bench.\n\nSecond, on the question of digitising the FIR process, the Committee stated that it should be allowed only through modes “*specified by the State*” and that “*allowing any form of electronic communication for FIR registration can create logistical and technical challenges for law enforcement*.” It also expressed that tracking FIRs filed via SMS or other electronic means will be difficult. To this, the Committee suggests the government prescribe specific rules and modalities for electronic FIR registration. On a plain reading, this seems to add to the list of executive powers given to the Union government through delegated legislation in the three bills, and is dangerous for the privacy of complainants, as pointed above.\n\nIt is [**commonly understood**](https://www.medianama.com/2023/11/223-parliamentary-committee-bharatiya-nyaya-sanhita/?ref=static.internetfreedom.in) that the Standing Committee did not adequately address the lacunae in the bills, and specifically the provisions affecting digital rights and freedoms. Reformatory laws of this magnitude must be thoroughly reviewed, and representations from experts must be invited and incorporated into Committee reports. Though some experts were consulted, their submissions were not made public, and the bills were never thrown open for public consultation. Given the complexity of provisions the new bills have introduced and their vast repercussions on not only digital rights but also various other aspects of the criminal justice system, the time the Parliamentary Committee has spent studying the bills is not adequate. The current reports are between 250 to 530 pages long, but the review and recommendations of the Committee only run between 15 to 42 pages. The reports lack the depth and quality of review the subject matter requires. \n\nThough the recommendations issued by the Standing Committee have been incorporated into the (Second) Sanhitas which were re-introduced and passed in the Winter session, these were not robust suggestions. The Standing Committee has missed a golden opportunity to contribute rights-centric and constitutional perspectives to this conversation, by spending some time thoroughly reviewing the provisions and passing holistic recommendations. Alas, the bills remain “colonial” in the provisions they carry, and even widen the scope of executive control in an already flawed criminal justice system. Shame shame shame!\n\n### Important documents:\n\n1. Bharatiya Nyaya Sanhita Bill, 2023 ([**link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nyaya_Sanhita,_2023.pdf?ref=static.internetfreedom.in))\n2. Bharatiya Nagarik Suraksha Sanhita Bill, 2023 ([**link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nagarik_Suraksha_Sanhita,_2023.pdf?ref=static.internetfreedom.in))\n3. Bharatiya Sakshya Bill, 2023 ([**link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/BHARATIYA_SAKSHYA_BILL,%202023.pdf?ref=static.internetfreedom.in))\n\n\\----------------------------------------------------\n\nWith the release of the Broadcasting Bill, 2023, now the draft Telecom Bill, 2023 and the rumoured upcoming DPDPA Rules, the fight for our digital rights is at a critical juncture. 📷📷 We need YOUR support now more than ever.\n\n🔻🔻🔻🔻There is a massive gap of over INR 23,00,000 in our income and expenditure between Jan 2023 to Nov 2023. We need your help to bridge this gap before the year ends.\n\n[https://internetfreedom.in/we-need-your-help-pls/](https://internetfreedom.in/we-need-your-help-pls/)\n\nhttps://preview.redd.it/pcsqfing3m8c1.png?width=1600&format=png&auto=webp&s=5e8bd8fafea39334c7b30524acb918580521dbc5\n\n&#x200B;",
    "flair": "Policy/Economy",
    "score": 8,
    "num_comments": 1,
    "created_utc": 1703584547.0,
    "convurl": "https://external-preview.redd.it/7XIfbJ0nAyUoVSH31SSnmzvtCQ02ZAbF6BIP65T6YGc.jpg?auto=webp&s=80bddde1fcf9c99b9fbfcbac548b8f311247087f",
    "comments": [],
    "cleaned_text": "reforming deforming criminal justice system digital rights overview three new criminal law bills xb iff needs support ever details end posthttpspreviewreddityvzujsjrmcpngwidthformatpngautowebpsbfcddbaaceaaf tldr last week three bills overhauling current indian criminal laws passed houses parliament winter session await presidential assent bills contain several provisions threaten fundamental rights privacy free speech attempt digitise many aspects criminal procedure include digital evidence ambit evidence law without outlining procedural safeguards though word sedition deleted law concept retained vague provisions leaves room arbitrary application executive powers pertaining search seizure digital evidence also broadened review recommendations parliamentary committee home affairs adequately address shortcomings introduction winter session indian parliament commenced december course took billshttpswwwhindustantimescomindianewsbillstoreplacecriminallawslistedforparliamentswintersessionhtmlrefstaticinternetfreedomin consideration list included three bills namely bharatiya nyaya second sanhita bns bharatiya sakshya second bill bsb bharatiya nagarik suraksha second sanhita bnss passedhttpspibgovinpressreleasepageaspxpridrefstaticinternetfreedomin lok sabha wednesday rajya sabha thursday whats line indian criminal justice system know three bills slated reform three foundational legislations propel criminal law procedure india indian penal code bns code criminal procedure bnss indian evidence act bsb bills sprung unsuspecting parliament monsoon session objectivehttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin decolonising britishera criminal laws retaining indianness referred parliamentary standing committee home affairs review recommendations standing committee published reports annexed expansive dissent notes members see reports bnshttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanyayasanhitapdfrefstaticinternetfreedomin bsbhttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyasakshyabillpdfrefstaticinternetfreedomin bnsshttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanagariksurakshasanhitapdfrefstaticinternetfreedomin failed cast critical eye many concerning provisions post briefly look reform brought three criminal bills impact digital rights freedoms assess circumstances passed critically evaluate role standing committee lack thereof shaping discussions around many glaringly concerning provisions whats three bills referred parliamentary committee august committee took months review november released reports bills first shall look reforms brought initial drafts three bills limiting provisions affecting digital rights privacy study reports standing committee drafts appraise role shaping pertinent discussions around provisions bill finally look bills final forms new sedition law dis touted one significanthttpswwwhindustantimescomindianewsseditionunderthenewbharatiyanyayasanhitabillwhatschangedhtmlrefstaticinternetfreedomin reforms indian penal code bns repeals sedition offence true paper ministry home affairs simply removed word sedition law formerly section ipc replaced much vague broad nomenclature bns clause titled acts endangering sovereignty unity integrity india clause criminalises acts endangering sovereignty unity integrity india include using electronic communications excite armed rebellion subversive activities secession separatism endanger indias unity sovereignty integrity actions similar sedition penalised wider scope application due vagueness catastrophic effects free speech dissent journalistic freedom whats worse punishment clause mandates imprisonment circumstances unlike section penalty could limited fine worrying inclusion electronic communications means commit seditious acts read telecommunications bill virtually opens doors legal interception electronic communications thus raises alarms privacy pointed first readhttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomin telecommunications bill becomes applicable online communication services service providers whatsapp signal etc adopt privacy protecting practice endtoend encryption may also required intercept detain disclose suspend message wherein message defined sign signal writing text image sound video data stream intelligence information sent telecommunication changes come play disregard supreme courts ongoing deliberation current sedition law september judge bench supreme court referred petitions pertaining challenge constitutionality sedition law bench least judges reported herehttpsinternetfreedominscseditionupdatelargerbenchrefstaticinternetfreedomin though new clause apply prospectively constructive jurisprudence supreme court criminalising seditious similar acts pivotal criminal justice reform passing bns posthaste legislative branch diminished possibility holistic reform evidencefinaldocx bsb expands definition documents include electronic digital records including online communications various personal devices definition broad covers electronic communication messages call recordings emails well electronic communication devices mobile phones laptops cameras electronic device may specified government later time bill attempts sizable reform provides means ensure security maintenance proper chain custody digital evidence acquired investigations without safeguards private information communication stored investigating officer may vulnerable tampering leaks breaches though like section b indian evidence bsb also requires certification admissibility electronic evidence arises contradiction virtue bsb classifies electronic records documents may need certification also pertinent note electronic records classified documents shift perception secondary primary evidence given electronic records easily tampered giving moniker primary evidence bound problematic take hand take phone laptop clause bnss allows court summon document material necessary investigation evidence includes digital evidence courts law also order search seizure evidence various reasons including person possession evidence expected produce directly involved trial mobiles laptops may contain lot information may irrelevant proceedings still collected evidence inclusion digital records bsb bnss may promote excessive invasions privacy violations constitutional right selfincrimination clause bsb allows police officer search material document including digital devices without written order reasonable grounds believe material document otherwise obtained without undue delay worrying provision legitimise encourage rampant infringement privacy executive recent years noticeable increasehttpswwwthehinducomnewsnationalnewsclickraidscanjournalistsbecompelledtosharepasswordsandhandoverelectronicdevicesexplainedarticleecerefstaticinternetfreedomin raids conducted discernible overreach powers search seizure also several incidentshttpsscrollinarticlecanthepoliceinindiaforcesomeonetohandovertheirphoneandchecktheirmessagesrefstaticinternetfreedomin police stopping individuals street forcing surrender phones given mobile devices become integral extensions personal lives laws like bsb bnss legitimising unfounded search seizure continue allowing police access extensive amounts individuals private information infringing upon right privacy read report ongoing deliberations issue supreme court herehttpsinternetfreedominscsearchseizureunionguidelinescbimanualdecrefstaticinternetfreedomin crpc goes online bills introduced clear objective digitising aspects criminal procedure registering first information report fir drawing charge sheet delivering judgement every step criminal investigation required recorded digitally bnss summons issued electronically testimonies witnesses experts accused parties may also presented electronicallyvirtually disputing fact eventually criminal processes digitised covid pandemic testament need connecting moving parts criminal justice system remotely widely done virtual courts eregistries however two concerns emerge shift first complete digitisation may effect excluding persons without internet access technological knowhow continues large population india second due care must given digitising something foundational machinery lodging firs soon operationalised may appetite verify authenticate identity complainant except cases may anonymously lodged additionally encouraging smsbased fir services may maximise data collection even complainant consent considerations require discussion impact assessment especially privacy complainants often victims survivors misorganised crime bns classifies financial scams cyber crimes inter alia organised crime significant change lead stringent penalisation cyber crimes outset positive step regulation organised crime national international contexts comes large historic baggage counterintuitive reform must brought without consulting experts relevant stakeholders civil society standing committee stand provisions mentioned along mammoth changes reform pivotal aspects indian criminal justice system referred parliamentary standing committee home affairs closer review appraisal months deliberation standing committee released three separate reports bills lets look conduct business pertinent recommendations issued needspeed standing committee edition crunched numbers months standing committee sat total meetings spent discussions queries committee members responses home minister views domain experts flanked procedural sessions spent introducing bills subsequently adopting reports standing committee spent total minutes hours minutes discussing three bills coming total provisions sections two bnss schedules spanning penalty clauses forms one bsb schedule committee allocated average shy minutes per provision number discounts overarching discussions bills review recommendations issued standing committee span fraction reports bns reporthttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanyayasanhitapdfrefstaticinternetfreedomin spans pages pages contain committees review clausebyclause recommendations bill bnss reporthttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanagariksurakshasanhitapdfrefstaticinternetfreedomin number pages bsb reporthttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyasakshyabillpdfrefstaticinternetfreedomin pages quality reviews recommendations must also assessed recommendations issued bsb pertained typos preferred language substantive bns recommendations issued substantive recommendations largely penalties commend ministry home affairs adding certain provisions lend support preferred language changes pointed typos bnss recommendations issued substantive commendations preferred language changes typos three reports contain general recommendation stating bill contains many typographical crossreferencing grammatical errors committee view even single typographical crossreferencing grammatical error potential misinterpreted dilute intent provision committee therefore recommends ministry rectify errors said standing committees handful substantive recommendations first lauded deletion section indian penal code criminalises sedition bns noted sedition law provisions somehow retained clause bill mild form committee failed issue strong recommendations front consider supreme courts observations misuse section ongoing case sedition law stayed deliberation upon constitutionality referred fivejudge bench second question digitising fir process committee stated allowed modes specified state allowing form electronic communication fir registration create logistical technical challenges law enforcement also expressed tracking firs filed via sms electronic means difficult committee suggests government prescribe specific rules modalities electronic fir registration plain reading seems add list executive powers given union government delegated legislation three bills dangerous privacy complainants pointed commonly understoodhttpswwwmedianamacomparliamentarycommitteebharatiyanyayasanhitarefstaticinternetfreedomin standing committee adequately address lacunae bills specifically provisions affecting digital rights freedoms reformatory laws magnitude must thoroughly reviewed representations experts must invited incorporated committee reports though experts consulted submissions made public bills never thrown open public consultation given complexity provisions new bills introduced vast repercussions digital rights also various aspects criminal justice system time parliamentary committee spent studying bills adequate current reports pages long review recommendations committee run pages reports lack depth quality review subject matter requires though recommendations issued standing committee incorporated second sanhitas reintroduced passed winter session robust suggestions standing committee missed golden opportunity contribute rightscentric constitutional perspectives conversation spending time thoroughly reviewing provisions passing holistic recommendations alas bills remain colonial provisions carry even widen scope executive control already flawed criminal justice system shame shame shame important documents bharatiya nyaya sanhita bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanyayasanhitapdfrefstaticinternetfreedomin bharatiya nagarik suraksha sanhita bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanagariksurakshasanhitapdfrefstaticinternetfreedomin bharatiya sakshya bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyasakshyabillpdfrefstaticinternetfreedomin release broadcasting bill draft telecom bill rumoured upcoming dpdpa rules fight digital rights critical juncture need support ever massive gap inr income expenditure jan nov need help bridge gap year ends httpsinternetfreedominweneedyourhelpplshttpsinternetfreedominweneedyourhelppls xb ",
    "cleaned_title": "reforming deforming criminal justice system digital rights overview three new criminal law bills",
    "cleaned_selftext": "xb iff needs support ever details end posthttpspreviewreddityvzujsjrmcpngwidthformatpngautowebpsbfcddbaaceaaf tldr last week three bills overhauling current indian criminal laws passed houses parliament winter session await presidential assent bills contain several provisions threaten fundamental rights privacy free speech attempt digitise many aspects criminal procedure include digital evidence ambit evidence law without outlining procedural safeguards though word sedition deleted law concept retained vague provisions leaves room arbitrary application executive powers pertaining search seizure digital evidence also broadened review recommendations parliamentary committee home affairs adequately address shortcomings introduction winter session indian parliament commenced december course took billshttpswwwhindustantimescomindianewsbillstoreplacecriminallawslistedforparliamentswintersessionhtmlrefstaticinternetfreedomin consideration list included three bills namely bharatiya nyaya second sanhita bns bharatiya sakshya second bill bsb bharatiya nagarik suraksha second sanhita bnss passedhttpspibgovinpressreleasepageaspxpridrefstaticinternetfreedomin lok sabha wednesday rajya sabha thursday whats line indian criminal justice system know three bills slated reform three foundational legislations propel criminal law procedure india indian penal code bns code criminal procedure bnss indian evidence act bsb bills sprung unsuspecting parliament monsoon session objectivehttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomin decolonising britishera criminal laws retaining indianness referred parliamentary standing committee home affairs review recommendations standing committee published reports annexed expansive dissent notes members see reports bnshttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanyayasanhitapdfrefstaticinternetfreedomin bsbhttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyasakshyabillpdfrefstaticinternetfreedomin bnsshttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanagariksurakshasanhitapdfrefstaticinternetfreedomin failed cast critical eye many concerning provisions post briefly look reform brought three criminal bills impact digital rights freedoms assess circumstances passed critically evaluate role standing committee lack thereof shaping discussions around many glaringly concerning provisions whats three bills referred parliamentary committee august committee took months review november released reports bills first shall look reforms brought initial drafts three bills limiting provisions affecting digital rights privacy study reports standing committee drafts appraise role shaping pertinent discussions around provisions bill finally look bills final forms new sedition law dis touted one significanthttpswwwhindustantimescomindianewsseditionunderthenewbharatiyanyayasanhitabillwhatschangedhtmlrefstaticinternetfreedomin reforms indian penal code bns repeals sedition offence true paper ministry home affairs simply removed word sedition law formerly section ipc replaced much vague broad nomenclature bns clause titled acts endangering sovereignty unity integrity india clause criminalises acts endangering sovereignty unity integrity india include using electronic communications excite armed rebellion subversive activities secession separatism endanger indias unity sovereignty integrity actions similar sedition penalised wider scope application due vagueness catastrophic effects free speech dissent journalistic freedom whats worse punishment clause mandates imprisonment circumstances unlike section penalty could limited fine worrying inclusion electronic communications means commit seditious acts read telecommunications bill virtually opens doors legal interception electronic communications thus raises alarms privacy pointed first readhttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomin telecommunications bill becomes applicable online communication services service providers whatsapp signal etc adopt privacy protecting practice endtoend encryption may also required intercept detain disclose suspend message wherein message defined sign signal writing text image sound video data stream intelligence information sent telecommunication changes come play disregard supreme courts ongoing deliberation current sedition law september judge bench supreme court referred petitions pertaining challenge constitutionality sedition law bench least judges reported herehttpsinternetfreedominscseditionupdatelargerbenchrefstaticinternetfreedomin though new clause apply prospectively constructive jurisprudence supreme court criminalising seditious similar acts pivotal criminal justice reform passing bns posthaste legislative branch diminished possibility holistic reform evidencefinaldocx bsb expands definition documents include electronic digital records including online communications various personal devices definition broad covers electronic communication messages call recordings emails well electronic communication devices mobile phones laptops cameras electronic device may specified government later time bill attempts sizable reform provides means ensure security maintenance proper chain custody digital evidence acquired investigations without safeguards private information communication stored investigating officer may vulnerable tampering leaks breaches though like section b indian evidence bsb also requires certification admissibility electronic evidence arises contradiction virtue bsb classifies electronic records documents may need certification also pertinent note electronic records classified documents shift perception secondary primary evidence given electronic records easily tampered giving moniker primary evidence bound problematic take hand take phone laptop clause bnss allows court summon document material necessary investigation evidence includes digital evidence courts law also order search seizure evidence various reasons including person possession evidence expected produce directly involved trial mobiles laptops may contain lot information may irrelevant proceedings still collected evidence inclusion digital records bsb bnss may promote excessive invasions privacy violations constitutional right selfincrimination clause bsb allows police officer search material document including digital devices without written order reasonable grounds believe material document otherwise obtained without undue delay worrying provision legitimise encourage rampant infringement privacy executive recent years noticeable increasehttpswwwthehinducomnewsnationalnewsclickraidscanjournalistsbecompelledtosharepasswordsandhandoverelectronicdevicesexplainedarticleecerefstaticinternetfreedomin raids conducted discernible overreach powers search seizure also several incidentshttpsscrollinarticlecanthepoliceinindiaforcesomeonetohandovertheirphoneandchecktheirmessagesrefstaticinternetfreedomin police stopping individuals street forcing surrender phones given mobile devices become integral extensions personal lives laws like bsb bnss legitimising unfounded search seizure continue allowing police access extensive amounts individuals private information infringing upon right privacy read report ongoing deliberations issue supreme court herehttpsinternetfreedominscsearchseizureunionguidelinescbimanualdecrefstaticinternetfreedomin crpc goes online bills introduced clear objective digitising aspects criminal procedure registering first information report fir drawing charge sheet delivering judgement every step criminal investigation required recorded digitally bnss summons issued electronically testimonies witnesses experts accused parties may also presented electronicallyvirtually disputing fact eventually criminal processes digitised covid pandemic testament need connecting moving parts criminal justice system remotely widely done virtual courts eregistries however two concerns emerge shift first complete digitisation may effect excluding persons without internet access technological knowhow continues large population india second due care must given digitising something foundational machinery lodging firs soon operationalised may appetite verify authenticate identity complainant except cases may anonymously lodged additionally encouraging smsbased fir services may maximise data collection even complainant consent considerations require discussion impact assessment especially privacy complainants often victims survivors misorganised crime bns classifies financial scams cyber crimes inter alia organised crime significant change lead stringent penalisation cyber crimes outset positive step regulation organised crime national international contexts comes large historic baggage counterintuitive reform must brought without consulting experts relevant stakeholders civil society standing committee stand provisions mentioned along mammoth changes reform pivotal aspects indian criminal justice system referred parliamentary standing committee home affairs closer review appraisal months deliberation standing committee released three separate reports bills lets look conduct business pertinent recommendations issued needspeed standing committee edition crunched numbers months standing committee sat total meetings spent discussions queries committee members responses home minister views domain experts flanked procedural sessions spent introducing bills subsequently adopting reports standing committee spent total minutes hours minutes discussing three bills coming total provisions sections two bnss schedules spanning penalty clauses forms one bsb schedule committee allocated average shy minutes per provision number discounts overarching discussions bills review recommendations issued standing committee span fraction reports bns reporthttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanyayasanhitapdfrefstaticinternetfreedomin spans pages pages contain committees review clausebyclause recommendations bill bnss reporthttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyanagariksurakshasanhitapdfrefstaticinternetfreedomin number pages bsb reporthttpsprsindiaorgfilesbillsactsbillsparliamentscreportbharatiyasakshyabillpdfrefstaticinternetfreedomin pages quality reviews recommendations must also assessed recommendations issued bsb pertained typos preferred language substantive bns recommendations issued substantive recommendations largely penalties commend ministry home affairs adding certain provisions lend support preferred language changes pointed typos bnss recommendations issued substantive commendations preferred language changes typos three reports contain general recommendation stating bill contains many typographical crossreferencing grammatical errors committee view even single typographical crossreferencing grammatical error potential misinterpreted dilute intent provision committee therefore recommends ministry rectify errors said standing committees handful substantive recommendations first lauded deletion section indian penal code criminalises sedition bns noted sedition law provisions somehow retained clause bill mild form committee failed issue strong recommendations front consider supreme courts observations misuse section ongoing case sedition law stayed deliberation upon constitutionality referred fivejudge bench second question digitising fir process committee stated allowed modes specified state allowing form electronic communication fir registration create logistical technical challenges law enforcement also expressed tracking firs filed via sms electronic means difficult committee suggests government prescribe specific rules modalities electronic fir registration plain reading seems add list executive powers given union government delegated legislation three bills dangerous privacy complainants pointed commonly understoodhttpswwwmedianamacomparliamentarycommitteebharatiyanyayasanhitarefstaticinternetfreedomin standing committee adequately address lacunae bills specifically provisions affecting digital rights freedoms reformatory laws magnitude must thoroughly reviewed representations experts must invited incorporated committee reports though experts consulted submissions made public bills never thrown open public consultation given complexity provisions new bills introduced vast repercussions digital rights also various aspects criminal justice system time parliamentary committee spent studying bills adequate current reports pages long review recommendations committee run pages reports lack depth quality review subject matter requires though recommendations issued standing committee incorporated second sanhitas reintroduced passed winter session robust suggestions standing committee missed golden opportunity contribute rightscentric constitutional perspectives conversation spending time thoroughly reviewing provisions passing holistic recommendations alas bills remain colonial provisions carry even widen scope executive control already flawed criminal justice system shame shame shame important documents bharatiya nyaya sanhita bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanyayasanhitapdfrefstaticinternetfreedomin bharatiya nagarik suraksha sanhita bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyanagariksurakshasanhitapdfrefstaticinternetfreedomin bharatiya sakshya bill linkhttpsprsindiaorgfilesbillsactsbillsparliamentbharatiyasakshyabillpdfrefstaticinternetfreedomin release broadcasting bill draft telecom bill rumoured upcoming dpdpa rules fight digital rights critical juncture need support ever massive gap inr income expenditure jan nov need help bridge gap year ends httpsinternetfreedominweneedyourhelpplshttpsinternetfreedominweneedyourhelppls xb",
    "cleaned_comments": "",
    "light_cleaned_title": "Reforming (or deforming?) the criminal justice system: A digital rights overview of the three new criminal law Bills",
    "light_cleaned_selftext": "&#x200B; [ IFF needs your support, now more than ever. Details at the end of this post.](https://preview.redd.it/yvzujsjr2m8c1.png?width=1600&format=png&auto=webp&s=0339bf52c598d26d6b64a1a7c8e171a976af1912) ## tl;dr Last week, three bills overhauling current Indian criminal laws were passed by both houses of the Parliament in the 2023 Winter Session, and now await Presidential assent. The bills contain several provisions that threaten our fundamental rights to privacy and free speech. They attempt to digitise many aspects of criminal procedure, and include ‘digital evidence’ under the ambit of the evidence law, without outlining procedural safeguards. Though the word ‘sedition’ has been deleted from the law, the concept is retained through vague provisions, which leaves room for arbitrary application. Executive powers pertaining to search and seizure of digital evidence have also been broadened. The review and recommendations of the Parliamentary Committee on Home Affairs did not adequately address these shortcomings. ## Introduction The Winter Session of the Indian Parliament commenced on December 04, 2023 and, in its course, took up [**18 bills**](https://www.hindustantimes.com/india-news/bills-to-replace-criminal-laws-listed-for-parliaments-winter-session-101701276878415.html?ref=static.internetfreedom.in) for consideration. The list included three bills, namely the Bharatiya Nyaya (Second) Sanhita, 2023 (**“**BNS”), Bharatiya Sakshya (Second) Bill, 2023 (**“**BSB**”**), and Bharatiya Nagarik Suraksha (Second) Sanhita, 2023 (**“**BNSS**”**) which were [**passed**](https://pib.gov.in/PressReleasePage.aspx?PRID=1989434&ref=static.internetfreedom.in) in the Lok Sabha on Wednesday, and the Rajya Sabha on Thursday. So, what’s on the line? Only all of the Indian criminal justice system as we know it. The three bills are slated to reform three foundational legislations that propel criminal law and procedure in India – the Indian Penal Code, 1860 (now BNS), the Code of Criminal Procedure, 1973 (now BNSS), and the Indian Evidence Act, 1872 (now BSB). The bills were sprung on an unsuspecting Parliament in the 2023 Monsoon Session with the [**objective**](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=1988913&ref=static.internetfreedom.in) of “decolonising” British-era criminal laws and retaining “Indianness”, and were then referred to the Parliamentary Standing Committee on Home Affairs for review and recommendations. The Standing Committee published its reports annexed with expansive dissent notes from its members (see reports on [**BNS**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nyaya_Sanhita_2023.pdf?ref=static.internetfreedom.in), [**BSB**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Sakshya_Bill_2023.pdf?ref=static.internetfreedom.in) and [**BNSS**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nagarik_Suraksha_Sanhita_2023.pdf?ref=static.internetfreedom.in)), which failed to cast a critical eye on many concerning provisions. In this post, we briefly look at the “reform” brought in by the three criminal bills and its impact on digital rights and freedoms, assess the circumstances in which they were passed, and critically evaluate the role of the Standing Committee (or lack thereof) in shaping discussions around many of their glaringly concerning provisions. ## So, what’s the 411? After the three bills were referred to the Parliamentary Committee on August 24, 2023, the Committee took 3 months to review them, and on November 6, 2023, released its Reports on the bills. First, we shall look at the “reforms” brought on by the initial drafts of the three bills, limiting ourselves to provisions affecting digital rights and privacy. Then, we study the reports of the Standing Committee on the drafts, and appraise their role in shaping pertinent discussions around provisions of the bill. Finally, we look at the bills in their final forms. ### New sedition law, who dis? Touted as one of the most [**significant**](https://www.hindustantimes.com/india-news/sedition-under-the-new-bharatiya-nyaya-sanhita-bill-2023-what-s-changed-101691751947093.html?ref=static.internetfreedom.in) “reforms” to the Indian Penal Code, BNS repeals “sedition” as an offence. While true on paper, the Ministry of Home Affairs has simply removed the word “sedition” from the law (formerly Section 124A of the IPC), and replaced it with a much more vague and broad nomenclature in the BNS, through Clause 150 titled ‘Acts endangering sovereignty unity and integrity of India.’ The Clause criminalises acts “*endangering the sovereignty, unity, and integrity of India”* which include using electronic communications to “e*xcite armed rebellion, subversive activities, secession, separatism, or to endanger India’s unity, sovereignty and integrity*”. Actions similar to sedition will be penalised, but with a wider scope and application due to its vagueness, which will have catastrophic effects on free speech, dissent and journalistic freedom. What’s worse is that punishment under Clause 150 mandates imprisonment under all circumstances, unlike Section 124A, under which the penalty could be limited to a fine. More worrying is the inclusion of ‘electronic communications’ as a means to commit “seditious” acts. Read with the Telecommunications Bill, 2023, this virtually opens doors for legal interception of electronic communications and thus, raises alarms for privacy. As we pointed out in our [**first read**](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in), if the Telecommunications Bill, 2023 becomes applicable to online communication services, service providers such as Whatsapp, Signal etc., which adopt the privacy protecting practice of end-to-end encryption, may also be required to intercept, detain, disclose, or suspend any message, wherein \"message\" is defined as “*any sign, signal, writing, text, image, sound, video, data stream, intelligence or information sent through telecommunication*”. These changes have come into play in disregard of the Supreme Court’s ongoing deliberation on the current sedition law. On September 12, 2023, a 3-judge bench of the Supreme Court referred the petitions pertaining to the challenge to the constitutionality of sedition law to a bench of at least 5 judges (as we reported [**here**](https://internetfreedom.in/sc-sedition-update-larger-bench/?ref=static.internetfreedom.in)). Though the new Clause 150 will only apply prospectively, constructive jurisprudence of the Supreme Court on criminalising seditious or similar acts is pivotal to criminal justice reform. By passing the BNS post-haste, the legislative branch has diminished all possibility of holistic reform. ### Evidence_final(1).docx The BSB expands the definition of 'documents' to include electronic or digital records including online communications on various personal devices. The definition is broad, and covers any electronic communication such as messages, call recordings, and emails as well as electronic communication devices such as mobile phones, laptops, cameras, and any other electronic device that “may be specified by the government at a later time”. The bill attempts sizable reform, but provides no means to ensure the security or maintenance of a proper chain of custody for such digital evidence acquired in investigations. Without safeguards, private information or communication stored by the investigating officer may be vulnerable to tampering, leaks or breaches. Further, though like Section 65B of the Indian Evidence, BSB also requires a certification for admissibility of electronic evidence, there arises a contradiction by virtue of how BSB classifies electronic records as “documents” which may not need certification. It is also pertinent to note that as electronic records are classified as “documents”, there is a shift in its perception from secondary to primary evidence. Given how electronic records can be easily tampered, giving it the moniker of “primary evidence” is bound to be problematic. ### Take my hand, take my phone and laptop too… Clause 94 of the BNSS further allows the Court to summon any document or material necessary for an investigation as ‘evidence’, and this includes digital evidence. Courts of law can also order search and seizure of such evidence for various reasons including if the person in possession of the evidence is “*not expected to produce the same*” or is not directly involved in the trial. Mobiles or laptops may contain a lot of information that may be irrelevant to the proceedings, but still be collected as evidence. The inclusion of digital records under BSB and BNSS may promote excessive invasions of privacy and violations of the constitutional right against self-incrimination. Further, Clause 185 of the BSB allows a police officer to search for any material or document (including in digital devices) without a written order if they have “reasonable grounds” to believe that such material or document cannot be otherwise obtained without undue delay. This is a worrying provision that will legitimise and encourage rampant infringement of privacy by the executive. In recent years, there has been a [**noticeable increase**](https://www.thehindu.com/news/national/newsclick-raids-can-journalists-be-compelled-to-share-passwords-and-hand-over-electronic-devices-explained/article67383548.ece?ref=static.internetfreedom.in) in raids being conducted where there is a discernible overreach in powers of search and seizure. There have also been [**several incidents**](https://scroll.in/article/1009529/can-the-police-in-india-force-someone-to-hand-over-their-phone-and-check-their-messages?ref=static.internetfreedom.in) of the police stopping individuals on the street and forcing them to surrender their phones. Given that mobile devices have become integral extensions of our personal lives, laws like the BSB and BNSS legitimising their unfounded search and seizure will continue allowing the police to access extensive amounts of an individual's private information, infringing upon their right to privacy. Read our report on the ongoing deliberations on the issue at the Supreme Court [**here**](https://internetfreedom.in/sc-search-seizure-union-guidelines-cbi-manual-dec/?ref=static.internetfreedom.in). ### CrPC goes online? The bills were introduced with a clear objective of digitising most aspects of criminal procedure. From registering a first information report (FIR) to drawing the charge sheet and delivering judgement, every step of a criminal investigation is required to be recorded digitally. Under the BNSS, summons can be issued electronically, and testimonies from witnesses, experts, accused, and other parties may also be presented electronically/virtually. There is no disputing the fact that, eventually, criminal processes will have to be digitised. The COVID-19 pandemic was testament to the need of connecting the moving parts of the criminal justice system remotely, as is widely being done through virtual courts and e-registries. However, two concerns emerge from this shift. First, complete digitisation may have the effect of excluding persons without internet access or technological know-how, which continues to be a large population of India. Second, due care must be given to digitising something as foundational to the machinery as lodging FIRs. As soon as this is operationalised, there may be an appetite to verify or authenticate the identity of the complainant (except in cases where they may be anonymously lodged). Additionally, encouraging SMS-based FIR services may maximise data collection, even where the complainant does not consent to the same. These are considerations that require discussion and impact assessment, especially for the privacy of complainants, who are often victims or survivors. ### (Mis)organised crime The BNS classifies financial scams and cyber crimes, *inter alia,* as ‘organised crime’. This is a significant change which will lead to stringent penalisation of such cyber crimes. While at the outset a positive step, the regulation of ‘organised crime’ in national and international contexts comes with large historic baggage and can be counter-intuitive. Such reform must not be brought about without consulting experts, relevant stakeholders, and civil society. ## Where does the Standing Committee stand? The provisions mentioned above, along with other mammoth changes that reform pivotal aspects of the Indian criminal justice system, were referred to the Parliamentary Standing Committee on Home Affairs for closer review and appraisal. After 3 months of deliberation, the Standing Committee released three separate reports on the bills. Let’s have a look at their conduct of business, and some of the pertinent recommendations that were issued. ### Need4Speed, Standing Committee Edition We crunched some numbers, and… 1. In these 3 months, the Standing Committee sat for a total of 13 meetings, of which 10 were spent on discussions and queries by committee members, responses by the Home Minister, and views of domain experts. These were flanked by 3 procedural sessions, which were spent introducing the bills and then subsequently adopting the reports. 2. The Standing Committee spent a total of 2595 minutes (or 43 hours, 15 minutes) discussing the three bills. Coming at a total of 1062 provisions (1059 Sections, two BNSS Schedules spanning over 300 penalty clauses and 56 forms, and one BSB Schedule), the Committee allocated, on average, just shy of 2.45 minutes per provision. This number discounts any overarching discussions on the bills. 3. The review and recommendations issued by the Standing Committee span only a fraction of their reports. The [**BNS report**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nyaya_Sanhita_2023.pdf?ref=static.internetfreedom.in) spans 342 pages, but only 42 pages contain the Committee’s review and clause-by-clause recommendations on the bill. In the [**BNSS report**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Nagarik_Suraksha_Sanhita_2023.pdf?ref=static.internetfreedom.in) this number is 35 out of 518 pages, and in the[ **BSB report**](https://prsindia.org/files/bills_acts/bills_parliament/2023/SC_Report_Bharatiya_Sakshya_Bill_2023.pdf?ref=static.internetfreedom.in),15 out of 243 pages. 4. The quality of the reviews and recommendations must also be assessed. Of the 15 recommendations issued on the BSB, 10 pertained to typos and preferred language, and 5 were substantive. For the BNS, of the 33 recommendations issued, 13 are substantive recommendations (largely on penalties), 9 commend the Ministry of Home Affairs on adding certain provisions and lend support to them, 18 were preferred language changes, and 3 pointed out typos. For the BNSS, of the 43 recommendations issued, 17 are substantive, 3 commendations, 11 preferred language changes, and 12 typos. 5. All three reports contain a general recommendation, stating, “*\\[T\\]he \\[bill\\] contains many typographical, cross-referencing and grammatical errors. The Committee is of the view that even a single typographical, cross-referencing or grammatical error has the potential to be misinterpreted and dilute the intent of the provision. The Committee, therefore, recommends the Ministry to rectify such errors.*” ### And they said… So, what were the Standing Committee’s handful of substantive recommendations? First, it lauded the deletion of Section 124A of the Indian Penal Code that criminalises sedition from the BNS, but noted that the sedition law provisions are \"*somehow retained in clause 150 \\[of the Bill\\] in mild form*.\" The Committee failed to issue any strong recommendations on this front, or consider Supreme Court’s observations on the misuse of Section 124A in the ongoing case where sedition law has been stayed, and deliberation upon its constitutionality has been referred to a five-Judge Bench. Second, on the question of digitising the FIR process, the Committee stated that it should be allowed only through modes “*specified by the State*” and that “*allowing any form of electronic communication for FIR registration can create logistical and technical challenges for law enforcement*.” It also expressed that tracking FIRs filed via SMS or other electronic means will be difficult. To this, the Committee suggests the government prescribe specific rules and modalities for electronic FIR registration. On a plain reading, this seems to add to the list of executive powers given to the Union government through delegated legislation in the three bills, and is dangerous for the privacy of complainants, as pointed above. It is [**commonly understood**](https://www.medianama.com/2023/11/223-parliamentary-committee-bharatiya-nyaya-sanhita/?ref=static.internetfreedom.in) that the Standing Committee did not adequately address the lacunae in the bills, and specifically the provisions affecting digital rights and freedoms. Reformatory laws of this magnitude must be thoroughly reviewed, and representations from experts must be invited and incorporated into Committee reports. Though some experts were consulted, their submissions were not made public, and the bills were never thrown open for public consultation. Given the complexity of provisions the new bills have introduced and their vast repercussions on not only digital rights but also various other aspects of the criminal justice system, the time the Parliamentary Committee has spent studying the bills is not adequate. The current reports are between 250 to 530 pages long, but the review and recommendations of the Committee only run between 15 to 42 pages. The reports lack the depth and quality of review the subject matter requires. Though the recommendations issued by the Standing Committee have been incorporated into the (Second) Sanhitas which were re-introduced and passed in the Winter session, these were not robust suggestions. The Standing Committee has missed a golden opportunity to contribute rights-centric and constitutional perspectives to this conversation, by spending some time thoroughly reviewing the provisions and passing holistic recommendations. Alas, the bills remain “colonial” in the provisions they carry, and even widen the scope of executive control in an already flawed criminal justice system. Shame shame shame! ### Important documents: 1. Bharatiya Nyaya Sanhita Bill, 2023 ([**link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nyaya_Sanhita,_2023.pdf?ref=static.internetfreedom.in)) 2. Bharatiya Nagarik Suraksha Sanhita Bill, 2023 ([**link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/Bharatiya_Nagarik_Suraksha_Sanhita,_2023.pdf?ref=static.internetfreedom.in)) 3. Bharatiya Sakshya Bill, 2023 ([**link**](https://prsindia.org/files/bills_acts/bills_parliament/2023/BHARATIYA_SAKSHYA_BILL,%202023.pdf?ref=static.internetfreedom.in)) \\---------------------------------------------------- With the release of the Broadcasting Bill, 2023, now the draft Telecom Bill, 2023 and the rumoured upcoming DPDPA Rules, the fight for our digital rights is at a critical juncture. 📷📷 We need YOUR support now more than ever. 🔻🔻🔻🔻There is a massive gap of over INR 23,00,000 in our income and expenditure between Jan 2023 to Nov 2023. We need your help to bridge this gap before the year ends. [https://internetfreedom.in/we-need-your-help-pls/](https://internetfreedom.in/we-need-your-help-pls/) &#x200B;",
    "light_cleaned_comments": ""
}