{
    "id": "1fv27yh",
    "title": "This could be the only way to tackle corruption in this country",
    "url": "https://www.youtube.com/watch?v=1IsZribF2EQ",
    "selftext": "Found this could be an effective way to get tough on corruption considering we already halfway to fascist democracy and this would keep the AA oligarchy in check.\n\n",
    "flair": "Policy/Economy",
    "score": 5,
    "num_comments": 2,
    "created_utc": 1727940385.0,
    "convurl": "https://external-preview.redd.it/rF-LHc5mgvq9I8l-Uh79mDn4K_cuyUyczOBIZ8-nSXI.jpg?auto=webp&s=e5107dace1b8197eb3d31f8b24479d7e8c63841c",
    "comments": [
        "Vietnam wants to be seen as a non-corrupt country that wants to attract foreign businesses, you know, trying to do good and be accountable, India on the other hand, *coughs*, is the best country on this planet and doesn't need anyone and anything, in fact anything international is either countries being jealous of India or conspiring to sabotage India. This is why greatest of the great leaders of India want to protect its amazing and patriotic capitalists and billionaries who only care about welfare of fellow Indians. It is the duty of our leaders to help them serve the nation by taking up all the contracts and make every Indian proud. So I don't think so this will ever work out in India."
    ],
    "cleaned_text": "could way tackle corruption country found could effective way get tough corruption considering already halfway fascist democracy would keep aa oligarchy check ",
    "cleaned_title": "could way tackle corruption country",
    "cleaned_selftext": "found could effective way get tough corruption considering already halfway fascist democracy would keep aa oligarchy check",
    "cleaned_comments": "vietnam wants seen noncorrupt country wants attract foreign businesses know trying good accountable india hand coughs best country planet doesnt need anyone anything fact anything international either countries jealous india conspiring sabotage india greatest great leaders india want protect amazing patriotic capitalists billionaries care welfare fellow indians duty leaders help serve nation taking contracts make every indian proud dont think ever work india",
    "light_cleaned_title": "This could be the only way to tackle corruption in this country",
    "light_cleaned_selftext": "Found this could be an effective way to get tough on corruption considering we already halfway to fascist democracy and this would keep the AA oligarchy in check.",
    "light_cleaned_comments": "Vietnam wants to be seen as a non-corrupt country that wants to attract foreign businesses, you know, trying to do good and be accountable, India on the other hand, *coughs*, is the best country on this planet and doesn't need anyone and anything, in fact anything international is either countries being jealous of India or conspiring to sabotage India. This is why greatest of the great leaders of India want to protect its amazing and patriotic capitalists and billionaries who only care about welfare of fellow Indians. It is the duty of our leaders to help them serve the nation by taking up all the contracts and make every Indian proud. So I don't think so this will ever work out in India."
}