{
    "id": "1dosv7n",
    "title": "The Telecom Act, 2023 is ready for (partial) take off: Outdated, colonial provisions to go into effect from June 26 | Internet Freedom Foundation",
    "url": "https://www.reddit.com/r/india/comments/1dosv7n/the_telecom_act_2023_is_ready_for_partial_take/",
    "selftext": "https://preview.redd.it/qr3u0np9dv8d1.jpg?width=1600&format=pjpg&auto=webp&s=24f094c32979cfb7b175e2c89410cfbdbdb28dc6\n\n# tl;dr\n\nOn June 21, 2024, the Ministry of Communications (“MoC”) issued a Gazette notification for enforcing certain sections of the Telecommunications Act 2023. Sections 1, 2, 10 to 30, 42 to 44, 46, 47, 50 to 58, 61 and 62 of the Act will go into effect from June 26, 2024. This post analyses, from a digital rights lens, the various sections of relevance that will come into force. \n\n# Important documents\n\n1. E-gazette notification for enforcement of sections of the Telecommunications Act, 2023 dated June 21, 2024 ([~link~](https://drive.google.com/file/d/1FYxQZBMpYxTwS_ZbCtdjjWN168_LasBi/view?usp=sharing&ref=static.internetfreedom.in))\n2. The Telecommunications Act, 2023 ([~link~](https://drive.google.com/file/d/1Jj1t8R98nT9-JirZXJmrGB5cYNOUgPzR/view?usp=sharing&ref=static.internetfreedom.in))\n3. Public Brief on draft Indian Telecommunication Bill, 2022 dated October 27, 2022 ([~link~](https://drive.google.com/file/d/13vSyFZY7mc5TMxTYsiueZ7051qt0-UK9/view?usp=sharing&ref=static.internetfreedom.in))\n4. IFF’s first read of the Telecom Bill, 2023 ([~link~](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in))\n\n# Background\n\nThe Telecom Act, 2023 was passed by both houses of the Parliament in December 2023 despite the suspension of over 140 opposition Members of Parliament and amidst chaos and disarray, and received Presidential assent on December 24, 2023. The Act, after it comes into effect, will repeal the Indian Telegraph Act, of 1885, the Indian Wireless Telegraphy Act, 1933, and the Telegraph Wire (Unlawful Protection) Act, 1950. The Telecom Act, 2023 continues to hang on to the colonial provisions of its 1885 predecessor it purportedly aims to overhaul. It misses a huge opportunity to reform the telecom sector and create a rights-centric law that protects user rights instead of infringing on them. Read our initial analysis of the Telecom Bill, 2023 [~here~](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in). \n\n# Sections in action and implications of their enforcement\n\nThe relevant [~sections~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2027941&ref=static.internetfreedom.in#:~:text=The%20Telecommunications%20Act%2C%202023%2C%20was,official%20Gazette%20on%2024.12.2023.) of the Act that have been listed in the Gazette notification for enforcement are as follows:\n\n1. **Definitions \\[Section 2\\]**: The definition of ‘telecommunication’ \\[Section 2(p)\\] read with ‘telecommunication service’ \\[Section 2(t)\\] is heavily diluted and truncated in the Act. Although the Telecom Act, unlike the draft Indian [~Telecom Bill, 2022~](https://internetfreedom.in/our-response-to-the-draft-telecom-bill-2022/?ref=static.internetfreedom.in), does not explicitly include a long list of online communication services, its definitional ambiguity and open-ended phrasing still leave the scope wide enough for online communication services such as WhatsApp and Zoom to be included in its ambit. Such a potential wide ambit implies that several alarming provisions related to surveillance, possession, suspension, authorisation, interception, etc will apply to internet services. Although the then Union Minister of MoC, Ashwini Vaishnaw, clarified to the [~media~](https://economictimes.indiatimes.com/industry/telecom/telecom-news/ott-not-under-ambit-of-telecom-bill-ashwini-vaishnaw/articleshow/106224226.cms?from=mdr&ref=static.internetfreedom.in) in December 2023 that Over-the-Top (“OTT”) communication services like WhatsApp are not covered under the Telecom Act, 2023, in May 2024 the Additional Secretary of the Department of Telecommunications (“DoT”) [~stated~](https://www.medianama.com/2024/05/223-licensing-ott-services-inter-ministerial-consultation-additional-secretary-dot/?ref=static.internetfreedom.in) that the “*licensing for OTT services would be decided after consultation between a lot of different ministries including the Ministry of Information and Broadcasting*”. To avoid expansion or re-interpretation of the scope in the future, we recently [~urged~](https://drive.google.com/file/d/1KJHddPLlaBvysbsLtSpcjqE3p9KZuKUc/view?usp=sharing&ref=static.internetfreedom.in) the current Union Minister to explicitly exclude internet services in the definition of ‘telecommunication’ and ‘telecommunication services’ in the Act itself. \n2. **Duties on users \\[Section 29\\]:** This Section imposes a duty on users to not furnish any false information while establishing their identity for availing ‘telecommunication services’. If applicable to internet services, Section 29 will have damaging consequences for a user’s ability to stay anonymous while communicating. The Digital Personal Data Protection Act, 2023 [~similarly~](https://www.hindustantimes.com/india-news/multiple-sections-of-telecom-act-to-come-into-effect-from-june-26-101718997660801.html?ref=static.internetfreedom.in) imposes a duty on data principals to not register a false or frivolous grievance or complaint, the [~violation~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) of which could result in penalties (of up to 10,000 INR). Such provisions can have a deleterious impact on vulnerable individuals such as whistleblowers and journalists, who wish to keep their identity anonymous, as well as on services such as Twitter and Instagram which currently provide users with the option to communicate anonymously. \n3. **Provisions for public emergency or public safety and notifying standards. \\[Section 19; 20\\]:** The entirety of Section 20 in the Telecom Act, 2023, whether it is the Union government’s power to temporarily possess, suspend, intercept, detain any telecommunication service \\[20(1)(a)\\], to intercept, detain, disclose, or suspend any message or class of messages \\[20(2)(a)\\], to direct suspension of any telecommunication service or class of telecommunication \\[20(2)(b)\\], or to notify encryption and data processing standards \\[19(f)\\], all on the grounds of public emergency (including disaster management) or in the interest of public safety, cements the colonial powers of the Union government. Misuse of these provisions, especially if the scope of the Act is extended to internet services, may result in draconian outcomes. Section 22(3) read with 2(f) empowers the Union government to notify ‘critical telecommunication infrastructure’ and issue measures related to the protection of such telecommunication networks and services. Protection measures listed include collection, analysis, and dissemination of traffic data, wherein ‘traffic data’ is defined as “*any data generated, transmitted, received or stored in telecommunication networks including data relating to the type, routing, duration or time of a telecommunication*”. This special categorisation and the Union government’s power to notify them, provide rules for their standards, and give them directions did not exist in the Telegraph Act, 1885. Thus, in addition to retaining several provisions that centralised power and control with the Executive, the Telecom Act, 2023 has created new ones that do so. Notably, Section 20 is almost identical to Section 5 of the Indian Telegraph Act, 1885. The Act meant to reform the colonial provisions under the latter fails to introduce meaningful oversight, accountability mechanisms, and/ or procedural safeguards in the surveillance and internet shutdown architecture of the country.\n4. **Power to search and supply of information \\[Section 43; 44\\]:** Section 43 confers quasi-judicial powers to any officer authorised by the Union government to “*search any building, vehicle, vessel, aircraft or place in which he has reason to believe that any unauthorised telecommunication network…. in respect of which an offence punishable under section 42 has been committed, is kept or concealed and take possession thereof*.” Such search and seizure powers are accompanied by the power to summon information, documents, or records in possession or control of any authorised entity if it is believed by the Union government to be necessary for any pending or apprehended civil or criminal proceedings \\[Section 44\\]. Such powers, non-existent in the Telegraph Act, 1885, may be open to misuse due to their ambiguous phrasing, absence of clear parameters of information that may be revealed, and overbroad grounds for revealing information due to the use of the phrase “apprehended”. This vagueness may lead to overbroad requests for disclosure which could result in the violation of the right to privacy of users, especially if it applies to internet services.\n5. **Continuation of existing rules \\[Section 61\\]:** Several provisions, including procedures and safeguards related to interception and suspension of services, are reliant on the yet-to-be-notified Rules under the Telecom Act. Until then, the current rules and regulations will continue to be applicable unless they are inconsistent with the Telecom Act. [~Reportedly~](https://economictimes.indiatimes.com/industry/telecom/telecom-policy/some-sections-of-telecom-act-to-come-into-force-from-june-26/articleshow/111174788.cms?from=mdr&ref=static.internetfreedom.in), the Union government is working to release around 35-37 Rules under the Act. As per reports from May 2024, DoT is likely to take at least [~six months~](https://www.livemint.com/industry/six-months-wait-for-new-telecom-law-rules-dot-plugging-all-gaps-to-ensure-no-flaws-11715002931646.html?ref=static.internetfreedom.in) before it begins notifying rules under the Telecom Act. \n\n# The need for repeal and reform\n\nProvisions of an Act which has retained its colonial roots, missed an opportune moment for bringing about reform, and was passed despite the suspension of 140+ opposition Members of Parliament as well as protests and walkouts in the Parliament, are going to come into force tomorrow. We stand by our initial ask to the Ministry to repeal the Telecom Act, 2023 and appoint a Law Commission and/or an unbiased, independent Standing Committee or expert body to look into the kinds of reforms needed for the telecommunication sector. Any regulatory framework for the telecom sector must be a right-centric version that protects and promotes individual rights and should be preceded by a broad, multi-city, in-person stakeholder consultation.",
    "flair": "Policy/Economy",
    "score": 23,
    "num_comments": 1,
    "created_utc": 1719387385.0,
    "convurl": "https://b.thumbs.redditmedia.com/Rptv4pJVNXfjmuhVWqhzeiGWMHa928-jyqDA0P4Eq8s.jpg",
    "comments": [],
    "cleaned_text": "telecom act ready partial take outdated colonial provisions go effect june internet freedom foundation tldr june ministry communications moc issued gazette notification enforcing certain sections telecommunications act sections act go effect june post analyses digital rights lens various sections relevance come force important documents egazette notification enforcement sections telecommunications act dated june linkhttpsdrivegooglecomfiledfyxqzbmpyxtwszbctdjjwnlasbiviewuspsharingrefstaticinternetfreedomin telecommunications act linkhttpsdrivegooglecomfiledjjtrntjirzxjmrgbcynougpzrviewuspsharingrefstaticinternetfreedomin public brief draft indian telecommunication bill dated october linkhttpsdrivegooglecomfiledvsyfzymctmxtysiuezqtukviewuspsharingrefstaticinternetfreedomin iffs first read telecom bill linkhttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomin background telecom act passed houses parliament december despite suspension opposition members parliament amidst chaos disarray received presidential assent december act comes effect repeal indian telegraph act indian wireless telegraphy act telegraph wire unlawful protection act telecom act continues hang colonial provisions predecessor purportedly aims overhaul misses huge opportunity reform telecom sector create rightscentric law protects user rights instead infringing read initial analysis telecom bill herehttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomin sections action implications enforcement relevant sectionshttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomintextthetelecommunicationsactccwasofficialgazetteon act listed gazette notification enforcement follows definitions section definition telecommunication section p read telecommunication service section heavily diluted truncated act although telecom act unlike draft indian telecom bill httpsinternetfreedominourresponsetothedrafttelecombillrefstaticinternetfreedomin explicitly include long list online communication services definitional ambiguity openended phrasing still leave scope wide enough online communication services whatsapp zoom included ambit potential wide ambit implies several alarming provisions related surveillance possession suspension authorisation interception etc apply internet services although union minister moc ashwini vaishnaw clarified mediahttpseconomictimesindiatimescomindustrytelecomtelecomnewsottnotunderambitoftelecombillashwinivaishnawarticleshowcmsfrommdrrefstaticinternetfreedomin december overthetop ott communication services like whatsapp covered telecom act may additional secretary department telecommunications dot statedhttpswwwmedianamacomlicensingottservicesinterministerialconsultationadditionalsecretarydotrefstaticinternetfreedomin licensing ott services would decided consultation lot different ministries including ministry information broadcasting avoid expansion reinterpretation scope future recently urgedhttpsdrivegooglecomfiledkjhddpllabvysbsltspcjqepkzukucviewuspsharingrefstaticinternetfreedomin current union minister explicitly exclude internet services definition telecommunication telecommunication services act duties users section section imposes duty users furnish false information establishing identity availing telecommunication services applicable internet services section damaging consequences users ability stay anonymous communicating digital personal data protection act similarlyhttpswwwhindustantimescomindianewsmultiplesectionsoftelecomacttocomeintoeffectfromjunehtmlrefstaticinternetfreedomin imposes duty data principals register false frivolous grievance complaint violationhttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin could result penalties inr provisions deleterious impact vulnerable individuals whistleblowers journalists wish keep identity anonymous well services twitter instagram currently provide users option communicate anonymously provisions public emergency public safety notifying standards section entirety section telecom act whether union governments power temporarily possess suspend intercept detain telecommunication service intercept detain disclose suspend message class messages direct suspension telecommunication service class telecommunication b notify encryption data processing standards f grounds public emergency including disaster management interest public safety cements colonial powers union government misuse provisions especially scope act extended internet services may result draconian outcomes section read f empowers union government notify critical telecommunication infrastructure issue measures related protection telecommunication networks services protection measures listed include collection analysis dissemination traffic data wherein traffic data defined data generated transmitted received stored telecommunication networks including data relating type routing duration time telecommunication special categorisation union governments power notify provide rules standards give directions exist telegraph act thus addition retaining several provisions centralised power control executive telecom act created new ones notably section almost identical section indian telegraph act act meant reform colonial provisions latter fails introduce meaningful oversight accountability mechanisms procedural safeguards surveillance internet shutdown architecture country power search supply information section section confers quasijudicial powers officer authorised union government search building vehicle vessel aircraft place reason believe unauthorised telecommunication network respect offence punishable section committed kept concealed take possession thereof search seizure powers accompanied power summon information documents records possession control authorised entity believed union government necessary pending apprehended civil criminal proceedings section powers nonexistent telegraph act may open misuse due ambiguous phrasing absence clear parameters information may revealed overbroad grounds revealing information due use phrase apprehended vagueness may lead overbroad requests disclosure could result violation right privacy users especially applies internet services continuation existing rules section several provisions including procedures safeguards related interception suspension services reliant yettobenotified rules telecom act current rules regulations continue applicable unless inconsistent telecom act reportedlyhttpseconomictimesindiatimescomindustrytelecomtelecompolicysomesectionsoftelecomacttocomeintoforcefromjunearticleshowcmsfrommdrrefstaticinternetfreedomin union government working release around rules act per reports may dot likely take least six monthshttpswwwlivemintcomindustrysixmonthswaitfornewtelecomlawrulesdotpluggingallgapstoensurenoflawshtmlrefstaticinternetfreedomin begins notifying rules telecom act need repeal reform provisions act retained colonial roots missed opportune moment bringing reform passed despite suspension opposition members parliament well protests walkouts parliament going come force tomorrow stand initial ask ministry repeal telecom act appoint law commission andor unbiased independent standing committee expert body look kinds reforms needed telecommunication sector regulatory framework telecom sector must rightcentric version protects promotes individual rights preceded broad multicity inperson stakeholder consultation ",
    "cleaned_title": "telecom act ready partial take outdated colonial provisions go effect june internet freedom foundation",
    "cleaned_selftext": "tldr june ministry communications moc issued gazette notification enforcing certain sections telecommunications act sections act go effect june post analyses digital rights lens various sections relevance come force important documents egazette notification enforcement sections telecommunications act dated june linkhttpsdrivegooglecomfiledfyxqzbmpyxtwszbctdjjwnlasbiviewuspsharingrefstaticinternetfreedomin telecommunications act linkhttpsdrivegooglecomfiledjjtrntjirzxjmrgbcynougpzrviewuspsharingrefstaticinternetfreedomin public brief draft indian telecommunication bill dated october linkhttpsdrivegooglecomfiledvsyfzymctmxtysiuezqtukviewuspsharingrefstaticinternetfreedomin iffs first read telecom bill linkhttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomin background telecom act passed houses parliament december despite suspension opposition members parliament amidst chaos disarray received presidential assent december act comes effect repeal indian telegraph act indian wireless telegraphy act telegraph wire unlawful protection act telecom act continues hang colonial provisions predecessor purportedly aims overhaul misses huge opportunity reform telecom sector create rightscentric law protects user rights instead infringing read initial analysis telecom bill herehttpsinternetfreedominfirstreadtelecombillrefstaticinternetfreedomin sections action implications enforcement relevant sectionshttpspibgovinpressreleaseiframepageaspxpridrefstaticinternetfreedomintextthetelecommunicationsactccwasofficialgazetteon act listed gazette notification enforcement follows definitions section definition telecommunication section p read telecommunication service section heavily diluted truncated act although telecom act unlike draft indian telecom bill httpsinternetfreedominourresponsetothedrafttelecombillrefstaticinternetfreedomin explicitly include long list online communication services definitional ambiguity openended phrasing still leave scope wide enough online communication services whatsapp zoom included ambit potential wide ambit implies several alarming provisions related surveillance possession suspension authorisation interception etc apply internet services although union minister moc ashwini vaishnaw clarified mediahttpseconomictimesindiatimescomindustrytelecomtelecomnewsottnotunderambitoftelecombillashwinivaishnawarticleshowcmsfrommdrrefstaticinternetfreedomin december overthetop ott communication services like whatsapp covered telecom act may additional secretary department telecommunications dot statedhttpswwwmedianamacomlicensingottservicesinterministerialconsultationadditionalsecretarydotrefstaticinternetfreedomin licensing ott services would decided consultation lot different ministries including ministry information broadcasting avoid expansion reinterpretation scope future recently urgedhttpsdrivegooglecomfiledkjhddpllabvysbsltspcjqepkzukucviewuspsharingrefstaticinternetfreedomin current union minister explicitly exclude internet services definition telecommunication telecommunication services act duties users section section imposes duty users furnish false information establishing identity availing telecommunication services applicable internet services section damaging consequences users ability stay anonymous communicating digital personal data protection act similarlyhttpswwwhindustantimescomindianewsmultiplesectionsoftelecomacttocomeintoeffectfromjunehtmlrefstaticinternetfreedomin imposes duty data principals register false frivolous grievance complaint violationhttpsinternetfreedominiffsfirstreadofthedraftdigitalpersonaldataprotectionbillrefstaticinternetfreedomin could result penalties inr provisions deleterious impact vulnerable individuals whistleblowers journalists wish keep identity anonymous well services twitter instagram currently provide users option communicate anonymously provisions public emergency public safety notifying standards section entirety section telecom act whether union governments power temporarily possess suspend intercept detain telecommunication service intercept detain disclose suspend message class messages direct suspension telecommunication service class telecommunication b notify encryption data processing standards f grounds public emergency including disaster management interest public safety cements colonial powers union government misuse provisions especially scope act extended internet services may result draconian outcomes section read f empowers union government notify critical telecommunication infrastructure issue measures related protection telecommunication networks services protection measures listed include collection analysis dissemination traffic data wherein traffic data defined data generated transmitted received stored telecommunication networks including data relating type routing duration time telecommunication special categorisation union governments power notify provide rules standards give directions exist telegraph act thus addition retaining several provisions centralised power control executive telecom act created new ones notably section almost identical section indian telegraph act act meant reform colonial provisions latter fails introduce meaningful oversight accountability mechanisms procedural safeguards surveillance internet shutdown architecture country power search supply information section section confers quasijudicial powers officer authorised union government search building vehicle vessel aircraft place reason believe unauthorised telecommunication network respect offence punishable section committed kept concealed take possession thereof search seizure powers accompanied power summon information documents records possession control authorised entity believed union government necessary pending apprehended civil criminal proceedings section powers nonexistent telegraph act may open misuse due ambiguous phrasing absence clear parameters information may revealed overbroad grounds revealing information due use phrase apprehended vagueness may lead overbroad requests disclosure could result violation right privacy users especially applies internet services continuation existing rules section several provisions including procedures safeguards related interception suspension services reliant yettobenotified rules telecom act current rules regulations continue applicable unless inconsistent telecom act reportedlyhttpseconomictimesindiatimescomindustrytelecomtelecompolicysomesectionsoftelecomacttocomeintoforcefromjunearticleshowcmsfrommdrrefstaticinternetfreedomin union government working release around rules act per reports may dot likely take least six monthshttpswwwlivemintcomindustrysixmonthswaitfornewtelecomlawrulesdotpluggingallgapstoensurenoflawshtmlrefstaticinternetfreedomin begins notifying rules telecom act need repeal reform provisions act retained colonial roots missed opportune moment bringing reform passed despite suspension opposition members parliament well protests walkouts parliament going come force tomorrow stand initial ask ministry repeal telecom act appoint law commission andor unbiased independent standing committee expert body look kinds reforms needed telecommunication sector regulatory framework telecom sector must rightcentric version protects promotes individual rights preceded broad multicity inperson stakeholder consultation",
    "cleaned_comments": "",
    "light_cleaned_title": "The Telecom Act, 2023 is ready for (partial) take off: Outdated, colonial provisions to go into effect from June 26 | Internet Freedom Foundation",
    "light_cleaned_selftext": "# tl;dr On June 21, 2024, the Ministry of Communications (“MoC”) issued a Gazette notification for enforcing certain sections of the Telecommunications Act 2023. Sections 1, 2, 10 to 30, 42 to 44, 46, 47, 50 to 58, 61 and 62 of the Act will go into effect from June 26, 2024. This post analyses, from a digital rights lens, the various sections of relevance that will come into force. # Important documents 1. E-gazette notification for enforcement of sections of the Telecommunications Act, 2023 dated June 21, 2024 ([~link~](https://drive.google.com/file/d/1FYxQZBMpYxTwS_ZbCtdjjWN168_LasBi/view?usp=sharing&ref=static.internetfreedom.in)) 2. The Telecommunications Act, 2023 ([~link~](https://drive.google.com/file/d/1Jj1t8R98nT9-JirZXJmrGB5cYNOUgPzR/view?usp=sharing&ref=static.internetfreedom.in)) 3. Public Brief on draft Indian Telecommunication Bill, 2022 dated October 27, 2022 ([~link~](https://drive.google.com/file/d/13vSyFZY7mc5TMxTYsiueZ7051qt0-UK9/view?usp=sharing&ref=static.internetfreedom.in)) 4. IFF’s first read of the Telecom Bill, 2023 ([~link~](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in)) # Background The Telecom Act, 2023 was passed by both houses of the Parliament in December 2023 despite the suspension of over 140 opposition Members of Parliament and amidst chaos and disarray, and received Presidential assent on December 24, 2023. The Act, after it comes into effect, will repeal the Indian Telegraph Act, of 1885, the Indian Wireless Telegraphy Act, 1933, and the Telegraph Wire (Unlawful Protection) Act, 1950. The Telecom Act, 2023 continues to hang on to the colonial provisions of its 1885 predecessor it purportedly aims to overhaul. It misses a huge opportunity to reform the telecom sector and create a rights-centric law that protects user rights instead of infringing on them. Read our initial analysis of the Telecom Bill, 2023 [~here~](https://internetfreedom.in/first-read-telecom-bill-2023/?ref=static.internetfreedom.in). # Sections in action and implications of their enforcement The relevant [~sections~](https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2027941&ref=static.internetfreedom.in#:~:text=The%20Telecommunications%20Act%2C%202023%2C%20was,official%20Gazette%20on%2024.12.2023.) of the Act that have been listed in the Gazette notification for enforcement are as follows: 1. **Definitions \\[Section 2\\]**: The definition of ‘telecommunication’ \\[Section 2(p)\\] read with ‘telecommunication service’ \\[Section 2(t)\\] is heavily diluted and truncated in the Act. Although the Telecom Act, unlike the draft Indian [~Telecom Bill, 2022~](https://internetfreedom.in/our-response-to-the-draft-telecom-bill-2022/?ref=static.internetfreedom.in), does not explicitly include a long list of online communication services, its definitional ambiguity and open-ended phrasing still leave the scope wide enough for online communication services such as WhatsApp and Zoom to be included in its ambit. Such a potential wide ambit implies that several alarming provisions related to surveillance, possession, suspension, authorisation, interception, etc will apply to internet services. Although the then Union Minister of MoC, Ashwini Vaishnaw, clarified to the [~media~](https://economictimes.indiatimes.com/industry/telecom/telecom-news/ott-not-under-ambit-of-telecom-bill-ashwini-vaishnaw/articleshow/106224226.cms?from=mdr&ref=static.internetfreedom.in) in December 2023 that Over-the-Top (“OTT”) communication services like WhatsApp are not covered under the Telecom Act, 2023, in May 2024 the Additional Secretary of the Department of Telecommunications (“DoT”) [~stated~](https://www.medianama.com/2024/05/223-licensing-ott-services-inter-ministerial-consultation-additional-secretary-dot/?ref=static.internetfreedom.in) that the “*licensing for OTT services would be decided after consultation between a lot of different ministries including the Ministry of Information and Broadcasting*”. To avoid expansion or re-interpretation of the scope in the future, we recently [~urged~](https://drive.google.com/file/d/1KJHddPLlaBvysbsLtSpcjqE3p9KZuKUc/view?usp=sharing&ref=static.internetfreedom.in) the current Union Minister to explicitly exclude internet services in the definition of ‘telecommunication’ and ‘telecommunication services’ in the Act itself. 2. **Duties on users \\[Section 29\\]:** This Section imposes a duty on users to not furnish any false information while establishing their identity for availing ‘telecommunication services’. If applicable to internet services, Section 29 will have damaging consequences for a user’s ability to stay anonymous while communicating. The Digital Personal Data Protection Act, 2023 [~similarly~](https://www.hindustantimes.com/india-news/multiple-sections-of-telecom-act-to-come-into-effect-from-june-26-101718997660801.html?ref=static.internetfreedom.in) imposes a duty on data principals to not register a false or frivolous grievance or complaint, the [~violation~](https://internetfreedom.in/iffs-first-read-of-the-draft-digital-personal-data-protection-bill-2023/?ref=static.internetfreedom.in) of which could result in penalties (of up to 10,000 INR). Such provisions can have a deleterious impact on vulnerable individuals such as whistleblowers and journalists, who wish to keep their identity anonymous, as well as on services such as Twitter and Instagram which currently provide users with the option to communicate anonymously. 3. **Provisions for public emergency or public safety and notifying standards. \\[Section 19; 20\\]:** The entirety of Section 20 in the Telecom Act, 2023, whether it is the Union government’s power to temporarily possess, suspend, intercept, detain any telecommunication service \\[20(1)(a)\\], to intercept, detain, disclose, or suspend any message or class of messages \\[20(2)(a)\\], to direct suspension of any telecommunication service or class of telecommunication \\[20(2)(b)\\], or to notify encryption and data processing standards \\[19(f)\\], all on the grounds of public emergency (including disaster management) or in the interest of public safety, cements the colonial powers of the Union government. Misuse of these provisions, especially if the scope of the Act is extended to internet services, may result in draconian outcomes. Section 22(3) read with 2(f) empowers the Union government to notify ‘critical telecommunication infrastructure’ and issue measures related to the protection of such telecommunication networks and services. Protection measures listed include collection, analysis, and dissemination of traffic data, wherein ‘traffic data’ is defined as “*any data generated, transmitted, received or stored in telecommunication networks including data relating to the type, routing, duration or time of a telecommunication*”. This special categorisation and the Union government’s power to notify them, provide rules for their standards, and give them directions did not exist in the Telegraph Act, 1885. Thus, in addition to retaining several provisions that centralised power and control with the Executive, the Telecom Act, 2023 has created new ones that do so. Notably, Section 20 is almost identical to Section 5 of the Indian Telegraph Act, 1885. The Act meant to reform the colonial provisions under the latter fails to introduce meaningful oversight, accountability mechanisms, and/ or procedural safeguards in the surveillance and internet shutdown architecture of the country. 4. **Power to search and supply of information \\[Section 43; 44\\]:** Section 43 confers quasi-judicial powers to any officer authorised by the Union government to “*search any building, vehicle, vessel, aircraft or place in which he has reason to believe that any unauthorised telecommunication network…. in respect of which an offence punishable under section 42 has been committed, is kept or concealed and take possession thereof*.” Such search and seizure powers are accompanied by the power to summon information, documents, or records in possession or control of any authorised entity if it is believed by the Union government to be necessary for any pending or apprehended civil or criminal proceedings \\[Section 44\\]. Such powers, non-existent in the Telegraph Act, 1885, may be open to misuse due to their ambiguous phrasing, absence of clear parameters of information that may be revealed, and overbroad grounds for revealing information due to the use of the phrase “apprehended”. This vagueness may lead to overbroad requests for disclosure which could result in the violation of the right to privacy of users, especially if it applies to internet services. 5. **Continuation of existing rules \\[Section 61\\]:** Several provisions, including procedures and safeguards related to interception and suspension of services, are reliant on the yet-to-be-notified Rules under the Telecom Act. Until then, the current rules and regulations will continue to be applicable unless they are inconsistent with the Telecom Act. [~Reportedly~](https://economictimes.indiatimes.com/industry/telecom/telecom-policy/some-sections-of-telecom-act-to-come-into-force-from-june-26/articleshow/111174788.cms?from=mdr&ref=static.internetfreedom.in), the Union government is working to release around 35-37 Rules under the Act. As per reports from May 2024, DoT is likely to take at least [~six months~](https://www.livemint.com/industry/six-months-wait-for-new-telecom-law-rules-dot-plugging-all-gaps-to-ensure-no-flaws-11715002931646.html?ref=static.internetfreedom.in) before it begins notifying rules under the Telecom Act. # The need for repeal and reform Provisions of an Act which has retained its colonial roots, missed an opportune moment for bringing about reform, and was passed despite the suspension of 140+ opposition Members of Parliament as well as protests and walkouts in the Parliament, are going to come into force tomorrow. We stand by our initial ask to the Ministry to repeal the Telecom Act, 2023 and appoint a Law Commission and/or an unbiased, independent Standing Committee or expert body to look into the kinds of reforms needed for the telecommunication sector. Any regulatory framework for the telecom sector must be a right-centric version that protects and promotes individual rights and should be preceded by a broad, multi-city, in-person stakeholder consultation.",
    "light_cleaned_comments": ""
}