{
    "id": "15fgpb8",
    "title": "Manipur status report on FIRs shows complete breakdown of constitutional machinery from May to July: Supreme Court",
    "url": "https://www.thehindu.com/news/national/manipur-status-report-on-crimes-shows-there-was-a-complete-breakdown-of-constitutional-machinery-from-may-to-july-end-supreme-court/article67145756.ece",
    "selftext": ">> “This shows that from the beginning of May till the end of July, there was an absolute breakdown of constitutional machinery. There was no law in the State… a complete breakdown of law and order. If law and order cannot protect citizens, where are we left?” Chief Justice of India D.Y. Chandrachud, heading a three-judge Bench, asked the Manipur government, represented by Solicitor-General Tushar Mehta.",
    "flair": "Law & Courts",
    "score": 1,
    "num_comments": 5,
    "created_utc": 1690905765.0,
    "convurl": "https://external-preview.redd.it/G9LTZ3G3J4iXO8O_W7wFIR011gXOabhtI5_FKAIyjgM.jpg?auto=webp&v=enabled&s=3d0843bca86dc7ca54a0d2d1efa804a8123ba00c",
    "comments": [
        "SC judges who accept RS seat for favourable judgements, pelling Gyan to mango people showing they care about the situation.",
        "Gormint is not working for the people. There have been many times where supreme court was the reprieve and arm twisted the gormint to follow the principle of fairness and law. \n\nThis particular judge cares.",
        "What is SC doing about it instead of just commenting? Impose presidential rule, law and order. CM Biren still resides over these atrocities.",
        "> Mr. Mehta surmised that the police may have been restricted as the situation in the State on the ground was not “conducive”.    \n\n\nIf the situation in the State was not conducive then why wasn't it escalated to involve centre?    \n\nYou claim double engine sarkar then it means both engines failed the PEOPLE."
    ],
    "cleaned_text": "manipur status report firs shows complete breakdown constitutional machinery may july supreme court shows beginning may till end july absolute breakdown constitutional machinery law state complete breakdown law order law order protect citizens left chief justice india dy chandrachud heading threejudge bench asked manipur government represented solicitorgeneral tushar mehta ",
    "cleaned_title": "manipur status report firs shows complete breakdown constitutional machinery may july supreme court",
    "cleaned_selftext": "shows beginning may till end july absolute breakdown constitutional machinery law state complete breakdown law order law order protect citizens left chief justice india dy chandrachud heading threejudge bench asked manipur government represented solicitorgeneral tushar mehta",
    "cleaned_comments": "sc judges accept rs seat favourable judgements pelling gyan mango people showing care situation gormint working people many times supreme court reprieve arm twisted gormint follow principle fairness law particular judge cares sc instead commenting impose presidential rule law order cm biren still resides atrocities mr mehta surmised police may restricted situation state ground conducive situation state conducive wasnt escalated involve centre claim double engine sarkar means engines failed people",
    "light_cleaned_title": "Manipur status report on FIRs shows complete breakdown of constitutional machinery from May to July: Supreme Court",
    "light_cleaned_selftext": ">> “This shows that from the beginning of May till the end of July, there was an absolute breakdown of constitutional machinery. There was no law in the State… a complete breakdown of law and order. If law and order cannot protect citizens, where are we left?” Chief Justice of India D.Y. Chandrachud, heading a three-judge Bench, asked the Manipur government, represented by Solicitor-General Tushar Mehta.",
    "light_cleaned_comments": "SC judges who accept RS seat for favourable judgements, pelling Gyan to mango people showing they care about the situation. Gormint is not working for the people. There have been many times where supreme court was the reprieve and arm twisted the gormint to follow the principle of fairness and law. This particular judge cares. What is SC doing about it instead of just commenting? Impose presidential rule, law and order. CM Biren still resides over these atrocities. > Mr. Mehta surmised that the police may have been restricted as the situation in the State on the ground was not “conducive”. If the situation in the State was not conducive then why wasn't it escalated to involve centre? You claim double engine sarkar then it means both engines failed the PEOPLE."
}