{
    "id": "13ihwc1",
    "title": "Multilateral banks debunk Indian government’s claims on growth rate",
    "url": "https://peoplesdispatch.org/2023/05/10/multilateral-banks-debunk-indian-governments-claims-on-growth-rate/",
    "selftext": "The so-called theory of trickle-down effect projected by the government (high prosperity of the rich flows down to enhance the economic welfare of the poor) has been debunked by the data on the growing gap between the rich and the poor in the country, rising poverty, unemployment, and the perpetually rising prices.",
    "flair": "Policy/Economy",
    "score": 52,
    "num_comments": 12,
    "created_utc": 1684179178.0,
    "convurl": "https://external-preview.redd.it/CxUzKDQ0YAlQP2dPGxkyxM2HAF_XLWgBciUlhcTu314.jpg?auto=webp&v=enabled&s=ffe6a8cc6b9e8e7711df054b8895791512078c72",
    "comments": [
        "That's how Reagan f#ucked middle class of US. MODI did same. \n\nTrickle down never worked. Ever.",
        "[50 years of tax cuts for the rich failed to trickle down, economics study says](https://www.cbsnews.com/news/tax-cuts-rich-50-years-no-trickle-down/)",
        "At this point I think everyone knows trickle down economics doesn’t work. But they’re pretending it does because they have a raging piss fetish.",
        "The tax duties, indeed, trickled down, to be fair.",
        "r/latestagecapitalism",
        "Trickle down works for making rich richer and it doesn't even hide the fact.\n\nA middle class person dreams of being richer than is peers and for that he looks to those much more wealthier than him. He hopes and dreams to be in their position and then horde more wealth so that his current peers may not achive what he has. For that he supports the whatever policies have made the rich richer.\n\nThis is just engrained human physiology for now.",
        "Right wingers everywhere ruin economies. From Brazil to Philippines",
        ">Described as left-wing, [Lula da Silva's](https://en.m.wikipedia.org/wiki/Luiz_Inácio_Lula_da_Silva) first presidency, which coincided with the first pink tide in the region, was marked by the consolidation of social welfare programs such as Bolsa Família and Fome Zero, which propelled Brazil to leave the United Nations' Hunger Map. During his two terms in office, he undertook radical reforms in the country, which eventually led to growth in GDP, reduction in public debt and inflation, and helping 20 million Brazilians escape poverty. Poverty, inequality, illiteracy, unemployment, infant mortality, and child labor rates fell significantly, while the minimum wage and average income increased, and access to school, university, and health care was expanded. He also played a prominent role in foreign policy, both on a regional level (as part of the BRICS) and as part of global trade and environmental negotiations.\n\nAnd then came this prick Bolsonaro, and did what any right-wing fascist fuck ever did to a country.",
        "Brazilians has some intelligence to vote him out, and now his punk ass is hiding in Florida, the penis of America 🇺🇸"
    ],
    "cleaned_text": "multilateral banks debunk indian governments claims growth rate socalled theory trickledown effect projected government high prosperity rich flows enhance economic welfare poor debunked data growing gap rich poor country rising poverty unemployment perpetually rising prices ",
    "cleaned_title": "multilateral banks debunk indian governments claims growth rate",
    "cleaned_selftext": "socalled theory trickledown effect projected government high prosperity rich flows enhance economic welfare poor debunked data growing gap rich poor country rising poverty unemployment perpetually rising prices",
    "cleaned_comments": "thats reagan fucked middle class us modi trickle never worked ever years tax cuts rich failed trickle economics study sayshttpswwwcbsnewscomnewstaxcutsrichyearsnotrickledown point think everyone knows trickle economics doesnt work theyre pretending raging piss fetish tax duties indeed trickled fair rlatestagecapitalism trickle works making rich richer doesnt even hide fact middle class person dreams richer peers looks much wealthier hopes dreams position horde wealth current peers may achive supports whatever policies made rich richer engrained human physiology right wingers everywhere ruin economies brazil philippines described leftwing lula da silvashttpsenmwikipediaorgwikiluizincioluladasilva first presidency coincided first pink tide region marked consolidation social welfare programs bolsa famlia fome zero propelled brazil leave united nations hunger map two terms office undertook radical reforms country eventually led growth gdp reduction public debt inflation helping million brazilians escape poverty poverty inequality illiteracy unemployment infant mortality child labor rates fell significantly minimum wage average income increased access school university health care expanded also played prominent role foreign policy regional level part brics part global trade environmental negotiations came prick bolsonaro rightwing fascist fuck ever country brazilians intelligence vote punk ass hiding florida penis america",
    "light_cleaned_title": "Multilateral banks debunk Indian government’s claims on growth rate",
    "light_cleaned_selftext": "The so-called theory of trickle-down effect projected by the government (high prosperity of the rich flows down to enhance the economic welfare of the poor) has been debunked by the data on the growing gap between the rich and the poor in the country, rising poverty, unemployment, and the perpetually rising prices.",
    "light_cleaned_comments": "That's how Reagan f#ucked middle class of US. MODI did same. Trickle down never worked. Ever. [50 years of tax cuts for the rich failed to trickle down, economics study says](https://www.cbsnews.com/news/tax-cuts-rich-50-years-no-trickle-down/) At this point I think everyone knows trickle down economics doesn’t work. But they’re pretending it does because they have a raging piss fetish. The tax duties, indeed, trickled down, to be fair. r/latestagecapitalism Trickle down works for making rich richer and it doesn't even hide the fact. A middle class person dreams of being richer than is peers and for that he looks to those much more wealthier than him. He hopes and dreams to be in their position and then horde more wealth so that his current peers may not achive what he has. For that he supports the whatever policies have made the rich richer. This is just engrained human physiology for now. Right wingers everywhere ruin economies. From Brazil to Philippines >Described as left-wing, [Lula da Silva's](https://en.m.wikipedia.org/wiki/Luiz_Inácio_Lula_da_Silva) first presidency, which coincided with the first pink tide in the region, was marked by the consolidation of social welfare programs such as Bolsa Família and Fome Zero, which propelled Brazil to leave the United Nations' Hunger Map. During his two terms in office, he undertook radical reforms in the country, which eventually led to growth in GDP, reduction in public debt and inflation, and helping 20 million Brazilians escape poverty. Poverty, inequality, illiteracy, unemployment, infant mortality, and child labor rates fell significantly, while the minimum wage and average income increased, and access to school, university, and health care was expanded. He also played a prominent role in foreign policy, both on a regional level (as part of the BRICS) and as part of global trade and environmental negotiations. And then came this prick Bolsonaro, and did what any right-wing fascist fuck ever did to a country. Brazilians has some intelligence to vote him out, and now his punk ass is hiding in Florida, the penis of America 🇺🇸"
}