{
    "id": "1gdi28s",
    "title": "Wakefit is a scam 💀",
    "url": "https://www.reddit.com/gallery/1gdi28s",
    "selftext": "I wanted to buy a comforter and wakefit had some good options. Since I didn't want to do the whole login thing on Wakefit's website, I ended up buying one of their comforter on Amazon. I decided to checkout some pillows and saw they're running a discount so I ended up logging in to their website and adding the same product in the cart (which I purchased on Amazon) to see if there's any price difference. Imagine to my surprise when the Amazon one still costs cheaper even after you add the discount coupon on their website. Apparently the discount coupon is worth 1,130 and 800 is waived off as \"shipping and Handling fee\"\n\nIs someone going to bring it to my address by walking all the way? 😭\n\nAin't this deceiving customers? ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1730054695.0,
    "convurl": "https://i.redd.it/dvozwtztgcxd1.jpg",
    "comments": [
        "This doesnt amount to deceiving, its a marketing strategy, thats all. It would be deceiving if they had sold something above MRP.",
        "No it’s no deceiving.",
        "Its price parity. Most D2C firms do this to bring traffic to a certain channel (Amazon here). Also Amazon category guys probably asked wakefit to keep the price lower on Az to drive more conversions. People do price matching all the time. \nSource: ex employee"
    ],
    "cleaned_text": "wakefit scam wanted buy comforter wakefit good options since didnt want whole login thing wakefits website ended buying one comforter amazon decided checkout pillows saw theyre running discount ended logging website adding product cart purchased amazon see theres price difference imagine surprise amazon one still costs cheaper even add discount coupon website apparently discount coupon worth waived shipping handling fee someone going bring address walking way aint deceiving customers ",
    "cleaned_title": "wakefit scam",
    "cleaned_selftext": "wanted buy comforter wakefit good options since didnt want whole login thing wakefits website ended buying one comforter amazon decided checkout pillows saw theyre running discount ended logging website adding product cart purchased amazon see theres price difference imagine surprise amazon one still costs cheaper even add discount coupon website apparently discount coupon worth waived shipping handling fee someone going bring address walking way aint deceiving customers",
    "cleaned_comments": "doesnt amount deceiving marketing strategy thats would deceiving sold something mrp deceiving price parity dc firms bring traffic certain channel amazon also amazon category guys probably asked wakefit keep price lower az drive conversions people price matching time source ex employee",
    "light_cleaned_title": "Wakefit is a scam 💀",
    "light_cleaned_selftext": "I wanted to buy a comforter and wakefit had some good options. Since I didn't want to do the whole login thing on Wakefit's website, I ended up buying one of their comforter on Amazon. I decided to checkout some pillows and saw they're running a discount so I ended up logging in to their website and adding the same product in the cart (which I purchased on Amazon) to see if there's any price difference. Imagine to my surprise when the Amazon one still costs cheaper even after you add the discount coupon on their website. Apparently the discount coupon is worth 1,130 and 800 is waived off as \"shipping and Handling fee\" Is someone going to bring it to my address by walking all the way? 😭 Ain't this deceiving customers?",
    "light_cleaned_comments": "This doesnt amount to deceiving, its a marketing strategy, thats all. It would be deceiving if they had sold something above MRP. No it’s no deceiving. Its price parity. Most D2C firms do this to bring traffic to a certain channel (Amazon here). Also Amazon category guys probably asked wakefit to keep the price lower on Az to drive more conversions. People do price matching all the time. Source: ex employee"
}