{
    "id": "14ycwv8",
    "title": "Hey, um, India, if I could just get a moment of your time, I'd like to ask: what the actual fuck?",
    "url": "https://timesofindia.indiatimes.com/india/why-hitler-is-not-a-dirty-word-in-india/articleshow/63955029.cms",
    "selftext": "Do we have to worry about ya'll genociding any time soon? Explain.",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1689229770.0,
    "convurl": "https://external-preview.redd.it/XEJ8wyJetcdW6rNhamQYjIcydvQ03u1ZF0Bw6ba3eKE.jpg?auto=webp&s=174a7204757f90184582865bb1d24cf174f50715",
    "comments": [
        "As a European holocaust historian and someone who has studied the Third Reich and Hitler I find this appalling. I have a feeling when I am in India one day I will be telling people the truth about him and WW2.  They are not living among its ruins and the chain of work and death camps like the people of Dachau, Saschenhausen or Oswieçim (Auschwitz);The others like Sobibor and Treblinka are in isolated places.\n\nIn fairness to the people of India, they are an entire world away and do have that emotional and rational disconnect to what happened and monsters like Hitler. \n\nEven just the first few pages of Mein Kampf are full of poison. \n\nAlso I ask people of India WTf? \n\nHitler was a great figure in many ways - he was a bum on the streets of Vienna for a number of years, born to an alcoholic and violent civil servant father and he then, for the first time in history, began a war which ripped Europe apart until 1989. \n\nOver here it is a lot more personal and hurtful for so many to be ignorant. For in his greatness, Hitler and the Nazis perfected for the first time in history - INDUSTRIALISED MASS MURDER. At their peak the Nazis were murdering over 14,348 bodies of yictims a day. Terrible things have happened in India I know. \n\nAnyone who wants to live in Europe (Inc the UK) really should learn about this out of respect for where they are starting their new lives. It's hard to get to know and appreciate a place if you know nothing of it's history or how it has come to be. I say this to all people who emigrate really."
    ],
    "cleaned_text": "hey um india could get moment time id like ask actual fuck worry yall genociding time soon explain ",
    "cleaned_title": "hey um india could get moment time id like ask actual fuck",
    "cleaned_selftext": "worry yall genociding time soon explain",
    "cleaned_comments": "european holocaust historian someone studied third reich hitler find appalling feeling india one day telling people truth ww living among ruins chain work death camps like people dachau saschenhausen oswieim auschwitzthe others like sobibor treblinka isolated places fairness people india entire world away emotional rational disconnect happened monsters like hitler even first pages mein kampf full poison also ask people india wtf hitler great figure many ways bum streets vienna number years born alcoholic violent civil servant father first time history began war ripped europe apart lot personal hurtful many ignorant greatness hitler nazis perfected first time history industrialised mass murder peak nazis murdering bodies yictims day terrible things happened india know anyone wants live europe inc uk really learn respect starting new lives hard get know appreciate place know nothing history come say people emigrate really",
    "light_cleaned_title": "Hey, um, India, if I could just get a moment of your time, I'd like to ask: what the actual fuck?",
    "light_cleaned_selftext": "Do we have to worry about ya'll genociding any time soon? Explain.",
    "light_cleaned_comments": "As a European holocaust historian and someone who has studied the Third Reich and Hitler I find this appalling. I have a feeling when I am in India one day I will be telling people the truth about him and WW2. They are not living among its ruins and the chain of work and death camps like the people of Dachau, Saschenhausen or Oswieçim (Auschwitz);The others like Sobibor and Treblinka are in isolated places. In fairness to the people of India, they are an entire world away and do have that emotional and rational disconnect to what happened and monsters like Hitler. Even just the first few pages of Mein Kampf are full of poison. Also I ask people of India WTf? Hitler was a great figure in many ways - he was a bum on the streets of Vienna for a number of years, born to an alcoholic and violent civil servant father and he then, for the first time in history, began a war which ripped Europe apart until 1989. Over here it is a lot more personal and hurtful for so many to be ignorant. For in his greatness, Hitler and the Nazis perfected for the first time in history - INDUSTRIALISED MASS MURDER. At their peak the Nazis were murdering over 14,348 bodies of yictims a day. Terrible things have happened in India I know. Anyone who wants to live in Europe (Inc the UK) really should learn about this out of respect for where they are starting their new lives. It's hard to get to know and appreciate a place if you know nothing of it's history or how it has come to be. I say this to all people who emigrate really."
}