{
    "id": "10hf829",
    "title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/10hf829/biweekly_movies_tv_shows_documentaries_podcasts/",
    "selftext": "So, what is r/India watching of late?\n\nWatched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy!\n\nThis is not just limited to Hollywood/Bollywood, nor to any particular language.\n\nFeel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch!\n\n**Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nhttps://preview.redd.it/e3cqi5nuw8n61.png?width=1487&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ae6b7a10fa3272821e9904431dab0b993b36aae7",
    "flair": "Scheduled",
    "score": 16,
    "num_comments": 31,
    "created_utc": 1674264611,
    "convurl": "https://b.thumbs.redditmedia.com/v5AfEVKIPJsaaj2jnRAOZHnpUPsb9SqrpruQlT8X49w.jpg",
    "comments": [
        "Mister Mummy movie is crap, do not watch.\n\nGenelia has become aunty but still acts like college student.",
        "I have started watching Trial by Fire. Finished about three episodes and it's pretty decent. I had no idea about the Uphaar Theatre tragedy so everything is new to me.",
        "If anyone is into anime, I can't recommend Bocchi the rock enough. It's great.",
        "I am watching a show called The Patient \nWatched 3 episodes and its really good \nSteve carrell's and Domhnall gleeson's role are so effective and its a perfect binge watch cause there are 10 episodes only with 20 minutes \nduration",
        "I feel it's just ok. Could have been better. I know the event itself was horrific but It's made overly sad and sometimes looks a bit fake and lacks good editing.",
        "been watching better call saul. I’m on S3 and i absolutely love it.\n\nwatched m3ghan, it was pretty typical movie.",
        "On my watchlist already!",
        "Watching Vidaathu Karuppu. Old (late 90s) but good one. It is a twisted story about faith, science and multiple personality disorder .\nWatch it on youtube.\nhttps://www.youtube.com/playlist?list=PLVNEvSiKsSruGI_f7GJgxAGsrFLDBuJHN",
        "Violent Night is a good movie.",
        "i found the movie funny and liked it. Dont lynch me now lol",
        "Saw Broker today in theatres. Koreeda is good as always. A treat to watch on the big screen.Beautiful story, gorgeous cinematography. 10/10 would recommend to everyone.\n\nWatching Mcmillions on Hotstar, very intriguing.\n\nJust started The Legend of Vox Machina season 2, it's so good I wish they released all the episodes  at once, it's agonizing to wait for episodes.",
        "BCS is a masterpiece. You're in for a treat!",
        "Mukundan Unni Associates is a cool watch for people who like dark comedies.",
        "I just watch THE LAST OF US and it's amazing ,i recommend it to all of you , excited for next episode tomorrow",
        "Watched nanpakal nerathu mayakam . Such a soothing and refreshing one",
        "Girl in the Basement (2021)\n\nBased on the infamous true story of Elisabeth Fritzl, who was locked up and abused for 24 years (from 1984 to 2008) by her father Josef in Amstetten (Austria).\n\nGood movie but not for the faint of heart mind you.\n\n&amp;#x200B;\n\nWould also recommend watching The Night Manager (2021) starring Tom Hiddleton (Loki) before the hotstar remake comes out.",
        "\"Empire\", a seasonal podcast with the first season about the British East India Company, their conquest of India, Freedom Struggle all the way till Independence. Hosted by historian William Dalrymple, probably the world authority on the East India Company and radio presenter Anita Anand.\n\nDefinitely check it out, getting Dalrymple's books and attending JLF is pretty much what got me into reading about Arts and Humanities.",
        "Gannibal on Hotstar.\n\nJapanese horror/thriller/mystery/suspense genres. Comfy immersive watch.",
        "Movie \"Room\" with Brie Larsson is also similar to the girl in the basement. Phenomenal movie. Told through the perspective of a child, so less grim, but will move you to tears",
        "Fauda season 4 ftw!",
        "Should I watch The Last of Us?",
        "Please do! Brilliant show",
        "It's one of the best dark comedies I have ever seen from India. It's so funny and immersive, never lets you get bored. \n\nAny people knowledgeable of malayalam cinema, can you suggest really good recent movies to watch but I don't wanna go back more than 10 years.",
        "depends on what you want to see\n\n- Jaya Jaya Jaya Hey\n- Pada\n- Nayattu\n- Rohrschach\n- Puzhu\n- Great Indian Kitchen\n- Kuruthi\n- Thallumaala\n\nThese are movies that I liked and they are from the last couple of years\n\nYou can check /r/MalayalamMovies",
        "Share the link for watching Girl in the Basement (2021). If it's not allowed to do so in the comments, DM me.",
        "Awesome anime. I can absolutely relate to the story.",
        "Fuck emmy for snubbing saul",
        "For me ending kinda sucked",
        "Definitely it is an amazing show based on 2 episodes i have seen \nFYI- The showrunner craig mizan is the one who was also the showrunner of Chernobyl"
    ],
    "cleaned_text": "biweekly movies tv shows documentaries amp podcasts discussion thread rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall ",
    "cleaned_title": "biweekly movies tv shows documentaries amp podcasts discussion thread",
    "cleaned_selftext": "rindia watching late watched premieres yesterday loved movie saw recently dying discuss discovered new series lately well space go crazy limited hollywoodbollywood particular language feel free share short films podcasts choice ask recommendations watch movies shows thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqmoviesthreaddiscussionamprestrictsronampsortnewamptall",
    "cleaned_comments": "mister mummy movie crap watch genelia become aunty still acts like college student started watching trial fire finished three episodes pretty decent idea uphaar theatre tragedy everything new anyone anime cant recommend bocchi rock enough great watching show called patient watched episodes really good steve carrells domhnall gleesons role effective perfect binge watch cause episodes minutes duration feel ok could better know event horrific made overly sad sometimes looks bit fake lacks good editing watching better call saul im absolutely love watched mghan pretty typical movie watchlist already watching vidaathu karuppu old late good one twisted story faith science multiple personality disorder watch youtube violent night good movie found movie funny liked dont lynch lol saw broker today theatres koreeda good always treat watch big screenbeautiful story gorgeous cinematography would recommend everyone watching mcmillions hotstar intriguing started legend vox machina season good wish released episodes agonizing wait episodes bcs masterpiece youre treat mukundan unni associates cool watch people like dark comedies watch last us amazing recommend excited next episode tomorrow watched nanpakal nerathu mayakam soothing refreshing one girl basement based infamous true story elisabeth fritzl locked abused years father josef amstetten austria good movie faint heart mind ampxb would also recommend watching night manager starring tom hiddleton loki hotstar remake comes empire seasonal podcast first season british east india company conquest india freedom struggle way till independence hosted historian william dalrymple probably world authority east india company radio presenter anita anand definitely check getting dalrymples books attending jlf pretty much got reading arts humanities gannibal hotstar japanese horrorthrillermysterysuspense genres comfy immersive watch movie room brie larsson also similar girl basement phenomenal movie told perspective child less grim move tears fauda season ftw watch last us please brilliant show one best dark comedies ever seen india funny immersive never lets get bored people knowledgeable malayalam cinema suggest really good recent movies watch dont wan na go back years depends want see jaya jaya jaya hey pada nayattu rohrschach puzhu great indian kitchen kuruthi thallumaala movies liked last couple years check rmalayalammovies share link watching girl basement allowed comments dm awesome anime absolutely relate story fuck emmy snubbing saul ending kinda sucked definitely amazing show based episodes seen fyi showrunner craig mizan one also showrunner chernobyl",
    "light_cleaned_title": "Bi-Weekly Movies, TV Shows, Documentaries &amp; Podcasts Discussion Thread",
    "light_cleaned_selftext": "So, what is r/India watching of late? Watched any premieres yesterday? Loved any movie that you saw recently and are dying to discuss it? Discovered any new series lately? Well, this is your space. Go crazy! This is not just limited to Hollywood/Bollywood, nor to any particular language. Feel free to share short films, or podcasts of your choice, too, and ask for recommendations for what to watch! **Movies and Shows Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Movies+thread+discussion+&amp;restrict_sr=on&amp;sort=new&amp;t=all)",
    "light_cleaned_comments": "Mister Mummy movie is crap, do not watch. Genelia has become aunty but still acts like college student. I have started watching Trial by Fire. Finished about three episodes and it's pretty decent. I had no idea about the Uphaar Theatre tragedy so everything is new to me. If anyone is into anime, I can't recommend Bocchi the rock enough. It's great. I am watching a show called The Patient Watched 3 episodes and its really good Steve carrell's and Domhnall gleeson's role are so effective and its a perfect binge watch cause there are 10 episodes only with 20 minutes duration I feel it's just ok. Could have been better. I know the event itself was horrific but It's made overly sad and sometimes looks a bit fake and lacks good editing. been watching better call saul. I’m on S3 and i absolutely love it. watched m3ghan, it was pretty typical movie. On my watchlist already! Watching Vidaathu Karuppu. Old (late 90s) but good one. It is a twisted story about faith, science and multiple personality disorder . Watch it on youtube. Violent Night is a good movie. i found the movie funny and liked it. Dont lynch me now lol Saw Broker today in theatres. Koreeda is good as always. A treat to watch on the big screen.Beautiful story, gorgeous cinematography. 10/10 would recommend to everyone. Watching Mcmillions on Hotstar, very intriguing. Just started The Legend of Vox Machina season 2, it's so good I wish they released all the episodes at once, it's agonizing to wait for episodes. BCS is a masterpiece. You're in for a treat! Mukundan Unni Associates is a cool watch for people who like dark comedies. I just watch THE LAST OF US and it's amazing ,i recommend it to all of you , excited for next episode tomorrow Watched nanpakal nerathu mayakam . Such a soothing and refreshing one Girl in the Basement (2021) Based on the infamous true story of Elisabeth Fritzl, who was locked up and abused for 24 years (from 1984 to 2008) by her father Josef in Amstetten (Austria). Good movie but not for the faint of heart mind you.  Would also recommend watching The Night Manager (2021) starring Tom Hiddleton (Loki) before the hotstar remake comes out. \"Empire\", a seasonal podcast with the first season about the British East India Company, their conquest of India, Freedom Struggle all the way till Independence. Hosted by historian William Dalrymple, probably the world authority on the East India Company and radio presenter Anita Anand. Definitely check it out, getting Dalrymple's books and attending JLF is pretty much what got me into reading about Arts and Humanities. Gannibal on Hotstar. Japanese horror/thriller/mystery/suspense genres. Comfy immersive watch. Movie \"Room\" with Brie Larsson is also similar to the girl in the basement. Phenomenal movie. Told through the perspective of a child, so less grim, but will move you to tears Fauda season 4 ftw! Should I watch The Last of Us? Please do! Brilliant show It's one of the best dark comedies I have ever seen from India. It's so funny and immersive, never lets you get bored. Any people knowledgeable of malayalam cinema, can you suggest really good recent movies to watch but I don't wanna go back more than 10 years. depends on what you want to see - Jaya Jaya Jaya Hey - Pada - Nayattu - Rohrschach - Puzhu - Great Indian Kitchen - Kuruthi - Thallumaala These are movies that I liked and they are from the last couple of years You can check /r/MalayalamMovies Share the link for watching Girl in the Basement (2021). If it's not allowed to do so in the comments, DM me. Awesome anime. I can absolutely relate to the story. Fuck emmy for snubbing saul For me ending kinda sucked Definitely it is an amazing show based on 2 episodes i have seen FYI- The showrunner craig mizan is the one who was also the showrunner of Chernobyl"
}