{
    "id": "15yfazk",
    "title": "Advice on route Delhi to Leh via Spiti Valley",
    "url": "https://www.reddit.com/r/india/comments/15yfazk/advice_on_route_delhi_to_leh_via_spiti_valley/",
    "selftext": "Hi, I'm visiting India in early September and will be riding a Royal Enfield Himalayan from Delhi to Leh via Spiti Valley.  I've ridden to Leh before from Manali via Rothang Pass and was wondering if anyone knows what the road condition is between Dehradun - Landour - and then taking the 507 to Naugaon and then the 707 to Mori and then on to Highway 5 to Reckong Peo and then joining up with Highway 3 all the way to Leh.\n\nHow is the monsoon this year? Are there likely to be landslides?  Here's some video I took when I was riding over the Rothang Pass back in 2009   [https://www.youtube.com/watch?v=4xERRyfHAqY](https://www.youtube.com/watch?v=4xERRyfHAqY)",
    "flair": "AskIndia",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1692731233.0,
    "convurl": "https://external-preview.redd.it/uP3Zz40vOaBGX45uLdPE4mNGqWcWpA0zc_frd6geoEY.jpg?auto=webp&s=0edf31cbcb8b4ccb167ee19e1c9c92f960b77d99",
    "comments": [
        "There's a Facebook group called Ladakh Return. You'd be better helped there with your questions.",
        "landslides happening, definitely check before visiting",
        "Thank you, I've asked to join that group.",
        "Thanks."
    ],
    "cleaned_text": "advice route delhi leh via spiti valley hi im visiting india early september riding royal enfield himalayan delhi leh via spiti valley ive ridden leh manali via rothang pass wondering anyone knows road condition dehradun landour taking naugaon mori highway reckong peo joining highway way leh monsoon year likely landslides heres video took riding rothang pass back httpswwwyoutubecomwatchvxerryfhaqyhttpswwwyoutubecomwatchvxerryfhaqy ",
    "cleaned_title": "advice route delhi leh via spiti valley",
    "cleaned_selftext": "hi im visiting india early september riding royal enfield himalayan delhi leh via spiti valley ive ridden leh manali via rothang pass wondering anyone knows road condition dehradun landour taking naugaon mori highway reckong peo joining highway way leh monsoon year likely landslides heres video took riding rothang pass back httpswwwyoutubecomwatchvxerryfhaqyhttpswwwyoutubecomwatchvxerryfhaqy",
    "cleaned_comments": "theres facebook group called ladakh return youd better helped questions landslides happening definitely check visiting thank ive asked join group thanks",
    "light_cleaned_title": "Advice on route Delhi to Leh via Spiti Valley",
    "light_cleaned_selftext": "Hi, I'm visiting India in early September and will be riding a Royal Enfield Himalayan from Delhi to Leh via Spiti Valley. I've ridden to Leh before from Manali via Rothang Pass and was wondering if anyone knows what the road condition is between Dehradun - Landour - and then taking the 507 to Naugaon and then the 707 to Mori and then on to Highway 5 to Reckong Peo and then joining up with Highway 3 all the way to Leh. How is the monsoon this year? Are there likely to be landslides? Here's some video I took when I was riding over the Rothang Pass back in 2009 [https://www.youtube.com/watch?v=4xERRyfHAqY](https://www.youtube.com/watch?v=4xERRyfHAqY)",
    "light_cleaned_comments": "There's a Facebook group called Ladakh Return. You'd be better helped there with your questions. landslides happening, definitely check before visiting Thank you, I've asked to join that group. Thanks."
}