{
    "id": "16r0iqy",
    "title": "Crocs Literide Strap broke within a year, Terrible after sales service",
    "url": "https://www.reddit.com/r/india/comments/16r0iqy/crocs_literide_strap_broke_within_a_year_terrible/",
    "selftext": "**Incident 1:** \n\nAbout 10 months ago, I purchased a pair of Crocs Literide clogs (costed me 5k), hoping for a comfortable and durable footwear option. The issue arose when, the strap on one of the shoes suddenly broke. I wfh and hardly step out or play out with this. And even if I do step out, i don't walk a lot.\n\nWhen I contacted the local store where I made the purchase, they directed me to contact Crocs customer care for assistance. So, I reached out to customer care, explaining my situation requesting a replacement strap, even if I had to pay for it. They simply brushed off my request, saying that this kind of issue \"happens\" and that they couldn't offer a refund or even a replacement strap. Sadly I couldn't find a compatible strap online / in local stores either.\n\n**Incident 2:** \n\nNow coming to quality of their products, my wife had also bought a pair of filp flops few months back. Yesterday, its Y strap broke at the center (the thong which goes between the fingers). Knowing them, I didn't bother to call their local outlet / customer care. A local shoe repair guy fixed it temporarily.\n\nI'm sharing this experience here not only to vent my frustration but also to warn others who may be considering purchasing Crocs products. This kind of product quality and customer service response is, in my opinion, unacceptable. For a product at this price, I honestly expected them to provide spare straps. Even a mobile phone bought for 3k provides better post sales service.\n\nPhotos - [https://imgur.com/a/c3tLe5i](https://imgur.com/a/c3tLe5i) ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695569410.0,
    "convurl": "https://external-preview.redd.it/oJoV_dalLsI8Vu3LugfnzDZRhU286lnQYdni_m6WKUY.jpg?auto=webp&s=6ad289e005a4373681c5c20b92385e5217253630",
    "comments": [
        "I purchased only one pair of crocs around 5 years ago. After I wore it out, I never purchased a second pair. Now I buy knock offs. They cost a tenth or even less compared to the original crocs and last just as long.",
        "My crocs worked for 5 years. They were still fine (sole worn out a little) and were in good condition to still use it. Dumped it only because my dog made bite marks in it.",
        "I had to give up on two pairs since I worn holes into the soles. The strap caused wounds and were irritating when wet. The holes let gravel get in. The black one got hotter than a boulder in the sun. \n\nWent back to mesh shoes, maybe a 3k power is as good as a 6k croc."
    ],
    "cleaned_text": "crocs literide strap broke within year terrible sales service incident months ago purchased pair crocs literide clogs costed k hoping comfortable durable footwear option issue arose strap one shoes suddenly broke wfh hardly step play even step dont walk lot contacted local store made purchase directed contact crocs customer care assistance reached customer care explaining situation requesting replacement strap even pay simply brushed request saying kind issue happens couldnt offer refund even replacement strap sadly couldnt find compatible strap online local stores either incident coming quality products wife also bought pair filp flops months back yesterday strap broke center thong goes fingers knowing didnt bother call local outlet customer care local shoe repair guy fixed temporarily im sharing experience vent frustration also warn others may considering purchasing crocs products kind product quality customer service response opinion unacceptable product price honestly expected provide spare straps even mobile phone bought k provides better post sales service photos httpsimgurcomactleihttpsimgurcomactlei ",
    "cleaned_title": "crocs literide strap broke within year terrible sales service",
    "cleaned_selftext": "incident months ago purchased pair crocs literide clogs costed k hoping comfortable durable footwear option issue arose strap one shoes suddenly broke wfh hardly step play even step dont walk lot contacted local store made purchase directed contact crocs customer care assistance reached customer care explaining situation requesting replacement strap even pay simply brushed request saying kind issue happens couldnt offer refund even replacement strap sadly couldnt find compatible strap online local stores either incident coming quality products wife also bought pair filp flops months back yesterday strap broke center thong goes fingers knowing didnt bother call local outlet customer care local shoe repair guy fixed temporarily im sharing experience vent frustration also warn others may considering purchasing crocs products kind product quality customer service response opinion unacceptable product price honestly expected provide spare straps even mobile phone bought k provides better post sales service photos httpsimgurcomactleihttpsimgurcomactlei",
    "cleaned_comments": "purchased one pair crocs around years ago wore never purchased second pair buy knock offs cost tenth even less compared original crocs last long crocs worked years still fine sole worn little good condition still use dumped dog made bite marks give two pairs since worn holes soles strap caused wounds irritating wet holes let gravel get black one got hotter boulder sun went back mesh shoes maybe k power good k croc",
    "light_cleaned_title": "Crocs Literide Strap broke within a year, Terrible after sales service",
    "light_cleaned_selftext": "**Incident 1:** About 10 months ago, I purchased a pair of Crocs Literide clogs (costed me 5k), hoping for a comfortable and durable footwear option. The issue arose when, the strap on one of the shoes suddenly broke. I wfh and hardly step out or play out with this. And even if I do step out, i don't walk a lot. When I contacted the local store where I made the purchase, they directed me to contact Crocs customer care for assistance. So, I reached out to customer care, explaining my situation requesting a replacement strap, even if I had to pay for it. They simply brushed off my request, saying that this kind of issue \"happens\" and that they couldn't offer a refund or even a replacement strap. Sadly I couldn't find a compatible strap online / in local stores either. **Incident 2:** Now coming to quality of their products, my wife had also bought a pair of filp flops few months back. Yesterday, its Y strap broke at the center (the thong which goes between the fingers). Knowing them, I didn't bother to call their local outlet / customer care. A local shoe repair guy fixed it temporarily. I'm sharing this experience here not only to vent my frustration but also to warn others who may be considering purchasing Crocs products. This kind of product quality and customer service response is, in my opinion, unacceptable. For a product at this price, I honestly expected them to provide spare straps. Even a mobile phone bought for 3k provides better post sales service. Photos - [https://imgur.com/a/c3tLe5i](https://imgur.com/a/c3tLe5i)",
    "light_cleaned_comments": "I purchased only one pair of crocs around 5 years ago. After I wore it out, I never purchased a second pair. Now I buy knock offs. They cost a tenth or even less compared to the original crocs and last just as long. My crocs worked for 5 years. They were still fine (sole worn out a little) and were in good condition to still use it. Dumped it only because my dog made bite marks in it. I had to give up on two pairs since I worn holes into the soles. The strap caused wounds and were irritating when wet. The holes let gravel get in. The black one got hotter than a boulder in the sun. Went back to mesh shoes, maybe a 3k power is as good as a 6k croc."
}