{
    "id": "176d30h",
    "title": "Student trying to keep his browser",
    "url": "https://www.reddit.com/r/india/comments/176d30h/student_trying_to_keep_his_browser/",
    "selftext": "Hi guys,  \nAs a student I'm not able to pay the subscription price for Sidekick pro. I used the free version for some time, but out of nowhere, I can't activate all of my sessions (only 2 of them). I really liked this feature, as it allows you to store different tabs together and replace windows/sessions very fast. Are there browsers with exactly the same functionality (so no workspaces that eat up your RAM)?  \nOr can you please use my link to download the Sidekick browser (I need 20 people to sign in after downloading to get it free for a lifetime)?  \n[https://join.meetsidekick.com/s92dv](https://join.meetsidekick.com/s92dv)\n\nThanks",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1697133298,
    "convurl": "https://external-preview.redd.it/pqU4MkXq6z9R7K-gjIjYFcpm7kv1r1fb9HuS7QU-UBo.jpg?auto=webp&s=5699b41e2189c320864248ce95dd0ae228debda2",
    "comments": [
        "Dont be so attached to specific technology. If you like it and see use in it then just buy it. Personally I dont see enough value in it to pay for it."
    ],
    "cleaned_text": "student trying keep browser hi guys student im able pay subscription price sidekick pro used free version time nowhere cant activate sessions really liked feature allows store different tabs together replace windowssessions fast browsers exactly functionality workspaces eat ram please use link download sidekick browser need people sign downloading get free lifetime httpsjoinmeetsidekickcomsdvhttpsjoinmeetsidekickcomsdv thanks ",
    "cleaned_title": "student trying keep browser",
    "cleaned_selftext": "hi guys student im able pay subscription price sidekick pro used free version time nowhere cant activate sessions really liked feature allows store different tabs together replace windowssessions fast browsers exactly functionality workspaces eat ram please use link download sidekick browser need people sign downloading get free lifetime httpsjoinmeetsidekickcomsdvhttpsjoinmeetsidekickcomsdv thanks",
    "cleaned_comments": "dont attached specific technology like see use buy personally dont see enough value pay",
    "light_cleaned_title": "Student trying to keep his browser",
    "light_cleaned_selftext": "Hi guys, As a student I'm not able to pay the subscription price for Sidekick pro. I used the free version for some time, but out of nowhere, I can't activate all of my sessions (only 2 of them). I really liked this feature, as it allows you to store different tabs together and replace windows/sessions very fast. Are there browsers with exactly the same functionality (so no workspaces that eat up your RAM)? Or can you please use my link to download the Sidekick browser (I need 20 people to sign in after downloading to get it free for a lifetime)? [https://join.meetsidekick.com/s92dv](https://join.meetsidekick.com/s92dv) Thanks",
    "light_cleaned_comments": "Dont be so attached to specific technology. If you like it and see use in it then just buy it. Personally I dont see enough value in it to pay for it."
}