{
    "id": "14fvvgj",
    "title": "'PM Modi's first press conference - two questions only'. What would the questions be?",
    "url": "https://www.livemint.com/news/india/pm-narendra-modis-us-visit-live-defence-critical-tech-on-agenda-joe-bidenelectionsusindia-11687223424905.html",
    "selftext": "\n\nIf you had the chance to ask these questions, what would be the two questions you asked? Wrong answers also accepted. \n\n\n---------------\n\n\n*From the Mint Article*\n\n\"In a rare press conference, Prime Minister Narendra Modi will take limited questions from journalists in the US following his speech alongside US President Joe Biden.\n\nAccording to The White House, \"They are likely to take questions from journalists. Normally each side takes two questions, but sometimes it can be one from each side. During the last Indian State Visit of former prime minister Manmohan Singh in November 2009, the two sides took one question each.\"\n\n\n----------------",
    "flair": "Politics",
    "score": 9,
    "num_comments": 17,
    "created_utc": 1687416430.0,
    "convurl": "https://external-preview.redd.it/SZ0llg8Waex_8h_vR0OJ32TiDl50Z665ikmogW3lxzo.jpg?auto=webp&v=enabled&s=ca38378f74c251899cec93e7c4845e6b8923b665",
    "comments": [
        "*prime minister do you like eating chocolate chocolate chip?*",
        "Its mango season",
        "India reporter: Would you like Adani to invest in USA? Also, did you request Elon Musk to launch Tesla in India so elites kids can buy it and flaunt in school?\n\nUSA reporter: Why are you on a state trip when one of your state, I think it's called MANIPUR burning ?",
        "The American reporters will most likely be muzzled from asking important questions too. I will be very surprised if something controversial is asked.",
        "1) Where dis you buy your yoga pants? 2) How much the the Indian Tax Payer pay for the massive Government Airplane? 3) Who does your hair?",
        "What do you think of Lab Grown Chicken?",
        "Lab grown chicken ⛔😤\n\nForeign mushrooms ☑️😍",
        "\"Moodizi langda khaate hain ya kesari\" 😂😂",
        "Well, he lit the fuse himself during the last elections to win them so... 🤷‍♀️🤷‍♀️",
        "Is it the US version of \"Melody itni chocolaty kyon hai\"? 🤔",
        "Yeah, very very unlikely. Also, not really sure if it will even happen",
        "Well Patanjali has opened a new clothing and hair style salon called \"Indie Fakeeri\" soon going to open a store in Times Square🥳✨",
        "https://youtu.be/400EGHmhBDk",
        "We need to hype this up. Thank you USA for Modi Interview.",
        "The joke is on the Indian Delegation,  those huge mushrooms were flown in express and direct from China..Sourced on AliBaba, delivery international via Amazon Express and locally via Skip The Dishes. ..\n."
    ],
    "cleaned_text": "pm modis first press conference two questions would questions chance ask questions would two questions asked wrong answers also accepted mint article rare press conference prime minister narendra modi take limited questions journalists us following speech alongside us president joe biden according white house likely take questions journalists normally side takes two questions sometimes one side last indian state visit former prime minister manmohan singh november two sides took one question ",
    "cleaned_title": "pm modis first press conference two questions would questions",
    "cleaned_selftext": "chance ask questions would two questions asked wrong answers also accepted mint article rare press conference prime minister narendra modi take limited questions journalists us following speech alongside us president joe biden according white house likely take questions journalists normally side takes two questions sometimes one side last indian state visit former prime minister manmohan singh november two sides took one question",
    "cleaned_comments": "prime minister like eating chocolate chocolate chip mango season india reporter would like adani invest usa also request elon musk launch tesla india elites kids buy flaunt school usa reporter state trip one state think called manipur burning american reporters likely muzzled asking important questions surprised something controversial asked dis buy yoga pants much indian tax payer pay massive government airplane hair think lab grown chicken lab grown chicken foreign mushrooms moodizi langda khaate hain ya kesari well lit fuse last elections win us version melody itni chocolaty kyon hai yeah unlikely also really sure even happen well patanjali opened new clothing hair style salon called indie fakeeri soon going open store times square need hype thank usa modi interview joke indian delegation huge mushrooms flown express direct chinasourced alibaba delivery international via amazon express locally via skip dishes",
    "light_cleaned_title": "'PM Modi's first press conference - two questions only'. What would the questions be?",
    "light_cleaned_selftext": "If you had the chance to ask these questions, what would be the two questions you asked? Wrong answers also accepted. --------------- *From the Mint Article* \"In a rare press conference, Prime Minister Narendra Modi will take limited questions from journalists in the US following his speech alongside US President Joe Biden. According to The White House, \"They are likely to take questions from journalists. Normally each side takes two questions, but sometimes it can be one from each side. During the last Indian State Visit of former prime minister Manmohan Singh in November 2009, the two sides took one question each.\" ----------------",
    "light_cleaned_comments": "*prime minister do you like eating chocolate chocolate chip?* Its mango season India reporter: Would you like Adani to invest in USA? Also, did you request Elon Musk to launch Tesla in India so elites kids can buy it and flaunt in school? USA reporter: Why are you on a state trip when one of your state, I think it's called MANIPUR burning ? The American reporters will most likely be muzzled from asking important questions too. I will be very surprised if something controversial is asked. 1) Where dis you buy your yoga pants? 2) How much the the Indian Tax Payer pay for the massive Government Airplane? 3) Who does your hair? What do you think of Lab Grown Chicken? Lab grown chicken ⛔😤 Foreign mushrooms ☑️😍 \"Moodizi langda khaate hain ya kesari\" 😂😂 Well, he lit the fuse himself during the last elections to win them so... 🤷‍♀️🤷‍♀️ Is it the US version of \"Melody itni chocolaty kyon hai\"? 🤔 Yeah, very very unlikely. Also, not really sure if it will even happen Well Patanjali has opened a new clothing and hair style salon called \"Indie Fakeeri\" soon going to open a store in Times Square🥳✨ We need to hype this up. Thank you USA for Modi Interview. The joke is on the Indian Delegation, those huge mushrooms were flown in express and direct from China..Sourced on AliBaba, delivery international via Amazon Express and locally via Skip The Dishes. .. ."
}