{
    "id": "16ozc4n",
    "title": "Police complaint against Assam CM for 'hate speech' against Sonia Gandhi",
    "url": "https://www.deccanherald.com/india/assam/police-complaint-against-assam-cm-for-hate-speech-against-sonia-gandhi-2695737",
    "selftext": "Senior Assam Congress leader Debabrata Saikia has filed a police complaint against Chief Minister Himanta Biswa Sarma for his alleged “hateful statement” such as Lok Sabha MP and former party president Sonia Gandhi’s residence should be burnt.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695351768.0,
    "convurl": "https://external-preview.redd.it/cF2dGsliJzEMaPvfzvtUe-n8tOp9v-S-B1IYzxM4fJ8.jpg?auto=webp&s=0891890e20a048cef8b906badd27073022fbe914",
    "comments": [
        ">“In a country governed by the rule of law, Sarma has taken electoral rhetoric to its ugliest form” and gave a “clear instigation towards violence and arson”, Saikia said. The Congress leader said that though the statement was made in Madhya Pradesh, it has been widely circulated over print, electronic and social media and it is accessible in Assam.",
        "> “While taunting Kamal Nath, a prominent member of the Indian National Congress, about his Hindu identity, Sarma has directly suggested that 10, Janpath should be burnt,”   \n\nHindus have to riot to prove their Hindu Identity?",
        "This guy is falling so low day by day just to prove loyalty to his new bosses."
    ],
    "cleaned_text": "police complaint assam cm hate speech sonia gandhi senior assam congress leader debabrata saikia filed police complaint chief minister himanta biswa sarma alleged hateful statement lok sabha mp former party president sonia gandhis residence burnt ",
    "cleaned_title": "police complaint assam cm hate speech sonia gandhi",
    "cleaned_selftext": "senior assam congress leader debabrata saikia filed police complaint chief minister himanta biswa sarma alleged hateful statement lok sabha mp former party president sonia gandhis residence burnt",
    "cleaned_comments": "country governed rule law sarma taken electoral rhetoric ugliest form gave clear instigation towards violence arson saikia said congress leader said though statement made madhya pradesh widely circulated print electronic social media accessible assam taunting kamal nath prominent member indian national congress hindu identity sarma directly suggested janpath burnt hindus riot prove hindu identity guy falling low day day prove loyalty new bosses",
    "light_cleaned_title": "Police complaint against Assam CM for 'hate speech' against Sonia Gandhi",
    "light_cleaned_selftext": "Senior Assam Congress leader Debabrata Saikia has filed a police complaint against Chief Minister Himanta Biswa Sarma for his alleged “hateful statement” such as Lok Sabha MP and former party president Sonia Gandhi’s residence should be burnt.",
    "light_cleaned_comments": ">“In a country governed by the rule of law, Sarma has taken electoral rhetoric to its ugliest form” and gave a “clear instigation towards violence and arson”, Saikia said. The Congress leader said that though the statement was made in Madhya Pradesh, it has been widely circulated over print, electronic and social media and it is accessible in Assam. > “While taunting Kamal Nath, a prominent member of the Indian National Congress, about his Hindu identity, Sarma has directly suggested that 10, Janpath should be burnt,” Hindus have to riot to prove their Hindu Identity? This guy is falling so low day by day just to prove loyalty to his new bosses."
}