{
    "id": "13cenn8",
    "title": "Is this some kind of spam ??",
    "url": "https://i.redd.it/n62bwbnmsrya1.jpg",
    "selftext": "Why are these random international callers giving missed calls on WhatsApp ?? Has anyone else received similar missed calls ??",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 7,
    "created_utc": 1683604520.0,
    "convurl": "https://i.redd.it/n62bwbnmsrya1.jpg",
    "comments": [
        "Yes i too have recieved WhatsApp calls but from Ethiopia (+251) , yours is from thailand",
        "yes its a scam",
        "i'm getting calls from Colombia, Russia",
        "Do not pick such calls. Govt just issued notice regarding scams.",
        "Initially, I thought some HR is trying to reach out to me. 🥲",
        "What would happen if we accidentally pick such calls?",
        "They hardly ring for one second. Even if the phone was in your hand, by the time you get a notification and read it the call is already disconnected. \n\nI don't think we are that quick answering an unknown international call, we tend to think for a moment. But even if you manage to pick up, I think they will disconnect \n\nI am sure they just want you to call them back."
    ],
    "cleaned_text": "kind spam random international callers giving missed calls whatsapp anyone else received similar missed calls ",
    "cleaned_title": "kind spam",
    "cleaned_selftext": "random international callers giving missed calls whatsapp anyone else received similar missed calls",
    "cleaned_comments": "yes recieved whatsapp calls ethiopia thailand yes scam im getting calls colombia russia pick calls govt issued notice regarding scams initially thought hr trying reach would happen accidentally pick calls hardly ring one second even phone hand time get notification read call already disconnected dont think quick answering unknown international call tend think moment even manage pick think disconnect sure want call back",
    "light_cleaned_title": "Is this some kind of spam ??",
    "light_cleaned_selftext": "Why are these random international callers giving missed calls on WhatsApp ?? Has anyone else received similar missed calls ??",
    "light_cleaned_comments": "Yes i too have recieved WhatsApp calls but from Ethiopia (+251) , yours is from thailand yes its a scam i'm getting calls from Colombia, Russia Do not pick such calls. Govt just issued notice regarding scams. Initially, I thought some HR is trying to reach out to me. 🥲 What would happen if we accidentally pick such calls? They hardly ring for one second. Even if the phone was in your hand, by the time you get a notification and read it the call is already disconnected. I don't think we are that quick answering an unknown international call, we tend to think for a moment. But even if you manage to pick up, I think they will disconnect I am sure they just want you to call them back."
}