{
    "id": "164ro1o",
    "title": "Vir Sanghvi in conversation with Shekhar Gupta on leadership in modern India: Off The Cuff",
    "url": "https://youtu.be/tTpaxgvCDSw?si=MBqhX_pmkwv8zraK",
    "selftext": "This is very informative but Vir didn’t ask any pointed questions. Shekhar is very knowledgeable and seems to be very well connected",
    "flair": "Politics",
    "score": 1,
    "num_comments": 3,
    "created_utc": 1693336984.0,
    "convurl": "https://external-preview.redd.it/J_LRVZWG5nZuCgjChaSmzOZLphk2p76zrVOks72xPlQ.jpg?auto=webp&s=bdda227d3d3a6d112c5b37ef0d2c5bd00b329614",
    "comments": [
        "Shekhar has a clear bias towards Modi. He almost reveres Modi for how Modi used the media in the past to become PM and now that he is now smart to use his power to sideline the same media\n\nMaybe since Shekhar grew up during emergency times, he is against Congress, which is fair but not going full vocal on how Modi dog whistles in driving the Hindutva agenda is mind boggling. Maybe there’s ED just around the corner trying to dig into AugustaLand deal where Shekhar’s name came up!! No, I don’t think Shekhar is corrupt but he has this weird bias towards Modi as a personality. He almost hero worships him without hero worshipping him",
        "Shekar is Sanghi-let. He just shows himself as a centrist but all centrists supportng current regime are nothing but Right-wingers. \n\nSanghvi is no less. Says some anti-bjp/ rss thing when its no biggie. Otherwise says some inconsequential. Fake centrist.",
        "I always give this example. Shekhar Gupta is one of the journalist who will discuss the advantage and disadvantages of genocide when its happening, pretending to be a centrist. People like this will suddenly become left leaning as soon as government changes. They're the worst of the journalist, even worst than likes of Arnab and Navika who are openly right winged,"
    ],
    "cleaned_text": "vir sanghvi conversation shekhar gupta leadership modern india cuff informative vir didnt ask pointed questions shekhar knowledgeable seems well connected ",
    "cleaned_title": "vir sanghvi conversation shekhar gupta leadership modern india cuff",
    "cleaned_selftext": "informative vir didnt ask pointed questions shekhar knowledgeable seems well connected",
    "cleaned_comments": "shekhar clear bias towards modi almost reveres modi modi used media past become pm smart use power sideline media maybe since shekhar grew emergency times congress fair going full vocal modi dog whistles driving hindutva agenda mind boggling maybe theres ed around corner trying dig augustaland deal shekhars name came dont think shekhar corrupt weird bias towards modi personality almost hero worships without hero worshipping shekar sanghilet shows centrist centrists supportng current regime nothing rightwingers sanghvi less says antibjp rss thing biggie otherwise says inconsequential fake centrist always give example shekhar gupta one journalist discuss advantage disadvantages genocide happening pretending centrist people like suddenly become left leaning soon government changes theyre worst journalist even worst likes arnab navika openly right winged",
    "light_cleaned_title": "Vir Sanghvi in conversation with Shekhar Gupta on leadership in modern India: Off The Cuff",
    "light_cleaned_selftext": "This is very informative but Vir didn’t ask any pointed questions. Shekhar is very knowledgeable and seems to be very well connected",
    "light_cleaned_comments": "Shekhar has a clear bias towards Modi. He almost reveres Modi for how Modi used the media in the past to become PM and now that he is now smart to use his power to sideline the same media Maybe since Shekhar grew up during emergency times, he is against Congress, which is fair but not going full vocal on how Modi dog whistles in driving the Hindutva agenda is mind boggling. Maybe there’s ED just around the corner trying to dig into AugustaLand deal where Shekhar’s name came up!! No, I don’t think Shekhar is corrupt but he has this weird bias towards Modi as a personality. He almost hero worships him without hero worshipping him Shekar is Sanghi-let. He just shows himself as a centrist but all centrists supportng current regime are nothing but Right-wingers. Sanghvi is no less. Says some anti-bjp/ rss thing when its no biggie. Otherwise says some inconsequential. Fake centrist. I always give this example. Shekhar Gupta is one of the journalist who will discuss the advantage and disadvantages of genocide when its happening, pretending to be a centrist. People like this will suddenly become left leaning as soon as government changes. They're the worst of the journalist, even worst than likes of Arnab and Navika who are openly right winged,"
}