{
    "id": "1e8f2td",
    "title": "Karnataka High Court quashes rape case against youth after allowing him to marry his ‘victim’ lover, who is also mother of his child - The Hindu",
    "url": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-quashes-rape-case-against-youth-after-allowing-him-to-marry-his-victim-lover-who-is-also-mother-of-his-child/article68426110.ece",
    "selftext": "The petitioner, a native of Mysuru, was arrested on the complaint lodged by the girl’s mother in February 2023, alleging that he had sexually assaulted her daughter. The girl’s mother at that time was against her daughter’s relationship with the petitioner, whose family was ready for their marriage. The petitioner was 21 and the girl was 16 years and nine months old when the complaint was lodged. \n",
    "flair": "Law & Courts",
    "score": 218,
    "num_comments": 29,
    "created_utc": 1721539806.0,
    "convurl": "https://external-preview.redd.it/3z67Mny4lnl2N0Bm4N4N_fdJPS0cos_bqH3ZX2ZZOxc.jpg?auto=webp&s=f35f18a5ed6b81caddc7134c106507bbed74809b",
    "comments": [
        "But it's that many rape cases are just the girl's parents lashing out against the boy's caste/religion/class or the girl's agency.",
        "Rape ko promote karne tareeqa bhut KEZUAL hai... But enough to prove k judge hone se bhi insaan ka inherent chutiapa kam nahi ho jata",
        "Exactly. I actually am in favor of the judgment, he took a real risky route to deliver justice. We should have a Romeo Juliet clause in our POCSO laws.",
        "I'm not sure it's that black and white. Is there any way to ensure that the girl consents to this union? We don't know",
        "That's what the news says. That the mother of the child who was against their 'relationship' filed the case. The chap was dumb, he shouldn't have had sex with the minor, it's a different matter altogether. But if they were actually in love, sending him to prison would be the worst injustice.",
        "My sir, the \"girl's mother\" was against the relationship. Your own post quotes this. And if the girl did file the case (not sure how she can if she's a minor) then she ClEarLY doesn't want to be with him but needs child support which he absolutely OWES her.",
        "I meant the girl by child, in the previous comment. Also, minors can file a criminal case.",
        "There should be a subject in school called Hilao101. It literally would prevent rape and sex thoughts of men go away\nBeen doing it since 15 years now I am 30 y old.. I am able to concentrate on career and money and travelling thanks to this.",
        "Pahle news padh le Carl Marx ke 14",
        "In this case if the guy was 21 and the girl was 16 - would that still not qualify as statuory rape? I dont know what the legal age of consent in India is.",
        "I'm for such clause but 21 and 16 is too large of an age gap. Three years age gap is acceptable. Five years is too much. At 16, you're in PUC. At 21, ideally, you've started working. That's a vast difference in maturity and economic power.",
        "Did I read that right? She can't consent wtf is this judgement?",
        "I don't think 21 & 16 come under whatever romeo and juliet you're thinking of.. This looks like statutory rape.",
        "They say she was in late 16s. Idk about boy. But at 21 very few start working annd most likely you are in late 3rd/early 4th year of UG. You are not barely allowed drink in certain states in that age. Yeah, it is gross. But idk if it as easy to convict as in other cases imo. I'm not qualified enough to discuss morality/legaility of this, but if both were \"consenting\" then is it a crime big enough call it rape and destroy the future? Judge decided it is not, and I think it is complicated enough that I leave it to the judge..",
        "The Protection of Children from Sexual Offences Act (POCSO), 2012 and the Indian Penal Code, 1860 both peg the age of consent at 18 years. This means that all persons under the age of 18 years are uniformly defined as children and the consent of any child, so defined, is deemed irrelevant in law. Damn I'm not from India but apparently I know the Indian legal code better than that judge.",
        "The Protection of Children from Sexual Offences Act (POCSO), 2012 and the Indian Penal Code, 1860 both peg the age of consent at 18 years. This means that all persons under the age of 18 years are uniformly defined as children and the consent of any child, so defined, is deemed irrelevant in law. Damn I'm not from India but apparently I know the Indian legal code better than that judge.",
        "This court recently said watching chil*d p**rn is not a crime\n\nIts so dumb. The statute literally says browsing chil*d p**rn, downloading that shit is illegal\n\nhttps://indiankanoon.org/doc/176300164/\n\nWhoever-\n(a)publishes or transmites or causes to be published or transmitted material in any electronic form which depicts children engaged in sexually esplicit act or conduct; or\n(b)creates text or digital images, **collects, seeks, browses, downloads,** advertises, promotes, exchanges or distributes material in any electronic form depicting children in obscene or indecent or sexually explicit manner; or\n(c)cultivates, entices or induces children to online relationship with one or more children for and on sexually explicit act or in a manner that may offend a reasonable adult on the computer resource; or\n(d)facilitates abusing children online, or\n(e)records in any electronic form own abuse or that of others pertaining to sexually explicit act with children,\nshall be punished on first conviction with imprisonment of either description for a term which may extend to five years and with fine which may extend to ten lakh rupees and in the event of second or subsequent conviction with imprisonment of either discription for a term which may extend to seven years and also with fine which may extend to ten lakh rupees:",
        "Yes it is. SHE WAS A MINOR. ik your heart hurts for that poor rapist but the law has to work how it has to work, this judgement sounds so wrong.",
        "Such clauses are not there because its easy to threaten someone into giving a compromise especially when rich and influential are involved",
        "Main to nahi hu Cark Max ka 14\n\nLekin tu zaroor kisi illiterate ka 14 hai, so tu padh le news\n\n>The petitioner was 21 and the girl was 16 years and nine months old when the complaint was lodged.",
        "The girl is a minor. It is statutory rape.",
        "What's the age of consent in karnataka?",
        "Don't some places have Romeo and Juliet laws? That is why I said it is not as straightforward when you deal with this around those are on either side of 18.",
        "The case is complicated.\n\nThe girl after turning 18, still wants to marry that guy.\n\nSo initially he was given bail for the Marriage and now the case has been quashed.\n\nThe judge has also said POSCO can be refilled if the guy abandons the marriage.\n\nI think the judgement is sound, the family is dependent on the guy for earning and as an adult the girl still loves him.",
        "No fuck it doesn't matter if a 30 grooms a 16 y. O minor and says \" I'll marry her later \" He wouldn't be let off will he? This is same , it is grooming. It's not \" Complicated \" , it's classic \" Grooming and rape \"",
        "oh looks like a rape complaint by a parent between two people of similar age....\n\n>reads the ages\n\nOh well",
        ">No fuck it doesn't matter if a 30 grooms a 16 y. O\n\nRomeo Juliet laws exist for a reason, maybe 21 is too old for that but usually if she is 16 and guy is like 19 he would not be prosecuted in many western countries.",
        "To tu kar le usse shadi aur pal le uske bacche ko. Ye love turned rape case hai.Judge ne best judgement dia hai. us bacche ko life me ek chance dia hai..",
        "Same as minor girl 😉 is not arrested when pregnant from even smaller minor like in tamil nadu 12 year was arrested for making 17 year girl pregnant. Milords and police have iq in country ",
        "so they let him go after a pedophile decided to marry a minor he raped and assaulted? India indeed is a fucked up shithole"
    ],
    "cleaned_text": "karnataka high court quashes rape case youth allowing marry victim lover also mother child hindu petitioner native mysuru arrested complaint lodged girls mother february alleging sexually assaulted daughter girls mother time daughters relationship petitioner whose family ready marriage petitioner girl years nine months old complaint lodged ",
    "cleaned_title": "karnataka high court quashes rape case youth allowing marry victim lover also mother child hindu",
    "cleaned_selftext": "petitioner native mysuru arrested complaint lodged girls mother february alleging sexually assaulted daughter girls mother time daughters relationship petitioner whose family ready marriage petitioner girl years nine months old complaint lodged",
    "cleaned_comments": "many rape cases girls parents lashing boys castereligionclass girls agency rape ko promote karne tareeqa bhut kezual hai enough prove k judge hone se bhi insaan ka inherent chutiapa kam nahi ho jata exactly actually favor judgment took real risky route deliver justice romeo juliet clause pocso laws im sure black white way ensure girl consents union dont know thats news says mother child relationship filed case chap dumb shouldnt sex minor different matter altogether actually love sending prison would worst injustice sir girls mother relationship post quotes girl file case sure shes minor clearly doesnt want needs child support absolutely owes meant girl child previous comment also minors file criminal case subject school called hilao literally would prevent rape sex thoughts men go away since years old able concentrate career money travelling thanks pahle news padh le carl marx ke case guy girl would still qualify statuory rape dont know legal age consent india im clause large age gap three years age gap acceptable five years much youre puc ideally youve started working thats vast difference maturity economic power read right cant consent wtf judgement dont think come whatever romeo juliet youre thinking looks like statutory rape say late idk boy start working annd likely late rdearly th year ug barely allowed drink certain states age yeah gross idk easy convict cases imo im qualified enough discuss moralitylegaility consenting crime big enough call rape destroy future judge decided think complicated enough leave judge protection children sexual offences act pocso indian penal code peg age consent years means persons age years uniformly defined children consent child defined deemed irrelevant law damn im india apparently know indian legal code better judge protection children sexual offences act pocso indian penal code peg age consent years means persons age years uniformly defined children consent child defined deemed irrelevant law damn im india apparently know indian legal code better judge court recently said watching child prn crime dumb statute literally says browsing child prn downloading shit illegal whoever apublishes transmites causes published transmitted material electronic form depicts children engaged sexually esplicit act conduct bcreates text digital images collects seeks browses downloads advertises promotes exchanges distributes material electronic form depicting children obscene indecent sexually explicit manner ccultivates entices induces children online relationship one children sexually explicit act manner may offend reasonable adult computer resource dfacilitates abusing children online erecords electronic form abuse others pertaining sexually explicit act children shall punished first conviction imprisonment either description term may extend five years fine may extend ten lakh rupees event second subsequent conviction imprisonment either discription term may extend seven years also fine may extend ten lakh rupees yes minor ik heart hurts poor rapist law work work judgement sounds wrong clauses easy threaten someone giving compromise especially rich influential involved main nahi hu cark max ka lekin tu zaroor kisi illiterate ka hai tu padh le news petitioner girl years nine months old complaint lodged girl minor statutory rape whats age consent karnataka dont places romeo juliet laws said straightforward deal around either side case complicated girl turning still wants marry guy initially given bail marriage case quashed judge also said posco refilled guy abandons marriage think judgement sound family dependent guy earning adult girl still loves fuck doesnt matter grooms minor says ill marry later wouldnt let grooming complicated classic grooming rape oh looks like rape complaint parent two people similar age reads ages oh well fuck doesnt matter grooms romeo juliet laws exist reason maybe old usually guy like would prosecuted many western countries tu kar le usse shadi aur pal le uske bacche ko ye love turned rape case haijudge ne best judgement dia hai us bacche ko life ek chance dia hai minor girl arrested pregnant even smaller minor like tamil nadu year arrested making year girl pregnant milords police iq country let go pedophile decided marry minor raped assaulted india indeed fucked shithole",
    "light_cleaned_title": "Karnataka High Court quashes rape case against youth after allowing him to marry his ‘victim’ lover, who is also mother of his child - The Hindu",
    "light_cleaned_selftext": "The petitioner, a native of Mysuru, was arrested on the complaint lodged by the girl’s mother in February 2023, alleging that he had sexually assaulted her daughter. The girl’s mother at that time was against her daughter’s relationship with the petitioner, whose family was ready for their marriage. The petitioner was 21 and the girl was 16 years and nine months old when the complaint was lodged.",
    "light_cleaned_comments": "But it's that many rape cases are just the girl's parents lashing out against the boy's caste/religion/class or the girl's agency. Rape ko promote karne tareeqa bhut KEZUAL hai... But enough to prove k judge hone se bhi insaan ka inherent chutiapa kam nahi ho jata Exactly. I actually am in favor of the judgment, he took a real risky route to deliver justice. We should have a Romeo Juliet clause in our POCSO laws. I'm not sure it's that black and white. Is there any way to ensure that the girl consents to this union? We don't know That's what the news says. That the mother of the child who was against their 'relationship' filed the case. The chap was dumb, he shouldn't have had sex with the minor, it's a different matter altogether. But if they were actually in love, sending him to prison would be the worst injustice. My sir, the \"girl's mother\" was against the relationship. Your own post quotes this. And if the girl did file the case (not sure how she can if she's a minor) then she ClEarLY doesn't want to be with him but needs child support which he absolutely OWES her. I meant the girl by child, in the previous comment. Also, minors can file a criminal case. There should be a subject in school called Hilao101. It literally would prevent rape and sex thoughts of men go away Been doing it since 15 years now I am 30 y old.. I am able to concentrate on career and money and travelling thanks to this. Pahle news padh le Carl Marx ke 14 In this case if the guy was 21 and the girl was 16 - would that still not qualify as statuory rape? I dont know what the legal age of consent in India is. I'm for such clause but 21 and 16 is too large of an age gap. Three years age gap is acceptable. Five years is too much. At 16, you're in PUC. At 21, ideally, you've started working. That's a vast difference in maturity and economic power. Did I read that right? She can't consent wtf is this judgement? I don't think 21 & 16 come under whatever romeo and juliet you're thinking of.. This looks like statutory rape. They say she was in late 16s. Idk about boy. But at 21 very few start working annd most likely you are in late 3rd/early 4th year of UG. You are not barely allowed drink in certain states in that age. Yeah, it is gross. But idk if it as easy to convict as in other cases imo. I'm not qualified enough to discuss morality/legaility of this, but if both were \"consenting\" then is it a crime big enough call it rape and destroy the future? Judge decided it is not, and I think it is complicated enough that I leave it to the judge.. The Protection of Children from Sexual Offences Act (POCSO), 2012 and the Indian Penal Code, 1860 both peg the age of consent at 18 years. This means that all persons under the age of 18 years are uniformly defined as children and the consent of any child, so defined, is deemed irrelevant in law. Damn I'm not from India but apparently I know the Indian legal code better than that judge. The Protection of Children from Sexual Offences Act (POCSO), 2012 and the Indian Penal Code, 1860 both peg the age of consent at 18 years. This means that all persons under the age of 18 years are uniformly defined as children and the consent of any child, so defined, is deemed irrelevant in law. Damn I'm not from India but apparently I know the Indian legal code better than that judge. This court recently said watching chil*d p**rn is not a crime Its so dumb. The statute literally says browsing chil*d p**rn, downloading that shit is illegal Whoever- (a)publishes or transmites or causes to be published or transmitted material in any electronic form which depicts children engaged in sexually esplicit act or conduct; or (b)creates text or digital images, **collects, seeks, browses, downloads,** advertises, promotes, exchanges or distributes material in any electronic form depicting children in obscene or indecent or sexually explicit manner; or (c)cultivates, entices or induces children to online relationship with one or more children for and on sexually explicit act or in a manner that may offend a reasonable adult on the computer resource; or (d)facilitates abusing children online, or (e)records in any electronic form own abuse or that of others pertaining to sexually explicit act with children, shall be punished on first conviction with imprisonment of either description for a term which may extend to five years and with fine which may extend to ten lakh rupees and in the event of second or subsequent conviction with imprisonment of either discription for a term which may extend to seven years and also with fine which may extend to ten lakh rupees: Yes it is. SHE WAS A MINOR. ik your heart hurts for that poor rapist but the law has to work how it has to work, this judgement sounds so wrong. Such clauses are not there because its easy to threaten someone into giving a compromise especially when rich and influential are involved Main to nahi hu Cark Max ka 14 Lekin tu zaroor kisi illiterate ka 14 hai, so tu padh le news >The petitioner was 21 and the girl was 16 years and nine months old when the complaint was lodged. The girl is a minor. It is statutory rape. What's the age of consent in karnataka? Don't some places have Romeo and Juliet laws? That is why I said it is not as straightforward when you deal with this around those are on either side of 18. The case is complicated. The girl after turning 18, still wants to marry that guy. So initially he was given bail for the Marriage and now the case has been quashed. The judge has also said POSCO can be refilled if the guy abandons the marriage. I think the judgement is sound, the family is dependent on the guy for earning and as an adult the girl still loves him. No fuck it doesn't matter if a 30 grooms a 16 y. O minor and says \" I'll marry her later \" He wouldn't be let off will he? This is same , it is grooming. It's not \" Complicated \" , it's classic \" Grooming and rape \" oh looks like a rape complaint by a parent between two people of similar age.... >reads the ages Oh well >No fuck it doesn't matter if a 30 grooms a 16 y. O Romeo Juliet laws exist for a reason, maybe 21 is too old for that but usually if she is 16 and guy is like 19 he would not be prosecuted in many western countries. To tu kar le usse shadi aur pal le uske bacche ko. Ye love turned rape case hai.Judge ne best judgement dia hai. us bacche ko life me ek chance dia hai.. Same as minor girl 😉 is not arrested when pregnant from even smaller minor like in tamil nadu 12 year was arrested for making 17 year girl pregnant. Milords and police have iq in country so they let him go after a pedophile decided to marry a minor he raped and assaulted? India indeed is a fucked up shithole"
}