{
    "id": "1he0qq6",
    "title": "Congratulating Tai for the win! ",
    "url": "https://i.redd.it/79chizg3rs6e1.png",
    "selftext": "If only they were put to good use... ",
    "flair": "Rant / Vent",
    "score": 12,
    "num_comments": 7,
    "created_utc": 1734174486.0,
    "convurl": "https://i.redd.it/79chizg3rs6e1.png",
    "comments": [
        "Did any politicians even praise him for winning?",
        "Now someone's vidhayak (MLA) uncle can add a new fortuner to his collection, and flex it on insta with the BJP flag to give sanghis boner.",
        "Oh yes.... Tamil Nadu and Andhra Pradesh CM congratulated him, only to steal credit. Now they're both fighting who Gukesh belongs to. Family Is Andhra, born and raised in Chennai. [Dumbasses](https://www.hindustantimes.com/india-news/gukeshs-historic-chess-win-sparks-rivalry-between-tamil-nadu-and-andhra-pradesh-101734073674660.html)",
        "Bro the concern is valid, but I believe you could have just cropped the picture or saved the picture in the device and re-uploaded it or you could have shared the post.",
        "Where is the fighting?",
        "bobby",
        "I wanted the comment to be part of the post. But would've had to edit the screenshot because of the ad which i didn't have the time for."
    ],
    "cleaned_text": "congratulating tai win put good use ",
    "cleaned_title": "congratulating tai win",
    "cleaned_selftext": "put good use",
    "cleaned_comments": "politicians even praise winning someones vidhayak mla uncle add new fortuner collection flex insta bjp flag give sanghis boner oh yes tamil nadu andhra pradesh cm congratulated steal credit theyre fighting gukesh belongs family andhra born raised chennai dumbasseshttpswwwhindustantimescomindianewsgukeshshistoricchesswinsparksrivalrybetweentamilnaduandandhrapradeshhtml bro concern valid believe could cropped picture saved picture device reuploaded could shared post fighting bobby wanted comment part post wouldve edit screenshot ad didnt time",
    "light_cleaned_title": "Congratulating Tai for the win!",
    "light_cleaned_selftext": "If only they were put to good use...",
    "light_cleaned_comments": "Did any politicians even praise him for winning? Now someone's vidhayak (MLA) uncle can add a new fortuner to his collection, and flex it on insta with the BJP flag to give sanghis boner. Oh yes.... Tamil Nadu and Andhra Pradesh CM congratulated him, only to steal credit. Now they're both fighting who Gukesh belongs to. Family Is Andhra, born and raised in Chennai. [Dumbasses](https://www.hindustantimes.com/india-news/gukeshs-historic-chess-win-sparks-rivalry-between-tamil-nadu-and-andhra-pradesh-101734073674660.html) Bro the concern is valid, but I believe you could have just cropped the picture or saved the picture in the device and re-uploaded it or you could have shared the post. Where is the fighting? bobby I wanted the comment to be part of the post. But would've had to edit the screenshot because of the ad which i didn't have the time for."
}