{
    "id": "1eaqqft",
    "title": "I do not think BJ Party considers Kerala to be part of the country anymore.",
    "url": "https://i.redd.it/zvvrefd0sded1.jpeg",
    "selftext": "It’s probably the only state that’s having to spend out its pocket for NH land acquisition. ",
    "flair": "Policy/Economy",
    "score": 104,
    "num_comments": 20,
    "created_utc": 1721789445.0,
    "convurl": "https://i.redd.it/zvvrefd0sded1.jpeg",
    "comments": [
        "What can you expect from the joker who called Kerala Somalia. The clown posse at the centre needs further lessons in all upcoming elections.\n\nAlso, as a Keralite, we elected that dipwick suresh gopi to parliament. Guy is a useless mfer.",
        "Wel atleast hopefully that would mark the last time they're gonna win in kerala",
        "Except bimaru, they don't see anything. Absolutely disgusting.",
        "I’m not very optimistic, they’ll do some communal engineering and Mallu mfers will vote for a Sanghi again.",
        "Since 2014, what's new here ?",
        "Punjab did not get a mention in the whole budget. Leave getting money 🤑",
        "That’s their major vote bank. What more can we expect?",
        "Good point. But I feel the govt is digging their own grave with this tax policies. If anything doesn't get malayalis angry it's basically coming for their wallets. Plus I've seen opinion about him change. My mom who had a pretty good opinion on him has now started losing respect.",
        "Try being west bengal lol",
        "and yet thirussur decided to give them 1 bjp mp////",
        "We’ve xerox copy fans in hiding, that’s new",
        "Lmao for us, even allotted money will be held back",
        "I just have to say......\n\nWait until Dandiya becomes an Olympic sport. My guess is 2032....",
        "At least he protested, people will feel like they have a voice. Here in Maharashtra, the leadership is completely silent."
    ],
    "cleaned_text": "think bj party considers kerala part country anymore probably state thats spend pocket nh land acquisition ",
    "cleaned_title": "think bj party considers kerala part country anymore",
    "cleaned_selftext": "probably state thats spend pocket nh land acquisition",
    "cleaned_comments": "expect joker called kerala somalia clown posse centre needs lessons upcoming elections also keralite elected dipwick suresh gopi parliament guy useless mfer wel atleast hopefully would mark last time theyre gon na win kerala except bimaru dont see anything absolutely disgusting im optimistic theyll communal engineering mallu mfers vote sanghi since whats new punjab get mention whole budget leave getting money thats major vote bank expect good point feel govt digging grave tax policies anything doesnt get malayalis angry basically coming wallets plus ive seen opinion change mom pretty good opinion started losing respect try west bengal lol yet thirussur decided give bjp mp weve xerox copy fans hiding thats new lmao us even allotted money held back say wait dandiya becomes olympic sport guess least protested people feel like voice maharashtra leadership completely silent",
    "light_cleaned_title": "I do not think BJ Party considers Kerala to be part of the country anymore.",
    "light_cleaned_selftext": "It’s probably the only state that’s having to spend out its pocket for NH land acquisition.",
    "light_cleaned_comments": "What can you expect from the joker who called Kerala Somalia. The clown posse at the centre needs further lessons in all upcoming elections. Also, as a Keralite, we elected that dipwick suresh gopi to parliament. Guy is a useless mfer. Wel atleast hopefully that would mark the last time they're gonna win in kerala Except bimaru, they don't see anything. Absolutely disgusting. I’m not very optimistic, they’ll do some communal engineering and Mallu mfers will vote for a Sanghi again. Since 2014, what's new here ? Punjab did not get a mention in the whole budget. Leave getting money 🤑 That’s their major vote bank. What more can we expect? Good point. But I feel the govt is digging their own grave with this tax policies. If anything doesn't get malayalis angry it's basically coming for their wallets. Plus I've seen opinion about him change. My mom who had a pretty good opinion on him has now started losing respect. Try being west bengal lol and yet thirussur decided to give them 1 bjp mp//// We’ve xerox copy fans in hiding, that’s new Lmao for us, even allotted money will be held back I just have to say...... Wait until Dandiya becomes an Olympic sport. My guess is 2032.... At least he protested, people will feel like they have a voice. Here in Maharashtra, the leadership is completely silent."
}