{
    "id": "1425026",
    "title": "Why do Indian Muslims always need to prove their patriotism ?",
    "url": "https://www.reddit.com/r/india/comments/1425026/why_do_indian_muslims_always_need_to_prove_their/",
    "selftext": "Want to have serious thoughts , why . There are good people and bad people from every religion .\n\n\nThere is one scene from “ [mulk](https://imgur.com/a/mmUzzkf)” movie .\n\nThis movie is way ahead and depicted the internal doing . \n\nLet me put you an example here . There is one person who does nothing but good to people and belongs from xyz religion . If we keep saying him , taunting him aat every stage , he will frustrated at one point and will say that “  अच्छा होकर क्या ही फ़ायदा , इससे अच्छा हम बुरे ही सही” । \n\nWhy can’t we change the perspective of people instead of creating unnecessary hate between two religions ? Don’t come with one saffron party or another palm tree party . Everyone is doing same , more or less . \n\n\nBut we citizens , even after having resources are so naive that we are getting brainwashed by these people who uses our emotions to fuel their political gains and agenda . \n\nDo god and religion really need a Superman? \n\nAnd my question still stands the same , why do one religion need to show you that they are patriotic?",
    "flair": "AskIndia",
    "score": 4,
    "num_comments": 22,
    "created_utc": 1686029470.0,
    "convurl": "https://external-preview.redd.it/eg14ODsBAeXeX0his53FR2du0CPtvs7tya9Fn9IfCUw.jpg?auto=webp&v=enabled&s=bdd84d3c633641710a4b88dab4b0ef3f5f1dc28a",
    "comments": [
        "If you keep attacking them and calling them anti-national/Pakistani and invoke their religious identity everywhere, it's a natural reaction for them to try to fit in by displaying their patriotism where possible.\n\nIt's sad but that's the reality. As a Hindu, I can talk about how shit my country is without raising eyebrows, but if a Muslim person does that, his allegiance is questioned.",
        "Because the majority of human beings are dumb and believe in simple narratives.",
        "Wait till you find out what has happened in Kashmir. The whole propaganda of stone pelters will become clear. Indians have completely lost humanity because even after so many years, we don't care about Kashmir, North east and other states of the country where people have become so used to atrocity that one should be grateful that you were not born there.\n\nThese people are labelled anti-nationalists by birth and randomly killed by the forces.",
        "sorry but can you mention the need for creation of Pakistan ? and who all voted for them?",
        "wait till you find out that the world is much more brutal than what you see in Kashmir and Eastern states.",
        "Source",
        "Muslim League and RSS pushed for it",
        "Username checks out\n\nNo country's army is killing their own citizens! Don't name the countries worse than us now to justify the killings just because you were fortunate enough to not be born as one of them.",
        "Pretty sure nobody will even read it because we like being ignorant and defensive, but here you go:\n\n[https://frontline.thehindu.com/the-nation/the-army-above-the-law/article10105947.ece](https://frontline.thehindu.com/the-nation/the-army-above-the-law/article10105947.ece)\n\n [https://thewire.in/rights/pathribal-supreme-court-army-encounter](https://thewire.in/rights/pathribal-supreme-court-army-encounter) \n\n[https://theprint.in/opinion/mod-protecting-army-in-nagaland-killings-gratifying-sit-acted-as-handmaiden-of-state-govt/1524710/](https://theprint.in/opinion/mod-protecting-army-in-nagaland-killings-gratifying-sit-acted-as-handmaiden-of-state-govt/1524710/)",
        "You are being slightly disingenuous here. I will be heavily downvoted but someone needs to say this. \n\nOnly one minority asked for a separate country. The 1946 elections were one of the most polarised elections in Indian history fought completely on religious grounds. Only one religious party was politically active pre independence. The ML leaders campaigned on the grounds that any Muslim who does not vote for Muslim League, will not be allowed to have a religious burial in Muslim cemeteries.  ([1946 elections](https://www.news18.com/amp/news/opinion/the-elections-of-1946-and-the-road-to-partition-7056181.html)). \n\nINC was helpless in stopping it because of its nature as a secular party. That is not to say that Congress did not have Muslims leaders, that is not at all the case. \nThe country was partitioned. And millions across both sides of the border were killed and millions more uprooted from their homes and culture. The new country kept waging wars and terror attacks on India again for religious causes (this is not the fault of Indian Muslims though)\n\nWhen Yakub Memon, a terrorist convicted for the 1993 bomb blasts was hanged, 15000 people turned up for his funeral in Mumbai in 2015. funeral arrangements for this terrorist were comparable to that for a VIP. ([Yakub Memon funeral](https://www.deccanherald.com/amp/content/492395/yakub-memon-buried-mumbai-cemetery.html) \n\nMuslims in India raise their voices in support of the global Ummah (beyond national borders) when matters sour in Israel- Palestine relations. This goes beyond national interests of India. \n([Source 1](https://www.thehindu.com/news/national/kerala/israel-palestine-conflict-muslim-organisations-in-kerala-urge-centre-to-intervene/article34584000.ece/amp/)\n[Source 2](https://indianexpress.com/article/india/kolkata-muslim-groups-hit-streets-against-israel-pms-visit-5030643/lite/) ) \n\nWhen religious interests take precedence over national interests, don’t blame the rest of the country when you are asked to prove your patriotism. \n\nDownvotes welcome. Thank you!\n\nETA: Does this mean that when any ordinary Muslim citizen complains about garbage or pollution or taxes in the country, we ask them to “go to Pakistan”? Hell no. This is absolutely abhorrent and incels who behave like this must be called out and punished under applicable laws.",
        "Two nation theory(?)",
        "You can't be more wrong on every point.\n\nSikhs demanded Khalistan, Christian tribals in North East ran separatist movements of their own. Not to forget the majority wanted a Hindu rashtra.\n\nWhat is your problem with Muslims raising their voice for Palestinian people? It's the right thing to do. It's the BJP supporters who licks Israeli boots out of spite. \n\nLakhs of Indian Hindus voted a terrorist to the parliament, so you don't have a leg to stand on. \n\nHindus have been putting their religious interest above the country as much if not more. So prove your patriotism first before questioning anyone else's.",
        "I specifically remember (90s) people lighting crackers in when Pak won against India and then claiming thumari team mein dam nahi hai..\n\nThen you have people like Tiger Memon, Dawood and Lateef gaslighting Indian cities. Possibly you have not witnessed 90s, an intense period of communal riots. Those who have will remain skeptical.\nThere are a lot of things that cannot be put on SM, you should speak with people who are above 40 of their experiences.",
        "The Khalistan movement gained mass popular appeal in the 1970s. The Northeast separatist movements (which are not religiously motivated) began in 1960s. Pleas produce a proof that there were any other religiously-motivated separatist movements in India before 1947. \n\nMajority wanted a Hindu rashtra? Source? \nThe INC was secular and till the last kept fighting for a United India. \n\nNo problem with Muslims raising a voice for human rights of Palestinians. Where is the same energy when human rights are being violated Ukraine? Why do human rights matter more than national interests only when it is Muslims being impacted? When did Muslims last raise their voice against Dalit emancipation in India? \n\nNo comments on Yakub funeral? Or the anti-Israeli minister protests? Or how the 1946 elections were religiously polarised? Since you mentioned all my points were wrong..\n\nETA: The Khalistan movement never got mainstream support among Indian Sikhs. It was and till today remains a fringe movement. The same cannot be said about the movement for Pakistan in the 1940s India.",
        "https://preview.redd.it/m9gkxiinpe4b1.jpeg?width=720&format=pjpg&auto=webp&v=enabled&s=af559e14b3ae9fdd0e50d3198c198c1924432b76\n\nBut sarr we are just supporting a team",
        "You are clearly ill informed of Indian history. Just check Wikipedia entries of Khalistan and Naga movements, both were active since before 1947. What other religion with any localized sizeable population is remaining.\n\nMajority as in Hindus. Hindu Mahasabha and RSS were working on Hindu Rashtra. Additionally while congress was ostensibly secular, a Hindu right faction existed within it which worked towards partition.\n\nPeople don't treat everyone as same. They treat those who share a commonbond better. Why is Europe more concerned about situation in Ukraine. Why are Tamil people more concerned about Sri Lankan Tamils.\n\nPlenty of Muslim activist work alongside Dalit activists.\n\nOkay, Yakub Memon took part in 93 blasts, and his funeral might have rankled you. But then did you pay any thought how a Muslim might have felt seeing Bal Thackrey's funeral? The 92 victims didn't even get any justice.\n\nI don't know what Israeli minister protest you are referring, but have no qualms about any of it.\n\nThe religious polarization wasn't unipolar.\n\nI am not sure how you define mainstream support or how you are quantifying it. Elaborate.",
        "> You are clearly ill informed of Indian history. Just check Wikipedia entries of Khalistan and Naga movements, both were active since before 1947.\n\nI did. Hence I am asking you for proof. The Wikipedia links clearly showed the dates I mentioned in my previous comments. \n\n> Majority as in Hindus. Hindu Mahasabha and RSS were working on Hindu Rashtra.\n\nThis is a blatant lie. Please check the 1946 elections link I provided above. INC was the single largest party with 58% of the seats, second largest was the Muslim League. There was no Hindu rashtra/ Hindu right faction that emerged as a political front-runner in this election. \n\n> Additionally while congress was ostensibly secular, a Hindu right faction existed within it which worked towards partition.\n\nPlease link sources. I am not accepting or denying this claim, just want to see a proof for this. \n\n> People don't treat everyone as same. They treat those who share a commonbond better. Why is Europe more concerned about situation in Ukraine. Why are Tamil people more concerned about Sri Lankan Tamils.\n\nSo your support for Palestinians has a reason which is tied to your religion? Exactly what I was trying to say earlier. Europe is concerned about Ukraine and this also aligns with their foreign policy. Indian Muslims view regarding Israel-Palestine doesn’t align with views of Indian state (neutrality). \n\n> Okay, Yakub Memon took part in 93 blasts, and his funeral might have rankled you. But then did you pay any thought how a Muslim might have felt seeing Bal Thackrey's funeral?\n\nAnd Bal Thackeray was convicted by the judiciary when exactly?\n\n> The 92 victims didn't even get any justice.\n\nAnd that’s why the popular support for the Yakub Memon funeral? \n\n\n> I don't know what Israeli minister protest you are referring, but have no qualms about any of it.\n\nLinked in my earlier comment. Benjamin Netanyahu. Of course you don’t, \n\n> The religious polarization wasn't unipolar.\n\nHow? Can you elaborate the exact state of events that led to the proclamation of the Two Nation Theory? \n\n> I am not sure how you define mainstream support or how you are quantifying it. Elaborate.\n\nMainstream support = mass support so much so that major leaders emerge from this movement, becomes a major election agenda and elections can be won/lost over this. Cases in point: Pakistan in 1946, Farmers’ Agitation a few years ago, Lokpal Bill which gave birth to AAP."
    ],
    "cleaned_text": "indian muslims always need prove patriotism want serious thoughts good people bad people every religion one scene mulkhttpsimgurcomammuzzkf movie movie way ahead depicted internal let put example one person nothing good people belongs xyz religion keep saying taunting aat every stage frustrated one point say cant change perspective people instead creating unnecessary hate two religions dont come one saffron party another palm tree party everyone less citizens even resources naive getting brainwashed people uses emotions fuel political gains agenda god religion really need superman question still stands one religion need show patriotic ",
    "cleaned_title": "indian muslims always need prove patriotism",
    "cleaned_selftext": "want serious thoughts good people bad people every religion one scene mulkhttpsimgurcomammuzzkf movie movie way ahead depicted internal let put example one person nothing good people belongs xyz religion keep saying taunting aat every stage frustrated one point say cant change perspective people instead creating unnecessary hate two religions dont come one saffron party another palm tree party everyone less citizens even resources naive getting brainwashed people uses emotions fuel political gains agenda god religion really need superman question still stands one religion need show patriotic",
    "cleaned_comments": "keep attacking calling antinationalpakistani invoke religious identity everywhere natural reaction try fit displaying patriotism possible sad thats reality hindu talk shit country without raising eyebrows muslim person allegiance questioned majority human beings dumb believe simple narratives wait till find happened kashmir whole propaganda stone pelters become clear indians completely lost humanity even many years dont care kashmir north east states country people become used atrocity one grateful born people labelled antinationalists birth randomly killed forces sorry mention need creation pakistan voted wait till find world much brutal see kashmir eastern states source muslim league rss pushed username checks countrys army killing citizens dont name countries worse us justify killings fortunate enough born one pretty sure nobody even read like ignorant defensive go httpsfrontlinethehinducomthenationthearmyabovethelawarticleecehttpsfrontlinethehinducomthenationthearmyabovethelawarticleece httpsthewireinrightspathribalsupremecourtarmyencounterhttpsthewireinrightspathribalsupremecourtarmyencounter httpstheprintinopinionmodprotectingarmyinnagalandkillingsgratifyingsitactedashandmaidenofstategovthttpstheprintinopinionmodprotectingarmyinnagalandkillingsgratifyingsitactedashandmaidenofstategovt slightly disingenuous heavily downvoted someone needs say one minority asked separate country elections one polarised elections indian history fought completely religious grounds one religious party politically active pre independence ml leaders campaigned grounds muslim vote muslim league allowed religious burial muslim cemeteries electionshttpswwwnewscomampnewsopiniontheelectionsofandtheroadtopartitionhtml inc helpless stopping nature secular party say congress muslims leaders case country partitioned millions across sides border killed millions uprooted homes culture new country kept waging wars terror attacks india religious causes fault indian muslims though yakub memon terrorist convicted bomb blasts hanged people turned funeral mumbai funeral arrangements terrorist comparable vip yakub memon funeralhttpswwwdeccanheraldcomampcontentyakubmemonburiedmumbaicemeteryhtml muslims india raise voices support global ummah beyond national borders matters sour israel palestine relations goes beyond national interests india source httpswwwthehinducomnewsnationalkeralaisraelpalestineconflictmuslimorganisationsinkeralaurgecentretointervenearticleeceamp source httpsindianexpresscomarticleindiakolkatamuslimgroupshitstreetsagainstisraelpmsvisitlite religious interests take precedence national interests dont blame rest country asked prove patriotism downvotes welcome thank eta mean ordinary muslim citizen complains garbage pollution taxes country ask go pakistan hell absolutely abhorrent incels behave like must called punished applicable laws two nation theory cant wrong every point sikhs demanded khalistan christian tribals north east ran separatist movements forget majority wanted hindu rashtra problem muslims raising voice palestinian people right thing bjp supporters licks israeli boots spite lakhs indian hindus voted terrorist parliament dont leg stand hindus putting religious interest country much prove patriotism first questioning anyone elses specifically remember people lighting crackers pak india claiming thumari team mein dam nahi hai people like tiger memon dawood lateef gaslighting indian cities possibly witnessed intense period communal riots remain skeptical lot things put sm speak people experiences khalistan movement gained mass popular appeal northeast separatist movements religiously motivated began pleas produce proof religiouslymotivated separatist movements india majority wanted hindu rashtra source inc secular till last kept fighting united india problem muslims raising voice human rights palestinians energy human rights violated ukraine human rights matter national interests muslims impacted muslims last raise voice dalit emancipation india comments yakub funeral antiisraeli minister protests elections religiously polarised since mentioned points wrong eta khalistan movement never got mainstream support among indian sikhs till today remains fringe movement said movement pakistan india sarr supporting team clearly ill informed indian history check wikipedia entries khalistan naga movements active since religion localized sizeable population remaining majority hindus hindu mahasabha rss working hindu rashtra additionally congress ostensibly secular hindu right faction existed within worked towards partition people dont treat everyone treat share commonbond better europe concerned situation ukraine tamil people concerned sri lankan tamils plenty muslim activist work alongside dalit activists okay yakub memon took part blasts funeral might rankled pay thought muslim might felt seeing bal thackreys funeral victims didnt even get justice dont know israeli minister protest referring qualms religious polarization wasnt unipolar sure define mainstream support quantifying elaborate clearly ill informed indian history check wikipedia entries khalistan naga movements active since hence asking proof wikipedia links clearly showed dates mentioned previous comments majority hindus hindu mahasabha rss working hindu rashtra blatant lie please check elections link provided inc single largest party seats second largest muslim league hindu rashtra hindu right faction emerged political frontrunner election additionally congress ostensibly secular hindu right faction existed within worked towards partition please link sources accepting denying claim want see proof people dont treat everyone treat share commonbond better europe concerned situation ukraine tamil people concerned sri lankan tamils support palestinians reason tied religion exactly trying say earlier europe concerned ukraine also aligns foreign policy indian muslims view regarding israelpalestine doesnt align views indian state neutrality okay yakub memon took part blasts funeral might rankled pay thought muslim might felt seeing bal thackreys funeral bal thackeray convicted judiciary exactly victims didnt even get justice thats popular support yakub memon funeral dont know israeli minister protest referring qualms linked earlier comment benjamin netanyahu course dont religious polarization wasnt unipolar elaborate exact state events led proclamation two nation theory sure define mainstream support quantifying elaborate mainstream support mass support much major leaders emerge movement becomes major election agenda elections wonlost cases point pakistan farmers agitation years ago lokpal bill gave birth aap",
    "light_cleaned_title": "Why do Indian Muslims always need to prove their patriotism ?",
    "light_cleaned_selftext": "Want to have serious thoughts , why . There are good people and bad people from every religion . There is one scene from “ [mulk](https://imgur.com/a/mmUzzkf)” movie . This movie is way ahead and depicted the internal doing . Let me put you an example here . There is one person who does nothing but good to people and belongs from xyz religion . If we keep saying him , taunting him aat every stage , he will frustrated at one point and will say that “ अच्छा होकर क्या ही फ़ायदा , इससे अच्छा हम बुरे ही सही” । Why can’t we change the perspective of people instead of creating unnecessary hate between two religions ? Don’t come with one saffron party or another palm tree party . Everyone is doing same , more or less . But we citizens , even after having resources are so naive that we are getting brainwashed by these people who uses our emotions to fuel their political gains and agenda . Do god and religion really need a Superman? And my question still stands the same , why do one religion need to show you that they are patriotic?",
    "light_cleaned_comments": "If you keep attacking them and calling them anti-national/Pakistani and invoke their religious identity everywhere, it's a natural reaction for them to try to fit in by displaying their patriotism where possible. It's sad but that's the reality. As a Hindu, I can talk about how shit my country is without raising eyebrows, but if a Muslim person does that, his allegiance is questioned. Because the majority of human beings are dumb and believe in simple narratives. Wait till you find out what has happened in Kashmir. The whole propaganda of stone pelters will become clear. Indians have completely lost humanity because even after so many years, we don't care about Kashmir, North east and other states of the country where people have become so used to atrocity that one should be grateful that you were not born there. These people are labelled anti-nationalists by birth and randomly killed by the forces. sorry but can you mention the need for creation of Pakistan ? and who all voted for them? wait till you find out that the world is much more brutal than what you see in Kashmir and Eastern states. Source Muslim League and RSS pushed for it Username checks out No country's army is killing their own citizens! Don't name the countries worse than us now to justify the killings just because you were fortunate enough to not be born as one of them. Pretty sure nobody will even read it because we like being ignorant and defensive, but here you go: [https://frontline.thehindu.com/the-nation/the-army-above-the-law/article10105947.ece](https://frontline.thehindu.com/the-nation/the-army-above-the-law/article10105947.ece) [https://thewire.in/rights/pathribal-supreme-court-army-encounter](https://thewire.in/rights/pathribal-supreme-court-army-encounter) [https://theprint.in/opinion/mod-protecting-army-in-nagaland-killings-gratifying-sit-acted-as-handmaiden-of-state-govt/1524710/](https://theprint.in/opinion/mod-protecting-army-in-nagaland-killings-gratifying-sit-acted-as-handmaiden-of-state-govt/1524710/) You are being slightly disingenuous here. I will be heavily downvoted but someone needs to say this. Only one minority asked for a separate country. The 1946 elections were one of the most polarised elections in Indian history fought completely on religious grounds. Only one religious party was politically active pre independence. The ML leaders campaigned on the grounds that any Muslim who does not vote for Muslim League, will not be allowed to have a religious burial in Muslim cemeteries. ([1946 elections](https://www.news18.com/amp/news/opinion/the-elections-of-1946-and-the-road-to-partition-7056181.html)). INC was helpless in stopping it because of its nature as a secular party. That is not to say that Congress did not have Muslims leaders, that is not at all the case. The country was partitioned. And millions across both sides of the border were killed and millions more uprooted from their homes and culture. The new country kept waging wars and terror attacks on India again for religious causes (this is not the fault of Indian Muslims though) When Yakub Memon, a terrorist convicted for the 1993 bomb blasts was hanged, 15000 people turned up for his funeral in Mumbai in 2015. funeral arrangements for this terrorist were comparable to that for a VIP. ([Yakub Memon funeral](https://www.deccanherald.com/amp/content/492395/yakub-memon-buried-mumbai-cemetery.html) Muslims in India raise their voices in support of the global Ummah (beyond national borders) when matters sour in Israel- Palestine relations. This goes beyond national interests of India. ([Source 1](https://www.thehindu.com/news/national/kerala/israel-palestine-conflict-muslim-organisations-in-kerala-urge-centre-to-intervene/article34584000.ece/amp/) [Source 2](https://indianexpress.com/article/india/kolkata-muslim-groups-hit-streets-against-israel-pms-visit-5030643/lite/) ) When religious interests take precedence over national interests, don’t blame the rest of the country when you are asked to prove your patriotism. Downvotes welcome. Thank you! ETA: Does this mean that when any ordinary Muslim citizen complains about garbage or pollution or taxes in the country, we ask them to “go to Pakistan”? Hell no. This is absolutely abhorrent and incels who behave like this must be called out and punished under applicable laws. Two nation theory(?) You can't be more wrong on every point. Sikhs demanded Khalistan, Christian tribals in North East ran separatist movements of their own. Not to forget the majority wanted a Hindu rashtra. What is your problem with Muslims raising their voice for Palestinian people? It's the right thing to do. It's the BJP supporters who licks Israeli boots out of spite. Lakhs of Indian Hindus voted a terrorist to the parliament, so you don't have a leg to stand on. Hindus have been putting their religious interest above the country as much if not more. So prove your patriotism first before questioning anyone else's. I specifically remember (90s) people lighting crackers in when Pak won against India and then claiming thumari team mein dam nahi hai.. Then you have people like Tiger Memon, Dawood and Lateef gaslighting Indian cities. Possibly you have not witnessed 90s, an intense period of communal riots. Those who have will remain skeptical. There are a lot of things that cannot be put on SM, you should speak with people who are above 40 of their experiences. The Khalistan movement gained mass popular appeal in the 1970s. The Northeast separatist movements (which are not religiously motivated) began in 1960s. Pleas produce a proof that there were any other religiously-motivated separatist movements in India before 1947. Majority wanted a Hindu rashtra? Source? The INC was secular and till the last kept fighting for a United India. No problem with Muslims raising a voice for human rights of Palestinians. Where is the same energy when human rights are being violated Ukraine? Why do human rights matter more than national interests only when it is Muslims being impacted? When did Muslims last raise their voice against Dalit emancipation in India? No comments on Yakub funeral? Or the anti-Israeli minister protests? Or how the 1946 elections were religiously polarised? Since you mentioned all my points were wrong.. ETA: The Khalistan movement never got mainstream support among Indian Sikhs. It was and till today remains a fringe movement. The same cannot be said about the movement for Pakistan in the 1940s India. But sarr we are just supporting a team You are clearly ill informed of Indian history. Just check Wikipedia entries of Khalistan and Naga movements, both were active since before 1947. What other religion with any localized sizeable population is remaining. Majority as in Hindus. Hindu Mahasabha and RSS were working on Hindu Rashtra. Additionally while congress was ostensibly secular, a Hindu right faction existed within it which worked towards partition. People don't treat everyone as same. They treat those who share a commonbond better. Why is Europe more concerned about situation in Ukraine. Why are Tamil people more concerned about Sri Lankan Tamils. Plenty of Muslim activist work alongside Dalit activists. Okay, Yakub Memon took part in 93 blasts, and his funeral might have rankled you. But then did you pay any thought how a Muslim might have felt seeing Bal Thackrey's funeral? The 92 victims didn't even get any justice. I don't know what Israeli minister protest you are referring, but have no qualms about any of it. The religious polarization wasn't unipolar. I am not sure how you define mainstream support or how you are quantifying it. Elaborate. > You are clearly ill informed of Indian history. Just check Wikipedia entries of Khalistan and Naga movements, both were active since before 1947. I did. Hence I am asking you for proof. The Wikipedia links clearly showed the dates I mentioned in my previous comments. > Majority as in Hindus. Hindu Mahasabha and RSS were working on Hindu Rashtra. This is a blatant lie. Please check the 1946 elections link I provided above. INC was the single largest party with 58% of the seats, second largest was the Muslim League. There was no Hindu rashtra/ Hindu right faction that emerged as a political front-runner in this election. > Additionally while congress was ostensibly secular, a Hindu right faction existed within it which worked towards partition. Please link sources. I am not accepting or denying this claim, just want to see a proof for this. > People don't treat everyone as same. They treat those who share a commonbond better. Why is Europe more concerned about situation in Ukraine. Why are Tamil people more concerned about Sri Lankan Tamils. So your support for Palestinians has a reason which is tied to your religion? Exactly what I was trying to say earlier. Europe is concerned about Ukraine and this also aligns with their foreign policy. Indian Muslims view regarding Israel-Palestine doesn’t align with views of Indian state (neutrality). > Okay, Yakub Memon took part in 93 blasts, and his funeral might have rankled you. But then did you pay any thought how a Muslim might have felt seeing Bal Thackrey's funeral? And Bal Thackeray was convicted by the judiciary when exactly? > The 92 victims didn't even get any justice. And that’s why the popular support for the Yakub Memon funeral? > I don't know what Israeli minister protest you are referring, but have no qualms about any of it. Linked in my earlier comment. Benjamin Netanyahu. Of course you don’t, > The religious polarization wasn't unipolar. How? Can you elaborate the exact state of events that led to the proclamation of the Two Nation Theory? > I am not sure how you define mainstream support or how you are quantifying it. Elaborate. Mainstream support = mass support so much so that major leaders emerge from this movement, becomes a major election agenda and elections can be won/lost over this. Cases in point: Pakistan in 1946, Farmers’ Agitation a few years ago, Lokpal Bill which gave birth to AAP."
}