{
    "id": "1gi13s9",
    "title": "Lenskart has gone downhill - Never ordering again. ",
    "url": "https://www.reddit.com/gallery/1gi13s9",
    "selftext": "I've been a repeat customer with Lenskart for a while now. I know their lens quality isn't great, but I wear my specs all the time, and they’re one of the only places with rimless frames I like. But seriously, this company has gone to absolute garbage over the past couple of years.\n\nTo start, let’s talk about their so-called \"premium\" soft green cases. It's a scam, plain and simple. They’re more like flimsy wallets than cases. Just the tiniest pinch, and my specs are damaged. What are they thinking? It’s like they designed it specifically to make you need another order sooner.\n\nAnd don’t even get me started on their \"Owndays\" line, which they’re hyping up as some premium Japanese brand. Turns out, it’s basically just a rebadged version of John Jacobs. I mean, what kind of rebranding nonsense is that? I recently placed three orders, and I’ve had to return every single one of them.\n\nI’m done. I’m never going to order from Lenskart again\n\n",
    "flair": "Rant / Vent",
    "score": 80,
    "num_comments": 47,
    "created_utc": 1730567082.0,
    "convurl": "https://i.redd.it/mvbetezesiyd1.jpg",
    "comments": [
        "Lenskart is one of the shittiest companies out there that gets away with a lot of shady stuff. Once you see past the facade, it's all a huge pile of shit. Here's to name a few:\n\n1. The other day I wanted to get myself a new pair of glasses so I installed the app. As soon as I opened the app, it showed me a  full screen ad to buy lenskart gold for 500 rupees. It said that on purchase of lenskart premium, I'll be entitled to 4 benefits, with free quarterly repairs and maintenance being one of them. I remembered that I had a coupon for a 1 year gold membership. The moment I entered the coupon code and got the membership for free, guess what? I now get only three benefits. No more free quarterly maintenance and repairs. And honestly, without it, it's not even worth it to get a gold membership. To add insult to injury, among the list of charges is a 49 rupees delivery fee. A 49 rupees delivery fee to deliver a confirmation email to my mail. I mean wtf!\n\n2. The gold membership itself is a scam. There's no such thing as a buy one get one free. Search for a product on lenskart, find it's product code and search for the same product on Amazon using the code. You'll get it at half the price on amazon (sometimes even less than half). The fucking audacity to charge the customer I'm order to sell him more stuff!\n\n3. The only other benefit you get with gold is free eye checkup at stores or in home. And honestly, how many times would you get your eyesight checked in a year for the 500 rupees membership to make sense?\n\nAt this point, the only reason why people aren't questioning this is because most of us get free gold memberships through coupons. But that doesn't mean everyone gets a free membership coupon. Even if 1 percent of lenskart's gold members pay for the membership, it's still a huge sum of money.",
        "What's a good eyewear brand then? I have always used lenskart but they seem to not last more thana year. Since i anyway change frames frequently i didn't mind.",
        "Idk if you have ever bought from local eyewear places, but I saw your last line that you had to return them. Guess what? The local places never allowed return. And often what you got might be flimsy quality.",
        "Try titan eye.",
        "Titan Eye Plus is good.",
        "Yes.\nThey have variety and even branded glasses.",
        "I have John & Jacobs glasses. Bought them from Lenskart. The frame, glasses are yellowed after 1 year of use.",
        "Strange. I bought two pairs from them in 2022. They’ve both held up very nicely. One of them I wear every day for several hours a day.",
        "All these franchisee businesses sell low quality products for high markups i.e. Lenskart, Titan Eye, Cleardekho etc. These companies sells disposable grade products, and eyewear isn't a disposable item. If you want to get actual good quality products. You need to visit good opticians, and buy quality products from eyewear brands that actively work on improving vision. Also, always invest in a good pair of lenses over frames. If you need any assistance, feel free to get back.",
        "Anything you see on Lenskart has zero credibility as they're all made-up names, mass produced in China. Ownsday, John Jacobs, etc. None of them are \"real\" brands. It's all made-up by Lenskart themselves, and create a sense of choices for their customers. But, it means nothing. At the end of the day, they're all low quality disposal grade products.",
        "Titan is much better",
        "Who uses Lenskart? Normal footpath shops are a better place for glasses than Lenskart.\n\nTaitan is the minimum you should go for if you value your eyes.",
        "Downhill? Well, when was it uphill for that matter? Third grade frame and lenses from China, and discount laden strategy???",
        "I bought Lenskart glasses two years back and bought one for my mom one year back.\n\nBoth of us got our eyes weaker and started to have issues with the lens.\n\nWe later switched back to our nearest local optical shop and literally both of us are now in our comfort zone.\n\nI got same feedback from my friends who warned me not to buy from them",
        ">find it's product code and search for the same product on Amazon using the code.\n\nI don't think that is possible.",
        "I had got a glass and frame in 2017 and its still as good as it was thay day. Only I had to replace the box as it was broken bcz I sat on that accidently.\n\nIf this is the situation now what you are showing, It surely is freefall.",
        "First and last time customer of Lenskart. Both pair lasted about a year and half. The frame broke while in my face. 🤔 It was possibly brought for a dollar in China. \n\nGot a replacement from the dollar store in Canada for 3 CAD. (159 Rupees) It has lasted me 2 years! And ongoing.",
        "Lenskart was always mediocre.",
        "In Singapore, I have known (not used ) Owndays as a budget brand that had online and brick and mortar shops. Considering the extremely high markup in eyewear industry the budget brands are welcome. \n\nI looked up and saw that Owndays has been acquired by Lenskart.\n\nAbout 7-8 years ago I had ordered quite a few eye glasses from Lenskart. All of them broke with a few months ...to maybe a year or a bit more. One power sunglass broke within 4 months of use, right there on my face. The typical failure profile was a clean break across the rim of one of the lenses.\n\nSince then I have steered clear of Lenskart. Their main business model is to increase their top line by forcing you to buy 2. It's a good model if you consider the large demographic to whom fashion matters and you have two pairs instead of one. Also many people prefer to have a spare, just in case. The only and biggest problem is that startups like these are mostly on expansion spree and don't care about the shit quality. Membership is another trap. Advertising and TV programs help their marketing. It is a fallacy to think that an economically successful companies will always providing the best price or the highest quality for the consumer. It is possible to provide much better quality at the prices they charge. They just won't.",
        "https://preview.redd.it/9ig9i9eg7lyd1.jpeg?width=1587&format=pjpg&auto=webp&s=707b5610c5a39e534a1ca0eb54105d34f6773f2b\n\nHere you go. And yeah you're right. It's not the product code it's the model number. My bad.",
        "I’m not sure if it was just a one-time issue, but the frame I got from Titan had problems back in 2017. I had to visit the store multiple times, though the service was great. Eventually, I tried Lenskart, which offered a BOGO deal and had good frames at the time. Now, I might consider switching back to Titan Eye Plus.",
        "Piyush Bansal seems to be using every possible tactic to boost sales and revenue, and it appears the company can get away with it due to limited alternatives. In India, with a steady stream of first-time buyers, the company could continue for years without reconsidering its approach.",
        "Totally agreed. I believe lack of alternatives at such price points is the key for its survival till now.",
        "Hey, even Toyota gives you better service when they slap their badge on a Maruti! But with Lenskart? Nope—still the same old lousy service, just with extra “flair.”",
        "Stopped buying from them 10 years ago. Always prefer Titan eye or gkb optical",
        "Luxotica.",
        "True. My parents got specs made from local shops.\n\nThe ones I returned costed 7.2k for 2 frame + basic lens + photochromatic coating. \nI don't know if the prices are justified considering the low quality of lens, frames and coating. I expect better from a company that is valued in billions. \n\nOnly the lack of alternatives and study first time buyers is keeping the show going for lenskart.",
        "I have got specs done from Titan eye plus, vision express before in 2015 to 2017. Lenskart then had better quality than now. Bought into BOGO sales. Lenskart made us change specs more often from these sales.",
        "Lenskart seems eager for us to order constantly—whether it’s because the specs don’t last or thanks to their BOGO (or should I say, “bogus”) sales!",
        "I can second that. I also got specs in 2017 from Lenskart. Used them for 3 years, had to change because of change in power. \n\nFrom then on never really got the same quality. Frames/lens break within a year. Their moto has become to make us order more and often by giving shitty quality with BOGO and discount sale.",
        "You can't buy powered stuff on Amazon. If you just need regular sunglasses you can buy from literally anywhere",
        "I have been using Lenskart pretty much since 2013-14. I have never faced issues regarding bad quality, all my glasses last for many years. I change only when there is some paint chip off etc. They are far better than local stores. Titan etc is better quality but much costlier.",
        "I somewhat agree with you. It is one of the factors. Quality optical lenses used to be expensive, but that's not the case anymore. Now, brands have introduced many budget-friendly options without compromising on quality. Also, the lack of knowledge, and awareness among the customers is another reason. I don't blame them though. It's an optician's responsibility to guide its customers properly, but most of the optical stores lack knowledge themselves. People also tend to treat a lens as just a lens. But, that is not the case. A LOT of tech and R&D goes into manufacturing quality lenses. It's actually amazing how your vision can differ because of the lens, and the way it is mapped despite of the having the same prescription.",
        "Yes, unfortunately.",
        "Go for titan, they dont even charge for cleaning (even after the warranty goes off),knowledgeable staff. Con- quite expensive",
        "If possible opt for store pickup. You can check your pair before leaving",
        "Tital eye plus is way better, i do feel like options are limited sometimes but whatever they have is absolutely top notch quality.",
        "Its like boat. Made in China, labelled in India. But in the case of glasses chinese made ones are still a better alternative than Luxotica monopoly,*as long as they* are priced right, which lenskart absolutely doesn't.",
        "it might be for people like me who have to wear glasses every second of the day except sleeping. My frames dont last more than 1 and half year.",
        "Ther is an actual japanese brand owndays which i guess sold trademark to lenskart.\n\nTheir specs used to be awesome. Especially the lens and would prepare the specs in 20 minutes.\n\nI still am using my owndays specs after 5 years I guess.",
        "Now it's majorly owned by lenskart and you know what happens when lenskart is calling shots. Twice, lens were cracked out of the box. They are just rebadging John Jacobs designs. Nothing Japanese about it anymore.",
        "I assume it's due to poor quality coating of lens.",
        "It was bad since the begining",
        "dont know man may this is a rare issue i have around 5-7 glasses from lenskart all have best cases. one time i even got refund of the total amount as they did not deliver in time. I even get my specs cleaned using some machine for free. \n\nI do agree that their pricing has become worse these days.",
        "After my first purchase from them five years ago, I decided I will only resort to local vendors for selecting my spectacles. VFM products and I can try them out physically.",
        "From 2017 I have ordered atleast 3 times for myself and more than 5 times for others. Never has the  quality and service been so low.",
        "Never ordered from local shops for myself. How much does it cost for <2 power, photochromatic coating and a decent frame? Thinking for going local for my next purchase.",
        "Not so bad at first. They did relieve us from come tomorrow attitude.",
        "It depends from vendor to vendor. I'm unable to comment how much will it cost, but give it a shot! I'm pretty sure you won't regret it.",
        "try complaining to lenskart via mail. May be they can compensate and resolve the issue and other dont get this bad quality.",
        "I meant the price for quality. I found it too expensive.",
        "I already did that. For the case they said, for John Jacobs and Owndays hard case has been replaced with soft case for convenience of carrying around. It seems lenskart values convenience of carrying around over safety for such a fragile thing. Damn. \n\nAs for the quality they said you can return within 14 days. Classic.",
        "True. It seems lens only costs about 50 bucks to make. Hence they allow you to return even if it's custom made. They will just discard it.",
        "I agree"
    ],
    "cleaned_text": "lenskart gone downhill never ordering ive repeat customer lenskart know lens quality isnt great wear specs time theyre one places rimless frames like seriously company gone absolute garbage past couple years start lets talk socalled premium soft green cases scam plain simple theyre like flimsy wallets cases tiniest pinch specs damaged thinking like designed specifically make need another order sooner dont even get started owndays line theyre hyping premium japanese brand turns basically rebadged version john jacobs mean kind rebranding nonsense recently placed three orders ive return every single one im done im never going order lenskart ",
    "cleaned_title": "lenskart gone downhill never ordering",
    "cleaned_selftext": "ive repeat customer lenskart know lens quality isnt great wear specs time theyre one places rimless frames like seriously company gone absolute garbage past couple years start lets talk socalled premium soft green cases scam plain simple theyre like flimsy wallets cases tiniest pinch specs damaged thinking like designed specifically make need another order sooner dont even get started owndays line theyre hyping premium japanese brand turns basically rebadged version john jacobs mean kind rebranding nonsense recently placed three orders ive return every single one im done im never going order lenskart",
    "cleaned_comments": "lenskart one shittiest companies gets away lot shady stuff see past facade huge pile shit heres name day wanted get new pair glasses installed app soon opened app showed full screen ad buy lenskart gold rupees said purchase lenskart premium ill entitled benefits free quarterly repairs maintenance one remembered coupon year gold membership moment entered coupon code got membership free guess get three benefits free quarterly maintenance repairs honestly without even worth get gold membership add insult injury among list charges rupees delivery fee rupees delivery fee deliver confirmation email mail mean wtf gold membership scam theres thing buy one get one free search product lenskart find product code search product amazon using code youll get half price amazon sometimes even less half fucking audacity charge customer im order sell stuff benefit get gold free eye checkup stores home honestly many times would get eyesight checked year rupees membership make sense point reason people arent questioning us get free gold memberships coupons doesnt mean everyone gets free membership coupon even percent lenskarts gold members pay membership still huge sum money whats good eyewear brand always used lenskart seem last thana year since anyway change frames frequently didnt mind idk ever bought local eyewear places saw last line return guess local places never allowed return often got might flimsy quality try titan eye titan eye plus good yes variety even branded glasses john jacobs glasses bought lenskart frame glasses yellowed year use strange bought two pairs theyve held nicely one wear every day several hours day franchisee businesses sell low quality products high markups ie lenskart titan eye cleardekho etc companies sells disposable grade products eyewear isnt disposable item want get actual good quality products need visit good opticians buy quality products eyewear brands actively work improving vision also always invest good pair lenses frames need assistance feel free get back anything see lenskart zero credibility theyre madeup names mass produced china ownsday john jacobs etc none real brands madeup lenskart create sense choices customers means nothing end day theyre low quality disposal grade products titan much better uses lenskart normal footpath shops better place glasses lenskart taitan minimum go value eyes downhill well uphill matter third grade frame lenses china discount laden strategy bought lenskart glasses two years back bought one mom one year back us got eyes weaker started issues lens later switched back nearest local optical shop literally us comfort zone got feedback friends warned buy find product code search product amazon using code dont think possible got glass frame still good thay day replace box broken bcz sat accidently situation showing surely freefall first last time customer lenskart pair lasted year half frame broke face possibly brought dollar china got replacement dollar store canada cad rupees lasted years ongoing lenskart always mediocre singapore known used owndays budget brand online brick mortar shops considering extremely high markup eyewear industry budget brands welcome looked saw owndays acquired lenskart years ago ordered quite eye glasses lenskart broke months maybe year bit one power sunglass broke within months use right face typical failure profile clean break across rim one lenses since steered clear lenskart main business model increase top line forcing buy good model consider large demographic fashion matters two pairs instead one also many people prefer spare case biggest problem startups like mostly expansion spree dont care shit quality membership another trap advertising tv programs help marketing fallacy think economically successful companies always providing best price highest quality consumer possible provide much better quality prices charge wont go yeah youre right product code model number bad im sure onetime issue frame got titan problems back visit store multiple times though service great eventually tried lenskart offered bogo deal good frames time might consider switching back titan eye plus piyush bansal seems using every possible tactic boost sales revenue appears company get away due limited alternatives india steady stream firsttime buyers company could continue years without reconsidering approach totally agreed believe lack alternatives price points key survival till hey even toyota gives better service slap badge maruti lenskart nopestill old lousy service extra flair stopped buying years ago always prefer titan eye gkb optical luxotica true parents got specs made local shops ones returned costed k frame basic lens photochromatic coating dont know prices justified considering low quality lens frames coating expect better company valued billions lack alternatives study first time buyers keeping show going lenskart got specs done titan eye plus vision express lenskart better quality bought bogo sales lenskart made us change specs often sales lenskart seems eager us order constantlywhether specs dont last thanks bogo say bogus sales second also got specs lenskart used years change change power never really got quality frameslens break within year moto become make us order often giving shitty quality bogo discount sale cant buy powered stuff amazon need regular sunglasses buy literally anywhere using lenskart pretty much since never faced issues regarding bad quality glasses last many years change paint chip etc far better local stores titan etc better quality much costlier somewhat agree one factors quality optical lenses used expensive thats case anymore brands introduced many budgetfriendly options without compromising quality also lack knowledge awareness among customers another reason dont blame though opticians responsibility guide customers properly optical stores lack knowledge people also tend treat lens lens case lot tech rd goes manufacturing quality lenses actually amazing vision differ lens way mapped despite prescription yes unfortunately go titan dont even charge cleaning even warranty goes offknowledgeable staff con quite expensive possible opt store pickup check pair leaving tital eye plus way better feel like options limited sometimes whatever absolutely top notch quality like boat made china labelled india case glasses chinese made ones still better alternative luxotica monopolyas long priced right lenskart absolutely doesnt might people like wear glasses every second day except sleeping frames dont last half year ther actual japanese brand owndays guess sold trademark lenskart specs used awesome especially lens would prepare specs minutes still using owndays specs years guess majorly owned lenskart know happens lenskart calling shots twice lens cracked box rebadging john jacobs designs nothing japanese anymore assume due poor quality coating lens bad since begining dont know man may rare issue around glasses lenskart best cases one time even got refund total amount deliver time even get specs cleaned using machine free agree pricing become worse days first purchase five years ago decided resort local vendors selecting spectacles vfm products try physically ordered atleast times times others never quality service low never ordered local shops much cost power photochromatic coating decent frame thinking going local next purchase bad first relieve us come tomorrow attitude depends vendor vendor im unable comment much cost give shot im pretty sure wont regret try complaining lenskart via mail may compensate resolve issue dont get bad quality meant price quality found expensive already case said john jacobs owndays hard case replaced soft case convenience carrying around seems lenskart values convenience carrying around safety fragile thing damn quality said return within days classic true seems lens costs bucks make hence allow return even custom made discard agree",
    "light_cleaned_title": "Lenskart has gone downhill - Never ordering again.",
    "light_cleaned_selftext": "I've been a repeat customer with Lenskart for a while now. I know their lens quality isn't great, but I wear my specs all the time, and they’re one of the only places with rimless frames I like. But seriously, this company has gone to absolute garbage over the past couple of years. To start, let’s talk about their so-called \"premium\" soft green cases. It's a scam, plain and simple. They’re more like flimsy wallets than cases. Just the tiniest pinch, and my specs are damaged. What are they thinking? It’s like they designed it specifically to make you need another order sooner. And don’t even get me started on their \"Owndays\" line, which they’re hyping up as some premium Japanese brand. Turns out, it’s basically just a rebadged version of John Jacobs. I mean, what kind of rebranding nonsense is that? I recently placed three orders, and I’ve had to return every single one of them. I’m done. I’m never going to order from Lenskart again",
    "light_cleaned_comments": "Lenskart is one of the shittiest companies out there that gets away with a lot of shady stuff. Once you see past the facade, it's all a huge pile of shit. Here's to name a few: 1. The other day I wanted to get myself a new pair of glasses so I installed the app. As soon as I opened the app, it showed me a full screen ad to buy lenskart gold for 500 rupees. It said that on purchase of lenskart premium, I'll be entitled to 4 benefits, with free quarterly repairs and maintenance being one of them. I remembered that I had a coupon for a 1 year gold membership. The moment I entered the coupon code and got the membership for free, guess what? I now get only three benefits. No more free quarterly maintenance and repairs. And honestly, without it, it's not even worth it to get a gold membership. To add insult to injury, among the list of charges is a 49 rupees delivery fee. A 49 rupees delivery fee to deliver a confirmation email to my mail. I mean wtf! 2. The gold membership itself is a scam. There's no such thing as a buy one get one free. Search for a product on lenskart, find it's product code and search for the same product on Amazon using the code. You'll get it at half the price on amazon (sometimes even less than half). The fucking audacity to charge the customer I'm order to sell him more stuff! 3. The only other benefit you get with gold is free eye checkup at stores or in home. And honestly, how many times would you get your eyesight checked in a year for the 500 rupees membership to make sense? At this point, the only reason why people aren't questioning this is because most of us get free gold memberships through coupons. But that doesn't mean everyone gets a free membership coupon. Even if 1 percent of lenskart's gold members pay for the membership, it's still a huge sum of money. What's a good eyewear brand then? I have always used lenskart but they seem to not last more thana year. Since i anyway change frames frequently i didn't mind. Idk if you have ever bought from local eyewear places, but I saw your last line that you had to return them. Guess what? The local places never allowed return. And often what you got might be flimsy quality. Try titan eye. Titan Eye Plus is good. Yes. They have variety and even branded glasses. I have John & Jacobs glasses. Bought them from Lenskart. The frame, glasses are yellowed after 1 year of use. Strange. I bought two pairs from them in 2022. They’ve both held up very nicely. One of them I wear every day for several hours a day. All these franchisee businesses sell low quality products for high markups i.e. Lenskart, Titan Eye, Cleardekho etc. These companies sells disposable grade products, and eyewear isn't a disposable item. If you want to get actual good quality products. You need to visit good opticians, and buy quality products from eyewear brands that actively work on improving vision. Also, always invest in a good pair of lenses over frames. If you need any assistance, feel free to get back. Anything you see on Lenskart has zero credibility as they're all made-up names, mass produced in China. Ownsday, John Jacobs, etc. None of them are \"real\" brands. It's all made-up by Lenskart themselves, and create a sense of choices for their customers. But, it means nothing. At the end of the day, they're all low quality disposal grade products. Titan is much better Who uses Lenskart? Normal footpath shops are a better place for glasses than Lenskart. Taitan is the minimum you should go for if you value your eyes. Downhill? Well, when was it uphill for that matter? Third grade frame and lenses from China, and discount laden strategy??? I bought Lenskart glasses two years back and bought one for my mom one year back. Both of us got our eyes weaker and started to have issues with the lens. We later switched back to our nearest local optical shop and literally both of us are now in our comfort zone. I got same feedback from my friends who warned me not to buy from them >find it's product code and search for the same product on Amazon using the code. I don't think that is possible. I had got a glass and frame in 2017 and its still as good as it was thay day. Only I had to replace the box as it was broken bcz I sat on that accidently. If this is the situation now what you are showing, It surely is freefall. First and last time customer of Lenskart. Both pair lasted about a year and half. The frame broke while in my face. 🤔 It was possibly brought for a dollar in China. Got a replacement from the dollar store in Canada for 3 CAD. (159 Rupees) It has lasted me 2 years! And ongoing. Lenskart was always mediocre. In Singapore, I have known (not used ) Owndays as a budget brand that had online and brick and mortar shops. Considering the extremely high markup in eyewear industry the budget brands are welcome. I looked up and saw that Owndays has been acquired by Lenskart. About 7-8 years ago I had ordered quite a few eye glasses from Lenskart. All of them broke with a few months ...to maybe a year or a bit more. One power sunglass broke within 4 months of use, right there on my face. The typical failure profile was a clean break across the rim of one of the lenses. Since then I have steered clear of Lenskart. Their main business model is to increase their top line by forcing you to buy 2. It's a good model if you consider the large demographic to whom fashion matters and you have two pairs instead of one. Also many people prefer to have a spare, just in case. The only and biggest problem is that startups like these are mostly on expansion spree and don't care about the shit quality. Membership is another trap. Advertising and TV programs help their marketing. It is a fallacy to think that an economically successful companies will always providing the best price or the highest quality for the consumer. It is possible to provide much better quality at the prices they charge. They just won't. Here you go. And yeah you're right. It's not the product code it's the model number. My bad. I’m not sure if it was just a one-time issue, but the frame I got from Titan had problems back in 2017. I had to visit the store multiple times, though the service was great. Eventually, I tried Lenskart, which offered a BOGO deal and had good frames at the time. Now, I might consider switching back to Titan Eye Plus. Piyush Bansal seems to be using every possible tactic to boost sales and revenue, and it appears the company can get away with it due to limited alternatives. In India, with a steady stream of first-time buyers, the company could continue for years without reconsidering its approach. Totally agreed. I believe lack of alternatives at such price points is the key for its survival till now. Hey, even Toyota gives you better service when they slap their badge on a Maruti! But with Lenskart? Nope—still the same old lousy service, just with extra “flair.” Stopped buying from them 10 years ago. Always prefer Titan eye or gkb optical Luxotica. True. My parents got specs made from local shops. The ones I returned costed 7.2k for 2 frame + basic lens + photochromatic coating. I don't know if the prices are justified considering the low quality of lens, frames and coating. I expect better from a company that is valued in billions. Only the lack of alternatives and study first time buyers is keeping the show going for lenskart. I have got specs done from Titan eye plus, vision express before in 2015 to 2017. Lenskart then had better quality than now. Bought into BOGO sales. Lenskart made us change specs more often from these sales. Lenskart seems eager for us to order constantly—whether it’s because the specs don’t last or thanks to their BOGO (or should I say, “bogus”) sales! I can second that. I also got specs in 2017 from Lenskart. Used them for 3 years, had to change because of change in power. From then on never really got the same quality. Frames/lens break within a year. Their moto has become to make us order more and often by giving shitty quality with BOGO and discount sale. You can't buy powered stuff on Amazon. If you just need regular sunglasses you can buy from literally anywhere I have been using Lenskart pretty much since 2013-14. I have never faced issues regarding bad quality, all my glasses last for many years. I change only when there is some paint chip off etc. They are far better than local stores. Titan etc is better quality but much costlier. I somewhat agree with you. It is one of the factors. Quality optical lenses used to be expensive, but that's not the case anymore. Now, brands have introduced many budget-friendly options without compromising on quality. Also, the lack of knowledge, and awareness among the customers is another reason. I don't blame them though. It's an optician's responsibility to guide its customers properly, but most of the optical stores lack knowledge themselves. People also tend to treat a lens as just a lens. But, that is not the case. A LOT of tech and R&D goes into manufacturing quality lenses. It's actually amazing how your vision can differ because of the lens, and the way it is mapped despite of the having the same prescription. Yes, unfortunately. Go for titan, they dont even charge for cleaning (even after the warranty goes off),knowledgeable staff. Con- quite expensive If possible opt for store pickup. You can check your pair before leaving Tital eye plus is way better, i do feel like options are limited sometimes but whatever they have is absolutely top notch quality. Its like boat. Made in China, labelled in India. But in the case of glasses chinese made ones are still a better alternative than Luxotica monopoly,*as long as they* are priced right, which lenskart absolutely doesn't. it might be for people like me who have to wear glasses every second of the day except sleeping. My frames dont last more than 1 and half year. Ther is an actual japanese brand owndays which i guess sold trademark to lenskart. Their specs used to be awesome. Especially the lens and would prepare the specs in 20 minutes. I still am using my owndays specs after 5 years I guess. Now it's majorly owned by lenskart and you know what happens when lenskart is calling shots. Twice, lens were cracked out of the box. They are just rebadging John Jacobs designs. Nothing Japanese about it anymore. I assume it's due to poor quality coating of lens. It was bad since the begining dont know man may this is a rare issue i have around 5-7 glasses from lenskart all have best cases. one time i even got refund of the total amount as they did not deliver in time. I even get my specs cleaned using some machine for free. I do agree that their pricing has become worse these days. After my first purchase from them five years ago, I decided I will only resort to local vendors for selecting my spectacles. VFM products and I can try them out physically. From 2017 I have ordered atleast 3 times for myself and more than 5 times for others. Never has the quality and service been so low. Never ordered from local shops for myself. How much does it cost for <2 power, photochromatic coating and a decent frame? Thinking for going local for my next purchase. Not so bad at first. They did relieve us from come tomorrow attitude. It depends from vendor to vendor. I'm unable to comment how much will it cost, but give it a shot! I'm pretty sure you won't regret it. try complaining to lenskart via mail. May be they can compensate and resolve the issue and other dont get this bad quality. I meant the price for quality. I found it too expensive. I already did that. For the case they said, for John Jacobs and Owndays hard case has been replaced with soft case for convenience of carrying around. It seems lenskart values convenience of carrying around over safety for such a fragile thing. Damn. As for the quality they said you can return within 14 days. Classic. True. It seems lens only costs about 50 bucks to make. Hence they allow you to return even if it's custom made. They will just discard it. I agree"
}