{
    "id": "16gt0sq",
    "title": "Pumps, manpower deployed twice overnight to clear waterlogging at Bharat Mandapam",
    "url": "https://indianexpress.com/article/cities/delhi/pumps-manpower-deployed-twice-overnight-to-clear-waterlogging-at-bharat-mandapam-8933885/",
    "selftext": "New Delhi | Updated: September 11, 2023 08:40 IST",
    "flair": "Politics",
    "score": 1,
    "num_comments": 4,
    "created_utc": 1694529307.0,
    "convurl": "https://external-preview.redd.it/hSXyzDoyoisiKZle5mSPhwp2QrnUmd8sQfFBimAEVqU.jpg?auto=webp&s=67040ec6258686ecb897d16c7fbe0d86f1427e7c",
    "comments": [
        "They successfully hid the slums but failed to hide poor infrastructure. Prior hosts of G20 managed the events in way less money than what the government of India has spent.",
        "The rest of the money is for personal use. Cmon mate!",
        ">Prior hosts of G20 managed the events in way less money than what the government of India has spent.\n\nYou mean already developed countries except China who spent 24 billion yes BILLION dollars on it? 💀"
    ],
    "cleaned_text": "pumps manpower deployed twice overnight clear waterlogging bharat mandapam new delhi updated september ist ",
    "cleaned_title": "pumps manpower deployed twice overnight clear waterlogging bharat mandapam",
    "cleaned_selftext": "new delhi updated september ist",
    "cleaned_comments": "successfully hid slums failed hide poor infrastructure prior hosts g managed events way less money government india spent rest money personal use cmon mate prior hosts g managed events way less money government india spent mean already developed countries except china spent billion yes billion dollars",
    "light_cleaned_title": "Pumps, manpower deployed twice overnight to clear waterlogging at Bharat Mandapam",
    "light_cleaned_selftext": "New Delhi | Updated: September 11, 2023 08:40 IST",
    "light_cleaned_comments": "They successfully hid the slums but failed to hide poor infrastructure. Prior hosts of G20 managed the events in way less money than what the government of India has spent. The rest of the money is for personal use. Cmon mate! >Prior hosts of G20 managed the events in way less money than what the government of India has spent. You mean already developed countries except China who spent 24 billion yes BILLION dollars on it? 💀"
}