{
    "id": "16dskll",
    "title": "Bi-Weekly Books & Reading Discussion Thread",
    "url": "https://www.reddit.com/r/india/comments/16dskll/biweekly_books_reading_discussion_thread/",
    "selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\nr/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)!\n\n**Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)\n\nhttps://preview.redd.it/obor0v8vx8n61.png?width=1487&format=png&auto=webp&s=bdf0b44db553b7c8c9f4a76aca3943d1728f7d3c",
    "flair": "Scheduled",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694223008.0,
    "convurl": "https://external-preview.redd.it/4-MB5BkKm6EYrEla9dN9w0T2n_gnXtFrCL-kOTKmNbI.jpg",
    "comments": [
        "Finished Hitchhikers guide to the galaxy. Will start Wuthering Heights (Emily Bronte) or maybe time machine by h.g. wells this sunday.",
        "Currently reading Mighty Sons of Hercules, a collection of sword and sandals short stories. Fun stuff..",
        "Had read WH long back. Thanks for reminding.",
        "Finished origin by Dan brown in a single day. Idk guys it's such a formulaic story with the same tropes but still keeps you hooked throughout. The weakest reveal of all his books though.",
        "read all of discworld",
        "reading \"ek gadhe ki atmakatha\"",
        "Currently reading Thursday Murder Club by Richard Osman , and gonna start  The Paper Menagerie",
        "Looking for suggestions on good books in Indian Economy",
        "Well, 'Unshackling India' by Ajay Chibber and Salman Anees Soz.",
        "Hi, I wanted to ask folks here , [Is this a good deal? ](https://i.imgur.com/asgDz2y.jpg) also how is the paper quality of these books?"
    ],
    "cleaned_text": "biweekly books reading discussion thread bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall ",
    "cleaned_title": "biweekly books reading discussion thread",
    "cleaned_selftext": "bookworms rindia space discuss anything related books literature articles long short form writing prompts essays novels short stories finish awesome book recently eager start one tell us read great longform articles lately share got idea read next ask recommendations check rindianbooks discussion books indian nonindian anything readingrelated also visit rbharat read share wellwritten insightful longform articles india rindia also goodreads grouphttpswwwgoodreadscomgroupshowrindia books thread posted every two weeks saturday mornings old threadshttpsredditcomrindiasearchqbiweeklybooksdiscussionthreadrestrictsronsortnewtall",
    "cleaned_comments": "finished hitchhikers guide galaxy start wuthering heights emily bronte maybe time machine hg wells sunday currently reading mighty sons hercules collection sword sandals short stories fun stuff read wh long back thanks reminding finished origin dan brown single day idk guys formulaic story tropes still keeps hooked throughout weakest reveal books though read discworld reading ek gadhe ki atmakatha currently reading thursday murder club richard osman gon na start paper menagerie looking suggestions good books indian economy well unshackling india ajay chibber salman anees soz hi wanted ask folks good deal httpsiimgurcomasgdzyjpg also paper quality books",
    "light_cleaned_title": "Bi-Weekly Books & Reading Discussion Thread",
    "light_cleaned_selftext": "Bookworms of r/India, this is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories! Did you finish an awesome book recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations! Check out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related. Also, visit r/Bharat, to read and share well-written, insightful long-form articles about India. r/India also has a [Goodreads group](https://www.goodreads.com/group/show/162898-r-india)! **Books Thread is posted every two weeks on Saturday mornings |** [**Old Threads**](https://reddit.com/r/india/search?q=Bi-Weekly+Books+Discussion+Thread&restrict_sr=on&sort=new&t=all)",
    "light_cleaned_comments": "Finished Hitchhikers guide to the galaxy. Will start Wuthering Heights (Emily Bronte) or maybe time machine by h.g. wells this sunday. Currently reading Mighty Sons of Hercules, a collection of sword and sandals short stories. Fun stuff.. Had read WH long back. Thanks for reminding. Finished origin by Dan brown in a single day. Idk guys it's such a formulaic story with the same tropes but still keeps you hooked throughout. The weakest reveal of all his books though. read all of discworld reading \"ek gadhe ki atmakatha\" Currently reading Thursday Murder Club by Richard Osman , and gonna start The Paper Menagerie Looking for suggestions on good books in Indian Economy Well, 'Unshackling India' by Ajay Chibber and Salman Anees Soz. Hi, I wanted to ask folks here , [Is this a good deal? ](https://i.imgur.com/asgDz2y.jpg) also how is the paper quality of these books?"
}