{
    "id": "16ti1pp",
    "title": "ED raids Tamil Nadu BJP accountant over illegal sand sale case; wraps it up in 4 hours",
    "url": "https://thesouthfirst.com/tamilnadu/ed-raids-tamil-nadu-bjp-accountant-over-illegal-sand-sale-case-wraps-it-up-in-4-hours/",
    "selftext": "A lot of noise was being made about the recent ED raids pertaining to the sand mining scam in TN. Now we can expect the case to quietly get buried as the ED sleuths unknowingly ended up at the doors of the BJP State HQ's accountant while chasing the money and have beaten a hasty retreat.",
    "flair": "Crime",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695814225.0,
    "convurl": "https://external-preview.redd.it/cfD8K3w14j8zGGjQPvRZoUHgbkyIZicEet7HamjRS-U.jpg?auto=webp&s=b80ade4120b86f27ba9844f24a1521f0f3811888",
    "comments": [
        "What a farce it has become",
        ">As the news spread, BJP functionaries rushed to the residence of Jothikumar and for some reason were allowed inside the house where the search was going on.\n\n\n>Asked about any pressure from the Union Finance Ministry on the ED team, the sources (from the BJP HQ Kamalayam) said that the issue was escalated to the BJP high command and that the search operation on Jothikumar was inadvisable\n\n\n>Sources from the ED stated that the probe agency had documentary evidence establishing the monetary transactions connecting Jothikumar, Shanmugam, and sand contractors\n\n#NaKhaungaNaKhaneDunga will start trending on Xitter now",
        "now no one can say ED only targets opposition politicians all part of a master plan"
    ],
    "cleaned_text": "ed raids tamil nadu bjp accountant illegal sand sale case wraps hours lot noise made recent ed raids pertaining sand mining scam tn expect case quietly get buried ed sleuths unknowingly ended doors bjp state hqs accountant chasing money beaten hasty retreat ",
    "cleaned_title": "ed raids tamil nadu bjp accountant illegal sand sale case wraps hours",
    "cleaned_selftext": "lot noise made recent ed raids pertaining sand mining scam tn expect case quietly get buried ed sleuths unknowingly ended doors bjp state hqs accountant chasing money beaten hasty retreat",
    "cleaned_comments": "farce become news spread bjp functionaries rushed residence jothikumar reason allowed inside house search going asked pressure union finance ministry ed team sources bjp hq kamalayam said issue escalated bjp high command search operation jothikumar inadvisable sources ed stated probe agency documentary evidence establishing monetary transactions connecting jothikumar shanmugam sand contractors nakhaunganakhanedunga start trending xitter one say ed targets opposition politicians part master plan",
    "light_cleaned_title": "ED raids Tamil Nadu BJP accountant over illegal sand sale case; wraps it up in 4 hours",
    "light_cleaned_selftext": "A lot of noise was being made about the recent ED raids pertaining to the sand mining scam in TN. Now we can expect the case to quietly get buried as the ED sleuths unknowingly ended up at the doors of the BJP State HQ's accountant while chasing the money and have beaten a hasty retreat.",
    "light_cleaned_comments": "What a farce it has become >As the news spread, BJP functionaries rushed to the residence of Jothikumar and for some reason were allowed inside the house where the search was going on. >Asked about any pressure from the Union Finance Ministry on the ED team, the sources (from the BJP HQ Kamalayam) said that the issue was escalated to the BJP high command and that the search operation on Jothikumar was inadvisable >Sources from the ED stated that the probe agency had documentary evidence establishing the monetary transactions connecting Jothikumar, Shanmugam, and sand contractors #NaKhaungaNaKhaneDunga will start trending on Xitter now now no one can say ED only targets opposition politicians all part of a master plan"
}