{
    "id": "152satg",
    "title": "How are immigrant indian men able to marry non indian women at high rates in US in spite of having creepy image ?",
    "url": "https://www.reddit.com/r/india/comments/152satg/how_are_immigrant_indian_men_able_to_marry_non/",
    "selftext": " \n\nI was checking the interracial marriage rates of different communities in US and it is only indian immigrant men who have such high out marry rates (twice as high as immigrant women). Just wanted to ask even though most abcd men here feel their dating image is ruined by immigrants and abcd women don't marry immigrant men but they themselves do pretty fine it seems by the data. Why do abcds think the data says so?\n\nFor immigrant men it's 20% outmarry rate while for immigrant women it's 10%\n\n[https://twitter.com/Noahpinion/status/986761107602681857](https://twitter.com/Noahpinion/status/986761107602681857)\n\nscroll up this tweet to see the difference between us born and total to see the difference in choosing white partners.\n\n[https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667](https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667)\n\njust skim through the rest of the data points",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1689668091.0,
    "convurl": "https://external-preview.redd.it/KLzq4JOGtdupQjgBgETxxLbqWzkC0aKlVqA6i_eKN4o.jpg",
    "comments": [],
    "cleaned_text": "immigrant indian men able marry non indian women high rates us spite creepy image checking interracial marriage rates different communities us indian immigrant men high marry rates twice high immigrant women wanted ask even though abcd men feel dating image ruined immigrants abcd women dont marry immigrant men pretty fine seems data abcds think data says immigrant men outmarry rate immigrant women httpstwittercomnoahpinionstatushttpstwittercomnoahpinionstatus scroll tweet see difference us born total see difference choosing white partners httpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypubhttpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypub skim rest data points ",
    "cleaned_title": "immigrant indian men able marry non indian women high rates us spite creepy image",
    "cleaned_selftext": "checking interracial marriage rates different communities us indian immigrant men high marry rates twice high immigrant women wanted ask even though abcd men feel dating image ruined immigrants abcd women dont marry immigrant men pretty fine seems data abcds think data says immigrant men outmarry rate immigrant women httpstwittercomnoahpinionstatushttpstwittercomnoahpinionstatus scroll tweet see difference us born total see difference choosing white partners httpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypubhttpscarnegieendowmentorgsocialrealitiesofindianamericansresultsfromindianamericanattitudessurveypub skim rest data points",
    "cleaned_comments": "",
    "light_cleaned_title": "How are immigrant indian men able to marry non indian women at high rates in US in spite of having creepy image ?",
    "light_cleaned_selftext": "I was checking the interracial marriage rates of different communities in US and it is only indian immigrant men who have such high out marry rates (twice as high as immigrant women). Just wanted to ask even though most abcd men here feel their dating image is ruined by immigrants and abcd women don't marry immigrant men but they themselves do pretty fine it seems by the data. Why do abcds think the data says so? For immigrant men it's 20% outmarry rate while for immigrant women it's 10% [https://twitter.com/Noahpinion/status/986761107602681857](https://twitter.com/Noahpinion/status/986761107602681857) scroll up this tweet to see the difference between us born and total to see the difference in choosing white partners. [https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667](https://carnegieendowment.org/2021/06/09/social-realities-of-indian-americans-results-from-2020-indian-american-attitudes-survey-pub-84667) just skim through the rest of the data points",
    "light_cleaned_comments": ""
}