{
    "id": "1f51n9o",
    "title": "Enough Proof To Charge Congress' Jagdish Tytler In Anti-Sikh Riots Case: Court",
    "url": "https://www.ndtv.com/india-news/enough-proof-to-charge-jagdish-tytler-in-1984-anti-sikh-riots-case-court-6452357",
    "selftext": "Congress leader Jagdish Tytler, accused of murder during the anti-Sikh riots of 1984, is out on bail granted by a sessions court on a bond and surety of ₹ 1 lakh each.",
    "flair": "Law & Courts",
    "score": 78,
    "num_comments": 7,
    "created_utc": 1725040570.0,
    "convurl": "https://external-preview.redd.it/nFlonKsXWWJBIZ45467lJ8Q5RFjl_DBaEhvzi1MvAYk.jpg?auto=webp&s=c80f7a4a8ebf7d37c16ebaab335f30ad9fae9393",
    "comments": [
        "###CBI’s Eyewitness Statements\n\n>In concluding arguments in January, the federal agency presented eyewitnesses’ statements and told the court there is sufficient evidence to frame charges against the Congress leader.\n\n>“Tytler provoked the mob to kill Sikhs which resulted in Gurudwara Pul Bangash being set on fire by the mob and killing of three persons...” the CBI had said.\n\n>One witness claimed to have seen a mob carrying petrol canisters, sticks, swords, and rods, with Tytler, then a Member of Parliament, in front of the gurudwara, while others claimed to have seen him emerge from a car - a white Ambassador - and exhort the gathered mob to carry out his “instructions”.",
        "Indian judicial system has also forgot about the atrocities faced by Sikh women in 1984.\n\nIf justice was provided at that time and the establishment wasn’t complicit in crimes itself. \n\nMay be we would not have seen these atrocities faced by women in recent years.\n\n>[2012 Nirbhaya Gang Rape](https://timesofindia.indiatimes.com/india/what-is-nirbhaya-case/articleshow/72868430.cms)\n\n>[2018 Kathua Gang Rape](https://www.newindianexpress.com/thesundaystandard/2021/Jan/10/we-got-only-half-justice-says-kathua-gang-rape-victims-father-2247924.html)\n\n>[202 Hathras Gang Rape](https://www.indiatoday.in/india/story/hathras-gangrape-case-19-year-old-woman-from-up-dies-in-delhi-hospital-temp-1726469-2020-09-29)\n\n>[2022 Delhi Gang Rape](https://www.aljazeera.com/news/2022/2/1/india-new-delhi-alleged-gang-rape-torture-woman-revenge-attack)\n\n>[2014 Kolkata Doctor Rape](https://www.livemint.com/news/india/kolkata-rape-murder-case-live-updates-august-22-supreme-court-hearing-today-cbi-status-report-rg-kar-hospital-news-11724291482327.html)\n\nTo document stories of Sikh women recently a book named “The Kaurs of 1984”by Sanam Sutirath Wazir, published by HarperCollins, which explores the stories and perspectives of Sikh women around the events in 1984, including Sikh Genocide.\n\nThe wire has written an article about the same book.\n\n>###[‘We Were Abandoned. We Never Mattered’: A Sikh Woman’s Story From 1984](https://thewire.in/books/we-were-abandoned-we-never-mattered-a-sikh-womans-story-from-1984)\n\n>In the winter of 1984, Trilokpuri became a burial ground, the air rent by smoke and inhuman screams. ‘The mob did not even spare the dead,’ Darshan told me. ‘They removed gold rings and chains from the dead bodies. \n\n>They were not scared of the law.’ It was as if the mob had been clearly instructed and perhaps even given some kind of training in what to do before the massacre. In the midst of this chaos, women were forced out of their homes by the attackers who wanted to prevent them from giving any assistance to their male kith and kin; most of those who were milling around on the streets were women. Those who tried to intervene and save their fathers, husbands, sons and brothers were attacked brutally by the marauding mob. \n\n>Darshan heard Rampal Saroj instigating the mob, shouting, ‘No one should be spared!’ She was not spared either. The mob dragged her down the road before pushing her to the ground. During this ordeal, she was separated from her twenty-day-old son, while her eldest son, a toddler of four, was attacked by arsonists with an iron rod; her son still bears a visible mark of the attack. When she pleaded with her attackers to spare her son, they called him the child of a snake.\n\n> At about 4 p.m., after the mob had murdered all the Sikh men they could get hold of in Block 32, they instructed all the women seated outside their homes. ‘Now your men are dead. Come out and sit together in the park nearby Block 32.’ The women came out and all huddled together. The mobsters offered them some water, but no one drank it. \n\n>Then the men began dragging off whichever girl caught their fancy. ‘Each girl was taken by a gang of some ten or twelve men. Many of these girls were in their teens. They would be taken to nearby shelters, raped and then sent back after a few hours,’ Darshan recalled. ‘The men were monsters. They also raped women who were of their mother’s and grandmother’s ages.’\n\n> Some girls never came back, and those who did were in a pitiable condition, naked and bruised. Darshan recalled how a young girl of about fifteen came back sobbing—she had been raped multiple times by men as old as her grandfather. Guddi (name changed), a woman in her late fifties, was raped in front of all the other women. \n\n>Darshan remembered the scene with painful clarity, ‘She was crying throughout, but the monsters did not stop. They took turns on her. Men as young as seventeen raped her. When they left, she was lying on the ground, naked like a newborn. \n\n>The women in the park covered her with sheets. These rapists were not bothered about anything. After all, they had unsaid police permissions.’ Darshan added, ‘The leaders of the Congress Party were coming and dragging women to nearby houses too.’\n\n>In less than two hours, there were 275 widows across 180 homes. In an area less than 1,000 sq. yards, hundreds of limbless bodies were scattered about. Worse was the fact that none of them knew why this was happening in the first place.\n\nIn an another investigation recently CBI told High Court that [extra judicial killings (custodial & encounters) of 6733 victims](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) is not feasible, even we know the number is way higher.",
        "Imma keep it a buck , this mf will not see the inside of a jail cell before the end of this Yuga  \n\nwhen this cunt dies they will dig up his body every election season just to say \"we are going to put him on trial any day now, please wait\"",
        "Not sure which is more shameful. The original crimes committed by this criminal, or the fact that we're saying \"enough proof to charge him\" **forty fucking years** after the act.",
        "Kamal Nath is culprit too",
        "Largest democracy in action.",
        "This was a shameful period in India's history and justice has been long overdue. ",
        "Indians need to learn street Justice, not with lovers in the park, inter caste marriages, low level thugs  but with these untouchable elite thugs.",
        "u/merscape\n>This was a shameful period in India’s history and justice has been long overdue.\n\n###After [1984Sikh Genocide](https://time.com/3545867/india-1984-sikh-genocide-anniversary/), I don’t see a single decade where violence has not happened in India.\n\nBelow are some of the genocide or violent riots that have happened in each decade after 1984:\n\n>[1987 Merrut Riots](https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-1987-the-horror-of-1987-meerut-riots-2356083-2023-04-05)\n\n>[1989 Anti-Sikh Jammu Riots](https://www.thequint.com/news/india/anti-sikh-jammu-riots-of-1989-revisited)\n\n\n>[1989 Bhagalpur Riots](https://www.aljazeera.com/gallery/2014/12/31/the-forgotten-riots-of-bhagalpur)\n\n\n>[1992 Mumbai Rights](https://www.nytimes.com/1992/12/08/world/at-least-200-killed-in-india-as-muslim-hindu-riots-rage.html)\n\n>[2002 Gujarat Genocidal Massacres](https://www.genocidewatch.com/single-post/the-2002-gujarat-genocidal-massacres)\n\n>[2013 Muzaffarnagar Riots](https://www.bbc.com/news/world-asia-india-24172537)\n\n>[2020 Delhi Riots](https://www.hrw.org/news/2022/02/21/india-biased-investigations-2-years-after-delhi-riot)\n\n>[2023 - Ongoing Genocide: Ethnic Conflict in Manipur](https://www.genocidewatch.com/single-post/genocide-warning-ethnic-conflict-in-manipur)\n\nAbove is not a full list and it also doesn’t include the violent riots happened before 1984 and from southern states.",
        "Yes, and they're all equally shameful. And, of course, for some of these we will probably never see all the perpetrators brought to justice simply because they are too powerful. India has a pretty big problem with ethnic/religious violence and we don't seem to be anywhere near close to leaving behind the divisive rhetoric that leads to them. "
    ],
    "cleaned_text": "enough proof charge congress jagdish tytler antisikh riots case court congress leader jagdish tytler accused murder antisikh riots bail granted sessions court bond surety lakh ",
    "cleaned_title": "enough proof charge congress jagdish tytler antisikh riots case court",
    "cleaned_selftext": "congress leader jagdish tytler accused murder antisikh riots bail granted sessions court bond surety lakh",
    "cleaned_comments": "cbis eyewitness statements concluding arguments january federal agency presented eyewitnesses statements told court sufficient evidence frame charges congress leader tytler provoked mob kill sikhs resulted gurudwara pul bangash set fire mob killing three persons cbi said one witness claimed seen mob carrying petrol canisters sticks swords rods tytler member parliament front gurudwara others claimed seen emerge car white ambassador exhort gathered mob carry instructions indian judicial system also forgot atrocities faced sikh women justice provided time establishment wasnt complicit crimes may would seen atrocities faced women recent years nirbhaya gang rapehttpstimesofindiaindiatimescomindiawhatisnirbhayacasearticleshowcms kathua gang rapehttpswwwnewindianexpresscomthesundaystandardjanwegotonlyhalfjusticesayskathuagangrapevictimsfatherhtml hathras gang rapehttpswwwindiatodayinindiastoryhathrasgangrapecaseyearoldwomanfromupdiesindelhihospitaltemp delhi gang rapehttpswwwaljazeeracomnewsindianewdelhiallegedgangrapetorturewomanrevengeattack kolkata doctor rapehttpswwwlivemintcomnewsindiakolkatarapemurdercaseliveupdatesaugustsupremecourthearingtodaycbistatusreportrgkarhospitalnewshtml document stories sikh women recently book named kaurs sanam sutirath wazir published harpercollins explores stories perspectives sikh women around events including sikh genocide wire written article book abandoned never mattered sikh womans story httpsthewireinbookswewereabandonedwenevermatteredasikhwomansstoryfrom winter trilokpuri became burial ground air rent smoke inhuman screams mob even spare dead darshan told removed gold rings chains dead bodies scared law mob clearly instructed perhaps even given kind training massacre midst chaos women forced homes attackers wanted prevent giving assistance male kith kin milling around streets women tried intervene save fathers husbands sons brothers attacked brutally marauding mob darshan heard rampal saroj instigating mob shouting one spared spared either mob dragged road pushing ground ordeal separated twentydayold son eldest son toddler four attacked arsonists iron rod son still bears visible mark attack pleaded attackers spare son called child snake pm mob murdered sikh men could get hold block instructed women seated outside homes men dead come sit together park nearby block women came huddled together mobsters offered water one drank men began dragging whichever girl caught fancy girl taken gang ten twelve men many girls teens would taken nearby shelters raped sent back hours darshan recalled men monsters also raped women mothers grandmothers ages girls never came back pitiable condition naked bruised darshan recalled young girl fifteen came back sobbingshe raped multiple times men old grandfather guddi name changed woman late fifties raped front women darshan remembered scene painful clarity crying throughout monsters stop took turns men young seventeen raped left lying ground naked like newborn women park covered sheets rapists bothered anything unsaid police permissions darshan added leaders congress party coming dragging women nearby houses less two hours widows across homes area less sq yards hundreds limbless bodies scattered worse fact none knew happening first place another investigation recently cbi told high court extra judicial killings custodial encounters victimshttpswwwlivelawinhighcourtpunjabandharyanahighcourtpunjabharyanahighcourtenforceddisappearanceencounterkillingsinpunjabduringincidentsdecadesoldnoeyewitnessinitiationofinvestigationnotfeasible feasible even know number way higher imma keep buck mf see inside jail cell end yuga cunt dies dig body every election season say going put trial day please wait sure shameful original crimes committed criminal fact saying enough proof charge forty fucking years act kamal nath culprit largest democracy action shameful period indias history justice long overdue indians need learn street justice lovers park inter caste marriages low level thugs untouchable elite thugs umerscape shameful period indias history justice long overdue sikh genocidehttpstimecomindiasikhgenocideanniversary dont see single decade violence happened india genocide violent riots happened decade merrut riotshttpswwwindiatodayinindiatodayinsightstoryfromtheindiatodayarchivesthehorrorofmeerutriots antisikh jammu riotshttpswwwthequintcomnewsindiaantisikhjammuriotsofrevisited bhagalpur riotshttpswwwaljazeeracomgallerytheforgottenriotsofbhagalpur mumbai rightshttpswwwnytimescomworldatleastkilledinindiaasmuslimhinduriotsragehtml gujarat genocidal massacreshttpswwwgenocidewatchcomsinglepostthegujaratgenocidalmassacres muzaffarnagar riotshttpswwwbbccomnewsworldasiaindia delhi riotshttpswwwhrworgnewsindiabiasedinvestigationsyearsafterdelhiriot ongoing genocide ethnic conflict manipurhttpswwwgenocidewatchcomsinglepostgenocidewarningethnicconflictinmanipur full list also doesnt include violent riots happened southern states yes theyre equally shameful course probably never see perpetrators brought justice simply powerful india pretty big problem ethnicreligious violence dont seem anywhere near close leaving behind divisive rhetoric leads",
    "light_cleaned_title": "Enough Proof To Charge Congress' Jagdish Tytler In Anti-Sikh Riots Case: Court",
    "light_cleaned_selftext": "Congress leader Jagdish Tytler, accused of murder during the anti-Sikh riots of 1984, is out on bail granted by a sessions court on a bond and surety of ₹ 1 lakh each.",
    "light_cleaned_comments": "###CBI’s Eyewitness Statements >In concluding arguments in January, the federal agency presented eyewitnesses’ statements and told the court there is sufficient evidence to frame charges against the Congress leader. >“Tytler provoked the mob to kill Sikhs which resulted in Gurudwara Pul Bangash being set on fire by the mob and killing of three persons...” the CBI had said. >One witness claimed to have seen a mob carrying petrol canisters, sticks, swords, and rods, with Tytler, then a Member of Parliament, in front of the gurudwara, while others claimed to have seen him emerge from a car - a white Ambassador - and exhort the gathered mob to carry out his “instructions”. Indian judicial system has also forgot about the atrocities faced by Sikh women in 1984. If justice was provided at that time and the establishment wasn’t complicit in crimes itself. May be we would not have seen these atrocities faced by women in recent years. >[2012 Nirbhaya Gang Rape](https://timesofindia.indiatimes.com/india/what-is-nirbhaya-case/articleshow/72868430.cms) >[2018 Kathua Gang Rape](https://www.newindianexpress.com/thesundaystandard/2021/Jan/10/we-got-only-half-justice-says-kathua-gang-rape-victims-father-2247924.html) >[202 Hathras Gang Rape](https://www.indiatoday.in/india/story/hathras-gangrape-case-19-year-old-woman-from-up-dies-in-delhi-hospital-temp-1726469-2020-09-29) >[2022 Delhi Gang Rape](https://www.aljazeera.com/news/2022/2/1/india-new-delhi-alleged-gang-rape-torture-woman-revenge-attack) >[2014 Kolkata Doctor Rape](https://www.livemint.com/news/india/kolkata-rape-murder-case-live-updates-august-22-supreme-court-hearing-today-cbi-status-report-rg-kar-hospital-news-11724291482327.html) To document stories of Sikh women recently a book named “The Kaurs of 1984”by Sanam Sutirath Wazir, published by HarperCollins, which explores the stories and perspectives of Sikh women around the events in 1984, including Sikh Genocide. The wire has written an article about the same book. >###[‘We Were Abandoned. We Never Mattered’: A Sikh Woman’s Story From 1984](https://thewire.in/books/we-were-abandoned-we-never-mattered-a-sikh-womans-story-from-1984) >In the winter of 1984, Trilokpuri became a burial ground, the air rent by smoke and inhuman screams. ‘The mob did not even spare the dead,’ Darshan told me. ‘They removed gold rings and chains from the dead bodies. >They were not scared of the law.’ It was as if the mob had been clearly instructed and perhaps even given some kind of training in what to do before the massacre. In the midst of this chaos, women were forced out of their homes by the attackers who wanted to prevent them from giving any assistance to their male kith and kin; most of those who were milling around on the streets were women. Those who tried to intervene and save their fathers, husbands, sons and brothers were attacked brutally by the marauding mob. >Darshan heard Rampal Saroj instigating the mob, shouting, ‘No one should be spared!’ She was not spared either. The mob dragged her down the road before pushing her to the ground. During this ordeal, she was separated from her twenty-day-old son, while her eldest son, a toddler of four, was attacked by arsonists with an iron rod; her son still bears a visible mark of the attack. When she pleaded with her attackers to spare her son, they called him the child of a snake. > At about 4 p.m., after the mob had murdered all the Sikh men they could get hold of in Block 32, they instructed all the women seated outside their homes. ‘Now your men are dead. Come out and sit together in the park nearby Block 32.’ The women came out and all huddled together. The mobsters offered them some water, but no one drank it. >Then the men began dragging off whichever girl caught their fancy. ‘Each girl was taken by a gang of some ten or twelve men. Many of these girls were in their teens. They would be taken to nearby shelters, raped and then sent back after a few hours,’ Darshan recalled. ‘The men were monsters. They also raped women who were of their mother’s and grandmother’s ages.’ > Some girls never came back, and those who did were in a pitiable condition, naked and bruised. Darshan recalled how a young girl of about fifteen came back sobbing—she had been raped multiple times by men as old as her grandfather. Guddi (name changed), a woman in her late fifties, was raped in front of all the other women. >Darshan remembered the scene with painful clarity, ‘She was crying throughout, but the monsters did not stop. They took turns on her. Men as young as seventeen raped her. When they left, she was lying on the ground, naked like a newborn. >The women in the park covered her with sheets. These rapists were not bothered about anything. After all, they had unsaid police permissions.’ Darshan added, ‘The leaders of the Congress Party were coming and dragging women to nearby houses too.’ >In less than two hours, there were 275 widows across 180 homes. In an area less than 1,000 sq. yards, hundreds of limbless bodies were scattered about. Worse was the fact that none of them knew why this was happening in the first place. In an another investigation recently CBI told High Court that [extra judicial killings (custodial & encounters) of 6733 victims](https://www.livelaw.in/high-court/punjab-and-haryana-high-court/punjab-haryana-high-court-enforced-disappearance-encounter-killings-in-punjab-during-1984-1995-incidents-decades-old-no-eye-witness-initiation-of-investigation-not-feasible-257544) is not feasible, even we know the number is way higher. Imma keep it a buck , this mf will not see the inside of a jail cell before the end of this Yuga when this cunt dies they will dig up his body every election season just to say \"we are going to put him on trial any day now, please wait\" Not sure which is more shameful. The original crimes committed by this criminal, or the fact that we're saying \"enough proof to charge him\" **forty fucking years** after the act. Kamal Nath is culprit too Largest democracy in action. This was a shameful period in India's history and justice has been long overdue. Indians need to learn street Justice, not with lovers in the park, inter caste marriages, low level thugs but with these untouchable elite thugs. u/merscape >This was a shameful period in India’s history and justice has been long overdue. ###After [1984Sikh Genocide](https://time.com/3545867/india-1984-sikh-genocide-anniversary/), I don’t see a single decade where violence has not happened in India. Below are some of the genocide or violent riots that have happened in each decade after 1984: >[1987 Merrut Riots](https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-1987-the-horror-of-1987-meerut-riots-2356083-2023-04-05) >[1989 Anti-Sikh Jammu Riots](https://www.thequint.com/news/india/anti-sikh-jammu-riots-of-1989-revisited) >[1989 Bhagalpur Riots](https://www.aljazeera.com/gallery/2014/12/31/the-forgotten-riots-of-bhagalpur) >[1992 Mumbai Rights](https://www.nytimes.com/1992/12/08/world/at-least-200-killed-in-india-as-muslim-hindu-riots-rage.html) >[2002 Gujarat Genocidal Massacres](https://www.genocidewatch.com/single-post/the-2002-gujarat-genocidal-massacres) >[2013 Muzaffarnagar Riots](https://www.bbc.com/news/world-asia-india-24172537) >[2020 Delhi Riots](https://www.hrw.org/news/2022/02/21/india-biased-investigations-2-years-after-delhi-riot) >[2023 - Ongoing Genocide: Ethnic Conflict in Manipur](https://www.genocidewatch.com/single-post/genocide-warning-ethnic-conflict-in-manipur) Above is not a full list and it also doesn’t include the violent riots happened before 1984 and from southern states. Yes, and they're all equally shameful. And, of course, for some of these we will probably never see all the perpetrators brought to justice simply because they are too powerful. India has a pretty big problem with ethnic/religious violence and we don't seem to be anywhere near close to leaving behind the divisive rhetoric that leads to them."
}