{
    "id": "16ndn2z",
    "title": "Is the Modi Govt Guilty of Assassinating a Canadian Citizen? A Former RAW Chief Responds to Trudeau",
    "url": "https://youtu.be/8mzpTci1fUw?si=BX9P9zmM4TFAv4F5",
    "selftext": "Never seen Thapar so angry in any interview. He was almost short of saying \"ACCEPT YOU INDIAN BASTARD ACCEPT!\"\n\nI thought that he played devil's advocate as his show had respected him ..that façade has been exposed.",
    "flair": "Politics",
    "score": 1,
    "num_comments": 2,
    "created_utc": 1695189972.0,
    "convurl": "https://external-preview.redd.it/7Wepk31PYOlxvz-IaJo_-6vx9qpiZkRWJEXhg392YEw.jpg?auto=webp&s=fc3025edef4fac36f277469ec61137851dbb48f8",
    "comments": [
        "Why is Thapar so angry ? \n\nHe shifts from whether RAW could have done an assassination to whether RAW is supporting separatist in Pakistan  and such it can do assassination. This are entirely different events separated by decades.\n\nHe felt more like Arnab here.",
        "Thapar was in holier than thou, whiter than white, more loyal than king mode.\n\nThe opposition minister himself has said that Trudeau has not presented any evidence.. but Thapar's every question is like according to the evidence presented by Trudeau 🫡"
    ],
    "cleaned_text": "modi govt guilty assassinating canadian citizen former raw chief responds trudeau never seen thapar angry interview almost short saying accept indian bastard accept thought played devils advocate show respected faade exposed ",
    "cleaned_title": "modi govt guilty assassinating canadian citizen former raw chief responds trudeau",
    "cleaned_selftext": "never seen thapar angry interview almost short saying accept indian bastard accept thought played devils advocate show respected faade exposed",
    "cleaned_comments": "thapar angry shifts whether raw could done assassination whether raw supporting separatist pakistan assassination entirely different events separated decades felt like arnab thapar holier thou whiter white loyal king mode opposition minister said trudeau presented evidence thapars every question like according evidence presented trudeau",
    "light_cleaned_title": "Is the Modi Govt Guilty of Assassinating a Canadian Citizen? A Former RAW Chief Responds to Trudeau",
    "light_cleaned_selftext": "Never seen Thapar so angry in any interview. He was almost short of saying \"ACCEPT YOU INDIAN BASTARD ACCEPT!\" I thought that he played devil's advocate as his show had respected him ..that façade has been exposed.",
    "light_cleaned_comments": "Why is Thapar so angry ? He shifts from whether RAW could have done an assassination to whether RAW is supporting separatist in Pakistan and such it can do assassination. This are entirely different events separated by decades. He felt more like Arnab here. Thapar was in holier than thou, whiter than white, more loyal than king mode. The opposition minister himself has said that Trudeau has not presented any evidence.. but Thapar's every question is like according to the evidence presented by Trudeau 🫡"
}