{
    "id": "12yeju7",
    "title": "Doomsday (penpencildraw)",
    "url": "https://i.redd.it/p90pmovhn1wa1.jpg",
    "selftext": "https://twitter.com/penpencildraw/status/1648666162132033539",
    "flair": "Law & Courts",
    "score": 653,
    "num_comments": 27,
    "created_utc": 1682416319.0,
    "convurl": "https://i.redd.it/p90pmovhn1wa1.jpg",
    "comments": [
        "https://twitter.com/penpencildraw/status/1648666162132033539",
        "Nice piece of art Fr fr !!",
        "9/11 happened again because you did same sex marriage",
        "Plot twist , the man who didn't get to marry any girl decided to turn against the society as nothing left to do\n\n![gif](giphy|PUBxelwT57jsQ)",
        "Hrithik roshan from kaho na pyaar hai\n\nhttps://preview.redd.it/s4lihdco84wa1.png?width=92&format=png&auto=webp&v=enabled&s=8dd599852b4d312b1c8895b265a97a6c99ea5c43",
        "Unkills being unkills!",
        "Naaa man...it's the earthquakes caused by sodomy.",
        "It's Akshay Kumar jumping into action to save our sanskar",
        "Unchained",
        "I'm gonna blame my gay friend for the layoffs.",
        "Karthik marrying Karthik",
        "Karthicc 🥵",
        "That's society's problem, not the ones getting married.",
        "Why are they having a wedding when actual warheads are being lodged? They should join fight hand in hand with the rest of the comrads like the Thebans did.",
        "I’ll be so happy if that happens",
        "Nah Volcanic eruption",
        "I love the idea that couples can adopt kids. Those kids can save the society from collapsing."
    ],
    "cleaned_text": "doomsday penpencildraw  ",
    "cleaned_title": "doomsday penpencildraw",
    "cleaned_selftext": "",
    "cleaned_comments": "nice piece art fr fr happened sex marriage plot twist man didnt get marry girl decided turn society nothing left gifgiphypubxelwtjsq hrithik roshan kaho na pyaar hai unkills unkills naaa manits earthquakes caused sodomy akshay kumar jumping action save sanskar unchained im gon na blame gay friend layoffs karthik marrying karthik karthicc thats societys problem ones getting married wedding actual warheads lodged join fight hand hand rest comrads like thebans ill happy happens nah volcanic eruption love idea couples adopt kids kids save society collapsing",
    "light_cleaned_title": "Doomsday (penpencildraw)",
    "light_cleaned_selftext": "",
    "light_cleaned_comments": "Nice piece of art Fr fr !! 9/11 happened again because you did same sex marriage Plot twist , the man who didn't get to marry any girl decided to turn against the society as nothing left to do ![gif](giphy|PUBxelwT57jsQ) Hrithik roshan from kaho na pyaar hai Unkills being unkills! Naaa man...it's the earthquakes caused by sodomy. It's Akshay Kumar jumping into action to save our sanskar Unchained I'm gonna blame my gay friend for the layoffs. Karthik marrying Karthik Karthicc 🥵 That's society's problem, not the ones getting married. Why are they having a wedding when actual warheads are being lodged? They should join fight hand in hand with the rest of the comrads like the Thebans did. I’ll be so happy if that happens Nah Volcanic eruption I love the idea that couples can adopt kids. Those kids can save the society from collapsing."
}