{
    "id": "1366ssa",
    "title": "Karnataka polls 2023: BJP's Ashwath Narayan 'gets personal data of voters', sends messages to them",
    "url": "https://www.newindianexpress.com/states/karnataka/2023/apr/30/karnataka-polls-2023-bjps-ashwath-narayan-gets-personal-data-of-voters-sends-messages-to-them-2570844.html",
    "selftext": "WhatsApp messages sent to voters by sitting MLA and BJP candidate for Malleswaram assembly constituency C N Ashwath Narayan included their names, voter ID card number, relatives’ names and the booth address.",
    "flair": "Politics",
    "score": 501,
    "num_comments": 27,
    "created_utc": 1683077811.0,
    "convurl": "https://external-preview.redd.it/kfl-y17qxvqWHb6XxUVLgNsobKzsLOJygoL4MjsN7lY.jpg?auto=webp&v=enabled&s=f0ad3d088aee986adb818ad24e8a5c71c65a1b87",
    "comments": [
        "The Deccan Herald report pointed out, “While candidates contesting elections have access to the electoral rolls in image format, the Election Commission does not share mobile numbers with any candidates, nor are the numbers linked to the voter ID.\n\nThese developments took place just after the controversy over the theft of electoral data involving NGO Chilume had rocked the state.\n\nAccording to sources in the Election Commission, what is of concern is that the format of the data on sale is similar to the data stored on ERONET, a government portal with ECI data on voters that only election officials can access.",
        "Just got a message from him telling me to vote for bjp or he will..... put beef in my mouth",
        "Data protection laws in our country are a joke",
        "...and the Election commission.",
        "\"I was taking bath and felt a scratch on my back. It was a MLA who thought he could help me.\"\n\nI won't be surprised if this also happens in the next 10 days. To hell with privacy.",
        "> a government portal with ECI data on voters that only election officials can access  \n\nElection officials in turn can only be accessed by the BJP.",
        "They'll soon know what category I like and recommend a few videos of their own...",
        "He is the IT minister after all...",
        "Holy fuck",
        "Right now i got an automated call from bjp and it told to vote for the bjp mla of my constituency smh(not ashwath’s constituency tho)",
        "They don’t exist actually.",
        "nah they will go a step further and even watch it between the vidhan soudhas proceedings",
        "Wait .. do we even have one ?",
        "This is crazy. Should we start using alternate phone numbers and email addresses for government agencies like adhar, SBI, eci, electricity etc?",
        "ahem, I ment movies",
        "This happens everywhere. Not just by bjp. Even in 2005 when my dad got a nokia, we got these smss.",
        "It all started with Aadhaar linkage.",
        "BJP can do any attrocity and getaway with it... Because \"Hindus are in danger\" lolz",
        "Arvind Kejriwal has been doing this forever in Delhi. Everytime there is an election here, the phone will have 3-4 spam calls from AAP. \n\nBJP doing this is stupid and bad as well, but no political party is sacrosanct 😥😥",
        "RIP to data protection and privacy 😅😂🤣",
        "We have data protection laws?? \n\nSince when?",
        "That is the joke xD",
        "Spam calls are different. I have no idea what AAP did, but in this case it seems that the person contacted people directly knowing who they were not blanket mass spam calls to all numbers in a region. If AAP did the same then they are equal. Both are irritating, but this one is just creepy.",
        "*buys bottle of water for 10rs*\n\nWhat's your phone number?"
    ],
    "cleaned_text": "karnataka polls bjps ashwath narayan gets personal data voters sends messages whatsapp messages sent voters sitting mla bjp candidate malleswaram assembly constituency c n ashwath narayan included names voter id card number relatives names booth address ",
    "cleaned_title": "karnataka polls bjps ashwath narayan gets personal data voters sends messages",
    "cleaned_selftext": "whatsapp messages sent voters sitting mla bjp candidate malleswaram assembly constituency c n ashwath narayan included names voter id card number relatives names booth address",
    "cleaned_comments": "deccan herald report pointed candidates contesting elections access electoral rolls image format election commission share mobile numbers candidates numbers linked voter id developments took place controversy theft electoral data involving ngo chilume rocked state according sources election commission concern format data sale similar data stored eronet government portal eci data voters election officials access got message telling vote bjp put beef mouth data protection laws country joke election commission taking bath felt scratch back mla thought could help wont surprised also happens next days hell privacy government portal eci data voters election officials access election officials turn accessed bjp theyll soon know category like recommend videos minister holy fuck right got automated call bjp told vote bjp mla constituency smhnot ashwaths constituency tho dont exist actually nah go step even watch vidhan soudhas proceedings wait even one crazy start using alternate phone numbers email addresses government agencies like adhar sbi eci electricity etc ahem ment movies happens everywhere bjp even dad got nokia got smss started aadhaar linkage bjp attrocity getaway hindus danger lolz arvind kejriwal forever delhi everytime election phone spam calls aap bjp stupid bad well political party sacrosanct rip data protection privacy data protection laws since joke xd spam calls different idea aap case seems person contacted people directly knowing blanket mass spam calls numbers region aap equal irritating one creepy buys bottle water rs whats phone number",
    "light_cleaned_title": "Karnataka polls 2023: BJP's Ashwath Narayan 'gets personal data of voters', sends messages to them",
    "light_cleaned_selftext": "WhatsApp messages sent to voters by sitting MLA and BJP candidate for Malleswaram assembly constituency C N Ashwath Narayan included their names, voter ID card number, relatives’ names and the booth address.",
    "light_cleaned_comments": "The Deccan Herald report pointed out, “While candidates contesting elections have access to the electoral rolls in image format, the Election Commission does not share mobile numbers with any candidates, nor are the numbers linked to the voter ID. These developments took place just after the controversy over the theft of electoral data involving NGO Chilume had rocked the state. According to sources in the Election Commission, what is of concern is that the format of the data on sale is similar to the data stored on ERONET, a government portal with ECI data on voters that only election officials can access. Just got a message from him telling me to vote for bjp or he will..... put beef in my mouth Data protection laws in our country are a joke ...and the Election commission. \"I was taking bath and felt a scratch on my back. It was a MLA who thought he could help me.\" I won't be surprised if this also happens in the next 10 days. To hell with privacy. > a government portal with ECI data on voters that only election officials can access Election officials in turn can only be accessed by the BJP. They'll soon know what category I like and recommend a few videos of their own... He is the IT minister after all... Holy fuck Right now i got an automated call from bjp and it told to vote for the bjp mla of my constituency smh(not ashwath’s constituency tho) They don’t exist actually. nah they will go a step further and even watch it between the vidhan soudhas proceedings Wait .. do we even have one ? This is crazy. Should we start using alternate phone numbers and email addresses for government agencies like adhar, SBI, eci, electricity etc? ahem, I ment movies This happens everywhere. Not just by bjp. Even in 2005 when my dad got a nokia, we got these smss. It all started with Aadhaar linkage. BJP can do any attrocity and getaway with it... Because \"Hindus are in danger\" lolz Arvind Kejriwal has been doing this forever in Delhi. Everytime there is an election here, the phone will have 3-4 spam calls from AAP. BJP doing this is stupid and bad as well, but no political party is sacrosanct 😥😥 RIP to data protection and privacy 😅😂🤣 We have data protection laws?? Since when? That is the joke xD Spam calls are different. I have no idea what AAP did, but in this case it seems that the person contacted people directly knowing who they were not blanket mass spam calls to all numbers in a region. If AAP did the same then they are equal. Both are irritating, but this one is just creepy. *buys bottle of water for 10rs* What's your phone number?"
}