{
    "id": "16sq61j",
    "title": "Better alternative to One Nation One Election",
    "url": "https://www.reddit.com/r/india/comments/16sq61j/better_alternative_to_one_nation_one_election/",
    "selftext": "I am here to propose a alternative to one nation, one election which is to have **One Nation Three Elections**. As per my plan\n\n1. We increase the tenure of a elected official from five years to 6 years.\n2. Every second year we will have a election.\n3. First the Centre election, then the state election and finally the local body election.\n4. All this will happen synchronously across the entire country.\n5. In case a government falls, the tenure of this new elected government is tell the reminder of the six-year term.\n\neg- If you got disqualified in the fourth year and a new government is formed, its tenure will be there only for two years and after that you'll have to again go for fresh elections.  \n\n\nThis means the govt is only not functioning at fixed times and not haphazardly like now. I have gone in-depth at   \n[https://medium.com/changing-world/one-nation-three-elections-better-alternative-to-one-nation-one-elections-ee57484149ac](https://medium.com/changing-world/one-nation-three-elections-better-alternative-to-one-nation-one-elections-ee57484149ac)",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1695740030.0,
    "convurl": "https://external-preview.redd.it/TfiizEd5qnaYse_BHmGuohaRS0DdnkiZztBK0BrtM4o.jpg?auto=webp&s=1de9bacf0c2001a23d1a35546cc253f37d7fc927",
    "comments": [
        "The usefulness of stability of politicians job for the citizens is overrated and the power they have at the center and state level is too much concentrated.\n\nRather than making a country which highly depends on which politician is in center and thus a high-optics silicon valley CEO style working, we should focus on efficiency and continuity of working under rule of law."
    ],
    "cleaned_text": "better alternative one nation one election propose alternative one nation one election one nation three elections per plan increase tenure elected official five years years every second year election first centre election state election finally local body election happen synchronously across entire country case government falls tenure new elected government tell reminder sixyear term eg got disqualified fourth year new government formed tenure two years youll go fresh elections means govt functioning fixed times haphazardly like gone indepth httpsmediumcomchangingworldonenationthreeelectionsbetteralternativetoonenationoneelectionseeachttpsmediumcomchangingworldonenationthreeelectionsbetteralternativetoonenationoneelectionseeac ",
    "cleaned_title": "better alternative one nation one election",
    "cleaned_selftext": "propose alternative one nation one election one nation three elections per plan increase tenure elected official five years years every second year election first centre election state election finally local body election happen synchronously across entire country case government falls tenure new elected government tell reminder sixyear term eg got disqualified fourth year new government formed tenure two years youll go fresh elections means govt functioning fixed times haphazardly like gone indepth httpsmediumcomchangingworldonenationthreeelectionsbetteralternativetoonenationoneelectionseeachttpsmediumcomchangingworldonenationthreeelectionsbetteralternativetoonenationoneelectionseeac",
    "cleaned_comments": "usefulness stability politicians job citizens overrated power center state level much concentrated rather making country highly depends politician center thus highoptics silicon valley ceo style working focus efficiency continuity working rule law",
    "light_cleaned_title": "Better alternative to One Nation One Election",
    "light_cleaned_selftext": "I am here to propose a alternative to one nation, one election which is to have **One Nation Three Elections**. As per my plan 1. We increase the tenure of a elected official from five years to 6 years. 2. Every second year we will have a election. 3. First the Centre election, then the state election and finally the local body election. 4. All this will happen synchronously across the entire country. 5. In case a government falls, the tenure of this new elected government is tell the reminder of the six-year term. eg- If you got disqualified in the fourth year and a new government is formed, its tenure will be there only for two years and after that you'll have to again go for fresh elections. This means the govt is only not functioning at fixed times and not haphazardly like now. I have gone in-depth at [https://medium.com/changing-world/one-nation-three-elections-better-alternative-to-one-nation-one-elections-ee57484149ac](https://medium.com/changing-world/one-nation-three-elections-better-alternative-to-one-nation-one-elections-ee57484149ac)",
    "light_cleaned_comments": "The usefulness of stability of politicians job for the citizens is overrated and the power they have at the center and state level is too much concentrated. Rather than making a country which highly depends on which politician is in center and thus a high-optics silicon valley CEO style working, we should focus on efficiency and continuity of working under rule of law."
}