{
    "id": "la1psh",
    "title": "Budget Analysis 2020-21 - Fuel subsidy is down 60%, while the entire claims of 2.2L crore on health are a sham (2.2 L includes 35k on vaccines + 65K on some PM scheme which is to be distributed over 6 YEARS!!!)",
    "url": "https://www.reddit.com/r/india/comments/la1psh/budget_analysis_202021_fuel_subsidy_is_down_60/",
    "selftext": "&amp;#x200B;\n\n[Look at items on Petroleum and Healthcare - source - https:\\/\\/www.indiabudget.gov.in\\/doc\\/Budget\\_at\\_Glance\\/budget\\_at\\_a\\_glance.pdf](https://preview.redd.it/w7goehfgxue61.png?width=1412&amp;format=png&amp;auto=webp&amp;s=0b7525895da25dba1ceb6e14288f2a83785913fc)",
    "flair": "Policy/Economy",
    "score": 50,
    "num_comments": 3,
    "created_utc": 1612181490,
    "convurl": "https://b.thumbs.redditmedia.com/kMt4RKBcc-5IEO6rDZ9apQk1IcO0jLA5wEzJB0VFeYU.jpg",
    "comments": [
        "Anyone else agrees that the fuel price was deliberately increased before the budget so as to show a slash in price?",
        "The policy for this budget and the market reaction is best summarised as \"No News Is Good News\"",
        "Right check out NYC policy on it. Thanks"
    ],
    "cleaned_text": "budget analysis fuel subsidy entire claims l crore health sham l includes k vaccines k pm scheme distributed years ampxb look items petroleum healthcare source ",
    "cleaned_title": "budget analysis fuel subsidy entire claims l crore health sham l includes k vaccines k pm scheme distributed years",
    "cleaned_selftext": "ampxb look items petroleum healthcare source",
    "cleaned_comments": "anyone else agrees fuel price deliberately increased budget show slash price policy budget market reaction best summarised news good news right check nyc policy thanks",
    "light_cleaned_title": "Budget Analysis 2020-21 - Fuel subsidy is down 60%, while the entire claims of 2.2L crore on health are a sham (2.2 L includes 35k on vaccines + 65K on some PM scheme which is to be distributed over 6 YEARS!!!)",
    "light_cleaned_selftext": "[Look at items on Petroleum and Healthcare - source -",
    "light_cleaned_comments": "Anyone else agrees that the fuel price was deliberately increased before the budget so as to show a slash in price? The policy for this budget and the market reaction is best summarised as \"No News Is Good News\" Right check out NYC policy on it. Thanks"
}