{
    "id": "1f0zym1",
    "title": "Swiggy now citing “internal policies” to deny eligible refunds!",
    "url": "https://www.reddit.com/gallery/1f0zym1",
    "selftext": "After *multiple instances* of getting rotten groceries, it seems like they have updated their “policies”.\n\nThis isn’t just about a few bucks now, but the repeated hassle of dealing with bad products & the time lost. What’s the “policy” for reimbursing those?\n\nThere seems like there’s a lot of “understanding”, but all in vain.\n\nWhat I don’t get is the plausible deniability of borderline grifting hiding behind those “internal policies”.\n\nIt’s a regularity that about 25-50% of your grocery order WILL be rotten. 1kg tomatoes? 500gm rotten. 8kg potatoes? 2kg rotten. 250gm ginger? 100gm rotten. And the trend goes on. ",
    "flair": "Rant / Vent",
    "score": 54,
    "num_comments": 24,
    "created_utc": 1724602258,
    "convurl": "https://i.redd.it/279rh09y3ukd1.jpg",
    "comments": [
        "Policies to deliver rotten grocery and then conveniently deny refunds. No wonder they offer discounts just in case if they lose one customer 10 others are ready to sign up. Yikes. 🤡",
        "Tell them something like, speak about policy when i file this to consumer court.\n\nSometime a polite request doesn't give the refund, be a little rude, annoy them. Like saying escalate this issue. Keep opening new chats if they close.",
        "Not defending Swiggy but if You've had a couple of bad instances of getting rotten produce, why do You keep ordering via Instamart? Is it because of necessity or convenience?\n\nThe only food product I've ordered via Instamart is Pomegranate arils & have ordered 5 or 6 times. Luckily, it was good to consume.",
        "Big basket is way better \n\nEven if they deliver like in the evening or tomorrow morning. If you face quality issues you can always complain to the delivery agent.",
        "Email them.",
        "Correct, and I did say that I’ll bring this up on social media and pursue on consumer rights platforms. The only thing is, the agents have no power in this (afaik), so I ask them to forward this to their higher authorities; and here I am, creating awareness of this to fight unjust consumer “policies”. \n\nI’m, however, appalled by folks saying “but if you have had experiences like this, why do you still keep using their services?” Essentially, ad-hominem. What could possibly be said to them? Lol. \n\nAnyway, let’s see where this goes. I really wish we had strong consumer rights protection framework, like we see in the EU and such. We the people, need to unite, and look out for each other.",
        "I got a rotten coconut about a month ago. Like REALLY rotten, visibly so. When I complained they asked for a pic and then gave a refund. Maybe the policies have changed? \n\n\nSide note: how come potatoes are no longer available on Instamart???!",
        "I understand, however, this is basically ad hominem. Since texting lacks body language, I need to acknowledge that my tone isn’t of sarcasm or degrading; but I’m trying to inform how this kind of thinking only benefits mal-actors, against us, the people; you and me.\n\nConsider this: if a mishap occurs to you but not the rest, is the mishap justified because it didn’t occur to the majority?\n\nFor me, I use Swiggy because -\n\n1. I pay for Swiggy One, and I’m a regular customer because of our domestic consumption.\n2. Products that may not be available elsewhere are seldom found there\n\nNow, if an entity does something wrong, it *is* wrong, irrespective of - amount, magnitude, affected populace, rate, and kind.\n\nWhat’s wrong is wrong, and accountability is one of the key pillars of civilisation.\n\nHence, it’s important that we all stand together, and fight against “policies” that work against us, instead of justifying them (because sometimes, the justification may happen unintentionally too). I hope this was helpful and provided clarity :)\n\nCheers!\n\nhttps://preview.redd.it/d03uzhbhiukd1.jpeg?width=1170&format=pjpg&auto=webp&s=49ab476d7a02263abfc9509571cea54a3ac21951",
        "You need to email them, chat support of still no refund then file complaint in consumer court.You don't even need to appear in person .",
        "I think this is a very region-specific thing, as it is usually with produce…\n\nSo about the refunds, generally what I face is instant refunds after photographic / video evidence via their support. Everything was smooth, until recently, where they are stating that “their policies have changed”. \n\nThat, is where the question arises: was this done to curb on the smooth refund process? \n\nNow now, I understand that they may cite: “such a smooth refund policy may be prone to bad actors abusing such a system”. To that, I’ll say, that is baseless because refunds are processed only after proper evidence is provided (as I’ve mentioned earlier). \n\nTherefore, it’s clear that their new “policies” are anti-consumer. Instead of cracking down on their quality control, which clearly has issues, they are trying to grift their customers, you and me, like this. This ain’t a good look…",
        "It's just shady practice at this point because they know consumer court won't even read this. \n\n\nHave you tried big basket. I think it's better to explore more options. I had ordered diced pineapple from there but some of it were rotten. So they refunded without much hassle.",
        "Yeah that’s just unfortunate. Let’s see what we can do. \nHowever, we need to make noise about these things and unite. We are paying for every nook and corner, yet being treated as we are getting freebies or smth. \n\nRegarding BigBasket: so I think it’s all region-specific. \nI mainly use Swiggy Instamart, BigBasket BBnow, and Blinkit. It really depends on product availability. Price isn’t a factor in my case, because what you need, is what you need; and *usually,* skimping out on food products might always lead to bad experiences…\n\nNow for me, BigBasket has been somewhat worse when it comes to the rest. They have this tendency to deliver products in ways that damage the packaging. However, they do process refunds promptly. \n\nThe only issue is that, their ‘refunds’ are credited into the BBwallet, which I believe, isn’t completely ideal. I have e-commerce side businesses, and every time we have worked with banks and payment gateways, they have asked us to ensure “giving the customer the option to choose between refunds to their original payment source, or refunds credited to your own loyalty wallet system”. For example - Uber crediting back to your credit card, or as Uber Cash: they always ask you which works best for the customer and it’s upto their choice. \n\nAdding to that, BBnow may not have certain things that Swiggy Instamart has, so that seldom makes me use Swiggy or Blinkit. \n\nAnyway, the issue is that, we need to resist such anti-consumer “policies”, and make them retract such unjust practices. Hopefully, we all can do something about this.",
        "Bruh should use zomato",
        "Zomato’s Blinkit, right? \n\nI actually do use their service(s), but the main factor when it comes to choosing between Blinkit, Instamart, and BBnow; is - product availability. \n\nUpon considering that, it’s clear that it’s not about which service I use, but it’s about their quality control, consistency, and reliability. If this is happening to me, or someone else, “please use something else” isn’t a sound advice. Obviously, maybe they already have trying alternatives, but it’s not possible at all times. You have to consider that “policies” should be bilateral - favouring nobody, but holds up values that keeps every actor accountable: suppliers supply proper products, delivery agents delivery properly, company folks maintains infrastructure, and certain customers/anybody else in this can’t commit fraud/abuse the system. \n\nI hope you get what’s at stake here…",
        "Usually when you already claimed refund for 2-3 times in 3 month period from swiggy instamart. They will not issue any more refund for claim regarding any item missing/quality issue. Same is with blinkit",
        "That means there’s no accountability on their end after those 2-3 times, got it. So, how is this even fundamentally acceptable by any means? \n\nWe definitely need to have them change this, because it’s not like after 2-3 orders, they give us concessions or discounts for “no quality assurance after this”, do they? \n\nHopefully the point got across…",
        "What in the GPT is this crap?",
        "This is what happens when you replace humans with chatbots. \n\nThey invested too much in chatbots over customer care agents and chatbots are always going to be easy to fool unless you put in explicit  instructions like “never give refunds” so you can pray that you somehow escalate to a human agent who at that point will be doijg damage control or file a consumer complaint and send them a copy at which point they have to respond.\n\nInitially when swiggy started using chatbots you could even get a refund for a valid order that was delivered perfectly. Then they slowly started patching it up but instead of putting in safeguards for human intervention they just made the constraints more stringent and at some point it started backfiring",
        "In this case, it was a human from the get-go, but she couldn’t help much because of the new “policy changes”, which is the crux of the discussion - why is refund not eligible for a product that is clearly rotten?",
        "You're right, Swiggy is the worst when it comes to fruits and veggies. They overcharge, no quality checks and send bad produce constantly. You've probably asked for so many refunds their scam filter is activated. I suggest you start rotating apps by using other services if you can.",
        "https://preview.redd.it/7qzvo28hyykd1.jpeg?width=927&format=pjpg&auto=webp&s=3c15e5a0d74595d9ca38fd8a01f06d4c1f7ad587\n\nUPDATE: Swiggy has refunded the amount. We won folks. The just shall prevail! 🤝🏼",
        "https://preview.redd.it/20yfzktoyykd1.jpeg?width=927&format=pjpg&auto=webp&s=d7081c686e2d1535cae97e424c4e0cfedd976ab7\n\nUPDATE: Swiggy has refunded the amount. We won folks. The just shall prevail! 🤝🏼",
        "That’s really terrible to hear, thanks for elaborating the context! Yeah I regularly have to rotate across the apps anyway, due to availability of the products we need; so it’s sometimes BigBasket BBnow, sometimes it’s Blinkit; and if we can wait for 24-ish hours, it’s Amazon Fresh. \n\nUnfortunately, there comes situations where we *really* need a product immediately, which would be available only on Swiggy Instamart 🙁 and that’s the pickle!",
        "Stop ordering from them! Period. Go out and buy from local stores instead.",
        "Also tell your friends and family about this. And post on social media like this. Let more people know about how scammy and shady these companies are."
    ],
    "cleaned_text": "swiggy citing internal policies deny eligible refunds multiple instances getting rotten groceries seems like updated policies isnt bucks repeated hassle dealing bad products time lost whats policy reimbursing seems like theres lot understanding vain dont get plausible deniability borderline grifting hiding behind internal policies regularity grocery order rotten kg tomatoes gm rotten kg potatoes kg rotten gm ginger gm rotten trend goes ",
    "cleaned_title": "swiggy citing internal policies deny eligible refunds",
    "cleaned_selftext": "multiple instances getting rotten groceries seems like updated policies isnt bucks repeated hassle dealing bad products time lost whats policy reimbursing seems like theres lot understanding vain dont get plausible deniability borderline grifting hiding behind internal policies regularity grocery order rotten kg tomatoes gm rotten kg potatoes kg rotten gm ginger gm rotten trend goes",
    "cleaned_comments": "policies deliver rotten grocery conveniently deny refunds wonder offer discounts case lose one customer others ready sign yikes tell something like speak policy file consumer court sometime polite request doesnt give refund little rude annoy like saying escalate issue keep opening new chats close defending swiggy youve couple bad instances getting rotten produce keep ordering via instamart necessity convenience food product ive ordered via instamart pomegranate arils ordered times luckily good consume big basket way better even deliver like evening tomorrow morning face quality issues always complain delivery agent email correct say ill bring social media pursue consumer rights platforms thing agents power afaik ask forward higher authorities creating awareness fight unjust consumer policies im however appalled folks saying experiences like still keep using services essentially adhominem could possibly said lol anyway lets see goes really wish strong consumer rights protection framework like see eu people need unite look got rotten coconut month ago like really rotten visibly complained asked pic gave refund maybe policies changed side note come potatoes longer available instamart understand however basically ad hominem since texting lacks body language need acknowledge tone isnt sarcasm degrading im trying inform kind thinking benefits malactors us people consider mishap occurs rest mishap justified didnt occur majority use swiggy pay swiggy one im regular customer domestic consumption products may available elsewhere seldom found entity something wrong wrong irrespective amount magnitude affected populace rate kind whats wrong wrong accountability one key pillars civilisation hence important stand together fight policies work us instead justifying sometimes justification may happen unintentionally hope helpful provided clarity cheers need email chat support still refund file complaint consumer courtyou dont even need appear person think regionspecific thing usually produce refunds generally face instant refunds photographic video evidence via support everything smooth recently stating policies changed question arises done curb smooth refund process understand may cite smooth refund policy may prone bad actors abusing system ill say baseless refunds processed proper evidence provided ive mentioned earlier therefore clear new policies anticonsumer instead cracking quality control clearly issues trying grift customers like aint good look shady practice point know consumer court wont even read tried big basket think better explore options ordered diced pineapple rotten refunded without much hassle yeah thats unfortunate lets see however need make noise things unite paying every nook corner yet treated getting freebies smth regarding bigbasket think regionspecific mainly use swiggy instamart bigbasket bbnow blinkit really depends product availability price isnt factor case need need usually skimping food products might always lead bad experiences bigbasket somewhat worse comes rest tendency deliver products ways damage packaging however process refunds promptly issue refunds credited bbwallet believe isnt completely ideal ecommerce side businesses every time worked banks payment gateways asked us ensure giving customer option choose refunds original payment source refunds credited loyalty wallet system example uber crediting back credit card uber cash always ask works best customer upto choice adding bbnow may certain things swiggy instamart seldom makes use swiggy blinkit anyway issue need resist anticonsumer policies make retract unjust practices hopefully something bruh use zomato zomatos blinkit right actually use services main factor comes choosing blinkit instamart bbnow product availability upon considering clear service use quality control consistency reliability happening someone else please use something else isnt sound advice obviously maybe already trying alternatives possible times consider policies bilateral favouring nobody holds values keeps every actor accountable suppliers supply proper products delivery agents delivery properly company folks maintains infrastructure certain customersanybody else cant commit fraudabuse system hope get whats stake usually already claimed refund times month period swiggy instamart issue refund claim regarding item missingquality issue blinkit means theres accountability end times got even fundamentally acceptable means definitely need change like orders give us concessions discounts quality assurance hopefully point got across gpt crap happens replace humans chatbots invested much chatbots customer care agents chatbots always going easy fool unless put explicit instructions like never give refunds pray somehow escalate human agent point doijg damage control file consumer complaint send copy point respond initially swiggy started using chatbots could even get refund valid order delivered perfectly slowly started patching instead putting safeguards human intervention made constraints stringent point started backfiring case human getgo couldnt help much new policy changes crux discussion refund eligible product clearly rotten youre right swiggy worst comes fruits veggies overcharge quality checks send bad produce constantly youve probably asked many refunds scam filter activated suggest start rotating apps using services update swiggy refunded amount folks shall prevail update swiggy refunded amount folks shall prevail thats really terrible hear thanks elaborating context yeah regularly rotate across apps anyway due availability products need sometimes bigbasket bbnow sometimes blinkit wait ish hours amazon fresh unfortunately comes situations really need product immediately would available swiggy instamart thats pickle stop ordering period go buy local stores instead also tell friends family post social media like let people know scammy shady companies",
    "light_cleaned_title": "Swiggy now citing “internal policies” to deny eligible refunds!",
    "light_cleaned_selftext": "After *multiple instances* of getting rotten groceries, it seems like they have updated their “policies”. This isn’t just about a few bucks now, but the repeated hassle of dealing with bad products & the time lost. What’s the “policy” for reimbursing those? There seems like there’s a lot of “understanding”, but all in vain. What I don’t get is the plausible deniability of borderline grifting hiding behind those “internal policies”. It’s a regularity that about 25-50% of your grocery order WILL be rotten. 1kg tomatoes? 500gm rotten. 8kg potatoes? 2kg rotten. 250gm ginger? 100gm rotten. And the trend goes on.",
    "light_cleaned_comments": "Policies to deliver rotten grocery and then conveniently deny refunds. No wonder they offer discounts just in case if they lose one customer 10 others are ready to sign up. Yikes. 🤡 Tell them something like, speak about policy when i file this to consumer court. Sometime a polite request doesn't give the refund, be a little rude, annoy them. Like saying escalate this issue. Keep opening new chats if they close. Not defending Swiggy but if You've had a couple of bad instances of getting rotten produce, why do You keep ordering via Instamart? Is it because of necessity or convenience? The only food product I've ordered via Instamart is Pomegranate arils & have ordered 5 or 6 times. Luckily, it was good to consume. Big basket is way better Even if they deliver like in the evening or tomorrow morning. If you face quality issues you can always complain to the delivery agent. Email them. Correct, and I did say that I’ll bring this up on social media and pursue on consumer rights platforms. The only thing is, the agents have no power in this (afaik), so I ask them to forward this to their higher authorities; and here I am, creating awareness of this to fight unjust consumer “policies”. I’m, however, appalled by folks saying “but if you have had experiences like this, why do you still keep using their services?” Essentially, ad-hominem. What could possibly be said to them? Lol. Anyway, let’s see where this goes. I really wish we had strong consumer rights protection framework, like we see in the EU and such. We the people, need to unite, and look out for each other. I got a rotten coconut about a month ago. Like REALLY rotten, visibly so. When I complained they asked for a pic and then gave a refund. Maybe the policies have changed? Side note: how come potatoes are no longer available on Instamart???! I understand, however, this is basically ad hominem. Since texting lacks body language, I need to acknowledge that my tone isn’t of sarcasm or degrading; but I’m trying to inform how this kind of thinking only benefits mal-actors, against us, the people; you and me. Consider this: if a mishap occurs to you but not the rest, is the mishap justified because it didn’t occur to the majority? For me, I use Swiggy because - 1. I pay for Swiggy One, and I’m a regular customer because of our domestic consumption. 2. Products that may not be available elsewhere are seldom found there Now, if an entity does something wrong, it *is* wrong, irrespective of - amount, magnitude, affected populace, rate, and kind. What’s wrong is wrong, and accountability is one of the key pillars of civilisation. Hence, it’s important that we all stand together, and fight against “policies” that work against us, instead of justifying them (because sometimes, the justification may happen unintentionally too). I hope this was helpful and provided clarity :) Cheers! You need to email them, chat support of still no refund then file complaint in consumer court.You don't even need to appear in person . I think this is a very region-specific thing, as it is usually with produce… So about the refunds, generally what I face is instant refunds after photographic / video evidence via their support. Everything was smooth, until recently, where they are stating that “their policies have changed”. That, is where the question arises: was this done to curb on the smooth refund process? Now now, I understand that they may cite: “such a smooth refund policy may be prone to bad actors abusing such a system”. To that, I’ll say, that is baseless because refunds are processed only after proper evidence is provided (as I’ve mentioned earlier). Therefore, it’s clear that their new “policies” are anti-consumer. Instead of cracking down on their quality control, which clearly has issues, they are trying to grift their customers, you and me, like this. This ain’t a good look… It's just shady practice at this point because they know consumer court won't even read this. Have you tried big basket. I think it's better to explore more options. I had ordered diced pineapple from there but some of it were rotten. So they refunded without much hassle. Yeah that’s just unfortunate. Let’s see what we can do. However, we need to make noise about these things and unite. We are paying for every nook and corner, yet being treated as we are getting freebies or smth. Regarding BigBasket: so I think it’s all region-specific. I mainly use Swiggy Instamart, BigBasket BBnow, and Blinkit. It really depends on product availability. Price isn’t a factor in my case, because what you need, is what you need; and *usually,* skimping out on food products might always lead to bad experiences… Now for me, BigBasket has been somewhat worse when it comes to the rest. They have this tendency to deliver products in ways that damage the packaging. However, they do process refunds promptly. The only issue is that, their ‘refunds’ are credited into the BBwallet, which I believe, isn’t completely ideal. I have e-commerce side businesses, and every time we have worked with banks and payment gateways, they have asked us to ensure “giving the customer the option to choose between refunds to their original payment source, or refunds credited to your own loyalty wallet system”. For example - Uber crediting back to your credit card, or as Uber Cash: they always ask you which works best for the customer and it’s upto their choice. Adding to that, BBnow may not have certain things that Swiggy Instamart has, so that seldom makes me use Swiggy or Blinkit. Anyway, the issue is that, we need to resist such anti-consumer “policies”, and make them retract such unjust practices. Hopefully, we all can do something about this. Bruh should use zomato Zomato’s Blinkit, right? I actually do use their service(s), but the main factor when it comes to choosing between Blinkit, Instamart, and BBnow; is - product availability. Upon considering that, it’s clear that it’s not about which service I use, but it’s about their quality control, consistency, and reliability. If this is happening to me, or someone else, “please use something else” isn’t a sound advice. Obviously, maybe they already have trying alternatives, but it’s not possible at all times. You have to consider that “policies” should be bilateral - favouring nobody, but holds up values that keeps every actor accountable: suppliers supply proper products, delivery agents delivery properly, company folks maintains infrastructure, and certain customers/anybody else in this can’t commit fraud/abuse the system. I hope you get what’s at stake here… Usually when you already claimed refund for 2-3 times in 3 month period from swiggy instamart. They will not issue any more refund for claim regarding any item missing/quality issue. Same is with blinkit That means there’s no accountability on their end after those 2-3 times, got it. So, how is this even fundamentally acceptable by any means? We definitely need to have them change this, because it’s not like after 2-3 orders, they give us concessions or discounts for “no quality assurance after this”, do they? Hopefully the point got across… What in the GPT is this crap? This is what happens when you replace humans with chatbots. They invested too much in chatbots over customer care agents and chatbots are always going to be easy to fool unless you put in explicit instructions like “never give refunds” so you can pray that you somehow escalate to a human agent who at that point will be doijg damage control or file a consumer complaint and send them a copy at which point they have to respond. Initially when swiggy started using chatbots you could even get a refund for a valid order that was delivered perfectly. Then they slowly started patching it up but instead of putting in safeguards for human intervention they just made the constraints more stringent and at some point it started backfiring In this case, it was a human from the get-go, but she couldn’t help much because of the new “policy changes”, which is the crux of the discussion - why is refund not eligible for a product that is clearly rotten? You're right, Swiggy is the worst when it comes to fruits and veggies. They overcharge, no quality checks and send bad produce constantly. You've probably asked for so many refunds their scam filter is activated. I suggest you start rotating apps by using other services if you can. UPDATE: Swiggy has refunded the amount. We won folks. The just shall prevail! 🤝🏼 UPDATE: Swiggy has refunded the amount. We won folks. The just shall prevail! 🤝🏼 That’s really terrible to hear, thanks for elaborating the context! Yeah I regularly have to rotate across the apps anyway, due to availability of the products we need; so it’s sometimes BigBasket BBnow, sometimes it’s Blinkit; and if we can wait for 24-ish hours, it’s Amazon Fresh. Unfortunately, there comes situations where we *really* need a product immediately, which would be available only on Swiggy Instamart 🙁 and that’s the pickle! Stop ordering from them! Period. Go out and buy from local stores instead. Also tell your friends and family about this. And post on social media like this. Let more people know about how scammy and shady these companies are."
}