{
    "id": "14z2kcg",
    "title": "Brics Currency Coming?\n\nThere could be a huge announcement at the upcoming BRICS summit in Johannesburg.  Speculation is rife that the bloc will launch a new currency - to rival the dollar.  This has been fuelled by the latest noises coming out of the host nation. ",
    "url": "https://v.redd.it/huri5m1d2ubb1",
    "selftext": "\n\nThere could be a huge announcement at the upcoming BRICS summit in Johannesburg.  Speculation is rife that the bloc will launch a new currency - to rival the dollar.  This has been fuelled by the latest noises coming out of the host nation.  With member countries expected to account for half of global GDP by 2030, it makes sense.  And it would also bullet-proof them against dollar-linked US sanctions.  Looks like the time is approaching when the greenback will have a fight on its hands for dominance.",
    "flair": "Policy/Economy",
    "score": 1,
    "num_comments": 0,
    "created_utc": 1689298035.0,
    "convurl": "https://external-preview.redd.it/dHB4N3N1emMydWJiMZ5BNk-3oq8lb3IbXoocX7FK-NoC6Y4RJSnx3g8p_Ejn.png?format=pjpg&auto=webp&s=b45843a3c63a42d30347aafbe3236b5ab0c80c9f",
    "comments": [],
    "cleaned_text": "brics currency coming could huge announcement upcoming brics summit johannesburg speculation rife bloc launch new currency rival dollar fuelled latest noises coming host nation could huge announcement upcoming brics summit johannesburg speculation rife bloc launch new currency rival dollar fuelled latest noises coming host nation member countries expected account half global gdp makes sense would also bulletproof dollarlinked us sanctions looks like time approaching greenback fight hands dominance ",
    "cleaned_title": "brics currency coming could huge announcement upcoming brics summit johannesburg speculation rife bloc launch new currency rival dollar fuelled latest noises coming host nation",
    "cleaned_selftext": "could huge announcement upcoming brics summit johannesburg speculation rife bloc launch new currency rival dollar fuelled latest noises coming host nation member countries expected account half global gdp makes sense would also bulletproof dollarlinked us sanctions looks like time approaching greenback fight hands dominance",
    "cleaned_comments": "",
    "light_cleaned_title": "Brics Currency Coming? There could be a huge announcement at the upcoming BRICS summit in Johannesburg. Speculation is rife that the bloc will launch a new currency - to rival the dollar. This has been fuelled by the latest noises coming out of the host nation.",
    "light_cleaned_selftext": "There could be a huge announcement at the upcoming BRICS summit in Johannesburg. Speculation is rife that the bloc will launch a new currency - to rival the dollar. This has been fuelled by the latest noises coming out of the host nation. With member countries expected to account for half of global GDP by 2030, it makes sense. And it would also bullet-proof them against dollar-linked US sanctions. Looks like the time is approaching when the greenback will have a fight on its hands for dominance.",
    "light_cleaned_comments": ""
}