{
    "id": "13h3h8x",
    "title": "Can anyone please give an unbiased and balanced explanation of why Raghuram Rajan keeps insisting that India should stick to Services and not go into manufacturing semiconductor or investing in semiconductor foundries?",
    "url": "https://www.reddit.com/r/india/comments/13h3h8x/can_anyone_please_give_an_unbiased_and_balanced/",
    "selftext": "Last time I recall reading him saying something similar to this was in 2021 or 2022 perhaps, when he has been saying India shouldn't go into Manufacturing. This  news article in 13th May 2023 is really intriguing that keeps on  repeating that. Why does he think India should stick to services? India  lost out a due to giving away manufacturing since 2004 to China. Out  middle economic sector is weak and like the torso of a human, a well  established manufacturing base is the most resilient section of the  economy. Manufacturing sector is the source of the middle class. India  wouldn't have developed a strong middle class if it wasn't for the  liberalization of manufacturing sector by PV Narasimha and Manmohan  Singh.\n\nHe keeps on saying \"India  should not go into manufacturing of chips as they are available in  abundance\", was there really an abundance of chips during and after  Covid? He is asking not to invest resources into semiconductor foundries  as India is \"deep resource strapped country\", as if Japan and Taiwan  are very resource rich countries that they could have their own domestic  semiconductor foundries? This reminds of the narrative when western  countries used to give reasons for why India shoulnd't go into space  industry because India was too poor then.\n\nMay  be he has said things somewhere that explains his position elaborately  that actually makes sense but I didn't get the opportunity to read that.  I fairly try to avoid reading much news cause then it becomes difficult  to avoid reading political news. I am just a 12th grade student aspiring to study in circuital branches and may be go into semiconductor industry  so I mostly try to read tech news from time to time.\n\nCould anybody please provide a balanced explanation that justifies Raghuram Rajan's position?\n\n[https://www.moneycontrol.com/news/business/economy/indias-growth-path-lies-in-liberal-democracy-to-earn-worlds-trust-raghuram-rajan-10578561.html?utm\\_campaign=fullarticle](https://www.moneycontrol.com/news/business/economy/indias-growth-path-lies-in-liberal-democracy-to-earn-worlds-trust-raghuram-rajan-10578561.html?utm_campaign=fullarticle)",
    "flair": "AskIndia",
    "score": 174,
    "num_comments": 94,
    "created_utc": 1684041740.0,
    "convurl": "https://external-preview.redd.it/G68cDdACnqGsGIKp6gj6wy8mo__KI90MawrtvL5snKM.jpg?auto=webp&v=enabled&s=059ef21162ba0e819d67edce2de4228a73423457",
    "comments": [
        "Semiconductor oversupply lasts for 10 years and US has tight control on supply chain. USA adds max value around 37%. We will be doing low level work on a over supply market.  \nForget about RR and read Semiconductor industry analysis and please do not engage in whataboutism.  \nAlso, India is doing well on chip design front. Adding on strength is the way to go ahead.",
        "Don't forget this was the guy who had the brilliant idea if introducing Islamic banks into the Indian Financial sector. Take whatever this shitstain spews with a grain of salt.",
        "For the semi conductor industry there are different products manufactured by different companies and they are like Electronic mafia.\n\nProcessor - TSMC\n\nCamera - Sony\n\nRAM - Samsung\n\nEg: For processor making, we're getting good into designing those and US along with the Dutch wants to reduce processor monopoly from China - This opens a small door of opportunities.\n\nCamera - can't do anything until Sony plans to expand into India or else small companies struggle really hard to sustain.\n\nOther components, We can but have significant risk involved due to high cost & regulations in India.\n\nGetting into electronics have good risk, while software products are going good.\n\nWe should have both imo, for that we need more support from government.",
        "The share of Indian manufacturing as percentage of GDP has stagnated for a while now. Multitude of factors have led to this. Here's an in depth article that tries to explain the issue. Having said that maybe just maybe there could be some impetus in the future.\nhttps://scroll.in/article/992066/despite-the-make-in-india-push-the-share-of-manufacturing-sector-in-the-gdp-has-stayed-stagnant",
        "In addition these are longterm (really very longterm things). One does not get into these without sufficient backing (may be some one like Reliance can do it with deep pockets - even they wont enter such things). \n\n\n\nThough one thinks we have brightest minds it is at a different league. Yes, it is also to do with who wants to buy from us. TSMC and others move to US as there is $B level encouragement. And one can't do these nano metres chips immediately. Slow progress. If India makes a 30 nm chip that works at the speed of 2000 mobile phone will you like it? or even buy it?\n\n- One needs to hire some top notch person to first instill confidence in the industry - this will be difficult.\n\n\ntldr; they need to do it like nuclear industry. form some tie ups to get started. Unfortunately, chip has not become national security. So no one would do this anymore - unless it benefits them. \n \n- Talent. Even the brightest minds (from any university or IIT) likely move to US when given $. We don't dare to invite bright people from Africa (all another topic for controversy)...\n\n- Patents: This is a nightmare. Anything one touches can be sued. \n\n- You won't get equipment to manufacture if one disagrees with gay rights etc (with  West). Again it works for china as they somehow West is dependent on their cheap goods.\n\n- supply chain. These need some very special items that are available from across the world. (Yes, India does not have all raw materials - though some won't even believe this - or if it is there our manufacturers can't get it to such purity) . This means importing from outside. (Our whole ecosystem of manufacturing needs to up the game - for example, if you buy a steel flask from Japan look at its finishing, perfection - we don't do it here...)\n\n\n- Ecosystem: There is too much animosity between India (and China/S.E Asia). One does not read that much but it is not like Vietnam or Taiwan are superfriendly. All have their own agendas. Even with western democracies our fellows often annoy them. This is not helpful\n\n(you may ask why does it work for china/taiwan - it works because US/West are still dependent on them. US/West has very few dependencies on India. We export too little and they are not that important stuff. (Sorry Pichai and Nadella!!! Jokeing)).\n\n- Or one needs a maverick investor like Elon to just bring 1000 robots and 20 engineers (+ 20000 cleaners to build factory. Unlikely to happen because (all parties) run country like families. Any one white saying anything will be put down.\n\n- In an ideal case, some one from India (likely Reliance or Tata) buys some foundry and then slowly moves production but they are intelligent\n\n - Tata (even owning all of Jaguar/Aston Martin) will never move production to India. Needs talent etc. We still have the opinion - 'sab kuch chalega'. Things in high value are made really with passion. \n\n(Take some handweaver in silk saree or that type)\n\n- We need that mentality in IT and industry. Our guys are often - lets go for money - all sorts of 'maska lagana promotion le lya.. jugaad etc. That is not manufacturing..\n\nWe don't need to be masters at everything. Do what we are fine to the best... Lets start there.",
        "Maybe he learned it from US and UK which have financial institutions that provide services for Islamic banking. I guess if IT cells existed in those countries they would have come up with some slogan maybe bank jihad or pound jihad",
        "The concept of Islamic bank involves lending money to people at no interest. Because in Islam earning interest on money lent is haram. Can you imagine a bank running without making any money? Raghu ram Rajan wanted to cripple the Indian financial sector. To a country where common people are as addicted to free stuff like drugs, politicians promising freebies for swinging elections, where no one has an insight for the future or the economy, this would have proved disastrous. Maybe to a civilised and ultra capitalistic society (like the US or UK) this would have worked helping small businesses on interest free loans. But to a bunch of financially illiterate and irresponsible folk such as us, it's a one way ticket to hell.   \nYou dont need an IT cell to give you a lecture on the basics of how the economy is operated.",
        "Margins for manufacturing sector is ~5-10%. Margin for service sector is ~40-50%. So starting factory in india is almost like doing agriculture which has almost same margin. You can verify it in RBI database of indian economy(click corporate sector).  \n\nSecondly the moment anyone else gives better incentives or govt cant afford/removes incentives like PLI, (eg for companies like Foxconn) they will shift factory somewhere else. Already they are making states compete with each other on who gives more freebies to them. Race to bottom with high risk if they leave.\n\nLook at textile industry or auto sector. Both have been around for a long time. They have lot of experience and are not trying enter totally new fields (like semiconductors) and compete against huge giants. But still they are struggling. Why they are not producing for the whole world? Tata Motors cant even get to 5% margin and that too after buying Jaguar in UK and mostly selling to Luxury market. And that is Tata as well managed a company can be in India. Not saying some large firms wont have success or India wont produce big player. \n\nBut if govt wants to encourage it on large scale there is a huge capex bill. Which is going to be paid by cutting social spending or massive borrowing with no big guarantees it will pay off.",
        "One shouldn't extrapolate so much. Stick to basics.",
        "Wow your hate for PM has turned to hate for the normal people?",
        "China has mfg sector from way before 2004. Doubt believe propaganda. Study facts. We just can't compete with china. So Dr. Singh or Rajan said so.",
        "Written by Chat GPT",
        "You are totally right sir, I'm gonna go and collect by 5kg free grains from the government and also  equity participation from the business",
        "Ehh… \nWhen I was assessing deals I looked at Islamic finance- it’s not got direct interest, sure. But there are multiple other ways that they get the time value of money of out it. They have structures where the institution buys the heavy machinery, and ownership is transferred from the bank to the applicant over years.\n\n\nThe time period of transfer would essentially be the payment scheme.\n\nThat’s just one structure that exists.",
        "Data has leftist bias, new things I learned today. Gotta appreciate the Internet.",
        "You forgot Dutch Monopoly via ASML",
        "Yup they're like the old guy in monopoly game most of the tings are based on them.",
        "Edit: for the record, I would argue for manufacturing led growth until some time earlier this year. \n\nYou are getting some poor responses.\n\nShort answer is that - \n\n\n- 1) manufacturing now is largely automated. It no longer employs swathes of people, which is what China used to generate employment.\n\n\n- 2) Semiconductors: this takes a crap ton of water. The shortage a year or so ago was because there was a water shortage in Taiwan. Semiconductor is also a massively capex driven industry; it’s one of the weirdest industries when you see it for the first time.\n\nThe fabs are out of date the moment they come online. The depreciation on them is absurd.\n\n\nSource - I used to be an analyst, and was part of semiconductor deals for clients myself. \n\n~~For the mfg part there’s a video between Pramod bhasin and Bannerjee where they talk about it.~~ got this wrong.\n\n\nI’m looking for other sources - but here’s WB, 2017: https://www.worldbank.org/en/topic/competitiveness/publication/trouble-in-the-making-the-future-of-manufacturing-led-development\n\nHere’s a more recent article:\n\nhttps://economictimes.indiatimes.com/news/economy/policy/the-world-cannot-afford-india-to-follow-chinas-manufacturing-growth-model-says-raghuram-rajan/articleshow/94890414.cms?from=mdr\n\n\nHis further points:\n\n1) Services gets distributed around the nation and not concentrated in single places.\n2) Its not climate harmful\n\nTheres many sources on automation vs Mfg online. I cant remember the article that was that last brick in the wall that changed my mind. If I find it, I’ll update this message.\n\n\nFound this: \n\nhttps://www.deccanherald.com/specials/manufacturing-or-services-we-need-both-and-more-1161839.html\n\nMost of his reasoning is covered here.\n\nThis is good, the better point is that China’s model depended on sales to the US/EU (and the yen carry trade too). We dont really have that same trade environment today. Protectionism is on the rise.\\\n\n\n\n——————-\n\n\nPersonal point:\n\nWell, fucking crap. If MFG isnt an option, what the heck is left. Employment is already crap, and we have too many people searching for jobs.\n\nGetting people educated is HARD. Anyone who talks to me about “we should educate people” gets an earful. \n\nEducation takes TIME, it means your student can focus, it means that they dont have to worry about survival, they have access to study material, teachers etc.\n\nIt takes a LOT to train a brain. Skilling people in India? Right now, I dont see it happening.\n\nOn a more humorous note, this ruins many of my arguments which I use to torment people in economic discussions. I can’t force people to choose between the environment and employment anymore.",
        "Arey, have you ever heard about humor/joke",
        "I don't have a concrete answer. But, just wanted to thank other people who provided their answers. For a change it feels good to read informative and actually unbiased answers(atleast most of them :) )",
        "India does not necessarily have to stick to services and avoid getting into semiconductor manufacturing or investing in foundries. There are both advantages and challenges for India in pursuing semiconductor manufacturing.\n\nAdvantages:\n1. Growing demand: The global demand for semiconductors is growing rapidly, and India could capitalize on this demand to develop a strong manufacturing sector.\n2. Diversification: Investing in semiconductor manufacturing can diversify India's economy, reducing overreliance on the services sector and promoting more balanced economic growth.\n3. Job creation: A robust semiconductor manufacturing sector could create numerous high-paying jobs, contributing to social and economic development.\n4. Technological advancement: Investing in semiconductor manufacturing can drive innovation and strengthen India's overall technological capabilities.\n5. Reducing import dependency: Building a domestic semiconductor manufacturing base can reduce India's dependency on imports, thereby improving its trade balance and self-reliance.\n\nChallenges:\n1. High initial investment: Semiconductor foundries require massive capital investments, making it a challenge for India to compete with established players.\n2. Skilled workforce: Developing a skilled workforce for semiconductor manufacturing could be a long-term challenge, as the industry requires highly specialized knowledge.\n3. Infrastructure requirements: Semiconductor manufacturing requires a highly stable power supply, clean water, and advanced transport infrastructure, which may be lacking in some parts of India.\n4. Environmental concerns: Semiconductor manufacturing processes involve hazardous materials and generate waste, which could pose challenges in terms of environmental sustainability and regulatory compliance.\n5. Global competition: India would face intense competition from established players in countries like the United States, China, Taiwan, and South Korea.\n\nOverall, India can consider investing in semiconductor manufacturing or foundries, but it must carefully weigh the potential benefits against the challenges. A comprehensive strategy that addresses the challenges leverages the country's strengths and promotes collaboration between the government, private sector, and research institutions would be crucial for success in this endeavour.\n\nChatGPT 4",
        "Moving a service industry is easier than moving a factory, specially a semiconductor factory.",
        "Services offer returns quickly. Manufacturing is a long term game. And return may take upto ages. Also we can't beat chinese Manufacturing,  They have made it to next level now. The quality and scale is next level.",
        "The PM unfortunately has no credentials. There's no hate or love. The man and his party is unworthy to lead this country. But he is. So I guess that's that.",
        "Don't forget the free poison from the VishaKanya and liquor bottle from your friendly Congress MLA.\n\nAlso Bangladesh and Pakistan practice Islamic banking as well. One country is going bankrupt and the other had to take $4 billion credit line from IMF to survive the current currency crisis.",
        "That is not true. Trained IT labour is in surplus in India. And service sector margins come from availability of cheap trained labour. Manufacturing margins depend much more on capital not labour.",
        "Limited resources should be allocated in manner that maximises the benefits to Country.\n\nHe feels that by providing PLI for manufacturing in multitude of sectors, we are not allocating resources in best possible way. Because we are not competitive in Manufacturing.\n\nWith similar allocation of resources to Service Industry we can, not only increase competitive edge, also can outsmart rising competition and continue to grow in existing areas and venture into new sector. \n\nService Industry has better payment, distributes wealth to greater number of people; ensues in greater demand for manufacturing, healthcare,  services, housing ...etc.. Which results in lower inequality, growth of manufacturing base and employment of large number of unskilled people in manufacturing and industry that caters to people of export oriented service Industry.\n\nFurther for manufacturing industry to have competitive advantages labour wages should be lower, we are not having great advantage in that area as labour wages have increased. Therefore the limited advantages in labour cost that we have now won't last long and our manufacturing base will become uncompetitive.\n\nOn other hand, govt thinks large unskilled masses should be employed in manufacturing industry to overcome unemployment. Therefore govt has brought out PLI for manufacturing industry.\n\nIMHO, Rajan appears more circumspect. Our Service export specially software Sector has done great and we are expanding into areas like accounting, medicine, education....etc. which hold immense potential given large pool of people with expertise in these areas in India. Therefore we should incentives this sector.\n\nOn other hand, govt has expanded PLI to multitude of sectors, results of that is not great, most of the money has gone to cronies. Except in Cellphone/Smartphone manufacturing we have not done well in other areas. In Smartphone sector, success is not necessarily is PLI driven. There are two factors that hold importance - first one is Apple wants to shift supply chain away from China and second next phase of growth for Apple would come from India(this is what that company thinks).",
        "service industry can create more jobs. India has a huge population. that can be both an advantage and a curse. depending upon how it is used.\nRr views are in consideration of this advantage.\nIndia does not have that much capital so as to compete in manufacturing. also manufacturing does not generate that many jobs.",
        "AI.",
        "He specifically only said about semi conductor not all of manufacturing sector.",
        "Manufacturing we would need to complete with other countries for cheap labour, resources. Additionally I feel it’s short term, manufacturing will be the first to be automated and thus again loosing out jobs.\n\nServices we already have a good network and and the brain capital.\nIt’s basically replicating Blore, Pune to other cities. Plus more money per capita. \nA mix of the 2 but focusing on Service would be the better way to go.",
        "This is the right answer when it comes to semiconductors.",
        "The most we can do at this point for the semicon industry is assembly and testing…he is right, we should continue to grow where our strengths lie. \n\nClean water is a problem where soda companies are under pressure to operate during droughts and consume a lot of energy, and FABs (Fabrication Units) can’t function without lots of either and other supplies and any shortages with billions of dollars (cost of building one) are at stake is draining to say the very least.\n\nIf the government serious about it, the supply chain needs to be established first and it may take a lot of time before we start setting up our first FAB.",
        "Reading that article, it feels like all he's trying to say is that it's a resource intensive industry and we should rather focus on other things that aren't as resource intensive. \n\nI don't like this argument (mighty pompous of me to disagree with this legend lmao)\n\nBut seriously, semiconductors are of national importance. You cannot look at them with the same lens as other products. These nifty things are required for the economy to function. \n\nFuck economics. Fuck P&L. Fuck supply chains. If our country is ever embargoed, we'll need domestic capacity to cater to our needs. That alone is a good enough reason to invest in this industry. Semiconductors are a matter of national importance.\n\nI feel like RR is looking at this from a purely economic angle whereas the vision for this industry needs to be much broader.",
        "Major drawbacks of manufacturing semiconductor is US monopoly on it, Japan tried to make their own and US bureaucracy shut it down then china tried and US again worked to shut it down but they are catching up to US now. Also the machines required to make one comes from one company in Netherlands, and it’s pretty tedious and costly process to make one.",
        "And did I say anything of pm or his worthiness? You guys are so obsessed that you don't even understand my comment , it's about discriminatory views about Gujarati...",
        "Some 5 years back we wanted to open a production unit in India. We gave up after a test run...\n- Traffic situation was a nightmare. We were never able to ship a packet on time\n- For one position we received close to 900 applications and none of the short listed candidates could handle a tweezer properly or move a relatively large diode (2mmx1mm) from one gelpack to another",
        "Tell me one country who has gone from filthy poor to rich from service sector. India is the most populous country now and to generate tons of job manufacturing is the only way to employ these many people. Service sector needs more skills , education and it employs way less than manufacturing sector.",
        "I am working in the semiconductor industry in Europe. I recently did a customer visit to see a semiconductor fab. Don't imagine them to be old factories , they are highly automated, futuristically designed. If you start creating the semiconductor factory, there are many auxiliary technical suppliers which need to support you. I saw that you need to work with almost 20 different suppliers to start a semiconductor fab. It is crazy but it doesn't bring a lot of technology back to india. It is difficult but not impossible.",
        "Not just water but Ultra Pure Water.",
        ">. If India makes a 30 nm chip that works at the speed of 2000 mobile phone will you like it? or even buy it?\n\nYes, your presumption rests on the fact that most semiconductors are cutting edge, overwhelming majority of semiconducters being produced are not. There are even new 300 and 200 nm process plants being built right now.",
        "Manufacturing is not that labour intensive everything is done by machines you can't generate that much employment now india should have focused on manufacturing in 1970",
        "People supporting him are clueless. If you want to be a weapon making powerhouse, or a car manufacturing hub, you need to reliably produce chips to support that. If you don’t, you’re at the mercy of Taiwan, USA, Korea, and China to supply that. All it takes is a threat of sanctions and you’re pretty screwed if you don’t have your own access to machinery and supply chains. \n\nThe good news is, you don’t need to build 3nm chips to be competitive. Even a 65nm node is sufficient simply because your use case is not HPC rather industrial and military.",
        "Semiconductor manufacturing is Achilles heel for not just India but China, Russia US EU and everyone else. But the fact is no one can build this industry. They tried but failed because of market economy and technological requirements. \n\nMany people don't know but India tried Semiconductor manufacturing and failed miserably. It's a very high end technical stuff and requires at least 3 Billion dollars to built a small fab. That's not end of it, it requires update every decade. We can try again but chances are we will end like others. But before you build it, you should know how to build them. Only people are Taiwanese and they are not going to help anyone. \n\nWe are at least two decades behind in cutting edge tech. Even if we spend decades building the tech we still can't compete with likes of TSMC. That means our product will be costlier than others. There is no logic behind this. \n\nTSMC builds the most advanced chips in the world but these chips are designed in US. What are the odds that US will give their designs to India ? With India low key taking side of Russia in this conflict means we will never get high end machines from ASML. ASML is the only company in the world that builds lithography machine. And it's a geopolitical nightmare getting these machines from them. \n\nIt's a lost cause everyone who tried building semiconductor manufacturing failed. UK EU US Russia China all of them have tried and failed. Although you can say Chinese are still doing much better than others. \n\nBut we shouldn't give up, India should build it's own low end semiconductor manufacturing and have a multi decade plan on building it's own infrastructure for semiconductor tech. India already has decent amount of manufacturing capacity which is good enough for us.",
        "I am not entirely agreeing to his point on the services especially when we are staring at the AI led optimisations that may slowly but surely eat up the services jobs. We need to create the hi-tech ecosystem that could work in conjunction with the local design talents. We are several nano meters behind in the indigenisation which should shield us from the NATO led monopoly in the supply of crucial third party components. We need to think in terms of at least collaborating with the ASML and have our local variants for the tech that currently ASML monopolises . I think Rajan's point of view is from the low margins/yields from the Chinese / Taiwanese semiconductor factories and the need to manage the supply chain and demand cycle. This market is highly competitive and dynamics both in terms of the technology and demand changes every six months. He might be concerned with the US which finally pulls  the strings leading it to a scenario like the garments manufactures. That said for the amount of investment that goes in versus the employment it generates is miniscule, or may be something of  significance in the supply chain side but as such very low.",
        "Boss I'm from Mumbai, we mumbaikars on old India and in new India always kept our target richer countries. Pakistan and Bangladesh are targets for bottom of the barrel folks. For us they are not worthy of competition or consideration. We aim higher and strive to achieve those aims without bringing pedantic religion in every debate. All the best.",
        "Semi conductor is not one location business. It involves a lot of countries.",
        "Yes chief that's what I wrote",
        "As compared to services it's very labour inducive, how many IT workers can realistically find employment ? Also only a tiny sliver of population can work in such field vast majority ends up doing menial jobs for them.",
        "India has 1 million new entrants into job market every month, I really doubt just service sector can create that many jobs.",
        "Manufacturing surely cannot. Service sector also includes hospitality sector, places where people are required to face customers.",
        "People used to say that automation & 3D printing will change or remove humans from manufacturing, but it's the opposite now , automation for a multipurpose tech is incredibly expensive but unlike general purpose AI, we will see huge cost cutting in the service sector in the coming 4-5 yrs.\n\nAlso, semiconductors will be right after oil in terms of expending foreign reserves. So having a foot in the game will help us immensely.\n\nThe job we have today either pays very little in core or too much in software, there is no in between. We need that otherwise there is no way to decrease income inequality without taxing the rich to death.",
        "Manufacturing absolutely could, provided India reorient itself into a manufacturing nation and goes all out like China did, just giving up isn't an option. There are limits to automation, a robot still can't assemble a mobile phone that's why Foxconn employees 70,000 workers in India.\n\nThe type of jobs in Hospitality that you are imagining can't provide 10 million jobs, neither can manufacturing alone as such both are needed in their maximum possible job generation capacities.",
        "It requires lots of capital. Which sadly India lacks and has almost poor access to.\nAlso it takes lots of time to set up and implement. Having a good infrastructure to transport good is also required.",
        "I don't like defeatist attitude of giving up even before starting, India's manufacturing output today is roughly equivalent to China's in late 90s- early 2000s.\n\nIf they would given up back then they won't be a juggernaut they are today, frankly we don't have any option but to do what China did because otherwise our vast majority of population is destined for eternal squalor.",
        "He is an economist. He thinks in terms of numbers. To him, the numbers say it is a game of diminishing returns. \n\nUnfortunately, economic development and socio-economic development doesn't always work that way. You need to go forward, break ground and take action.\n\nWe had every chance to be a manufacturing nation and failed. So, he has given up and says we should stick to services, effectively conceding we aren't good at anything else.\n\nPersonally, coming from a state with nearly 200+ years of manufacturing history and which has exported finished goods all over the world for a longer time, I do not want an economy completely focused on services. We cannot go on stuffing people into IT offices or pushing them into the hospitality sector. We need to be smart on what we make. \n\nThe state government here has actually made a smart decision here by inviting foreign governments to set up ground level R&D centres in polytechnic institutes on two next-gen products- Electric Vehicles and Solar Technology. This is exactly the kind of initiative needed. Surgically educate a section of population and turn them into experts, let that talent bleed into the industries and it becomes a self-sustaining loop.",
        "We are not \"strong\" at services. We are cheap.",
        "This defeatist attitude is the reason why it might not, China being dominant isn't however is an excuse.\n\nIndia's manufacturing output today is roughly the same as China's was in late 90s-early 2000s, if they had policy mandarins like Singh or Rajan they would have never took off.",
        "You can watch his recent speech and discussion with shasi tharoor held in Raipur, Chhattisgarh along with the state CM. He has explained there very well.[Question and answer ](https://www.youtube.com/live/cmbMNV1MdX0?feature=share)",
        "In general, services are a higher margin business.\n\nHowever with manufacturing you can make up in volume. \n\nIt is not an either / or. You can do both. Different levels of workforce skills are necessary for different jobs.",
        "The gist of his argument is that India should invest in areas where it is competitive, which are services. While indeed true from a globalised economic perspective doesn't always hold true in reality, where countries have put up walls of tariff to protect their economic interest. \n\nServices can't generate enough jobs in the first place, our workforce isn't skilled enough in the second place. The fact that no country has really transitioned from poor to rich without an extensive manufacturing is another reality, even city state like Singapore has had a big manufacturing base.",
        "Nice joke",
        "how us shut down japan?",
        "Why manufacturing? We should have stuck to agriculture from the beginning. I'm not being sarcastic. India is blessed with a conducive climate for any kind of crop. \n\nMore investment in agricultural R&D and technologies like hydroponic farming will make this country a top producer of so many agricultural produce.\n\nMoreover, it is labour intensive and doesn't need a high level of skills. This can help with the employment situation. There is always a huge demand for luxury foods and we can capitalise on that.\n\nOf course there are drawbacks like current state of supply chain and the backward technology used currently but these can be mitigated by government initiatives and investments. \n\nIt's not the most glamorous thing but other SE Asian economies like Vietnam are growing rapidly due to this.",
        "Don't have to  beat chinese just make our own manufacturing ecosystem.",
        "\"Manufacturing no longer employs swathes of people.\"\n\nAnd you know what employs swathes of people, albeit ungainfully? Agriculture. You have 40% people employed in a sector that contributes 19% of the GDP. Obviously, there is disguised unemployment and inefficiency there. So how should these people be reassigned? \n\nService sector's white collar jobs requires soft skills and high education to a higher level than the manufacturing jobs. So, there's a better chance for agriculture people to pivot to manufacturing, like it happened in China. \n\nI see food processing and packaging as an untapped potential area wherein we could brand our indigenous products for domestic and export consumption. \n\nChildren's products, especially durables (plastic bath-tubs, toys), is another area of large potential. God know we have a lot of childen. It would be good to have something that's not Made in China even if the in-house variant is at a 20% higher cost than the PRC one.\n\nWe should not pay heed to the west's insistence on woke products, renewables, et al. That'd just jack up the input cost. \n\nWe have a younger population than China atm. Basic biology suggests manufacturing is the best way to gain competitive advantage. \n\nWe have relatively cheap labour.\n\nWe have a large country with a large coastline that makes it ideal for setting up factories and exporting through the sea routes. I was a foreign trade student and I see how badly we use our EXIM policies. Tarrifs and Quotas are the keys to the west's pockets. It can open doors we can't imagine. We just need to use them adroitly.\n\nThe advantages seem far too great to not challenge Mr. Rajan's take on the matter.",
        "[Read here.](https://www.trtworld.com/magazine/how-us-prevented-japan-s-toshiba-from-becoming-no-1-chipmaker-62393)",
        "AI summaries are so garbage",
        "Industrial chips (scada, plm, etc) are still in triple digit nm range.",
        "Services industry is also highly dependant industry. Manufacturing is much more resilient. This argument is good for a highly capital intensive field like semi conductors but overall manufacturing industry/economy is good",
        "Manufacturing needs low cost labour, Indians are not low cost labour that can rival China or low cost of mexican labour.",
        "I know someone who works for the world's largest semiconductor IP company, they mention there is no design sales on India, if there is no design sales, then that means no chip will be produced when the manufacturing comes up. manufacturing is a highly leveraged and research oriented in semiconductor, you lose the edge, you lose everything and is easy to get bankrupted",
        "Right way I think, we are building the ecosystem. We have the design teams from almost every semiconductor companies setup in Bangalore. It might be a long game but worth it.",
        "Good point! What are some examples?",
        "[https://en.wikipedia.org/wiki/List\\_of\\_semiconductor\\_fabrication\\_plants](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants) \n\nSort by descending order of size of process nodes, you can see there are as many as 13 semi-conducters plants under-construction.",
        "Getting paid as influencer by America?",
        "1. IT is not as automated as manufacturing, so to generate the same amount of revenue in their respective fields, you need more IT workers compared to manufacturing. \n2. Many IT workers can’t find jobs because of oversupply of IT workers, not because IT sector is automated\n3. Talking about quality of work is a different debate altogether",
        "What a well researched counter argument. Give this guy the Nobel prize",
        "India simply is not competitive enough on Global scale compared to China,Bangladesh,Vietnam etc when it comes to manufacturing of technology,textiles etc goods..Goods which can be exported out of the country and improve our economy.  Difficult in doing business and red tape etc are key problems.  India also can't make currency weaker to improve exports which China does!\n\n India is exceptional at services export due to its skilled and huge population. So to improve overall performance it's obvious that India should concentrate heavily on its strength but doesn't mean we should forget manufacturing entirely.\n\nThis is the real and economic driven answer! Rest are basically shit political takes",
        "manufacturing requires lower input costs like power and transportation, India is not competitive in those areas compared to other countries, growing services esp outside of Bangalore or other big cities for example is the best bet, Getting services economy in say Patna or Lucknow will bring more overall growth as consumption will increase in those areas, if I were the PM I would do anything to move it companies from Bangalore to Lucknow and Patna and so on..",
        ">move a relatively large diode (2mmx1mm) from one gelpack to another \n\nHow bloody hard could it be ? I reckon I could do it with a pair of Japanese style chopsticks",
        "That makes no sense. India can't ban Chinese stuff unilaterally, no country can because Chinese focus on cheap production and we prefer globalist capitalism. Quality is not always abysmal, like the iPhones were the best in class built in China. If our manufacturing ecosystem needs to improve, are we competing on quality or price? If so, the way we invest vaires wildly. For example, 1000 maruti Suzuki can be built in India, but not one Bugatti because of quality requirements. If our aim is for 10000 maruti or one Bugatti our investment for the technology changes. Makes sense?",
        "We currently have advantages in service sector, not manufacturing as of date. If we make our advantage larger, we make more money reliably for longer. If we want to be the jack of all trades and get into manufacturing as well, our resources will spread thin , our focuses change because the capital investment and return cycle of each sector(agri, manufacturing and services) varies wildly. Our long term sustained investment for growth now becomes riskier because of blind diversification . 1 crore in service sector is more predictable for growth in today's market compared to one crore in manufacturing based on roi percentages and employment rates because manufacturing is razor thin margins with minimal room for risk, niche labour requirements compared to service sector and manufactured good sales are based on services like Amazon to stores , which each have different overhead costs ranging from branding to packaging . \n\nHis vision is simple - Developed society moves from agri to manufacturing to service . We have basically skipped manufacturing, moved into service and are competitive there. Don't regress just for the sake of it, we need more resources in services which isn't saturated yet, keep going to press the advantage.",
        "Even worse, most of them did not bother to use a ESD band",
        "what we need is a state of the art fab for protyping purposes only, so that you can move r&d and testing jobs to India\n\nmass manufacturing wafers doesnt look like an economically sound approach, because its highly automated and capex intensive, typically such investments make sense in countries with very low interest rates..\n\nunless fabs are a prerequisite for attracting downstream labor intensive jobs like systems integration, which they arent as is well known that all chips assembled in taiwan go to mainland china where they are assembled on boards, i dont see much that helps our situation..",
        "nope, it doesnt matter, unless the fab is nationalized nothing prevents them prioritizing US over domestic market. you could have export barriers but surrely that would reflect poorly on our investment worthiness\n\ncase in point being every country that you are mentioning here prioritizes US, China and other big spenders. i dont see how Taiwan gets a priority access to tsmc's output unless its wartime or an equally special situation",
        "Raghuram Rajan is far more qualified than I ever would be. But here are my two cents:\n\nIt's all about value-add. Think of countries that are incredibly recourse rich, but still poor as fuck. Venezuela, a lot of African countries etc. \n\nThe kind of money their resources generate, should be enough to turn those countries into economic behemoths. But it doesn't happen often (the Oil states are an exception). The reason for that is because raw resource extraction is not a very high value-add part of the supply chain. Income depends heavily on the price of the good, the labour is usually low skill, and generation of wealth tends to happen only for people who own the place. \n\nThat's why manufacturing (and not raw resource extraction) is generally preferred (even though finding oil, or equivalent, is often celebrated). It's harder to supplant an entire factory, the labour tends to be a little more skilled and harder to replace, and the wealth generated flows to the rest of the economy as well though taxation (resource extraction can be  subject to a lot of black market stuff). Low value goods like plastic goods, fast fashion textiles etc do this to some extent. High value good manufacturing (automobile, IT components, silicon, etc) is even better. \n\nServices are on the other end of this from raw resource extraction. They're the hardest to replace, because they require an educated labour force. The economic value generation per capita, tends to be the highest. \n\nMost developing countries tend to follow this pattern. They move from an agrarian economy, to a manufacturing economy, to a service based economy. India has the opportunity to move from agrarian directly to a service based economy. Perhaps that's why he's saying what he's saying. \n\nI would disagree, in the sense that I think the economies that are the most resilient are the ones who aren't too dependent on just a few sectors. In order to be robust against global market forces, we also ought to have a robust manufacturing sector of our own as well. \n\nI could be severely wrong in all of this though, so only take my thoughts with a massive grain of salt.",
        "Thanks!",
        "Chinese focused on demand and supply, they could control all sides because they're communist. Let's make India communist? True, Chinese did hard work. The time, tech and environment when they began building is changed. Now Chinese economic crisis is hidden due to Russian war. Search about their high expenditure infra failure and their real estate crash which should ahve wiped out 30% savings. What happened to the yuan? Nothing. That kind of blatant manipulation will not fly in globalised markets. If China wants to make the next big thing they're focused on services. In recent years, they're offering apps and software more than manufacturing because it's the next big thing. Their population is skilled in manufacturing though which they're trying to shift. You're comparing the mentality of one person to economic policies of a country.",
        "For good manufacturing we need good talented engineers but mostly talented and intelligent engineers are interested in computer sciences. Rest either do mba or upsc after engineering. And also brain drain to west ensures that we have very limited talent here in India who cannot support manufacturing growth required by India"
    ],
    "cleaned_text": "anyone please give unbiased balanced explanation raghuram rajan keeps insisting india stick services go manufacturing semiconductor investing semiconductor foundries last time recall reading saying something similar perhaps saying india shouldnt go manufacturing news article th may really intriguing keeps repeating think india stick services india lost due giving away manufacturing since china middle economic sector weak like torso human well established manufacturing base resilient section economy manufacturing sector source middle class india wouldnt developed strong middle class wasnt liberalization manufacturing sector pv narasimha manmohan singh keeps saying india go manufacturing chips available abundance really abundance chips covid asking invest resources semiconductor foundries india deep resource strapped country japan taiwan resource rich countries could domestic semiconductor foundries reminds narrative western countries used give reasons india shoulndt go space industry india poor may said things somewhere explains position elaborately actually makes sense didnt get opportunity read fairly try avoid reading much news cause becomes difficult avoid reading political news th grade student aspiring study circuital branches may go semiconductor industry mostly try read tech news time time could anybody please provide balanced explanation justifies raghuram rajans position httpswwwmoneycontrolcomnewsbusinesseconomyindiasgrowthpathliesinliberaldemocracytoearnworldstrustraghuramrajanhtmlutmcampaignfullarticlehttpswwwmoneycontrolcomnewsbusinesseconomyindiasgrowthpathliesinliberaldemocracytoearnworldstrustraghuramrajanhtmlutmcampaignfullarticle ",
    "cleaned_title": "anyone please give unbiased balanced explanation raghuram rajan keeps insisting india stick services go manufacturing semiconductor investing semiconductor foundries",
    "cleaned_selftext": "last time recall reading saying something similar perhaps saying india shouldnt go manufacturing news article th may really intriguing keeps repeating think india stick services india lost due giving away manufacturing since china middle economic sector weak like torso human well established manufacturing base resilient section economy manufacturing sector source middle class india wouldnt developed strong middle class wasnt liberalization manufacturing sector pv narasimha manmohan singh keeps saying india go manufacturing chips available abundance really abundance chips covid asking invest resources semiconductor foundries india deep resource strapped country japan taiwan resource rich countries could domestic semiconductor foundries reminds narrative western countries used give reasons india shoulndt go space industry india poor may said things somewhere explains position elaborately actually makes sense didnt get opportunity read fairly try avoid reading much news cause becomes difficult avoid reading political news th grade student aspiring study circuital branches may go semiconductor industry mostly try read tech news time time could anybody please provide balanced explanation justifies raghuram rajans position httpswwwmoneycontrolcomnewsbusinesseconomyindiasgrowthpathliesinliberaldemocracytoearnworldstrustraghuramrajanhtmlutmcampaignfullarticlehttpswwwmoneycontrolcomnewsbusinesseconomyindiasgrowthpathliesinliberaldemocracytoearnworldstrustraghuramrajanhtmlutmcampaignfullarticle",
    "cleaned_comments": "semiconductor oversupply lasts years us tight control supply chain usa adds max value around low level work supply market forget rr read semiconductor industry analysis please engage whataboutism also india well chip design front adding strength way go ahead dont forget guy brilliant idea introducing islamic banks indian financial sector take whatever shitstain spews grain salt semi conductor industry different products manufactured different companies like electronic mafia processor tsmc camera sony ram samsung eg processor making getting good designing us along dutch wants reduce processor monopoly china opens small door opportunities camera cant anything sony plans expand india else small companies struggle really hard sustain components significant risk involved due high cost regulations india getting electronics good risk software products going good imo need support government share indian manufacturing percentage gdp stagnated multitude factors led heres depth article tries explain issue said maybe maybe could impetus future addition longterm really longterm things one get without sufficient backing may one like reliance deep pockets even wont enter things though one thinks brightest minds different league yes also wants buy us tsmc others move us b level encouragement one cant nano metres chips immediately slow progress india makes nm chip works speed mobile phone like even buy one needs hire top notch person first instill confidence industry difficult tldr need like nuclear industry form tie ups get started unfortunately chip become national security one would anymore unless benefits talent even brightest minds university iit likely move us given dont dare invite bright people africa another topic controversy patents nightmare anything one touches sued wont get equipment manufacture one disagrees gay rights etc west works china somehow west dependent cheap goods supply chain need special items available across world yes india raw materials though wont even believe manufacturers cant get purity means importing outside whole ecosystem manufacturing needs game example buy steel flask japan look finishing perfection dont ecosystem much animosity india chinase asia one read much like vietnam taiwan superfriendly agendas even western democracies fellows often annoy helpful may ask work chinataiwan works uswest still dependent uswest dependencies india export little important stuff sorry pichai nadella jokeing one needs maverick investor like elon bring robots engineers cleaners build factory unlikely happen parties run country like families one white saying anything put ideal case one india likely reliance tata buys foundry slowly moves production intelligent tata even owning jaguaraston martin never move production india needs talent etc still opinion sab kuch chalega things high value made really passion take handweaver silk saree type need mentality industry guys often lets go money sorts maska lagana promotion le lya jugaad etc manufacturing dont need masters everything fine best lets start maybe learned us uk financial institutions provide services islamic banking guess cells existed countries would come slogan maybe bank jihad pound jihad concept islamic bank involves lending money people interest islam earning interest money lent haram imagine bank running without making money raghu ram rajan wanted cripple indian financial sector country common people addicted free stuff like drugs politicians promising freebies swinging elections one insight future economy would proved disastrous maybe civilised ultra capitalistic society like us uk would worked helping small businesses interest free loans bunch financially illiterate irresponsible folk us one way ticket hell dont need cell give lecture basics economy operated margins manufacturing sector margin service sector starting factory india almost like agriculture almost margin verify rbi database indian economyclick corporate sector secondly moment anyone else gives better incentives govt cant affordremoves incentives like pli eg companies like foxconn shift factory somewhere else already making states compete gives freebies race bottom high risk leave look textile industry auto sector around long time lot experience trying enter totally new fields like semiconductors compete huge giants still struggling producing whole world tata motors cant even get margin buying jaguar uk mostly selling luxury market tata well managed company india saying large firms wont success india wont produce big player govt wants encourage large scale huge capex bill going paid cutting social spending massive borrowing big guarantees pay one shouldnt extrapolate much stick basics wow hate pm turned hate normal people china mfg sector way doubt believe propaganda study facts cant compete china dr singh rajan said written chat gpt totally right sir im gon na go collect kg free grains government also equity participation business ehh assessing deals looked islamic finance got direct interest sure multiple ways get time value money structures institution buys heavy machinery ownership transferred bank applicant years time period transfer would essentially payment scheme thats one structure exists data leftist bias new things learned today got ta appreciate internet forgot dutch monopoly via asml yup theyre like old guy monopoly game tings based edit record would argue manufacturing led growth time earlier year getting poor responses short answer manufacturing largely automated longer employs swathes people china used generate employment semiconductors takes crap ton water shortage year ago water shortage taiwan semiconductor also massively capex driven industry one weirdest industries see first time fabs date moment come online depreciation absurd source used analyst part semiconductor deals clients mfg part theres video pramod bhasin bannerjee talk got wrong im looking sources heres wb heres recent article points services gets distributed around nation concentrated single places climate harmful theres many sources automation vs mfg online cant remember article last brick wall changed mind find ill update message found reasoning covered good better point chinas model depended sales useu yen carry trade dont really trade environment today protectionism rise personal point well fucking crap mfg isnt option heck left employment already crap many people searching jobs getting people educated hard anyone talks educate people gets earful education takes time means student focus means dont worry survival access study material teachers etc takes lot train brain skilling people india right dont see happening humorous note ruins many arguments use torment people economic discussions cant force people choose environment employment anymore arey ever heard humorjoke dont concrete answer wanted thank people provided answers change feels good read informative actually unbiased answersatleast india necessarily stick services avoid getting semiconductor manufacturing investing foundries advantages challenges india pursuing semiconductor manufacturing advantages growing demand global demand semiconductors growing rapidly india could capitalize demand develop strong manufacturing sector diversification investing semiconductor manufacturing diversify indias economy reducing overreliance services sector promoting balanced economic growth job creation robust semiconductor manufacturing sector could create numerous highpaying jobs contributing social economic development technological advancement investing semiconductor manufacturing drive innovation strengthen indias overall technological capabilities reducing import dependency building domestic semiconductor manufacturing base reduce indias dependency imports thereby improving trade balance selfreliance challenges high initial investment semiconductor foundries require massive capital investments making challenge india compete established players skilled workforce developing skilled workforce semiconductor manufacturing could longterm challenge industry requires highly specialized knowledge infrastructure requirements semiconductor manufacturing requires highly stable power supply clean water advanced transport infrastructure may lacking parts india environmental concerns semiconductor manufacturing processes involve hazardous materials generate waste could pose challenges terms environmental sustainability regulatory compliance global competition india would face intense competition established players countries like united states china taiwan south korea overall india consider investing semiconductor manufacturing foundries must carefully weigh potential benefits challenges comprehensive strategy addresses challenges leverages countrys strengths promotes collaboration government private sector research institutions would crucial success endeavour chatgpt moving service industry easier moving factory specially semiconductor factory services offer returns quickly manufacturing long term game return may take upto ages also cant beat chinese manufacturing made next level quality scale next level pm unfortunately credentials theres hate love man party unworthy lead country guess thats dont forget free poison vishakanya liquor bottle friendly congress mla also bangladesh pakistan practice islamic banking well one country going bankrupt take billion credit line imf survive current currency crisis true trained labour surplus india service sector margins come availability cheap trained labour manufacturing margins depend much capital labour limited resources allocated manner maximises benefits country feels providing pli manufacturing multitude sectors allocating resources best possible way competitive manufacturing similar allocation resources service industry increase competitive edge also outsmart rising competition continue grow existing areas venture new sector service industry better payment distributes wealth greater number people ensues greater demand manufacturing healthcare services housing etc results lower inequality growth manufacturing base employment large number unskilled people manufacturing industry caters people export oriented service industry manufacturing industry competitive advantages labour wages lower great advantage area labour wages increased therefore limited advantages labour cost wont last long manufacturing base become uncompetitive hand govt thinks large unskilled masses employed manufacturing industry overcome unemployment therefore govt brought pli manufacturing industry imho rajan appears circumspect service export specially software sector done great expanding areas like accounting medicine educationetc hold immense potential given large pool people expertise areas india therefore incentives sector hand govt expanded pli multitude sectors results great money gone cronies except cellphonesmartphone manufacturing done well areas smartphone sector success necessarily pli driven two factors hold importance first one apple wants shift supply chain away china second next phase growth apple would come indiathis company thinks service industry create jobs india huge population advantage curse depending upon used rr views consideration advantage india much capital compete manufacturing also manufacturing generate many jobs ai specifically said semi conductor manufacturing sector manufacturing would need complete countries cheap labour resources additionally feel short term manufacturing first automated thus loosing jobs services already good network brain capital basically replicating blore pune cities plus money per capita mix focusing service would better way go right answer comes semiconductors point semicon industry assembly testinghe right continue grow strengths lie clean water problem soda companies pressure operate droughts consume lot energy fabs fabrication units cant function without lots either supplies shortages billions dollars cost building one stake draining say least government serious supply chain needs established first may take lot time start setting first fab reading article feels like hes trying say resource intensive industry rather focus things arent resource intensive dont like argument mighty pompous disagree legend lmao seriously semiconductors national importance look lens products nifty things required economy function fuck economics fuck pl fuck supply chains country ever embargoed well need domestic capacity cater needs alone good enough reason invest industry semiconductors matter national importance feel like rr looking purely economic angle whereas vision industry needs much broader major drawbacks manufacturing semiconductor us monopoly japan tried make us bureaucracy shut china tried us worked shut catching us also machines required make one comes one company netherlands pretty tedious costly process make one say anything pm worthiness guys obsessed dont even understand comment discriminatory views gujarati years back wanted open production unit india gave test run traffic situation nightmare never able ship packet time one position received close applications none short listed candidates could handle tweezer properly move relatively large diode mmxmm one gelpack another tell one country gone filthy poor rich service sector india populous country generate tons job manufacturing way employ many people service sector needs skills education employs way less manufacturing sector working semiconductor industry europe recently customer visit see semiconductor fab dont imagine old factories highly automated futuristically designed start creating semiconductor factory many auxiliary technical suppliers need support saw need work almost different suppliers start semiconductor fab crazy doesnt bring lot technology back india difficult impossible water ultra pure water india makes nm chip works speed mobile phone like even buy yes presumption rests fact semiconductors cutting edge overwhelming majority semiconducters produced even new nm process plants built right manufacturing labour intensive everything done machines cant generate much employment india focused manufacturing people supporting clueless want weapon making powerhouse car manufacturing hub need reliably produce chips support dont youre mercy taiwan usa korea china supply takes threat sanctions youre pretty screwed dont access machinery supply chains good news dont need build nm chips competitive even nm node sufficient simply use case hpc rather industrial military semiconductor manufacturing achilles heel india china russia us eu everyone else fact one build industry tried failed market economy technological requirements many people dont know india tried semiconductor manufacturing failed miserably high end technical stuff requires least billion dollars built small fab thats end requires update every decade try chances end like others build know build people taiwanese going help anyone least two decades behind cutting edge tech even spend decades building tech still cant compete likes tsmc means product costlier others logic behind tsmc builds advanced chips world chips designed us odds us give designs india india low key taking side russia conflict means never get high end machines asml asml company world builds lithography machine geopolitical nightmare getting machines lost cause everyone tried building semiconductor manufacturing failed uk eu us russia china tried failed although say chinese still much better others shouldnt give india build low end semiconductor manufacturing multi decade plan building infrastructure semiconductor tech india already decent amount manufacturing capacity good enough us entirely agreeing point services especially staring ai led optimisations may slowly surely eat services jobs need create hitech ecosystem could work conjunction local design talents several nano meters behind indigenisation shield us nato led monopoly supply crucial third party components need think terms least collaborating asml local variants tech currently asml monopolises think rajans point view low marginsyields chinese taiwanese semiconductor factories need manage supply chain demand cycle market highly competitive dynamics terms technology demand changes every six months might concerned us finally pulls strings leading scenario like garments manufactures said amount investment goes versus employment generates miniscule may something significance supply chain side low boss im mumbai mumbaikars old india new india always kept target richer countries pakistan bangladesh targets bottom barrel folks us worthy competition consideration aim higher strive achieve aims without bringing pedantic religion every debate best semi conductor one location business involves lot countries yes chief thats wrote compared services labour inducive many workers realistically find employment also tiny sliver population work field vast majority ends menial jobs india million new entrants job market every month really doubt service sector create many jobs manufacturing surely service sector also includes hospitality sector places people required face customers people used say automation printing change remove humans manufacturing opposite automation multipurpose tech incredibly expensive unlike general purpose ai see huge cost cutting service sector coming yrs also semiconductors right oil terms expending foreign reserves foot game help us immensely job today either pays little core much software need otherwise way decrease income inequality without taxing rich death manufacturing absolutely could provided india reorient manufacturing nation goes like china giving isnt option limits automation robot still cant assemble mobile phone thats foxconn employees workers india type jobs hospitality imagining cant provide million jobs neither manufacturing alone needed maximum possible job generation capacities requires lots capital sadly india lacks almost poor access also takes lots time set implement good infrastructure transport good also required dont like defeatist attitude giving even starting indias manufacturing output today roughly equivalent chinas late early would given back wont juggernaut today frankly dont option china otherwise vast majority population destined eternal squalor economist thinks terms numbers numbers say game diminishing returns unfortunately economic development socioeconomic development doesnt always work way need go forward break ground take action every chance manufacturing nation failed given says stick services effectively conceding arent good anything else personally coming state nearly years manufacturing history exported finished goods world longer time want economy completely focused services go stuffing people offices pushing hospitality sector need smart make state government actually made smart decision inviting foreign governments set ground level rd centres polytechnic institutes two nextgen products electric vehicles solar technology exactly kind initiative needed surgically educate section population turn experts let talent bleed industries becomes selfsustaining loop strong services cheap defeatist attitude reason might china dominant isnt however excuse indias manufacturing output today roughly chinas late searly policy mandarins like singh rajan would never took watch recent speech discussion shasi tharoor held raipur chhattisgarh along state cm explained wellquestion answer httpswwwyoutubecomlivecmbmnvmdxfeatureshare general services higher margin business however manufacturing make volume either different levels workforce skills necessary different jobs gist argument india invest areas competitive services indeed true globalised economic perspective doesnt always hold true reality countries put walls tariff protect economic interest services cant generate enough jobs first place workforce isnt skilled enough second place fact country really transitioned poor rich without extensive manufacturing another reality even city state like singapore big manufacturing base nice joke us shut japan manufacturing stuck agriculture beginning im sarcastic india blessed conducive climate kind crop investment agricultural rd technologies like hydroponic farming make country top producer many agricultural produce moreover labour intensive doesnt need high level skills help employment situation always huge demand luxury foods capitalise course drawbacks like current state supply chain backward technology used currently mitigated government initiatives investments glamorous thing se asian economies like vietnam growing rapidly due dont beat chinese make manufacturing ecosystem manufacturing longer employs swathes people know employs swathes people albeit ungainfully agriculture people employed sector contributes gdp obviously disguised unemployment inefficiency people reassigned service sectors white collar jobs requires soft skills high education higher level manufacturing jobs theres better chance agriculture people pivot manufacturing like happened china see food processing packaging untapped potential area wherein could brand indigenous products domestic export consumption childrens products especially durables plastic bathtubs toys another area large potential god know lot childen would good something thats made china even inhouse variant higher cost prc one pay heed wests insistence woke products renewables et al thatd jack input cost younger population china atm basic biology suggests manufacturing best way gain competitive advantage relatively cheap labour large country large coastline makes ideal setting factories exporting sea routes foreign trade student see badly use exim policies tarrifs quotas keys wests pockets open doors cant imagine need use adroitly advantages seem far great challenge mr rajans take matter read herehttpswwwtrtworldcommagazinehowuspreventedjapanstoshibafrombecomingnochipmaker ai summaries garbage industrial chips scada plm etc still triple digit nm range services industry also highly dependant industry manufacturing much resilient argument good highly capital intensive field like semi conductors overall manufacturing industryeconomy good manufacturing needs low cost labour indians low cost labour rival china low cost mexican labour know someone works worlds largest semiconductor ip company mention design sales india design sales means chip produced manufacturing comes manufacturing highly leveraged research oriented semiconductor lose edge lose everything easy get bankrupted right way think building ecosystem design teams almost every semiconductor companies setup bangalore might long game worth good point examples httpsenwikipediaorgwikilistofsemiconductorfabricationplantshttpsenwikipediaorgwikilistofsemiconductorfabricationplants sort descending order size process nodes see many semiconducters plants underconstruction getting paid influencer america automated manufacturing generate amount revenue respective fields need workers compared manufacturing many workers cant find jobs oversupply workers sector automated talking quality work different debate altogether well researched counter argument give guy nobel prize india simply competitive enough global scale compared chinabangladeshvietnam etc comes manufacturing technologytextiles etc goodsgoods exported country improve economy difficult business red tape etc key problems india also cant make currency weaker improve exports china india exceptional services export due skilled huge population improve overall performance obvious india concentrate heavily strength doesnt mean forget manufacturing entirely real economic driven answer rest basically shit political takes manufacturing requires lower input costs like power transportation india competitive areas compared countries growing services esp outside bangalore big cities example best bet getting services economy say patna lucknow bring overall growth consumption increase areas pm would anything move companies bangalore lucknow patna move relatively large diode mmxmm one gelpack another bloody hard could reckon could pair japanese style chopsticks makes sense india cant ban chinese stuff unilaterally country chinese focus cheap production prefer globalist capitalism quality always abysmal like iphones best class built china manufacturing ecosystem needs improve competing quality price way invest vaires wildly example maruti suzuki built india one bugatti quality requirements aim maruti one bugatti investment technology changes makes sense currently advantages service sector manufacturing date make advantage larger make money reliably longer want jack trades get manufacturing well resources spread thin focuses change capital investment return cycle sectoragri manufacturing services varies wildly long term sustained investment growth becomes riskier blind diversification crore service sector predictable growth todays market compared one crore manufacturing based roi percentages employment rates manufacturing razor thin margins minimal room risk niche labour requirements compared service sector manufactured good sales based services like amazon stores different overhead costs ranging branding packaging vision simple developed society moves agri manufacturing service basically skipped manufacturing moved service competitive dont regress sake need resources services isnt saturated yet keep going press advantage even worse bother use esd band need state art fab protyping purposes move rd testing jobs india mass manufacturing wafers doesnt look like economically sound approach highly automated capex intensive typically investments make sense countries low interest rates unless fabs prerequisite attracting downstream labor intensive jobs like systems integration arent well known chips assembled taiwan go mainland china assembled boards dont see much helps situation nope doesnt matter unless fab nationalized nothing prevents prioritizing us domestic market could export barriers surrely would reflect poorly investment worthiness case point every country mentioning prioritizes us china big spenders dont see taiwan gets priority access tsmcs output unless wartime equally special situation raghuram rajan far qualified ever would two cents valueadd think countries incredibly recourse rich still poor fuck venezuela lot african countries etc kind money resources generate enough turn countries economic behemoths doesnt happen often oil states exception reason raw resource extraction high valueadd part supply chain income depends heavily price good labour usually low skill generation wealth tends happen people place thats manufacturing raw resource extraction generally preferred even though finding oil equivalent often celebrated harder supplant entire factory labour tends little skilled harder replace wealth generated flows rest economy well though taxation resource extraction subject lot black market stuff low value goods like plastic goods fast fashion textiles etc extent high value good manufacturing automobile components silicon etc even better services end raw resource extraction theyre hardest replace require educated labour force economic value generation per capita tends highest developing countries tend follow pattern move agrarian economy manufacturing economy service based economy india opportunity move agrarian directly service based economy perhaps thats hes saying hes saying would disagree sense think economies resilient ones arent dependent sectors order robust global market forces also ought robust manufacturing sector well could severely wrong though take thoughts massive grain salt thanks chinese focused demand supply could control sides theyre communist lets make india communist true chinese hard work time tech environment began building changed chinese economic crisis hidden due russian war search high expenditure infra failure real estate crash ahve wiped savings happened yuan nothing kind blatant manipulation fly globalised markets china wants make next big thing theyre focused services recent years theyre offering apps software manufacturing next big thing population skilled manufacturing though theyre trying shift youre comparing mentality one person economic policies country good manufacturing need good talented engineers mostly talented intelligent engineers interested computer sciences rest either mba upsc engineering also brain drain west ensures limited talent india support manufacturing growth required india",
    "light_cleaned_title": "Can anyone please give an unbiased and balanced explanation of why Raghuram Rajan keeps insisting that India should stick to Services and not go into manufacturing semiconductor or investing in semiconductor foundries?",
    "light_cleaned_selftext": "Last time I recall reading him saying something similar to this was in 2021 or 2022 perhaps, when he has been saying India shouldn't go into Manufacturing. This news article in 13th May 2023 is really intriguing that keeps on repeating that. Why does he think India should stick to services? India lost out a due to giving away manufacturing since 2004 to China. Out middle economic sector is weak and like the torso of a human, a well established manufacturing base is the most resilient section of the economy. Manufacturing sector is the source of the middle class. India wouldn't have developed a strong middle class if it wasn't for the liberalization of manufacturing sector by PV Narasimha and Manmohan Singh. He keeps on saying \"India should not go into manufacturing of chips as they are available in abundance\", was there really an abundance of chips during and after Covid? He is asking not to invest resources into semiconductor foundries as India is \"deep resource strapped country\", as if Japan and Taiwan are very resource rich countries that they could have their own domestic semiconductor foundries? This reminds of the narrative when western countries used to give reasons for why India shoulnd't go into space industry because India was too poor then. May be he has said things somewhere that explains his position elaborately that actually makes sense but I didn't get the opportunity to read that. I fairly try to avoid reading much news cause then it becomes difficult to avoid reading political news. I am just a 12th grade student aspiring to study in circuital branches and may be go into semiconductor industry so I mostly try to read tech news from time to time. Could anybody please provide a balanced explanation that justifies Raghuram Rajan's position? [https://www.moneycontrol.com/news/business/economy/indias-growth-path-lies-in-liberal-democracy-to-earn-worlds-trust-raghuram-rajan-10578561.html?utm\\_campaign=fullarticle](https://www.moneycontrol.com/news/business/economy/indias-growth-path-lies-in-liberal-democracy-to-earn-worlds-trust-raghuram-rajan-10578561.html?utm_campaign=fullarticle)",
    "light_cleaned_comments": "Semiconductor oversupply lasts for 10 years and US has tight control on supply chain. USA adds max value around 37%. We will be doing low level work on a over supply market. Forget about RR and read Semiconductor industry analysis and please do not engage in whataboutism. Also, India is doing well on chip design front. Adding on strength is the way to go ahead. Don't forget this was the guy who had the brilliant idea if introducing Islamic banks into the Indian Financial sector. Take whatever this shitstain spews with a grain of salt. For the semi conductor industry there are different products manufactured by different companies and they are like Electronic mafia. Processor - TSMC Camera - Sony RAM - Samsung Eg: For processor making, we're getting good into designing those and US along with the Dutch wants to reduce processor monopoly from China - This opens a small door of opportunities. Camera - can't do anything until Sony plans to expand into India or else small companies struggle really hard to sustain. Other components, We can but have significant risk involved due to high cost & regulations in India. Getting into electronics have good risk, while software products are going good. We should have both imo, for that we need more support from government. The share of Indian manufacturing as percentage of GDP has stagnated for a while now. Multitude of factors have led to this. Here's an in depth article that tries to explain the issue. Having said that maybe just maybe there could be some impetus in the future. In addition these are longterm (really very longterm things). One does not get into these without sufficient backing (may be some one like Reliance can do it with deep pockets - even they wont enter such things). Though one thinks we have brightest minds it is at a different league. Yes, it is also to do with who wants to buy from us. TSMC and others move to US as there is $B level encouragement. And one can't do these nano metres chips immediately. Slow progress. If India makes a 30 nm chip that works at the speed of 2000 mobile phone will you like it? or even buy it? - One needs to hire some top notch person to first instill confidence in the industry - this will be difficult. tldr; they need to do it like nuclear industry. form some tie ups to get started. Unfortunately, chip has not become national security. So no one would do this anymore - unless it benefits them. - Talent. Even the brightest minds (from any university or IIT) likely move to US when given $. We don't dare to invite bright people from Africa (all another topic for controversy)... - Patents: This is a nightmare. Anything one touches can be sued. - You won't get equipment to manufacture if one disagrees with gay rights etc (with West). Again it works for china as they somehow West is dependent on their cheap goods. - supply chain. These need some very special items that are available from across the world. (Yes, India does not have all raw materials - though some won't even believe this - or if it is there our manufacturers can't get it to such purity) . This means importing from outside. (Our whole ecosystem of manufacturing needs to up the game - for example, if you buy a steel flask from Japan look at its finishing, perfection - we don't do it here...) - Ecosystem: There is too much animosity between India (and China/S.E Asia). One does not read that much but it is not like Vietnam or Taiwan are superfriendly. All have their own agendas. Even with western democracies our fellows often annoy them. This is not helpful (you may ask why does it work for china/taiwan - it works because US/West are still dependent on them. US/West has very few dependencies on India. We export too little and they are not that important stuff. (Sorry Pichai and Nadella!!! Jokeing)). - Or one needs a maverick investor like Elon to just bring 1000 robots and 20 engineers (+ 20000 cleaners to build factory. Unlikely to happen because (all parties) run country like families. Any one white saying anything will be put down. - In an ideal case, some one from India (likely Reliance or Tata) buys some foundry and then slowly moves production but they are intelligent - Tata (even owning all of Jaguar/Aston Martin) will never move production to India. Needs talent etc. We still have the opinion - 'sab kuch chalega'. Things in high value are made really with passion. (Take some handweaver in silk saree or that type) - We need that mentality in IT and industry. Our guys are often - lets go for money - all sorts of 'maska lagana promotion le lya.. jugaad etc. That is not manufacturing.. We don't need to be masters at everything. Do what we are fine to the best... Lets start there. Maybe he learned it from US and UK which have financial institutions that provide services for Islamic banking. I guess if IT cells existed in those countries they would have come up with some slogan maybe bank jihad or pound jihad The concept of Islamic bank involves lending money to people at no interest. Because in Islam earning interest on money lent is haram. Can you imagine a bank running without making any money? Raghu ram Rajan wanted to cripple the Indian financial sector. To a country where common people are as addicted to free stuff like drugs, politicians promising freebies for swinging elections, where no one has an insight for the future or the economy, this would have proved disastrous. Maybe to a civilised and ultra capitalistic society (like the US or UK) this would have worked helping small businesses on interest free loans. But to a bunch of financially illiterate and irresponsible folk such as us, it's a one way ticket to hell. You dont need an IT cell to give you a lecture on the basics of how the economy is operated. Margins for manufacturing sector is ~5-10%. Margin for service sector is ~40-50%. So starting factory in india is almost like doing agriculture which has almost same margin. You can verify it in RBI database of indian economy(click corporate sector). Secondly the moment anyone else gives better incentives or govt cant afford/removes incentives like PLI, (eg for companies like Foxconn) they will shift factory somewhere else. Already they are making states compete with each other on who gives more freebies to them. Race to bottom with high risk if they leave. Look at textile industry or auto sector. Both have been around for a long time. They have lot of experience and are not trying enter totally new fields (like semiconductors) and compete against huge giants. But still they are struggling. Why they are not producing for the whole world? Tata Motors cant even get to 5% margin and that too after buying Jaguar in UK and mostly selling to Luxury market. And that is Tata as well managed a company can be in India. Not saying some large firms wont have success or India wont produce big player. But if govt wants to encourage it on large scale there is a huge capex bill. Which is going to be paid by cutting social spending or massive borrowing with no big guarantees it will pay off. One shouldn't extrapolate so much. Stick to basics. Wow your hate for PM has turned to hate for the normal people? China has mfg sector from way before 2004. Doubt believe propaganda. Study facts. We just can't compete with china. So Dr. Singh or Rajan said so. Written by Chat GPT You are totally right sir, I'm gonna go and collect by 5kg free grains from the government and also equity participation from the business Ehh… When I was assessing deals I looked at Islamic finance- it’s not got direct interest, sure. But there are multiple other ways that they get the time value of money of out it. They have structures where the institution buys the heavy machinery, and ownership is transferred from the bank to the applicant over years. The time period of transfer would essentially be the payment scheme. That’s just one structure that exists. Data has leftist bias, new things I learned today. Gotta appreciate the Internet. You forgot Dutch Monopoly via ASML Yup they're like the old guy in monopoly game most of the tings are based on them. Edit: for the record, I would argue for manufacturing led growth until some time earlier this year. You are getting some poor responses. Short answer is that - - 1) manufacturing now is largely automated. It no longer employs swathes of people, which is what China used to generate employment. - 2) Semiconductors: this takes a crap ton of water. The shortage a year or so ago was because there was a water shortage in Taiwan. Semiconductor is also a massively capex driven industry; it’s one of the weirdest industries when you see it for the first time. The fabs are out of date the moment they come online. The depreciation on them is absurd. Source - I used to be an analyst, and was part of semiconductor deals for clients myself. ~~For the mfg part there’s a video between Pramod bhasin and Bannerjee where they talk about it.~~ got this wrong. I’m looking for other sources - but here’s WB, 2017: Here’s a more recent article: His further points: 1) Services gets distributed around the nation and not concentrated in single places. 2) Its not climate harmful Theres many sources on automation vs Mfg online. I cant remember the article that was that last brick in the wall that changed my mind. If I find it, I’ll update this message. Found this: Most of his reasoning is covered here. This is good, the better point is that China’s model depended on sales to the US/EU (and the yen carry trade too). We dont really have that same trade environment today. Protectionism is on the rise.\\ ——————- Personal point: Well, fucking crap. If MFG isnt an option, what the heck is left. Employment is already crap, and we have too many people searching for jobs. Getting people educated is HARD. Anyone who talks to me about “we should educate people” gets an earful. Education takes TIME, it means your student can focus, it means that they dont have to worry about survival, they have access to study material, teachers etc. It takes a LOT to train a brain. Skilling people in India? Right now, I dont see it happening. On a more humorous note, this ruins many of my arguments which I use to torment people in economic discussions. I can’t force people to choose between the environment and employment anymore. Arey, have you ever heard about humor/joke I don't have a concrete answer. But, just wanted to thank other people who provided their answers. For a change it feels good to read informative and actually unbiased answers(atleast most of them :) ) India does not necessarily have to stick to services and avoid getting into semiconductor manufacturing or investing in foundries. There are both advantages and challenges for India in pursuing semiconductor manufacturing. Advantages: 1. Growing demand: The global demand for semiconductors is growing rapidly, and India could capitalize on this demand to develop a strong manufacturing sector. 2. Diversification: Investing in semiconductor manufacturing can diversify India's economy, reducing overreliance on the services sector and promoting more balanced economic growth. 3. Job creation: A robust semiconductor manufacturing sector could create numerous high-paying jobs, contributing to social and economic development. 4. Technological advancement: Investing in semiconductor manufacturing can drive innovation and strengthen India's overall technological capabilities. 5. Reducing import dependency: Building a domestic semiconductor manufacturing base can reduce India's dependency on imports, thereby improving its trade balance and self-reliance. Challenges: 1. High initial investment: Semiconductor foundries require massive capital investments, making it a challenge for India to compete with established players. 2. Skilled workforce: Developing a skilled workforce for semiconductor manufacturing could be a long-term challenge, as the industry requires highly specialized knowledge. 3. Infrastructure requirements: Semiconductor manufacturing requires a highly stable power supply, clean water, and advanced transport infrastructure, which may be lacking in some parts of India. 4. Environmental concerns: Semiconductor manufacturing processes involve hazardous materials and generate waste, which could pose challenges in terms of environmental sustainability and regulatory compliance. 5. Global competition: India would face intense competition from established players in countries like the United States, China, Taiwan, and South Korea. Overall, India can consider investing in semiconductor manufacturing or foundries, but it must carefully weigh the potential benefits against the challenges. A comprehensive strategy that addresses the challenges leverages the country's strengths and promotes collaboration between the government, private sector, and research institutions would be crucial for success in this endeavour. ChatGPT 4 Moving a service industry is easier than moving a factory, specially a semiconductor factory. Services offer returns quickly. Manufacturing is a long term game. And return may take upto ages. Also we can't beat chinese Manufacturing, They have made it to next level now. The quality and scale is next level. The PM unfortunately has no credentials. There's no hate or love. The man and his party is unworthy to lead this country. But he is. So I guess that's that. Don't forget the free poison from the VishaKanya and liquor bottle from your friendly Congress MLA. Also Bangladesh and Pakistan practice Islamic banking as well. One country is going bankrupt and the other had to take $4 billion credit line from IMF to survive the current currency crisis. That is not true. Trained IT labour is in surplus in India. And service sector margins come from availability of cheap trained labour. Manufacturing margins depend much more on capital not labour. Limited resources should be allocated in manner that maximises the benefits to Country. He feels that by providing PLI for manufacturing in multitude of sectors, we are not allocating resources in best possible way. Because we are not competitive in Manufacturing. With similar allocation of resources to Service Industry we can, not only increase competitive edge, also can outsmart rising competition and continue to grow in existing areas and venture into new sector. Service Industry has better payment, distributes wealth to greater number of people; ensues in greater demand for manufacturing, healthcare, services, housing ...etc.. Which results in lower inequality, growth of manufacturing base and employment of large number of unskilled people in manufacturing and industry that caters to people of export oriented service Industry. Further for manufacturing industry to have competitive advantages labour wages should be lower, we are not having great advantage in that area as labour wages have increased. Therefore the limited advantages in labour cost that we have now won't last long and our manufacturing base will become uncompetitive. On other hand, govt thinks large unskilled masses should be employed in manufacturing industry to overcome unemployment. Therefore govt has brought out PLI for manufacturing industry. IMHO, Rajan appears more circumspect. Our Service export specially software Sector has done great and we are expanding into areas like accounting, medicine, education....etc. which hold immense potential given large pool of people with expertise in these areas in India. Therefore we should incentives this sector. On other hand, govt has expanded PLI to multitude of sectors, results of that is not great, most of the money has gone to cronies. Except in Cellphone/Smartphone manufacturing we have not done well in other areas. In Smartphone sector, success is not necessarily is PLI driven. There are two factors that hold importance - first one is Apple wants to shift supply chain away from China and second next phase of growth for Apple would come from India(this is what that company thinks). service industry can create more jobs. India has a huge population. that can be both an advantage and a curse. depending upon how it is used. Rr views are in consideration of this advantage. India does not have that much capital so as to compete in manufacturing. also manufacturing does not generate that many jobs. AI. He specifically only said about semi conductor not all of manufacturing sector. Manufacturing we would need to complete with other countries for cheap labour, resources. Additionally I feel it’s short term, manufacturing will be the first to be automated and thus again loosing out jobs. Services we already have a good network and and the brain capital. It’s basically replicating Blore, Pune to other cities. Plus more money per capita. A mix of the 2 but focusing on Service would be the better way to go. This is the right answer when it comes to semiconductors. The most we can do at this point for the semicon industry is assembly and testing…he is right, we should continue to grow where our strengths lie. Clean water is a problem where soda companies are under pressure to operate during droughts and consume a lot of energy, and FABs (Fabrication Units) can’t function without lots of either and other supplies and any shortages with billions of dollars (cost of building one) are at stake is draining to say the very least. If the government serious about it, the supply chain needs to be established first and it may take a lot of time before we start setting up our first FAB. Reading that article, it feels like all he's trying to say is that it's a resource intensive industry and we should rather focus on other things that aren't as resource intensive. I don't like this argument (mighty pompous of me to disagree with this legend lmao) But seriously, semiconductors are of national importance. You cannot look at them with the same lens as other products. These nifty things are required for the economy to function. Fuck economics. Fuck P&L. Fuck supply chains. If our country is ever embargoed, we'll need domestic capacity to cater to our needs. That alone is a good enough reason to invest in this industry. Semiconductors are a matter of national importance. I feel like RR is looking at this from a purely economic angle whereas the vision for this industry needs to be much broader. Major drawbacks of manufacturing semiconductor is US monopoly on it, Japan tried to make their own and US bureaucracy shut it down then china tried and US again worked to shut it down but they are catching up to US now. Also the machines required to make one comes from one company in Netherlands, and it’s pretty tedious and costly process to make one. And did I say anything of pm or his worthiness? You guys are so obsessed that you don't even understand my comment , it's about discriminatory views about Gujarati... Some 5 years back we wanted to open a production unit in India. We gave up after a test run... - Traffic situation was a nightmare. We were never able to ship a packet on time - For one position we received close to 900 applications and none of the short listed candidates could handle a tweezer properly or move a relatively large diode (2mmx1mm) from one gelpack to another Tell me one country who has gone from filthy poor to rich from service sector. India is the most populous country now and to generate tons of job manufacturing is the only way to employ these many people. Service sector needs more skills , education and it employs way less than manufacturing sector. I am working in the semiconductor industry in Europe. I recently did a customer visit to see a semiconductor fab. Don't imagine them to be old factories , they are highly automated, futuristically designed. If you start creating the semiconductor factory, there are many auxiliary technical suppliers which need to support you. I saw that you need to work with almost 20 different suppliers to start a semiconductor fab. It is crazy but it doesn't bring a lot of technology back to india. It is difficult but not impossible. Not just water but Ultra Pure Water. >. If India makes a 30 nm chip that works at the speed of 2000 mobile phone will you like it? or even buy it? Yes, your presumption rests on the fact that most semiconductors are cutting edge, overwhelming majority of semiconducters being produced are not. There are even new 300 and 200 nm process plants being built right now. Manufacturing is not that labour intensive everything is done by machines you can't generate that much employment now india should have focused on manufacturing in 1970 People supporting him are clueless. If you want to be a weapon making powerhouse, or a car manufacturing hub, you need to reliably produce chips to support that. If you don’t, you’re at the mercy of Taiwan, USA, Korea, and China to supply that. All it takes is a threat of sanctions and you’re pretty screwed if you don’t have your own access to machinery and supply chains. The good news is, you don’t need to build 3nm chips to be competitive. Even a 65nm node is sufficient simply because your use case is not HPC rather industrial and military. Semiconductor manufacturing is Achilles heel for not just India but China, Russia US EU and everyone else. But the fact is no one can build this industry. They tried but failed because of market economy and technological requirements. Many people don't know but India tried Semiconductor manufacturing and failed miserably. It's a very high end technical stuff and requires at least 3 Billion dollars to built a small fab. That's not end of it, it requires update every decade. We can try again but chances are we will end like others. But before you build it, you should know how to build them. Only people are Taiwanese and they are not going to help anyone. We are at least two decades behind in cutting edge tech. Even if we spend decades building the tech we still can't compete with likes of TSMC. That means our product will be costlier than others. There is no logic behind this. TSMC builds the most advanced chips in the world but these chips are designed in US. What are the odds that US will give their designs to India ? With India low key taking side of Russia in this conflict means we will never get high end machines from ASML. ASML is the only company in the world that builds lithography machine. And it's a geopolitical nightmare getting these machines from them. It's a lost cause everyone who tried building semiconductor manufacturing failed. UK EU US Russia China all of them have tried and failed. Although you can say Chinese are still doing much better than others. But we shouldn't give up, India should build it's own low end semiconductor manufacturing and have a multi decade plan on building it's own infrastructure for semiconductor tech. India already has decent amount of manufacturing capacity which is good enough for us. I am not entirely agreeing to his point on the services especially when we are staring at the AI led optimisations that may slowly but surely eat up the services jobs. We need to create the hi-tech ecosystem that could work in conjunction with the local design talents. We are several nano meters behind in the indigenisation which should shield us from the NATO led monopoly in the supply of crucial third party components. We need to think in terms of at least collaborating with the ASML and have our local variants for the tech that currently ASML monopolises . I think Rajan's point of view is from the low margins/yields from the Chinese / Taiwanese semiconductor factories and the need to manage the supply chain and demand cycle. This market is highly competitive and dynamics both in terms of the technology and demand changes every six months. He might be concerned with the US which finally pulls the strings leading it to a scenario like the garments manufactures. That said for the amount of investment that goes in versus the employment it generates is miniscule, or may be something of significance in the supply chain side but as such very low. Boss I'm from Mumbai, we mumbaikars on old India and in new India always kept our target richer countries. Pakistan and Bangladesh are targets for bottom of the barrel folks. For us they are not worthy of competition or consideration. We aim higher and strive to achieve those aims without bringing pedantic religion in every debate. All the best. Semi conductor is not one location business. It involves a lot of countries. Yes chief that's what I wrote As compared to services it's very labour inducive, how many IT workers can realistically find employment ? Also only a tiny sliver of population can work in such field vast majority ends up doing menial jobs for them. India has 1 million new entrants into job market every month, I really doubt just service sector can create that many jobs. Manufacturing surely cannot. Service sector also includes hospitality sector, places where people are required to face customers. People used to say that automation & 3D printing will change or remove humans from manufacturing, but it's the opposite now , automation for a multipurpose tech is incredibly expensive but unlike general purpose AI, we will see huge cost cutting in the service sector in the coming 4-5 yrs. Also, semiconductors will be right after oil in terms of expending foreign reserves. So having a foot in the game will help us immensely. The job we have today either pays very little in core or too much in software, there is no in between. We need that otherwise there is no way to decrease income inequality without taxing the rich to death. Manufacturing absolutely could, provided India reorient itself into a manufacturing nation and goes all out like China did, just giving up isn't an option. There are limits to automation, a robot still can't assemble a mobile phone that's why Foxconn employees 70,000 workers in India. The type of jobs in Hospitality that you are imagining can't provide 10 million jobs, neither can manufacturing alone as such both are needed in their maximum possible job generation capacities. It requires lots of capital. Which sadly India lacks and has almost poor access to. Also it takes lots of time to set up and implement. Having a good infrastructure to transport good is also required. I don't like defeatist attitude of giving up even before starting, India's manufacturing output today is roughly equivalent to China's in late 90s- early 2000s. If they would given up back then they won't be a juggernaut they are today, frankly we don't have any option but to do what China did because otherwise our vast majority of population is destined for eternal squalor. He is an economist. He thinks in terms of numbers. To him, the numbers say it is a game of diminishing returns. Unfortunately, economic development and socio-economic development doesn't always work that way. You need to go forward, break ground and take action. We had every chance to be a manufacturing nation and failed. So, he has given up and says we should stick to services, effectively conceding we aren't good at anything else. Personally, coming from a state with nearly 200+ years of manufacturing history and which has exported finished goods all over the world for a longer time, I do not want an economy completely focused on services. We cannot go on stuffing people into IT offices or pushing them into the hospitality sector. We need to be smart on what we make. The state government here has actually made a smart decision here by inviting foreign governments to set up ground level R&D centres in polytechnic institutes on two next-gen products- Electric Vehicles and Solar Technology. This is exactly the kind of initiative needed. Surgically educate a section of population and turn them into experts, let that talent bleed into the industries and it becomes a self-sustaining loop. We are not \"strong\" at services. We are cheap. This defeatist attitude is the reason why it might not, China being dominant isn't however is an excuse. India's manufacturing output today is roughly the same as China's was in late 90s-early 2000s, if they had policy mandarins like Singh or Rajan they would have never took off. You can watch his recent speech and discussion with shasi tharoor held in Raipur, Chhattisgarh along with the state CM. He has explained there very well.[Question and answer ](https://www.youtube.com/live/cmbMNV1MdX0?feature=share) In general, services are a higher margin business. However with manufacturing you can make up in volume. It is not an either / or. You can do both. Different levels of workforce skills are necessary for different jobs. The gist of his argument is that India should invest in areas where it is competitive, which are services. While indeed true from a globalised economic perspective doesn't always hold true in reality, where countries have put up walls of tariff to protect their economic interest. Services can't generate enough jobs in the first place, our workforce isn't skilled enough in the second place. The fact that no country has really transitioned from poor to rich without an extensive manufacturing is another reality, even city state like Singapore has had a big manufacturing base. Nice joke how us shut down japan? Why manufacturing? We should have stuck to agriculture from the beginning. I'm not being sarcastic. India is blessed with a conducive climate for any kind of crop. More investment in agricultural R&D and technologies like hydroponic farming will make this country a top producer of so many agricultural produce. Moreover, it is labour intensive and doesn't need a high level of skills. This can help with the employment situation. There is always a huge demand for luxury foods and we can capitalise on that. Of course there are drawbacks like current state of supply chain and the backward technology used currently but these can be mitigated by government initiatives and investments. It's not the most glamorous thing but other SE Asian economies like Vietnam are growing rapidly due to this. Don't have to beat chinese just make our own manufacturing ecosystem. \"Manufacturing no longer employs swathes of people.\" And you know what employs swathes of people, albeit ungainfully? Agriculture. You have 40% people employed in a sector that contributes 19% of the GDP. Obviously, there is disguised unemployment and inefficiency there. So how should these people be reassigned? Service sector's white collar jobs requires soft skills and high education to a higher level than the manufacturing jobs. So, there's a better chance for agriculture people to pivot to manufacturing, like it happened in China. I see food processing and packaging as an untapped potential area wherein we could brand our indigenous products for domestic and export consumption. Children's products, especially durables (plastic bath-tubs, toys), is another area of large potential. God know we have a lot of childen. It would be good to have something that's not Made in China even if the in-house variant is at a 20% higher cost than the PRC one. We should not pay heed to the west's insistence on woke products, renewables, et al. That'd just jack up the input cost. We have a younger population than China atm. Basic biology suggests manufacturing is the best way to gain competitive advantage. We have relatively cheap labour. We have a large country with a large coastline that makes it ideal for setting up factories and exporting through the sea routes. I was a foreign trade student and I see how badly we use our EXIM policies. Tarrifs and Quotas are the keys to the west's pockets. It can open doors we can't imagine. We just need to use them adroitly. The advantages seem far too great to not challenge Mr. Rajan's take on the matter. [Read here.](https://www.trtworld.com/magazine/how-us-prevented-japan-s-toshiba-from-becoming-no-1-chipmaker-62393) AI summaries are so garbage Industrial chips (scada, plm, etc) are still in triple digit nm range. Services industry is also highly dependant industry. Manufacturing is much more resilient. This argument is good for a highly capital intensive field like semi conductors but overall manufacturing industry/economy is good Manufacturing needs low cost labour, Indians are not low cost labour that can rival China or low cost of mexican labour. I know someone who works for the world's largest semiconductor IP company, they mention there is no design sales on India, if there is no design sales, then that means no chip will be produced when the manufacturing comes up. manufacturing is a highly leveraged and research oriented in semiconductor, you lose the edge, you lose everything and is easy to get bankrupted Right way I think, we are building the ecosystem. We have the design teams from almost every semiconductor companies setup in Bangalore. It might be a long game but worth it. Good point! What are some examples? [https://en.wikipedia.org/wiki/List\\_of\\_semiconductor\\_fabrication\\_plants](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants) Sort by descending order of size of process nodes, you can see there are as many as 13 semi-conducters plants under-construction. Getting paid as influencer by America? 1. IT is not as automated as manufacturing, so to generate the same amount of revenue in their respective fields, you need more IT workers compared to manufacturing. 2. Many IT workers can’t find jobs because of oversupply of IT workers, not because IT sector is automated 3. Talking about quality of work is a different debate altogether What a well researched counter argument. Give this guy the Nobel prize India simply is not competitive enough on Global scale compared to China,Bangladesh,Vietnam etc when it comes to manufacturing of technology,textiles etc goods..Goods which can be exported out of the country and improve our economy. Difficult in doing business and red tape etc are key problems. India also can't make currency weaker to improve exports which China does! India is exceptional at services export due to its skilled and huge population. So to improve overall performance it's obvious that India should concentrate heavily on its strength but doesn't mean we should forget manufacturing entirely. This is the real and economic driven answer! Rest are basically shit political takes manufacturing requires lower input costs like power and transportation, India is not competitive in those areas compared to other countries, growing services esp outside of Bangalore or other big cities for example is the best bet, Getting services economy in say Patna or Lucknow will bring more overall growth as consumption will increase in those areas, if I were the PM I would do anything to move it companies from Bangalore to Lucknow and Patna and so on.. >move a relatively large diode (2mmx1mm) from one gelpack to another How bloody hard could it be ? I reckon I could do it with a pair of Japanese style chopsticks That makes no sense. India can't ban Chinese stuff unilaterally, no country can because Chinese focus on cheap production and we prefer globalist capitalism. Quality is not always abysmal, like the iPhones were the best in class built in China. If our manufacturing ecosystem needs to improve, are we competing on quality or price? If so, the way we invest vaires wildly. For example, 1000 maruti Suzuki can be built in India, but not one Bugatti because of quality requirements. If our aim is for 10000 maruti or one Bugatti our investment for the technology changes. Makes sense? We currently have advantages in service sector, not manufacturing as of date. If we make our advantage larger, we make more money reliably for longer. If we want to be the jack of all trades and get into manufacturing as well, our resources will spread thin , our focuses change because the capital investment and return cycle of each sector(agri, manufacturing and services) varies wildly. Our long term sustained investment for growth now becomes riskier because of blind diversification . 1 crore in service sector is more predictable for growth in today's market compared to one crore in manufacturing based on roi percentages and employment rates because manufacturing is razor thin margins with minimal room for risk, niche labour requirements compared to service sector and manufactured good sales are based on services like Amazon to stores , which each have different overhead costs ranging from branding to packaging . His vision is simple - Developed society moves from agri to manufacturing to service . We have basically skipped manufacturing, moved into service and are competitive there. Don't regress just for the sake of it, we need more resources in services which isn't saturated yet, keep going to press the advantage. Even worse, most of them did not bother to use a ESD band what we need is a state of the art fab for protyping purposes only, so that you can move r&d and testing jobs to India mass manufacturing wafers doesnt look like an economically sound approach, because its highly automated and capex intensive, typically such investments make sense in countries with very low interest rates.. unless fabs are a prerequisite for attracting downstream labor intensive jobs like systems integration, which they arent as is well known that all chips assembled in taiwan go to mainland china where they are assembled on boards, i dont see much that helps our situation.. nope, it doesnt matter, unless the fab is nationalized nothing prevents them prioritizing US over domestic market. you could have export barriers but surrely that would reflect poorly on our investment worthiness case in point being every country that you are mentioning here prioritizes US, China and other big spenders. i dont see how Taiwan gets a priority access to tsmc's output unless its wartime or an equally special situation Raghuram Rajan is far more qualified than I ever would be. But here are my two cents: It's all about value-add. Think of countries that are incredibly recourse rich, but still poor as fuck. Venezuela, a lot of African countries etc. The kind of money their resources generate, should be enough to turn those countries into economic behemoths. But it doesn't happen often (the Oil states are an exception). The reason for that is because raw resource extraction is not a very high value-add part of the supply chain. Income depends heavily on the price of the good, the labour is usually low skill, and generation of wealth tends to happen only for people who own the place. That's why manufacturing (and not raw resource extraction) is generally preferred (even though finding oil, or equivalent, is often celebrated). It's harder to supplant an entire factory, the labour tends to be a little more skilled and harder to replace, and the wealth generated flows to the rest of the economy as well though taxation (resource extraction can be subject to a lot of black market stuff). Low value goods like plastic goods, fast fashion textiles etc do this to some extent. High value good manufacturing (automobile, IT components, silicon, etc) is even better. Services are on the other end of this from raw resource extraction. They're the hardest to replace, because they require an educated labour force. The economic value generation per capita, tends to be the highest. Most developing countries tend to follow this pattern. They move from an agrarian economy, to a manufacturing economy, to a service based economy. India has the opportunity to move from agrarian directly to a service based economy. Perhaps that's why he's saying what he's saying. I would disagree, in the sense that I think the economies that are the most resilient are the ones who aren't too dependent on just a few sectors. In order to be robust against global market forces, we also ought to have a robust manufacturing sector of our own as well. I could be severely wrong in all of this though, so only take my thoughts with a massive grain of salt. Thanks! Chinese focused on demand and supply, they could control all sides because they're communist. Let's make India communist? True, Chinese did hard work. The time, tech and environment when they began building is changed. Now Chinese economic crisis is hidden due to Russian war. Search about their high expenditure infra failure and their real estate crash which should ahve wiped out 30% savings. What happened to the yuan? Nothing. That kind of blatant manipulation will not fly in globalised markets. If China wants to make the next big thing they're focused on services. In recent years, they're offering apps and software more than manufacturing because it's the next big thing. Their population is skilled in manufacturing though which they're trying to shift. You're comparing the mentality of one person to economic policies of a country. For good manufacturing we need good talented engineers but mostly talented and intelligent engineers are interested in computer sciences. Rest either do mba or upsc after engineering. And also brain drain to west ensures that we have very limited talent here in India who cannot support manufacturing growth required by India"
}