{
    "id": "16its7c",
    "title": "President of Brazil steals pens in India",
    "url": "https://www.reddit.com/r/india/comments/16its7c/president_of_brazil_steals_pens_in_india/",
    "selftext": "Dear friends from India, I am Brazilian and I would like to share with you a subject that is being talked about a lot here on social media in Brazil, a video of the G20 meeting, which took place in your country, which captures our president (a corrupt and ex-convict Lula) allegedly stealing pens after the event, together with his wife's complicity.  I would like you to tell me if it makes sense, and if the body language of both President Lula and his wife are in fact those of two people who are committing a crime.  And I would like to ask if anyone can tell me what type of pen was used at the G20 in India.  Whether they are luxury pens or not.  And let me tell you why this is important, because among several scandals that the current president of my country was involved in, a few months ago, during his inauguration, a controversy arose with a Montblanc pen that he couldn't explain the origin of, so it's clear that the corrupt Lula likes expensive and luxurious things, at the expense of the tax payer.  Thank you for your time, see you soon  \n\nvideo below:\n\nhttps://m.youtube.com/watch?v=2e6dMPsNGqE",
    "flair": "Politics",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1694725253.0,
    "convurl": "https://external-preview.redd.it/wus6H2UbdfmTST3SIcg1WNvCt9j6_iTGkQinfyi9sr8.jpg?auto=webp&s=f3dc0cd5ee5a160655871ce7114acb93c405e10d",
    "comments": [
        "Are you some kind of jilted Bolsonaro fan pissed off that he lost the election to Lula?\n\nWtf is the President of the 5rd largest country in the world doing stealing pens? \n\nLet us know when he starts a Presidents fund for Covid relief, accepts billions of dollars in donations, converts the fund to a private one and claims the money for himself and his party.\n\nUntil then keep all this amateur pen bullshit out of here",
        "Apply for a job in Indian TV Media. You will go a long way.",
        "Bruh, our Indian Prime Minister stole the whole country and sold it to a corrupt businessman. \n\nWe really don't care about the pens. Keep them. We have bigger problems.",
        "Who doesn't take pens at conferences? Mementos, gifts, or sometimes you just find a pen type that's really nice.\n\n\nI have pens and pencils from conferences I attended in college, almost 20 years ago.",
        "Spotted a Brazilian equivalent of a Trumpet 😂😂",
        "Stealing pens >> Stealing entire Amazon forest",
        "I also have spoons, those are stolen.",
        "Hahahahaha your average Bolsonaro fan.",
        "I don't know what pens were used but I have been part of several smaller G20 conferences and pens there are usually paper pens (a recycled paper is rolled beautifully on ink and the cap is also made of paper)\n\nFrom the video, it seems they are the same pens. \n\nOn the back of it, there is a cup shape made of cellulose, and inside that cup shape there are some seeds. \n\nIdea is, if you throw that pen after use, It will biodegrade and plant will grow. \n\nEach pen costs about 0.30 USD in India. Since they were mass produced for G20, the cost per pen would have been around 0.15 USD or maybe even less. \n\nSo most likely He was not stealing pens. \n\nHope this helps"
    ],
    "cleaned_text": "president brazil steals pens india dear friends india brazilian would like share subject talked lot social media brazil video g meeting took place country captures president corrupt exconvict lula allegedly stealing pens event together wifes complicity would like tell makes sense body language president lula wife fact two people committing crime would like ask anyone tell type pen used g india whether luxury pens let tell important among several scandals current president country involved months ago inauguration controversy arose montblanc pen couldnt explain origin clear corrupt lula likes expensive luxurious things expense tax payer thank time see soon video ",
    "cleaned_title": "president brazil steals pens india",
    "cleaned_selftext": "dear friends india brazilian would like share subject talked lot social media brazil video g meeting took place country captures president corrupt exconvict lula allegedly stealing pens event together wifes complicity would like tell makes sense body language president lula wife fact two people committing crime would like ask anyone tell type pen used g india whether luxury pens let tell important among several scandals current president country involved months ago inauguration controversy arose montblanc pen couldnt explain origin clear corrupt lula likes expensive luxurious things expense tax payer thank time see soon video",
    "cleaned_comments": "kind jilted bolsonaro fan pissed lost election lula wtf president rd largest country world stealing pens let us know starts presidents fund covid relief accepts billions dollars donations converts fund private one claims money party keep amateur pen bullshit apply job indian tv media go long way bruh indian prime minister stole whole country sold corrupt businessman really dont care pens keep bigger problems doesnt take pens conferences mementos gifts sometimes find pen type thats really nice pens pencils conferences attended college almost years ago spotted brazilian equivalent trumpet stealing pens stealing entire amazon forest also spoons stolen hahahahaha average bolsonaro fan dont know pens used part several smaller g conferences pens usually paper pens recycled paper rolled beautifully ink cap also made paper video seems pens back cup shape made cellulose inside cup shape seeds idea throw pen use biodegrade plant grow pen costs usd india since mass produced g cost per pen would around usd maybe even less likely stealing pens hope helps",
    "light_cleaned_title": "President of Brazil steals pens in India",
    "light_cleaned_selftext": "Dear friends from India, I am Brazilian and I would like to share with you a subject that is being talked about a lot here on social media in Brazil, a video of the G20 meeting, which took place in your country, which captures our president (a corrupt and ex-convict Lula) allegedly stealing pens after the event, together with his wife's complicity. I would like you to tell me if it makes sense, and if the body language of both President Lula and his wife are in fact those of two people who are committing a crime. And I would like to ask if anyone can tell me what type of pen was used at the G20 in India. Whether they are luxury pens or not. And let me tell you why this is important, because among several scandals that the current president of my country was involved in, a few months ago, during his inauguration, a controversy arose with a Montblanc pen that he couldn't explain the origin of, so it's clear that the corrupt Lula likes expensive and luxurious things, at the expense of the tax payer. Thank you for your time, see you soon video below:",
    "light_cleaned_comments": "Are you some kind of jilted Bolsonaro fan pissed off that he lost the election to Lula? Wtf is the President of the 5rd largest country in the world doing stealing pens? Let us know when he starts a Presidents fund for Covid relief, accepts billions of dollars in donations, converts the fund to a private one and claims the money for himself and his party. Until then keep all this amateur pen bullshit out of here Apply for a job in Indian TV Media. You will go a long way. Bruh, our Indian Prime Minister stole the whole country and sold it to a corrupt businessman. We really don't care about the pens. Keep them. We have bigger problems. Who doesn't take pens at conferences? Mementos, gifts, or sometimes you just find a pen type that's really nice. I have pens and pencils from conferences I attended in college, almost 20 years ago. Spotted a Brazilian equivalent of a Trumpet 😂😂 Stealing pens >> Stealing entire Amazon forest I also have spoons, those are stolen. Hahahahaha your average Bolsonaro fan. I don't know what pens were used but I have been part of several smaller G20 conferences and pens there are usually paper pens (a recycled paper is rolled beautifully on ink and the cap is also made of paper) From the video, it seems they are the same pens. On the back of it, there is a cup shape made of cellulose, and inside that cup shape there are some seeds. Idea is, if you throw that pen after use, It will biodegrade and plant will grow. Each pen costs about 0.30 USD in India. Since they were mass produced for G20, the cost per pen would have been around 0.15 USD or maybe even less. So most likely He was not stealing pens. Hope this helps"
}