{
    "id": "15fl63r",
    "title": "My cousin, the last of my family has moved out of India. A sigh of relief escaped me and I want to share why.",
    "url": "https://www.reddit.com/r/india/comments/15fl63r/my_cousin_the_last_of_my_family_has_moved_out_of/",
    "selftext": "I have many beloved memories of visiting my Auntie and her family in Chennai. Running along the banks of the mighty river, catching fireflies in the gardens at night, the bustling markets, the incredible food, my families eclectic home. Yet my memories are so tainted by incidents where I feared for my life, where I felt eaten alive by the eyes of men around me. Where I was told, as a 8 year old, to not look men directly in the eyes. Where I was groped and shoved and grabbed and leered at. Today, as I realized my cousin has gotten on her flight, the last person in my family to move back to Europe, I stumbled across an article with the headline \"More than 1 million women disappeared in India between 2019-2021\" ([article](https://www.thenationalnews.com/world/asia/2023/07/31/more-than-1-million-women-went-missing-in-india-from-2019-to-2021/) )  \n\n\nThroughout the years, I never asked my cousins about what I worried about the most, if they are safe.  I would push the thought out of my mind as soon as it came and I would not read news regarding the massive violence against women in India. The understanding of this immense danger was so clear, so imminent, I felt suffocated by the idea that my cousins could fall prey to violence and femicide.  \n\n\nNow that my last family member has left, it feels as though a gigantic weight has lifted from me. I will never have to fear for her again. But still I pray for the millions of women in India, who fear for their lives everyday. ",
    "flair": "Rant / Vent",
    "score": 1,
    "num_comments": 1,
    "created_utc": 1690915768.0,
    "convurl": "https://external-preview.redd.it/oDnxPwo20BbZb8uw4sDxV0tIWQRqayT9kx9Hk8Knwh4.jpg?auto=webp&s=d429e3c1579c148cb83f1872ffc6544c1407de90",
    "comments": [
        "My family is still in India and I’m trying everythjng to get them out of there. Visiting after so many years and I genuinely cannot stand walking those streets anymore. The country is broken. We just save our families.",
        "Imagine being a Pakistani and getting shocked by Indian roads. A few days back you were complaining for not getting Visa to visit from UK and now once you're here you cannot stand walking the streets. Truly no winning with you lot",
        "That article was a miss lead most of the girls return home within a week. I will share when I will get the supporting article.",
        "“Most of the girls return home within a week” .. after what though? After kidnapping? Rape? Torture? This doesn’t really make it better at all!",
        "now many people will bash you for this post, but the truth is, anyone will lead a better standard of life in Europe and the US than India. \nBest of luck.",
        "Isn't this too much?\nYou wanted to leave, then leave. Hope you reach the paradise your dreams, where no sin exists. \n\nKhade ho kar bolna bahot easy hai. Ghar ke safai me haath gande kaun kare. \nNahi?\n\nShameful.\n\nAnyways hope wherever you reach, you can truly call that place your home and natives accept you as the same.",
        "Isn't this too much?\nYou wanted to leave, then leave. Hope you reach the paradise your dreams, where no sin exists. \n\nKhade ho kar bolna bahot easy hai. Ghar ke safai me haath gande kaun kare. \nNahi?\n\nShameful.\n\nAnyways hope wherever you reach, you can truly call that place your home and natives accept you as their own.",
        "Sorry if it was not clear from my writing. My Aunt moved to India for her business and took her family with her, my cousins were 2 and 3 years old at the time. They were there as foreigner/expats from France. Venting here, because I’ve never understood how violence against women could be so normalized..",
        "this post is giving 'I'm living a better life than y'all' vibes 😭",
        "Thank you. It was a cultural thing that I never understood and maybe now I can talk to my cousins about how they dealt with it.",
        "Go to the Muslim and Balkan populated areas in Strasbourg",
        "Yea this wasn’t intended at all but I totally see it too. I’m so sorry. I had some of my best childhood memories in India and I have great love for especially Tamil Nadu. If it wasn’t for the severe violence women face I would consider to travel to India again and even to live there. It was a combination of being super shocked by this article and happy for my family to move back home..",
        "Please fuck off without these idiotic rants",
        "Ya no worries I live in Berlin where groping and harassing is part of my daily reality too. It’s bad everywhere on this planet, in India and the Middle East the violence and oppression of women is, devastatingly so, on a whole other level..",
        "Nautanki and drama .",
        "Now you have come to gloat that you live in Berlin. Get out of here .",
        " in this post you're saying you're very glad that you/your family won't be harassed in the streets anymore WHILE reminding us indians that we might be. very very tone deaf and unnecessary IMO.",
        "That wasn’t the point though. Gotta admit that india has a big problem no?? You think women are ok here??",
        "I would suggest getting out of your cosy European city and travelling a bit around the real world so that your perception isn’t so warped. You want to extrapolate a statistic and apply it to the whole country, across all economic classes? 1 million is 0.006% of the population. 1.5 billion people live here and good chunk of that is a thriving population. It’s alright to compare the standard of living and factors such as women safety. India is clearly lacking in those vectors. But to make it sound like this place is fucking Mordor where every minute women are disappearing left right and centre is just ridiculous. I guess the sensational news headline has done its job. I recommend subscribing to better quality journalism which respects nuance and isn’t a doomseller.",
        "Well, if Indians are the biggest problem, we are migrating all around the world. You aren’t safe then, I guess?",
        "What exactly are you venting about? I don't see a point here.",
        "I am really seeing the severe tone deafness of this post. I am not white but that doesn’t mean I’m absolved of the insensitivity that comes with mostly growing up in the privileged confines of “safe” Europe.   \n\nI am super sorry. Do you think I should delete this whole post or the whole text and leave up the article..? I obv carry a lot of anger in me when it come to violence against women and other ppl made vulnerable by shit minds. But in the case of India I guess I thought it was something I was also affected by since I spent big chunks of my summer childhoods with my family, realizing now that maybe it’s not at all for me to chime in",
        "when was the last time you visited India? \n\nYou know this is an extremely over exaggeration right?",
        "2018",
        "I guess you have got some wrong idea. I wouldn't say that India is a completely safe place for women but this post somehow sounds misleading. Idk if you really meant it, anyhow this seems a bit unnecessary, the whole 'venting'.",
        "Stupid ass comment, sin exists everywhere but India has a major problem with rape culture and it’s treatment of women. \n\nOP and her family left India for a new place for increased safety, no shame in that.\n\nYou can’t expect a demographic privy to crime to be the ones that change the country",
        "Ignore them, india has a problem w rape culture as i mentioned in one of my other comments. Wanting to leave india in search of a safer place isn’t something to be shamed for.\n\nYou’re good dw about it 👍",
        "Ma'am violence against women can never be accepted as normal. Women's rights in India have come a long way, still many issues exist including thr constant ogling you mention. \nNo one can deny the lived reality of women all over the world including India.\nThis starring issue is within every class of society-from the bottom to the top and I am a witness to this. My head hangs in shame when I see incidents like Japanese tourist assaulted during Holi or child kidnapped and raped. \nOne thing I thank God for is that I have bad enough eyesight that I didn't get into this activity. I remember fighting a friend when he asked me to come checkout a girl with big breasts, she heard us and I can only imagine what must be going on in her. What's her mistake, being objectfied for what? Just existing.\nSo I can definitely not feel the pain and anger but I do understand. \n\nI am preparing to join the civil services.\nEven my own brother says we should leave India and settle in North America. I only try to explain that I trying to fight the issues of India, so how can I leave. Wherever I go I will only be a migrant, this is my home. Many many issues plague this country but it is also my responsibility to improve the situation so that it's better for the next generations of Indians. \n\nI hope this explains my point of view.\n\nI am sorry If I offended you. I hope that a day comes when you and other women could feel happy and safe here, at home.",
        "Bunch of insecure dumbasses in this post, OP’s sharing her reasons for leaving India, like it or not, it’s not safe for women compared to western countries.\n\nIf you think OP is somehow rubbing it in your face then you might be brain dead.\n\nAnytime anybody even slightly privileged comes  and posts, all you dumbasses get riled up and start shitting on them even if they have valid issues",
        "I totally understand you, thank you for sharing your perspective. Respect to you, for standing up for women and putting in efforts to making this world a place where we can all feel safe! If only we were all as aware of our responsibilities and moral obligations to eachother 💜",
        "Listen all I can say is sorry you to experience that in your childhood , you have deep underlying trauma and i hope you get the help you need to move on with your life .\n\nNow coming to your vent , you equated something that happened to you in your childhood and applied it to everyone , that doesn't work everywhere I am afraid.\n\nIs India a perfect place ? Nope it has a lot of issues . Is India a rapist hellhole like you have described , also nope . You have linked 1 million women have dissaperead in 3 years , our hearts bleed that so many of our sisters have dissaperead. So that's 333 thousand out of 600 million per year . You can do the maths yourself and compare it with world averages , we are not in the front or the back . I'm not making any excuses it's very bad to be even in the middle .\n\nhttps://worldpopulationreview.com/country-rankings/rape-statistics-by-country\n\nI just pulled the first result from Google , there are many such statistics that always consistently show India is nowhere near the hellhole you all portray it to be .\n\nIf you are referring to the Manipur incident yes we are deeply ashamed , however in your rants you make it seem like it is a daily occurance . It is not . It is happening in a region which is almost in a state of war and the very structure of society is in a complete state of chaos .the animals caught doing this will be caught and never see the light of the day , but the point I'm trying to make is these are circumstances that are not as common as you are making it out to be .",
        "It’s not Indians. It’s rape culture, this is especially bad in India. But it is also bad everywhere in the world.",
        "it's not. india isn't safe. we know that already. that's why reminding us of that while feeling happy for having to not deal with it is so fucking annoying.",
        "Boo hoo you’ll come across posts or ppl like this irl too, can’t be annoyed all the time bout it. Op isn’t even trying to be annoying so idk why she’s getting so much hate",
        "Thank you so much for your effort to clarify some numbers with me, it’s truly appreciated. I have been to a lot of places in the world though, I lived in 6 countries, and I can safely say that I felt the least safe in Saudi Arabia and in India.. in India more so as I got to travel freely and really experience it and know quite a few people there. Most families I know have had bad incidences happen to female family members.. Have the women in your life experiences of assault, rape and violence? How many of them? All of this is bad here too, but significantly less so and also less normalized in language, public life, media, etc",
        "boo hoo I can be annoyed at whatever I want 😭",
        "Fair enough lmaooo",
        "Imagine an American leaving America cause there's gun violence there🤡🤡 have a problem? Change it from within. Anyone can catch flights. Just saying, a little bit of your privilege is showing.",
        "Ffff honestly I hate these kinds of ppl flaunting privilege and being patronizing and I’m feeling shame that I actually have the capacity to be that person.. but I also like some of the discussion happening on here and will probably waste some time feeling conflicted on Reddit 🥴💀",
        ">Have the women in your life experiences of assault, rape and violence? How many of them?\n\nSince you asked , none . My mom's side has 6 women . My dad's side has 15. I'd say at Max one woman has encountered domestic violence due to a shit marriage but all the women were supportive towards her and reprimanded the male . They eventually divorced and I know that now she is living happily .\n\nDo they feel safe ? Sure during the day yes , during the night not so much but even i as a male don't feel safe during the night , due to cops catching people at random and then fleecing money if you don't have id or a good reason for being out at late night .\n\n>Most families I know have had bad incidences happen to female family members.\n\nI mean this very subjective . It depends on so many things the area , the class ( rich , middle , poor ) . I lived in Chennai in an area called saligram and it was a low middle class area and there were barely any women indecency issues or even domestic violence . I don't doubt your observations but you are taking your very small sample sizes and extrapolating it to 600 million plus women .\n\n>All of this is bad here too, but significantly less so and also less normalized in language, public life, media, etc\n\nNo one is disputing that , compared to Germany it is definitely more . But Germany is far far more advanced and developed from education system to religion to law and order . From the grassroots level the right education is being provided , in India just getting education is itself a challenge , naturally we won't be able to reflect the numbers shown by advanced countries .\n\nAnd I don't think we are normalising anything . We remember each and every incident and though rather sadly I can't say we have learnt 100% lessons from each incident ( if that was the case after nirbhaya nothing would have happened) , we are definitely making slow and sure progress . Maybe not to the level you will be happy with but we are definitely trying our hardest to change .",
        "- Says she’s relieved that her entire family is out of India, because it’s unsafe for women. \n- lives in Berlin \n\nMFW",
        "It is not just Indians but also law and order, enforcement of said law, corruption of said enforcers, sluggishness of judiciary, political support for abusers and harassers etc\n\nMost of these are solved if you move to a developed country",
        "She’ll never let the facts come in the way of her narrative.",
        "Typical male response, easy to downplay the struggle faced be every single woman in the country just to exist, because you will never have to face something like that yourself",
        "again, thanks a lot for your perspective and allowing me to understand my biased, subjective and small sample size experience.",
        "People are calling out on the tone deafness of the article, quite rightly. This post reeks.",
        "It’s not. Saying this as a guy",
        "I wouldn’t say i can dismiss your feelings about the country - who am I to do that. But I also doesn’t understand the point of the post. Doesn’t your newly adopted country have a subreddit for you to rant in? I think checking out of india subreddit could lift some weight off your shoulders too",
        "Why?",
        "There is no tone deafness, if anything the opposite. She’s literally been effected by India’s rape problem and is sharing that experience to communicate why she decided to leave.",
        "Realizing the gross exaggeration and subjective perspective I have due to a really biased view and too little knowledge on lived reality in India. All I can speak for are my experiences and feelings I get when I read the \"news\" (in parenthesis as media on such issues is never really neutral and really sensationalized, like the article I posted) .  \n\n\nThe last time I was in India was in 2018. Me and friends (M+F) travelled from Chennai to Ooty to Goa, with lots of stops in between. With our male friend we felt mostly safe, then toward Goa in a hotel in a small town, our female friend got assaulted. We then put on wedding rings, a tip from my cousins, and didnt get too much hassle afterwards (just the odd groping and touching here and there and discomfort by staring though, which we were mentally prepared for)",
        "The point isn't that this isn't a safe place, it's that this isn't the only unsafe place in the world.",
        "Oh ok, so the 'point' was basically \"we are better than pakistan\"\n\nCongratulations 🎉",
        "I am not saying Pakistan. I am sure rape occurs in many countries around the world and there are places in these countries where it's unsafe for women. India isn't the only such country.",
        "These rants are becoming more and more idiotic",
        "Facts?! What facts? Facts don’t matter in today’s world.",
        "I disagree. There’s a blatant tone deafness in that post. You can disagree with me. That’s fine.",
        "Hey OP\nSeems like you’ve got rose tinted glasses and a very Eurocentric belief that everywhere except India is good. \n\nYou should try looking at statistics of Europe and other countries for safety. \n\nWish you and your family the best.",
        "Generally, Indian men love rape and this goes for all of the Indian subcontinent. Rape has been a huge part of Indian culture. From Ramayan to movies made in modern times. The way people curse in India is quite revealing about the way men treat women as it's almost always about having sex with a female relative, whether it be sister or mother. The culture needs to change in the whole subcontinent and change comes after admitting that the root cause is the culture. Hindus always argue that they worship Goddesses and what not but they are not much better than many Islamic countries. India is completely and utterly Islamized in that sense.",
        "If women in your family did experience any sexual violence or abuse, they wouldn't tell you since culturally it's very shameful. India has a huge problem and needs to step up.",
        "I hear you! I also have one female cousin and she’s coming to Canada and can’t be more thrilled! It’s funny everyone here saying “it’s not as bad as some countries” here (usually a man) - if they ask any female member of their family raised in India, they have all been groped, eve teased, and/or other sexual harassment. Probably even beaten up by male relatives. My only sexual harassment experiences have been in India and it’s the place I least visit. Life is much better outside India for women and I have lived in countries way way way more poor than India.",
        "You're right. Pakistan living rent-free in so many Indian's heads lol. You didn't even mention Pakistan. There is literally no reason to bring it into the convo but the other guy managed to do just that.",
        "No i would know, not from them but from my cousins . And yes we do need to step up , grassroots level education is required along with stricter laws and it's implementation.",
        "I see hateful comments by mostly men as if they know what it like to be a woman in India. I live in Sweden and most women who have ever travelled to India have the same complaint. This goes for Swedes and NRIs both. India sucks when it comes to safety for women. You guys hating on Reddit should be ashamed for putting energy in trying to disprove something you never could have experienced since you're not women. Also, most of the women you know will never honestly tell you about their experiences since it's still very shameful in India to be a victim of sexual crime.",
        "Huh. Once, my mentor from an internship told me how she was catcalled/harassed in the streets of London. And then went on to say something like, “if I wanted to be treated this way I’d be in India anyway”. \n\nNot comparing two countries, but sometimes I actually feel that safety is an illusion we create for ourselves :(",
        "It's 0.06%",
        "\" but sometimes I actually feel that safety is an illusion we create for ourselves :( \"\n\n100% this. As it is non existent for us, we create safety as pockets in time, passing moments of feeling safe. That illusion is over as soon as a man's reality will crash into ours. And obv they are everywhere. London is sooo bad too, someone just told me they had counted to have gotten harassed 16 times in one day. Even worse in Berlin. We have got to start whipping men and revolting drastically or something.",
        "In 2022  11896 rape cases took place in Germany  while 31677 rape cases took place in India (this is 2021 data , 2022 is yet to be released by NCRB).\nNow Germany has a population of 83 million (8.3 cr) while india has a population of 1.42 billion(142 cr).\nSo around 14.28 rape per 100000 of the population in Germany. \nWhile the same figure stands at about 2.2 per 100000 for india. \nWhile nobody is defending the crime committed against women and that such incidences should not occur in a civilized society,  but an unfortunate reality is that even if one incident occurs in some corner of this country it is blown out of proportion by all the media houses creating mass sensationalism. While at the same time  100s of such cases may be happening across Europe and USA  [ which has 43.5 rapes PER 100000 people , ONE Of the HIGHEST in the world] , most of the media houses don't even bat an eye to such incidences.\n\nThus the common narrative  as a result of these coverages became that all the women in india are assault victims and that india is some lawless desolate land where being a woman automatically means you will be molested.",
        "i agree. i did the whole \"i pray for the women in india\" thing and im embarassed.",
        "I can’t help it if that’s the conclusion you want to draw from my comment.",
        "Sorry. Typo.",
        "Regarding that article, 1 million is the number of women gone missing, not the number of women gone missing _and_ never found. Don't fall for that click bait headline.",
        "I don't think you are aware of the fact that most missing reports are closed within days because most people go missing because of petty reasons.",
        "Look, I have no problem with anyone emigrating out of India. We all have our reasons and that’s okay. Not my place to judge. However, one thing I don’t understand— how come a bad experience with a bunch people in any other country is a bad experience with that bunch of people, but when it comes to us brown unwashed masses, it’s a referendum on the entire country and society? \n\nI have no doubt that there may be a bunch of people who made you fear for your safety, life, and dignity. I spit on them, and hope that they die a slow and painful death. I am also sorry that you had to experience that, however, you also mentioned in your post that you had a good time in India too, I am sure there must a bunch of people who were friendly, kind, and helpful to you and yours. However, while condemning the assholes who made you fear for your safety, you lumped the good people who came in your life India together with the assholes. Is that fair to them? \n\nSomewhere in the comment section, you said you’re based in Berlin, I’ve been to Berlin and quite a few German cities, and it’s no utopia. So, if someone makes you feel uncomfortable over there, is it going to be entire German or just those people?",
        "Look, I have no problem with anyone emigrating out of India. We all have our reasons and that’s okay. Not my place to judge. However, one thing I don’t understand— how come a bad experience with a bunch people in any other country is a bad experience with that bunch of people, but when it comes to us brown unwashed masses, it’s a referendum on the entire country and society? \n\nI have no doubt that there may be a bunch of people who made you fear for your safety, life, and dignity. I spit on them, and hope that they die a slow and painful death. I am also sorry that you had to experience that, however, you also mentioned in your post that you had a good time in India too, I am sure there must a bunch of people who were friendly, kind, and helpful to you and yours. However, while condemning the assholes who made you fear for your safety, you lumped the good people who came in your life India together with the assholes. Is that fair to them? \n\nSomewhere in the comment section, you said you’re based in Berlin, I’ve been to Berlin and quite a few German cities, and it’s no utopia. So, if someone makes you feel uncomfortable over there, is it going to be entire German or just those people?",
        "I simply don't understand the point of these posts.\n\nThe ones here arent the criminals. They are t the rapists. They aren't the ones who scam. Who works in kidnapping circles. We arent in power. Heck the people we WANT to be in power aren't there either.\n\nWhat do you want us to do? What will posting on reddit, especially Indian reddit accomplish?",
        "This is exactly what it is…honestly nobody gives a damn..op your whole family moved to europe? good for you but no need to announce their departure.",
        "I live in the United States. All my female/AFAB friends have experienced some form of sexual violence. The world is a really shitty place. I agree that there is a problem with rape and sexual violence in India and we should do what we can but your post implies that Europe and other countries are free from this. Sexual violence isn't inherently an Indian problem, its a patriarchal problem and the way to go about fixing it is to dismantle patriarchy.",
        "Good! Glad people like you left India. God! So much arrogance and tone deafness in one post is not what you see everyday even on Reddit.",
        "Eh. I wouldn’t assume that you would know. I’ve been molested thrice. None of my cousins or family know. Meanwhile when I’ve spoken with female friends or even acquaintances about this issue, turns out an easy 80+% have had similar experiences in India. (Disclaimer: anecdata)\n\nNot sure if that’s how you meant it, but an earlier comment of yours mainly focused on DV in the realm of sexual assault. And while that’s far more severe than molestation, I’m sure you recognize that it’s by no means the only form of sexual violence Indian women experience day to day.",
        "I 100% agree that my writing is not in the best tone and presenting a super skewed and subjective perspective. I am super sorry about that and quite embarassed but happy to get told I guess. I really need to work on how I see things and how I reflect on how I form an opinion and express that opinion..   \n\n\nEverywhere in this world are women unsafe, I live in Germany where similarly to you, every AFAB person I know has experienced some form of sexual violence. Comparison to how apparent this is in language, culture and media won't make a difference and we will have to fight until we've dismantled the patriarchy, truly",
        "Ok? And what is the relevance of that? OP is from India, this is the subreddit called r/India, so of course people will point out about this country. What is the purpose of saying \"but other countries too!\"?",
        "What do you mean what relevance does it have? The post was basically, \"I saw the 1 million women reported missing over 3 years news article. I'm so glad my entire family is now in Europe!\" Except [600,000 people go missing in Europe](https://www.amberalert.eu/our-mission) every year. Assuming only half of those are women (typically it's more), that's 900k over 3 years. On a per capita basis that's higher than India. There's a lot India deserves to be criticized for including the missing women, but these people need to look at how dirty their own backyards are first before they start casting judgment on us and dehumanizing us.",
        "You think India is good for men or anyone ? Stop whining and do something about it ."
    ],
    "cleaned_text": "cousin last family moved india sigh relief escaped want share many beloved memories visiting auntie family chennai running along banks mighty river catching fireflies gardens night bustling markets incredible food families eclectic home yet memories tainted incidents feared life felt eaten alive eyes men around told year old look men directly eyes groped shoved grabbed leered today realized cousin gotten flight last person family move back europe stumbled across article headline million women disappeared india articlehttpswwwthenationalnewscomworldasiamorethanmillionwomenwentmissinginindiafromto throughout years never asked cousins worried safe would push thought mind soon came would read news regarding massive violence women india understanding immense danger clear imminent felt suffocated idea cousins could fall prey violence femicide last family member left feels though gigantic weight lifted never fear still pray millions women india fear lives everyday ",
    "cleaned_title": "cousin last family moved india sigh relief escaped want share",
    "cleaned_selftext": "many beloved memories visiting auntie family chennai running along banks mighty river catching fireflies gardens night bustling markets incredible food families eclectic home yet memories tainted incidents feared life felt eaten alive eyes men around told year old look men directly eyes groped shoved grabbed leered today realized cousin gotten flight last person family move back europe stumbled across article headline million women disappeared india articlehttpswwwthenationalnewscomworldasiamorethanmillionwomenwentmissinginindiafromto throughout years never asked cousins worried safe would push thought mind soon came would read news regarding massive violence women india understanding immense danger clear imminent felt suffocated idea cousins could fall prey violence femicide last family member left feels though gigantic weight lifted never fear still pray millions women india fear lives everyday",
    "cleaned_comments": "family still india im trying everythjng get visiting many years genuinely stand walking streets anymore country broken save families imagine pakistani getting shocked indian roads days back complaining getting visa visit uk youre stand walking streets truly winning lot article miss lead girls return home within week share get supporting article girls return home within week though kidnapping rape torture doesnt really make better many people bash post truth anyone lead better standard life europe us india best luck isnt much wanted leave leave hope reach paradise dreams sin exists khade ho kar bolna bahot easy hai ghar ke safai haath gande kaun kare nahi shameful anyways hope wherever reach truly call place home natives accept isnt much wanted leave leave hope reach paradise dreams sin exists khade ho kar bolna bahot easy hai ghar ke safai haath gande kaun kare nahi shameful anyways hope wherever reach truly call place home natives accept sorry clear writing aunt moved india business took family cousins years old time foreignerexpats france venting ive never understood violence women could normalized post giving im living better life yall vibes thank cultural thing never understood maybe talk cousins dealt go muslim balkan populated areas strasbourg yea wasnt intended totally see im sorry best childhood memories india great love especially tamil nadu wasnt severe violence women face would consider travel india even live combination super shocked article happy family move back home please fuck without idiotic rants ya worries live berlin groping harassing part daily reality bad everywhere planet india middle east violence oppression women devastatingly whole level nautanki drama come gloat live berlin get post youre saying youre glad youyour family wont harassed streets anymore reminding us indians might tone deaf unnecessary imo wasnt point though got ta admit india big problem think women ok would suggest getting cosy european city travelling bit around real world perception isnt warped want extrapolate statistic apply whole country across economic classes million population billion people live good chunk thriving population alright compare standard living factors women safety india clearly lacking vectors make sound like place fucking mordor every minute women disappearing left right centre ridiculous guess sensational news headline done job recommend subscribing better quality journalism respects nuance isnt doomseller well indians biggest problem migrating around world arent safe guess exactly venting dont see point really seeing severe tone deafness post white doesnt mean im absolved insensitivity comes mostly growing privileged confines safe europe super sorry think delete whole post whole text leave article obv carry lot anger come violence women ppl made vulnerable shit minds case india guess thought something also affected since spent big chunks summer childhoods family realizing maybe chime last time visited india know extremely exaggeration right guess got wrong idea wouldnt say india completely safe place women post somehow sounds misleading idk really meant anyhow seems bit unnecessary whole venting stupid ass comment sin exists everywhere india major problem rape culture treatment women op family left india new place increased safety shame cant expect demographic privy crime ones change country ignore india problem w rape culture mentioned one comments wanting leave india search safer place isnt something shamed youre good dw maam violence women never accepted normal womens rights india come long way still many issues exist including thr constant ogling mention one deny lived reality women world including india starring issue within every class societyfrom bottom top witness head hangs shame see incidents like japanese tourist assaulted holi child kidnapped raped one thing thank god bad enough eyesight didnt get activity remember fighting friend asked come checkout girl big breasts heard us imagine must going whats mistake objectfied existing definitely feel pain anger understand preparing join civil services even brother says leave india settle north america try explain trying fight issues india leave wherever go migrant home many many issues plague country also responsibility improve situation better next generations indians hope explains point view sorry offended hope day comes women could feel happy safe home bunch insecure dumbasses post ops sharing reasons leaving india like safe women compared western countries think op somehow rubbing face might brain dead anytime anybody even slightly privileged comes posts dumbasses get riled start shitting even valid issues totally understand thank sharing perspective respect standing women putting efforts making world place feel safe aware responsibilities moral obligations eachother listen say sorry experience childhood deep underlying trauma hope get help need move life coming vent equated something happened childhood applied everyone doesnt work everywhere afraid india perfect place nope lot issues india rapist hellhole like described also nope linked million women dissaperead years hearts bleed many sisters dissaperead thats thousand million per year maths compare world averages front back im making excuses bad even middle pulled first result google many statistics always consistently show india nowhere near hellhole portray referring manipur incident yes deeply ashamed however rants make seem like daily occurance happening region almost state war structure society complete state chaos animals caught caught never see light day point im trying make circumstances common making indians rape culture especially bad india also bad everywhere world india isnt safe know already thats reminding us feeling happy deal fucking annoying boo hoo youll come across posts ppl like irl cant annoyed time bout op isnt even trying annoying idk shes getting much hate thank much effort clarify numbers truly appreciated lot places world though lived countries safely say felt least safe saudi arabia india india got travel freely really experience know quite people families know bad incidences happen female family members women life experiences assault rape violence many bad significantly less also less normalized language public life media etc boo hoo annoyed whatever want fair enough lmaooo imagine american leaving america cause theres gun violence problem change within anyone catch flights saying little bit privilege showing ffff honestly hate kinds ppl flaunting privilege patronizing im feeling shame actually capacity person also like discussion happening probably waste time feeling conflicted reddit women life experiences assault rape violence many since asked none moms side women dads side id say max one woman encountered domestic violence due shit marriage women supportive towards reprimanded male eventually divorced know living happily feel safe sure day yes night much even male dont feel safe night due cops catching people random fleecing money dont id good reason late night families know bad incidences happen female family members mean subjective depends many things area class rich middle poor lived chennai area called saligram low middle class area barely women indecency issues even domestic violence dont doubt observations taking small sample sizes extrapolating million plus women bad significantly less also less normalized language public life media etc one disputing compared germany definitely germany far far advanced developed education system religion law order grassroots level right education provided india getting education challenge naturally wont able reflect numbers shown advanced countries dont think normalising anything remember every incident though rather sadly cant say learnt lessons incident case nirbhaya nothing would happened definitely making slow sure progress maybe level happy definitely trying hardest change says shes relieved entire family india unsafe women lives berlin mfw indians also law order enforcement said law corruption said enforcers sluggishness judiciary political support abusers harassers etc solved move developed country shell never let facts come way narrative typical male response easy downplay struggle faced every single woman country exist never face something like thanks lot perspective allowing understand biased subjective small sample size experience people calling tone deafness article quite rightly post reeks saying guy wouldnt say dismiss feelings country also doesnt understand point post doesnt newly adopted country subreddit rant think checking india subreddit could lift weight shoulders tone deafness anything opposite shes literally effected indias rape problem sharing experience communicate decided leave realizing gross exaggeration subjective perspective due really biased view little knowledge lived reality india speak experiences feelings get read news parenthesis media issues never really neutral really sensationalized like article posted last time india friends mf travelled chennai ooty goa lots stops male friend felt mostly safe toward goa hotel small town female friend got assaulted put wedding rings tip cousins didnt get much hassle afterwards odd groping touching discomfort staring though mentally prepared point isnt isnt safe place isnt unsafe place world oh ok point basically better pakistan congratulations saying pakistan sure rape occurs many countries around world places countries unsafe women india isnt country rants becoming idiotic facts facts facts dont matter todays world disagree theres blatant tone deafness post disagree thats fine hey op seems like youve got rose tinted glasses eurocentric belief everywhere except india good try looking statistics europe countries safety wish family best generally indian men love rape goes indian subcontinent rape huge part indian culture ramayan movies made modern times way people curse india quite revealing way men treat women almost always sex female relative whether sister mother culture needs change whole subcontinent change comes admitting root cause culture hindus always argue worship goddesses much better many islamic countries india completely utterly islamized sense women family experience sexual violence abuse wouldnt tell since culturally shameful india huge problem needs step hear also one female cousin shes coming canada cant thrilled funny everyone saying bad countries usually man ask female member family raised india groped eve teased andor sexual harassment probably even beaten male relatives sexual harassment experiences india place least visit life much better outside india women lived countries way way way poor india youre right pakistan living rentfree many indians heads lol didnt even mention pakistan literally reason bring convo guy managed would know cousins yes need step grassroots level education required along stricter laws implementation see hateful comments mostly men know like woman india live sweden women ever travelled india complaint goes swedes nris india sucks comes safety women guys hating reddit ashamed putting energy trying disprove something never could experienced since youre women also women know never honestly tell experiences since still shameful india victim sexual crime huh mentor internship told catcalledharassed streets london went say something like wanted treated way id india anyway comparing two countries sometimes actually feel safety illusion create sometimes actually feel safety illusion create non existent us create safety pockets time passing moments feeling safe illusion soon mans reality crash obv everywhere london sooo bad someone told counted gotten harassed times one day even worse berlin got start whipping men revolting drastically something rape cases took place germany rape cases took place india data yet released ncrb germany population million cr india population billion cr around rape per population germany figure stands per india nobody defending crime committed women incidences occur civilized society unfortunate reality even one incident occurs corner country blown proportion media houses creating mass sensationalism time cases may happening across europe usa rapes per people one highest world media houses dont even bat eye incidences thus common narrative result coverages became women india assault victims india lawless desolate land woman automatically means molested agree whole pray women india thing im embarassed cant help thats conclusion want draw comment sorry typo regarding article million number women gone missing number women gone missing never found dont fall click bait headline dont think aware fact missing reports closed within days people go missing petty reasons look problem anyone emigrating india reasons thats okay place judge however one thing dont understand come bad experience bunch people country bad experience bunch people comes us brown unwashed masses referendum entire country society doubt may bunch people made fear safety life dignity spit hope die slow painful death also sorry experience however also mentioned post good time india sure must bunch people friendly kind helpful however condemning assholes made fear safety lumped good people came life india together assholes fair somewhere comment section said youre based berlin ive berlin quite german cities utopia someone makes feel uncomfortable going entire german people look problem anyone emigrating india reasons thats okay place judge however one thing dont understand come bad experience bunch people country bad experience bunch people comes us brown unwashed masses referendum entire country society doubt may bunch people made fear safety life dignity spit hope die slow painful death also sorry experience however also mentioned post good time india sure must bunch people friendly kind helpful however condemning assholes made fear safety lumped good people came life india together assholes fair somewhere comment section said youre based berlin ive berlin quite german cities utopia someone makes feel uncomfortable going entire german people simply dont understand point posts ones arent criminals rapists arent ones scam works kidnapping circles arent power heck people want power arent either want us posting reddit especially indian reddit accomplish exactly ishonestly nobody gives damnop whole family moved europe good need announce departure live united states femaleafab friends experienced form sexual violence world really shitty place agree problem rape sexual violence india post implies europe countries free sexual violence isnt inherently indian problem patriarchal problem way go fixing dismantle patriarchy good glad people like left india god much arrogance tone deafness one post see everyday even reddit eh wouldnt assume would know ive molested thrice none cousins family know meanwhile ive spoken female friends even acquaintances issue turns easy similar experiences india disclaimer anecdata sure thats meant earlier comment mainly focused dv realm sexual assault thats far severe molestation im sure recognize means form sexual violence indian women experience day day agree writing best tone presenting super skewed subjective perspective super sorry quite embarassed happy get told guess really need work see things reflect form opinion express opinion everywhere world women unsafe live germany similarly every afab person know experienced form sexual violence comparison apparent language culture media wont make difference fight weve dismantled patriarchy truly ok relevance op india subreddit called rindia course people point country purpose saying countries mean relevance post basically saw million women reported missing years news article im glad entire family europe except people go missing europehttpswwwamberalerteuourmission every year assuming half women typically thats k years per capita basis thats higher india theres lot india deserves criticized including missing women people need look dirty backyards first start casting judgment us dehumanizing us think india good men anyone stop whining something",
    "light_cleaned_title": "My cousin, the last of my family has moved out of India. A sigh of relief escaped me and I want to share why.",
    "light_cleaned_selftext": "I have many beloved memories of visiting my Auntie and her family in Chennai. Running along the banks of the mighty river, catching fireflies in the gardens at night, the bustling markets, the incredible food, my families eclectic home. Yet my memories are so tainted by incidents where I feared for my life, where I felt eaten alive by the eyes of men around me. Where I was told, as a 8 year old, to not look men directly in the eyes. Where I was groped and shoved and grabbed and leered at. Today, as I realized my cousin has gotten on her flight, the last person in my family to move back to Europe, I stumbled across an article with the headline \"More than 1 million women disappeared in India between 2019-2021\" ([article](https://www.thenationalnews.com/world/asia/2023/07/31/more-than-1-million-women-went-missing-in-india-from-2019-to-2021/) ) Throughout the years, I never asked my cousins about what I worried about the most, if they are safe. I would push the thought out of my mind as soon as it came and I would not read news regarding the massive violence against women in India. The understanding of this immense danger was so clear, so imminent, I felt suffocated by the idea that my cousins could fall prey to violence and femicide. Now that my last family member has left, it feels as though a gigantic weight has lifted from me. I will never have to fear for her again. But still I pray for the millions of women in India, who fear for their lives everyday.",
    "light_cleaned_comments": "My family is still in India and I’m trying everythjng to get them out of there. Visiting after so many years and I genuinely cannot stand walking those streets anymore. The country is broken. We just save our families. Imagine being a Pakistani and getting shocked by Indian roads. A few days back you were complaining for not getting Visa to visit from UK and now once you're here you cannot stand walking the streets. Truly no winning with you lot That article was a miss lead most of the girls return home within a week. I will share when I will get the supporting article. “Most of the girls return home within a week” .. after what though? After kidnapping? Rape? Torture? This doesn’t really make it better at all! now many people will bash you for this post, but the truth is, anyone will lead a better standard of life in Europe and the US than India. Best of luck. Isn't this too much? You wanted to leave, then leave. Hope you reach the paradise your dreams, where no sin exists. Khade ho kar bolna bahot easy hai. Ghar ke safai me haath gande kaun kare. Nahi? Shameful. Anyways hope wherever you reach, you can truly call that place your home and natives accept you as the same. Isn't this too much? You wanted to leave, then leave. Hope you reach the paradise your dreams, where no sin exists. Khade ho kar bolna bahot easy hai. Ghar ke safai me haath gande kaun kare. Nahi? Shameful. Anyways hope wherever you reach, you can truly call that place your home and natives accept you as their own. Sorry if it was not clear from my writing. My Aunt moved to India for her business and took her family with her, my cousins were 2 and 3 years old at the time. They were there as foreigner/expats from France. Venting here, because I’ve never understood how violence against women could be so normalized.. this post is giving 'I'm living a better life than y'all' vibes 😭 Thank you. It was a cultural thing that I never understood and maybe now I can talk to my cousins about how they dealt with it. Go to the Muslim and Balkan populated areas in Strasbourg Yea this wasn’t intended at all but I totally see it too. I’m so sorry. I had some of my best childhood memories in India and I have great love for especially Tamil Nadu. If it wasn’t for the severe violence women face I would consider to travel to India again and even to live there. It was a combination of being super shocked by this article and happy for my family to move back home.. Please fuck off without these idiotic rants Ya no worries I live in Berlin where groping and harassing is part of my daily reality too. It’s bad everywhere on this planet, in India and the Middle East the violence and oppression of women is, devastatingly so, on a whole other level.. Nautanki and drama . Now you have come to gloat that you live in Berlin. Get out of here . in this post you're saying you're very glad that you/your family won't be harassed in the streets anymore WHILE reminding us indians that we might be. very very tone deaf and unnecessary IMO. That wasn’t the point though. Gotta admit that india has a big problem no?? You think women are ok here?? I would suggest getting out of your cosy European city and travelling a bit around the real world so that your perception isn’t so warped. You want to extrapolate a statistic and apply it to the whole country, across all economic classes? 1 million is 0.006% of the population. 1.5 billion people live here and good chunk of that is a thriving population. It’s alright to compare the standard of living and factors such as women safety. India is clearly lacking in those vectors. But to make it sound like this place is fucking Mordor where every minute women are disappearing left right and centre is just ridiculous. I guess the sensational news headline has done its job. I recommend subscribing to better quality journalism which respects nuance and isn’t a doomseller. Well, if Indians are the biggest problem, we are migrating all around the world. You aren’t safe then, I guess? What exactly are you venting about? I don't see a point here. I am really seeing the severe tone deafness of this post. I am not white but that doesn’t mean I’m absolved of the insensitivity that comes with mostly growing up in the privileged confines of “safe” Europe. I am super sorry. Do you think I should delete this whole post or the whole text and leave up the article..? I obv carry a lot of anger in me when it come to violence against women and other ppl made vulnerable by shit minds. But in the case of India I guess I thought it was something I was also affected by since I spent big chunks of my summer childhoods with my family, realizing now that maybe it’s not at all for me to chime in when was the last time you visited India? You know this is an extremely over exaggeration right? 2018 I guess you have got some wrong idea. I wouldn't say that India is a completely safe place for women but this post somehow sounds misleading. Idk if you really meant it, anyhow this seems a bit unnecessary, the whole 'venting'. Stupid ass comment, sin exists everywhere but India has a major problem with rape culture and it’s treatment of women. OP and her family left India for a new place for increased safety, no shame in that. You can’t expect a demographic privy to crime to be the ones that change the country Ignore them, india has a problem w rape culture as i mentioned in one of my other comments. Wanting to leave india in search of a safer place isn’t something to be shamed for. You’re good dw about it 👍 Ma'am violence against women can never be accepted as normal. Women's rights in India have come a long way, still many issues exist including thr constant ogling you mention. No one can deny the lived reality of women all over the world including India. This starring issue is within every class of society-from the bottom to the top and I am a witness to this. My head hangs in shame when I see incidents like Japanese tourist assaulted during Holi or child kidnapped and raped. One thing I thank God for is that I have bad enough eyesight that I didn't get into this activity. I remember fighting a friend when he asked me to come checkout a girl with big breasts, she heard us and I can only imagine what must be going on in her. What's her mistake, being objectfied for what? Just existing. So I can definitely not feel the pain and anger but I do understand. I am preparing to join the civil services. Even my own brother says we should leave India and settle in North America. I only try to explain that I trying to fight the issues of India, so how can I leave. Wherever I go I will only be a migrant, this is my home. Many many issues plague this country but it is also my responsibility to improve the situation so that it's better for the next generations of Indians. I hope this explains my point of view. I am sorry If I offended you. I hope that a day comes when you and other women could feel happy and safe here, at home. Bunch of insecure dumbasses in this post, OP’s sharing her reasons for leaving India, like it or not, it’s not safe for women compared to western countries. If you think OP is somehow rubbing it in your face then you might be brain dead. Anytime anybody even slightly privileged comes and posts, all you dumbasses get riled up and start shitting on them even if they have valid issues I totally understand you, thank you for sharing your perspective. Respect to you, for standing up for women and putting in efforts to making this world a place where we can all feel safe! If only we were all as aware of our responsibilities and moral obligations to eachother 💜 Listen all I can say is sorry you to experience that in your childhood , you have deep underlying trauma and i hope you get the help you need to move on with your life . Now coming to your vent , you equated something that happened to you in your childhood and applied it to everyone , that doesn't work everywhere I am afraid. Is India a perfect place ? Nope it has a lot of issues . Is India a rapist hellhole like you have described , also nope . You have linked 1 million women have dissaperead in 3 years , our hearts bleed that so many of our sisters have dissaperead. So that's 333 thousand out of 600 million per year . You can do the maths yourself and compare it with world averages , we are not in the front or the back . I'm not making any excuses it's very bad to be even in the middle . I just pulled the first result from Google , there are many such statistics that always consistently show India is nowhere near the hellhole you all portray it to be . If you are referring to the Manipur incident yes we are deeply ashamed , however in your rants you make it seem like it is a daily occurance . It is not . It is happening in a region which is almost in a state of war and the very structure of society is in a complete state of chaos .the animals caught doing this will be caught and never see the light of the day , but the point I'm trying to make is these are circumstances that are not as common as you are making it out to be . It’s not Indians. It’s rape culture, this is especially bad in India. But it is also bad everywhere in the world. it's not. india isn't safe. we know that already. that's why reminding us of that while feeling happy for having to not deal with it is so fucking annoying. Boo hoo you’ll come across posts or ppl like this irl too, can’t be annoyed all the time bout it. Op isn’t even trying to be annoying so idk why she’s getting so much hate Thank you so much for your effort to clarify some numbers with me, it’s truly appreciated. I have been to a lot of places in the world though, I lived in 6 countries, and I can safely say that I felt the least safe in Saudi Arabia and in India.. in India more so as I got to travel freely and really experience it and know quite a few people there. Most families I know have had bad incidences happen to female family members.. Have the women in your life experiences of assault, rape and violence? How many of them? All of this is bad here too, but significantly less so and also less normalized in language, public life, media, etc boo hoo I can be annoyed at whatever I want 😭 Fair enough lmaooo Imagine an American leaving America cause there's gun violence there🤡🤡 have a problem? Change it from within. Anyone can catch flights. Just saying, a little bit of your privilege is showing. Ffff honestly I hate these kinds of ppl flaunting privilege and being patronizing and I’m feeling shame that I actually have the capacity to be that person.. but I also like some of the discussion happening on here and will probably waste some time feeling conflicted on Reddit 🥴💀 >Have the women in your life experiences of assault, rape and violence? How many of them? Since you asked , none . My mom's side has 6 women . My dad's side has 15. I'd say at Max one woman has encountered domestic violence due to a shit marriage but all the women were supportive towards her and reprimanded the male . They eventually divorced and I know that now she is living happily . Do they feel safe ? Sure during the day yes , during the night not so much but even i as a male don't feel safe during the night , due to cops catching people at random and then fleecing money if you don't have id or a good reason for being out at late night . >Most families I know have had bad incidences happen to female family members. I mean this very subjective . It depends on so many things the area , the class ( rich , middle , poor ) . I lived in Chennai in an area called saligram and it was a low middle class area and there were barely any women indecency issues or even domestic violence . I don't doubt your observations but you are taking your very small sample sizes and extrapolating it to 600 million plus women . >All of this is bad here too, but significantly less so and also less normalized in language, public life, media, etc No one is disputing that , compared to Germany it is definitely more . But Germany is far far more advanced and developed from education system to religion to law and order . From the grassroots level the right education is being provided , in India just getting education is itself a challenge , naturally we won't be able to reflect the numbers shown by advanced countries . And I don't think we are normalising anything . We remember each and every incident and though rather sadly I can't say we have learnt 100% lessons from each incident ( if that was the case after nirbhaya nothing would have happened) , we are definitely making slow and sure progress . Maybe not to the level you will be happy with but we are definitely trying our hardest to change . - Says she’s relieved that her entire family is out of India, because it’s unsafe for women. - lives in Berlin MFW It is not just Indians but also law and order, enforcement of said law, corruption of said enforcers, sluggishness of judiciary, political support for abusers and harassers etc Most of these are solved if you move to a developed country She’ll never let the facts come in the way of her narrative. Typical male response, easy to downplay the struggle faced be every single woman in the country just to exist, because you will never have to face something like that yourself again, thanks a lot for your perspective and allowing me to understand my biased, subjective and small sample size experience. People are calling out on the tone deafness of the article, quite rightly. This post reeks. It’s not. Saying this as a guy I wouldn’t say i can dismiss your feelings about the country - who am I to do that. But I also doesn’t understand the point of the post. Doesn’t your newly adopted country have a subreddit for you to rant in? I think checking out of india subreddit could lift some weight off your shoulders too Why? There is no tone deafness, if anything the opposite. She’s literally been effected by India’s rape problem and is sharing that experience to communicate why she decided to leave. Realizing the gross exaggeration and subjective perspective I have due to a really biased view and too little knowledge on lived reality in India. All I can speak for are my experiences and feelings I get when I read the \"news\" (in parenthesis as media on such issues is never really neutral and really sensationalized, like the article I posted) . The last time I was in India was in 2018. Me and friends (M+F) travelled from Chennai to Ooty to Goa, with lots of stops in between. With our male friend we felt mostly safe, then toward Goa in a hotel in a small town, our female friend got assaulted. We then put on wedding rings, a tip from my cousins, and didnt get too much hassle afterwards (just the odd groping and touching here and there and discomfort by staring though, which we were mentally prepared for) The point isn't that this isn't a safe place, it's that this isn't the only unsafe place in the world. Oh ok, so the 'point' was basically \"we are better than pakistan\" Congratulations 🎉 I am not saying Pakistan. I am sure rape occurs in many countries around the world and there are places in these countries where it's unsafe for women. India isn't the only such country. These rants are becoming more and more idiotic Facts?! What facts? Facts don’t matter in today’s world. I disagree. There’s a blatant tone deafness in that post. You can disagree with me. That’s fine. Hey OP Seems like you’ve got rose tinted glasses and a very Eurocentric belief that everywhere except India is good. You should try looking at statistics of Europe and other countries for safety. Wish you and your family the best. Generally, Indian men love rape and this goes for all of the Indian subcontinent. Rape has been a huge part of Indian culture. From Ramayan to movies made in modern times. The way people curse in India is quite revealing about the way men treat women as it's almost always about having sex with a female relative, whether it be sister or mother. The culture needs to change in the whole subcontinent and change comes after admitting that the root cause is the culture. Hindus always argue that they worship Goddesses and what not but they are not much better than many Islamic countries. India is completely and utterly Islamized in that sense. If women in your family did experience any sexual violence or abuse, they wouldn't tell you since culturally it's very shameful. India has a huge problem and needs to step up. I hear you! I also have one female cousin and she’s coming to Canada and can’t be more thrilled! It’s funny everyone here saying “it’s not as bad as some countries” here (usually a man) - if they ask any female member of their family raised in India, they have all been groped, eve teased, and/or other sexual harassment. Probably even beaten up by male relatives. My only sexual harassment experiences have been in India and it’s the place I least visit. Life is much better outside India for women and I have lived in countries way way way more poor than India. You're right. Pakistan living rent-free in so many Indian's heads lol. You didn't even mention Pakistan. There is literally no reason to bring it into the convo but the other guy managed to do just that. No i would know, not from them but from my cousins . And yes we do need to step up , grassroots level education is required along with stricter laws and it's implementation. I see hateful comments by mostly men as if they know what it like to be a woman in India. I live in Sweden and most women who have ever travelled to India have the same complaint. This goes for Swedes and NRIs both. India sucks when it comes to safety for women. You guys hating on Reddit should be ashamed for putting energy in trying to disprove something you never could have experienced since you're not women. Also, most of the women you know will never honestly tell you about their experiences since it's still very shameful in India to be a victim of sexual crime. Huh. Once, my mentor from an internship told me how she was catcalled/harassed in the streets of London. And then went on to say something like, “if I wanted to be treated this way I’d be in India anyway”. Not comparing two countries, but sometimes I actually feel that safety is an illusion we create for ourselves :( It's 0.06% \" but sometimes I actually feel that safety is an illusion we create for ourselves :( \" 100% this. As it is non existent for us, we create safety as pockets in time, passing moments of feeling safe. That illusion is over as soon as a man's reality will crash into ours. And obv they are everywhere. London is sooo bad too, someone just told me they had counted to have gotten harassed 16 times in one day. Even worse in Berlin. We have got to start whipping men and revolting drastically or something. In 2022 11896 rape cases took place in Germany while 31677 rape cases took place in India (this is 2021 data , 2022 is yet to be released by NCRB). Now Germany has a population of 83 million (8.3 cr) while india has a population of 1.42 billion(142 cr). So around 14.28 rape per 100000 of the population in Germany. While the same figure stands at about 2.2 per 100000 for india. While nobody is defending the crime committed against women and that such incidences should not occur in a civilized society, but an unfortunate reality is that even if one incident occurs in some corner of this country it is blown out of proportion by all the media houses creating mass sensationalism. While at the same time 100s of such cases may be happening across Europe and USA [ which has 43.5 rapes PER 100000 people , ONE Of the HIGHEST in the world] , most of the media houses don't even bat an eye to such incidences. Thus the common narrative as a result of these coverages became that all the women in india are assault victims and that india is some lawless desolate land where being a woman automatically means you will be molested. i agree. i did the whole \"i pray for the women in india\" thing and im embarassed. I can’t help it if that’s the conclusion you want to draw from my comment. Sorry. Typo. Regarding that article, 1 million is the number of women gone missing, not the number of women gone missing _and_ never found. Don't fall for that click bait headline. I don't think you are aware of the fact that most missing reports are closed within days because most people go missing because of petty reasons. Look, I have no problem with anyone emigrating out of India. We all have our reasons and that’s okay. Not my place to judge. However, one thing I don’t understand— how come a bad experience with a bunch people in any other country is a bad experience with that bunch of people, but when it comes to us brown unwashed masses, it’s a referendum on the entire country and society? I have no doubt that there may be a bunch of people who made you fear for your safety, life, and dignity. I spit on them, and hope that they die a slow and painful death. I am also sorry that you had to experience that, however, you also mentioned in your post that you had a good time in India too, I am sure there must a bunch of people who were friendly, kind, and helpful to you and yours. However, while condemning the assholes who made you fear for your safety, you lumped the good people who came in your life India together with the assholes. Is that fair to them? Somewhere in the comment section, you said you’re based in Berlin, I’ve been to Berlin and quite a few German cities, and it’s no utopia. So, if someone makes you feel uncomfortable over there, is it going to be entire German or just those people? Look, I have no problem with anyone emigrating out of India. We all have our reasons and that’s okay. Not my place to judge. However, one thing I don’t understand— how come a bad experience with a bunch people in any other country is a bad experience with that bunch of people, but when it comes to us brown unwashed masses, it’s a referendum on the entire country and society? I have no doubt that there may be a bunch of people who made you fear for your safety, life, and dignity. I spit on them, and hope that they die a slow and painful death. I am also sorry that you had to experience that, however, you also mentioned in your post that you had a good time in India too, I am sure there must a bunch of people who were friendly, kind, and helpful to you and yours. However, while condemning the assholes who made you fear for your safety, you lumped the good people who came in your life India together with the assholes. Is that fair to them? Somewhere in the comment section, you said you’re based in Berlin, I’ve been to Berlin and quite a few German cities, and it’s no utopia. So, if someone makes you feel uncomfortable over there, is it going to be entire German or just those people? I simply don't understand the point of these posts. The ones here arent the criminals. They are t the rapists. They aren't the ones who scam. Who works in kidnapping circles. We arent in power. Heck the people we WANT to be in power aren't there either. What do you want us to do? What will posting on reddit, especially Indian reddit accomplish? This is exactly what it is…honestly nobody gives a damn..op your whole family moved to europe? good for you but no need to announce their departure. I live in the United States. All my female/AFAB friends have experienced some form of sexual violence. The world is a really shitty place. I agree that there is a problem with rape and sexual violence in India and we should do what we can but your post implies that Europe and other countries are free from this. Sexual violence isn't inherently an Indian problem, its a patriarchal problem and the way to go about fixing it is to dismantle patriarchy. Good! Glad people like you left India. God! So much arrogance and tone deafness in one post is not what you see everyday even on Reddit. Eh. I wouldn’t assume that you would know. I’ve been molested thrice. None of my cousins or family know. Meanwhile when I’ve spoken with female friends or even acquaintances about this issue, turns out an easy 80+% have had similar experiences in India. (Disclaimer: anecdata) Not sure if that’s how you meant it, but an earlier comment of yours mainly focused on DV in the realm of sexual assault. And while that’s far more severe than molestation, I’m sure you recognize that it’s by no means the only form of sexual violence Indian women experience day to day. I 100% agree that my writing is not in the best tone and presenting a super skewed and subjective perspective. I am super sorry about that and quite embarassed but happy to get told I guess. I really need to work on how I see things and how I reflect on how I form an opinion and express that opinion.. Everywhere in this world are women unsafe, I live in Germany where similarly to you, every AFAB person I know has experienced some form of sexual violence. Comparison to how apparent this is in language, culture and media won't make a difference and we will have to fight until we've dismantled the patriarchy, truly Ok? And what is the relevance of that? OP is from India, this is the subreddit called r/India, so of course people will point out about this country. What is the purpose of saying \"but other countries too!\"? What do you mean what relevance does it have? The post was basically, \"I saw the 1 million women reported missing over 3 years news article. I'm so glad my entire family is now in Europe!\" Except [600,000 people go missing in Europe](https://www.amberalert.eu/our-mission) every year. Assuming only half of those are women (typically it's more), that's 900k over 3 years. On a per capita basis that's higher than India. There's a lot India deserves to be criticized for including the missing women, but these people need to look at how dirty their own backyards are first before they start casting judgment on us and dehumanizing us. You think India is good for men or anyone ? Stop whining and do something about it ."
}